[
 [
  [
   427151, 
   null, 
   "MrWriteLA", 
   "I now support full marriage equality - Louis J. Marinelli\nHaving spent the last five years putting all of my political will, interest and energy into fighting against the spread of same-sex marriage as if it were a contagious disease, I must admit that it is hard for me to put the following text into words let alone utter them with my own voice.\n \n Whether it is an issue of disbelief, shame or embarrassment, the one thing that is for sure is that I have come to this point after several months of an internal conflict with myself. That conflict gradually tore away at me until recently when I was able to for the first time simply admit to myself that I do in fact support civil marriage equality.\n \n While I have come to terms with this reality internally, speaking about it, even with the closest members of my family, has proven to be something difficult for me to do.\n \n In short, if there is an issue of disbelief surrounding my newfound support for civil marriage equality, it is disbelief from those who surround me. If there is an issue of shame, it is a result of acknowledging the number of people I have targeted, hurt and oppressed. And if there is an issue of embarrassment, its roots lie in the face-to-face encounters I have had and expect to have with those with whom I once toiled over this very contentious issue.\n \n I understand that those whom I approach now are well within their right to disbelieve and question me and my motives. I accept that is the result of what I have done over the past few years and would therefore like to take this time to, as openly as I can, discuss the events that brought about my change of heart.\n \n As you may already know, I was the one behind the 2010 Summer for Marriage Tour which the National Organization for Marriage sponsored and operated throughout July and August last year. It was my doing when, in March that year, I approached Brian Brown, then Executive Director of the National Organization for Marriage about sponsoring and participating in a series of traditional marriage rallies scattered around the Nation.\n \n In fact, the tour route itself, while chosen largely by NOM itself, incorporated as many of the sites I had originally chosen and helped independently organize. Other locations were added due to strategic, political or simply logistical purposes.\n \n Ironically, one of the last tour stops added to the itinerary was Atlanta and I bring this site up because it was in Atlanta that I can remember that I questioned what I was doing for the first time. The NOM showing in the heart of the Bible-belt was dismal and the hundreds of counter-protesters who showed up were nothing short of inspiring.\n \n Even though I had been confronted by the counter-protesters throughout the marriage tour, the lesbian and gay people whom I made a profession out of opposing became real people for me almost instantly. For the first time I had empathy for them and remember asking myself what I was doing.\n \n If my transition from opponent to supporter of same-sex civil marriage was a timeline, Atlanta would be indicated by the first point on the line. The next point on that timeline would be two months later.\n \n After the marriage tour wrapped up and everyone went their separate ways, I transformed my marriage tour \"Inside Look\" blog to a more general blog about protecting marriage and opposing the homosexual agenda.\n \n Over the course of September and October I occupied my time writing up articles along these very lines. Some of the articles were fair, even if you disagree with them, but many of them I would now categorize as propaganda filled with strong and unnecessary rhetoric. This is especially true of the YouTube videos I made.\n \n One article I wrote, towards the end of October, 2010 caught the attention of a blogger by the name of RJ, who writes on the blog AmIWorking. He responded to my article about the homosexual agenda with an article addressed personally to me regarding marriage equality. In short, his article had the miraculous effect of instantly putting things into perspective for me.\n \n At that point, between what I had witnessed on the marriage tour and RJ's post about marriage equality, I really came to understand that gays and lesbians were just real people who wanted to live real lives and be treated equally as opposed to, for example, wanting to destroy American culture. No, they didn't want to destroy American culture, they wanted to openly particulate in it. I was well on my way to becoming a supporter of civil marriage equality. You can read my statement retracting the statements I made about gays and lesbians here.\n \n As a result of that I closed down my blog within a couple of days. That gave birth to my current endeavor, The Conservative Dispatch, which is how I occupy my time. The site is about promoting general conservative principles and is not focused solely on social issues.\n \n In December I came out in support of the repeal of Don't Ask, Don't Tell. I also removed the admins I had delegated my moderating duties to for my Facebook page.\n \n Having done that, I had to pick up where they left off. I was largely taken aback by the fact that the page I created had become such a hateful place. My comments and rhetoric paled in comparison to what that place had turned into. I began to understand why the gay community was out there claiming opposition to same-sex civil marriage was all about hate.\n \n I soon realized that there I was surrounded by hateful people; propping up a cause I created five years ago, a cause which I had begun to question. This would be timeline point number three. I wanted to extend an olive branch in some way and started to reinstate those who had been banned by previous administrators of my page. I welcomed them to participate on the page and did what I could do erase the worst comments and even ban those who posted them.\n \n Also, I started regularly conversing with same-sex marriage supporters in another Facebook group. This further solidified my new perception of gays and lesbians as real people, not some faceless political opponent. That could be considered the next point on the timeline.\n \n Lastly, I came to understand the difference between civil marriage and holy marriage as in the sacrament of the Catholic Church. Let me rephrase. I understood that but either willingly chose not to accept it or just didn't see it. Regardless, I see it now and the significance of that is as follows:\n \n Once you understand the great difference between civil marriage and holy marriage, there is not one valid reason to forbid the former from same-sex couples, and all that is left to protect is the latter.\n \n Indeed Christians and Catholics alike are well within their right to demand that holy matrimony, a sacrament and service performed by the Church and recognized by the Church, remains between a man and a woman as their faith would dictate. However, that has nothing to do with civil marriage, performed and recognized by the State in accordance with state law.\n \n My name is Louis J. Marinelli, a conservative-Republican and I now support full civil marriage equality. The constitution calls for nothing less.\n", 
   {
    "post_info": {
     "post_title": "&quot;I now support full marriage equality&quot;"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1302410820.0
  ], 
  [
   427158, 
   null, 
   "gansao", 
   "How long beore gays say it is their RIGHT to marry in church and that to prohibit this is homophobia?\n They will say that the church would not bar black people so why ban gays.\n They will say that any kind of discrimination towards gays in any way is wrong.\n \n Matthew S on this forum says so.......\n \n A preacher in the UK was arrested for telling a passing shopper that homosexuality was wrong..do you honestly think that gays will accepted being forbidden to marry in church.\n The man is a naive fool", 
   {}, 
   427151, 
   null, 
   1302439260.0
  ], 
  [
   427159, 
   null, 
   "Accipiter", 
   "Has anyone ever sued a church for discrimination?\n \n Just curious.", 
   {}, 
   427158, 
   null, 
   1302441060.0
  ], 
  [
   427161, 
   null, 
   "gansao", 
   "Has anyone ever sued a church for discrimination?\n \n Just curious.\n\n \n Has a church refused to marry black people lately?\n Just curious", 
   {}, 
   427159, 
   null, 
   1302441960.0
  ], 
  [
   427163, 
   null, 
   "Easyrider", 
   "I now support full marriage equality - Louis J. Marinelli\n\n \n If the man was a conservative Republican he's not any longer. He also needs to break his Bible open again to all the passages that condemn illicit gay sex.\n \n Gay civil unions are institutions of carnal sin and should not be legitimized. And those who promote the sin and those institutions need to repent of their spiritually-challenged folly.", 
   {}, 
   427151, 
   null, 
   1302444840.0
  ], 
  [
   427164, 
   null, 
   "Accipiter", 
   "Sleazy is a robot, he always says the same thing over and over again.", 
   {}, 
   427163, 
   null, 
   1302447540.0
  ], 
  [
   427168, 
   null, 
   "jitobear", 
   "Gay civil unions are institutions of carnal sin and should not be legitimized. And those who promote the sin and those institutions need to repent of their spiritually-challenged folly.\n\n \n Fine, but per the first ammendment, this is not the job of the US government or US law.", 
   {}, 
   427163, 
   null, 
   1302454020.0
  ], 
  [
   427499, 
   null, 
   "foundit66", 
   "At that point, between what I had witnessed on the marriage tour and RJ's post about marriage equality, I really came to understand that gays and lesbians were just real people who wanted to live real lives and be treated equally as opposed to, for example, wanting to destroy American culture. No, they didn't want to destroy American culture, they wanted to openly particulate in it. I was well on my way to becoming a supporter of civil marriage equality.\n\n I've said it before and I'll say it again...\n Real gay men and women coming out is the biggest weapon against the anti-gay propaganda...\n \n There are plenty of examples on this forum of anti-gay Christians who diminish gays and essentially fail to recognize gay men and women as people like any other people.\n It's sad to recognize that some people continue to use religion as a weapon to put people into \"us vs them\" camps for no logical reason.\n \n As soon as the propaganda is stripped away and people like the author recognize that the absurd insinuations and allegations regarding gays are hyped-up prejudice, then the truth is realized and the bigotry stripped away.", 
   {
    "unicode_changes_made": true
   }, 
   427168, 
   null, 
   1302925560.0
  ], 
  [
   427506, 
   null, 
   "JPSartre12", 
   "The OP smells like BS to me.\n I wish I had a nickel for every planted article I've read. emoticon_rolleyes", 
   {}, 
   427499, 
   null, 
   1302931020.0
  ], 
  [
   427510, 
   null, 
   "Accipiter", 
   "I wish I had a nickel for every planted article I've read.\n\n \n Can you tell me what you mean by a planted article?", 
   {}, 
   427506, 
   null, 
   1302933900.0
  ], 
  [
   427518, 
   null, 
   "gansao", 
   "Since when has a marriage between two men been American culture?\n Since when has a child having two fathers and no mother been American culture?\n Homosexuals do not want to participate in American culture , they want to change it.\n Mormons wanted to change American culture by embracing polygamy but could not...why make gays an exception?", 
   {}, 
   427510, 
   null, 
   1302965280.0
  ], 
  [
   427531, 
   null, 
   "MrWriteLA", 
   "YouTube - MSNBC covers Courage Campaign and Louis Marinelli's conversion", 
   {}, 
   427151, 
   null, 
   1302977160.0
  ], 
  [
   427532, 
   null, 
   "MrWriteLA", 
   "Can you tell me what you mean by a planted article?\n\"Planted\" means things like anti-gay news items posted by so-called \"network administrators\" in the employ of Southern Baptist universities.", 
   {}, 
   427510, 
   null, 
   1302977700.0
  ], 
  [
   427533, 
   null, 
   "foundit66", 
   "Since when has a marriage between two men been American culture?\n Since when has a child having two fathers and no mother been American culture?\n\n These comments are pointlessly subjective and thoroughly irrelevant.\n \n What you consider as \"American culture\" is your own opinion...\n But more importantly, the constitution does not guarantee a right to some people's stagnant ideals of \"American culture\".\n It guarantees rights.\n It guarantees equality.\n And that's what this is about.\n \n \n \nHomosexuals do not want to participate in American culture , they want to change it.\n\n emoticon_rolleyes\n And this is part of the alienation I was talking about earlier.\n A pretense that MY marriage in MY life is somehow some of your business.\n It ain't.\n \n YOUR \"American culture\" can continue to be how you want to observe your life.\n You have NO right to demand my rights and life be restricted just cause I might impact your ideals on \"American culture\"... emoticon_rolleyes\n \n \n \nMormons wanted to change American culture by embracing polygamy but could not...why make gays an exception?\n\n Gay marriage doesn't harm anybody.\n There is no \"legitimate state interest\" (mandated by the 14th amendment) to prohibit recognition of our marital rights.\n \n Polygamy on the other hand has bona fide victims.\n Lost boys (Mormon fundamentalism) - Wikipedia, the free encyclopedia", 
   {}, 
   427518, 
   null, 
   1302977820.0
  ], 
  [
   427534, 
   null, 
   "foundit66", 
   "The OP smells like BS to me.\n I wish I had a nickel for every planted article I've read. emoticon_rolleyes\n\n I suspect the riches you accumulate from those \"nickels\" are vastly overvalue and the truth worth would be easily found by doing some rudimentary research to verify your pretense of \"planted article\"...\n \n But in this case, I suspect like many anti-gay responses, it's more about just tossing out a denial of the obvious even if there is no logical basis for that refusal to recognize the truth...\n \n Here's a thought...\n He's a real person.\n Google him: Louis J. Marinelli\n \n Why can't you face it?\n The polls in this country CONSISTENTLY show a steady decline in anti-gay marriage stance and a steady growth in gay marriage support.\n Pollster.com - Political Surveys and Election Polls, Trends, Charts and Analysis\n That doesn't happen without some SERIOUS change of hearts occurring.\n \n \n \nhttp://www.youtube.com/watch?v=4PPH3V_AHSo\n\n emoticon_xagree", 
   {}, 
   427506, 
   null, 
   1302978480.0
  ], 
  [
   427535, 
   null, 
   "gansao", 
   "These comments are pointlessly subjective and thoroughly irrelevant.\n \n What you consider as \"American culture\" is your own opinion...\n But more importantly, the constitution does not guarantee a right to some people's stagnant ideals of \"American culture\".\n It guarantees rights.\n It guarantees equality.\n And that's what this is about.\n \n \n \n emoticon_rolleyes\n And this is part of the alienation I was talking about earlier.\n A pretense that MY marriage in MY life is somehow some of your business.\n It ain't.\n \n YOUR \"American culture\" can continue to be how you want to observe your life.\n You have NO right to demand my rights and life be restricted just cause I might impact your ideals on \"American culture\"... emoticon_rolleyes\n \n \n \n Gay marriage doesn't harm anybody.\n There is no \"legitimate state interest\" (mandated by the 14th amendment) to prohibit recognition of our marital rights.\n \n Polygamy on the other hand has bona fide victims.\n Lost boys (Mormon fundamentalism) - Wikipedia, the free encyclopedia\n\n \n Then so are your cut and pasted points about gays wanting to participate in American culture rather than destroy it are pointless and irrelevant\n You cant have it both ways.\n Rights and equality are not culture.\n \n So you have no right to demand the rights of polygamists and incest be restricted..once again you cant have it both ways.\n \n It wasnt the polygamy that caused the victims of the Mormons it was many other factors from the fundamentalists.\n I am sure there are many polygamous families that are quite happy.\n I also do not propose that only Mormons should be allowed to have polygamous relationships nor should they be only multi wife marriages either.\n People should be allowed to do what they want within any sexual relationship if we are to change marriage( which gay marriages will do ) not just add on a deviant facimile to hetero marriage and disregard other sexual lifestyles that are equally deserving .\n If you look for victims in any lifestyle you will find them and God knows homosexuals are good at finding victims", 
   {}, 
   427533, 
   null, 
   1302979020.0
  ], 
  [
   427537, 
   null, 
   "MrWriteLA", 
   "\n He's a real person.\n Google him: Louis J. Marinelli\n \nBesides which, the link I provided in the OP goes to the man's website. The suspicion of BS is what's really BS here.", 
   {}, 
   427534, 
   null, 
   1302980040.0
  ], 
  [
   427543, 
   null, 
   "foundit66", 
   "Then so are your cut and pasted points about gays wanting to participate in American culture rather than destroy it are pointless and irrelevant\n You cant have it both ways.\n Rights and equality are not culture.\n\n I'm going to go out on a limb and point out the obvious.\n I AM NOT CLAIMING that polygamy should be denied based on \"American culture\".\n \n I am stating that polygamy has a LEGITIMATE STATE INTEREST prohibiting it (\"lost boys\" victims), while gay marriage does not have such a legitimate state interest.\n \n Please make a point of understanding that before attempting to reply to me...\n \n \n \nIf you look for victims in any lifestyle you will find them and God knows homosexuals are good at finding victims\n\n Please elaborate on this claim...", 
   {}, 
   427535, 
   null, 
   1302981900.0
  ], 
  [
   427547, 
   null, 
   "gansao", 
   "I'm going to go out on a limb and point out the obvious.\n I AM NOT CLAIMING that polygamy should be denied based on \"American culture\".\n \n I am stating that polygamy has a LEGITIMATE STATE INTEREST prohibiting it (\"lost boys\" victims), while gay marriage does not have such a legitimate state interest.\n \n Please make a point of understanding that before attempting to reply to me...\n \n \n \n Please elaborate on this claim...\n\n \n You are making a scurrilous claim.\n There is no legitimate state interest in prohibiting polygamy on the basis of the Mormon faith.\n As for homosexuals being good at finding victims..look at some of the gay victim posts on this site/gay websites and last but not least the thread I posted about homosexuals being asked to leave a pub because they were kissing and crying homophobia", 
   {}, 
   427543, 
   null, 
   1302983040.0
  ], 
  [
   427552, 
   null, 
   "foundit66", 
   "You are making a scurrilous claim.\n\n YouTube - You keep using that word.\n \n \n \nThere is no legitimate state interest in prohibiting polygamy on the basis of the Mormon faith.\n\n I never claimed there was. emoticon_rolleyes\n \n If you eliminate the underlined portion of your sentence, THAT is my argument...\n \n \n \nAs for homosexuals being good at finding victims..look at some of the gay victim posts on this site/gay websites .and last but not least the thread I posted about homosexuals being asked to leave a pub because they were kissing and crying homophobia\n\n Yeah. I didn't really expect an answer of substance... emoticon_rolleyes\n \n To spell out the obvious to everybody else, just because some people get \"offended\" at seeing blacks or gays or women not wearing burkas?\n Those are not real \"victims\"...", 
   {}, 
   427547, 
   null, 
   1302987720.0
  ], 
  [
   433042, 
   null, 
   "hwyangel", 
   "I disagree with both sides. Government recognized marriage has very little resemblance to a Godly union. Especially common law. (Ya'll might want to be careful about same sex room mates. (lol). Though I also disagree that government recognized marriages have anything to do with gender, recreation, religion, status, recognition, or tax breaks. In fact, marriage is not a right at all. It is a responsibility and legally binding document ment to protect childrens rights to a legitimate name, paternity, custody, child support, and inheritance. Things that can not be protected through adoption or power of attorney, as with same sex couples or barren couples. How on earth can anyone think that the government cares who you love or want to spend your life with!? How is this not a religious point of view being forced on those who may believe differently?", 
   {}, 
   427552, 
   null, 
   1308945600.0
  ], 
  [
   433113, 
   null, 
   "hwyangel", 
   "Ok. I'll try this again. How is it fair, just, or \"right\" for the government to spend hundreds of thousands of more dollars of tax payers money for marriage documentation to recognize your personal feelings and views? Or perhaps I am misunderstanding something that you can explain?", 
   {}, 
   433042, 
   null, 
   1308999300.0
  ], 
  [
   433184, 
   null, 
   "pappillion001", 
   "Then so are your cut and pasted points about gays wanting to participate in American culture rather than destroy it are pointless and irrelevant\n You cant have it both ways.\n Rights and equality are not culture.\n \n So you have no right to demand the rights of polygamists and incest be restricted..once again you cant have it both ways.\n \n It wasnt the polygamy that caused the victims of the Mormons it was many other factors from the fundamentalists.\n I am sure there are many polygamous families that are quite happy.\n I also do not propose that only Mormons should be allowed to have polygamous relationships nor should they be only multi wife marriages either.\n People should be allowed to do what they want within any sexual relationship if we are to change marriage( which gay marriages will do ) not just add on a deviant facimile to hetero marriage and disregard other sexual lifestyles that are equally deserving .\n If you look for victims in any lifestyle you will find them and God knows homosexuals are good at finding victims\n\n \n There you go again trying to make it all or none. How people feel about polygamy has no relevance on same sex couples. Both exist independent of each other. By saying gay marriage is something a person believes in doesn't require that person to also support polygamy, incest or bestiality. \n \n How well does your position fare if you argue each one separably? Do you even have an argument without bringing in PIB?", 
   {}, 
   427535, 
   null, 
   1309057200.0
  ], 
  [
   433192, 
   null, 
   "hwyangel", 
   "Are you suggesting that someone who is bi or or born with both male and female sex organs should be limited to traditional two party marriages? And what is the difference between the argument of \"born homosexual\" that is deserving of special rights and born \"male and female\" that does not? \n Also, if you can, (no contention intend), can you answer previous question? Why would same sex couples require government documented marriage if not for religious or political reasons?", 
   {}, 
   433184, 
   null, 
   1309063380.0
  ], 
  [
   433200, 
   null, 
   "pappillion001", 
   "Are you suggesting that someone who is bi or or born with both male and female sex organs should be limited to traditional two party marriages? \n\n \n I am suggesting that there is no reason to have a debate about three different types of relationships as if they were the same. Gay marriage, Polygamy, incest etc all have their own unique conditions that may be acceptable or not for different reasons. \n \n \nAnd what is the difference between the argument of \"born homosexual\" that is deserving of special rights and born \"male and female\" that does not? \n\n \n You have that backwards. Currently if you are a man and woman you are special because as a couple you can do something a gay couple can not. Gays want to be able under the same conditions with the same obligations take advantage of those same benefits. The only rational argument (and I use that phrase with a very broad understanding) is the religious which at the end of the day is very weak and the never talked about political one which is the cost to the government if it recognized gay marriage at the Federal level.\n \n What special rights do you think gay people want that nobody else has?\n \n \nAlso, if you can, (no contention intend), can you answer previous question? Why would same sex couples require government documented marriage if not for religious or political reasons?\n\n \n Because marriage and everything that goes with it comes from the government. Religion is absolutely 100% unnecessary for marriage. Being married in the eyes of God may have value in Heaven (which it actually does not) but here on earth it has 0 value except emotionally. \n \n The religious argument is simply God prohibits gay marriage. Without going into the lengthy reasons of the defects in this argument I will leave it with religion has not the right to impose it's concept of permitted behavior onto anyone else. If a person chooses to follow religion then don't get into a gay relationship and then try and marry that person. Religion doesn't get to enjoy the freedom to practice as it sees fit when it includes taking away the freedoms of others \n \n Without government recognition there is no survivor rights, there are no property rights, there are no tax benefits, there is no spousal rights to name but a few and where these things can be attempted via contract some can not and others do not carry the same strength legally. Additionally, there can be a significant expenditure of time and money to end up in a weak legal position, things that an opposite sex couple do not generally have to deal with.", 
   {}, 
   433192, 
   null, 
   1309073280.0
  ], 
  [
   433201, 
   null, 
   "hwyangel", 
   "As I said: I do not hold a religious view on government recognized marriage. Common law or living together before marriage is not at all biblical. If the problem then is that a power of attorney or adoption is \"weak\", how would that justify changing a system ment to protect childrens right by weakening it, as opposed to strengthening those rights protected through power of attorney or adoption to benefit everyone? \n Also, how will common law be effected? If two persons of the same sex for example share a residence, but do not adhere to same sex preferance, will they be considered \"married\"? Or will children protected under common law no longer be protected?", 
   {}, 
   433200, 
   null, 
   1309074360.0
  ], 
  [
   433203, 
   null, 
   "hwyangel", 
   "I may be wrong, but my understanding is that homosexuals people are \"born that way\". What way? To be attracted to the same sex. So isn't safe then to say that someone who is born male and female is obviously born that way? Or someone who is bi? So based on the exact same concept wouldn't it then be unfair or discriminating to limit someone who is born male and female or bi from marrying another male and female? What is the difference?", 
   {}, 
   433201, 
   null, 
   1309075800.0
  ], 
  [
   433204, 
   null, 
   "hwyangel", 
   "survivor rights are easily established through a will, (a biological child without paternity established would be screwed).property rights can be established through a will or power of attorney ( a child without married parents would become homeless if daddy kicked him/her out along with mommy). You are right about tax benefits as married couples who both work actualy pay more taxes than someone who is single. You are also right about spousal rights as unmarried couples are not subjected to allimony.", 
   {}, 
   433203, 
   null, 
   1309076820.0
  ], 
  [
   433205, 
   null, 
   "hwyangel", 
   "Now a child through adoption already has a secure home and income established before the adoption can take place. A child birthed is cared for through child support should they be abandoned by a parent, after paternity is established.", 
   {}, 
   433204, 
   null, 
   1309078380.0
  ], 
  [
   433206, 
   null, 
   "hwyangel", 
   "Marriage also protects children through marriage regarding custody. A biological relitive is able take cusody of a child should something happens to the parents, protecting them from the foster care system.", 
   {}, 
   433205, 
   null, 
   1309078800.0
  ], 
  [
   433209, 
   null, 
   "pappillion001", 
   "As I said: I do not hold a religious view on government recognized marriage. Common law or living together before marriage is not at all biblical. If the problem then is that a power of attorney or adoption is \"weak\", how would that justify changing a system ment to protect childrens right by weakening it, as opposed to strengthening those rights protected through power of attorney or adoption to benefit everyone? \n Also, how will common law be effected? If two persons of the same sex for example share a residence, but do not adhere to same sex preferance, will they be considered \"married\"? Or will children protected under common law no longer be protected?\n\n \n The system is not intended for the sole benefit of children. There is no requirement to reproduce, the majority of benefits granted married people have nothing to do with having kids. \n \n By allowing gay couples to marry in no way weakens marriage. Laws don't get watered down by adding a group. Look at discrimination laws they retain the same force regardless of how many groups are added. \n \n A POA is a fairly useless document for many of the benefits granted to married people. Secondly would you want to carry one around to show people any time it became necessary? Why would people be granted these special privileges for doing nothing more than living together. \n \n Common law requires there be an intent to live together as a couple and acting as such. Roommates don't end up in divorce court unless one of them is psycho.\n \n What would change that would leave children unprotected? Nothing. Whatever protections are in place now would remain so.", 
   {}, 
   433201, 
   null, 
   1309092780.0
  ], 
  [
   433212, 
   null, 
   "pappillion001", 
   "I may be wrong, but my understanding is that homosexuals people are \"born that way\". What way? To be attracted to the same sex. So isn't safe then to say that someone who is born male and female is obviously born that way? Or someone who is bi? So based on the exact same concept wouldn't it then be unfair or discriminating to limit someone who is born male and female or bi from marrying another male and female? What is the difference?\n\n \n If I understand you correctly that is the argument. People marry someone for reasons other than reproduction. They marry for all the fluffy feelings stuff that make for great chick flicks. But gays don't get warm and fuzzy with the opposite sex, so in effect current law punishes them if they choose to try and experience the relationship that opposite gender couples are free to have as many times as they want (as long as it is one at a time)\n \n Gays just want the same thing nothing more nothing less.", 
   {}, 
   433203, 
   null, 
   1309093860.0
  ], 
  [
   433214, 
   null, 
   "pappillion001", 
   "survivor rights are easily established through a will, (a biological child without paternity established would be screwed).property rights can be established through a will or power of attorney ( a child without married parents would become homeless if daddy kicked him/her out along with mommy). You are right about tax benefits as married couples who both work actualy pay more taxes than someone who is single. You are also right about spousal rights as unmarried couples are not subjected to allimony.\n\n \n Family has a greater claim and courts have on many occasions disregarded a will that was challenged by a long lost or estranged family member and the surviving partner loses the person and half of their stuff. \n \n Those rights are easily established for family members which doesn't include your same sex partner. Again your making it all about kids and especially for gay couples that is not the primary concern. Even for straight couples it is a secondary concern until they actually have them and even then it sometimes remains so. As a recognized next of kin you don't need a will, the spouse or kids have rights and claims that are automatic\n \n Again a will is easily challenged potentially tying up assets for years which the surviving person may have paid for completely or in part. A POA allows someone to act on behalf of another when the person becomes incapacitated or dies I don't think the POA continues as the executor of that persons estate takes over whether it be someone named specifically or the courts.\n \n But mommy can turn around and seek immediate relief from and have recourse to attach daddy's wages and make daddy sell the house if he doesn't want her to live there. The courts and laws are already set up and ready to go, no such luck for same sex couples.", 
   {}, 
   433204, 
   null, 
   1309094760.0
  ], 
  [
   433215, 
   null, 
   "pappillion001", 
   "Now a child through adoption already has a secure home and income established before the adoption can take place. A child birthed is cared for through child support should they be abandoned by a parent, after paternity is established.\n\n \n There are no guarantees that will remain so, but I don't follow how this is relevant.", 
   {}, 
   433205, 
   null, 
   1309094880.0
  ], 
  [
   433217, 
   null, 
   "pappillion001", 
   "Marriage also protects children through marriage regarding custody. A biological relitive is able take cusody of a child should something happens to the parents, protecting them from the foster care system.\n\n \n Nothing would change, the same way custody is decided currently for adopted children would be the method used to determine for a same sex couple, but this doesn't have a lot of bearing on whether gays should be able to marry or not.", 
   {}, 
   433206, 
   null, 
   1309095000.0
  ], 
  [
   433219, 
   null, 
   "hwyangel", 
   "Through government documented marriage a childs has right to a name, the right to acquire a nationality or genealogy , it establishes grandparents rights to obtain custody for childs protection, the right to support from an absent parent, a right to a secure home or inheritance that could otherwise obtained through an adoption. Gay marriage violates all of thease rights by redefining marriage for there own political/religious views.", 
   {}, 
   433212, 
   null, 
   1309095540.0
  ], 
  [
   433220, 
   null, 
   "hwyangel", 
   "A secure home an income is already established for an adopted child before the the adoption can be obtained. Legal rights pertaining to same sex couples are easily obtained through a will or power of attorney. In fact, redefining marriage as a \"right\" adds a religious meaning to the whole concept of marriage.", 
   {}, 
   433219, 
   null, 
   1309096140.0
  ], 
  [
   433229, 
   null, 
   "Matthew S", 
   "How long beore gays say it is their RIGHT to marry in church and that to prohibit this is homophobia?\n They will say that the church would not bar black people so why ban gays.\n They will say that any kind of discrimination towards gays in any way is wrong.\n \n Matthew S on this forum says so.......\n \n A preacher in the UK was arrested for telling a passing shopper that homosexuality was wrong..do you honestly think that gays will accepted being forbidden to marry in church.\n The man is a naive fool\n\n \n I have never taken that stance. If some christianist wants to not let gay people to attend their church then I support their right to exclude. What I am opposed to is the christianists bringing their religious beliefs out and putting them in the laws that I have to live under. If they what to exclude me from public accommodations because of their religious beliefs then I feel gay people should have an equal right to exclude them from gay owned public accommodations.", 
   {}, 
   427158, 
   null, 
   1309100940.0
  ], 
  [
   433230, 
   null, 
   "Easyrider", 
   " What I am opposed to is the christianists bringing their religious beliefs out and putting them in the laws that I have to live under. \n\n \n Try and stop us. There's a heck of a lot more of us than there are of you. We vote our religious beliefs whenever possible, and there's nothing you can do to keep us from doing that.", 
   {}, 
   433229, 
   null, 
   1309101420.0
  ], 
  [
   433232, 
   null, 
   "poet", 
   "Try and stop us. There's a heck of a lot more of us than there are of you. We vote our religious beliefs whenever possible, and there's nothing you can do to keep us from doing that.\n\n \n Really? Then you underestimate us and our resolve. And that would be pseudo-religious beliefs...you pointing fingers has a thumb which points back at you. Like you are innocent. LOL.", 
   {}, 
   433230, 
   null, 
   1309101840.0
  ], 
  [
   433234, 
   null, 
   "gansao", 
   "I have never taken that stance. If some christianist wants to not let gay people to attend their church then I support their right to exclude. What I am opposed to is the christianists bringing their religious beliefs out and putting them in the laws that I have to live under. If they what to exclude me from public accommodations because of their religious beliefs then I feel gay people should have an equal right to exclude them from gay owned public accommodations.\n\n \n That is nonsense.\n You have never argued that the the solution to homophobia is to allow gays to discriminate against gays.\n To have always stated that the law should make any discrimination against gays illegal.\n If you are saying that you believe that a church should be able to throw a gay man out of its congregation if a gay church can throw a straight man out..and this should be provided by law then I do not believe you.", 
   {}, 
   433229, 
   null, 
   1309102980.0
  ], 
  [
   433238, 
   null, 
   "pappillion001", 
   "Through government documented marriage a childs has right to a name,\n \n \n Marriage is not a necessary requirement to take the surname of a parent.\n \n \nthe right to acquire a nationality or genealogy \n, \n \n Marriage is not necessary to establish nationality or ancestry\n \n \n \nit establishes grandparents rights to obtain custody for childs protection, \n\n \n Marriage is not necessary to establish grandparents rights to obtain any right they may have in regards to a child.\n \n \nthe right to support from an absent parent, \n\n \n Marriage is not necessary to establish financial responsibility of a parent\n \n \n \na right to a secure home\n \n \n Marriage is not necessary to to the establishment of a secure home\n \n \nor inheritance that could otherwise obtained through an adoption. \n\n \n Do you see a trend in my responses? \n \n \nGay marriage violates all of these rights by redefining marriage for there own political/religious views.\n\n \n Your premise are wrong and your conclusion is wrong. I am now very curious exactly what makes you think any of what you have stated is true and how allowing gays to marry would in fact achieve these things?\n \n I have no problem with you disagreeing with my opinion but along with the statement a reason would be nice. \n \n Marriage is not just to protect the rights of children, honestly it does very little in this area. By ignoring the primary reasons that marriage exists and is recognized by government you miss the point why gays want equality. \n \n Gay marriage does not violate anything you have stated\n \n Gay marriage is not about religious ideals. The effort to oppose it is about religious ideals.\n \n I don't feel my right to marry a woman is politically motivated and can't really understand what political agenda might be desired that includes the establishment of gay marriage. \n \n I think you listen to far to much talk radio because all I am hearing is the same BS that they spit out all day. There is no rational or logical way to arrive at your conclusions", 
   {}, 
   433219, 
   null, 
   1309108680.0
  ], 
  [
   433243, 
   null, 
   "Matthew S", 
   "Try and stop us. There's a heck of a lot more of us than there are of you. We vote our religious beliefs whenever possible, and there's nothing you can do to keep us from doing that.\n\n \n Then the answer is to remove that religious freedom. I prefer French revolution solution as a final solution to the infestation of the fundamentalist christianist problem", 
   {}, 
   433230, 
   null, 
   1309110720.0
  ], 
  [
   433248, 
   null, 
   "Matthew S", 
   "That is nonsense.\n You have never argued that the the solution to homophobia is to allow gays to discriminate against gays.\n To have always stated that the law should make any discrimination against gays illegal.\n If you are saying that you believe that a church should be able to throw a gay man out of its congregation if a gay church can throw a straight man out..and this should be provided by law then I do not believe you.\n\n \n We are talking apples and oranges here.\n \n I support a churches right to allow who they wish to attend services. If they want to throw out a gay person, not preform a marriage then that is their right. Think of gay as just being another religion, and you have my answer on this point.\n \n If a christian couple owns a public accommodation, such as a B&B or a restaurant etc that they operate to the general public. Then they can not use religion as an excuse to deny service to gay people, or fire employees because that person is gay. What I am saying is that if you give or allow that christian couple to deny service to gay people, or fire employees that are gay on religious grounds then I, as gay man, want an equal exemption to deny service to anti gay Christians and fire anti gay christian employees.", 
   {}, 
   433234, 
   null, 
   1309113900.0
  ], 
  [
   433253, 
   null, 
   "gansao", 
   "We are talking apples and oranges here.\n \n I support a churches right to allow who they wish to attend services. If they want to throw out a gay person, not preform a marriage then that is their right. Think of gay as just being another religion, and you have my answer on this point.\n \n If a christian couple owns a public accommodation, such as a B&B or a restaurant etc that they operate to the general public. Then they can not use religion as an excuse to deny service to gay people, or fire employees because that person is gay. What I am saying is that if you give or allow that christian couple to deny service to gay people, or fire employees that are gay on religious grounds then I, as gay man, want an equal exemption to deny service to anti gay Christians and fire anti gay christian employees.\n\n \n I will actually call you a liar over this one.\n I believe that if gays admitted this openly the churches would go onto a war footing against them because that is what they fear the most..having to actually change their doctrine because it would be ruled homophobic,\n I can imagine you telling us in a the future that no church would be able to eject a black man so why should it be allowed to eject a gay man?\n Worse, I am pretty sure that gay rights zealots like you would like to see the day when the church can be prosecuted for spreading ' homophobic, propaganda .So if you dont mind I wouldnt trust you as far as I could throw you on this one Matthewemoticon_xdonno", 
   {}, 
   433248, 
   null, 
   1309115940.0
  ], 
  [
   433255, 
   null, 
   "gansao", 
   "Then the answer is to remove that religious freedom. I prefer French revolution solution as a final solution to the infestation of the fundamentalist christianist problem\n\n \n Which completely contradicts what you stated to meemoticon_xdonno\n The 'fundamentalist Christian problem' will always be here while they have votes.", 
   {}, 
   433243, 
   null, 
   1309117380.0
  ], 
  [
   433260, 
   null, 
   "Matthew S", 
   "Which completely contradicts what you stated to meemoticon_xdonno\n The 'fundamentalist Christian problem' will always be here while they have votes.\n\n \n And they better hope they don't become a minority, because the weapons of war they are using in their war against gay people can and will be turned upon them when they become the minority. They need to watch what they are doing because some day it can and will be their freedoms going before a popular vote of the people. They want to play the democracy card and be able to vote upon other peoples rights then they will get burned with their own weapons. When the day comes I will gladly use my right to vote to outlaw the practice of Roman catholicism and mormonism and any religion or church that has bible or gospel in its name. An I will cry as loudly as they do now calling for the people to be able to vote to define religion.", 
   {}, 
   433255, 
   null, 
   1309124640.0
  ], 
  [
   433261, 
   null, 
   "gansao", 
   "And they better hope they don't become a minority, because the weapons of war they are using in their war against gay people can and will be turned upon them when they become the minority. They need to watch what they are doing because some day it can and will be their freedoms going before a popular vote of the people. They want to play the democracy card and be able to vote upon other peoples rights then they will get burned with their own weapons. When the day comes I will gladly use my right to vote to outlaw the practice of Roman catholicism and mormonism and any religion or church that has bible or gospel in its name. An I will cry as loudly as they do now calling for the people to be able to vote to define religion.\n\n \n I dont doubt this sent is shared by many other gays.However I dont think anytime soon gays and their allies will be numerous enough to achieve this.\n In the meantime, as I stated in another post, when the opportunity arises gays will press for preachers who preach that gay sex is a sin to be prosecuted and gays will be suing churches who reject them.", 
   {}, 
   433260, 
   null, 
   1309126200.0
  ], 
  [
   433264, 
   null, 
   "Easyrider", 
   "Then the answer is to remove that religious freedom. I prefer French revolution solution as a final solution to the infestation of the fundamentalist christianist problem\n\n \n Then there's going to be a lot of slow walking and sad singing in your neighborhood, preppie.", 
   {}, 
   433243, 
   null, 
   1309129200.0
  ], 
  [
   433268, 
   null, 
   "Accipiter", 
   "Then there's going to be a lot of slow walking and sad singing in your neighborhood, preppie.\n\n \n ez is the prophet who can predict nothing.", 
   {}, 
   433264, 
   null, 
   1309138740.0
  ], 
  [
   433270, 
   null, 
   "E Mutz", 
   " If they what to exclude me from public accommodations because of their religious beliefs then I feel gay people should have an equal right to exclude them from gay owned public accommodations.\n\n \n Oh dear. Imagine if the doors to the Bed Bath and Beyond suddenly closed!", 
   {}, 
   433229, 
   null, 
   1309139400.0
  ], 
  [
   433272, 
   null, 
   "Provocateaur", 
   "I dont doubt this sent is shared by many other gays.\n\n \n How do you know? How many other gays have you talked to about this, and how many have showed this sentiment? The religious right on the other hand, have actually demonstrated their desire to interfere in the civil rights of gays.\n \n \nHowever I dont think anytime soon gays and their allies will be numerous enough to achieve this.\n\n \n I guess \"soon\" could be seen as relative. Non-religious is the fastest growing category, especially among those 29 and under.\n \n Statistics on Religion in America Report -- Pew Forum on Religion & Public Life\n \n Support for gay rights is on the increase, especially among the youth.\n \n \nIn the meantime, as I stated in another post, when the opportunity arises gays will press for preachers who preach that gay sex is a sin to be prosecuted and gays will be suing churches who reject them.\n\n \n So your prejudiced suspicion of gays, as guilty until proven innocent, tells you. At least we didn't have to pay five bucks to the lady in the tent with the crystal ball, for that prognostication. That's because it's worthless.", 
   {}, 
   433261, 
   null, 
   1309140360.0
  ], 
  [
   433273, 
   null, 
   "Provocateaur", 
   "Oh dear. Imagine if the doors to the Bed Bath and Beyond suddenly closed!\n\n \n Ha! There are a lot more gay owned and straight non-homophobic or non-religious businesses than that. Thanks for the cheap and clueless stereotype though!", 
   {}, 
   433270, 
   null, 
   1309140600.0
  ], 
  [
   433274, 
   null, 
   "E Mutz", 
   "Ha! There are a lot more gay owned and straight non-homophobic or non-religious businesses than that. Thanks for the cheap and clueless stereotype though!\n\n \n And I am sure they are all owned by ravenous French Revolutionaries. Do note, the comment was quite clearly directed at the clueless Matt, himself a walking author of stereotypes. \n \n Matt calls for a french revolution solution and I am the cheap and clueless one... Rich.", 
   {}, 
   433273, 
   null, 
   1309141560.0
  ], 
  [
   433276, 
   null, 
   "Freedom", 
   "And they better hope they don't become a minority, because the weapons of war they are using in their war against gay people can and will be turned upon them when they become the minority. They need to watch what they are doing because some day it can and will be their freedoms going before a popular vote of the people. They want to play the democracy card and be able to vote upon other peoples rights then they will get burned with their own weapons. When the day comes I will gladly use my right to vote to outlaw the practice of Roman catholicism and mormonism and any religion or church that has bible or gospel in its name. An I will cry as loudly as they do now calling for the people to be able to vote to define religion.\n\n You don't have the right to outlaw rights, and if you think you do you are validating those that think they do now.\n \n Hopefully if and when enough people are anti-religious to make your threat at all meaningful we will have established a society which outlaws the the notion of modifying rights by vote.", 
   {}, 
   433274, 
   null, 
   1309146900.0
  ], 
  [
   433278, 
   null, 
   "Shooterandproud", 
   "You don't have the right to outlaw rights, and if you think you do you are validating those that think they do now.\n \n Hopefully if and when enough people are anti-religious to make your threat at all meaningful we will have established a society which outlaws the the notion of modifying rights by vote.\n\n \n THANK YOU. Civil rights can't be simply voted away. That's why they're civil rights and not privileges allotted by the majority.", 
   {}, 
   433276, 
   null, 
   1309147620.0
  ], 
  [
   433280, 
   null, 
   "Provocateaur", 
   "And I am sure they are all owned by ravenous French Revolutionaries.\n\n \n Perhaps more likely they are owned by materialists, gay or straight.\n \n \nDo note, the comment was quite clearly directed at the clueless Matt, himself a walking author of stereotypes.\n\n \n Would you stereotype African Americans as being especially great consumers of pork ribs and watermelons? Like heck your comment wasn't meant to belittle gay people and our place and power in society. \n \n \nMatt calls for a french revolution solution and I am the cheap and clueless one... Rich.\n\n \n Yes, that was a cheap and clueless stereotype I replied to. Now, if you had used this analogy to the French revolution initially, that's a better point. Matt wasn't calling for anyone's head to come off, though. He was just saying he'd vote \"no\", when it comes to less important issues such as their right to practice, maybe their right to civil recognition and equality of their marriages, and their rights to adopt and raise children. Perhaps on their right to housing, jobs, and public services. Gays and gay rights advocates have had to fight for all these things, which were not considered important(unless to rail against with fear, ignorance, hatred, and lies), by the usual religious or majority suspects, and we've had to fight every step of the way on each separate issue. Everyone has civil rights, or no one does. Going through a process of taking those away from the religious is just as much of a waste of time. So what Matt is advocating isn't right either. We have yet to see it enacted as anything more than a revenge fantasy, from one gay civil rights supporter.\n \n By the way, Matt also cited Betty Bowers who put forward this idea, and she's a heterosexual.", 
   {}, 
   433274, 
   null, 
   1309149060.0
  ], 
  [
   433282, 
   null, 
   "E Mutz", 
   "Perhaps more likely they are owned by materialists, gay or straight.\n\n \n Again missing the irony. Read on kind Sir or Madam.\n \n \nWould you stereotype African Americans as being especially great consumers of pork ribs and watermelons? Like heck your comment wasn't meant to belittle gay people and our place and power in society.\n \n \n And out comes the race card. Usually this comes out at the end of a losing argument. \n \n My post was in response to Matt's earlier stereotyping of religion and basically anyone whose opinion does not agree with his. Using the same tactic as a vehicle to note the paucity of Mattew's methods is NOT a wider statement on homosexuality but a reference to the tried and true methods which Matt invokes in lieu of actual argumentation.\n \n \nYes, that was a cheap and clueless stereotype I replied to. Now, if you had used this analogy to the French revolution initially, that's a better point. Matt wasn't calling for anyone's head to come off, though. He was just saying he'd vote \"no\", when it comes to less important issues such as their right to practice, maybe their right to civil recognition and equality of their marriages, and their rights to adopt and raise children. Perhaps on their right to housing, jobs, and public services. Gays and gay rights advocates have had to fight for all these things, which were not considered important(unless to rail against with fear, ignorance, hatred, and lies), by the usual religious or majority suspects, and we've had to fight every step of the way on each separate issue. Everyone has civil rights, or no one does. Going through a process of taking those away from the religious is just as much of a waste of time. So what Matt is advocating isn't right either. We have yet to see it enacted as anything more than a revenge fantasy, from one gay civil rights supporter.\n \n By the way, Matt also cited Betty Bowers who put forward this idea, and she's a heterosexual.\n\n \n Well, let me take that race card and throw it right back at ye: How do you suppose one would be viewed if they suggested a French Revolution solution to African Americans, homosexuals, jews et al? OUTRAGE!!!! Just look at your own indignation at your misinterpretation of my post. You cannot even muster a stifled yawn at Matt's \"revenge fantasy\". Yet Matt is granted a pass for suggesting this peculiar little solution upon those he labels as \"Fundies\", \"Christonazis\" and other such learned labels. \n \n You might not have observed these things in your 3 months here. Let me bring you up to speed with Matt.\n \n Matt and I have known each other for at least 4 years. In that time he has quite virulently spewed his anti Christian rhetoric whilst openly using names and labels as his sole means of attack. \n \n My problem is not with Matt's argument it is the method with which he chooses to ineffectively advance it. Let me make this easy for you. This post and my previous posts have not argued one way or another against homosexual marriage. Rather, they argue against Matt's own tortured logic. He argues for the same actions that he decries in his labeled stereotyped opponents. He lumps people of faith together and then wonders why people do not treat him with individual dignity. Matt is his own argument's worst enemy. I have been telling him for YEARS that he argues against his ends far more effectively than any theoretical \"Christonazi\". He is a caricature who does damage to his own argument. \n \n If you would advance the cause of full marriage equality you might do well to point out to Matt how his own brand of invective does not lend support to the ends he seeks to acheive.", 
   {}, 
   433280, 
   null, 
   1309151520.0
  ], 
  [
   433283, 
   null, 
   "hwyangel", 
   "Marriage (and only marriage) unites the three core dimensions of parenthood --biological, social and legal --into one pro-child form: the married couple. Marriage says to a child: The man and the woman whose sexual union made you will also be there to love and raise you. Marriage says to society as a whole: For every child born, there is a recognized mother and a father, accountable to the child and to each other.\n The foundational human rights document in the world today regarding children, the 1989 U.N. Convention on the Rights of the Child, specifically guarantees children this right. The last time I checked, liberals were supposed to be in favor of internationally recognized human rights, particularly concerning children, who are typically society's most voiceless and vulnerable group. Or have I now said something I shouldn't?", 
   {}, 
   433282, 
   null, 
   1309152360.0
  ], 
  [
   433284, 
   null, 
   "Xcaliber", 
   "Marriage (and only marriage) unites the three core dimensions of parenthood --biological, social and legal --into one pro-child form: the married couple. Marriage says to a child: The man and the woman whose sexual union made you will also be there to love and raise you. Marriage says to society as a whole: For every child born, there is a recognized mother and a father, accountable to the child and to each other.\n The foundational human rights document in the world today regarding children, the 1989 U.N. Convention on the Rights of the Child, specifically guarantees children this right. The last time I checked, liberals were supposed to be in favor of internationally recognized human rights, particularly concerning children, who are typically society's most voiceless and vulnerable group. Or have I now said something I shouldn't?\n\n \n \n You're correct that the U.N. Convention on the Rights of the Child does guarantee certain rights to children, but nothing in the Convention says or requires that the parents be One man and One woman. In fact it specifically added an Article to protect ALL parents from discrimination. And furthermore as of 2009 The United States had still not Signed or Ratified this Convention so as of now we are not bound to follow it. \n \n Here's the U.N. Convention on the rights of a child, I read most of it and I found nothing in it that even mentions Gay marriage. It refers to the Parents as just that.. THE PARENTS.. whether it be a Gay couple who adopt or a Monogamous couple who gave birth ALL Parents are included.\n \n Article 1\n For the purposes of the present Convention, a child means every human being below the age of eighteen years unless under the law applicable to the child, majority is attained earlier.\n \n Article 2\n 1. States Parties shall respect and ensure the rights set forth in the present Convention to each child within their jurisdiction without discrimination of any kind, irrespective of the child's or his or her parent's or legal guardian's race, colour, sex, language, religion, political or other opinion, national,ethnic or social origin, property, disability, birth or other status. \n \n http://www2.ohchr.org/english/law/pdf/crc.pdf", 
   {}, 
   433283, 
   null, 
   1309154040.0
  ], 
  [
   433285, 
   null, 
   "Provocateaur", 
   "Again missing the irony. Read on kind Sir or Madam.\n \n \n \n And out comes the race card. Usually this comes out at the end of a losing argument. \n \n My post was in response to Matt's earlier stereotyping of religion and basically anyone whose opinion does not agree with his. Using the same tactic as a vehicle to note the paucity of Mattew's methods is NOT a wider statement on homosexuality but a reference to the tried and true methods which Matt invokes in lieu of actual argumentation.\n \n \n \n Well, let me take that race card and throw it right back at ye: How do you suppose one would be viewed if they suggested a French Revolution solution to African Americans, homosexuals, jews et al? OUTRAGE!!!! Just look at your own indignation at your misinterpretation of my post. You cannot even muster a stifled yawn at Matt's \"revenge fantasy\". Yet Matt is granted a pass for suggesting this peculiar little solution upon those he labels as \"Fundies\", \"Christonazis\" and other such learned labels. \n \n You might not have observed these things in your 3 months here. Let me bring you up to speed with Matt.\n \n Matt and I have known each other for at least 4 years. In that time he has quite virulently spewed his anti Christian rhetoric whilst openly using names and labels as his sole means of attack. \n \n My problem is not with Matt's argument it is the method with which he chooses to ineffectively advance it. Let me make this easy for you. This post and my previous posts have not argued one way or another against homosexual marriage. Rather, they argue against Matt's own tortured logic. He argues for the same actions that he decries in his labeled stereotyped opponents. He lumps people of faith together and then wonders why people do not treat him with individual dignity. Matt is his own argument's worst enemy. I have been telling him for YEARS that he argues against his ends far more effectively than any theoretical \"Christonazi\". He is a caricature who does damage to his own argument. \n \n If you would advance the cause of full marriage equality you might do well to point out to Matt how his own brand of invective does not lend support to the ends he seeks to acheive.\n\n \n Those African Americans, Jews, and gay people have all dealt with actual, REAL WORLD discrimination. It's not theoretical or satirical, as in the case of alleged trials of the straight white Christian American male. So yes, suggesting further pain be inflicted on the historically disenfranchised groups, through the French Revolution revenge idea, would be quite incensing indeed. The concerns of the white heterosexual Christian American male are of less worry to me. I've had a racial minority male call me a \"cracker\" once because I'm a white male. He then quickly said he was just joking. I would never think of responding with the \"n\" word or some other such word, back, because I'm aware and educated on the history, the experience the group of people have in this society. I respect it. It's not equivalent to any disenfranchisement I may feel by being called \"cracker\". Though, ideally, and in theory, the word cracker shouldn't be used either. \n \n I don't know if Matt really believes these things, if he is playing devil's advocate, or is being satirical. Where are any of these ideas against white heterosexual Christian males, being put into force, as they have been with the other groups mentioned(gays jews blacks)? What should we be most focused on?", 
   {}, 
   433282, 
   null, 
   1309154100.0
  ], 
  [
   433286, 
   null, 
   "E Mutz", 
   "Those African Americans, Jews, and gay people have all dealt with actual, REAL WORLD discrimination. It's not theoretical or satirical, as in the case of alleged trials of the straight white Christian American male. \n\n \n Anyone may be victim of real world discrimination. All that is required is to stop considering a person as an individual and to start regarding them as a faceless member of a group. Hate is non denominational and the first step to hatred is depersonalization, regardless of what group is being marginalized. \n \n \nSo yes, suggesting further pain be inflicted on the historically disenfranchised groups, through the French Revolution revenge idea, would be quite incensing indeed. The concerns of the white heterosexual Christian American male are of less worry to me. \n\n \n And yet are of no less import if you truly seek equality. Otherwise you merely wish to supplant one injustice with another. Again, the problem I have with Matt's theories.\n \n \nI've had a racial minority male call me a \"cracker\" once because I'm a white male. I would never think of responding with the \"n\" word or some other such word, back, because I'm aware and educated on the history, the experience the group of people have in this society. I respect it. It's not equivalent to any disenfranchisement I may feel by being called \"cracker\". Though, ideally, and in theory, the word cracker shouldn't be used either. \n \n \n Indeed, and if you care to peruse my history of interactions with Matt you will find not one single pejorative. If you have to reduce to a label of any kind it indicates your argument is inherently week. Matt's insistence of labels makes him, and by extension his argument, easy to dismiss. \n \n \nI don't know if Matt really believes these things, if he is playing devil's advocate, or is being satirical. Where are any of these ideas against white heterosexual Christian males, being put into force, as they have been with the other groups mentioned(gays jews blacks)? What should we be most focused on?\n\n \n Correct. You do not know. This is why I have informed you of Matt's methods in this manner. Further, there is no need to construct some test by which to gauge the effectiveness of labels. They all represent the same thing: ignorance on the part of the arguer and an inability to reason an argument through on its own merit.", 
   {}, 
   433285, 
   null, 
   1309155060.0
  ], 
  [
   433287, 
   null, 
   "hwyangel", 
   "However, a biological child can not have thease same right established as through adoption. For example: A man decides to kick his child out along with the childs mother or leaves and leaves them no support. Without having established paternity the woman and child are now homeless. With adoption, a secure home and income must be established before the adoption can take place. Also by redefining marriage the child would not have a right to a legitimate last name or nationality. Ok, possibly biological history doesn't mean any to you, but this is not about beliefs, is it? We are talking about rights. \n There are two examples. But in the interest of fairness, I am open to understanding what same sex couples hope to gain by becoming married. I have heard it preached about \"rights\", but exactly what \"rights\" are being denied without government recognized marriage?", 
   {}, 
   433284, 
   null, 
   1309155840.0
  ], 
  [
   433288, 
   null, 
   "E Mutz", 
   "Provacateur,\n \n A couple of other items of note:\n \n You stated:\n Those African Americans, Jews, and gay people have all dealt with actual, REAL WORLD discrimination. It's not theoretical or satirical, as in the case of alleged trials of the straight white Christian American male. \n Why do you presume that Christians are white and male? Matt condemns his opponents as \"Fundies\" and Christonazis.\" Since you claim not to know the reasons behind his methods why do make this curious assumption?\n \n You also noted:\n I don't know if Matt really believes these things, if he is playing devil's advocate, or is being satirical. \n So, you don't condemn Matt's language because you claim to not understand his purpose, yet you evince no such weakness of spleen in claiming my post was tantamount to racism when you did not know my purpose. Will you now retract your earlier rather disgusting suggestion that I was making a cheap and clueless stereotype or will you make an attempt at consistency and similarly renounce Matt's cheap stereotypes?", 
   {}, 
   433286, 
   null, 
   1309156200.0
  ], 
  [
   433289, 
   null, 
   "E Mutz", 
   "However, a biological child can not have thease same right established as through adoption. For example: A man decides to kick his child out along with the childs mother or leaves and leaves them no support. Without having established paternity the woman and child are now homeless. With adoption, a secure home and income must be established before the adoption can take place. Also by redefining marriage the child would not have a right to a legitimate last name or nationality. Ok, possibly biological history doesn't mean any to you, but this is not about beliefs, is it? We are talking about rights. \n There are two examples. But in the interest of fairness, I am open to understanding what same sex couples hope to gain by becoming married. I have heard it preached about \"rights\", but exactly what \"rights\" are being denied without government recognized marriage?\n\n \n ???\n \n What nationality is denied through adoption?\n \n PLease restate as I fear I could not make hide nor hair of the above.\n \n Respectfully,", 
   {}, 
   433287, 
   null, 
   1309156440.0
  ], 
  [
   433290, 
   null, 
   "Freedom", 
   "Those African Americans, Jews, and gay people have all dealt with actual, REAL WORLD discrimination. It's not theoretical or satirical, as in the case of alleged trials of the straight white Christian American male.\n\n Such absurd sophistry, but it's not your fault; it's the simple product of dealing with abstract groups like that.\n \n Christians have historically faced much persecution. It doesn't matter because it's not happening now (well here). The same goes for homosexuals and blacks. Laws respecting race no longer exist except in the few corners in which they cower under the guise of affirmative action and charity. Laws respecting sexual orientation no longer exist.\n \n Many faces trials, none can blame their genes, culture, or interests for them now or ever.\n \n \nSo yes, suggesting further pain be inflicted on the historically disenfranchised groups, through the French Revolution revenge idea, would be quite incensing indeed.\n\n Then why didn't it concern you? Or perhaps you didn't know that the french revolution for a time had serious issues with the catholic church?\n \n \nThe concerns of the white heterosexual Christian American male are of less worry to me.\n\n What should be of worry to you is the rights (not concerns) of every human being.\n \n \nI would never think of responding with the \"n\" word or some other such word, back, because I'm aware and educated on the history, the experience the group of people have in this society.\n\n I would have accepted any other justification for not saying the 'n' word but that one.\n \n Perhaps you didn't feel like insulting someone that day.\n Perhaps you don't think in terms of race so it didn't even occur to you.\n Perhaps you were so disgusted by his/her behavior that you didn't even want to acknowledge his/her's existance.\n Perhaps you believed him/her that it was a joke.\n \n But to not say it because you think his/her genes entitled him/her to utter racisims at you!?!\n \n \nI respect it. It's not equivalent to any disenfranchisement I may feel by being called \"cracker\". \n\n It's not equivalent to anything but a racial insult, and so is cracker.\n \n \nThough, ideally, and in theory, the word cracker shouldn't be used either. \n \n :xbanghead\n \n \nI don't know if Matt really believes these things, if he is playing devil's advocate, or is being satirical. Where are any of these ideas against white heterosexual Christian males, being put into force, as they have been with the other groups mentioned(gays jews blacks)? What should we be most focused on?\nSo in principle you agree he's crazy, you just didn't react because you don't feel his beliefs are any threat?\n \n \nHowever, a biological child can not have thease same right established as through adoption. For example: A man decides to kick his child out along with the childs mother or leaves and leaves them no support.\n\n That is the purpose of marriage though, a promise to remain dedicated to each other and to share responsibilities. A man has no more duty from having sex than a woman does. If homosexuals get married they have made a promise and dragging one parent back based on biological parenthood is redundant.\n \n \nWithout having established paternity the woman and child are now homeless.\n\n So the act of actually creating the child has basically made the promise to care for the child for the parent, which is to say that marriage is automatic or required for sex (wait who thought of that? Oh yes those insane Christians). I am sure when homosexuals are confronted with a child out of wedlock your complaint will be valid :p\n \n \nAlso by redefining marriage the child would not have a right to a legitimate last name or nationality.\n\n Both nationality and last name are cultural conventions having no objective meaning.\n \n \nOk, possibly biological history doesn't mean any to you, but this is not about beliefs, is it? We are talking about rights.\n\n What right do you think you have to biological history? I'm sure there will be no conspiracy to hide lineage from anyone.\n \n \nI am open to understanding what same sex couples hope to gain by becoming married.\n\n 1. Social recognition (which the government can't really give them)\n 2. The fiscal benefits of marriage (which the government currently doesn't have a right to give them)\n 3. The ability to adopt children (which should be a function of promising(contract) to take care of the child and the child's choice)\n \n Other than that it's merely a semantic opportunity to continue the fight with anti-homosexual elements even though homosexual sex is no longer illegal or considered mentally ill.", 
   {}, 
   433287, 
   null, 
   1309157820.0
  ], 
  [
   433291, 
   null, 
   "Xcaliber", 
   " I have heard it preached about \"rights\", but exactly what \"rights\" are being denied without government recognized marriage?\n\n \n Gay Couples cannot file Joint Tax returns as a Hetero Couple can do...\n A Gay Person who has a Partner is not allowed to make decision if their partner suddenly dies, or even allowed Visitation in some cases because they are not considered immediate family.\n A gay couple who lives together for 40 years and one dies, the survivor has no legal claim to his/her partners estate. \n \n That's just a couple of examples.. but there are over 1000 Rights that hetero couples have that Gay couples are being denied because of a unconstitutional Federal Law. \n \n I hear Right Wing Fundamentals scream for Equality as long as it benefits them, but they are only for equality if you are not Gay. \n \n Marriage was Never defined on a Federal Level because Marriage Laws are States Laws. The Federal Government did not have the Power under the Constitution to define Marriage and to do so in order to discriminate against one group of citizens is wrong no matter how you look at it.", 
   {}, 
   433287, 
   null, 
   1309162560.0
  ], 
  [
   433293, 
   null, 
   "Freedom", 
   "Marriage was Never defined on a Federal Level because Marriage Laws are States Laws. The Federal Government did not have the Power under the Constitution to define Marriage and to do so in order to discriminate against one group of citizens is wrong no matter how you look at it.\n\n If you can't define something you can't then recognize it with taxes or legal benefits. You note the hypocrisy of those who claim they want equality. Have you considered how absurd it is when people flip flop between federalism and states rights depending on which is more likely to go their way?\n \n A state has no more rights than a union because they derive their rights from the same source.", 
   {}, 
   433291, 
   null, 
   1309166040.0
  ], 
  [
   433300, 
   null, 
   "gansao", 
   "How do you know? How many other gays have you talked to about this, and how many have showed this sentiment? The religious right on the other hand, have actually demonstrated their desire to interfere in the civil rights of gays..\n\n So you are saying that most gays would not use their vote against institutions that condemn homosexuality?\n Do I need to talk to every homosexual to not to doubt it? \n \n \n \nI guess \"soon\" could be seen as relative. Non-religious is the fastest growing category, especially among those 29 and under.\n \n Statistics on Religion in America Report -- Pew Forum on Religion & Public Life\n \n Support for gay rights is on the increase, especially among the youth..\n\n \n Soon IS a relative term.I am surprised you did not realise it.\n \n \nSo your prejudiced suspicion of gays, as guilty until proven innocent, tells you. At least we didn't have to pay five bucks to the lady in the tent with the crystal ball, for that prognostication. That's because it's worthless.\n\n \n Oh dear..the criticise gay = prejudice BS again.\n Dont you tire of this ' poor me' argument? I doubt you ever will.\n A preacher being arrested in the Uk for preaching gay sex is a sin and a pub being picketed and the landlord arrested for ejecting gay men kissing in a bar plus other incidents tells me what I need to know about the subject.", 
   {}, 
   433272, 
   null, 
   1309179540.0
  ], 
  [
   433304, 
   null, 
   "Xcaliber", 
   "If you can't define something you can't then recognize it with taxes or legal benefits. You note the hypocrisy of those who claim they want equality. Have you considered how absurd it is when people flip flop between federalism and states rights depending on which is more likely to go their way?\n \n A state has no more rights than a union because they derive their rights from the same source.\n\n \n There is no flip-flopping between States rights and Federal rights. The Constitution is Federal, there are some things the Federal Government does not have power over and those are State Issues. Marriage is and always has been a state issue and the federal government did not have the power to intervene on states issues. By defining marriage on a federal level the feds are discriminating against one particular group, which is unconstitutional. \n \n If a State puts a definition on marriage that is their Right . If a State decides they don't want to allow Gay Marriage that is their right. On a state level Gay Rights activists have to go through the process of either changing the Law through legislature within their state and or pass Laws that will award them the right to marry. \n \n On a Federal Level they have no authority and it is unconstitutional. I don't have a problem against a particular State constitution.. My main beef is with the Federal Government , or those within the Federal Government trampling on the constitution because of their own personal views or religious doctrine.\n DOMA has already been found unconstitutional by two courts and WILL be repealed once it goes through the process.", 
   {}, 
   433293, 
   null, 
   1309184580.0
  ], 
  [
   433305, 
   null, 
   "hwyangel", 
   "@E Mutz\n I'm sorry, I mis-spoke. I ment that a birthed chil has a right to know their heritage by establishing paternity. An adopted child was already denied this right by his/her biological parents, so it would not apply. I have friends that for example are able to research their lineage through martial records. And this is not something that can be obtained through adoption. A child that is adopted has a secure home and income because it must be established before the adoption can take place. But through marriage a birthed child can be garenteed the same secure home and income through child support.\n marriage is the only pro-child institution that covers all of thease rights. Same sex couples are able to establish their \"rights\" to medical releases through power of attorney. Far as taxes, I don't understand what \"break\" anyone is talking about, married couples who both work actually pay higher taxes than a single person. You may have noticed on your tax forms where it gives the option to file at a lower single rate? This is the \"tax break\".", 
   {}, 
   433300, 
   null, 
   1309184700.0
  ], 
  [
   433306, 
   null, 
   "hwyangel", 
   "Recognition? Really?", 
   {}, 
   433305, 
   null, 
   1309185000.0
  ], 
  [
   433309, 
   null, 
   "Xcaliber", 
   "@E Mutz\n I'm sorry, I mis-spoke. I ment that a birthed child is denied the right to know their heritage by establishing paternity. I have friends that for example are able to research their lineage through martial records. And this is not something that can be obtained through adoption. A child that is adopted has a secure home and income because it must be established before the adoption can take place. But through marriage a birthed child can be garenteed the same secure home and income through child support.\n marriage is the only pro-child institution that covers all of thease rights. Same sex couples are able to establish their \"rights\" to medical releases through power of attorney. Far as taxes, I don't understand what \"break\" anyone is talking about, married couples who both work actually pay higher taxes than a single person. You may have noticed on your tax forms where it gives the option to file at a lower single rate? This is the \"tax break\".\n\n \n So you mean Children shouldn't be adopted to any married couple then? Most Adoption services seal the birth records to protect people whom have given their children up for adoption . There are adopted kids who were raised in a family with a man and woman who are being \" denied\" that same right. As far as the U.S. goes we did not agree to nor ratify that U.N Convention on children's rights so we're not bound by it's rules. \n \n and as far as taxes I'll put it this way, maybe you can understand it...\n \n There are things that normal Married couples can do that Legally Gay couples cannot do under Federal Law. With the passage of DOMA the Federal Government does not recognize legally binding Gay marriages from states where Gay Marriage is allowed. In a state such as Massachusetts where Gay Marriage is allowed a gay couple cannot file joint returns or take advantage of certain tax breaks that other married couples can.", 
   {}, 
   433305, 
   null, 
   1309186860.0
  ], 
  [
   433312, 
   null, 
   "MrWriteLA", 
   "For the benefit of the unenlightened, here is the GAO's 1997 list of 1049 federal laws that provide benefits, rights and privileges based on marital status: http://buddybuddy.com/gao-1997.pdf\n \n Additionally, in 2003 a further GAO search turned up additional laws (some of which had been enacted in the interim), bringing the number to 1,138, enumerated in this update: http://buddybuddy.com/gao-2003.pdf\n \n From the cover letter of the original report: \nTo give readers a sense of the kinds of federal laws in which marital status is a factor, we classified the laws on the list into the following 13 categories:\n Social Security and Related Programs, Housing, and Food Stamps\n Veterans' Benefits\n Taxation\n Federal Civilian and Military Service Benefits\n Employment Benefits and Related Laws\n Immigration, Naturalization, and Aliens\n Indians\n Trade, Commerce, and Intellectual Property\n Financial Disclosure and Conflict of Interest\n Crimes and Family Violence\n Loans, Guarantees, and Payments in Agriculture\n Federal Natural Resources and Related Laws\n Miscellaneous Laws\n", 
   {
    "unicode_changes_made": true
   }, 
   433309, 
   null, 
   1309190220.0
  ], 
  [
   433313, 
   null, 
   "jyoshu", 
   "\"A 1997 General Accounting Office (GAO) report found 1,049 legal incidents of marriage in federal law, frequently referred to as \"1,049 federal marriage benefits.\" But this preliminary analysis of the GAO report reveals a more complicated story: Most of these legal provisions are not benefits per se, but ways in which married couples are treated differently than unmarried couples or individuals in federal law.\"Full report at http://www.marriagedebate.com/pdf/iMAPP.GAO.pdf", 
   {
    "post_info": {
     "post_title": "The myth of the supposed 1049 (or whatever the current # claim) marriage benefits"
    }, 
    "unicode_changes_made": true
   }, 
   433312, 
   null, 
   1309195260.0
  ], 
  [
   433315, 
   null, 
   "Xcaliber", 
   "\"A 1997 General Accounting Office (GAO) report found 1,049 legal incidents of marriage in federal law, frequently referred to as \"1,049 federal marriage benefits.\" But this preliminary analysis of the GAO report reveals a more complicated story: Most of these legal provisions are not benefits per se, but ways in which married couples are treated differently than unmarried couples or individuals in federal law.\"Full report at http://www.marriagedebate.com/pdf/iMAPP.GAO.pdf\n\n \n Most is not all.. The Fact remains that Married Hetero Couples are awarded certain rights under the Law that Married Gay Couples are not awarded. That is blatant discrimination and unconstitutional no matter how someone wants to twist it. I'm sure Gay Couples also know of the Penalties that Married couples must face, but that's what being Equal is all about is it not?....", 
   {
    "unicode_changes_made": true
   }, 
   433313, 
   null, 
   1309200960.0
  ], 
  [
   433316, 
   null, 
   "hwyangel", 
   "Marriage law isn't designed for the private benefit of any person; it's for the benefit of society. When we pass a law, we pass a law because that law will benefit society as a whole. Society as a whole is befitted from the union of a male and a female in ways that are not valid for unions of two persons of the same sex. \n Society's interest in safe sex, for both physical and emotional health, support heterosexual marriage alone. Only heterosexual unions are capable of procreation. Heterosexual unions provide the optimal environment for nurturing and raising children.\n Once allowed to be officially married, homosexual couples will more than likely be able to adopt. I do not doubt the pure love that these couples would show a child, and I do not doubt their pure intentions. I do believe in the natural drive toward wanting to have children. Yet, I also know that it has been shown that children who are deprived of the parenting of one gender have a very strong tendency toward emotional and/or psychological problems. These issues will affect their entire life. \n The most prevalent argument that I hear is that homosexual couples wish to have the rights of being considered family, especially where hospital emergencies and inheritance issues are concerned. I would argue that if they really love each other that much, then they would take the steps necessary to secure those rights, even if they cannot be officially married. The problem of not being able to see each other in the case of a medical emergency is solved by signing the proper papers ahead of time, which would designate the partners as each other next of kin. \n Legally I could make anyone I wanted my next of kin, thus given the same rights as a family member. If that is not enough to satisfy the inheritance issue also, then I would propose that the couple write a will. Heterosexual couples even generally also go through the process of making a will. I think that it should also be noted that even in the case of a traditional marriage one spouse can fill out a will that would prohibit everything from being left to the other. A husband can just as easily leave everything to his favorite pet as he can to his wife. \n I have also heard that gay couples wish to have an official ceremony that friends and family may attend. There is no law against arranging such a gathering. People invite friends and family to second weddings all of the time. \n There is also the argument that scientifically we find that homosexuality is a natural response to overpopulation, and so we should not fight so hard against policies having to do with it. I will quickly agree that the studies are accurate, but also point out that we find that disease and cannibalism are at least equally common responses to the same problem. I am not trying to compare homosexuality to disease or cannibalism in any way. However, I would say that until we stop fighting disease and legalize cannibalism, I see this as an invalid argument to support the gay community.\n there is the problem of employers being required to provide health insurance for both partners. In some cases this would seem like a good thing, but in reality it would be too large a stress on the institution of family coverage. I also believe that family coverage is largely to support children, which currently most homosexual couples do not have.", 
   {}, 
   433313, 
   null, 
   1309201020.0
  ], 
  [
   433319, 
   null, 
   "MrWriteLA", 
   "The Fact remains that Married Hetero Couples are awarded certain rights under the Law that Married Gay Couples are not awarded. That is blatant discrimination and unconstitutional no matter how someone wants to twist it. I'm sure Gay Couples also know of the Penalties that Married couples must face, but that's what being Equal is all about is it not?....\nExactly. It has long been a homophobic canard that all gays care about in respect to same-sex marriage is the \"benefits.\" We're supposed to be greedy little Uriah Heeps, rubbing our hands in anticipation of some (unspecified) monetary windfall--to come, presumably, exclusively from the pockets of heterosexuals--that will supposedly accrue to us once our institution-destroying goal is achieved. The fact is, and has always been, that all we have ever wanted is equal rights across the board, including obligations and responsibilities... the exact same ones that apply to opposite-sex couples.", 
   {}, 
   433315, 
   null, 
   1309202400.0
  ], 
  [
   433320, 
   null, 
   "Xcaliber", 
   " I would argue that if they really love each other that much, then they would take the steps necessary to secure those rights, even if they cannot be officially married. The problem of not being able to see each other in the case of a medical emergency is solved by signing the proper papers ahead of time, which would designate the partners as each other next of kin. \n\n \n The Point is that they shouldn't have to take those steps when Other Married Couples are awarded these rights by Law. Sure there may be ways around some of it, but not everything is so cut and dry. A legally Married Gay Couple from a State like New York will not be awarded all the Federal Rights that other married couples are given. What part of Wrong do people not understand. Our Constitution was written with the intent that All of us had equal rights, and those rights are being trampled on by homophobic religious zealots who are hell bent on forcing their religious views on the rest of Society.. It's wrong.", 
   {}, 
   433316, 
   null, 
   1309202460.0
  ], 
  [
   433322, 
   null, 
   "MrWriteLA", 
   "Simple example:\n \n In the U.S., as in many foreign countries, it is a federal law that one cannot be compelled to give testimony in court damaging to one's spouse. \n \n No \"civil union\" status, no drawn-up-at-enormous-expense legal document, confers upon an unmarried couple that right. They have to be married--end of story.", 
   {}, 
   433320, 
   null, 
   1309203420.0
  ], 
  [
   433327, 
   null, 
   "Freedom", 
   "The Point is that they shouldn't have to take those steps when Other Married Couples are awarded these rights by Law. Sure there may be ways around some of it, but not everything is so cut and dry. A legally Married Gay Couple from a State like New York will not be awarded all the Federal Rights that other married couples are given. What part of Wrong do people not understand. Our Constitution was written with the intent that All of us had equal rights, and those rights are being trampled on by homophobic religious zealots who are hell bent on forcing their religious views on the rest of Society.. It's wrong.\n\n Yes it was written with that intent but it did not say that explicitly, it also forgot to mention any objective rights that weren't subject to later legislation.\n \n You whom I'm sure would deny a human being the fundamental and most general form of all rights, liberty; cannot take the high road for something that can't even be demonstrated to be a right!\n \n Right to marriage?!\n \n There can be no right to marriage, it's an agreement and nobody has a right to the volition of others. All that can be said on this matter is that no one has the right to stop people from interacting volitionally, but as hwyangel has pointed out (he is absolutely correct) no one is.\n \n It is a privilege you homosexuals want from the government not a right, and that privilege is on morally unsound footing for those that have it now!\n \n Hwyangel is absolutely correct that any official recognition through generalized form and societal recognition through benefits and programs is solely at the discretion of society and what it thinks best. We are all owed only what we are promised.", 
   {}, 
   433322, 
   null, 
   1309214880.0
  ], 
  [
   433329, 
   null, 
   "pappillion001", 
   "Marriage law isn't designed for the private benefit of any person; it's for the benefit of society. \n\n \n The laws are for an individual. Society benefits from the hoped for elevated position of the individual. How many marriage laws can you name that benefit society before it benefits the individual?\n \n \n \nWhen we pass a law, we pass a law because that law will benefit society as a whole. Society as a whole is befitted from the union of a male and a female in ways that are not valid for unions of two persons of the same sex. \n\n \n Such as?\n \n \nSociety's interest in safe sex\n, \n \n So if there were no gay people there would be no STD's? \n \n \n \nfor both physical and emotional health,\n\n \n Yes we all have in interest in these. I assume your suggesting that gays are more likely to be behind straights with respect to physical and emotional health. You should consider looking up this type of information from credible sources you may be surprised at what you find.\n \n \n \nsupport heterosexual marriage alone. Only heterosexual unions are capable of procreation. Heterosexual unions provide the optimal environment for nurturing and raising children.\n\n \n While there is limited research available Gays are turning out to be pretty good parents. Why are there so many screwed up children if they have the optimum environment for growing up? If this is the best it gets we are in for bigger problems than gay marriage.\n \n \nOnce allowed to be officially married, homosexual couples will more than likely be able to adopt. I do not doubt the pure love that these couples would show a child, and I do not doubt their pure intentions. I do believe in the natural drive toward wanting to have children. Yet, I also know that it has been shown that children who are deprived of the parenting of one gender have a very strong tendency toward emotional and/or psychological problems. These issues will affect their entire life. \n\n \n Then you should be arguing about banning divorce. Marriage does not insure any of these things. The divorce rate is over 50%, single parent families by choice are on the rise and plenty of messed up people had two parents.\n \n \n \nThe most prevalent argument that I hear is that homosexual couples wish to have the rights of being considered family, especially where hospital emergencies and inheritance issues are concerned. I would argue that if they really love each other that much, then they would take the steps necessary to secure those rights, even if they cannot be officially married. The problem of not being able to see each other in the case of a medical emergency is solved by signing the proper papers ahead of time, which would designate the partners as each other next of kin. \n\n \n As I stated before a POA can be challenged, it can become void in the case of death or incapacitation and it can be ignored. Do we ask that the spouse have a POA for the same scenario? Why not and why should it that way?\n \n The same goes for a will. Nest of kin need do nothing if there is no will. A will can easily be challenged by next of kin over boyfriend girlfriend.\n \n \nLegally I could make anyone I wanted my next of kin, thus given the same rights as a family member.\n \n \n No you can't\n \n \n \nIf that is not enough to satisfy the inheritance issue also, then I would propose that the couple write a will. Heterosexual couples even generally also go through the process of making a will. I think that it should also be noted that even in the case of a traditional marriage one spouse can fill out a will that would prohibit everything from being left to the other. A husband can just as easily leave everything to his favorite pet as he can to his wife. \n\n \n He can try, but he will not be successfull. That cat will end up in the pound. Again family has automatic rights that can overcome what you seem to think is a simple fool proof solution. It isn't. \n \n \nI have also heard that gay couples wish to have an official ceremony that friends and family may attend. There is no law against arranging such a gathering. People invite friends and family to second weddings all of the time.\n \n \n You can also celebrate your first birthday every year, but what is the point it wouldn't be real.\n \n \nThere is also the argument that scientifically we find that homosexuality is a natural response to overpopulation, and so we should not fight so hard against policies having to do with it. I will quickly agree that the studies are accurate, but also point out that we find that disease and cannibalism are at least equally common responses to the same problem. I am not trying to compare homosexuality to disease or cannibalism in any way. However, I would say that until we stop fighting disease and legalize cannibalism, I see this as an invalid argument to support the gay community.\n\n \n \n emoticon_emb Please provide evidence of this\n \n \nthere is the problem of employers being required to provide health insurance for both partners. In some cases this would seem like a good thing, but in reality it would be too large a stress on the institution of family coverage. I also believe that family coverage is largely to support children, which currently most homosexual couples do not have.\n\n \n Without sounding to rude you obviuosly listen to a lot of talk radio. I would suggest you go to some pro same sex marriage websites and just get a look at some the evidence from the other side. Then try and find unbiased sources to confirm what each says. As it stands much of your conclusion is not based on any facts.", 
   {}, 
   433316, 
   null, 
   1309217880.0
  ], 
  [
   433331, 
   null, 
   "MrWriteLA", 
   "From Legal and economic benefits of marriage...\nOn the order of 1,400 legal rights are conferred upon married couples in the U.S. Typically these are composed of about 400 state benefits and over 1,000 federal benefits. Among them are the rights to:[*]joint parenting;[*]joint adoption;[*]joint foster care, custody, and visitation (including non-biological parents);[*]status as next-of-kin for hospital visits and medical decisions where one partner is too ill to be competent;[*]joint insurance policies for home, auto and health;[*]dissolution and divorce protections such as community property and child support;[*]immigration and residency for partners from other countries;[*]inheritance automatically in the absence of a will;[*]joint leases with automatic renewal rights in the event one partner dies or leaves the house or apartment;[*]inheritance of jointly-owned real and personal property through the right of survivorship (which avoids the time and expense and taxes in probate);[*]benefits such as annuities, pension plans, Social Security, and Medicare;[*]spousal exemptions to property tax increases upon the death of one partner who is a co-owner of the home;[*]veterans' discounts on medical care, education, and home loans; joint filing of tax returns;[*]joint filing of customs claims when traveling;[*]wrongful death benefits for a surviving partner and children;[*]bereavement or sick leave to care for a partner or child;[*]decision-making power with respect to whether a deceased partner will be cremated or not and where to bury him or her;[*]crime victims' recovery benefits;[*]loss of consortium tort benefits;[*]domestic violence protection orders;[*]judicial protections and evidentiary immunity;[*]and more....Most of these legal and economic benefits cannot be privately arranged or contracted for. For example, absent a legal (or civil) marriage, there is no guaranteed joint responsibility to the partner and to third parties (including children) in such areas as child support, debts to creditors, taxes, etc. In addition, private employers and institutions often give other economic privileges and other benefits (special rates or memberships) only to married couples. And, of course, when people cannot marry, they are denied all the emotional and social benefits and responsibilities of marriage as well.\n", 
   {}, 
   427151, 
   null, 
   1309221120.0
  ], 
  [
   433332, 
   null, 
   "hwyangel", 
   "I suppose we can only disagree then. I do not believe that marriage was ever ment to be recreational, or that the effects it has on society as whole is irrelevant, or that childrens rights are irrelevant.\n I also support stricter divorce laws.", 
   {}, 
   433331, 
   null, 
   1309222380.0
  ], 
  [
   433333, 
   null, 
   "Xcaliber", 
   "\n Right to marriage?!\n \n Hwyangel is absolutely correct that any official recognition through generalized form and societal recognition through benefits and programs is solely at the discretion of society and what it thinks best. We are all owed only what we are promised.\n\n \n I disagree. A person has the RIGHT to marry whomever they choose and the Society in which they live does not have the RIGHT to stop them or limit them and not other Marriages. Some States allow Gay Marriage, Some Don't.. The Federal Government doesn't have the Power to infringe on Marriage or Discriminate based on Sexual Preference, that's where the problem is. If a State doesn't want to allow Gay Marriages fine, the People in that state have spoken for their State. But the Federal Government HAS to apply the Law equally to Every Citizen in Every State, so if they are going to Recognize a Marriage from Arkansas and award that Couple all the Rights and Privileges and Penalties of Marriage then by LAW they should have to recognize Gay Marriages that Are Legally binding in other states.", 
   {}, 
   433327, 
   null, 
   1309222860.0
  ], 
  [
   433335, 
   null, 
   "Freedom", 
   "Then you should be arguing about banning divorce. Marriage does not insure any of these things. The divorce rate is over 50%, single parent families by choice are on the rise and plenty of messed up people had two parents.\n\n Or at least divorce after children whether by adoption or birth, yes that is where is logic leads. Let's not pretend that is a new idea either, divorce has always been looked on with disapproval, that fact is as universal as marriage.\n \n Why make vows that are acceptable to break?\n \n \nthere is the problem of employers being required to provide health insurance for both partners.\n\n Yea, it's employers being required to provide health insurance for both partners.\n \n \nI disagree. A person has the RIGHT to marry whomever they choose and the Society in which they live does not have the RIGHT to stop them or limit them and not other Marriages.\n\n No one is interfering with homosexual marriage.\n \n \nSome States allow Gay Marriage, Some Don't.. \n\n Some states recognize homosexual marriages, some don't.\n \n \nThe Federal Government doesn't have the Power to infringe on Marriage or Discriminate based on Sexual Preference, that's where the problem is.\n\n They aren't. If they are infringing on anything it's the right to property by taking money from people to subsidize heterosexual marriages without their consent.\n \n \nIf a State doesn't want to allow Gay Marriages fine, the People in that state have spoken for their State.\n\n That's even worse, if there was a moral dilemma here the majority decision doesn't magically blanket lines on the map with a different form of human nature.\n \n \nBut the Federal Government HAS to apply the Law equally to Every Citizen in Every State, so if they are going to Recognize a Marriage from Arkansas and award that Couple all the Rights and Privileges and Penalties of Marriage then by LAW they should have to recognize Gay Marriages that Are Legally binding in other states.\n\n Why? The only equality that justice demands is equality of rights, not privileges. The very act of recognizing any marriage is unequal to singles or platonic relationships.", 
   {}, 
   433333, 
   null, 
   1309225560.0
  ], 
  [
   433337, 
   null, 
   "pappillion001", 
   "I suppose we can only disagree then. I do not believe that marriage was ever ment to be recreational, or that the effects it has on society as whole is irrelevant, or that childrens rights are irrelevant.\n I also support stricter divorce laws.\n\n \n I am not say that it should be recreational. \n I am not saying that the effects on society or children or not relevant.\n \n But you imply that by recognizing gay marriage will result in these things happening. I am saying they are already present in significant proportions and there is no evidence that same sex marriage will in any way have a negative impact. What little research there is shows it would actually slow down the decline slightly. \n \n All you have done is made statements about how marriage and children will suffer because of same sex marriage based on things you have heard about. I have asked you to provide evidence to support these claims and you come back with we will just have to disagree. \n \n So I guess we will. I would still ask that you get some information from places that are both for and against and then confirm the position of each from credible sources then make up your mind and if you still believe the same things the same way we can happily disagree again.", 
   {}, 
   433332, 
   null, 
   1309228080.0
  ], 
  [
   433340, 
   null, 
   "hwyangel", 
   "As I have mentioned before. Marriage is the only government recognized institution that protects the rights of children. Unlike same sex couples, children do not have the ability to establish their rights any other way. \n There is also mountains of proof that children raised in homes where there is both gender role models are psychological ,emotionaly , and socaily healthier which is why we don't promote single parent homes.\n \n How same-sex \"marriage\" affects Massachusetts", 
   {}, 
   433333, 
   null, 
   1309238820.0
  ], 
  [
   433343, 
   null, 
   "hwyangel", 
   "The laws are for an individual. Society benefits from the hoped for elevated position of the individual. How many marriage laws can you name that benefit society before it benefits the individual?\n \n \n \n \n Such as?\n \n Federal motor carrier safety regulations\n (Not everyone is permitted to drive a rig or carry a CDL)\n \n Passports\n (Not everyone qualifies)\n \n Blood donations.\n (Gay men, interrveinious drug users, and recent tattoos or piercing, are banned )\n \n Hud housing, welfare, social security, unemployment, veterans benifites, student visas, college admissions.\n (All require special qualifications and benefits society as a whole)\n \n \n \n So if there were no gay people there would be no STD's? \n \n Never suggested that. But their in reason why gay men are not allowed to donate blood.\n \n \n \n \n Yes we all have in interest in these. I assume your suggesting that gays are more likely to be behind straights with respect to physical and emotional health. You should consider looking up this type of information from...\n \n As a single mom, having raised two sons(now men), after their fathers death, I can personaly testify that \"most\" women do not shave their face or urinate standing up. LOLLOL\n \n \n \n \n \n While there is limited research available Gays are turning out to be pretty good parents. Why are there so many screwed up children if they have the optimum environment for growing up? If this is the best it gets we are in for bigger problems than gay marriage.\n \n Single parent homes have never been promoted in our society. Divorce also was never recognized as a positive thing, and was in fact discouraged , and usually met with child support, alimony, and many other restrictions ment to protect the child. That is untill the gay movement. \n \n \n Then you should be arguing about banning divorce. Marriage does not insure any of these things. The divorce rate is over 50%, single parent families by choice are on the rise and plenty of messed up people had two parents.\n \n \n \n \n As I stated before a POA can be challenged, it can become void in the case of death or incapacitation and it can be ignored. Do we ask that the spouse have a POA for the same scenario? Why not and why should it that way?\n \n The same goes for a will. Nest of kin need do nothing if there is no will. A will can easily be challenged by next of kin over boyfriend girlfriend.\n \n \n \n No you can't\n \n Yes you can. What other purpose would it have?\n \n \n \n \n He can try, but he will not be successfull. That cat will end up in the pound. Again family has automatic rights that can overcome what you seem to think is a simple fool proof solution. It isn't. \n \n \n \n You can also celebrate your first birthday every year, but what is the point it wouldn't be real.\n \n Real? Marriage is not real without recognition from those who may not agree with you or \"automatic\" financial benefits from the government? \n \n \n \n \n emoticon_emb Please provide evidence of this\n \n \n \n Without sounding to rude you obviuosly listen to a lot of talk radio. I would suggest you go to some pro same sex marriage websites and just get a look at some the evidence from the other side. Then try and find unbiased sources to confirm what each says. As it stands much of your conclusion is not based on any facts.\n\n \n Actually, the idea that children deserve to have their rights protected as opposed to the recognition and financial benefits of gay marriage is a personal opinion.", 
   {}, 
   433329, 
   null, 
   1309245780.0
  ], 
  [
   433346, 
   null, 
   "hwyangel", 
   "Apples vs oranges :\n \n Traditional marriage :\n Wife/mother Husband/father\n genetic ties, pro-creation, security, male and female roll models, established nationality, garenteed support through established paternity.\n \n Same sex marriage:\n wife/wife or husband/husband\n children are from broken home, absence of one gender roll model, child support can not be established from this union, limited genetic medical history/nationality,", 
   {}, 
   433253, 
   null, 
   1309257180.0
  ], 
  [
   433358, 
   null, 
   "Xcaliber", 
   "No one is interfering with homosexual marriage.\n \n\n \n The Federal Government is. They don't have the right to get involved in anything to do with marriage, yet they passed DOMA to specifically disallow Gay Married couples the same RIGHTS that Hetero couples have.\n \n \n\n Some states recognize homosexual marriages, some don't.\n\n \n Already said that, and that is fine. Marriage is a State by State decision and the Feds are not only infringing on individual rights but they blatantly ignoring states rights to as of now 6 states, by overstepping the boundaries of States Rights.\n \n \n\n They aren't. If they are infringing on anything it's the right to property by taking money from people to subsidize heterosexual marriages without their consent.\n\n \n They are. \n \n \n\n That's even worse, if there was a moral dilemma here the majority decision doesn't magically blanket lines on the map with a different form of human nature.\n\n \n This isn't about human nature, it's about the Federal Government abusing their power to discriminate against a group of people. The States have the right to decided their own Marriage Laws, the Feds do not have that right. \n \n \n\n Why? The only equality that justice demands is equality of rights, not privileges. The very act of recognizing any marriage is unequal to singles or platonic relationships.\n\n \n I agree. The Federal Government should not be allowed to have anything to do with Marriage, it is a State Issue. Before DOMA the Federal Government did not have a \" Definition\" for Marriage. It never said Marriage was between one man and one woman. With the passage of DOMA they applied this Definition to specifically discriminate against Gay Marriage and in effect gave the States a Safety net to keep Gay Marriage out of their States. As of now The Government is applying two sets of Tax laws to the states. \n 1: The States where Gay Marriage is NOT allowed are under one set of rules, \n 2: In States where Gay Marriage IS allowed the Gay couples are under a different set of rules. \n \n So tell me.. how is this equal for all?...", 
   {}, 
   433335, 
   null, 
   1309278420.0
  ], 
  [
   433359, 
   null, 
   "Xcaliber", 
   "As I have mentioned before. Marriage is the only government recognized institution that protects the rights of children. Unlike same sex couples, children do not have the ability to establish their rights any other way. \n\n \n Hogwash.. there is no evidence to support this statement. \n \n There is also mountains of proof that children raised in homes where there is both gender role models are psychological ,emotionaly , and socaily healthier which is why we don't promote single parent homes.\n \n How same-sex \"marriage\" affects Massachusetts[/QUOTE]\n \n And apparent Anti-Gay Marriage blog with no credible source. Again you avoid the question.. CAN YOU PROVIDE ACTUAL CASE STUDIES TO PROVE THIS ERRONEOUS CLAIM? \n So where is the \"Mountain of Proof\"?", 
   {}, 
   433340, 
   null, 
   1309278960.0
  ], 
  [
   433361, 
   null, 
   "Freedom", 
   "The Federal Government is. They don't have the right to get involved in anything to do with marriage, \n\n Then we can drop those one thousand ways they do?\n \n \nyet they passed DOMA to specifically disallow Gay Married couples the same RIGHTS that Hetero couples have.\n\n I doubt it.\n \n \nAlready said that, and that is fine. Marriage is a State by State decision and the Feds are not only infringing on individual rights but they blatantly ignoring states rights to as of now 6 states, by overstepping the boundaries of States Rights.\n\n No you said allow, they all allow homosexual marriage.\n \n \nThey are.\n \n How?\n \n \n \nThis isn't about human nature, it's about the Federal Government abusing their power to discriminate against a group of people. The States have the right to decided their own Marriage Laws, the Feds do not have that right.\n \n That's insane, no government is right just because it's a government and that applies to state and federal governments.\n \n If you were correct that the rights of homosexuals were being violated a state would have no more right to do it than the federal government.\n \n \nI agree. The Federal Government should not be allowed to have anything to do with Marriage, it is a State Issue.\n\n Why is it a state issue? and don't just say 'this I know because the constitution told me so'.\n \n \nBefore DOMA the Federal Government did not have a \" Definition\" for Marriage. It never said Marriage was between one man and one woman. With the passage of DOMA they applied this Definition to specifically discriminate against Gay Marriage and in effect gave the States a Safety net to keep Gay Marriage out of their States.\n\n They can, and in fact have a duty to define any term that appears in the law.\n \n \nAs of now The Government is applying two sets of Tax laws to the states. \n 1: The States where Gay Marriage is NOT allowed are under one set of rules, \n 2: In States where Gay Marriage IS allowed the Gay couples are under a different set of rules.\n \n Oh that gave me a good laugh, not that I disbelieve you.\n \n \nSo tell me.. how is this equal for all?...\n\n If you had been paying attention there is nothing I complain about more than the moral foundation of taxation (or lack there of).\n \n You think you can surprise me by finding unjust tax laws? They are all unjust. I knew from the start that this issue really tracked back like most do to the money. Americans are pretty good with civil liberties, but economic ones have been under constant assault, and it's only foolish leftist who came up with two different names, for they are certainly as interconnected with each other as themselves.", 
   {}, 
   433358, 
   null, 
   1309279320.0
  ], 
  [
   433363, 
   null, 
   "Xcaliber", 
   "Apples vs oranges :\n \n Traditional marriage :\n Wife/mother Husband/father\n genetic ties, pro-creation, security, male and female roll models, established nationality, garenteed support through established paternity.\n\n \n \n\n Same sex marriage:\n wife/wife or husband/husband\n \n children are from broken home, \n\n \n Considering that these Children mostly come from Adoption they were from a Broken home to begin with and there is no evidence that adopted children fair less than other children.\n \n \nabsence of one gender roll model, \n\n Gay people have extended families as well and grandmothers/grandfathers serve well as role models to their Grandchildren. again, Homophobic nonsense. \n \nchild support can not be established from this union,\n\n BullXXXX.. In cases where Married Gay Couples are Divorced Child custody is determined in the same way as with a Hetero Couple. The Child will live with one Parent the other pays Child support or they share joint custody .. More nonsense.\n \nlimited genetic medical history/nationality,\n\n Most all adoption houses have extensive medical records for the kids. They know in most cases who the biological parents were and have enough genetic history to pass this along to the children or the adoptive parents.\n \n Clearly you are homophobic and simply grasping at straws trying to convince yourself that you are justified in being homophobic.", 
   {}, 
   433346, 
   null, 
   1309279680.0
  ], 
  [
   433365, 
   null, 
   "MrWriteLA", 
   "Study: Same-Sex Parents Raise Well-Adjusted Kids\n Lesbian & Gay Parenting: Theoretical & Conceptual Examinations Related to Lesbian & Gay Parenting\n Studies of same-sex parenting\n Kids with Lesbian Parents May Do Better Than Their Peers - TIME\n Same-sex couples can be effective parents, researchers find - USATODAY.com\n College Inc. - Study: Same-sex couples can thrive as adoptive parents\n Kids do as well with same-sex parents, study says - Health - Kids and parenting - msnbc.com\n TODAYMoms - The kids are all right: Largest study of gay parents shows their children to be well adjusted\n Refuting the Myths About Gay Parents | gbge.aclu.org", 
   {}, 
   433363, 
   null, 
   1309286280.0
  ], 
  [
   433369, 
   null, 
   "Xcaliber", 
   "\n No you said allow, they all allow homosexual marriage.\n \n\n \n They most certainly do not. only 6 of the 50 states currently ALLOW Gay marriage. It's not legal in the other 44 states as of yet. and the Federal Government doesn't recognize legal gay Marriages as legal so they are discriminating against Gays.", 
   {}, 
   433361, 
   null, 
   1309288440.0
  ], 
  [
   433370, 
   null, 
   "MrWriteLA", 
   "I was wrong about same-sex marriage - David Frum\nEditor's note: David Frum writes a weekly column for CNN.com. A special assistant to President George W. Bush from 2001 to 2002, he is the author of six books, including \"Comeback: Conservatism That Can Win Again,\" and is the editor of FrumForum.\n \n Washington (CNN) -- I was a strong opponent of same-sex marriage. Fourteen years ago, Andrew Sullivan and I forcefully debated the issue at length online (at a time when online debate was a brand new thing).\n \n Yet I find myself strangely untroubled by New York state's vote to authorize same-sex marriage -- a vote that probably signals that most of \"blue\" states will follow within the next 10 years.\n \n I don't think I'm alone in my reaction either. Most conservatives have reacted with calm -- if not outright approval -- to New York's dramatic decision.\n \n Why?\n \n The short answer is that the case against same-sex marriage has been tested against reality. The case has not passed its test.\n \n Since 1997, same-sex marriage has evolved from talk to fact.\n \n If people like me had been right, we should have seen the American family become radically more unstable over the subsequent decade and a half.\n \n Instead -- while American family stability has continued to deteriorate -- it has deteriorated much more slowly than it did in the 1970s and 1980s before same-sex marriage was ever seriously thought of.\n \n By the numbers, in fact, the 2000s were the least bad decade for American family stability since the fabled 1950s. And when you take a closer look at the American family, the facts have become even tougher for the anti-gay marriage position.\n \n Middle-class families have become somewhat more stable than they used to be. For example: College-educated women who got married in the 1990s were much less likely to get divorced than equally educated women who got married in the 1970s.\n \n What's new and different in the past 20 years is the collapse of the Hispanic immigrant family. First-generation Latino immigrants maintain traditional families: conservative values, low divorce rates, high fertility and -- despite low incomes -- mothers surprisingly often at home with the children.\n \n But the second-generation Latino family looks very different. In the new country, old norms collapse. Nearly half of all children born to Hispanic mothers are now born out of wedlock.\n \n The case against same-sex marriage has been tested against reality. The case has not passed its test.\n \n Whatever is driving this negative trend, it seems more than implausible to connect it to same-sex marriage. How would it even work that a 15-year-old girl in Van Nuys, California, becomes more likely to have a baby because two men in Des Moines, Iowa, can marry?\n \n Maybe somebody can believe the connection, but I cannot.\n \n I remain as worried as ever about the decline in family stability among poorer Americans. But as for same-sex marriage, my attitude follows the trajectory described nearly 150 years ago by the English writer Anthony Trollope in his novel \"Phineas Finn.\"\n \n Two of his characters are discussing a proposed reform that has just been defeated in Parliament. The author of the reform is understandably dejected. His friend consoles him by pointing to the future:\n \n \"Many who before regarded legislation on the subject as chimerical, will now fancy that it is only dangerous, or perhaps not more than difficult. And so in time it will come to be looked on as among the things possible, then among the things probable; -- and so at last it will be ranged in the list of those few measures which the country requires as being absolutely needed. That is the way in which public opinion is made.\"\n \n By coincidence, I am writing these words on the morning of my own 23rd wedding anniversary. Of all the blessings life has to offer, none equals a happy marriage. If proportionally fewer Americans enjoy that blessing today than did 40 years ago, we're going to have to look for the explanation somewhere other than the Legislature in Albany.\n", 
   {}, 
   427151, 
   null, 
   1309288500.0
  ], 
  [
   433371, 
   null, 
   "gansao", 
   "I was wrong about same-sex marriage - David Frum\n\n \n Did anyone else but him claim that allowing same sex marriage would destablise hetero marriage?", 
   {}, 
   433370, 
   null, 
   1309289640.0
  ], 
  [
   433375, 
   null, 
   "Xcaliber", 
   "Why is it a state issue? and don't just say 'this I know because the constitution told me so'.\n\n \n Well sadly I live in the United States and therefore I live under the Constitution of the U.S. and that of my state. \n \n The powers of Congress are limited to those enumerated in the Constitution; all other powers are reserved to the states and the people. The Federal Government was given it's powers by the States but only Powers to Govern on a National Level. The Federal Government was given the Power to raise Revenues , to pay for National defense, create post offices and roads, as well as to Create Courts . Everything else concerning the Citizens was kept under the States Powers and the Feds did not have the Power to override States.\n \n The Tenth Amendment to the United States Constitution prohibits the Federal Government from exercising any power not delegated to it by the States in the Constitution.\n \n This includes but is not limited to deciding Marriage laws. Most States have their own Constitutions and their own Laws concerning Marriage, it's always been a State issue because each state is responsible only for the citizens within said State and each individual Citizen of the U.S. is protected by the Federal Constitution which is supposed to mean Equal rights for all on the Federal Level. \n \n That's not saying that the States who have made Gay Marriage Illegal by Legislation are right.. what I'm saying is that the Feds should not be sticking their 2 cents into State issues . Gay People already had it hard enough trying to fight for equality on a State level but now because of Government Abuse of power they have to fight on a Federal level too. \n \n \n\n If you had been paying attention there is nothing I complain about more than the moral foundation of taxation (or lack there of).\n\n \n Well this is not about just the taxes. To be honest , If I get you right, you are saying that we should have No taxes whatsoever?..\n \n It's ridiculous to think we could even be a Nation without taxes of some kind. Forming a Society is not a free ride. Without taxes we would not have a Military, hell we wouldn't even have a Government. Whether you like taxes or not taxes are just part of life.", 
   {}, 
   433361, 
   null, 
   1309291080.0
  ], 
  [
   433380, 
   null, 
   "pappillion001", 
   "As I have mentioned before. Marriage is the only government recognized institution that protects the rights of children. Unlike same sex couples, children do not have the ability to establish their rights any other way.\n\n \n Marriage itself does not protect the rights of children. There are separate laws that do that. Financial responsibility is not based on whether the parents were married. An unwed parent is just as liable as a wedded parent. A married parent can just as easily deny paternity as an unwed parent. Your belief that marriage grants children special protections that adopted children will not have is incorrect. \n \n What laws are you referring to that are afforded to natural children that are not given to adopted children or vice versa? \n \n or are granted to the children or wedded parents and not unwedded?\n \n \nThere is also mountains of proof that children raised in homes where there is both gender role models are psychological ,emotionaly , and socaily healthier which is why we don't promote single parent homes.\n\n \n Yes as compared to single parent homes, not same sex homes, either single or two parents. So your basing your statement on evidence that does not account for the circumstances that you say are inferior. \n \n \nHow same-sex \"marriage\" affects Massachusetts\n\n \n Like I said you should visit credible sites to get your information\n \n I assume you did not bother to read the facts about this trusting the website would be honest in detailing the events it discusses. \n \n I only read two claims it made and found both to be biased and not completely truthful.\n \n The part were it said one school teacher would openly discuss the use of sex toys by lesbians failed to mention she was a sex ed teacher and doing so was in a question answer part of the curriculum concerning different types of intercourse. It was implied that this teacher was doing so in the course of teaching Math, English or some other subject where the topic would be out of place for the class.\n \n The second was the man who was arrested as the article wants you to believe for trying to discuss the school policy on teaching about same sex families. Mr. Parker had repeatedly been told that the school material in question was not subject to the MA opt-out laws and that the school would not make an exception for his children. Over several months Mr. Parker continued to insist the school comply with his requests finally meeting with school officials, he had drafted an agreement that the school refused to sign. After two hours the school ended the meeting at which time Mr. Parker refused to leave school grounds. At 5:20 police arrived and at 6:00 a lieutenant arrived and all 3 tried to get Mr. Parker to leave voluntarily. He refused stating he was performing an act of civil disobedience in protest of the school policy. He was arrested for trespassing shortly after.\n \n That is a bit different than what is implied by \"strongly insisted on being notified when teachers were discussing homosexuality or transgenderism with his son, the school had him arrested and put in jail overnight.\"", 
   {
    "unicode_changes_made": true
   }, 
   433340, 
   null, 
   1309297500.0
  ], 
  [
   433381, 
   null, 
   "Freedom", 
   "They most certainly do not. only 6 of the 50 states currently ALLOW Gay marriage. It's not legal in the other 44 states as of yet. and the Federal Government doesn't recognize legal gay Marriages as legal so they are discriminating against Gays.\n\n Find one case of marriage disallowance in the past 10 years please. (marriage being defined only as the business of the two people getting married as you claimed it was)\n \n \nWell sadly I live in the United States and therefore I live under the Constitution of the U.S. and that of my state. \n \n The powers of Congress are limited to those enumerated in the Constitution; all other powers are reserved to the states and the people. The Federal Government was given it's powers by the States but only Powers to Govern on a National Level. The Federal Government was given the Power to raise Revenues , to pay for National defense, create post offices and roads, as well as to Create Courts . Everything else concerning the Citizens was kept under the States Powers and the Feds did not have the Power to override States.\n \n The Tenth Amendment to the United States Constitution prohibits the Federal Government from exercising any power not delegated to it by the States in the Constitution.\n \n This includes but is not limited to deciding Marriage laws. Most States have their own Constitutions and their own Laws concerning Marriage, it's always been a State issue because each state is responsible only for the citizens within said State and each individual Citizen of the U.S. is protected by the Federal Constitution which is supposed to mean Equal rights for all on the Federal Level. \n\n That doesn't answer the question, and I warned you that it wouldn't. When the federal government is forcing it's will on the confederacy for equal rights, then it's obvious how necessary it is (people claim); but when it's the federal government forcing injustices than it's obvious states rights are primary. This is hypocrisy not a check and balance.\n \n All people are saying is that the people who make the right decisions are right (wow!).\n \n If this were a moral issue it would be neither a state or federal issue it would be the responsibility of each person.\n \n \nThat's not saying that the States who have made Gay Marriage Illegal by Legislation are right.. what I'm saying is that the Feds should not be sticking their 2 cents into State issues . Gay People already had it hard enough trying to fight for equality on a State level but now because of Government Abuse of power they have to fight on a Federal level too. \n\n They ought to only fight on a moral level. By trusting states to be right about rights but not the federal government you are claiming that the moral truth of the matter is attached to their decisions. This cannot be the case. All you can say is that it would be less trouble at this place and time if states could choose individually, and even then only for those states that choose correctly.\n \n \nWell this is not about just the taxes.\n\n There are other parts of the marriage framework yes, but none of them are rights either, they ought to be conventions and legal structure.\n \n The only injustice I see however is that as a poster pointed out in another thread the government is taking homosexuals money to pay for organizations that discriminate against homosexuals.\n \n This is only a particular subset of the general problem.\n \n The problem is the government taking A's money to pay for B.\n \n Where moral analysis concludes these variables:\n A = anyone\n B = anything they don't want to pay for\n \n Clearly A = homosexuals is a subset of anyone, B = discriminatory marriage benefits is a subset of anything they don't want to pay for.\n \n If easyrider claimed \"I am only willing to pay for benefits for heterosexual marriage\" he has that right, just as Matthew is allowed to only pay for homosexual marriage. That is the natural state, you would need to construct a special agreement of cooperation to merge individual decisions to social duties.\n \n \nTo be honest , If I get you right, you are saying that we should have No taxes whatsoever?..\n\n That is correct. Where taxes are defined as funds collected by a government irregardless of consent.\n \n \nIt's ridiculous to think we could even be a Nation without taxes of some kind. \n\n Of course it's possible.\n \n \nForming a Society is not a free ride.\n\n Ideally it can be done entirely on the trade principal. Do you call a trade 'free'? for it's premise is certainly that value is conserved or increased for both parties.\n \n \nWithout taxes we would not have a Military, hell we wouldn't even have a Government.\n\n Why?\n \n \nWhether you like taxes or not taxes are just part of life.\n\n Just like slavery, serfdom, repression of sexual deviation, or any other oppression; it's a fact of life... until someone changes it.", 
   {}, 
   433375, 
   null, 
   1309297620.0
  ], 
  [
   433388, 
   null, 
   "pappillion001", 
   "The Federal Government is. They don't have the right to get involved in anything to do with marriage, yet they passed DOMA to specifically disallow Gay Married couples the same RIGHTS that Hetero couples have.\n\n \n Correct me if I am wrong but I don't think the Fed is interferring with a state. The Fed has passed laws that define its position on marriage, but it isn't saying states have to do so as well. \n \n \nAlready said that, and that is fine. Marriage is a State by State decision and the Feds are not only infringing on individual rights but they blatantly ignoring states rights to as of now 6 states, by overstepping the boundaries of States Rights.\n\n \n If the Fed was doing that then those states could not pass laws allowing it,\n \n They are. \n \n \n \n \nThis isn't about human nature, it's about the Federal Government abusing their power to discriminate against a group of people. The States have the right to decided their own Marriage Laws, the Feds do not have that right. \n\n \n I would agree but the states do not have the right to dictate what the Fed will do either. \n \n \nI agree. The Federal Government should not be allowed to have anything to do with Marriage, it is a State Issue. Before DOMA the Federal Government did not have a \" Definition\" for Marriage. It never said Marriage was between one man and one woman. With the passage of DOMA they applied this Definition to specifically discriminate against Gay Marriage and in effect gave the States a Safety net to keep Gay Marriage out of their States. As of now The Government is applying two sets of Tax laws to the states. \n 1: The States where Gay Marriage is NOT allowed are under one set of rules, \n 2: In States where Gay Marriage IS allowed the Gay couples are under a different set of rules.\n \n \n The fed was involved in marriage say for taxes. It was not an issue before because marriage was uniformly a man and woman in every state. When states added a different coupling the Fed had to define what it would recognize also.\n \n \nSo tell me.. how is this equal for all?...\n\n \n For the Fed I think it looks also at the economic impact recognition would have on revenue, not that that should be a consideration but somewhere someone said that would cost a lot of money. The primary reasons I would agree are political, conservatives vote more than liberals and that is what counts. Gays have done a good job recently shifting their focus and they are seeing the payoff. Conservatives are trying the same tactics and it is getting old. I think gay marriage will become law across the Union at some point and it is to bad it will be in the future but the when it does it will be a huge blow to religion and the country just isn't willing to engage in that just yet.", 
   {}, 
   433358, 
   null, 
   1309303920.0
  ], 
  [
   433399, 
   null, 
   "pappillion001", 
   "Actually, the idea that children deserve to have their rights protected as opposed to the recognition and financial benefits of gay marriage is a personal opinion.\n\n \n \nFederal motor carrier safety regulations\n (Not everyone is permitted to drive a rig or carry a CDL)\n\n \n And this has what to do with marriage?\n \n \n \nPassports\n (Not everyone qualifies)\n\n \n Still looking for the marriage connection\n \n \n \nBlood donations.\n (Gay men, interrveinious drug users, and recent tattoos or piercing, are banned )\n\n \n Marriage connection, no \n \n \nHud housing, welfare, social security, unemployment, veterans benifites, student visas, college admissions.\n (All require special qualifications and benefits society as a whole)\n\n \n And marriage doesn't happen to be one of those qualifications does it? Now marriage can be a factor on certain SS and VA benefits, but you need not be married to be eligible as a primary recipient for any of the above.\n \n My question and the topic concerned marriage. \n \n \n \nNever suggested that. But their in reason why gay men are not allowed to donate blood.\n\n \n Unless they happen to feed it to the guests at thier wedding as a requirement to have it made official or are raising vampires I don't see why that makes a difference. There is a long list of people blood banks won't take blood from. Being at risk for disease is not a deal breaker for a marriage.\n \n \nAs a single mom, having raised two sons(now men), after their fathers death, I can personaly testify that \"most\" women do not shave their face or urinate standing up. LOLLOL\n\n \n As a single guy coming from a single mom who raised two sons none of the women I known did those things either. Having also been married I don't recall either of those questions on my marriage application. \n \n \nSingle parent homes have never been promoted in our society. Divorce also was never recognized as a positive thing, and was in fact discouraged , and usually met with child support, alimony, and many other restrictions ment to protect the child. That is untill the gay movement. \n\n \n I really do not understand this. Gays don't effect any of these things. If a gay couple adopts a child or uses artificial methods to become pregnant and they then divorce guess what one will have primary custody and one will pay support for the child. The courts will decide which one same as with straight couples. Why would it be any different. If a straight couple adopts are you suggesting if they split then there is no custody or support options available? \n \n Granting marriage rights would most likely do the opposite of what you are stating. Currently same sex couple living together are not liable to each other for anything. If one was succesfull and the other stayed at home and raised a child either adopted or from another relationship and they split the stay at home one has no right to anything. if they had married and adopted or had their own or adopted the child from another relationship now there is recourse and responsibility.\n \n \nYes you can. What other purpose would it have?\n\n \n A will does not make someone a relative. The purpose is to direct the courts as to the terms of disolving the decedents estate. Courts generally comply with the wishes of the deceased, but do not have to. There are ways that same sex couple can protect their property and have their wishes executed, but they tend to be costly and have drawbacks that don't always make them desireable. Same sex couples generally can bypass a lot of these issues simply because they are married.\n \n \nReal? Marriage is not real without recognition from those who may not agree with you or \"automatic\" financial benefits from the government? \n\n \n Yes that is the point. Gay couples who accept the burdens of marriage would also like to receive the benefits and not suffer additional consequences for playing house.\n \n \nActually, the idea that children deserve to have their rights protected as opposed to the recognition and financial benefits of gay marriage is a personal opinion.\n\n \n That you can have all day long. I only wish your opinion was based on fact and not other opinions.", 
   {}, 
   433343, 
   null, 
   1309318080.0
  ], 
  [
   433405, 
   null, 
   "hwyangel", 
   "Apples vs oranges :\n \n Traditional marriage :\n Wife/mother Husband/father\n genetic ties, pro-creation, security, male and female roll models, established nationality, garenteed support through established paternity.\n \n Same sex marriage:\n wife/wife or husband/husband\n children are from broken home, absence of one gender roll model, child support can not be established from this union, limited genetic medical history/nationality,\n\n \n Here it is again. How is a same sex marriage going to be \"responsible\"? Obviously child support will still be the responsibility of the biological parents. Until the gay movement, divorce was not something looked upon favorably. But for a same sex couple to be a family it requires a child be from a broken home. This is why, until the gay movement, single parents were not considered fit for adoption.", 
   {}, 
   433346, 
   null, 
   1309322940.0
  ], 
  [
   433407, 
   null, 
   "hwyangel", 
   "I fully realize that there are heterosexual couples that have children out of wedlock, or get divorced. And the child is the one who suffer, as well as the effects this has on society as a whole. But is it just? Is it fair? Is what we want to promote to society as a \"right\" for everyone to do?", 
   {}, 
   433405, 
   null, 
   1309324320.0
  ], 
  [
   433412, 
   null, 
   "Provocateaur", 
   "The children being raised by gay or lesbian couples aren't necessarily from a broken home. They just had a sperm or a uterus donor/renter.\n \n Adoption and marriage would make child support mandatory. Were one to be in a real marriage, wouldn't it help encourage the non-biological parent to adopt the child?\n \n Maybe the solution is better laws to protect children. I don't see how throwing out one type of family, because the parents are the same sex, will accomplish this.\n \n Do you really think that divorce was a nod to gay rights(in general), hwyangel? I doubt it. Because two things happened in roughly the same time period doesn't necessarily mean one caused the other. That's a logical fallacy. Because a heterosexual married couple was forced to live under the same roof, does not mean it was a functional family.", 
   {}, 
   433407, 
   null, 
   1309327440.0
  ], 
  [
   433419, 
   null, 
   "pappillion001", 
   "Here it is again. \n\n \n And it makes as little sense as it did the first time \n \n \nHow is a same sex marriage going to be \"responsible\"? \n \n\n \n The same way opposite sex parents would be. \n Same sex couples will have kids one of three ways. Adopt, one will already have a child from a prior relationship or artificially/donor/surragate. \n If their state allows marriage and they are married or if their state allows second parent adoption then the non bio parent adopts and both are legal parents no different than straight people. If their state does not allow these options then only the biological parent is responsible which is the same for straight couples. If the husband is not the father guess what it doesn't matter if they have been married 17 years or 7 months he isn't financially responsible. \n \n \n \nObviously child support will still be the responsibility of the biological parents. \n \n \n \n Unless adoption occurs then both are and that is for same sex and opposite sex couples. \n \n \nUntil the gay movement, divorce was not something looked upon favorably. \n \n \n It still isn't. It just happens so often that people have become numb to it. The expectation is that a marriage will fail as most do and most people now are either an ex or child of an ex. It isn't gays that have caused greater acceptance of divorce it is straight people who divorce more than marry. After all gays have not been able to marry how can they be at fault for divorce?\n \n \n \nBut for a same sex couple to be a family it requires a child be from a broken home. \n\n \n Talk radio steering you wrong again. Same sex couples can make brand new people same as kind and model as straight people. A child can come from a broken home as is the case for both couples but there is no requirement that the child come from a broken home.\n \n But let us say that is true or the majority will come from foster care. For someone who says they want to protect children your desire is to keep them in foster care where statistically they will grow up and fail to successfully integrate into society. Foster cares lengthy record on being just a step above being on the streets is far superior to the research showing gay couples for the most part make at least mediocre if not good parents. \n Why is that?\n \n \nThis is why, until the gay movement, single parents were not considered fit for adoption.\n\n \n I see it is gay people (the ones who can't have kids) who have flooded the foster care system necessitating the need to broaden its pool of potential parents to handle the increasing number of kids entering into the program. \n \n And foster care is preferred over single parent adoptions because one social worker for every 20 - 100 kids who is overworked and underpaid and has kids of their own to worry about is much better for than a single parent adopting 1 child.\n \n Does that about sum up your position or am I not understanding you correctly?", 
   {}, 
   433405, 
   null, 
   1309340280.0
  ], 
  [
   433420, 
   null, 
   "pappillion001", 
   "I fully realize that there are heterosexual couples that have children out of wedlock, or get divorced. And the child is the one who suffer, as well as the effects this has on society as a whole. But is it just? Is it fair? Is what we want to promote to society as a \"right\" for everyone to do?\n\n \n I don't follow what you are saying here.", 
   {}, 
   433407, 
   null, 
   1309340460.0
  ], 
  [
   433421, 
   null, 
   "hwyangel", 
   "· 63% of youth suicides are from fatherless homes. · 85% of all children that exhibit behavioural disorders come from fatherless homes. · 80% of rapists motivated with displaced anger come from fatherless homes. · 71% of all high school dropouts come from fatherless homes. · 75% of all adolescent patients in drug abuse centres come from fatherless homes. · 85% of all youths sitting in prisons grew up in a fatherless home.", 
   {}, 
   433412, 
   null, 
   1309341060.0
  ], 
  [
   433422, 
   null, 
   "hwyangel", 
   "Children from a previous home will obviously be from a broken home. Either by divorce or abandonment. This would require financial restitution from the absent parent as well as other restrictions. \n An adopted child, and adoption is honorable, would be the ressponsibility of the adoptive parent. The \"partner\" is not required to adopt, and their is no guarantee they will accept this respodsibility. \n artificial insemination, same thing. \n Child will have one parent and one step parent.", 
   {}, 
   433421, 
   null, 
   1309343100.0
  ], 
  [
   433423, 
   null, 
   "Freedom", 
   "· 63% of youth suicides are from fatherless homes. · 85% of all children that exhibit behavioural disorders come from fatherless homes. · 80% of rapists motivated with displaced anger come from fatherless homes. · 71% of all high school dropouts come from fatherless homes. · 75% of all adolescent patients in drug abuse centres come from fatherless homes. · 85% of all youths sitting in prisons grew up in a fatherless home.\n\n Perhaps you should have had statistics from motherless homes because males are +2 fathers and females don't even meet your criteria of unable to have biological offspring.\n \n If an extra 35% of imprisoned persons are from fatherless homes does that mean homes with two fathers will represent only 15% of the prison population?\n \n \nChildren from a previous home will obviously be from a broken home. Either by divorce or abandonment. This would require financial restitution from the absent parent as well as other restrictions. \n An adopted child, and adoption is honorable, would be the ressponsibility of the adoptive parent. The \"partner\" is not required to adopt, and their is no guarantee they will accept this respodsibility. \n artificial insemination, same thing. \n Child will have one parent and one step parent.\n\n The premise of adoption is that someone who did not donate genes is taking on the responsibility of parenthood. You can't possibly believe that adoption agencies run on the premise of ongoing support from biological parents who by definition are abandoning the child, probably because of death or insufficient resources, or even because they don't give a damn.\n \n The 'partner' can very well adopt just as much as the other; are you implying that the signature of some contract perfectly reflects intentions and what makes you think two people can't sign adoption papers?", 
   {}, 
   433422, 
   null, 
   1309344660.0
  ], 
  [
   433424, 
   null, 
   "hwyangel", 
   "Adoption is a very honorable and loving thing to do. I'm not debating that at all. Divorce and abandonment is a tragedy. Even as honorable as step parenting may be I do not support it as an equal or sought after thing situation to be promoted in favor of parents being responsible and keeping their families together.", 
   {}, 
   433423, 
   null, 
   1309347360.0
  ], 
  [
   433426, 
   null, 
   "hwyangel", 
   "I would support same sex marriage under \n #1 Stricter policies for obtaining a divorce with a probation period that includes both homo and hetro. (In other words no one can get a divorce and remarry the next day)\n #2 No single parent adoptions. This goes for artificial insemenation too.\n #3 No minister, bishop, or religious leader can be forced, or sued to perform a marriage against their beliefs. \n (Ministers often refuse to marry heterosexual couples who are living in sin or refuse premarrital counciling)", 
   {}, 
   433424, 
   null, 
   1309349820.0
  ], 
  [
   433452, 
   null, 
   "Freedom", 
   "I would support same sex marriage under \n #1 Stricter policies for obtaining a divorce with a probation period that includes both homo and hetro. (In other words no one can get a divorce and remarry the next day)\n #2 No single parent adoptions. This goes for artificial insemenation too.\n #3 No minister, bishop, or religious leader can be forced, or sued to perform a marriage against their beliefs. \n (Ministers often refuse to marry heterosexual couples who are living in sin or refuse premarrital counciling)\n\n That sounds reasonable except for the fact that you imply that allowing more potential parents into the loop is bad for children, adoption agencies ought to have an excess of parents and choose the best for the child amongst them. That means singles should be included as a plan B.", 
   {}, 
   433426, 
   null, 
   1309385160.0
  ], 
  [
   433458, 
   null, 
   "Jo Bennett", 
   "· 63% of youth suicides are from fatherless homes. · 85% of all children that exhibit behavioural disorders come from fatherless homes. · 80% of rapists motivated with displaced anger come from fatherless homes. · 71% of all high school dropouts come from fatherless homes. · 75% of all adolescent patients in drug abuse centres come from fatherless homes. · 85% of all youths sitting in prisons grew up in a fatherless home.\n\n \n And how do all these correlate with poverty? You're highlighting a correlation, but my suspicion is that the causation has more to do with a lack of time from a single parent forced to work all hours to make enough money to support a family, rather than the lack of a particularly gendered parent. If you want to demonstrate that gay couples are bad parents you might want to cite some information about gay couples rather than another situation that is totally different.", 
   {}, 
   433421, 
   null, 
   1309388580.0
  ], 
  [
   433479, 
   null, 
   "Provocateaur", 
   "Oh my, my, my, Freedom and E_Mutz. I just looked back at your replies to me.\n \n I think you missed my point. Discrimination of all sorts, is indeed putting labels and stereotypical assumptions on people. However, it's more than that. It's also people being in a position of power to feel justified putting those negative attitudes into action. The power could be in terms of numbers or social position.\n \n Gays experienced this during Prop. 8 in California, and in other votes over rights issues. Matt was saying that perhaps one day the tables could turn, and perhaps right-wing Christians, or Mormons, could have their rights voted away by a simple fifty per cent plus one, majority. Matt said he would vote against their rights, as they had used their power against his.\n \n Now, we have several people on here, quickly showing their outrage against this potential prospect. Some of them don't bother to lend much, if any support to gay rights in this forum(shooter and proud is the exception). For gays it's not a theory, it's reality. I'd say what Matt has merely proposed when it comes to the rights of others, gives you or them a small inkling of what we feel, when the theory is put into practice, but that may be too generous.\n \n So yes, perhaps Matt was just getting you to think and react to show how unjust this notion is when it's your rights up for a vote.", 
   {}, 
   433313, 
   null, 
   1309416780.0
  ], 
  [
   433481, 
   null, 
   "Freedom", 
   "I think you missed my point. Discrimination of all sorts, is indeed putting labels and stereotypical assumptions on people. However, it's more than that. It's also people being in a position of power to feel justified putting those negative attitudes into action. The power could be in terms of numbers or social position.\n\n ???\n \n \nMatt was saying that perhaps one day the tables could turn, and perhaps right-wing Christians, or Mormons, could have their rights voted away by a simple fifty per cent plus one, majority. Matt said he would vote against their rights, as they had used their power against his.\n\n If he has just said the first part, I would be cheering him on, but the last part proves that the first part was not an illustration of a morally unacceptable situation but his hope at getting revenge on an abstract collective. If he had left any avenue to interpret his statements as morally sound I would not have condemned them. He however explicitly expressed his desire to violate rights, not merely illustrate that the system allows such violation.\n \n \nNow, we have several people on here, quickly showing their outrage against this potential prospect.\n\n As far as I express emotion on this forum, this is nothing new. I do not like the violation of rights and I object to their advocation in all circumstances and from all advocates.\n \n \nSome of them don't bother to lend much, if any support to gay rights in this forum(shooter and proud is the exception). \n\n If homosexuals are human, I have defended their rights as strenuously as possible.\n \n \nFor gays it's not a theory, it's reality.\n\n It's reality for us all, except those who are deluded into thinking they chose choicelessness.\n \n \nI'd say what Matt has merely proposed when it comes to the rights of others, gives you or them a small inkling of what we feel\n\n Perhaps you feel outrage at the subjectivist fallacies that would claim that there is no truth, that the next best thing is the will of the majority. Perhaps you know that there is a moral truth even if you don't know exactly how to describe it, and you know that no matter how many people in the world ignore or deny it; it's there and it validates your actions not by social acceptance but by something more fundamental; something natural to humanity.\n \n If that is what you feel, then yes I have felt it; throughout the ages those who have had their rights violated have felt it. It is their value system which produces these emotions, it is recognition of this value system which demands men respect the rights of others.\n \n Too many homosexuals desperate for philosophical backing have been drawn to a most despicable current based on non-judgement. It advocates the immunization from the disapproval of others through the suspension of thought (for to think is to judge). This prompts them to ask 'who are you to judge me?' The answer I give is 'a person', but a counter-question cuts deeper into the fallacy. \"Who are you to judge yourself?\"\n \n Judgement is not the evil here. Remember that feeling I was just talking about, well there is a philosophy that claims you can know what it's about, where it comes from, claims that not only can you control it but once you understand where emotions come from they are not even forces you need to fight against in a struggle for peace, resolve, or self-control. It claims you can know moral truth not just feel it. That is the philosophical backing homosexuals (as a instance of the category human) need, their emotion is a poor argument, but their is reasoning which can be brought to bear.\n \n So do not pretend that the insignificant difference of sexual orientation has somehow magically made you so unique that you now face problems alien the human race that the 'rest of us' need to be made to understand. \n \n \nSo yes, perhaps Matt was just getting you to think and react to show how unjust this notion is when it's your rights up for a vote.\n\n .... but my rights are up for a vote, and I have been crusading to expose it's injustice.", 
   {}, 
   433479, 
   null, 
   1309419780.0
  ], 
  [
   433483, 
   null, 
   "pappillion001", 
   "· 63% of youth suicides are from fatherless homes. · 85% of all children that exhibit behavioural disorders come from fatherless homes. · 80% of rapists motivated with displaced anger come from fatherless homes. · 71% of all high school dropouts come from fatherless homes. · 75% of all adolescent patients in drug abuse centres come from fatherless homes. · 85% of all youths sitting in prisons grew up in a fatherless home.\n\n \n You do realize the site you pulled this from has no other purpose than to try and show the importance of fathers in a family. Which I would agree is important, but the information is presented not in a manner that attempts to identify various cause and effect relationships that result in the stats, but to place emphasis on one possible reason which they support.\n \n This was one of the more noticable instances of manipulating the facts. The place where your website got it's facts is here\n \n Fathers & Families | The Father Factor - Data on the Consequences of Father Absence\n \n Which goes under various version of The Fatherhood Initiative. This was part of their report\n \n Father Factor in Child Abuse\n \n \n An analysis of child abuse cases in a nationally representative sample of 42 counties found that children from single-parent families are more likely to be victims of physical and sexual abuse than children who live with both biological parents. Compared to their peers living with both parents, children in single parent homes had:\n a 77% greater risk of being physically abused\n an 87% greater risk of being harmed by physical neglect\n a 165% greater risk of experiencing notable physical neglect\n a 74% greater risk of suffering from emotional neglect\n an 80% greater risk of suffering serious injury as a result of abuse\n overall, a 120% greater risk of being endangered by some type of child abuse.\n Source: Sedlak, Andrea J. and Diane D. Broadhurst. The Third National Incidence Study of Child Abuse and Neglect: Final Report. U.S. Department of Health and Human Services. National Center on Child Abuse and Neglect. Washington, D.C., September 1996.\n \n Things I found most interesting as I read through the information is A) Women are not fit to raise children. From the information provided I don't see how we have achieved the level of civilization we have considering the considerable damage children suffer when left alone with mothers. \n B) The ability to raise wonder children by men seems to only be possible with their biological children. When rearing someone else's child they have little impact. The only rational conclusion is that the damage a mother causes is immediate and irreversible. C) I noticed two other odd things for the few dozen stats offered almost none came from a source more than once and there were stats with numbers like 165% and 220%. \n \n I felt perhaps women were not being fairly represented and maybe the site dedicated to fathers was just expressing themselves passionately, but not accurately. I went to the source they cited for the above stats and it stated the following \n \n Family Structure. Children of single parents were at higher risk of physical abuse and of all types of neglect and were overrepresented among seriously injured, moderately injured, and endangered children. Compared with their counterparts living with both parents, children in single-parent families had\n \n a 77-percent greater risk of being harmed by physical abuse (using the stringent Harm Standard) and a 63-percent greater risk of experiencing any countable physical abuse (using the Endangerment Standard);\n an 87-percent greater risk of being harmed by physical neglect and a 165-percent greater risk of experiencing any countable physical neglect;\n a 74-percent greater risk of being harmed by emotional neglect and a 64-percent greater risk of experiencing any countable emotional neglect;\n a 220-percent (or more than three times) greater risk of being educationally neglected;\n an approximately 80-percent greater risk of suffering serious injury or harm from abuse or neglect;\n an approximately 90-percent greater risk of receiving moderate injury or harm as a result of child maltreatment; and\n a 120-percent (or more than two times) greater risk of being endangered by some type of child abuse or neglect.\n \n Among children in single-parent households, those living with only their fathers were approximately one and two-thirds times more likely to be physically abused than those living with only their mothers.\n \n Although parents are not necessarily, nor even most frequently, the perpetrators of maltreatment, the relationship between parent structure and maltreatment incidence is understandable, considering the added responsibilities and stresses of single-parenting together with the likelihood that surrounding social and practical support may be inadequate.\n \n Family Size. The incidence of maltreatment was related to the number of dependent children in the family, especially in the categories of physical and educational neglect. For educational neglect, and for physical neglect according to the Harm Standard, the pattern was nonlinear: the incidence rates were highest for children in the largest families (those with four or more children), intermediate for \"only\" children, and lowest for children in families with two to three children. Children in the largest families were almost three times more likely to be educationally neglected, and nearly two and two-fifths times more likely to be physically neglected under the Harm Standard, compared to children in families with two or three children. Under the Endangerment Standard, the pattern was one of increasing incidence of physical neglect with greater numbers of children. Children in the largest families were physically neglected at nearly three times the rate of those who came from \"only\" child families.\n \n Additional children in a household mean additional tasks and responsibilities, so it is understandable why incidence rates of child abuse and neglect may be higher when there are more children. Accounting for why \"only\" children have higher rates of educational neglect and of physical neglect under the Harm Standard than children in families with two or three children requires a different explanation. One possibility is that there may be too many expectations focused on \"only\" children, whereas expectations (and disappointments) are diffused over multiple children in the larger families. Another possibility is that many \"only\" child households represent the early stages in their families' development, since a number of these families will have additional children, in time. Thus, many \"only\" children are in families with relatively young and inexperienced parents and caretakers.\n \n Executive Summary of the Third National Incidence Study of Child Abuse and Neglect\n \n As you can see they seemed to have left out some rather important details that were not consistent with their purpose.\n \n I would also point out that a lot of your stats include not just fatherless homes, but children of no parent homes as well. Foster care stats are horrible especially when they just turn 18 and are on their own. \n \n And lastly what does this have to do with same sex marriage? I mean your sort of putting the cart before the horse. Sure there will be children involved but let's not forget it won't be for a large part of them and for those that do these stats are for straight people. Gay people are different as evidenced by their inability to marry in the first place.", 
   {}, 
   433421, 
   null, 
   1309422120.0
  ], 
  [
   433484, 
   null, 
   "pappillion001", 
   "I would support same sex marriage under \n #1 Stricter policies for obtaining a divorce with a probation period that includes both homo and hetro. (In other words no one can get a divorce and remarry the next day)\n #2 No single parent adoptions. This goes for artificial insemenation too.\n #3 No minister, bishop, or religious leader can be forced, or sued to perform a marriage against their beliefs. \n (Ministers often refuse to marry heterosexual couples who are living in sin or refuse premarrital counciling)\n\n \n Well surprise your pretty much there. Other than illegal marriages (bigamy, force etc.) most states don't have same day divorce services. Single parent adoptions in this situation is not necessarily a single person, but a single biological parent allowing their partner to adopt to hold joint custody comparable to an MF couple. I would think this preferable to single parent as to do so doubles the potential resources available for the child. In this circumstance gays get treated the same os straights sign on the dotted line and your on the hook no if's and's or but's. It is possible and I don't support religion being forced to act against itself (as long as it restricts itself to itself. Meaning if religion thinks a gay relationship is a sin then they should not get involved in one, but there is no place for the unwanted insistence that everybody must follow that belief) And yes when I got married the priest felt my first communion wasn't good enough and so I waited while my wife went up to receive it during our wedding, but hey his church his rules.", 
   {}, 
   433426, 
   null, 
   1309422900.0
  ], 
  [
   433485, 
   null, 
   "Provocateaur", 
   "So you are saying that most gays would not use their vote against institutions that condemn homosexuality?\n Do I need to talk to every homosexual to not to doubt it? \n \n \n \n \n Soon IS a relative term.I am surprised you did not realise it.\n \n \n \n Oh dear..the criticise gay = prejudice BS again.\n Dont you tire of this ' poor me' argument? I doubt you ever will.\n A preacher being arrested in the Uk for preaching gay sex is a sin and a pub being picketed and the landlord arrested for ejecting gay men kissing in a bar plus other incidents tells me what I need to know about the subject.\n\n \n Why don't you talk to a prominent gay activist(possibly the most prominent) in the UK, who defended the street preacher---\n Charges Dropped Against Anti-Gay U.K. Street Preacher :: EDGE Boston\n \n Notice how the gay officer wasn't the one who made the arrest. Also, was the preacher charged for his anti-gay speech, or under the anti-hooliganism law, since the police said he was being loud? Although he said he wasn't loud. I think anyone who goes out there on the street, speaking out against any group or political issue, runs the risk of bothering people going about their daily business. They have to be very careful, even for their own safety. For all we know, the ones who complained were not gay. \n \n Yes, \"criticizing\" gays as you call it, is anti-gay, when you don't have a logical argument. You're the one playing a false victim. As with the bar situation, and the government-funded adoption agency in Illinois, not being allowed to discriminate, does not make you a victim. The laws are supposed to protect, and apply to everyone equally, yes, including gay people. Laws are sometimes put to the test. In this case of the street preacher, perhaps the police were being too \"heavy handed\", in applying it. I hope they now will recognize everyone has this basic freedom of expression, to attack abstract others, anywhere. Wait a minute, no one but an anti-gay right-wing Christian would be rude and mundane enough to be out there on the street, bothering people going about their daily business, about the supposed threat gays pose. But in theory, others could do the same thing and against Christians or anyone else.", 
   {}, 
   433300, 
   null, 
   1309425180.0
  ], 
  [
   433489, 
   null, 
   "Matthew S", 
   "\n \n (Ministers often refuse to marry heterosexual couples who are living in sin or refuse premarrital counciling)\n\n \n Exactly which is why marriage does not and should not require religious input. You go down to the court house and have a civil ceremony. Marriage has absolutely nothing to do with children. If two 100 year old heteros, who have no intention of and will not be breeding, can get a civil marriage license then there is no reason to deny a civil marriage license to two men or two women.", 
   {}, 
   433426, 
   null, 
   1309440120.0
  ], 
  [
   433508, 
   null, 
   "gansao", 
   "Why don't you talk to a prominent gay activist(possibly the most prominent) in the UK, who defended the street preacher---\n Charges Dropped Against Anti-Gay U.K. Street Preacher :: EDGE Boston\n \n Notice how the gay officer wasn't the one who made the arrest. Also, was the preacher charged for his anti-gay speech, or under the anti-hooliganism law, since the police said he was being loud? Although he said he wasn't loud. I think anyone who goes out there on the street, speaking out against any group or political issue, runs the risk of bothering people going about their daily business. They have to be very careful, even for their own safety. For all we know, the ones who complained were not gay. \n \n Yes, \"criticizing\" gays as you call it, is anti-gay, when you don't have a logical argument. You're the one playing a false victim. As with the bar situation, and the government-funded adoption agency in Illinois, not being allowed to discriminate, does not make you a victim. The laws are supposed to protect, and apply to everyone equally, yes, including gay people. Laws are sometimes put to the test. In this case of the street preacher, perhaps the police were being too \"heavy handed\", in applying it. I hope they now will recognize everyone has this basic freedom of expression, to attack abstract others, anywhere. Wait a minute, no one but an anti-gay right-wing Christian would be rude and mundane enough to be out there on the street, bothering people going about their daily business, about the supposed threat gays pose. But in theory, others could do the same thing and against Christians or anyone else.\n\n \n Ah Peter Tatchell..he who campaigns for the age of consent to be 14 years old.\n Yes I know about him and I admire him in many ways but not I that one.\n He was arrested because he said homosexuality was a crime against the creator..he was arrested for criticising gays.\n Even Tatchell recognised that .\n The offence that he was arrested for therefore was trumped up..thank you exposing this.", 
   {}, 
   433485, 
   null, 
   1309469580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  \"I now support full marriage equality\"", 
  "url": "http://www.4forums.com/political/gay-rights-debates/15258-i-now-support-full-marriage-equality.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 15258, 
  "discussion_files": [
   [
    "11028.html", 
    "http://www.4forums.com/political/gay-rights-debates/15258-i-now-support-full-marriage-equality-print.html"
   ], 
   [
    "11029.html", 
    "http://www.4forums.com/political/gay-rights-debates/15258-i-now-support-full-marriage-equality-9-print.html"
   ], 
   [
    "11030.html", 
    "http://www.4forums.com/political/gay-rights-debates/15258-i-now-support-full-marriage-equality-7-print.html"
   ], 
   [
    "11031.html", 
    "http://www.4forums.com/political/gay-rights-debates/15258-i-now-support-full-marriage-equality-5-print.html"
   ], 
   [
    "11032.html", 
    "http://www.4forums.com/political/gay-rights-debates/15258-i-now-support-full-marriage-equality-4-print.html"
   ], 
   [
    "11033.html", 
    "http://www.4forums.com/political/gay-rights-debates/15258-i-now-support-full-marriage-equality-6-print.html"
   ], 
   [
    "11034.html", 
    "http://www.4forums.com/political/gay-rights-debates/15258-i-now-support-full-marriage-equality-8-print.html"
   ], 
   [
    "11035.html", 
    "http://www.4forums.com/political/gay-rights-debates/15258-i-now-support-full-marriage-equality-3-print.html"
   ], 
   [
    "11036.html", 
    "http://www.4forums.com/political/gay-rights-debates/15258-i-now-support-full-marriage-equality-2-print.html"
   ]
  ], 
  "identifier": 15258
 }
]