[
 [
  [
   427327, 
   null, 
   "JPSartre12", 
   "\n Obama unveils framework for cutting deficit by $4 trillion over 12 years \n \n By Zachary A. Goldfarb and Lori Montgomery, Wednesday, April 13, 1:48 PM\n \n President Obama unveiled a framework Wednesday to reduce borrowing over the next 12 years by $4 trillion &#8212; a goal that falls short of targets set by his deficit commission and House Republicans &#8212; and called for a new congressional commission to help develop a plan to get there. \n In his most ambitious effort to claim the mantle of deficit cutter, Obama proposed sharp new cuts to domestic and military spending, and an overhaul of the tax code that would raise fresh revenue. But he steered clear of fundamental changes to Medicare, Medicaid and Social Security &#8212; the primary drivers of future spending. \n Obama unveils framework for cutting deficit by $4 trillion over 12 years - The Washington Post \n\n \n It appears that Obama is pulling a Bill Clinton in hopes of being re-elected. ;)", 
   {
    "post_info": {
     "post_title": "Obama - Settling in under his new &quot;Fiscal Restraint&quot; Yoke"
    }
   }, 
   null, 
   null, 
   1302726240.0
  ], 
  [
   427336, 
   null, 
   "poet", 
   "It appears that Obama is pulling a Bill Clinton in hopes of being re-elected. ;)\n\n \n And? George W. Bush pulled a Richard Nixon, in hopes of being elected? So?\n \n http://www.huffingtonpost.com/2011/04/13/obama-debt-speech-_n_848446.html", 
   {}, 
   427327, 
   null, 
   1302737100.0
  ], 
  [
   427345, 
   null, 
   "sparetime", 
   "Using the Huffington Post as a source said all you needed to say here.", 
   {}, 
   427336, 
   null, 
   1302742200.0
  ], 
  [
   427351, 
   null, 
   "poet", 
   "Using the Huffington Post as a source said all you needed to say here.\n\n \n Really? Well, pardon me. \n \n Huffington Post\n Co-Founder & Editor-in-Chief: Arianna Huffington\n Chief Executive Officer: Eric Hippeau\n \n \n \n Editor: Roy Sekoff; Managing Editor: Jai Singh\n \n \n Political Editor: Thomas B. Edsall; Senior Editor: Willow Bay\n Senior Washington Correspondent: Daniel Froomkin; Executive Editor: Nico Pitney\n Senior Blog & Food Editor: Colin Sterling; Senior Locals Editor: Ashley McAdams \n Washington Bureau Chief: Ryan Grim,\n Senior Politics Editor: Howard Fineman, Business Editor: Peter Goodman\n Senior Style Editor: Anya Strzemien, Senior Media Editor: Danny Shea\n Managing Blog Editor: David Flumenbaum; Arts Editor: Kimberly Brooks\n World Editor: Cara Parks, Senior Living Editor: Alana B. Elias Kornfeld \n Entertainment Editor: Katy Hall, Divorce Editor: Sara Wilson\n Night Editor: Adam Rose; Senior Editor: Marcus Baram\n New York Editor: Jonah Green, Chicago Editor: Jennifer Sabella\n Denver Editor: Ethan Axelrod, Books Editor: Amy Hertz \n Technology Editor: Bianca Bosker, College Editor: Leah Finnegan\n Politics Editor: Whitney Snyder, Los Angeles Editor: Billy Silverman\n Travel Editor: Kate Auletta, Religion Editor: Paul Raushenbush \n Video Editor: Ben Craw, Video News Editor: Nicholas Graham\n Contributing Editor: David Weiner\n \n Senior Polling Editor: Mark Blumenthal, Associate Polling Editor: Emily Swanson\n \n Senior Editors at Large: Russell Bishop\n Wellness Editor: Dr. Patricia Fitzgerald; New York Editor at Large: Dan Collins\n Contributing Business Editor: Simon Johnson; Medical Editor: Dean Ornish, M.D.\n Medical Editor, Mental Health: Lloyd I. Sederer, M.D.\n Public Health Editor: Susan Blumenthal M.D.\n \n Medical Review Board: David Katz, M.D.,MPH, Mark Hyman, M.D., Rachel Naomi Remen, M.D., Mark D. Smith, M.D., MBA, Michael Roizen, M.D., Janet Taylor, M.D., MPH, William Sears, M.D.\n \n Associate News Editors: Jeff Muskus, TJ Ortenzi, Alexander Belenky, Carly Schwartz\n \n \n Associate Politics Editor: Elyse Siegel\n Associate Business Editor: Ryan McCarthy\n Associate Living Editor: Clay Chiles\n Associate Health Editor: Meghan Neal\n Associate Style Editor: Hilary Moss\n Associate Comedy Editor: Katla McGlynn\n Associate Sports Editor: Michael Klopman\n Associate Media Editor: Jack Mirkinson\n Associate Green Editor: Travis Donovan\n \n \n Deputy Blog Editor: Stuart Whatley\n \n \n Associate Blog Editors:Matt Sledge, Kerstin Picht, Sebastian Howard, Grace Kiser, Lila Shapiro, Gazelle Emami, Hallie Seegal\n \n \n Reporters: Jason Linkins, Sam Stein, Arthur Delaney, Amanda Terkel, Shahien Nasiripour, Chris Kirkham, Laura Bassett\n \n Writer/Researcher: Nicholas Wing, William Alden, Amy Lee\n \n Traffic Editor: Craig Kanalley, Social Media Editor: Rob Fishman\n \n Associate Social News Editor: Rebecca Harrington\n \n \n Associate Video Editor: Hunter Stuart\n \n \n \n Editor at Large: Nora Ephron\n \n \n The Huffington Post is an American news website and content aggregating blog founded by Arianna Huffington, Kenneth Lerer, and Jonah Peretti, featuring various news sources and columnists.[2] The site offers coverage of politics, media, business, entertainment, living, style, the green movement, world news, and comedy, and has news, blogs, and original content. The Huffington Post was launched on May 9, 2005, as a commentary outlet and alternative to news websites like the Drudge Report.[3] On February 7, 2011, AOL acquired The Huffington Post for US$315 million making Arianna Huffington editor-in-chief of The Huffington Post Media Group\n \n \n The Huffington Post - Wikipedia, the free encyclopedia\n Contributors\n In addition to columns by Arianna Huffington and a core group of contributors such as John Conyers, Harry Shearer and Roy Sekoff, The Huffington Post has over 3,000 bloggers-from politicians and celebrities to academics and policy experts-who contribute in real time on a wide-range of topics.\n \n Celebrities are allowed to post blogs on the site, and a number have opted to do so over the years. In many cases, such as Robert Reich, the content posted to The Huffington Post, the content is cross-posted among multiple sites.[13]\n \n The site also publishes columns by specialists in a wide range of fields such as Alice Waters on food, Doctor Harold Katz on dental health, Suzie Heumann on sex, Diane Ravitch on education, Jacob M. Appel on ethics, Auren Hoffman on business and politics, and Jon LaPook on medicine, and publishes scoops of current news stories and links to selected prominent news stories. Unlike other left-leaning blogs such as Znet or Daily Kos, The Huffington Post offers both news commentary and coverage.[citation needed]\n \n The Huffington Post's OffTheBus is a citizen-powered online news organization that is a collaboration between The Huffington Post, New York University (NYU), and Jay Rosen's NewAssignment.Net.[14][15] The Huffington Post's FundRace is a website that tracks contributions to the presidential campaigns and includes a mapping feature that shows contributions broken down by city, neighborhood, and block\n \n \n Personally, I don't think it gets any better than this.-poet", 
   {
    "unicode_changes_made": true
   }, 
   427345, 
   null, 
   1302744960.0
  ], 
  [
   427360, 
   null, 
   "daewoo", 
   "It appears that Obama is pulling a Bill Clinton in hopes of being re-elected. ;)\n\n \n Disagree. Clinton was a fiscal conservative with a plan from day one. Even Greenspan, who has worked with every president since Ford admired Clintons fiscal views and specifically his views on debt. I dont think there is any question but that Clinton was the most fiscally conservative president we have had in my lifetime. Back to greenspan, I think he captured the situation pretty well in his book when he said \"Reagan borrowed heavily from Clinton and Clinton had to pay it back\". \n \n The big difference is that Bill Clinton had a plan, and that plan made sense. Obama does not have a plan that makes sense.", 
   {}, 
   427327, 
   null, 
   1302757680.0
  ], 
  [
   427391, 
   null, 
   "jitobear", 
   "Disagree. Clinton was a fiscal conservative with a plan from day one. Even Greenspan, who has worked with every president since Ford admired Clintons fiscal views and specifically his views on debt. I dont think there is any question but that Clinton was the most fiscally conservative president we have had in my lifetime. Back to greenspan, I think he captured the situation pretty well in his book when he said \"Reagan borrowed heavily from Clinton and Clinton had to pay it back\". \n \n The big difference is that Bill Clinton had a plan, and that plan made sense. Obama does not have a plan that makes sense.\n\n \n That's it? I have been stoked to read your thoughts, rousing critique of yesterday's speach. You are the only individual I have encountered who can discuss economics and not put me to sleep.", 
   {}, 
   427360, 
   null, 
   1302812100.0
  ], 
  [
   427392, 
   null, 
   "daewoo", 
   "That's it? I have been stoked to read your thoughts, rousing critique of yesterday's speach. You are the only individual I have encountered who can discuss economics and not put me to sleep.\n\n \n I am still looking at numbers and figuring out how it all fits together. I should have a handle on it tonight, but will probably start a new thread (one geared solely toward the budget proposal).", 
   {}, 
   427391, 
   null, 
   1302816120.0
  ], 
  [
   427395, 
   null, 
   "poet", 
   "I am still looking at numbers and figuring out how it all fits together. I should have a handle on it tonight, but will probably start a new thread (one geared solely toward the budget proposal).\n\n \n Oh, no need. Apparently, it's a done deal. Never mind.\n Budget Deal Passes House Vote", 
   {}, 
   427392, 
   null, 
   1302824100.0
  ], 
  [
   427397, 
   null, 
   "daewoo", 
   "Oh, no need. Apparently, it's a done deal. Never mind.\n Budget Deal Passes House Vote\n\n \n We are talking about the long term budget plan he released a few days ago, not the deal to fund the government through the end of the fiscal year.\n \n Try to keep up.", 
   {}, 
   427395, 
   null, 
   1302832200.0
  ], 
  [
   427405, 
   null, 
   "poet", 
   "We are talking about the long term budget plan he released a few days ago, not the deal to fund the government through the end of the fiscal year.\n \n Try to keep up.\n\n \n Really? No one is interested in a plan from those who are responsible for the fiscal mess, in the first place. Tax cuts for the wealthy at the expense of seniors? Are you mad?", 
   {}, 
   427397, 
   null, 
   1302845340.0
  ], 
  [
   427410, 
   null, 
   "daewoo", 
   "Really? No one is interested in a plan from those who are responsible for the fiscal mess, in the first place. Tax cuts for the wealthy at the expense of seniors? Are you mad?\n\n \n Obamas plan. \n \n Click on the link in JPs post. There is a whole article about it. \n \n Why exactly are you here?? Are you just stalking JP? You sure as hell dont seem to have a clue when it comes to...well.....anything. \n \n Why are you here??", 
   {}, 
   427405, 
   null, 
   1302847740.0
  ], 
  [
   427423, 
   null, 
   "JPSartre12", 
   "Disagree. Clinton was a fiscal conservative with a plan from day one. Even Greenspan, who has worked with every president since Ford admired Clintons fiscal views and specifically his views on debt. I dont think there is any question but that Clinton was the most fiscally conservative president we have had in my lifetime. Back to greenspan, I think he captured the situation pretty well in his book when he said \"Reagan borrowed heavily from Clinton and Clinton had to pay it back\". \n \n The big difference is that Bill Clinton had a plan, and that plan made sense. Obama does not have a plan that makes sense.\n\n \n Clinton's fiscal plan was to gut the military and keep the Welfare state. The Republican Congress redirected his efforts and forced him to accept Welfare Reform.", 
   {}, 
   427360, 
   null, 
   1302871980.0
  ], 
  [
   427424, 
   null, 
   "JPSartre12", 
   "Obamas plan. \n \n Click on the link in JPs post. There is a whole article about it. \n \n Why exactly are you here?? Are you just stalking JP? You sure as hell dont seem to have a clue when it comes to...well.....anything. \n \n Why are you here??\n\n \n Ever hear of a self-appointed ankle-biter? ;)", 
   {}, 
   427410, 
   null, 
   1302872100.0
  ], 
  [
   427426, 
   null, 
   "poet", 
   "Obamas plan. \n \n Click on the link in JPs post. There is a whole article about it. \n \n Why exactly are you here?? Are you just stalking JP? You sure as hell dont seem to have a clue when it comes to...well.....anything. \n \n Why are you here??\n\n \n No...I won't click on JP's post. I'm completely familiar with JP's schtick and his bias. I'm an Obama supporter, for better or for worse. Any ridicule, insults, or \"finger pointing\" by you clueless and yes, evil conservatives, is easily dismissed as \"jealousy\" and partisanship, of the first order. Just cannot accept a \"black man\" in the Oval Office....\n \n Why am I here? Why do you want to know? Are you JP's keeper? Here you go, yet again, defending him. So much, for the rumor of him being \"a man\".", 
   {}, 
   427410, 
   null, 
   1302878220.0
  ], 
  [
   427427, 
   null, 
   "poet", 
   "Ever hear of a self-appointed ankle-biter? ;)\n\n \n In other words, \" a flea\", a nuisance, or an irritant. Please. You're not that important. I just \"found\" another forum, that could benefit from my liberal point of view, since all you've had in the past is a \"circle jerk\". Interesting...............that you can't say, here, all that you're thinking. You wouldn't want the forum to get the wrong impression, now would you? LOL", 
   {}, 
   427424, 
   null, 
   1302878460.0
  ], 
  [
   427431, 
   null, 
   "JPSartre12", 
   "In other words, \" a flea\", a nuisance, or an irritant. Please. You're not that important. I just \"found\" another forum, that could benefit from my liberal point of view, since all you've had in the past is a \"circle jerk\". Interesting...............that you can't say, here, all that you're thinking. You wouldn't want the forum to get the wrong impression, now would you? LOL\n\n \n I refuse to get into a XXXXXXX match with you on this forum. If you'd like to debate me, formally, I can arrange that quite easily. That way, we can see if your \"liberal point of view\" can prevail when it's stripped of personal attacks. \n \n I have a standing offer, made several years ago, to debate the spread of AIDS in the US. Maybe you'd like to pick up the banner and lead the charge for the Left? Or you could just sit on the porch while the big dogs walk down the street. ;)\n http://www.4forums.com/political/254376-post1.html", 
   {}, 
   427427, 
   null, 
   1302882360.0
  ], 
  [
   427434, 
   null, 
   "poet", 
   "I refuse to get into a XXXXXXX match with you on this forum. If you'd like to debate me, formally, I can arrange that quite easily. That way, we can see if your \"liberal point of view\" can prevail when it's stripped of personal attacks. \n \n I have a standing offer, made several years ago, to debate the spread of AIDS in the US. Maybe you'd like to pick up the banner and lead the charge for the Left? Or you could just sit on the porch while the big dogs walk down the street. ;)\n http://www.4forums.com/political/254376-post1.html\n\n \n LOL...but you didn't mind it one bit, to do so at the other forum? What's the matter? Don't want them to see your \"dark side\"?\n I already commented on your thread, such as it was.\n Big dogs???? I'm not entertained by the sight of dogs urinating.", 
   {}, 
   427431, 
   null, 
   1302883440.0
  ], 
  [
   427442, 
   null, 
   "JPSartre12", 
   "LOL...but you didn't mind it one bit, to do so at the other forum? What's the matter? Don't want them to see your \"dark side\"?\n I already commented on your thread, such as it was.\n Big dogs???? I'm not entertained by the sight of dogs urinating.\n\n \n This is a moderated forum and I have always respected that fact. Now, if you continue to follow me from forum to forum, please pick one that is unmoderated next time so I can tell you exactly what I think.", 
   {}, 
   427434, 
   null, 
   1302888180.0
  ], 
  [
   427447, 
   null, 
   "poet", 
   "This is a moderated forum and I have always respected that fact. Now, if you continue to follow me from forum to forum, please pick one that is unmoderated next time so I can tell you exactly what I think.\n\n \n Like I said, your fake persona, may have forum members here fooled, but those at TPA are hardly singing your praises. \n I initially came here, specifically to gloat...and unless the topics and the responses rise above the mundane and boring, I shan't be here for long, no doubt, to your delight. You told me, precisely what you thought, at TPA, and it got you banned. Since you have little control over your tongue, or keystrokes, others have to intervene. Not everyone is blessed with an I.Q. as high as yours. LOL.", 
   {}, 
   427442, 
   null, 
   1302890820.0
  ], 
  [
   427449, 
   null, 
   "JPSartre12", 
   "Like I said, your fake persona, may have forum members here fooled, but those at TPA are hardly singing your praises. \n I initially came here, specifically to gloat...and unless the topics and the responses rise above the mundane and boring, I shan't be here for long, no doubt, to your delight. You told me, precisely what you thought, at TPA, and it got you banned. Since you have little control over your tongue, or keystrokes, others have to intervene. Not everyone is blessed with an I.Q. as high as yours. LOL.\n\n \n So, I'll take that as a \"NO\", you don't want me to shred you in a formal debate, then?", 
   {}, 
   427447, 
   null, 
   1302891300.0
  ], 
  [
   427451, 
   null, 
   "poet", 
   "So, I'll take that as a \"NO\", you don't want me to shred you in a formal debate, then?\n\n \n Like you allegedly did, elsewhere? No, thanks. Why would I feed your inflated ego? You're the one who volunteered that you had an I.Q. of 140, yet, can't distinguish between your and \"you're\". No. Have your fans here believe that you can shred me and most anyone else in a \"formal debate\". No doubt, your prowess is legendary. I did what I came to do. Snap.", 
   {}, 
   427449, 
   null, 
   1302892080.0
  ], 
  [
   427459, 
   null, 
   "JPSartre12", 
   "Like you allegedly did, elsewhere? No, thanks. Why would I feed your inflated ego? You're the one who volunteered that you had an I.Q. of 140, yet, can't distinguish between your and \"you're\". No. Have your fans here believe that you can shred me and most anyone else in a \"formal debate\". No doubt, your prowess is legendary. I did what I came to do. Snap.\n\n \n I see, so let's be clear. You are AFRAID to debate me formally, so you will continue ad hominem attacks because you are unable to match me intellectually. Does that about sum it up?\n \n Make no mistake. Don't take my unwillingness to engage you here as a sign of weakness. Find an unmoderated forum and I will be happy to go medieval on your XXX. :xcensored", 
   {}, 
   427451, 
   null, 
   1302894540.0
  ], 
  [
   427476, 
   null, 
   "daewoo", 
   "Clinton's fiscal plan was to gut the military and keep the Welfare state. The Republican Congress redirected his efforts and forced him to accept Welfare Reform.\n\n \n Clintons plan when it came to the military was to let the joint chiefs write his budget...and they did. They literally got every penny they asked for.\n \n What they were trying to do was reorganize the military for what they perceived as a shift in warfare. They wanted fewer aircraft carriers and more special forces. Fewer main battle tanks, more rapid response vehicles (armored hummers, support helicopters, etc...). \n \n When Bush hit the white house he put a brake on all those changes and went back to building a military to re-fight WWII. Then we got into a modern engagement and find that our aircraft carriers and ships dont do us much good. Our main battle tanks are almost worthless. BUT, we need more special forces and rapid response vehicles. \n \n After blowing a couple trillion dollars on the WRONG stuff, Rumsfeld announced in the 6th year of the Bush presidency that they were going to look at revamping our military. If you look at the plan they put forth, parts of it were copied word for word from the Clinton plan. \n \n I did not like the VAST majority of Clintons policies...foreign or domestic...but when it came to his fiscal policies, the guy had his head on straight, and when it came to his military policy he was 100% correct. We dont need a military that is geared toward re-fighting WWII and total destruction of the enemy. We need a military that is geared toward fighting limited engagements and can get the job done quickly, quietly, and efficiently with an eye toward extremely limited collateral damage.\n \n Bush, Cheney, and Rumsfeld failed to understand what true force projection is. It is not just a matter of being able to show up with a trillion dollars worth of really cool military vehicles and gadgets. It is about being able to show up, wipe the floor with the other guy, and make it look easy. Their strategy in Afghanistan, which we now know the joint chiefs STRONGLY opposed, made us the laughing stock of the military world. What should have been a simple operation involving less than 2000 special forces soldiers to take down Bin Laden and AQ turned into a multi year, trillion dollar fiasco where we ended up destabilizing the entire region.", 
   {}, 
   427423, 
   null, 
   1302908040.0
  ], 
  [
   427487, 
   null, 
   "poet", 
   "I see, so let's be clear. You are AFRAID to debate me formally, so you will continue ad hominem attacks because you are unable to match me intellectually. Does that about sum it up?\n \n Make no mistake. Don't take my unwillingness to engage you here as a sign of weakness. Find an unmoderated forum and I will be happy to go medieval on your XXX. :xcensored\n\n \n Let's do be clear. Here, you're a moderator, with powers, to censor, ban, or manipulate. As I proved in TPA, you are not to be feared, on any level. The fact that I won't fall for your trap, in no way, signals that I fear you, am intimidated by you, or that I don't hold you with contempt and disgust. \n \n You are weak. You couldn't keep your cool, and decided to sign on as a sok, a clear violation of the TOS...they caught you and banned you. If you decide to return the favor, it wouldn't faze me in the slightest.\n \n \"Find an unmoderated forum\"????????? I thought you got that memo. Lincoln freed the slaves. Dream on.", 
   {}, 
   427459, 
   null, 
   1302914460.0
  ], 
  [
   427501, 
   null, 
   "JPSartre12", 
   "Clintons plan when it came to the military was to let the joint chiefs write his budget...and they did. They literally got every penny they asked for.\n\n \n The Army lost 100,000 soldiers between 1993-2001 and the military overall went from 1.7-1.3million.\n \n\n $453 billion &#8211; the average annual defense budget for the nine years before Clinton took office.\n $377 billion &#8211; the average annual defense budget during Clinton&#8217;s time in office, a 16.7% decrease.\n $496 billion &#8211; the average annual defense budget during Bush&#8217;s time in office, a whopping 31% increase not even including the campaigns in Iraq and Afghanistan, which are largely funded through supplementals not included in the official defense budget.\n \n Defense Spending: Reagan/Bush I vs. Clinton vs. Bush II TheZoo \n\n \n \n\n Measured in 1995 dollars, U.S. defense spending has declined from a Cold War high of around $375 billion in 1988 to around $265 billion in 1997, according to the Stockholm International Peace Research Institute (SIPRI). Defense spending for the USSR was around $260 billion in 1988. With the break up of the USSR, Russia's defense spending has declined to around $30 billion annually. Nevertheless, U.S. military leaders warned that funds were needed to fill alarming gaps in military readiness. \n Clinton's $124 Billion Defense Increase Jeopardizes Social Security, Medicare \n\n \n It wasn't until 1998, under the threat of impeachment, that Clinton agreed to a significant increase in the military budget .\n \n\n What they were trying to do was reorganize the military for what they perceived as a shift in warfare. They wanted fewer aircraft carriers and more special forces. Fewer main battle tanks, more rapid response vehicles (armored hummers, support helicopters, etc...). \n \n\n \n I haven't done enough research to argue that point with you.\n \n\n When Bush hit the white house he put a brake on all those changes and went back to building a military to re-fight WWII. Then we got into a modern engagement and find that our aircraft carriers and ships dont do us much good. Our main battle tanks are almost worthless. BUT, we need more special forces and rapid response vehicles. \n \n After blowing a couple trillion dollars on the WRONG stuff, Rumsfeld announced in the 6th year of the Bush presidency that they were going to look at revamping our military. If you look at the plan they put forth, parts of it were copied word for word from the Clinton plan. \n \n\n \n You're not trying to get me to defend GW's spending habits, are you? I've always said that he spent like a sailor on shore leave.\n \n\n I did not like the VAST majority of Clintons policies...foreign or domestic...but when it came to his fiscal policies, the guy had his head on straight, and when it came to his military policy he was 100% correct. We dont need a military that is geared toward re-fighting WWII and total destruction of the enemy. We need a military that is geared toward fighting limited engagements and can get the job done quickly, quietly, and efficiently with an eye toward extremely limited collateral damage.\n \n\n \n I would think that the Gulf Wars proved that the age of heavy armor is dead......against a superpower, but might be just the ticket if you have air superiority. \n \n\n Bush, Cheney, and Rumsfeld failed to understand what true force projection is. It is not just a matter of being able to show up with a trillion dollars worth of really cool military vehicles and gadgets. It is about being able to show up, wipe the floor with the other guy, and make it look easy. Their strategy in Afghanistan, which we now know the joint chiefs STRONGLY opposed, made us the laughing stock of the military world. What should have been a simple operation involving less than 2000 special forces soldiers to take down Bin Laden and AQ turned into a multi year, trillion dollar fiasco where we ended up destabilizing the entire region.\n\n \n I think you're over-simplifying the War in Afghanistan. Them thar mountains are a bitch to fight in. Ask the Russians.\n Heavy armor would be just the ticket in Libya, BTW.", 
   {}, 
   427476, 
   null, 
   1302927960.0
  ], 
  [
   427502, 
   null, 
   "JPSartre12", 
   "Let's do be clear. Here, you're a moderator, with powers, to censor, ban, or manipulate. As I proved in TPA, you are not to be feared, on any level. The fact that I won't fall for your trap, in no way, signals that I fear you, am intimidated by you, or that I don't hold you with contempt and disgust. \n\n \n I don't have the power to censor, ban or manipulate. The only forum that I can even edit posts is in the formal debate forum.\n \n\n You are weak. You couldn't keep your cool, and decided to sign on as a sok, a clear violation of the TOS...they caught you and banned you. If you decide to return the favor, it wouldn't faze me in the slightest.\n \n\n \n Revisionist history has always been your specialty. \n \n\n \"Find an unmoderated forum\"????????? I thought you got that memo. Lincoln freed the slaves. Dream on.\n\n \n Afraid of a formal debate and now afraid of an unmoderated one. I guess you'll just have to crawl back under the bridge.", 
   {}, 
   427487, 
   null, 
   1302928440.0
  ], 
  [
   427511, 
   null, 
   "daewoo", 
   "The Army lost 100,000 soldiers between 1993-2001 and the military overall went from 1.7-1.3million.\n \n \n It wasn't until 1998, under the threat of impeachment, that Clinton agreed to a significant increase in the military budget .\n\n \n I dont disagree that he cut military spending. I just dont think it is fair to categorize it as gutting the military when, in fact, the military got every single penny they asked for. \n \n The 9 years prior to Clinton included Reagan trying to build giant space lasers. The 9 years after included Bush builidng up conventional ground and naval forces in order to combat terrorism (still trying to figure that one out).\n \n When clinton hit office, he literally had the joint chiefs telling him that the military we had did not make sense in the modern world and they needed to downsize and refocus. On the other side you had lobbyists for defense contractors with a bunch of republican puppets. Further in the second article you post it says:\n \n \nFormer U.S. Defense Secretary Robert S. McNamara, and Lawrence J. Korb, an assistant secretary of defense during the Reagan administration, in their December 11, 1989 testimony before the Senate Budget Committee, stated that U.S. defense spending could safely be cut in half over the next five years. \n \n\n \n That was McNamara....one of the cheerleaders for giant space lasers and \"it does not matter what we spend we have to have more than the soviets\". \n \n That $453 billion that was spent in the 9 years before Clinton took office was cold war spending. Even after the soviet union fell, Bush Sr kept military spending at cold war era levels until they had demobilized and dismantled their military. \n \n So the only nation on the planet that had any hope of defeating the US was GONE...their military was dismantled. \n \n Clinton cut military spending by 16.5% and that was \"gutting\" the military? Even with his cuts, we were still spending substantially more than the rest of the world COMBINED. \n \n I am just not seeing any \"gutting\" going on there. \n \n \n \nI would think that the Gulf Wars proved that the age of heavy armor is dead......against a superpower, but might be just the ticket if you have air superiority. \n \n I think you're over-simplifying the War in Afghanistan. Them thar mountains are a bitch to fight in. Ask the Russians.\n Heavy armor would be just the ticket in Libya, BTW.\n\n \n \n Heavy armor is dead either way. Just the ticket in Libya? Libya has Milan anti tank missiles. They are a single shot solution to the Abrams. Rolling a $6.5 million tank into libya only to have it destroyed with a $8000 missile leaves you short of tanks pretty quick. \n \n That is the problem with armor in modern warfare. Tanks are GREAT if your enemy is going to come out and meet you in their tanks and you can shoot at each other. They are AWESOME for that. For pretty much everything else, they suck. We used them in vietnam to support/cover infantry. We cant even use them for that anymore since anti armor weapons are part of a squads standard weapons payload in pretty much every military in the world now. \n \n In Iraq we thought we could roll our tanks in with no problem since saddam had been under sanctions for so long, and the Iraq military pretty much blew all their anti tank weapons invading kuwait. Instead we have had a bunch of them destroyed by IEDs, RPGs (which we did not think could happen) and even heavy machine gun fire. There are just too many man portable weapons out there that can take out a tank for them to ever be worth a damn on a battlefield again. \n \n As far as the war in Afghanistan, here is what Richard Clarke had to say about it:\n \n \nThey put only 11,000 troops into Afghanistan. There are more police here in Manhattan. More in Manhattan than there are U.S. Troops in Afghanistan. The president botched the response. He should have gone after bin Laden. The U.S. Special Forces didn't get into the area where bin Laden was for two months! \n\n \n We knew where Bin Laden was prior to invading. We can put special forces on the ground anywhere on the planet earth in 18 hours, no exceptions. So why did they not get into the area for 2 months? Because they had them establishing beach heads for the \"main invasion\". They were planning a WWII invasion, not a realistic modern military action. \n \n You are 100% correct about trying to fight in the mountains of Afghanistan. Once Bin Laden fled to Tora Bora, there was no chance we were ever going to get him. \n \n That is what makes the Rumsfeld strategy in Afghanistan so mind numbingly stupid. In the early days of our invasion, Osama was in Jalalabad. We KNEW he was there. We knew his base of operations in Jalalabad was the Center for Islamic Studies. Up until the point that we started bombing and squandering our special forces by having them establish a WWII type beach head, the guy was LITERALLY giving public speeches in Jalalabad. \n \n Bush and Rumsfeld WANTED a protracted war in Afghanistan. They wanted a chance to show off what the US military could do. The Joint Special Operations Command wanted to send Tier 1 operators (Delta Force and DEVGRU) into Jalalabad to hunt down and either kill or capture bin laden while Tier 2 operators (Green Berets, 75th Rangers) provided support. \n \n We spend millions of dollars training those guys for exactly that mission. All we had to do was turn them loose. \n \n Instead we wanted a REAL war...one where we could show off the full might of the US military as a warning to others who might attack us.\n \n Instead we showed them what it looks like when America gets kicked in the nuts. We showed them that odds are they can attack us and then just stroll away while we are busy blowing up people who had nothing at all to do with it. We showed them that if they spent a few hundred thousand dollars attacking us, we would spend trillions of dollars flailing around like an epileptic with a sword.", 
   {}, 
   427501, 
   null, 
   1302937860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Obama - Settling in under his new \"Fiscal Restraint\" Yoke", 
  "url": "http://www.4forums.com/political/economics-debates/15264-obama-settling-under-his-new-fiscal-restraint-yoke.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 15264, 
  "discussion_files": [
   [
    "27009.html", 
    "http://www.4forums.com/political/economics-debates/15264-obama-settling-under-his-new-fiscal-restraint-yoke-print.html"
   ], 
   [
    "27010.html", 
    "http://www.4forums.com/political/economics-debates/15264-obama-settling-under-his-new-fiscal-restraint-yoke-2-print.html"
   ]
  ], 
  "identifier": 15264
 }
]