[
 [
  [
   428821, 
   null, 
   "sinjin", 
   "OBL shot in the head.", 
   {
    "post_info": {
     "post_title": "Go Seals"
    }
   }, 
   null, 
   null, 
   1304367060.0
  ], 
  [
   428836, 
   null, 
   "snakespit", 
   "Yay. Now what?\n \n Wait...I got it. How about we bring all our men and women in uniform home home. We end all government contracts with companies like Blackwater and Wackenhut, and offer them new contracts to rebuild our crumbling infrastructure here in the US. If nations like Iraq wish to keep contracts with Blackwater, etc...they foot the bill themselves. We streamline our military to a force that is efficient, well equipped, and readily mobilized for conflict or disaster both at home and abroad. We deal with threats harshly and totally as they present themselves, not preemptively with no clear goal or exit strategy. \n \n Just a few ideas.\n \n Late note: Just to be clear...I am proud of the fact that we killed that douchewaffle. However, I understand that it is a symbolic victory, and otherwise changes very little in the present or future of Islamic Extremism.", 
   {}, 
   428821, 
   null, 
   1304372220.0
  ], 
  [
   428872, 
   null, 
   "Easyrider", 
   "Yay. Now what?\n \n Wait...I got it. How about we bring all our men and women in uniform home home. We end all government contracts with companies like Blackwater and Wackenhut, and offer them new contracts to rebuild our crumbling infrastructure here in the US. If nations like Iraq wish to keep contracts with Blackwater, etc...they foot the bill themselves. We streamline our military to a force that is efficient, well equipped, and readily mobilized for conflict or disaster both at home and abroad. We deal with threats harshly and totally as they present themselves, not preemptively with no clear goal or exit strategy. \n \n Just a few ideas.\n\n \n Meanwhile, Al Qaeda reconstitutes themselves in Afghanistan and elsewhere, while the Taliban cuts women's noses off and, with Al Qaeda, trains more terrorists to kill Americans in the U.S. \n \n By the way, Rep. Peter King (R-NY) confirms it was waterboarding that led to the lead on the courier that led to Osama. So any flaming liberal that says waterboarding doesn't work is now officially a dunce.", 
   {}, 
   428836, 
   null, 
   1304389860.0
  ], 
  [
   428878, 
   null, 
   "Accipiter", 
   "Meanwhile, Al Qaeda reconstitutes themselves in Afghanistan and elsewhere, while the Taliban cuts women's noses off and, with Al Qaeda, trains more terrorists to kill Americans in the U.S. \n \n By the way, Rep. Peter King (R-NY) confirms it was waterboarding that led to the lead on the courier that led to Osama. So any flaming liberal that says waterboarding doesn't work is now officially a dunce.\n\n \n meaningless tripe", 
   {}, 
   428872, 
   null, 
   1304398320.0
  ], 
  [
   428923, 
   null, 
   "daewoo", 
   "Meanwhile, Al Qaeda reconstitutes themselves in Afghanistan and elsewhere, while the Taliban cuts women's noses off and, with Al Qaeda, trains more terrorists to kill Americans in the U.S. \n \n By the way, Rep. Peter King (R-NY) confirms it was waterboarding that led to the lead on the courier that led to Osama. So any flaming liberal that says waterboarding doesn't work is now officially a dunce.\n\n \n Whoops....looks like King was talking out his butt:\n \n Weigel : Feinstein: Information That Led to Bin Laden Didn't Come from Enhanced Interrogation\n \n\n Today, in a wide-ranging press conference, the chairwoman of the Senate Intelligence Committee said this wasn't true. Dianne Feinstein, who'd been briefed on exactly what happened on Sunday in Pakistan, said the breakthrough did not come from information gleaned at Gitmo or through enhanced interrogation -- ie, waterboarding.\n \n \"To the best of our knowledge,\" she said, \"based on a look, none of it came as a result of harsh interrogation techniques.\"\n\n \n If you look at what King is claiming specifically, it is dumb. He is claiming that several years ago we got information about a courier from KSM during a waterboarding session, and that is the information that led to Bin Laden being killed. \n \n First, there is nothing at all to make us think that the courier from several years ago was the same courier they followed to bin laden. In fact, it would be HIGHLY unlikely (and now we have sources in the intelligence world...folks who actually KNOW telling us not only is it unlikely, it is a flat out falsehood). Second, the courier we learned about from KSM we did not learn about because he broke under the torture and gave us a name or location. We \"learned\" about him because KSM refused to discuss the matter...even under torture...so our intel people decided it must be important. \n \n As far as \"flaming liberals\" who dont think waterboarding works being \"dunces\"...watch your mouth. That is the US military you are talking about. From day one the military has been careful to point out that the pictures, etc.. that depicted torture were taken in CIA run prisons and their soldiers were under the command of CIA officers. \n \n Our military does not torture, and they do not torture because it does not work and never has. \n \n If our intel agencies, politicians, and nitwits like yourself had stopped and LISTENED to the military, which actually has experience in these matters, it might not have taken us 10 years and 2.5 trillion to find Osama", 
   {}, 
   428872, 
   null, 
   1304460660.0
  ], 
  [
   428948, 
   null, 
   "Penfold", 
   "I see they sent in the same team that shot the hostage they were rescuing last year.", 
   {}, 
   428923, 
   null, 
   1304474700.0
  ], 
  [
   429032, 
   null, 
   "White Bread", 
   "Whoops....looks like King was talking out his butt:\n ...\n If you look at what King is claiming specifically, it is dumb. He is claiming that several years ago we got information about a courier from KSM during a waterboarding session, and that is the information that led to Bin Laden being killed. \n \n First, there is nothing at all to make us think that the courier from several years ago was the same courier they followed to bin laden. In fact, it would be HIGHLY unlikely (and now we have sources in the intelligence world...folks who actually KNOW telling us not only is it unlikely, it is a flat out falsehood). Second, the courier we learned about from KSM we did not learn about because he broke under the torture and gave us a name or location. We \"learned\" about him because KSM refused to discuss the matter...even under torture...so our intel people decided it must be important. \n \n As far as \"flaming liberals\" who dont think waterboarding works being \"dunces\"...watch your mouth. That is the US military you are talking about. From day one the military has been careful to point out that the pictures, etc.. that depicted torture were taken in CIA run prisons and their soldiers were under the command of CIA officers. \n \n Our military does not torture, and they do not torture because it does not work and never has. \n \n If our intel agencies, politicians, and nitwits like yourself had stopped and LISTENED to the military, which actually has experience in these matters, it might not have taken us 10 years and 2.5 trillion to find Osama\n\n \n If the liberal director of the CIA says that information obtained via waterboarding was part of the package, do you expect us to take Feinstein's word instead?", 
   {}, 
   428923, 
   null, 
   1304619960.0
  ], 
  [
   429099, 
   null, 
   "daewoo", 
   "If the liberal director of the CIA says that information obtained via waterboarding was part of the package, do you expect us to take Feinstein's word instead?\n\n \n Ok...if you dont like the head of the senate intelligence committee, how about the military interrogators that actually DID the waterboarding:\n \n Military interrogators: Waterboarding didn't yield tips that led to bin Laden - CSMonitor.com\n \n \nMilitary interrogators: Waterboarding didn't yield tips that led to bin Laden\n \n Several former military interrogators refute assertions that waterboarding and other 'enhanced' methods provided intelligence that led the US to bin Laden. Some lament lost opportunity to grill Al Qaeda's leader.\n\n \n \nA group of former US military interrogators are pushing back against the notion that Bush administration \"enhanced interrogation techniques\" - which many consider to be torture - led to the intelligence that helped US officials locate Al Qaeda leader Osama bin Laden.\n\n \n Why is the US military anti torture?\n \n \nIt is a misconception that ideologues don't talk, he says. \"The opinion that, 'Oh, he's such a fanatic, he won't tell us anything' - that's uninformed blathering by people who don't understand the business,\" Herrington adds. \"The experience with those who worked with Khalid Sheikh Mohammed and some of the other most senior terrorists is that they are narcissists and that they do want to talk - and talk and talk.\"\n \n The key, Herrington says, is to \"channel those long talking sessions where they begin to - inadvertently at first - reveal things that are useful. All the while he's talking, he's telling us things that he doesn't think are important, but they are.\"\n \n That requires building relationships - a process that is hampered, not helped, by practices such as \"slapping someone in the face and stripping them naked,\" he adds.\n\n \n \n\"We are concerned about the suggestion by some that the use of waterboarding and other enhanced interrogation techniques led US forces to Osama bin Laden's compound,\" reads the statement, signed by four former military and FBI interrogators, including Herrington.\n\n \n \nThe interrogators assert that Mr. Mohammed and others \"did not divulge the nom de guerre of a courier during torture, but rather several months later, when they were questioned by interrogators who did not use abusive techniques.\"\n\n \n These are the people who were there...the guys who questioned him.\n \n This has always been my objection to torturing prisoners. I dont care if it is cruel or inhumane....we are talking about war here. We are blowing kids up. It does not matter if we are mean to prisoners. My objection is that it DOES NOT WORK. It was never sanctioned by the military, it was ordered by a bunch of political appointees who did not know what they were doing. You can say a lot about or military, much of it bad, and most of the bad stuff is probably true, but they are PROFESSIONALS. The guys who make the rules about whether or not we torture are guys with decades of experience and the best military education on the planet. THEY KNOW WHAT THEY ARE DOING. From the minute it leaked out that we were torturing people, the military came out and said THIS IS A BAD IDEA. They knew there would be blowback against our troops. They knew that we would not get good information from the process. \n \n Look at Ibn al-Shaykh al-Libi. He was captured, tortured, and eventually provided the link that the Bush administration was looking for between Saddam Hussein and AQ. He told interrogators that Saddam had provided WMD training and support to AQ.....a fact that turned out to be 100% false. The Defense Intelligence Agency told the Bush administration THEN that it was probably not true, and that when you torture somebody they will tell you anything they think you want to hear to make it stop. The Bush administration pushed ahead, using the \"intelligence\" they got from the guy to push for the war in Iraq. Course....even after they KNEW the information was false they STILL used it, so it may just be that the Bush administration was a bunch of swine. \n \n Of course then he was a MAJOR embarrassment to the Bush administration, so they transferred him to libya, even though they knew the libyans were going to kill him. \n \n If torturing people worked, I would probably be FOR it, as long as it was limited to non citizens. But it DOES NOT WORK. It leads to BAD intel, which is worse than NO intel. BAD intel gets people killed and wastes huge amounts of money.", 
   {
    "unicode_changes_made": true
   }, 
   429032, 
   null, 
   1304658480.0
  ], 
  [
   429100, 
   null, 
   "daewoo", 
   "BTW.....NO. I do not trust the head of the CIA. I dont care who it is or how liberal or conservative they are. I dont care if Jesus Christ is the head of the CIA...I would not trust him. \n \n NOBODY should trust the head of the CIA.", 
   {}, 
   429099, 
   null, 
   1304658660.0
  ], 
  [
   429114, 
   null, 
   "snakespit", 
   "Reflecting the anger in Pakistan, hundreds of members of radical Islamic parties protested Friday in several Pakistan cities against the American raid and in favor of bin Laden. Many of the people chanted \"Osama is alive\" and blasted the U.S. for violating the country's sovereignty.\n \n The largest rally took place in the town of Khuchlak in southwestern Baluchistan province, where about 500 people attended.\n \n \"America is celebrating Osama bin Laden's killing, but it will be a temporary celebration,\" said Abdullah Sittar Chishti, a member of the Jamiat Ulema Islam party who attended the rally in Khuchlak. \"After the martyrdom of Osama, billions, trillions of Osamas will be born.\"\n\n Bin Laden's wife spent 6 years in Pakistani house - Yahoo! News\n \n It seems that our \"covert\" mission to kill Bin Laden is turning out to be a great recruiting tool for Islamic extremism.", 
   {}, 
   428872, 
   null, 
   1304699460.0
  ], 
  [
   429379, 
   null, 
   "Easyrider", 
   "\n \n It seems that our \"covert\" mission to kill Bin Laden is turning out to be a great recruiting tool for Islamic extremism.\n\n \n Yeah, take that, Obama.\n \n Osama bin Laden had three wives living with him and evidently none of them knew how to keep a house clean.", 
   {}, 
   429114, 
   null, 
   1304997960.0
  ], 
  [
   429390, 
   null, 
   "snakespit", 
   "Yeah, take that, Obama.\n\n What exactly is that supposed to mean?", 
   {}, 
   429379, 
   null, 
   1305004680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Go Seals", 
  "url": "http://www.4forums.com/political/current-events-debates/15319-go-seals.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 15319, 
  "discussion_files": [
   [
    "25001.html", 
    "http://www.4forums.com/political/current-events-debates/15319-go-seals-print.html"
   ]
  ], 
  "identifier": 15319
 }
]