[
 [
  [
   429020, 
   null, 
   "Charlie_XT", 
   "So I joined the board to take part in the debate that seems to permeate everything and one of the areas I was always curious about was in this section. I've always had a question that I wanted to see asked but nobody ever brought it up so I'm going to.\n \n Supporters of gun control are accustomed to a specific type of opponent in their arguments, specifically white men. White guys are the easiest to attack and blame for everything due to history painting them as the ultimate evil, and collectively the white culture has been forced to simply roll over and take it for fear of being called racist all over again. However in becoming accustomed to doing battle with this specific group supporters of gun control have become typecast in their arguments and can't easily adapt to confronting other people of different heritages.\n \n So how exactly do supporters of gun control respond when the opponent they have to confront is a woman? How does their rhetoric and fear mongering and hyperbole work when they've gotta deal with members of the female side of the population who don't buy into their arguments? How exactly do you sell disarmament to women who don't believe in being unarmed and helpless as an answer?\n \n I never believed that any attempt to take away my gun or restrict my ability to use it when I'm out late would do anything to prevent me from being mugged, raped or murdered by whatever lowlife of society has yet to be locked up because they chose to not obey the rules of said society. Nor do I believe that requiring me to obtain a permit to buy a gun would do anything to prevent me from becoming a victim of domestic violence simply because the same law might prevent my abuser from becoming armed.\n \n So what do they have? When they encounter someone who can't be assaulted with claims of racist nature, or insults of sexual dysfunction, or mockery of compensation for lacking something, etc. what is the course of action that's to be taken next?", 
   {
    "post_info": {
     "post_title": "What to do with women"
    }
   }, 
   null, 
   null, 
   1304615340.0
  ], 
  [
   429024, 
   null, 
   "poet", 
   "So I joined the board to take part in the debate that seems to permeate everything and one of the areas I was always curious about was in this section. I've always had a question that I wanted to see asked but nobody ever brought it up so I'm going to.\n \n Supporters of gun control are accustomed to a specific type of opponent in their arguments, specifically white men. White guys are the easiest to attack and blame for everything due to history painting them as the ultimate evil, and collectively the white culture has been forced to simply roll over and take it for fear of being called racist all over again. However in becoming accustomed to doing battle with this specific group supporters of gun control have become typecast in their arguments and can't easily adapt to confronting other people of different heritages.\n \n LOLOLOL. Absolute BS. If you and others like you weren't so caught up and attached to \"white privilege\", in which, you being \"born white\", completely out of your control, means something ridiculous like \"you're superior to others\", or something. We won't get into specifics such as chattal slavery, stealing the land from Native Americans, all of the various and sundry imperialistic wars ,you, collectively, have gotten us into, Jim Crow, lynchings, voter intimidation, and a skewed justice system, to name but a few. \n \n I grew up around white people. Went to school, and church with them. Had sleep overs. Dinners and lunches. Worked with them. Partied with them. Slept with a few. They are no special than anyone else, contrary to popular belief. \n \n So how exactly do supporters of gun control respond when the opponent they have to confront is a woman? How does their rhetoric and fear mongering and hyperbole work when they've gotta deal with members of the female side of the population who don't buy into their arguments? How exactly do you sell disarmament to women who don't believe in being unarmed and helpless as an answer?\n \n Oh that's easy. Most men equate guns with phalluses. The smaller the penis the more enthusiastic the gun enthusiast...because firepower is a metaphor for sexual prowess. Don't you get it?\n And yeah, a woman having gun would tend to make you think twice about forcing yourself into a compromising situation. Lorena Bobbitt is a name that strikes fear into the groin of most straight men. Women benefit from firearms to deal with criminals and Neanderthals. \n I never believed that any attempt to take away my gun or restrict my ability to use it when I'm out late would do anything to prevent me from being mugged, raped or murdered by whatever lowlife of society has yet to be locked up because they chose to not obey the rules of said society. Nor do I believe that requiring me to obtain a permit to buy a gun would do anything to prevent me from becoming a victim of domestic violence simply because the same law might prevent my abuser from becoming armed.\n \n So what do they have? When they encounter someone who can't be assaulted with claims of racist nature, or insults of sexual dysfunction, or mockery of compensation for lacking something, etc. what is the course of action that's to be taken next?\n\n \n To ban all firearms by repealing the second amendment. How do you like them apples? ", 
   {}, 
   429020, 
   null, 
   1304617860.0
  ], 
  [
   429026, 
   null, 
   "Tither", 
   "\n To ban all firearms by repealing the second amendment. How do you like them apples? \n\n My how RADICAL. \n \n However, since you want em. You could try to come and get them! emoticon_smile Howe'd that be?", 
   {}, 
   429024, 
   null, 
   1304618160.0
  ], 
  [
   429027, 
   null, 
   "poet", 
   "My how RADICAL. \n \n However, since you want em. You could try to come and get them! emoticon_smile Howe'd that be?\n\n \n I don't want 'em. I just don't want you to have 'em. Or anybody for that matter. What do you thing video games are for? Or are you just violent as a rule of thumb?", 
   {}, 
   429026, 
   null, 
   1304619180.0
  ], 
  [
   429033, 
   null, 
   "sinjin", 
   "So I joined the board to take part in the debate that seems to permeate everything and one of the areas I was always curious about was in this section. I've always had a question that I wanted to see asked but nobody ever brought it up so I'm going to.\n \n Supporters of gun control are accustomed to a specific type of opponent in their arguments, specifically white men. White guys are the easiest to attack and blame for everything due to history painting them as the ultimate evil, and collectively the white culture has been forced to simply roll over and take it for fear of being called racist all over again. However in becoming accustomed to doing battle with this specific group supporters of gun control have become typecast in their arguments and can't easily adapt to confronting other people of different heritages.\n \n So how exactly do supporters of gun control respond when the opponent they have to confront is a woman? How does their rhetoric and fear mongering and hyperbole work when they've gotta deal with members of the female side of the population who don't buy into their arguments? How exactly do you sell disarmament to women who don't believe in being unarmed and helpless as an answer?\n \n I never believed that any attempt to take away my gun or restrict my ability to use it when I'm out late would do anything to prevent me from being mugged, raped or murdered by whatever lowlife of society has yet to be locked up because they chose to not obey the rules of said society. Nor do I believe that requiring me to obtain a permit to buy a gun would do anything to prevent me from becoming a victim of domestic violence simply because the same law might prevent my abuser from becoming armed.\n \n So what do they have? When they encounter someone who can't be assaulted with claims of racist nature, or insults of sexual dysfunction, or mockery of compensation for lacking something, etc. what is the course of action that's to be taken next?\nOpponents of gun control are accustomed to a specific type of opponent in their arguments, specifically pacifists.\n \n You're typecasting supporters of firearm regulations right now.\n \n And btw, white women can be racist too.", 
   {}, 
   429020, 
   null, 
   1304620620.0
  ], 
  [
   429061, 
   null, 
   "zsu2357", 
   "I don't want 'em. I just don't want you to have 'em. Or anybody for that matter. What do you thing video games are for? Or are you just violent as a rule of thumb?\n\n \n Do you mean Tither in particular or the other 85-100 million of us as well?That's a lot of anybodies.", 
   {}, 
   429027, 
   null, 
   1304631660.0
  ], 
  [
   429062, 
   null, 
   "poet", 
   "Do you mean Tither in particular or the other 85-100 million of us as well?That's a lot of anybodies.\n\n \n You like guns? Never grew out of cowboys and indians, eh? Or you like playing soldiers?", 
   {}, 
   429061, 
   null, 
   1304631780.0
  ], 
  [
   429064, 
   null, 
   "zsu2357", 
   "You like guns? Never grew out of cowboys and indians, eh? Or you like playing soldiers?\n\n Never really was into cowboys and Indians always had to be on the losing side\n (depending on ones view).Playing soldier was fun,until a big dose of reality.emoticon_smile", 
   {}, 
   429062, 
   null, 
   1304632800.0
  ], 
  [
   429071, 
   null, 
   "Charlie_XT", 
   "To ban all firearms by repealing the second amendment. How do you like them apples?\n\n \n Well at least you've got the cojones to openly state what your ambitions and goals are. Others who support your notions aren't nearly as forthcoming with what they want because it's become political suicide to take such a position.\n \n Just don't come crying if your position comes back to bite you when there's a push to also repeal the Fourth Amendment, or maybe even the Sixth Amendment. Trying to read something out of the Constitution simply because you don't like it can have drastic consequences.\n \n \nLOLOLOL. Absolute BS. If you and others like you weren't so caught up and attached to \"white privilege\", in which, you being \"born white\", completely out of your control, means something ridiculous like \"you're superior to others\", or something. We won't get into specifics such as chattal slavery, stealing the land from Native Americans, all of the various and sundry imperialistic wars ,you, collectively, have gotten us into, Jim Crow, lynchings, voter intimidation, and a skewed justice system, to name but a few.\n\n \n I didn't start this thread to give credit to the concept of white privilege. I don't even believe that such a standard exists. I started this thread to get to the bottom of some important questions. Blacks and women are often portrayed as the victims of gun violence and widespread gun ownership, and some try and use us as a cause to argue for restrictions on gun rights because they present them as a method of protecting us. That is what's absolute BS here.\n \n I really find something to be quite interesting in your racially motivated rants Poet. I'm assuming you're a black man by the way you've been addressing me. Your take a stance of complete disarmament. Why this is I can't understand. You spoke of Jim Crow laws as being part of the evil that whites have committed in this country. Are you aware that Jim Crow laws also included prohibitions against blacks and other colored from being armed?\n \n Tell me something Poet. How can a black man support the concept of disarmament when such a concept was used to keep past blacks from being armed in the first place? Isn't that the same as saying the racists were correct?\n \n \nOh that's easy. Most men equate guns with phalluses. The smaller the penis the more enthusiastic the gun enthusiast...because firepower is a metaphor for sexual prowess. Don't you get it?\n\n \n No I really don't get it. Besides Dr. Joyce Brothers what other psychiatrists support this mistaken belief? Who has peer reviewed this opinion and considered it viable in nature? Simply because somebody claims there's a sexual connection to gun ownership that doesn't mean they're correct in their personal beliefs. I'm not buying this notion until there's sufficient scientific study to prove that this is a legitimate position to argue.\n \n \nAnd yeah, a woman having gun would tend to make you think twice about forcing yourself into a compromising situation. Lorena Bobbitt is a name that strikes fear into the groin of most straight men. Women benefit from firearms to deal with criminals and Neanderthals.\n \n \n Lorena Bobbitt you say? She was tried in a court of law and found by a jury to be not guilty for her actions due to everything her husband had put her through. Meanwhile John Bobbitt went on to have numerous other run ins with the law, including several arrests and even convictions for domestic battery because he apparently didn't learn from the last time. So exactly what are you hoping to yield from bringing her name into the discussion? Are you making jokes about the fact that women are physically weak compared to men and might need assistance in protecting themselves from victimization?\n \n \nI don't want 'em. I just don't want you to have 'em. Or anybody for that matter. What do you thing video games are for? Or are you just violent as a rule of thumb?\n\n \n Despite whatever you might be trying to suggest, gun ownership isn't a direct result of violent tendencies and a desire to destroy stuff. Do you choose to deny the fact that this is a dangerous world filled with dangerous people who will kill you because you were in the wrong place at the wrong time?\n \n That would certainly be an interesting topic of discussion. I'd like to see you try and make a coherent case for the argument that people don't own guns because they want to protect themselves, but rather to act upon violent impulses to a sufficient degree.\n \n \nYou like guns? Never grew out of cowboys and indians, eh? Or you like playing soldiers?\n\n \n See now this is the type of rhetoric I was talking about at the beginning of the thread. This is the kind of nonsense you can't deploy against women in trying to make your case against gun ownership. Playing games like soldier, or cowboys and indians, wasn't something that a great many of us engaged in as kids. You can't shame us out of gun ownership with mentally deficient rhetoric such as that. Ask any woman that's been raped and chose to be armed in order to be a victim no more.", 
   {}, 
   429024, 
   null, 
   1304635920.0
  ], 
  [
   429074, 
   null, 
   "sinjin", 
   "Wonder why 9 out of 10 American women choose not to own a gun?", 
   {}, 
   429071, 
   null, 
   1304636400.0
  ], 
  [
   429075, 
   null, 
   "Doc Jones", 
   "Wonder why 9 out of 10 American women choose not to own a gun?\n\n \n Link??? You sure are spreading the brady propaganda today despite being debunked numerous times on every 'factoid' you have produced. emoticon_xbouncer", 
   {}, 
   429074, 
   null, 
   1304637780.0
  ], 
  [
   429077, 
   null, 
   "Charlie_XT", 
   "Wonder why 9 out of 10 American women choose not to own a gun?\n\n \n Actually I'm more curious as to where you got such figures. I'm even more curious as to why you didn't post a link that would support your claim.", 
   {}, 
   429074, 
   null, 
   1304638320.0
  ], 
  [
   429078, 
   null, 
   "sinjin", 
   "Actually I'm more curious as to where you got such figures.\nGun Ownership and Use in America\n \n \nI'm even more curious as to why you didn't post a link that would support your claim.\nBecause we've been through all this here ad nauseum?", 
   {}, 
   429077, 
   null, 
   1304639040.0
  ], 
  [
   429080, 
   null, 
   "sinjin", 
   "\"Between 2-5 percent of the population in \"shall issue\" concealed carry permit (CCP) \n states avail themselves of that right. Less than half are women!\"\n Women, Guns and Disinformation", 
   {}, 
   429078, 
   null, 
   1304640960.0
  ], 
  [
   429083, 
   null, 
   "poet", 
   "Actually I'm more curious as to where you got such figures. I'm even more curious as to why you didn't post a link that would support your claim.\n\n \n Why don't you?", 
   {}, 
   429077, 
   null, 
   1304641380.0
  ], 
  [
   429085, 
   null, 
   "poet", 
   "Gun Ownership and Use in America\n \n Because we've been through all this here ad nauseum?\n\n \n Evidently, late to the party.", 
   {}, 
   429078, 
   null, 
   1304641620.0
  ], 
  [
   429087, 
   null, 
   "Freedom", 
   "And btw, white women can be racist too.\n\n She didn't say she was white or a racist, although it was odd to talk about 'white culture'.\n \n Charlie, you do know that no such thing exists right? Oh and don't even respond to poet, it then posts even more. You will go on ignore the moment you say something it can't respond to.", 
   {}, 
   429085, 
   null, 
   1304642460.0
  ], 
  [
   429092, 
   null, 
   "Doc Jones", 
   "\"Between 2-5 percent of the population in \"shall issue\" concealed carry permit (CCP) \n states avail themselves of that right. Less than half are women!\"\n Women, Guns and Disinformation\n\n \n That is right up there with your claims that gun owners are dropping when the stats show they are increasing.\n \n Getting permission to exercise a civil right is about like asking a colored man to get a permit to go to the water fountain or your cafe and eat or go to the school your kids go to,\n \n A RIGHT requires no fee nor license. McDonald incorporated the 2A into the 14th Amendment as a civil and individual, FUNDAMENTAL right. SCOTUS has ruled that a license or fee to exercise a right is unconstitutional. Why that would be no right at all now would it? A gov't priviledge? emoticon_xclown", 
   {}, 
   429080, 
   null, 
   1304645880.0
  ], 
  [
   429101, 
   null, 
   "zsu2357", 
   "Wonder why 9 out of 10 American women choose not to own a gun?\n\n My wife owns a gun my oldest daughter owns one at least 2 sister in laws and all within 10 miles 1 next door,that's just for a quick start,take to much time to list them all.\n \n There's a standing rule here at home, any surveys anyone decides to take, when it comes to guns it's non of their business.How many other surveys or person being surveyed says likewise?Kinda invalidates it.", 
   {}, 
   429074, 
   null, 
   1304659020.0
  ], 
  [
   429102, 
   null, 
   "sinjin", 
   "My wife owns a gun my oldest daughter owns one at least 2 sister in laws and all within 10 miles 1 next door,that's just for a quick start,take to much time to list them all.\nMillions of women own firearms. Most women want nothing to do with firearms. Most women would prefer the men in their lives felt likewise. Such is life.\n \n \nThere's a standing rule here at home, any surveys anyone decides to take, when it comes to guns it's non of their business.How many other surveys or person being surveyed says likewise?Kinda invalidates it.\nWhat's the standing rule if they come to the door? emoticon_xclown", 
   {}, 
   429101, 
   null, 
   1304663040.0
  ], 
  [
   429103, 
   null, 
   "sinjin", 
   "Evidently, late to the party.\nYou should know I strongly disagree with what you have expressed.", 
   {}, 
   429085, 
   null, 
   1304663100.0
  ], 
  [
   429104, 
   null, 
   "Charlie_XT", 
   "Millions of women own firearms. Most women want nothing to do with firearms. Most women would prefer the men in their lives felt likewise. Such is life.\n\n \n Speaking for the masses like their elected representative? How can you be sure this information is accurate and factual?", 
   {}, 
   429102, 
   null, 
   1304663520.0
  ], 
  [
   429105, 
   null, 
   "Freedom", 
   "You should know I strongly disagree with what you have expressed.\n\n Now you've gone and done it. You can't possibly know how racist you have just shown yourself to be sinjin because your so blinded by white privilege you can't see the end of your pearly white rich male nose. (Don't try to do deny you are a rich white racist sexist homophobe capitalist, I/We/Collective know better).", 
   {}, 
   429103, 
   null, 
   1304663700.0
  ], 
  [
   429106, 
   null, 
   "poet", 
   "You should know I strongly disagree with what you have expressed.\n\n \n Your right.", 
   {}, 
   429103, 
   null, 
   1304667180.0
  ], 
  [
   429108, 
   null, 
   "Bryan", 
   " To ban all firearms by repealing the second amendment. How do you like them apples? \n\n \n Well the apples look a little rotten to me, but I'll risk a bite.... \n \n \n I don't want 'em. I just don't want you to have 'em. Or anybody for that matter. What do you thing video games are for? Or are you just violent as a rule of thumb? \n\n \n I respect your decision not to have 'em. And yet I must confess that I do own more than one gun. \n \n Am I wrong to ignore your desires?\n \n Why don't you want me to have a gun?\n \n What makes you assume that someone who owns a gun would be \"violent as a rule of thumb\"?\n \n I'm serious, Poet. If you're willing to have a discussion then I'm game. I can't respond as often as some here, but I'll engage you and give you the courtesy of answering questions you pose to me in turn-if you are also serious. I have no interest in watching you tilt at windmills. All I ask is that you answer my questions, if at all, by addressing them to me as opposed to some fictional \"white man\" with a sexual dysfunction, a false superiority complex, and who has the time to parade around as a jingoist American imperialist warmonger because his living is made on the backs of slaves he owns who work for him on the land he stole from Native Americans.", 
   {
    "post_info": {
     "post_title": "An invitation to Poet"
    }, 
    "unicode_changes_made": true
   }, 
   429085, 
   null, 
   1304687340.0
  ], 
  [
   429113, 
   null, 
   "Freedom", 
   "I'm serious, Poet. If you're willing to have a discussion then I'm game.\n\n He's not... as a rule of thumb he prefers propaganda rhetoric to debate.", 
   {
    "unicode_changes_made": true
   }, 
   429108, 
   null, 
   1304697780.0
  ], 
  [
   429120, 
   null, 
   "sinjin", 
   "Speaking for the masses like their elected representative? How can you be sure this information is accurate and factual?\nI could have said the same thing for motorcycles. \n Don't get me wrong.", 
   {}, 
   429104, 
   null, 
   1304707560.0
  ], 
  [
   429121, 
   null, 
   "sinjin", 
   "Now you've gone and done it. You can't possibly know how racist you have just shown yourself to be sinjin because your so blinded by white privilege you can't see the end of your pearly white rich male nose. (Don't try to do deny you are a rich white racist sexist homophobe capitalist, I/We/Collective know better).\nSarcasm doesn't play well in text. A friendly warning.\n \n I think the past ripples into the present.\n I think we have far to go.\n I think relations are improving.\n \n Not being white in America can still be a pain in the XXX.\n Blind is not recognizing that simple fact.\n \n Rev. Jackson and his ilk have had their day.\n They were never part of the problem IMO.\n Opportunistic? All politicians are that.\n Have they exploited people of color more for their own advantage than that of the group? \n I'd have to say no. Far from it.", 
   {}, 
   429105, 
   null, 
   1304708100.0
  ], 
  [
   429123, 
   null, 
   "Pietro", 
   "Poet-\n \n This is my first time encountering you here on the forums so I can't accurately judge how you engage in debate. But from what I've seen your posting style looks a great deal like a hybridization of the styles favored by Brady and Simone. Brady favors insults of sexual inadequacy for gun owners and one sentence trolling positions, while Simone enjoys injecting race into every subject under the sun. Neither of which is conductive of honest and open debate.", 
   {}, 
   429020, 
   null, 
   1304711100.0
  ], 
  [
   429125, 
   null, 
   "Superlite27", 
   "Poet-\n \n This is my first time encountering you here on the forums so I can't accurately judge how you engage in debate. But from what I've seen your posting style looks a great deal like a hybridization of the styles favored by Brady and Simone. Brady favors insults of sexual inadequacy for gun owners and one sentence trolling positions, while Simone enjoys injecting race into every subject under the sun. Neither of which is conductive of honest and open debate.\n\n \n ...and there's the answer to the question posed by Charlie XT: \n \n \nSo how exactly do supporters of gun control respond when the opponent they have to confront is a woman? \n\n \n \n The fact that you fall into a demographic inconsistent with the premeditated sound-bite of an answer will be completely ignored like every other fact they are confronted with. You will be treated with the same loathing disgust and disdainful superiority they treat any other stereotyped, red-neck, uneducated, fat, pasty, old, hick white-guy with.\n \n But, it's best not to accuse them all of falling into the same category. That would be stereotyping. The only things exempt from this are labels commonly applied to all gun owners such as \"penis compensation\", \"red-neck\", \"uneducated\", \"overweight\", \"white\", and \"male\". Any other demographic is irrellevant because everyone knows that all gun owners fall into only these categories, therefore, it is perfectly acceptable to stereotype them. Just do not refer to any other demographic in any stereotypical or categorical reference or you will be instantly labeled a \"racist\" or \"bigot\" (other categories exclusively obtained only by gun owners).\n \n Being a woman is completely irrelevant as this would fall into the realm of \"fact\", therefore, an area of no concern to anti-gunners, whatsoever. These pesky \"facts\" are easily countermandered by appeals to emotion, instant calls for \"Cite!...Cite!\", or obfuscation of the point in question by sidetracking the entire argument into a 10 page long discussion of whether or not you have ever worn a dress and whether or not that is a relevant basis to determine \"womanhood\". It will then take at least another 3 pages to answer whether or not you have had children and another 4 pages to determine if motherhood is a relevant basis for womanhood.\n \n By this time, nobody will care how anti-gunner's pre-formulated arguments against male dominated gun ownership apply to you, and their wish to avoid that pesky \"fact\" problem will be successfully diverted through typical obfuscation of the point in question.\n \n Whoops! Did I just say the word \"typical\" and \"anti-gunner\" in the same sentence? Ahhhh! A stereotype! Ahhhhhh! I'm such a hateful, uneducated, bigot! I lose!", 
   {}, 
   429020, 
   null, 
   1304713260.0
  ], 
  [
   429126, 
   null, 
   "Bryan", 
   "He's not... as a rule of thumb he prefers propaganda rhetoric to debate.\n\n \n Fair enough. Then I am asking that Poet avoid using his or her thumbs and just use the fingers when he or she responds. \n \n What do you say, Poet?", 
   {
    "post_info": {
     "post_title": "my offer still stands"
    }
   }, 
   429113, 
   null, 
   1304713980.0
  ], 
  [
   429127, 
   null, 
   "poet", 
   "Well the apples look a little rotten to me, but I&#8217;ll risk a bite&#8230;. \n \n \n \n I respect your decision not to have &#8216;em. And yet I must confess that I do own more than one gun. \n \n Am I wrong to ignore your desires?\n \n Why don&#8217;t you want me to have a gun?\n \n \n I don't want anyone to have a gun, probably because I was a victim of gun violence in 1977, and have hated all guns since.\n I was disturbed by my brother's juvenile and twisted obsession with handguns. I don't believe they serve any purpose but to maim or kill.\n \n \n \n What makes you assume that someone who owns a gun would be &#8220;violent as a rule of thumb&#8221;?\n \n I don't know you, and I can't trust that you'll do the right thing.\n People who play with matches, eventually wind up starting fires. \n There is far too many incidents of accidental shootings in homes, in schools, and in public.\n Gun violence is everywhere...at McDonalds, at churches...nowhere is safe. \n I&#8217;m serious, Poet. If you&#8217;re willing to have a discussion then I&#8217;m game. I can&#8217;t respond as often as some here, but I&#8217;ll engage you and give you the courtesy of answering questions you pose to me in turn&#8212;if you are also serious. I have no interest in watching you tilt at windmills. All I ask is that you answer my questions, if at all, by addressing them to me as opposed to some fictional &#8220;white man&#8221; with a sexual dysfunction, a false superiority complex, and who has the time to parade around as a jingoist American imperialist warmonger because his living is made on the backs of slaves he owns who work for him on the land he stole from Native Americans.\n\n \n Guns and penises - Camille Paglia - Salon.com\n \n \"The gun as mutant penis: Men or women who abuse guns are equally sexually dysfunctional. The first question that popped into my mind about the Columbine killers was, \"What was their sex life like?\" It's very difficult to be a man in today's post-industrial culture, with its bland service-sector jobs and endless paper-shuffling deskwork. All you have before you is eternal tethering -- to parents, teachers, boss, wife. There's little room for genuine masculine adventure and achievement. And there are few men to admire -- which is why violent video games and action-adventure films have been thriving.\n \n You males whose courage, energy and ingenuity turned the global wilderness into civilization (and allowed women to emerge from the servitude of reproductive biology to become self-determining individuals) are not honored by the clichid ideologies of our time. From feminism to therapy, the ruling premise is the Sensitive Male, as talky as a woman as he gets in touch with his banal feelings. Natural, robust, assertive masculinity is defined as a disease from which society must be cured.\n \n You tartly cite Harvard psychoanalyst William Pollack, whose bestselling book, \"Real Boys,\" has been tirelessly promoted by Oprah Winfrey in her ever-lengthening chain of white male gurus and black earth mothers. I know from the testimony of friends that Pollack is a superb therapist. But I'm afraid I must agree with your skepticism about his approach to current social issues. His bookish milieu has little understanding of either athletics or war -- which are crucial to any historical analysis of masculinity.\"\n \n And I'm sorry if my analysis hit way too close to home. Many whites are precisely as I described them : sexually dysfunctional, operating with fantastic senses of entitlement and notions of superiority, are caught up in gun culture (a sure sign of immaturity and stunted development), who profitted from the labor of enslaved blacks, after stealing America from the indigenous peoples. Have I mischaracterized? - poet", 
   {}, 
   429108, 
   null, 
   1304716860.0
  ], 
  [
   429128, 
   null, 
   "sinjin", 
   "...and there's the answer to the question posed by Charlie XT: \n \n \n \n \n The fact that you fall into a demographic inconsistent with the premeditated sound-bite of an answer will be completely ignored like every other fact they are confronted with. You will be treated with the same loathing disgust and disdainful superiority they treat any other stereotyped, red-neck, uneducated, fat, pasty, old, hick white-guy with.\n \n But, it's best not to accuse them all of falling into the same category. That would be stereotyping. The only things exempt from this are labels commonly applied to all gun owners such as \"penis compensation\", \"red-neck\", \"uneducated\", \"overweight\", \"white\", and \"male\". Any other demographic is irrellevant because everyone knows that all gun owners fall into only these categories, therefore, it is perfectly acceptable to stereotype them. Just do not refer to any other demographic in any stereotypical or categorical reference or you will be instantly labeled a \"racist\" or \"bigot\" (other categories exclusively obtained only by gun owners).\n \n Being a woman is completely irrelevant as this would fall into the realm of \"fact\", therefore, an area of no concern to anti-gunners, whatsoever. These pesky \"facts\" are easily countermandered by appeals to emotion, instant calls for \"Cite!...Cite!\", or obfuscation of the point in question by sidetracking the entire argument into a 10 page long discussion of whether or not you have ever worn a dress and whether or not that is a relevant basis to determine \"womanhood\". It will then take at least another 3 pages to answer whether or not you have had children and another 4 pages to determine if motherhood is a relevant basis for womanhood.\n \n By this time, nobody will care how anti-gunner's pre-formulated arguments against male dominated gun ownership apply to you, and their wish to avoid that pesky \"fact\" problem will be successfully diverted through typical obfuscation of the point in question.\n \n Whoops! Did I just say the word \"typical\" and \"anti-gunner\" in the same sentence? Ahhhh! A stereotype! Ahhhhhh! I'm such a hateful, uneducated, bigot! I lose!\nMaybe you could address the fact that even in \"shall issue\" locales, no more than 3 women in 100 choose to seek the ability to legally carry concealed.", 
   {}, 
   429125, 
   null, 
   1304716920.0
  ], 
  [
   429129, 
   null, 
   "poet", 
   "Poet-\n \n This is my first time encountering you here on the forums so I can't accurately judge how you engage in debate. But from what I've seen your posting style looks a great deal like a hybridization of the styles favored by Brady and Simone. Brady favors insults of sexual inadequacy for gun owners and one sentence trolling positions, while Simone enjoys injecting race into every subject under the sun. Neither of which is conductive of honest and open debate.\n\n \n And I don't know you from Adam. So what? You're entitled to your opinion...as valuable as it is.", 
   {}, 
   429123, 
   null, 
   1304716980.0
  ], 
  [
   429130, 
   null, 
   "poet", 
   "Fair enough. Then I am asking that Poet avoid using his or her thumbs and just use the fingers when he or she responds. \n \n What do you say, Poet?\n\n \n \nOriginally Posted by Freedom \n He's not... as a rule of thumb he prefers propaganda rhetoric to debate. \n\n \n The response by Freedom gave you insight as to my gender....but you chose to demean me, by suggesting that I might plausibly be female.\n And so, since you are a dishonest poster, chiding me for being less that forthcoming, I'll not respond further....denying you the discourse you claim you wanted. Typical.", 
   {}, 
   429126, 
   null, 
   1304717220.0
  ], 
  [
   429133, 
   null, 
   "Doc Jones", 
   "emoticon_xclown\n=poet;429130]The response by Freedom gave you insight as to my gender....but you chose to demean me, by suggesting that I might plausibly be female.\n\n \n \"demean you by suggesting that you might plausibly be female\"?\n What exactly is demeaning about that other than you consider yourself better than the opposite sex? You quote from a female because she says it better than you but you have contempt for females? On the board Miss Poet there is a 50-50 chance you will be male or female and I think Bryan gave you the opening to declare and went out of the way to avoid any value judgement.\n \n \nAnd so, since you are a dishonest poster, chiding me for being less that forthcoming, I'll not respond further....denying you the discourse you claim you wanted. Typical.\n\n \n Whoop de doo. ...and you saw fit to demonize, demean and insult every citizen exercising their civil right to keep and bear arms and tell men you know nothing about that myth by brady that they are 'sexually inadequate'. Wanna tell some Marines and Seals or other SF that they are sexually inadequate? Easy to tell you never did any military duty and no telling what other duties and responsibilities you dodged. Us black boys know our white brothers are in the same boat we are...it is sluggards like you that get shunned. \n \n Once my son asked me when I was in my late 60's if it was true the military gave us salt peter in our mashed potatoes as a history class had taught and if it worked. I told him \"that it was starting to\".\n \n What did they do to you? Shoot your organ off? That is about all that myth and lie would cover.\n \n No, the reason you won't engage Bryan is because you know you will have to be truthful. You just came in to spread some old, old, old BS and demean gun owners who have the 2A right enshrined in the XIVth Amendment of Civil Rights. Eat your heart out emoticon_xclown emoticon_xbye", 
   {}, 
   429130, 
   null, 
   1304722260.0
  ], 
  [
   429134, 
   null, 
   "Bryan", 
   " I don't want anyone to have a gun, probably because I was a victim of gun violence in 1977, and have hated all guns since.\n I was disturbed by my brother's juvenile and twisted obsession with handguns. I don't believe they serve any purpose but to maim or kill. \n\n \n Fair enough, I wanted to see where you claimed to come from on gun control. Suffice to say at this time that I disagree with your views. We can discuss our disagreements in detail if you wish....\n \n \n I don't know you. \n \n \n Very true-which leads me to question the wisdom of your assumption that I fit within this laughably simplistic stereotype....\n \n \n And I'm sorry if my analysis hit way too close to home. Many whites are precisely as I described them : sexually dysfunctional, operating with fantastic senses of entitlement and notions of superiority, are caught up in gun culture (a sure sign of immaturity and stunted development), who profitted from the labor of enslaved blacks, after stealing America from the indigenous peoples. Have I mischaracterized? \n\n \n Why yes, you have.\n \n \n The response by Freedom gave you insight as to my gender....but you chose to demean me, by suggesting that I might plausibly be female.\n And so, since you are a dishonest poster, chiding me for being less that forthcoming, I'll not respond further....denying you the discourse you claim you wanted. Typical. \n\n \n I did notice what Freedom posted, but as you two are clearly at odds in this thread I thought it would be impertinent to assume that Freedom was authorized to be your gender spokesperson. \n \n I looked at your public profile before my last post, and I saw nothing about your gender. If I have inadvertently offended your sensibilities by refusing to make an assumption about your gender then I crave pardon for that offense.\n \n I assure you that I do not consider a person's gender as a fact which demeans anyone. To my knowledge I have never asked anyone to list their gender (or race, or religious preference, if any) before. Unless someone wishes to share these personal facts as a way of explaining what they are saying, or of placing what they are saying in context, then I consider it irrelevant. \n \n It appears then that you and I have different views on this subject. I simply will not attempt to measure the wisdom, or lack thereof, of someone's comments based only upon their gender or their race. With that said, I disagree with your method of stereotyping people so that you may casually dismiss their arguments rather than confront them for the truth, or lack thereof, in the words themselves. \n \n In any event, please don't aggressively look to take offense at anything I say as an excuse to avoid me. It only gives the appearance that you seek to claim a noble motive for flight. I do not think this is the case, mind you, and I want to continue to hold my offer open to you despite your recent PM to me. \n \n Regardless of what you decide, please feel free at any time to offer your comments on things that I say here. \n \n Rest assured I will assume the same privilege with your comments.", 
   {
    "post_info": {
     "post_title": "I have not given up on you yet, Poet"
    }, 
    "unicode_changes_made": true
   }, 
   429133, 
   null, 
   1304722560.0
  ], 
  [
   429135, 
   null, 
   "Doc Jones", 
   "Maybe you could address the fact that even in \"shall issue\" locales, no more than 3 women in 100 choose to seek the ability to legally carry concealed.\n\n \n Which you would have no way of knowing. This is kin to the old 87% smuggling myth you tried to perpetrate...again.\n \n Of course to you any old law made by anyone is considered \"legal\" but we got a new sheriff in town. He is like the old sheriff before the late '68 shenanigans that got to rolling finally by gun grabbers in the 1990's; most of which you missed. If your desire is to be a rapist, I suggest you test your 3% theory. emoticon_xbye", 
   {}, 
   429128, 
   null, 
   1304723040.0
  ], 
  [
   429136, 
   null, 
   "poet", 
   "Fair enough, I wanted to see where you claimed to come from on gun control. Suffice to say at this time that I disagree with your views. We can discuss our disagreements in detail if you wish....\n \n \n \n Very true-which leads me to question the wisdom of your assumption that I fit within this laughably simplistic stereotype....\n \n \n \n Why yes, you have.\n \n \n \n I did notice what Freedom posted, but as you two are clearly at odds in this thread I thought it would be impertinent to assume that Freedom was authorized to be your gender spokesperson. \n \n I looked at your public profile before my last post, and I saw nothing about your gender. If I have inadvertently offended your sensibilities by refusing to make an assumption about your gender then I crave pardon for that offense.\n \n I assure you that I do not consider a person's gender as a fact which demeans anyone. To my knowledge I have never asked anyone to list their gender (or race, or religious preference, if any) before. Unless someone wishes to share these personal facts as a way of explaining what they are saying, or of placing what they are saying in context, then I consider it irrelevant. \n \n It appears then that you and I have different views on this subject. I simply will not attempt to measure the wisdom, or lack thereof, of someone's comments based only upon their gender or their race. With that said, I disagree with your method of stereotyping people so that you may casually dismiss their arguments rather than confront them for the truth, or lack thereof, in the words themselves. \n \n In any event, please don't aggressively look to take offense at anything I say as an excuse to avoid me. It only gives the appearance that you seek to claim a noble motive for flight. I do not think this is the case, mind you, and I want to continue to hold my offer open to you despite your recent PM to me. \n \n Regardless of what you decide, please feel free at any time to offer your comments on things that I say here. \n \n Rest assured I will assume the same privilege with your comments.\n\n \n I'm duly impressed. The first genuine, non-biased, intelligent response I've received here. I welcome the exchange. Please forgive my knee-jerk response to you, privately. I've been nothing but attacked here.", 
   {
    "unicode_changes_made": true
   }, 
   429134, 
   null, 
   1304724060.0
  ], 
  [
   429137, 
   null, 
   "poet", 
   "emoticon_xclown\n \n \"demean you by suggesting that you might plausibly be female\"?\n What exactly is demeaning about that other than you consider yourself better than the opposite sex? You quote from a female because she says it better than you but you have contempt for females? On the board Miss Poet there is a 50-50 chance you will be male or female and I think Bryan gave you the opening to declare and went out of the way to avoid any value judgement.\n \n You're an idiot. \n Whoop de doo. ...and you saw fit to demonize, demean and insult every citizen exercising their civil right to keep and bear arms and tell men you know nothing about that myth by brady that they are 'sexually inadequate'. Wanna tell some Marines and Seals or other SF that they are sexually inadequate? Easy to tell you never did any military duty and no telling what other duties and responsibilities you dodged. Us black boys know our white brothers are in the same boat we are...it is sluggards like you that get shunned. \n \n Once my son asked me when I was in my late 60's if it was true the military gave us salt peter in our mashed potatoes as a history class had taught and if it worked. I told him \"that it was starting to\".\n \n What did they do to you? Shoot your organ off? That is about all that myth and lie would cover.\n \n No, the reason you won't engage Bryan is because you know you will have to be truthful. You just came in to spread some old, old, old BS and demean gun owners who have the 2A right enshrined in the XIVth Amendment of Civil Rights. Eat your heart out emoticon_xclown emoticon_xbye\n\n \n What are you now? In your late senile 80's? Kiss it.", 
   {}, 
   429133, 
   null, 
   1304724240.0
  ], 
  [
   429139, 
   null, 
   "Doc Jones", 
   "What are you now? In your late senile 80's? Kiss it.\n\n \n Well, it is plain you are not a poet either. You got any claims you can back up or you spreading umbrage from your safe spot in the rubber room?", 
   {}, 
   429137, 
   null, 
   1304724600.0
  ], 
  [
   429141, 
   null, 
   "poet", 
   "Well, it is plain you are not a poet either. You got any claims you can back up or you spreading umbrage from your safe spot in the rubber room?\n\n \n I'm an ex-cardiopulmonary tech (14 years). A published author. Musician, producer. Related to show biz royalty. Being considered for poet laureate of Houston. What you got?", 
   {}, 
   429139, 
   null, 
   1304725920.0
  ], 
  [
   429143, 
   null, 
   "Doc Jones", 
   "I'm an ex-cardiopulmonary tech (14 years). A published author. Musician, producer. Related to show biz royalty. Being considered for poet laureate of Houston. What you got?\n\n \n Top shrink: Leftists are mentally ill", 
   {}, 
   429141, 
   null, 
   1304726160.0
  ], 
  [
   429145, 
   null, 
   "poet", 
   "Top shrink: Leftists are mentally ill\n\n \n I'll see your link and raise you one. \n Conservatism: The Politics Of Ignorance and Self-Interest\n Conservatism: The Politics of Ignorance And Self-Interest\n \n I guess you didn't have nothing to offer. Old fart.", 
   {}, 
   429143, 
   null, 
   1304726280.0
  ], 
  [
   429147, 
   null, 
   "Doc Jones", 
   "I'll see your link and raise you one. \n Conservatism: The Politics Of Ignorance and Self-Interest\n Conservatism: The Politics of Ignorance And Self-Interest\n \n I guess you didn't have nothing to offer. Old fart.\n\n \n I suppose that proves my point; that was what the good doc was talking about. Now we know where your silver elitist spoon is hidden. emoticon_xagree\n \n You do understand this is a Republic and not a democracy without the Rule of Law which you would change if you couldemoticon_xagree\n \n What, pray tell, gives you any authority over the Constitution nor the Civil Rights of the citizens of this Republic? hummmm?", 
   {}, 
   429145, 
   null, 
   1304726940.0
  ], 
  [
   429149, 
   null, 
   "Freedom", 
   "Sarcasm doesn't play well in text. A friendly warning.\n \n\n Lol, you figured it out.\n \n \nNot being white in America can still be a pain in the XXX.\n\n Not so much as an ache here.\n \n \nThe response by Freedom gave you insight as to my gender....but you chose to demean me, by suggesting that I might plausibly be female.\n\n Demean? So you think women are inferior to you?\n \n \nAnd so, since you are a dishonest poster, chiding me for being less that forthcoming, I'll not respond further....denying you the discourse you claim you wanted. Typical.\n\n Ha! I couldn't have been more prophetic if I had written it in stone.\n \n \nVery true-which leads me to question the wisdom of your assumption that I fit within this laughably simplistic stereotype....\n\n and what if you did? skin color, gender, and geographical location hardly translate to instantly wrong.\n \n \nI did notice what Freedom posted, but as you two are clearly at odds in this thread I thought it would be impertinent to assume that Freedom was authorized to be your gender spokesperson. \n\n It's at odds with sanity and the countdown before you go on ignore too is ticking.\n \n \nI'm duly impressed. The first genuine, non-biased, intelligent response I've received here. I welcome the exchange. Please forgive my knee-jerk response to you, privately. I've been nothing but attacked here.\n\n Won't last. M a r k m y w o r d s", 
   {
    "unicode_changes_made": true
   }, 
   429139, 
   null, 
   1304727600.0
  ], 
  [
   429150, 
   null, 
   "Pietro", 
   "I don't want anyone to have a gun, probably because I was a victim of gun violence in 1977, and have hated all guns since.\n\n \n I'm sorry that you were victimized but that's hardly grounds for declaring an all out war against a nation of 300+ million people and the Constitution itself. Your suffering isn't justification for forcing others to suffer in return. Nothing that you have experienced is bad enough that it would warrant changing the laws for the entire nation.\n \n \nI was disturbed by my brother's juvenile and twisted obsession with handguns.\n\n \n And I'm disturbed by the current state of the justice system. That doesn't mean I support lynchings and detainment without legal council. I object to the notion of calling for permanent restrictions simply because somebody does something that I don't like. Annoyance and being disturbed is part of the price for living in a free society.\n \n \nI don't believe they serve any purpose but to maim or kill.\n\n \n This is a simple fact and I've never claimed otherwise. Guns are lethal weapons and must be handled with respect or somebody can wind up dead. That's their purpose, that's the intent of their design. We don't live in a society where only non-harmful things are allowed to be owned by the people, we don't need to apologize for having a potentially lethal tool at our disposal.\n \n \nI don't know you, and I can't trust that you'll do the right thing.\n\n \n So why exactly should we extend to you the courtesy of trust when you refuse to trust anyone that you don't know? You expect us to give you more than you yourself are willing to give?\n \n \nPeople who play with matches, eventually wind up starting fires.\n\n \n I don't believe that guns and matches are a proper comparison to make. I've felt the same way with those that try and compare guns and marijuana.\n \n \nThere is far too many incidents of accidental shootings in homes, in schools, and in public.\n \n Gun violence is everywhere...at McDonalds, at churches...nowhere is safe.\n \n \n And such shootings usually occur where the law forbids gun possession or ownership. Look at how many people have been murdered in the handgun-free city of Chicago. I pointed out those statistics in pointing out Brady's hypocrisy.\n \n Guns and penises - Camille Paglia - Salon.com\n \n That's quite an individual you've chosen to cite. Unfortunately Camille Paglia isn't very noteworthy nor authoritative. Camille Paglia is little more than a school teacher who's highly critical of society. She has absolutely no credentials as a psychiatrist or a psychologist, instead she works for an art university. A good majority of the article you link is devoted to the topic of circumcision. The whole sexual obsession thing is quite tiring. When all else things you resort to talk of sex as if it's an acceptable excuse for your position.\n \n \nAnd I'm sorry if my analysis hit way too close to home. Many whites are precisely as I described them : sexually dysfunctional,\n\n \n Please explain exactly what you mean by sexually dysfunctional. Do you mean impotent? Do you mean sterile? That's an awful broad term to be throwing around so freely and readily. Maybe you could qualify as sexually dysfunctional because you believe everything is sexually related.\n \n Perhaps sexual dysfunction isn't the proper term to be using. Perhaps sexually obsessive is. Maybe to you and others like you everything has a phallic explanation because you're incapable of seeing otherwise. Perhaps while in school Sigmund Freud was beaten into you to the point you don't know anything else.\n \n \noperating with fantastic senses of entitlement and notions of superiority, are caught up in gun culture (a sure sign of immaturity and stunted development), who profitted from the labor of enslaved blacks, after stealing America from the indigenous peoples. Have I mischaracterized? - poet\n\n \n And what do you say about black gun owners? Why the silence on that topic?\n \n As for the founding of America and what happened to those that were here before us that's simply too bad. In war you're either the victor or the loser and that's just how it is. There are no innocents in war except the civilians who are stuck in the location of the two fighting factions.\n \n White people aren't exclusive in committing atrocious acts against others. We don't have a corner market on killing people that probably didn't deserve it. Take the Rwanda Genocide for example.", 
   {}, 
   429127, 
   null, 
   1304728080.0
  ], 
  [
   429151, 
   null, 
   "poet", 
   "I'm sorry that you were victimized but that's hardly grounds for declaring an all out war against a nation of 300+ million people and the Constitution itself. Your suffering isn't justification for forcing others to suffer in return. Nothing that you have experienced is bad enough that it would warrant changing the laws for the entire nation.\n \n War? Aren't you being a little melodramatic? And who are you to tell me what is justification and what isn't? I have just as much right to my views, no matter how extreme, as you have to yours. \n \n \n And I'm disturbed by the current state of the justice system. That doesn't mean I support lynchings and detainment without legal council. I object to the notion of calling for permanent restrictions simply because somebody does something that I don't like. Annoyance and being disturbed is part of the price for living in a free society.\n \n \n BS. You can stick your objections. \n \n This is a simple fact and I've never claimed otherwise. Guns are lethal weapons and must be handled with respect or somebody can wind up dead. That's their purpose, that's the intent of their design. We don't live in a society where only non-harmful things are allowed to be owned by the people, we don't need to apologize for having a potentially lethal tool at our disposal.\n \n Oh, please. You sound like a commercial for the NRA. Apparently you never grew up. \n So why exactly should we extend to you the courtesy of trust when you refuse to trust anyone that you don't know? You expect us to give you more than you yourself are willing to give?\n \n \n Illogical fallacy. I'm against all guns. Period. They should be banned. Anyone caught with one ought to go to jail, or be shot on sight. Are you peeved yet?\n \n I don't believe that guns and matches are a proper comparison to make. I've felt the same way with those that try and compare guns and marijuana.\n \n  I give a rat's booty what you believe. Did I ask you to comment. No, you just volunteered. Am I supposed to be moved by your words? I'm not. \n And such shootings usually occur where the law forbids gun possession or ownership. Look at how many people have been murdered in the handgun-free city of Chicago. I pointed out those statistics in pointing out Brady's hypocrisy.\n \n I'm from Chicago. What?\n Guns and penises - Camille Paglia - Salon.com\n \n That's quite an individual you've chosen to cite. Unfortunately Camille Paglia isn't very noteworthy nor authoritative. Camille Paglia is little more than a school teacher who's highly critical of society. She has absolutely no credentials as a psychiatrist or a psychologist, instead she works for an art university. A good majority of the article you link is devoted to the topic of circumcision. The whole sexual obsession thing is quite tiring. When all else things you resort to talk of sex as if it's an acceptable excuse for your position.\n \n Illogical fallacy. Your opinion counts for nothing with me. \n Please explain exactly what you mean by sexually dysfunctional. Do you mean impotent? Do you mean sterile? That's an awful broad term to be throwing around so freely and readily. Maybe you could qualify as sexually dysfunctional because you believe everything is sexually related.\n \n I must have hit a nerve. Why are you worried? \n Perhaps sexual dysfunction isn't the proper term to be using. Perhaps sexually obsessive is. Maybe to you and others like you everything has a phallic explanation because you're incapable of seeing otherwise. Perhaps while in school Sigmund Freud was beaten into you to the point you don't know anything else.\n \n \n Perhaps your stereotype of me, has gotten the best of you. \n Better to be thought a fool, than to open one's mouth and remove all doubt. \n And what do you say about black gun owners? Why the silence on that topic?\n \n I didn't make any distinction concerning race. I said \"all guns\". Race-baiting, much? \n As for the founding of America and what happened to those that were here before us that's simply too bad. In war you're either the victor or the loser and that's just how it is. There are no innocents in war except the civilians who are stuck in the location of the two fighting factions.\n \n Spoken like a true believer of the white man's manifest destiny. \n White people aren't exclusive in committing atrocious acts against others. We don't have a corner market on killing people that probably didn't deserve it. Take the Rwanda Genocide for example.\n\n \n Right. He's doing it, so what's the matter with me doing it, right? I'll take the Rwanda Genocide and raise you a Holocaust and a My Lai.", 
   {}, 
   429150, 
   null, 
   1304731200.0
  ], 
  [
   429152, 
   null, 
   "Freedom", 
   "It begins, ladies and gentlemen who know poet; a portrait for you.\n \n He accuses Pietro of race baiting\n \n \"who profitted from the labor of enslaved blacks, after stealing America from the indigenous peoples.\"", 
   {}, 
   429151, 
   null, 
   1304732400.0
  ], 
  [
   429157, 
   null, 
   "Pietro", 
   "War? Aren't you being a little melodramatic? And who are you to tell me what is justification and what isn't? I have just as much right to my views, no matter how extreme, as you have to yours.\n\n \n Melodrama is defined as performance characterized by exaggerated proportions and over the top delivery. My statement of war is certainly an acceptable comparison. In Heller and again in McDonald the Supreme Court ruled that gun ownership is a constitutionally recognized and protected right that belongs to the people. That means your position is an assault against the Constitution itself. In other words war. It doesn't matter if you don't agree with that analysis, that doesn't change the fact that you want to banish something that the Supreme Court said can't be banished.\n \n \nBS. You can't stick your objections.\n\n \n It's not BS. You claim your brother had a twisted obsession with handguns but you didn't elaborate on it in any way. I personally don't see disturbance as grounds for anything that involves altering the Constitution and enacting wide ranging and extreme changes.\n \n \nOh, please. You sound like a commercial for the NRA. Apparently you never grew up.\n\n \n You accuse me of never growing up when what I say is the simple truth? You accuse me of not growing up because I say that guns aren't toys and shouldn't be played with? How is that not a sign of maturity exactly? Can you elaborate on that or are you simply going to run away because you can't address the shortcomings in your own logic?\n \n \nIllogical fallacy. I'm against all guns. Period. They should be banned. Anyone caught with one ought to go to jail, or be shot on sight. Are you peeved yet?\n\n \n Rosie O'Donnell had a very similar position, except she didn't endorse the wholesale murder of people for simply exercising their constitutional rights. You on the other hand are doing just that. That hardly sounds like a member of the liberal party.\n \n You don't like that the people can freely own guns in a legal manner. That's simply too bad for you and people who share your views. It's not going to change regardless of the minute public outcry you try and generate. That would be like trying to repeal the 14th Amendment because racists didn't like the idea of blacks having equal rights under the law.\n \n \nI give a rat's booty what you believe. Did I ask you to comment. No, you just volunteered. Am I supposed to be moved by your words? I'm not.\n\n \n I don't care whether or not you're swayed by the opposition's opinion. Those who are committed to being wrong will fight to the death for the sake of maintaining their incorrect position because they know nothing else and can't comprehend the possibility of everything they were raised to believe as being nothing more than a lie.\n \n \nI'm from Chicago. What?\n\n \n Well that actually explains a lot.\n \n http://www.4forums.com/political/425502-post25.html\n \n Illinois Crime Rates 1960 - 2009\n \n HOMICIDE\n \n 2007: 752\n 2008: 790\n 2009: 773\n \n Total: 2,315\n \n Crime in Chicago - Wikipedia, the free encyclopedia\n \n HOMICIDE\n \n 2007: 442\n 2008: 510\n 2009: 458\n \n Total: 1,410\n \n Chicago accounts for approximately 25 percent of the total population of Illinois, but they're responsible for about 60 percent of the murders that occur in the state.\n \n \nIllogical fallacy. Your opinion counts for nothing with me.\n\n \n I don't care what your opinion of my opinion is. The facts about Camille Paglia speak for themselves. At least Galileo had history professors to cite for his nonsense but you don't even have that. Camille Paglia is little more than an art teacher, she has no credentials for determining what has a Freudian connection and what doesn't. She's no more an expert on the topic than an automotive mechanic would be. You might as well ask the school janitor for his opinion.\n \n Perhaps you should come back when you have an established and certified psychiatrist who is fully willing to support your position. Then I'll tear them down and discredit their arguments as well.\n \n \nI must have hit a nerve. Why are you worried?\n\n \n I have no need to worry, I simply wish for those I do battle with to be as specific as possible as it makes my job of dismantling them that much easier. Otherwise I have to elaborate on the different ways that their broad statement can be dismantled or misinterpreted and how they weren't on their game when they made the statement that they did.\n \n But even without you elaborating I can tell you this. There are too many gun owners who have children for your claim to have any basis in fact. Sexual dysfunction and parenthood don't go together as one prevents the other from occurring.\n \n \nPerhaps your stereotype of me, has gotten the best of you.\n Better to be thought a fool, than to open one's mouth and remove all doubt.\n\n \n You proved you were a fool when you started talking about \"white privilege\" when the question presented was how gun control rhetoric doesn't work on female gun owners. You used this thread as a base of operations for your racially motivated fallacies. You could have instead focused on how insults and crudeness doesn't work when addressing women but you didn't do that.\n \n \nI didn't make any distinction concerning race. I said \"all guns\". Race-baiting, much?\n\n \n I'm not the one who introduced race into the equation. Rather that one was your own fault and yours exclusively.\n \n \nSpoken like a true believer of the white man's manifest destiny.\n\n \n What \"white man's destiny\" are you referring to exactly? \n \n \nRight. He's doing it, so what's the matter with me doing it, right? I'll take the Rwanda Genocide and raise you a Holocaust and a My Lai.\n\n \n Do you really want to play this game Poet? Do you really want to be compiling lists of atrocities carried out by various ethnic groups to see what skin color is responsible for the most violence and evil in recorded history? Is it really going to come down to sheer body count here? Are you really going to resort to columns divided up into black, white, asian, mexican, etc. and see who has the highest tallies for murder and unspeakable acts?", 
   {}, 
   429151, 
   null, 
   1304741760.0
  ], 
  [
   429159, 
   null, 
   "zsu2357", 
   "=sinjin;429102]Millions of women own firearms. Most women want nothing to do with firearms. Most women would prefer the men in their lives felt likewise. Such is life.\n\n Not most I know,such IS life.\n \n \nWhat's the standing rule if they come to the door? emoticon_xclown\n\n \n Standing rule on that is:I point my finger down the road and say good bye.\n And if they don't get the hint I get rude.I don't discriminate, I do likewise with anyone trying to sell religion.emoticon_xangel", 
   {}, 
   429102, 
   null, 
   1304743260.0
  ], 
  [
   429160, 
   null, 
   "zsu2357", 
   "Guns and penises - Camille Paglia - Salon.com\n \n \"The gun as mutant penis: Men or women who abuse guns are equally sexually dysfunctional. The first question that popped into my mind about the Columbine killers was, \"What was their sex life like?\" It's very difficult to be a man in today's post-industrial culture, with its bland service-sector jobs and endless paper-shuffling deskwork. All you have before you is eternal tethering -- to parents, teachers, boss, wife. There's little room for genuine masculine adventure and achievement. And there are few men to admire -- which is why violent video games and action-adventure films have been thriving.\n \n You males whose courage, energy and ingenuity turned the global wilderness into civilization (and allowed women to emerge from the servitude of reproductive biology to become self-determining individuals) are not honored by the clichid ideologies of our time. From feminism to therapy, the ruling premise is the Sensitive Male, as talky as a woman as he gets in touch with his banal feelings. Natural, robust, assertive masculinity is defined as a disease from which society must be cured.\n \n You tartly cite Harvard psychoanalyst William Pollack, whose bestselling book, \"Real Boys,\" has been tirelessly promoted by Oprah Winfrey in her ever-lengthening chain of white male gurus and black earth mothers. I know from the testimony of friends that Pollack is a superb therapist. But I'm afraid I must agree with your skepticism about his approach to current social issues. His bookish milieu has little understanding of either athletics or war -- which are crucial to any historical analysis of masculinity.\"\n \n And I'm sorry if my analysis hit way too close to home. Many whites are precisely as I described them : sexually dysfunctional, operating with fantastic senses of entitlement and notions of superiority, are caught up in gun culture (a sure sign of immaturity and stunted development), who profitted from the labor of enslaved blacks, after stealing America from the indigenous peoples. Have I mischaracterized? - poet\n\n \n Damn Poet I didn't realize it was so complex to be a gun/s owner,I think I will turn them in and live a less complex life WHEW,anybody else?lolololololemoticon_rolleyesyour good you should have been a head psycho I mean psych.emoticon_smile", 
   {}, 
   429127, 
   null, 
   1304744100.0
  ], 
  [
   429161, 
   null, 
   "zsu2357", 
   "I'm an ex-cardiopulmonary tech (14 years). A published author. Musician, producer. Related to show biz royalty. Being considered for poet laureate of Houston. What you got?\n\n \n Apparently a head that's not as swollen as yours.If that sounds personal.It is.", 
   {}, 
   429141, 
   null, 
   1304744700.0
  ], 
  [
   429163, 
   null, 
   "Superlite27", 
   "Guns and penises - Camille Paglia - Salon.com\n \n The first question that popped into my mind about the Columbine killers was, \"What was their sex life like?\" \n\n \n This is an excerpt from Ms. Paglia's response to a letter in which she goes on to state she has no problem with the Second Amendment.\n \n Nice cherry picking. Way to capitalize on the sole object of your attention while simultaneously discarding the rest.\n \n Although, I find the statement perplexing. For all the \"penis compensation\" XXXX we gun owners supposedly partake in, you'd think we were the pinnacle of subliminal Freudian fixation.....\n \n ..and yet, I'm proud to say that, unlike those of poet's ilk, my first thoughts when contemplating mass murderers is not about how they choose to acheive orgasm. Who are the people with subliminal sexual fixations, again?\n \n \nI don't want anyone to have a gun, probably because I was a victim of gun violence in 1977, and have hated all guns since.\n\n \n Why, that awful gun! I'd be frightened of them to if I witnessed a firearm jump up and become violent of its own volition. Do you also hate knives? What about panty hose?\n \n There's been a handgun setting on my coffee table for over a week now. I've been keeping a very close eye on it, but so far, it hasn't acted the least bit violent. As a matter of fact, it hasn't moved on its own at all.\n \n BTW: Did this gun you witnessed being so violent HAVE A PERSON directing its action? If so, how does this person get complete absolution while the inanimate object receives the focus (gun violence)? When a person is bludgeoned to death, would this be stick violence? How about that serial killer that strangled those hookers a few years back? Think you'll have any returns on a Google search for \"Panty Hose Violence\"? Why, the people are just as dead. Think there's some folks out there trying to ban panty hose? If I were accosted by some murderer trying to strangle me with panty hose, I'd........blame the panty hose, too. After all, it's perfectly rational to blame inanimate objects for the actions performed by the people holding them, correct? According to poet, it's the OBJECT's fault while the person required to animate the object and put it to use gets absolved.\n \n Car's fault for drunk driving fatalities? Nope.\n Knife's fault for stabbing? No.\n Matchbook's fault for arson? Not at all.\n Garrot's fault for strangling? Nope.\n \n Those are some pretty violent deaths.\n \n Shooting? AAAAAH! GUN VIOLENCE! IT'S THE GUN'S FAULT!\n \n And yet.....it's gun owners who have a \"fixation\", right?\n \n If so, how come those gun owners aren't nearly as efficient at personification as those who insist on blaming a piece of metal? I can't think of any other hunk of wood, piece of steel, or scrap of material who gets the blame for any action I can think of. The gravel in my driveway isn't going to leap up and fly through my livingroom window by itself. I would suspect, upon finding a broken window and rocks in my livingroom, that SOMEBODY threw it. I would suspect, upon discovering a scratch down the side of my vehicle that SOMEBODY ran their car keys down it. No matter what action, or result of an action I observed, I would rationally conclude that a PERSON was required in order to put an inanimate object or TOOL to use in order to effect that action.\n \n Unless it's a gun. Then we gun owners (Remember, we folks who have some kind of hang-up about firearms?) have this novel idea that a person is required to cause it to act.\n \n Whereas, those like poet (remember, those who accuse gun owners of having hang-ups?) fail to notice their own effortless personification of a TOOL. \n \n GUN violence.\n \n I'm looking at my coffee table. Maybe poet can tell me how long before that pistol jumps up?", 
   {}, 
   429127, 
   null, 
   1304747460.0
  ], 
  [
   429164, 
   null, 
   "poet", 
   "This is an excerpt from Ms. Paglia's response to a letter in which she goes on to state she has no problem with the Second Amendment.\n \n Nice cherry picking. Way to capitalize on the sole object of your attention while simultaneously discarding the rest.\n \n Although, I find the statement perplexing. For all the \"penis compensation\" XXXX we gun owners supposedly partake in, you'd think we were the pinnacle of subliminal Freudian fixation.....\n \n ..and yet, I'm proud to say that, unlike those of poet's ilk, my first thoughts when contemplating mass murderers is not about how they choose to acheive orgasm. Who are the people with subliminal sexual fixations, again?\n \n \n \n Why, that awful gun! I'd be frightened of them to if I witnessed a firearm jump up and become violent of its own volition. Do you also hate knives? What about panty hose?\n \n There's been a handgun setting on my coffee table for over a week now. I've been keeping a very close eye on it, but so far, it hasn't acted the least bit violent. As a matter of fact, it hasn't moved on its own at all.\n \n BTW: Did this gun you witnessed being so violent HAVE A PERSON directing its action? If so, how does this person get complete absolution while the inanimate object receives the focus (gun violence)? When a person is bludgeoned to death, would this be stick violence? How about that serial killer that strangled those hookers a few years back? Think you'll have any returns on a Google search for \"Panty Hose Violence\"? Why, the people are just as dead. Think there's some folks out there trying to ban panty hose? If I were accosted by some murderer trying to strangle me with panty hose, I'd........blame the panty hose, too. After all, it's perfectly rational to blame inanimate objects for the actions performed by the people holding them, correct? According to poet, it's the OBJECT's fault while the person required to animate the object and put it to use gets absolved.\n \n Car's fault for drunk driving fatalities? Nope.\n Knife's fault for stabbing? No.\n Matchbook's fault for arson? Not at all.\n Garrot's fault for strangling? Nope.\n \n Those are some pretty violent deaths.\n \n Shooting? AAAAAH! GUN VIOLENCE! IT'S THE GUN'S FAULT!\n \n And yet.....it's gun owners who have a \"fixation\", right?\n \n If so, how come those gun owners aren't nearly as efficient at personification as those who insist on blaming a piece of metal? I can't think of any other hunk of wood, piece of steel, or scrap of material who gets the blame for any action I can think of. The gravel in my driveway isn't going to leap up and fly through my livingroom window by itself. I would suspect, upon finding a broken window and rocks in my livingroom, that SOMEBODY threw it. I would suspect, upon discovering a scratch down the side of my vehicle that SOMEBODY ran their car keys down it. No matter what action, or result of an action I observed, I would rationally conclude that a PERSON was required in order to put an inanimate object or TOOL to use in order to effect that action.\n \n Unless it's a gun. Then we gun owners (Remember, we folks who have some kind of hang-up about firearms?) have this novel idea that a person is required to cause it to act.\n \n Whereas, those like poet (remember, those who accuse gun owners of having hang-ups?) fail to notice their own effortless personification of a TOOL. \n \n GUN violence.\n \n I'm looking at my coffee table. Maybe poet can tell me how long before that pistol jumps up?\n\n \n Sorry, but your argument was hardly persuasive. If repeal of the 2nd amendment is up for vote, you best believe I'm voting in the affirmative. Bye bye guns. Bye bye jerks who love 'em.", 
   {}, 
   429163, 
   null, 
   1304752140.0
  ], 
  [
   429165, 
   null, 
   "Freedom", 
   "Why, that awful gun! I'd be frightened of them to if I witnessed a firearm jump up and become violent of its own volition. Do you also hate knives? What about panty hose?\n \n There's been a handgun setting on my coffee table for over a week now. I've been keeping a very close eye on it, but so far, it hasn't acted the least bit violent. As a matter of fact, it hasn't moved on its own at all.\n \n BTW: Did this gun you witnessed being so violent HAVE A PERSON directing its action? If so, how does this person get complete absolution while the inanimate object receives the focus (gun violence)? When a person is bludgeoned to death, would this be stick violence? How about that serial killer that strangled those hookers a few years back? Think you'll have any returns on a Google search for \"Panty Hose Violence\"? Why, the people are just as dead. Think there's some folks out there trying to ban panty hose? If I were accosted by some murderer trying to strangle me with panty hose, I'd........blame the panty hose, too. After all, it's perfectly rational to blame inanimate objects for the actions performed by the people holding them, correct? According to poet, it's the OBJECT's fault while the person required to animate the object and put it to use gets absolved.\n \n Car's fault for drunk driving fatalities? Nope.\n Knife's fault for stabbing? No.\n Matchbook's fault for arson? Not at all.\n Garrot's fault for strangling? Nope.\n \n Those are some pretty violent deaths.\n \n Shooting? AAAAAH! GUN VIOLENCE! IT'S THE GUN'S FAULT!\n \n And yet.....it's gun owners who have a \"fixation\", right?\n \n If so, how come those gun owners aren't nearly as efficient at personification as those who insist on blaming a piece of metal? I can't think of any other hunk of wood, piece of steel, or scrap of material who gets the blame for any action I can think of. The gravel in my driveway isn't going to leap up and fly through my livingroom window by itself. I would suspect, upon finding a broken window and rocks in my livingroom, that SOMEBODY threw it. I would suspect, upon discovering a scratch down the side of my vehicle that SOMEBODY ran their car keys down it. No matter what action, or result of an action I observed, I would rationally conclude that a PERSON was required in order to put an inanimate object or TOOL to use in order to effect that action.\n \n Unless it's a gun. Then we gun owners (Remember, we folks who have some kind of hang-up about firearms?) have this novel idea that a person is required to cause it to act.\n \n Whereas, those like poet (remember, those who accuse gun owners of having hang-ups?) fail to notice their own effortless personification of a TOOL. \n \n GUN violence.\n \n I'm looking at my coffee table. Maybe poet can tell me how long before that pistol jumps up?\n\n Superlite27, you realize that although a gun is a tool, like all weapons it is a tool with but one practical purpose; violence. Anti-gun people aren't claiming it's the guns fault they are claiming the violence wouldn't have happened or wouldn't be as bad without weapons.", 
   {}, 
   429163, 
   null, 
   1304752440.0
  ], 
  [
   429166, 
   null, 
   "zsu2357", 
   "Sorry, but your argument was hardly persuasive. If repeal of the 2nd amendment is up for vote, you best believe I'm voting in the affirmative. Bye bye guns. Bye bye jerks who love 'em.\n\n Well it's a good thing your vote counts for so many.emoticon_xbouncer", 
   {}, 
   429164, 
   null, 
   1304753880.0
  ], 
  [
   429167, 
   null, 
   "zsu2357", 
   "Superlite27, you realize that although a gun is a tool, like all weapons it is a tool with but one practical purpose; violence. Anti-gun people aren't claiming it's the guns fault they are claiming the violence wouldn't have happened or wouldn't be as bad without weapons.\n\n \n Well that's a big 10-4, but when you say weapons you mean guns?Because we all know that getting hacked up is more preferable.emoticon_idea", 
   {}, 
   429165, 
   null, 
   1304754300.0
  ], 
  [
   429170, 
   null, 
   "Doc Jones", 
   "Sorry, but your argument was hardly persuasive. If repeal of the 2nd amendment is up for vote, you best believe I'm voting in the affirmative. Bye bye guns. Bye bye jerks who love 'em.\n\n \n I'll let you in on something creep. \n \n If, IF you were really what you claimed to be instead of a darn poor liar, you would know that you are 9 times more likely to die at the hands of the medical profession than by any firearm. That's right, MEDICAL MISTAKES are the #1 killer according to CDC.\n \n If you had an education, IF, you would know that RIGHTS are not subject to majority opinion...nor even a vote. Rights are pre-existing and are not even subject to gov't approval and would exist even if they were not so protected and acknowledged in the Constitution.\n \n Where is your outrage at gov't actors like the ATF and DOJ in this administration that intentionally broke their own smuggling laws?\n \n You are a poor fraud and even a worse liar. Are you still stuck in the basement Raulito?", 
   {}, 
   429164, 
   null, 
   1304760120.0
  ], 
  [
   429171, 
   null, 
   "Doc Jones", 
   "Superlite27, you realize that although a gun is a tool, like all weapons it is a tool with but one practical purpose; violence. Anti-gun people aren't claiming it's the guns fault they are claiming the violence wouldn't have happened or wouldn't be as bad without weapons.\n\n \n You can take hope then! Coroners in Mexico at the last found mass graves have determined that most of the victims were killed with a sledge hammer emoticon_mad", 
   {}, 
   429165, 
   null, 
   1304760300.0
  ], 
  [
   429172, 
   null, 
   "Doc Jones", 
   "Mass graves in Mexico reveal new levels of savagery - The Washington Post\n \n \nBy Nick Miroff and William Booth, Published: April 24\n SAN FERNANDO, Mexico - At the largest mass grave site ever found in Mexico, where 177 bodies have been pulled from deep pits, authorities say they have recovered few bullet casings and little evidence that the dead were killed with a gun.\n \n Instead, most died of blunt force trauma to the head, and a sledgehammer found at the crime scene this month is believed to have been used in the executions, according to Mexican investigators and state officials. The search continued Sunday, with state officials warning they expect the count to rise.\n \n \n\n \n You just have to close the tool show loophole....", 
   {
    "unicode_changes_made": true
   }, 
   429171, 
   null, 
   1304764200.0
  ], 
  [
   429175, 
   null, 
   "Doc Jones", 
   "According to ACCT ,(association to control and confiscate tools), over 90% of all sledgehammers originate in the U.S. and call for stricter controls over straw purchasers who buy and sell these tools to unregistered and illegal buyers.\n \n \"...there must be something done to stop these deadly weapons from being used in the wrong hands\" said a spokesman for ACCT. \"We can do more to make it harder for these deadly tools to wind up in the wrong hands\" he said.\n \n \"First a strong registration scheme and a new agency to enforce and punish those who use them in criminal acts\", he continued, \"these deadly screwdrivers, icepicks and blunt instruments, especially sledgehammers must be more strictly controlled and only in the hands of qualified people such as the police and military.\"\n \n \"We have proof these tools have been used by cartels and criminals not only in home invasions and other crimes and homocide but can be concealed easily and these powerful assault tools are only used for destruction and should be limited to military and SWAT teams since their main purpose is to rapidly kill large numbers of people.\"\n \n \"...recall in Rwanda handled hoes, knives and clubs were used with government permission in a large act of genocide and these implements of violence must be removed from civilian hands unless they are trained and have a license to use them\", he continued. \"License and registration are key to safety of the children as are laws requiring people to lock them up when not in use and also not to loan them out to people who are unlicensed and kalifornia has a law we need to look at that requires penalties for not reporting stolen tools and requiring sold tools to individuals to be conducted in a licensed tool store and re-registered so we will know where they are\".\n \n \n Open carry will not be allowed and only concealed carry with strict background checks repeated yearly will be required. \"It is time for America to take tool safety seriously\", he said. \"Hammer abuse causes sexual impotence amoung frequent users\", he continued. \"It is like a phallic symbol people want to own to compensate for small sex organs and diminished desire\".\n \n Lock up those hammers and tools America chanted Sarah and Diane who agreed that complete confiscation was their goal; it is time for some common sense tool control in America and I would confiscate every hammer if I could said Diane. \"Imagine what would happen if we allowed these deadly tools in schools\", piped Sarah.\n ACCT is a for profit organization dedicated to disinfranchising every American and extorting fees and any rights possible to join today and get at the top of the ponzi scheme. emoticon_xhoho emoticon_xgood", 
   {}, 
   429172, 
   null, 
   1304768760.0
  ], 
  [
   429182, 
   null, 
   "poet", 
   "Damn Poet I didn't realize it was so complex to be a gun/s owner,I think I will turn them in and live a less complex life WHEW,anybody else?lolololololemoticon_rolleyesyour good you should have been a head psycho I mean psych.emoticon_smile\n\n \n Your vs You're - e Learn English Language\n \n When you learn English, get back with me.", 
   {}, 
   429160, 
   null, 
   1304776380.0
  ], 
  [
   429183, 
   null, 
   "poet", 
   "I'll let you in on something creep. \n \n If, IF you were really what you claimed to be instead of a darn poor liar, you would know that you are 9 times more likely to die at the hands of the medical profession than by any firearm. That's right, MEDICAL MISTAKES are the #1 killer according to CDC.\n \n If you had an education, IF, you would know that RIGHTS are not subject to majority opinion...nor even a vote. Rights are pre-existing and are not even subject to gov't approval and would exist even if they were not so protected and acknowledged in the Constitution.\n \n Where is your outrage at gov't actors like the ATF and DOJ in this administration that intentionally broke their own smuggling laws?\n \n You are a poor fraud and even a worse liar. Are you still stuck in the basement Raulito?\n\n \n \n Creep? Now did I say anything about your family? No. You're an idiot, just like the rest of the XXXXXX here. \n If? If? You don't know me. Don't pretend that you do. You're another gun crazie, who thinks like Charleton Heston...the only way they'll get your gun is to pry it from your cold hands.\n It's clear you're anti-government and pro-militia....the original intent of the \n 2nd amendment.....not valid anymore. Fascist.", 
   {}, 
   429170, 
   null, 
   1304776860.0
  ], 
  [
   429184, 
   null, 
   "Doc Jones", 
   "Creep? Now did I say anything about your family? No\n. \n \n Did I say anything about your family?\n \n \nYou're an idiot, just like the rest of the XXXXXX here. \n If? If? You don't know me. Don't pretend that you do.\n\n \n I don't want to know you and you are doing my job easier by your ad homs. My job is to hold the mirror up to nature and make you look as bad as you are :)\n \n \nYou're another gun crazie, who thinks like Charleton Heston...the only way they'll get your gun is to pry it from your cold hands.\n It's clear you're anti-government and pro-militia....the original intent of the \n 2nd amendment.....not valid anymore. Fascist.\n\n \n Have you seen your militia lately?\n United States Code: Title 10,311. Militia: composition and classes | LII / Legal Information Institute\n \n(a) The militia of the United States consists of all able-bodied males at least 17 years of age and, except as provided in section 313 of title 32, under 45 years of age who are, or who have made a declaration of intention to become, citizens of the United States and of female citizens of the United States who are members of the National Guard. \n (b) The classes of the militia are- \n (1) the organized militia, which consists of the National Guard and the Naval Militia; and \n (2) the unorganized militia, which consists of the members of the militia who are not members of the National Guard or the Naval Militia\n\n \n Are you doing your militia duty? The law of the land is that the militia is you...and me and every true citizen. That is pro government in this Republic.\n \n Since when did it become invalid? Serving as a group is NOT a necessity to own firearms as the Supreme Court ruled in McDonald ruled it is a personal and FUNDAMENTAL RIGHT.\n \n You really are out of your league aren't you pot licker? emoticon_xclown", 
   {
    "unicode_changes_made": true
   }, 
   429183, 
   null, 
   1304778420.0
  ], 
  [
   429185, 
   null, 
   "poet", 
   ". \n \n Did I say anything about your family?\n \n \n \n I don't want to know you and you are doing my job easier by your ad homs. My job is to hold the mirror up to nature and make you look as bad as you are :)\n \n \n \n Have you seen your militia lately?\n United States Code: Title 10,311. Militia: composition and classes | LII / Legal Information Institute\n \n \n Are you doing your militia duty? The law of the land is that the militia is you...and me and every true citizen. That is pro government in this Republic.\n \n Since when did it become invalid? Serving as a group is NOT a necessity to own firearms as the Supreme Court ruled in McDonald ruled it is a personal and FUNDAMENTAL RIGHT.\n \n You really are out of your league aren't you pot licker? emoticon_xclown\n\n \n No. I simply despise violent types and those that lobby to get their \"violence\" on. Admit it. You simply like shooting and killing things, and undoubtedly, \"blowing up\" things. It's primeval. Man at his basest. You're the reason we have war....war is simply the mind's quest to be right at the expense of making others wrong at the global level. Some folks would rather die in their quest to be right...which makes no sense. \n You're preaching to the absolute \"wrongest\" one. I can't hear you, because I never drank that koolaid. Get ready to be thwarted and frustrated. Talk to the hand. You're on ignore. Bye.", 
   {}, 
   429184, 
   null, 
   1304778720.0
  ], 
  [
   429186, 
   null, 
   "Doc Jones", 
   "No. I simply despise violent types and those that lobby to get their \"violence\" on. Admit it.\n \n \n Read my posts and then read yours and see who is unstable and violent. I leave the question to the readers and lukers...I post not to thee :)\n \n \nYou simply like shooting and killing things, and undoubtedly, \"blowing up\" things. It's primeval. Man at his basest.\n \n \n You mean the sledgehammer murders are much more desireable than shooting? Have you not heard if you live by the hammer you will die by the hammer? In your case, you will probably starve without nanny feeding you emoticon_xclown \n \n \nYou're the reason we have war....war is simply the mind's quest to be right at the expense of making others wrong at the global level. Some folks would rather die in their quest to be right...which makes no sense.\n\n \n There are two kinds of war, political and economic. Wars are a government action and has nothing to do with me nor any other gun owner.\n \n \nYou're preaching to the absolute \"wrongest\" one. I can't hear you, because I never drank that koolaid. Get ready to be thwarted and frustrated. Talk to the hand. You're on ignore. Bye.\n\n \n Come back when you can and get your rump handed to you in your hat again. emoticon_smile", 
   {}, 
   429185, 
   null, 
   1304779500.0
  ], 
  [
   429188, 
   null, 
   "Superlite27", 
   "Superlite27, you realize that although a gun is a tool, like all weapons it is a tool with but one practical purpose; violence. Anti-gun people aren't claiming it's the guns fault they are claiming the violence wouldn't have happened or wouldn't be as bad without weapons.\n\n \n Very good point, but.......\n \n .....maybe you could then tell me why police officers insist on carrying the violent objects?\n \n According to your point above, it would be to intentionally promote violence.\n \n You are also continuing the object blame. The violence wouldn't be as bad wihout weapons? Define weapon.\n \n Most stabbings would be less harmful without knives.\n \n Beatings would be a heckuva lot less lethal without blunt objects.\n \n Stranglings wouldn't be as easy to accomplish without cordlike material.\n \n Yet, I almost always see the person blamed for their criminal activity using these objects. Wouldn't these violent acts also be less harmful without the inanimate objects used to commit them? Of course, none of them are a tool that ignites a powder causing compression to force a metal object quickly out of a tube. THOSE tools get special consideration. There is some wierd supernatural force that imbues only THOSE with their own moral personification (Unless one posesses a shiny metal disk issued by the government.)\n \n Choke someone to death....you're a strangler.\n Beat someone to death....you're a bludgeoner.\n Slip some arsenic into a person's coffee...you're a poisoner.\n \n Shoot someone......THEY WERE A VICTIM OF GUN VIOLENCE! The evil GUN did it! Or, according to Freedom, they're somehow more dead than the previous victims. After all, having a cord wrapped around one's neck and tightened until the brain is starved of oxygen....how does it go?......\"wouldn't be as bad\". \n \n Yeah. Getting killed with the thousands of other items like candle sticks, lead pipes, lawnmower blades, cyanide, anti-freeze, BEING LIT ON FIRE WHILE ASLEEP, tree branches, telephone cord, and the uncountable other mundane items humans use to inflict violence on each other gets pushed to the back burner.....\n \n ....there's a special place reserved for folks who get a hole poked in them by a fast moving chunk of metal.", 
   {}, 
   429186, 
   null, 
   1304780400.0
  ], 
  [
   429190, 
   null, 
   "Superlite27", 
   "I don't want anyone to have a gun, probably because I was a victim of gun violence in 1977, and have hated all guns since.\n\n \n I'm still trying to wrap my head around this one.\n \n I was savagely attacked and mauled by a dog when I was eight.\n \n Therefore, it should make perfectly good sense to poet that we should refuse to allow anyone to keep one as a pet. Insisting that, since I was a victim, EVERYONE ELSE should face some kind of restriction based on my experience is perfectly logical.\n \n Good thing poet didn't get beaten with a coat hanger as a kid. What would folks hang their clothes on after a successful campaign to forbid folks from owning coat hangers?\n \n After all, hatred of an inanimate object based solely upon how another person decides to use it doesn't reek of projectionism and displaced emotion, right?\n \n Don't forget....it's we gun owners with deep seated mental problems. Not folks who hate tools. (Sorry...A tool. The rest are absolved of their bad behavior.)", 
   {}, 
   429188, 
   null, 
   1304781300.0
  ], 
  [
   429192, 
   null, 
   "poet", 
   "I'm still trying to wrap my head around this one.\n \n I was savagely attacked and mauled by a dog when I was eight.\n \n Therefore, it should make perfectly good sense to poet that we should refuse to allow anyone to keep one as a pet. Insisting that, since I was a victim, EVERYONE ELSE should face some kind of restriction based on my experience is perfectly logical.\n \n Good thing poet didn't get beaten with a coat hanger as a kid. What would folks hang their clothes on after a successful campaign to forbid folks from owning coat hangers?\n \n After all, hatred of an inanimate object based solely upon how another person decides to use it doesn't reek of projectionism and displaced emotion, right?\n \n Don't forget....it's we gun owners with deep seated mental problems. Not folks who hate tools. (Sorry...A tool. The rest are absolved of their bad behavior.)\n\n \n By that logic, what's wrong with everyone having nuclear weapons? After all it's not the nuclear weapons we have to fear, but the careless hands of the imbeciles who have them. \n All you Neanderthals can go to Hades...shoot up everybody. I don't care. You won't be happy until you do. Just don't call it 'hunting\".", 
   {}, 
   429190, 
   null, 
   1304786820.0
  ], 
  [
   429193, 
   null, 
   "Doc Jones", 
   "By that logic, what's wrong with everyone having nuclear weapons? After all it's not the nuclear weapons we have to fear, but the careless hands of the imbeciles who have them. \n All you Neanderthals can go to Hades...shoot up everybody. I don't care. You won't be happy until you do. Just don't call it 'hunting\".\n\n \n Nukes tear up the deer, elk and birds too bad. emoticon_rolleyes", 
   {}, 
   429192, 
   null, 
   1304787540.0
  ], 
  [
   429194, 
   null, 
   "Pietro", 
   "Sorry, but your argument was hardly persuasive. If repeal of the 2nd amendment is up for vote, you best believe I'm voting in the affirmative. Bye bye guns. Bye bye jerks who love 'em.\n\n \n Oh really? And how exactly do you propose carrying that out? Even if you did manage to get the Second Amendment repealed, exactly how would you go about getting rid of the hundreds? They aren't going to just magically disappear off the face of the planet and out of the hands of the people who own them. What to you propose then? Are you going to form task forces to go door to door and look for guns to confiscate? The practicalities of such an operation would be stacked against you. It would be physically impossible for the small number of government agents to effectively search every conceivable hiding place somebody might stash a gun.\n \n Of course this only takes into account the number of guns that the government actually knows about, the ones they can actually look up and locate the owner and their address of residence. There's an unknown number of unregistered and untraceable guns out there in the private sector and nobody knows where they are. How do you propose getting them out of circulation without transforming into a police state where government thugs can kick down your doors and ransack your house without a permit?\n \n I'd really love to hear your idea for how to make your plan work. You can't just say ban guns or repeal the Second Amendment and expect that to be the end of it. You've got to commit to the long haul for making your plan actually work and be feasible in nature.\n \n \nIf? If? You don't know me. Don't pretend that you do. You're another gun crazie, who thinks like Charleton Heston...the only way they'll get your gun is to pry it from your cold hands.\n\n \n Gun crazy you say? What exactly is crazy about the Constitution? Are you going to label some book as \"book crazies\" or \"privacy nuts\" next?\n \n \nIt's clear you're anti-government and pro-militia....the original intent of the 2nd amendment.....not valid anymore. Fascist.\n\n \n There's nothing wrong with being critical of the government and its actions, especially recently with the budget mishandling they've carried out. Misappropriation of funds, unauthorized bailouts, Obamacare, etc. Anybody who has blind loyalty to the government and believes that they can do no wrong is a serious threat to the safety and well being of the country.\n \n \nNo. I simply despise violent types and those that lobby to get their \"violence\" on.\n\n \n You claim you despise violence, and yet you want to make others suffer because you were a victim a long time ago. That's highly contradictory of you. You also seem to blindly worship government like it's your god and master, yet government is responsible for a great many acts of violence against their people. Look at the Holocaust you cited earlier, carried out by the ruling government at the time.\n \n \nAdmit it. You simply like shooting and killing things, and undoubtedly, \"blowing up\" things.\n\n \n You've been reported on this line of insult. Suggesting that gun owners enjoy causing senseless death and devastation is highly inflammatory and has no basis in reality. If this were true nobody would own small guns. Nobody would be satisfied with anything less than .50 caliber rifles and AP rounds.\n \n \nIt's primeval. Man at his basest. You're the reason we have war....war is simply the mind's quest to be right at the expense of making others wrong at the global level. Some folks would rather die in their quest to be right...which makes no sense.\n\n \n Are you saying that women are incapable of the same ideals as men? Are women lesser than men in your eyes?\n \n \nYou're preaching to the absolute \"wrongest\" one. I can't hear you, because I never drank that koolaid. Get ready to be thwarted and frustrated. Talk to the hand. You're on ignore. Bye.\n\n \n And you're nothing more than a troll who cares less about honest debate and more about hurling sexual insults because of your own inadequacies. I'll bet your supposed victimization back in 1977 was you shooting yourself in the foot.\n \n \nBy that logic, what's wrong with everyone having nuclear weapons? After all it's not the nuclear weapons we have to fear, but the careless hands of the imbeciles who have them. All you Neanderthals can go to Hades...shoot up everybody. I don't care. You won't be happy until you do. Just don't call it 'hunting\".\n\n \n Don't even try and bring nuclear material into this discussion. Anybody who could look at a handgun and a nuclear warhead and say they see no difference obviously isn't interested in the truth.", 
   {}, 
   429164, 
   null, 
   1304787960.0
  ], 
  [
   429195, 
   null, 
   "poet", 
   "Oh really? And how exactly do you propose carrying that out? Even if you did manage to get the Second Amendment repealed, exactly how would you go about getting rid of the hundreds? They aren't going to just magically disappear off the face of the planet and out of the hands of the people who own them. What to you propose then? Are you going to form task forces to go door to door and look for guns to confiscate? The practicalities of such an operation would be stacked against you. It would be physically impossible for the small number of government agents to effectively search every conceivable hiding place somebody might stash a gun.\n \n Of course this only takes into account the number of guns that the government actually knows about, the ones they can actually look up and locate the owner and their address of residence. There's an unknown number of unregistered and untraceable guns out there in the private sector and nobody knows where they are. How do you propose getting them out of circulation without transforming into a police state where government thugs can kick down your doors and ransack your house without a permit?\n \n I'd really love to hear your idea for how to make your plan work. You can't just say ban guns or repeal the Second Amendment and expect that to be the end of it. You've got to commit to the long haul for making your plan actually work and be feasible in nature.\n \n \n \n Gun crazy you say? What exactly is crazy about the Constitution? Are you going to label some book as \"book crazies\" or \"privacy nuts\" next?\n \n \n \n There's nothing wrong with being critical of the government and its actions, especially recently with the budget mishandling they've carried out. Misappropriation of funds, unauthorized bailouts, Obamacare, etc. Anybody who has blind loyalty to the government and believes that they can do no wrong is a serious threat to the safety and well being of the country.\n \n \n \n You claim you despise violence, and yet you want to make others suffer because you were a victim a long time ago. That's highly contradictory of you. You also seem to blindly worship government like it's your god and master, yet government is responsible for a great many acts of violence against their people. Look at the Holocaust you cited earlier, carried out by the ruling government at the time.\n \n \n \n You've been reported on this line of insult. Suggesting that gun owners enjoy causing senseless death and devastation is highly inflammatory and has no basis in reality. If this were true nobody would own small guns. Nobody would be satisfied with anything less than .50 caliber rifles and AP rounds.\n \n \n \n Are you saying that women are incapable of the same ideals as men? Are women lesser than men in your eyes?\n \n \n \n And you're nothing more than a troll who cares less about honest debate and more about hurling sexual insults because of your own inadequacies. I'll bet your supposed victimization back in 1977 was you shooting yourself in the foot.\n \n \n \n Don't even try and bring nuclear material into this discussion. Anybody who could look at a handgun and a nuclear warhead and say they see no difference obviously isn't interested in the truth.\n\n \n It's not so funny when the rabbit has the gun is it? Run. Run, rabbit, run. \n Reported? How chickens***.\n Were your widdle feewins hoit? I forgot to add \"bloodthirsty\", and callous. \n Repeal the g.d. 2nd amendment. Quick, fast, and in a hurry, And if you don't like it...bite me.", 
   {}, 
   429194, 
   null, 
   1304788740.0
  ], 
  [
   429196, 
   null, 
   "Tither", 
   "I'm an ex-cardiopulmonary tech (14 years). A published author. Musician, producer. Related to show biz royalty. Being considered for poet laureate of Houston. What you got?\n\n Quite an impressive resume, and I hate to see you get off on the wrong foot. So excuse me for saying so, all I have see you do is to lay out quite a bit of B.S. and offensive stereotyping as well. Is that what you came here to do? Prove that you can be yet another chimp flinging poo?\n \n I guess I am asking, is this the impression you want to leave? You have time to change that impression, if you care to. But maybe you don't. I don't know.\n \n Your resume suggests that you have the ability to lay out an impressive argument. This is a personal suggestion, and you can take it for what it is worth, but I suggest you take a different tact, and do so. Maybe you have already have figured this out, and perhaps that scares you a bit, but both Bryan and Pietro are you equals. \n \n Let me just say that you are entitled to your opinion! That is not anything anyone here wants to dispute. I am sure your experience was quite traumatic, however I have an experience that is opposite than yours, where a gun saved me, because it was available for me. Criminals, predators, and thugs are going to be here weather we want them to be or not. Don't lump them in with the law abiding. \n \n If the only purpose of a gun is to kill and hurt people, then all of mine must be horribly defective. I'm 63. I have shot 100's of thousands of rounds at skeet, trap, and a variety of targets, and have never hurt anyone. There are approximately 300 million guns in the U.S., and less than one percent have ever been used in a crime or a killing or hurting situation. So maybe, just maybe you could be wrong in your stereotyping. Please don't overlook the fact that you are painting a huge number of law-abiding people with that offensive brush. This is, after all, an Inalienable, constitutionally recognized as protected right that you are walking all over. \n \n The purpose of a car is not to kill, and yet it kills far more often than guns do. It is just a byproduct of it's lawful use, and humans are thin skinned and fragile beings. Because they kill, that does not justify them being banned.", 
   {}, 
   429141, 
   null, 
   1304790600.0
  ], 
  [
   429198, 
   null, 
   "Pietro", 
   "It's not so funny when the rabbit has the gun is it? Run. Run, rabbit, run. \n Reported? How chickens***.\n Were your widdle feewins hoit? I forgot to add \"bloodthirsty\", and callous.\n\n \n Perhaps you should familiarize yourself with the board rules. You know the rules that we're all bound by and required to follow, you included.\n \n 4Forums.com Political Debates and Polls - FAQ: 4Forums.com FAQ\n \n 3. Any posts deemed offensive or self-serving will be deleted or otherwise censored without notice. \n a) No Personal attacks, insults, name calling, offensive generalizations, or labeling.\n \n 5. Do not be disruptive. You will be banned if we receive complaints from other posters.\n a) You are required to be willing to engage in honest debate, which requires reading links and responding to legitimate questions. If not you will be banned. \n \n 7. Bigoted, racist, prejudiced or broad-brushed statements are not allowed. \n \n 12. Do not make a nuisance of yourself, you will be banned if you require too much of the moderators time. \n \n If you can't abide by the rules like everyone else then you'll be banned and your notion of \"white privilege\" will be disgraced in your absence. Just ask J Miro about what happened to him.\n \n \nRepeal the g.d. 2nd amendment. Quick, fast, and in a hurry, And if you don't like it...bite me.\n\n \n What's the matter? You can't address the fact that such a plan is physically impossible to carry out?\n \n Mexico has no Second Amendment, but the country is awash in some of the most bloody violence we've seen in the modern age outside of the conflict in Iraq and Afghanistan. None of those weapons possessed by the drug cartel are legal and the government is helpless to do anything about it.\n \n What do you have to say on that issue of Mexico, Poet? Are the guns simply not illegal enough yet? Or are you going to continue disobeying the rules in order to hurl cheap insults and run away from debating opponents who are beyond your skill level?", 
   {}, 
   429195, 
   null, 
   1304792400.0
  ], 
  [
   429200, 
   null, 
   "Freedom", 
   "Well that's a big 10-4, but when you say weapons you mean guns?Because we all know that getting hacked up is more preferable.emoticon_idea\n\n No I mean weapons. A weapon is defined as a tool used for violence, so if one was claiming that guns were innately dangerous because they made attacks more effective that standard would apply to all tools which do so.\n \n A bronze sword is hardly a match for a gun, but back when it was invented it allowed soldiers and travelers to kill prospective attackers who used only clubs and bare hands. Instead of an increase in violence civilization began to spread. There was violence in these civilizations of course but compared to the tribal wars that persisted for a hundred thousand years and would in places persist up to present day it was a peaceful day at the beach.\n \n One must note there are two very distinct camps on weapon control. The first are pacifist, they rue the day people made the first real weapons (weapons which were so powerful their intended purpose was military conflict). The second are people who accept weapons as necessary, they just think the army should be the only ones who use them.\n \n The second camp has won out more often than not because if the army of a nation keeps it's citizens safe they tend not to feel the need for weapons in any case. Some notable exceptions are cultures in which the army is seen as a civic responsibility and not just the sole realm of professionals paid for by the state. Ancient greece is an excellent example.\n \n \nIf you had an education, IF, you would know that RIGHTS are not subject to majority opinion...nor even a vote. Rights are pre-existing and are not even subject to gov't approval and would exist even if they were not so protected and acknowledged in the Constitution.\n\n Bravo!\n \n \nCreep? Now did I say anything about your family? No. You're an idiot, just like the rest of the XXXXXX here. \n If? If? You don't know me. Don't pretend that you do. You're another gun crazie, who thinks like Charleton Heston...the only way they'll get your gun is to pry it from your cold hands.\n It's clear you're anti-government and pro-militia....the original intent of the \n 2nd amendment.....not valid anymore. Fascist.\n\n Rofl! You advocate the removal of all military power to the government but your not the fascist?\n \n \n.....maybe you could then tell me why police officers insist on carrying the violent objects?\n\n Soldiers use weapons because their job is primarily the use of physical force.\n \n \nAccording to your point above, it would be to intentionally promote violence.\n\n Just because one has a hammer in one's belt does it mean one intends to nail something. A weapon does not promote violence but it's only purpose is violence, in this case to be prepared for the violence of an attack.\n \n \nYou are also continuing the object blame.\n\n I was pointing out that I haven't ever seen anyone sane blame the weapon itself (poet is not sane).\n \n \nThe violence wouldn't be as bad wihout weapons? Define weapon.\n\n any instrument or device for use in attack or defense in combat, fighting, or war, as a sword, rifle, or cannon. \n \n \nMost stabbings would be less harmful without knives.\n\n Stabbings would be impossible without knives but that doesn't mean a knife is necessarily a weapon.\n \n \nBeatings would be a heckuva lot less lethal without blunt objects.\n \n Stranglings wouldn't be as easy to accomplish without cordlike material.\n\n This is the confusion I was worried you were having. You are confusing weapons and non-weapons on the criteria that non-weapons can be re-purposed to violence. That doesn't mean that is what they were designed for and it is no contradiction for someone to advocate the removal of weapons without advocating anything that could be used as a weapon.\n \n \nYet, I almost always see the person blamed for their criminal activity using these objects. Wouldn't these violent acts also be less harmful without the inanimate objects used to commit them? Of course, none of them are a tool that ignites a powder causing compression to force a metal object quickly out of a tube. THOSE tools get special consideration.\n\n Actually it's more like the most advanced weapon an average person can afford at the time seems to be the pattern. It depends on the cultures idea about the highest military power. In a country where the military uses bows and arrows to great effect people try to control those. In a country like Rome where swords and shields but not so much spears and knives were considered the best weapons it was the swords and shields that were suspicious in the hands of plebeians (well before the Marian reforms).\n \n \nOr, according to Freedom, they're somehow more dead than the previous victims. After all, having a cord wrapped around one's neck and tightened until the brain is starved of oxygen....how does it go?......\"wouldn't be as bad\". \n\n That is an intentional and very directed gap in imagination and you know it. If two guys get into a fight and they start beating each other up but the moment of rage passes and they stop the damage has been far less than if in the moment of rage one guy shoots the other in the chest.\n \n It's what people are doing when they aren't thinking rationally not the other way around that scares anti-gun people.\n \n For instance I know someone who had a gun aimed at them by someone who was very mad at the traffic (apparently in his enraged mind it was the car in front of him that did it not the parking lot that extended to the horizon).\n \n A person who threatens an innocent civilian for no purpose is not securing themselves, they are using the vastly superior military strength of a firearm to scare another person half to death. What if he had a panty hose instead? She could have just rolled up the window.\n \n So I am talking about 'more dead', more people dead.\n \n I am not against people owning weapons, but you shouldn't engage in sophistry to defend that. You must admit that any weapon is orders of magnitude more effective as a weapon than an object that was not designed to be a weapon and that modern firearms are the pinnacle of that truth.\n \n \nLook at the Holocaust you cited earlier, carried out by the ruling government at the time.\n\n He's immune to those analogies, apparently he doesn't share enough genetic material with the master race to absorb their guilt through the collective consciousness.\n \n \nAnd you're nothing more than a troll who cares less about honest debate and more about hurling sexual insults because of your own inadequacies. I'll bet your supposed victimization back in 1977 was you shooting yourself in the foot.\n\n Sexual insults, racial insults, political insults... in fact I haven't seen much more than insults period.\n \n \nDon't even try and bring nuclear material into this discussion. Anybody who could look at a handgun and a nuclear warhead and say they see no difference obviously isn't interested in the truth.\n\n There is a difference, a nuclear weapon is very very powerful in comparison to a hand gun.\n \n With it you might be able to defend yourself from an entire army and not just a mugger.", 
   {}, 
   429195, 
   null, 
   1304793300.0
  ], 
  [
   429201, 
   null, 
   "poet", 
   "Perhaps you should familiarize yourself with the board rules. You know the rules that we're all bound by and required to follow, you included.\n \n 4Forums.com Political Debates and Polls - FAQ: 4Forums.com FAQ\n \n 3. Any posts deemed offensive or self-serving will be deleted or otherwise censored without notice. \n a) No Personal attacks, insults, name calling, offensive generalizations, or labeling.\n \n 5. Do not be disruptive. You will be banned if we receive complaints from other posters.\n a) You are required to be willing to engage in honest debate, which requires reading links and responding to legitimate questions. If not you will be banned. \n \n 7. Bigoted, racist, prejudiced or broad-brushed statements are not allowed. \n \n 12. Do not make a nuisance of yourself, you will be banned if you require too much of the moderators time. \n \n If you can't abide by the rules like everyone else then you'll be banned and your notion of \"white privilege\" will be disgraced in your absence. Just ask J Miro about what happened to him.\n \n \n What is that supposed to scare me? I've been banned from scores of forums, seeking to silence the opposition. More white privilege. So friggn what?\n I only came here to deal with JPSartre who harrassed me in another forum...and as forums go, this one is pretty lame and clueless...so, no huge loss for me, should something happen. \n \n What's the matter? You can't address the fact that such a plan is physically impossible to carry out?\n \n Mexico has no Second Amendment, but the country is awash in some of the most bloody violence we've seen in the modern age outside of the conflict in Iraq and Afghanistan. None of those weapons possessed by the drug cartel are legal and the government is helpless to do anything about it.\n \n What do you have to say on that issue of Mexico, Poet? Are the guns simply not illegal enough yet? Or are you going to continue disobeying the rules in order to hurl cheap insults and run away from debating opponents who are beyond your skill level?\n\n \n \n More xenophobia. Mexicans? Blacks? What? No Russians? Probably because they define what it means to be Caucasian.\n What kind of a name is Pietro? Not very white sounding, but here you are \"taking up the cause\". Sounds like an immigrant name to me. \n I'm not impressed. Anybody else here, with the intellect and the smarts to engage me? ", 
   {}, 
   429198, 
   null, 
   1304796360.0
  ], 
  [
   429205, 
   null, 
   "Pietro", 
   "[COLOR=&quot;darkred&quot;]What is that supposed to scare me? I've been banned from scores of forums, seeking to silence the opposition. More white privilege. So friggn what? I only came here to deal with JPSartre who harrassed me in another forum...and as forums go, this one is pretty lame and clueless...so, no huge loss for me, should something happen.\n\n \n Well that's too bad because you don't get any choice on the matter. Obey the rules or get banned from the site. Those are the only two choices that any member is allowed to make. There's no third option that can be taken, there's no ignoring what's inconvenient because you don't like it. That's simply not how it works.\n \n Now do you care to elaborate on how you would go about removing guns from the people if you ever managed to have the Second Amendment repealed? Or would you like to address the fact that over two thirds of the states have their own keep and bear arms provisions that would remain in place even if the federal protections were to disappear?\n \n \nMore xenophobia. Mexicans? Blacks? What? No Russians? Probably because they define what it means to be Caucasian.\n\n \n I have no reason to mention Russia because they're not currently involved in a massive drug war, or government sanctioned genocide against dissidents and innocent civilians. Which \"white nations\" are currently killing their own people on a scale comparable to Rwanda?\n \n \nWhat kind of a name is Pietro? Not very white sounding, but here you are \"taking up the cause\". Sounds like an immigrant name to me. \n I'm not impressed. Anybody else here, with the intellect and the smarts to engage me?\n\n \n What kind of name is Poet? Sounds more like a description of talents than a title of personal being. It's like Janitor or Fry Cook or even Bell Hop. If you wish to have an honest, open and intellectual debate I'm all ears. I'll gladly go into detail discussing the impossibilities of trying to rid America of all the millions of guns in circulation. I'll even cover matters like budget restraints that keep the government from growing any further. But I refuse to indulge you in your discussion of \"white privilege\" and the nonsense that gun ownership is a substitution for sexual prowess.", 
   {}, 
   429201, 
   null, 
   1304798340.0
  ], 
  [
   429209, 
   null, 
   "Doc Jones", 
   "More xenophobia. Mexicans? Blacks? What? No Russians? Probably because they define what it means to be Caucasian.\n What kind of a name is Pietro? Not very white sounding, but here you are \"taking up the cause\". Sounds like an immigrant name to me. \n I'm not impressed. Anybody else here, with the intellect and the smarts to engage me? \n\n \n You have been engaged and had your rump handed to you in your hat at least 3 or 4 times.\n \n JpSarte hasn't posted on this board even before the last time you posted here Miro. You and the lovely Ms. M can hit the circus circuit.\n \n You, as I have stated earlier, are a liar, fraud and a sham. You have no education, no creds and I doubt any interest in rights, especially 2A rights. Your attempts at debate are lame and without basis and you are incapable of debate. When the moderator connects your sign in you will be BANNED AGAIN.\n \n You couldn't carry a thought in a bucket.", 
   {}, 
   429201, 
   null, 
   1304800500.0
  ], 
  [
   429211, 
   null, 
   "Doc Jones", 
   "More xenophobia. Mexicans? Blacks? What? No Russians? Probably because they define what it means to be Caucasian.\n What kind of a name is Pietro? Not very white sounding, but here you are \"taking up the cause\". Sounds like an immigrant name to me. \n I'm not impressed. Anybody else here, with the intellect and the smarts to engage me? \n\n \n \nI only came here to deal with JPSartre who harrassed me in another forum...and as forums go, this one is pretty lame and clueless...so, no huge loss for me, should something happen. \n \n \n\n \n He isn't here, hasn't been here in a long time and is a poor excuse since you lost your attempt to disrupt the board and fool people with claims of imaginary talent which you are sorely lacking. Beat it!", 
   {}, 
   429201, 
   null, 
   1304801520.0
  ], 
  [
   429220, 
   null, 
   "poet", 
   "Well that's too bad because you don't get any choice on the matter. Obey the rules or get banned from the site. Those are the only two choices that any member is allowed to make. There's no third option that can be taken, there's no ignoring what's inconvenient because you don't like it. That's simply not how it works.\n \n Please. I do as I like...and if that gets me banned, so be it. The only way to silence me is to banish me. You, apparently are a pleb and don't run anything. \n Now do you care to elaborate on how you would go about removing guns from the people if you ever managed to have the Second Amendment repealed? Or would you like to address the fact that over two thirds of the states have their own keep and bear arms provisions that would remain in place even if the federal protections were to disappear?\n \n No. I don't care to elaborate about anything with you. \n \n I have no reason to mention Russia because they're not currently involved in a massive drug war, or government sanctioned genocide against dissidents and innocent civilians. Which \"white nations\" are currently killing their own people on a scale comparable to Rwanda?\n \n \n More racism and bigotry, but justified, right, because it's black people. And Russia is as corrupt as the US, if not more. You can't sell me any wolf tickets. \n \n What kind of name is Poet? Sounds more like a description of talents than a title of personal being. It's like Janitor or Fry Cook or even Bell Hop. If you wish to have an honest, open and intellectual debate I'm all ears. I'll gladly go into detail discussing the impossibilities of trying to rid America of all the millions of guns in circulation. I'll even cover matters like budget restraints that keep the government from growing any further. But I refuse to indulge you in your discussion of \"white privilege\" and the nonsense that gun ownership is a substitution for sexual prowess.\n\n \n \n \n Poet, is the name I chose because it's what I am. I'm up for consideration for poet laureate of Houston, Texas. Problem? \n I don't care to indulge you at all....you have a bad attitude. ", 
   {}, 
   429205, 
   null, 
   1304811060.0
  ], 
  [
   429228, 
   null, 
   "gansao", 
   "Poet, is the name I chose because it's what I am. I'm up for consideration for poet laureate of Houston, Texas. Problem? \n I don't care to indulge you at all....you have a bad attitude. \n\n \n Not many poets in Houston then?....", 
   {}, 
   429220, 
   null, 
   1304813580.0
  ], 
  [
   429231, 
   null, 
   "Pietro", 
   "Please. I do as I like...and if that gets me banned, so be it. The only way to silence me is to banish me. You, apparently are a pleb and don't run anything.\n\n \n You won't be around for very long. You'll become nothing more than a footnote in the history of this board and your thesis on \"white privilege\" will die once you're gone.\n \n By the way you said earlier on that you despised any kind of violence. Yet earlier than that you said anybody found with a gun should be shot on sight. Aren't you endorsing violence against tens of millions of people because they did something you don't like?\n \n \nNo. I don't care to elaborate about anything with you.\n\n \n And that's why you'll never win this argument. You can't make it work in your favor, you can't make your position work for you. Your skills are akin to a chimpanzee screaming and smacking a computer with a stick because that's the limits of its knowledge. All you can do is scream silently and futilely about nothing.\n \n \nMore racism and bigotry, but justified, right, because it's black people. And Russia is as corrupt as the US, if not more. You can't sell me any wolf tickets. \n\n \n Nobody said white people are saints. I'm just asking for clarifications on what \"white nations\" have carried out Rwanda-type genocides against their own people in recent history.\n \n \nPoet, is the name I chose because it's what I am. I'm up for consideration for poet laureate of Houston, Texas. Problem? I don't care to indulge you at all....you have a bad attitude.\n\n \n What I have is a forum troll who thinks he's beyond reproach and above everybody else. You're a lot like the former J Miro who got banned because he couldn't lay off the sexual assault and behave himself like he was told to. I can't help but wonder if you and he are the same sick individual.", 
   {}, 
   429220, 
   null, 
   1304813880.0
  ], 
  [
   429241, 
   null, 
   "poet", 
   "You won't be around for very long. You'll become nothing more than a footnote in the history of this board and your thesis on \"white privilege\" will die once you're gone.\n \n \n Such as life. Footnotes sometimes have a long shelf-life, surprisingly. \n \n By the way you said earlier on that you despised any kind of violence. Yet earlier than that you said anybody found with a gun should be shot on sight. Aren't you endorsing violence against tens of millions of people because they did something you don't like?\n \n Really? I know hyperbole is a literary device you're unfamiliar with...not my problem. Or perhaps I was being sarcastic..or both, I'm not sure. \n \n And that's why you'll never win this argument. You can't make it work in your favor, you can't make your position work for you. Your skills are akin to a chimpanzee screaming and smacking a computer with a stick because that's the limits of its knowledge. All you can do is scream silently and futilely about nothing.\n \n OH, more racial pejoratives. That's the thing about \"pointing fingers\"....a thumb always points back at you. I'm confident that no one here can hold a remote candle to me...don't hate, appreciate. \n Nobody said white people are saints. I'm just asking for clarifications on what \"white nations\" have carried out Rwanda-type genocides against their own people in recent history.\n \n Nobody said??? Could you have stated a more gross understatement?\n Nothing any black nation has done compares with white European or white American aggression. Sorry you have a problem accepting reality. Deny if you must. \n \n \n What I have is a forum troll who thinks he's beyond reproach and above everybody else. You're a lot like the former J Miro who got banned because he couldn't lay off the sexual assault and behave himself like he was told to. I can't help but wonder if you and he are the same sick individual.\n\n \n Think? I know that I am. Isn't that predictable...I have to be a sok, because I couldn't be as awesome as I am, on my own. Me and Barack. Who would have thought. LOL. I love me some me. ", 
   {}, 
   429231, 
   null, 
   1304817660.0
  ], 
  [
   429243, 
   null, 
   "sinjin", 
   "Can we get back to talking about women?;)\n \n One of my favorite subjects.emoticon_xagree\n \n White, black or otherwise.emoticon_cool\n \n \n Now as I see it, the question isn't how many women wear pistols, \n it's how many have ever worn nothing but...", 
   {}, 
   429241, 
   null, 
   1304820180.0
  ], 
  [
   429245, 
   null, 
   "Charlie_XT", 
   "What the hell is going on here. I started this thread to ask what gun control activists do when their rhetoric fails because it can't be applied to female opponents. And what happens next? Suddenly the discussion has descended into talks of racism and Freudian theory and outright trolling. Is it simply impossible to get a straight answer around here?", 
   {}, 
   429200, 
   null, 
   1304821080.0
  ], 
  [
   429246, 
   null, 
   "Freedom", 
   "Unfortunately charlie as soon as poet posted many of us knew that destruction would be radiate from is sick mind unto all he read. There is no such thing as a thread with poet without race baiting and insults. He will consistently utter the most unsupportable absurd position, refuse to explain himself; and put anyone who demands it on ignore (they are racially biased don't you know).", 
   {}, 
   429245, 
   null, 
   1304824680.0
  ], 
  [
   429248, 
   null, 
   "zsu2357", 
   "Your vs You're - e Learn English Language\n \n When you learn English, get back with me.\n\n \n Well nit pick me raw and EXCUUUUSE ME.", 
   {}, 
   429182, 
   null, 
   1304830440.0
  ], 
  [
   429249, 
   null, 
   "zsu2357", 
   "What the hell is going on here. I started this thread to ask what gun control activists do when their rhetoric fails because it can't be applied to female opponents. And what happens next? Suddenly the discussion has descended into talks of racism and Freudian theory and outright trolling. Is it simply impossible to get a straight answer around here?\n\n \n One word Charlie, POET. Hopefully the late Poet.", 
   {}, 
   429245, 
   null, 
   1304831880.0
  ], 
  [
   429250, 
   null, 
   "Bryan", 
   "Sorry Charlie, Poet has hijacked the thread and I am as guilty as anyone here for encouraging it. I apologize for doing so once again. \n \n \n If repeal of the 2nd amendment is up for vote, you best believe I'm voting in the affirmative. \n \n \n Thankfully none of our rights are on the ballot: \n \n \"The great ideals of liberty and equality are preserved against the assaults of opportunism, the expediency of the passing hour, the erosion of small encroachments, the scorn and derision of those who have no patience with general principles, by enshrining them in constitutions, and consecrating to the task of their protection a body of defenders.\" Justice Benjamin Cardozo, The Nature of the Judicial Process, Lecture II, 1921.\n \n \n the original intent of the 2nd amendment.....not valid anymore. \n \n \n You have not said what you believe the original intent was. I believe the individual right to keep and bear arms pre-existed my Constitution. I believe the original intent behind the 2nd. Amendment was to recognize and protect this preexisting individual right. \n \n If you disagree, then tell me and we can discuss whose theory has the greater weight of political history, judicial precedent, common sense, and more competent spokesman.\n \n \n By that logic, what's wrong with everyone having nuclear weapons? After all it's not the nuclear weapons we have to fear, but the careless hands of the imbeciles who have them. \n \n \n No right is absolute, and you cannot read the 2nd. Amendment any more absolutely than the other rights it helps protect. The First Amendment reads freedom of \"speech,\" but this does not equate to freedom to commit libel, slander, or false advertising. Likewise, \"religion\" is also not defined in the First but this does not create a license to engage in human sacrifice. For the same reason \"arms\" cannot be read in the Second Amendment to mean \"nukes.\" If you have read Heller and McDonald  then you know neither case has held this. See also, for example, the following case that long predates them:\n \n \"At the outset we reject the view that freedom of speech and association (N. A. A. C. P. v. Alabama, 357 U.S. 449, 460), as protected by the First and Fourteenth Amendments, are \"absolutes,\" not only in the undoubted sense that where the constitutional protection exists it must prevail, but also in the sense that the scope of that protection must be gathered solely from a literal reading of the First Amendment. (FN10)\n \n (FN10) \"That view, which of course cannot be reconciled with the law relating to libel, slander, misrepresentation, obscenity, perjury, false advertising, solicitation of crime, complicity by encouragement, conspiracy, and the like, is said to be compelled by the fact that the commands of the First Amendment are stated in unqualified terms: \"Congress shall make no law . . . abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble . . . .\" But as Mr. Justice Holmes once said: \"[T]he provisions of the Constitution are not mathematical formulas having their essence in their form; they are organic living institutions transplanted from English soil. Their significance is vital not formal; it is to be gathered not simply by taking the words and a dictionary, but by considering their origin and the line of their growth.\" Gompers v. United States, 233 U.S. 604, 610. In this connection also compare the equally unqualified command of the Second Amendment: \"the right of the people to keep and bear arms shall not be infringed.\" And see United States v. Miller, 307 U.S. 174.\" Konigsberg v. States Bar, 366 U.S. 36, 49 (1961)\n \n \n I'm against all guns. Period. They should be banned. Anyone caught with one ought to go to jail, or be shot on sight. \n \n \n A simple question....How will these commands be carried out? After all, if all guns are banned, then what will we be shot with? I doubt you mean crossbows, so I must assume you mean to have a government monopoly on firearms.\n \n \"An armed republic submits less easily to the rule of one of its citizens than a republic armed by foreign forces. Rome and Sparta were for many centuries well-armed and free. The Swiss are well-armed and enjoy great freedom. . . .Among other evils caused by being disarmed, it renders you contemptible. . . . It is not reasonable to suppose that one who is armed will obey willingly one who is unarmed; or that any unarmed man will remain safe among armed servants.\" Machiavelli, The Prince, pp. 73 & 81 (L. Ricci, trans. 1952)\n \n But let me return to being serious. It seems that you believe capital punishment is still constitutional under the Eighth Amendment. But imprisonment and execution without trial? This is where you lose all credibility with me, Poet.\n \n Must you also trample the rights protected in the Fifth, Sixth, and Fourteenth Amendments to gain your way? What a reckless disregard for fundamental rights you have. I guess now would be the time for me to express my thanks once again to my Founding Fathers for putting these rights beyond the your reach. \n \n \"William Roper: So, now you give the Devil the benefit of law! \n Sir Thomas Moore: Yes! What would you do? Cut a great road through the law to get after the Devil? \n William Roper: Yes, I'd cut down every law in England to do that! \n Sir Thomas Moore: Oh? And when the last law was down, and the Devil turned 'round on you, where would you hide, Roper, the laws all being flat? This country is planted thick with laws, from coast to coast, Man's laws, not God's! And if you cut them down, and you're just the man to do it, do you really think you could stand upright in the winds that would blow then? Yes, I'd give the Devil benefit of law, for my own safety's sake!\" From Robert Bolt's play \"A Man for All Seasons\" \n \n \"Experience should teach us to be most on our guard to protect liberty when the Government's purposes are beneficent. Men born to freedom are naturally alert to repel invasion of their liberty by evil-minded rulers. The greatest dangers to liberty lurk in insidious encroachment by men of zeal, well-meaning but without understanding.\"--Olmstead v. United States, 277 U.S. 438, 485 (1928) (Brandeis, dissenting).\n \n I mean really, Poet. If this is an attempt to apply for a position as a person who wants to be taken seriously, then I have to tell you the interview is not going so well. How can you expect to be taken seriously when you say your opponents should be shot on sight? Was this a very poor attempt at sarcasm? \n \n \n Anybody else here, with the intellect and the smarts to engage me? \n \n \n Molon Labe.", 
   {
    "post_info": {
     "post_title": "Sorry Charlie...."
    }, 
    "unicode_changes_made": true
   }, 
   429248, 
   null, 
   1304832720.0
  ], 
  [
   429252, 
   null, 
   "zsu2357", 
   "Can we get back to talking about women?;)\n \n One of my favorite subjects.emoticon_xagree\n \n White, black or otherwise.emoticon_cool\n \n \n Now as I see it, the question isn't how many women wear pistols, \n it's how many have ever worn nothing but...\n\n \n You sir are a man with a plan!\n Ah nothing but ? now that sounds down right sexist,but interesting.emoticon_wow", 
   {}, 
   429243, 
   null, 
   1304833320.0
  ], 
  [
   429253, 
   null, 
   "Freedom", 
   "No right is absolute, and you cannot read the 2nd. Amendment any more absolutely than the other rights it helps protect. The First Amendment reads freedom of \"speech,\" but this does not equate to freedom to commit libel, slander, or false advertising. Likewise, \"religion\" is also not defined in the First but this does not create a license to engage in human sacrifice. For the same reason \"arms\" cannot be read in the Second Amendment to mean \"nukes.\" If you have read Heller and McDonald  then you know neither case has held this. See also, for example, the following case that long predates them:\n \n\n If no right is absolute then no right is inalienable. All are subject to the subjective reinterpretation of contemporary political forces. A nuclear weapon is a weapon.\n \n By saying a nuclear weapon is not protected but a gun is you imply you have drawn a line somewhere in between those two. A battleship? A tank? Fully automatic? It doesn't matter, that you have drawn the line means you have already admitted the right you appeal to as objective and not subject to public opinion.... is subject to your opinion. You cannot object to anyone even so mad a person as poet drawing the line somewhere else.\n \n Even if you have clear an unmistakable criteria for that line, and even if it is unarbitrary in relation to society; it will be arbitrary in relation to the constitution you reference; which defined no line or limit to the type of weapons permitted.", 
   {
    "unicode_changes_made": true
   }, 
   429250, 
   null, 
   1304835540.0
  ], 
  [
   429286, 
   null, 
   "Bryan", 
   "No I would not equate \"inalienable\" with \"absolute.\" \"Absolute\" defines the scope of the right-what conduct and arms it covers. \"Inalienable\" is a term that defines the origin of the right. \"Inalienable\" is another term for a \"natural\" right which does not depend on governmental approval for its existence. These rights, to quote the Declaration of Independence, draw their authority from the \"Law of Nature and Nature's God.\" They are \"self-evident\" and they exist independently of any government. We can forfeit these rights by our own misconduct, but absent this no government has the legitimate authority to deprive us of these rights. I would consider the RKBA one of these rights. In contrast, we also have \"statutory\" rights which governments create and governments can modify at will. These rights fall within the legitimate power of the government. An example would be a right to appeal a criminal conviction that expires 30 days after the conviction. This right can be modified at any time. \n \n I understand the argument, though. If an inalienable right is not absolute then its scope is in danger of becoming elastic. That scope can expand or contract depending on who controls SCOTUS, and conceivably the judicial contraction of the scope of the right could be great enough to effectively deny the right altogether. \n \n But we have to deal with the reality of our form of government, and that reality contains a warning. Like it or not the battle over the scope of the right will be settled by SCOTUS, and because of its jurisdictional limitations the process will be by incremental decisions. The Brady Campaign understands this, and we need to as well. Heller did not declare the RKBA to be absolute in scope, and SCOTUS will never do so. Heller also only defined the scope of the right as broadly as necessary to decide the case. \n \n For me, Heller is the starting point of defining the scope of the right. For the Brady Campaign, Heller should be the end point. Having lost the battle to deny the right altogether, Brady's goal is to build a wall around the limited scope defined in Heller, and then try to collapse the wall and crush the right. My goal is to continue to expand the scope of the right-and Heller has clearly indicated the Court will do so in later opinions. But we have to understand the limitations of the system we are working with, and one of these limitations is SCOTUS will never declare the right to be absolute.", 
   {
    "unicode_changes_made": true
   }, 
   429253, 
   null, 
   1304917440.0
  ], 
  [
   429288, 
   null, 
   "Freedom", 
   "No I would not equate \"inalienable\" with \"absolute.\" \"Absolute\" defines the scope of the right-what conduct and arms it covers. \"Inalienable\" is a term that defines the origin of the right. \"Inalienable\" is another term for a \"natural\" right which does not depend on governmental approval for its existence. These rights, to quote the Declaration of Independence, draw their authority from the \"Law of Nature and Nature's God.\" They are \"self-evident\" and they exist independently of any government.\n\n I would, by saying it is inalienable you are saying that it is natural; which is to say that it is derived not from authority but from reality. If it is not derived from authority what power has authority to modify it?\n \n If you think you have found an exception to a right, that right was not defined correctly.... or it never existed in the first place.\n \n \nWe can forfeit these rights by our own misconduct\n\n The mechanism of such forfeiture has no bearing on innocent people what so ever. It cannot be applied to limit the 'scope' of a natural right.\n \n \nI understand the argument, though. If an inalienable right is not absolute then its scope is in danger of becoming elastic. That scope can expand or contract depending on who controls SCOTUS, and conceivably the judicial contraction of the scope of the right could be great enough to effectively deny the right altogether. \n\n It seems you come close but not quite there. The problem is not just that the rights's 'scope' will be redefined into obscurity, it is the idea that a right is redefined. All true rights are absolute and universal because all true rights derive from a single absolute and universal right, liberty.\n \n Does anyone have a right to live in a world where another person isn't 'too powerful', 'too powerful' to be determined by arbitrary ever shifting decisions?\n \n No, they do not.\n \n \nBut we have to deal with the reality of our form of government, and that reality contains a warning. Like it or not the battle over the scope of the right will be settled by SCOTUS, and because of its jurisdictional limitations the process will be by incremental decisions. The Brady Campaign understands this, and we need to as well. Heller did not declare the RKBA to be absolute in scope, and SCOTUS will never do so. Heller also only defined the scope of the right as broadly as necessary to decide the case. \n \n For me, Heller is the starting point of defining the scope of the right. For the Brady Campaign, Heller should be the end point. Having lost the battle to deny the right altogether, Brady's goal is to build a wall around the limited scope defined in Heller, and then try to collapse the wall and crush the right. My goal is to continue to expand the scope of the right-and Heller has clearly indicated the Court will do so in later opinions. But we have to understand the limitations of the system we are working with, and one of these limitations is SCOTUS will never declare the right to be absolute.\n\n What you call limitations I call failings. I have no response to your appeal to practicality except that all who know better ought to work towards the ideal.", 
   {
    "unicode_changes_made": true
   }, 
   429286, 
   null, 
   1304918940.0
  ], 
  [
   429291, 
   null, 
   "Galileo", 
   "If no right is absolute then no right is inalienable. All are subject to the subjective reinterpretation of contemporary political forces. A nuclear weapon is a weapon.\n \n By saying a nuclear weapon is not protected but a gun is you imply you have drawn a line somewhere in between those two. A battleship? A tank? Fully automatic? It doesn't matter, that you have drawn the line means you have already admitted the right you appeal to as objective and not subject to public opinion.... is subject to your opinion. You cannot object to anyone even so mad a person as poet drawing the line somewhere else.\n \n Even if you have clear an unmistakable criteria for that line, and even if it is unarbitrary in relation to society; it will be arbitrary in relation to the constitution you reference; which defined no line or limit to the type of weapons permitted.\n\n I think the Supreme Court could have looked to the preamble of the Second Amendment as a guide for determining which weapons are constitutionally protected (weapons which would be useful in a militia). However, I don't think they wanted restrictions on machine guns to be ruled unconstitutional at some point in the future. So they came up with the in common use rule (weapons which are in common use are protected). I think Heller recognized the RKBA as an individual right but when you start talking about where to draw the line between unconstitutional and constitutional gun laws that's when things start to get messy. From the Breyer dissent in McDonald:\n \n \"Rather, the Court has haphazardly created a few simple rules, such as that it will not touch 'prohibitions on the possession of firearms by felons and the mentally ill,' 'laws forbidding the carrying of firearms in sensitive places such as schools and government buildings,' or 'laws imposing conditions and qualifications on the commercial sale of arms.' Heller, 544 U. S., at ___ (slip op., at 54-55); Ante, at 39 (plurality opinion). But why these rules and not others? Does the Court know that these regulations are justified by some special gun-related risk of death? In fact, the Court does not know. It has simply invented rules that sound sensible without being able to explain why or how Chicago's handgun ban is different.\"", 
   {
    "unicode_changes_made": true
   }, 
   429253, 
   null, 
   1304923860.0
  ], 
  [
   429293, 
   null, 
   "Freedom", 
   "I think the Supreme Court could have looked to the preamble of the Second Amendment as a guide for determining which weapons are constitutionally protected (weapons which would be useful in a militia).\n\n Sure thing, and we could probably today set up pretty objective criteria to tell if someone is stockpiling weapons for sport/personal defence or merely to gain military power which he/she intends to let loose on their neighbors.\n \n That does not matter, if one has to look at the context of the founding fathers position to define the right it was not defined explicitly. Further it, \n infact is not derived from nature as all true rights are but from the document in question if the document needs to be consulted to define the right. A document can define a natural right but the times and writers cannot define the definition. Times and writers come and go, they are not absolute, they are no more natural or inherent to man than a tricorn is.\n \n \nSo they came up with the in common use rule (weapons which are in common use are protected). \n\n Lol, and when they are outlawed they will be less common. That is the closest thing to 'we don't want to deal with the issue' as you get.", 
   {}, 
   429291, 
   null, 
   1304925060.0
  ], 
  [
   429300, 
   null, 
   "Charlie_XT", 
   "I think the Supreme Court could have looked to the preamble of the Second Amendment as a guide for determining which weapons are constitutionally protected (weapons which would be useful in a militia). However, I don't think they wanted restrictions on machine guns to be ruled unconstitutional at some point in the future. So they came up with the in common use rule (weapons which are in common use are protected). I think Heller recognized the RKBA as an individual right but when you start talking about where to draw the line between unconstitutional and constitutional gun laws that's when things start to get messy. From the Breyer dissent in McDonald:\n \n \"Rather, the Court has haphazardly created a few simple rules, such as that it will not touch 'prohibitions on the possession of firearms by felons and the mentally ill,' 'laws forbidding the carrying of firearms in sensitive places such as schools and government buildings,' or 'laws imposing conditions and qualifications on the commercial sale of arms.' Heller, 544 U. S., at ___ (slip op., at 54&#8211;55); Ante, at 39 (plurality opinion). But why these rules and not others? Does the Court know that these regulations are justified by some special gun-related risk of death? In fact, the Court does not know. It has simply invented rules that sound sensible without being able to explain why or how Chicago&#8217;s handgun ban is different.\"\n\n \n In a different thread didn't you say that you didn't bring up the discussion of machine gun ownership with respect to the Heller ruling?\n \n I have a question to present to you Galileo. This supposed standard of \"weapons that would be useful to a militia\" is this a term that has to be viewed differently as the times change to compensate for new development in firearms technology? Because while some might find revolvers and lever action rifles to work as viable defense weapons I'm not sure how useful they would be to militia purposes, what with all the recent developments in the last 20 or so years. Even though a lever action rifle can easily be made to use armor piercing ammunition, as can certain revolvers, that doesn't mean they're suitable for fighting an enemy that might possess the AKS-74U or other similar weaponry being used by the insurgents in Iraq.\n \n So we must consider the existence of these particular firearms when considering all the other standards. If they don't have a modern suitability for fighting a defined enemy like the Taliban would that mean they can be banned and restricted while new modern weaponry couldn't be? If this is so then doesn't the standard of \"useful ina militia\" basically criminalize current attempts to outlaw and restrict modern weaponry under the guise of \"assault weapons\" and \"high capacity ammo clips\"?", 
   {}, 
   429291, 
   null, 
   1304953560.0
  ], 
  [
   429303, 
   null, 
   "Tither", 
   "Lol, and when they are outlawed they will be less common. \n\n Brilliant statement. The truth of which, hit me like a ton of bricks. It seems that We the People have to not only fight just about all governments from encroachment, but also the courts to include the Supreme Court&#8217;s too. \n \n We the People fixed this with the 14th Amendment, and the will of the people is known. However, all of government, many courts, and to include the S.C. said, Uh, Yeah, We will take that under advisement. Dork Wads. We&#8217;ll get back to you on that. Don&#8217;t wait up nights for that though! We will incorporate YOUR Rights that bind us, when we get around to it. Yeah that&#8217;s the scam! I mean the ticket. \n \n Governments made the laws contrary to the 14th Amendment, and the courts, to include the Supreme Courts, back their play. \n \n Where did the S.C. get the power to deny P&I? Where did they get the power to wait and incorporate our rights when they saw fit? Did We the People, or their elected representatives give them instructions to incorporate? Or did they throw a hissy fit and come up with this as a delaying tactic, and in many cases a denying tactic, on their own? \n \n Also, if the Supreme Court actually obeyed the LAW, and I mean directly after the 14th was ratified, what would the 2nd Amendment look like today? \n \n Why did we have to wait 150 years for the 2nd to be recognized? Who, exactly, authorized that? \n \n The whole darn thing reeks with illegality, and some serious mistakes and power grabbing needs to be addressed. Well, that is, if we are really talking about being law-abiding, and being Constitutional, and all! Which IS, the only law that really matters. The Constitution is the Supreme law of the Land, and this miscarriage of justice, has to be adressed. IF, we are law-abiding and all. \n \n I repeat, the whole darn thing reeks with illegality, and needs to be addressed. Are we law-abiding or not? Ooooor is that, OK for thee, but not for me? emoticon_smile", 
   {}, 
   429293, 
   null, 
   1304955300.0
  ], 
  [
   429307, 
   null, 
   "poet", 
   "So I joined the board to take part in the debate that seems to permeate everything and one of the areas I was always curious about was in this section. I've always had a question that I wanted to see asked but nobody ever brought it up so I'm going to.\n \n Supporters of gun control are accustomed to a specific type of opponent in their arguments, specifically white men. White guys are the easiest to attack and blame for everything due to history painting them as the ultimate evil, and collectively the white culture has been forced to simply roll over and take it for fear of being called racist all over again. However in becoming accustomed to doing battle with this specific group supporters of gun control have become typecast in their arguments and can't easily adapt to confronting other people of different heritages.\n \n \n I am so incensed by the OP, and your crying of \"foul\", as it relates to white men, that I feel I need to address it \"anew\". It's not like you, as white men, have ever done anything wrong, correct? You've been \"saints\", and the predominant culture, which happens to be \"white culture\", seeing that you're in most positions of power and authority and \"white privilege\" affords you skewed protection of your inherent sense of entitlement by simply being born white...and it doesn't matter if you're uneducated, classless, poor, criminal, racist, doofus, atheist, abusers, misogynistic, anarchists, or whatever, your white skin will give you the carte blanche that will trump any non-whites, regardless of their superior qualities. How the hell is that equitable or fair? \n If you're a friggin racist, or misogynist, or criminal...own it. It's what you are. Why pretend to be what you are not, if only for appearances' sake?\n You already own almost every g.d. thing, and still it's not enough. And heaven forbid someone take away your security blankets....your guns...because without them, you're not real men. Which is why I alluded earlier to guns being phallus symbols. If you were \"swingin', you wouldn't need firepower to back you up. Truth of the matter is that a gun doesn't make up for a teeny tiny member, no matter how much you fantasize....and everyone knows, size is what women think that they want..when the truth lies in \"the motion of the ocean\". Surprising I know so much about women....and I do. Not all gay men are \"inexperienced\", contrary to popular belief. And despite being in a committed gay relationship for 10 years, I'm still propositioned by women. Eat your hearts out. \n So how exactly do supporters of gun control respond when the opponent they have to confront is a woman? How does their rhetoric and fear mongering and hyperbole work when they've gotta deal with members of the female side of the population who don't buy into their arguments? How exactly do you sell disarmament to women who don't believe in being unarmed and helpless as an answer?\n \n I never believed that any attempt to take away my gun or restrict my ability to use it when I'm out late would do anything to prevent me from being mugged, raped or murdered by whatever lowlife of society has yet to be locked up because they chose to not obey the rules of said society. Nor do I believe that requiring me to obtain a permit to buy a gun would do anything to prevent me from becoming a victim of domestic violence simply because the same law might prevent my abuser from becoming armed.\n \n So what do they have? When they encounter someone who can't be assaulted with claims of racist nature, or insults of sexual dysfunction, or mockery of compensation for lacking something, etc. what is the course of action that's to be taken next?\n\n \n Of course anything can be explained away or supported to promote one's own agenda. I think that the premise of the OP is misogynistic.", 
   {}, 
   429020, 
   null, 
   1304962740.0
  ], 
  [
   429313, 
   null, 
   "Charlie_XT", 
   "I am so incensed by the OP, and your crying of \"foul\", as it relates to white men, that I feel I need to address it \"anew\". It's not like you, as white men, have ever done anything wrong, correct? You've been \"saints\", and the predominant culture, which happens to be \"white culture\", seeing that you're in most positions of power and authority and \"white privilege\" affords you skewed protection of your inherent sense of entitlement by simply being born white...and it doesn't matter if you're uneducated, classless, poor, criminal, racist, doofus, atheist, abusers, misogynistic, anarchists, or whatever, your white skin will give you the carte blanche that will trump any non-whites, regardless of their superior qualities. How the hell is that equitable or fair?\n\n \n You wanna know why I introduced the white male argument? Because the most common stereotype of gun owners is backwoods inbred hicks who shoot animals from their trucks for the simple purpose of having something to kill. Rednecks, hicks, hillbillies, they're all considered white in nature.\n \n Show me a black redneck. Show me a black community that qualifies as NASCAR watching, mayonnaise eating, cousin ****ing trailer trash. Show me the members of the black community that like Jeff Foxworthy, hate Jeff Gordon, love monster trucks and have a wallet made of duct tape on a chain. Show me these backwoods blacks if they exist.\n \n You keep talking about how \"white privilege\" supposedly leaves us as being superior to everyone else even if we're not. But I don't know of any black community trailer parks where you need to hunt squirrels in order to be able to eat.\n \n \nIf you're a friggin racist, or misogynist, or criminal...own it. It's what you are. Why pretend to be what you are not, if only for appearances' sake?\n You already own almost every g.d. thing, and still it's not enough. And heaven forbid someone take away your security blankets....your guns...because without them, you're not real men. Which is why I alluded earlier to guns being phallus symbols. If you were \"swingin', you wouldn't need firepower to back you up. Truth of the matter is that a gun doesn't make up for a teeny tiny member, no matter how much you fantasize....and everyone knows, size is what women think that they want..when the truth lies in \"the motion of the ocean\". Surprising I know so much about women....and I do. Not all gay men are \"inexperienced\", contrary to popular belief. And despite being in a committed gay relationship for 10 years, I'm still propositioned by women. Eat your hearts out.\n \n \n And I suppose as far as you're concerned rape is just a fantasy right? White people don't need to carry guns because nobody who's white is ever victimized because being born into \"white privilege\" protects them from all manner of harm, correct?\n \n \nOf course anything can be explained away or supported to promote one's own agenda. I think that the premise of the OP is misogynistic.\n\n \n The premise of the OP is to shake up the gun control status quo. You can't try and bully and intimidate and shame female gun owners the same way you can men, because we don't have a manhood status that can be insulted and ridiculed. We're often portrayed as the victims that need gun control to protect them in the first place. Well that's just plain wrong.", 
   {}, 
   429307, 
   null, 
   1304970180.0
  ], 
  [
   429314, 
   null, 
   "poet", 
   "You wanna know why I introduced the white male argument? Because the most common stereotype of gun owners is backwoods inbred hicks who shoot animals from their trucks for the simple purpose of having something to kill. Rednecks, hicks, hillbillies, they're all considered white in nature.\n \n Show me a black redneck. Show me a black community that qualifies as NASCAR watching, mayonnaise eating, cousin ****ing trailer trash. Show me the members of the black community that like Jeff Foxworthy, hate Jeff Gordon, love monster trucks and have a wallet made of duct tape on a chain. Show me these backwoods blacks if they exist.\n \n You keep talking about how \"white privilege\" supposedly leaves us as being superior to everyone else even if we're not. But I don't know of any black community trailer parks where you need to hunt squirrels in order to be able to eat.\n \n What?????????? I'm sure black rednecks exist. I don't personally know any.  \n \n And I suppose as far as you're concerned rape is just a fantasy right? White people don't need to carry guns because nobody who's white is ever victimized because being born into \"white privilege\" protects them from all manner of harm, correct?\n \n All I can say is protect yourself. Any way you can. An ounce of prevention is worth a pound of cure. \n The premise of the OP is to shake up the gun control status quo. You can't try and bully and intimidate and shame female gun owners the same way you can men, because we don't have a manhood status that can be insulted and ridiculed. We're often portrayed as the victims that need gun control to protect them in the first place. Well that's just plain wrong.\n\n \n I'm all for women power. I'm a feminist. I'm anti-Neanderthal. ", 
   {}, 
   429313, 
   null, 
   1304970540.0
  ], 
  [
   429315, 
   null, 
   "sinjin", 
   "I don't see how background checks and form 4473s's have anything to do with gender. Please don't buy into the nonsense that says any regulations associated with the purchasing of a firearm are some prelude to a wholesale confiscation of privately held weapons.\n \n My only point to you CharlieXT is that a woman who wants to carry a pistol is in an extreme minority of women. \n Why do you suppose that is? You say \"girls like guns too\", but they in fact don't as a group. \n \n I support certain regulations but have no desire to disarm any law-abiding citizen, man or woman.", 
   {}, 
   429314, 
   null, 
   1304970960.0
  ], 
  [
   429318, 
   null, 
   "Doc Jones", 
   "I'm all for women power. I'm a feminist. I'm anti-Neanderthal. \nY]\n \n You claimed to be a homosexual. I got good news for you; now you can join the military and not have to pretend to be a real man.\n \n Obama repealed the \"don't ask don't tell\" policy so you should be overjoyed.l\n You can take your orders from real women and like it while you carry a gun and serve your country.", 
   {}, 
   429314, 
   null, 
   1304971200.0
  ], 
  [
   429326, 
   null, 
   "Freedom", 
   "The premise of the OP is to shake up the gun control status quo. You can't try and bully and intimidate and shame female gun owners the same way you can men, because we don't have a manhood status that can be insulted and ridiculed. We're often portrayed as the victims that need gun control to protect them in the first place. Well that's just plain wrong.\n\n but charlie, the truth is he couldn't 'bully' or 'intimidate' anyone with such vitriol and collectivist rantings unless they believed it themselves. You may have a convenient excuse that you don't fit his irrational stereotypes but those who he claims do still have the fact that they are irrational.\n \n If he thinks arguing against a white person gives him an advantage he's a racist. If he thinks arguing against men gives him an advantage, he's a sexist.\n \n I wouldn't mind if you made it clear to him the truth that it doesn't matter whether your a woman or not or black or not or what ever the hell other meaningless attribute he wants to pull out. It may as well be 'shredded wheat guzzler' for all it matters. The right being referenced is not race or gender specific nor is any right.", 
   {}, 
   429313, 
   null, 
   1304974560.0
  ], 
  [
   429328, 
   null, 
   "Charlie_XT", 
   "What?????????? I'm sure black rednecks exist. I don't personally know any.\n\n \n You're sure they exist? You don't know? Well that's awful convenient isn't it? I present something that undercuts your thesis on \"white privilege\" by introducing the trailer park demographic and, at the same time revealing the racially motivated tones supported by gun control activists, showing that simply being born white isn't enough to land you the upscale lifestyle.\n \n Black people might have the ghettos, but white people have trailer parks. At least they've got city territory and actual buildings. And how many blacks have to bag an opossum or rattlesnake just to have meat for dinner tonight?\n \n \nAll I can say is protect yourself. Any way you can. An ounce of prevention is worth a pound of cure.\n\n \n And yet you said you want all guns banned and anyone caught with one should either be gunned down like a rabid dog (shot on sight, no questions asked) or put in jail for being armed. Which standard is it? Do we protect ourselves or do we not?\n \n And the ounce of prevention thing really doesn't work when trouble follows you home. Somebody breaks into your house, prevention doesn't mean dick.\n \n \nI'm all for women power. I'm a feminist. I'm anti-Neanderthal.\n\n \n I don't buy it, mainly because I read your back and forth banter about racism and Freudian logic. Very few women have the ability to actually beat the **** out of a male assailant even with the element of surprise. Physical strength isn't on our side, we got the short end of that stick. Hence we have a legitimate need for being armed because we're such easy targets.", 
   {}, 
   429314, 
   null, 
   1304975400.0
  ], 
  [
   429329, 
   null, 
   "sinjin", 
   "Very few women have the ability to actually beat the **** out of a male assailant even with the element of surprise. Physical strength isn't on our side, we got the short end of that stick. Hence we have a legitimate need for being armed because we're such easy targets.\nThis isn't about gender at all. The same disadvantage applies to a smaller or elderly man.", 
   {}, 
   429328, 
   null, 
   1304976660.0
  ], 
  [
   429331, 
   null, 
   "Charlie_XT", 
   "I don't see how background checks and form 4473s's have anything to do with gender. Please don't buy into the nonsense that says any regulations associated with the purchasing of a firearm are some prelude to a wholesale confiscation of privately held weapons.\n\n \n I don't believe that this was an argumentative approach that I've taken yet. I don't see the relevance.\n \n \nMy only point to you CharlieXT is that a woman who wants to carry a pistol is in an extreme minority of women. Why do you suppose that is?\n\n \n I don't know the exact reason for such but there are a number of plausible theories that would work as an answer. Fear of the unknown, the media's liberal slant, socially engineered gender stereotypes, intimidation, etc. any one of them a potentially lengthy explanation of why women are less likely to carry a gun than a man even though they're more likely to be victimized.\n \n Currently too many women stay with their abusive spouses and even defend them from the authorities despite knowing full well that the abuse is just going to continue until one of them is dead. Despite access to sufficient knowledge that would tell them this is a bad idea they still willingly choose to do so. What's the logic in it? I honestly don't know the answer to that, but I do believe it serves as a good comparison and contrast with gun ownership or the lack thereof amongst women.\n \n \nYou say \"girls like guns too\", but they in fact don't as a group.\n\n \n I really don't put much stock into that. All the evidence you have to go on is answers concerning a random telephone survey. If you randomly call people up and supply them with information that can't be verified you don't really expect a great deal of honesty to be extended do you? Conduct a random telephone survey and ask participants how many of them like kinky sex of questionable legality and you'd probably get a lot of hang ups, cursed at and told where to stick your survey.\n \n \nI support certain regulations but have no desire to disarm any law-abiding citizen, man or woman.\n\n \n Certainly a wise decision.", 
   {}, 
   429315, 
   null, 
   1304976900.0
  ], 
  [
   429332, 
   null, 
   "Charlie_XT", 
   "This isn't about gender at all. The same disadvantage applies to a smaller or elderly man.\n\n \n This may be true but I'm unaware of any pro-gun control organization or activists that use the senior citizens and their disabilities as a cause for gaining sympathy to try and further their political positions. Women are used, children are used, firefighters and the police are used, even black people are used by those hoping to mobilize white guilt. But senior citizens aren't mentioned despite their disabilities.", 
   {}, 
   429329, 
   null, 
   1304977140.0
  ], 
  [
   429333, 
   null, 
   "sinjin", 
   "I don't believe that this was an argumentative approach that I've taken yet. I don't see the relevance. \nNo, you suggested supporters of gun control are all like those you describe in the OP. They're not.\n \n \n \nHow does their rhetoric and fear mongering and hyperbole work when they've gotta deal with members of the female side of the population who don't buy into their arguments? How exactly do you sell disarmament to women who don't believe in being unarmed and helpless as an answer?\nNot all supporters of a regulated firearms market are selling disarmament.\n \n \nI never believed that any attempt to take away my gun or restrict my ability to use it when I'm out late would do anything to prevent me from being mugged, raped or murdered by whatever lowlife of society has yet to be locked up because they chose to not obey the rules of said society.\nNot all supporters of a regulated firearms market are selling disarmament.\n \n \nSo what do they have? When they encounter someone who can't be assaulted with claims of racist nature, or insults of sexual dysfunction, or mockery of compensation for lacking something, etc. what is the course of action that's to be taken next? \nBy suggesting the logic of background checks and owner info on file at the point of sale.", 
   {}, 
   429331, 
   null, 
   1304977860.0
  ], 
  [
   429335, 
   null, 
   "Charlie_XT", 
   "No, you suggested supporters of gun control are all like those you describe in the OP. They're not.\n \n Not all supporters of a regulated firearms market are selling disarmament.\n \n Not all supporters of a regulated firearms market are selling disarmament.\n\n \n However there are supporters that are trying to sell disarmament as an option, and they're the ones I'd like to hear from. People like Michael Moore and others, and those that support their message. They're the people I want to hear from and what answers they have when presented with the difficult questions.\n \n \nBy suggesting the logic of background checks and owner info on file at the point of sale.\n\n \n I don't understand how that's supposed to work.", 
   {}, 
   429333, 
   null, 
   1304980200.0
  ], 
  [
   429340, 
   null, 
   "sinjin", 
   "I don't understand how that's supposed to work.\nHave you ever purchased a firearm?", 
   {}, 
   429335, 
   null, 
   1304981520.0
  ], 
  [
   429341, 
   null, 
   "Bryan", 
   "I would, by saying it is inalienable you are saying that it is natural; which is to say that it is derived not from authority but from reality. If it is not derived from authority what power has authority to modify it?\n \n If you think you have found an exception to a right, that right was not defined correctly.... or it never existed in the first place.\n \n \n The mechanism of such forfeiture has no bearing on innocent people what so ever. It cannot be applied to limit the 'scope' of a natural right.\n \n \n It seems you come close but not quite there. The problem is not just that the rights's 'scope' will be redefined into obscurity, it is the idea that a right is redefined. All true rights are absolute and universal because all true rights derive from a single absolute and universal right, liberty.\n \n Does anyone have a right to live in a world where another person isn't 'too powerful', 'too powerful' to be determined by arbitrary ever shifting decisions?\n \n No, they do not.\n \n \n What you call limitations I call failings. I have no response to your appeal to practicality except that all who know better ought to work towards the ideal.\n\n \n Interesting. If all true natural rights derive from the single absolute right of liberty, then how do we define this unlimited right to \"liberty\"?\n \n If the right is held by the individual, then can the individual voluntarily surrender some of this natural absolute liberty by agreeing with his fellow man to form a government? \n \n What other rights in the Bill of Rights should be considered natural rights of absolute scope?\n \n On the mechanism of forfeiture you and I are in complete agreement. I do not claim, and I do not imply, that my actions could cause the forfeiture of anyone else's rights. This is of course the modus operandi for gun control-where one person's criminal misuse of the RKBA forms the basis for taking the same right from everyone else under the guise that they can no longer be \"trusted\" with the right.", 
   {
    "unicode_changes_made": true
   }, 
   429288, 
   null, 
   1304981640.0
  ], 
  [
   429343, 
   null, 
   "Charlie_XT", 
   "Have you ever purchased a firearm?\n\n \n I know what the paperwork is like and how it works. What I meant to say is that I don't understand how the paperwork is supposed to keep anyone safe. How do forms with names and serial numbers prevent severe bodily assault from taking place?", 
   {}, 
   429340, 
   null, 
   1304983800.0
  ], 
  [
   429346, 
   null, 
   "sinjin", 
   "I know what the paperwork is like and how it works. What I meant to say is that I don't understand how the paperwork is supposed to keep anyone safe. How do forms with names and serial numbers prevent severe bodily assault from taking place?\nDoes the fact that one needs a prescription for a particular medicine prevent drug abuse in general? Why bother then?\n \n So why are you going around unarmed if you feel so strongly about shooting potential rapists?", 
   {}, 
   429343, 
   null, 
   1304984580.0
  ], 
  [
   429349, 
   null, 
   "Charlie_XT", 
   "Does the fact that one needs a prescription for a particular medicine prevent drug abuse in general? Why bother then?\n\n \n Can you please elaborate? Wouldn't the paperwork only come into play after the fact once somebody has been victimized and/or murdered?\n \n \nSo why are you going around unarmed if you feel so strongly about shooting potential rapists?\n\n \n Whoever said I was going around unarmed? That's the whole point of concealed carry; you don't know one way or the other.", 
   {}, 
   429346, 
   null, 
   1304985000.0
  ], 
  [
   429359, 
   null, 
   "sinjin", 
   "Can you please elaborate? Wouldn't the paperwork only come into play after the fact once somebody has been victimized and/or murdered?\nNot NICS.\n \n \nWhoever said I was going around unarmed? That's the whole point of concealed carry; you don't know one way or the other. \nMy mistake. I assumed you didn't own a gun.", 
   {}, 
   429349, 
   null, 
   1304987220.0
  ], 
  [
   429365, 
   null, 
   "Charlie_XT", 
   "Not NICS.\n\n \n I'm still afraid that I'm not following. The National Instant Check System screens potential buyers at the point of sale, but at the same time this system is being easily bypassed by straw buyers and front men who then turn around and resell to people who couldn't pass it in the first place. How much good would more paperwork do as long as there are people who are willing to serve the role as straw buyers in order to make a quick buck?", 
   {}, 
   429359, 
   null, 
   1304988840.0
  ], 
  [
   429378, 
   null, 
   "sinjin", 
   "I'm still afraid that I'm not following. The National Instant Check System screens potential buyers at the point of sale, but at the same time this system is being easily bypassed by straw buyers and front men who then turn around and resell to people who couldn't pass it in the first place. How much good would more paperwork do as long as there are people who are willing to serve the role as straw buyers in order to make a quick buck?\nThere is no perfect regulatory measure. Would you do away with laws prohibiting the sale\n of alcohol to minors since teens bypass the law regularly with \"straw purchasers\"?", 
   {}, 
   429365, 
   null, 
   1304996160.0
  ], 
  [
   429386, 
   null, 
   "Charlie_XT", 
   "There is no perfect regulatory measure. Would you do away with laws prohibiting the sale of alcohol to minors since teens bypass the law regularly with \"straw purchasers\"?\n\n \n I've never bought any booze myself so I can't accurately do a compare and contrast between the two. What are the standards for buying alcoholic beverages as opposed to buying a gun? Can a proper comparison be made since there are gun smuggling rings but the same isn't true for booze? How many prospective individuals earn a living wage by smuggling vodka and malt liquor into the state of California?", 
   {}, 
   429378, 
   null, 
   1305001200.0
  ], 
  [
   429409, 
   null, 
   "sinjin", 
   "I've never bought any booze myself so I can't accurately do a compare and contrast between the two. What are the standards for buying alcoholic beverages as opposed to buying a gun? Can a proper comparison be made since there are gun smuggling rings but the same isn't true for booze? How many prospective individuals earn a living wage by smuggling vodka and malt liquor into the state of California?\nWTF? I'm not \"comparing and contrasting\" the two. \n \n I'll try to make this simple for you.\n \n Do you feel that a law that is broken regularly has no business being on the books in the first place? \n \n What law has never been broken?", 
   {}, 
   429386, 
   null, 
   1305046860.0
  ], 
  [
   429417, 
   null, 
   "Tither", 
   "What law has never been broken?\n\n Scientific laws, the law of gravity, Boils law, ohms law, laws of physics just to name a few. :)\n \n \n Maybe the law of unintended consequences. :)", 
   {}, 
   429409, 
   null, 
   1305053220.0
  ], 
  [
   429421, 
   null, 
   "Charlie_XT", 
   "WTF? I'm not \"comparing and contrasting\" the two. \n \n I'll try to make this simple for you.\n \n Do you feel that a law that is broken regularly has no business being on the books in the first place? \n \n What law has never been broken?\n\n \n If the law is broken so readily and those that have broken it aren't regularly being prosecuted for their crimes then what is the purpose of maintaining the law in the first place?\n \n How often are straw purchasers prosecuted for their crimes, thus proving the federal officials are on the ball and doing their job?", 
   {}, 
   429409, 
   null, 
   1305054360.0
  ], 
  [
   429434, 
   null, 
   "Freedom", 
   "Interesting. If all true natural rights derive from the single absolute right of liberty, then how do we define this unlimited right to \"liberty\"?\n\n The right to control one's body, to choose without coercion one's actions; to hold complete ownership over the products of one's efforts so long as one does not violate these same conditions in others.\n \n Anyone who has done a venn diagram can understand the concept of mutual exclusion, it is not contradictory as some insane people (not you) have claimed to reference the definition within the definition.\n \n If you choose to buy a gun you have not violated any one's rights regardless of the proposed risk of you doing so.\n \n So more blabbing by me on the subject:\n http://www.4forums.com/political/formal-open-debate/14447-society-based-volition-ideal-one.html#post407234\n \n http://www.4forums.com/political/formal-open-debate/14447-society-based-volition-ideal-one.html#post407901\n \n \nIf the right is held by the individual, then can the individual voluntarily surrender some of this natural absolute liberty by agreeing with his fellow man to form a government? \n\n He can in so far he can pretend it doesn't exist. However in reality it does exist and he cannot surrender it.\n \n By the very act of consenting you do not destroy your right to give consent or not.\n \n \nWhat other rights in the Bill of Rights should be considered natural rights of absolute scope?\n\n Actually most are derivations of liberty, some are not natural but constructed rights like the ones on the legal system.\n \n In all my years of defining the rights of man for people I have never had to go to such particular levels, people should be able to apply a principle. If you don't have the right to coerce someone to do something of course you cannot coerce a reporter to shut up nor can it be a crime to do anything but violate some one's rights.\n \n\n On the mechanism of forfeiture you and I are in complete agreement. I do not claim, and I do not imply, that my actions could cause the forfeiture of anyone else's rights. This is of course the modus operandi for gun control-where one person's criminal misuse of the RKBA forms the basis for taking the same right from everyone else under the guise that they can no longer be \"trusted\" with the right.\n\n Yes, I have tried many times to get people to see the pattern which is clear as day to me behind such 'modus operandi'. The pattern is thinking about humanity as groups; it is dealing with the collective as the unit of humanity. The simple fallacy of composition carried out on a grand scale has far too many names sometimes condemned sometimes not.\n \n It's called stereotyping, racism, classism, social equality etc..\n \n When you try to make laws about groups you are always in the wrong, laws about gun owners cannot speak to any individual action except owning a gun but it is justified with the actions of other individuals because to the people who are thinking this way, consciously or unconsciously they are assigning criminal actions to the collective not to the individual.\n \n Most evil in the modern world while claimed to be separate issues are the results of this single evil called collectivism.", 
   {
    "unicode_changes_made": true
   }, 
   429341, 
   null, 
   1305071640.0
  ], 
  [
   429460, 
   null, 
   "Tither", 
   "Charlie_XT. I hope you don't mind. Because of what this thread has morphed into, I think these articles belong here. \n   Second Amendment Foundation Challenges Interstate Handgun Sales Ban \n The Second Amendment Foundation today filed suit in U.S. District Court in Virginia challenging the constitutionality of federal and Virginia provisions barring handgun sales to non-residents.\n \n SAF is joined in the lawsuit by Michelle Lane, a District of Columbia resident who cannot legally purchase handguns because there are no retail firearms dealers inside the District.\n \n SAF and Lane are represented by attorney Alan Gura of Gura & Possessky, PLLC, who won both the Heller ruling and last year's Supreme Court victory in McDonald v. City of Chicago. Named as defendants are Attorney General Eric Holder and W. Steven Flaherty, superintendent of the Virginia State Police.\n \n \"This is an important issue in the era of the national instant background check,\" said SAF Executive Vice President Alan M. Gottlieb. \"The NICS check should allow law-abiding citizens like Miss Lane to exercise their Second Amendment rights regardless their place of residence.\"\n \n \"Americans don't check their constitutional rights at the state line,\" said Gura. \"And since Michelle Lane is legally entitled to possess firearms, forcing her to seek a non-existing D.C. dealer to buy a handgun is pointless when perfectly legitimate options exist minutes across the Potomac River.\"\n \n \"The Supreme Court has ruled that District residents have an individual right, protected by the Constitution, to have a handgun in their home,\" Gottlieb noted. \"The high court has also ruled that the Second Amendment applies to the states. Existing state and federal statutes violate both the spirit and letter of recent court rulings and the Constitution, and our lawsuit seeks to remedy that situation.\"\n\n \n  Boarding? Denied. Lock and Loading? Sure. \n .... proposing that the attorney general be given authority to block gun sales to those on the list, \n \n Deny people their 2nd Amendment Rights without their 14th Amendment due process Right. What about the ill advised president this sets? I guess the correct question is, do you want a Bill of Rights or not? Should the government be restrained from acting in certain areas or not? \n \n About this article, Kurt Hoffman says:\n  247 on 'terror watch list' buy guns, terrorize no one with them \n What the editorial doesn't bother to mention is that the NY Times can find, among those 247 \"suspected terrorist\" gun buyers, precisely zero incidents of terrorism or violent crime. In fact, according to Fox News, this lack of \"gun crime\" among \"suspected terrorist\" gun buyers is something of a tradition, going back at least as far as 2004:\n \n The NY Times article claims \"careful guidelines\" in the proposed \"terror loophole\" laws would protect prospective gun buyers from the obvious, enormous potential to abuse a law that grants one unelected official (the Attorney General--just the guy gun owners and the rest of America should trust) the power to unilaterally deny the Constitutionally guaranteed, fundamental human right of the individual to keep and bear arms--without a conviction, without an indictment, without even an arrest or formal charges. You see, a would-be gun buyer who is blocked from buying guns can appeal the \"suspected terrorist\" ruling. The Coalition to Stop Gun Violence (CSGV) describess gun owners' concerns about this proposed gaping hole in due process as \"conspiracy theories.\"\n\n \n   The Cafe Constitution: #2, Firearms \n The Constitution of the United States is not a café where one may pick and choose which items on the menu one prefers. The Constitution is what it is. These days it is popular to call it a \"living\" document. Which means it is subject to the whims of political correctness, a judiciary and executive branch overstepping the bounds of the separation of powers, goofy world wide trends, and a statist belief that the individual is no longer capable of making decisions without the strong arm of the federal government pointing the way. The matter of the Second Amendment and its interpretation is a case in point. It is a matter of whether or not the intent of the founders is valid any longer. The question is raised whether or not the people of the United States are about to have part of the Bill of Rights discarded because of political correctness and a perilous desire to leave defense of the self in the hands of government.\n ....\n \n The Federalist Papers, which describe the evolution of the Constitution by the Founders, speak to the issues in the Bill of Rights including those raised by today's crop of statists, collectivists, and the left. The intent of the founders is clear. But with regard to the Second Amendment the statists on the left don't care; they no longer consider the Constitution as it was written as relevant to the times.\n ....\n Each and every part of the Bill of Rights depends on the other for legitimacy. The Constitution may be amended but it may not be ignored. But no matter how many arguments there are about the legitimacy and meaning of the Second Amendment, collectivist-statists come up with a reason why it no longer applies.\n \n The integrity of the entire document and its affect on our rights and liberties is called into question. That includes the First Amendment which guarantees freedom of the press, speech and religion. Because if the Second Amendment, or the Fourth, or any other is made irrelevant for what may be perceived as a transitory good of the state, then the whole becomes subject to the same attacks.\n \n The rest of the liberties, as enumerated in the document, may eventually become irrelevant because they offend someone. For the perceived good of the collective state, the liberty of the individual is diminished.\n", 
   {
    "unicode_changes_made": true
   }, 
   429434, 
   null, 
   1305126180.0
  ], 
  [
   429788, 
   null, 
   "poet", 
   "Scientific laws, the law of gravity, Boils law, ohms law, laws of physics just to name a few. :)\n \n \n Maybe the law of unintended consequences. :)\n\n \n Like the following:\n \n Pennsylvania Boy Injured After Playing With Guns", 
   {}, 
   429417, 
   null, 
   1305468420.0
  ], 
  [
   429794, 
   null, 
   "Tither", 
   "Like the following:\n \n Pennsylvania Boy Injured After Playing With Guns\n\n Yeah, I wish things like that never happened at all. Ever! But alas, there are tons of dangerous products out there, and people are thin skinned and fragile. Hey Poet, maybe you will wax poetic about the things that cause even more accidental deaths. Oooooor don't they count, because they are not firearm deaths? We will all hold our breath, waiting. emoticon_smile\n \n Realize that I am in no way demeaning gun accidents, but. \n  Gun Accidents (and Kids & Gun Accidents) \n The reality does not correspond to the perception created by media coverage. Fatal gun accidents declined by almost sixty percent from 1975 to 1995, even though the number of guns per capita increased by almost forty percent.\n \n Fatal gun accidents involving children (aged 0-14) also fell significantly, from 495 in 1975, to under 250 in 1995. More children die from accidental drownings or burns than from gun accidents. \n (Gun supply statistics are from the Bureau of Alcohol Tobacco and Firearms, gun accident rates from the National Safety Council). \n \n Automobile = 43,000\n Falls = 16,200\n Poisoning by solids, liquids = 11,700\n Pedestrian1 = 5,300\n Drowning = 3,900\n Fires, burns = 3,600\n Suffocation by ingested object = 3,400\n \n Firearms = 600\n \n Poisoning by gases, vapors = 400\n All other causes = 14,500 \n TOTAL = 97,300\n\n Firearms account for 0.006 of the total accidents. Or 6/100ths of a percent. \n And the news even gets better. The latest figures for age 0 to 19 was down to 138 unintential deaths.\n \n Meanwhile the gun supply in the U.S. has been rising astronomically. There were an estimated 250 million firearms in citizen's hands before the NICS background checks was implemented. The amount of NICS checks since its inception?\n   Total NICS Background Checks -- November 30, 1998 - April 30, 2011  \n TOTAL = 130,025,276 \n\n 130 million background checks and violent crime and murder down to historic lows, and now gun accidents are too. Like I said, we all wish this were all zeros, but how. Nevertheless, we are headed in the right direction. No?", 
   {
    "unicode_changes_made": true
   }, 
   429788, 
   null, 
   1305471900.0
  ], 
  [
   429797, 
   null, 
   "Charlie_XT", 
   "Like the following:\n \n Pennsylvania Boy Injured After Playing With Guns\n\n \n I can reply with cases of children imitating professional wrestling and kill each other. What would you support in such cases, a ban on televised wrestling matches?\n \n Do Wrestling Shows Hurt Kids? - CBS News", 
   {}, 
   429788, 
   null, 
   1305472620.0
  ], 
  [
   429799, 
   null, 
   "poet", 
   "I can reply with cases of children imitating professional wrestling and kill each other. What would you support in such cases, a ban on televised wrestling matches?\n \n Do Wrestling Shows Hurt Kids? - CBS News\n\n \n Guns serve no useful purpose...but to maim or kill. A civilized, non-violent society would have outlawed them long ago. Wishful thinking", 
   {}, 
   429797, 
   null, 
   1305473400.0
  ], 
  [
   429800, 
   null, 
   "poet", 
   "Yeah, I wish things like that never happened at all. Ever! But alas, there are tons of dangerous products out there, and people are thin skinned and fragile. Hey Poet, maybe you will wax poetic about the things that cause even more accidental deaths. Oooooor don't they count, because they are not firearm deaths? We will all hold our breath, waiting. emoticon_smile\n \n Realize that I am in no way demeaning gun accidents, but. \n  Gun Accidents (and Kids & Gun Accidents) \n Firearms account for 0.006 of the total accidents. Or 6/100ths of a percent. \n And the news even gets better. The latest figures for age 0 to 19 was down to 138 unintential deaths.\n \n Meanwhile the gun supply in the U.S. has been rising astronomically. There were an estimated 250 million firearms in citizen's hands before the NICS background checks was implemented. The amount of NICS checks since its inception?\n   Total NICS Background Checks -- November 30, 1998 - April 30, 2011  \n 130 million background checks and violent crime and murder down to historic lows, and now gun accidents are too. Like I said, we all wish this were all zeros, but how. Nevertheless, we are headed in the right direction. No?\n\n \n People who indulge guns either have never grown up, or are mentally disturbed.", 
   {
    "unicode_changes_made": true
   }, 
   429794, 
   null, 
   1305473520.0
  ], 
  [
   429801, 
   null, 
   "Charlie_XT", 
   "People who indulge guns either have never grown up, or are mentally disturbed.\n\n \n I guess this contradicts with what you told me previously about how you support empowering women and being a feminist? You can't be a feminist if you support women being weaker and having less options than men.", 
   {}, 
   429800, 
   null, 
   1305473580.0
  ], 
  [
   429802, 
   null, 
   "Pietro", 
   "Guns serve no useful purpose...but to maim or kill.\n\n \n Isn't that what I told you? Didn't I tell you that guns are lethal weapon capable of inflicting harm and death if used incorrectly? They're no different than any other tool if used improperly. Death is death no matter what the implement is. Beat someone with a baseball bat or shoot them with a gun the result is the same.\n \n And sometimes there are cases where somebody has to be killed, like a violent criminal for instance. If you honestly believe that the life of the home stalker or rapist is of much greater importance than the life of their victim then you're the one who's truly disturbed.\n \n \nA civilized, non-violent society would have outlawed them long ago. Wishful thinking.\n\n \n Who says that we're either? America isn't a nonviolent society and it never has been. Look at hockey for example.\n \n To some Japan is arguably the most civilized, nonviolent society in the world. But they still haven't completely outlawed gun ownership.\n \n And then there's the fact that we're not a nation of peace but rather a nation of law. We have laws that bind government authority and restrict what it can and can't do. And as it is now the law states that guns can't be outlawed in a blanket manner. See DC v Heller and Chicago v McDonald.\n \n \nPeople who indulge guns either have never grown up, or are mentally disturbed.\n\n \n A true sign of being mentally disturbed is being afraid of an inanimate object that's incapable of committing harm without a human operator controlling it.", 
   {}, 
   429799, 
   null, 
   1305474060.0
  ], 
  [
   429810, 
   null, 
   "poet", 
   "Isn't that what I told you? Didn't I tell you that guns are lethal weapon capable of inflicting harm and death if used incorrectly? They're no different than any other tool if used improperly. Death is death no matter what the implement is. Beat someone with a baseball bat or shoot them with a gun the result is the same.\n \n And sometimes there are cases where somebody has to be killed, like a violent criminal for instance. If you honestly believe that the life of the home stalker or rapist is of much greater importance than the life of their victim then you're the one who's truly disturbed.\n \n \n \n Who says that we're either? America isn't a nonviolent society and it never has been. Look at hockey for example.\n \n To some Japan is arguably the most civilized, nonviolent society in the world. But they still haven't completely outlawed gun ownership.\n \n And then there's the fact that we're not a nation of peace but rather a nation of law. We have laws that bind government authority and restrict what it can and can't do. And as it is now the law states that guns can't be outlawed in a blanket manner. See DC v Heller and Chicago v McDonald.\n \n \n \n A true sign of being mentally disturbed is being afraid of an inanimate object that's incapable of committing harm without a human operator controlling it.\n\n \n Right. And we've already had a discussion, and I compared guns to nuclear weapons..and that is another inanimate object that in the wrong hands can unleash untold misery and destruction...but what useful purpose, pray tell, does it serve? Begone. Your argument defines your mental pathology.", 
   {}, 
   429802, 
   null, 
   1305483000.0
  ], 
  [
   429811, 
   null, 
   "poet", 
   "I guess this contradicts with what you told me previously about how you support empowering women and being a feminist? You can't be a feminist if you support women being weaker and having less options than men.\n\n \n Learn martial arts. Use Mace. Be aware, and pro-active. Guns serve no one.", 
   {}, 
   429801, 
   null, 
   1305483120.0
  ], 
  [
   429826, 
   null, 
   "Pietro", 
   "Right. And we've already had a discussion, and I compared guns to nuclear weapons..and that is another inanimate object that in the wrong hands can unleash untold misery and destruction...but what useful purpose, pray tell, does it serve? Begone. Your argument defines your mental pathology.\n\n \n I'll tell you the same thing that I told Galileo a while back. If you choose to put me on ignore then I'll just come back under a different alias to continue the discussion with you. And as long as hotmail addresses are accepted for account creations I'll have no shortage of aliases should you wish to play hardball.", 
   {}, 
   429810, 
   null, 
   1305488580.0
  ], 
  [
   429827, 
   null, 
   "Charlie_XT", 
   "Learn martial arts. Use Mace. Be aware, and pro-active. Guns serve no one.\n\n \n You claimed that were for the empowerment of women and yet you make these useless offerings of advice.\n \n Martial arts is a joke. I don't know about you but I don't have three years and $10,000 to learn a technique that won't enable me to protect myself. The amount of time and effort it takes to even begin becoming proficient at something like martial arts makes it far too impractical to be a viable alternative to an already effective solution.\n \n Being aware, being proactive and carrying mace ultimately do no good when the **** hits the fan and you find yourself in a situation where nonviolence and evasion aren't acceptable answers. Being aware does no good when you're being carjacked at a red light, and being proactive is useless you're confronted by a knife wielding rapist.\n \n You really have no business telling those that are the most likely to be victims of crime, to limit themselves to noneffective alternatives that the criminals will never limit themselves to as well.", 
   {}, 
   429811, 
   null, 
   1305489300.0
  ], 
  [
   429836, 
   null, 
   "Freedom", 
   "You claimed that were for the empowerment of women and yet you make these useless offerings of advice.\n \n Martial arts is a joke. I don't know about you but I don't have three years and $10,000 to learn a technique that won't enable me to protect myself. The amount of time and effort it takes to even begin becoming proficient at something like martial arts makes it far too impractical to be a viable alternative to an already effective solution.\n \n Being aware, being proactive and carrying mace ultimately do no good when the **** hits the fan and you find yourself in a situation where nonviolence and evasion aren't acceptable answers. Being aware does no good when you're being carjacked at a red light, and being proactive is useless you're confronted by a knife wielding rapist.\n \n You really have no business telling those that are the most likely to be victims of crime, to limit themselves to noneffective alternatives that the criminals will never limit themselves to as well.\n\n Alright charlie, you are right about taking a long time to learn; and about it being more expensive than a gun; but martial arts are not useless. The problem is that most teachers either don't know what their doing or figure since you probably aren't going to use it they don't need to teach you correctly. If however you find someone who wants to teach you how to fight not just some ancient pretty form you would have an excellent chance of defending yourself from anyone who hasn't had training. The strength women between men and women is quite insignificant to the techniques that exist.\n \n That being said there is always the danger that the aggressor is also good at hand to hand combat, but if you think about it; there is also a chance that they have a gun.", 
   {}, 
   429827, 
   null, 
   1305491940.0
  ], 
  [
   429839, 
   null, 
   "gansao", 
   "Alright charlie, you are right about taking a long time to learn; and about it being more expensive than a gun; but martial arts are not useless. The problem is that most teachers either don't know what their doing or figure since you probably aren't going to use it they don't need to teach you correctly. If however you find someone who wants to teach you how to fight not just some ancient pretty form you would have an excellent chance of defending yourself from anyone who hasn't had training. The strength women between men and women is quite insignificant to the techniques that exist.\n \n That being said there is always the danger that the aggressor is also good at hand to hand combat, but if you think about it; there is also a chance that they have a gun.\n\n \n Teaching women martial arts to protect themselves from attacks from men is fraught with danger..for the women.\n If you are saying that techniques exist that that are easily taught and remembered as well as easily executed by someone full of tension and fear then you are wrong...dreadfully wrong.\n Also, the techniques must overcome an attacker of maybe several times the strength of the defender .", 
   {}, 
   429836, 
   null, 
   1305492840.0
  ], 
  [
   429843, 
   null, 
   "Tither", 
   "God created man/woman, Coronal Colt made them equal!", 
   {}, 
   429839, 
   null, 
   1305495780.0
  ], 
  [
   429846, 
   null, 
   "Penfold", 
   "God created man/woman, Coronal Colt made them equal!\n\n \n No he didn't, and no he didn't.\n \n Coronal?\n \n I bet you believe that a woman is like a piano.\n \n When she's not upright, she's grand.;)", 
   {}, 
   429843, 
   null, 
   1305496440.0
  ], 
  [
   429848, 
   null, 
   "gansao", 
   "No he didn't, and no he didn't.\n \n Coronal?\n \n I bet you believe that a woman is like a piano.\n \n When she's not upright, she's grand.;)\n\n \n A trip down memory lane for you ,eh;)", 
   {}, 
   429846, 
   null, 
   1305496800.0
  ], 
  [
   429855, 
   null, 
   "Charlie_XT", 
   "No he didn't, and no he didn't.\n \n Coronal?\n \n I bet you believe that a woman is like a piano.\n \n When she's not upright, she's grand.;)\n\n \n Equal or unequal, nobody ever tries to argue with a bullet.", 
   {}, 
   429846, 
   null, 
   1305497820.0
  ], 
  [
   429858, 
   null, 
   "gansao", 
   "Sensei Shiro Asano....'If you want to be unbeatable, buy a gun'", 
   {}, 
   429855, 
   null, 
   1305498300.0
  ], 
  [
   429868, 
   null, 
   "Freedom", 
   "Teaching women martial arts to protect themselves from attacks from men is fraught with danger..for the women.\n\n What, they might get the guy mad?\n \n \nIf you are saying that techniques exist that that are easily taught and remembered as well as easily executed by someone full of tension and fear then you are wrong...dreadfully wrong.\n\n I didn't say they were easily taught or remembered. I said if properly taught they are effective.\n \n \nAlso, the techniques must overcome an attacker of maybe several times the strength of the defender.\n\n Strength is an asset to be sure but both genders posses the strength required to incapacitate anyone. Just not by flailing your limbs about trying to bruise the enemy into submission.", 
   {}, 
   429839, 
   null, 
   1305501180.0
  ], 
  [
   429874, 
   null, 
   "gansao", 
   "What, they might get the guy mad?\n \n \n I didn't say they were easily taught or remembered. I said if properly taught they are effective.\n \n \n Strength is an asset to be sure but both genders posses the strength required to incapacitate anyone. Just not by flailing your limbs about trying to bruise the enemy into submission.\n\n \n That is one of the biggest problems for anyone who attacks someone who is far more powerful than you...you may break his nose..then he breaks your neck.\n 'properly taught' doesnt actually mean squat...the recipient of this ' properly taught knowledge must be able to do it under stress that you will not be able to reproduce in your garage or ' dojo'.\n Even highly trained ' martial artists' can freeze outside thier comfort zone.\n You may be able to' incapacitate' your friends in a dojo but incapacitating a man that has twice your strength and has just punched you in the face and is ripping your dress is another thing.\n It takes years to learn to make up the difference of someone who has a significant strength and aggression advantage.\n I have trained with many women who have a good martial arts background and I have only met one that could beat a strong young man...and a woman who was being mugged or raped would have to do that very very quickly before being overcome.", 
   {}, 
   429868, 
   null, 
   1305502200.0
  ], 
  [
   429876, 
   null, 
   "zsu2357", 
   "Then what if the women in question are let us say 60-80 yrs. old and on the frail side?then what?", 
   {}, 
   429868, 
   null, 
   1305502380.0
  ], 
  [
   429879, 
   null, 
   "gansao", 
   "Then what if the women in question are let us say 60-80 yrs. old and on the frail side?then what?\n\n \n I wouldnt even say that was a consideration zsu.\n If I wanted to incapacitate a woman , the FIRST thing that I would do would be to hit her in the body...I can almost guarantee that this would render her defencless...ribs,lower abdomen.chest..no problem.\n A woman would be as easy to overcome as a frail old person.\n Taking a man out with one punch is a completely different problem..and going for the nuts/eyes/throat is a very risky business", 
   {}, 
   429876, 
   null, 
   1305502800.0
  ], 
  [
   429882, 
   null, 
   "Freedom", 
   "'properly taught' doesnt actually mean squat...the recipient of this ' properly taught knowledge must be able to do it under stress that you will not be able to reproduce in your garage or ' dojo'.\n\n Properly taught includes dealing with stress and thinking clearly in a fight.\n \n \nIt takes years to learn to make up the difference of someone who has a significant strength and aggression advantage.\n\n I won't argue against that, and even minimal training or past fighting experience on the aggressors side can counter-act that.\n \n \nI have trained with many women who have a good martial arts background and I have only met one that could beat a strong young man...and a woman who was being mugged or raped would have to do that very very quickly before being overcome.\n\n Most schools are not about real combat but some kind of meditative art that happens to be descended from a way of fighting. They teach kids as a soccer alternative and hand out belts like candy. I am talking about the mixed martial arts taught to military personal. (not to say that a pure martial art isn't 'good enough' but merely refering to the style of training, in which the stress and confusion of a real fight is trying to be simulated)", 
   {}, 
   429874, 
   null, 
   1305503580.0
  ], 
  [
   429884, 
   null, 
   "gansao", 
   "Properly taught includes dealing with stress and thinking clearly in a fight.\n \n \n I won't argue against that, and even minimal training or past fighting experience on the aggressors side can counter-act that.\n \n \n Most schools are not about real combat but some kind of meditative art that happens to be descended from a way of fighting. They teach kids as a soccer alternative and hand out belts like candy. I am talking about the mixed martial arts taught to military personal. (not to say that a pure martial art isn't 'good enough' but merely refering to the style of training, in which the stress and confusion of a real fight is trying to be simulated)\n\n \n Ok. How is this stress and confusion replicated , bearing in mind that you cant just have the teacher put the pupil through a small amount of stress and controlled pain and expecting the experience to be of any advantage for long?", 
   {}, 
   429882, 
   null, 
   1305503940.0
  ], 
  [
   429888, 
   null, 
   "Freedom", 
   "Ok. How is this stress and confusion replicated , bearing in mind that you cant just have the teacher put the pupil through a small amount of stress and controlled pain and expecting the experience to be of any advantage for long?\n\n The same way it is in military training, lots of yelling; many sparing sessions as opposed to punching bags. Doing some of the training in different locations so students don't associate their fighting skills only with the school. Doing exercises which emphasize unexpected attacks, and yes making sure people know what being punched feels like and training them to keep going even with that pain.\n \n I don't agree that the advantage of this would 'wear off' so easily. I also realize it's a little intense which is why schools like this are rare and instructors are mostly in the military.\n \n Remember I am not arguing it's easier than owning a gun or more effective. It is however (and unfortunately) the only choice for some who live where gun laws are too restrictive to allow much else.", 
   {}, 
   429884, 
   null, 
   1305505260.0
  ], 
  [
   429890, 
   null, 
   "gansao", 
   "The same way it is in military training, lots of yelling; many sparing sessions as opposed to punching bags. Doing some of the training in different locations so students don't associate their fighting skills only with the school. Doing exercises which emphasize unexpected attacks, and yes making sure people know what being punched feels like and training them to keep going even with that pain.\n \n I don't agree that the advantage of this would 'wear off' so easily. I also realize it's a little intense which is why schools like this are rare and instructors are mostly in the military.\n \n Remember I am not arguing it's easier than owning a gun or more effective. It is however (and unfortunately) the only choice for some who live where gun laws are too restrictive to allow much else.\n\n \n Sparring sessions do not even start to replicate the emotions that you have in a ' street' situation .\n The other consideration is that there is never a good uptake of women for classes of this kind.\n Look at it from another point of view..two men can fight full contact and reproduce a similar situation of a street fight( in fact letting a sparring session get out of hand is a good way of training serious students).\n However this cannot be allowed to happen in a male female sparring session because the woman will get creamed in a stand up fight.\n So a realistic session would be for a male student to attack a female student full on and the female student to strike a vital area to neutralise his attack..to be honest I would refuse to be kicked in the balls or gouged by a female student because she was incapable of stopping me in any other way.\n \n The 'emotion' training wears off very quickly...in fact as quickly as the instinctual reaction to attack.", 
   {}, 
   429888, 
   null, 
   1305506160.0
  ], 
  [
   429892, 
   null, 
   "Charlie_XT", 
   "Alright let me begin by saying that this whole \"learn martial arts\" thing is complete and utter bull**** and should never be offered as defensive advise under any circumstances.\n \n To start with the average martial arts courses won't teach you anything useful for dealing with a serious attacker. The kind of stuff taught on these weekend courses is designed to be as simple and appealing as possible for the sake of generating money and contains no real world applicability whatsoever.\n \n What needs to be learned for quickly and efficiently disabling a serious attacker are the hard core Special Forces maneuvers that are designed for effectively killing a target with as little hassle as possible. These are the lessons that if learned incorrectly can potentially cripple the learner for the rest of their lives and leaving them dependent on a cane or a wheelchair to get around. Even if you can learn them they have absolutely no deterrent effect on whatever lowlife wants to rape you. You can't just hold up your hands and expect them to leave you alone, these skills can only be deployed once violent and conflict are your only available option left. A gun on the other hand will work simply by pulling it out and pointing it in the attacker's direction.\n \n Questionable legalities of these advances techniques aside, the time and the money necessary to learn them are far beyond the means of your average private individual, never mind those who are economically challenged or suffer serious physical injuries from previous abuse, or have to deal with an abusive spouse every single day of the year. Who has thousands of dollars and many years to prepare for an unpredictable attack to come their direction? Absolutely nobody. In the time you spend learning the basics of whatever advanced martial arts technique you desire you can be quickly and mercilessly killed by someone who's physically bigger and stronger than you even if they're as dumb as a caveman.\n \n Guns work best, everything else doesn't and that's a fact of life. If martial arts works cops wouldn't need guns, they could just karate chop a violent suspect and that'd be the end of the story.", 
   {}, 
   429836, 
   null, 
   1305506340.0
  ], 
  [
   429894, 
   null, 
   "gansao", 
   "Alright let me begin by saying that this whole \"learn martial arts\" thing is complete and utter bull**** and should never be offered as defensive advise under any circumstances.\n \n To start with the average martial arts courses won't teach you anything useful for dealing with a serious attacker. The kind of stuff taught on these weekend courses is designed to be as simple and appealing as possible for the sake of generating money and contains no real world applicability whatsoever.\n \n What needs to be learned for quickly and efficiently disabling a serious attacker are the hard core Special Forces maneuvers that are designed for effectively killing a target with as little hassle as possible. These are the lessons that if learned incorrectly can potentially cripple the learner for the rest of their lives and leaving them dependent on a cane or a wheelchair to get around. Even if you can learn them they have absolutely no deterrent effect on whatever lowlife wants to rape you. You can't just hold up your hands and expect them to leave you alone, these skills can only be deployed once violent and conflict are your only available option left. A gun on the other hand will work simply by pulling it out and pointing it in the attacker's direction.\n \n Questionable legalities of these advances techniques aside, the time and the money necessary to learn them are far beyond the means of your average private individual, never mind those who are economically challenged or suffer serious physical injuries from previous abuse, or have to deal with an abusive spouse every single day of the year. Who has thousands of dollars and many years to prepare for an unpredictable attack to come their direction? Absolutely nobody. In the time you spend learning the basics of whatever advanced martial arts technique you desire you can be quickly and mercilessly killed by someone who's physically bigger and stronger than you even if they're as dumb as a caveman.\n \n Guns work best, everything else doesn't and that's a fact of life. If martial arts works cops wouldn't need guns, they could just karate chop a violent suspect and that'd be the end of the story.\n\n \n I absolutely and totally agree with this post.", 
   {}, 
   429892, 
   null, 
   1305506640.0
  ], 
  [
   429901, 
   null, 
   "zsu2357", 
   "I wouldnt even say that was a consideration zsu.\n If I wanted to incapacitate a woman , the FIRST thing that I would do would be to hit her in the body...I can almost guarantee that this would render her defencless...ribs,lower abdomen.chest..no problem.\n A woman would be as easy to overcome as a frail old person.\n Taking a man out with one punch is a completely different problem..and going for the nuts/eyes/throat is a very risky business\n\n \n Ah but if she were armed that might also be the last thing you ever tried,mostly I was trying to get something across to Sunshine(aka Poet).", 
   {}, 
   429879, 
   null, 
   1305508740.0
  ], 
  [
   429906, 
   null, 
   "Freedom", 
   "I absolutely and totally agree with this post.\n\n As do I except for the first line. The fact that professional soldiers, females included are taught these techniques even though they fight in concert with tanks and helicopter gunships ought to be evidence enough that no level of combat should be considered outmoded.\n \n \nAh but if she were armed that might also be the last thing you ever tried,mostly I was trying to get something across to Sunshine(aka Poet).\n\n By the same token that trying to defend yourself in a fist fight is 'more dangerous' than not could not pointing a gun at someone infuriate them to kill you later when they have the gun out first.", 
   {}, 
   429901, 
   null, 
   1305511260.0
  ], 
  [
   429907, 
   null, 
   "poet", 
   "Ah but if she were armed that might also be the last thing you ever tried,mostly I was trying to get something across to Sunshine(aka Poet).\n\n \n Poet doesn't need anyone to \"get something across\" to him. Poet realizes everyone is entitled to their own opinion...regardless of how stupid or inane it is. I was more intrigued by gansao's post:\n Originally Posted by gansao \n \nI wouldnt even say that was a consideration zsu.\n If I wanted to incapacitate a woman , the FIRST thing that I would do would be to hit her in the body...I can almost guarantee that this would render her defencless...ribs,lower abdomen.chest..no problem.\n A woman would be as easy to overcome as a frail old person.\n Taking a man out with one punch is a completely different problem..and going for the nuts/eyes/throat is a very risky business \n\n \n Obviously, he's had experience in perpetrating violence on women. No problem. Pathetic. Disgusting.", 
   {}, 
   429901, 
   null, 
   1305511980.0
  ], 
  [
   429910, 
   null, 
   "Charlie_XT", 
   "As do I except for the first line. The fact that professional soldiers, females included are taught these techniques even though they fight in concert with tanks and helicopter gunships ought to be evidence enough that no level of combat should be considered outmoded.\n\n \n Professional soldiers aren't taught martial arts along the lines of karate, judo, or other watered down techniques designed to appeal to the masses and be simple enough for children to participate in.", 
   {}, 
   429906, 
   null, 
   1305513000.0
  ], 
  [
   429912, 
   null, 
   "Freedom", 
   "Professional soldiers aren't taught martial arts along the lines of karate, judo, or other watered down techniques designed to appeal to the masses and be simple enough for children to participate in.\n\n Karate, judo, and the other martial arts are not inherently watered down that is merely how they are presented. The mixed martial arts soldiers are taught are the most dangerous attacks and most effective defences from many martial arts. They all began as very real very practical fighting skills.", 
   {}, 
   429910, 
   null, 
   1305514140.0
  ], 
  [
   429936, 
   null, 
   "gansao", 
   "Ah but if she were armed that might also be the last thing you ever tried,mostly I was trying to get something across to Sunshine(aka Poet).\n\n \n Exactly but I dont really feel I should have an opinion about gun ownership in the US.", 
   {}, 
   429901, 
   null, 
   1305543660.0
  ], 
  [
   429937, 
   null, 
   "gansao", 
   "Poet doesn't need anyone to \"get something across\" to him. Poet realizes everyone is entitled to their own opinion...regardless of how stupid or inane it is. I was more intrigued by gansao's post:\n Originally Posted by gansao \n \n \n Obviously, he's had experience in perpetrating violence on women. No problem. Pathetic. Disgusting.\n\n \n Silly old foolemoticon_xdonno", 
   {}, 
   429907, 
   null, 
   1305543780.0
  ], 
  [
   429938, 
   null, 
   "gansao", 
   "As do I except for the first line. The fact that professional soldiers, females included are taught these techniques even though they fight in concert with tanks and helicopter gunships ought to be evidence enough that no level of combat should be considered outmoded.\n \n \n By the same token that trying to defend yourself in a fist fight is 'more dangerous' than not could not pointing a gun at someone infuriate them to kill you later when they have the gun out first.\n\n \n Female soldiers are taught unarmed combat alongside armed combat.\n If a battle was fought unarmed the female soldiers would not nearly be effective as the men.\n The fact is that they are usually smaller than men and pound for pound weaker too.There is not many simple techniques that can be used by a 10 stone ,not particularly fit man to render an 18 stone man helpless while he assaults the smaller man..especially if the smaller man is terrified.\n So why expect techniques taught for a hour or two to women to be effective?\n Take another example..boxing.\n A ten stone woman would not last a round against an equally trained ten stone man..there are exceptions but not many.\n There is a lot of sense in your second sentence.\n If there was a chance that a potential victim was armed with a gun then you would HAVE to render them helpless immediately.\n \n I dont have an opinion about gun ownership in the US but I know that teaching women unarmed combat as an effect way to render an assailant helpless can be very dangerous for the women .", 
   {}, 
   429906, 
   null, 
   1305545400.0
  ], 
  [
   429939, 
   null, 
   "gansao", 
   "Karate, judo, and the other martial arts are not inherently watered down that is merely how they are presented. The mixed martial arts soldiers are taught are the most dangerous attacks and most effective defences from many martial arts. They all began as very real very practical fighting skills.\n\n \n Mixed martial arts as taught by your local club is take downs,elbows and generally power stuff ..not suited for women really.\n Why should a woman go to her local mixed martial arts club, train for years to learn,breaks,locks,strikes,break falls,power training and endurance,endure pain and injury,maybe bulk up .. just so she MAY be able to fight her way out of a mugging or potential rape ...when she can carry a pistol?", 
   {}, 
   429912, 
   null, 
   1305546660.0
  ], 
  [
   429940, 
   null, 
   "Freedom", 
   "Female soldiers are taught unarmed combat alongside armed combat.\n If a battle was fought unarmed the female soldiers would not nearly be effective as the men.\n The fact is that they are usually smaller than men and pound for pound weaker too.There is not many simple techniques that can be used by a 10 stone ,not particularly fit man to render an 18 stone man helpless while he assaults the smaller man..especially if the smaller man is terrified.\n So why expect techniques taught for a hour or two to women to be effective?\n Take another example..boxing.\n A ten stone woman would not last a round against an equally trained ten stone man..there are exceptions but not many.\n There is a lot of sense in your second sentence.\n If there was a chance that a potential victim was armed with a gun then you would HAVE to render them helpless immediately.\n \n I dont have an opinion about gun ownership in the US but I know that teaching women unarmed combat as an effect way to render an assailant helpless can be very dangerous for the women .\n\n Perhaps then the wise thing to do is to carry not only a firearm, but handcuffs, a tazer, and pepper spray. That way you can render them helpless while you have your weapon trained on them without killing them.\n \n My personal belief is that a concealed weapon is worth 1/10 a displayed weapon when it comes to preventing attack. However the anti-gun nuts for no reason in particular find that the most offensive prospect. If I was afraid of guns I would at least like to know if some one's got one so I know to be wary if they seem unstable.\n \n \nMixed martial arts as taught by your local club is take downs,elbows and generally power stuff ..not suited for women really.\n Why should a woman go to her local mixed martial arts club, train for years to learn,breaks,locks,strikes,break falls,power training and endurance,endure pain and injury,maybe bulk up .. just so she MAY be able to fight her way out of a mugging or potential rape ...when she can carry a pistol?\n\n She might be afraid of killing someone in a moment of fright. I know that sounds cliche, but you were just making a case that this poor frightened woman couldn't possibly maintain the composure to fight effectively. Your image painting has worked but now I am a frightened by a freaked out stressed person with a gun pointing at anyone who happens to be walking down an alley with a hood. I also may have an exaggerated view of the danger of accidental gun fire because my uncle was killed in a misfire accident.\n \n If someone has a gun it is doubly important that they keep their head if they fear they about to be attacked. Let's be honest, predicting the attack is the only thing that is going to help anyway. You have just finished making the case that hand to hand there is no chance for women which means that she has got to pull and aim before the attacker is upon her or else he could just wrest the gun from her. Take for instance a guy passing a woman in an alleyway. If he decides to attack her just as their passing, perhaps with a knife; that gun is pretty useless. She would have to have it out before that time.\n \n The underlying framework of my point, starting with the comments on unarmed training; is that the general curriculum of a soldier is an excellent model of gaining and holding military power (unsurprisingly). There is no magic fix that will protect you from aggressors. A fight just like a war is subject to tactical and strategic axioms, and all the well laid plans in the world will do you little good if you panic in the moment of conflict.\n \n The advantage of a gun is setting up an individual MAD situation if the other guy has a gun, but that is a psychological defense; it doesn't work unless they can see you are armed.\n \n If you actually needed to win a gun fight, you would probably be looking at a similar investment in time and energy training with a firearm as you would need to win a fist fight.", 
   {}, 
   429939, 
   null, 
   1305552960.0
  ], 
  [
   429947, 
   null, 
   "Charlie_XT", 
   "I said it before and I'll say it again. The concept of martial arts being a viable self defense strategy is complete and utter bull****. There's absolutely no martial arts styles or techniques that can be both be readily learned, and effective enough to enable a woman to easily incapacitate a male assailant. That is the stuff of bad Hollywood movies and anybody who believes it accurately reflects real life is as deranged as those who still think the Earth is flat, or that the Holocaust never happened.\n \n When a person needs to defend themselves they need to be able to defend themselves NOW! Not five years from now, not even five months from now. For something to be considered a viable defensive strategy is has to be capable of being realistically deployed within a matter of days at the very most. And martial arts simply isn't capable of doing that.\n \n Women are eternally stuck behind men in the physical area, and no quick weekend course at the local karate club is going to change that fact, ever. No limb lock is going to compensate for the fact that a man can put a woman in a one handed choke hold and throw them against a wall with little effort.\n \n Nobody who ever suggests learning martial arts for protection is a woman. Because no woman would ever make such a stupid statement to another woman in all seriousness. Who suggests martial arts? Men who by default are the physically strongest and most capable of the species. They never have to worry about being smaller, weaker or more scared than anybody else.\n \n If you can come up with something that will render guns completely obsolete for personal protection then be sure you tell it to the military and the police and the Secret Service first. Let them give up their guns and bombs and stuff for this new alternative you're so favorable of. Let them prove that it's effective and works the way you claim it does.", 
   {}, 
   429940, 
   null, 
   1305558420.0
  ], 
  [
   429949, 
   null, 
   "gansao", 
   "Perhaps then the wise thing to do is to carry not only a firearm, but handcuffs, a tazer, and pepper spray. That way you can render them helpless while you have your weapon trained on them without killing them.\n \n My personal belief is that a concealed weapon is worth 1/10 a displayed weapon when it comes to preventing attack. However the anti-gun nuts for no reason in particular find that the most offensive prospect. If I was afraid of guns I would at least like to know if some one's got one so I know to be wary if they seem unstable.\n \n \n She might be afraid of killing someone in a moment of fright. I know that sounds cliche, but you were just making a case that this poor frightened woman couldn't possibly maintain the composure to fight effectively. Your image painting has worked but now I am a frightened by a freaked out stressed person with a gun pointing at anyone who happens to be walking down an alley with a hood. I also may have an exaggerated view of the danger of accidental gun fire because my uncle was killed in a misfire accident.\n \n If someone has a gun it is doubly important that they keep their head if they fear they about to be attacked. Let's be honest, predicting the attack is the only thing that is going to help anyway. You have just finished making the case that hand to hand there is no chance for women which means that she has got to pull and aim before the attacker is upon her or else he could just wrest the gun from her. Take for instance a guy passing a woman in an alleyway. If he decides to attack her just as their passing, perhaps with a knife; that gun is pretty useless. She would have to have it out before that time.\n \n The underlying framework of my point, starting with the comments on unarmed training; is that the general curriculum of a soldier is an excellent model of gaining and holding military power (unsurprisingly). There is no magic fix that will protect you from aggressors. A fight just like a war is subject to tactical and strategic axioms, and all the well laid plans in the world will do you little good if you panic in the moment of conflict.\n \n The advantage of a gun is setting up an individual MAD situation if the other guy has a gun, but that is a psychological defense; it doesn't work unless they can see you are armed.\n \n If you actually needed to win a gun fight, you would probably be looking at a similar investment in time and energy training with a firearm as you would need to win a fist fight.\n\n \n You are referring to trained soldiers which is a completely different thing from a woman who goes to ' self defence' lessons once or twice a week and is told that the techniques learned will protect her from an assault by a fully grown man.\n If you are recommending that women who want to learn how to protect themselves from a potential attack from a man should join the forces and become a combat soldier then I have no comment to make on this point.\n \n As said I cannot comment on gun owneship in the US but I can comment and do know that most of the self defence lessons given to women is useless guff taken out of context with a real life situation.", 
   {}, 
   429940, 
   null, 
   1305559020.0
  ], 
  [
   429950, 
   null, 
   "gansao", 
   "I said it before and I'll say it again. The concept of martial arts being a viable self defense strategy is complete and utter bull****. There's absolutely no martial arts styles or techniques that can be both be readily learned, and effective enough to enable a woman to easily incapacitate a male assailant. That is the stuff of bad Hollywood movies and anybody who believes it accurately reflects real life is as deranged as those who still think the Earth is flat, or that the Holocaust never happened.\n \n When a person needs to defend themselves they need to be able to defend themselves NOW! Not five years from now, not even five months from now. For something to be considered a viable defensive strategy is has to be capable of being realistically deployed within a matter of days at the very most. And martial arts simply isn't capable of doing that.\n \n Women are eternally stuck behind men in the physical area, and no quick weekend course at the local karate club is going to change that fact, ever. No limb lock is going to compensate for the fact that a man can put a woman in a one handed choke hold and throw them against a wall with little effort.\n \n Nobody who ever suggests learning martial arts for protection is a woman. Because no woman would ever make such a stupid statement to another woman in all seriousness. Who suggests martial arts? Men who by default are the physically strongest and most capable of the species. They never have to worry about being smaller, weaker or more scared than anybody else.\n\n \n I thik if the same ' martial arts experts' that teach women self defence lessons would try to sell the same techniques to men by teling them that they could deal with an attack by any heavyweight proffessional boxer in seconds then it would put their claims into perspective.", 
   {}, 
   429947, 
   null, 
   1305559380.0
  ], 
  [
   429951, 
   null, 
   "Tither", 
   "Professional soldiers aren't taught martial arts along the lines of karate, judo, or other watered down techniques designed to appeal to the masses and be simple enough for children to participate in.\n\n And what about us elderly and disabled people? \n \n The hand to hand training is for when things go HORRIBLY wrong! Horribly wrong! As in, Oh Sh**. I have No Other Choice. If this doesn&#8217;t work, I am dead, Horribly wrong. Last resort, as in, chose all other options first! Stick, knife, broken bottle, anything but bear hands Horribly wrong.", 
   {}, 
   429910, 
   null, 
   1305563160.0
  ], 
  [
   430359, 
   null, 
   "Freedom", 
   "When a person needs to defend themselves they need to be able to defend themselves NOW! Not five years from now, not even five months from now. For something to be considered a viable defensive strategy is has to be capable of being realistically deployed within a matter of days at the very most. And martial arts simply isn't capable of doing that.\n\n Well if we are talking about the moment of attack it needs to be deployed in seconds, so that means you need to prepare to defend yourself. Buying a gun is a preparative step just as much as learning martial arts would be. Remember I never claimed learning martial arts was faster, cheaper, easier than buying a gun.\n \n \nNobody who ever suggests learning martial arts for protection is a woman. Because no woman would ever make such a stupid statement to another woman in all seriousness. Who suggests martial arts? Men who by default are the physically strongest and most capable of the species. They never have to worry about being smaller, weaker or more scared than anybody else.\n\n You caught me. Don't think all males are Arnold Schwarzenegger though. You can have no hope as a weak or old male too. I suggest and I stand by my suggestion that if you intend to fight to defend yourself that if you are going to risk getting your attacker angry you had better go the whole mile. You can turn a perp who just wanted your purse into a murderer or worse if you lose.\n \n The modern soldier is the embodiment of the military philosophy and knowledge of mankind, if they are concerned with the possibility of a melee fight; you should be too.\n \n \nIf you can come up with something that will render guns completely obsolete for personal protection\n\n Working on it.\n \n \nthen be sure you tell it to the military and the police and the Secret Service first. Let them give up their guns and bombs and stuff for this new alternative you're so favorable of. Let them prove that it's effective and works the way you claim it does.\n\n Knowing how to fight with your body is not exclusive to knowing how to fight with a gun. Even if it's just the ability to put enough distance between you and your opponent to pull your gun it may be necessary.\n \n \nYou are referring to trained soldiers which is a completely different thing from a woman who goes to ' self defence' lessons once or twice a week and is told that the techniques learned will protect her from an assault by a fully grown man.\n If you are recommending that women who want to learn how to protect themselves from a potential attack from a man should join the forces and become a combat soldier then I have no comment to make on this point.\n \n As said I cannot comment on gun owneship in the US but I can comment and do know that most of the self defence lessons given to women is useless guff taken out of context with a real life situation.\n\n Agreed", 
   {}, 
   429951, 
   null, 
   1306042260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What to do with women", 
  "url": "http://www.4forums.com/political/gun-control-debates/15322-what-do-women.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 15322, 
  "discussion_files": [
   [
    "770.html", 
    "http://www.4forums.com/political/gun-control-debates/15322-what-do-women-print.html"
   ], 
   [
    "771.html", 
    "http://www.4forums.com/political/gun-control-debates/15322-what-do-women-12-print.html"
   ], 
   [
    "772.html", 
    "http://www.4forums.com/political/gun-control-debates/15322-what-do-women-10-print.html"
   ], 
   [
    "773.html", 
    "http://www.4forums.com/political/gun-control-debates/15322-what-do-women-8-print.html"
   ], 
   [
    "774.html", 
    "http://www.4forums.com/political/gun-control-debates/15322-what-do-women-6-print.html"
   ], 
   [
    "775.html", 
    "http://www.4forums.com/political/gun-control-debates/15322-what-do-women-4-print.html"
   ], 
   [
    "776.html", 
    "http://www.4forums.com/political/gun-control-debates/15322-what-do-women-5-print.html"
   ], 
   [
    "777.html", 
    "http://www.4forums.com/political/gun-control-debates/15322-what-do-women-7-print.html"
   ], 
   [
    "778.html", 
    "http://www.4forums.com/political/gun-control-debates/15322-what-do-women-9-print.html"
   ], 
   [
    "779.html", 
    "http://www.4forums.com/political/gun-control-debates/15322-what-do-women-11-print.html"
   ], 
   [
    "780.html", 
    "http://www.4forums.com/political/gun-control-debates/15322-what-do-women-3-print.html"
   ], 
   [
    "781.html", 
    "http://www.4forums.com/political/gun-control-debates/15322-what-do-women-2-print.html"
   ]
  ], 
  "identifier": 15322
 }
]