[
 [
  [
   430067, 
   null, 
   "NATO 556", 
   "Connecticut Law Tribune: 18th-Century Americans Were Actually Well-Armed\n \n \nIn Daniel Kirsch&#8217;s May 9 column, &#8220;Founding Fathers Weren&#8217;t Gun Toters,&#8221; he claims the Founders and their contemporaries &#8220;did not own guns.&#8221; This falsehood derives from Michael Bellesiles&#8217; &#8220;Arming America,&#8221; which initially received the Bancroft Prize in American history &#8211; given by academics who share Kirsch&#8217;s antipathy to guns and their owners. Mr. Kirsch is presumably unaware that the book has been discredited as a fraud, its Bancroft prize has been rescinded, its publication halted and Bellesiles driven from academia.\n \n The facts, as Professor John M. Dederer notes, are that &#8220;by the 18th century, Americans were the most heavily armed people in the world.&#8221; (&#8220;War In America To 1775,&#8221; published in 1990). Indeed, all the Founding Fathers seem to have owned guns, specifically including George Washington (a gun collector), John Adams, Sam Adams, Thomas Jefferson (a gun collector and amateur gunsmith), Benjamin Franklin and Thomas Paine.\n \n Last but not least, James Madison, author of the Second Amendment, boasted of his marksmanship skills, though admitting that they were no better than average among his friends.\n \n Regarding the Founders&#8217; attitudes toward gun ownership as a basic right, three quotes are indicative:\n \n &#8226; Thomas Jefferson&#8217;s personal journal of great quotations reiterates Cesare Beccaria (&#8220;the father of criminlogy&#8221;) dismissing gun control as a &#8220;false idea of utility&#8221; because only the law abiding obey &#8211; leaving criminals armed.\n \n &#8226; Roger Sherman of Connecticut described having guns as &#8220;the privilege of every citizen, [it being] one of his most essential rights, to bear arms, and to resist every attack on his liberty and property, by whomsoever made.&#8221;\n \n &#8226; Thomas Paine also exulted in owning guns and endorsed the right to arms, declaring &#8220;arms like laws discourage and keep the invader and plunderer in awe and preserve order in the world as well as property.&#8221;\n \n All three of these, and hundreds of other such quotations from late 18th-century Americans, can be found in Stephen Halbrook&#8217;s &#8220;The Founders of The Second Amendment&#8221; (2008).\n \n Mr. Kirsch is also apparently unaware that modern criminological studies concur that gun control disarms only the harmless while leaving criminals armed. After reviewing hundreds of studies the National Academy of Sciences (2004) and the Centers for Disease Control and Prevention (2003) could not identify any gun control that had curbed violence, suicide or gun accidents. (See Charles F. Wellford, &#8220;Firearms and Violence: A Critical Review; National Academy of Sciences; 2004).\n \n The Kirsch article has other crucial errors. For instance, Mr. Kirsch seems to think that because England and Russia ban handguns so does all of Europe.\n \n In fact, law-abiding Europeans generally encounter less severe bars to buying handguns than do residents of Connecticut. Any adult Italian without a criminal record can walk right in and back out of his or her local gun store with a newly purchased handgun &#8211; though he must register it within 10 days.\n \n An Austrian needs a license to buy a semi-automatic pistol but being licensed for self-defense is a legal right. (Nor is a license required to buy any kind of revolver.) In France, licensing is needed to buy any handgun but home defense licenses are easily available to law abiding adults.\n \n International statistics prove Beccaria right that gun bans disarm only the law abiding, not criminals. Handgun-allowing Italy, Austria and France have far lower murder and violent crime rates than handgun-banning Russia and England. England&#8217;s violent crime rate is twice the U.S. rate.\n \n In 2002 England&#8217;s National Crime Intelligence Service evaluated that nation&#8217;s handgun ban in terms that demonstrate Beccaria&#8217;s (and the Founders&#8217;) views. Its report stated that, while &#8220;Britain has some of the strictest gun laws in the world it appears that anyone who wishes to obtain a firearm [illegally] will have little difficulty in doing so.&#8221;\n\n \n The work of Bellesiles is dead. Let him and his \"research\" be buried appropriately and never visited again.", 
   {
    "post_info": {
     "post_title": "18th-Century Americans Were Actually Well-Armed"
    }
   }, 
   null, 
   null, 
   1305662280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  18th-Century Americans Were Actually Well-Armed", 
  "url": "http://www.4forums.com/political/gun-control-debates/15346-18th-century-americans-were-actually-well-armed.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 15346, 
  "discussion_files": [
   [
    "18098.html", 
    "http://www.4forums.com/political/gun-control-debates/15346-18th-century-americans-were-actually-well-armed-print.html"
   ]
  ], 
  "identifier": 15346
 }
]