[
 [
  [
   431346, 
   null, 
   "MrWriteLA", 
   "For over a decade now, I've been curious about the number of posters you see on Forums like these who post multiple times, day after day, starting thread after thread, cranking out post after post with the same unsupported talking points, unforthcoming about their own personal situations, unresponsive to the replies of others except with fallacy and insults, oblivious to decisive refutation, masochistically immune to embarrassment, prone to rinse-and-repeat repetition, and frequently denying an agenda that is all to obvious to everyone else. \n \n Doing a google search, I came upon a few blog entries that would seem to verify my suspicions:\n \n \n\n Democratic Underground - Paid RW shills - Democratic Underground\n \n I think a large portion of the posts on FreeRepublic are written by RWers on someone's payroll, possibly all sitting together in a well-appointed \"boiler-room.\"\n \n Why? It's well known that RW hack authors like Jerome Corsi, co-author of that fine \"Swift Boat Veterans\" book, make hundreds of posts on FreeRepublic. I doubt that he sits there doing it for his health.\n \n You seldom find long posts on FR. Long posts are often heart-felt outpourings of feelings. People being paid by the hour, or being paid by the post, will just be going for the talking-point, sound-bite effect.\n \n The biggest clue? How could anyone actually believe some of the absolutely bogus ideas that get floated on FR threads like this? That a news report on completely verifiable recruiting figures, with the information coming directly from the US government, is just \"liberal propaganda.\" That soldiers are being blown to bits right and left in Iraq, and stop loss orders are preventing soldiers from ever getting out, yet people are not joining the military because of an \"improving economy\". Give me a break!!! Few people are THAT dumb.\n \n If someone is actually ignorant enough to believe things like these, then one would expect many more misspellings and much poorer grammar, organization, and compositional style.\nhttp://community.history.com/topic/35461/t/Paid---post-Writers-Needed--Post-Right-Wing-Comments-Vancouv.html\n \n Anyone brave enough to confess? Of course not, it would kill your job.\n \n I hate to say I told you so, but I told you so.\n \n Reich wingers are being paid by the post. Explains a lot doesn't it?\n \n And this is just an overt ad. This has been going on for a long time.\n \n No wonder these cretins are able to sit in front of their computers day in day out, it's the way they make their living. How pathetic.\nWriters Needed To Post Right-Wing Comments (Vancouver, Calgary, Toronto, Halifax)\n Posted March 28th, 2011 by Writing Job\n City: Calgary\n \n Writers needed to post right-wing comments to social media and news outlets.\n \n We are a social media company working for a political organization, hired to help balance the left-wing bias of the major media outlets by supplying a team of writers who will post to newspaper comments, media forums, Facebook pages, etc.\n \n Your writing must be strong, right-wing and use the supplied talking points without being bogged down in too much detail. You are creating an online persona with a consistent tone. Ideally you can find or construct facts and statistics to stir controversy. Where suited humor is welcome.\n \n You are a news junky who is able to log on to news forums and Facebook pages several times a day. You are able to write comments tailored to new topics while repeating key talking points.\n \n Compensation: TBD, hourly rate and volume of online activity. Bonuses for controversial postings that heat up a topic or forums thread.\n \n How to apply: We are more interested in your writing than your resume. To apply submit a 100 word post based on the headline\n \n Show us that you can write from a right wing character voice, score points, stir outrage and use humour.\n \n Be sure to include your name, email and cell number so we can contact you.\n \n Sorry, only candidates who submit the best submissions will be contacted for an interview.\n\nFinally, this thread had a number of pertinent comments. I've included a couple, but the whole thing is worth reading:\nhttp://hubpages.com/forum/topic/71723\n \n Should Paid Forum Posting Be Outlawed?\n \n \"Well would you make such an XXX of yourself for nothing?\"\n \n * * *\n \n \"If I were a Conservative (and I am on many things) I would be very concerned that postings like yours only make the right look bad.\n \n As many times as you have been asked if you're a paid poster, you never gave a straight \"No\" answer.\"\n \n * * *\n \n \"Your motives and number of posts, demonstrates more aggressiveness than the average person, therefore you could very well be paid for your post. Your motives, to me, are obvious- you are about control of people, distortion and misinformation, scarred with a hatefulness that spews out in your words.\"\nAnyway, something to consider the next time you feel you're running your head at a brick wall during some of the \"debates\" we have here.", 
   {
    "post_info": {
     "post_title": "Paid by the post?"
    }
   }, 
   null, 
   null, 
   1307027580.0
  ], 
  [
   431350, 
   null, 
   "jyoshu", 
   "I've always believed left-wingers were getting paid to post.\n But being that they're left-wing, they must get a flat rate and everyone has to be getting the same amount even if some did a better job than others! emoticon_xangel", 
   {}, 
   431346, 
   null, 
   1307032920.0
  ], 
  [
   431351, 
   null, 
   "Accipiter", 
   "Maybe it's that most right wingers can't figure out how to work a computer.\n \n http://www.4forums.com/political/politics-debates/15302-ann-coulters-conservative-email-news-letter.html", 
   {}, 
   431350, 
   null, 
   1307034420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Paid by the post?", 
  "url": "http://www.4forums.com/political/gay-rights-debates/15389-paid-post.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 15389, 
  "discussion_files": [
   [
    "72.html", 
    "http://www.4forums.com/political/gay-rights-debates/15389-paid-post-print.html"
   ]
  ], 
  "identifier": 15389
 }
]