[
 [
  [
   431537, 
   null, 
   "jyoshu", 
   "Illinois Catholic Charities forced out of adoptions over gay rights\n \n But of course, gay pride proponents insist they won't force a religion to do anything against their beliefs.\n Yeah.", 
   {
    "post_info": {
     "post_title": "Illinois Catholic Charities forced out of adoptions over gay \u0091rights\u0092"
    }
   }, 
   null, 
   null, 
   1307325840.0
  ], 
  [
   431552, 
   null, 
   "Provocateaur", 
   "Lol. It's not \"gay pride proponents\", whatever that means(a rainbow flag in the window?), who are doing anything to them. Those are the rules. Gays(and many others who happen to be non-Catholic) can't discriminate against Catholic individuals or families either.", 
   {}, 
   431537, 
   null, 
   1307334060.0
  ], 
  [
   431554, 
   null, 
   "Accipiter", 
   "But of course, gay pride proponents insist they won't force a religion to do anything against their beliefs.\n Yeah.\n\n \n It must be hard to watch something you love being torn apart by a godless government and gay people.", 
   {}, 
   431537, 
   null, 
   1307338860.0
  ], 
  [
   431564, 
   null, 
   "jitobear", 
   "Its a pity the compromise they suggested could not be agreed to as it does seem to have been a reasonable one. There is also much to be said for not allowing discrimination within public services.\n \n But in the end they are not being forced out of anything, they are choosing to shut their doors. Seems hating gays is of higher priority than helping children. Somehow I just don't see that as having been Christ's stance. Anyway, the Bible says that people (men in particular) should not engage in homosexual sex. It does not say that anyone cannot love a child.", 
   {}, 
   431554, 
   null, 
   1307371860.0
  ], 
  [
   431567, 
   null, 
   "Matthew S", 
   "Illinois Catholic Charities forced out of adoptions over gay rights\n \n But of course, gay pride proponents insist they won't force a religion to do anything against their beliefs.\n Yeah.\n\n \n No one is forcing them to stop doing anything. They just want to continue to hate and discriminate against gay people.", 
   {}, 
   431537, 
   null, 
   1307373240.0
  ], 
  [
   431590, 
   null, 
   "jyoshu", 
   "But in the end they are not being forced out of anything, they are choosing to shut their doors.\n\n \n \nNo one is forcing them to stop doing anything. They just want to continue to hate and discriminate against gay people.\n\n \n Sure they are. If you put constraints on a church to ONLY do its charity in a way that goes against their religious belief, you certainly are forcing them. \n \n And this goes to show how the gay pride movement flat out lies about things like this, since I have heard many say churches wouldn't be forced to do things against their beliefs.", 
   {}, 
   431567, 
   null, 
   1307388000.0
  ], 
  [
   431594, 
   null, 
   "Jo Bennett", 
   "Sure they are. If you put constraints on a church to ONLY do its charity in a way that goes against their religious belief, you certainly are forcing them. \n \n\n \n Tell me, do Catholic adoption agencies bar people from adopting who use artificial contraception? How about people who are divorced and remarried? Smells like hypocrisy and homophobia to me.\n \n On the other hand, the proposed compromise seems eminently sensible, so long as it's viable.", 
   {}, 
   431590, 
   null, 
   1307388420.0
  ], 
  [
   431606, 
   null, 
   "gansao", 
   "Tell me, do Catholic adoption agencies bar people from adopting who use artificial contraception? How about people who are divorced and remarried? Smells like hypocrisy and homophobia to me.\n \n On the other hand, the proposed compromise seems eminently sensible, so long as it's viable.\n\n \n I doubt that catholic adoption agencies allow protestants to use their services\n If that is the case I dont see protestants whining about it", 
   {}, 
   431594, 
   null, 
   1307392920.0
  ], 
  [
   431619, 
   null, 
   "jitobear", 
   "Sure they are. If you put constraints on a church to ONLY do its charity in a way that goes against their religious belief, you certainly are forcing them. \n \n And this goes to show how the gay pride movement flat out lies about things like this, since I have heard many say churches wouldn't be forced to do things against their beliefs.\n\n \n But this is not about what theyare doing behind church doors or during religious worship. They are operating a chraity in the public sphere and there are rules about discrimination out here. Plus there is no Biblical argument for this anyway. Bible says no gay sex. It doesn't say anywhere that gay people can not have a job, be safe or love a child. The facility they run is supposed to be about children. Instead it seems dogma gets to be the priority.", 
   {}, 
   431590, 
   null, 
   1307397480.0
  ], 
  [
   431621, 
   null, 
   "Matthew S", 
   "Sure they are. If you put constraints on a church to ONLY do its charity in a way that goes against their religious belief, you certainly are forcing them. \n \n And this goes to show how the gay pride movement flat out lies about things like this, since I have heard many say churches wouldn't be forced to do things against their beliefs.\n\n \n Who cares anyway in a secular society they can shove their religion and religious beliefs up their asses.", 
   {}, 
   431590, 
   null, 
   1307397540.0
  ], 
  [
   431625, 
   null, 
   "jyoshu", 
   "Who cares anyway in a secular society they can shove their religion and religious beliefs up their asses.\n\n \n Well, a lot of orphans that won't be placed because the agency can't operate may certainly care.", 
   {}, 
   431621, 
   null, 
   1307398260.0
  ], 
  [
   431653, 
   null, 
   "thelmoose", 
   "I can't tell what happened to the compromise. The Catholics could refer any \"objectionable\" couples to other agencies. Who decided this was not good enough?\n \n If the law allowed for that and the church still refused, they seem to care more about sticking to their arbitrary principles than for the clients and babies they purport to serve.", 
   {}, 
   431625, 
   null, 
   1307414640.0
  ], 
  [
   431660, 
   null, 
   "Matthew S", 
   "Well, a lot of orphans that won't be placed because the agency can't operate may certainly care.\n\n \n Then who are the bigger monsters? They are the ones letting a fairy tale book influence the well being of children.", 
   {}, 
   431625, 
   null, 
   1307417460.0
  ], 
  [
   431662, 
   null, 
   "jyoshu", 
   "I can't tell what happened to the compromise. The Catholics could refer any \"objectionable\" couples to other agencies. Who decided this was not good enough?\n \n If the law allowed for that and the church still refused, they seem to care more about sticking to their arbitrary principles than for the clients and babies they purport to serve.\n\n \n True, gay pride and legislators certainly failed to compromise by not letting churches conduct such work according to their religious beliefs.\n If they referred gay couples to other agencies, they would still be indirectly accommodating a lifestyle they can't support. Sending them to someone who will accommodate sin (from the church's POV) is little better than doing it themselves.", 
   {}, 
   431660, 
   null, 
   1307418300.0
  ], 
  [
   432933, 
   null, 
   "jyoshu", 
   "Now there is serious concern the same sort of lack of religious protections may happen in New York. \n \n NY gay-marriage talks hinge on religious rights - Yahoo! News", 
   {}, 
   431537, 
   null, 
   1308789720.0
  ], 
  [
   432936, 
   null, 
   "poet", 
   "Now there is serious concern the same sort of lack of religious protections may happen in New York. \n \n NY gay-marriage talks hinge on religious rights - Yahoo! News\n\n \n The horror! Cry me a friggin river, I don't care.", 
   {}, 
   432933, 
   null, 
   1308790920.0
  ], 
  [
   432939, 
   null, 
   "gansao", 
   "The horror! Cry me a friggin river, I don't care.\n\n \n Good because you dont matter.\n Gays are always complaining about the poor little gay children who kill themselves because of straights but seem to not care a jot about children who benefit from religious adoption agencies.\n Why? Because they hate religious people more than they love children..at least you do.", 
   {}, 
   432936, 
   null, 
   1308792660.0
  ], 
  [
   433010, 
   null, 
   "Provocateaur", 
   "From the text of the bill, H.R. 1681:\n \n (1) PROHIBITION- An entity that receives Federal assistance or contracts with an entity that receives Federal assistance, and is involved in adoption or foster care placements may not--\n \n (A) deny to any person the opportunity to become an adoptive or a foster parent on the basis of the sexual orientation, gender identity, or marital status of the person, or the sexual orientation or gender identity of the child involved;\n \n (B) delay or deny the placement of a child for adoption or into foster care on the basis of the sexual orientation, gender identity, or marital status of any prospective adoptive or foster parent, or the sexual orientation or gender identity of the child; or\n \n (C) require different or additional screenings, processes, or procedures for adoptive or foster placement decisions on the basis of the sexual orientation, gender identity, or marital status of the prospective adoptive or foster parent, or the sexual orientation or gender identity of the child involved. [emphasis added]\n\n \n So they are talking about taxpayer-funded adoption agencies, which happen to be Catholic in this case. They can't take gay people's tax money, and then use it to discriminate in public services against the group which helped fund them. \n \n Gansao: Gays or anyone else, when approaching these agencies, or any other adoption place, obviously WANT to be able to care for children. The hatred is coming from the other side who discriminate against their desire to do that.", 
   {}, 
   432939, 
   null, 
   1308895380.0
  ], 
  [
   433013, 
   null, 
   "Provocateaur", 
   "Good because you dont matter.\n \n\n \n Why do you say that? Because he's gay and doesn't accept the discrimination placed against him? Believe me, those gay and straight who fight discrimination, matter!", 
   {}, 
   432939, 
   null, 
   1308898680.0
  ], 
  [
   433031, 
   null, 
   "Shooterandproud", 
   "Illinois Catholic Charities forced out of adoptions over gay rights\n \n But of course, gay pride proponents insist they won't force a religion to do anything against their beliefs.\n Yeah.\n\n \n I don't see how they were \"forced out\". They chose to close because they could no longer continue their discriminatory policies.\n \n \nGood because you dont matter.\n Gays are always complaining about the poor little gay children who kill themselves because of straights but seem to not care a jot about children who benefit from religious adoption agencies.\n Why? Because they hate religious people more than they love children..at least you do.\n\n \n Other way around, buddy. No one is closing down the religious agencies, they're choosing to close down. They are the ones who have failed the orphaned children, not the gays seeking protection (sts). The Catholic church is simply throwing a fit because they don't want to follow the rules. They've failed to ask themselves what I was taught in 6 years of catholic school: \"What would Jesus do?\" As I recall, Jesus spent a great deal more time helping those in need than lobbying the government for less protection for homosexuals.", 
   {}, 
   431537, 
   null, 
   1308935880.0
  ], 
  [
   433062, 
   null, 
   "gansao", 
   "Why do you say that? Because he's gay and doesn't accept the discrimination placed against him? Believe me, those gay and straight who fight discrimination, matter!\n\n \n There you go...straight in to ' you must be a homophobe' mode..pathetic.\n I couldnt care less if Catholics would not let anyone but Catholics adopt babies through their agencies.\n That would discriminate against me just as it does for gays.\n But I do not link my whole identity to being discriminated against and I do not hate Catholics enough to deny children families.\n Did you not read his post ...HE SAID HE DIDNT CARE", 
   {}, 
   433013, 
   null, 
   1308960060.0
  ], 
  [
   433064, 
   null, 
   "gansao", 
   "I don't see how they were \"forced out\". They chose to close because they could no longer continue their discriminatory policies.\n \n \n \n Other way around, buddy. No one is closing down the religious agencies, they're choosing to close down. They are the ones who have failed the orphaned children, not the gays seeking protection (sts). The Catholic church is simply throwing a fit because they don't want to follow the rules. They've failed to ask themselves what I was taught in 6 years of catholic school: \"What would Jesus do?\" As I recall, Jesus spent a great deal more time helping those in need than lobbying the government for less protection for homosexuals.\n\n \n I am not your buddy", 
   {}, 
   433031, 
   null, 
   1308960180.0
  ], 
  [
   433066, 
   null, 
   "jitobear", 
   "I do not hate religion enough to deny children families.\n\n \n Apparently the Catholic church hates homosexuals enough to do so, however, as it is they who are choosing to no longer provide the service.", 
   {}, 
   433062, 
   null, 
   1308961020.0
  ], 
  [
   433067, 
   null, 
   "gansao", 
   "Apparently the Catholic church hates homosexuals enough to do so, however, as it is they who are choosing to no longer provide the service.\n\n \n They cannot support gay adoption without the collapse of the Catholic church in the US.\n I am not saying they are right, I am saying that at least one poster on this forum hates Catholics so much that they cannot even contemplate the adoption agencies discriminating against gays in any situation even if it means children suffer.\n His hatred of the Catholics surpasses his concern with the children..as your does it seems.\n I am saying that I would not give a fig if I was excluded from discriminated against in this case.\n Lets face it you and others are using the kids as weapons and levers arent you?\n \n I am reacting to a homosexual on this forum who said\n Posted by poet \n The horror! Cry me a friggin river, I don't care.\n \n I presume he stated that he did not care about the whole issue, which included the fact that he did not care about the closure of Catholic adoption agencies.\n Jito does not seem to care either and Provocateaur thinks I said he does not matter because he is gay and fighting discrimination...which is not what I stated but seems to be kneejerk reaction( say gay is wrong or irrelevant = hates gay).", 
   {}, 
   433066, 
   null, 
   1308961800.0
  ], 
  [
   433081, 
   null, 
   "gansao", 
   "White couples 'will be able to adopt black children more easily' - Telegraph\n Note that white families were clearly being discriminated against but as far as I know they did not want to close the agencies down.\n I got resolved.\n Equally why cant the Catholic agencies have their amendment and be gradually sidelined?\n Too easy?", 
   {}, 
   433067, 
   null, 
   1308968640.0
  ], 
  [
   433088, 
   null, 
   "Shooterandproud", 
   "I am not your buddy\n\n \n That's the only part you disagree with? Cool.", 
   {}, 
   433064, 
   null, 
   1308973680.0
  ], 
  [
   433090, 
   null, 
   "gansao", 
   "That's the only part you disagree with? Cool.\n\n \n I am glad that my agreement is so important to you but Im afraid I stopped reading after' buddy'.", 
   {}, 
   433088, 
   null, 
   1308973920.0
  ], 
  [
   433098, 
   null, 
   "Provocateaur", 
   "There you go...straight in to ' you must be a homophobe' mode..pathetic.\n\n \n Well, you said that poet doesn't matter. This is about discrimination against gays specifically, and poet is gay.\n \n \nI couldnt care less if Catholics would not let anyone but Catholics adopt babies through their agencies.\n\n \n They can't discriminate against non-Catholics either. That's the law, put forward by the majority of lawmakers who are gay, straight, Catholic, non-Catholic, etc.\n \n \nThat would discriminate against me just as it does for gays.\n\n \n That's not on the table. It's actually MANY groups who see the value in non-discrimination. Other groups are not coming forward, and saying to please take away their rights to not be discriminated against, so why should gay people and straight supporters of gay non-discrimination? \n \n \nBut I do not link my whole identity to being discriminated against and I do not hate Catholics enough to deny children families.\n\n \n The reality unfortunately, is that minorities are more likely to face discrimination from the majority. Minorities actually need the protection of the laws more, not less. Why should one particular group, in this case, Catholics, be given the right to discriminate, when no one else is allowed to? Gays aren't asking for the right to discriminate against Catholics! Because I don't want to give Catholics this clearly, special right, I must hate them? Now who is \"whining\" as you claimed earlier? Ah, it's that false right-wing conservative persecution complex again.", 
   {}, 
   433062, 
   null, 
   1308982620.0
  ], 
  [
   433114, 
   null, 
   "gansao", 
   "Well, you said that poet doesn't matter. This is about discrimination against gays specifically, and poet is gay..\n\n And you assumed I said he didnt matter BECAUSE he was gay ,which is just a kneejerk accusation of homophobia.\n The fact is there are more people than gay ones involved here.\n Poet has indirectly declared that he could not care less about the plight of the children.I think that qualifies him to be irrelevant dont you?\n \n \n \n \nThey can't discriminate against non-Catholics either. That's the law, put forward by the majority of lawmakers who are gay, straight, Catholic, non-Catholic, etc..\n\n \n As a non catholic I would not be particularly bothered to be discriminated against if it ment that children would be given homes hence I would let them have the amendment.\n \n \nThat's not on the table. It's actually MANY groups who see the value in non-discrimination. Other groups are not coming forward, and saying to please take away their rights to not be discriminated against, so why should gay people and straight supporters of gay non-discrimination?.\n \n \n White couples 'will be able to adopt black children more easily' - Telegraph\n As far as I know white pressure groups did not lobby against this blatant discrimination.\n A solution was found through common sense.\n But maybe they cared more about the children than the opportunity to scream victim.\n As I said why not let the catholics have the amendment then gradually sideline them?\n \n \nThe reality unfortunately, is that minorities are more likely to face discrimination from the majority. Minorities actually need the protection of the laws more, not less. Why should one particular group, in this case, Catholics, be given the right to discriminate, when no one else is allowed to? Gays aren't asking for the right to discriminate against Catholics! Because I don't want to give Catholics this clearly, special right, I must hate them? Now who is \"whining\" as you claimed earlier? Ah, it's that false right-wing conservative persecution complex again.\n\n \n If other vulnerable people were not involved here then I would agree but it seems that I this case gays are quite happy for another vulnerable minority to be a casualty of war between them and catholics.\n It seems you agree with Poet that you should not care about other minorities but demand they care about you.\n Catholics are abandoning the children while you are turning your back on them when a solution could be found .You are both as bad as each other.", 
   {}, 
   433098, 
   null, 
   1309005720.0
  ], 
  [
   433141, 
   null, 
   "Freedom", 
   "So they are talking about taxpayer-funded adoption agencies, which happen to be Catholic in this case. They can't take gay people's tax money, and then use it to discriminate in public services against the group which helped fund them. \n \n\n Ah yes, the terrible mess that results in a causeless mess of everyone owing everyone everything.\n \n Taxes are inherently immoral way to fund anything, it shouldn't surprise you that they cause moral dilemmas to the organizations they fund. The problem you have exposed with this post is that homo-sexual tax payers aren't being given a choice to pay for the adoption agency, not that all public programs need to somehow conform to the contradictory fickle whims of the mob. \n \n \nWhite couples 'will be able to adopt black children more easily' - Telegraph\n\n I didn't even know that was going in, it's infuriating that they even consider race in the 'match' much less slow down the process for it.", 
   {}, 
   433114, 
   null, 
   1309024440.0
  ], 
  [
   433144, 
   null, 
   "gansao", 
   " \n \n \n I didn't even know that was going in, it's infuriating that they even consider race in the 'match' much less slow down the process for it.\n\n \n There are a lot of people in the UK making a lot of money by creating race issue that do not exist IMO.", 
   {}, 
   433141, 
   null, 
   1309025280.0
  ], 
  [
   433148, 
   null, 
   "jyoshu", 
   "Gays aren't asking for the right to discriminate against Catholics! Because I don't want to give Catholics this clearly, special right, I must hate them?\n\n \n Letting people operate a charity in a way in keeping with their religious beliefs isn't giving them 'special rights'. You might as well be demanding them to let Muslims have equal-time services in a church too. If you want to make sure they don't get \"tax-payer\" help, that's your view, but you need to know you're helping ensure a lot of children don't get homes that otherwise would.", 
   {}, 
   433098, 
   null, 
   1309027260.0
  ], 
  [
   433150, 
   null, 
   "Shooterandproud", 
   "I am glad that my agreement is so important to you but Im afraid I stopped reading after' buddy'.\n\n \n That has got to be the lamest excuse I've ever heard. If that one word offends you so much that you can't bear to read another word then there's really not much I can say.", 
   {}, 
   433090, 
   null, 
   1309028040.0
  ], 
  [
   433153, 
   null, 
   "daewoo", 
   "For those who have not bothered to actually look at any information on this, or even read the article,\n \n This was NOT a charitable program being run by catholic charities. They were CONTRACTED on a FOR PROFIT basis with the state to carry out these services. \n \n Catholic charities does this in a lot of states with a lot of social services. They bid competitively against other companies. This is NOT charitable work.\n \n So, what actually happened here is that a government contractor did not wish to renew their contract because they disliked some aspects of the performance requirements.\n \n This belongs in the economics section.", 
   {}, 
   433114, 
   null, 
   1309029060.0
  ], 
  [
   433154, 
   null, 
   "gansao", 
   "That has got to be the lamest excuse I've ever heard. If that one word offends you so much that you can't bear to read another word then there's really not much I can say.\n\n \n Then dont.", 
   {}, 
   433150, 
   null, 
   1309030020.0
  ], 
  [
   433155, 
   null, 
   "gansao", 
   "For those who have not bothered to actually look at any information on this, or even read the article,\n \n This was NOT a charitable program being run by catholic charities. They were CONTRACTED on a FOR PROFIT basis with the state to carry out these services. \n \n Catholic charities does this in a lot of states with a lot of social services. They bid competitively against other companies. This is NOT charitable work.\n \n So, what actually happened here is that a government contractor did not wish to renew their contract because they disliked some aspects of the performance requirements.\n \n This belongs in the economics section.\n\n \n So you are saying that not renewing the contract with the Catholic adoption agency will not affect the amount of children place with families one bit?\n Also if the Catholics bid for this business with other agencies why were the Catholics getting it.Seeing that they have a more restrictive base of people that they will allow to adopt?\n Why werent there more moderate agencies getting the business?", 
   {}, 
   433153, 
   null, 
   1309030380.0
  ], 
  [
   433158, 
   null, 
   "daewoo", 
   "So you are saying that not renewing the contract with the Catholic adoption agency will not affect the amount of children place with families one bit?\n\n \n No. It wont. In most states catholic charities has nothing at all to do with adoptions, and kids still get adopted out just fine. \n \n My state (kansas) was the first to privatize foster care and adoption services. Their first contractor was TFI family services (AKA The Farm). Today they divide the state up into territories and use several different private contractors to carry out not only those services, but juvenile rehabilitation (group homes). \n \n \n\n Also if the Catholics bid for this business with other agencies why were the Catholics getting it.Seeing that they have a more restrictive base of people that they will allow to adopt?\n Why werent there more moderate agencies getting the business?\n\n \n The term you are looking for is \"low bidder\"\n \n And...they are NOT getting it. Now that adoption by homosexuals is legal in that state, the companies that the state contracts with to carry out adoption services have to function within the guidelines of their contract and within the laws of that state. They dont get to make up their own guidelines. \n \n Frankly this whole thing is foolish. A private company performing contract work decided they did not like the terms of their contract, so they did not renew it. \n \n SO WHAT?!?!?", 
   {}, 
   433155, 
   null, 
   1309034160.0
  ], 
  [
   433160, 
   null, 
   "gansao", 
   "No. It wont. In most states catholic charities has nothing at all to do with adoptions, and kids still get adopted out just fine. \n \n My state (kansas) was the first to privatize foster care and adoption services. Their first contractor was TFI family services (AKA The Farm). Today they divide the state up into territories and use several different private contractors to carry out not only those services, but juvenile rehabilitation (group homes). \n \n \n \n The term you are looking for is \"low bidder\"\n \n And...they are NOT getting it. Now that adoption by homosexuals is legal in that state, the companies that the state contracts with to carry out adoption services have to function within the guidelines of their contract and within the laws of that state. They dont get to make up their own guidelines. \n \n Frankly this whole thing is foolish. A private company performing contract work decided they did not like the terms of their contract, so they did not renew it. \n \n SO WHAT?!?!?\n\n \n If that is the case then I certainly agree.\n So it was the State that made the guidlines that blocked gays from adopting children and the lowest bidder who happened to be Catholic adoption agency that followed it.\n The religious issue seems to have evaporated....", 
   {}, 
   433158, 
   null, 
   1309034700.0
  ], 
  [
   433164, 
   null, 
   "jyoshu", 
   "If that is the case then I certainly agree.\n\n \n Daewoo doesn't know what he's talking about; there are many, many kids who don't get adopted out. Some people have this idea that adoptions just involve babies, and even then many minorities and special needs babies don't get adopted.", 
   {}, 
   433160, 
   null, 
   1309042800.0
  ], 
  [
   433167, 
   null, 
   "thelmoose", 
   "True, gay pride and legislators certainly failed to compromise by not letting churches conduct such work according to their religious beliefs.\n If they referred gay couples to other agencies, they would still be indirectly accommodating a lifestyle they can't support. Sending them to someone who will accommodate sin (from the church's POV) is little better than doing it themselves.\n\n \n Keeping a referral list is an undue burden?\n \n \n Perhaps this non-profit could forego its burden of non-profit status, and rid themselves of the tax benefits? They don't seem to mind that government interference.", 
   {}, 
   431662, 
   null, 
   1309046160.0
  ], 
  [
   433168, 
   null, 
   "Penfold", 
   "Yet another gay hating thread from the usual suspect. Could he be a self-hater, like so many homophobes?", 
   {}, 
   433167, 
   null, 
   1309048500.0
  ], 
  [
   433169, 
   null, 
   "gansao", 
   "Yet another gay hating thread from the usual suspect. Could he be a self-hater, like so many homophobes?\n\n \n Please supply evidence of this assertion or withdraw it.\n I hope your carer knows that you are up this late Penfold...", 
   {}, 
   433168, 
   null, 
   1309049040.0
  ], 
  [
   433171, 
   null, 
   "Provocateaur", 
   "And you assumed I said he didnt matter BECAUSE he was gay ,which is just a kneejerk accusation of homophobia.\n\n \n Gay, and was against anti-gay discrimination.\n \n \nThe fact is there are more people than gay ones involved here.\n\n \n There always are.\n \n \nPoet has indirectly declared that he could not care less about the plight of the children.I think that qualifies him to be irrelevant dont you?\n\n \n Cheap debate tactic. Accuse the other side of not caring about children, mothers or apple pie, without one logical reason offered.\n \n \nAs a non catholic I would not be particularly bothered to be discriminated against if it ment that children would be given homes hence I would let them have the amendment.\n\n \n The children are not getting homes, because they are turning away otherwise qualified candidates. \n \n \nWhite couples 'will be able to adopt black children more easily' - Telegraph\n As far as I know white pressure groups did not lobby against this blatant discrimination.\n A solution was found through common sense.\n\n \n As far as you know? Why is this relevant? Here's a news flash. This legislation in Illinois didn't pass without the majority of legislators who are straight, supporting it. How do you know it was just gays lobbying for this?\n \n \nBut maybe they cared more about the children than the opportunity to scream victim.\n\n \n Yeah, maybe this, and perhaps that. Bull. You have this preconceived notion in your head, that gays are just weak, whining victims, if the law doesn't say that they specifically, not any other group there in Illinois, may be discriminated against. Nonsense! \n \n \nAs I said why not let the catholics have the amendment then gradually sideline them?\n \n If other vulnerable people were not involved here then I would agree but it seems that I this case gays are quite happy for another vulnerable minority to be a casualty of war between them and catholics.\n It seems you agree with Poet that you should not care about other minorities but demand they care about you.\n Catholics are abandoning the children while you are turning your back on them when a solution could be found .You are both as bad as each other.\n\n \n No, not at all. Gays want to be able to care for children, Catholics won't allow them the opportunity. This is sad for the lives of loving gay adults and for children. Discrimination ruins lives, everywhere it is appled. It sets a dangerous precedent. It's not just about stopping gays from adopting children. Were one able to discriminate based on the principle of religious belief, but only against selected mostly disfavoured groups, what's to stop a Catholic landlord from throwing gays out of their apartments, not letting them stay at a hotel, eat at a restaurant. There are a great many public services in which gays could see themselves being discriminated. What you're asking is for gays to lobby(against many straight legislators who don't believe in discrimination), for 3 lashes for the gays a day, trusting it will never become more.", 
   {}, 
   433114, 
   null, 
   1309049760.0
  ], 
  [
   433172, 
   null, 
   "gansao", 
   "Gay, and was against anti-gay discrimination.\n \n \n \n There always are.\n \n \n \n Cheap debate tactic. Accuse the other side of not caring about children, mothers or apple pie, without one logical reason offered.\n \n \n \n The children are not getting homes, because they are turning away otherwise qualified candidates. \n \n \n \n As far as you know? Why is this relevant? Here's a news flash. This legislation in Illinois didn't pass without the majority of legislators who are straight, supporting it. How do you know it was just gays lobbying for this?\n \n \n \n Yeah, maybe this, and perhaps that. Bull. You have this preconceived notion in your head, that gays are just weak, whining victims, if the law doesn't say that they specifically, not any other group there in Illinois, may be discriminated against. Nonsense! \n \n \n \n No, not at all. Gays want to be able to care for children, Catholics won't allow them the opportunity. This is sad for the lives of loving gay adults and for children. Discrimination ruins lives, everywhere it is appled. It sets a dangerous precedent. It's not just about stopping gays from adopting children. Were one able to discriminate based on the principle of religious belief, but only against selected mostly disfavoured groups, what's to stop a Catholic landlord from throwing gays out of their apartments, not letting them stay at a hotel, eat at a restaurant. There are a great many public services in which gays could see themselves being discriminated. What you're asking is for gays to lobby(against many straight legislators who don't believe in discrimination), for 3 lashes for the gays a day, trusting it will never become more.\n\n \n I cant really respond to this post if the Catholic adoption agency was just a private agency that happened to be the lowest bidder and were operating within the guidelines of the contractor.\n The premise of my argument would be untenable.\n However if the agency was a charitable one which was unable to find childrens home because of' gay rights' intransigence then my argument stands IMO.", 
   {}, 
   433171, 
   null, 
   1309050780.0
  ], 
  [
   433173, 
   null, 
   "jyoshu", 
   "Yet another gay hating thread from the usual suspect. Could he be a self-hater, like so many homophobes?\n\n \n Nope, just a happy pride-movement hater since it tries to control everyone's morality through govt. mandate, and I make no bones about it. emoticon_xagree And I certainly don't hate gays, or whatever the usual false accusation is for people who disagree with your political movement.", 
   {}, 
   433168, 
   null, 
   1309051620.0
  ], 
  [
   433178, 
   null, 
   "daewoo", 
   "Daewoo doesn't know what he's talking about; there are many, many kids who don't get adopted out. Some people have this idea that adoptions just involve babies, and even then many minorities and special needs babies don't get adopted.\n\n \n I know what I am talking about. It is YOU who leapt right past logical to foolish indignation. From YOUR original article (that you apparently either did not read or were not able to comprehend):\n \n \nCurrently, the Diocese handles approximately 350 foster family and adoption cases in 11 counties in northern Illinois with a state budget of $7.5 million and 58 workers who will now no longer have jobs.\n\n \n \nThe Diocese announced that the agency is being forced to opt out of contracting with the State of Illinois for these services\n\n \n And they were getting $7.5 MILLION a year to handle 350 adoption and foster family cases a year in 11 counties. That was an EXTREMELY lucrative contract. They will have NO PROBLEM finding another organization to do it. I may LITERALLY see if I can scab together a company fast enough to bid that!! That is over $21,000 per case to administer adoption and foster services. By comparison, The Farm in KS gets about $4,000 per case. That is a SWEET deal that the catholics are walking away from. \n \n Their \"compromise\" made no sense whatsoever. Illinois districts their state, just like Ks. Catholic Charities district consisted of 11 counties. Their \"compromise\" basically boiled down to referring applicants they did not like to other companies in other districts...essentially creating a system where in those 11 counties gays could not adopt. Stupidity at its finest. \n \n Personally, I would argue that catholic charities should never have been allowed to bid the contract in the first place. When you let a non profit charity bid a for profit contract they have a SIGNIFICANT advantage over a normal company that actually has to pay taxes. I dont find the argument that the money will go out elsewhere so they are non profit to be persuasive.", 
   {}, 
   433164, 
   null, 
   1309054320.0
  ], 
  [
   433179, 
   null, 
   "Provocateaur", 
   "Nope, just a happy pride-movement hater since it tries to control everyone's morality through govt. mandate, and I make no bones about it. emoticon_xagree And I certainly don't hate gays, or whatever the usual false accusation is for people who disagree with your political movement.\n\n \n Those who are against equality are doing that, imposing their religion on civil rights, spending millions of dollars to do so. Maggie Gallagher doesn't go to the events, because they are serving free ice cream.", 
   {}, 
   433173, 
   null, 
   1309054620.0
  ], 
  [
   433185, 
   null, 
   "jyoshu", 
   "Those who are against equality are doing that, imposing their religion on civil rights, spending millions of dollars to do so. Maggie Gallagher doesn't go to the events, because they are serving free ice cream.\n\n \n I had to look up who that woman was; I wasn't familiar with her. Anyway, gay pride is imposing it's ideology on religion by not building in protections since what they are doing affects churches.", 
   {}, 
   433179, 
   null, 
   1309057980.0
  ], 
  [
   433189, 
   null, 
   "daewoo", 
   "I had to look up who that woman was; I wasn't familiar with her. Anyway, gay pride is imposing it's ideology on religion by not building in protections since what they are doing affects churches.\n\n \n Kind of like churches are exempt against laws protecting black people from discrimination. Oooh....er....uh.....\n \n I am not going to lie....watching you try to turn the churches into victims is hilarious.", 
   {}, 
   433185, 
   null, 
   1309058820.0
  ], 
  [
   433202, 
   null, 
   "Shooterandproud", 
   "Then dont.\n\n \n Whatever dude. Having an intelligent discussion with you is like teaching quantum physics to a goldfish.", 
   {}, 
   433154, 
   null, 
   1309075500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Illinois Catholic Charities forced out of adoptions over gay \u0091rights\u0092", 
  "url": "http://www.4forums.com/political/gay-rights-debates/15397-illinois-catholic-charities-forced-out-adoptions-over-gay-rights.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 15397, 
  "discussion_files": [
   [
    "6.html", 
    "http://www.4forums.com/political/gay-rights-debates/15397-illinois-catholic-charities-forced-out-adoptions-over-gay-rights-print.html"
   ], 
   [
    "7.html", 
    "http://www.4forums.com/political/gay-rights-debates/15397-illinois-catholic-charities-forced-out-adoptions-over-gay-rights-4-print.html"
   ], 
   [
    "8.html", 
    "http://www.4forums.com/political/gay-rights-debates/15397-illinois-catholic-charities-forced-out-adoptions-over-gay-rights-3-print.html"
   ], 
   [
    "9.html", 
    "http://www.4forums.com/political/gay-rights-debates/15397-illinois-catholic-charities-forced-out-adoptions-over-gay-rights-2-print.html"
   ]
  ], 
  "identifier": 15397
 }
]