[
 [
  [
   432359, 
   null, 
   "Winston Smith", 
   "The other day I came across this quote in a Spanish speaking forum (it was in Spanish of course)\n \n It seems to be the most popular definition of Christianity in the whole Web.\n \n Does anyone know who wrote it ?\n \n \nThe belief that a cosmic Jewish zombie who was his own father can make you live forever if you symbolically eat his flesh and telepathically tell him you accept him as your master, so he can remove an evil force from your soul that is present in humanity because a rib-woman was convinced by a talking snake to eat from a magical tree... \n\n \n I don't know if this the original:\n \n Christianity - Uncyclopedia, the content-free encyclopedia", 
   {
    "post_info": {
     "post_title": "Quote"
    }
   }, 
   null, 
   null, 
   1308191700.0
  ], 
  [
   432363, 
   null, 
   "Xcaliber", 
   "The other day I came across this quote in a Spanish speaking forum (it was in Spanish of course)\n \n It seems to be the most popular definition of Christianity in the whole Web.\n \n Does anyone know who wrote it ?\n\n \n To the best of my knowledge it was a person named OogaBooga at a site called the Urban Dictionary... But he/she could have gotten from someone else and added it to this site. I see this quote floating around at a lot of Atheist and anti-Christian web sites.\n \n Urban Dictionary: Christianity", 
   {}, 
   432359, 
   null, 
   1308199680.0
  ], 
  [
   432371, 
   null, 
   "Stonewall", 
   "I doubt it would be possible to find the original since that quote is plastered all over the internet. It's pretty funny, though, especially since it's not really disputable.", 
   {}, 
   432363, 
   null, 
   1308213840.0
  ], 
  [
   432417, 
   null, 
   "Jo Bennett", 
   "I doubt it would be possible to find the original since that quote is plastered all over the internet. It's pretty funny, though, especially since it's not really disputable.\n\n \n Undead and resurrected are not the same thing, as any good D&D player can tell you, there's a flaw in the first seven words.", 
   {}, 
   432371, 
   null, 
   1308264360.0
  ], 
  [
   432419, 
   null, 
   "Stonewall", 
   "Undead and resurrected are not the same thing, as any good D&D player can tell you, there's a flaw in the first seven words.\n\n \n A dead person brought back to life... that sounds like the definition of a zombie to me. I guess he didn't act 'lifeless' if that's what you mean.", 
   {}, 
   432417, 
   null, 
   1308268380.0
  ], 
  [
   432421, 
   null, 
   "Winston Smith", 
   "zom·bie (zmb)\n n.\n 1. A snake god of voodoo cults in West Africa, Haiti, and the southern United States.\n 2. \n a. A supernatural power or spell that according to voodoo belief can enter into and reanimate a corpse.\n b. A corpse revived in this way.\n \n I think the above (at the beginning of this thread) definition of Christianity became famous because is a funny, concise description of some of the fundamental beliefs of Christianity.\n It points out the obvious absurdity or absurdities of what many Christians believe in using simple words (the vocabuary of children), hence its ubiquity in the Web (cloud ?)\n \n Of course it is not a complete version of Catholic catechism i.e. the body of fundamental beliefs (absurdities) accepted uncritically by millions (billions?) of believers.", 
   {}, 
   432419, 
   null, 
   1308272340.0
  ], 
  [
   432422, 
   null, 
   "Xcaliber", 
   "Undead and resurrected are not the same thing, as any good D&D player can tell you, there's a flaw in the first seven words.\n\n \n A Zombie would be someone who has died and been resurrected to live again, The Undead would be Vampires and werewolves.. considering they don't die to become what they are but they are technically dead since they don't have a heart beat so they are undead as opposed to being a Resurrected Zombie. \n \n Question.. According to the Bible how many Jewish Zombies were mentioned ?", 
   {}, 
   432417, 
   null, 
   1308272340.0
  ], 
  [
   432524, 
   null, 
   "Jo Bennett", 
   "Even if you were to accept the false premise that reanimation and resurrection are equivalent, that would make Jesus a liche, not a zombie. Really, if you're going to try and make snide jokes, you need to get your legends right. And, since you seem to be incapable of researching it yourself:\n Undead - Wikipedia, the free encyclopedia", 
   {}, 
   432422, 
   null, 
   1308392700.0
  ], 
  [
   432525, 
   null, 
   "Iuris", 
   "C'mon, Joe, You know JC can't be a lich without a phylactery...\n \n Now, while some fish were mentioned at the times nearby, there's also no real indication he was a zombie. For starters, he was after our souls, not our brains...\n \n :)", 
   {}, 
   432524, 
   null, 
   1308400740.0
  ], 
  [
   432529, 
   null, 
   "Xcaliber", 
   "I suppose technically Jebus was neither Undead, Vampire, Or Zombie considering his body was never found he would technically be a Ghost. He could have been a Necromancer since he raised a Zombie named Lazarus. But when comparing jebus with zombies, vampires, ghosts, resurrected, or the undead in general two words do come to mind that would encompass all and those are...fictional and mythological.", 
   {}, 
   432525, 
   null, 
   1308415500.0
  ], 
  [
   432537, 
   null, 
   "Easyrider", 
   "I suppose technically Jebus was neither Undead, Vampire, Or Zombie considering his body was never found... \n\n \n Hey dork, Jesus is Risen.", 
   {}, 
   432529, 
   null, 
   1308423060.0
  ], 
  [
   432538, 
   null, 
   "Xcaliber", 
   "Hey dork, Jesus is Risen.\n\n \n lmao.. Prove it... emoticon_xagreeemoticon_xagree", 
   {}, 
   432537, 
   null, 
   1308423180.0
  ], 
  [
   432541, 
   null, 
   "MrWriteLA", 
   "Jesus was just about to make his presence known this morning, but on learning that his truest followers think it Christ-like to call people \"dorks\" while spreading the Good Word, he went back into the men's room to continue vomiting.", 
   {}, 
   432538, 
   null, 
   1308426060.0
  ], 
  [
   432543, 
   null, 
   "pappillion001", 
   "Hey dork, Jesus is Risen.\n\n \n World English Dictionary \n \n \n \n dork (d&#596;&#720;k) \n \n - n \n \n 1. a stupid or incompetent person \n \n 2. ( US ) a penis \n \n \n Did you name yours and were telling it about someone else's or were you saying what his did? Odd thing to bring up here but if it is something you want to talk about I sure someone will be happy to give you a hand with that.", 
   {
    "unicode_changes_made": true
   }, 
   432537, 
   null, 
   1308427560.0
  ], 
  [
   432544, 
   null, 
   "pappillion001", 
   "A Zombie would be someone who has died and been resurrected to live again, The Undead would be Vampires and werewolves.. considering they don't die to become what they are but they are technically dead since they don't have a heart beat so they are undead as opposed to being a Resurrected Zombie. \n \n Question.. According to the Bible how many Jewish Zombies were mentioned ?\n\n \n I think five in total, but I would have to loook it up. That is five specifically mentioned by name. \n \n There was a mass of them that fell out of their graves right before Jesus died. They wandered about a bit and then went to town. Surely there has to be some record of a number of dead and buried people coming back to where the used to live, I mean other than movies becuse those aren't real.", 
   {}, 
   432422, 
   null, 
   1308427800.0
  ], 
  [
   432545, 
   null, 
   "Xcaliber", 
   "I think five in total, but I would have to loook it up. That is five specifically mentioned by name. \n \n There was a mass of them that fell out of their graves right before Jesus died. They wandered about a bit and then went to town. Surely there has to be some record of a number of dead and buried people coming back to where the used to live, I mean other than movies becuse those aren't real.\n\n \n I found 8 accounts of the undead, not including the mass of undead From \"Resident Evil Part 5: The Resurrection\" \n \n 1. Elijah & the widow's son (1 Kings 17)\n \n 2. Elisha & the son of the Shunammite woman (2 Kings 4)\n \n 3. The dead man who touched the bones of Elisha (2 Kings 13)\n \n 4. Jesus brought back the widow of Nain's son (Luke 7)\n \n 5. Jesus brought back the synagogue leader's daughter (Luke 8)\n \n 6. Jesus brought back Lazarus (John 11)\n \n 7. Peter brought back Tabitha/or Dorcas (Acts 9)\n \n 8. Paul brought Eutychus back to life (Acts 20)", 
   {}, 
   432544, 
   null, 
   1308429240.0
  ], 
  [
   432551, 
   null, 
   "trebor", 
   "Hey dork, Jesus is Risen.\n\n \n So it the Pillsbury dough boy.", 
   {}, 
   432537, 
   null, 
   1308436380.0
  ], 
  [
   432552, 
   null, 
   "jyoshu", 
   " see this quote floating around at a lot of Atheist and anti-Christian web sites.\n\n \n Gee, imagine that.", 
   {}, 
   432363, 
   null, 
   1308437520.0
  ], 
  [
   432566, 
   null, 
   "Winston Smith", 
   "OK! If Jesus was not a zombie, the why so many of his followers seem to be brain dead? emoticon_xangel", 
   {}, 
   432552, 
   null, 
   1308452040.0
  ], 
  [
   432582, 
   null, 
   "gansao", 
   "A dead person brought back to life... that sounds like the definition of a zombie to me. I guess he didn't act 'lifeless' if that's what you mean.\n\n \n So if your heart stops on an operating table and your are resuscitated then you qualify to be a zombie?\n \n Zombie according to wiki and as I understood it...\n \n \n Zombie (Haitian Creole: zonbi; North Mbundu: nzumbe) is a term used to describe a hypnotized person bereft of consciousness and self-awareness, yet ambulant and able to respond to surrounding stimuli. Of voodoo (Vodun) origin, the word initially referred to a curse cast by sorcerers (or bokors) allowing them to take control of a person's mind, therefore affecting his or her actions. However, due to significant influence of Haitian Vodou and New Orleans Voodoo on witchcraft mythology, this meaning soon morphed into that of a human corpse mysteriously reanimated to serve the undead. Since the late 19th century, zombies have acquired notable popularity, especially in North American and European folklore.\n \n So the idiot who described Christ as a zombie obviously does not know what a zombie is.\n Please ..no rants by the ' Jebus is a myth' brigade.I am not saying he existed, I am saying he was not a zombie", 
   {}, 
   432419, 
   null, 
   1308496680.0
  ], 
  [
   432589, 
   null, 
   "MrWriteLA", 
   "As Tom Paine puts it in The Age of Reason:\n(T)his opening of the graves is supernatural, and directly in point to their doctrine, their cause, and their apostleship. Had it been true, it would have filled up whole chapters of those books, and been the chosen theme and general chorus of all the writers; but instead of this, little and trivial things, and mere prattling conversations of, he said this, and he said that, are often tediously detailed, while this, most important of all, had it been true, is passed off in a slovenly manner by a single dash of the pen, and that by one writer only, and not so much as hinted at by the rest.\n \n It is an easy thing to tell a lie, but it is difficult to support the lie after it is told. The writer of the book of Matthew should have told us who the saints were that came to life again, and went into the city, and what became of them afterward, and who it was that saw them - for he is not hardy enough to say he saw them himself; whether they came out naked, and all in natural buff, he-saints and she-saints; or whether they came full dressed, and where they got their dresses; whether they went to their former habitations, and reclaimed their wives, their husbands, and their property, and how they were received; whether they entered ejectments for the recovery of their possessions, or brought actions of crim. con. against the rival interlopers; whether they remained on earth, and followed their former occupation of preaching or working; or whether they died again, or went back to their graves alive, and buried themselves.\n \n Strange, indeed, that an army of saints should return to life, and nobody know who they were, nor who it was that saw them, and that not a word more should be said upon the subject, nor these saints have anything to tell us! Had it been the prophets who (as we are told) had formerly prophesied of these things, they must have had a great deal to say. They could have told us everything and we should have had posthumous prophecies, with notes and commentaries upon the first, a little better at least than we have now. Had it been Moses and Aaron and Joshua and Samuel and David, not an unconverted Jew had remained in all Jerusalem. Had it been John the Baptist, and the saints of the time then present, everybody would have known them, and they would have out-preached and out-famed all the other apostles. But, instead of this, these saints were made to pop up, like Jonah's gourd in the night, for no purpose at all but to wither in the morning. Thus much for this part of the story.\nAge of Reason by Thomas Paine", 
   {
    "unicode_changes_made": true
   }, 
   432544, 
   null, 
   1308499620.0
  ], 
  [
   432593, 
   null, 
   "Xcaliber", 
   "this meaning soon morphed into that of a human corpse mysteriously reanimated to serve the undead.\n \n So the idiot who described Christ as a zombie obviously does not know what a zombie is.\n Please ..no rants by the ' Jebus is a myth' brigade.I am not saying he existed, I am saying he was not a zombie\n\n \n Read it again.. \" corpse mysteriously reanimated to serve the undead\" .. Hmm seems to describe Jebus to the letter.. Although his body was never found the religion preaches that he came back.. after being dead... A Jewish Zombie according to your own definition ...", 
   {}, 
   432582, 
   null, 
   1308501660.0
  ], 
  [
   432594, 
   null, 
   "gansao", 
   "Read it again.. \" corpse mysteriously reanimated to serve the undead\" .. Hmm seems to describe Jebus to the letter.. Although his body was never found the religion preaches that he came back.. after being dead... A Jewish Zombie according to your own definition ...\n\n \n You obviously didnt read my definitionemoticon_xclown....maybe you just didnt understand it", 
   {}, 
   432593, 
   null, 
   1308501840.0
  ], 
  [
   432595, 
   null, 
   "Jo Bennett", 
   "Again, you're inaccurately conflating reanimation and resurrection. Reanimation is the equivalent of making the frog's legs jerk by running a current through them. Resurrection is the complete and total restoration of life.", 
   {}, 
   432593, 
   null, 
   1308502020.0
  ], 
  [
   432597, 
   null, 
   "Xcaliber", 
   "You obviously didnt read my definitionemoticon_xclown....maybe you just didnt understand it\n\n \n Well I actually quoted part of it back to you AND repeated it for good measure.. maybe you don't understand your own definition... lol", 
   {}, 
   432594, 
   null, 
   1308502680.0
  ], 
  [
   432598, 
   null, 
   "gansao", 
   "Again, you're inaccurately conflating reanimation and resurrection. Reanimation is the equivalent of making the frog's legs jerk by running a current through them. Resurrection is the complete and total restoration of life.\n\n \n Well if you want to twist the terms of being a zombie like Xcaliber then a resucitated jewish undertaker would be a jewish zombie serving the undead.\n Thats what happens when apply what you see on television to religious philosophy.\n The zombie..even on the crassest tv shows were controlled or souless creatures..animated dead bodies as you suggest and even that was the stuff of recent pulp fiction and horror films.\n The original 'voodoo' zombie was described in my post but ignored in the response.", 
   {}, 
   432595, 
   null, 
   1308502680.0
  ], 
  [
   432599, 
   null, 
   "gansao", 
   "Well I actually quoted part of it back to you AND repeated it for good measure.. maybe you don't understand your own definition... lol\n\n \n Read the previous post and learn something..I should charge lol!", 
   {}, 
   432597, 
   null, 
   1308502740.0
  ], 
  [
   432600, 
   null, 
   "Xcaliber", 
   "Again, you're inaccurately conflating reanimation and resurrection. Reanimation is the equivalent of making the frog's legs jerk by running a current through them. Resurrection is the complete and total restoration of life.\n\n \n There is no difference in the two unless you're a religious zealot defending the mythical resurrection. Zombies it seems come in more than one form. If a dead man comes back to life according to Myth he is called a Zombie.. considering the FACT that Jebus 's body was never found I could argue your definition of Resurrected since without a body there is no proof that he was alive a day and a half after he died.", 
   {}, 
   432595, 
   null, 
   1308502980.0
  ], 
  [
   432601, 
   null, 
   "gansao", 
   "To call god 'a man in the sky' and Jesus a zombie actually makes the anti religious brigade look stupid and obtuse...but just look who's posting this stuff...", 
   {}, 
   432599, 
   null, 
   1308503040.0
  ], 
  [
   432602, 
   null, 
   "Xcaliber", 
   "Read the previous post and learn something..I should charge lol!\n\n \n just proving you're ignorance again , You posted a definition and now are trying to twist your own definition because you know you stuck your foot in your mouth and you can't handle being called out on it.. \n \n Your definition, or at least the last part, describes what Jebus could have been. get over yourself.", 
   {}, 
   432599, 
   null, 
   1308503160.0
  ], 
  [
   432604, 
   null, 
   "gansao", 
   "There is no difference in the two unless you're a religious zealot defending the mythical resurrection. Zombies it seems come in more than one form. If a dead man comes back to life according to Myth he is called a Zombie.. considering the FACT that Jebus 's body was never found I could argue your definition of Resurrected since without a body there is no proof that he was alive a day and a half after he died.\n\n \n Wrong .Zombie applies to the voodoo cult not ' myth'( whatever that is).\n It has a specific meaning that has been changed through popular books and( where you come in) films.\n There are many people who believe in Jesus who are not religious zealots so you are wrong again..maybe its a habit", 
   {}, 
   432600, 
   null, 
   1308503400.0
  ], 
  [
   432605, 
   null, 
   "gansao", 
   "just proving you're ignorance again , You posted a definition and now are trying to twist your own definition because you know you stuck your foot in your mouth and you can't handle being called out on it.. \n \n Your definition, or at least the last part, describes what Jebus could have been. get over yourself.\n\n \n Just keep telling yourself that.Im not refuting you to convince you.\n Im just showing that you are wrong..what you think is as irrelevant as you.", 
   {}, 
   432602, 
   null, 
   1308503520.0
  ], 
  [
   432614, 
   null, 
   "Stonewall", 
   "So if your heart stops on an operating table and your are resuscitated then you qualify to be a zombie?\n \n Zombie according to wiki and as I understood it...\n \n \n Zombie (Haitian Creole: zonbi; North Mbundu: nzumbe) is a term used to describe a hypnotized person bereft of consciousness and self-awareness, yet ambulant and able to respond to surrounding stimuli. Of voodoo (Vodun) origin, the word initially referred to a curse cast by sorcerers (or bokors) allowing them to take control of a person's mind, therefore affecting his or her actions. However, due to significant influence of Haitian Vodou and New Orleans Voodoo on witchcraft mythology, this meaning soon morphed into that of a human corpse mysteriously reanimated to serve the undead. Since the late 19th century, zombies have acquired notable popularity, especially in North American and European folklore.\n \n So the idiot who described Christ as a zombie obviously does not know what a zombie is.\n Please ..no rants by the ' Jebus is a myth' brigade.I am not saying he existed, I am saying he was not a zombie\n\n \n By dead, I would think 'brain dead', but your point is valid. \n \n I guess Jesus doesn't fit the strict definition of a zombie, and it isn't a very accurate description since most people think of a zombie as the slow moving, lifeless pe, which Jesus obviously wasn't. It does sorta fit a very loose definition (like the one below), but the word was obviously picked to show the absurdity of the story in a funny (mocking) way, not to be a meaningful summary of Christian belief.\n \n \nn\n 1. a dead body that has been brought back to life by a supernatural force [syn: zombi, the living dead]\n\n Zombie definition by Babylon's free dictionary\n \n (I'm not saying this is very accurate, but it is a loose definition that fits here).", 
   {}, 
   432582, 
   null, 
   1308511740.0
  ], 
  [
   432615, 
   null, 
   "gansao", 
   "By dead, I would think 'brain dead', but your point is valid. \n \n I guess Jesus doesn't fit the strict definition of a zombie, and it isn't a very accurate description since most people think of a zombie as the slow moving, lifeless pe, which Jesus obviously wasn't. It does sorta fit a very loose definition (like the one below), but the word was obviously picked to show the absurdity of the story in a funny (mocking) way, not to be a meaningful summary of Christian belief.\n \n \n Zombie definition by Babylon's free dictionary\n \n (I'm not saying this is very accurate, but it is a loose definition that fits here).\n\n \n You are right that the ' babylon' definition is loose..you forgot the one about someone who surfs the internet for hours .\n We could all add rather stupid definitions that seems loose but ' sorta fits here'.\n Showing the absurdity of the story is not served by providing an absurd definition that ' sorta fits'.\n When a Christian provides a view that ' sorta fits' their view of what the Bible states it usually creates a dogpile of athiest derision at yet they seem to be happy with ' sorta fit' definitions of their own.", 
   {}, 
   432614, 
   null, 
   1308516420.0
  ], 
  [
   432626, 
   null, 
   "Xcaliber", 
   "Just keep telling yourself that.Im not refuting you to convince you.\n Im just showing that you are wrong..what you think is as irrelevant as you.\n\n \n Well you haven't proved me wrong yet so I suppose you need to keep trying.\n \n According to MY definition, or rather one I like to adhere to then I'm within my right to call Jebus a Zombie.. \n \n http://www.urbandictionary.com/define.php?term=Cosmic%20Jewish%20Zombie", 
   {}, 
   432605, 
   null, 
   1308526800.0
  ], 
  [
   432631, 
   null, 
   "gansao", 
   "Well you haven't proved me wrong yet so I suppose you need to keep trying.\n \n According to MY definition, or rather one I like to adhere to then I'm within my right to call Jebus a Zombie.. \n \n Urban Dictionary: Cosmic Jewish Zombie\n\n \n You know as much about voodoo as you do about greek mythology..whatever you picked up from the tv.\n You can call jebus a zombie and I can call you an imbecile but once again I would be the one who is correct emoticon_xclown\n \n Urban dictionary...have you got buck teeth and play a banjo...jesus XXXXing christemoticon_xchicken", 
   {}, 
   432626, 
   null, 
   1308532080.0
  ], 
  [
   432633, 
   null, 
   "Winston Smith", 
   "The reason this quote is so popular and not only in the English speaking Web is because it's funny, why is it funny ? because it shows in a few words the absurdity of Christian beliefs using simple imagery.\n Let&#8217;s remove the contentious &#8216;zombie&#8217; from the definition: \n \n \n&#8220;The belief that a cosmic being who was his own father and impregnated his own mother and organized his own death, can make you live forever if you symbolically eat his flesh and telepathically tell him you accept him as your master, so he can remove an evil force from your soul that is present in humanity because a rib-woman was convinced by a talking snake to eat from a magical tree...&#8221;\n\n \n all Christians happy now ? emoticon_xangel\n \n Christianity - Uncyclopedia, the content-free encyclopedia", 
   {}, 
   432602, 
   null, 
   1308535920.0
  ], 
  [
   432636, 
   null, 
   "gansao", 
   "The reason this quote is so popular and not only in the English speaking Web is because it's funny, why is it funny ? because it shows in a few words the absurdity of Christian beliefs using simple imagery.\n Let's remove the contentious 'zombie' from the definition: \n \n \n \n all Christians happy now ? emoticon_xangel\n \n Christianity - Uncyclopedia, the content-free encyclopedia\n\n \n Christ never claimed tp be his own father.Biologically or spritually.\n Neither was it claimed he impregnated his own mother.\n Yep he organised his own death.\n Not all Christians symbolically eat his own flesh and note the ' symbolically' for the ones that do. The sign of the cross is symbol but ones that do it do not believe they actually make a mini cross neither do people who wear crucifixes believe it is a tiny actual cross that Jesus died on.\n You could say that you telepathically accept him for your master in order to remove an evil force from your soul or you could say that by embracing his teachings you will become worthy of eternal life..not much between that I suppose.\n Not sure about the rib woman..Eve was supposed to be created from Adams rib so I suppose that you being created from your mother makes you a lady boy.\n Yep the snake talked and I suppose the tree was magic.\n 5 out of 10 maybe.\n Could do better.you can snigger at your joke nowemoticon_xclown\n Maybe the adults will just say the Bibble is a collection of allegories but you have to wait for hair to grow on your testicles to think that one up.", 
   {
    "unicode_changes_made": true
   }, 
   432633, 
   null, 
   1308536880.0
  ], 
  [
   432638, 
   null, 
   "Xcaliber", 
   "You know as much about voodoo as you do about greek mythology..whatever you picked up from the tv.\n You can call jebus a zombie and I can call you an imbecile but once again I would be the one who is correct emoticon_xclown\n \n Urban dictionary...have you got buck teeth and play a banjo...jesus XXXXing christemoticon_xchicken\n\n \n Who said anything about Voodoo?.. You honestly think because you found ONE definition for Zombie that suddenly the great gansao is right?.. How moronic can you be. Jebus wasn't real,,, Jebus was a Zombie... Jebus was a necromancer... Hell I can call him anything I damn well please and it still doesn't make you right. What a dumb XXXXer you are...emoticon_xbangheadxbanghead", 
   {}, 
   432631, 
   null, 
   1308537300.0
  ], 
  [
   432639, 
   null, 
   "gansao", 
   "Who said anything about Voodoo?.. You honestly think because you found ONE definition for Zombie that suddenly the great gansao is right?.. How moronic can you be. Jebus wasn't real,,, Jebus was a Zombie... Jebus was a necromancer... Hell I can call him anything I damn well please and it still doesn't make you right. What a dumb XXXXer you are...emoticon_xbangheadxbanghead\n\n \n I was right wasnt I? You do have buck teeth and play the banjo...look see if the Sesame street web site has a definition of zombie..what an arsehole lol", 
   {}, 
   432638, 
   null, 
   1308537480.0
  ], 
  [
   432640, 
   null, 
   "Xcaliber", 
   "I was right wasnt I? You do have buck teeth and play the banjo...look see if the Sesame street web site has a definition of zombie..what an arsehole lol\n\n \n What's Sesame Street?... Oh wait that's where you got your pathetic education isn't it, no wonder you're so ignorant. ... emoticon_xchickenemoticon_xchicken", 
   {}, 
   432639, 
   null, 
   1308537720.0
  ], 
  [
   432641, 
   null, 
   "gansao", 
   "zombi, also spelled zombie, in Vodou, a dead person who is revived after burial and compelled to do the bidding of the reviver, including criminal acts and heavy manual labour. Scholars believe that actual zombis are living persons under the influence of powerful drugs, including burundanga (reportedly used by Colombian criminals) and drugs derived from poisonous toads and puffer fish\n \n This the grown up version...this is not for you Xcaliber . Its for the adults.", 
   {}, 
   432639, 
   null, 
   1308537720.0
  ], 
  [
   432642, 
   null, 
   "gansao", 
   "What's Sesame Street?... Oh wait that's where you got your pathetic education isn't it, no wonder you're so ignorant. ... emoticon_xchickenemoticon_xchicken\n\n \n That and nickelodeon taught you all that know..how could you forget?", 
   {}, 
   432640, 
   null, 
   1308537840.0
  ], 
  [
   432643, 
   null, 
   "Xcaliber", 
   "That and nickelodeon taught you all that know..how could you forget?\n\n \n From an Actual Dictionary, not your Wikipedia source.. And no I don't think Jebus was a Mixed Drink, he was technically a ZOMBIE.. dumbass....\n \n Noun 1. zombie - a dead body that has been brought back to life by a supernatural force\n 2. zombie - (voodooism) a spirit or supernatural force that reanimates a dead body\n 3. zombie - a god of voodoo cults of African origin worshipped especially in West Indies\n 4. zombie - someone who acts or responds in a mechanical or apathetic way\n 5. zombie - several kinds of rum with fruit juice and usually apricot liqueur \n a. A supernatural power or spell that according to voodoo belief can enter into and reanimate a corpse.\n 2 a : a person held to resemble the so-called walking dead;", 
   {}, 
   432642, 
   null, 
   1308538260.0
  ], 
  [
   432645, 
   null, 
   "gansao", 
   "From an Actual Dictionary, not your Wikipedia source.. And no I don't think Jebus was a Mixed Drink, he was technically a ZOMBIE.. dumbass....\n \n Noun 1. zombie - a dead body that has been brought back to life by a supernatural force\n 2. zombie - (voodooism) a spirit or supernatural force that reanimates a dead body\n 3. zombie - a god of voodoo cults of African origin worshipped especially in West Indies\n 4. zombie - someone who acts or responds in a mechanical or apathetic way\n 5. zombie - several kinds of rum with fruit juice and usually apricot liqueur \n a. A supernatural power or spell that according to voodoo belief can enter into and reanimate a corpse.\n 2 a : a person held to resemble the so-called walking dead;\n\n \n MY source was encyclopedia britannica but wiki was far better than this one.\n \n Now this is what happened, you used the urban dictionary which frankly humiliated you so you scurried around to find one that was as ignorant as you..and you succeeded..well done.\n Is this the same one that says Zeus created mankind or did you tappy tap it out and pretend it come from a credible source?\n \n Quote Zombie..a god of voodoo cults.... pmsl......only you could post that XXXX with a straight face", 
   {}, 
   432643, 
   null, 
   1308538680.0
  ], 
  [
   432650, 
   null, 
   "Xcaliber", 
   "MY source was encyclopedia britannica but wiki was far better than this one.\n \n Now this is what happened, you used the urban dictionary which frankly humiliated you so you scurried around to find one that was as ignorant as you..and you succeeded..well done.\n Is this the same one that says Zeus created mankind or did you tappy tap it out and pretend it come from a credible source?\n \n Quote Zombie..a god of voodoo cults.... pmsl......only you could post that XXXX with a straight face\n\n \n You are an ignorant XXXXX aren't you. I got that from a dictionary, and it's one of many different definitions , which you are just ignorant enough to believe only the one you posted is correct.. Lame attempt to look smart, it didn't work for you this time either.", 
   {}, 
   432645, 
   null, 
   1308542880.0
  ], 
  [
   432652, 
   null, 
   "Xcaliber", 
   "MY source was encyclopedia britannica but wiki was far better than this one.\n\n \n So not only are you stupid you're a Liar too?... \n \n \n\n Zombie according to wiki and as I understood it...\n \n Zombie (Haitian Creole: zonbi; North Mbundu: nzumbe) is a term used to describe a hypnotized person bereft of consciousness and self-awareness, yet ambulant and able to respond to surrounding stimuli. Of voodoo (Vodun) origin, the word initially referred to a curse cast by sorcerers (or bokors) allowing them to take control of a person's mind, therefore affecting his or her actions. However, due to significant influence of Haitian Vodou and New Orleans Voodoo on witchcraft mythology, this meaning soon morphed into that of a human corpse mysteriously reanimated to serve the undead. Since the late 19th century, zombies have acquired notable popularity, especially in North American and European folklore.\n\n \n I'm afraid Wiki isn't the Encyclopedia Britannica.. You should try really hard to remember when you try to tell lies like this.", 
   {}, 
   432645, 
   null, 
   1308543840.0
  ], 
  [
   432657, 
   null, 
   "gansao", 
   "zombi, also spelled zombie, in Vodou, a dead person who is revived after burial and compelled to do the bidding of the reviver, including criminal acts and heavy manual labour. Scholars believe that actual zombis are living persons under the influence of powerful drugs, including burundanga (reportedly used by Colombian criminals) and drugs derived from poisonous toads and puffer fish\n \n This the grown up version...this is not for you Xcaliber . Its for the adults.\n\n \n \nSo not only are you stupid you're a Liar too?... \n \n \n \n I'm afraid Wiki isn't the Encyclopedia Britannica.. You should try really hard to remember when you try to tell lies like this.\n\n \n I used the encyclopdia brittanica one after wiki but mentioned wiki in the post because that was far better than your one as well.\n Do try to keep up banjo boy and wash your mouth out with soap and water while you're at it. lol", 
   {}, 
   432652, 
   null, 
   1308546720.0
  ], 
  [
   432658, 
   null, 
   "gansao", 
   "You are an ignorant XXXXX aren't you. I got that from a dictionary, and it's one of many different definitions , which you are just ignorant enough to believe only the one you posted is correct.. Lame attempt to look smart, it didn't work for you this time either.\n\n \n What dictionary was that? \n I'd only have to fart and chew gum at the same time to look smart compared to you;)", 
   {}, 
   432650, 
   null, 
   1308546900.0
  ], 
  [
   432660, 
   null, 
   "Xcaliber", 
   "I used the encyclopdia brittanica one after wiki but mentioned wiki in the post because that was far better than your one as well.\n Do try to keep up banjo boy and wash your mouth out with soap and water while you're at it. lol\n\n \n backtracking does seem to be your style. .. It's ok I'm sure everyone here is used to you lying and then backing out by telling more lies...emoticon_xbye", 
   {}, 
   432657, 
   null, 
   1308547500.0
  ], 
  [
   432661, 
   null, 
   "Xcaliber", 
   "What dictionary was that? \n I'd only have to fart and chew gum at the same time to look smart compared to you;)\n\n \n yeah you say it but you consistently show how truly stupid you are.. I doubt you are smart enough to chew gum.emoticon_xbye", 
   {}, 
   432658, 
   null, 
   1308547620.0
  ], 
  [
   432664, 
   null, 
   "gansao", 
   "backtracking does seem to be your style. .. It's ok I'm sure everyone here is used to you lying and then backing out by telling more lies...emoticon_xbye\n\n \n Show me how I lied.\n I provided you with a quote from encyclopaedia brittanica and stated that it was from encyclopaedia brittanica.\n When you asserted that I lied I provided you with the post that you stated I did not supply.\n IS that all that you have Xcaliber because I dont think I did lie", 
   {}, 
   432660, 
   null, 
   1308547860.0
  ], 
  [
   432666, 
   null, 
   "gansao", 
   "yeah you say it but you consistently show how truly stupid you are.. I doubt you are smart enough to chew gum.emoticon_xbye\n\n \n I did not supply a definition from urban dictionary nor did I supply one and refused to show the source.\n I have not stated that you are a liar when I know full well that you are not.\n You are a coward and thats not a good thing to openly be for someone who pretends he is an ex soldier", 
   {}, 
   432661, 
   null, 
   1308548100.0
  ], 
  [
   432676, 
   null, 
   "poet", 
   "You are an ignorant XXXXX aren't you. I got that from a dictionary, and it's one of many different definitions , which you are just ignorant enough to believe only the one you posted is correct.. Lame attempt to look smart, it didn't work for you this time either.\n\n \n LOL. What would you expect from a Neanderthal?", 
   {}, 
   432650, 
   null, 
   1308549300.0
  ], 
  [
   432678, 
   null, 
   "gansao", 
   "LOL. What would you expect from a Neanderthal?\n\n \n Neanderthals were very smart people.\n I would have thought a scholar like you would know that.", 
   {}, 
   432676, 
   null, 
   1308549480.0
  ], 
  [
   432692, 
   null, 
   "poet", 
   "Neanderthals were very smart people.\n I would have thought a scholar like you would know that.\n\n \n They went extinct. Not the mark of intelligent beings, who can adapt.", 
   {}, 
   432678, 
   null, 
   1308551100.0
  ], 
  [
   432694, 
   null, 
   "gansao", 
   "They went extinct. Not the mark of intelligent beings, who can adapt.\n\n \n It was the climate that done for them.\n They were not as adaptable as the Homosapiens but smart nonetheless.\n Their remnants may have just been assimilated into the homosapiens and so not exactly extinct.\n A kind of prehistoric human melting pot..makes you feel all warm inside", 
   {}, 
   432692, 
   null, 
   1308552840.0
  ], 
  [
   432705, 
   null, 
   "pappillion001", 
   "I found 8 accounts of the undead, not including the mass of undead From \"Resident Evil Part 5: The Resurrection\" \n \n 1. Elijah & the widow's son (1 Kings 17)\n \n 2. Elisha & the son of the Shunammite woman (2 Kings 4)\n \n 3. The dead man who touched the bones of Elisha (2 Kings 13)\n \n 4. Jesus brought back the widow of Nain's son (Luke 7)\n \n 5. Jesus brought back the synagogue leader's daughter (Luke 8)\n \n 6. Jesus brought back Lazarus (John 11)\n \n 7. Peter brought back Tabitha/or Dorcas (Acts 9)\n \n 8. Paul brought Eutychus back to life (Acts 20)\n\n \n I knew there were a few both before and after Jesus, which seems to not be brought up very much. I think mostly Christians don't know or have convinced themselves that there is a difference.", 
   {}, 
   432545, 
   null, 
   1308565980.0
  ], 
  [
   432706, 
   null, 
   "pappillion001", 
   "So if your heart stops on an operating table and your are resuscitated then you qualify to be a zombie?\n \n Zombie according to wiki and as I understood it...\n \n \n Zombie (Haitian Creole: zonbi; North Mbundu: nzumbe) is a term used to describe a hypnotized person bereft of consciousness and self-awareness, yet ambulant and able to respond to surrounding stimuli. Of voodoo (Vodun) origin, the word initially referred to a curse cast by sorcerers (or bokors) allowing them to take control of a person's mind, therefore affecting his or her actions. However, due to significant influence of Haitian Vodou and New Orleans Voodoo on witchcraft mythology, this meaning soon morphed into that of a human corpse mysteriously reanimated to serve the undead. Since the late 19th century, zombies have acquired notable popularity, especially in North American and European folklore.\n \n So the idiot who described Christ as a zombie obviously does not know what a zombie is.\n Please ..no rants by the ' Jebus is a myth' brigade.I am not saying he existed, I am saying he was not a zombie\n\n \n Then what was he?", 
   {}, 
   432582, 
   null, 
   1308567000.0
  ], 
  [
   432708, 
   null, 
   "Winston Smith", 
   "Please ..no rants by the ' Jebus is a myth' brigade.I am not saying he existed, I am saying he was not a zombie\n\n \n hm...if you are not saying he existed it means you are saying he did not exist ?\n \n if he did not exist then ... forget about the zombie part for what doesn't exist cannot have atributes. \n \n but just for argument's sake what do you think happened with Jesus after he was crucified. no habeas corpus means he resurrected himself or mybe his father or the holy ghost did it, well they are all the same thing, right? or maybe his followers sold his corpse for pet food or something like that ? emoticon_cool", 
   {}, 
   432582, 
   null, 
   1308568680.0
  ], 
  [
   432713, 
   null, 
   "gansao", 
   "Then what was he?\n\n \n I dont know what he was but I do know what he wasnt.\n He wasnt a Zombie, Centaur,Djinn,goblin or the incredible hulk.", 
   {}, 
   432706, 
   null, 
   1308577620.0
  ], 
  [
   432714, 
   null, 
   "gansao", 
   "hm...if you are not saying he existed it means you are saying he did not exist ?\n \n if he did not exist then ... forget about the zombie part for what doesn't exist cannot have atributes. \n \n but just for argument's sake what do you think happened with Jesus after he was crucified. no habeas corpus means he resurrected himself or mybe his father or the holy ghost did it, well they are all the same thing, right? or maybe his followers sold his corpse for pet food or something like that ? emoticon_cool\n\n \n I am quite happy to accept the opinion that Christ was not resurrected or even that he did not exist.\n I am not happy with an obviously wrong definition of Christ whether he was devine or even existed at all.\n It reduces the argument of athiests if they apply a ridiculous definition to a diety ie saying that God is a man in the sky only makes the argument against God harder because there are two obvious mistakes in the definition.\n \n If you actually want my opinion rather than fish for something to take the XXXX out of then I will tell you.\n Jesus was either divine or not .\n If he was not divine then the New Testament is still worth studying as a piece of ancient philosophy that still has relevence in the modern world.\n In the event that he was divine( which I agree is highly unlikely) then it causes a problem to me and one which I cannot overcome by reading the Bible...so I dont.\n So I think the best way to view the Bible is to see it as a collection of allegories( whether it is or not) and let people who believe it is actually true to their own devices in trying to make sense out of it.", 
   {}, 
   432708, 
   null, 
   1308578880.0
  ], 
  [
   432715, 
   null, 
   "Winston Smith", 
   "ganso, the Bible is not a collection of allegories and ganso, it is not a piece of ancient philosophy either.\n \n But yes, that definition of Christianity deserves IMHO , for the reasons I gave above, to be ubiquitous in the Web.\n \n this forum is zzzz.... zzzzz \n \n Back to reading and watching movies, right now I was watching \"Fanny and Alexander\" \n \n emoticon_xbye emoticon_xbye", 
   {}, 
   432714, 
   null, 
   1308579780.0
  ], 
  [
   432724, 
   null, 
   "gansao", 
   "ganso, the Bible is not a collection of allegories and ganso, it is not a piece of ancient philosophy either.\n \n But yes, that definition of Christianity deserves IMHO , for the reasons I gave above, to be ubiquitous in the Web.\n \n this forum is zzzz.... zzzzz \n \n Back to reading and watching movies, right now I was watching \"Fanny and Alexander\" \n \n emoticon_xbye emoticon_xbye\n\n \n It can be considered to be a collection of allegories and it contains ancient philosophy.\n So you are wrong.\n Keep watching your television thoughemoticon_xbye", 
   {}, 
   432715, 
   null, 
   1308581940.0
  ], 
  [
   432727, 
   null, 
   "gansao", 
   "backtracking does seem to be your style. .. It's ok I'm sure everyone here is used to you lying and then backing out by telling more lies...emoticon_xbye\n\n \n \nShow me how I lied.\n I provided you with a quote from encyclopaedia brittanica and stated that it was from encyclopaedia brittanica.\n When you asserted that I lied I provided you with the post that you stated I did not supply.\n IS that all that you have Xcaliber because I dont think I did lie\n\n \n Still no reply from the chocolate soldier", 
   {}, 
   432708, 
   null, 
   1308584700.0
  ], 
  [
   432728, 
   null, 
   "Xcaliber", 
   "I did not supply a definition from urban dictionary nor did I supply one and refused to show the source.\n I have not stated that you are a liar when I know full well that you are not.\n You are a coward and thats not a good thing to openly be for someone who pretends he is an ex soldier\n\n \n No.. You first posted a definition from Wiki.. then you later said that your source was the encyclopedia... Wiki is not the encyclopedia...\n \n Point is though, Only an ignorant M-o-r-o-n would make such a big deal out of a term that is used mostly as a slap in the face of religion. I call Jebus a Zombie all the time, and using the term Zombie loosely well yes, Jebus could be seen as a Zombie. Considering the fact that Zombies don't exist any more than Jebus did it's actually stupid on my part to continue arguing this with you. This isn't about Jebus being a Zombie.. it's about you're feelings of inadequacy and being proven wrong before.", 
   {}, 
   432666, 
   null, 
   1308585000.0
  ], 
  [
   432729, 
   null, 
   "gansao", 
   "No.. You first posted a definition from Wiki.. then you later said that your source was the encyclopedia... Wiki is not the encyclopedia...\n \n Point is though, Only an ignorant M-o-r-o-n would make such a big deal out of a term that is used mostly as a slap in the face of religion. I call Jebus a Zombie all the time, and using the term Zombie loosely well yes, Jebus could be seen as a Zombie. Considering the fact that Zombies don't exist any more than Jebus did it's actually stupid on my part to continue arguing this with you. This isn't about Jebus being a Zombie.. it's about you're feelings of inadequacy and being proven wrong before.\n\n \n I know that I FIRST posted a definition from Wiki.\n Then I posted a definition from Encyclopaedia brittanica and referred to that while saying that the wiki was still better than yours.\n You then quoted the wiki and claimed I was a liar because I said it was from encyclopaedia Brittanica.\n I pointed out that you were wrong and requoted the brittanica definition.\n You came back and said that I was back pedalling and a liar.\n Its about you being a snivelling little coward..I proved the Zombie point far earlier.\n I dont care about youre stupid definition but I wont be called a liar by a coward who pretends he is a Vietnam vet..especially after I took the time to prove he was wrong and he still insists on being dishonest.\n You are right its not about the definition its about you being a dishonest coward and that cant be said enough.", 
   {}, 
   432728, 
   null, 
   1308585540.0
  ], 
  [
   432730, 
   null, 
   "Xcaliber", 
   "I know that I FIRST posted a definition from Wiki.\n Then I posted a definition from Encyclopaedia brittanica and referred to that while saying that the wiki was still better than yours.\n You then quoted the wiki and claimed I was a liar because I said it was from encyclopaedia Brittanica.\n I pointed out that you were wrong and requoted the brittanica definition.\n You came back and said that I was back pedalling and a liar.\n Its about you being a snivelling little coward..I proved the Zombie point far earlier.\n I dont care about youre stupid definition but I wont be called a liar by a coward who pretends he is a Vietnam vet..especially after I took the time to prove he was wrong and he still insists on being dishonest.\n You are right its not about the definition its about you being a dishonest coward and that cant be said enough.\n\n \n You are a Liar, and a Coward. And I never claimed to be a Vietnam Vet..I said Disabled Vet.. I never told you what War. And I'm not sure what you mean by \" Chocolate Soldier\".. that's ignorant even for you. Now stop lying and get back on topic.", 
   {}, 
   432729, 
   null, 
   1308585780.0
  ], 
  [
   432731, 
   null, 
   "gansao", 
   "You are a Liar, and a Coward. And I never claimed to be a Vietnam Vet..I said Disabled Vet.. I never told you what War. And I'm not sure what you mean by \" Chocolate Soldier\".. that's ignorant even for you. Now stop lying and get back on topic.\n\n \n Nope, you stated that I am a liar but could not prove it and even carried on saying it after I proved you wrong.\n I dont mind you being slow because you cant help that but no one has the right to lie through his teeth.\n So once again I challenge you to prove I am a liar or concede that you are.", 
   {}, 
   432730, 
   null, 
   1308586260.0
  ], 
  [
   432738, 
   null, 
   "Xcaliber", 
   "Nope, you stated that I am a liar but could not prove it and even carried on saying it after I proved you wrong.\n I dont mind you being slow because you cant help that but no one has the right to lie through his teeth.\n So once again I challenge you to prove I am a liar or concede that you are.\n\n \n YOU STATED THAT YOUR SOURCE WAS THE ENCYCLOPEDIA..\n YOU POSTED A LINK TO A WIKI...\n YOU LIED... \n \n Now stop trying to back out of it or explain it away .. I'm fully aware that you later posted a NEW definition, but we were discussing the original definition you posted from the Wiki.. which means YOU LIED...\n \n There, All the Proof One needs.. \n \n Happy Now?....\n \n emoticon_xbyeemoticon_xbyeemoticon_xbyeemoticon_xbye", 
   {}, 
   432731, 
   null, 
   1308591300.0
  ], 
  [
   432740, 
   null, 
   "Stonewall", 
   "These Xcal/Gansao back-and-forths are so much fun.\n \n Let me try to solve the problem (I know the arguing will continue, anyway, but oh well). \n \n Jesus was brain dead and brought back to life by a supernatural force.\n \n Jesus was not under voodoo powers, he was not after brains (souls yes, but not brains), he was not lifeless or like a robot, and he wasn't soulless. \n \n In short, he does not fit the normal voodoo or horror movie definition of a zombie, but he does fit under a very loose usage of the term. \n \n I will say that the Gospel of Matthew's account of the graves being opened and the bodies of the saints rising and going into the city certainly is reminiscent of a zombie apocalypse, though.", 
   {}, 
   432731, 
   null, 
   1308591540.0
  ], 
  [
   432742, 
   null, 
   "Xcaliber", 
   "In short, he does not fit the normal voodoo or horror movie definition of a zombie, but he does fit under a very loose usage of the term.\n\n \n Dead Guy Coming back to Life = Zombie..\n \n Zombie = a word used to describe a dead guy coming back to life..\n \n Jewish Zombie = A term used by anti religious people to describe the man known as Jebus, who was supposedly resurrected three days after he was murdered. The term is most often used in a sarcastic manner to display one's disdain for religion , and specifically the fairy tales of the Judea/Christian Bible.\n \n gansoa = a m-o-r-o-n who likes to think he is smart yet has thus far been unable to prove it. \n \n Case Closed...", 
   {}, 
   432740, 
   null, 
   1308592200.0
  ], 
  [
   432743, 
   null, 
   "gansao", 
   "YOU STATED THAT YOUR SOURCE WAS THE ENCYCLOPEDIA..\n YOU POSTED A LINK TO A WIKI...\n YOU LIED... \n \n Now stop trying to back out of it or explain it away .. I'm fully aware that you later posted a NEW definition, but we were discussing the original definition you posted from the Wiki.. which means YOU LIED...\n \n There, All the Proof One needs.. \n \n Happy Now?....\n \n emoticon_xbyeemoticon_xbyeemoticon_xbyeemoticon_xbye\n\n \n I never posted a link you tool.emoticon_xdonno\n I copied and pasted the definition.\n After I posted the brittannia definition I referred to it and mentioned wiki in the post.\n Once more the chocolate soldier shows his dishonesty.\n What a dick", 
   {}, 
   432738, 
   null, 
   1308592200.0
  ], 
  [
   432744, 
   null, 
   "gansao", 
   "Dead Guy Coming back to Life = Zombie..\n \n Zombie = a word used to describe a dead guy coming back to life..\n \n Jewish Zombie = A term used by anti religious people to describe the man known as Jebus, who was supposedly resurrected three days after he was murdered. The term is most often used in a sarcastic manner to display one's disdain religion , and specifically the fairy tales of the Judea/Christian Bible.\n \n gansoa = a m-o-r-o-n who likes to think he is smart yet has thus far been unable to prove it. \n \n Case Closed...\n\n \n I can see Ive got under the chocolate soldiers skin....good because he is a snivelling little coward", 
   {}, 
   432742, 
   null, 
   1308592320.0
  ], 
  [
   432745, 
   null, 
   "Xcaliber", 
   "I can see Ive got under the chocolate soldiers skin....good because he is a snivelling little coward\n\n \n actually you don't concern me doofus.. ROFLMAO.. you wouldn't concrn anyone as far as I'm aware. \n \n The point is YOU LIED.. blatantly, LIED.. and then tried to back your way out of it. You're the one taking this too serious. You actually think in your little pea sized brain that YOU are the authority On what a Zombie is or isn't? what makes YOUR definition any more right ?.. I'll tell you, it isn't. I use the term Jewish Zombie in reference to Jebus, and it's always in sarcasm. It doesn't mean I actually believe Some XXXXX named Jebus was a Zombie, and even if I did he falls under the definition of Zombie. The problem is he doesn't fall under YOUR definition, but oh well, hate to break the news Podunk but it doesn't make you right, it makes you stupid for thinking you were. \n \n And In referring to me as \" the chocolate soldier\" I have no idea what you mean, unless you think I am a black man and you're just showing your racist bigotry and trying to be coy about it. \n \n Either way, YOU ARE A LIAR and A FRAUD.. and I can promise you that you're little words don't concern me. emoticon_xbyeemoticon_xbye", 
   {}, 
   432744, 
   null, 
   1308593160.0
  ], 
  [
   432746, 
   null, 
   "gansao", 
   "These Xcal/Gansao back-and-forths are so much fun.\n \n Let me try to solve the problem (I know the arguing will continue, anyway, but oh well). \n \n Jesus was brain dead and brought back to life by a supernatural force.\n \n Jesus was not under voodoo powers, he was not after brains (souls yes, but not brains), he was not lifeless or like a robot, and he wasn't soulless. \n \n In short, he does not fit the normal voodoo or horror movie definition of a zombie, but he does fit under a very loose usage of the term. \n \n I will say that the Gospel of Matthew's account of the graves being opened and the bodies of the saints rising and going into the city certainly is reminiscent of a zombie apocalypse, though.\n\n Yeah fun aint it?\n A zombie is a voodoo phenomenon so you are right there.It has been changed for comics and films..hence the brain eating stuff and the rest of the XXXX that Romero put in his films.\n Also even the films that the chocolate soldier seems to get his definition of a zombie from has the zombie acting sub human and they can ultimately be killed again... rather like him. but not like the portrayal of the risen Christ which you more or less point out.\n If you use the term so loosely as to include anyone that comes back from the dead to be a Zombie then everyone that has been resusitated or had heart surgery would be a zombie..unless you have a very definite point at which you believe death occurs and that point must be proved applied to the point Jesus died for to be sure he qualifies.So not really worth the effort\n I think the notion of saints rising and going into the city spoils the resurrection story a bit:)", 
   {}, 
   432740, 
   null, 
   1308593340.0
  ], 
  [
   432747, 
   null, 
   "gansao", 
   "actually you don't concern me doofus.. ROFLMAO.. you wouldn't concrn anyone as far as I'm aware. \n \n The point is YOU LIED.. blatantly, LIED.. and then tried to back your way out of it. You're the one taking this too serious. You actually think in your little pea sized brain that YOU are the authority On what a Zombie is or isn't? what makes YOUR definition any more right ?.. I'll tell you, it isn't. I use the term Jewish Zombie in reference to Jebus, and it's always in sarcasm. It doesn't mean I actually believe Some XXXXX named Jebus was a Zombie, and even if I did he falls under the definition of Zombie. The problem is he doesn't fall under YOUR definition, but oh well, hate to break the news Podunk but it doesn't make you right, it makes you stupid for thinking you were. \n \n And In referring to me as \" the chocolate soldier\" I have no idea what you mean, unless you think I am a black man and you're just showing your racist bigotry and trying to be coy about it. \n \n Either way, YOU ARE A LIAR and A FRAUD.. and I can promise you that you're little words don't concern me. emoticon_xbyeemoticon_xbye\n\n \n Prove it.I proved you were wrong.\n Oh dear the chocolate soldier says I am racist.\n Even a tool like you should able to do better than that.\n I do concern you, you snivelling coward and you know it.\n Prove I lied or stay a liar", 
   {}, 
   432745, 
   null, 
   1308593580.0
  ], 
  [
   432749, 
   null, 
   "gansao", 
   "Coooeeee!:)", 
   {}, 
   432747, 
   null, 
   1308594120.0
  ], 
  [
   432750, 
   null, 
   "Xcaliber", 
   "Prove it.I proved you were wrong.\n Oh dear the chocolate soldier says I am racist.\n Even a tool like you should able to do better than that.\n I do concern you, you snivelling coward and you know it.\n Prove I lied or stay a liar\n\n \n wha, wha , wha.. cry me a river...\n \n Already proven dude, I need not prove anything else.. You should go post in that other thread now .. \" why do we lie\" .. and explain why you felt you needed to lie to prove something as mundane as this...lmao...\n \n what a dumb XXXX you are, ...emoticon_xbounceremoticon_xbounceremoticon_xbouncer", 
   {}, 
   432747, 
   null, 
   1308595080.0
  ], 
  [
   432753, 
   null, 
   "gansao", 
   "wha, wha , wha.. cry me a river...\n \n Already proven dude, I need not prove anything else.. You should go post in that other thread now .. \" why do we lie\" .. and explain why you felt you needed to lie to prove something as mundane as this...lmao...\n \n what a dumb XXXX you are, ...emoticon_xbounceremoticon_xbounceremoticon_xbouncer\n\n \n Thats good enough for me sniveller.\n You got no proof, no class, no balls.emoticon_xbye", 
   {}, 
   432750, 
   null, 
   1308595800.0
  ], 
  [
   432755, 
   null, 
   "Xcaliber", 
   "Thats good enough for me sniveller.\n You got no proof, no class, no balls.emoticon_xbye\n\n \n lmao.. yeah keep telling yourself that, it'll get easier to deal with after a time. Must really be sad to be so pathetic.. emoticon_xbyeemoticon_xbye", 
   {}, 
   432753, 
   null, 
   1308596700.0
  ], 
  [
   432756, 
   null, 
   "gansao", 
   "lmao.. yeah keep telling yourself that, it'll get easier to deal with after a time. Must really be sad to be so pathetic.. emoticon_xbyeemoticon_xbye\n\n \n xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx", 
   {}, 
   432755, 
   null, 
   1308596820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Quote", 
  "url": "http://www.4forums.com/political/religion-debates/15419-quote.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 15419, 
  "discussion_files": [
   [
    "88.html", 
    "http://www.4forums.com/political/religion-debates/15419-quote-print.html"
   ], 
   [
    "89.html", 
    "http://www.4forums.com/political/religion-debates/15419-quote-6-print.html"
   ], 
   [
    "90.html", 
    "http://www.4forums.com/political/religion-debates/15419-quote-4-print.html"
   ], 
   [
    "91.html", 
    "http://www.4forums.com/political/religion-debates/15419-quote-5-print.html"
   ], 
   [
    "92.html", 
    "http://www.4forums.com/political/religion-debates/15419-quote-3-print.html"
   ], 
   [
    "93.html", 
    "http://www.4forums.com/political/religion-debates/15419-quote-2-print.html"
   ]
  ], 
  "identifier": 15419
 }
]