[
 [
  [
   432368, 
   null, 
   "Bennedict", 
   "An odd thing happened tonight. In Vancouver Canada, widely considered to be amongst the most peaceful places in the world, riots and fighting broke out. Even a car was lit on fire. The government had to deploy it's pathetic riot control which consists of nothing more than a guy named Blake dressed up in full motorcycle attire complete with crash helmet and armed with a water sprayer. That tactic may work on cats, but riotting Canadians? Maybe not.\n \n The reason? Vancouver lost the hockey game to Boston. My question is why the hell does it matter if one team loses a sporting event to another team? Why favour one group of athletes over another group simply depending on where the team is based? Why get so steamed up about a game that one ends up conducting what some would consider mild terrorism? I will never understand sports fandom. In the case of hockey, I'm not a fan, but I see nothing wrong with it. But at the same time, I hate it more than anything because of the absurdly obnoxious fans we have here in Canada. We should be chill like what our reputation would lead you to believe.\n \n Despite our clean bill of safety, this sort of thing happens more often than you think. We loves us some riots. A few years ago at the G8 summit in... Ottawa? or Toronto or somewhere? another car was lit on fire. Maybe we just like to light cars on fire. Maybe it's so cold up here we require it every once in a while.", 
   {
    "post_info": {
     "post_title": "Vancouver Riots"
    }
   }, 
   null, 
   null, 
   1308205980.0
  ], 
  [
   432381, 
   null, 
   "Xcaliber", 
   "Probably had more to do with the fact that Boston is an American based team and the Canadians hate to lose to America, especially in Hockey. I'm not a Hockey fan myself but I've been to a few games here, those fans are like rabid dogs on steroids compared to say baseball fans. I can imagine after the game some Boston fans rubbing it in and taunting the Canadians, so a Riot was inevitable . With all the problems we have in this world it's ignorant to get so worked up over a game, but oh well.. what can we do.", 
   {}, 
   432368, 
   null, 
   1308234660.0
  ], 
  [
   432394, 
   null, 
   "jitobear", 
   "All I can say is - what a sack of jackasses. No excuse for it and I hope everyone who participated ends up with hefty fines and long stint in the can. Destroying property and putting people in danger over a game? Really? I also hope their names are submitted to the NHL and they are never allowed to go to (another) hockey game in their life. \n \n I remember when the Twins won the World Series - people went crazy here, tipping over city buses and the like. There are times when a solid kick to the teeth is EXACTLY what is needed.", 
   {}, 
   432381, 
   null, 
   1308241140.0
  ], 
  [
   432403, 
   null, 
   "Bennedict", 
   "All I can say is - what a sack of jackasses. No excuse for it and I hope everyone who participated ends up with hefty fines and long stint in the can. Destroying property and putting people in danger over a game? Really? I also hope their names are submitted to the NHL and they are never allowed to go to (another) hockey game in their life. \n \n I remember when the Twins won the World Series - people went crazy here, tipping over city buses and the like. There are times when a solid kick to the teeth is EXACTLY what is needed.\n\n \n Definitely. Extreme sports terrorism would lead to 15 years in solitary confinement in Bennedict's universe.", 
   {}, 
   432394, 
   null, 
   1308251340.0
  ], 
  [
   432406, 
   null, 
   "Charlie_XT", 
   "Anything you'd like to add to the discussion, Simone? You've got a lot to say about America being a bad place, but now the discussion is about Canada and the people up there who take their sports really seriously.", 
   {}, 
   432403, 
   null, 
   1308252300.0
  ], 
  [
   432414, 
   null, 
   "sinjin", 
   "Mama, Don't Let Your Babies Grow Up To Be Sportsfans.", 
   {}, 
   432406, 
   null, 
   1308261540.0
  ], 
  [
   432415, 
   null, 
   "daewoo", 
   "Mama, Don't Let Your Babies Grow Up To Be Sportsfans.\n\n \n emoticon_xhohoemoticon_xhohoemoticon_xhoho", 
   {}, 
   432414, 
   null, 
   1308262080.0
  ], 
  [
   432416, 
   null, 
   "snakespit", 
   "In Philly, our fans rioted after the Phillies won the world series, the next year when they won the league championship, and then again when they lost the series. \n \n It's a simple formula of rowdy people in large groups fueled by too much alcohol. It's a shame that a proportionally small group of assclowns has to do stuff like this...but it doesn't surprise me when it happens.", 
   {}, 
   432415, 
   null, 
   1308263460.0
  ], 
  [
   432423, 
   null, 
   "Winston Smith", 
   "Do French Canadians behave the way the English Canadians in Vancouver behaved ?", 
   {}, 
   432416, 
   null, 
   1308273180.0
  ], 
  [
   432424, 
   null, 
   "Winston Smith", 
   "An odd thing happened tonight. In Vancouver Canada, widely considered to be amongst the most peaceful places in the world, riots and fighting broke out. Even a car was lit on fire. The government had to deploy it's pathetic riot control which consists of nothing more than a guy named Blake dressed up in full motorcycle attire complete with crash helmet and armed with a water sprayer. That tactic may work on cats, but riotting Canadians? Maybe not.\n \n The reason? Vancouver lost the hockey game to Boston. My question is why the hell does it matter if one team loses a sporting event to another team? Why favour one group of athletes over another group simply depending on where the team is based? Why get so steamed up about a game that one ends up conducting what some would consider mild terrorism? I will never understand sports fandom. In the case of hockey, I'm not a fan, but I see nothing wrong with it. But at the same time, I hate it more than anything because of the absurdly obnoxious fans we have here in Canada. We should be chill like what our reputation would lead you to believe.\n \n Despite our clean bill of safety, this sort of thing happens more often than you think. We loves us some riots. A few years ago at the G8 summit in... Ottawa? or Toronto or somewhere? another car was lit on fire. Maybe we just like to light cars on fire. Maybe it's so cold up here we require it every once in a while.\n\n \n It is a violent game, a stick is a weapon and the speed of the game (skating is fast) enhances its violent nature. There are movies which had focussed in the physically and mentally inherent violence of the game.\n \n So yes, the violence is transferred to the spectators and onto the streets.\n \n Sport fandom is akin to religious fanaticism or maybe not? Some call sports of this nature war by other means.", 
   {}, 
   432368, 
   null, 
   1308273720.0
  ], 
  [
   432440, 
   null, 
   "snakespit", 
   "It is a violent game, a stick is a weapon and the speed of the game (skating is fast) enhances its violent nature. There are movies which had focussed in the physically and mentally inherent violence of the game.\n \n So yes, the violence is transferred to the spectators and onto the streets.\n \n Sport fandom is akin to religious fanaticism or maybe not? Some call sports of this nature war by other means.\n\n \n That's a little dramatic, don't you think? It's just a game. Emotions may run high, but at the end of the day, it's still just a game. Even the players who moments before were smearing each other into the glass lined up to shake hands after the game. \n \n No \"violence\" is transferred to the spectators and onto the streets. Again...it's quite simple: mob mentality and too much alcohol. Soccer is not an inherently violent sport, yet I am willing to bet that soccer hooligans have caused far more damage than hockey fans. Same with baseball fans, people who go to concerts, and any other venue that attracts large groups of people. Hell, even universities erupt into violent riots every now and then, over apparently nothing. The common demoninator seems to be alcohol.", 
   {}, 
   432424, 
   null, 
   1308284880.0
  ], 
  [
   432453, 
   null, 
   "Winston Smith", 
   "the common element is tribalism. The Vancouver tribe lost, defeated in its own turf, hence: War !!\n \n nobody riots over a game of chess. The violent nature of the game of hockey excites the feelings of tribal savagery of the spectators. Ask any psychologist.", 
   {}, 
   432440, 
   null, 
   1308299040.0
  ], 
  [
   432469, 
   null, 
   "Charlie_XT", 
   "the common element is tribalism. The Vancouver tribe lost, defeated in its own turf, hence: War !!\n \n nobody riots over a game of chess. The violent nature of the game of hockey excites the feelings of tribal savagery of the spectators. Ask any psychologist.\n\n \n Then why doesn't watching war movies inspire the same? There's plenty of violence in them and there's a lot of people there to watch them in theaters with that massive surround sound and high definition.", 
   {}, 
   432453, 
   null, 
   1308321180.0
  ], 
  [
   432489, 
   null, 
   "Bennedict", 
   "That's a little dramatic, don't you think? It's just a game. Emotions may run high, but at the end of the day, it's still just a game. Even the players who moments before were smearing each other into the glass lined up to shake hands after the game. \n \n No \"violence\" is transferred to the spectators and onto the streets. Again...it's quite simple: mob mentality and too much alcohol. Soccer is not an inherently violent sport, yet I am willing to bet that soccer hooligans have caused far more damage than hockey fans. Same with baseball fans, people who go to concerts, and any other venue that attracts large groups of people. Hell, even universities erupt into violent riots every now and then, over apparently nothing. The common demoninator seems to be alcohol.\n\n \n That's a good point. Soccer (or football) in the UK seems to spark this kind of violence on a game to game basis, and there is no weapon in soccer other than the player's own body. A seemingly harmless sport evokes violence from the crowd, simply because of fandom.", 
   {}, 
   432440, 
   null, 
   1308352620.0
  ], 
  [
   432496, 
   null, 
   "Winston Smith", 
   "Then why doesn't watching war movies inspire the same? There's plenty of violence in them and there's a lot of people there to watch them in theaters with that massive surround sound and high definition.\n\n \n Simple: a movie is fiction, Sport is real and immediate. Most people can tell the difference.\n The tribal instinct of the spectators kicks in when two bunch of men fight for control of that thing they call the \"puck\".\n It is the same with football (soccer for you) a contact sports that produce acute bouts of tribalism during and after the game in the young males of the species. Tribalism is enhanced by alcohol.", 
   {}, 
   432469, 
   null, 
   1308360540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Vancouver Riots", 
  "url": "http://www.4forums.com/political/current-events-debates/15420-vancouver-riots.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 15420, 
  "discussion_files": [
   [
    "279.html", 
    "http://www.4forums.com/political/current-events-debates/15420-vancouver-riots-print.html"
   ]
  ], 
  "identifier": 15420
 }
]