[
 [
  [
   432998, 
   null, 
   "Doc Jones", 
   "Strategically-timed, Joyce Foundation-funded \"study\" conveniently links gun ownership and carrying a gun to heavy alcohol use\n \n Anti gun Joyce foundation buys pre-ordained results from willing \"researchers\".\n \n So called study already disproven to the chagrin of G. Winemute.", 
   {
    "post_info": {
     "post_title": "Buy a lie or pin the tail on the donkey"
    }
   }, 
   null, 
   null, 
   1308863760.0
  ], 
  [
   433008, 
   null, 
   "zsu2357", 
   "Strategically-timed, Joyce Foundation-funded \"study\" conveniently links gun ownership and carrying a gun to heavy alcohol use\n \n Anti gun Joyce foundation buys pre-ordained results from willing \"researchers\".\n \n So called study already disproven to the chagrin of G. Winemute.\n\n \n Oh wow that's almost as good as guns being linked to sexual arousal or what ever that garbage was.emoticon_smileemoticon_smile", 
   {}, 
   432998, 
   null, 
   1308891060.0
  ], 
  [
   433014, 
   null, 
   "Galileo", 
   "\"After adjustment for demographics and state of residence, firearm owners were more likely than those with no firearms at home to have &#8805;5 drinks on one occasion (OR 1.32; 95% CI 1.16 to 1.50), to drink and drive (OR 1.79; 95% CI 1.34 to 2.39) and to have &#8805;60 drinks per month (OR 1.45; 95% CI 1.14 to 1.83). Heavy alcohol use was most common among firearm owners who also engaged in behaviours such as carrying a firearm for protection against other people and keeping a firearm at home that was both loaded and not locked away. The author concludes that firearm ownership and specific firearm-related behaviours are associated with alcohol-related risk behaviours.\"\n British Medical Journal\n \n So people that are more willing to take risks with alcohol are also more willing to take risks with firearms. Is that surprising?", 
   {}, 
   433008, 
   null, 
   1308900540.0
  ], 
  [
   433023, 
   null, 
   "Charlie_XT", 
   "So people that are more willing to take risks with alcohol are also more willing to take risks with firearms. Is that surprising?\n\n \n What's surprising is just how you try and pass this off as a legitimate study.\n \n \nFor most people, it&#8217;s just common sense that it is never a good idea to consume alcoholic beverages to the point that one&#8217;s judgment and physical capabilities are impaired, particularly if one is going to operate a vehicle or other machine, such as a firearm.\n \n But for Garen Wintemute, the longtime gun control-advocacy junk researcher at the University of California at Davis, who promotes himself as &#8220;one of the world&#8217;s foremost experts on gun-related violence,&#8221; talking about alcohol and guns in the same breath is just another way to do what he most likes to do--expressing his feeling that guns and gun owners are inherently unsafe--and getting paid for doing it.\n \n His new &#8220;study,&#8221; published by Injury Prevention, pushes the idea that gun owners, particularly those who keep and carry firearms for protection, are more likely to drink heavily and often. Not surprisingly, it was paid for by the anti-gun Joyce Foundation, which has given $26 million to anti-gun groups and causes between 2003 and the present, and the California Wellness Foundation. And to make sure the money keeps coming in, Wintemute says &#8220;new and more comprehensive [funded] research is needed, since legislation authorizing the public carrying of loaded and concealed firearms has become almost universal in the United States.&#8221;\n \n There aren&#8217;t too many jobs in which you can get paid hundreds of thousands of dollars for doing not much more than punching the time clock and making sure the boss knows about it. But Wintemute&#8217;s sugar daddies and mommas at the anti-gun foundations don&#8217;t seem to care. Wintemute even admits the limitations of his latest diatribe.\n \n For starters, Wintemute&#8217;s poll depends on the truthfulness of the poll&#8217;s respondents. Undoubtedly and understandably, habitual drunkenness is viewed with disrespect in our society, and some people won&#8217;t admit such behavior to a stranger conducting a telephone poll. Similarly, people may be unwilling to admit gun ownership to strangers, to protect themselves against being burglarized or placed on gun owner registration lists. It&#8217;s not mere coincidence that national polls began showing a significant decline in gun ownership in the early 1990s, as the Clinton Administration&#8217;s multi-faceted campaign against the right to arms took shape.\n \n Also, the eight states Wintemute used for his study were self-selecting on a basis he does not disclose. Polls suffering from this limitation are referred to as &#8220;SLOP,&#8221; for &#8220;self-selecting opinion poll,&#8221; because the self-selection process can inject bias into poll question responses and severely skew the poll&#8217;s findings.\n \n Wintemute&#8217;s study doesn&#8217;t even try to determine whether there is any greater incidence of mishaps or misconduct, firearm-related or not, among gun owners who consume alcohol. But that might be for good reason. After all, as Right-to-Carry laws have become &#8220;almost universal,&#8221; the nation&#8217;s murder rate has fallen to a 47-year low. Maybe Wintemute understands the meaning of the old axiom, &#8220;if you don&#8217;t want the answer, don&#8217;t ask the question.&#8221;\n\n \n I believe that qualifies as checkmate.", 
   {}, 
   433014, 
   null, 
   1308925800.0
  ], 
  [
   433024, 
   null, 
   "Doc Jones", 
   "Winne Mute knows full well that the acceptance of the inalienable right, just like his \"freedom of speech\" are equal and such acceptance as intended by our FF DECRIMINALIZES both civil and criminal use of that right.\n \n The right to keep and bear arms must come under strict scrutiny and not some misleading and hap hazard \"study\" which is little more than intended theorizing carefully constructed to avoid any symbalance of facts but emphasis is placed on the author's own opinion without any regard to the status of the BOR, free speech and indeed the inclusion of the 2A into the XIVth amendment.\n \n By this avoidance and rock throwing tantrum he attempts to introduce his liberal leftist aspersion in a unique way to avoid a criminal construct induced by his \"free speech\" in an attack on an equally protected right to keep and bear arms. Gun owners enjoy the full enjoyment of protection as does the first amendment which he attempts to carefully avoid in his wild claims.\n \n Perhaps he was 'legally' drunk during most of his railing against a right freely stated in the BOR and XIVth amendment? Irony much? emoticon_xbouncer", 
   {}, 
   433023, 
   null, 
   1308927060.0
  ], 
  [
   433034, 
   null, 
   "Doc Jones", 
   "\"After adjustment for demographics and state of residence, firearm owners were more likely than those with no firearms at home to have &#8805;5 drinks on one occasion (OR 1.32; 95% CI 1.16 to 1.50), to drink and drive (OR 1.79; 95% CI 1.34 to 2.39) and to have &#8805;60 drinks per month (OR 1.45; 95% CI 1.14 to 1.83). Heavy alcohol use was most common among firearm owners who also engaged in behaviours such as carrying a firearm for protection against other people and keeping a firearm at home that was both loaded and not locked away. The author concludes that firearm ownership and specific firearm-related behaviours are associated with alcohol-related risk behaviours.\"\n British Medical Journal\n \n So people that are more willing to take risks with alcohol are also more willing to take risks with firearms. Is that surprising?\n\n \n Well now, that ought to offend all the LEOs who:\n \nalso engaged in behaviours such as carrying a firearm for protection against other people and keeping a firearm at home that was both loaded and not locked away. The author concludes that firearm ownership and specific firearm-related behaviours are associated with alcohol-related risk behaviours.\"\n \n Is that surprising?", 
   {}, 
   433014, 
   null, 
   1308939540.0
  ], 
  [
   433120, 
   null, 
   "Doc Jones", 
   "\"After adjustment for demographics and state of residence, firearm owners were more likely than those with no firearms at home to have &#8805;5 drinks on one occasion (OR 1.32; 95% CI 1.16 to 1.50), to drink and drive (OR 1.79; 95% CI 1.34 to 2.39) and to have &#8805;60 drinks per month (OR 1.45; 95% CI 1.14 to 1.83). Heavy alcohol use was most common among firearm owners who also engaged in behaviours such as carrying a firearm for protection against other people and keeping a firearm at home that was both loaded and not locked away. The author concludes that firearm ownership and specific firearm-related behaviours are associated with alcohol-related risk behaviours.\"\n British Medical Journal\n \n So people that are more willing to take risks with alcohol are also more willing to take risks with firearms. Is that surprising?\n\n \n Evidently, ...star gazer, Helmke didn't find this information helpful and QUIT...abandoned ship...50% of brady legal counsel gone now. I imagine \n finally saw the light and wanted to get paid but the dwindling membership \n couldn't afford him. Now, that leaves Henigan in a lonely job as the ATF is still stuck with Melson who refuses to fall on the sword alone :)\n HAPPY DAYS ARE HERE AGAIN emoticon_xhoho emoticon_xgood\n \n Next call is disbanding the BATF(E).", 
   {}, 
   433014, 
   null, 
   1309009740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Buy a lie or pin the tail on the donkey", 
  "url": "http://www.4forums.com/political/gun-control-debates/15437-buy-lie-pin-tail-donkey.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 15437, 
  "discussion_files": [
   [
    "202.html", 
    "http://www.4forums.com/political/gun-control-debates/15437-buy-lie-pin-tail-donkey-print.html"
   ]
  ], 
  "identifier": 15437
 }
]