[
 [
  [
   30581, 
   null, 
   "rapture", 
   "Does the thought of robots created in the image of humans scare you just a bit? \n \n Is it possible for robots to become intelligent? Capable of thinking and making decisions?\n \n \n Or capable of\"choosing\"between evil or good?\n \n Could robots become Self sufficent and reproductive? \n \n \n  Or is it just Hollywood messing with our emotions?\n \n \n I personally believe, robots is essentially the best tool for deep space exploration. \n \n \n Machines have been cash registers, coffee makers, and vibrators for long enough-", 
   {
    "post_info": {
     "post_title": "In the Image of men?"
    }
   }, 
   null, 
   null, 
   1073615040.0
  ], 
  [
   31181, 
   null, 
   "Hiberpirates", 
   "I do not think that we are 'meant' to explore space.\n Since we are, we should do it by sending MAN to space, not in a cowardly way as robots. emoticon_mad", 
   {}, 
   30581, 
   null, 
   1074095700.0
  ], 
  [
   31199, 
   null, 
   "AMD4EVER", 
   "Actually I fear the fact that we will soon create robots as smart as humans for many different reasons. First off after we create them we will probably give them many of the jobs humans currently have and cause our economy to both become extremely productive while leaving millions of people in poverty. Our supply will increase and our demand will fall as the unemployed look for work leaving our economy in a tail spin. It simply isn't feasible to have a robot workforce even though in the future it is probably going to have to occur eventually. A possible answer to this may end up being humans will have to be genetically altered in order to keep up with the robots. Perhaps we find a way to make humans smarter than the AI as well as more efficient but eventually this makes us slaves to our own technology and as our technology increases we are made into something that is nothing more than a competitive product to our robot AI's.\n \n My paranoia runs rampant in this field as I really don't have a clue what will actually happen when robots are capable of exceeding us in everyway.", 
   {}, 
   31181, 
   null, 
   1074103440.0
  ], 
  [
   31281, 
   null, 
   "rapture", 
   "=Hiberpirates]I do not think that we are 'meant' to explore space.\n\n \n \n Why?\n \n \n \n \nSince we are, we should do it by sending MAN to space, not in a cowardly way as robots. emoticon_mad\n\n \n I don't think humans should not be involved, yet, boy's should send their toy's before themselves", 
   {}, 
   31181, 
   null, 
   1074136380.0
  ], 
  [
   31282, 
   null, 
   "rapture", 
   "=AMD4EVER]Actually I fear the fact that we will soon create robots as smart as humans for many different reasons. First off after we create them we will probably give them many of the jobs humans currently have and cause our economy to both become extremely productive while leaving millions of people in poverty. Our supply will increase and our demand will fall as the unemployed look for work leaving our economy in a tail spin.\n \n \n \n Yet, I don't think we can make robots think( only humans)\n \n \n \n It simply isn't feasible to have a robot workforce even though in the future it is probably going to have to occur eventually. \n \n \n \n Perhaps.....\n \n \n \n \n \n \n A possible answer to this may end up being humans will have to be genetically altered in order to keep up with the robots. Perhaps we find a way to make humans smarter than the AI as well as more efficient but eventually this makes us slaves to our own technology and as our technology increases we are made into something that is nothing more than a competitive product to our robot AI's.\n \n \n \n Humans vs Robots\n \n \n My paranoia runs rampant in this field as I really don't have a clue what will actually happen when robots are capable of exceeding us in everyway.\n\n \n I see( just blast them out in space)", 
   {}, 
   31199, 
   null, 
   1074136920.0
  ], 
  [
   31288, 
   null, 
   "Void", 
   "Is it possible for robots to become intelligent? Capable of thinking and making decisions?\n \n From the pace of progress it will not happen in the next 20 years, but it will happen this century. I would bet money on it I am so sure.", 
   {}, 
   31282, 
   null, 
   1074138120.0
  ], 
  [
   31298, 
   null, 
   "AMD4EVER", 
   "Yet, I don't think we can make robots think( only humans)\n\n \n Of course we can make robots think. It is just a matter of time before we make them smarter than us.\n \n \nHumans vs Robots\n \n I see( just blast them out in space)\n\n \n I'm not in the least bit worried about a Humans vs Robot war. Humans will control the robots, there is no question about that. My fear is that robots will take many of the roles of society that humans currently have which in turn will increase the supplies of our society because of excessive efficiency while decreasing the demand because of the people who are being made unemployed. This in turn will cause a collapse of our economy. Our efficiency and technology are leading us towards an economic collapse as far as I can tell but perhaps I'm just too uninformed.", 
   {}, 
   31282, 
   null, 
   1074145320.0
  ], 
  [
   31323, 
   null, 
   "Hiberpirates", 
   "[QUOTE=rapture]Why?\n \n \n I it just a feeling. I don't know why.\n \n But in the case of sending toys before boys, just suposidly we encountered a new alien species (as intelligent as us), their judgments of us would be rushed, as we as humans are quick to jump to conclusions. They probably would feel intimidated that humans would send robots (robots= warlike perception). It would be an unfriendly gesture to send robots, in my view.\n \n Sure it would take the safety risk away from man in space. But danger is what you have to put yourself through to explore, ie Colombus, Cook, etc.", 
   {}, 
   31281, 
   null, 
   1074174780.0
  ], 
  [
   31661, 
   null, 
   "rapture", 
   " it just a feeling. I don't know why.\n\n \n Fear of....( natural feeling, but your going to see it anyway- got to croak\n \n \nBut in the case of sending toys before boys, just suposidly we encountered a new alien species (as intelligent as us), their judgments of us would be rushed, as we as humans are quick to jump to conclusions.\n\n \n \n I don't know if that should be classified with intelligence, perhaps, we screen this out of the robots\n \n \n \n \n They probably would feel intimidated that humans would send robots (robots= warlike perceptionp).\n\n \n Would not be far from the truth?\n \n \n It would be an unfriendly gesture to send robots, in my view.\n \n Sure it would take the safety risk away from man in space. But danger is what you have to put yourself through to explore, ie Colombus, Cook, etc.\n\n \n Robots should be thought of as a tool/or aid for deep space exploration", 
   {}, 
   31323, 
   null, 
   1074402120.0
  ], 
  [
   31663, 
   null, 
   "rapture", 
   "I'm not in the least bit worried about a Humans vs Robot war. Humans will control the robots, there is no question about that.\n Of course we can make robots think. It is just a matter of time before we make them smarter than us.\n\n \n \n Or could robots make themselves smarter than us?\n \n \n \n \n \n My fear is that robots will take many of the roles of society that humans currently have which in turn will increase the supplies of our society because of excessive efficiency while decreasing the demand because of the people who are being made unemployed. This in turn will cause a collapse of our economy. Our efficiency and technology are leading us towards an economic collapse as far as I can tell but perhaps I'm just too uninformed.\n\n \n \n Jobs...perhaps they can be our slaves until they start demanding rights.....", 
   {}, 
   31298, 
   null, 
   1074403260.0
  ], 
  [
   38147, 
   null, 
   "Tastyfish", 
   "Self awareness isn't nessesary for many of the tasks you want them to do, far more interesting would be the ability to copy people digitally (possibly by having a chip that intergrates itself with your brain and then slowly takes over more function as connections become more likely to form through the faster and larger chip- will be working in exactly the same way as your mind works for storing information but might be possible to then copy the patten to a computer), would be able to live at a much faster rate and for a lot longer. The fate of the rest of humanity is debatable once we can start to become 'post-human', but do we really owe any loyality to organic molecules? Though they would probably be in the computers. Would it really matter if everyone transferred over. Seems a much better way to do space travel if you have to- send a robot that is a whole community rather than a dumb probe or a machine designed to keep a whole load of poor adapted brain survival devices in a now much more complex and massive ship.", 
   {}, 
   31663, 
   null, 
   1078448940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  In the Image of men?", 
  "url": "http://www.4forums.com/political/science-math-debates/1545-image-men.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 1545, 
  "discussion_files": [
   [
    "6151.html", 
    "http://www.4forums.com/political/science-math-debates/1545-image-men-print.html"
   ]
  ], 
  "identifier": 1545
 }
]