[
 [
  [
   433463, 
   null, 
   "charleslb", 
   "Well, the ole Fourth of July is coming up, and it's of course another holiday that serves as a special occasion to give the hoodwinkable hoi polloi, the manipulable multitudes, the mass media-programmed populace another dose and booster shot of indoctrination with our society's conventional version and view of history. This is of course a part of a larger strategy that all societies practice to preserve their socioeconomic power structure, i.e. the promotion of a worldview that accommodates and rationalizes and justifies it. Yep, every power structure needs to imprint the mind of the common man with the uncritical belief that it's legitimate and natural, not even to be questioned let alone challenged. \n \n Now then, in our \"democratic\" and non-authoritarian society this strategy of ideologically inoculating the people against dissent and subversion, and in favor of resigned, apathetic acceptance of the powers that be, this strategy of collective socio-cultural brainwashing is quite decentralized and subtle. That is, it doesn't take the form of overt propaganda churned out from some central ministry of misinformation. No, instead it takes the seemingly more benign form of the power structure's take on reality constantly being fed into our unsuspecting brains by everything from the news media to the popular entertainment industry to our public schools, and yes, even our public holidays, such as the nation's birthday, the Fourth.\n \n Yes, the conventional, consensus version of that little episode in American history called the War of Independence and the birth of the nation is really just ideology, just a revision of historical reality designed to affirm and support the legitimacy of our system of society and its politico-economic pecking order. So then, the obvious question that puts itself here is what about the facts and truth of this country's \"revolution\", what pray tell might those facts and truth be?\n \n First of all, from a critical perspective, from a \"hermeneutics of suspicion\" point of view, the reality of America's struggle to separate from Great Britain had little at all to do with the yearning of the man on the street to be free! Sure, it's always possible to persuade the man on the street that the yearnings, goals, and interests at stake are his own, and thereby motivate him to fight and bleed in the wars of the ruling elite, but come now, how often are the goals and interests of the man on the street really & truly what our wars are fought for?\n \n Alas no, the American Revolutionary War was no noble exception to the realpolitik and realeconomik rule that wars are virtually always fought to benefit the elite members of society - a rule that of course we find to still be very much in effect today in the case of this country's corporate greed-driven wars in Iraq and Afghanistan. Quite simply, this nation's much idealized and mythologized \"Founding Fathers\" launched their people into a war, a bloody conflict with their mother country to cut the royal apron strings and set themselves up as the highest political echelon of American society. \n \n They, the George Wahingtons and Thomas Jeffersons and John Adamses of the thirteen colonies were of course already the upper crust and establishment of the land, but in the larger context of the British Empire they were a second-tier upper crust functioning as vassals of the Crown and kowtowing to the likes of ole King George III. Well, they felt that their britches were plenty bigger than this, and they wished to grow into them. In other words, they dreamt the dream of being the real power in their own independent country, and set about making this self-aggrandizing dream come true. \n \n As for their vaunted democratic ideals, you know, the ideals that they claimed to be fighting for, well, every movement needs its ideals to inspire its followers, doesn't it? The philosophy of democracy was merely in the right place at the right time, as it were. That is, democracy was the avant-garde zeitgeist and political gospel coming out of the French Enlightenment, and all the OGs of the American Revolution were of course educated men who had imbibed some of its shibboleths and slogans. It was only natural then that they would drape the revolutionary mantle of democracy over the underlying self-interest driving their insurrectionary movement for independence. \n \n To put it bluntly, democracy became the lofty and glorious vehicle for the selfish political ambitions of the big names of the Revolution. The same thing would later happen in the case of the French Revolution. There the new, on-the-rise bourgeois class would use the popular spirit of democracy and revolution to overthrow the ancien régime, i.e. the rule of the old-line aristocracy, and to install themselves as the new establishment. \n \n Mm-hmm, America's own bourgeoisie, consisting of the provincial leaders who administered the colonies' governmental and economic structure on behalf of the imperial British bureaucracy wanted to come into their own every bit as much as their French counterparts. And, just like their French counterparts would later do in the Revolution of 1789, the colonial American business & burgher class realized that the rallying cry of representative government was their ticket - a ticket they could use to ride their way to ascendency in the political and economic life of their society. \n \n These businessmen and burghers, plantation owners and lawyers, who pushed for American independence were certainly not idealists with an authentic and deep faith in the common man and in egalitarian democracy. Rather, they were of an elitist and worldly-wise salon set who looked down their upturned noses on the lower orders, who considered the masses to be as*es, that sort of thing. They actually never intended to create a form of body politic in which there would be much direct and true democracy, for they held to the classist view that they were \"the best people\", best qualified to run the public's affairs. We the people, on the other hand, were regarded to be decidedly unfit to manage political matters on our own, i.e. we supposedly require the benevolent direction of a dominant gentry. \n \n In point of radically but reliably revisionist historical fact, when the former leaders of the Revolution colluded together in Philadelphia in 1787 to design their now independent country's system of government, the structure they devised was one that was consciously meant to have only enough real-deal democracy built into it to prevent any individual or faction from erecting a dictatorship that would edge the rest of the power elite out of power. However, the founders of the American nation were quite keen to not take democracy so far as to enfranchise ordinary laboring and unpropertied people. The idea was not to create a society in which the rank & file citizenry would genuinely govern themselves, but rather to construct a patricianly order and polity in which the gentleman class, men of property and wealth, would be guaranteed a permanent firm hold on the reins of real power.\n \n This was always the vision for their society harbored by the likes of establishmentarians such as Hamilton, Madison, and Morris. A vision that they actualized and codified in the United States Constitution, a document that enshrined a republic of the higher bourgeoisie, of the moneyed noblesse who would be the custodians of governmental power and play shepherd to the sheep-like plebeians. And, oh yeah, I seem to recall that the new sociopolitical order constituted by the Constitution accommodated the evil institution of slavery, another teeny factoid that rudely flies in the face of democracy and the naïve image of the Revolution's ringleaders as \"freedom fighters\". \n \n Sorry then, but securing the liberty of all the people was hardly the true and driving motive of the American Revolutionary War. It was more of an instinctive motivational maneuver to galvanize popular support than a genuine motive. Sadly, the myth reconsecrated and reinforced every Fourth of July, the myth of enlightened exponents and progressive paladins of democracy taking up the noble crusade for the rights and freedom of man is just that, a venerable mythic motif. \n \n Certainly, just as with theological fables, our public holidays perform the function of hallowing and imparting the lore of this nation's \"civil religion\", of the belief system that acculturates Americans to their national identity, and to a patriotic acceptance of the underlyingly plutocratic politico-economic hierarchy of their society. This country's Independence Day is of course the secular High Holy Day on the U.S. calendar, the mother of all three day weekends for ritually-festively observing the romanticized, storied, mythopoetic narrative of American history and politics. \n \n The unworthy-of-legend truth of the American Revolution, however, is that it was little more than a bourgeois power play whose political-historical legacy has been the structural, if unofficial, sovereignty not of the people, but of men of commerce and finance and capital. Not a bona fide democracy, but a \"benevolent\" dictatorship of the capitalist plutotariat, this is the sham system that the main characters of our society's creation story have saddled us with, what quaint old Ben Franklin, valiant Georgie Porgie Washington, and the sage of Monticello, and company, have deformed the beautiful ideal of self-government into. \n \n When we observe the Fourth of July, in our own small way we perpetuate a gullible faith in the mythic big lie that the heroes of the Revolution did something more than establish a constitutional businessocracy, that they were heaven-sent patriarchs of the land of the free and the home of the brave, bestowing the blessings of \"government of the people, by the people, and for the people\". Until we cease to cooperate with such smarmy historical flimflam, until we begin to choose hard facts over pious fictions, until we stoutly reject the sanctified premises of our catechistic holidays, we'll remain deeply and vulnerably stuck in the undemocratic cycles set in motion by the founding frauds of our system, undemocratic cycles of being manipulated, screwed, and increasingly peonized by a ruling class that officially doesn't exist.\n \n :)", 
   {
    "post_info": {
     "post_title": "A Critical Look at the Fourth of July"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1309393080.0
  ], 
  [
   433598, 
   null, 
   "Freedom", 
   "No, instead it takes the seemingly more benign form of the power structure's take on reality constantly being fed into our unsuspecting brains by everything from the news media to the popular entertainment industry to our public schools, and yes, even our public holidays, such as the nation's birthday, the Fourth.\n\n In other words the countries culture.\n \n \nFirst of all, from a critical perspective, from a \"hermeneutics of suspicion\" point of view, the reality of America's struggle to separate from Great Britain had little at all to do with the yearning of the man on the street to be free! Sure, it's always possible to persuade the man on the street that the yearnings, goals, and interests at stake are his own, and thereby motivate him to fight and bleed in the wars of the ruling elite, \n\n You're right it wasn't to free just men on the street, men move from streets to houses, to fields to forest; it just wouldn't do at all to try to free them based on a location. So the silly revolutionaries tried to free everyone in the 13 colonies from great britain.\n \n \nbut come now, how often are the goals and interests of the man on the street really & truly what our wars are fought for?\n\n More often than people would like to admit. And certainly all revolutions, including the American, french, Russian, and Nazi ones.\n \n \nAlas no, the American Revolutionary War was no noble exception to the realpolitik and realeconomik rule that wars are virtually always fought to benefit the elite members of society - a rule that of course we find to still be very much in effect today in the case of this country's corporate greed-driven wars in Iraq and Afghanistan. Quite simply, this nation's much idealized and mythologized \"Founding Fathers\" launched their people into a war, a bloody conflict with their mother country to cut the royal apron strings and set themselves up as the highest political echelon of American society.\n \n Any evidence for this conspiracy theory or are the rest of us fools for believing what these people wrote and what the American people did?\n \n \nThey, the George Wahingtons and Thomas Jeffersons and John Adamses of the thirteen colonies were of course already the upper crust and establishment of the land, but in the larger context of the British Empire they were a second-tier upper crust functioning as vassals of the Crown and kowtowing to the likes of ole King George III. Well, they felt that their britches were plenty bigger than this, and they wished to grow into them. In other words, they dreamt the dream of being the real power in their own independent country, and set about making this self-aggrandizing dream come true.\n \n In which they get to endure at best four years of psuedo-dictatorship before the 'guy on the street' could throw them out? If Washington wanted kingship, he could have taken it like Napoleon did. I can just see Adam's evil plans working out for him as he sit's in London trying to talk to people who will never listen, I mean we all know that's where he wanted to end up right? In the back of his mind when he signed on eh?.\n \n \nAs for their vaunted democratic ideals, you know, the ideals that they claimed to be fighting for, well, every movement needs its ideals to inspire its followers, doesn't it? The philosophy of democracy was merely in the right place at the right time, as it were. That is, democracy was the avant-garde zeitgeist and political gospel coming out of the French Enlightenment, and all the OGs of the American Revolution were of course educated men who had imbibed some of its shibboleths and slogans. It was only natural then that they would drape the revolutionary mantle of democracy over the underlying self-interest driving their insurrectionary movement for independence. \n\n rofl, yes it was self-interest; they wanted to be free of Britain too.\n \n \nMm-hmm, America's own bourgeoisie, consisting of the provincial leaders who administered the colonies' governmental and economic structure on behalf of the imperial British bureaucracy wanted to come into their own every bit as much as their French counterparts. And, just like their French counterparts would later do in the Revolution of 1789, the colonial American business & burgher class realized that the rallying cry of representative government was their ticket - a ticket they could use to ride their way to ascendency in the political and economic life of their society.\n\n You're just crazy, do you have any evidence of this dastardly capitalist plot?\n \n \nThese businessmen and burghers, plantation owners and lawyers, who pushed for American independence were certainly not idealists with an authentic and deep faith in the common man and in egalitarian democracy. Rather, they were of an elitist and worldly-wise salon set who looked down their upturned noses on the lower orders, who considered the masses to be as*es, that sort of thing.\n\n Delusions.\n \n \nThey actually never intended to create a form of body politic in which there would be much direct and true democracy, for they held to the classist view that they were \"the best people\", best qualified to run the public's affairs.\n\n Best to be decided by public vote, if you are complaining about direct democracy it's called a republic and it's been necessary until just recently.\n \n \nWe the people, on the other hand, were regarded to be decidedly unfit to manage political matters on our own, i.e. we supposedly require the benevolent direction of a dominant gentry. \n\n We the people? How can anyone claim that title? We you become a multi-being tell me. Until then I grant you only the right to direct your own actions. You want to put your life into the hands of nobles go find some.\n \n \nIn point of radically but reliably revisionist historical fact, when the former leaders of the Revolution colluded together in Philadelphia in 1787 to design their now independent country's system of government, the structure they devised was one that was consciously meant to have only enough real-deal democracy built into it to prevent any individual or faction from erecting a dictatorship that would edge the rest of the power elite out of power. However, the founders of the American nation were quite keen to not take democracy so far as to enfranchise ordinary laboring and unpropertied people.\n\n What were 'ordinary laboring and unpropertied people' owed?\n \n \nThe idea was not to create a society in which the rank & file citizenry would genuinely govern themselves, but rather to construct a patricianly order and polity in which the gentleman class, men of property and wealth, would be guaranteed a permanent firm hold on the reins of real power.\n\n Yet I'm sure any attempt to protect absolutely the rights of man would be blocked by you and people like you. You don't want the idea of 'real power' to be taken away because you want it for your own mob.\n \n \nThis was always the vision for their society harbored by the likes of establishmentarians such as Hamilton, Madison, and Morris. A vision that they actualized and codified in the United States Constitution, a document that enshrined a republic of the higher bourgeoisie, of the moneyed noblesse who would be the custodians of governmental power and play shepherd to the sheep-like plebeians.\n\n Enshrined where? \n \n \nSorry then, but securing the liberty of all the people was hardly the true and driving motive of the American Revolutionary War. It was more of an instinctive motivational maneuver to galvanize popular support than a genuine motive. Sadly, the myth reconsecrated and reinforced every Fourth of July, the myth of enlightened exponents and progressive paladins of democracy taking up the noble crusade for the rights and freedom of man is just that, a venerable mythic motif. \n\n All that is supported by the evidence is myth while your conspiracy theory should be accepted.... why?\n \n \nWhen we observe the Fourth of July, in our own small way we perpetuate a gullible faith in the mythic big lie that the heroes of the Revolution did something more than establish a constitutional businessocracy, that they were heaven-sent patriarchs of the land of the free and the home of the brave, bestowing the blessings of \"government of the people, by the people, and for the people\". Until we cease to cooperate with such smarmy historical flimflam, until we begin to choose hard facts over pious fictions, until we stoutly reject the sanctified premises of our catechistic holidays, we'll remain deeply and vulnerably stuck in the undemocratic cycles set in motion by the founding frauds of our system, undemocratic cycles of being manipulated, screwed, and increasingly peonized by a ruling class that officially doesn't exist.\n\n The hard fact is that the people in the revolution were fighting for freedom, including the rich ones. Please look up Occam's razor.\n \n businesses are not mentioned in the constitution. What are mentioned are taxes, an affront the the liberties of every human being. If there was any failing in the writing of the constitution it was failure to be even more radically against people like you.\n \n Why do I bother, you're not going to respond to this I'm sure.", 
   {
    "unicode_changes_made": true
   }, 
   433463, 
   null, 
   1309596000.0
  ], 
  [
   433605, 
   null, 
   "Xcaliber", 
   "Makes me wonder what it would be like today if The Parliament had not passed the Stamp Act, or if they had allowed the \" Englishmen\" in the 13 colonies to send representatives to Parliament . \n \n This was almost like reading from the Bible.. Some Historical references surrounded by a lot of myth and fairy tale, with a twist of humor. Now that I know I've been brainwashed I am better prepared to defend myself against the tyranny of Freedom.", 
   {}, 
   433598, 
   null, 
   1309619460.0
  ], 
  [
   433606, 
   null, 
   "Steeeeve", 
   "In other news, I saw a hummingbird this morning.", 
   {}, 
   433605, 
   null, 
   1309623960.0
  ], 
  [
   433614, 
   null, 
   "Freedom", 
   "Makes me wonder what it would be like today if The Parliament had not passed the Stamp Act, or if they had allowed the \" Englishmen\" in the 13 colonies to send representatives to Parliament . \n \n\n Possibly very different. Britain may have grown more powerful than it's European rivals by far; I don't think France would have a revolution or if they did it would be much weaker. Over all the world would probably be more feudalistic than it is now, but that would probably also serve to crush any revolutionary spirits in Europe so there may not have ever been a USSR or Nazi Germany.", 
   {}, 
   433605, 
   null, 
   1309628100.0
  ], 
  [
   433615, 
   null, 
   "Xcaliber", 
   "Possibly very different. Britain may have grown more powerful than it's European rivals by far; I don't think France would have a revolution or if they did it would be much weaker. Over all the world would probably be more feudalistic than it is now, but that would probably also serve to crush any revolutionary spirits in Europe so there may not have ever been a USSR or Nazi Germany.\n\n \n Damn Stamp Act...", 
   {}, 
   433614, 
   null, 
   1309628400.0
  ], 
  [
   433676, 
   null, 
   "Xenamnes", 
   "Makes me wonder what it would be like today if The Parliament had not passed the Stamp Act, or if they had allowed the \" Englishmen\" in the 13 colonies to send representatives to Parliament.\n\n \n The Stamp Act of 1765 was repealed in 1766 and later replaced with the Declaratory Act. Britain went from trying to tax printed matter such as newspapers and playing cards, to trying to bind the colonies of America to the authority of the parliament in Britain.", 
   {}, 
   433605, 
   null, 
   1309709160.0
  ], 
  [
   433678, 
   null, 
   "Xcaliber", 
   "The Stamp Act of 1765 was repealed in 1766 and later replaced with the Declaratory Act. Britain went from trying to tax printed matter such as newspapers and playing cards, to trying to bind the colonies of America to the authority of the parliament in Britain.\n\n \n Yeah I knew that, the point was it was the passage of the Stamp Act that sparked the Revolution in the Americas. If Britain had never tried to over tax without allowing representation the war may have never happened or might have happened later. \n \n Mostly I was poking fun at the original post though.. emoticon_xangel", 
   {}, 
   433676, 
   null, 
   1309709580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A Critical Look at the Fourth of July", 
  "url": "http://www.4forums.com/political/current-events-debates/15455-critical-look-fourth-july.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 15455, 
  "discussion_files": [
   [
    "280.html", 
    "http://www.4forums.com/political/current-events-debates/15455-critical-look-fourth-july-print.html"
   ]
  ], 
  "identifier": 15455
 }
]