[
 [
  [
   433893, 
   null, 
   "simone", 
   "Arizona utterly worships guns and other strange gods and the True Creator may have decided to destroy Arizona through the agency of the worst wildfire in Arizona's history and a huge and historic dust storm and other natural disasters. Arizonans have been brought to believe that they can get a free ride without paying their fair share in taxes, that they can sell off all of the valuable things held in common by the people, the one good thing they brought about, clean and publicly financed elections, has been destroyed by the five devils on the U.S. Supreme Court.\n \n Innocents have been murdered and harmed because the followers of Satan in Arizona want everyone to be armed with six or seven guns and endless rounds of ammunition. Arizonans are so tight with Satan that they refuse to limit the murderous potential of guns in any way, refusing to limit how many shots a gun can fire when reloaded.\n \n A hundred rounds or more to fire off in murderous abandon? Not enough for these children of Satan. Satan loves guns. And the murder of innocents.", 
   {
    "post_info": {
     "post_title": "God's Wrath Visited Upon Arizona"
    }
   }, 
   null, 
   null, 
   1309989420.0
  ], 
  [
   433907, 
   null, 
   "Xcaliber", 
   "What does this have to do with religion?.. other than the fact that God doesn't exist in the real world And therefore Satan doesn't exist either.. This is a desperate ploy to spill some anti Gun rhetoric on the forum without actually taking it to the Gun Debate Forum... \n \n Arizona is no different from the rest of the world..", 
   {}, 
   433893, 
   null, 
   1309999200.0
  ], 
  [
   433912, 
   null, 
   "Xenamnes", 
   "I would be very interested in finding out what this rant on guns has to do with religion. Perhaps you can show us the historical accounts of civilizations during biblical times that were smote off the face of the Earth because they possessed weapons.\n \n You make a complicated attempt at spinning insanity into something that is coherent, yet you fail miserably in that attempt. There is no evidence that guns have any connection to either God or Satan. By the logic you use the state of Alaska should have suffered massive earthquakes and a volcanic eruption by now not only due to their lack of draconian gun laws, but also because of their connection to Sarah Palin. The number of natural disasters constantly befalling the state of California also suggests otherwise; they have very restrictive gun laws and yet they have wildfires almost annually, while other times they have flooding and earthquakes.\n \n Truth doesn't seem to be something you have any interest in. Rather you seem to want attention and for people to pay attention to you.\n \n You mention an arbitrarily selected number of guns and rounds of ammunition as if the amount makes any difference. I'll save time and cut to the chase by pointing out that the numbers make no difference in the matter.\n \n You talk about the \"murderous potential of guns\" but this completely misses a very basic point; guns are deadly in nature and have been from the very beginning. There is no way to make them anything else but deadly, just as poison cannot be made non-deadly in nature or design. Nor should any such attempt be made for it might inspire people to be stupid on purpose and result in killing either themselves or others.\n \n And then we come back to your continued reference to Satan, how Satan supposedly loves the murder of the innocent. If they truly are innocent then they would go to Heaven and Satan won't be able to claim them. The only people Satan would be able to claim would be those that commit murder in the first place.\n \n However this isn't a true discussion about religion even though you might claim otherwise. This is a misplaced assault against constitutional rights and a clear display of your intolerance for others. The actions of Jared Loughner are not the works of Satan or anyone else other than him and him alone.", 
   {}, 
   433907, 
   null, 
   1310003340.0
  ], 
  [
   434020, 
   null, 
   "simone", 
   "I take issue with the actions of a mass of very religious people who worship guns and made it possible for a nutcase like Jared Loughner to walk into a Wal-mart and walk out with a gun and rounds of ammunition as easily as if he had made a purchase of chewing gum.\n \n Please explain to me how and why it was so easy for Loughner to accomplish that and why so many people want things to be exactly like that. There are far too many people who cannot bear the slightest restriction on the ownership and use of guns.\n \n People like that are agents of Satan -- be there a Satan or not.\n \n I use the concept of Satan as an icon of absolute evil.", 
   {}, 
   433912, 
   null, 
   1310150040.0
  ], 
  [
   434023, 
   null, 
   "Xcaliber", 
   "I take issue with the actions of a mass of very religious people who worship guns and made it possible for a nutcase like Jared Loughner to walk into a Wal-mart and walk out with a gun and rounds of ammunition as easily as if he had made a purchase of chewing gum.\n \n Please explain to me how and why it was so easy for Loughner to accomplish that and why so many people want things to be exactly like that. There are far too many people who cannot bear the slightest restriction on the ownership and use of guns.\n \n People like that are agents of Satan -- be there a Satan or not.\n \n I use the concept of Satan as an icon of absolute evil.\n\n \n Ever heard the saying \" Guns don't kill people, People Kill People\".. what would you be saying if Loughner had walked up and stabbed the Congresswoman with a steak knife?.. \" Ban Steak Knives for everyone?... what about a baseball bat?.. Wow, no more baseball for anyone. I could name a thousand every day Items that are just as deadly in the hands of a crazy person. It doesn't mean I want to ban or restrict everything or trample on the constitution and place the blame on the weapon used. Put the blame where it belongs.. on Loughner. If he hadn't got his weapon at Wal-mart he would have bought one somewhere else. He had it in his mind to kill and he wasn't going to let the purchase of a gun stand in his way.", 
   {}, 
   434020, 
   null, 
   1310151000.0
  ], 
  [
   434026, 
   null, 
   "Xenamnes", 
   "Hyperbole and insults have no place in a debate covering serious matters. If you are not prepared to engage in open discussion and would rather resort to underhanded tactics designed to inflame others then you have lost the argument from your first post.\n \n You have yet to show any connection between religion and weapons ownership. I will ask again, and I will continue asking until you answer the question adequately to support your own position. Perhaps you can show us the historical accounts of civilizations during biblical times that were smote off the face of the Earth because they possessed weapons.\n \n You are free to take offense. However that does not permit you to take offense in the wrong direction. To begin with Jared Loughner did not obtain his gun from Wal-Mart but rather a licensed and legitimate firearms dealer, certified with the ATF. Wal-Mart has not sold handguns in many years, nor is it likely they will ever start again even though they legally can.\n \n Purchasing a gun from a licensed dealer is not as simple as you claim, like buying chewing gum. No person buying chewing gum has to pay several hundred dollars for a pack of gum, or provide identification, fill out forms, and undergo a background check.\n \n You seem to fault America's laws for the actions of Jared Loughner, asking why it was so easy for him to buy a gun in the first place. Instead of laying blame with a lack of gun control you would be better off faulting those who could have done something but did nothing. The college Jared Loughner was kicked out of could have reported his activities to the police; they chose not to. The military recruiter who discovered Jared Lougher failed his drug test could have reported this discovery and had him arrested and charged with a felony; they chose not to.\n \n A system only works as well as those that maintain the system. Those who could maintain it chose to do nothing instead. They didn't want to get involved and instead chose to remain silent. They are no different than the people who allowed Kitty Genovese to be stabbed to death, because they didn't want to get involved.\n \n A criminal record is not born from nothing. It cannot come to fruition unless someone is willing to do something in response to a criminal action they see taking place. Being silent yields nothing.\n \n There is little reason to support new restrictions on gun ownership when they will yield no beneficial results. Because no person did anything to raise potential red flags regarding Jared Loughner in the first place, no criminal record existed and no system would be able to stop him. Adding additional restrictions would yield no true benefit. Rather new restrictions would be held up for symbolic purposes rather than their substance and effectiveness. It would be a way for politicians to proclaim \"Look! We're doing something!\" and little more.\n \n Blackstone's formula of law states it is better that ten guilty persons escape than that one innocent suffer. The same should apply with the implementation of any new laws and restrictions. Better that ten prohibited individuals be able to arm themselves than one innocent be unable to arm themselves. To what extent are you willing to pursue those you claim to be guilty? How many innocent people would you readily sacrifice to achieve your goals?\n \n Your comparison with Satan is heavily flawed. Innocents that are murdered and sent to Heaven is a loss for Satan, not a victory. Better to leave the innocents alive and corrupt them rather than shepherd them to Heaven where they're beyond corruption. For your comparison to work Satan would have to be a sleeper agent working to move as many pure souls to Heaven as possible.", 
   {}, 
   434020, 
   null, 
   1310152320.0
  ], 
  [
   434028, 
   null, 
   "simone", 
   "Ever heard the saying \" Guns don't kill people, People Kill People\".. what would you be saying if Loughner had walked up and stabbed the Congresswoman with a steak knife?.. \" ..\n\n So, are you saying that Loughner could have taken out just as many people carrying a steak knife as with a multi-round gun?\n \n Um, seems to me that if someone ran around flashing a knife, a bunch of folks would have been on on the dude, maybe getting slashed in the process, but you can't take out a bunch of people with a stupid steak knife.\n \n Christ almighty! What wonderful thinking!", 
   {}, 
   434023, 
   null, 
   1310152500.0
  ], 
  [
   434036, 
   null, 
   "Xenamnes", 
   "Your latest rant is far off topic Simone and has no bearing on the original topic of this thread, which was your claim that gun ownership is connected to religion and Satan.\n \n The method by which Jared Loughner became famous on January 6th is immaterial, as he could have used an improvised explosive device and chucked it into the crowd to carry out his killing spree, or driven his truck into the crowd and run them over.\n \n Your obsessive focus on guns is childish and immature. You seem far more upset about the tool chosen by Jared Loughner rather than the actions he took. You don't seem to care that he was allowed free when he displayed obvious warning signs that would have otherwise forced his commitment, conviction or otherwise disqualification from gun ownership.\n \n And this still has nothing to do with your claim that Satan has any connection to guns. I will ask again, and I will continue asking until you answer the question adequately to support your own position. Perhaps you can show us the historical accounts of civilizations during biblical times that were smote off the face of the Earth because they possessed weapons.\n \n You introduced this topic of discussion in the first place. It will not be going away until you address your own claims.", 
   {}, 
   434028, 
   null, 
   1310154960.0
  ], 
  [
   434040, 
   null, 
   "poet", 
   "Arizona utterly worships guns and other strange gods and the True Creator may have decided to destroy Arizona through the agency of the worst wildfire in Arizona's history and a huge and historic dust storm and other natural disasters. Arizonans have been brought to believe that they can get a free ride without paying their fair share in taxes, that they can sell off all of the valuable things held in common by the people, the one good thing they brought about, clean and publicly financed elections, has been destroyed by the five devils on the U.S. Supreme Court.\n \n Innocents have been murdered and harmed because the followers of Satan in Arizona want everyone to be armed with six or seven guns and endless rounds of ammunition. Arizonans are so tight with Satan that they refuse to limit the murderous potential of guns in any way, refusing to limit how many shots a gun can fire when reloaded.\n \n A hundred rounds or more to fire off in murderous abandon? Not enough for these children of Satan. Satan loves guns. And the murder of innocents.\n\n \n Joe Arpaio, Arizona Sheriff, To Pay $200,000 In Racial Profiling Case\n \n Indeed!", 
   {}, 
   433893, 
   null, 
   1310157000.0
  ], 
  [
   434050, 
   null, 
   "Xenamnes", 
   "Perhaps you would care to explain just what a racial profiling case has to do with regard to Simone's erroneous statement about gun ownership having any connection to Satan specifically or religion in general.\n \n There is no visible evidence to suggest even a casual relationship or connection exists between Simone's inaccurate claims about religion and gun ownership, and your message about abuse of police authority with regard to racial discrimination. The only visible connection that exists is both accounts mention Arizona. Beyond that there is nothing to connect the two.", 
   {}, 
   434040, 
   null, 
   1310159460.0
  ], 
  [
   434060, 
   null, 
   "pappillion001", 
   "Hyperbole and insults have no place in a debate covering serious matters. If you are not prepared to engage in open discussion and would rather resort to underhanded tactics designed to inflame others then you have lost the argument from your first post.\n\n \n True\n \n \nYou have yet to show any connection between religion and weapons ownership.\n\n \n Because there really isn't one that has any value to the topic.\n \n \nI will ask again, and I will continue asking until you answer the question adequately to support your own position. Perhaps you can show us the historical accounts of civilizations during biblical times that were smote off the face of the Earth because they possessed weapons.\n\n \n Most of them. Few civilizations were conquered by hand to hand combat or by the sharp witted tongues of their opponents.\n \n \nYou are free to take offense. However that does not permit you to take offense in the wrong direction. To begin with Jared Loughner did not obtain his gun from Wal-Mart but rather a licensed and legitimate firearms dealer, certified with the ATF. Wal-Mart has not sold handguns in many years, nor is it likely they will ever start again even though they legally can.\n\n \n \n They have started selling them again in half their stores.\n \n Ammo on Aisle Three: Walmart Brings Back Guns to Many Stores - TIME NewsFeed\n \n \nPurchasing a gun from a licensed dealer is not as simple as you claim, like buying chewing gum. No person buying chewing gum has to pay several hundred dollars for a pack of gum, or provide identification, fill out forms, and undergo a background check.\n\n \n \n Nobody has ever been robbed, assaulted or killed with chewing gum either. I think the accessibility is in proportion to the potential risk.\n \n \nYou seem to fault America's laws for the actions of Jared Loughner, asking why it was so easy for him to buy a gun in the first place.\n \n \n You start off good\n \n \nInstead of laying blame with a lack of gun control you would be better off faulting those who could have done something but did nothing.\n\n \n But then I think you take a path that sounds reasonable until one really looks at it hard.\n \n \nThe college Jared Loughner was kicked out of could have reported his activities to the police; they chose not to.\n \n \n What did he do that was illegal?\n \n \nThe military recruiter who discovered Jared Lougher failed his drug test could have reported this discovery and had him arrested and charged with a felony; they chose not to.\n\n \n Failing a voluntary drug test is not illegal\n \n \nA system only works as well as those that maintain the system. Those who could maintain it chose to do nothing instead.\n \n \n He was suspended and denied entry into the military. In both cases the reasons were noted.\n \n \nThey didn't want to get involved and instead chose to remain silent. They are no different than the people who allowed Kitty Genovese to be stabbed to death, because they didn't want to get involved.\n\n \n The two have absolutly nothing in common\n \n \n \nA criminal record is not born from nothing. It cannot come to fruition unless someone is willing to do something in response to a criminal action they see taking place. \n\n \n We are not a society of vigilantes and we have a legal system which is founded on the presumption of innocense. \n \n \nThere is little reason to support new restrictions on gun ownership when they will yield no beneficial results. Because no person did anything to raise potential red flags regarding Jared Loughner in the first place, no criminal record existed and no system would be able to stop him. Adding additional restrictions would yield no true benefit. Rather new restrictions would be held up for symbolic purposes rather than their substance and effectiveness. It would be a way for politicians to proclaim \"Look! We're doing something!\" and little more.\n\n \n \n True\n \n \nBlackstone's formula of law states it is better that ten guilty persons escape than that one innocent suffer. The same should apply with the implementation of any new laws and restrictions. Better that ten prohibited individuals be able to arm themselves than one innocent be unable to arm themselves. To what extent are you willing to pursue those you claim to be guilty? How many innocent people would you readily sacrifice to achieve your goals?\n\n \n \n Yes ten innocents suffering from the 10 guilty persons gone free is much better than one. I guess it really depends on which group you belong to.\n \n \nYour comparison with Satan is heavily flawed. Innocents that are murdered and sent to Heaven is a loss for Satan, not a victory. Better to leave the innocents alive and corrupt them rather than shepherd them to Heaven where they're beyond corruption. For your comparison to work Satan would have to be a sleeper agent working to move as many pure souls to Heaven as possible.\n\n \n Entry to heaven is not quite that simple and odds are that more innocents killed would not be going to Heaven than would. There are a number of reasons if Satan were the cause why it would be reasonable to believe so. \n \n The numbing to violence that occurs when it is an everyday event.\n The anger and retaliation from survivors towards others and specifically towards God for permitting it.\n The fear and mistrust caused by the possibility that it could happen anywhere at any time are just a few.", 
   {}, 
   434026, 
   null, 
   1310163660.0
  ], 
  [
   434081, 
   null, 
   "Xenamnes", 
   "Most of them. Few civilizations were conquered by hand to hand combat or by the sharp witted tongues of their opponents.\n\n \n There is a difference between being conquered by invaders, and being smote in a rain of fire and brimstone in a manner similar to Sodom and Gomorrah. And to the best of my knowledge no city was ever smote off the face of the planet simply because they had widespread ownership of weapons that could be used for the purpose of hurting others.\n \n \nThey have started selling them again in half their stores.\n \n Ammo on Aisle Three: Walmart Brings Back Guns to Many Stores - TIME NewsFeed\n\n \n I am quite aware of how Wal-Mart plans to bring back gun sales to a number of its stores. However I was specific when mentioning the sale of handguns, not guns in general. Wal-Mart has long sold shotguns and hunting rifles, but not handguns better suited for personal defense. These sales are unlikely to ever be made again even if names like Remington, Mossberg, Marlin, Savage and others are brought back in.\n \n \nNobody has ever been robbed, assaulted or killed with chewing gum either. I think the accessibility is in proportion to the potential risk.\n\n \n The number of offenses committed are immaterial to the discussion. Simone claimed guns are as easy to buy as chewing gum. I pointed out why this claim is grossly incorrect and misleading. \n \n \nYou start off good\n \n But then I think you take a path that sounds reasonable until one really looks at it hard.\n \n What did he do that was illegal?\n\n \n Perhaps this is the truth. Perhaps the actions of Jared Loughner were harmless in nature and he was expelled simply for being a class clown and counterproductive to a functional classroom setting. In which case his failures at school would be immaterial and the media has no business broadcasting them as if they were a determining matter.\n \n \nFailing a voluntary drug test is not illegal\n\n \n I was unaware that applicants seeking to join the military were allowed to refuse drug tests and must be allowed to enter service regardless. I was operating under the assumption that drug tests are a mandatory part of the screening, as are mental health evaluations, and applicants who refuse are denied entry on the spot.\n \n Perhaps failing a drug test is not illegal. But when the test comes back positive for heroin, meth, marijuana, cocaine or any number of other illegal drugs then the results must be reported to the authorities, correct? \n \n \nThe two have absolutly nothing in common\n\n \n Perhaps this is true. Perhaps I am completely off base in my assessment and in need to changing my stance. But if I am wrong that means in the eyes of the law Jared Loughner was considered no different than 75-to-100 million other everyday Americans and there was no reason to deny him the purchase in the first place. In the eyes of the law a name without a criminal record is a person who is innocent and cannot be discriminated against when it comes to the exercising of their rights. Without something that would be disqualifying in nature that was made apparent at some point down the line that lead up to January 8th, the FBI, ATF and federal government had no reason to deny the purchase in the first place.\n \n \nWe are not a society of vigilantes and we have a legal system which is founded on the presumption of innocense.\n\n \n We also have a duty to not stand by and simply watch as a crime takes place. If we see someone being raped in a parking lot we are guilty in some manner if we don't call the police or make some effort to stop the assault. Failure to report a crime you know is taking place is a crime in itself, especially if a death occurs. Guilt by association works in that manner.\n \n \nYes ten innocents suffering from the 10 guilty persons gone free is much better than one. I guess it really depends on which group you belong to.\n\n \n It is Blackstone's theory that I follow. If you find it questionable then he would be a more likely candidate to speak to than I. However one must question if it is truly a system of justice if we're willing to punish the guilty at the cost of punishing the innocent as well and simply considering their suffering a small price to pay.\n \n \nEntry to heaven is not quite that simple and odds are that more innocents killed would not be going to Heaven than would. There are a number of reasons if Satan were the cause why it would be reasonable to believe so. \n \n The numbing to violence that occurs when it is an everyday event.\n The anger and retaliation from survivors towards others and specifically towards God for permitting it. The fear and mistrust caused by the possibility that it could happen anywhere at any time are just a few.\n\n \n That could be argued. However to engage in such a matter would derail the discussion and allow Simone to escape her obligation to defend her own position.", 
   {}, 
   434060, 
   null, 
   1310173620.0
  ], 
  [
   434125, 
   null, 
   "pappillion001", 
   "There is a difference between being conquered by invaders, and being smote in a rain of fire and brimstone in a manner similar to Sodom and Gomorrah. \n\n \n Although you were not originally that specific why must God punish in that manner alone? According to the Bible nations were often set upon by other nations and taken away in bondage for their sins.\n \n \nAnd to the best of my knowledge no city was ever smote off the face of the planet simply because they had widespread ownership of weapons that could be used for the purpose of hurting others.\n\n \n Escalation of military might is often viewed as a threat. One group begins to arm themselves and it makes their neighbors nervous who do the same. The circle continues until they reach an agreement or wipe each other out.\n \n Is there another purpose for a weapon?\n \n \nI am quite aware of how Wal-Mart plans to bring back gun sales to a number of its stores. However I was specific when mentioning the sale of handguns, not guns in general. Wal-Mart has long sold shotguns and hunting rifles, but not handguns better suited for personal defense. These sales are unlikely to ever be made again even if names like Remington, Mossberg, Marlin, Savage and others are brought back in.\n\n \n Ok, but the topic didn't make any specific mention of the type of gun, just guns. \n \n \nThe number of offenses committed are immaterial to the discussion. Simone claimed guns are as easy to buy as chewing gum. I pointed out why this claim is grossly incorrect and misleading. \n\n \n In some states it can be, having a no wait period nor a shall issue law regarding concealed weapons.\n \n \nPerhaps this is the truth. Perhaps the actions of Jared Loughner were harmless in nature and he was expelled simply for being a class clown and counterproductive to a functional classroom setting. In which case his failures at school would be immaterial and the media has no business broadcasting them as if they were a determining matter.\n\n \n I didn't say they should\n \n \nI was unaware that applicants seeking to join the military were allowed to refuse drug tests and must be allowed to enter service regardless. I was operating under the assumption that drug tests are a mandatory part of the screening, as are mental health evaluations, and applicants who refuse are denied entry on the spot.\n\n \n They aren't, but they are not required to join the military and submit one either. Involuntary would be if you are pulled over by law enforcement for sobriety or are incarcerated or on parole. In those instances you are not submitting to one because you choose to comply with the requirements set before you. \n \n Joining the military is a choice and you further choose to submit to the drug test.\n \n \nPerhaps failing a drug test is not illegal. But when the test comes back positive for heroin, meth, marijuana, cocaine or any number of other illegal drugs then the results must be reported to the authorities, correct? \n\n \n Not unless it violates a law or is determined the cause of some other violation (driving under the influence)\n \n \n \nPerhaps this is true. Perhaps I am completely off base in my assessment and in need to changing my stance. But if I am wrong that means in the eyes of the law Jared Loughner was considered no different than 75-to-100 million other everyday Americans and there was no reason to deny him the purchase in the first place. In the eyes of the law a name without a criminal record is a person who is innocent and cannot be discriminated against when it comes to the exercising of their rights. Without something that would be disqualifying in nature that was made apparent at some point down the line that lead up to January 8th, the FBI, ATF and federal government had no reason to deny the purchase in the first place.\n\n \n \n Which is why they didn't.\n \n \nWe also have a duty to not stand by and simply watch as a crime takes place. If we see someone being raped in a parking lot we are guilty in some manner if we don't call the police or make some effort to stop the assault. Failure to report a crime you know is taking place is a crime in itself, especially if a death occurs. Guilt by association works in that manner.\n\n \n He was stopped because people tackled him as he went to reload. Typically law enforcement suggests no involvement other than to contact them as you potentially subject yourself to becoming another victim and making their job more difficult. \n \n The moral aspects of simply calling the police and then remaining silent while someone is raped or beaten is altogether different \n \n \nIt is Blackstone's theory that I follow. If you find it questionable then he would be a more likely candidate to speak to than I\n\n \n You brought it up not him.\n \n \nHowever one must question if it is truly a system of justice if we're willing to punish the guilty at the cost of punishing the innocent as well and simply considering their suffering a small price to pay.\n\n \n One should question the soundness of permitting the guilty to remain unpunished for fear of the consequences to the innocent. \n \n \nThat could be argued. However to engage in such a matter would derail the discussion and allow Simone to escape her obligation to defend her own position.\n\n \n No it wouldn't and the response was directed at your assertions not hers.", 
   {}, 
   434081, 
   null, 
   1310263560.0
  ], 
  [
   434175, 
   null, 
   "simone", 
   "It is documented that Satan favors the Kriss Vector .45 ACP sub machine gun. \n \nAll traditional machine guns, large and small, share a common problem; they utilize heavy linear operating mechanisms that deliver recoil forces directly into the operator's shoulder. These forces cause the operator to constantly re- acquire his sight picture due to felt recoil shock and the resulting rotational muzzle climb. Newton's 3rd Law; run amok.\n \n In other words, if the point of operating a machine gun is to put lots of rounds, in a hurry and in a very specific location, why is it that traditional machine guns, no matter how many tricky buffers, floating barrels, springs and pads are deployed, all work against the operator's goal?\n \n The engineers at KRISS USA, starting with a clean computer screen and one goal in mind, have solved this century-old problem by creating the patented KRISS Super V System-the only full-auto operating system in the world that actually works with the operator to help put more rounds on target, more of the time. Here's how.\n\n KRISS Vector SMG? .45 ACP\n \n In case you didn't know, Satan is a notoriously bad shot and couldn't hit the broad side of a barn with a full-splatter shotgun. Also, while Satan gets his jollies from seeing others in pain, he is a total pansy-pot when it comes to his experiencing pain. No sore shoulders for Mr. Satan.", 
   {}, 
   434125, 
   null, 
   1310329320.0
  ], 
  [
   434187, 
   null, 
   "snakespit", 
   "It is documented that Satan favors the Kriss Vector .45 ACP sub machine gun. \n \n KRISS Vector SMG? .45 ACP\n \n In case you didn't know, Satan is a notoriously bad shot and couldn't hit the broad side of a barn with a full-splatter shotgun. Also, while Satan gets his jollies from seeing others in pain, he is a total pansy-pot when it comes to his experiencing pain. No sore shoulders for Mr. Satan.\n\n \n Thanks for the link simone! Never saw this before, but thanks to you, I think I am going to get one. Ever thought about a career in advertising? You are a natural. Thanks again!!!", 
   {}, 
   434175, 
   null, 
   1310348940.0
  ], 
  [
   434192, 
   null, 
   "AirAssault1988", 
   "I'm not grasping the need to connect guns with religion. Religion is an entity in and of itself and has no connection to anything worldly in my opinion. What's religion's connection to snake wrangling? What about coal walking? Or bungie jumping? Religion is maleable and can be molded to fit anyone person's argument about anything. Or visa versa it can be expunged to a person's argument. Example: Guns are the work of Satan. Counter argument: God created man and man created Guns. Guns are the tools of God.", 
   {}, 
   434187, 
   null, 
   1310351040.0
  ], 
  [
   434195, 
   null, 
   "Stonewall", 
   "I'm not grasping the need to connect guns with religion. Religion is an entity in and of itself and has no connection to anything worldly in my opinion. What's religion's connection to snake wrangling? What about coal walking? Or bungie jumping? Religion is maleable and can be molded to fit anyone person's argument about anything. Or visa versa it can be expunged to a person's argument. Example: Guns are the work of Satan. Counter argument: God created man and man created Guns. Guns are the tools of God.\n\n \n Where I come from there are some snake handling churches, so they would probably see a connection with the snake wrangling.", 
   {}, 
   434192, 
   null, 
   1310352000.0
  ], 
  [
   434199, 
   null, 
   "Xenamnes", 
   "It is documented that Satan favors the Kriss Vector .45 ACP sub machine gun. \n \n KRISS Vector SMG? .45 ACP\n \n In case you didn't know, Satan is a notoriously bad shot and couldn't hit the broad side of a barn with a full-splatter shotgun. Also, while Satan gets his jollies from seeing others in pain, he is a total pansy-pot when it comes to his experiencing pain. No sore shoulders for Mr. Satan.\n\n \n The legitimacy of your claims, as well as your relevancy, continues to degrade with each new post. And this still has nothing to do with your claim that Satan has any connection to guns. I will ask again, and I will continue asking until you answer the question adequately to support your own position. Perhaps you can show us the historical accounts of civilizations during biblical times that were smote off the face of the Earth because they possessed weapons.\n \n I have seen this link you present, and yet I see no \"documentation\" that the new Kriss is favored by Satan, or anyone else for that matter. You have supplied no evidence to show a connection between new firearms technology and any connection to evil.\n \n Furthermore this latest tangent you're attempting to take has nothing to do with the original message of the supposed wrath of God descending upon the state of Arizona in punishment for having little to no gun control of their own.\n \n The number of irrelevancies you try to pile on will make no difference. You will not be allowed to steer this rant into a direction you are comfortable with. You have made the claims and now you will have to see them through.", 
   {}, 
   434175, 
   null, 
   1310354160.0
  ], 
  [
   434317, 
   null, 
   "simone", 
   "Logical and calculating? No human feelings? No sense of humor?\n \n The question must be asked, not \"Who are you?\" but \"What are you?\"\n \n You are an alien machine, incapable of understanding.", 
   {}, 
   434199, 
   null, 
   1310492640.0
  ], 
  [
   434321, 
   null, 
   "gansao", 
   "Logical and calculating? No human feelings? No sense of humor?\n \n The question must be asked, not \"Who are you?\" but \"What are you?\"\n \n You are an alien machine, incapable of understanding.\n\n \n Thats because he's a man and all men are baaaad eh Simone?", 
   {}, 
   434317, 
   null, 
   1310493360.0
  ], 
  [
   434322, 
   null, 
   "Xenamnes", 
   "My ability to understand and comprehend irrelevant matters is not the discussion of the matter. Rather the subject relates to your claims about a connection to guns and Satan or religion in general. Attempting to shift focus from yourself and your claims, to me and how I engage in debate, will not work as a diversionary tactic in this matter.\n \n I will ask again, and I will continue asking until you answer the question adequately to support your own position. Perhaps you can show us the historical accounts of civilizations during biblical times that were smote off the face of the Earth because they possessed weapons.\n \n You began this thread to attack the policies of Arizona, claiming God was punishing them for relying on federal laws rather than implementing their own. However you have been incapable of proving the current weather issues affecting Arizona have any connection to the wrath of God over the exercising of home rule authority. \n \n Further diversionary tactics of introducing aspects of Jared Loughner and the new Kriss have also failed at attempting to show guns are the tools used by Satan, or that God is angry at the widespread gun ownership style implemented by Arizona.", 
   {}, 
   434317, 
   null, 
   1310493420.0
  ], 
  [
   434332, 
   null, 
   "simone", 
   "Thats because he's a man and all men are baaaad eh Simone?\n\n I do not despise men as you despise women, Gansao, as evidenced by your disrespectful portrayal of Sarah Palin.\n \n I'm surprised you haven't included a closeup crotch shot, Palin as the four-letter rude word for a woman's sexual organs, the word used by the lower classes.", 
   {}, 
   434321, 
   null, 
   1310495460.0
  ], 
  [
   434340, 
   null, 
   "gansao", 
   "I do not despise men as you despise women, Gansao, as evidenced by your disrespectful portrayal of Sarah Palin.\n \n I'm surprised you haven't included a closeup crotch shot, Palin as the four-letter rude word for a woman's sexual organs, the word used by the lower classes.\n\n \n You are wrong.I love women.\n I am sorry to dissappoint you by not posting a close up of her crutch but there are web sites for ladies like you that want to look at other womens sexual organs.You may even see that word you long to see.(whatever turns you on)", 
   {}, 
   434332, 
   null, 
   1310496120.0
  ], 
  [
   434357, 
   null, 
   "pappillion001", 
   "My ability to understand and comprehend irrelevant matters is not the discussion of the matter. Rather the subject relates to your claims about a connection to guns and Satan or religion in general. Attempting to shift focus from yourself and your claims, to me and how I engage in debate, will not work as a diversionary tactic in this matter.\n\n \n Some people feel and their exists, sufficient evidence to suggests they may be correct, that guns are not in the best interest of society. As a religion that embraces the commandment \"Thou shalt not Kill\" it seems a contradiction to be so vocal in support of something whose primary purpose is the death of whatever happens to be in front of it. \n \n I stand by my position that if you are a hunter and require 33 rounds in your hand gun you are also an idiot and should consider a grocery store as an alternative source of food. The same holds true if you require a rifle to discharges 10 rounds per second while hunting a squirrel. \n \n \nI will ask again, and I will continue asking until you answer the question adequately to support your own position. Perhaps you can show us the historical accounts of civilizations during biblical times that were smote off the face of the Earth because they possessed weapons.\n\n \n I have already pointed out God's wrath is not limited to raining fire from the sky. The flood had no fire from the sky so should we consider this something other than God's wrath? The Roman conquest, The Babyalonian capture and Egyptian enslavement were examples of God's wrath falling on a sinful nation.\n \n The sacking of Juesalem was to Romans a response to armed revolt to Roman rule. In other words the Jewish people took up arms to defend themselves and as a result their temple was destroyed, their city practically burned to the ground and their people killed, banished or taken into slavery. Again what was their crime they armed themselves not to conquer Rome but to defend their homes. \n \n I trust that is Biblical and wrathful enough for you. If not you may wish to evaluate the standard by which you judge evidence.\n \n \nYou began this thread to attack the policies of Arizona, claiming God was punishing them for relying on federal laws rather than implementing their own. However you have been incapable of proving the current weather issues affecting Arizona have any connection to the wrath of God over the exercising of home rule authority. \n\n \n God gives warning of his displeasure before deciding to wipe out the offending people. There is a popular thread in this forum addressing natural disasters as being warnings from God. \n \n As to actual evidence one must prove the existance of God which is not possible one way or the other at this point in our existance leaving only one's best guess.\n \n \nFurther diversionary tactics of introducing aspects of Jared Loughner and the new Kriss have also failed at attempting to show guns are the tools used by Satan, or that God is angry at the widespread gun ownership style implemented by Arizona.\n\n \n If we are to believe all that is said about Satan then any argument thinking that he would not favor the use of guns shows a complete ignorance of what he stands for and what he hopes to achieve.", 
   {
    "unicode_changes_made": true
   }, 
   434322, 
   null, 
   1310506260.0
  ], 
  [
   434358, 
   null, 
   "Freedom", 
   "I would be very interested in finding out what this rant on guns has to do with religion.\n\n It's just Simone's scheduled rant.", 
   {}, 
   433912, 
   null, 
   1310506920.0
  ], 
  [
   434394, 
   null, 
   "Xenamnes", 
   "Some people feel and their exists, sufficient evidence to suggests they may be correct, that guns are not in the best interest of society. As a religion that embraces the commandment \"Thou shalt not Kill\" it seems a contradiction to be so vocal in support of something whose primary purpose is the death of whatever happens to be in front of it. \n\n \n Whether or not guns are in the best interest of society is not relevant to the discussion at hand. Nor is how \"thou shall not kill\" being applied either properly or improperly. While these topics certainly make for interesting discussion and debate they simply aren't appropriate to discuss here and now. It greatly detracts from Simone's points and instead allows her a method of escaping her responsibilities.\n \n \nI stand by my position that if you are a hunter and require 33 rounds in your hand gun you are also an idiot and should consider a grocery store as an alternative source of food. The same holds true if you require a rifle to discharges 10 rounds per second while hunting a squirrel.\n \n \n Your position is duly noted. However it must be noted that there is a significant difference between guns designed for hunting game and guns designed for protection against human threats. The two are entirely different categories and shouldn't be compared to each other.\n \n Your position is also heavily flawed and not in line with either physics or the laws governing the hunting of game in various states.\n \n \nI have already pointed out God's wrath is not limited to raining fire from the sky. The flood had no fire from the sky so should we consider this something other than God's wrath? The Roman conquest, The Babyalonian capture and Egyptian enslavement were examples of God's wrath falling on a sinful nation.\n\n \n The fact that God has brought his wrath against various nations in various ways, while worth noting, is irrelevant to the topic at hand. This has no bearing on Simone's position on the state of Arizona.\n \n \nThe sacking of Juesalem was to Romans a response to armed revolt to Roman rule. In other words the Jewish people took up arms to defend themselves and as a result their temple was destroyed, their city practically burned to the ground and their people killed, banished or taken into slavery. Again what was their crime they armed themselves not to conquer Rome but to defend their homes. \n \n I trust that is Biblical and wrathful enough for you. If not you may wish to evaluate the standard by which you judge evidence.\n\n \n It is not. The Roman empire deciding to punish Jerusalem for considering the possibility of an armed rebellion is not the same as an entire society being smote from existence by God because their offense was arming themselves.\n \n \nGod gives warning of his displeasure before deciding to wipe out the offending people. There is a popular thread in this forum addressing natural disasters as being warnings from God. \n \n As to actual evidence one must prove the existance of God which is not possible one way or the other at this point in our existance leaving only one's best guess.\n \n If we are to believe all that is said about Satan then any argument thinking that he would not favor the use of guns shows a complete ignorance of what he stands for and what he hopes to achieve.\n\n \n What bearing any of this has in relation to Simone's current position is highly questionable. I did not come here to argue the existence of God, or debate the methods in which evildoers have suffered for their crimes. My goal is simply to keep this discussion on topic and relevant to the original message. Simone's claims about Satan favoring guns, and God having displeasure with Arizona and its lack of draconian gun laws is what this topic is about.", 
   {
    "unicode_changes_made": true
   }, 
   434357, 
   null, 
   1310529000.0
  ], 
  [
   434462, 
   null, 
   "pappillion001", 
   "Whether or not guns are in the best interest of society is not relevant to the discussion at hand. Nor is how \"thou shall not kill\" being applied either properly or improperly. While these topics certainly make for interesting discussion and debate they simply aren't appropriate to discuss here and now. It greatly detracts from Simone's points and instead allows her a method of escaping her responsibilities.\n\n \n Read the OP again what is irrelevent is your attempts to guide the thread in the direction you feel most comfortable in defending. \n \n \nYour position is duly noted. However it must be noted that there is a significant difference between guns designed for hunting game and guns designed for protection against human threats. The two are entirely different categories and shouldn't be compared to each other.\n\n \n \n Make the leap it is not hard. Man uses guns interchangably and would be silly to restrict each to a seperate catagory. My sarcasm was intended to point this out. Do you suggest that gun owners often use hunting for justification of assualt rifles? Regardless the a gun has one purpose above all others and that is to kill. This is the point of my response and the OP. God does not condone killing and punishes those who disobey his commandments.\n \n \nYour position is also heavily flawed and not in line with either physics or the laws governing the hunting of game in various states.\n\n \n Sorry if I don't take your word for it. Please explain.\n \n \nThe fact that God has brought his wrath against various nations in various ways, while worth noting, is irrelevant to the topic at hand. This has no bearing on Simone's position on the state of Arizona.\n\n \n YOU continue to ask for a civiliation smote by God for arming themselves and when one is provided it is no longer relevent. You asked and you recieved an answer the fact you did not expect one does not make it irrelevant it makes you incorrect in your assumption.\n \n \nIt is not. The Roman empire deciding to punish Jerusalem for considering the possibility of an armed rebellion is not the same as an entire society being smote from existence by God because their offense was arming themselves.\n\n \n \n Juersalem was the society. There was no Jewish state of an merit after Rome came through a second time. The destruction of the Temple changed the religion and culture that exist to this day. God more often than not uses one group to punish another again you ask for conditions that are not consistant with the OP and history.\n \n \nWhat bearing any of this has in relation to Simone's current position is highly questionable. I did not come here to argue the existence of God, or debate the methods in which evildoers have suffered for their crimes. My goal is simply to keep this discussion on topic and relevant to the original message. Simone's claims about Satan favoring guns, and God having displeasure with Arizona and its lack of draconian gun laws is what this topic is about.\n\n \n Then you misunderstand the point of the OP and let the moderators guide the direction of the threads if they are to off topic. Each thread should be dynamic and go with the flow of the debate slight drifts should be encouraged as opening the debate to others. MAjor shifts can always be brought back by those who wish to keep along the original topic.", 
   {}, 
   434394, 
   null, 
   1310593440.0
  ], 
  [
   434487, 
   null, 
   "Stonewall", 
   "Make the leap it is not hard. Man uses guns interchangably and would be silly to restrict each to a seperate catagory. My sarcasm was intended to point this out. Do you suggest that gun owners often use hunting for justification of assualt rifles? Regardless the a gun has one purpose above all others and that is to kill. This is the point of my response and the OP. God does not condone killing and punishes those who disobey his commandments.\n\n \n I know plenty of people who own \"assault rifles\" (which is an arbitrary scare-tactic term, by the way), and none of them have ever killed anyone, nor do they plan to. The purpose of the gun for them is for fun. Believe it or not, a lot of people enjoy shooting at a gun range, or in competitions. I know guns are \"scary,\" but for the average civilian who owns an assault rifle, it has nothing to do with killing, and a person shot in the right place with a single shot .22 is going to be just as dead as somebody shot with a scarier weapon.\n \n That said, I'm sure Satan would be all for guns, but he would also be all for swords, knives, grenades, the military, throwing rocks, bows and arrows... He would be pro-violence no matter how you look at it, but a gun doesn't make someone violent or a killer. \n \n Would a world without guns and advanced weapons be safer? Sure, but it's a fantasy that isn't possible; because guns exist, millions of people have them and know how to make them, and any laws restricting those things just affect law abiding citizens, who are not really the ones you have to worry about shooting a place up with expensive weapons.", 
   {}, 
   434462, 
   null, 
   1310613600.0
  ], 
  [
   434488, 
   null, 
   "Xenamnes", 
   "Read the OP again what is irrelevent is your attempts to guide the thread in the direction you feel most comfortable in defending.\n\n \n I have read the opening post of this thread. Simone's attempts to suggest guns are the tools of Satan is a dismal failure. She has been questioned regarding the legitimacy of both her claims and this topic being placed in the religious forums, and yet she has given no explanation for either. Any attempt to escape this indefensible position will be rebuffed.\n \n \nMake the leap it is not hard. Man uses guns interchangably and would be silly to restrict each to a seperate catagory. My sarcasm was intended to point this out.\n \n \n I fail to see the supposed silliness in pointing out that different types of guns are best utilized for different roles. What is better utilized for deer, cougar, bear or water buffalo is not the best option for use against muggers, rapists or arsonists. This is a fact of common sense and must be recognized is honest debate and discussion is to be had.\n \n \nDo you suggest that gun owners often use hunting for justification of assualt rifles?\n\n \n No such suggestion has been made on my part. What one does with their privately owned property is of no consequence or interest to me as I have no say in the matter. \n \n \nRegardless the a gun has one purpose above all others and that is to kill.\n\n \n Who has suggested otherwise to even make this line relevant to the discussion? I have not seen this supposed argument introduced.\n \n \nThis is the point of my response and the OP. God does not condone killing and punishes those who disobey his commandments.\n\n \n Whether or not this is the truth, this has no bearing on Simone's position regarding the supposed connection between guns and Satan. Weapons are not exclusively the tools of the devil, even if they could be utilized by people with evil intentions. We could most certainly fill an entire debate regarding the punishment of various individuals from around the world for committing one offense or another. But that is not the subject of discussion here and is best utilized elsewhere in a dedicated topic of discussion.\n \n \nSorry if I don't take your word for it. Please explain.\n\n \n Hunting regulations specify various aspects of hunting equipment, this is no different when it comes to guns and ammunition. Bore diameter, cartridge length, bullet weight, muzzle velocity, muzzle energy, materials used, type of action allowed, type of firearm allowed, magazine capacity, etc. are all spelled out in all 50 states within the country.\n \n The possibility that someone would legally be in possession of a magazine holding 33 rounds while engaging in a licensed hunt, or utilizing a rifle capable of firing 10 shots per second (a firearm better known as a machine gun, licensed and regulated by the federal government) is unlikely at best.\n \n \nYOU continue to ask for a civiliation smote by God for arming themselves and when one is provided it is no longer relevent. You asked and you recieved an answer the fact you did not expect one does not make it irrelevant it makes you incorrect in your assumption.\n \n Juersalem was the society. There was no Jewish state of an merit after Rome came through a second time. The destruction of the Temple changed the religion and culture that exist to this day. God more often than not uses one group to punish another again you ask for conditions that are not consistant with the OP and history.\n\n \n The bible is filled with many mentions of the people of Jerusalem being the people of God, as well as those who turn against Jerusalem being punished for their actions. It is unlikely that the Roman empire's actions against Jerusalem would have been commanded by God simply because they chose to arm themselves.\n \n In which passage of the bible has it been said that the people may not take up weapons for the purpose of defending themselves against others. Where did God state that He would smite those that took up arms against those that would do them harm?\n \n \nThen you misunderstand the point of the OP and let the moderators guide the direction of the threads if they are to off topic. Each thread should be dynamic and go with the flow of the debate slight drifts should be encouraged as opening the debate to others. MAjor shifts can always be brought back by those who wish to keep along the original topic.\n\n \n The attempted actions of Simone constitute a major shift in the course of discussion, into further irrelevancy and further away from her original claims. She has made her claims, it is her responsibility to respond to questions about their legitimacy and explain her reasoning.", 
   {}, 
   434462, 
   null, 
   1310613780.0
  ], 
  [
   434518, 
   null, 
   "Freedom", 
   "Logical and calculating?\n\n I like it. It's nice to see someone else putting forth good effort\n (Note the 'annoying', 'line by line' responses to blocks of meaning, and the stubborn focus on the subject... stonewall) even when it is not reciprocated.\n \n \nYou are wrong.I love women.\n I am sorry to dissappoint you by not posting a close up of her crutch but there are web sites for ladies like you that want to look at other womens sexual organs.You may even see that word you long to see.(whatever turns you on)\n\n You have to admit that if you met Sarah Palin she probably wouldn't like that image. It's obviously been doctored and if she wanted to pose like that she would have done it herself and written 'girl I could get behind'.\n \n You realize she has a family and husband right?", 
   {}, 
   434488, 
   null, 
   1310662980.0
  ], 
  [
   434529, 
   null, 
   "gansao", 
   "\n \n \n You have to admit that if you met Sarah Palin she probably wouldn't like that image. It's obviously been doctored and if she wanted to pose like that she would have done it herself and written 'girl I could get behind'.\n \n You realize she has a family and husband right?\n\n I wouldnt worry.She must have skin as thick as a Rhino to have been in public office and if she tries for POTUS she will need an even thicker skin than that.\n \n \n &#x202a;Sarah Palin Prank Call 'Nicolas Sarkozy' Sarah Palin pranked&#x202c;&rlm; - YouTube\n \n She thought that she was talking to the French president in this clip.\n If she can say thank you to his reference to ' nailin' Palin' she can forgive my avatar\n Of course the picture is doctored. \n I realise that she has a husband and family...I dont see that as being relevant.\n \n Simone has a family but that doesnt stop her talking dirty to me..\"I'm surprised you haven't included a closeup crotch shot, Palin as the four-letter rude word for a woman's sexual organs, the word used by the lower classes\"", 
   {}, 
   434518, 
   null, 
   1310678580.0
  ], 
  [
   434531, 
   null, 
   "pappillion001", 
   "I know plenty of people who own \"assault rifles\" (which is an arbitrary scare-tactic term, by the way), and none of them have ever killed anyone, nor do they plan to.\n \n \n Very few people know people who own guns who have shot and killed other people yet in 2006 just under 31,000 people died from a gun.\n \n \nThe purpose of the gun for them is for fun. Believe it or not, a lot of people enjoy shooting at a gun range, or in competitions.\n \n \n The primary purpose of a gun is to kill. There are a number of other uses, which is why I didn't say the only purpose is to kill.\n \n \nI know guns are \"scary,\" but for the average civilian who owns an assault rifle, it has nothing to do with killing, and a person shot in the right place with a single shot .22 is going to be just as dead as somebody shot with a scarier weapon.\n\n \n I am ex-military and my particular MOS had me training with a .60 cal, .50 cal, LAW, several different granades as well as the M-16 which is really a .22 with a lot more powder behind it. I have owned guns and been hunting, both of which seemed to end up with me not killing anything. Good on the first not so good on the second. So while I agree for some guns are scary and shot is shot even little holes can kill. I am not one of those who is scared and that guns can and are used for purposes other than death doesn't lessen the position that they do kill and God does not condone killing. \n \n \nThat said, I'm sure Satan would be all for guns, but he would also be all for swords, knives, grenades, the military, throwing rocks, bows and arrows... He would be pro-violence no matter how you look at it, but a gun doesn't make someone violent or a killer. \n\n \n \n I agree. I did not limit my point to only guns nor did I say all gun owners are killers violent or otherwise.\n \n \nWould a world without guns and advanced weapons be safer? Sure, but it's a fantasy that isn't possible; because guns exist, millions of people have them and know how to make them, and any laws restricting those things just affect law abiding citizens, who are not really the ones you have to worry about shooting a place up with expensive weapons.\n\n \n Honestly so is God punishing peopel for owning them, but that isn't the point here. The assumption is God is real and does punish.", 
   {}, 
   434487, 
   null, 
   1310686320.0
  ], 
  [
   434536, 
   null, 
   "Stonewall", 
   "Very few people know people who own guns who have shot and killed other people yet in 2006 just under 31,000 people died from a gun.\n\n \n It's a big number, way too big, but compared to the number of people with guns, it's not a huge percentage, so it's not really a surprise that most people don't know murderers. There are plenty of non-gun death statistics that are pretty shocking that are the same way.\n \n \nThe primary purpose of a gun is to kill. There are a number of other uses, which is why I didn't say the only purpose is to kill.\n\n \n It's true that guns were originally made and advancements were made for killing (animals and humans), but I'd guess that most non-criminal civilians these days own guns solely for hunting and target shooting (and self defense if needed).", 
   {}, 
   434531, 
   null, 
   1310700840.0
  ], 
  [
   434537, 
   null, 
   "MrWriteLA", 
   "It's true that guns were originally made and advancements were made for killing (animals and humans), but I'd guess that most non-criminal civilians these days own guns solely for hunting and target shooting (and self defense if needed).\nI'd be really interested to see a pie-chart showing the percentages of the two groups.", 
   {}, 
   434536, 
   null, 
   1310701080.0
  ], 
  [
   434542, 
   null, 
   "Xenamnes", 
   "The current discussion has become greatly off topic with the original message that was being discussed.\n \n Whether or not God is displeased with people using firearms to defend themselves against violent threats is not relevant to what the original discussion is about. Discussion of guns in general is not what this forum section is intended for.\n \n Simone's claim about Satan being linked to guns, and God punishing Arizona for not implementing extensive gun control laws of its own, are what this thread was started for. She has been asked to defend her position, and to date she has not fulfilled her duties.", 
   {}, 
   434537, 
   null, 
   1310740080.0
  ], 
  [
   434551, 
   null, 
   "pappillion001", 
   "The current discussion has become greatly off topic with the original message that was being discussed.\n \n Whether or not God is displeased with people using firearms to defend themselves against violent threats is not relevant to what the original discussion is about. Discussion of guns in general is not what this forum section is intended for.\n \n Simone's claim about Satan being linked to guns, and God punishing Arizona for not implementing extensive gun control laws of its own, are what this thread was started for. She has been asked to defend her position, and to date she has not fulfilled her duties.\n\n \n Simone you are a wretched little girl and unitl you can properly organize your thoughts into a comprehensible group of statements that expresses your views conciesly you must not post anywhere a man may run afoul of your devilish whimsical rantings. \n \n Your befuddlement of these issues of great import will not be tolerated. Do we make ourselves clear young lady? Now off to your room to contemplate the nonsensical mischief and unneccessary consternation we have all suffered due to your blatant disregard of forums ettiquite. emoticon_frazzled\n \n You sound like a 9 year old trying to get a date. Simone hasd left the building the debate has drifted it isn't the end of the world. The sun will rise tomorrow emoticon_xbouncer", 
   {}, 
   434542, 
   null, 
   1310757540.0
  ], 
  [
   434559, 
   null, 
   "simone", 
   "Blast it, Papillion! When you go off on one of your drunken rants, please be so kind as to provide a glossary.\n \n How is that I might express my views conciesly?\n \n Concisely? Consciously? With a concierge holding my hand? \n \n How may I oblige you?\n \n Have you been imbibing a bit too much of Satan's brew?", 
   {}, 
   434551, 
   null, 
   1310762040.0
  ], 
  [
   434586, 
   null, 
   "pappillion001", 
   "Blast it, Papillion! When you go off on one of your drunken rants, please be so kind as to provide a glossary.\n \n How is that I might express my views conciesly?\n \n Concisely? Consciously? With a concierge holding my hand? \n \n How may I oblige you?\n \n Have you been imbibing a bit too much of Satan's brew?\n\n \n Sadly my attempts to mock Xenamnes seem to have missed the mark. I thought taken in its entirety it would be at leat slightly amusing \n \n This all stemming from his insistance that any statement that was not a precise rebuttle to his intepretation of your post was irrelevant, a diversion or both. Spending more time on demending the correct response and crying foul that the thread was being taking off topic than addressing any points being made.", 
   {}, 
   434559, 
   null, 
   1310774280.0
  ], 
  [
   434592, 
   null, 
   "MrWriteLA", 
   "Of course, we all know that the real topic of any thread on this board is... GAY SEX SIN!! \n \n (At least according to one dork... uh...meathead...uh...reprobate...uh... \"true\" Christian poster.)", 
   {}, 
   434586, 
   null, 
   1310786220.0
  ], 
  [
   434593, 
   null, 
   "Xenamnes", 
   "If you wish to have a discussion about gun control, its effectiveness and its merits there is an appropriate forum for that, but it isn't here. \n \n If you wish to discuss the ineffectiveness of the government following the Ten Commandments, or if they even can as there is a separation of church and state, then such a discussion deserves a dedicated thread based on such a concept.\n \n However this thread is not appropriate for such discussions. This thread was started by Simone when she made the following erroneous statements.\n \n \nArizona utterly worships guns and other strange gods and the True Creator may have decided to destroy Arizona through the agency of the worst wildfire in Arizona's history and a huge and historic dust storm and other natural disasters. Arizonans have been brought to believe that they can get a free ride without paying their fair share in taxes, that they can sell off all of the valuable things held in common by the people, the one good thing they brought about, clean and publicly financed elections, has been destroyed by the five devils on the U.S. Supreme Court.\n \n Innocents have been murdered and harmed because the followers of Satan in Arizona want everyone to be armed with six or seven guns and endless rounds of ammunition. Arizonans are so tight with Satan that they refuse to limit the murderous potential of guns in any way, refusing to limit how many shots a gun can fire when reloaded.\n \n A hundred rounds or more to fire off in murderous abandon? Not enough for these children of Satan. Satan loves guns. And the murder of innocents.\n\n \n I have asked to explain her position, justify her logic and even defend her claims. To date she has done nothing to prove she is serious in nature regarding any of these. She has failed to show evidence that God has smote civilizations for taking up arms. She has failed to show that Satan has any connection to guns. She has failed to show that God has found disfavor with Arizona because of their gun laws of all things. She has been asked multiple times to respond to questions about the legitimacy and relevancy of her claims and to date she has been unwilling to offer anything.\n \n Simone has been called out and asked to defend her claims. That is a reasonable request to make as this is her thread.", 
   {}, 
   434592, 
   null, 
   1310789580.0
  ], 
  [
   434598, 
   null, 
   "Freedom", 
   "I wouldnt worry.She must have skin as thick as a Rhino to have been in public office and if she tries for POTUS she will need an even thicker skin than that.\n \n She thought that she was talking to the French president in this clip.\n If she can say thank you to his reference to ' nailin' Palin' she can forgive my avatar\n Of course the picture is doctored. \n I realise that she has a husband and family...I dont see that as being relevant.\n \n Simone has a family but that doesnt stop her talking dirty to me..\"I'm surprised you haven't included a closeup crotch shot, Palin as the four-letter rude word for a woman's sexual organs, the word used by the lower classes\"\n\n Her ability to ignore it does not mean she would appreciate or approve.", 
   {}, 
   434529, 
   null, 
   1310792340.0
  ], 
  [
   434600, 
   null, 
   "pappillion001", 
   "If you wish to have a discussion about gun control, its effectiveness and its merits there is an appropriate forum for that, but it isn't here. \n\n \n I agree, but when God is part of the debate than it can enter into religion, especially when an attempt is made to connect them by implying because the activities of one results in the actions of the other. \n \n With the introduction of God and Satan and their role in the OP I think the thread belongs here more than it would there.\n \n \nIf you wish to discuss the ineffectiveness of the government following the Ten Commandments, or if they even can as there is a separation of church and state, then such a discussion deserves a dedicated thread based on such a concept.\n\n \n Agreed, but this isn't primarily concerning AZ gun laws, those are secondary to the main point just as the State laws following the Ten Commandments.\n \n \n \nHowever this thread is not appropriate for such discussions. This thread was started by Simone when she made the following erroneous statements.\n\n \n Some of it is in error, but the opening statement has not been shown to be errorneus. That is the one that most belongs here and what for the most part has been the focus\n \n \nI have asked to explain her position, justify her logic and even defend her claims. To date she has done nothing to prove she is serious in nature regarding any of these. She has failed to show evidence that God has smote civilizations for taking up arms.\n \n \n We are discussing God, precedent is not necessary, but I gave the plight of Israel under The Egyptians, Babylonians and Romans as examples of God laying waste to sinful nation. I used the uprising in 70AD as an example of God using their arming of themselves in rebellion to make the Romans be the tool of God's wrath. The initial conquest would have worked as well since it was brought about by civil war. \n \n After the rebellion in 70AD Judea was renamed as was Jerusalem. The majority of the population was banished, killed or enslaved. They had been pretty much been wiped out at that point.\n \n \nShe has failed to show that Satan has any connection to guns.\n \n \n Satan sows the seeds of Chaos and looks to cause sorrow, rejection of God and the misery of humanity. Why would there death, fear and violence attributable to guns not be something endorsed by Satan?\n \n \n \nShe has failed to show that God has found disfavor with Arizona because of their gun laws of all things. \n\n \n It is not just Gun laws it is the ungodly love of an object whose existence is often the cause of directly or indirectly of a drift away from God's will. \n \n \nShe has been asked multiple times to respond to questions about the legitimacy and relevancy of her claims and to date she has been unwilling to offer anything.\n\n \n That is her choice and she takes the hits verbally when she does, but if you want to debate only her there is a place for that specifically and it isn't in religion. Otherwise it fairly open with most people respecting each other or an ongoing exchange. There is some razzing at times but I have never seen anyone so persistent in the desire to make an example of someone.\n \n \nSimone has been called out and asked to defend her claims. That is a reasonable request to make as this is her thread.\n\n \n I agree and if she doesn't let her know it, but after the 5th time within a page or two it starts to get a little annoying. Would it help if someone said your right she didn't you win by default?\n \n You seem like a good guy and I don't fault you for expecting some semblance of structure but for good or bad there is a place for formal debate and it's up at the top of the topic headings. Your not going to find it for the most part in the other topics.", 
   {}, 
   434593, 
   null, 
   1310797140.0
  ], 
  [
   434601, 
   null, 
   "pappillion001", 
   "It's a big number, way too big, but compared to the number of people with guns, it's not a huge percentage, so it's not really a surprise that most people don't know murderers. There are plenty of non-gun death statistics that are pretty shocking that are the same way.\n\n \n How many is one to many for God to take action to warn against further instances? \n \n \nIt's true that guns were originally made and advancements were made for killing (animals and humans), but I'd guess that most non-criminal civilians these days own guns solely for hunting and target shooting (and self defense if needed).\n\n \n Almost none purchase a gun with the intention of committing murder or being involved in their own or anothers death, but the best of intentions....\n \n Don't get me wrong I thought is was fantastic to chop a car in half at 600 yards, but is that a joy that God would approve of? Considering how often it is used to violate his commandments.", 
   {}, 
   434536, 
   null, 
   1310797620.0
  ], 
  [
   434631, 
   null, 
   "Xenamnes", 
   "The goal was this was never to win any sort of debate. Rather it was to require Simone to contribute something of substance to substantiate her own claims. Simply introducing the concept of God's wrath into a discussion does not mean it qualifies as a debate on religion and its intricate details, and her opening post would support this fact. Her focus has been more on the lethality of guns, the availability of magazines with adequate storage capability, and the unwillingness to introduce useless limitations on ownership and use, rather than on God or Satan or the bible.\n \n I have pressed her to explain her position and clarify whatever logic she has attempted to use. However she seems unwilling to engage in legitimate discussion. Simone has been offered ample opportunity and reason to offer up further information to show that she is serious about her discussion here, yet she has done nothing of the sort. It would appear she is far more interested in trolling for fun rather than anything else.", 
   {}, 
   434529, 
   null, 
   1310839920.0
  ], 
  [
   434637, 
   null, 
   "pappillion001", 
   "The goal was this was never to win any sort of debate. Rather it was to require Simone to contribute something of substance to substantiate her own claims. Simply introducing the concept of God's wrath into a discussion does not mean it qualifies as a debate on religion and its intricate details, and her opening post would support this fact. Her focus has been more on the lethality of guns, the availability of magazines with adequate storage capability, and the unwillingness to introduce useless limitations on ownership and use, rather than on God or Satan or the bible.\n\n \n I would agree if her post was introduced at any point other than the OP. As such her post was reasonably consistant with being in religion or gun control, personally I felt it was more of a religious question and the religion threads get far more attention to boot.\n \n \nI have pressed her to explain her position and clarify whatever logic she has attempted to use. However she seems unwilling to engage in legitimate discussion. Simone has been offered ample opportunity and reason to offer up further information to show that she is serious about her discussion here, yet she has done nothing of the sort. It would appear she is far more interested in trolling for fun rather than anything else.\n\n \n Based on results I would have to agree", 
   {}, 
   434631, 
   null, 
   1310847180.0
  ], 
  [
   434647, 
   null, 
   "gansao", 
   "Her ability to ignore it does not mean she would appreciate or approve.\n\n \n Whether she appreciates or approves means nothing.\n Its whether the people that are important to her appreciates and approves of her thats important.\n Politicians, in the main, are liars and charlatans.\n If they are lampooned, I do not care one jot", 
   {}, 
   434598, 
   null, 
   1310857380.0
  ], 
  [
   434655, 
   null, 
   "Freedom", 
   "Whether she appreciates or approves means nothing.\n Its whether the people that are important to her appreciates and approves of her thats important.\n Politicians, in the main, are liars and charlatans.\n If they are lampooned, I do not care one jot\n\n You're new one is not much better IMO. Is it really necessary to have scantly clothed human being in absurd poses?", 
   {}, 
   434647, 
   null, 
   1310860260.0
  ], 
  [
   434658, 
   null, 
   "gansao", 
   "You're new one is not much better IMO. Is it really necessary to have scantly clothed human being in absurd poses?\n\n \n Im afraid it is Freedom.\n Silly avatars make me smile", 
   {}, 
   434655, 
   null, 
   1310860980.0
  ], 
  [
   434660, 
   null, 
   "pappillion001", 
   "Im afraid it is Freedom.\n Silly avatars make me smile\n\n \n Go back to the chick at the bar, she was visually appealing. emoticon_xgood", 
   {}, 
   434658, 
   null, 
   1310861340.0
  ], 
  [
   434661, 
   null, 
   "gansao", 
   "Go back to the chick at the bar, she was visually appealing. emoticon_xgood\n\n \n I can assure you that Borat will not be here for long.\n I liked the way that young lady imbibed her barley wine too;)", 
   {}, 
   434660, 
   null, 
   1310861700.0
  ], 
  [
   434703, 
   null, 
   "simone", 
   "Her ability to ignore it does not mean she would appreciate or approve.\n\n Thank you, Freedom. I totally hate having to agree with you but you are right on the mark! And I totally dislike Palin but I could never treat her in such a disrespectful way.\n \n I love gansao's new avatar!", 
   {}, 
   434598, 
   null, 
   1310931180.0
  ], 
  [
   434705, 
   null, 
   "gansao", 
   "Thank you, Freedom. I totally hate having to agree with you but you are right on the mark! And I totally dislike Palin but I could never treat her in such a disrespectful way.\n \n I love gansao's new avatar!\n\n \n Im so glad that you do Simone;)", 
   {}, 
   434703, 
   null, 
   1310931720.0
  ], 
  [
   434707, 
   null, 
   "simone", 
   "Why did you change your avatar, Gansao?\n \n I don't have your boob fetish.", 
   {}, 
   434705, 
   null, 
   1310932020.0
  ], 
  [
   434708, 
   null, 
   "simone", 
   "By the way, God is a scientist and is angry at Arizona because it disdains truth and science.", 
   {}, 
   434707, 
   null, 
   1310932140.0
  ], 
  [
   434710, 
   null, 
   "gansao", 
   "Why did you change your avatar, Gansao?\n \n I don't have your boob fetish.\n\n \n Because I have a boob fetish..... and a bum and leg fetish too", 
   {}, 
   434707, 
   null, 
   1310932500.0
  ], 
  [
   434715, 
   null, 
   "simone", 
   "Too bad you don't have a package like Borat.", 
   {}, 
   434710, 
   null, 
   1310933160.0
  ], 
  [
   434716, 
   null, 
   "gansao", 
   "Too bad you don't have a package like Borat.\n\n \n You wouldnt want it dry\n \n As much as I enjoy talking dirty with you Simone...maybe you should refrain from doing it in front of the others", 
   {}, 
   434715, 
   null, 
   1310933820.0
  ], 
  [
   434717, 
   null, 
   "Xcaliber", 
   "Because I have a boob fetish..... and a bum and leg fetish too\n\n \n I think you should put Sara Palins head on your Avatar ... lol... But someone might get upset.. would still be a funny Avatar though....", 
   {}, 
   434710, 
   null, 
   1310935380.0
  ], 
  [
   434720, 
   null, 
   "gansao", 
   "I think you should put Sara Palins head on your Avatar ... lol... But someone might get upset.. would still be a funny Avatar though....\n\n \n Lol.........", 
   {}, 
   434717, 
   null, 
   1310935800.0
  ], 
  [
   434721, 
   null, 
   "pappillion001", 
   "By the way, God is a scientist and is angry at Arizona because it disdains truth and science.\n\n \n Xenamnes is going to have an apoplectic fit when he sees the direction this thread has gone and then you drop this on him. Not nice emoticon_wow emoticon_xdonno", 
   {}, 
   434708, 
   null, 
   1310936760.0
  ], 
  [
   434724, 
   null, 
   "Xcaliber", 
   "By the way, God is a scientist and is angry at Arizona because it disdains truth and science.\n\n \n All I can do to that statement is ROFLMAO...emoticon_xangelemoticon_xangel", 
   {}, 
   434708, 
   null, 
   1310939520.0
  ], 
  [
   434726, 
   null, 
   "Xenamnes", 
   "Having a fit is not a constructive manner of having a discussion or debate with anyone.\n \n Rather I feel it necessary to point out, yet again, that Simone has been entirely unwilling or unable to answer the questions raised about the legitimacy or the relevancy of her earlier statements.\n \n The latest statement by Simone, that God is a scientist, is a poor diversionary tactic and will not serve as a method of making others forget her previous post points.\n \n Simone you have been asked multiple time to substantiate your claims and prove your claims as accurate. Your lack of willingness to engage others in honest discussion about your own position does not speak highly of you.", 
   {}, 
   434721, 
   null, 
   1310940840.0
  ], 
  [
   434968, 
   null, 
   "simone", 
   "Well, SHE is a scientist! And don't argue with me.", 
   {}, 
   434726, 
   null, 
   1311204780.0
  ], 
  [
   434973, 
   null, 
   "Xenamnes", 
   "Well, SHE is a scientist! And don't argue with me.\n\n \n For an argument to take place a subject of discussion and debate requires two or more willing participants. I have repeatedly questioned you about your claims and their legitimacy, but you have been notably absent in defending your position from inquiries.\n \n You have been asked for historical evidence that would support your claims, you have provided none. You have been asked to defend posting this discussion in the religion thread rather than the gun control thread, you have been silent. You have been questioned about how guns are supposedly the tool of Satan, you have contributed nothing.\n \n An argument on this topic is pointless. Rather I am interested in the truth and seeing that you fulfill your duty to address the questions presented about your position.", 
   {}, 
   434968, 
   null, 
   1311208920.0
  ], 
  [
   435507, 
   null, 
   "Xenamnes", 
   "I have mode no secret of the fact that I have a great dislike for introducing off topic points that derail a debate about a specific subject in need of addressing. However when I read this article I believed there was relevancy in refuting some of Simone's statements.\n \n Deadly Tornadoes Blast &#8220;Gun Valley&#8221; - Guns & Ammo\n \n So we have a region known as \"gun valley\" because of the manufacturing companies and museums located there, and the twisters that struck did no damage to the plants of Savage Arms, Smith & Wesson, or the gun museum located there. That doesn't lend much support to Simone's claims of how God is using natural disasters to punish those connected to guns because they're the tools of Satan.", 
   {}, 
   434973, 
   null, 
   1311732600.0
  ], 
  [
   435583, 
   null, 
   "pappillion001", 
   "I have mode no secret of the fact that I have a great dislike for introducing off topic points that derail a debate about a specific subject in need of addressing. However when I read this article I believed there was relevancy in refuting some of Simone's statements.\n \n Deadly Tornadoes Blast \"Gun Valley\" - Guns & Ammo\n \n So we have a region known as \"gun valley\" because of the manufacturing companies and museums located there, and the twisters that struck did no damage to the plants of Savage Arms, Smith & Wesson, or the gun museum located there. That doesn't lend much support to Simone's claims of how God is using natural disasters to punish those connected to guns because they're the tools of Satan.\n\n \n Think of it as a warning shot.", 
   {
    "unicode_changes_made": true
   }, 
   435507, 
   null, 
   1311804960.0
  ], 
  [
   435596, 
   null, 
   "Xenamnes", 
   "A warning shot? Where exactly has it been established that God issues \"warning shots\" against sinners and those that supposedly work for Satan? What biblical examples of civilizations being smote would count as warning shots?", 
   {}, 
   435583, 
   null, 
   1311807960.0
  ], 
  [
   435619, 
   null, 
   "pappillion001", 
   "A warning shot? Where exactly has it been established that God issues \"warning shots\" against sinners and those that supposedly work for Satan? What biblical examples of civilizations being smote would count as warning shots?\n\n \n \n \nNum 26:10 The earth opened its mouth and swallowed them along with Korah, whose followers died when the fire devoured the 250 men. And they served as a warning sign. \n\n \n Jer 6:8 Take warning, O Jerusalem, or I will turn away from you and make your land desolate so no one can live in it.\" \n \n Eze 5:15 You will be a reproach and a taunt, a warning and an object of horror to the nations around you when I inflict punishment on you in anger and in wrath and with stinging rebuke. I the LORD have spoken. \n \n and don't forget Sodom and Gomorrah", 
   {}, 
   435596, 
   null, 
   1311823980.0
  ], 
  [
   435675, 
   null, 
   "Xenamnes", 
   "Rather interesting really. However the difference between the reported tornado outbreak, and the biblical examples of smiting being referred to as warnings to others, seem difficult to reconcile.\n \n Why was neither manufacturing plant destroyed or heavily damaged if this was a warning against gun manufacturers and owners that God is angry with them?", 
   {}, 
   435619, 
   null, 
   1311892260.0
  ], 
  [
   435678, 
   null, 
   "Stonewall", 
   "Rather interesting really. However the difference between the reported tornado outbreak, and the biblical examples of smiting being referred to as warnings to others, seem difficult to reconcile.\n \n Why was neither manufacturing plant destroyed or heavily damaged if this was a warning against gun manufacturers and owners that God is angry with them?\n\n \n The Lord works in mysterious ways.", 
   {}, 
   435675, 
   null, 
   1311893220.0
  ], 
  [
   435680, 
   null, 
   "Easyrider", 
   "All I can do to that statement is ROFLMAO...emoticon_xangelemoticon_xangel\n\n \n You don't have to roll around on the floor to do that. Just open your pie hole.", 
   {}, 
   434724, 
   null, 
   1311893580.0
  ], 
  [
   435727, 
   null, 
   "pappillion001", 
   "Rather interesting really. However the difference between the reported tornado outbreak, and the biblical examples of smiting being referred to as warnings to others, seem difficult to reconcile.\n \n Why was neither manufacturing plant destroyed or heavily damaged if this was a warning against gun manufacturers and owners that God is angry with them?\n\n \n To God they are all guilty, but if he had sent a tornado strong enough to destroy the gun plants many more would have died. As it was much of the damage came from trees and the collapse of taller buildings and homes not intended to withstand that kind of force.", 
   {}, 
   435675, 
   null, 
   1311926340.0
  ], 
  [
   435745, 
   null, 
   "Xenamnes", 
   "An interesting explanation of the events that happened. However more questions are raised rather than answered. Specifically, how does one go about differentiating the natural disasters that were sent by God to punish firearm owners, manufacturers, licensed dealers and NRA backed politicians, from those that strike locations with greater firearms restrictions?\n \n California has been the unfortunate recipient of numerous natural disasters in recent history. Flooding, drought, forest fires, mudslides, earthquakes, tornadoes and multiple others.", 
   {}, 
   435727, 
   null, 
   1311951240.0
  ], 
  [
   435773, 
   null, 
   "Stonewall", 
   "An interesting explanation of the events that happened. However more questions are raised rather than answered. Specifically, how does one go about differentiating the natural disasters that were sent by God to punish firearm owners, manufacturers, licensed dealers and NRA backed politicians, from those that strike locations with greater firearms restrictions?\n \n California has been the unfortunate recipient of numerous natural disasters in recent history. Flooding, drought, forest fires, mudslides, earthquakes, tornadoes and multiple others.\n\n \n Oh that's easy. You just differentiate based on your agenda.", 
   {}, 
   435745, 
   null, 
   1311964740.0
  ], 
  [
   435780, 
   null, 
   "pappillion001", 
   "An interesting explanation of the events that happened. However more questions are raised rather than answered. Specifically, how does one go about differentiating the natural disasters that were sent by God to punish firearm owners, manufacturers, licensed dealers and NRA backed politicians, from those that strike locations with greater firearms restrictions?\n \n California has been the unfortunate recipient of numerous natural disasters in recent history. Flooding, drought, forest fires, mudslides, earthquakes, tornadoes and multiple others.\n\n \n Sins are punished on a first come first serve basis and each carries its own punishment based on what it is, severity and occurance. Also God likes to test us by sometimes rewarding sinners or he sometimes just washes has hands of them and makes them continue to sin. \n \n It isn't hard to understand you just simply have to have faith your a miserable wretched mistake that God tolerates because his son took pity on us and now like feeding a stray we won't go away. Oh and if you question this its because your the Devil. emoticon_xangel", 
   {}, 
   435745, 
   null, 
   1311973800.0
  ], 
  [
   435792, 
   null, 
   "sinjin", 
   "It's pretty obvious God hates rural people more than city folk.:p", 
   {}, 
   435780, 
   null, 
   1311985020.0
  ], 
  [
   435852, 
   null, 
   "simone", 
   "An interesting explanation of the events that happened. However more questions are raised rather than answered. Specifically, how does one go about differentiating the natural disasters that were sent by God to punish firearm owners, manufacturers, licensed dealers and NRA backed politicians, from those that strike locations with greater firearms restrictions?\n \n California has been the unfortunate recipient of numerous natural disasters in recent history. Flooding, drought, forest fires, mudslides, earthquakes, tornadoes and multiple others.\n\n Ahrnold was the guv, maybe? Are guns restricted in any manner in California?", 
   {}, 
   435745, 
   null, 
   1312053780.0
  ], 
  [
   435859, 
   null, 
   "Xenamnes", 
   "First I am regarded as an alien machine incapable of understanding by Simone, and now I am regarded as the devil by Pappillion. Rather interesting.\n \n \nAhrnold was the guv, maybe? Are guns restricted in any manner in California?\n\n \n Quite extensively really. The laws restricting gun sales, ownership and use in the state of California are numerous in nature and quite restrictive. To give a comprehensive list would be an exhaustive endeavor better suited for Sinjin as he is a native of California.\n [*]All handgun sales are subject to state authorized permission for ownership, termed a \"certificate\" but still an example of needing to obtain a permit first.\n [*]Any firearm that fits the broad and overreaching criteria for qualifying as an \"assault weapon\" is banned from sale or ownership to private citizens. In recent history the defining characteristics have been expanded to include bolt-action and single shot rifles of specific caliber despite lacking other features necessary for classification.\n [*]All firearms are required to be locked up and made inaccessible to nearly everyone, this extends even to firearms designated as primary defensive tools in event of home invasion.\n [*]Handgun sales are limited strictly to one sale in a 30 day period per person. All sales are subject to FFL oversight and record keeping.\n [*]All handguns must be registered with state authorities and logged into a database of ownership records.\n [*]Concealed carry, for all intents and purposes, does not exist.\n [*]The sale of handguns may be restricted by color or metal finish, as dictated by California's handgun safety roster.\n [*]All new handguns must be equipped with proprietary and proven unreliable micostamping technology or their sale will be prohibited on the basis of being \"unsafe\" even though they conform to other standards of safety.\n [*]Even if a particular model handgun has been selected as the official service sidearm of a police department or military organization, it still cannot be sold within the state of California unless it meets the specific criteria set by the state.\n These are just a few examples of the laws that exist in California.", 
   {}, 
   435852, 
   null, 
   1312056960.0
  ], 
  [
   435933, 
   null, 
   "pappillion001", 
   "First I am regarded as an alien machine incapable of understanding by Simone, and now I am regarded as the devil by Pappillion. Rather interesting.\n\n \n I don't regard you as the Devil. I was just pointing out the Christian position on those who question the authority of scripture. If it is any consolation I would be considered The Devil as well\n \n \nQuite extensively really. The laws restricting gun sales, ownership and use in the state of California are numerous in nature and quite restrictive. To give a comprehensive list would be an exhaustive endeavor better suited for Sinjin as he is a native of California.\n [*]All handgun sales are subject to state authorized permission for ownership, termed a \"certificate\" but still an example of needing to obtain a permit first.\n [*]Any firearm that fits the broad and overreaching criteria for qualifying as an \"assault weapon\" is banned from sale or ownership to private citizens. In recent history the defining characteristics have been expanded to include bolt-action and single shot rifles of specific caliber despite lacking other features necessary for classification.\n [*]All firearms are required to be locked up and made inaccessible to nearly everyone, this extends even to firearms designated as primary defensive tools in event of home invasion.\n [*]Handgun sales are limited strictly to one sale in a 30 day period per person. All sales are subject to FFL oversight and record keeping.\n [*]All handguns must be registered with state authorities and logged into a database of ownership records.\n [*]Concealed carry, for all intents and purposes, does not exist.\n [*]The sale of handguns may be restricted by color or metal finish, as dictated by California's handgun safety roster.\n [*]All new handguns must be equipped with proprietary and proven unreliable micostamping technology or their sale will be prohibited on the basis of being \"unsafe\" even though they conform to other standards of safety.\n [*]Even if a particular model handgun has been selected as the official service sidearm of a police department or military organization, it still cannot be sold within the state of California unless it meets the specific criteria set by the state.\n These are just a few examples of the laws that exist in California.\n\n \n There was a period of time in California specifically in larger gang infested cities, LA, Oakland, S San Diego, where crimes committed with a gun were ridiculously high. The primary or at least second biggest reason for having a gun is for hunting in many parts of the US. California is not one of those states. The protection argument wasn't much better because most of the guns on the street had been stolen. Guns bought for protection were being used illegally more than for protection. Lastly we have a large number of sandal wearing, bark eating, bearded peace loving hippie freaks in the state. Although I have to grudgingly agree that as a whole we have not shown the responsibility that would merit an easing of gun control.", 
   {}, 
   435859, 
   null, 
   1312113660.0
  ], 
  [
   435937, 
   null, 
   "Matthew S", 
   "First I am regarded as an alien machine incapable of understanding by Simone, and now I am regarded as the devil by Pappillion. Rather interesting.\n \n \n \n Quite extensively really. The laws restricting gun sales, ownership and use in the state of California are numerous in nature and quite restrictive. To give a comprehensive list would be an exhaustive endeavor better suited for Sinjin as he is a native of California.\n [*]All handgun sales are subject to state authorized permission for ownership, termed a \"certificate\" but still an example of needing to obtain a permit first.\n [*]Any firearm that fits the broad and overreaching criteria for qualifying as an \"assault weapon\" is banned from sale or ownership to private citizens. In recent history the defining characteristics have been expanded to include bolt-action and single shot rifles of specific caliber despite lacking other features necessary for classification.\n [*]All firearms are required to be locked up and made inaccessible to nearly everyone, this extends even to firearms designated as primary defensive tools in event of home invasion.\n [*]Handgun sales are limited strictly to one sale in a 30 day period per person. All sales are subject to FFL oversight and record keeping.\n [*]All handguns must be registered with state authorities and logged into a database of ownership records.\n [*]Concealed carry, for all intents and purposes, does not exist.\n [*]The sale of handguns may be restricted by color or metal finish, as dictated by California's handgun safety roster.\n [*]All new handguns must be equipped with proprietary and proven unreliable micostamping technology or their sale will be prohibited on the basis of being \"unsafe\" even though they conform to other standards of safety.\n [*]Even if a particular model handgun has been selected as the official service sidearm of a police department or military organization, it still cannot be sold within the state of California unless it meets the specific criteria set by the state.\n These are just a few examples of the laws that exist in California.\n\n \n but they are still able to sell guns correct?", 
   {}, 
   435859, 
   null, 
   1312119360.0
  ], 
  [
   435946, 
   null, 
   "Xenamnes", 
   "There was a period of time in California specifically in larger gang infested cities, LA, Oakland, S San Diego, where crimes committed with a gun were ridiculously high. The primary or at least second biggest reason for having a gun is for hunting in many parts of the US. California is not one of those states. The protection argument wasn't much better because most of the guns on the street had been stolen. Guns bought for protection were being used illegally more than for protection. Lastly we have a large number of sandal wearing, bark eating, bearded peace loving hippie freaks in the state. Although I have to grudgingly agree that as a whole we have not shown the responsibility that would merit an easing of gun control.\n\n \n I am not certain I see the relevancy of this statement. Are there not still high instances of criminal action with firearms, such as drive by shootings and random murders?\n \n Simply because those using guns illegally claimed they acquired them for the purpose of protection means nothing. The criminal element is not known for being particularly truthful and forthcoming. Shooting someone in a drug deal gone bad is not what would be considered a justified example of self defense since the act was brought about as a result of criminal actions in the first place.", 
   {}, 
   435933, 
   null, 
   1312127520.0
  ], 
  [
   435947, 
   null, 
   "Xenamnes", 
   "but they are still able to sell guns correct?\n\n \n Simply because California is unable to completely stop the sale of firearms to the populace in a broad manner similar to Chicago and the District of Columbia, does not mean that their restrictions are minor or reasonable in nature. The current assortment of firearms that are legal for sale in California is quite limited, and if the microstamping legislation is allowed to remain and become enforced that assortment will shrink even further. It may also violate federal law and result in a lawsuit the state is simply unable to afford.\n \n However these points were not made for invoking a discussion about the questionable laws of California. Simone asked if guns were restricted in any manner in California and she was given several examples as answers.\n \n It is now Simone's turn to answer how the natural disasters in Arizona are the result of God's fury over its lack of gun control laws, while at the same time the natural disasters in California are not the result of God's fury in regard to gun control.", 
   {}, 
   435937, 
   null, 
   1312127880.0
  ], 
  [
   435956, 
   null, 
   "pappillion001", 
   "I am not certain I see the relevancy of this statement. Are there not still high instances of criminal action with firearms, such as drive by shootings and random murders?\n\n \n No drastic decline\n \n \n \nSimply because those using guns illegally claimed they acquired them for the purpose of protection means nothing. The criminal element is not known for being particularly truthful and forthcoming. Shooting someone in a drug deal gone bad is not what would be considered a justified example of self defense since the act was brought about as a result of criminal actions in the first place.\n\n \n Seriously?\n \n No! People bought them legally and crooks stole the guns from them and then committed other crimes with the stolen guns. \n \n Make more sense?", 
   {}, 
   435946, 
   null, 
   1312134480.0
  ], 
  [
   435957, 
   null, 
   "pappillion001", 
   "Simply because California is unable to completely stop the sale of firearms to the populace in a broad manner similar to Chicago and the District of Columbia, does not mean that their restrictions are minor or reasonable in nature. The current assortment of firearms that are legal for sale in California is quite limited, and if the microstamping legislation is allowed to remain and become enforced that assortment will shrink even further. It may also violate federal law and result in a lawsuit the state is simply unable to afford.\n \n However these points were not made for invoking a discussion about the questionable laws of California. Simone asked if guns were restricted in any manner in California and she was given several examples as answers.\n \n It is now Simone's turn to answer how the natural disasters in Arizona are the result of God's fury over its lack of gun control laws, while at the same time the natural disasters in California are not the result of God's fury in regard to gun control.\n\n \n Not all natural disasters are because of the lack of gun control. That seems the obvious answer. As you recall God punishes for many reasons and in many ways. Sometimes the innocent get punished along with the guilty sometimes he waits for a period of time after and sometimes not. \n \n God says what you can and can't do. You know when you don't do that. By misbehaving your subject to punishment at God's discretion.\n \n So you will never know which fire, or flood or tornado is punishment for what sin or who by. You just know all man is deserving of punishment and God being just and Holy fulfills his obligation to enforce the rules.", 
   {}, 
   435947, 
   null, 
   1312134900.0
  ], 
  [
   435959, 
   null, 
   "Stonewall", 
   "I don't regard you as the Devil. I was just pointing out the Christian position on those who question the authority of scripture. If it is any consolation I would be considered The Devil as well\n \n \n \n There was a period of time in California specifically in larger gang infested cities, LA, Oakland, S San Diego, where crimes committed with a gun were ridiculously high. The primary or at least second biggest reason for having a gun is for hunting in many parts of the US. California is not one of those states. The protection argument wasn't much better because most of the guns on the street had been stolen. Guns bought for protection were being used illegally more than for protection. Lastly we have a large number of sandal wearing, bark eating, bearded peace loving hippie freaks in the state. Although I have to grudgingly agree that as a whole we have not shown the responsibility that would merit an easing of gun control.\n\n \n There's actually quite a bit of hunting in California... people seem to forget the northern parts of the state.", 
   {}, 
   435933, 
   null, 
   1312136340.0
  ], 
  [
   435962, 
   null, 
   "Xenamnes", 
   "No! People bought them legally and crooks stole the guns from them and then committed other crimes with the stolen guns. \n \n Make more sense?\n\n \n That is hardly sufficient justification for implementing more restrictive gun laws.", 
   {}, 
   435956, 
   null, 
   1312137660.0
  ], 
  [
   435963, 
   null, 
   "Xenamnes", 
   "Not all natural disasters are because of the lack of gun control. That seems the obvious answer. As you recall God punishes for many reasons and in many ways. Sometimes the innocent get punished along with the guilty sometimes he waits for a period of time after and sometimes not. \n \n God says what you can and can't do. You know when you don't do that. By misbehaving your subject to punishment at God's discretion.\n \n So you will never know which fire, or flood or tornado is punishment for what sin or who by. You just know all man is deserving of punishment and God being just and Holy fulfills his obligation to enforce the rules.\n\n \n Then it would seem Simone's reason for starting this thread is without basis or relevancy. If mankind is truly incapable of telling which natural disasters are punishment from God, and which are random acts of nature, then it would seem quite dishonest to claim Arizona is being punished by God for a lack of gun control laws.", 
   {}, 
   435957, 
   null, 
   1312137780.0
  ], 
  [
   435968, 
   null, 
   "Matthew S", 
   "Then it would seem Simone's reason for starting this thread is without basis or relevancy. If mankind is truly incapable of telling which natural disasters are punishment from God, and which are random acts of nature, then it would seem quite dishonest to claim Arizona is being punished by God for a lack of gun control laws.\n\n \n OH please the real reason God is visiting the place with natural disasters is because gay people and gay activity, just ask any christianist. We HAVE THE POWER. Has nothing to do with guns.", 
   {}, 
   435963, 
   null, 
   1312141920.0
  ], 
  [
   435980, 
   null, 
   "Xenamnes", 
   "Homosexuality is irrelevant to this discussion. It has no place in a debate about whether or not guns are tools of Satan, and God is sending natural disasters to the state of Arizona to punish them for their lack of strict gun control laws.", 
   {}, 
   435968, 
   null, 
   1312150020.0
  ], 
  [
   435981, 
   null, 
   "Matthew S", 
   "Homosexuality is irrelevant to this discussion. It has no place in a debate about whether or not guns are tools of Satan, and God is sending natural disasters to the state of Arizona to punish them for their lack of strict gun control laws.\n\n \n However you are talking about God sending natural disasters because of human actions and according to a plenitude of christianist preachers homosexuality always trumps all other reasons. Just ask Cindi Jacobs, or Rick Joyner.\n \n However if you prefer I can offer this\n God and Guns: The Bible and Gun Ownership: Ezekiel 16 - John 8\n \n \nEzekiel 35:4-5\n 4 I will lay thy cities waste, and thou shalt be desolate,\n and thou shalt know that I [am] the LORD.\n 5 Because thou hast had a perpetual hatred, and hast shed\n [the blood of] the children of Israel by the force of the\n sword in the time of their calamity, in the time [that\n their] iniquity [had] an end:\n \n \n\n \n Pretty much says God favors gun control to me.", 
   {}, 
   435980, 
   null, 
   1312152720.0
  ], 
  [
   436018, 
   null, 
   "pappillion001", 
   "That is hardly sufficient justification for implementing more restrictive gun laws.\n\n \n CA lawmakers disagree", 
   {}, 
   435962, 
   null, 
   1312197840.0
  ], 
  [
   436026, 
   null, 
   "Xenamnes", 
   "CA lawmakers disagree\n\n \n The lawmakers in California are most certainly an interesting bunch. The number of things they have passed laws against in the past is quite a wide range of everyday goods, such as the use of brass in plumbing because it contains minute traces of lead.\n \n But simply because they have chosen to implement bans to satisfy their numerous special interest groups at the expense of common sense does not mean that they're correct in their approach, or that theirs is the proper way of going about and doing things.\n \n The reasons California gives are similar to what Chicago and the District of Columbia offered up in defense of their laws. However their laws were shot down by the Supreme Court. California may be the next to follow.\n \n The number of items that can be misused for criminal purposes truly has no limit. It would seem foolish to continue allowing California to use this justification for whatever law they want whenever they wish.", 
   {}, 
   436018, 
   null, 
   1312210860.0
  ], 
  [
   436049, 
   null, 
   "Matthew S", 
   "\n The number of items that can be misused for criminal purposes truly has no limit. It would seem foolish to continue allowing California to use this justification for whatever law they want whenever they wish.\n\n \n \n However it is with in their constitutional right to do so. See the tenth amendment.", 
   {}, 
   436026, 
   null, 
   1312242840.0
  ], 
  [
   436116, 
   null, 
   "pappillion001", 
   "The lawmakers in California are most certainly an interesting bunch. The number of things they have passed laws against in the past is quite a wide range of everyday goods, such as the use of brass in plumbing because it contains minute traces of lead.\n\n \n Interesting as in watching kids in a sandbox with 2 toys fewer than children who think nobody is watching.\n \n \nBut simply because they have chosen to implement bans to satisfy their numerous special interest groups at the expense of common sense does not mean that they're correct in their approach, or that theirs is the proper way of going about and doing things\n.\n \n Find me 2 politicians that believe that.\n \n \nThe reasons California gives are similar to what Chicago and the District of Columbia offered up in defense of their laws. However their laws were shot down by the Supreme Court. California may be the next to follow.\n\n \n :p In California they would have sent them to jail for shooting them.\n \n \nThe number of items that can be misused for criminal purposes truly has no limit. It would seem foolish to continue allowing California to use this justification for whatever law they want whenever they wish.\n\n \n They watched MacGyver and got scared", 
   {}, 
   436026, 
   null, 
   1312353600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  God's Wrath Visited Upon Arizona", 
  "url": "http://www.4forums.com/political/religion-debates/15466-gods-wrath-visited-upon-arizona.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 15466, 
  "discussion_files": [
   [
    "121.html", 
    "http://www.4forums.com/political/religion-debates/15466-gods-wrath-visited-upon-arizona-print.html"
   ], 
   [
    "122.html", 
    "http://www.4forums.com/political/religion-debates/15466-gods-wrath-visited-upon-arizona-7-print.html"
   ], 
   [
    "123.html", 
    "http://www.4forums.com/political/religion-debates/15466-gods-wrath-visited-upon-arizona-5-print.html"
   ], 
   [
    "124.html", 
    "http://www.4forums.com/political/religion-debates/15466-gods-wrath-visited-upon-arizona-4-print.html"
   ], 
   [
    "125.html", 
    "http://www.4forums.com/political/religion-debates/15466-gods-wrath-visited-upon-arizona-6-print.html"
   ], 
   [
    "126.html", 
    "http://www.4forums.com/political/religion-debates/15466-gods-wrath-visited-upon-arizona-3-print.html"
   ], 
   [
    "127.html", 
    "http://www.4forums.com/political/religion-debates/15466-gods-wrath-visited-upon-arizona-2-print.html"
   ]
  ], 
  "identifier": 15466
 }
]