[
 [
  [
   433727, 
   null, 
   "jyoshu", 
   "A federal court in Tacoma, Wash., has been asked to order that the names of signatories of a state petition seeking to protect traditional marriage be redacted to protect them from death threats from homosexual activists.\n \n \"What is becoming increasingly evident,\" said James Bopp of the James Madison Center, \"is that some groups and individuals, certainly a minority, have resorted to advancing their cause, not by debating the merits of the issue but by discouraging participation in the democratic process itself.\n \n \"The First Amendment was designed to ensure that all groups, whatever their persuasion, could participate fully in our republic,\" he said. That breaks down when some groups or individuals are cowed into silence for fear that they or their families will be targeted or threatened if they speak up.\"\n \n The issue is the some 138,000 Washington state residents who signed a petition in 2009 to repeal a law that gave same-sex partners all the legal rights of married couples. The petition forced a referendum vote in November of that year in which voters decided to sustain the law.\n \n But because the state considers such petitions \"public records,\" homosexual activists are demanding the names and addresses of the signers in order to post them on the Internet and \"publicize on their web sites, in searchable format, the identities of every person who signed the &#8230; petition,\" according to a new filing seeking nondisclosure of the names.\n \n The groups announcing the plans were KnowThyNeighbor.org and WhoSigned.org, according to the filing.\n \n The filing on behalf of Protect Marriage Washington explains the real problem is the documentation of actual threats that have been made against those who support traditional marriage, a litany of what the Los Angeles Times described as a \"vengeful campaign.\"\n \n Among the documented threats:\n \n  \"I will kill you and your family.\"\n \n \"Oh my God, This woman is so f---ing stupid. Someone please shoot her in the head, again and again. And again.\"\n \n \"I'm going to kill the pastor.\"\n \n \"If I had a gun I would have gunned you down along with each and every other supporter&#8230;\"\n \n \"We're going to kill you.\"\n \n \"You're dead. Maybe not today, maybe not tomorrow, but soon &#8230; you're dead.\"\n \n \"I'm a gay guy who owns guns, and he's my next target.\"\n \n \"I warn you, I know how to kill, I'm an ex-special forces person.\"\n \n \"Get ready for retribution all you bigots.\"\n \n Burn their f---ing churches to the ground, and then tax the charred timbers.\"\n \n\n \n Support traditional marriage? 'You're dead'\n \n Citizens to Federal Court: Do Not Allow Government to Release Petition Names | Press Releases\n \n Sad thing is, if it were death threats against gay priders, it would be all over the news. After all, sorta like Anthony Weiner stories ... emoticon_rolleyes", 
   {
    "post_info": {
     "post_title": "Death threats by gay-priders"
    }
   }, 
   null, 
   null, 
   1309794300.0
  ], 
  [
   433730, 
   null, 
   "poet", 
   "Support traditional marriage? 'You're dead'\n \n Citizens to Federal Court: Do Not Allow Government to Release Petition Names | Press Releases\n \n Sad thing is, if it were death threats against gay priders, it would be all over the news. After all, sorta like Anthony Weiner stories ... emoticon_rolleyes\n\n \n Case in point. You're obsessed. I rest my case. LOL\n \n Girl, your panties are showing.", 
   {}, 
   433727, 
   null, 
   1309794720.0
  ], 
  [
   433735, 
   null, 
   "jyoshu", 
   "Poet, no comment about the death threats, eh? Figures.", 
   {}, 
   433730, 
   null, 
   1309795740.0
  ], 
  [
   433738, 
   null, 
   "Accipiter", 
   "I bet the list of death threats to gay people from christians is longer.", 
   {}, 
   433735, 
   null, 
   1309798500.0
  ], 
  [
   433746, 
   null, 
   "Matthew S", 
   "Poet, no comment about the death threats, eh? Figures.\n\n \n If they don't want their names and address made public they should not have signed a public record.\n \n http://news.change.org/stories/when-glenn-beck-fans-issue-death-threats-to-gay-people", 
   {}, 
   433735, 
   null, 
   1309807560.0
  ], 
  [
   433747, 
   null, 
   "gansao", 
   "\"I warn you, I know how to kill, I'm an ex-special forces person\" I bet Poet sent that one :)", 
   {}, 
   433746, 
   null, 
   1309810380.0
  ], 
  [
   433750, 
   null, 
   "jyoshu", 
   "If they don't want their names and address made public they should not have signed a public record.\n\n \n Do you condone or condemn the death threats in the article?", 
   {}, 
   433746, 
   null, 
   1309811100.0
  ], 
  [
   433759, 
   null, 
   "Matthew S", 
   "Do you condone or condemn the death threats in the article?\n\n \n Depends, most people who sign these initiative proposals to vote upon civil rights of a minority, are evil and no better then the German public who gave power to the Nazi party. They are just as evil as the white apartheid racists in the south. They are just as evil as the puritans in Salem who put people on trial for witch craft. So do I condone these death threats depends would it get rid of a great evil if one where to go back and kill Hitler?\n \n but that is beside the point.\n \n The ones screaming the loudest about these threats are the ones who say the believe in democracy. When you put your name on a ballot initiative you are signing a public record. The public's right to know when it comes to public records is a paramount pillar of democracy. It does not matter if there are death threats or not. If you don't want your name and address published don't sign the paper.", 
   {}, 
   433750, 
   null, 
   1309818540.0
  ], 
  [
   433760, 
   null, 
   "Freedom", 
   "\"I warn you, I know how to kill, I'm an ex-special forces person\" I bet Poet sent that one :)\n\n He is surely dangerous :p\n \n \nDo you condone or condemn the death threats in the article?\n\n Not tactically, nor in this case because it is not a violation of anyones rights to support traditional marriage; but I do condone the use of violence to defend one's rights.", 
   {}, 
   433759, 
   null, 
   1309823400.0
  ], 
  [
   433761, 
   null, 
   "poet", 
   "Poet, no comment about the death threats, eh? Figures.\n\n \n Please. When you're concerned about the death threats aimed at President Obama, I'll be concerned about some queens that give as good as they get. \n Some gay folks are not to be \"played with\". I thought you knew.", 
   {}, 
   433735, 
   null, 
   1309823700.0
  ], 
  [
   433762, 
   null, 
   "poet", 
   "\"I warn you, I know how to kill, I'm an ex-special forces person\" I bet Poet sent that one :)\n\n \n Ex-forces....excuse me, but my opinion of the military is low. I kill with words...", 
   {}, 
   433747, 
   null, 
   1309823760.0
  ], 
  [
   433765, 
   null, 
   "Freedom", 
   "I kill with words...\n\n They certainly have caused me pain.", 
   {}, 
   433762, 
   null, 
   1309824000.0
  ], 
  [
   433775, 
   null, 
   "poet", 
   "They certainly have caused me pain.\n\n \n Mission accomplished.", 
   {}, 
   433765, 
   null, 
   1309825200.0
  ], 
  [
   433793, 
   null, 
   "jyoshu", 
   "The ones screaming the loudest about these threats are the ones who say the believe in democracy. When you put your name on a ballot initiative you are signing a public record. The public's right to know when it comes to public records is a paramount pillar of democracy. It does not matter if there are death threats or not. If you don't want your name and address published don't sign the paper.\n\n \n So in other words you can't bring yourself to condemn hateful acts if they are members of your movement. I agree laws shouldn't be enacted to single out gay marriage, but threatening to kill someone is worse act, by far. Not to mention it illustrates hypocrisy in your ranks when you don't condemn hate speech on one hand and do on the other.", 
   {}, 
   433759, 
   null, 
   1309884480.0
  ], 
  [
   433795, 
   null, 
   "Xenamnes", 
   "As we have seen both the liberal and the conservative sides are capable of extreme hatred for others and have no qualms about engaging in tactics best favored by terrorists. Yet only those connected to the conservative side of the argument ever make the news. The various crimes and atrocities committed by liberals and minorities never seem to make the news, rather they're portrayed as exclusively victims who wish to live in peace with everyone else.\n \n Such is not the case.", 
   {}, 
   433793, 
   null, 
   1309889340.0
  ], 
  [
   433796, 
   null, 
   "Xcaliber", 
   "As we have seen both the liberal and the conservative sides are capable of extreme hatred for others and have no qualms about engaging in tactics best favored by terrorists. Yet only those connected to the conservative side of the argument ever make the news. The various crimes and atrocities committed by liberals and minorities never seem to make the news, rather they're portrayed as exclusively victims who wish to live in peace with everyone else.\n \n Such is not the case.\n\n \n Maybe they don't make the news because they don't happen as often . You can bet money if Liberals were doing the sort of things Conservatives do to \"make the news\" we would have conservative news channels like FOX NEWS all over it... yet we don't. Maybe it's because the Radical Right is far more radical than the left. I'm not saying it doesn't happen, just that it happens less frequently on the left.", 
   {}, 
   433795, 
   null, 
   1309891380.0
  ], 
  [
   433797, 
   null, 
   "Xenamnes", 
   "In today's media saturated world where twitter posts are noteworthy on CNN and other news outlets, the likelihood of death threats from the gay community not making the news due to rarity seems highly unlikely to be the logical reason.", 
   {}, 
   433796, 
   null, 
   1309894800.0
  ], 
  [
   433805, 
   null, 
   "gansao", 
   "Ex-forces....excuse me, but my opinion of the military is low. I kill with words...\n\n \n You have nearly bored me to death once or twice:)", 
   {}, 
   433762, 
   null, 
   1309904520.0
  ], 
  [
   433807, 
   null, 
   "gansao", 
   "So in other words you can't bring yourself to condemn hateful acts if they are members of your movement. I agree laws shouldn't be enacted to single out gay marriage, but threatening to kill someone is worse act, by far. Not to mention it illustrates hypocrisy in your ranks when you don't condemn hate speech on one hand and do on the other.\n\n \n I reckon its BS in the highest order.\n If a homosexual was known to have killed or injured someone who signed a ballot against gay marriage there would be a backlash from the gay haters.\n Also its against type.Gays are better off playing the victim...its worked up to now", 
   {}, 
   433793, 
   null, 
   1309905000.0
  ], 
  [
   433813, 
   null, 
   "Matthew S", 
   "So in other words you can't bring yourself to condemn hateful acts if they are members of your movement. I agree laws shouldn't be enacted to single out gay marriage, but threatening to kill someone is worse act, by far. Not to mention it illustrates hypocrisy in your ranks when you don't condemn hate speech on one hand and do on the other.\n\n \n They are the evil ones on par with the German people who put Hitler and the Nazi's into power in the 1930's. \n \n \n It goes both ways\n \n Ding dong Sarah Connor?\n \n Besides the fear they show is the fear every openly gay person lives with every day. Will today be the day that the red necks break down my door and drag me behind their truck. So waaaaa waaaaa for the christianists they started this war they can just live with the consequences.", 
   {}, 
   433793, 
   null, 
   1309906140.0
  ], 
  [
   433824, 
   null, 
   "Xenamnes", 
   "No gay person has a right or excuse to issue death threats to gay marriage opponents. Unlike Clint Eastwood's character in \"Unforgiven\" no person may get away with stating that they will kill you, your friends, your family, your classmates, your dog, burn down your house, etc. for having an opposing view of politics.\n \n They ask for tolerance and acceptance of their ways, practices and lifestyles. Yet they refuse to show the same qualities to people who disagree with them. They have no desire to be the bigger person of the two.", 
   {}, 
   433813, 
   null, 
   1309912500.0
  ], 
  [
   433830, 
   null, 
   "Matthew S", 
   "They ask for tolerance and acceptance of their ways, practices and lifestyles. Yet they refuse to show the same qualities to people who disagree with them. They have no desire to be the bigger person of the two.\n\n \n It is one thing to disagree. It is quite another to wage war against the civil and human rights of a minority.\n \n The people who put these anti gay measures on the ballot hate gay people, they do not want us to exist. Yet we are the ones being vilified when the real enemy are the christianists.\n \n We are not the ones out their trying to tear their families apart, fire them from their jobs, or out their passing anti christian laws. Their noose is around my neck and you are saying that we should not complain about the lynching.", 
   {}, 
   433824, 
   null, 
   1309916760.0
  ], 
  [
   433832, 
   null, 
   "Xenamnes", 
   "You suggest that gay people are the true victims, and the true victims exclusively. Yet we have gays issuing death threats to the point that names of gay marriage opponents need to be withheld for their own protection.\n \n Regardless of your willingness to address the fact that death threats were made, their existence is a matter of fact. And under US law death threats against anyone are a criminal offense punishable by a prison sentence.\n \n Simply because you dislike the facts doesn't mean you can pretend they don't exist and go without addressing them.\n \n The people of the United States have the right to seek redress of grievances with the government. They have the right to seek change and the passage of bills they find favorable. However the opposition doesn't have the right to silence legitimate debate under threat of death or great bodily harm. And the latter is exactly what the gays are doing in this case.", 
   {}, 
   433830, 
   null, 
   1309917480.0
  ], 
  [
   433834, 
   null, 
   "Freedom", 
   "The people of the United States have the right to seek redress of grievances with the government. They have the right to seek change and the passage of bills they find favorable. However the opposition doesn't have the right to silence legitimate debate under threat of death or great bodily harm. And the latter is exactly what the gays are doing in this case.\n\n Humans have a right and a duty to defend their rights and the rights of others by any means necessary. This country was born on that premise so don't start blathering about laws. If a law was moral it needs no special recognition and defense for it is defended along with morality, but it if is immoral it must be destroyed and ignored for what it is a baseless assertion.\n \n You can't win moral arguments by appeal to the law because the law is what appears when a moral agreement has been reached not the other way around.\n \n Now in this particular case homosexuals rights are not being violated any more than anyone else so it really isn't legitimate, but you speak as if it was the threat of violence itself and not the mistake about a violation that was the problem.", 
   {}, 
   433832, 
   null, 
   1309918140.0
  ], 
  [
   433837, 
   null, 
   "Xenamnes", 
   "I speak about the fact that death threats were made by the gay community against opponents of gay marriage. Perhaps I need to bold the \"death threats\" part to make it understandable by everyone who has an opinion to offer up.\n \n Threatening to murder someone with intent to carry it out is a terrorist threat, a felony punishable by ten years in prison. Making a hoax statement about a threat to murder someone is punishable by five years in prison.\n \n You have made the claim that humans have a right and a duty to defend their rights and the rights of others by any means necessary. However I don't see the homosexual community making any such efforts to fulfill this duty. Rather they seem to be pushing for preferential treatment at the expense of the rights of all others.", 
   {}, 
   433834, 
   null, 
   1309920900.0
  ], 
  [
   433841, 
   null, 
   "Matthew S", 
   "You suggest that gay people are the true victims, and the true victims exclusively. Yet we have gays issuing death threats to the point that names of gay marriage opponents need to be withheld for their own protection.\n \n Regardless of your willingness to address the fact that death threats were made, their existence is a matter of fact. And under US law death threats against anyone are a criminal offense punishable by a prison sentence.\n \n Simply because you dislike the facts doesn't mean you can pretend they don't exist and go without addressing them.\n \n The people of the United States have the right to seek redress of grievances with the government. They have the right to seek change and the passage of bills they find favorable. However the opposition doesn't have the right to silence legitimate debate under threat of death or great bodily harm. And the latter is exactly what the gays are doing in this case.\n\n \n AND the Majority never has the right to put the civil and human rights of a minority up to a popular vote. Death threats are beside the point. The fact that the christianists think that they have a right to deny my civil right by popular referendum is outrageous. \n \n Bottom line if they do want their names and addresses published they should not sign the intuitive. You also forgot that along with the\" The people of the United States have the right to seek redress of grievances with the government. They have the right to seek change and the passage of bills they find favorable\" has a flip side they can not do this in secret or with out public scrutiny. \n \n The travesty is that you are defending my lynching while complaining that I am damaging their rope.", 
   {}, 
   433832, 
   null, 
   1309925100.0
  ], 
  [
   433842, 
   null, 
   "Matthew S", 
   "jyoshu\n \n I will make a deal with you I will denounce the death threats made in the artical when you denounce this terrorist and all those like him.\n \n YouTube - &#x202a;Damon Thompson&#39;s Anti-Gay Message&#x202c;&rlm;\n \n Deal?", 
   {}, 
   433841, 
   null, 
   1309925880.0
  ], 
  [
   433843, 
   null, 
   "E Mutz", 
   "AND the Majority never has the right to put the civil and human rights of a minority up to a popular vote. Death threats are beside the point. The fact that the christianists think that they have a right to deny my civil right by popular referendum is outrageous. \n\n \n And yet this is precisely what happens. Who defines what a right is? We have a very well defined process for this. The citizens or their proxies initiate legislation for either popular approval by the masses or approval of the majority of representatives. These laws may then be reviewed and ultimately decided based on a majority of supreme court justices. So now where would you get the notion that the majority does not vote on matters of rights? Find me a law anywhere that does not somehoe restrict a \"right\". \n \n \nBottom line if they do want their names and addresses published they should not sign the intuitive.\n \n \n Fear is your best tool for advancing your agenda then? \n \n \nYou also forgot that along with the\" The people of the United States have the right to seek redress of grievances with the government. They have the right to seek change and the passage of bills they find favorable\" has a flip side they can not do this in secret or with out public scrutiny. \n\n \n And yet there is no presumption that they must have their addresses bandied about as a blackmail tactic. \n \n\n The travesty is that you are defending my lynching while complaining that I am damaging their rope.\n\n \n The travesty is that you are attempting to use a metaphor which was visited literally against African Americans. It is crass and feeble. But then, if your best methods are labels, violence, and intimidation it should not surprise anyone that you would also stoop to this. Call yourself a martyr while you are at it.", 
   {}, 
   433841, 
   null, 
   1309926300.0
  ], 
  [
   433844, 
   null, 
   "Xenamnes", 
   "The death threats made by the gay community are not beside the point, rather they are the point of this discussion. The gay community has shown that it's just as capable of hatred for others as anyone else, and has no qualms with demonstrating such tactics.\n \n You keep throwing out the notion of christianist hatred for gays as if it means anything here. I'll tell you right now that it doesn't. The old saying is two wrongs don't make a right. Death threats are not excused simply because those issuing them are of the homosexual persuasion.\n \n Your claim of \"if they do want their names and addresses published they should not sign the intuitive\" is simply wrong. A person cannot have their personal information released publicly simply because they choose to engage in politics that are unfavorable to one group or another. Such tactics are a chilling effect on a person's right to partake in political debate and discussion. Use of force, threat of force, or other form of intimidation to hinder legitimate action is not a legally permissible course of action.\n \n I am defending nothing, certainly not your hypothetical lynching. What I am attempting to do is maintain the course of this thread which is the discussion moving away from death threats issued by the gay community to political opponents, and prevent it from degrading into a blame game of \"us vs. them\", of \"gays against the religious nuts\".", 
   {}, 
   433841, 
   null, 
   1309926480.0
  ], 
  [
   433848, 
   null, 
   "Matthew S", 
   "The death threats made by the gay community are not beside the point, rather they are the point of this discussion. The gay community has shown that it's just as capable of hatred for others as anyone else, and has no qualms with demonstrating such tactics.\n \n You keep throwing out the notion of christianist hatred for gays as if it means anything here. I'll tell you right now that it doesn't. The old saying is two wrongs don't make a right. Death threats are not excused simply because those issuing them are of the homosexual persuasion.\n \n Your claim of \"if they do want their names and addresses published they should not sign the intuitive\" is simply wrong. A person cannot have their personal information released publicly simply because they choose to engage in politics that are unfavorable to one group or another. Such tactics are a chilling effect on a person's right to partake in political debate and discussion. Use of force, threat of force, or other form of intimidation to hinder legitimate action is not a legally permissible course of action.\n \n I am defending nothing, certainly not your hypothetical lynching. What I am attempting to do is maintain the course of this thread which is the discussion moving away from death threats issued by the gay community to political opponents, and prevent it from degrading into a blame game of \"us vs. them\", of \"gays against the religious nuts\".\n\n \n Yet this is what we have. The religious right has declared war upon us. Like it or not. A few small not serious threats thrown out as a defense mechanism from the side whose lives are literally at the whim of the christainist majority, pales in comparison to the death threats, and terrorism issued by the religious right against us.", 
   {}, 
   433844, 
   null, 
   1309927500.0
  ], 
  [
   433849, 
   null, 
   "E Mutz", 
   "jyoshu\n \n I will make a deal with you I will denounce the death threats made in the artical when you denounce this terrorist and all those like him.\n \n YouTube - &#x202a;Damon Thompson's Anti-Gay Message&#x202c;&rlm;\n \n Deal?\n\n \n Huh???\n \n I must have missed the part where he issued the death threat...??? Why is this here and what relevance does it have to the argument?", 
   {}, 
   433842, 
   null, 
   1309928040.0
  ], 
  [
   433850, 
   null, 
   "Xenamnes", 
   "You keep claiming that you're the victim here, or that your life exists at the whim of the religious group you hate the most. This is simply not the case regardless of how you may try and spin it. This is not a discussion regarding christians vs gays, this is a discussion about the gay community threatening acts of terrorism because they're upset about the way people have voted.\n \n You fail to realize the simple fact that, despite the perceived hatred and mistreatment you have been made receipt to, that doesn't excuse whatever course of criminal action you choose to take. You are not entitled to claim that you are going to kill people.\n \n You claim the death threats made are small and not serious in nature. You could not be further from the truth. \n \n \n\"If I had a gun I would have gunned you down along with each and every other supporter&#8230;\"\n\n \n \n\"We're going to kill you.\"\n\n \n \n\"You're dead. Maybe not today, maybe not tomorrow, but soon &#8230; you're dead.\"\n\n \n \n\"I'm a gay guy who owns guns, and he's my next target.\"\n\n \n \n\"Burn their f---ing churches to the ground, and then tax the charred timbers.\"\n\n \n This is to say nothing of the property damage administered to the supporters of traditional marriage. The article even mentions having hundreds of pages worth of evidence of threats of violence against those who signed the petition. That hardly sounds small or not serious in nature.\n \n Despite your best attempts I will not let you drag religion into this discussion. It is completely irrelevant and beyond the scope of the matter at hand. The only discussion to be had here is the fact that the gay community has resorted to terrorism against political opponents.", 
   {}, 
   433848, 
   null, 
   1309928460.0
  ], 
  [
   433851, 
   null, 
   "Matthew S", 
   "And yet this is precisely what happens. Who defines what a right is? We have a very well defined process for this. The citizens or their proxies initiate legislation for either popular approval by the masses or approval of the majority of representatives. These laws may then be reviewed and ultimately decided based on a majority of supreme court justices. So now where would you get the notion that the majority does not vote on matters of rights? Find me a law anywhere that does not somehow restrict a \"right\". \n\n \n Nonsense, if this is true then I want to remove the religious freedom from all bible believing Christians. Yet you would argue that I can not because religious freedom is untouchable.\n \n \n \n\n Fear is your best tool for advancing your agenda then?\n\n \n \n No get then out in the open and the light, you bring the bigots out into the light. Bigots don't like to have their bigotry pointed out to them that is way they are crying about a few statements. I have the right to know which of my neighbors wants to destroy my family at the ballot box.\n \n \n \n\n And yet there is no presumption that they must have their addresses bandied about as a blackmail tactic. \n\n \n and once again if they do not like the light of day they should not sign.\n \n\n The travesty is that you are attempting to use a metaphor which was visited literally against African Americans. It is crass and feeble. But then, if your best methods are labels, violence, and intimidation it should not surprise anyone that you would also stoop to this. Call yourself a martyr while you are at it.\n\n \n Tell it to Judy Shepard, whose son was beat and left for dead tied to a fence in the cold Wyoming country side because he was gay. \n \n Or the family of PFC Barry Winchell who had his head bashed in while sleeping on his cot in the barracks because he was gay.\n \n Or the mother of Lawrence King who was shot to death in class because he was gay. \n \n The threats of violence are real against us and carried out every day. It is hardly crass or feeble, to point this out.", 
   {}, 
   433843, 
   null, 
   1309928520.0
  ], 
  [
   433852, 
   null, 
   "Matthew S", 
   "You keep claiming that you're the victim here, or that your life exists at the whim of the religious group you hate the most. This is simply not the case regardless of how you may try and spin it. This is not a discussion regarding christians vs gays, this is a discussion about the gay community threatening acts of terrorism because they're upset about the way people have voted.\n \n You fail to realize the simple fact that, despite the perceived hatred and mistreatment you have been made receipt to, that doesn't excuse whatever course of criminal action you choose to take. You are not entitled to claim that you are going to kill people.\n \n You claim the death threats made are small and not serious in nature. You could not be further from the truth. \n \n \n This is to say nothing of the property damage administered to the supporters of traditional marriage. The article even mentions having hundreds of pages worth of evidence of threats of violence against those who signed the petition. That hardly sounds small or not serious in nature.\n \n Despite your best attempts I will not let you drag religion into this discussion. It is completely irrelevant and beyond the scope of the matter at hand. The only discussion to be had here is the fact that the gay community has resorted to terrorism against political opponents.\n\n \n So you are ignoring the terrorism perpetrated by the religious right against gay people and our families. Religion is the whole reason the ballot initiative existed. No religion = no ballot initiative, no ballot initiative = no threats. Religion and religious hatred of gay people is behind this whole topic, whether you like it or not. You just don't get it they should never been allowed to vote on a civil rights issue to begin with. Civil rights are not ballot issues.", 
   {}, 
   433850, 
   null, 
   1309928940.0
  ], 
  [
   433853, 
   null, 
   "Matthew S", 
   "Huh???\n \n I must have missed the part where he issued the death threat...??? Why is this here and what relevance does it have to the argument?\n\n \n Because him and those like him are terrorists no better then the Taliban you went to Afghanistan to fight. He terrorises and intimidates those kids. He uses fear to obtain his aims. He and those like him would have gay people not exist.", 
   {}, 
   433849, 
   null, 
   1309929300.0
  ], 
  [
   433854, 
   null, 
   "E Mutz", 
   "Because him and those like him are terrorists no better then the Taliban you went to Afghanistan to fight. He terrorises and intimidates those kids. He uses fear to obtain his aims. He and those like him would have gay people not exist.\n\n \n I see. So it would be permissible therefore for you to threaten his life?", 
   {}, 
   433853, 
   null, 
   1309929780.0
  ], 
  [
   433855, 
   null, 
   "Xenamnes", 
   "Your claim that religion is the source of hatred for the gay community is incorrect. Science is sufficient reason for someone to hate the gay community just as much as religion. The only difference is one doesn't quote the word of God but rather points to statistics and data supported by repeatable experiments.\n \n I could easily bring up the AIDS epidemic and how it's linked to members of the gay community having questionable sexual practices. But if I introduced that subject and drew parallels between that and terrorists engaging in the use of biological weapons that would only lend more credibility to you going off topic about christianist hatred.\n \n Simply put I am denying you the opportunity to hijack this thread with the introduction of off topic and irrelevant matters that don't apply to the subject at hand.\n \n The subject at hand is the fact of the gay community engaging in tactics of terrorism because they don't like that people actually voted against gay marriage. That is no excuse for threatening to kill people you don't know and rape their children in retaliation. \n \n There is no room for ranting about religious hatred here. The only discussion to be had is the hatred and intolerance being exercised openly by the gay community, showing that they have no interest in being the more mature group.", 
   {}, 
   433854, 
   null, 
   1309930560.0
  ], 
  [
   433856, 
   null, 
   "E Mutz", 
   "Nonsense, if this is true then I want to remove the religious freedom from all bible believing Christians. Yet you would argue that I can not because religious freedom is untouchable.\n\n \n \n You would go through the exact same process as anyone seeking to make policy. You would gather support for your initiative, move it through the legislative process, see it enacted into law and then argue in favor of the law before the Supreme Court. The fact that your opinion is not one shared by the majority does not make you a martyr nor does it presuppose some sort of evil in your opponents.\n \n \n \n No get then out in the open and the light, you bring the bigots out into the light. Bigots don't like to have their bigotry pointed out to them that is way they are crying about a few statements. I have the right to know which of my neighbors wants to destroy my family at the ballot box.\n\n \n No you do not sir unless you have invented some sort of right to view the votes of citizens as they emerge from the booth. I hardly think folks are shy in expressing their opinions with regard to homosexuality but they need not reveal their home address as a price of having a voice in a representative republic.\n \n \nand once again if they do not like the light of day they should not sign.\n\n \n Marriage licenses and home titles are public records. You would therefore have no objection if opponents of Homosexual marriage in New York took it upon themselves to review the public record for the addresses of homosexuals and took your peculiar approach to getting their point accross? I mean, if you don't want that kind of intimidation you shouldn't get married right? \n \n See, it is not wise to advocate for the injustice that can easily be visited upon you. \n \n \n\n Tell it to Judy Shepard, whose son was beat and left for dead tied to a fence in the cold Wyoming country side because he was gay. \n \n Or the family of PFC Barry Winchell who had his head bashed in while sleeping on his cot in the barracks because he was gay.\n \n Or the mother of Lawrence King who was shot to death in class because he was gay. \n \n The threats of violence are real against us and carried out every day. It is hardly crass or feeble, to point this out.\n\n \n Tragic stories all. But if I were to rattle off rape victims who were all targeted because of their sex it would not argue for some grand lynching by a male agenda. Your own sense of martyrdom not withstanding you are in a far different place than that of African Americans in those dark days. You can bemoan your sense of social injustice without borrowed metaphors. Why not call it a holocaust while you are at it?", 
   {}, 
   433851, 
   null, 
   1309931400.0
  ], 
  [
   433857, 
   null, 
   "Accipiter", 
   "Here are death threat against gay people I found without trying to hard.\n \n Gay marriage supporter receives death threat | News Story on 365gay.com\n \n Gay Iowa senator gets death threat | Dallas Voice\n \n OUT IN THE SILENCE: Gay Filmmaker Gets Death Threat on SUNY Campus\n \n BBC NEWS | Africa | Gambia gay death threat condemned\n \n Pop star Mika gets gay death threat - PinkNews.co.uk\n \n Gay candidate reports death threat | Wichita Eagle\n \n Anti-Gay Death Threat Traced to Georgia Senator Saxby Chambliss' Office\n \n The problem of gay people threatening the anti gay people is miniscule by comparison.\n \n Death threats against gay people is a much bigger problem.", 
   {}, 
   433855, 
   null, 
   1309932360.0
  ], 
  [
   433858, 
   null, 
   "Xenamnes", 
   "Death threats against members of the gay community is not the subject here. What is the subject is the fact that the gay community has issued death threats against political opponents and wish to engage in other terrorist activities against them for refusing to see their way as the right way.\n \n Two wrongs do not make a right. Past atrocities carried out against the gay community to not excuse the atrocities being carried out by the gay community in retaliation.", 
   {}, 
   433857, 
   null, 
   1309933440.0
  ], 
  [
   433859, 
   null, 
   "Accipiter", 
   "No what this thread is about is trying to paint the anti gay people as the victims.", 
   {}, 
   433858, 
   null, 
   1309934160.0
  ], 
  [
   433860, 
   null, 
   "Accipiter", 
   "Has anyone brought up the fact that discussion centers around an article from a heavily biased source?\n \n What's the matter jyoshu couldn't find anything from a credible source?", 
   {}, 
   433859, 
   null, 
   1309936080.0
  ], 
  [
   433861, 
   null, 
   "Xenamnes", 
   "While the legitimacy of World Net Daily may be questionable, they do cite sources that can be viewed independently. Case in point, the court motion.\n \n http://www.jamesmadisoncenter.org/cases/files/2011/06/209-Plaintiffs-Motion-Brief-for-Summary-Judgment.pdf\n \n I would recommend page 15, Section B.", 
   {}, 
   433860, 
   null, 
   1309936920.0
  ], 
  [
   433863, 
   null, 
   "MrWriteLA", 
   "Here are death threat against gay people I found without trying to hard.\nAnd of course it all too frequently is more than just threats. Kind of surprised you didn't link to this one, as it's all over the news... which I'm sure fills jyoshu with outrage, since the victim only accounts for a miniscule percentage of the population (what gays won't do to get themselves in the news, eh?):The Murder Of Larry King\nBrandon McInerney was a 14-year-old boy from a broken home when he gunned down a classmate in front of stunned students at a Ventura County middle school &#8211; all because that fellow student was gay. That was three years ago, now McInerney is about to stand trial for the murder of the 15 year old classmate Larry King.\nY'know, when these christosexuals can point to even one straight person who was actually beat up, shot, crucified, etc. by a gay person just for being heterosexual -- or even being perceived  to be heterosexual -- maybe I'll take their pusilanimous whining seriously. Until then, their tiny, bigoted souls fill me with contempt and pity. Their Christ must be so proud of the example they set. Truly pathetic.", 
   {}, 
   433857, 
   null, 
   1309941240.0
  ], 
  [
   433864, 
   null, 
   "pappillion001", 
   "Death threats against members of the gay community is not the subject here. What is the subject is the fact that the gay community has issued death threats against political opponents and wish to engage in other terrorist activities against them for refusing to see their way as the right way.\n \n Two wrongs do not make a right. Past atrocities carried out against the gay community to not excuse the atrocities being carried out by the gay community in retaliation.\n\n \n Nor should it be considered indicative of every gay person's belief on dealing with the opposition.\n \n Is it fair to say the entire gay community supports and is actively considering some type of violent reprisal against those who refuse to see an issue as they do?\n \n This is a case where past reactions are one measurement of future potential reactions. In the past have gays attacked the opposition in states where elections were held or where abuses were (for lack of better words, and I did try to phrase this differently but) noteworthy. \n \n They did not and The Supreme Court agreed there was no threat to names being released.", 
   {}, 
   433858, 
   null, 
   1309942860.0
  ], 
  [
   433865, 
   null, 
   "Easyrider", 
   "Yet this is what we have. The religious right has declared war upon us. Like it or not.\n\n \n We'd prefer you people repent of your gay sex debauchery and get yourselves right with God. But if you want to keep cramming your perverted agenda down the throats of society at large (i.e. mandatory gay history classes in California), then we'lll fight you in a non-violent way tooth and nail. And you will not win. There is a Judgment Day coming and your little demonic, circus side show is going to come to a screeching end.", 
   {}, 
   433848, 
   null, 
   1309957260.0
  ], 
  [
   433866, 
   null, 
   "Accipiter", 
   "We'd prefer you people repent of your gay sex debauchery and get yourselves right with God. But if you want to keep cramming your perverted agenda down the throats of society at large (i.e. mandatory gay history classes in California), then we'lll fight you in a non-violent way tooth and nail. And you will not win. There is a Judgment Day coming and your little demonic, circus side show is going to come to a screeching end.\n\n \n If you weren't a giant walking a hole you would probably get less stuff crammed in to you.", 
   {
    "unicode_changes_made": true
   }, 
   433865, 
   null, 
   1309957620.0
  ], 
  [
   433867, 
   null, 
   "Matthew S", 
   "Your claim that religion is the source of hatred for the gay community is incorrect. Science is sufficient reason for someone to hate the gay community just as much as religion. The only difference is one doesn't quote the word of God but rather points to statistics and data supported by repeatable experiments.\n \n I could easily bring up the AIDS epidemic and how it's linked to members of the gay community having questionable sexual practices. But if I introduced that subject and drew parallels between that and terrorists engaging in the use of biological weapons that would only lend more credibility to you going off topic about christianist hatred.\n \n Simply put I am denying you the opportunity to hijack this thread with the introduction of off topic and irrelevant matters that don't apply to the subject at hand.\n \n The subject at hand is the fact of the gay community engaging in tactics of terrorism because they don't like that people actually voted against gay marriage. That is no excuse for threatening to kill people you don't know and rape their children in retaliation. \n \n There is no room for ranting about religious hatred here. The only discussion to be had is the hatred and intolerance being exercised openly by the gay community, showing that they have no interest in being the more mature group.\n\n \n Well then please enlighten me to the motives of the people who put the initiative on the ballot in the first place? Because their motivations are relevant no initiative no threats. You think the the sheep should be more mature then the two wolves that just voted to eat it for dinner.\n There is a difference between those who voted for and those who signed the petitions.", 
   {}, 
   433855, 
   null, 
   1309961160.0
  ], 
  [
   433872, 
   null, 
   "Xenamnes", 
   "Pretending to be the victim of bigotry and drawing attention to yourself is no excuse for the actions that have been taken by the gay community in retaliation. You ask for acceptance and tolerance and yet refuse to show the same to others.\n \n At the very least the gay community has made several hundred terrorist threats against others based on private matters such as how they voted on a political matter. Threats of murder, threats of rape, and a number of counts of vandalism and property damage. There is no excusing these actions, nor will there be any blaming of religious bigotry and christianist hatred for supposedly forcing their hand and making them do these things.\n \n You are not a martyr for your cause, neither are you the victim here. The victims are the parents who had to suffer the threat of their children being raped or killed in retaliation for how they voted on a specific piece of legislation. The victims are the community members who found their churches vandalized with broken windows, locks glued shut and swastikas prominently emblazoned on the buildings.", 
   {}, 
   433867, 
   null, 
   1309963620.0
  ], 
  [
   433874, 
   null, 
   "Matthew S", 
   "Pretending to be the victim of bigotry and drawing attention to yourself is no excuse for the actions that have been taken by the gay community in retaliation. You ask for acceptance and tolerance and yet refuse to show the same to others.\n \n At the very least the gay community has made several hundred terrorist threats against others based on private matters such as how they voted on a political matter. Threats of murder, threats of rape, and a number of counts of vandalism and property damage. There is no excusing these actions, nor will there be any blaming of religious bigotry and christianist hatred for supposedly forcing their hand and making them do these things.\n \n You are not a martyr for your cause, neither are you the victim here. The victims are the parents who had to suffer the threat of their children being raped or killed in retaliation for how they voted on a specific piece of legislation. The victims are the community members who found their churches vandalized with broken windows, locks glued shut and swastikas prominently emblazoned on the buildings.\n\n \n Nonsense\n \n Come now did any of these threats come true?\n \n This is like the Germans screaming that their cities have been bombed and laid waste and they did nothing to instigate the bombing.\n \n I personally like to have the names and addresses of those who would vote on my civil rights so I can protest and bring it home to them. They are not going to be able to just vote away my rights without me bringing it back in their face. A good camp outside their homes with a sign that says \"your a bigot\" or yell at their children \"Your daddy is a monster\" would do wonders.", 
   {}, 
   433872, 
   null, 
   1309965480.0
  ], 
  [
   433878, 
   null, 
   "Xenamnes", 
   "Whether or not the death threats were follow up with actual events is irrelevant to the discussion. The fact remains that terrorist threats were made against those with opposing political views, and such threats are felony offenses in this post September 11th world. Even if the threats were merely hoaxes with no intent of them being carried out they were still made regardless, and such claims still qualify as felony offenses.\n \n Why were the threats not carried out? I don't have the answer. Perhaps the gay community realized if they went through with it they would lend support to the anti-gay movements and make themselves the villains. Perhaps they realized that they lacked the necessary fortitude to go out and murder children for the perceived crimes of their parents.\n \n You talk about civil rights in respect to gay marriage. However I have seen no Supreme Court ruling that held same sex marriage is truly a right. The number of states that ban such practices certainly suggest it is not a true right.\n \n Your idea of protest sounds more like harassment than anything else. Feel free to show me that I'm wrong but I am unaware of the Supreme Court stating that you have a right to harass people based on their political views and positions.\n \n The gay community has demanded the private information of 218,000 private citizens in the state of Washington for the purpose of releasing the information and making it easily searchable by anyone regardless of their intentions. If this is allowed to take place the death threats may very well be followed up on because now there will be a map of targets.\n \n Are you aware of the repercussions that could be had from publicizing the private information of political opponents? Such tactics have the possibility of hurting the economy in Washington state by leading to 218,000 losing their jobs due to political position on a controversial subject. The economy is already bad enough without adding to the matter in a spite fest of hurting those who don't see things your way.\n \n Complicating the matter is the number of hackers permeating the internet currently. If this private information is made public on sites encouraging the firing and harassment of private citizens it could very well lead to a cyber attack by anti-gay hackers who will destroy the sites, damage the hosting communities, and quite possibly turn things around and release a gay offender website with the names, pictures and addresses of members in the gay community, and showing who made which death threat.\n \n You have a right to protest, but only if it's done peacefully. You have no right to harass others and instigate a massive and widespread war of retribution and ideals based on infantile and childish tactics of hurting those who hurt you and not caring who suffers so long as you get some measure of satisfaction.", 
   {}, 
   433874, 
   null, 
   1309967880.0
  ], 
  [
   433884, 
   null, 
   "Matthew S", 
   "Whether or not the death threats were follow up with actual events is irrelevant to the discussion. The fact remains that terrorist threats were made against those with opposing political views, and such threats are felony offenses in this post September 11th world. Even if the threats were merely hoaxes with no intent of them being carried out they were still made regardless, and such claims still qualify as felony offenses.\n \n Why were the threats not carried out? I don't have the answer. Perhaps the gay community realized if they went through with it they would lend support to the anti-gay movements and make themselves the villains. Perhaps they realized that they lacked the necessary fortitude to go out and murder children for the perceived crimes of their parents.\n \n You talk about civil rights in respect to gay marriage. However I have seen no Supreme Court ruling that held same sex marriage is truly a right. The number of states that ban such practices certainly suggest it is not a true right.\n \n Your idea of protest sounds more like harassment than anything else. Feel free to show me that I'm wrong but I am unaware of the Supreme Court stating that you have a right to harass people based on their political views and positions.\n \n The gay community has demanded the private information of 218,000 private citizens in the state of Washington for the purpose of releasing the information and making it easily searchable by anyone regardless of their intentions. If this is allowed to take place the death threats may very well be followed up on because now there will be a map of targets.\n \n Are you aware of the repercussions that could be had from publicizing the private information of political opponents? Such tactics have the possibility of hurting the economy in Washington state by leading to 218,000 losing their jobs due to political position on a controversial subject. The economy is already bad enough without adding to the matter in a spite fest of hurting those who don't see things your way.\n \n Complicating the matter is the number of hackers permeating the internet currently. If this private information is made public on sites encouraging the firing and harassment of private citizens it could very well lead to a cyber attack by anti-gay hackers who will destroy the sites, damage the hosting communities, and quite possibly turn things around and release a gay offender website with the names, pictures and addresses of members in the gay community, and showing who made which death threat.\n \n You have a right to protest, but only if it's done peacefully. You have no right to harass others and instigate a massive and widespread war of retribution and ideals based on infantile and childish tactics of hurting those who hurt you and not caring who suffers so long as you get some measure of satisfaction.\n\n \n http://1.bp.blogspot.com/-4VPQW_UlzC4/ThSJV4BDWeI/AAAAAAABHjM/6CBlD1dJ5X4/s1600/NOMSolution.jpg\n \n Carried by a anti gay marriage supporter. Should this person be arrested for their terrorist threats too?\n \n I don't care what or who was threatened. Part of our democratic process is the availability of the public to view public records. When you sign a ballot initiative you are signing a public record that is viewable by anyone. This is a cornerstone pillar of our democracy. You don't like that too bad, and don't argue for democracy then.\n \n You talk about hurting the economy you need to look at who is responsible for placing the thing on the ballot in the first place and blame their religious christianist buts not gay people.", 
   {}, 
   433878, 
   null, 
   1309979220.0
  ], 
  [
   433885, 
   null, 
   "Xenamnes", 
   "It is not for me to determine whether or not quoting from the bible qualifies as a terrorist threat to murder others. However what was written on the sign is quite different from claiming you'll murder somebody's children for the sake of revenge.\n \n As to the rest of your message about the democratic process. There is no right to use the democratic process as a method of inciting violence against others. Freedom of speech doesn't cover enraging an angry mob to the point that they'll engage in widespread violence. Gay community activists have freely admitted that they wish to use this information to further their terrorist activity goals. They wish to make the information accessible on a website in an easy to search format. They wish to release the information so gay marriage opponents may be accosted in public over the matter of how they voted.\n \n What you ask for is not democracy. What you demand is nothing more than terrorism.", 
   {}, 
   433884, 
   null, 
   1309980900.0
  ], 
  [
   433886, 
   null, 
   "Matthew S", 
   "It is not for me to determine whether or not quoting from the bible qualifies as a terrorist threat to murder others. However what was written on the sign is quite different from claiming you'll murder somebody's children for the sake of revenge.\n \n As to the rest of your message about the democratic process. There is no right to use the democratic process as a method of inciting violence against others. Freedom of speech doesn't cover enraging an angry mob to the point that they'll engage in widespread violence. Gay community activists have freely admitted that they wish to use this information to further their terrorist activity goals. They wish to make the information accessible on a website in an easy to search format. They wish to release the information so gay marriage opponents may be accosted in public over the matter of how they voted.\n \n What you ask for is not democracy. What you demand is nothing more than terrorism.\n\n \n You have no respect for the democratic process. Doesn't matter if there is a threat of violence or not. Public records are just that public and must be made available for viewing by the public. To hide public records from the public is a threat to our system and democratic processes.\n \n What is written on the sign by the opponents of gay marriage is an open threat of terrorism against gay people. It is saying we should be lynched, in the name of Jesus.", 
   {}, 
   433885, 
   null, 
   1309986660.0
  ], 
  [
   433889, 
   null, 
   "Accipiter", 
   "It is not for me to determine whether or not quoting from the bible qualifies as a terrorist threat to murder others. However what was written on the sign is quite different from claiming you'll murder somebody's children for the sake of revenge.\n \n As to the rest of your message about the democratic process. There is no right to use the democratic process as a method of inciting violence against others. Freedom of speech doesn't cover enraging an angry mob to the point that they'll engage in widespread violence. Gay community activists have freely admitted that they wish to use this information to further their terrorist activity goals. They wish to make the information accessible on a website in an easy to search format. They wish to release the information so gay marriage opponents may be accosted in public over the matter of how they voted.\n \n What you ask for is not democracy. What you demand is nothing more than terrorism.\n\n You know you have been saying the same thing over and over. You rearrange the words but still boils down to the same thing. Why are you so emotionally invested in this thing, whats your problem exactly?", 
   {}, 
   433885, 
   null, 
   1309987440.0
  ], 
  [
   433901, 
   null, 
   "Xenamnes", 
   "You have no respect for the democratic process. Doesn't matter if there is a threat of violence or not. Public records are just that public and must be made available for viewing by the public. To hide public records from the public is a threat to our system and democratic processes.\n\n \n It doesn't matter if there is a threat of violence or not? The gay community is threatening violence and promising repercussions for how people voted on a matter and you claim this fact is irrelevant? How is such a process conductive of honest and open debate?\n \n Would you object if the names of supporters of gay marriage were made public knowledge even if terrorist threats were made against them? Supplying gay haters with the names, addresses, pictures and places of employment of those who voted in favor of gay marriage would yield no outrage or concern from you?\n \n The gate does not swing both ways. If the names and addresses of gay marriage opposition should be made available to the public, then so should the name of gay marriage supporters, even if one group is more likely to be victimized as a result of their politics than the other.\n \n \nWhat is written on the sign by the opponents of gay marriage is an open threat of terrorism against gay people. It is saying we should be lynched, in the name of Jesus.\n\n \n So you claim. However we are not discussing the matter of religion here. We are discussing the willingness of the gay community to engage in acts of terrorism and their embrace of intolerance for others who disagree with them. You wish to use the democratic process as a tool of furthering your own agenda through threat of violence and intimidation to punish those who hold a different view than you.\n \n I advise you and those in Washington as well to be very careful of what course of action you take. Those who voted in favor of getting gay marriage on the ballot can just as easily be outed. What will happen could ultimately become very ugly because the gay community was unwilling to be the bigger party.", 
   {}, 
   433886, 
   null, 
   1309995720.0
  ], 
  [
   433902, 
   null, 
   "Xenamnes", 
   "You know you have been saying the same thing over and over. You rearrange the words but still boils down to the same thing. Why are you so emotionally invested in this thing, whats your problem exactly?\n\n \n I have no specific problem with the subject, other than the fact that Matthew is continually attempting to ignore the issue of death threats being issued to gay marriage opponents, and instead trying to derail this topic to have an argument about how gay opposition is born from religious hatred and intolerance. That is not the discussion here, nor should it become such. We are seeing evidence that the gay community wants to engage in acts of terrorism out of spite and revenge. We will not be ignoring that fact. This is simply not going away.", 
   {}, 
   433889, 
   null, 
   1309996080.0
  ], 
  [
   433904, 
   null, 
   "Matthew S", 
   "I have no specific problem with the subject, other than the fact that Matthew is continually attempting to ignore the issue of death threats being issued to gay marriage opponents, and instead trying to derail this topic to have an argument about how gay opposition is born from religious hatred and intolerance. That is not the discussion here, nor should it become such. We are seeing evidence that the gay community wants to engage in acts of terrorism out of spite and revenge. We will not be ignoring that fact. This is simply not going away.\n\n \n And no one is ignoring that. Yes threats where made but they pale in comparison to the threats, and intimadation directed at us every day by the very people who now want to hide their involvement in our oppression.", 
   {}, 
   433902, 
   null, 
   1309997760.0
  ], 
  [
   433905, 
   null, 
   "Matthew S", 
   "It doesn't matter if there is a threat of violence or not? The gay community is threatening violence and promising repercussions for how people voted on a matter and you claim this fact is irrelevant? How is such a process conductive of honest and open debate?\n \n Would you object if the names of supporters of gay marriage were made public knowledge even if terrorist threats were made against them? Supplying gay haters with the names, addresses, pictures and places of employment of those who voted in favor of gay marriage would yield no outrage or concern from you?\n \n The gate does not swing both ways. If the names and addresses of gay marriage opposition should be made available to the public, then so should the name of gay marriage supporters, even if one group is more likely to be victimized as a result of their politics than the other.\n \n \n \n So you claim. However we are not discussing the matter of religion here. We are discussing the willingness of the gay community to engage in acts of terrorism and their embrace of intolerance for others who disagree with them. You wish to use the democratic process as a tool of furthering your own agenda through threat of violence and intimidation to punish those who hold a different view than you.\n \n I advise you and those in Washington as well to be very careful of what course of action you take. Those who voted in favor of getting gay marriage on the ballot can just as easily be outed. What will happen could ultimately become very ugly because the gay community was unwilling to be the bigger party.\n\n \n You keep ignoring the fact that religion is the whole driving factor behind these ballot initiatives. No religion no ballot initiative. Like it or not religion and religious fanatic christianists are behind the war of oppression against gay people. And these are the very christianist terrorists you are defending.", 
   {}, 
   433901, 
   null, 
   1309997940.0
  ], 
  [
   433908, 
   null, 
   "Xenamnes", 
   "And no one is ignoring that. Yes threats where made but they pale in comparison to the threats, and intimadation directed at us every day by the very people who now want to hide their involvement in our oppression.\n\n \n Incorrect on the first and irrelevant on the second. The only reason we are still discussing the existence of the death threats made is because I will not let the subject go cold. Whether or not they are minute compared to the number of threats received by the gay community isn't the subject here. Rather it is the willingness of the gay community to readily engage in the tactics used by those who are supposedly intolerant to them and unwilling to listen to reason. \n \n \nYou keep ignoring the fact that religion is the whole driving factor behind these ballot initiatives. No religion no ballot initiative. Like it or not religion and religious fanatic christianists are behind the war of oppression against gay people. And these are the very christianist terrorists you are defending.\n\n \n I am not defending the actions of those you deem to be christianist terrorists. I am pointing out that those who claim to be victims are willing to engage in the very actions that they decry in an attempt to victimize others. Are you familiar with hypocrisy?\n \n In my last post I brought up the fact that the names and addresses of gay marriage supporters who signed the original initiative would be a matter of public record and could be abused in much the same way as the names of gay marriage opponents. Are you and those in Washington really willing for such retaliation to become a possibility?", 
   {}, 
   433905, 
   null, 
   1309999200.0
  ], 
  [
   433911, 
   null, 
   "pappillion001", 
   "Whether or not the death threats were follow up with actual events is irrelevant to the discussion. The fact remains that terrorist threats were made against those with opposing political views, and such threats are felony offenses in this post September 11th world. Even if the threats were merely hoaxes with no intent of them being carried out they were still made regardless, and such claims still qualify as felony offenses.\n \n Why were the threats not carried out? I don't have the answer. Perhaps the gay community realized if they went through with it they would lend support to the anti-gay movements and make themselves the villains. Perhaps they realized that they lacked the necessary fortitude to go out and murder children for the perceived crimes of their parents.\n \n You talk about civil rights in respect to gay marriage. However I have seen no Supreme Court ruling that held same sex marriage is truly a right. The number of states that ban such practices certainly suggest it is not a true right.\n \n Your idea of protest sounds more like harassment than anything else. Feel free to show me that I'm wrong but I am unaware of the Supreme Court stating that you have a right to harass people based on their political views and positions.\n \n The gay community has demanded the private information of 218,000 private citizens in the state of Washington for the purpose of releasing the information and making it easily searchable by anyone regardless of their intentions. If this is allowed to take place the death threats may very well be followed up on because now there will be a map of targets.\n \n Are you aware of the repercussions that could be had from publicizing the private information of political opponents? Such tactics have the possibility of hurting the economy in Washington state by leading to 218,000 losing their jobs due to political position on a controversial subject. The economy is already bad enough without adding to the matter in a spite fest of hurting those who don't see things your way.\n \n Complicating the matter is the number of hackers permeating the internet currently. If this private information is made public on sites encouraging the firing and harassment of private citizens it could very well lead to a cyber attack by anti-gay hackers who will destroy the sites, damage the hosting communities, and quite possibly turn things around and release a gay offender website with the names, pictures and addresses of members in the gay community, and showing who made which death threat.\n \n You have a right to protest, but only if it's done peacefully. You have no right to harass others and instigate a massive and widespread war of retribution and ideals based on infantile and childish tactics of hurting those who hurt you and not caring who suffers so long as you get some measure of satisfaction.\n\n \n I am assuming that your distortion of a couple of points you make is not intentional, but for the record\n \n A threat can be a felony, a misdemeanor, earn a warning or have no action taken. It is not an automatic felony.\n \n I apologize, but how many of the persons making the threats were arrested? That would be a good indication of the severity of the threats.\n \n Maybe the threats were taken out of context. Maybe they were in response to threats made to them. Maybe they have been embellished or made up. Again the best indicator would be the number of arrests and subsequent convictions. \n \n The gay community demanded nothing. They requested a copy of a public information that is available to anyone. States at times encourage this because it helps in fighting voter fraud.\n \n There was no fear of repercussions. The Courts in Washington confirmed this and later the Supreme Court agreed.\n \n I think the lawsuits for illegal termination and discrimination would have a much greater impact on the economy. \n \n Wow You think there are that many vengeful gay marriage supporting employers just in Washington who would go and check if any of their employees were on the list so they could fire them? A little much don't you think?\n \n \n Your absolutly right two wrongs won't make it all better. That small part of the gay community that engages in those tactics should not and the vast majority who don't support this type of behavior are very disappointed in them.\n \n So your point is made sometimes people don't act civil towards each other\n \n \n Now what? \n \n Should same sex couples be further punished for what some angry supporters said in the heat of the moment? \n \n Has this confirmed in your mind that if they can not be responsible while protesting being oppressed they certainly won't be able to handle being married? \n \n I mean other than blowing much of this out of proportion and making a stand on a non-issue what are you looking to walk away with?\n \n Oh last thing almost forgot as to having a right to harass others with your point of view or who disagree with you. If Fred Phelps can do it why can't gays?", 
   {}, 
   433878, 
   null, 
   1310003340.0
  ], 
  [
   433914, 
   null, 
   "Xenamnes", 
   "I have no particular interest in this discussion, other than keeping the course on topic with the original discussion itself. The original topic of discussion was death threats from the gay community directed as opponents of gay marriage. Matthew attempted to hijack the thread and switch it from terrorist threats by gays, to christianist hatred being the source of persecution of the gay community and the reason why the initiative was signed in the first place. This was off topic and had no relevant place in the discussion as it detracted with the original point.\n \n My position on the issue of gay marriage and the legal recognition of such is irrelevant to the discussion at hand. Whatever said I might support is not at issue here and will not be introduced into the debate.", 
   {}, 
   433911, 
   null, 
   1310004060.0
  ], 
  [
   433917, 
   null, 
   "Easyrider", 
   "If you weren't a giant walking a hole you would probably get less stuff crammed in to you.\n\n \n Nice talk, toilet tongue. Now go back to San Francisco where you belong.", 
   {
    "unicode_changes_made": true
   }, 
   433866, 
   null, 
   1310008680.0
  ], 
  [
   433920, 
   null, 
   "Accipiter", 
   "Nice talk, toilet tongue. Now go back to San Francisco where you belong.\n\n \n What happened to you that made you so caustic?\n \n Was it something in the war?\n \n Perhaps you made a deal with god to get you out of a dangerous situation?\n \n Why are you afraid to tell us?", 
   {}, 
   433917, 
   null, 
   1310010000.0
  ], 
  [
   433923, 
   null, 
   "Accipiter", 
   "I have no particular interest in this discussion, other than keeping the course on topic with the original discussion itself. The original topic of discussion was death threats from the gay community directed as opponents of gay marriage. Matthew attempted to hijack the thread and switch it from terrorist threats by gays, to christianist hatred being the source of persecution of the gay community and the reason why the initiative was signed in the first place. This was off topic and had no relevant place in the discussion as it detracted with the original point.\n \n My position on the issue of gay marriage and the legal recognition of such is irrelevant to the discussion at hand. Whatever said I might support is not at issue here and will not be introduced into the debate.\n\n Obviously the topic has been adequately addressed several pages ago when you started repeating yourself so why stick to the topic?\n \n You lost anyway so give it a rest.", 
   {}, 
   433914, 
   null, 
   1310010600.0
  ], 
  [
   433928, 
   null, 
   "Xenamnes", 
   "The goal was never to win the debate. Rather it was simply to keep it on topic and prevent Matthew from \"winning\" through changing the subject and avoiding the original material of the discussion. I was well aware that continually bringing up the original point would never lead to any sort of victory, therefore it was pointless to even try. However bringing up the original point and denying any attempt at changing the subject is best to ensure the original material is addressed properly.", 
   {}, 
   433923, 
   null, 
   1310013540.0
  ], 
  [
   433929, 
   null, 
   "Provocateaur", 
   "No, I don't believe these threats of violence are right, no matter who is making them and under what circumstances. While I understand there is anger at being treated as second-class citizens and facing discrimination, I still can't justify this course of action. They will be prosecuted as to the law. \n \n I also reject this notion that if it were conservatives making the threats it would be dealt with differently. Threats of violence or death, coming from any side, generally don't make major mainstream news headlines, unless and until they are turned into action.", 
   {}, 
   433795, 
   null, 
   1310015100.0
  ], 
  [
   433942, 
   null, 
   "Easyrider", 
   "What happened to you that made you so caustic?\n \n Was it something in the war?\n \n Perhaps you made a deal with god to get you out of a dangerous situation?\n \n Why are you afraid to tell us?\n\n \n You're pushing the doctrines of demons and turning America into a modern day Sodom and Gomorrah. Somebody needs to be upset with your hedonism. By virtue of that, you're putting America at great risk of judgment by God. Wise up.", 
   {}, 
   433920, 
   null, 
   1310045460.0
  ], 
  [
   433946, 
   null, 
   "Accipiter", 
   "Wise up.\n\n \n Funny thing for an anti-intellectual to say.", 
   {}, 
   433942, 
   null, 
   1310048520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Death threats by gay-priders", 
  "url": "http://www.4forums.com/political/gay-rights-debates/15462-death-threats-gay-priders.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 15462, 
  "discussion_files": [
   [
    "24.html", 
    "http://www.4forums.com/political/gay-rights-debates/15462-death-threats-gay-priders-print.html"
   ], 
   [
    "25.html", 
    "http://www.4forums.com/political/gay-rights-debates/15462-death-threats-gay-priders-5-print.html"
   ], 
   [
    "26.html", 
    "http://www.4forums.com/political/gay-rights-debates/15462-death-threats-gay-priders-4-print.html"
   ], 
   [
    "27.html", 
    "http://www.4forums.com/political/gay-rights-debates/15462-death-threats-gay-priders-3-print.html"
   ], 
   [
    "28.html", 
    "http://www.4forums.com/political/gay-rights-debates/15462-death-threats-gay-priders-2-print.html"
   ]
  ], 
  "identifier": 15462
 }
]