[
 [
  [
   434383, 
   null, 
   "Superlite27", 
   "I notice that the Brady Campaign is always at the forefront, endlessly screaming about \"keeping guns out of the wrong hands\", or \"keeping guns out of the hands of criminals\", closing the illusary \"gun show loophole\", and their current darling: banning \"assault clips\", (whatever those may be). I was waiting on the edge of my seat to see the loud and indignant reaction by the Brady Campaign to Project Gunrunner.\n \n I mean...here we have an organization LOUDLY DEVOTED TO KEEPING GUNS OUT OF THE HANDS OF CRIMINALS, therefore, I could only imagine the VOCIFEROUS AND LOUDLY PROCLAIMED OUTRAGE at folks that plainly and boldfacedly HANDED CRIMINALS SEVERAL THOUSANDS OF \"ASSAULT RIFLES\"! I thought, \"Wow! This is going to be good!\".\n \n The Brady Campaign's entire existence (supposedly) is to keep guns out of the hands of criminals. So let's see their outrage when the thing they exist to prevent gets, not only ignored, but ADVOCATED by the ATF.\n \n I mean, if someone was REALLY, REALLY, REALLY AGAINST letting guns fall into the hands of criminals.....the condemnation of someone who PURPOSEFULLY did the exact opposite: intentionally GAVE criminals guns, should be loud and undeniable......\n \n So I looked at what The Brady Campaign had to say about such blatant disregard of their purpose:\n \n Brady Campaign to Prevent Gun Violence : Search Results\n \n \n Hmmmmm.\n \n \n Chirp....Chirp......Chirp.......\n \n \n Uh......well?\n \n \n Chirp...Chirp.....\n \n Can anyone explain how INTENTIONALLY SELLING GUNS TO CRIMINALS helps to KEEP THEM FROM HAVING THEM?\n \n Using this logic....we could help prevent school kids from using methamphetamine by......\n \n .....giving methamphetamine to school kids!\n \n \n How does INTENTIONALLY DOING SOMETHING help to prevent THAT VERY SOMETHING from happening? \n \n Maybe I should try this tactic. I currently have a headache. Therefore, the ATF would probably suggest HITTING MYSELF IN THE HEAD WITH A HAMMER. After all, it's supposedly the best method for preventing something, right? Doing it intentionally? Look at Project Gunrunner: Want to keep guns out of the hands of criminals? Simple: GIVE criminals thousands of guns. TA-DA! Ingenious!\n \n So, let's check in with The Brady Campaign again to see what they have to say about an occurrence of THE VERY THING THEY SUPPOSEDLY STAND TO PREVENT:\n \n Brady Campaign to Prevent Gun Violence : Search Results\n \n Hmmmm. \"No search results\". You would think, for an organization that stands for keeping guns out of the hands of criminals, we might see something about the biggest GUN HAND OFF TO CRIMINALS IN THE HISTORY OF THE U.S. somewhere on their website, huh?\n \n Is that what they really stand for? After all, we can read thousands of articles, blogs, and press releases about those evil \"assault clips\". Yup. Page after page about requiring a .02 second reload after 10 shots instead of every 15 (I thought shooting 1 person with 1 bullet was bad. Evidently, murdering 10 before a reload is O.K., but shooting any more than 10 without a .02 second reload YouTube - &#x202a;Fast reloading&#x202c;&rlm; is worthy of endless pandering.)\n \n \n \n But for the very thing they say they're against: GIVING guns to criminals a.k.a. \"Project Gunrunner\"? Well.......\n \n (Cue crickets again)\n \n Kinda makes you think they're lying. Why would anyone think that?", 
   {
    "post_info": {
     "post_title": "The Brady Campaign reaction to Project Gunrunner"
    }
   }, 
   null, 
   null, 
   1310522220.0
  ], 
  [
   434426, 
   null, 
   "Doc Jones", 
   "I notice that the Brady Campaign is always at the forefront, endlessly screaming about \"keeping guns out of the wrong hands\", or \"keeping guns out of the hands of criminals\", closing the illusary \"gun show loophole\", and their current darling: banning \"assault clips\", (whatever those may be). I was waiting on the edge of my seat to see the loud and indignant reaction by the Brady Campaign to Project Gunrunner.\n \n I mean...here we have an organization LOUDLY DEVOTED TO KEEPING GUNS OUT OF THE HANDS OF CRIMINALS, therefore, I could only imagine the VOCIFEROUS AND LOUDLY PROCLAIMED OUTRAGE at folks that plainly and boldfacedly HANDED CRIMINALS SEVERAL THOUSANDS OF \"ASSAULT RIFLES\"! I thought, \"Wow! This is going to be good!\".\n \n The Brady Campaign's entire existence (supposedly) is to keep guns out of the hands of criminals. So let's see their outrage when the thing they exist to prevent gets, not only ignored, but ADVOCATED by the ATF.\n \n I mean, if someone was REALLY, REALLY, REALLY AGAINST letting guns fall into the hands of criminals.....the condemnation of someone who PURPOSEFULLY did the exact opposite: intentionally GAVE criminals guns, should be loud and undeniable......\n \n So I looked at what The Brady Campaign had to say about such blatant disregard of their purpose:\n \n Brady Campaign to Prevent Gun Violence : Search Results\n \n \n Hmmmmm.\n \n \n Chirp....Chirp......Chirp.......\n \n \n Uh......well?\n \n \n Chirp...Chirp.....\n \n Can anyone explain how INTENTIONALLY SELLING GUNS TO CRIMINALS helps to KEEP THEM FROM HAVING THEM?\n \n Using this logic....we could help prevent school kids from using methamphetamine by......\n \n .....giving methamphetamine to school kids!\n \n \n How does INTENTIONALLY DOING SOMETHING help to prevent THAT VERY SOMETHING from happening? \n \n Maybe I should try this tactic. I currently have a headache. Therefore, the ATF would probably suggest HITTING MYSELF IN THE HEAD WITH A HAMMER. After all, it's supposedly the best method for preventing something, right? Doing it intentionally? Look at Project Gunrunner: Want to keep guns out of the hands of criminals? Simple: GIVE criminals thousands of guns. TA-DA! Ingenious!\n \n So, let's check in with The Brady Campaign again to see what they have to say about an occurrence of THE VERY THING THEY SUPPOSEDLY STAND TO PREVENT:\n \n Brady Campaign to Prevent Gun Violence : Search Results\n \n Hmmmm. \"No search results\". You would think, for an organization that stands for keeping guns out of the hands of criminals, we might see something about the biggest GUN HAND OFF TO CRIMINALS IN THE HISTORY OF THE U.S. somewhere on their website, huh?\n \n Is that what they really stand for? After all, we can read thousands of articles, blogs, and press releases about those evil \"assault clips\". Yup. Page after page about requiring a .02 second reload after 10 shots instead of every 15 (I thought shooting 1 person with 1 bullet was bad. Evidently, murdering 10 before a reload is O.K., but shooting any more than 10 without a .02 second reload YouTube - &#x202a;Fast reloading&#x202c;&rlm; is worthy of endless pandering.)\n \n \n \n But for the very thing they say they're against: GIVING guns to criminals a.k.a. \"Project Gunrunner\"? Well.......\n \n (Cue crickets again)\n \n Kinda makes you think they're lying. Why would anyone think that?\n\n \n It has been pointed out that this scam/scheme goes much deeper than the ATF which is now being used as a DIVERSION to the depth of corruption and Constitutional violation and criminality...even to the point of perjury at the highest levels of this government administration.\n \n Even the SPLC has issued death threats against oath keeper founder, Robert Rhodes which makes the farce it is founded on exposed for what it is, an anti-American and anti Constitutional hydra of deceit and enemy of the Republic.\n Maybe not enemy #1 but certainly in the top ten...", 
   {}, 
   434383, 
   null, 
   1310571480.0
  ], 
  [
   434430, 
   null, 
   "Tither", 
   "Even the SPLC has issued death threats against oath keeper founder, \n\n \n Maybe they never read ==<   U.S. Constitution - Article 6 \n The Senators and Representatives before mentioned, and the Members of the several State Legislatures, and all executive and judicial Officers, both of the United States and of the several States, shall be bound by Oath or Affirmation, to support this Constitution; \n\n So asking people to keep their oaths is a bad thing?", 
   {}, 
   434426, 
   null, 
   1310573700.0
  ], 
  [
   434437, 
   null, 
   "sinjin", 
   "In The ATF &#8220;Fast And Furious&#8221; Controversy, Congress Needs To Question Its Own Behavior-- Brady Campaign Blog", 
   {}, 
   434430, 
   null, 
   1310578320.0
  ], 
  [
   434439, 
   null, 
   "Xenamnes", 
   "It would appear the Brady Campaign is willing to excuse the potentially criminal behavior of the ATF and pay no attention to the serious accusations leveled against them.\n \n To date we have accounts of the ATF ordering felony transactions to take place, that the head offices ordering field agents to allow smugglers to go free with defined arsenals, the Justice Department telling the ATF to not comply with congressional subpoenas, the Attorney General having no knowledge of a government scandal taking place, and just recently the report that some of the gun smugglers were paid informants for the FBI and DEA, and they were paid with taxpayer money to smuggle weapons.\n \n I fail to see either relevancy or legitimacy in the claims of people such as these.", 
   {}, 
   434437, 
   null, 
   1310581920.0
  ], 
  [
   434515, 
   null, 
   "Doc Jones", 
   "Honey, I don't know what you are. I mean, for all I know, you could be \n some big, fat dude sitting in his stim chair with his **** hanging out. \n - Bruce Willis as Tom Greer, \"Surrogates\" ]\n\n \n You sure you are on the right forum there sliiiiick? Mention of the brady bunch brings out the best in you huh? If that was a book or movie, it should be underlined as a title and not in quote marks. IF Bruce did say that, that quote should be in quotations. Sure sign of a very limited education :) Whatever, it marks you as the filthy troll :) and also appears quite apt when talking about your favorite .org emoticon_xclown", 
   {}, 
   434437, 
   null, 
   1310653920.0
  ], 
  [
   434544, 
   null, 
   "Tither", 
   "  Democrats to Introduce Gun Control Legislation Tomorrow \n U.S. Representatives Carolyn B. Maloney (D-NY), Elijah E. Cummings (D-MD), ranking member of the House Oversight and Government Reform Committee, and Carolyn McCarthy (D-NY) will join other members and a leading law enforcement organization for an event Friday, July 15th, 11:00 a.m. at the House Triangle to introduce the &#8220;Stop Gun Trafficking and Strengthen Law Enforcement Act,&#8221; which establishes a dedicated firearms trafficking statute to empower law enforcement to keep high-powered firearms out of the hands of dangerous criminals, including Mexican drug cartels.\n \n \n So let me get this straight, democrats want to punish law abiding Americans and impede on Second Amendment rights with new legislation \"to prevent gun trafficking to Mexico,\" however, aren't willing to focus on the ATF and DOJ's role in deliberately putting high powered firearms into the hands of criminals including Mexican drug cartels? It doesn't matter how many gun control laws we have on the books if the federal government is willing to break them to push a political agenda, however, this is not surprising. \n \n The announcement of new legislation comes just a day after Townhall obtained emails showing Operation Fast and Furious was designed to promote gun control and four days after the DOJ Deputy Attorney General James Cole, who is under investigation for his involvement in the scandal, released new reporting requirements for multiple sales of certain semi-automatic rifles. \n\n I have a great idea. Lets first keep the Justice Department from sending guns to the Murderous Drug Cartel, before we slime the Bill of Rights! How&#8217;d that be?", 
   {}, 
   434515, 
   null, 
   1310747100.0
  ], 
  [
   434546, 
   null, 
   "Tither", 
   " It's not about the guns \n So where did this all start? After all, a few decades ago we could all buy a handgun from the Sears catalog and see an episode of \"Leave it to Beaver\" with Beaver handling firearms with his girlfriend's father.\n \n Modern day gun-control began with the assassinations and inner city riots of the 1960s. Clearly, these incidents had absolutely nothing to do with the law-abiding gun owner, but those concerned with politics over fact and logic immediately set out to take firearms away from those who didn't do it (as an easy measure to cover up their own failed policies).\n \n Continued efforts to undermine the Second Amendment threaten the core concept of liberty. The Right to Keep and Bear Arms isn't about guns - it's about our inalienable right to life, liberty and the pursuit of happiness. Millions of Americans see the right to protect themselves and their families as their single most important civil right (whether they exercise that right or not).\n \n The Constitution doesn't give us these rights. We already have them. The Constitution just ensures that our federal government can't take them away.  \n\n I prefer can't legislate them away, like they are trying to do now with this phoney scam.", 
   {}, 
   434544, 
   null, 
   1310748120.0
  ], 
  [
   434788, 
   null, 
   "Galileo", 
   "In The ATF \"Fast And Furious\" Controversy, Congress Needs To Question Its Own Behavior-- Brady Campaign Blog\n\n So are we going to hear an apology from SuperElite for unfairly attacking the Brady Campaign? \n \n From that link:\n \"If California Rep. Darrell Issa and other congressional members who are in lock-step with the NRA bosses want to get to the bottom of the ATF gun trafficking operation, they need to start looking at their own actions and lack of action. By blocking and loosening laws to prevent gun violence they, too, are culpable in ATF's 'Fast and Furious' apparent debacle.\"\n \n Helmke condemns the actions of the ATF, but he's not ignoring the bigger picture. The gun lobby and its buddies in Congress have had a lot more say in what the ATF does than the Brady Campaign. They need to start examining their own actions and asking themselves some difficult questions. They need to ask themselves if they are truly concerned about gun trafficking then why do they have a record of opposing efforts to reduce gun trafficking?", 
   {
    "unicode_changes_made": true
   }, 
   434437, 
   null, 
   1311048840.0
  ], 
  [
   434790, 
   null, 
   "Xenamnes", 
   "So are we going to hear an apology from SuperElite for unfairly attacking the Brady Campaign? \n \n From that link:\n \"If California Rep. Darrell Issa and other congressional members who are in lock-step with the NRA bosses want to get to the bottom of the ATF gun trafficking operation, they need to start looking at their own actions and lack of action. By blocking and loosening laws to prevent gun violence they, too, are culpable in ATF's 'Fast and Furious' apparent debacle.\"\n \n Helmke condemns the actions of the ATF, but he's not ignoring the bigger picture. The gun lobby and its buddies in Congress have had a lot more say in what the ATF does than the Brady Campaign. They need to start examining their own actions and asking themselves some difficult questions. They need to ask themselves if they are truly concerned about gun trafficking then why do they have a record of opposing efforts to reduce gun trafficking?\n\n \n Pray tell exactly what do laws relating to gun violence have to do with a government agency illegally smuggling weapons to foreign criminal organizations? I can see no correlation that would make sense in this discussion. Perhaps you would care to enlighten us as to your reasoning and logic.\n \n Current information would suggest the ATF engaged in Fast & Furious for the purpose of justifying their request for further authority. In more simple terms they broke the law to have new laws and regulations implemented. Further information suggests that the gun smugglers operating on the Mexico side of the border were informants of the FBI and DEA and were paid with American taxpayer money.\n \n The actions of congress regarding the implementation of gun control laws is not at fault here. Rather one should be asking why law enforcement is engaged in the business of law breaking.\n \n As it currently stands the new policy rules for Arizona, New Mexico, Texas and California, will yield no beneficial results for law enforcement. The qualifications are set far too low to be accurate and will lead to a great deal of false leads, further exhausting investigative resources that could be better spent elsewhere. One must also ask what benefit the new reporting requirements will produce when videotaped evidence yielded no beneficial results, and law enforcement was ordered to not investigate or interfere.", 
   {
    "unicode_changes_made": true
   }, 
   434788, 
   null, 
   1311049980.0
  ], 
  [
   434809, 
   null, 
   "Doc Jones", 
   "There are other things so clearly out of the power of Congress, that the bare recital of them is sufficient, I mean the \"...rights of bearing arms for defence, or for killing game...\" These things seem to have been inserted among their objections, merely to induce the ignorant to believe that Congress would have a power over such objects and to infer from their being refused a place in the Constitution, their intention to exercise that power to the oppression of the people. -ALEXANDER WHITE (1787) \n \n\n \n Is that about it star gazer? Despite all the Constitutional proof that has been cited you still yet try to defend an unConstitutional .org with no members, one legal counsel since Helmke quit, violation of it's 501(c)(3) filings and other legal violations probably apparent to you but you just don't want to go there. IF DENNIS had a lick of sense he would follow Helmke out the door wouldn't he?? emoticon_xgood", 
   {
    "unicode_changes_made": true
   }, 
   434790, 
   null, 
   1311085680.0
  ], 
  [
   434824, 
   null, 
   "Tither", 
   "Lets see. \n \n We have the Federal agents and the gun shop owners saying this idea of giving 2000 rifles to the Mexican Drug Cartels is absolutely INSANE! We did have some Mexican Senators calling for the American officials responsible, to be charged and jailed in Mexico for all of the carnage that is caused the Mexican People. We have the Director of the ATF saying that when he found out the full details of the problems, it made him sick to his stomach. We have the President and Eric Holder denying any part in this debacle. According to Galileo, apparently ALL NRA stooges. emoticon_smile \n \n So we apparently all of these people wondering about it's real purpose. It now it has got me wondering about it's real purpose too.\n \n So besides Galileo and the Bradys, who else, exactly, is throwing up a good defense? Is there anyone else who thinks it was a good idea?", 
   {}, 
   434809, 
   null, 
   1311094740.0
  ], 
  [
   434924, 
   null, 
   "Galileo", 
   "CNN.com International - Breaking, World, Business, Sports, Entertainment and Video News\n \n Once again the question needs to be asked- if the gun lobby and its activists are truly concerned about gun trafficking then why do they have a record of opposing efforts to reduce gun trafficking?", 
   {}, 
   434824, 
   null, 
   1311194940.0
  ], 
  [
   434930, 
   null, 
   "Tither", 
   "Uhhhh YEah! \n \n Issa and Grassley respond to Obama's new gun control \n Here is Issa's blistering response:\n \n \"This political maneuver seems designed to protect the careers of political appointees at the Justice Department and not public safety. It's disconcerting that Justice Department officials who may have known about or tried to cover-up gunwalking in Operation Fast and Furious are continuing attempts to distract attention from clear wrongdoing. In Operation Fast and Furious, gun dealers didn't need this regulation as they voluntarily provided ATF agents with information about suspected straw purchasers.  In return for this voluntary cooperation, the Justice Department betrayed them by offering false assurances that they would closely monitor sales of weapons that dealers otherwise did not want to make.\" \n\n \n And here is the statement from Sen. Grassley:\n \n\"We've learned from our investigation of Fast and Furious that reporting multiple long gun sales would do nothing to stop the flow of firearms to known straw purchasers because many Federal Firearms Dealers are already voluntarily reporting suspicious transactions.  In fact, in just the documents we've obtained, we are aware of 150 multiple long guns sales associated with the ATF's Fast and Furious case, and despite the fact that nearly all of these sales were reported in real time by cooperating gun dealers, the ATF watched the guns be transported from known straw purchasers to third parties and then let the guns walk away, often across the border.  This makes it pretty clear that the problem isn't lack of burdensome reporting requirements. The administration's continued overreach with regulations continues, and is a distraction from its reckless policy to allow guns to walk into Mexico.\"\n\n", 
   {
    "unicode_changes_made": true
   }, 
   434924, 
   null, 
   1311196080.0
  ], 
  [
   434945, 
   null, 
   "Xenamnes", 
   "Dennis Hennigan claims the purchase of multiple rifles are \"highly suspicious\" in nature. However the policy dictates that any purchase of two rifles must be reported, meaning under Hennigan's logic the purchase of two rifles are \"highly suspicious\" in nature.\n \n However none of this detracts from the fact that this policy was implemented without congressional approval or change to existing law to give it legal weight and enforcement.\n \n Add to the fact the ATF has been accused of allowing multiple sales to be made to known or suspected smugglers, and then allowed them to become lost once they left the shops, despite having videotaped and documented the transactions taking place.\n \n Also please not that Hennigan specifically mentioned that the ATF already possessed this supposed authority to require reporting of multiple long gun transactions. If this is true then why did the ATF need congress to approve the measure in the first place?", 
   {}, 
   434930, 
   null, 
   1311199380.0
  ], 
  [
   434948, 
   null, 
   "Doc Jones", 
   "Dennis Hennigan claims the purchase of multiple rifles are \"highly suspicious\" in nature. However the policy dictates that any purchase of two rifles must be reported, meaning under Hennigan's logic the purchase of two rifles are \"highly suspicious\" in nature.\n \n However none of this detracts from the fact that this policy was implemented without congressional approval or change to existing law to give it legal weight and enforcement.\n \n Add to the fact the ATF has been accused of allowing multiple sales to be made to known or suspected smugglers, and then allowed them to become lost once they left the shops, despite having videotaped and documented the transactions taking place.\n \n Also please not that Hennigan specifically mentioned that the ATF already possessed this supposed authority to require reporting of multiple long gun transactions. If this is true then why did the ATF need congress to approve the measure in the first place?\n\n \n I think you mean multiple handgun purchases to the local sheriff or police chief. Go back and read my post on \"the gun owners' protection act.\" What they proposed and did not get funded by congress was to keep records at another place for 2 months to begin with. Of course once started that would grow into a registry which has always been prohibited by law in the 1968 gca and later in the gopa of 1986.", 
   {}, 
   434945, 
   null, 
   1311199920.0
  ], 
  [
   434952, 
   null, 
   "Tither", 
   "In operation Fast and Ferrous some of the straw purchasers were working for the ATF, FBI, and the DEA. How many were not, we don't know, the gun shops, however, called the ATF immediately whenever they thought someone was up to no good. They were told to proceed with the sales. \n \n Besides the fact that civilian weapons are not the problem that the Antis claim, that picture kind of blows away the notion that the gun controllers are trying to paint of them, and us. No?\n \n But Galileo was just trying to get people to watch the video of his hero Dennis Hennagan, because no one actually believes the things they say, nor do they agree that their is a need for more gun control! \n \n I guess the attitude is, but hey any publicity they can generate is all good for them.", 
   {}, 
   434945, 
   null, 
   1311200460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Brady Campaign reaction to Project Gunrunner", 
  "url": "http://www.4forums.com/political/gun-control-debates/15484-brady-campaign-reaction-project-gunrunner.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 15484, 
  "discussion_files": [
   [
    "209.html", 
    "http://www.4forums.com/political/gun-control-debates/15484-brady-campaign-reaction-project-gunrunner-print.html"
   ], 
   [
    "210.html", 
    "http://www.4forums.com/political/gun-control-debates/15484-brady-campaign-reaction-project-gunrunner-2-print.html"
   ]
  ], 
  "identifier": 15484
 }
]