[
 [
  [
   434312, 
   null, 
   "MrWriteLA", 
   "Undercover Operation Finds That Marcus Bachmann's Clinic Works to \"Cure\" Gay People \nMINNEAPOLIS &#8211; An investigation by Truth Wins Out revealed today that the clinic of Marcus Bachmann, the husband of presidential candidate Michele Bachmann (R-MN), practices reparative therapy, a controversial and discredited clinical method designed to &#8220;cure&#8221; gay, lesbian, bisexual, and transgender people. TWO&#8217;s findings contradict claims by Mr. Bachmann that he and his clinic, Bachmann & Associates, do not participate in reparative therapy. The story broke today in The Nation magazine where Mariah Blake reported on the results of our investigation.\n \n &#8220;The results of our investigation should end all doubt whether Marcus Bachmann&#8217;s clinic endorses and practices reparative therapy aimed at changing a gay person&#8217;s sexual orientation,&#8221; said Truth Wins Out&#8217;s Executive Director Wayne Besen. &#8220;The facts plainly show that Bachmann&#8217;s clinic does try to cure gay people and he is being evasive when he claims otherwise.&#8221;\n \n &#8220;It&#8217;s time for Michele and Marcus Bachmann to stop denying, dodging, and stonewalling,&#8221; added Truth Wins Out&#8217;s Communications and Development Director John Becker. &#8220;They owe it to all Americans to provide a full and honest explanation for their embrace of these dangerous and fraudulent practices.&#8221;\n \n During a weeklong Truth Wins Out undercover investigation inside Bachmann & Associates with hidden cameras, Becker, attended five private sessions with Bachmann & Associates counselor Timothy Wiertzema.\n \n The undeniable goal of the sessions was transforming Becker from homosexual to heterosexual. To his credit, the counselor did not claim that change would be instantaneous or even complete. However, he did explicitly promise that sexual conversion could occur as a result of prayer and therapy at the clinic.\n \n During one of the sessions Wiertzema said, &#8220;&#8230;It&#8217;s possible to be totally free of [same-sex attraction]. For sure.&#8221; And that, &#8220;It&#8217;s happened! It really has happened to people.&#8221; In the fifth session, Wiertzema said, &#8220;&#8230;Obviously your goal is not to have any feelings of attraction for men&#8230;And I really am going to recommend that we start working on how you can develop your attraction towards women.&#8221;\n \n At no time during the therapy was homosexuality portrayed as a natural variation of human sexuality. Instead it was presented as a treatable condition at odds with a normal and healthy sexual orientation. Becker was told by Wiertzema that &#8220;God designed our eyes to be attracted to the woman&#8217;s body, to be attracted to everything, to be attracted to her breasts.&#8221; Furthermore, according to Timothy, &#8220;We&#8217;re all heterosexuals, but we have different challenges.&#8221; Attraction to the same sex &#8220;is there, and it&#8217;s real, but at the core value, in terms of how God created us, we&#8217;re all heterosexual.&#8221;\n \n Becker was never given nor asked to sign any kind of informed consent document that disclosed the dangers of or alternatives to &#8220;ex-gay&#8221; therapy. As such, TWO believes Bachmann & Associates to be practicing unethically, even by the standards of the American Association of Christian Counselors. Such therapy is considered ineffective and potentially harmful by The American Psychological Association, The American Medical Association, The American Academy of Pediatrics, and The American Psychiatric Association.\n \n &#8220;What I found was particularly disconcerting given the fact that Marcus Bachmann&#8217;s clinic has received significant funding from the State of Minnesota and the federal government,&#8221; said Becker.\n \n For sale inside the clinic was Minnesota &#8220;ex-gay&#8221; minister Janet Boynes&#8217; book Called Out. It was accompanied by a typewritten note featuring Mr. Bachmann&#8217;s endorsement: &#8220;Janet is a friend. I recommend this book as she speaks to the heart of the matter and gives practical insights of truth to set people free. &#8211; Marcus Bachmann, PhD.&#8221;\n \n &#8220;It appears that the Bachmann family is trying to distance themselves from some of their more extreme beliefs in an attempt to appeal to mainstream Americans,&#8221; said TWO&#8217;s Besen. &#8220;We think it is important that voters have accurate information and we hope our investigation sheds some light on their genuine views.&#8221;\n \n Truth Wins Out is a non-profit organization that fights anti-LGBT religious extremism. TWO specializes in turning information into action by organizing, advocating and fighting for LGBT equality.\n", 
   {
    "post_info": {
     "post_title": "Bachmann's Husband Tries to &quot;Cure&quot; Gays"
    }
   }, 
   null, 
   null, 
   1310490000.0
  ], 
  [
   434327, 
   null, 
   "poet", 
   "Undercover Operation Finds That Marcus Bachmann's Clinic Works to \"Cure\" Gay People\n\n Baby, that's more pudenda than the Pointer Sisters there. That's a girl.", 
   {}, 
   434312, 
   null, 
   1310495220.0
  ], 
  [
   434335, 
   null, 
   "gansao", 
   "Baby, that's more pudenda than the Pointer Sisters there. That's a girl.\n\n \n What the hell are you on about?", 
   {}, 
   434327, 
   null, 
   1310495640.0
  ], 
  [
   434344, 
   null, 
   "poet", 
   "What the hell are you on about?\n\n \n Marcus Bachmann is obviously a repressed homosexual, and possibly the biggest hypocrite.", 
   {}, 
   434335, 
   null, 
   1310498640.0
  ], 
  [
   434350, 
   null, 
   "gansao", 
   "Marcus Bachmann is obviously a repressed homosexual, and possibly the biggest hypocrite.\n\n \n Then why didnt you say that you blithering idiot?emoticon_xclown", 
   {}, 
   434344, 
   null, 
   1310500500.0
  ], 
  [
   434353, 
   null, 
   "jyoshu", 
   "For those who want to read about this from a less biased site ...\n \n Reports: Bachmann's clinic tries to cure gay patients - On Politics: Covering the US Congress, Governors, and the 2010 Election - USATODAY.com\n \n One thing that stood out:\n \n\"The ABC story included secretly taped video by a gay activist posing as a patient.\"\n \n \"John Becker, a gay activist with a group called Truth Wins Out, took two hidden cameras to treatment sessions at the Bachmann clinic in Lake Elmo, Minn. Becker said he posed as someone seeking counseling for homosexuality.\"\n\n \n Wow, a gay activist lying and doing something under false pretenses, when there's a connection to a Republican candidate. Imagine that. emoticon_rolleyes How ironic for a group that calls itself \"Truth Wins Out.\"\n Sorry, but a special interest activist group out to catch the husband of a political candidate in something has just as little credibility.", 
   {}, 
   434350, 
   null, 
   1310502000.0
  ], 
  [
   434354, 
   null, 
   "Freedom", 
   "For those who want to read about this from a less biased site ...\n \n Reports: Bachmann's clinic tries to cure gay patients - On Politics: Covering the US Congress, Governors, and the 2010 Election - USATODAY.com\n \n One thing that stood out:\n \n \n Wow, a gay activist lying and doing something under false pretenses, when there's a connection to a Republican candidate. Imagine that. emoticon_rolleyes How ironic for a group that calls itself \"Truth Wins Out.\"\n Sorry, but a special interest activist group out to catch the husband of a political candidate in something has just as little credibility.\n\n Someone who is not ashamed of what they are saying will not mind if it becomes public knowledge.\n \n I have little respect for psychologist in general, and I say if you're going somewhere in hopes that another person will understand you better than yourself you are just asking for idiocy like 'pray away gay', of course others aren't going to do the exact same thing but the premise is the same.\n \n You can't say it's impossible or possible to de-homosexualize someone until you have a sound theory as to what makes someone homosexual in the first place, in that light both the 'impossible' and 'possible' people are on the same page of ignorance.", 
   {}, 
   434353, 
   null, 
   1310503260.0
  ], 
  [
   434364, 
   null, 
   "jyoshu", 
   "Someone who is not ashamed of what they are saying will not mind if it becomes public knowledge.\n \n I have little respect for psychologist in general, and I say if you're going somewhere in hopes that another person will understand you better than yourself you are just asking for idiocy like 'pray away gay', of course others aren't going to do the exact same thing but the premise is the same.\n \n You can't say it's impossible or possible to de-homosexualize someone until you have a sound theory as to what makes someone homosexual in the first place, in that light both the 'impossible' and 'possible' people are on the same page of ignorance.\n\n \n Nowadays, most of the focus in religion pertaining to this issue is based on helping people live in a way that doesn't accommodate homosexual urges. For the gay pride movement to continue misrepresenting the 'ex-gay' movement as if it is entirely about so-called 'conversion therapy is disingenuous, to say the least. In all likelihood, the truth about this incident is somewhere in the middle: the organization probably did recommend to the religious person to pray about it (gee, big surprise) and the gay activist probably portrayed it in a worse way than it was. Either way, my opinion is that this isn't an important enough issue to affect one's vote for Bachmann. What matters politically is her views on economy and other much more pertinent issues.", 
   {}, 
   434354, 
   null, 
   1310511900.0
  ], 
  [
   434413, 
   null, 
   "Matthew S", 
   "Nowadays, most of the focus in religion pertaining to this issue is based on helping people live in a way that doesn't accommodate homosexual urges. For the gay pride movement to continue misrepresenting the 'ex-gay' movement as if it is entirely about so-called 'conversion therapy is disingenuous, to say the least. In all likelihood, the truth about this incident is somewhere in the middle: the organization probably did recommend to the religious person to pray about it (gee, big surprise) and the gay activist probably portrayed it in a worse way than it was. Either way, my opinion is that this isn't an important enough issue to affect one's vote for Bachmann. What matters politically is her views on economy and other much more pertinent issues.\n\n \n The problem we have with the ex gay movement is that they say that there is something wrong with being gay, that one can change, and that though prayer they can be cured.", 
   {}, 
   434364, 
   null, 
   1310556240.0
  ], 
  [
   434421, 
   null, 
   "Easyrider", 
   "The problem we have with the ex gay movement is that they say that there is something wrong with being gay, that one can change, and that though prayer they can be cured.\n\n \n There's nothing wrong with that. Gay sex is a perversion, Matthew. And if God can create an entire universe he can darn well change one's proclivity for illicit gay sex.", 
   {}, 
   434413, 
   null, 
   1310565900.0
  ], 
  [
   434422, 
   null, 
   "Winston Smith", 
   "homosexuals are born perverted or do they choose pervertion ? emoticon_xangel\n \n \nAnd if God can create an entire universe he can darn well change one's proclivity for illicit gay sex.\n\n \n why doesn't He ? emoticon_xclown", 
   {}, 
   434421, 
   null, 
   1310567520.0
  ], 
  [
   434475, 
   null, 
   "Easyrider", 
   "Easyrider: And if God can create an entire universe he can darn well change one's proclivity for illicit gay sex.\n\n \n \nwhy doesn't He ? emoticon_xclown\n\n \n Free will.", 
   {}, 
   434422, 
   null, 
   1310603940.0
  ], 
  [
   434480, 
   null, 
   "smiley", 
   "homosexuals are born perverted or do they choose pervertion ? emoticon_xangel\n \n \n \n why doesn't He ? emoticon_xclown\n\n \n Because he's not real.", 
   {}, 
   434422, 
   null, 
   1310607120.0
  ], 
  [
   434493, 
   null, 
   "Xcaliber", 
   "Either way, my opinion is that this isn't an important enough issue to affect one's vote for Bachmann. What matters politically is her views on economy and other much more pertinent issues.\n\n \n I agree.. the Fact that she continuously speaks out against Government Spending and then rakes in a couple of hundred thousand for the Bachman Clinic is reason not to vote for her. The Fact that she's about as bright as a 2 watt bulb is reason not to vote for her. The fact that she would rather see the nation go bankrupt than to raise a few taxes on the super rich is reason not to vote for her. But the number one reason NOT to vote for her is because she's a religious zealot who doesn't realize that religion doesn't belong in the world of politics.", 
   {}, 
   434364, 
   null, 
   1310615160.0
  ], 
  [
   434496, 
   null, 
   "Freedom", 
   "The Fact that she's about as bright as a 2 watt bulb is reason not to vote for her. \n\n If that is an LED I would not stare directly into it.\n \n \nwho doesn't realize that religion doesn't belong in the world of politics.\n\n Why do you keep carrying it everywhere then?", 
   {}, 
   434493, 
   null, 
   1310617080.0
  ], 
  [
   434499, 
   null, 
   "snakespit", 
   "Marcus Bachmann is obviously a repressed homosexual, and possibly the biggest hypocrite.\n\n \n Does every anti-gay person have to be a \"repressed homosexual\"? Can't he just be an ignorant bigot?", 
   {}, 
   434344, 
   null, 
   1310618940.0
  ], 
  [
   434500, 
   null, 
   "MrWriteLA", 
   "Does every anti-gay person have to be a \"repressed homosexual\"? Can't he just be an ignorant bigot?\nI don't think he means \"every\" anti-gay person.\n \n Just jyoshu.", 
   {}, 
   434499, 
   null, 
   1310619420.0
  ], 
  [
   434506, 
   null, 
   "poet", 
   "Does every anti-gay person have to be a \"repressed homosexual\"? Can't he just be an ignorant bigot?\n\n \n Not every \"anti-gay\" person is a repressed homosexual. That girl is , though. \n Did you see Bachmann dancing with Michele on the podium? He's more woman than she is.", 
   {}, 
   434499, 
   null, 
   1310634840.0
  ], 
  [
   434510, 
   null, 
   "Xcaliber", 
   "If that is an LED I would not stare directly into it.\n \n\n \n Then why did you?...\n \n \n\n Why do you keep carrying it everywhere then?\n\n \n Are you and Bachman doing the same drugs?....", 
   {}, 
   434496, 
   null, 
   1310649900.0
  ], 
  [
   434517, 
   null, 
   "Freedom", 
   "Then why did you?...\n \n \n \n Are you and Bachman doing the same drugs?....\n\n You were responding to some pretty empty comments but it was worth it just to see you rear up.", 
   {}, 
   434510, 
   null, 
   1310662320.0
  ], 
  [
   434520, 
   null, 
   "MrWriteLA", 
   "For those who didn't catch itJon Stewart did a hilarious bit on this last night:\n Jon Stewart on Marcus Bachmann", 
   {}, 
   434312, 
   null, 
   1310667120.0
  ], 
  [
   434540, 
   null, 
   "Matthew S", 
   "For those who didn't catch itJon Stewart did a hilarious bit on this last night:\n Jon Stewart on Marcus Bachmann\n\n \n The end of the clip was offensive and borderline anti gay. That is so suprising comming from John Stewart.", 
   {}, 
   434520, 
   null, 
   1310730900.0
  ], 
  [
   434597, 
   null, 
   "Freedom", 
   "The end of the clip was offensive and borderline anti gay. That is so suprising comming from John Stewart.\n\n Well it's a good thing you're here I didn't catch it. You are paranoid...", 
   {}, 
   434540, 
   null, 
   1310791740.0
  ], 
  [
   434604, 
   null, 
   "snakespit", 
   "The end of the clip was offensive and borderline anti gay. That is so suprising comming from John Stewart.\n\n \n Offensive? In what way? I think Stewart got it right.", 
   {}, 
   434540, 
   null, 
   1310799540.0
  ], 
  [
   434609, 
   null, 
   "jazyjason", 
   "Undercover Operation Finds That Marcus Bachmann's Clinic Works to \"Cure\" Gay People\n\n \n \n The sad truth in all of this is the victim's themselves. These people who let their lives become nothing more than the experiments of a few twisted, bigoted psychos who now potentially hold the keys to the highest of offices in this Country. \n \n if this is not a warning to the horror's of the religious right, the ultimate \"final solution\" they demise even including Bachmann's own flesh and blood sister whom she called \"sad\". It is beyond decent human comprehension to even fathom such utter depravity of human freedom than whom a person can love.\n \n If any truths are to be held in self evidence where all men (and women) are equal, these people must not I repeat MUST not enter into the high offices and positions of government where power is wielded upon the will of the people.\n \n Today, a prominent Kentucky House candidate Matthew Vanderpool took his own life because of hellish people like Bachmann and her husband. If anything akin to a fictitious hell could be materialized into reality, it would be the pain and suffering this man and many thousands of those like him including those that attended Bachmann's \"clinic\" go through on a day to day basis at the hands of their torturers in the name of dark, sick, religion.", 
   {}, 
   434312, 
   null, 
   1310807520.0
  ], 
  [
   434617, 
   null, 
   "Freedom", 
   "The sad truth in all of this is the victim's themselves. These people who let their lives become nothing more than the experiments of a few twisted, bigoted psychos who now potentially hold the keys to the highest of offices in this Country. \n \n if this is not a warning to the horror's of the religious right, the ultimate \"final solution\" they demise even including Bachmann's own flesh and blood sister whom she called \"sad\". It is beyond decent human comprehension to even fathom such utter depravity of human freedom than whom a person can love.\n \n If any truths are to be held in self evidence where all men (and women) are equal, these people must not I repeat MUST not enter into the high offices and positions of government where power is wielded upon the will of the people.\n \n Today, a prominent Kentucky House candidate Matthew Vanderpool took his own life because of hellish people like Bachmann and her husband. If anything akin to a fictitious hell could be materialized into reality, it would be the pain and suffering this man and many thousands of those like him including those that attended Bachmann's \"clinic\" go through on a day to day basis at the hands of their torturers in the name of dark, sick, religion.\n\n That was a moving speech jazy, but if a homosexual is going to a clinic for their sexual attractions they already have somewhat of a repression problem don't they?", 
   {}, 
   434609, 
   null, 
   1310812680.0
  ], 
  [
   434620, 
   null, 
   "Matthew S", 
   "That was a moving speech jazy, but if a homosexual is going to a clinic for their sexual attractions they already have somewhat of a repression problem don't they?\n\n \n But we should live in a world where they don't feel they have to cure themselves. We should live in a world where religion shuts its mouth about homosexuality and lets people live their lives. We should live in a world where homosexuality is considered just as normal as heterosexuality", 
   {}, 
   434617, 
   null, 
   1310816520.0
  ], 
  [
   434623, 
   null, 
   "thelmoose", 
   "I think part of the problem is the concept of the \"Christian counselor\". I suspect that those who call themselves that have a varied approach to their clients, so I don't want to malign all of them, but Bachmann's ilk is the problem. Mental health specialists should not, according to the accreditation organizations in this country, be present in the room with certain pre-conceived ideas - one of which would be that homosexuality is wrong and must be changed. \n \n Marcus Bachmann has stated that the problem we have is we don't stand for right and wrong - we are too accepting of certains behaviors. Well, that may be a good idea for a parent or a cop, but not a counselor. The counselor is their to listen dispassionately and with an open mind. And certainly not to judge that homosexuality is aberrant as that is not standard practice.\n \n Now, if a \"christian counselor\" doesn't want any part of that, and they don't want practice that way, that's fine. But don't call yourself a licensed therapist because that therapy is malpractice according to the standards of the profession. And you certainly should not be billing Medicaid for this quackery.", 
   {}, 
   434620, 
   null, 
   1310829900.0
  ], 
  [
   434626, 
   null, 
   "jyoshu", 
   "I think part of the problem is the concept of the \"Christian counselor\". I suspect that those who call themselves that have a varied approach to their clients, so I don't want to malign all of them, but Bachmann's ilk is the problem. Mental health specialists should not, according to the accreditation organizations in this country, be present in the room with certain pre-conceived ideas - one of which would be that homosexuality is wrong and must be changed. \n \n Marcus Bachmann has stated that the problem we have is we don't stand for right and wrong - we are too accepting of certains behaviors. Well, that may be a good idea for a parent or a cop, but not a counselor. The counselor is their to listen dispassionately and with an open mind. And certainly not to judge that homosexuality is aberrant as that is not standard practice.\n\n \n Not exactly--a counselor is there to 'counsel', hence the term--instead of \"listener\". If a counselor is asked what to do, he is naturally going to answer based on what he thinks is best. There are lots of ways a Christian counselor may counsel different than a secular one, on any number of issues. For instance, a priest may counsel someone that it would help them to go to confession. Most people realize that when they go to a Christian counselor, they will get a Christian perspective. They are going to know they will get a Christian take on things up front. If you don't want Christian counsel, then don't go to a Christian counselor. You are making muchado about nothing.", 
   {}, 
   434623, 
   null, 
   1310833500.0
  ], 
  [
   434627, 
   null, 
   "Easyrider", 
   "I think part of the problem is the concept of the \"Christian counselor\". I suspect that those who call themselves that have a varied approach to their clients, so I don't want to malign all of them, but Bachmann's ilk is the problem. Mental health specialists should not, according to the accreditation organizations in this country, be present in the room with certain pre-conceived ideas - one of which would be that homosexuality is wrong and must be changed. \n \n\n \n They need to be in the room with somebody who will lead them into repentance for their homosexual sins, and lead them to Christ for salvation, before they all perish. \n \n \"But unless you repent, you will all perish\" (Luke 13:3).\n \n The problem isn't the Bachmann's, the problem is with the unrepentant gay sex sinners and those who defend and encourage them.", 
   {}, 
   434623, 
   null, 
   1310833560.0
  ], 
  [
   434634, 
   null, 
   "poet", 
   "They need to be in the room with somebody who will lead them into repentance for their homosexual sins, and lead them to Christ for salvation, before they all perish. \n \n \"But unless you repent, you will all perish\" (Luke 13:3).\n \n The problem isn't the Bachmann's, the problem is with the unrepentant gay sex sinners and those who defend and encourage them.\n\n \n Well, the day that you sin no more, is the day I'll be in that room. All fall short of the grace of God.\n Your azz needs to be in a room with somebody who will lead your azz into repentance for all the dirt you do...as if you were \"of Christ\"...the farthest thing from Him. \n \n Unrepentant? God made me this way...and God doesn't make mistakes. \n You, thinking you'll be the first in the line to the kingdom of heaven, will find yourself, last.", 
   {}, 
   434627, 
   null, 
   1310844900.0
  ], 
  [
   434638, 
   null, 
   "pappillion001", 
   "For those who want to read about this from a less biased site ...\n \n Reports: Bachmann's clinic tries to cure gay patients - On Politics: Covering the US Congress, Governors, and the 2010 Election - USATODAY.com\n \n One thing that stood out:\n \n \n Wow, a gay activist lying and doing something under false pretenses, when there's a connection to a Republican candidate. Imagine that. emoticon_rolleyes How ironic for a group that calls itself \"Truth Wins Out.\"\n Sorry, but a special interest activist group out to catch the husband of a political candidate in something has just as little credibility.\n\n \n Other than your version listing another person who says its gay fix therapy how does your story differ from the OP?", 
   {}, 
   434353, 
   null, 
   1310847780.0
  ], 
  [
   434639, 
   null, 
   "pappillion001", 
   "There's nothing wrong with that. Gay sex is a perversion, Matthew. And if God can create an entire universe he can darn well change one's proclivity for illicit gay sex.\n\n \n Would it not have been better to just not make them gay in the first place? I mean if he chnages them from gay to straight wouldn't that imply he made a mistake?", 
   {}, 
   434421, 
   null, 
   1310847960.0
  ], 
  [
   434640, 
   null, 
   "pappillion001", 
   "Free will.\n\n \n The bible says he made them gay, where does free will come into the picture?", 
   {}, 
   434475, 
   null, 
   1310848020.0
  ], 
  [
   434641, 
   null, 
   "thelmoose", 
   "Not exactly--a counselor is there to 'counsel', hence the term--instead of \"listener\". If a counselor is asked what to do, he is naturally going to answer based on what he thinks is best. There are lots of ways a Christian counselor may counsel different than a secular one, on any number of issues. For instance, a priest may counsel someone that it would help them to go to confession. Most people realize that when they go to a Christian counselor, they will get a Christian perspective. They are going to know they will get a Christian take on things up front. If you don't want Christian counsel, then don't go to a Christian counselor. You are making muchado about nothing.\n\n \n As I said if the previous post, that is fine. But that is not psychotherapy as it is taught in the professional schools and is agreed upon by the accrediation agencies. You don't get to make up what standard practice is. \n \n If you are going to be a dentist or a doctor or a mental health therapist, and want to be sanctioned by the professional societies that license you and you want insurers to pay for your services, like the evil federal government, there are certain standards to live up to or you are committing malpractice. Are you expecting the insurers to pay for quackery?\n \n \n According to your definition, I don't see the difference, between the \"christian counselor\" and the clergy. If you understood anything about psychotherapy, you would understand the idea of a \"Christian counselor\" makes as much sense as a christian dentist. It is the antithesis of therapy to take such postions with your patients.", 
   {}, 
   434626, 
   null, 
   1310851140.0
  ], 
  [
   434644, 
   null, 
   "Easyrider", 
   "The bible says he made them gay... \n\n \n Not in a million years does it say that.", 
   {}, 
   434640, 
   null, 
   1310855760.0
  ], 
  [
   434645, 
   null, 
   "Xcaliber", 
   "Not in a million years does it say that.\n\n \n It doesn't say anything about Free will either.. that was made up by delusional sheep herders too....", 
   {}, 
   434644, 
   null, 
   1310857140.0
  ], 
  [
   434649, 
   null, 
   "jyoshu", 
   "As I said if the previous post, that is fine. But that is not psychotherapy as it is taught in the professional schools and is agreed upon by the accrediation agencies. You don't get to make up what standard practice is. \n \n If you are going to be a dentist or a doctor or a mental health therapist, and want to be sanctioned by the professional societies that license you and you want insurers to pay for your services, like the evil federal government, there are certain standards to live up to or you are committing malpractice. Are you expecting the insurers to pay for quackery?\n \n According to your definition, I don't see the difference, between the \"christian counselor\" and the clergy. If you understood anything about psychotherapy, you would understand the idea of a \"Christian counselor\" makes as much sense as a christian dentist. It is the antithesis of therapy to take such postions with your patients.\n\n \n 'Quackery?' Come on. (A lot of people think that ALL psycho-therapy is quackery.) Gay-related issues are so gray-area-ish that it's ridiculous to portray them as so cut and dry by calling this 'quackery'. Behavioral issues aren't like going to the dentist at all, or for some physical ailment. \n \n Neither can anyone in good faith consider psychiatry-related issues like this to be so cut and dry when it comes to \"accreditation agencies\". The APA for instance, has been steeped in controversy for years on numerous issues and even came dangerously close to sanctioning pedophilia just a few years ago. (They had to back off in part due to religious conservatives' outrage.) In short, the reputation of such \"accreditation agencies\" and the whole psychiatric and therapeutic secular industry is in a mess these days. In fact, a lot of people probably go to Christian counselors because the \"professional\" secular psychiatric field is such an industry.\n \n \"Therapy\" is such a general term that a Christian counselor (or 'clergy' if you prefer that term) can refer to their work in that way. Again, this is a much different realm of issues than going to get treated for an abscessed tooth or a broken bone. People have turned to clergy for counsel and a listening ear for ages, and that isn't going to change.", 
   {}, 
   434641, 
   null, 
   1310858460.0
  ], 
  [
   434651, 
   null, 
   "pappillion001", 
   "Not exactly--a counselor is there to 'counsel', hence the term--instead of \"listener\". If a counselor is asked what to do, he is naturally going to answer based on what he thinks is best. There are lots of ways a Christian counselor may counsel different than a secular one, on any number of issues. For instance, a priest may counsel someone that it would help them to go to confession. Most people realize that when they go to a Christian counselor, they will get a Christian perspective. They are going to know they will get a Christian take on things up front. If you don't want Christian counsel, then don't go to a Christian counselor. You are making muchado about nothing.\n\n \n Christian or secular he still must work within the boundaries of the standards determined by a medical or pscylogical board. He can't say \"You know what you need to end it your life just isn't going to get better\" This type of treatment is not endorsed by any professional credible board. \n \n A priest can offer a perspective that is biased and the person should have no expesctation of an objective opinion in that scenario. Your psychologist is different. People who go there are obviously religious and are struggling with who they are and what they believe. I don't see religion as having defined and tested methods of dealing with these problems and I personally don't see how religion suddenly knows better than the medical community. \n \n I think people go there thinking they will find a psychologist who may have a better understanding than a secular one.", 
   {}, 
   434626, 
   null, 
   1310859480.0
  ], 
  [
   434653, 
   null, 
   "jyoshu", 
   "Christian or secular he still must work within the boundaries of the standards determined by a medical or pscylogical board. He can't say \"You know what you need to end it your life just isn't going to get better\" This type of treatment is not endorsed by any professional credible board.\n\n \n To \"end it\"? What therapist has counseled such a thing? LOL\n \n \nA priest can offer a perspective that is biased and the person should have no expesctation of an objective opinion in that scenario.\n\n \n With these sort of controversial issues, ANYONE is going to be biased. It's like asking someone their view about abortion and expecting them to be non-biased just because they have a degree on the wall. Either opinion is a bias. You guys act like this isn't the controversial issue that it is. You just think a gay-friendly therapist is non-biased because that's the side YOU hold to.", 
   {}, 
   434651, 
   null, 
   1310859720.0
  ], 
  [
   434654, 
   null, 
   "Freedom", 
   "But we should live in a world where they don't feel they have to cure themselves. We should live in a world where religion shuts its mouth about homosexuality and lets people live their lives. We should live in a world where homosexuality is considered just as normal as heterosexuality\n\n We should live in a world without religion but that is not going to happen, all we have a right to demand is that we live in a world where we are given the liberty we all deserve.\n \n \nI think part of the problem is the concept of the \"Christian counselor\". I suspect that those who call themselves that have a varied approach to their clients, so I don't want to malign all of them, but Bachmann's ilk is the problem. Mental health specialists should not, according to the accreditation organizations in this country, be present in the room with certain pre-conceived ideas - one of which would be that homosexuality is wrong and must be changed. \n \n Marcus Bachmann has stated that the problem we have is we don't stand for right and wrong - we are too accepting of certains behaviors. Well, that may be a good idea for a parent or a cop, but not a counselor. The counselor is their to listen dispassionately and with an open mind. And certainly not to judge that homosexuality is aberrant as that is not standard practice.\n \n Now, if a \"christian counselor\" doesn't want any part of that, and they don't want practice that way, that's fine. But don't call yourself a licensed therapist because that therapy is malpractice according to the standards of the profession. And you certainly should not be billing Medicaid for this quackery.\n\n \n \nNot exactly--a counselor is there to 'counsel', hence the term--instead of \"listener\". If a counselor is asked what to do, he is naturally going to answer based on what he thinks is best. There are lots of ways a Christian counselor may counsel different than a secular one, on any number of issues. For instance, a priest may counsel someone that it would help them to go to confession. Most people realize that when they go to a Christian counselor, they will get a Christian perspective. They are going to know they will get a Christian take on things up front. If you don't want Christian counsel, then don't go to a Christian counselor. You are making muchado about nothing.\n\n I must agree with jyoshu, the idea of a person without 'opinions' (beliefs or judgements is silly and is automatically impossible for any kind of professional anything.\n \n The idea that homosexuality is right is just as much a belief as the idea homosexuality is wrong, and unless this counselor just sits there and nods their head they need to have an idea on what's troubling the person.\n \n \nUnrepentant? God made me this way...and God doesn't make mistakes. \n You, thinking you'll be the first in the line to the kingdom of heaven, will find yourself, last.\n\n Did god make christian radicals the way they are?\n \"No they choose that\"\n \n Easyrider would say that god didn't make you this way, you choose it.\n \n \nNot in a million years does it say that.\n\n see.", 
   {}, 
   434653, 
   null, 
   1310860200.0
  ], 
  [
   434657, 
   null, 
   "pappillion001", 
   "Not in a million years does it say that.\n\n \n Wherefore God also gave them up to uncleanness through the lusts of their own hearts, to dishonour their own bodies between themselves: Who changed the truth of God into a lie, and worshipped and served the creature more than the Creator, who is blessed for ever. Amen. For this cause God gave them up unto vile affections: for even their women did change the natural use into that which is against nature: And likewise also the men, leaving the natural use of the woman, burned in their lust one toward another; men with men working that which is unseemly, and receiving in themselves that recompence of their error which was meet. \n \n This was a punishment for idol worship, but gay people are gay before they worship any idols, don't worship any idols and/or before thye even understand God. Why is God allowing and encouraging this when he says it is a sin and wants nothing more than to be in fellowship with us?", 
   {}, 
   434644, 
   null, 
   1310860560.0
  ], 
  [
   434659, 
   null, 
   "pappillion001", 
   "To \"end it\"? What therapist has counseled such a thing? LOL\n\n \n Yes that is why its called sarcasm. The point was no therapist would because that is outside what is permitted treatment. Your priest, your friend a stranger can say that but your therapist can't. Why because your therapist is supposed to use his professional training to help you not send you over the edge.\n \n \nWith these sort of controversial issues, ANYONE is going to be biased. It's like asking someone their view about abortion and expecting them to be non-biased just because they have a degree on the wall. Either opinion is a bias. You guys act like this isn't the controversial issue that it is. You just think a gay-friendly therapist is non-biased because that's the side YOU hold to.\n\n \n I don't go to a doctor thinking my diagnosis will depend on his political views why should my shrink be different? \n \n A gay friendly therapist will help you to make a decision and be able to go on about your life afterwards. They may guide you in either direction based on the discussions you have with them. They aren't pushing one side or the other because that would make your treatment about them not you.", 
   {}, 
   434653, 
   null, 
   1310861100.0
  ], 
  [
   434662, 
   null, 
   "thelmoose", 
   "'Quackery?' Come on. (A lot of people think that ALL psycho-therapy is quackery.) Gay-related issues are so gray-area-ish that it's ridiculous to portray them as so cut and dry by calling this 'quackery'. Behavioral issues aren't like going to the dentist at all, or for some physical ailment. \n \n Neither can anyone in good faith consider psychiatry-related issues like this to be so cut and dry when it comes to \"accreditation agencies\". The APA for instance, has been steeped in controversy for years on numerous issues and even came dangerously close to sanctioning pedophilia just a few years ago. (They had to back off in part due to religious conservatives' outrage.) In short, the reputation of such \"accreditation agencies\" and the whole psychiatric and therapeutic secular industry is in a mess these days. In fact, a lot of people probably go to Christian counselors because the \"professional\" secular psychiatric field is such an industry.\n \n \"Therapy\" is such a general term that a Christian counselor (or 'clergy' if you prefer that term) can refer to their work in that way. Again, this is a much different realm of issues than going to get treated for an abscessed tooth or a broken bone. People have turned to clergy for counsel and a listening ear for ages, and that isn't going to change.\n\n \n This is all incorrect. \n One must be licensed to bill Medicaid, which Bachmann does. If licensed and billing people, one must practice at the community standard of care. There are no boards of licensure in the US that would condone a licensed therapist (MD, PhD, or Masters level) calling homosexuality something that needs to be cured, let alone calling it barbarian, which he has done.\n \n There is no controversy. This is not a gray area. Homosexuality in not a mental illness. Period.\n \n And people who think psychotherapy is quackery deserve no serious regard.", 
   {}, 
   434649, 
   null, 
   1310861940.0
  ], 
  [
   434663, 
   null, 
   "jyoshu", 
   "One must be licensed to bill Medicaid, which Bachmann does. If licensed and billing people, one must practice at the community standard of care. There are no boards of licensure in the US that would condone a licensed therapist (MD, PhD, or Masters level) calling homosexuality something that needs to be cured, let alone calling it barbarian, which he has done.\n\n \n Regardless of the fact that psychological issues are often gray areas, you would do well to at least get your facts straight first about the issue at hand before getting on a soapbox. He's on record saying they \"don't have an agenda or a philosophy of trying to change someone.\"\n \n Anyways, why do political opponents tend to always target family members?? Marcus Bachmann isn't even running for office. It's no surprise that political opponents are trying to dredge up anything they can on Republican candidates even to the point of targeting their family members. It was done with Bristol Palin, Michelle Obama, Chelsea Clinton, etc.", 
   {}, 
   434662, 
   null, 
   1310865660.0
  ], 
  [
   434666, 
   null, 
   "Xcaliber", 
   "He's on record saying they \"don't have an agenda or a philosophy of trying to change someone.\"\n\n \n lol.. yeah and he lied. He got caught in his lie, ON FILM.. one of his counselors telling a supposed patient he could \" prey the Gay away\".. Trying to Change a gay person through therapy. \n \n \n\n Anyways, why do political opponents tend to always target family members?? Marcus Bachmann isn't even running for office. It's no surprise that political opponents are trying to dredge up anything they can on Republican candidates even to the point of targeting their family members. It was done with Bristol Palin, Michelle Obama, Chelsea Clinton, etc.\n\n \n Because that's politics. Both parties do this and have done it since politics were born. Anyone who decides to run for office must realize that their entire life, and the lives of their Families will be dragged through the Mud. It just so happens in this particular case that Bachmann and her Husband are being proven for what they really are. Religious Zealots with no grasp on reality .", 
   {}, 
   434663, 
   null, 
   1310869380.0
  ], 
  [
   434669, 
   null, 
   "Freedom", 
   "There is no controversy. This is not a gray area. Homosexuality in not a mental illness. Period.\n\n By what standard?\n \n \nAnd people who think psychotherapy is quackery deserve no serious regard.\n\n What in the 'science' of psychology has changed so greatly in the past 40 years that it is now sound but was not before?", 
   {}, 
   434662, 
   null, 
   1310874780.0
  ], 
  [
   434675, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider \n Not in a million years does it say that.\n\n \n \nWherefore God also gave them up to uncleanness through the lusts of their own hearts, to dishonour their own bodies between themselves: Who changed the truth of God into a lie, and worshipped and served the creature more than the Creator, who is blessed for ever. Amen. For this cause God gave them up unto vile affections: for even their women did change the natural use into that which is against nature: And likewise also the men, leaving the natural use of the woman, burned in their lust one toward another; men with men working that which is unseemly, and receiving in themselves that recompence of their error which was meet. \n \n This was a punishment for idol worship, but gay people are gay before they worship any idols, don't worship any idols and/or before thye even understand God. Why is God allowing and encouraging this when he says it is a sin and wants nothing more than to be in fellowship with us?\n\n \n This is your \"God created them gay\" argument? It's a joke. Every respectable theologian knows that since the fall in Eden all kinds of abberations of nature have occurred. And your idol worship claim is horse dung too. Gay sex remains a perversion and an abomination to the Lord.", 
   {}, 
   434657, 
   null, 
   1310890560.0
  ], 
  [
   434677, 
   null, 
   "Matthew S", 
   "We should live in a world without religion but that is not going to happen, all we have a right to demand is that we live in a world where we are given the liberty we all deserve.\n\n \n I was going to say this too but I thought I would tone it down a bit. I actually feel that the time has come for the final solution. What we need to do is make being anti gay and make anti gay religious statements a capital offense. I would love to go to Mike Huckabee's, Pat Robetson's, Glen Beck's, Maggie Gallagher's, Brian Brown's Peter Sprig's, Michelle Bachmann's, Jeff Session's, James Dodson's, Sarah Palin's, and the myriad of anti gay religious leaders and anti gay social conservatives lethal injections. Or we could just deal with them ancient Roman style.", 
   {}, 
   434654, 
   null, 
   1310905260.0
  ], 
  [
   434678, 
   null, 
   "Matthew S", 
   "This is your \"God created them gay\" argument? It's a joke. Every respectable theologian knows that since the fall in Eden all kinds of abberations of nature have occurred. And your idol worship claim is horse dung too. Gay sex remains a perversion and an abomination to the Lord.\n\n \n And so is eating shrimp, lobster, and every insect on the planet, except locusts, pig and camel but you see every christian chow down on a ham or bacon and think nothing of repentance for their abominable sin against God.", 
   {}, 
   434675, 
   null, 
   1310905800.0
  ], 
  [
   434679, 
   null, 
   "gansao", 
   "I was going to say this too but I thought I would tone it down a bit. I actually feel that the time has come for the final solution. What we need to do is make being anti gay and make anti gay religious statements a capital offense. I would love to go to Mike Huckabee's, Pat Robetson's, Glen Beck's, Maggie Gallagher's, Brian Brown's Peter Sprig's, Michelle Bachmann's, Jeff Session's, James Dodson's, Sarah Palin's, and the myriad of anti gay religious leaders and anti gay social conservatives lethal injections. Or we could just deal with them ancient Roman style.\n\n \n A homosexual lifestyle is not illegal and pretty soon homosexual marriage will be legal too.\n So if you make anti gay lifestyle illegal it stands to reason that you should make anti religious life style statements illegal too..then maybe the fundies would be coming to your house with a big syringe", 
   {}, 
   434677, 
   null, 
   1310909940.0
  ], 
  [
   434680, 
   null, 
   "Easyrider", 
   "And so is eating shrimp, lobster, and every insect on the planet, except locusts, pig and camel.....\n\n \n You're apparently too stupid to learn. I've told you a dozen times now Jesus declared all foods clean in the NT, and you keep ignoring it. \n \n However, gay sex remains a sin.", 
   {}, 
   434678, 
   null, 
   1310910240.0
  ], 
  [
   434687, 
   null, 
   "thelmoose", 
   "By what standard? [is homosexuality not a disease] \n\n \n By the same standard by which we declare anything a disease, or non disease.\n \n Simply put, homosexuals show no greater or worse level of behavior mental and behavioral functioning than anyone else, when studied objectively.\n That's what pulled homosexuality from the DSM, nothing else.\n \n \n \n\n What in the 'science' of psychology has changed so greatly in the past 40 years that it is now sound but was not before?\n\n \n Not sure what you mean by 40 years. But if you are suggesting that psychology does not have sound scientific footing, you should not be taken seriously.\n \n \"Ignorance more frequently begets confidence than does knowledge\" - Charles Darwin\n \n \"One of the painful things about our time is that those who feel certainty are stupid, and those with any imagination and understanding are filled with doubt and indecision\" - Bertrand Russell", 
   {}, 
   434669, 
   null, 
   1310920200.0
  ], 
  [
   434690, 
   null, 
   "Xcaliber", 
   "You're apparently too stupid to learn. I've told you a dozen times now Jesus declared all foods clean in the NT, and you keep ignoring it. However, gay sex remains a sin.\n\n \n If homosexuality truly is a sin worthy of eternal damnation as You believe it is then tell me, why didn't Jesus discuss it? He was obviously not concerned with Sexual issues, Gay or Straight, considering he never spoke for or against Homosexuality. It's funny how you fundamental wackos will cherry pick your book of fairy tales to justify your own \" Sins\" but ignore the facts when expressing your bigotry towards others. Pathetic.", 
   {}, 
   434680, 
   null, 
   1310921940.0
  ], 
  [
   434691, 
   null, 
   "pappillion001", 
   "This is your \"God created them gay\" argument? It's a joke. Every respectable theologian knows that since the fall in Eden all kinds of abberations of nature have occurred. And your idol worship claim is horse dung too. Gay sex remains a perversion and an abomination to the Lord.\n\n \n There you go spinning tales and avoiding the questions you find to difficult to answer. Every respectable theologian understands Paul to be talking about idol worship. \n \n You avoid the question though. Why does God let them be gay as a punishment for something they have not done? In effect creating them. Punishment is given before the crime if committed occurs. \n \n By your argument there is no personal responsibility. We are not to blame, it is the corrupting influence of original sin, but Jesus was to have paid for that sin, all of it. All that was is and will be, yet that corrupting influence remains the same as it ever was.", 
   {}, 
   434675, 
   null, 
   1310922120.0
  ], 
  [
   434692, 
   null, 
   "pappillion001", 
   "You're apparently too stupid to learn. I've told you a dozen times now Jesus declared all foods clean in the NT, and you keep ignoring it. \n \n However, gay sex remains a sin.\n\n \n Stupid is as stupid does Forrest. You have been shown a dozen times why you are wrong. That Jesus was not speaking of food or intended to release the dietary laws. Unless you want to also admit that God was mistaken in enacting them which is why he said I change my mind eating pig used to make you unclean but now it doesn't.\n \n Jesus never says gay sex is a sin. He says sex outside of marriage is a sin or with someone other than your spouse, well actually he doesn't really get that deep into it. Paul would be so proud, Jesus not so much but based on your theology Paul is the one that matters.", 
   {}, 
   434680, 
   null, 
   1310922660.0
  ], 
  [
   434709, 
   null, 
   "Freedom", 
   "Simply put, homosexuals show no greater or worse level of behavior mental and behavioral functioning than anyone else, when studied objectively.\n That's what pulled homosexuality from the DSM, nothing else.\n\n So the standard is whether something effects 'level of behavior mental and behavioral functioning', sufficient to create some divergence from a median defined by the general population?\n \n \n \nNot sure what you mean by 40 years.\n\n Forty years ago homosexuals were officially 'crazy'. What has changed that repaired the fallacious reasoning of the psychologist who made that 'determination'?\n \n \nBut if you are suggesting that psychology does not have sound scientific footing, you should not be taken seriously.\n\n If you are suggesting that I am not infallible than you cannot be taken seriously. emoticon_frazzled Dismissals are so much funner when they are silly.\n \n \n \n\"Ignorance more frequently begets confidence than does knowledge\" - Charles Darwin\n\n \"The hardest thing to explain is the glaringly evident which everybody had decided not to see.\" - Ayn Rand\n \n \n\"One of the painful things about our time is that those who feel certainty are stupid, and those with any imagination and understanding are filled with doubt and indecision\" - Bertrand Russell\n\n \"In that world, you'll be able to rise in the morning with the spirit you had known in your childhood: that spirit of eagerness, adventure and certainty which comes from dealing with a rational universe\"\n \n Ah, I love quote time; we should just skip nap time for quote time tomorrow. As with all such subjectivist oxymorons this one by senior Russell is patently self-defeating. Are you certain I cannot be taken seriously, because I doubt that the psychological profession as it stands based on sound reasoning? I mean if they had any imagination or understanding then they would be filled with doubt and indecision and could hardly disagree with any lack of confidence in them no? On the other hand you seem to feel certainty that they are on sound footing, just as they seem to feel certainty in their edicts, you must be stupid.\n \n Perhaps the ignorance of the psychological profession begets their confidence in declaring this and that mental illnesses but not the other thing?", 
   {
    "unicode_changes_made": true
   }, 
   434687, 
   null, 
   1310932200.0
  ], 
  [
   434730, 
   null, 
   "thelmoose", 
   "So the standard is whether something effects 'level of behavior mental and behavioral functioning', sufficient to create some divergence from a median defined by the general population? \n\n \n No. the standard is in the part you deleted, when I directly answered your question. To repeat:\n \nBy what standard? [is homosexuality not a disease] \n\n \n By the same standard by which we declare anything a disease, or non disease.\n \n \n \n\n Forty years ago homosexuals were officially 'crazy'. What has changed that repaired the fallacious reasoning of the psychologist who made that 'determination'? \n\n \n This is not really true.\n \n Homosexuality was determined not to be a disease when it was finally studied objectively, starting with research in the 1920s. Previous work never bothered to ask the question of whether homosexuality was a mental illness, but simply assumed so. Numerous studies concur the any mental problems homosexuals have is the same as any one else and has nothing to due with homosexuality. \n \n If. like Bachmann and his ilk, the practitioner assumes that there is something wrong with being gay, the patient hasn't got a chance.\n \n \n\n If you are suggesting that I am not infallible than you cannot be taken seriously. emoticon_frazzled Dismissals are so much funner when they are silly.\n &#8220;The hardest thing to explain is the glaringly evident which everybody had decided not to see.&#8221; - Ayn Rand\n &#8220;In that world, you'll be able to rise in the morning with the spirit you had known in your childhood: that spirit of eagerness, adventure and certainty which comes from dealing with a rational universe&#8221;\n Ah, I love quote time; we should just skip nap time for quote time tomorrow. As with all such subjectivist oxymorons this one by senior Russell is patently self-defeating. Are you certain I cannot be taken seriously, because I doubt that the psychological profession as it stands based on sound reasoning? I mean if they had any imagination or understanding then they would be filled with doubt and indecision and could hardly disagree with any lack of confidence in them no? On the other hand you seem to feel certainty that they are on sound footing, just as they seem to feel certainty in their edicts, you must be stupid.Perhaps the ignorance of the psychological profession begets their confidence in declaring this and that mental illnesses but not the other thing?\n\n \n And I have no frigging idea what the rest of this garbage means, so I can't comment, except that you can be taken seriously when you stop saying indefensible things. And stop trying to use words whose meaning you do not understand. I'm guessing, no older than 10th grade, right?", 
   {}, 
   434709, 
   null, 
   1310945340.0
  ], 
  [
   434732, 
   null, 
   "Matthew S", 
   "A homosexual lifestyle is not illegal and pretty soon homosexual marriage will be legal too.\n So if you make anti gay lifestyle illegal it stands to reason that you should make anti religious life style statements illegal too..then maybe the fundies would be coming to your house with a big syringe\n\n \n I want them to sit down shut up and mind their own business, if they won't do that then they need to be bitch slapped.", 
   {}, 
   434679, 
   null, 
   1310953380.0
  ], 
  [
   434740, 
   null, 
   "Freedom", 
   "By the same standard by which we declare anything a disease, or non disease.\n\n Which is what?\n \n \nHomosexuality was determined not to be a disease when it was finally studied objectively, starting with research in the 1920s. Previous work never bothered to ask the question of whether homosexuality was a mental illness, but simply assumed so. Numerous studies concur the any mental problems homosexuals have is the same as any one else and has nothing to due with homosexuality.\n \n It was not merely assumed so, they define a mental illness as some level of divergence from 'normal', normal to be defined by the psychologist. i.e. homosexuality was a disorder because it was not heterosexuality.\n \n You are basically saying the change was a lack of bias about what constituted normal.\n \n \nIf. like Bachmann and his ilk, the practitioner assumes that there is something wrong with being gay, the patient hasn't got a chance.\n\n Which was the official position of your 'science' for the better part of it's existance.\n \n \nAnd I have no frigging idea what the rest of this garbage means, so I can't comment, except that you can be taken seriously when you stop saying indefensible things. And stop trying to use words whose meaning you do not understand. I'm guessing, no older than 10th grade, right?\n\n If you can't understand it just say so, there is no need to take out your frustration on me.", 
   {}, 
   434730, 
   null, 
   1310959620.0
  ], 
  [
   434744, 
   null, 
   "thelmoose", 
   "Which is what?\n \n \n It was not merely assumed so, they define a mental illness as some level of divergence from 'normal', normal to be defined by the psychologist. i.e. homosexuality was a disorder because it was not heterosexuality.\n \n You are basically saying the change was a lack of bias about what constituted normal.\n \n \n Which was the official position of your 'science' for the better part of it's existance.\n \n \n If you can't understand it just say so, there is no need to take out your frustration on me.\n\n \n \"My\" science. You got something against science?", 
   {}, 
   434740, 
   null, 
   1310965800.0
  ], 
  [
   434746, 
   null, 
   "jazyjason", 
   "That was a moving speech jazy, but if a homosexual is going to a clinic for their sexual attractions they already have somewhat of a repression problem don't they?\n\n \n Yes. Sadly alot of society has painted gays in a negative light and especially in parts of the Country where it is more centered around Conservative and often religious areas gays are target even heavier and sometimes in violent ways.\n \n Let me give you an example. My father actually wanted to put me in one of these \"clinics\" after I came out. He is still part of a very terrible church that spouts terrible things about gays and particularly those who do not conform to a Conservative view including politics.\n \n Well in order to keep from being put into one of these clinics or \"therapy\" groups I faked being \"redeemed.\" It was the only way to avoid being brain washed and guilted by underlying feelings I had as a teenager that made me attempt suicide twice.\n \n These gay people are vulnerable as alot are. They listen to the negativity, the stereotype's and the slander in the pews every Sunday hearing about how terrible they are, that their going to hell for something they cannot possibly change nor even understand at the beginning why they are in fact gay.\n \n They run thoughts thought their mind that there is something wrong or they \"need\" to change because of the guilt and brainwashing that is compiled onto their minds day after day until sadly you read about another young person who cannot take the stress and takes their own life.\n \n I can affirm to such things because that's exactly what I personally went through. The clinic Bachmann has funded with government money is sickening and personally if I ever saw either of them I'd spit in their faces...", 
   {}, 
   434617, 
   null, 
   1310966760.0
  ], 
  [
   434748, 
   null, 
   "jazyjason", 
   "Not exactly--a counselor is there to 'counsel', hence the term--instead of \"listener\". \n Will these \"counselors\" listen without a tainted perspective on such things as homosexuality? These people aren't even qualified as counselors!\n \n The exact \"clinic\" I was almost forced to attend was run by several head Pastors and in no way shape or for did they have any training, let alone a degree. All they had was their bigoted perspective and a bible.\n \n \n \n \n \n If a counselor is asked what to do, he is naturally going to answer based on what he thinks is best.\n\n \n Sigh.... you really try to spin stuff don't you? You actually think these people under Bachmann care about the suffering of these gays people? If they did they'd encourage them to live their lives and be happy instead of torturing themselves over something they cannot change!\n \n \n There are lots of ways a Christian counselor may counsel different than a secular one, on any number of issues.\n\n \n Well DUH... They for one certainly won't adhere to the AMA or the APA that's for damned sure...\n \n \n For instance, a priest may counsel someone that it would help them to go to confession.\n\n \n Or tithe a little more to fill their coffers. After all \"quality\" counseling isn't cheap...\n \n \n Most people realize that when they go to a Christian counselor, they will get a Christian perspective.\n\n \n Not so. Sadly these gays have been brainwashed or even forced to go by family members like I almost was.... \n \n \n They are going to know they will get a Christian take on things up front.\n\n \n \n If you don't want Christian counsel, then don't go to a Christian counselor. You are making muchado about nothing.\n\n \n BULL. How can you claim that? Do you know the circumstances around each person in these clinics? I had nowhere to go except to rely on my family and if I wasn't going to wind up on the street I had to play along with my fathers crazed religious antics.\n \n Don't believe me? Mr.Write can affirm this as I spent many a night talking with him on the phone about my family life as I struggled to remain strong. It wasn't until I was out of that environment that I truly began to heal...", 
   {}, 
   434626, 
   null, 
   1310967300.0
  ], 
  [
   434749, 
   null, 
   "jazyjason", 
   "They need to be in the room with somebody who will lead them into repentance for their homosexual sins, and lead them to Christ for salvation, before they all perish. \n\n \n Oh yes... and there also needs to be a loaded gun with a single bullet in the chamber there sitting next to their huge book of Lies... So that when this poor XXXXX finally despairs they can at least have an easy way out...\n \n \n \n \nThe problem isn't the Bachmann's, the problem is with the unrepentant gay sex sinners and those who defend and encourage them.\n\n \n Your an idiot plain and simple. I dare you to talk to the mothers of those young teens that took there own lives cause of their sexuality and see what they have to say.... Regret, pain, and suffering because they were too blind to see past their bible....", 
   {}, 
   434627, 
   null, 
   1310967540.0
  ], 
  [
   434750, 
   null, 
   "jazyjason", 
   "You're apparently too stupid to learn. I've told you a dozen times now Jesus declared all foods clean in the NT, and you keep ignoring it. \n \n However, gay sex remains a sin.\n\n \n Oh so pick and choose right? Typical Christian....", 
   {}, 
   434680, 
   null, 
   1310967660.0
  ], 
  [
   434754, 
   null, 
   "Freedom", 
   "\"My\" science. You got something against science?\n\n Only things which are not truly science but are called such, hence the quotes. Counseling can help people, psychology is a real field of study; but the idea that another person can under normal circumstances understand your mental processes better than yourself is absurd. You presume objectivity in ideas like mental illness that do not exist. They have no basis to define healthy thoughts because they do not understand that the basis of a healthy mind has already been a subject of study for millennia, it's called philosophy.\n \n The mere fact that homosexuality was ever cataloged is strong evidence of the error in the method.\n \n \nYes. Sadly alot of society has painted gays in a negative light and especially in parts of the Country where it is more centered around Conservative and often religious areas gays are target even heavier and sometimes in violent ways.\n \n Let me give you an example. My father actually wanted to put me in one of these \"clinics\" after I came out. He is still part of a very terrible church that spouts terrible things about gays and particularly those who do not conform to a Conservative view including politics.\n \n Well in order to keep from being put into one of these clinics or \"therapy\" groups I faked being \"redeemed.\" It was the only way to avoid being brain washed and guilted by underlying feelings I had as a teenager that made me attempt suicide twice.\n\n Wow, I did not realize you were so close to this. Well I do not wish to offend you so forgive me if using you as an example is pushing it.\n \n Stories like yours underscore the validity of my point that the knowledge and science of psychology must be objectively defined so as to disallow quacks from invoking it's name as authority for what is in truth nothing more than their 'take' translated to advice or pressure. I think you'll agree that people who believe it's wrong will continue to 'offer' these services regardless of any official position.\n \n The best possible thing for anyone who in such a situation to know is objective morality, to that end the best way for society to support these people is to make information and apologetics for objective morality available.\n \n \"The worst guilt is to accept an unearned guilt.\" - Ayn Rand\n \n \nThese gay people are vulnerable as alot are. They listen to the negativity, the stereotype's and the slander in the pews every Sunday hearing about how terrible they are, that their going to hell for something they cannot possibly change nor even understand at the beginning why they are in fact gay.\n\n Do you understand now?\n \n \nThey run thoughts thought their mind that there is something wrong or they \"need\" to change because of the guilt and brainwashing that is compiled onto their minds day after day until sadly you read about another young person who cannot take the stress and takes their own life.\n\n The first question anyone should ask themselves about something is 'is this moral', the second should be 'why'. Relativism is the greatest producer of guilt that has ever existed, how can you know if you should feel guilt if there is no standard but whether other people condemn you?\n \n \nI can affirm to such things because that's exactly what I personally went through. The clinic Bachmann has funded with government money is sickening and personally if I ever saw either of them I'd spit in their faces...\n\n It is immoral that you are being forced to pay for them, that I am being forced to pay for them. Measures must be taken immediately to establish a voluntary society.", 
   {}, 
   434750, 
   null, 
   1310970840.0
  ], 
  [
   434755, 
   null, 
   "thelmoose", 
   "Only things which are not truly science but are called such, hence the quotes. Counseling can help people, psychology is a real field of study; but the idea that another person can under normal circumstances understand your mental processes better than yourself is absurd. You presume objectivity in ideas like mental illness that do not exist. They have no basis to define healthy thoughts because they do not understand that the basis of a healthy mind has already been a subject of study for millennia, it's called philosophy.\n \n The mere fact that homosexuality was ever cataloged is strong evidence of the error in the method.\n \n\n \n You do realize you are making all this up?", 
   {}, 
   434754, 
   null, 
   1310971620.0
  ], 
  [
   434756, 
   null, 
   "Freedom", 
   "You do realize you are making all this up?\n\n You do realize that they just make all that up?", 
   {}, 
   434755, 
   null, 
   1310972220.0
  ], 
  [
   434758, 
   null, 
   "thelmoose", 
   "You do realize that they just make all that up?\n\n \n \"they\" who?", 
   {}, 
   434756, 
   null, 
   1310989980.0
  ], 
  [
   434761, 
   null, 
   "jyoshu", 
   "Not so. Sadly these gays have been brainwashed or even forced to go by family members like I almost was....\n\n \n You family likely has a whole different perspective on this, and likely a more mature one than yours. They probably know you a lot better than you think they do.\n \n \nDon't believe me? Mr.Write can affirm this as I spent many a night talking with him on the phone about my family life as I struggled to remain strong. It wasn't until I was out of that environment that I truly began to heal...\n\n \n Hope he could hear you ok through his tinfoil hat.", 
   {}, 
   434748, 
   null, 
   1311003000.0
  ], 
  [
   434763, 
   null, 
   "Freedom", 
   "\"they\" who?\n\n \"They\" psychologist who make the standard of a mental illness their opinion on a host of subjective terms that they evaluate on the spot like 'adjustment', 'normal functioning', and 'psychological disturbance'.\n \n You dig through it all and it will boil down to: \"The behavior is either a problem for the person, society, or the psychologist.\"\n \n \nYou family likely has a whole different perspective on this, and likely a more mature one than yours. They probably know you a lot better than you think they do.\n \n\n It is extremely presumptuous to assert such a thing in a complete void of evidence jyoshu. Since none of us have any proper way to confirm personal stories they must be trusted unless contradicted.", 
   {}, 
   434758, 
   null, 
   1311004140.0
  ], 
  [
   434765, 
   null, 
   "jyoshu", 
   "It is extremely presumptuous to assert such a thing in a complete void of evidence jyoshu. Since none of us have any proper way to confirm personal stories they must be trusted unless contradicted.\n\n \n Forgive me using a Bushism, but this isn't our first rodeo with Jason, believe me. \n \n Most every teenager thinks they know better than their parents do. And many teens think about suicide over many different issues, not just homosexuality. It's pretty typical, sadly. You may be right of course, but anytime someone who's around a young person's age lashes out at their parents, that's not uncommon behavior even when the parents are good ones. Personally, I wonder how his parents would feel if they knew their son comes on discussion forums and makes them out to sound like they are backwards fundies who don't care about their kid.", 
   {}, 
   434763, 
   null, 
   1311005160.0
  ], 
  [
   434766, 
   null, 
   "thelmoose", 
   "\"They\" psychologist who make the standard of a mental illness their opinion on a host of subjective terms that they evaluate on the spot like 'adjustment', 'normal functioning', and 'psychological disturbance'.\n \n You dig through it all and it will boil down to: \"The behavior is either a problem for the person, society, or the psychologist.\"\n \n\n \n No offense, but it doesn't look like English is your first language the way you string barely related words together.\n \n Anyway, you obviously know nothing about Clinical Psychology, psychiatry. Or clinical research, for that matter. The details (or facts) are clearly unimportant to you, but your definition isn't half bad: \n \n\"The behavior is either a problem for the person, society, or the psychologist.\"\n\n \n This might be a reasonable working diagnosis (except the psychologist part) for mental illness and if so, homosexuality doesn't fit that definition.\n \n It is amazing to me how people like you suddenly decide certain science is bad when it reaches a conclusion you don't like. Science is perfectly fine for you when it serves your purpose, but if some facts don't strike your fancy, you suddenly think you can be expert in a field you know nothing about and spout firm opinions. Analagous the those who selectively \"disagree\" with evolutionary biology because they don't like its conclusions. \n \n You use words like \"subjective\" in this discussion. Psyschology must have some subjective determinations when things are not discretely measureable. This does not mean subjective data is bad. You misunderstand the term here.\n \n But maybe that's because you seem to be Rand-head and blindly misunderstand the term objective. (By her definition, by the way, you should be agreeing with this science.)\n \n Back to the main subject. \n \n Homosexuality is not a mental illness because is doesn't act like one, according to extensive research. Therefore, clinical psychologists have no business treating it like one.\n \n You can call it a sin or immoral if you want, but this is outside the purview of Mental Health Care. Nothing more to say.", 
   {}, 
   434763, 
   null, 
   1311006660.0
  ], 
  [
   434767, 
   null, 
   "poet", 
   "No offense, but it doesn't look like English is your first language the way you string barely related words together.\n \n Anyway, you obviously know nothing about Clinical Psychology, psychiatry. Or clinical research, for that matter. The details (or facts) are clearly unimportant to you, but your definition isn't half bad: \n \n \n This might be a reasonable working diagnosis (except the psychologist part) for mental illness and if so, homosexuality doesn't fit that definition.\n \n It is amazing to me how people like you suddenly decide certain science is bad when it reaches a conclusion you don't like. Science is perfectly fine for you when it serves your purpose, but if some facts don't strike your fancy, you suddenly think you can be expert in a field you know nothing about and spout firm opinions. Analagous the those who selectively \"disagree\" with evolutionary biology because they don't like its conclusions. \n \n You use words like \"subjective\" in this discussion. Psyschology must have some subjective determinations when things are not discretely measureable. This does not mean subjective data is bad. You misunderstand the term here.\n \n But maybe that's because you seem to be Rand-head and blindly misunderstand the term objective. (By her definition, by the way, you should be agreeing with this science.)\n \n Back to the main subject. \n \n Homosexuality is not a mental illness because is doesn't act like one, according to extensive research. Therefore, clinical psychologists have no business treating it like one.\n \n You can call it a sin or immoral if you want, but this is outside the purview of Mental Health Care. Nothing more to say.\n\n \n LOL. Bravo. Well-said.", 
   {}, 
   434766, 
   null, 
   1311008640.0
  ], 
  [
   434768, 
   null, 
   "poet", 
   "\"My\" science. You got something against science?\n\n \n Don't you know. He believes in creationism, and ID. You know...the Earth is only 6K and man and dinosaurs occupied the same space in time.", 
   {}, 
   434744, 
   null, 
   1311008760.0
  ], 
  [
   434777, 
   null, 
   "Freedom", 
   "No offense, but it doesn't look like English is your first language the way you string barely related words together.\n\n No offense but I am completly ignoring that statement :p\n \n \nAnyway, you obviously know nothing about Clinical Psychology, psychiatry. Or clinical research, for that matter. The details (or facts) are clearly unimportant to you\n\n clearly ;)\n \n \nThis might be a reasonable working diagnosis (except the psychologist part) for mental illness and if so, homosexuality doesn't fit that definition.\n\n Really? Well I have a problem with relativist, subjectivist, and every other subscriber to degenerate moral theories. Do they have a mental illness?\n \n \nIt is amazing to me how people like you suddenly decide certain science is bad when it reaches a conclusion you don't like.\n\n It's not sudden. As I learn about a scientific concept I decide if it's \"bad\"; I always appreciated it when my professors went through the proof if there was time.\n \n Further ad absurdum is a completly valid objection to an idea.\n \n \nScience is perfectly fine for you when it serves your purpose, but if some facts don't strike your fancy, you suddenly think you can be expert in a field you know nothing about and spout firm opinions. Analagous the those who selectively \"disagree\" with evolutionary biology because they don't like its conclusions.\n \n This might have some effect if I didn't believe it was the betrayal of science to personal motives that causes these hoaxes and pretenders. Have you forgotten that I do have a problem with what is said about evolution and it's \"status\" as a theory of life's advancement?\n \n \nYou use words like \"subjective\" in this discussion. Psyschology must have some subjective determinations when things are not discretely measureable. This does not mean subjective data is bad. You misunderstand the term here.\n\n I understand the term perfectly. Subjective is bad in science. Why must psychology must have some subjective determinations? Are you saying that any psychological theory fundamentally lacks objectivity? If so you have said more against it than I.\n \n \nBut maybe that's because you seem to be Rand-head and blindly misunderstand the term objective. (By her definition, by the way, you should be agreeing with this science.)\n\n Maybe you disagree with me because you seem to be a non-rand-head and blindly misunderstand the term objective.\n \n \nHomosexuality is not a mental illness because is doesn't act like one, according to extensive research. Therefore, clinical psychologists have no business treating it like one.\n \n You can call it a sin or immoral if you want, but this is outside the purview of Mental Health Care. Nothing more to say.\n\n You say it doesn't act like one but you still have not explicitly accepted a working definition. Are you saying the one I just threw out there is good enough?\n \n \nLOL. Bravo. Well-said.\n\n \n \nDon't you know. He believes in creationism, and ID. You know...the Earth is only 6K and man and dinosaurs occupied the same space in time.\n\n Still having trouble with honesty, logic; or any other human virtue besides persistence poet? What do I have to do to get you to ignore me :p", 
   {}, 
   434768, 
   null, 
   1311035100.0
  ], 
  [
   434785, 
   null, 
   "thelmoose", 
   "No offense but I am completly ignoring that statement :p\n \n \n clearly ;)\n \n \n Really? Well I have a problem with relativist, subjectivist, and every other subscriber to degenerate moral theories. Do they have a mental illness?\n \n \n It's not sudden. As I learn about a scientific concept I decide if it's \"bad\"; I always appreciated it when my professors went through the proof if there was time.\n \n Further ad absurdum is a completly valid objection to an idea.\n \n \n This might have some effect if I didn't believe it was the betrayal of science to personal motives that causes these hoaxes and pretenders. Have you forgotten that I do have a problem with what is said about evolution and it's \"status\" as a theory of life's advancement?\n \n \n I understand the term perfectly. Subjective is bad in science. Why must psychology must have some subjective determinations? Are you saying that any psychological theory fundamentally lacks objectivity? If so you have said more against it than I.\n \n \n Maybe you disagree with me because you seem to be a non-rand-head and blindly misunderstand the term objective.\n \n \n You say it doesn't act like one but you still have explicitly accepted a working definition. Are you saying the one I just threw out there is good enough?\n \n \n \n \n Still having trouble with honesty, logic; or any other human virtue besides persistence poet? What do I have to do to get you to ignore me :p\n\n \n Pardon me for wasting our time. \n The situation is much worse than I thought.\n \n I'm still banking on 10th grade, max. The weird kid that nobody likes. Future is scary, like, serial killler or shooting spree.\n \n I shall back off.", 
   {}, 
   434777, 
   null, 
   1311045300.0
  ], 
  [
   434787, 
   null, 
   "Freedom", 
   "Pardon me for wasting our time. \n The situation is much worse than I thought.\n \n I'm still banking on 10th grade, max. The weird kid that nobody likes. Future is scary, like, serial killler or shooting spree.\n \n I shall back off.\n\n That's nice I'll just file that in with the 'teenage serial killer ad hominems' they are the best IMO. Sure you're not self projecting?", 
   {}, 
   434785, 
   null, 
   1311047040.0
  ], 
  [
   434796, 
   null, 
   "jazyjason", 
   "You family likely has a whole different perspective on this, and likely a more mature one than yours. They probably know you a lot better than you think they do.\n\n \n Oh yes I'm certain their perspectives on life are more mature especially when it comes to my mothers own gambling addiction and my fathers power trips... typical Christian family. Full of dysfunction.\n \n Jyoshu for once I'd advise you to hold your tongue on the matter. You don't know my family and trying to take an opposite stance on assumption is a major fallacy.\n \n \n \n \nHope he could hear you ok through his tinfoil hat.\n\n \n Oh he hears me just fine thank you. And I'd be careful if I were you tossing around unwarranted insults like that. Mr Write is hardly one who blocks out peoples opinions.", 
   {}, 
   434761, 
   null, 
   1311058080.0
  ], 
  [
   434797, 
   null, 
   "jazyjason", 
   "\n \n Wow, I did not realize you were so close to this. Well I do not wish to offend you so forgive me if using you as an example is pushing it.\n\n \n Oh no it's fine. Just exactly my point people cannot judge a book by it's cover yet that's exactly what a majority of society does when it concerns gays.\n \n \nStories like yours underscore the validity of my point that the knowledge and science of psychology must be objectively defined so as to disallow quacks from invoking it's name as authority for what is in truth nothing more than their 'take' translated to advice or pressure. I think you'll agree that people who believe it's wrong will continue to 'offer' these services regardless of any official position.\n\n \n Of course they will. They'll maks prejudice with medicine and the revolving door will continue.\n \n \nThe best possible thing for anyone who in such a situation to know is objective morality, to that end the best way for society to support these people is to make information and apologetics for objective morality available.\n\n \n Hiw about live and let live? What you do in your bedroom is private and be respectful? Heaven forbid humanity treats each other with unwarranted kindness.\n \n \n\"The worst guilt is to accept an unearned guilt.\" - Ayn Rand\n\n \n Mhm.\n \n \n \nDo you understand now?\nYep.\n \n \n \nThe first question anyone should ask themselves about something is 'is this moral', the second should be 'why'. Relativism is the greatest producer of guilt that has ever existed, how can you know if you should feel guilt if there is no standard but whether other people condemn you?\n\n \n I don't ask myself when I kiss my partner is if it's moral. I have my own standard of morals. I abide by the law, I pay my taxes, go to work, and hope to have a decent life while treating others right.\n \n \n \nIt is immoral that you are being forced to pay for them, that I am being forced to pay for them. Measures must be taken immediately to establish a voluntary society.\n\n \n Meh. Their just quacks plain and simple", 
   {}, 
   434754, 
   null, 
   1311058440.0
  ], 
  [
   434801, 
   null, 
   "Freedom", 
   "Oh no it's fine. Just exactly my point people cannot judge a book by it's cover yet that's exactly what a majority of society does when it concerns gays.\n\n lol, well I didn't know that you didn't have any experience with these clinics but I did assume it; the kind of depression you mentioned is no light matter. It's like finding out that someone in the room visited a place you were talking about, it's reasonable to assume that they haven't because it's rare (or at least in this case you hope it was rare).\n \n \nHiw about live and let live?\n\n That phrase refers to a moral position.\n \n \nHeaven forbid humanity treats each other with unwarranted kindness.\n\n I actually have to agree with that :p\n \n \nYep.\n\n Would you mind discussing your conclusions, I am quite interested and have been annoyed at the refusal of pretty much anyone to address the matter scientifically.\n \n They will blather on for hours 'choice' vs 'innate' but both sides refuse to advance a real theory.\n \n \nI don't ask myself when I kiss my partner is if it's moral. I have my own standard of morals.\n\n Alright, again please do not mistake this for rudeness; it is simply unfortunate way of debate forums that you only get responses when people disagree.\n \n You obviously did ask yourself if homosexuality was moral, and as evidenced by your depression and suicide attempts you believed it wasn't, the guilt doesn't spring from nowhere, you had to believe that you were doing something wrong it is it's only source.\n \n It appears that you have since arrived at a more rational conclusion about homosexuality, but you still have asked yourself and now answer 'yes'. Notice how the very next sentence after you claimed you don't ask yourself you said 'I have my own standard of morals'.\n \n It's not invalid just because it doesn't come from others, in fact it's never valid just because it comes from others.\n \n \nI abide by the law, I pay my taxes, go to work, and hope to have a decent life while treating others right.\n\n You are committed to the good, and the freedom from religion is understanding that some ancient text has no monopoly on the good. This was a philosophical journey, everyone needs philosophy and it really bugs me to no end when people act like it's some high tower abstractions disconnected from real life. Your philosophical growth has saved you from literally deadly and unfounded guilt. Few sciences can claim as much destruction or greatness as philosophy.\n \n I would like to note that the law is not guaranteed to be moral, if you were in NAZI Germany I trust you would do the right thing regardless of the law.", 
   {}, 
   434797, 
   null, 
   1311062640.0
  ], 
  [
   434811, 
   null, 
   "jyoshu", 
   "Oh yes I'm certain their perspectives on life are more mature especially when it comes to my mothers own gambling addiction and my fathers power trips... typical Christian family. Full of dysfunction. Jyoshu for once I'd advise you to hold your tongue on the matter. You don't know my family and trying to take an opposite stance on assumption is a major fallacy.\n\n \n Sorry, but there are two sides to every story. And theirs probably has a lot more life experiences than yours. In terms of 'holding my tongue', you put your family out for discussion on this forum by bringing them up. I'm just pointing out that teenage angst often views parents in certain light. Many kids have contemplated suicide at some point--you're not that unusual in that regard. There's a good chance that when you're older you'll realize they probably actually loved you and were a lot better parents than you think.\n \n \nOh he hears me just fine thank you.\n\n \n Oh I bet he does! emoticon_xangel", 
   {}, 
   434796, 
   null, 
   1311088620.0
  ], 
  [
   434881, 
   null, 
   "poet", 
   "Pardon me for wasting our time. \n The situation is much worse than I thought.\n \n I'm still banking on 10th grade, max. The weird kid that nobody likes. Future is scary, like, serial killler or shooting spree.\n \n I shall back off.\n\n \n Me, too. End of days worse.", 
   {}, 
   434785, 
   null, 
   1311172500.0
  ], 
  [
   434920, 
   null, 
   "gansao", 
   "I want them to sit down shut up and mind their own business, if they won't do that then they need to be bitch slapped.\n\n \n lolemoticon_xclown......", 
   {}, 
   434732, 
   null, 
   1311194100.0
  ], 
  [
   434921, 
   null, 
   "gansao", 
   "Why is it that wanting to have deviant sex is not a mental illness but being repelled by it is?", 
   {}, 
   434920, 
   null, 
   1311194160.0
  ], 
  [
   434937, 
   null, 
   "Lovinliberal11", 
   "I hope she loses because of this.", 
   {}, 
   434777, 
   null, 
   1311198240.0
  ], 
  [
   434939, 
   null, 
   "jazyjason", 
   "lol, well I didn't know that you didn't have any experience with these clinics but I did assume it; the kind of depression you mentioned is no light matter. It's like finding out that someone in the room visited a place you were talking about, it's reasonable to assume that they haven't because it's rare (or at least in this case you hope it was rare).\n\n \n Well it's sadly not as rare as you think. It doesn't eve have to BE a clinic. It could just be a pastor hounding you day in and day out as well as your prejudiced family trying to \"fix\" you.\n \n Just look up how many LDS teens have committed suicide because of their sexuality for example. These young people even blew their brains out on the steps of their main center in Salt Lake! \n \n And still they did nothing.... Nor do they care. All they care about is their mandatory 10% of your income you MUST give in order to keep the church growing...\n \n \n \nThat phrase refers to a moral position.\n\n \n Oh I know.\n \n \n \nI actually have to agree with that :p\n\n \n emoticon_xgood\n \n \n \nWould you mind discussing your conclusions, I am quite interested and have been annoyed at the refusal of pretty much anyone to address the matter scientifically.\n\n \n As far as what the root of homosexuality? In all honesty I think it stems from our evolution as a species. Homosexuality has been observed in 1500 active species in the animal kingdom (probably more by now) and even observed male cranes raising young as well as Penguins.\n \n In other words, it seems that even in nature although a rare occurrence (at least from what we can observe since we cannot see all of natures doings at once 100% of the time) homosexuality is like a form of population control, and a branch of species being able to care for one another.\n \n Two males raising young ensures that the genetic line will continue of that species. If the young dies due to lack of care and upbringing, then it's a loss.\n \n I think in a loose sense of a theory that homosexuality has been passed down as an evolutionary trait. A makeup in our brain somehow. I'm not exactly sure how it would be, but it reflects heavily upon homosexuality in nature.\n \n The desire to raise young for example. Look at how many gays want to adopt or form unions and marry?\n \n I believe it is a combination of evolution, genetics, brain activity, DNA/RNA and development at birth as well as upbringing and environment.\n \n Do I think a person is \"born\" gay? No. As a child you have no inkling at birth the concept of homosexuality. However! Due to evolution and genetics I do believe that as the child progresses in development those dormant traits manifest and become prominent as the child reaches adolescence. \n \n \nThey will blather on for hours 'choice' vs 'innate' but both sides refuse to advance a real theory.\n\n \n Well look above. That's my humble thoughts on it. However I\"ll leave the final conclusions to science.\n \n \n \nAlright, again please do not mistake this for rudeness; it is simply unfortunate way of debate forums that you only get responses when people disagree.\n\n \n It's fine. Sadly the more abrasive members on this forums have whittled down my form of formal debate. Call it a wave battering at a cliff or something.\n \n \n \nYou obviously did ask yourself if homosexuality was moral, and as evidenced by your depression and suicide attempts you believed it wasn't, the guilt doesn't spring from nowhere, you had to believe that you were doing something wrong it is it's only source.\n\n \n Well morality is I think the wrong concept your going for. See the roots of my guilt and suicide attempts sprang from a vigorous religious upbringing as well as the stereotypes of society. At school kids would say \"oh that's gay. Your gay. XXXXXX.\" And those words no matter how seemingly insignificant have a profound effect on shaping a young child's perception.\n \n Like I stated earlier it all comes down to environment Freedom. Put a child with homosexual traits in a negative environment and see's what happens compared to a child in a positive environment. It's simple.\n \n One will flourish and grow being encouraged, be able to learn better, and the other will struggle at school. I cannot tell you how many classes I failed as a teenager cause of my struggles with my sexuality yet tested positive for the GATE program in California and MENSA.\n \n The problem was my lack of focus, and being able to finish things. I developed a failure complex which to this very day I fight. We as humans condition ourselves and take in whats around us very seriously. We're a species of society. It's part of our evolution yet the roots are still there....\n \n I am only being very open because I feel honesty is the best way to open peoples eyes and look past the \"gay straight\" debate and look at it from a more objective point of view.\n \n \nIt appears that you have since arrived at a more rational conclusion about homosexuality, but you still have asked yourself and now answer 'yes'. Notice how the very next sentence after you claimed you don't ask yourself you said 'I have my own standard of morals'.\n\n \n Yes. We all derive from our own conclusions Freedom. However, my morals are constantly changing. In the past five years my views have shifted so far and grow so continuous I cannot list them all. The ability to change ones mind or admit they were wrong is a testament to the true nature of human consciousness.\n \n \nIt's not invalid just because it doesn't come from others, in fact it's never valid just because it comes from others.\n\n \n Explain more please.\n \n \n \nYou are committed to the good, and the freedom from religion is understanding that some ancient text has no monopoly on the good. This was a philosophical journey, everyone needs philosophy and it really bugs me to no end when people act like it's some high tower abstractions disconnected from real life. Your philosophical growth has saved you from literally deadly and unfounded guilt. Few sciences can claim as much destruction or greatness as philosophy.\n\n \n It has taken many tears, many cuts, bruises, rasped voices, and dark trials to overcome to be able to look at myself and feel loved. The reason I am so adamant against religion is simply because I am still a victim of it's damnation, it's scoffing, and it's utter lack of compassion.\n \n \nI would like to note that the law is not guaranteed to be moral, if you were in NAZI Germany I trust you would do the right thing regardless of the law.\n\n \n I'd be a pile of ashes before long so I'd probably give my life somehow in fighting the Nazi's anyway I could. People forget that the \"pink triangles\" were persecuted as much even worse in some regards than Jews. And unlike the Jews, we homosexuals that survived continued to be persecuted into the 50's and 60's.", 
   {}, 
   434801, 
   null, 
   1311198720.0
  ], 
  [
   434944, 
   null, 
   "gansao", 
   "Regarding homosexual penguins raising young...who lays the eggs?", 
   {}, 
   434939, 
   null, 
   1311199380.0
  ], 
  [
   434950, 
   null, 
   "jazyjason", 
   "Sorry, but there are two sides to every story.\n \n \n Then call my mother and ask her Jyoshu. You certainly do not want to hear the validity of my side and I doubt that even if you sat down and spoke with my parents your mind would be swayed towards \"my side\". \n \n It certainly shows me Jyoshu that you simple cannot grasp, nor indeed want to grasp the reality of peoples lives. Having evidence and seeing it before you in my opinion, makes you even more agitated at the results when they are not what you were seeking.\n \n Having a gay person share their actual lives and attempt to paint a picture of the reality they face is something you simply refuse to face. And I have observed your tone in posts to have shifted from someone who goes \"I see BUT...\" to \"Well your just wrong and this is why *Insert spin*\"\n \n I think it is because you feel your on the defensive. Where I have nothing to lose you however have much to lose. Your stance on religion, your beliefs, your \"morals\" as you put them, even your outlook on certain groups of people.\n \n That I believe is what you most fear and what the more how should I put this ... forward of your side think.\n \n \n \n And theirs probably has a lot more life experiences than yours. \n\n \n Certainly. My Father in his late sixties my mother in her late Forties. Yet you cannot compare life experience to understanding ones sexuality Jyoshu. Your interjecting that somehow sexuality and my parents position are correct due to their time on Earth.\n \n You attempt to paint my opinion as nothing more than an adolescent teenager devoid of any real experience which is entirely false. Just because someone is old doesn't automatically make them wise, and just because someone is young doesn't make them ignorant or stupid.\n \n \n In terms of 'holding my tongue', you put your family out for discussion on this forum by bringing them up. \n\n \n Certainly I did yet you interjected and brought it to the next level. You insulted my intelligence and the validity of my opinion simply on my age compared to that of my parents. If you cannot debate on fact Jyoshu please feel free to refrain from using crude tactics in your posts.\n \n Even I in my \"lack of life experience\" can see past them.\n \n \n I'm just pointing out that teenage angst often views parents in certain light.\n\n \n So now I am a homosexual because I felt i needed to rebel against my parents right? Jyoshu. I've never taken drugs, never stolen, never been in trouble with the law, and am an upstanding member of society and a Veteran.\n \n if anything I feared my parents beyond rebellion especially my potentially violent Father. Your observation is noted but misplaced as usual..\n \n \n \n \n Many kids have contemplated suicide at some point--you're not that unusual in that regard. \n\n \n This is almost laughable except for the context in which you put it. Unusual. So your saying that gay teens throwing their lives away is just matter of fact. Or rather that my life is just another number on a census? Or is it that the very notion of taking one's own life seems trivial to you?\n \n Jyoshu your stance and grasping at straws is pitiable if not for the gaping holes you leave in your argument. At least in this post please reflect on the utter lack of empathy you stated.\n \n \nThere's a good chance that when you're older you'll realize they probably actually loved you and were a lot better parents than you think.\n\n \n It is not a matter of love Jyoshu. Love here is not the issue. I love my parents no matter what. Their blood. My mother needs a liver transplant and if I'm a match I'll be the first to donate half of mine no questions asked.\n \n Your attempting to paint my sexuality and my Atheism on rebellion. When in actuality I am actually a pretty selfless person. I don't seek accolades in my charity I just put forth the best I can in myself. And that is more than an ancient text can tell you to do or live your life.\n \n \n \n \nOh I bet he does! emoticon_xangel\n He does. And he's helped me out many times escaping the hellish situation I was in with my family. I owe him a great deal.", 
   {}, 
   434811, 
   null, 
   1311200160.0
  ], 
  [
   434951, 
   null, 
   "jazyjason", 
   "Regarding homosexual penguins raising young...who lays the eggs?\n\n \n Well... the females obviously. But what if the mother dies? Or there is no others to raise the offspring? I know what your trying to point out but that wasn't the object of my observation on homosexuality in nature.", 
   {}, 
   434944, 
   null, 
   1311200280.0
  ], 
  [
   434954, 
   null, 
   "gansao", 
   "Well... the females obviously. But what if the mother dies? Or there is no others to raise the offspring? I know what your trying to point out but that wasn't the object of my observation on homosexuality in nature.\n\n \n So two ' homosexual' cranes/penguins/tits get together and scour for dead mother birds to raise orphan chicks?\n You never thought that one through did you?\n There is no such thing as ' homosexuality' in nature.\n Two confused penguins or two sex starved chimpanzees trying to rut each other is not homosexuality...unless a 'scientist' gets a grant to study and find it.....", 
   {}, 
   434951, 
   null, 
   1311200640.0
  ], 
  [
   434959, 
   null, 
   "jazyjason", 
   "So two ' homosexual' cranes/penguins/tits get together and scour for dead mother birds to raise orphan chicks?\n\n \n No I did not say that. Yet already your post screams trying to drown out any fact or evidence as I'll point out below....\n \n \n \nYou never thought that one through did you?\n \n \n Certainly not. Congratulations we now have a new movie about homosexual zombie penguins we can show in bible class....\n \n \n \nThere is no such thing as ' homosexuality' in nature.\n\n \n Okay. Your right Gansao. Because see if I try to give you evidence all you will do is counter it, ignore it, and spin it while you cover your ears and scream.\n \n \n \nTwo confused penguins or two sex starved chimpanzees trying to rut each other is not homosexuality...unless a 'scientist' gets a grant to study and find it.....\n\n \n A nice play there Gansao. Such venom! I'm sure Charles Darwin is turning in his grave now that you exposed this conspiracy....", 
   {}, 
   434954, 
   null, 
   1311201180.0
  ], 
  [
   434960, 
   null, 
   "jazyjason", 
   "Not that it matters to anyone on the other side of the debate... yet here is an interesting article:\n \n Male Homosexuality Can Be Explained Through A Specific Model Of Darwinian Evolution, Study Shows\n \n \n Male Homosexuality Can Be Explained Through A Specific Model Of Darwinian Evolution, Study Shows\n \n ScienceDaily (June 18, 2008) - An Italian research team, consisting of Andrea Camperio Ciani and Giovanni Zanzotto at the University of Padova and Paolo Cermelli at the University of Torino, found that the evolutionary origin and maintenance of male homosexuality in human populations could be explained by a model based around the idea of sexually antagonistic selection, in which genetic factors spread in the population by giving a reproductive advantage to one sex while disadvantaging the other.\n \n Male homosexuality is thought to be influenced by psycho-social factors, as well as having a genetic component. This is suggested by the high concordance of sexual orientation in identical twins and the fact that homosexuality is more common in males belonging to the maternal line of male homosexuals. These effects have not been shown for female homosexuality, indicating that these two phenomena may have very different origins and dynamics.\n \n Male homosexuality is difficult to explain under Darwinian evolutionary models, because carriers of genes predisposing towards male homosexuality would be likely to reproduce less than average, suggesting that alleles influencing homosexuality should progressively disappear from a population. This changed when previous work by Camperio Ciani and collaborators, published in 2004, showed that females in the maternal line of male homosexuals were more fertile than average.\n \n Challenged by all these empirical data, the authors of the new study considered a range of different hypotheses for the genetic diffusion of male homosexuality. These included: the genetic maternal effects on sons, the heterozygote advantage (as is found in malaria resistance), and \"sexually antagonistic selection.\" The latter is a particular aspect of Darwinian evolution, in which genetic factors spread in the population by giving a reproductive advantage to one sex while disadvantaging the other. This type of evolution has been previously found in insects, birds, and some mammals, but never in humans.\n \n To discover and clarify the dynamics of the genetic factors for homosexuality, the researchers had to screen a large set of models and exclude them one by one. They concluded that the only possible model was that of sexually antagonistic selection. The other models did not fit the empirical data, either implying that the alleles would become extinct too easily or invade the population, or failing to describe the distribution patterns of male homosexuality and female fecundity observed in the families of homosexuals. Only the model of sexually antagonistic selection involving at least two genes -- at least one of which must be on the X chromosome (inherited in males only through their mother) -- accounted for all the known data.\n \n The results of this model show the interaction of male homosexuality with increased female fecundity within human populations, in a complex dynamic, resulting in the maintenance of male homosexuality at stable and relatively low frequencies, and highlighting the effects of heredity through the maternal line.\n \n These findings provide new insights into male homosexuality in humans. In particular, they promote a focus shift in which homosexuality should not be viewed as a detrimental trait (due to the reduced male fecundity it entails), but, rather, should be considered within the wider evolutionary framework of a characteristic with gender-specific benefits, and which promotes female fecundity. This may well be the evolutionary origin of this genetic trait in human beings.\n \n The possible widespread occurrence of sexually antagonistic characteristics in evolutionary processes, which play their evolutionary game by giving a fecundity benefit to one sex while disadvantaging the other, has only recently begun to be appreciated. This is understood as a key mechanism through which high levels of genetic variation are maintained in biological populations.\n \n Male homosexuality is just the first example of an unknown number of sexually antagonistic traits, which contribute to the maintenance of the natural genetic variability of humans. The new perspectives opened by the models developed for sexually antagonistic selection may also contribute to a better understanding of most genetically-based sexual conflicts, which are, at present, poorly understood in humans.\n \n An unexpected implication of the new models concerns the impact that the sexually antagonistic genetic factors for male homosexuality have on the overall fecundity of a population. The findings suggest that the proportion of male homosexuals may signal a corresponding proportion of females with higher fecundity. Consequently, these factors always contribute, all else being equal, a positive net increase of the fecundity of the whole population, when compared to populations in which such factors are lower or absent. This increase grows as the population baseline fecundity decreases; this means that the genes influencing male homosexuality end up playing the role of a buffer effect on any external factors lowering the overall fecundity of the whole population.", 
   {
    "unicode_changes_made": true
   }, 
   434959, 
   null, 
   1311201360.0
  ], 
  [
   434964, 
   null, 
   "gansao", 
   "No I did not say that. Yet already your post screams trying to drown out any fact or evidence as I'll point out below....\n \n \n \n \n Certainly not. Congratulations we now have a new movie about homosexual zombie penguins we can show in bible class....\n \n \n \n \n Okay. Your right Gansao. Because see if I try to give you evidence all you will do is counter it, ignore it, and spin it while you cover your ears and scream.\n \n \n \n \n A nice play there Gansao. Such venom! I'm sure Charles Darwin is turning in his grave now that you exposed this conspiracy....\n\n \n I am not aware that Charles Darwin stated that there were homosexual animals neither am I aware that he believed that homosexuality in animals would have significance in evolution had it existed\n What I am aware of is that homosexuals seem to feel the need to for an existence of homosexual animals.\n Maybe they need to dispel the notion that they are ' unnatural'.\n You have not explained how the homosexual birds get their eggs...Are they opportunistic egg thieves? Do they look for dead females and foster their brood? Surely this has been studied or maybe overlooked?", 
   {}, 
   434959, 
   null, 
   1311202260.0
  ], 
  [
   434966, 
   null, 
   "gansao", 
   "Not that it matters to anyone on the other side of the debate... yet here is an interesting article:\n \n Male Homosexuality Can Be Explained Through A Specific Model Of Darwinian Evolution, Study Shows\n \n \n Male Homosexuality Can Be Explained Through A Specific Model Of Darwinian Evolution, Study Shows\n \n ScienceDaily (June 18, 2008) - An Italian research team, consisting of Andrea Camperio Ciani and Giovanni Zanzotto at the University of Padova and Paolo Cermelli at the University of Torino, found that the evolutionary origin and maintenance of male homosexuality in human populations could be explained by a model based around the idea of sexually antagonistic selection, in which genetic factors spread in the population by giving a reproductive advantage to one sex while disadvantaging the other.\n \n Male homosexuality is thought to be influenced by psycho-social factors, as well as having a genetic component. This is suggested by the high concordance of sexual orientation in identical twins and the fact that homosexuality is more common in males belonging to the maternal line of male homosexuals. These effects have not been shown for female homosexuality, indicating that these two phenomena may have very different origins and dynamics.\n \n Male homosexuality is difficult to explain under Darwinian evolutionary models, because carriers of genes predisposing towards male homosexuality would be likely to reproduce less than average, suggesting that alleles influencing homosexuality should progressively disappear from a population. This changed when previous work by Camperio Ciani and collaborators, published in 2004, showed that females in the maternal line of male homosexuals were more fertile than average.\n \n Challenged by all these empirical data, the authors of the new study considered a range of different hypotheses for the genetic diffusion of male homosexuality. These included: the genetic maternal effects on sons, the heterozygote advantage (as is found in malaria resistance), and \"sexually antagonistic selection.\" The latter is a particular aspect of Darwinian evolution, in which genetic factors spread in the population by giving a reproductive advantage to one sex while disadvantaging the other. This type of evolution has been previously found in insects, birds, and some mammals, but never in humans.\n \n To discover and clarify the dynamics of the genetic factors for homosexuality, the researchers had to screen a large set of models and exclude them one by one. They concluded that the only possible model was that of sexually antagonistic selection. The other models did not fit the empirical data, either implying that the alleles would become extinct too easily or invade the population, or failing to describe the distribution patterns of male homosexuality and female fecundity observed in the families of homosexuals. Only the model of sexually antagonistic selection involving at least two genes -- at least one of which must be on the X chromosome (inherited in males only through their mother) -- accounted for all the known data.\n \n The results of this model show the interaction of male homosexuality with increased female fecundity within human populations, in a complex dynamic, resulting in the maintenance of male homosexuality at stable and relatively low frequencies, and highlighting the effects of heredity through the maternal line.\n \n These findings provide new insights into male homosexuality in humans. In particular, they promote a focus shift in which homosexuality should not be viewed as a detrimental trait (due to the reduced male fecundity it entails), but, rather, should be considered within the wider evolutionary framework of a characteristic with gender-specific benefits, and which promotes female fecundity. This may well be the evolutionary origin of this genetic trait in human beings.\n \n The possible widespread occurrence of sexually antagonistic characteristics in evolutionary processes, which play their evolutionary game by giving a fecundity benefit to one sex while disadvantaging the other, has only recently begun to be appreciated. This is understood as a key mechanism through which high levels of genetic variation are maintained in biological populations.\n \n Male homosexuality is just the first example of an unknown number of sexually antagonistic traits, which contribute to the maintenance of the natural genetic variability of humans. The new perspectives opened by the models developed for sexually antagonistic selection may also contribute to a better understanding of most genetically-based sexual conflicts, which are, at present, poorly understood in humans.\n \n An unexpected implication of the new models concerns the impact that the sexually antagonistic genetic factors for male homosexuality have on the overall fecundity of a population. The findings suggest that the proportion of male homosexuals may signal a corresponding proportion of females with higher fecundity. Consequently, these factors always contribute, all else being equal, a positive net increase of the fecundity of the whole population, when compared to populations in which such factors are lower or absent. This increase grows as the population baseline fecundity decreases; this means that the genes influencing male homosexuality end up playing the role of a buffer effect on any external factors lowering the overall fecundity of the whole population.\n\n \n Have you read this?\n It seems to state a conclusion without explaining how they came to it.", 
   {
    "unicode_changes_made": true
   }, 
   434960, 
   null, 
   1311202920.0
  ], 
  [
   434969, 
   null, 
   "simone", 
   "How come Marcus can't cure Michele's migraines with his wunnerful \"prayer\" therapy?", 
   {}, 
   434966, 
   null, 
   1311205020.0
  ], 
  [
   434974, 
   null, 
   "pappillion001", 
   "How come Marcus can't cure Michele's migraines with his wunnerful \"prayer\" therapy?\n\n \n Because he might have to consumate the marriage if she no longer had them", 
   {}, 
   434969, 
   null, 
   1311211800.0
  ], 
  [
   434975, 
   null, 
   "Freedom", 
   "Well it's sadly not as rare as you think. It doesn't eve have to BE a clinic. It could just be a pastor hounding you day in and day out as well as your prejudiced family trying to \"fix\" you.\n \n Just look up how many LDS teens have committed suicide because of their sexuality for example. These young people even blew their brains out on the steps of their main center in Salt Lake! \n \n And still they did nothing.... Nor do they care. All they care about is their mandatory 10% of your income you MUST give in order to keep the church growing...\n\n Well in the context of this thread the issue was someone doing the hounding under the pretext of medical treatment.\n \n \nAs far as what the root of homosexuality? In all honesty I think it stems from our evolution as a species. Homosexuality has been observed in 1500 active species in the animal kingdom (probably more by now) and even observed male cranes raising young as well as Penguins.\n \n In other words, it seems that even in nature although a rare occurrence (at least from what we can observe since we cannot see all of natures doings at once 100% of the time) homosexuality is like a form of population control, and a branch of species being able to care for one another.\n \n Two males raising young ensures that the genetic line will continue of that species. If the young dies due to lack of care and upbringing, then it's a loss.\n \n I think in a loose sense of a theory that homosexuality has been passed down as an evolutionary trait. A makeup in our brain somehow. I'm not exactly sure how it would be, but it reflects heavily upon homosexuality in nature.\n \n The desire to raise young for example. Look at how many gays want to adopt or form unions and marry?\n \n I believe it is a combination of evolution, genetics, brain activity, DNA/RNA and development at birth as well as upbringing and environment.\n \n Do I think a person is \"born\" gay? No. As a child you have no inkling at birth the concept of homosexuality. However! Due to evolution and genetics I do believe that as the child progresses in development those dormant traits manifest and become prominent as the child reaches adolescence. \n\n Do you think it's a uniform potential or is present only in certain frequencies? Do you think the same sequences are responsible for other deviations? You mentioned that it was population control, what mechanism could trigger an overpopulation response like this?\n \n \nWell morality is I think the wrong concept your going for. See the roots of my guilt and suicide attempts sprang from a vigorous religious upbringing as well as the stereotypes of society. At school kids would say \"oh that's gay. Your gay. XXXXXX.\" And those words no matter how seemingly insignificant have a profound effect on shaping a young child's perception.\n \n Like I stated earlier it all comes down to environment Freedom. Put a child with homosexual traits in a negative environment and see's what happens compared to a child in a positive environment. It's simple.\n \n One will flourish and grow being encouraged, be able to learn better, and the other will struggle at school. I cannot tell you how many classes I failed as a teenager cause of my struggles with my sexuality yet tested positive for the GATE program in California and MENSA.\n \n The problem was my lack of focus, and being able to finish things. I developed a failure complex which to this very day I fight. We as humans condition ourselves and take in whats around us very seriously. We're a species of society. It's part of our evolution yet the roots are still there....\n\n You wrote much but said little, all I got out of that is that your struggles with sexuality were caused by the condemnation of others. Their condemnation would have meant nothing to you if you knew they were wrong as you seem to know now.\n \n \nI am only being very open because I feel honesty is the best way to open peoples eyes and look past the \"gay straight\" debate and look at it from a more objective point of view.\n\n Q.E.D :)\n \n \nYes. We all derive from our own conclusions Freedom.\n\n Which I hope you don't mean to say are all different.\n \n \nHowever, my morals are constantly changing.\n\n That's not good.\n \n \nThe ability to change ones mind or admit they were wrong is a testament to the true nature of human consciousness.\n\n A dedication to truth requires that but it also requires the belief in a truth and a willingness to never betray that ideal.\n \n \nExplain more please.\n\n Oh I'm sure you must have heard one of my speeches by now.\n \n Morality is objective, the result of essentially a logical derivation. It is not a matter of arbitrary authority on any one's part. Suffering and fallacy is the only result of an incorrect morality, and the terrifying truth is that the majority of people think morality is a subjective concept defined by the arbitrary average of the public provided they even think enough about it to come to that perverse conclusion.\n \n Humans can and ought to cooperate, that means trusting the judgement of others. but one must never forget that it is trust not truth. Religion is as good a proof as any that 'so many people' can be wrong, followed closely by mass slavery and every other form of implemented collectivism.\n \n Anything anyone tells you and especially anything that pops into your head on it's own ought to be subject to a rational evaluation. There is no authority which transcends the truth, and the truth is that which is consistent to reality as evaluated by logic.\n \n \nIt has taken many tears, many cuts, bruises, rasped voices, and dark trials to overcome to be able to look at myself and feel loved. \n\n Do you love yourself?\n \n \nThe reason I am so adamant against religion is simply because I am still a victim of it's damnation, it's scoffing, and it's utter lack of compassion.\n\n The reason I am against religion is because it is based on faith.\n \n \nSo two ' homosexual' cranes/penguins/tits get together and scour for dead mother birds to raise orphan chicks?\n You never thought that one through did you?\n There is no such thing as ' homosexuality' in nature.\n Two confused penguins or two sex starved chimpanzees trying to rut each other is not homosexuality...unless a 'scientist' gets a grant to study and find it.....\n\n Gansao there is such a thing as homosexuality in nature. Male animals have sex with other male animals; it doesn't get much more obvious than that. If you are talking about animals that only have sex with males no that doesn't really exist.\n \n \nNot that it matters to anyone on the other side of the debate... yet here is an interesting article:\n \n Male Homosexuality Can Be Explained Through A Specific Model Of Darwinian Evolution, Study Shows\n \n \n Male Homosexuality Can Be Explained Through A Specific Model Of Darwinian Evolution, Study Shows\n \n ScienceDaily (June 18, 2008) - An Italian research team, consisting of Andrea Camperio Ciani and Giovanni Zanzotto at the University of Padova and Paolo Cermelli at the University of Torino, found that the evolutionary origin and maintenance of male homosexuality in human populations could be explained by a model based around the idea of sexually antagonistic selection, in which genetic factors spread in the population by giving a reproductive advantage to one sex while disadvantaging the other.\n \n Male homosexuality is thought to be influenced by psycho-social factors, as well as having a genetic component. This is suggested by the high concordance of sexual orientation in identical twins and the fact that homosexuality is more common in males belonging to the maternal line of male homosexuals. These effects have not been shown for female homosexuality, indicating that these two phenomena may have very different origins and dynamics.\n \n Male homosexuality is difficult to explain under Darwinian evolutionary models, because carriers of genes predisposing towards male homosexuality would be likely to reproduce less than average, suggesting that alleles influencing homosexuality should progressively disappear from a population. This changed when previous work by Camperio Ciani and collaborators, published in 2004, showed that females in the maternal line of male homosexuals were more fertile than average.\n \n Challenged by all these empirical data, the authors of the new study considered a range of different hypotheses for the genetic diffusion of male homosexuality. These included: the genetic maternal effects on sons, the heterozygote advantage (as is found in malaria resistance), and \"sexually antagonistic selection.\" The latter is a particular aspect of Darwinian evolution, in which genetic factors spread in the population by giving a reproductive advantage to one sex while disadvantaging the other. This type of evolution has been previously found in insects, birds, and some mammals, but never in humans.\n \n To discover and clarify the dynamics of the genetic factors for homosexuality, the researchers had to screen a large set of models and exclude them one by one. They concluded that the only possible model was that of sexually antagonistic selection. The other models did not fit the empirical data, either implying that the alleles would become extinct too easily or invade the population, or failing to describe the distribution patterns of male homosexuality and female fecundity observed in the families of homosexuals. Only the model of sexually antagonistic selection involving at least two genes -- at least one of which must be on the X chromosome (inherited in males only through their mother) -- accounted for all the known data.\n \n The results of this model show the interaction of male homosexuality with increased female fecundity within human populations, in a complex dynamic, resulting in the maintenance of male homosexuality at stable and relatively low frequencies, and highlighting the effects of heredity through the maternal line.\n \n These findings provide new insights into male homosexuality in humans. In particular, they promote a focus shift in which homosexuality should not be viewed as a detrimental trait (due to the reduced male fecundity it entails), but, rather, should be considered within the wider evolutionary framework of a characteristic with gender-specific benefits, and which promotes female fecundity. This may well be the evolutionary origin of this genetic trait in human beings.\n \n The possible widespread occurrence of sexually antagonistic characteristics in evolutionary processes, which play their evolutionary game by giving a fecundity benefit to one sex while disadvantaging the other, has only recently begun to be appreciated. This is understood as a key mechanism through which high levels of genetic variation are maintained in biological populations.\n \n Male homosexuality is just the first example of an unknown number of sexually antagonistic traits, which contribute to the maintenance of the natural genetic variability of humans. The new perspectives opened by the models developed for sexually antagonistic selection may also contribute to a better understanding of most genetically-based sexual conflicts, which are, at present, poorly understood in humans.\n \n An unexpected implication of the new models concerns the impact that the sexually antagonistic genetic factors for male homosexuality have on the overall fecundity of a population. The findings suggest that the proportion of male homosexuals may signal a corresponding proportion of females with higher fecundity. Consequently, these factors always contribute, all else being equal, a positive net increase of the fecundity of the whole population, when compared to populations in which such factors are lower or absent. This increase grows as the population baseline fecundity decreases; this means that the genes influencing male homosexuality end up playing the role of a buffer effect on any external factors lowering the overall fecundity of the whole population.\n\n So basically homosexuality exists because the guy loving gene in some women is so useful that it hasn't been shut off in males of the line, at least for now.", 
   {
    "unicode_changes_made": true
   }, 
   434969, 
   null, 
   1311212220.0
  ], 
  [
   434986, 
   null, 
   "gansao", 
   "Well in the context of this thread the issue was someone doing the hounding under the pretext of medical treatment.\n \n \n Do you think it's a uniform potential or is present only in certain frequencies? Do you think the same sequences are responsible for other deviations? You mentioned that it was population control, what mechanism could trigger an overpopulation response like this?\n \n \n You wrote much but said little, all I got out of that is that your struggles with sexuality were caused by the condemnation of others. Their condemnation would have meant nothing to you if you knew they were wrong as you seem to know now.\n \n \n Q.E.D :)\n \n \n Which I hope you don't mean to say are all different.\n \n \n That's not good.\n \n \n A dedication to truth requires that but it also requires the belief in a truth and a willingness to never betray that ideal.\n \n \n Oh I'm sure you must have heard one of my speeches by now.\n \n Morality is objective, the result of essentially a logical derivation. It is not a matter of arbitrary authority on any one's part. Suffering and fallacy is the only result of an incorrect morality, and the terrifying truth is that the majority of people think morality is a subjective concept defined by the arbitrary average of the public provided they even think enough about it to come to that perverse conclusion.\n \n Humans can and ought to cooperate, that means trusting the judgement of others. but one must never forget that it is trust not truth. Religion is as good a proof as any that 'so many people' can be wrong, followed closely by mass slavery and every other form of implemented collectivism.\n \n Anything anyone tells you and especially anything that pops into your head on it's own ought to be subject to a rational evaluation. There is no authority which transcends the truth, and the truth is that which is consistent to reality as evaluated by logic.\n \n \n Do you love yourself?\n \n \n The reason I am against religion is because it is based on faith.\n \n \n Gansao there is such a thing as homosexuality in nature. Male animals have sex with other male animals; it doesn't get much more obvious than that. If you are talking about animals that only have sex with males no that doesn't really exist.\n \n \n So basically homosexuality exists because the guy loving gene in some women is so useful that it hasn't been shut off in males of the line, at least for now.\n\n \n Regarding your point about homosexuality in nature.\n Homosexual activity takes place in prisons by frustrated heterosexuals but gays on this forum differentiate between these people and ' real' homosexuals.\n I do not believe that two male penguins sitting on an egg makes them homosexuals nor do I accept two sexualy frustrated chimpanzees dry humping each other to be a parallel to human homosexuality.\n Also gays on this forum regularly point out that homosexuality is not just the sex act...they talk about love and desire for other men.\n When it can be proved that male animals have the exact equivalent of the bonding between the male and female then I will accept that there are gay animals.\n Who makes the arguments that polygamy is natural and therefore more acceptable because it occurs in animals?", 
   {}, 
   434975, 
   null, 
   1311247920.0
  ], 
  [
   434993, 
   null, 
   "poet", 
   "Regarding your point about homosexuality in nature.\n Homosexual activity takes place in prisons by frustrated heterosexuals but gays on this forum differentiate between these people and ' real' homosexuals.\n I do not believe that two male penguins sitting on an egg makes them homosexuals nor do I accept two sexualy frustrated chimpanzees dry humping each other to be a parallel to human homosexuality.\n Also gays on this forum regularly point out that homosexuality is not just the sex act...they talk about love and desire for other men.\n When it can be proved that male animals have the exact equivalent of the bonding between the male and female then I will accept that there are gay animals.\n Who makes the arguments that polygamy is natural and therefore more acceptable because it occurs in animals?\n\n \n You're about as stupid as they come. Not only is it not fair to link polygamy, bestiality, child molestation, incest, or any other aborrent behavior to homosexuality, it isn't even relevant.\n \n The pairings and unions that happen in confined spaces such as prisons or islands, or even ships at sea, is more about human touch and interaction rather than any sexual proclivities. Men like to \"get off\"...and at times, they're not particular about \"how\", where, or with whom. That's not homosexuality....that is frustration meets opportunity. Dumb dora. \n \n I'm in the 10th year of a monogamous relationship (my longest), and I deeply love my partner and he, me. And it's not about the sex act, as heterosexual marriages are hardly about the sex act.\n When it can be proven? Who are you that anything has to be proven to you?\n Bonding isn't something particular to only heteros. It's a human trait. You're dumber than dirt.", 
   {}, 
   434986, 
   null, 
   1311261840.0
  ], 
  [
   434994, 
   null, 
   "gansao", 
   "You're about as stupid as they come. Not only is it not fair to link polygamy, bestiality, child molestation, incest, or any other aborrent behavior to homosexuality, it isn't even relevant.\n \n The pairings and unions that happen in confined spaces such as prisons or islands, or even ships at sea, is more about human touch and interaction rather than any sexual proclivities. Men like to \"get off\"...and at times, they're not particular about \"how\", where, or with whom. That's not homosexuality....that is frustration meets opportunity. Dumb dora. \n \n I'm in the 10th year of a monogamous relationship (my longest), and I deeply love my partner and he, me. And it's not about the sex act, as heterosexual marriages are hardly about the sex act.\n When it can be proven? Who are you that anything has to be proven to you?\n Bonding isn't something particular to only heteros. It's a human trait. You're dumber than dirt.\n\n \n Pothead, you just linked bestiality,child molestation etc to homosexuality not meemoticon_xclown\n You dont read so well do you ...poet( what a joke).\n The various proddings of male animals on male animals are nearer to the gropings of frustrated prisoners than the ' loving' homosexual relationships that you and your gay pals tell us that you have.\n I dont really care about your relationship sweetplums..its not about you.\n Now mince awayemoticon_xgood", 
   {}, 
   434993, 
   null, 
   1311262320.0
  ], 
  [
   434996, 
   null, 
   "poet", 
   "Pothead, you just linked bestiality,child molestation etc to homosexuality not meemoticon_xclown\n You dont read so well do you ...poet( what a joke).\n The various proddings of male animals on male animals are nearer to the gropings of frustrated prisoners than the ' loving' homosexual relationships that you and your gay pals tell us that you have.\n I dont really care about your relationship sweetplums..its not about you.\n Now mince awayemoticon_xgood\n\n \n Oh, please. I know your type. And you're precisely the type that would link all of those abberations together with homosexuality.\n Love is a human quality...not exclusive to straights. You are stupid, aren't you?\n Mince? You're stuck on that. I'm not a queen...so there is no mincing.\n Come to Houston and espouse that XXXX. I'll meet you.", 
   {}, 
   434994, 
   null, 
   1311262980.0
  ], 
  [
   434997, 
   null, 
   "gansao", 
   "Oh, please. I know your type. And you're precisely the type that would link all of those abberations together with homosexuality.\n Love is a human quality...not exclusive to straights. You are stupid, aren't you?\n Mince? You're stuck on that. I'm not a queen...so there is no mincing.\n Come to Houston and espouse that XXXX. I'll meet you.\n\n \n Come to England and Ill meet you sugarplumemoticon_xbye\n \n You linked all those other abberations( although that is rich coming from a sexual deviant) together with homosexuality you dirty old man.\n \n We were talking about homosexuality in ANIMALS pothead but you keep insisting its about HUMANS ( read the caps) and then changing the subject to you and Mrs Poet....try to keep up !\n You mince..no doubt about itemoticon_xchicken", 
   {}, 
   434996, 
   null, 
   1311263400.0
  ], 
  [
   435029, 
   null, 
   "Lovinliberal11", 
   "You're about as stupid as they come. Not only is it not fair to link polygamy, bestiality, child molestation, incest, or any other aborrent behavior to homosexuality, it isn't even relevant.\n \n The pairings and unions that happen in confined spaces such as prisons or islands, or even ships at sea, is more about human touch and interaction rather than any sexual proclivities. Men like to \"get off\"...and at times, they're not particular about \"how\", where, or with whom. That's not homosexuality....that is frustration meets opportunity. Dumb dora. \n \n I'm in the 10th year of a monogamous relationship (my longest), and I deeply love my partner and he, me. And it's not about the sex act, as heterosexual marriages are hardly about the sex act.\n When it can be proven? Who are you that anything has to be proven to you?\n Bonding isn't something particular to only heteros. It's a human trait. You're dumber than dirt.\n\n \n \"Not only is it not fair to link polygamy, bestiality, child molestation, incest, or any other aborrent behavior to homosexuality, it isn't even relevant.\"\n \n :xbanghead They don't link together at all.", 
   {}, 
   434993, 
   null, 
   1311282420.0
  ], 
  [
   435040, 
   null, 
   "Freedom", 
   "Regarding your point about homosexuality in nature.\n Homosexual activity takes place in prisons by frustrated heterosexuals but gays on this forum differentiate between these people and ' real' homosexuals.\n I do not believe that two male penguins sitting on an egg makes them homosexuals nor do I accept two sexualy frustrated chimpanzees dry humping each other to be a parallel to human homosexuality.\n Also gays on this forum regularly point out that homosexuality is not just the sex act...they talk about love and desire for other men.\n When it can be proved that male animals have the exact equivalent of the bonding between the male and female then I will accept that there are gay animals.\n \n\n Well, if you look at it that way there are no relationships perfectly analogous to human heterosexual ones in nature either because no animal on earth has relationships on the exact level that humans do.\n \n I agree that two males taking care of young is hardly homosexuality, if simply working together was homosexuality the whole of humanity would be one giant marriage.\n \n I do still disagree that homosexuality does not exist in animals, I however understand now that you were pointing out the definition of homosexual used by others and not yourself.\n \n As far as I am concerned homosexuality and heterosexuality have sex in the word for a reason, it is defined by the act; and the attraction is permanently linked to the act and vice versa. That does not mean homosexual attractions must go with homosexual acts but that is obviously what the attractions would result in without other factors.\n \n So animals can be homosexual, they are also polygamous more than not, and have also been observed mating in between species and with siblings and parents.\n \n \n\"Not only is it not fair to link polygamy, bestiality, child molestation, incest, or any other aborrent behavior to homosexuality, it isn't even relevant.\"\n \n :xbanghead They don't link together at all.\n\n Why?\n \n http://www.4forums.com/political/gay-rights-debates/15318-princible-involved-sexual-morality.html", 
   {}, 
   435029, 
   null, 
   1311291240.0
  ], 
  [
   435067, 
   null, 
   "pappillion001", 
   "\"Not only is it not fair to link polygamy, bestiality, child molestation, incest, or any other aborrent behavior to homosexuality, it isn't even relevant.\"\n \n :xbanghead They don't link together at all.\n\n \n Oh they can link together but what you will notice is that there seems to always be one missing. That the standard used to link these to each other adds Heterosexual into the mix yet never is it stated. \n \n The standard becomes biased based on the perspective of the one judging. Homosexuals would view the rest as deviants because it is not normal for them. The same would be true for incest, polygamy, polyandry (that comes up even less) and bestiality.\n \n Its really an intelligent play on words which puts gay people immediately on the defensive by making them defend homosexuality linked to sexual taboos. I have watched several people get their arguments sucked into a position where by defending one they are defending all.\n \n They are all as distinctly different as they are the same. Circumstances for one are different and the reasons one would be acceptable do not necessarily hold true for the rest. The reasons against them also vary and are not necessarily interchangeable. \n \n Linking them together as an all or none is just something to make defending homosexuality far more difficult. Water is water until you are dying of thirst and someone brings you sea water, followed by steam, after ice. It is all water but it isn't the same", 
   {}, 
   435029, 
   null, 
   1311315300.0
  ], 
  [
   435069, 
   null, 
   "Freedom", 
   "Its really an intelligent play on words which puts gay people immediately on the defensive by making them defend homosexuality linked to sexual taboos. I have watched several people get their arguments sucked into a position where by defending one they are defending all.\n \n Linking them together as an all or none is just something to make defending homosexuality far more difficult. Water is water until you are dying of thirst and someone brings you sea water, followed by steam, after ice. It is all water but it isn't the same\n\n One must compare them and identify a standard of judgement before one can know if defending one is defending all.\n \n If you see people getting 'sucked' into a position where they are defending all maybe that is a result of the standard they espoused and not some trick.", 
   {}, 
   435067, 
   null, 
   1311316320.0
  ], 
  [
   435078, 
   null, 
   "gansao", 
   "Well, if you look at it that way there are no relationships perfectly analogous to human heterosexual ones in nature either because no animal on earth has relationships on the exact level that humans do.\n \n I agree that two males taking care of young is hardly homosexuality, if simply working together was homosexuality the whole of humanity would be one giant marriage.\n \n I do still disagree that homosexuality does not exist in animals, I however understand now that you were pointing out the definition of homosexual used by others and not yourself.\n \n As far as I am concerned homosexuality and heterosexuality have sex in the word for a reason, it is defined by the act; and the attraction is permanently linked to the act and vice versa. That does not mean homosexual attractions must go with homosexual acts but that is obviously what the attractions would result in without other factors.\n \n So animals can be homosexual, they are also polygamous more than not, and have also been observed mating in between species and with siblings and parents.\n \n \n Why?\n \n http://www.4forums.com/political/gay-rights-debates/15318-princible-involved-sexual-morality.html\n\n \n When gays define homosexuals as two males having gratuous sex with each other then I am prepared to accept that some animals can be gay but will insist that people can be 'temporarily' gay when confined with other males and sexually frustrated.\n Gays are hardly likely to accept this.\n I will never accept that the conduct of animals can be used to condone human behaviour or lifestyles.", 
   {}, 
   435040, 
   null, 
   1311342600.0
  ], 
  [
   435091, 
   null, 
   "Freedom", 
   "When gays define homosexuals as two males having gratuous sex with each other then I am prepared to accept that some animals can be gay but will insist that people can be 'temporarily' gay when confined with other males and sexually frustrated.\n\n I don't think frustration alone is the only trigger. I mean from an evolutionary standpoint it's not very detrimental to waste a little sperm; and it is probably hard to craft a foolproof attraction system. Animals of course don't have society pressuring them to declare themselves part of some group or party so they can get emotional support. They just do whatever they feel like at the time, if humans behaved like that I am sure intermittent homosexuality would be far more prevalent.\n \n \nGays are hardly likely to accept this.\n\n Well then I suppose they can't claim animals are homosexual.\n \n \nI will never accept that the conduct of animals can be used to condone human behaviour or lifestyles.\n\n You have my agreement there.", 
   {}, 
   435078, 
   null, 
   1311354480.0
  ], 
  [
   435126, 
   null, 
   "pappillion001", 
   "One must compare them and identify a standard of judgement before one can know if defending one is defending all.\n\n \n I don't know that there is a reasonable standard that can be used. I don't believe the answer is to be found in what is right with each or what is wrong with each separately. They share only a few general similarities, which by the same measurement would include heterosexuality, but are to general in nature to be worthwhile. The specific differences are what make each potentially acceptable or unacceptable and when those are used they no longer are similar.\n \n \n \nIf you see people getting 'sucked' into a position where they are defending all maybe that is a result of the standard they espoused and not some trick.\n\n \n They aren't adopting it because they agree with it. It is a natural defense to try and distance themselves from acts perceived as taboo. Whether intentional or not the immediate response is to try and disassociate one from the others.\n \n I don't know that it is a well thought out plan, as much as it comes across as a strong position to take when arguing against gay marriage. I hear it often used and I see responses that can't seem to get past those initial claims. Some just don't think it out, but some I think get flustered which is why they can't think it out. \n \n It's an observation I am not married to it.", 
   {}, 
   435069, 
   null, 
   1311410460.0
  ], 
  [
   435127, 
   null, 
   "Freedom", 
   "I don't know that there is a reasonable standard that can be used.\n\n A recurring theme in subjectivism.\n \n \nI don't believe the answer is to be found in what is right with each or what is wrong with each separately. \n\n lol, where would a subjectivist find such an answer?\n \n \nThey share only a few general similarities, which by the same measurement would include heterosexuality, but are to general in nature to be worthwhile.\n\n How different they are depends on the aspects you are looking at, that is why I said one must have a standard AND then one must compare them to know how the standard applies to each.\n \n \nThe specific differences are what make each potentially acceptable or unacceptable and when those are used they no longer are similar.\n\n Provided some are moral and others are not. The reason comparison is important is because if someone says one is moral but another is not they are obviously implying that some difference allows one to satisfy their standard of judgement while the other did not.\n \n It is a double standard of using some hidden standard in one stance but rejecting it in the next.\n \n If sexual orientations were truly unrelated, did not link together, and were irrelevant to each other; then that would be to admit one has no standard applying to sexual orientations, which would mean that all of this 'just like heterosexuality' business would be just as irrelevant. Deprived of your comparison to an accepted moral behavior (heterosexuality) you are back to square one, how do you judge this new one? That's right you need a standard again.\n \n There is simply no escaping it, either you don't make moral claims about a sexual orientation or you have a standard by which to judge the morality of a sexual behavior; and this is not the only case of this pattern.\n \n \nThey aren't adopting it because they agree with it. \n\n ??? They aren't adopting defending all because they agree with all?\n \n \nIt is a natural defense to try and distance themselves from acts perceived as taboo. Whether intentional or not the immediate response is to try and disassociate one from the others.\n\n I've noticed, and it's very annoying; especially when it comes from the so called open minded people. It tells me that they still have the fear and disgust that the so called oppressive 'normal people' do, just one less.\n \n \nI don't know that it is a well thought out plan, as much as it comes across as a strong position to take when arguing against gay marriage. I hear it often used and I see responses that can't seem to get past those initial claims.\n\n If it's used often by anti-homosexuals it's because they can sense a weak spot, it is a hole in one's position if refuse to apply your arguments consistently.\n \n The same is going on with evolution and creationist, Only the most crazy ones are going after geology; most attack irrational evolution because they sense the weakness.", 
   {}, 
   435126, 
   null, 
   1311414060.0
  ], 
  [
   435170, 
   null, 
   "jyoshu", 
   "Then call my mother and ask her Jyoshu. You certainly do not want to hear the validity of my side and I doubt that even if you sat down and spoke with my parents your mind would be swayed towards \"my side\" ............\n\n \n Jason, whatever problems you have had growing up, I am sorry to hear of such. No matter what one's stance is on the political issue of gay marriage, I (and anyone else I know of, frankly, religious or otherwise) would never wish such problems on you or anyone else that would lead to contemplating suicide. Where we disagree is that the only way to prevent it is such legal sanction for gay relationships that we would go so far as to single it out in law, and therefore create special-rights categories. It should not be expected of religious people to turn their back on their beliefs as if that were the only way to combat an issue of teenage suicide. One can hold to the view that teenage suicide is bad and can support people and tell them they love them yet at the same time not agree with their actions. My view has nothing to do with any personal 'fear'. It is simply what I think is best for society in general, and I cannot in good conscience support society giving sanction to what has demonstrated itself as harmful behavior, time and time again. \n \n You can do what you want of course, but I would caution you against putting a lot of personal info on an online discussion forum. Too many nutcases out there. Peace.", 
   {}, 
   434950, 
   null, 
   1311455220.0
  ], 
  [
   435280, 
   null, 
   "jyoshu", 
   "\"Apparently, Mr. Bachmann, who has a PhD in clinical psychology, operates several counseling centers which also offer services to homosexual clients seeking to overcome unwanted same-sex attractions. But because even one ex-gay proves that homosexual behavior is not innate or immutable, the gay lobby's fear of their former members results in false claims and attacks aimed at preventing homosexuals from exercising their right to self-determination. They cannot bear to have even one homosexual leave homosexuality, hence their outrage at Dr. Bachmann. \n I know because I am ex-gay myself. I suffer more harassment as a former homosexual than I ever did as an out and proud homosexual.\n The ex-gay community includes thousands of former homosexuals like myself who benefited from counseling. We did not choose our homosexual feelings, but we did exercise our right to seek help to change those feelings. As a registered nurse, I saw hundreds of gay men die of AIDS before I finally left the gay lifestyle. \n Contrary to the myths being generated by outraged homosexuals, counseling for unwanted same-sex attractions is not prohibited by any medical association. Unhappy homosexuals are not children in need of parental permission and can freely choose their own therapeutic treatment just like anyone else.\"\n\n \n More at PFOX-ExGays: Michelle Bachmann and Ex-Gays", 
   {
    "unicode_changes_made": true
   }, 
   435170, 
   null, 
   1311544140.0
  ], 
  [
   435281, 
   null, 
   "Matthew S", 
   "You all knew this was coming. They had an appointment with him too.\n \n &#x202a;Gay Barbarian Horde Glitters Bachmann Clinic&#x202c;&rlm; - YouTube", 
   {}, 
   435280, 
   null, 
   1311546480.0
  ], 
  [
   435284, 
   null, 
   "gansao", 
   "You all knew this was coming. They had an appointment with him too.\n \n &#x202a;Gay Barbarian Horde Glitters Bachmann Clinic&#x202c;&rlm; - YouTube\n\n \n Having these XXXXXX invade his clinic probably did him more good than harm.", 
   {}, 
   435281, 
   null, 
   1311549900.0
  ], 
  [
   435285, 
   null, 
   "jyoshu", 
   "Conservative Gay Leader To LGBT Glitterers: You're Not Helping | TPMDC", 
   {}, 
   435284, 
   null, 
   1311550380.0
  ], 
  [
   435324, 
   null, 
   "Matthew S", 
   "Having these XXXXXX invade his clinic probably did him more good than harm.\n\n \n Why?\n \n I think this is a brilliant theme. Call him out into the light. He is the one who called us barbarians and said we need to be disciplined.", 
   {}, 
   435284, 
   null, 
   1311588180.0
  ], 
  [
   435325, 
   null, 
   "Matthew S", 
   "Conservative Gay Leader To LGBT Glitterers: You're Not Helping | TPMDC\n\n \n \n That is one of the funniest things you have posted in a long time. You are actually taking Chris \"uncle Tom\" Barron seriously?\n \n This Uncle Tom supports Bachmann for president and supports the closet, where in his opinion all good gays should be.", 
   {}, 
   435285, 
   null, 
   1311588540.0
  ], 
  [
   435332, 
   null, 
   "gansao", 
   "Why?\n \n I think this is a brilliant theme. Call him out into the light. He is the one who called us barbarians and said we need to be disciplined.\n\n \n If you think that sending a bunch of XXXXXX to throw glitter around is a statement that will advance the homosexual 'cause' then your are pretty stupid.\n In fact you are part of the problem for gay people who want to be accepted into the larger community .", 
   {}, 
   435324, 
   null, 
   1311593340.0
  ], 
  [
   435333, 
   null, 
   "gansao", 
   "That is one of the funniest things you have posted in a long time. You are actually taking Chris \"uncle Tom\" Barron seriously?\n \n This Uncle Tom supports Bachmann for president and supports the closet, where in his opinion all good gays should be.\n\n \n Your bitterness is a liability.\n You need more of these people.\n If you want to be seen as the ' same' as heteros (except in the bedroom ..yawn).\n Then you need to be seen as such.\n Not a bunch of freaks playing dress up and being a pest.\n Barron is the type of person that will take gays into the community and negate the view that they are a fringe and unnatural group.", 
   {}, 
   435325, 
   null, 
   1311593640.0
  ], 
  [
   435380, 
   null, 
   "Matthew S", 
   "Your bitterness is a liability.\n You need more of these people.\n If you want to be seen as the ' same' as heteros (except in the bedroom ..yawn).\n Then you need to be seen as such.\n Not a bunch of freaks playing dress up and being a pest.\n Barron is the type of person that will take gays into the community and negate the view that they are a fringe and unnatural group.\n\n \n Chris barron is nothing but an uncle Tom who is willing to to say \"yes massa, whatever ya say massa\"", 
   {}, 
   435333, 
   null, 
   1311637320.0
  ], 
  [
   435381, 
   null, 
   "gansao", 
   "Chris barron is nothing but an uncle Tom who is willing to to say \"yes massa, whatever ya say massa\"\n\n \n I dont know exactly what you mean Matthew but you need more ordinary gay people( ordinary being not idiotic freaks that throw glitter around) to promote the gay cause.\n One gay couple comprising of a quantity surveyor and a air steward that are saving for a mortgage is worth a hundred of the jokers in that video.", 
   {}, 
   435380, 
   null, 
   1311638820.0
  ], 
  [
   435386, 
   null, 
   "Matthew S", 
   "I dont know exactly what you mean Matthew but you need more ordinary gay people( ordinary being not idiotic freaks that throw glitter around) to promote the gay cause.\n One gay couple comprising of a quantity surveyor and a air steward that are saving for a mortgage is worth a hundred of the jokers in that video.\n\n \n You honestly do not know what an uncle tom is?\n \n Uncle Tom - Wikipedia, the free encyclopedia\n \n \nor a black person who behaves in a subservient manner to white people\n\n \n In this case he is a gay man who behaves in a subservient manner to his conservative heterosexual masters. I should say he is an uncle Mary.\n \n But I agree with in in one respect we need more people to protest anti gay churches, businesses, and politicians. A good old fashioned civil rights uprising is what is needed. Where are the drag queens with the stonewall bricks. The last thing we need are more self hating kowtowing anti equality gays such as Chris Barron.", 
   {}, 
   435381, 
   null, 
   1311640620.0
  ], 
  [
   435388, 
   null, 
   "gansao", 
   "You honestly do not know what an uncle tom is?\n \n Uncle Tom - Wikipedia, the free encyclopedia\n \n \n \n In this case he is a gay man who behaves in a subservient manner to his conservative heterosexual masters. I should say he is an uncle Mary.\n \n But I agree with in in one respect we need more people to protest anti gay churches, businesses, and politicians. A good old fashioned civil rights uprising is what is needed. Where are the drag queens with the stonewall bricks. The last thing we need are more self hating kowtowing anti equality gays such as Chris Barron.\n\n \n You may have noticed that I avoided the question of whether Barron is what you describe as an ' uncle Tom'.\n \n What you need is LESS protesting drag queens and MORE conservative gay guys living like conservative hetero guys( except being gay of course) and asking why they are treated differently to conservative hetero guys.", 
   {}, 
   435386, 
   null, 
   1311642300.0
  ], 
  [
   435396, 
   null, 
   "Provocateaur", 
   "Not exactly--a counselor is there to 'counsel', hence the term--instead of \"listener\". If a counselor is asked what to do, he is naturally going to answer based on what he thinks is best. There are lots of ways a Christian counselor may counsel different than a secular one, on any number of issues. For instance, a priest may counsel someone that it would help them to go to confession. Most people realize that when they go to a Christian counselor, they will get a Christian perspective. They are going to know they will get a Christian take on things up front. If you don't want Christian counsel, then don't go to a Christian counselor. You are making muchado about nothing.\n\n \n Horse pucky. A therapist is indeed there to listen, and not to direct the outcome based on what he or she thinks is best. It's not about directing the therapy based on the psychiatrist's personal prejudices. Now, if this is the way certain Christians run their game, then by all means, your general idea that someone should go to a different therapist is a very good one.", 
   {}, 
   434626, 
   null, 
   1311646080.0
  ], 
  [
   435397, 
   null, 
   "Matthew S", 
   "You may have noticed that I avoided the question of whether Barron is what you describe as an ' uncle Tom'.\n\n \n You didn't avoid it you pleaded ignorance.\n \n\n What you need is LESS protesting drag queens and MORE conservative gay guys living like conservative hetero guys( except being gay of course) and asking why the f*ck they are treated differently to conservative hetero guys.\n\n \n No we need more angry drag queens with bricks. Chris Barron practices what is know as covering. It is the modern form of the closet. Covering is where it is OK to be gay as long as you don't talk about it. Chris Barron needs to stop supporting our oppressors. He is like a like a Jewish Nazi or a black KKK member. When will you open your eyes. Conservatives do not want gay people to exist period, and these are the same conservatives that Chris Barron is kissing the XXX of.", 
   {}, 
   435388, 
   null, 
   1311646440.0
  ], 
  [
   435424, 
   null, 
   "gansao", 
   "You didn't avoid it you pleaded ignorance.\n \n \n No we need more angry drag queens with bricks. Chris Barron practices what is know as covering. It is the modern form of the closet. Covering is where it is OK to be gay as long as you don't talk about it. Chris Barron needs to stop supporting our oppressors. He is like a like a Jewish Nazi or a black KKK member. When will you open your eyes. Conservatives do not want gay people to exist period, and these are the same conservatives that Chris Barron is kissing the XXX of.\n\n \n No I avoided it because it is a silly comparison.\n Even blacks using the expression uncle tom as a black traitor is stupid.\n \n Gays need drag queens with bricks like they need a hole in the head.\n The black middle class did more for black equality than the black panthers.\n When angry queens get that through their heads then they may start making progress towards a more gay friendly society.", 
   {}, 
   435397, 
   null, 
   1311678000.0
  ], 
  [
   435649, 
   null, 
   "poet", 
   "No I avoided it because it is a silly comparison.\n Even blacks using the expression uncle tom as a black traitor is stupid.\n \n Gays need drag queens with bricks like they need a hole in the head.\n The black middle class did more for black equality than the black panthers.\n When angry queens get that through their heads then they may start making progress towards a more gay friendly society.\n\n \n Why is black using the expression of \"Uncle Tom\" or 'race traitor\" stupid?\n I use it all the time, to describe black Republicans or conservatives. \n And the black middle class did more for themselves than any whites.\n It's a good thing you're way over there, where my brick can't reach you.", 
   {}, 
   435424, 
   null, 
   1311869100.0
  ], 
  [
   435650, 
   null, 
   "poet", 
   "You honestly do not know what an uncle tom is?\n \n Uncle Tom - Wikipedia, the free encyclopedia\n \n \n \n In this case he is a gay man who behaves in a subservient manner to his conservative heterosexual masters. I should say he is an uncle Mary.\n \n But I agree with in in one respect we need more people to protest anti gay churches, businesses, and politicians. A good old fashioned civil rights uprising is what is needed. Where are the drag queens with the stonewall bricks. The last thing we need are more self hating kowtowing anti equality gays such as Chris Barron.\n\n \n Bravo! ,,,,,,,,,,,,,", 
   {}, 
   435386, 
   null, 
   1311869160.0
  ], 
  [
   435656, 
   null, 
   "Freedom", 
   "Why is black using the expression of \"Uncle Tom\" or 'race traitor\" stupid?\n I use it all the time, to describe black Republicans or conservatives. \n And the black middle class did more for themselves than any whites.\n It's a good thing you're way over there, where my brick can't reach you.\n\n You answered your first question with the next two sentences.", 
   {}, 
   435649, 
   null, 
   1311873900.0
  ], 
  [
   435669, 
   null, 
   "gansao", 
   "Why is black using the expression of \"Uncle Tom\" or 'race traitor\" stupid?\n I use it all the time, to describe black Republicans or conservatives. \n And the black middle class did more for themselves than any whites.\n It's a good thing you're way over there, where my brick can't reach you.\n\n \n You say a lot of stupid things pothead.\n I think you typed a b for an p lol.\n One middle class black professional is worth an army of old limp wristed bigots sweetplums", 
   {}, 
   435649, 
   null, 
   1311887100.0
  ], 
  [
   435905, 
   null, 
   "jitobear", 
   "My sister in law has worked for years with the mentally ill in Minnesota. She has known about Marcus Bachmann for a loooooong time. He has been a headache for legitmate mental health professionals in MN for awhile. She has never liked the man and that was BEFORE this story broke or his wife became a Tea Party media darling (or she even knew who his wife was for that matter).\n \n The guy is a quack.", 
   {}, 
   435669, 
   null, 
   1312088880.0
  ], 
  [
   435922, 
   null, 
   "Easyrider", 
   "My sister in law has worked for years with the mentally ill in Minnesota. She has known about Marcus Bachmann for a loooooong time. He has been a headache for legitmate mental health professionals in MN for awhile. She has never liked the man and that was BEFORE this story broke or his wife became a Tea Party media darling (or she even knew who his wife was for that matter).\n \n The guy is a quack.\n\n \n The pro gay-sex liberals are the real quacks. They're the ones steeped in sin and folly and don't know right from wrong.", 
   {}, 
   435905, 
   null, 
   1312105320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bachmann's Husband Tries to \"Cure\" Gays", 
  "url": "http://www.4forums.com/political/gay-rights-debates/15482-bachmanns-husband-tries-cure-gays.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 15482, 
  "discussion_files": [
   [
    "33.html", 
    "http://www.4forums.com/political/gay-rights-debates/15482-bachmanns-husband-tries-cure-gays-print.html"
   ], 
   [
    "34.html", 
    "http://www.4forums.com/political/gay-rights-debates/15482-bachmanns-husband-tries-cure-gays-9-print.html"
   ], 
   [
    "35.html", 
    "http://www.4forums.com/political/gay-rights-debates/15482-bachmanns-husband-tries-cure-gays-7-print.html"
   ], 
   [
    "36.html", 
    "http://www.4forums.com/political/gay-rights-debates/15482-bachmanns-husband-tries-cure-gays-5-print.html"
   ], 
   [
    "37.html", 
    "http://www.4forums.com/political/gay-rights-debates/15482-bachmanns-husband-tries-cure-gays-4-print.html"
   ], 
   [
    "38.html", 
    "http://www.4forums.com/political/gay-rights-debates/15482-bachmanns-husband-tries-cure-gays-6-print.html"
   ], 
   [
    "39.html", 
    "http://www.4forums.com/political/gay-rights-debates/15482-bachmanns-husband-tries-cure-gays-8-print.html"
   ], 
   [
    "40.html", 
    "http://www.4forums.com/political/gay-rights-debates/15482-bachmanns-husband-tries-cure-gays-3-print.html"
   ], 
   [
    "41.html", 
    "http://www.4forums.com/political/gay-rights-debates/15482-bachmanns-husband-tries-cure-gays-2-print.html"
   ]
  ], 
  "identifier": 15482
 }
]