[
 [
  [
   435237, 
   null, 
   "Brady", 
   "Norway: Authorities now say at least 80 dead in mass shooting at youth camp.\n VPC Twitter\n \n And there are lot of guns in Norway. Boy that really didnt work out for them.", 
   {
    "post_info": {
     "post_title": "At least 80 dead in mass shooting at youth camp"
    }
   }, 
   null, 
   null, 
   1311512760.0
  ], 
  [
   435238, 
   null, 
   "Winston Smith", 
   "there are lots of guns, but, obviously not enough of them emoticon_rolleyes", 
   {}, 
   435237, 
   null, 
   1311514920.0
  ], 
  [
   435241, 
   null, 
   "Xenamnes", 
   "You appear to have no respect for the dead.\n \n In the territory of firearms-related deaths Norway is ranked quite low compared to other countries. Guns in Norway: Facts, Figures and Firearm Law In fact the numbers point out that Norway is ranked well below even Canada. Guns in Canada: Facts, Figures and Firearm Law In 2005 alive Norway had 5 firearm-related homicides, Canada had 223 in the same year.\n \n There is debate whether or not patrol officers are armed or not in Norway.\n \n If you are trying to suggest that guns are the reason for this massacre taking place then it would be best if you came out and said that in a specific and explicit manner.\n \n As to the high number of murders taking place it occurred because the suspect chose to attack an isolated island, occupied by youths and 90 minutes away from the nearest rescue. Approximately 85 people were shot and killed in that 90 minute wait before the police could arrive. Hardly a whirlwind of death and destruction at a breakneck pace.", 
   {}, 
   435238, 
   null, 
   1311519840.0
  ], 
  [
   435250, 
   null, 
   "Doc Jones", 
   "Norway: Authorities now say at least 80 dead in mass shooting at youth camp.\n VPC Twitter\n \n And there are lot of guns in Norway. Boy that really didnt work out for them.\n\n \n WTH? Did VPC and brady conspire to send Lon Houruchi on vacation again?\n \n After a bomb blast that leveled two city blocks and didn't kill anyone? What's wrong with this picture? Atf and justice dept. active in Norway too?", 
   {}, 
   435237, 
   null, 
   1311529740.0
  ], 
  [
   435251, 
   null, 
   "poet", 
   "You appear to have no respect for the dead.\n \n In the territory of firearms-related deaths Norway is ranked quite low compared to other countries. Guns in Norway: Facts, Figures and Firearm Law In fact the numbers point out that Norway is ranked well below even Canada. Guns in Canada: Facts, Figures and Firearm Law In 2005 alive Norway had 5 firearm-related homicides, Canada had 223 in the same year.\n \n There is debate whether or not patrol officers are armed or not in Norway.\n \n If you are trying to suggest that guns are the reason for this massacre taking place then it would be best if you came out and said that in a specific and explicit manner.\n \n As to the high number of murders taking place it occurred because the suspect chose to attack an isolated island, occupied by youths and 90 minutes away from the nearest rescue. Approximately 85 people were shot and killed in that 90 minute wait before the police could arrive. Hardly a whirlwind of death and destruction at a breakneck pace.\n\n \n Respect for the dead? Apparently, the teabagger gunman didn't have the respect for the dead.", 
   {}, 
   435241, 
   null, 
   1311529860.0
  ], 
  [
   435252, 
   null, 
   "Doc Jones", 
   "Meanwhile in other gory news, 90 or more people were killed in a plane crash in the Congo.\n \n 30 killed and over 200 seriously injured in a train wreck in China..\n \n How far do you want to dance scott?", 
   {}, 
   435250, 
   null, 
   1311529920.0
  ], 
  [
   435253, 
   null, 
   "simone", 
   "Norway does not have a reputation as a stupid, gun-toting nation, mad about guns. What are the rules on gun ownership in Norway?\n \n I've never heard of a Norwegian having a hysterical fit because he was afraid someone would take his guns away. That only happens in America, to my knowledge.\n \n I've seen so many American men, their eyes go utterly strange, they clutch at their crotch and they mutter about the \"guvment taking their precious guns away,\" as though the \"guvment\" was threatening to take away their manhood.", 
   {}, 
   435241, 
   null, 
   1311529980.0
  ], 
  [
   435259, 
   null, 
   "Doc Jones", 
   "Norway does not have a reputation as a stupid, gun-toting nation, mad about guns. What are the rules on gun ownership in Norway?\n \n I've never heard of a Norwegian having a hysterical fit because he was afraid someone would take his guns away. That only happens in America, to my knowledge.\n \n I've seen so many American men, their eyes go utterly strange, they clutch at their crotch and they mutter about the \"guvment taking their precious guns away,\" as though the \"guvment\" was threatening to take away their manhood.\n\n \n With a didapper like you around simone, what man wouldn't protect his crotch?", 
   {}, 
   435253, 
   null, 
   1311530220.0
  ], 
  [
   435269, 
   null, 
   "gansao", 
   "Norway does not have a reputation as a stupid, gun-toting nation, mad about guns. What are the rules on gun ownership in Norway?\n \n I've never heard of a Norwegian having a hysterical fit because he was afraid someone would take his guns away. That only happens in America, to my knowledge.\n \n I've seen so many American men, their eyes go utterly strange, they clutch at their crotch and they mutter about the \"guvment taking their precious guns away,\" as though the \"guvment\" was threatening to take away their manhood.\n\n \n Not your crotch then...?", 
   {}, 
   435253, 
   null, 
   1311531300.0
  ], 
  [
   435273, 
   null, 
   "Xenamnes", 
   "Norway does not have a reputation as a stupid, gun-toting nation, mad about guns. What are the rules on gun ownership in Norway?\n\n \n Compared to some other countries the rules on gun ownership in Norway would appear relatively relaxed. Gun politics in Norway: Information from Answers.com\n \n \nI've never heard of a Norwegian having a hysterical fit because he was afraid someone would take his guns away. That only happens in America, to my knowledge.\n\n \n Nobody else has much such an argument in this matter Simone, you're the only one to introduce such a concept. Perhaps you would care to show maturity for a change and actually substantiate this point with something of relevance. Perhaps you can show us where it was shown the actions of this individual were a direct result of the Norwegian government deciding to introduce some new piece of gun control legislation. His own manifesto certainly made no such mention.\n \n \nI've seen so many American men, their eyes go utterly strange, they clutch at their crotch and they mutter about the \"guvment taking their precious guns away,\" as though the \"guvment\" was threatening to take away their manhood.\n\n \n Hyperbole, emotional rhetoric and sexual innuendos.", 
   {}, 
   435253, 
   null, 
   1311532140.0
  ], 
  [
   435275, 
   null, 
   "E Mutz", 
   "Respect for the dead? Apparently, the teabagger gunman didn't have the respect for the dead.\n\n \n In what universe does that comment make sense.\n \n Norway has a tea party?\n \n Oh, I forgot, that OSLO tea party in which Norweigians dressed like Indians to protest the British....\n \n Yeeeeeaaaahhhhhhhh.............\n \n You might want to register that comment with the Bureau of the Stupid.", 
   {}, 
   435251, 
   null, 
   1311535980.0
  ], 
  [
   435290, 
   null, 
   "simone", 
   "There appear to be links between the Norwegian shooter and the American teaparty people. \n \nAnders Behring Breivik posted links to the Atlas Shrugs website of the Tea Party's Pamela Geller... under the name of Anders Behring (his middle name) posting links to Geller's \"Atlas Shrugs\" site. That cache page is bing translated from Norwegian. ...\n \n The links themselves appear to have been disabled.....\n\n Craig Murray Blog Archive Norwegian Killer Linked to Tea Party and EDL\n \n Looks like the culprits are trying to erase any links between Breivik and the baggers.", 
   {
    "unicode_changes_made": true
   }, 
   435275, 
   null, 
   1311553800.0
  ], 
  [
   435291, 
   null, 
   "gansao", 
   "There appear to be links between the Norwegian shooter and the American teaparty people. \n \n Craig Murray Blog Archive Norwegian Killer Linked to Tea Party and EDL\n \n Looks like the culprits are trying to erase any links between Breivik and the baggers.\n\n \n Does a nutcase posting to website make it linked to the nutcase?\n So this forum must be a man hating lefty website eh Simone?", 
   {}, 
   435290, 
   null, 
   1311554220.0
  ], 
  [
   435292, 
   null, 
   "Penfold", 
   "He met with EDL fellow nutters in London.", 
   {}, 
   435291, 
   null, 
   1311554760.0
  ], 
  [
   435294, 
   null, 
   "gansao", 
   "He met with EDL fellow nutters in London.\n\n \n We all know there are right wing nutters around and this geek seemed to seek them out but he admitted that he did what he did ON HIS OWN.\n Why cant you people get that through your heads?\n He wasnt encouraged by the teabaggers or any right wing group to kill people as far as we know and he did not belong to a church that preached mass murder.", 
   {}, 
   435292, 
   null, 
   1311555240.0
  ], 
  [
   435297, 
   null, 
   "E Mutz", 
   "There appear to be links between the Norwegian shooter and the American teaparty people. \n \n Craig Murray Blog Archive Norwegian Killer Linked to Tea Party and EDL\n \n Looks like the culprits are trying to erase any links between Breivik and the baggers.\n\n \n He also quoted liberally (get it) from the Unabomber manifesto. Norway suspect borrowed from Unabomber's manifesto - Yahoo! News\n \n So, the attacker is now linked with the University of Berkeley???\n \n If this keeps up I am sure we will find out it was all Kevin Bacon's fault...", 
   {}, 
   435290, 
   null, 
   1311558180.0
  ], 
  [
   435299, 
   null, 
   "Xenamnes", 
   "The Oklahoma City Bombing was an act committed with 5,400 pounds of ammonium nitrate rich fertilizer. This man purchased 12,000 pounds of fertilizer that we can assume was also rich with ammonium nitrate. The potential damage that could have resulted from the bombing would have greatly exceeded the damage done by the shooting, had such a bomb been deployed on the island instead.\n \n Regardless of the irrelevant and erroneous claims made by many here, the actions of this man are the fault of nobody except himself and himself alone. America, the Tea Party, conservatives and others played no part in this attack. Sarah Palin did not convince this man to shoot 85 people, Glenn Beck did not tell this man to set off a bomb. This was decision and his alone, he bears full blame. If you care to contest this then prove otherwise with facts and evidence.", 
   {}, 
   435294, 
   null, 
   1311561120.0
  ], 
  [
   435300, 
   null, 
   "Winston Smith", 
   "Guns and crazies are a bad mix, a deadly mix, and there lots of both in the USA hence the aperiodic but frequent deadly gun rampages in the USA.\n \n Now, put a crazy in charge of the armed forces and he'll give us the invasion of Iraq and hundred of thousands deaths and many more injured.\n \n Simone is right, fearful boys always need someone or something to allay their fears, and since they can't cling to their mothers aprons for ever they cling to their guns instead.\n \n the bigger the gun the bigger the fear emoticon_rolleyes", 
   {}, 
   435299, 
   null, 
   1311562200.0
  ], 
  [
   435301, 
   null, 
   "Xenamnes", 
   "Nothing you have said Winston is even remotely relevant to the topic of discussion, or accurate in general. Your continued mention of the USA are off base because this event happened in Norway, and Norway is not a part of the United States. And the shooting in Norway exceeded any school massacre that has taken place in the United States, even the Virginia Tech Massacre.\n \n There has been no indication that this man was motivated by fear, either of government or any other group. Just as there was no evidence that Jared Loughner was motivated by conservative extremism.\n \n Your continued off topic, derogatory and anti-USA statements are irrelevant to the discussion and contribute nothing. Kindly stay focused on the facts and not your own personal political extremist opinions.", 
   {}, 
   435300, 
   null, 
   1311562800.0
  ], 
  [
   435306, 
   null, 
   "Brady", 
   "OSLO, Norway (July 24, 2011)--Anders Breivik, 32, the man arrested in Friday's deadly attacks in Norway, wanted to start a revolution, his lawyer said.\n \n The attorney said Breivik confessed to the attacks in Oslo and at a youth camp that killed more than 90 people, but denies criminal responsibility.\n Click here to find out more!\n \n Breivik is believed to be the author of a manifesto that was published the day of the attacks, ranting against Muslim immigration and vowing revenge on \"indigenous Europeans\" for betraying their heritage.\n Man Arrested In Attacks In Norway Wanted To Start A Revolution\n \n So this was his second amendment solution and he opposed immigration just like teabaggers in the US do. American right wing lunacy has infected Europe.", 
   {}, 
   435301, 
   null, 
   1311565860.0
  ], 
  [
   435311, 
   null, 
   "Xenamnes", 
   "So this was his second amendment solution and he opposed immigration just like teabaggers in the US do. American right wing lunacy has infected Europe.\n\n \n Norway is without a Second Amendment. Personal defense is not considered a legitimate reason for owning a firearm, only sports and hunting qualify; the same as in Britain.\n \n Opposing immigration is not some \"teabagger\" trait as you claim in your derogatory statements. The politics of America are not responsible for the problems of other countries regardless of what irrelevant claims to the contrary you may make.", 
   {}, 
   435306, 
   null, 
   1311568020.0
  ], 
  [
   435312, 
   null, 
   "Brady", 
   "Anders Behring Breivik, charged in connection with Friday's horrific bombing and shootings in Norway, left clues to his motivation at an anti-Muslim website called Document.no. In the entries below-culled and translated by the British magazine Searchlight-Breivik is fixated on what he believes is the creeping evil of Islam in Europe. He argues for setting up a system of social networking \"such that is linked to similar organizations in other countries (similar to a beginning of a cultural Euro-version of a Tea Party movement).\"\n Mother Jones: Read Anders Behring Breivik's Internet Comments Here\n \n So he posted online that he wanted to start a tea party in Europe!", 
   {
    "unicode_changes_made": true
   }, 
   435306, 
   null, 
   1311568080.0
  ], 
  [
   435316, 
   null, 
   "Xenamnes", 
   "Anders Behring Breivik, charged in connection with Friday's horrific bombing and shootings in Norway, left clues to his motivation at an anti-Muslim website called Document.no. In the entries below-culled and translated by the British magazine Searchlight-Breivik is fixated on what he believes is the creeping evil of Islam in Europe. He argues for setting up a system of social networking \"such that is linked to similar organizations in other countries (similar to a beginning of a cultural Euro-version of a Tea Party movement).\"\n Mother Jones: Read Anders Behring Breivik's Internet Comments Here\n \n So he posted online that he wanted to start a tea party in Europe!\n\n \n I fail to see any relevancy in your post Brady. \n \n If you have something to say it would be best if you came out and said it directly rather than tiptoeing around in a secretive manner open to the interpretation of the other readers. If you wish to lay blame at America and the Tea Party movement then say it and get it over with.", 
   {
    "unicode_changes_made": true
   }, 
   435312, 
   null, 
   1311568380.0
  ], 
  [
   435321, 
   null, 
   "Winston Smith", 
   "He was a Christian fundamentalist who joined the equivalent of the tea party in Norway the so called Progress Party. He targeted members of the Labour party because they were according to him 'soft' on Muslims. He wanted to exterminate the next generation of Labour Party leaders (kind of Democratic Party).\n \n He is the Norwegian equivalent of Timothy McVeigh. All right wingers or conservatives (same thing) are intrinsically violent people.\n \n Typical Christian arch conservative. Religion and gun crazies are a deadly combination. Maybe he saw that Paulin website where she put 'targets' on the face of Democratic Pary politicians.\n \n http://www.dailymail.co.uk/news/article-1345682/Sarah-Palin-hits-critics-blame-vitriolic-rhetoric-Arizona-shooting.html\n \n \n \n .", 
   {
    "post_info": {
     "post_title": "modest Christian boy who became a mass murderer."
    }
   }, 
   435316, 
   null, 
   1311581400.0
  ], 
  [
   435331, 
   null, 
   "gansao", 
   "He was a Christian fundamentalist who joined the equivalent of the tea party in Norway the so called Progress Party. He targeted members of the Labour party because they were according to him 'soft' on Muslims. He wanted to exterminate the next generation of Labour Party leaders (kind of Democratic Party).\n \n He is the Norwegian equivalent of Timothy McVeigh. All right wingers or conservatives (same thing) are intrinsically violent people.\n \n Typical Christian arch conservative. Religion and gun crazies are a deadly combination. Maybe he saw that Paulin website where she put 'targets' on the face of Democratic Pary politicians.\n \n Sarah Palin hits back as critics blame 'vitriolic rhetoric' for Arizona shooting | Mail Online.\n\n What a crock of XXXX.\n What church?\n What Norwegian tea party?", 
   {}, 
   435321, 
   null, 
   1311593100.0
  ], 
  [
   435334, 
   null, 
   "Doc Jones", 
   "He was a Christian fundamentalist who joined the equivalent of the tea party in Norway the so called Progress Party. He targeted members of the Labour party because they were according to him 'soft' on Muslims. He wanted to exterminate the next generation of Labour Party leaders (kind of Democratic Party).\n\n \n So, all those children were members of the \"Labour Party\" and were \"soft on Muslims\" and in your mind were the equivilent to the demoncrats?\n \n \nHe is the Norwegian equivalent of Timothy McVeigh. All right wingers or conservatives (same thing) are intrinsically violent people.\n\n \n Present facts and legitimate sources to back your claim or admit your LIES!\n \n \nTypical Christian arch conservative. Religion and gun crazies are a deadly combination. Maybe he saw that Paulin website where she put 'targets' on the face of Democratic Pary politicians.\n\n \n So,, you were with him or just think like him and are qualified to make value judgements? or, you just spreading more propaganda thick and deep hoping some nut like him will create another incident so you can slander anyone or party you don't like?\n \n \n Sarah Palin hits back as critics blame 'vitriolic rhetoric' for Arizona shooting | Mail Online\n \n \n \n .\n\n \n You are a pitiful excuse for humanity raulito. I still contend that the Arizona nut was a hit job to get rid of Judge Roll who ruled against this administration, had his two U.S. Marshall protection removed and was killed at the scene. Why no one mentions this travesty? Too obvious? Sure Laughner killed other people, same price as only one ain't it raulito? These guys are like Manchurian candidates, programmed and spring from the woodwork just in time for political purposes or distract from current events, always political.", 
   {}, 
   435321, 
   null, 
   1311593940.0
  ], 
  [
   435336, 
   null, 
   "Winston Smith", 
   "where did Breivik get the guns and ammo ? emoticon_xkill\n \n maybe a mail order from the USA ?", 
   {
    "post_info": {
     "post_title": "Question"
    }
   }, 
   435334, 
   null, 
   1311594720.0
  ], 
  [
   435337, 
   null, 
   "Winston Smith", 
   "With a didapper like you around simone, what man wouldn't protect his crotch?\n\n \n I bet you have very little to protect emoticon_xgood", 
   {}, 
   435259, 
   null, 
   1311594840.0
  ], 
  [
   435338, 
   null, 
   "Doc Jones", 
   "where did Breivik get the guns and ammo ? emoticon_xkill\n \n maybe a mail order from the USA ?\n\n \n How about answering the questions I challenged you with if you are able and made counter statements you need to prove.\n \n If you don't know the laws of the country or our country you should find out. I am not going to help you one tiny bit, you dug your own hole.\n \n My job is to make you look as horrible and uninformed as you are. Thanks for the additional proof :)", 
   {}, 
   435336, 
   null, 
   1311595020.0
  ], 
  [
   435339, 
   null, 
   "Doc Jones", 
   "I bet you have very little to protect emoticon_xgood\n\n \n AC/DC raulito? Been in the basement too long?", 
   {}, 
   435337, 
   null, 
   1311595140.0
  ], 
  [
   435343, 
   null, 
   "Winston Smith", 
   "OSLO, Norway (July 24, 2011)--Anders Breivik, 32, the man arrested in Friday's deadly attacks in Norway, wanted to start a revolution, his lawyer said.\n \n The attorney said Breivik confessed to the attacks in Oslo and at a youth camp that killed more than 90 people, but denies criminal responsibility.\n Click here to find out more!\n \n Breivik is believed to be the author of a manifesto that was published the day of the attacks, ranting against Muslim immigration and vowing revenge on \"indigenous Europeans\" for betraying their heritage.\n Man Arrested In Attacks In Norway Wanted To Start A Revolution\n \n So this was his second amendment solution and he opposed immigration just like teabaggers in the US do. American right wing lunacy has infected Europe.\n\n \n It would have been better if this crazy guy had moved to the USA and joined the tea party. There are millions like him in the USA, just swap the Muslims for Mexicans and bingo! he would have felt at home in Arizona ... maybe not. :p", 
   {}, 
   435306, 
   null, 
   1311604080.0
  ], 
  [
   435344, 
   null, 
   "Xenamnes", 
   "He was a Christian fundamentalist who joined the equivalent of the tea party in Norway the so called Progress Party. He targeted members of the Labour party because they were according to him 'soft' on Muslims. He wanted to exterminate the next generation of Labour Party leaders (kind of Democratic Party).\n\n \n This is your opinion. However these are not facts and should not be treated as such.\n \n \nHe is the Norwegian equivalent of Timothy McVeigh. All right wingers or conservatives (same thing) are intrinsically violent people.\n\n \n \"All right wingers or conservatives are intrinsically violent people\" you say? No exceptions? It's impossible for a conservative to not be violent in nature?\n \n \nTypical Christian arch conservative. Religion and gun crazies are a deadly combination. Maybe he saw that Paulin website where she put 'targets' on the face of Democratic Pary politicians.\n\n \n Paulin? Do you mean Palin? The website of Sarah Palin did not put targets on the face of democratic politicians. If you are going to introduce some talking point at least try and be accurate with it.", 
   {}, 
   435321, 
   null, 
   1311604500.0
  ], 
  [
   435346, 
   null, 
   "Tither", 
   "The Tea Party did it, no Bush Did It. emoticon_smile Just some of what is becoming, some on the Left&#8217;s typical HATE Speech. That&#8217;s all it is.\n \n But No Wait! The 2nd Amendment in the U.S. caused this guy to Build an Extremely Effective BOMB. Did you see the damage that caused? No, scratch that, that won&#8217;t work either! emoticon_smile\n \n If we could dis-invent all firearms had he would have JUST BUILT MORE Brutally Effective BOMBS! \n \n Lots and Lots of Bombs! What might that have looked like in that camp? \n \n People have a choice. Either they can work on \"real\" and effective solutions, or they can use these tragedies for their political HATE Speech, and HATE for one of our Constitution&#8217;s Bill of Rights. \n \n The guy needed counseling help. A novel solution, I know, but the HATERS of the Left are now saying. Hey that&#8217;s a great idea! Lets do that just as soon as we kill the Constitution's Bill of Rights that We Don&#8217;t Like! emoticon_smile \n \n But until then, like the deaths of our agents and of the plethora of deaths of Mexicans in the Gun Walker scam, they are nothing but necessary and useful cannon fodder to Kill the 2nd Amendment. Huh BRADY? \n \n If anyone is asking me, but sorrily no one is, I chose the avenue of getting this guy some help before he goes off. That could have been done respectfully of him and his rights. But no. That didn't happen. Why? Didn't anyone know of his problems?\n \n Now some are asking themselves, Hey can't we use THIS as an excuse to Kill just as many people as possible 2nd Amendment rights? \n \n Just imagine it. Everyone is nuts therefore no one has any rights! emoticon_smile Huh Brady?", 
   {}, 
   435339, 
   null, 
   1311605100.0
  ], 
  [
   435349, 
   null, 
   "zsu2357", 
   "How about answering the questions I challenged you with if you are able and made counter statements you need to prove.\n \n If you don't know the laws of the country or our country you should find out. I am not going to help you one tiny bit, you dug your own hole.\n \n My job is to make you look as horrible and uninformed as you are. Thanks for the additional proof :)\n\n \n Heck Doc what job is that?little job?.And he is very informed because Comrade P see's to it.emoticon_xgood", 
   {}, 
   435338, 
   null, 
   1311609660.0
  ], 
  [
   435356, 
   null, 
   "Xenamnes", 
   "It would seem heavy revisions are already coming forward. Instead of 80 to 85 people being shot dead at the youth camp the new figures show it was 68.\n \n Norway terror suspect claims to have worked with 2 other cells - CNN.com\n \n If the death toll itself is being revised and downgraded from the original claim, one must wonder what else will be revised and downgraded as the investigation continues.", 
   {}, 
   435349, 
   null, 
   1311615660.0
  ], 
  [
   435359, 
   null, 
   "Tither", 
   "It would seem heavy revisions are already coming forward. Instead of 80 to 85 people being shot dead at the youth camp the new figures show it was 68.\n\n I Thank God that it is lower!", 
   {}, 
   435356, 
   null, 
   1311619320.0
  ], 
  [
   435371, 
   null, 
   "Doc Jones", 
   "Well looka here, a picture of the remaining members of the brady bunch, (1),scott brady holding a sign ignoring the fact that if one other gun would have been present the gun grabber CRIMINAL enablers wouldn't have a policeman in uniform shooting kids on an island.\n \n Even police seldom carry guns in Norway and that enables terrorists and bomb makers and users too. The longest sentence this guy can get is 21 years so the cost to him is the same. When you gonna turn yours in scottie?\n \n Never miss a chance to dance in the blood scottie.\n \n Meanwhile in the real world, http://www.wnd.com/index.php?fa=PAGE.view&pageId=325897 Feds won't say how criminals bought guns.\n \n http://www.wnd.com/index.php?fa=PAGE.view&pageId=326021\n ATF didn't notify the Mexican embassy either.\n \n Just more shirts with a badge busily breaking the law and enabling criminals.", 
   {}, 
   435359, 
   null, 
   1311632040.0
  ], 
  [
   435384, 
   null, 
   "Brady", 
   "The high-capacity Glock pistol owned by Norway mass murderer Anders Behring Breivik stands as a stark example of the gun industry's marketing of increased lethality. Since the mid-1980s, increased firepower and capacity have defined the products of the gun industry-of both U.S. and foreign manufacture.\n \n Glock pistols have been part of the arsenals of the some of the most infamous mass shooters in the United States, including the 2007 Virginia Tech shooting which left 33 dead and 17 wounded and, more recently, the attack in January 2011 in Tucson, AZ, by Jared Loughner which left six dead and 13 wounded-including U.S. Representative Gabrielle Giffords (D-TX). Oklahoma City bomber Timothy McVeigh was illegally carrying a 45 caliber Glock pistol when he was stopped by law enforcement after the 1995 bombing for driving a car without a license plate. For examples of mass shootings in the United States that involved Glock pistols, please see the chart below.\n \n The dominance of the semiautomatic pistol greatly increased the firepower in civilian hands. Not only are semiautomatic pistols capable of rapid fire, they utilize high-capacity magazines and can be quickly reloaded. The combination of these features makes semiautomatic pistols efficient killing machines.\n http://www.vpc.org/fact_sht/GlockBackgrounderJuly2011.pdf", 
   {
    "post_info": {
     "post_title": "Glocks are efficient killing machines"
    }, 
    "unicode_changes_made": true
   }, 
   435371, 
   null, 
   1311639420.0
  ], 
  [
   435385, 
   null, 
   "Brady", 
   "Whereas a mass shooting in Norway is an extraordinary event, it is a regular occurrence in America. Whereas 84 shooting deaths in a single day is a historic event in Norway, described by the nation's prime minister as a 'national disaster,' 84 dead is essentially the everyday toll of fatal gun violence in America. \n Brady Campaign to Prevent Gun Violence : Media", 
   {}, 
   435384, 
   null, 
   1311639780.0
  ], 
  [
   435389, 
   null, 
   "Tither", 
   "So now we are posting predominantly from Anti-gun, Anti-Bill of Rights sites? Don't you think they MIGHT be a little biased? emoticon_rolleyes\n \n Only one problem. Gun control is NOT Crime Control.\n \n In 2000 to 2002 The CDC conducted a systematic review of scientific evidence regarding the effectiveness of firearms laws in preventing violence, including violent crimes, suicide, and unintentional injury. The systematic review development team identified 51 studies that evaluated the effects of selected firearms laws on violence and met the inclusion criteria for this review. No study was excluded because of limitations in design or execution.\n \n  What did they find?  \n &#8220;the task Force found insufficient evidence to determine the effectiveness of any of the firearms laws or combinations of laws reviewed on violent outcomes.&#8221; \n\n The CDC did suggest more studies. Then a few years later the CDC got a second bite at the apple with The National Academy of Sciences studies. They, along with the Anti-gun Joyce foundation funded, the study. National-Academies.org | Newsroom\n \n Here is an article about the study Link  who issued a 328-page report based on 253 journal articles, 99 books, 43 government publications, a survey of 80 different gun-control laws and some of its own independent study. \nIn short, the panel could find no link between restrictions on gun ownership and lower rates of crime, firearms violence or even accidents with guns. \n\n \n Gun Control is NOT Crime Control! And even the Anti-gun CDC nor the predominantly anti-gun National Academy of Sciences can prove that is it. Our Constitution deserve proof that things will work before one starts stripping away one's Constitutional Rights. \n \n I am sure all but the Antis would agree.", 
   {}, 
   435385, 
   null, 
   1311642720.0
  ], 
  [
   435391, 
   null, 
   "Xenamnes", 
   "The high-capacity Glock pistol owned by Norway mass murderer Anders Behring Breivik stands as a stark example of the gun industry&#8217;s marketing of increased lethality. Since the mid-1980s, increased firepower and capacity have defined the products of the gun industry&#8212;of both U.S. and foreign manufacture.\n\n \n I have yet to see any news releases that indicate exactly what firearms were used in the Norway shooting. Perhaps you could enlighten us with some easy to cite examples from other locations beyond the Violence Policy Center.\n \n \nGlock pistols have been part of the arsenals of the some of the most infamous mass shooters in the United States, including the 2007 Virginia Tech shooting which left 33 dead and 17 wounded and, more recently, the attack in January 2011 in Tucson, AZ, by Jared Loughner which left six dead and 13 wounded&#8212;including U.S. Representative Gabrielle Giffords (D-TX). Oklahoma City bomber Timothy McVeigh was illegally carrying a 45 caliber Glock pistol when he was stopped by law enforcement after the 1995 bombing for driving a car without a license plate. For examples of mass shootings in the United States that involved Glock pistols, please see the chart below.\n\n \n For the sake of facts, the Glock series of firearms are standard issue for many police departments, making them the primary tool for law enforcement and keeping the peace since 1982. One would be hard pressed to find a law enforcement agency that doesn't use the Glock as their standard issue firearm. Simply because murderers choose to use them is irrelevant. The tool is not to blame for the action.\n \n \nThe dominance of the semiautomatic pistol greatly increased the firepower in civilian hands. Not only are semiautomatic pistols capable of rapid fire, they utilize high-capacity magazines and can be quickly reloaded. The combination of these features makes semiautomatic pistols efficient killing machines.\n http://www.vpc.org/fact_sht/GlockBackgrounderJuly2011.pdf\n\n \n You are approximately 76 years too late in making your claim Brady. The first semi-automatic pistol equipped with what you claim to be is a high-capacity magazine, was first sold in 1935. It was known as the Browning Hi-Power and came with a magazine capable of holding the unheard of amount of 13 rounds of ammunition, nearly double the amount of its competitors. It also possessed a greater muzzle velocity than most of its competitors at the time, making it more likely to penetrate the primitive body armor available in that era.\n \n This effectively makes the semi-automatic pistol and the high-capacity magazine older than the gun control movement itself. The current hype and scare about their use by criminals is far too late to be accurate or relevant.\n \n \nWhereas a mass shooting in Norway is an extraordinary event, it is a regular occurrence in America. Whereas 84 shooting deaths in a single day is a historic event in Norway, described by the nation's prime minister as a 'national disaster,' 84 dead is essentially the everyday toll of fatal gun violence in America. \n Brady Campaign to Prevent Gun Violence : Media\n\n \n I see you are continuing to quote outdated information. The Norwegian authorities have lowered the shooting portion of the death toll to 68 rather than 84.\n \n 84 is also not the correct number for the daily firearm-related murders that take place in the United States. Such a rate would put the yearly homicide rate at 30,660. Upon last check the reported annual firearm-related homicide rate for the United States was between 10,000 and least and 15,000 at most.", 
   {}, 
   435384, 
   null, 
   1311643860.0
  ], 
  [
   435394, 
   null, 
   "Tither", 
   "15,000 at most.\n\n \n   A little over 15,000 is correct for 2009,  and not all firearm either. Criminals on criminals mostly. \n \n Gun Violence and Constitutional Issues \n The FBI statistics reveal that 75 percent of all violent crimes for any locality are committed by six percent of hardened criminals and repeat offenders.18 Violent crimes continue to be a problem in the inner cities with gangs involved in the drug trade.\n\n \n Brady's figures are like the rest of his info. A Lie, and exaggeration, or figures put together is ways the reader would not normally understand, as presented, which makes it a deception.", 
   {}, 
   435391, 
   null, 
   1311645000.0
  ], 
  [
   435402, 
   null, 
   "sinjin", 
   "I have yet to see any news releases that indicate exactly what firearms were used in the Norway shooting. Perhaps you could enlighten us with some easy to cite examples from other locations beyond the Violence Policy Center.\n\n \n \"He was the registered holder of two weapons - a Glock pistol and an automatic rifle, both of which are thought to have been used in the massacre.\"\n Oslo mass murderer Anders Behring Breivik posts YouTube video, terrorises teen in Norway shooting | thetelegraph.com.au\n \n \"Breivik is a member of the Oslo Pistol Club and has three weapons registered in his name, according to leading Norwegian newspaper VG, citing Norway's official weapons register. \n They are a Glock pistol, a rifle and a shotgun, VG reported.\"\n http://articles.cnn.com/2011-07-23/world/norway.suspect_1_youth-camp-norway-nrk?_s=PM:WORLD", 
   {}, 
   435391, 
   null, 
   1311649860.0
  ], 
  [
   435404, 
   null, 
   "Xenamnes", 
   "Rather an interesting read. But it serves to raise more questions than it answers. If Breivik's rant was primarily against the muslim community why were his victims of non-muslim nature?\n \n A better question would concern Breivik's choice in arming himself. Why did he not deploy any bombs at the youth community on the island where they could do more damage than against a building? Why did he choose to go through the paperwork process for acquiring an inferior weapon when he previously owned a Ruger Mini-14 carbine and enough magazines to hold 300 rounds of ammunition?\n \n Further searches about the weapons used in the Norway Massacre talk about Breivik acquiring a Ruger Mini-14 rifle for deer hunting, and later purchasing 10 magazines capable of holding 30 rounds each. Certainly sufficient for such a massacre, a far superior weapons platform than the Glock series pistol he chose to acquire later on.\n \n The legitimacy of the integrity of the first article also needs to be called into question. It goes on to talk about the use of bullets designed to disintegrate inside the body and cause maximum internal damage. Exactly what ammunition is this that is capable of such a feat? And why does the article continue to repeat the 85 figure when Norwegian authorities lowered the number to 68?", 
   {}, 
   435402, 
   null, 
   1311651480.0
  ], 
  [
   435407, 
   null, 
   "sinjin", 
   "You're welcome.", 
   {}, 
   435404, 
   null, 
   1311653280.0
  ], 
  [
   435410, 
   null, 
   "Zorba", 
   "Norway: Authorities now say at least 80 dead in mass shooting at youth camp.\n VPC Twitter\n \n And there are lot of guns in Norway. Boy that really didnt work out for them.\n\n \n Really? Then shouldn't the police be armed also? \n Norway\n The Norwegian national police force (Norwegian: Politiet) is subordinate to the Ministry of Justice and Police. The Politiet is divided into 27 regional police departments and seven nation-wide special departments. In total the force has about 11.000 employees, with the Oslo police precinct, as the largest, accounting for 2300.\n Officers of Politiet usually do not carry firearms, making the force one of the few unarmed police organizations in the world. They are instead armed with telescopic batons and pepper spray.\n Law enforcement by country - Wikipedia, the free encyclopedia", 
   {}, 
   435237, 
   null, 
   1311657780.0
  ], 
  [
   435415, 
   null, 
   "Galileo", 
   "Dennis Henigan must be including suicides when he talks about the number of lives lost due to gun violence each day. I wonder how nice prisons are in Norway. It sounds like the shooter was expecting to spend a few decades in prison. Should Norway make its guns laws stricter? That is a decision for Norway to make. I think that places with higher crime rates need more gun control. In places with higher crime rates, there are more people that are likely to misuse guns. This massacre may lead to stricter gun laws in other European nations also:\n \n \"Finland's gun laws are to be reviewed in the wake of Friday's massacre in Norway. An Interior Ministry steering group will meet early in the week to look at pending firearms legislation....\"\n m.yle.fi News: Gun laws to be reviewed", 
   {}, 
   435410, 
   null, 
   1311664620.0
  ], 
  [
   435435, 
   null, 
   "Xenamnes", 
   "Stricter gun control laws are of no use when those in charge will fail to enforce them against those who break them.\n \n Other countries choosing to review their gun control laws and potentially change them is nothing more than a knee-jerk reaction to being caught off guard. Since the Norway Massacre included a bombing perhaps they would be better served with reviewing the laws concerning the sale of ammonium nitrate rich fertilizer.\n \n 68 people were murdered because a youth group on a remote island was chosen as the scene of a massacre. This was quite literally a matter of shooting fish in a barrel. Who could have possibly fought back in such a situation? What alternatives were there available? And why were the police 90 minutes away?", 
   {}, 
   435415, 
   null, 
   1311689640.0
  ], 
  [
   435440, 
   null, 
   "Tither", 
   "As always, these kind of events cause the Rabid Anti gun people to come pouring out of the woodwork saying this in my fault and demanding more, and more, and ever more of the 2nd Amendment. Kind of like they did and are doing with the viscous Mexican Drug Lords carnage in Mexico.\n \n \n\"He was the registered holder of two weapons - a Glock pistol and an automatic rifle, both of which are thought to have been used in the massacre.\"\n\n Automatic Rifle. The Ruger Mini 14 is a semi-auto. It is not a machine gun. \n \n As interesting as that is, however, no one ever tells us what kind of explosive devise he used, or the legal manufacturers who made it. Where can people buy those? \n \n If he had no access to firearms, could he have built more of them? What might that have looked like in that camp? \n \n All over the Middle East, and just about every week, we here of the carnage caused by explosive devices going off. Maybe you guys can push for some kind of bomb control! \n \n Oooor is that JUST Crazy Talk because it gets no guns banned. Like those who are going after the Glocks or the Semi Autos.", 
   {}, 
   435402, 
   null, 
   1311691440.0
  ], 
  [
   435441, 
   null, 
   "Doc Jones", 
   "Dennis Henigan must be including suicides when he talks about the number of lives lost due to gun violence each day.\n\n \n That technique should be easy for you to identify since you repeatedly do the same thing to \"muddy the waters\" and \"build strawmen\" by lying about simple facts to sensationalize them. Tither has repeatedly shown the error of your ways by posting the CDC and NAS studies which admit that GUN LAWS are innefective as crime fighting tools. \n \n \nI wonder how nice prisons are in Norway. It sounds like the shooter was expecting to spend a few decades in prison.\n\n \n iF YOU ARE REALLY CURIOUS....\n \n The most he can get in prison is 21 years I have read. You got different info?\n \n \nShould Norway make its guns laws stricter? That is a decision for Norway to make.\n\n \n If you really believe that, why do you continue on and attempt to make their decision for them? You putting the cart ahead of the horse...again.\n \n \nI think that places with higher crime rates need more gun control. In places with higher crime rates, there are more people that are likely to misuse guns. \n\n \n Why would you believe that after the CDC and NAS determination and why are you determined to interfere in their business? There is apt evidence that gun free zones are criminal protection zones and most crime occurs in exactly the same place as it did in Norway...where the perp has the only guns.\n \n It was pure genius, although misguided, that led to your determination that gun cause crime. We have been over this repeatedly and proven you cannot prove your assertion. Wanna try again?\n \n \nThis massacre may lead to stricter gun laws in other European nations also:\n\n \n LIMBO, how low can you go? Virtual bans in most European countries make mincemeat of your 'theory'.\n \n \n\"Finland's gun laws are to be reviewed in the wake of Friday's massacre in Norway. An Interior Ministry steering group will meet early in the week to look at pending firearms legislation....\"\n m.yle.fi News: Gun laws to be reviewed\n\n \n The problem was evident, including the \"first responders\". That problem was the LACK OF GUNS in the hands of both the citizenry and the police who took over an hour and a half to gather their guns and equipment and get to get to the scene and the first boat to attempt it was overloaded and didn't even make it and had to be rescued while taking on water that further delayed intervention.\n \n MORE GUNS EQUAL LESS CRIME emoticon_xagree", 
   {}, 
   435415, 
   null, 
   1311692040.0
  ], 
  [
   435442, 
   null, 
   "Doc Jones", 
   "Dennis Henigan must be including suicides when he talks about the number of lives lost due to gun violence each day. I wonder how nice prisons are in Norway. It sounds like the shooter was expecting to spend a few decades in prison. Should Norway make its guns laws stricter? That is a decision for Norway to make. I think that places with higher crime rates need more gun control. In places with higher crime rates, there are more people that are likely to misuse guns. This massacre may lead to stricter gun laws in other European nations also:\n \n \"Finland's gun laws are to be reviewed in the wake of Friday's massacre in Norway. An Interior Ministry steering group will meet early in the week to look at pending firearms legislation....\"\n m.yle.fi News: Gun laws to be reviewed\n\n \n The most ghoulishly thing wrong with your rambling manifesto is that as Xanamenes has already shown is that Norway is NOT a high crime area. Historically they have very low crime rates and rather strict gun laws.", 
   {}, 
   435415, 
   null, 
   1311692520.0
  ], 
  [
   435444, 
   null, 
   "Galileo", 
   "The most ghoulishly thing wrong with [U]your rambling manifesto is that as Xanamenes has already shown is that Norway is NOT a high crime area. Historically they have very low crime rates and rather strict gun laws.\n\n Good to see you associating strict gun control with low crime.", 
   {}, 
   435442, 
   null, 
   1311693900.0
  ], 
  [
   435446, 
   null, 
   "Doc Jones", 
   "Good to see you associating strict gun control with low crime.\n\n \n I repeat, you have never proven that assertion! Your job, should you accept it, is to prove that guns = crime.\n \n CDC, NAS or the Royal Science Institute were unable to show any correlation and you have yet to prove your statement and correlation. \n \n In fact, the evidence points in the other direction.", 
   {}, 
   435444, 
   null, 
   1311694320.0
  ], 
  [
   435454, 
   null, 
   "Doc Jones", 
   "I believe this disputes every claim and false account you have ever posted here:\n \n http://www.nytimes.com/2011/07/26/world/europe/26police.html?_r=2&partner=MYWAY&ei=5065\n \n Looks like they are re-evaluating the need for more guns, more accessible than before.\n \n On a side note, I bet he had a copy of J.D. Salinger's book, The Catcher in the Rye. Wait for it emoticon_idea emoticon_xagree", 
   {
    "post_info": {
     "post_title": "star gazer and brady:"
    }
   }, 
   435446, 
   null, 
   1311702060.0
  ], 
  [
   435460, 
   null, 
   "Xenamnes", 
   "Good to see you associating strict gun control with low crime.\n\n \n You have yet to show Norway's gun control laws are responsible for their lower crime rates, rather than their way of society as a whole. The laws of Norway governing the sales, use and acquisition of Norway could be considered lax when compared to a country such as Canada or Great Britain. And yet in 2005 only five murders can be attributed to firearm-related offenses.\n \n You still seem to be ignoring the fact that the shooter had already purchased 6 tons of fertilizer for the purpose of constructing bombs; more than twice the amount purchased by Timothy McVeigh for the Oklahoma City Bombing.", 
   {}, 
   435444, 
   null, 
   1311705960.0
  ], 
  [
   435496, 
   null, 
   "Superlite27", 
   "Guns don't seem to be working out so well. Christians are way down in the competition. \n \n Maybe they should take a page from the Muslims and start using airplanes.\n \n Even Christian bombs are sissy. McVeigh only killed 168...WITH A TRUCK.\n \n The Muslims used backpacks in Madrid and got over 190. \n \n Nah. Those Christians are amateurs. The Jews are even worse. Who ever heard of a Jewish suicide bomber?\n \n Can't hold a candle to the Palestinians. Now THOSE people know how to murder folks.", 
   {}, 
   435460, 
   null, 
   1311722640.0
  ], 
  [
   435499, 
   null, 
   "Penfold", 
   "Palestinians are not that good at it. Israelis kill ten of them for every one.", 
   {}, 
   435496, 
   null, 
   1311723180.0
  ], 
  [
   435528, 
   null, 
   "Winston Smith", 
   "Guns don't seem to be working out so well. Christians are way down in the competition. \n \n Maybe they should take a page from the Muslims and start using airplanes.\n \n Even Christian bombs are sissy. McVeigh only killed 168...WITH A TRUCK.\n \n The Muslims used backpacks in Madrid and got over 190. \n \n Nah. Those Christians are amateurs. The Jews are even worse. Who ever heard of a Jewish suicide bomber?\n \n Can't hold a candle to the Palestinians. Now THOSE people know how to murder folks.\n\n \n \n You forgot to account for \"misson accomplished \" Dubya Bush the Texan crusader who killed hundred of thousands of Iraqis and God knows how many Afghans in the name of God and oil companies.", 
   {}, 
   435496, 
   null, 
   1311766560.0
  ], 
  [
   435529, 
   null, 
   "Winston Smith", 
   "Good to see you associating strict gun control with low crime.\n\n \n occasionally, (a rare random event) Doc's few neurons short-circuit and produce a sensible rational logical thought. \n \n Soon though he reverses to his 'more guns = less crime' insane statements emoticon_rolleyes", 
   {}, 
   435444, 
   null, 
   1311766860.0
  ], 
  [
   435530, 
   null, 
   "Winston Smith", 
   "Palestinians are not that good at it. Israelis kill ten of them for every one.\n\n \n They learnt it from the Nazis emoticon_xclown", 
   {}, 
   435499, 
   null, 
   1311766920.0
  ], 
  [
   435534, 
   null, 
   "Doc Jones", 
   "occasionally, (a rare random event) Doc's few neurons short-circuit and produce a sensible rational logical thought. \n \n Soon though he reverses to his 'more guns = less crime' insane statements emoticon_rolleyes\n\n \n Let us review the situation and the quote in it's entire morgue atmosphere. Here you responded to star gazer with an attempted cheap shot at me and undermined both his and your obvious innacurate claim:\n \n Quote:\n Originally Posted by Galileo \n Good to see you associating strict gun control with low crime. \n Winnie:\n occasionally, (a rare random event) Doc's few neurons short-circuit and produce a sensible rational logical thought. \n \n Soon though he reverses to his 'more guns = less crime' insane statements \n __________________\n \n The bleeding obvious, although you are too shallow to recognize it is like your failure to recognize a skunk until it is too late.\n \n IF, IF \"strict gun control\" was effective, there never would have been such a situation!!!! That occurance would never have been possible IF \"strict gun laws\" were anything but a failure and caused other problems since even the police were unarmed and delayed their response for over an hour and a half.\n \n Seems to me, if either of you boys had a nueron that would be obvious but do keep up the attempt at petty talking points that show the futility of gun control as a crime control measure; never worked and never will.\n \n MORE GUNS EQUAL LESS CRIME.", 
   {}, 
   435529, 
   null, 
   1311770100.0
  ], 
  [
   435536, 
   null, 
   "Doc Jones", 
   "You wanna be gun grabbers and anti rights activists are giving each other a 'high five' for scoring a goal for your opposition.\n \n Thanks for the admission and pointing out the obvious.......again. emoticon_xgood", 
   {}, 
   435534, 
   null, 
   1311770880.0
  ], 
  [
   435538, 
   null, 
   "gansao", 
   "They learnt it from the Nazis emoticon_xclown\n\n \n Lot of Nazism about in the old country eh Whiney?\n Chilean Skeletons: Was Salvador Allende a Racist? - SPIEGEL ONLINE - News - International", 
   {}, 
   435530, 
   null, 
   1311771840.0
  ], 
  [
   435539, 
   null, 
   "Doc Jones", 
   "I have wondered what a bunch of kids on an island, in a political camp, supposedly getting indoctrinated or brainwashed, and totally unprotected were engaged in which presented a target rich opportunity?\n \n Perhaps the mention of J.D. Salinger's book, The Catcher in the Rye hasn't been considered quite fully. That used to be required reading in public schools. Some of the less well-educated should consider adding it to their reading list?", 
   {}, 
   435538, 
   null, 
   1311773160.0
  ], 
  [
   435540, 
   null, 
   "Winston Smith", 
   "Let us review the situation and the quote in it's entire morgue atmosphere. Here you responded to star gazer with an attempted cheap shot at me and undermined both his and your obvious innacurate claim:\n \n Quote:\n Originally Posted by Galileo \n Good to see you associating strict gun control with low crime. \n Winnie:\n occasionally, (a rare random event) Doc's few neurons short-circuit and produce a sensible rational logical thought. \n \n Soon though he reverses to his 'more guns = less crime' insane statements \n __________________\n \n The bleeding obvious, although you are too shallow to recognize it is like your failure to recognize a skunk until it is too late.\n \n IF, IF \"strict gun control\" was effective, there never would have been such a situation!!!! That occurance would never have been possible IF \"strict gun laws\" were anything but a failure and caused other problems since even the police were unarmed and delayed their response for over an hour and a half.\n \n Seems to me, if either of you boys had a nueron that would be obvious but do keep up the attempt at petty talking points that show the futility of gun control as a crime control measure; never worked and never will.\n \n MORE GUNS EQUAL LESS CRIME.\n\n \n you are back to 'normal' emoticon_rolleyes", 
   {}, 
   435534, 
   null, 
   1311775740.0
  ], 
  [
   435541, 
   null, 
   "Winston Smith", 
   "I have wondered what a bunch of kids on an island, in a political camp, supposedly getting indoctrinated or brainwashed, and totally unprotected were engaged in which presented a target rich opportunity?\n \n Perhaps the mention of J.D. Salinger's book, The Catcher in the Rye hasn't been considered quite fully. That used to be required reading in public schools. Some of the less well-educated should consider adding it to their reading list?\n\n \n the \"less well-educated\" ????? emoticon_rolleyes", 
   {}, 
   435539, 
   null, 
   1311775980.0
  ], 
  [
   435542, 
   null, 
   "Doc Jones", 
   "the \"less well-educated\" ????? emoticon_rolleyes\n\n \n Second Amendment | Oslo Massacre | US Gun Rights | The Daily Caller\n \n \nGottleib said gun control activists are \"intellectually defrauded and bankrupt\" in continuing to defend gun control laws in the face of the shooting.\n \n \"The truth of the matter is they only look at one side of the equation,\" he said. \"They don't want you to see the other side of the equation, because if you did, you might come up with the correct public policy answer.\"\n \n\n \n Read all and Hennigan's squirming comment emoticon_xclown\n \n You guys got some 'splainin' to do. emoticon_xagree", 
   {
    "unicode_changes_made": true
   }, 
   435541, 
   null, 
   1311776940.0
  ], 
  [
   435544, 
   null, 
   "Xenamnes", 
   "All of these recently introduced topics are completely irrelevant and beyond the scope of the discussion. It wasn't Bush that carried out the Norway Massacre. Nor was it the Palestinians, the Israelis, Christians, Muslims, the Nazis, Sarah Palin, or even the Tea Party movement in America.\n \n This was an attack that was orchestrated by a sole individual, he is the one solely responsible for what happened that day. He chose to purchase six tons of ammonium nitrate fertilizer for the purpose of carrying out bombings. He chose to carry out a rampage on an isolated island 90 minutes away from the nearest police response, executing unarmed children.\n \n The police of Norway go unarmed, not because the country is such a safe location, but because it's a point of national pride. Even if an entire precinct of police officers had been at the island to provide security there is little they could have done other than die right along side the youth group.", 
   {}, 
   435534, 
   null, 
   1311778500.0
  ], 
  [
   435546, 
   null, 
   "Tither", 
   "Dennis Henigan must be including suicides when he talks about the number of lives lost due to gun violence each day. \n\n I knew it was a deception. But it also is an exaggeration too. emoticon_cool Latest figures will not support those totals. \n \n Counting suicides increases the total one and a half times, and makes it look like he is talking about crime and murders. \n \n However if guns cause or increases suicides, and we know we are the most armed nation on earth, then why are we seeing this? \n   U.S. Suicide Statistics  \n Deaths per 100,000 population: 10.8 \n Which a little over half, are firearm. \n \n   The global suicide rate per 100,000 population. \n The global suicide rate is 16 per 100,000 population.\n \n Global suicide rates have increased 60% in the past 45 years. \n While ours remains constant.\n \n How many guns are increased every year? However many coincides with a 132 million background checks in 12 years. \n   Total NICS Background Checks -- November 30, 1998 - June 30, 2011 \n Total = 132,424,551 \n\n \n All of that while our violent crime and murders have been almost cut in half since the early 90&#8217;s? \n   Crime in the United States -- by Volume and Rate per 100,000 Inhabitants, 1990&#8211;2009 \n \n 1991 Violent Crime Rate = 758.2 Murder Rate = 9.8\n \n 2009 Violent Crime Rate = 429.4 Murder Rate = 5.0\n \n And the good news continues to get better.\n   January to December 2010 - Percent Change 2009 to 2010 \n Violent crime rate down by &#8211;5.5% and Murder down by - 4.4% \n \n Lets see. More cops on the street, 3 strikes sentencing rules, all of those new guns, and all of those new CCW permit holders. How can you explain all of that? Or is this something you hope others will not see. Perhaps murder rates are different because other societies are different.\n \n Kind of like this. Norway&#8217;s crime and murder rates are rather low but yet,   Four times more crime in Oslo than New York \n The crime rate in Oslo has been growing at an alarming rate and recent statistics show the Norwegian capital had 20 percent more robberies last year than in 2006.\n \n While crime in the rest of Norway has been going down, it has been quite another situation in Oslo, where personal and automobile thefts increased markedly last year.\n \n There were 10,600 crimes reported in public places in 2007, up from 8,000 a year earlier, writes Norwegian daily newspaper Dagbladet.\n \n Oslo had the highest rate per person in Scandinavia in terms of reported crimes, with 90 reported crimes per 1,000.\n \n Copenhagen had 50 crimes reported per 1,000 and Stockholm had 79.\n \n In New York, there were 22 reported crimes per 1,000 inhabitants.\n \n This means there were four times as many reported crimes per person in Oslo as in New York.\n \n The Oslo police are blaming the increase on an influx of East Europeans, and Minister of Justice Knut Storberget is reportedly partly in agreement.\n\n emoticon_ic", 
   {}, 
   435415, 
   null, 
   1311781320.0
  ], 
  [
   435568, 
   null, 
   "zsu2357", 
   "They learnt it from the Nazis emoticon_xclown\n\n Well Doc old man it is like Sir Winston said \"They learn't it from the Nazi's\",heck of a resume ain't it.emoticon_xkillA lot of lessons were learned,some not to be forgotten.", 
   {}, 
   435530, 
   null, 
   1311794460.0
  ], 
  [
   435672, 
   null, 
   "Brady", 
   "Norway Shooter's Mini-14: The \"Poor Man's Assault Rifle\" \n \n The attack in Norway by Anders Behring Breivik, apparently involving a Ruger Mini-14 assault rifle, is only the most horrific of the mass shootings involving the company's products.\n \n Founded in 1949, the \"corporate motto\" of Sturm, Ruger & Co. is \"Arms Makers for Responsible Citizens.\" But Sturm, Ruger firearms are also often found in the hands of mass shooters: last year's attack at a Connecticut beer distributor, leaving eight victims dead and two wounded; the 1999 shooting at Wedgewood Baptist Church in Texas, leaving seven victims dead and seven wounded; Oregon's Thurston High School in 1998, leaving four dead and 22 wounded; the 1993 Long Island Railroad shooting, leaving six dead and 19 wounded; the 1991 Luby's massacre, leaving 23 victims dead and 20 wounded; and, a 1987 shootout at a Florida shopping center, leaving six dead, including two police officers...\n Josh Sugarmann: Norway Shooter's Mini-14: The \"Poor Man's Assault Rifle\"\n \n Too bad Norway didnt learn from the tragedies that happened in the US involving Ruger assault rifles.", 
   {}, 
   435568, 
   null, 
   1311891720.0
  ], 
  [
   435673, 
   null, 
   "Doc Jones", 
   "Norway Shooter's Mini-14: The \"Poor Man's Assault Rifle\" \n \n The attack in Norway by Anders Behring Breivik, apparently involving a Ruger Mini-14 assault rifle, is only the most horrific of the mass shootings involving the company's products.\n \n Founded in 1949, the \"corporate motto\" of Sturm, Ruger & Co. is \"Arms Makers for Responsible Citizens.\" But Sturm, Ruger firearms are also often found in the hands of mass shooters: last year's attack at a Connecticut beer distributor, leaving eight victims dead and two wounded; the 1999 shooting at Wedgewood Baptist Church in Texas, leaving seven victims dead and seven wounded; Oregon's Thurston High School in 1998, leaving four dead and 22 wounded; the 1993 Long Island Railroad shooting, leaving six dead and 19 wounded; the 1991 Luby's massacre, leaving 23 victims dead and 20 wounded; and, a 1987 shootout at a Florida shopping center, leaving six dead, including two police officers...\n Josh Sugarmann: Norway Shooter's Mini-14: The \"Poor Man's Assault Rifle\"\n \n Too bad Norway didnt learn from the tragedies that happened in the US involving Ruger assault rifles.\n\n \n And every single one listed was a gun free zone. When are you going to wise up brady?", 
   {}, 
   435672, 
   null, 
   1311891960.0
  ], 
  [
   435691, 
   null, 
   "Winston Smith", 
   "All of these recently introduced topics are completely irrelevant and beyond the scope of the discussion. It wasn't Bush that carried out the Norway Massacre. Nor was it the Palestinians, the Israelis, Christians, Muslims, the Nazis, Sarah Palin, or even the Tea Party movement in America.\n \n This was an attack that was orchestrated by a sole individual, he is the one solely responsible for what happened that day. He chose to purchase six tons of ammonium nitrate fertilizer for the purpose of carrying out bombings. He chose to carry out a rampage on an isolated island 90 minutes away from the nearest police response, executing unarmed children.\n \n The police of Norway go unarmed, not because the country is such a safe location, but because it's a point of national pride. Even if an entire precinct of police officers had been at the island to provide security there is little they could have done other than die right along side the youth group.\n\n \n You are right, Bush didn't kill anyone in Norway. He chose instead to invade Iraq and as a result hundred of thousands died and continue dying because Dubya chose and is fully responsible for the invasion of Iraq. He is a terrorist and mass murderer.", 
   {}, 
   435544, 
   null, 
   1311899640.0
  ], 
  [
   435697, 
   null, 
   "Xenamnes", 
   "You are right, Bush didn't kill anyone in Norway. He chose instead to invade Iraq and as a result hundred of thousands died and continue dying because Dubya chose and is fully responsible for the invasion of Iraq. He is a terrorist and mass murderer.\n\n \n All of which is still irrelevant to the discussion at hand. Bush's actions in Iraq are not the subject of discussion regarding Norway.", 
   {}, 
   435691, 
   null, 
   1311900480.0
  ], 
  [
   435700, 
   null, 
   "zsu2357", 
   "Norway Shooter's Mini-14: The \"Poor Man's Assault Rifle\" \n \n The attack in Norway by Anders Behring Breivik, apparently involving a Ruger Mini-14 assault rifle, is only the most horrific of the mass shootings involving the company's products.\n \n Founded in 1949, the \"corporate motto\" of Sturm, Ruger & Co. is \"Arms Makers for Responsible Citizens.\" But Sturm, Ruger firearms are also often found in the hands of mass shooters: last year's attack at a Connecticut beer distributor, leaving eight victims dead and two wounded; the 1999 shooting at Wedgewood Baptist Church in Texas, leaving seven victims dead and seven wounded; Oregon's Thurston High School in 1998, leaving four dead and 22 wounded; the 1993 Long Island Railroad shooting, leaving six dead and 19 wounded; the 1991 Luby's massacre, leaving 23 victims dead and 20 wounded; and, a 1987 shootout at a Florida shopping center, leaving six dead, including two police officers...\n Josh Sugarmann: Norway Shooter's Mini-14: The \"Poor Man's Assault Rifle\"\n \n Too bad Norway didnt learn from the tragedies that happened in the US involving Ruger assault rifles.\n\n \n What makes a Mini-14 a poor mans \"assault rifle\"?Shoots the same round that an M-16 does or AR 15 (semi-auto).Trust me on this you would never know the difference between them.", 
   {}, 
   435672, 
   null, 
   1311900900.0
  ], 
  [
   435701, 
   null, 
   "Xenamnes", 
   "Norway Shooter's Mini-14: The \"Poor Man's Assault Rifle\"\n\n \n To express surprise on the speed of which you chose to jump on this issue would be false in nature. It was entirely unlikely that you wouldn't bring up this article at some point in the future.\n \n However that said the article is quite misleading. The Ruger Mini-14 is not an assault rifle, nor is it a cheap substitute for one. At one point the Mini-14 may have cost less than an AR-15, but this is no longer the truth. The Mini-14 variant used by Breivik is hardly cheap when compared to other available models. The Ruger website lists his chosen variant as costing $921, which is a price equal to or even greater than several brands of AR-15 rifles, such at those made by the DPMS company.\n \n A poor man's rifle for use in a massacre would far more likely be the Romanian brand of AK-47, which can usually be found for $450, less than half of what a new or used Mini-14 would command on the open market, and chambered in what consider to be a superior caliber. Even cheaper still is the SKS rifle, which can be found for $200 to $300 on the market.\n \n \nThe attack in Norway by Anders Behring Breivik, apparently involving a Ruger Mini-14 assault rifle, is only the most horrific of the mass shootings involving the company's products.\n \n Founded in 1949, the \"corporate motto\" of Sturm, Ruger & Co. is \"Arms Makers for Responsible Citizens.\" But Sturm, Ruger firearms are also often found in the hands of mass shooters: last year's attack at a Connecticut beer distributor, leaving eight victims dead and two wounded; the 1999 shooting at Wedgewood Baptist Church in Texas, leaving seven victims dead and seven wounded; Oregon's Thurston High School in 1998, leaving four dead and 22 wounded; the 1993 Long Island Railroad shooting, leaving six dead and 19 wounded; the 1991 Luby's massacre, leaving 23 victims dead and 20 wounded; and, a 1987 shootout at a Florida shopping center, leaving six dead, including two police officers...\n Josh Sugarmann: Norway Shooter's Mini-14: The \"Poor Man's Assault Rifle\"\n\n \n Criminal misuse of a product is hardly telling of what the product was designed for. Sudafed wasn't put on the market for the purpose of it being used in the production of methamphetamine. Simply because the Mini-14 has been found in the hands of a few notable criminals is hardly the fault of the Ruger company itself.\n \n \nToo bad Norway didnt learn from the tragedies that happened in the US involving Ruger assault rifles.\n\n \n In his application for the Mini-14 rifle Breivik listed \"deer hunting\" as a reason for ownership. His application was later approved. Apparently Norway believed the Mini-14 was a suitable hunting firearm and not a weapon of massacre.\n \n As said previously the Mini-14 is not an \"assault rifle\" and cannot legally considered as one. It doesn't fit the criteria set forth for determining and defining something as an assault rifle. It is no more an assault rifle than, as you said earlier, \"your grandfather's shotgun\" is one.", 
   {}, 
   435672, 
   null, 
   1311901140.0
  ], 
  [
   435704, 
   null, 
   "Tither", 
   " The Ruger website lists his chosen variant as costing $921, ...\n\n 921 Dollars is cheap to these emoticon_xclown . That goes to show us just how far they will go to manufacture up a point when their really is none. \n \n All of that gun control and it STILL Happened. \n \n The Anti's Screams, Bush caused it. The Tea Party! Pailen, they did it all!!!! \n \n Did you see his haircut? Ban Assault Haircuts!!! \n His shoes were Nike's. Ban the Assault Nike. \n He had a bicycle. Ban Assault Bicycles.\n He had a Parakeet. Ban Assault Parakeets Now! \n \n emoticon_smile", 
   {}, 
   435701, 
   null, 
   1311902640.0
  ], 
  [
   435715, 
   null, 
   "Tither", 
   "I would be remiss if I didn't mention that in England, which has the strictest gun control in the Western world, we still have this kind of stuff happen.\n   gunman Derrick Bird killed at least 12 people in a shooting spree in Cumbria and injured another 25 before taking his own life.  \n Armed with two weapons - a .22 rifle and a shotgun \n \n No semi autos, no pumps, no handguns allowed. Period. Strict cradle to grave registration, and locked up guns. Everything that the gun banners say we need in order to stop all of this. And we still have this happen. \n \n Undaunted by these glaring failures, the gun banners violently try to race us towards Armageddon to kill the 2nd Amendment to our Great and Unique Constitution. Using Any and ALL excuses they can manufacture. \n \n But still, the Norwegian guy made a very effective and destructive bomb. And yet no words about assault bombs, or bomb control! :)", 
   {}, 
   435704, 
   null, 
   1311910380.0
  ], 
  [
   435717, 
   null, 
   "zsu2357", 
   "You can listen to Brady and his anti-gun buds talk about how evil the Mini-14 is all day.Why? It was used in a shooting,who knows maybe tomorrow it will be that evil looking SKS or the evil sears and roebuck semi-auto .22?emoticon_rolleyes", 
   {}, 
   435715, 
   null, 
   1311911400.0
  ], 
  [
   435736, 
   null, 
   "Doc Jones", 
   "Norway Shooter's Mini-14: The \"Poor Man's Assault Rifle\" \n \n The attack in Norway by Anders Behring Breivik, apparently involving a Ruger Mini-14 assault rifle, is only the most horrific of the mass shootings involving the company's products.\n\n \n Imported by Norway courtesy of our own State Department and Hillary Klinton with the approval of Obama. You under the impression that Ruger just filled an order from Breivik?\n \n That is the same thing and way gov't to gov't sales got guns to Mexico, not dealers but administration acts...other than the obvious smuggling encouraged and paid for by atf and other criminal agencies. What about that FFL licensed in Mexico? Plumb out of jurisdiction and title. I guess that is something else inconvenient for you to mention?\n \n You will never be a man until you stand up, Ride, shoot straight and tell the Truth. - Book written by the late Jeff Cooper, Col. USMC\n \n You wouldn't recall but Senator Dodd that pushed the '68 safe streets and presidential protection act through following the Nazi gun grab bill his old man got from the Nurenberg Trials was \"censured by his own Senate colleagues in 1967 for political abuse and corruption and rightly defeated in 1970 for re-election.\"\n \n Your gun grabbing platform is built on a whole quicksand of socialism, lies and criminal acts.", 
   {}, 
   435672, 
   null, 
   1311943560.0
  ], 
  [
   435863, 
   null, 
   "Xenamnes", 
   "A followup to Brady's post regarding the Ruger Mini-14 being a \"poor man's assault rifle.\"\n \n Beyond the point that the Mini-14 does not fit set criteria for being considered an assault rifle is the \"poor man's\" angle. As it has already been pointed out Breivik's selected variant of the Mini-14 commands a price of $921 as advertised on the Ruger website; hardly the most affordable of firearms. Adding further to the fact is Breivik having paid $550 for a total of 10 magazines, which breaks down to $55 for each magazine, bringing the investment up to $1,471, not counting taxes and shipping fees. This price greatly exceeds the market value of a number of Bushmaster AR-15 variants which come with only two magazines standard.\n \n There is also the fact that Breivik possessed sufficient funds to purchase 12,000 pounds of ammonium nitrate fertilizer, which is hardly a cheap investment by any measure.", 
   {}, 
   435736, 
   null, 
   1312057620.0
  ], 
  [
   435880, 
   null, 
   "Penfold", 
   "As the Mini 14 is effectively a smaller but more efficient version of the M14 Garand, the appellation assault rifle fits well. The \"Poor Mans\" tag references the competitive pricing relative to broadly comparable weapons. The financial circumstances of the rightwing psychoChristian terrorist is a strawman diversion, and irrelevant.", 
   {}, 
   435863, 
   null, 
   1312068840.0
  ], 
  [
   435883, 
   null, 
   "Xenamnes", 
   "As the Mini 14 is effectively a smaller but more efficient version of the M14 Garand,\n\n \n There is the M14, and then there is the M1 Garand. The two are similar in design but considerably different from one another.\n \n \nthe appellation assault rifle fits well.\n\n \n It does not. To qualify as an assault rifle a firearm needs to possess a selective fire capability. If the design does not possess an integral mechanism to let it switch from semi-automatic fire, to burst fire or full automatic fire, then it is quite false to label it as an assault rifle.\n \n \nThe \"Poor Mans\" tag references the competitive pricing relative to broadly comparable weapons.\n\n \n The Mini-14 is hardly what many would consider cheap, costing more than several AR-15 variants, more than twice the price of a Romanian made AK-47, and up to three times as much as an SKS. The \"poor man's\" tag is quite misleading.\n \n \nThe financial circumstances of the rightwing psychoChristian terrorist is a strawman diversion, and irrelevant.\n\n \n Political and religious orientation are not of issue to this discussion. However the fact that Breivik could purchase 12,000 pounds of ammonium nitrate fertilizer, and supposedly a farm for which he could explain the use of said fertilizer, suggests that he was in possession of considerable finances and well able to cause far more damage than he had if he had wished to. There is no irrelevancy to this matter.", 
   {}, 
   435880, 
   null, 
   1312071180.0
  ], 
  [
   435884, 
   null, 
   "E Mutz", 
   "As the Mini 14 is effectively a smaller but more efficient version of the M14 Garand, the appellation assault rifle fits well. \n\n \n And a housecat is effectively a smaller more efficient version of a Lion but that does not make Fluffy an assault cat.", 
   {}, 
   435880, 
   null, 
   1312071600.0
  ], 
  [
   435886, 
   null, 
   "Tither", 
   "Humm, More HATE speech, this time from England. I am a proud Christian, am I a terrorist in your eyes, Penfold? \n \n What is an Assault Weapon? This firearm has no bayonet lug, nor a barrel shroud. It is not a full automatic firearm. And the Ruger mini 14 was given protected status in the original 1993 Assault Weapons Ban as something that would never be banned. \n \n And Poor man's gun? What financial class does one have to ride in, not to call a thousand bucks for a firearm something that is befitting a poor man? \n \n Lastly: \n In 2000 to 2002 The CDC conducted a systematic review of scientific evidence regarding the effectiveness of firearms laws in preventing violence, including violent crimes, suicide, and unintentional injury. The systematic review development team identified 51 studies that evaluated the effects of selected firearms laws on violence and met the inclusion criteria for this review. No study was excluded because of limitations in design or execution.\n \n One of the things they studied was: Bans on specified firearms or ammunition. \n Prohibit acquisition or possession of certain categories of firearms. (e.g. Machineguns or assault weapons or ammunition (e.g. large capacity magazines.)) \n \n \n  What did they find?  \n &#8220;the task Force found insufficient evidence to determine the effectiveness of any of the firearms laws or combinations of laws reviewed on violent outcomes.&#8221; \n\n The CDC did suggest more studies. Then a few years later the CDC got a second bite at the apple with The National Academy of Sciences studies. They, along with the Anti-gun Joyce foundation funded, the study. National-Academies.org | Newsroom\n \n Here is an article about the study Link  who issued a 328-page report based on 253 journal articles, 99 books, 43 government publications, a survey of 80 different gun-control laws and some of its own independent study. \nIn short, the panel could find no link between restrictions on gun ownership and lower rates of crime, firearms violence or even accidents with guns. \n ...\n The Justice Department's interviews also showed so-called \"assault weapons\" are not a major cause of gun violence. Only about 8 percent of the inmates used one of the models covered in the now-expired assault weapons ban, signed into law by the Clinton administration in 1994.\n\n The whole anti-gun pronouncement on the Mini 14 is nothing but a strawman!\n \n Gun control is NOT crime Control. Neither is it Bomb control, which he made a horror fill effective one. But what this was, was a failure of strict gun control, yet again!\n \n So I have a question. Is all of this HATE speech from the Left an example of the new civility that you guys hope to push on us? Or is this just another example of OK for me, but surely not meant for thee?", 
   {}, 
   435880, 
   null, 
   1312072260.0
  ], 
  [
   435893, 
   null, 
   "zsu2357", 
   "Please excuse Comrade P. as I doubt if he really has any idea at all what he's talking about,probably don't know the difference between a Red Ryder and a RPG.emoticon_idea\n \n 'Fluffy assault cat'? I love it.", 
   {}, 
   435886, 
   null, 
   1312080300.0
  ], 
  [
   435925, 
   null, 
   "Brady", 
   "The man who confessed to killing 68 people in Norway last week says he bought the ammunition clips used in his shooting spree from the U.S by mail order.\n \n Anders Behring Breivik wrote in his 1,500-page manifesto that he spent $500 for 10 30-round clips.\n \n Clips with more than three rounds are banned from sale in Norway.\n \n Rep. Carolyn McCarthy (D-NY), who introduced legislation to limit high-capacity ammunition clips following the shooting of Rep. Gabrielle Giffords (D-AZ), told Politico that U.S. lawmakers should be ashamed.\n \n \"We're sending a death warrant to other parts of the world,\" she said. \"Unfortunately now, internationally, it's known that you can get here, buy your guns, buy your large magazines, and you're not going to have any problem\"\n Alleged Norway killer bought ammunition clips from U.S.|Raw Replay\n \n The lax gun laws gun nuts support have deadly consequences for innocent victims in other nations.", 
   {
    "unicode_changes_made": true
   }, 
   435893, 
   null, 
   1312107900.0
  ], 
  [
   435926, 
   null, 
   "Brady", 
   "Sweden's gun laws would have stopped Norway killer: police\n \n In Sweden, a person like Anders Behring Breivik wouldn't have been allowed an automatic weapon, according to Swedish police.\n \n By law, licenses for automatic weapons can only be issued if there are extraordinary reasons. Among other things, the Swedish Armed Forces (Försvarsmakten) must justify the possession.\n \n Breivik, the suspected mass murderer, wrote in his application that the reason he was applying for an automatic weapon license was to hunt deer.\n \n \"It wouldn't have worked in Sweden,\" said Lars Tonneman, director of the police law section at the National Police Agency (Rikspolisstyrelsen).\n \n Roughly 2,500 individuals in Sweden have licenses for submachine guns. According to the Swedish Shooting Sport Association (Svenska skyttesportförbundet), this is the only type of automatic weapon that occurs in Swedish shooting clubs.\n \n \"And no new licenses are being issued. The ones that exist, exist. The fact that Swedish championships in semi-automatic weapons exist is a heritage from the Armed Forces. It's the only category we have that's automatic, and it's on its way out,\" he said.\n \n \"Most of those who have a license on that sort of gun are militia men or military.\"\n Sweden's gun laws would have stopped Norway killer: police - The Local\n \n Hopefully Norway will ban military assault rifles.", 
   {}, 
   435925, 
   null, 
   1312108740.0
  ], 
  [
   435928, 
   null, 
   "Doc Jones", 
   "Sweden's gun laws would have stopped Norway killer: police\n \n In Sweden, a person like Anders Behring Breivik wouldn't have been allowed an automatic weapon, according to Swedish police.\n \n By law, licenses for automatic weapons can only be issued if there are extraordinary reasons. Among other things, the Swedish Armed Forces (Försvarsmakten) must justify the possession.\n \n Breivik, the suspected mass murderer, wrote in his application that the reason he was applying for an automatic weapon license was to hunt deer.\n \n \"It wouldn't have worked in Sweden,\" said Lars Tonneman, director of the police law section at the National Police Agency (Rikspolisstyrelsen).\n \n Roughly 2,500 individuals in Sweden have licenses for submachine guns. According to the Swedish Shooting Sport Association (Svenska skyttesportförbundet), this is the only type of automatic weapon that occurs in Swedish shooting clubs.\n\n \n Muddy waters much Greg? A semi auto is NOT a machine gun and further, a submachine gun is a pistol cartridge. \n \n Now be a good mouth breather and tell us exactly WHO IS THE MILITIA in the United States.\n \n \n\"And no new licenses are being issued. The ones that exist, exist. The fact that Swedish championships in semi-automatic weapons exist is a heritage from the Armed Forces. It's the only category we have that's automatic, and it's on its way out,\" he said.\n\n \n So, your source correctly recognizes a difference between a full auto \"automatic\" and a semi-auto that requires a single pull. LOL\n \n \n\"Most of those who have a license on that sort of gun are militia men or military.\"\n Sweden's gun laws would have stopped Norway killer: police - The Local\n \n Hopefully Norway will ban military assault rifles.\n\n \n Whoop de do! I do not think any country will ban \"military assault rifles nor submachine guns\" any more than they will ban high explosives, RPGs, rockets or airplanes with high tech arms including nuclear bombs. You don't either!!!!", 
   {}, 
   435926, 
   null, 
   1312109820.0
  ], 
  [
   435930, 
   null, 
   "Doc Jones", 
   "The man who confessed to killing 68 people in Norway last week says he bought the ammunition clips used in his shooting spree from the U.S by mail order.\n \n Anders Behring Breivik wrote in his 1,500-page manifesto that he spent $500 for 10 30-round clips.\n \n Clips with more than three rounds are banned from sale in Norway.\n \n Rep. Carolyn McCarthy (D-NY), who introduced legislation to limit high-capacity ammunition clips following the shooting of Rep. Gabrielle Giffords (D-AZ), told Politico that U.S. lawmakers should be ashamed.\n \n \"We're sending a death warrant to other parts of the world,\" she said. \"Unfortunately now, internationally, it's known that you can get here, buy your guns, buy your large magazines, and you're not going to have any problem\"\n Alleged Norway killer bought ammunition clips from U.S.|Raw Replay\n \n The lax gun laws gun nuts support have deadly consequences for innocent victims in other nations.\n\n \n Your mind is a horrible thing to lose! You got so many things wrong and co-mingled here there is no place to start. People like you are the ones that screwed up the budget and spending. You don't know the difference between a clip and a magazine and neither does your source. Education problems?", 
   {
    "unicode_changes_made": true
   }, 
   435925, 
   null, 
   1312110180.0
  ], 
  [
   435932, 
   null, 
   "Doc Jones", 
   "Know what would have stopped the shooter cold in his tracks?\n \n McCarthy blames Norway shootings on ?lax U.S. gun laws?! - National gun rights | Examiner.com\n \n If only we would give up our unalienable rights, McCarthy would be happy. Liberals are always happy when they spend other peoples' money and they do not have to give up anything including rights nor money.emoticon_xgood\n \n Hey McCarthy, there wouldn't be an exclusion for congress present nor past now would there? You always excuse yourselves from any punative laws including taxes.", 
   {}, 
   435930, 
   null, 
   1312112880.0
  ], 
  [
   435938, 
   null, 
   "Tither", 
   "The deluded Anti-gunner spews: If they would just listen to me, and ban all guns this would be the safest place ever. \n Kind of like ==< \nSweden's gun laws would have stopped Norway killer: police\n\n Really? What law permits someone to manufacture huge car bombs? As far as I know, there is nowhere someone can legally use those to kill people of blow up buildings, and yet, he made a HUGE and very powerful one. \n \n A google search.   For very recent Suicide Bombing. \n Suicide car bomber kills 10 Afghan policemen Los Angeles Times - Aimal Yaqubi - 1 hour ago\n Police converge on the scene of a suicide car bomb blast in Lashkar Gah, capital of the volatile Helmand province. (Sher Khan, EPA) By Laura King Los ...\n 5 Police Killed in Southern Afghanistan&#8206; Voice of America (blog)\n \n Suicide bomber kills 10 Afghan officers, 1 child outside police ...&#8206; Washington Post\n \n 12 POLICEMEN AND A CHILD KILLED IN AFGHAN SUICIDE ATTACK&#8206; Agenzia Giornalistica Italia\n \n Attack on Afghan government compound kills 19\n Suicide bomber strikes Iraqi bank, killing 12 \n Kandahar mayor killed by suicide bombing \n Suicide Bomber Hits Troops at Port City in Yemen \n Suicide bomber kills 4 at Karzai memorial service\n Suicide Bomber Kills 5 French Soldiers\n CNN.com - Suicide bombing at Israeli disco \n Suicide bombing suspect 'on welfare six years' - \n Pakistani Officials: Suicide Bombing Kills One Soldier, Wounds Several \n \n But I suppose this is all MY/Our Fault too. Huh Brady?\n \n First all of Mexico's violence was my/our fault until it was found out that the ATF was actually running guns into Mexico, now what some slimeball does in Norway is my fault. \n \n Get a clue.", 
   {}, 
   435932, 
   null, 
   1312119720.0
  ], 
  [
   435939, 
   null, 
   "Tither", 
   "Why do the Anti-gunners HAVE TO use the pitiful tactic of pointing to trouble in other countries, and blame it on us, so that he/she can try take our guns away from us? \n \n Before the NICS Background checks went into operation, there were an estimated 250 million guns in America. Since then, the FBI has performed a 132 million checks on people purchasing guns. \n   Total NICS Background Checks -- November 30, 1998 - June 30, 2011 \n TOTAL = 132,424,551\n \n \n My, all of the new guns that correspond to 132 million checks, and yet our violent crime and murder rate has dropped like a stone. \n \n The FBI&#8217;s Uniform Crime reports show.\n   Crime in the United States &#8211; by Volume and Rate per 100,000 Inhabitants, 1990&#8211;2009 \n High 1991 Violent Crime rate = 758.2 ------ Murder rate = 9.8 \n \n Low 2009 Violent Crime rate = 429.4 ------ Murder rate = 5.0 \n \n And our good news just keeps on coming. \n   January to December 2010 -- Percent Change for Consecutive Years \n 2010/2009 violent crime decrease = -5.5 murder decrease = -4.4 \n\n Imagine That! And this after the Assault Weapon ban expired too! emoticon_rolleyes\n \n Not to mention that, all but one state has some form of allowed Concealed Carry. Imagine all of those Concealed Carry people out there with guns, and crime dropping like a stone. It is not quite the picture the Antis have painted, is it?", 
   {}, 
   435938, 
   null, 
   1312121460.0
  ], 
  [
   435942, 
   null, 
   "Xenamnes", 
   "The man who confessed to killing 68 people in Norway last week says he bought the ammunition clips used in his shooting spree from the U.S by mail order.\n \n Anders Behring Breivik wrote in his 1,500-page manifesto that he spent $500 for 10 30-round clips.\n \n Clips with more than three rounds are banned from sale in Norway.\n \n Rep. Carolyn McCarthy (D-NY), who introduced legislation to limit high-capacity ammunition clips following the shooting of Rep. Gabrielle Giffords (D-AZ), told Politico that U.S. lawmakers should be ashamed.\n \n \"We're sending a death warrant to other parts of the world,\" she said. \"Unfortunately now, internationally, it's known that you can get here, buy your guns, buy your large magazines, and you're not going to have any problem\"\n Alleged Norway killer bought ammunition clips from U.S.|Raw Replay\n \n The lax gun laws gun nuts support have deadly consequences for innocent victims in other nations.\n\n \n It has already been pointed out that shipping the magazines to Norway was a potentially illegal action due to the size of the order and the price of the transaction. Carolyn McCarthy's bill wasn't needed to outlaw this particular transaction. If the seller is found it's likely they will face more serious charges for violating a federal law dealing with international sales.\n \n Killing 68 unarmed children on a remote island, 90 minutes away from the nearest police response, is hardly an act that requires what you deem \"high capacity magazines\". This is an act that could truly have been perpetrated just the same with 10 round magazines, which would have cost significantly less for each.\n \n \nSweden's gun laws would have stopped Norway killer: police\n \n In Sweden, a person like Anders Behring Breivik wouldn't have been allowed an automatic weapon, according to Swedish police.\n \n By law, licenses for automatic weapons can only be issued if there are extraordinary reasons. Among other things, the Swedish Armed Forces (Försvarsmakten) must justify the possession.\n \n Breivik, the suspected mass murderer, wrote in his application that the reason he was applying for an automatic weapon license was to hunt deer.\n \n \"It wouldn't have worked in Sweden,\" said Lars Tonneman, director of the police law section at the National Police Agency (Rikspolisstyrelsen).\n \n Roughly 2,500 individuals in Sweden have licenses for submachine guns. According to the Swedish Shooting Sport Association (Svenska skyttesportförbundet), this is the only type of automatic weapon that occurs in Swedish shooting clubs.\n \n \"And no new licenses are being issued. The ones that exist, exist. The fact that Swedish championships in semi-automatic weapons exist is a heritage from the Armed Forces. It's the only category we have that's automatic, and it's on its way out,\" he said.\n \n \"Most of those who have a license on that sort of gun are militia men or military.\"\n Sweden's gun laws would have stopped Norway killer: police - The Local\n \n Hopefully Norway will ban military assault rifles.\n\n \n The Ruger Mini-14 is not an automatic weapon. It is neither an assault rifle nor a submachine guns. The Mini-14 lacks the parts necessary to allow for selective fire capabilities, making it impossible to fire more than one bullet per pull of the trigger.\n \n There is already a total ban on the ownership of true automatic weapons in Norway, and any attempt to modify a semi-automatic into a full automatic is considered a felony offense.\n \n The laws of Sweden are irrelevant to the discussion. Norway is not Sweden and should not be forced to adopt the rules governing Sweden.\n \n All of these details concerning gun laws of various countries are irrelevant. It has repeatedly been pointed out that Breivik was in possession of 12,000 pounds of ammonium nitrate fertilizer, an amount more than double that possessed by Timothy McVeigh at the time of the Oklahoma City Bombing.", 
   {
    "unicode_changes_made": true
   }, 
   435925, 
   null, 
   1312126620.0
  ], 
  [
   435984, 
   null, 
   "zsu2357", 
   "The man who confessed to killing 68 people in Norway last week says he bought the ammunition clips used in his shooting spree from the U.S by mail order.\n \n Anders Behring Breivik wrote in his 1,500-page manifesto that he spent $500 for 10 30-round clips.\n \n Clips with more than three rounds are banned from sale in Norway.\n \n Rep. Carolyn McCarthy (D-NY), who introduced legislation to limit high-capacity ammunition clips following the shooting of Rep. Gabrielle Giffords (D-AZ), told Politico that U.S. lawmakers should be ashamed.\n \n \"We're sending a death warrant to other parts of the world,\" she said. \"Unfortunately now, internationally, it's known that you can get here, buy your guns, buy your large magazines, and you're not going to have any problem\"\n Alleged Norway killer bought ammunition clips from U.S.|Raw Replay\n \n The lax gun laws gun nuts support have deadly consequences for innocent victims in other nations.\n\n &#x202a;Speed loading ammo From SKS stripper clips to AK mag (NEW)&#x202c;&rlm; - YouTube\n \n Mr.Brady watch the video and see what a clip is and what a magazine is.", 
   {
    "unicode_changes_made": true
   }, 
   435925, 
   null, 
   1312157820.0
  ], 
  [
   435990, 
   null, 
   "E Mutz", 
   "&#x202a;Speed loading ammo From SKS stripper clips to AK mag (NEW)&#x202c;&rlm; - YouTube\n \n Mr.Brady watch the video and see what a clip is and what a magazine is.\n\n \n There is a difference?\n \n Maybe that explains why I haven't been able to cancel my subscription to Readers Digest Clip.\n \n Words do mean things.", 
   {}, 
   435984, 
   null, 
   1312161000.0
  ], 
  [
   436000, 
   null, 
   "zsu2357", 
   "There is a difference?\n \n Maybe that explains why I haven't been able to cancel my subscription to Readers Digest Clip.\n \n Words do mean things.\n\n \n Amazon.com: Pokemon Evolvers Clip Strip (9781575845227): Reader's Digest Children's Books: Books\n \n Maybe they thought you meant revolver clip? lol.emoticon_xhoho", 
   {}, 
   435990, 
   null, 
   1312171560.0
  ], 
  [
   436080, 
   null, 
   "Doc Jones", 
   "What Norway needs is some SENSIBLE gun laws; the kind they gave up after WWI and WWII.\n \n \nWashington, DC --(Ammoland.com)- &#8220;The Storting, the Norwegian Parliament, should repeal immediately that nation&#8217;s restrictive firearms control laws,&#8221;gun law expert John M. Snyder said here today.\n \n \n &#8220;The Norwegian Government should allow law-abiding citizens to acquire, carry and use the guns they need to protect themselves and their loved ones from mass murderers and other violent criminals,&#8221; he added.\n \n Snyder is the Gun Dean here in the United States, according to Human Events.\n \n Snyder noted the Norwegian gun control laws did not prevent the recent mass murder of about 70 civilians near Oslo. However, they did prevent innocent citizens from being able to stop or interrupt the slaughter.\n \n Currently, Norwegians must get a government permit to own a firearm legally and give government officials a reason for wanting the gun. Norwegian policy prevents citizens from acquiring automatic firearms, although the alleged mass murderer used a semiautomatic firearm which reportedly had been converted to a fully automatic firearm.\n \n \n &#8220;The gun laws had no effect at all on preventing the mass murder,&#8221; said Snyder. &#8220;They did prevent anyone from legally stopping or interrupting the killing. It took police an hour and a half to get to the scene of the horror, during which time the murderer picked off the innocent one by one. As The Telegraph of the United Kingdom pointed out, there was &#8216;no one able to stop him.&#8217;\n &#8220;Restrictive gun laws are the products of sheer idiocy. Hopefully, the Norwegian Prime Minister, Jens Stoltenberg, and King Harald will demonstrate they hold dear the right to life of Norwegians. Let them encourage the Storting to free Norway from this oppressive idiocy and allow Norwegians to acquire, carry and use the guns they need to defend life.&#8221;\n \n John M. Snyder\n Manager\n Telum Associates, LLC\n Arlington, VA\n \n", 
   {}, 
   436000, 
   null, 
   1312292580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  At least 80 dead in mass shooting at youth camp", 
  "url": "http://www.4forums.com/political/gun-control-debates/15514-least-80-dead-mass-shooting-youth-camp.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 15514, 
  "discussion_files": [
   [
    "220.html", 
    "http://www.4forums.com/political/gun-control-debates/15514-least-80-dead-mass-shooting-youth-camp-print.html"
   ], 
   [
    "221.html", 
    "http://www.4forums.com/political/gun-control-debates/15514-least-80-dead-mass-shooting-youth-camp-7-print.html"
   ], 
   [
    "222.html", 
    "http://www.4forums.com/political/gun-control-debates/15514-least-80-dead-mass-shooting-youth-camp-5-print.html"
   ], 
   [
    "223.html", 
    "http://www.4forums.com/political/gun-control-debates/15514-least-80-dead-mass-shooting-youth-camp-4-print.html"
   ], 
   [
    "224.html", 
    "http://www.4forums.com/political/gun-control-debates/15514-least-80-dead-mass-shooting-youth-camp-6-print.html"
   ], 
   [
    "225.html", 
    "http://www.4forums.com/political/gun-control-debates/15514-least-80-dead-mass-shooting-youth-camp-3-print.html"
   ], 
   [
    "226.html", 
    "http://www.4forums.com/political/gun-control-debates/15514-least-80-dead-mass-shooting-youth-camp-2-print.html"
   ]
  ], 
  "identifier": 15514
 }
]