[
 [
  [
   436083, 
   null, 
   "jyoshu", 
   "From Scientific American ....\n \n\"It is admittedly odd to think that a progressive, humanitarian shift in attitudes toward gays and lesbians might lead, ironically, to a noticeable decline in the homosexual population. Yet this is precisely what I predict will happen over the very long course of natural selection should the societal-level normalization of adult homosexual relationships, such as is happening currently with the triumphant legalization of gay marriage in my new home state of New York, continues happily on its way. ....\n \n ....Homosexuality is often presented as an evolutionary &#8220;mystery&#8221; because of the obvious reproductive disadvantages, and thus for decades researchers have sought some adaptive function for the culturally recurrent percentage (anywhere from 1 to 10 percent of the population, depending on the measures used) of the human population that is aroused more by the same than it is by the opposite sex. Yet if we consider the historical, and perhaps even the ancestral, percentage of the homosexual population that did in fact reproduce because of societal proscriptions against adult relations with the same sex, the mystery becomes considerably less profound.\"\n\n \n More at Bering in Mind: The End of Gays: Gay Marriage and the Decline of the Homosexual Population", 
   {
    "post_info": {
     "post_title": "&quot;The End of Gays: Gay Marriage and the Decline of the Homosexual Population&quot;"
    }
   }, 
   null, 
   null, 
   1312298580.0
  ], 
  [
   436089, 
   null, 
   "Ripskar", 
   "Assuming that it is caused by a genetic factor, the study claiming this was debated here previously and I seem to recall the usual suspects denouncing it as being entirely choice, which would render the hypothesis(? not really a scientific paper as such) unsustainable.\n Normalisation didn't seem to make the Greek homosexual population decline either.", 
   {}, 
   436083, 
   null, 
   1312316940.0
  ], 
  [
   436093, 
   null, 
   "Easyrider", 
   "\\The End of Gays: Gay Marriage and the Decline of the Homosexual Population[/url]\n\n \n Good one. Very fitting.\n \n The end of days will bring the end of gays. Gotta love it.", 
   {}, 
   436083, 
   null, 
   1312329120.0
  ], 
  [
   436100, 
   null, 
   "thelmoose", 
   "From Scientific American ....\n \n \n More at Bering in Mind: The End of Gays: Gay Marriage and the Decline of the Homosexual Population\n\n \n You must be googling gay topics 'cause I know you don't read Scientific American.", 
   {}, 
   436083, 
   null, 
   1312340160.0
  ], 
  [
   436109, 
   null, 
   "MrWriteLA", 
   "You must be googling gay topics 'cause I know you don't read Scientific American.\nAlmost. He's googling anti-gay topics.", 
   {}, 
   436100, 
   null, 
   1312347180.0
  ], 
  [
   436121, 
   null, 
   "Matthew S", 
   "Good one. Very fitting.\n \n The end of days will bring the end of gays. Gotta love it.\n\n \n And below would be my hope\n \n &#x202a;Gay Scientists Isolate Christian Gene&#x202c;&rlm; - YouTube", 
   {}, 
   436093, 
   null, 
   1312374180.0
  ], 
  [
   436127, 
   null, 
   "Easyrider", 
   "And below would be my hope\n \n &#x202a;Gay Scientists Isolate Christian Gene&#x202c;&rlm; - YouTube\n\n \n They need to read the Gospels. Christ is Risen, and nothing is going to make that go away.\n \n Come out of Sodom. Come out of Gomorrah. Flee from the coming wrath.", 
   {}, 
   436121, 
   null, 
   1312377120.0
  ], 
  [
   436129, 
   null, 
   "poet", 
   "From Scientific American ....\n \n \n More at Bering in Mind: The End of Gays: Gay Marriage and the Decline of the Homosexual Population\n\n \n LOL. You can't believe everything you read. LOL", 
   {}, 
   436083, 
   null, 
   1312382820.0
  ], 
  [
   436130, 
   null, 
   "poet", 
   "Good one. Very fitting.\n \n The end of days will bring the end of gays. Gotta love it.\n\n \n It will be the end of you.", 
   {}, 
   436093, 
   null, 
   1312382880.0
  ], 
  [
   436132, 
   null, 
   "poet", 
   "They need to read the Gospels. Christ is Risen, and nothing is going to make that go away.\n \n Come out of Sodom. Come out of Gomorrah. Flee from the coming wrath.\n\n \n Sodom and Gommorah was a meteorite strike. You read the Gospels, and look what it's done to and for you. Made you a raving lunatic zealot, who has nothing in common with Christianity.", 
   {}, 
   436127, 
   null, 
   1312383060.0
  ], 
  [
   436133, 
   null, 
   "poet", 
   "You must be googling gay topics 'cause I know you don't read Scientific American.\n\n \n And how do you know what people read? Are you clairvoyant?", 
   {}, 
   436100, 
   null, 
   1312383120.0
  ], 
  [
   436137, 
   null, 
   "jyoshu", 
   "You must be googling gay topics 'cause I know you don't read Scientific American.\n\n \n I read their articles from time to time, as I do many sources.\n And no, I wasn't googling anything. What's more noteworthy is that you chose to ignore the topic in favor of veiled ad hominem.", 
   {}, 
   436100, 
   null, 
   1312383960.0
  ], 
  [
   436141, 
   null, 
   "thelmoose", 
   "I read their articles from time to time, as I do many sources.\n And no, I wasn't googling anything. What's more noteworthy is that you chose to ignore the topic in favor of veiled ad hominem.\n\n \n \n You read SA? Right. You may like the pictures, but the articles use big words. \n \n I don't know what point you were trying to raise, though that has never stopped you from posting. The author's argument is interesting at first blush. Something you might muse about briefly, but it is flawed. \n \n 1. There are lots of reasons that genes hang around in the gene pool and not all are related to the survival of one individual's offspring. \n 2. Gay men and women have offspring from their own loins without the use of a heterosexual relationship. \n 3. Epigenetic phenomena are not considered. \n \n The comments following the article talk about these, but you would have to get through that loooong bunch of science-y words to get waaaay down to the bottom of the page. And that would be hard on your brain.", 
   {}, 
   436137, 
   null, 
   1312386060.0
  ], 
  [
   436146, 
   null, 
   "Freedom", 
   "Almost. He's googling anti-gay topics.\n\n Do you ever have anything meaningful to say?\n \n \nYou read SA? Right. You may like the pictures, but the articles use big words. \n\n The ad hominems just make you look foolish.\n \n \n1. There are lots of reasons that genes hang around in the gene pool and not all are related to the survival of one individual's offspring. \n\n Like?\n \n \n2. Gay men and women have offspring from their own loins without the use of a heterosexual relationship. \n\n Not without heterosexual reproduction I assure you. Medical techniques would not have effected most of our history.\n \n \n3. Epigenetic phenomena are not considered. \n\n No they aren't, one would have to identify the genes responsible (if they exist in that sense); have you?", 
   {}, 
   436141, 
   null, 
   1312390020.0
  ], 
  [
   436151, 
   null, 
   "Accipiter", 
   "One of the comments below the article sums it up nicely:\n \n \nI know this is a blog and not a research paper, but in my opinion it is way too speculative.\n", 
   {}, 
   436146, 
   null, 
   1312395720.0
  ], 
  [
   436154, 
   null, 
   "jyoshu", 
   "The ad hominems just make you look foolish.\n\n \n Aren't these two fellas endearing? Such warm examples for their pride movement! Just makes one wanna wave a rainbow flag, huh? emoticon_xangel\n \n \nNot without heterosexual reproduction I assure you. Medical techniques would not have effected most of our history.\n\n \n Well, regardless the genes would still be passed on. It stands to reason to me that medical technologies would only make them that much more able to pass on supposed gay genes, not less. Gays will only be more and more able to 'get around' having to engage in any normal biological baby-making relationship. I just think the article was interesting. I don't really agree with it, frankly.", 
   {}, 
   436146, 
   null, 
   1312398480.0
  ], 
  [
   436178, 
   null, 
   "Freedom", 
   "One of the comments below the article sums it up nicely:\n\n In other words it's a typical evolution story.\n \n \nAren't these two fellas endearing? Such warm examples for their pride movement! Just makes one wanna wave a rainbow flag, huh? emoticon_xangel\n\n I don't know what movement they ascribe to, but I certainly find the dismissive insults offensive to my purpose for signing up.\n \n \nWell, regardless the genes would still be passed on.\n\n Only if you had kids. It's hardly a selective force for a trait if you have to contradict it to pass it on, and I doubt many persons of the opposite sex would go 'oh OK' to 'I am not attracted to you I just need your gametes so that there can be more homosexuals in the world'. Observe of course that we have not have sperm banks for the vast majority of our history.\n \n Therefore the statement that homosexuals can reproduce without heterosexual relationships is simply absurd. It presumes that the relationship in which one has sex with the other sex until a child is produced is not heterosexual.\n \n \nIt stands to reason to me that medical technologies would only make them that much more able to pass on supposed gay genes, not less.\n\n That's true, but that couldn't really effect numbers right now.\n \n Now that homosexuals aren't repressing themselves and acting like heterosexuals their reproduction overall will go down unless some serious medical advances are made.\n \n This is not taking into account the possible selection for female variants of the genes.", 
   {}, 
   436154, 
   null, 
   1312411800.0
  ], 
  [
   436183, 
   null, 
   "jyoshu", 
   "Therefore the statement that homosexuals can reproduce without heterosexual relationships is simply absurd.\n\n \n Oh I agree; though no 'relationship' is needed. (A woman could use a donation from a sperm bank, for instance.) The bottom line here really though, is that gays can never have children without either a.) doing things in a heterosexual way or b.) going-around what's normative by using technology to assist. \n \n \nNow that homosexuals aren't repressing themselves and acting like heterosexuals their reproduction overall will go down unless some serious medical advances are made.\n\n \n Sounds like you agree with the author or the article.", 
   {}, 
   436178, 
   null, 
   1312421160.0
  ], 
  [
   436184, 
   null, 
   "Easyrider", 
   "Sodom and Gommorah was a meteorite strike. You read the Gospels, and look what it's done to and for you. Made you a raving lunatic zealot, who has nothing in common with Christianity.\n\n \n You're nuts. You gays will say anything to try to justify your sin. God is not fooled.", 
   {}, 
   436132, 
   null, 
   1312421340.0
  ], 
  [
   436187, 
   null, 
   "Freedom", 
   "\n Sounds like you agree with the author or the article.\n\n I agree that less homosexuals are pretending to be heterosexual and therefore having kids. I disagree on a more fundamental level, that homosexuality is primarily an inherited genetic trait. That last is not a solid position but just a working model. It's maddeningly impossible to collect data on the subject, and those who are in an excellent position to report are so paranoid about homophobes they refuse to treat the matter objectively.", 
   {}, 
   436183, 
   null, 
   1312422420.0
  ], 
  [
   436193, 
   null, 
   "Accipiter", 
   "Breakthrough raises possibility of genetic children for same-sex couples", 
   {}, 
   436187, 
   null, 
   1312440000.0
  ], 
  [
   436197, 
   null, 
   "Freedom", 
   "Breakthrough raises possibility of genetic children for same-sex couples\n\n Still going to need those borg incubation chambers, and I don't see how they are supposed to get their hands on an XO for a human without a fetus from one person.", 
   {}, 
   436193, 
   null, 
   1312442700.0
  ], 
  [
   436200, 
   null, 
   "Matthew S", 
   "Still going to need those borg incubation chambers, and I don't see how they are supposed to get their hands on an XO for a human without a fetus from one person.\n\n \n Any male can carry a child ectopically under his abdominal wall. As research continues adult stem cells may one day be used.", 
   {}, 
   436197, 
   null, 
   1312457760.0
  ], 
  [
   436201, 
   null, 
   "Matthew S", 
   "They need to read the Gospels. Christ is Risen, and nothing is going to make that go away.\n \n Come out of Sodom. Come out of Gomorrah. Flee from the coming wrath.\n\n \n Do we have to go through this again?", 
   {}, 
   436127, 
   null, 
   1312457940.0
  ], 
  [
   436204, 
   null, 
   "gansao", 
   "I thought homosexuals reproduced through turkey baster sex with a friendly lesbian:)", 
   {}, 
   436201, 
   null, 
   1312462140.0
  ], 
  [
   436208, 
   null, 
   "MrWriteLA", 
   "Do we have to go through this again?\n\"EZ want a cracker?\"", 
   {}, 
   436201, 
   null, 
   1312468560.0
  ], 
  [
   436217, 
   null, 
   "Freedom", 
   "Any male can carry a child ectopically under his abdominal wall. As research continues adult stem cells may one day be used.\n\n I see you haven't thought about it much. It would be a medical monument to build an artificial womb; but to build one out of tissue... it's science fiction.", 
   {}, 
   436200, 
   null, 
   1312474140.0
  ], 
  [
   436234, 
   null, 
   "pappillion001", 
   "Breakthrough raises possibility of genetic children for same-sex couples\n\n \n This has bad idea written all over it. The female body physically and chemically is designed for reproduction. There is still soooo much we don't know about the steps and reactions that occur during human formation and then the long term genetic repercussions. \n \n Make it so they can only give birth naturally and see how many volunteers there are.", 
   {}, 
   436193, 
   null, 
   1312497060.0
  ], 
  [
   436237, 
   null, 
   "Accipiter", 
   "This has bad idea written all over it. The female body physically and chemically is designed for reproduction. There is still soooo much we don't know about the steps and reactions that occur during human formation and then the long term genetic repercussions. \n \n Make it so they can only give birth naturally and see how many volunteers there are.\n\n \n Not saying it's something that anyone should plan on doing at this point but it is a real possibility in the near future.\n \n Men giving birth is not going to happen soon but who knows where technology will take us given enough time.", 
   {}, 
   436234, 
   null, 
   1312498140.0
  ], 
  [
   436240, 
   null, 
   "Freedom", 
   "Not saying it's something that anyone should plan on doing at this point but it is a real possibility in the near future.\n \n Men giving birth is not going to happen soon but who knows where technology will take us given enough time.\n\n Any biotech even half of the way to making men capable of pregnancy will be able to make a machine that is safer and less stressful than that.", 
   {}, 
   436237, 
   null, 
   1312499640.0
  ], 
  [
   436246, 
   null, 
   "jyoshu", 
   "I see you haven't thought about it much. It would be a medical monument to build an artificial womb; but to build one out of tissue... it's science fiction.\n\n \n Anything to get around doing things the normative way ... emoticon_xdonno", 
   {}, 
   436217, 
   null, 
   1312511160.0
  ], 
  [
   436247, 
   null, 
   "Accipiter", 
   "Any biotech even half of the way to making men capable of pregnancy will be able to make a machine that is safer and less stressful than that.\n\n \n I don't disagree but what if a man wants to experience pregnancy?\n \n It sounds far-fetched but who knows what technology will be capable of in a hundred years or more.", 
   {}, 
   436240, 
   null, 
   1312512900.0
  ], 
  [
   436248, 
   null, 
   "Easyrider", 
   "I don't disagree but what if a man wants to experience pregnancy?\n \n\n \n Then he flys into la la land on a pig to have Al Gore explain how it's done in liberal America.\n \n I think you've od'd on left-wing Kool Aid again, piter-baby. Take a break.", 
   {}, 
   436247, 
   null, 
   1312514220.0
  ], 
  [
   436250, 
   null, 
   "Freedom", 
   "I don't disagree but what if a man wants to experience pregnancy?\n \n It sounds far-fetched but who knows what technology will be capable of in a hundred years or more.\n\n They can't experience pregnancy they are always going to miss the hormonal patterns that women have. Their bodies are not designed to be pregnant and even if it was made technically possible it will almost certainly be the worst option in terms of comfort, and safety for both father and child. \n \n It's bringing a hammer to a screwdriver's job. It might even be easier to alter gene expression to bring about partial sex change (that doesn't sound hopeful either). That won't do though because then the partner wouldn't be attracted to the more woman than man person.\n \n Seriously think about this.\n \n People call many things 'sci-fi', but not all imagined future technologies are the same.\n \n There are technologies which we haven't really pursued but given enough resources we could, there are technologies whose concepts have been proven but for any reason we do not have the precision or infrastructure to do. Then there are sci-fi ideas that are based on no sane possibilities whatever. This is one of those.\n \n We have no reason to believe that we can engineer a new organ safe enough to justify trying to incubate a baby in INSIDE A MAN. This isn't just some generic human part, you can't use a womb or womb DNA because that undoubtedly relies on female control systems.\n \n Of course I am not going to rule anything out, nobody should do that given the track record of skeptics on what humanity can accomplish; but I am cataloging this one with faster than light travel and telepathy.", 
   {}, 
   436247, 
   null, 
   1312515660.0
  ], 
  [
   436252, 
   null, 
   "Matthew S", 
   "Men giving birth is not going to happen soon but who knows where technology will take us given enough time.\n\n \n It is possible now. I could have a fertilized egg implanted in my abdomen and the placenta would form. women have been having these types of pregnancies for millennia.\n \n It would be extremely dangerous since there is no predicting what vital organ the placenta would attach too, but it is totally possible for a male to carry a baby.", 
   {}, 
   436237, 
   null, 
   1312515840.0
  ], 
  [
   436254, 
   null, 
   "thelmoose", 
   "It is possible now. I could have a fertilized egg implanted in my abdomen and the placenta would form. women have been having these types of pregnancies for millennia.\n \n It would be extremely dangerous since there is no predicting what vital organ the placenta would attach too, but it is totally possible for a male to carry a baby.\n\n \n Oh dear. \n Women have been doing it as they have this thing called a uterus. You do not. You aren't joking are you? If not, you need to read up.", 
   {}, 
   436252, 
   null, 
   1312516260.0
  ], 
  [
   436256, 
   null, 
   "Freedom", 
   "It is possible now. I could have a fertilized egg implanted in my abdomen and the placenta would form. women have been having these types of pregnancies for millennia.\n \n It would be extremely dangerous since there is no predicting what vital organ the placenta would attach too, but it is totally possible for a male to carry a baby.\n\n Lol is this poet's school of medicine, where HIV is race war weapon and zygotes are startrek aliens which will infect crewmen?", 
   {}, 
   436252, 
   null, 
   1312521900.0
  ], 
  [
   436257, 
   null, 
   "pappillion001", 
   "It is possible now. I could have a fertilized egg implanted in my abdomen and the placenta would form. women have been having these types of pregnancies for millennia.\n \n It would be extremely dangerous since there is no predicting what vital organ the placenta would attach too, but it is totally possible for a male to carry a baby.\n\n \n Many things are possible, sometimes the question is not could I or should I but why would I want to?\n \n Have you seen what is involved?", 
   {}, 
   436252, 
   null, 
   1312528500.0
  ], 
  [
   436259, 
   null, 
   "Matthew S", 
   "Lol is this poet's school of medicine, where HIV is race war weapon and zygotes are startrek aliens which will infect crewmen?\n\n \n \nOh dear. \n Women have been doing it as they have this thing called a uterus. You do not. You aren't joking are you? If not, you need to read up.\n\n \n The placenta is a feature of fetus not the uterus, so all it needs is a place to hook up to a blood supply. \n \n \n Ectopic Pregnancy\n \n \nThe egg can also implant in the ovary, abdomen, or the cervix, so you may see these referred to as cervical or abdominal pregnancies.\n\n \n I never said it was wise or advisable for a man to do this just that it is possible.", 
   {}, 
   436256, 
   null, 
   1312547580.0
  ], 
  [
   436260, 
   null, 
   "Matthew S", 
   "Many things are possible, sometimes the question is not could I or should I but why would I want to?\n \n Have you seen what is involved?\n\n \n To shut the anti gay christianists up over weather two men can have a baby that is geneticly related to both and carried by one of them.", 
   {}, 
   436257, 
   null, 
   1312547700.0
  ], 
  [
   436267, 
   null, 
   "Provocateaur", 
   "Here are some interesting theories from Richard Dawkins:\n \n &#x202a;Richard Dawkins explains how the gay gene was preserved&#x202c;&rlm; - YouTube", 
   {}, 
   436240, 
   null, 
   1312555440.0
  ], 
  [
   436268, 
   null, 
   "Provocateaur", 
   "Anything to get around doing things the normative way ... emoticon_xdonno\n\n \n The norm isn't necessarily better.", 
   {}, 
   436246, 
   null, 
   1312555740.0
  ], 
  [
   436269, 
   null, 
   "Provocateaur", 
   "I see you haven't thought about it much. It would be a medical monument to build an artificial womb; but to build one out of tissue... it's science fiction.\n\n \n I'm not sure what you're really getting at here. It doesn't have to be artificial:\n \n \n \n \nSo is male pregnancy possible? Probably yes.\n \n Is male pregnancy safe? No, not at the present time. But at some point in the future, it's likely that reproductive biologists will figure out how to direct the growth of the placenta away from vulnerable abdominal organs and onto an easily detachable, but blood-rich, surface for growth. And then, pregnancy will be possible for men who are 100% men, although it's certainly not something that I would want to do.\n\n \n Can A Man Really Get Pregnant? Sure, But It Might Kill Him", 
   {
    "unicode_changes_made": true
   }, 
   436217, 
   null, 
   1312556820.0
  ], 
  [
   436271, 
   null, 
   "gansao", 
   "The only 'man' ever to become pregnant was not a man at all.\n A fetus inside a man would push out his internal organs,would probably die along with its 'mum/dad'.\n The man would have to given huge amounts of female hormones too.\n So a man having a baby is so remote and dangerous that its not worth contemplating.\n More BS from the 4forum gay revolutionary front:)", 
   {}, 
   436269, 
   null, 
   1312558560.0
  ], 
  [
   436272, 
   null, 
   "pappillion001", 
   "To shut the anti gay christianists up over weather two men can have a baby that is geneticly related to both and carried by one of them.\n\n \n Sadly, we both know that it would do just the opposite. I don't know what you could do to upset their idea of what is natural more than this. \n \n This is the kind of thing that without a major shift in culture would bring back witch hunts. \n \n For me this is an area of science that needs to remain unknown. This isn't surgically altering your outside physical appearance or even \"hot wiring\" a system already designed for such a purpose. This is man playing God and he is nowhere near capable of doing such a thing.", 
   {}, 
   436260, 
   null, 
   1312560300.0
  ], 
  [
   436274, 
   null, 
   "Provocateaur", 
   "The person who wrote the article isn't taking into account gene penetrance. Straight people may be carrying the gay gene, but it doesn't penetrate:\n \n (scroll down when you bring up the link)\n What causes sexual orientation?\n \n Well, gansao the scientist I quoted, seems to think it could be placed away from the \"vulnerable organs\". He seems to think it's entirely plausible that there could be a safe way for it to occur in the future. He's not from some \"gay revolutinary front(whatever that means)\" from as far as I know. It's clearly not just gays who are discussing this possibility. I'm not sure about needing female hormones. I haven't seen anything to that effect, but I could be wrong on that last point.\n \n According to the Bible, God artificially inseminated a surrogate to get his child in an \"\"ïmmacualte conception\". God is also said to be supernatural, meaning he wouldn't be \"natural\" or the \"norm\". The conservative Christinans here seem to imply that not being the norm or natural is bad. This would make God, bad.", 
   {}, 
   436271, 
   null, 
   1312560840.0
  ], 
  [
   436275, 
   null, 
   "poet", 
   "You're nuts. You gays will say anything to try to justify your sin. God is not fooled.\n\n \n And you won't? Nobody is attempting to justify sin. Adultery is sin. Promiscuity is sinful. Romantic love between two consenting adults is not sinful. And you can't speak for God. It's a sin to do so.", 
   {}, 
   436184, 
   null, 
   1312560840.0
  ], 
  [
   436278, 
   null, 
   "Freedom", 
   "The norm isn't necessarily better.\n\n In this case it is.\n \n This is like trying to sail with a brick because you have pride issues with mineral deposits.\n \n \nI'm not sure what you're really getting at here. It doesn't have to be artificial:\n \n\n Of course it has to be artificial. Men don't have uteruses or the female control systems to run them.\n \n You are talking about genetic engineering of a novel human tissue and nothing less.\n \n The simple absurdity of assuming the uterus is around just for the hec of it...\n \n Every birth would be a surgery, how would the proper fluid form in the open body?\n \n This is a thousand times more dangerous, especially to the child, than doing it the proper (not normal) way. Whats the difference between proper and normal?\n \n proper - adapted or appropriate to the purpose or circumstances; fit; suitable\n \n normal - conforming to the standard or the common type; usual; not abnormal; regular; natural. \n \n I'll watch that video is a bit.", 
   {}, 
   436271, 
   null, 
   1312561560.0
  ], 
  [
   436280, 
   null, 
   "gansao", 
   "The person who wrote the article isn't taking into account gene penetrance. Straight people may be carrying the gay gene, but it doesn't penetrate:\n \n (scroll down when you bring up the link)\n What causes sexual orientation?\n \n Well, gansao the scientist I quoted, seems to think it could be placed away from the \"vulnerable organs\". He seems to think it's entirely plausible that there could be a safe way for it to occur in the future. He's not from some \"gay revolutinary front(whatever that means)\" from as far as I know. It's clearly not just gays who are discussing this possibility. I'm not sure about needing female hormones. I haven't seen anything to that effect, but I could be wrong on that last point.\n \n According to the Bible, God artificially inseminated a surrogate to get his child in an \"\"ïmmacualte conception\". God is also said to be supernatural, meaning he wouldn't be \"natural\" or the \"norm\". The conservative Christinans here seem to imply that not being the norm or natural is bad. This would make God, bad.\n\n \n I read that a man would need female hormones in another site.Can a Man Have a Baby?\n \n This one will do..its a bit obvious anyway seeing as the ' man' who was pregnant was a trangender woman who had to stop its male hormone treatment\n \n As for the 'scientist' that seemed to think a fetus could be placed away from vulnerable organs...where did this ' scientist' actually say where it would be?\n I would imagine that this ' scientist' would have a reasonable knowledge anatomy and physiology being a 'scientist' and all so I am surprised he didnt give you a clue.\n I believe it was a 'scientist' that persuaded some people to give him money so that they could be frozen after death and be revived ' in the future'.\n He was full of xxxx too.\n What I find comical is that some gays on this forum can actually support this cobblers then howl in derision at a thread that purports that homosexuals can be cured", 
   {}, 
   436274, 
   null, 
   1312565400.0
  ], 
  [
   436281, 
   null, 
   "gansao", 
   "And you won't? Nobody is attempting to justify sin. Adultery is sin. Promiscuity is sinful. Romantic love between two consenting adults is not sinful. And you can't speak for God. It's a sin to do so.\n\n \n Romantic loves is fine sweetplums. Its when you get passed the chocolates and flowers that it gets sinful.lol", 
   {}, 
   436275, 
   null, 
   1312565520.0
  ], 
  [
   436283, 
   null, 
   "Accipiter", 
   "In this case it is.\n \n This is like trying to sail with a brick because you have pride issues with mineral deposits.\n \n \n Of course it has to be artificial. Men don't have uteruses or the female control systems to run them.\n \n You are talking about genetic engineering of a novel human tissue and nothing less.\n \n The simple absurdity of assuming the uterus is around just for the hec of it...\n \n Every birth would be a surgery, how would the proper fluid form in the open body?\n \n This is a thousand times more dangerous, especially to the child, than doing it the proper (not normal) way. Whats the difference between proper and normal?\n \n proper - adapted or appropriate to the purpose or circumstances; fit; suitable\n \n normal - conforming to the standard or the common type; usual; not abnormal; regular; natural. \n \n I'll watch that video is a bit.\n\n \n All this only works if technology remains stagnant, one day it could be perfectly safe for a man to be pregnant.", 
   {}, 
   436278, 
   null, 
   1312588380.0
  ], 
  [
   436284, 
   null, 
   "Provocateaur", 
   "Pregnancy outside the uterus is possible:\n Possibility of Male Pregnancy - from Ronnie Falcão's Midwife Archives\n \n The fetus could feed on a bowel. It would seem more dangerous, at least with our present level of know-how.", 
   {}, 
   436283, 
   null, 
   1312591020.0
  ], 
  [
   436285, 
   null, 
   "poet", 
   "Romantic loves is fine sweetplums. Its when you get passed the chocolates and flowers that it gets sinful.lol\n\n \n You'll have to explain that, because I don't understand. I'm suspecting your premise is from \"holier-than-thou\", but I'll let you clarify. You can't be pointing fingers if your hands are unclean.", 
   {}, 
   436281, 
   null, 
   1312591080.0
  ], 
  [
   436286, 
   null, 
   "Freedom", 
   "All this only works if technology remains stagnant, one day it could be perfectly safe for a man to be pregnant.\n\n One day we might be able to beam the baby out of the womb.", 
   {}, 
   436283, 
   null, 
   1312598340.0
  ], 
  [
   436289, 
   null, 
   "Matthew S", 
   "In this case it is.\n \n \n Of course it has to be artificial. Men don't have uterus's or the female control systems to run them.\n \n .\n\n \n you don't need a uterus to have a baby. Implant a fetus it creates the placenta and the placenta plugs into a blood supply. one could put an egg in ones leg and the placenta would attach to the muscles. so in a way drop a fertilised egg into some nutrient fluid and you have your artificial womb.\n \n What the fetus does is excrete a hormone that stops the women's menstrual cycle from flushing the uterus. I saw a story about a woman that was pregnant with 7 or 8 babies and one of the boys was outside in her abdomen and the placenta had attached to her bladder.", 
   {}, 
   436278, 
   null, 
   1312599420.0
  ], 
  [
   436291, 
   null, 
   "Freedom", 
   "you don't need a uterus to have a baby. Implant a fetus it creates the placenta and the placenta plugs into a blood supply. one could put an egg in ones leg and the placenta would attach to the muscles. so in a way drop a fertilised egg into some nutrient fluid and you have your artificial womb.\n \n What the fetus does is excrete a hormone that stops the women's menstrual cycle from flushing the uterus. I saw a story about a woman that was pregnant with 7 or 8 babies and one of the boys was outside in her abdomen and the placenta had attached to her bladder.\n\n As easy as that huh?\n \n I cannot help the irony of being called impractical because I believe given enough work, dedication, and argument a volitional society could be real. Yet you reduce a pregnancy to 'plug and play' biology and of course it's only christian radicals that stand in the way of you having a baby...", 
   {}, 
   436289, 
   null, 
   1312600140.0
  ], 
  [
   436292, 
   null, 
   "Matthew S", 
   "As easy as that huh?\n \n I cannot help the irony of being called impractical because I believe given enough work, dedication, and argument a volitional society could be real. Yet you reduce a pregnancy to 'plug and play' biology and of course it's only christian radicals that stand in the way of you having a baby...\n\n \n Maybe no one has tried. Pregnancy is pretty much plug and play. Just because there are billions of uteri around does not mean that is the only option available just that it is the easiest.\n \n Here is a run down of the world I imagine, and BTW is not as much a fantasy world as your \"volitional society\"\n \n 1 a stem cell is taken from me. \n 2 the stem cell is then forced to produce an egg\n 3 the egg is then fertilized with my husbands sperm\n 4 The fertilized egg is then implanted in me\n 5 I carry the baby to term\n 6 we produce a child that is biologically related to two men and carried to term by a man.", 
   {}, 
   436291, 
   null, 
   1312601280.0
  ], 
  [
   436297, 
   null, 
   "Freedom", 
   "Maybe no one has tried. Pregnancy is pretty much plug and play. Just because there are billions of uteri around does not mean that is the only option available just that it is the easiest.\n \n Here is a run down of the world I imagine, and BTW is not as much a fantasy world as your \"volitional society\"\n \n 1 a stem cell is taken from me. \n 2 the stem cell is then forced to produce an egg\n 3 the egg is then fertilized with my husbands sperm\n 4 The fertilized egg is then implanted in me\n 5 I carry the baby to term\n 6 we produce a child that is biologically related to two men and carried to term by a man.\n\n Steps 2 and 5 are the problems. You know I am going to enjoy giving you the same effort and quality of response that you gave me on issues of far greater import.", 
   {}, 
   436292, 
   null, 
   1312612320.0
  ], 
  [
   436298, 
   null, 
   "MrWriteLA", 
   "The point IS...which we seem to have gotten completely off... is that the whole thing about you necessarily NEED a couple of male/female gender to produce a parental relational offspring is ferkakta. You don't, at least in the near future. Nobody may WANT to do it that way, but it may be possible. so... so what?\n \n Big friggin deal. Where is it written that two people who love each other and may even want to have a family together need to produce an offspring that's a result of their mutal DNA or else \"no deal\"?\n \n Guess what? I have a son, produced as the result of a heterosexual relationship. He's cool, he's straight, has a girlfriend he's been with for 2 years, who both have a great relationship with me AND with his mom, I'm living in Spokane, in a monogomous relationship with my partner, whom I adore who has a great relationship with my son and my exwife, and we are known and loved by at least THREE straight, CHRISTIAN couples, which whom we go to concerts, plays, and block parties together, and have one terrific existence together, and pea-brained religio-fascist antiChrists like Gansao and Easyrider (by the way, EZ, Peter Fonda and Jack Nicholson are prepping a lawsuit against you for defaming their franchise--did you even SEE that movie, f-head?) can blow it out their collective @sses, cuz I have a great life which I'm enjoying to the max NOW and they'll discover that their supposedly great \"afterlives\" will be nothin but ashes in an urn.", 
   {}, 
   436297, 
   null, 
   1312614780.0
  ], 
  [
   436300, 
   null, 
   "pappillion001", 
   "The point IS...which we seem to have gotten completely off... is that the whole thing about you necessarily NEED a couple of male/female gender to produce a parental relational offspring is ferkakta. You don't, at least in the near future. Nobody may WANT to do it that way, but it may be possible. so... so what?\n \n Big friggin deal. Where is it written that two people who love each other and may even want to have a family together need to produce an offspring that's a result of their mutal DNA or else \"no deal\"?\n \n Guess what? I have a son, produced as the result of a heterosexual relationship. He's cool, he's straight, has a girlfriend he's been with for 2 years, who both have a great relationship with me AND with his mom, I'm living in Spokane, in a monogomous relationship with my partner, whom I adore who has a great relationship with my son and my exwife, and we are known and loved by at least THREE straight, CHRISTIAN couples, which whom we go to concerts, plays, and block parties together, and have one terrific existence together, and pea-brained religio-fascist antiChrists like Gansao and Easyrider (by the way, EZ, Peter Fonda and Jack Nicholson are prepping a lawsuit against you for defaming their franchise--did you even SEE that movie, f-head?) can blow it out their collective @sses, cuz I have a great life which I'm enjoying to the max NOW and they'll discover that their supposedly great \"afterlives\" will be nothin but ashes in an urn.\n\n \n I think it took the gay spin because this is where it popped up. Personally I would have the same reaction if a straight guy wanted to do this. Its like having your brain put into another body. Sure there is an upside, but a lot of downside also.\n \n By arguing this you pretty much concede that gays being unable to reproduce should be a factor in any discussion. By giving value to this as a way to overcome that objection you validate it as an objection needing to be overcome. It isn't, any other time that comes up it gets shot down with the simple example of straights who marry who cannot have children. Now this Sci Fi channel Science gone mad waves this in front of the eyes of gay people and all of sudden The reproduction argument is valid enough to say \"See we could have kids as well\".\n \n This will not suddenly turn their hearts and minds. This will be only one more thing to add to their list. There are much better ways than this to both have children and get the repressed peckernecks to practice some goodwill towards others. \n \n I think we have enough parent-less kids made the old fashion way. Adding to that among the many other reasons there are, makes this in my mind just a bad idea. Your contribution in winning hearts and minds is probably the most effective and far reaching, not that it was part of some long ago planned strategic plan to infiltrate the straights, but look how strong, dignified and respectable your circumstances are and then compare to what this would bring to the table", 
   {}, 
   436298, 
   null, 
   1312616760.0
  ], 
  [
   436303, 
   null, 
   "gansao", 
   "You'll have to explain that, because I don't understand. I'm suspecting your premise is from \"holier-than-thou\", but I'll let you clarify. You can't be pointing fingers if your hands are unclean.\n\n \n Oh dearemoticon_xclown\n What do you call ' romantic love' sweetplums?\n Are you calling gay sex romantic love?\n For a rejected poet laureate you arent too brightemoticon_rolleyes", 
   {}, 
   436285, 
   null, 
   1312630920.0
  ], 
  [
   436304, 
   null, 
   "gansao", 
   "The point IS...which we seem to have gotten completely off... is that the whole thing about you necessarily NEED a couple of male/female gender to produce a parental relational offspring is ferkakta. You don't, at least in the near future. Nobody may WANT to do it that way, but it may be possible. so... so what?\n \n Big friggin deal. Where is it written that two people who love each other and may even want to have a family together need to produce an offspring that's a result of their mutal DNA or else \"no deal\"?\n \n Guess what? I have a son, produced as the result of a heterosexual relationship. He's cool, he's straight, has a girlfriend he's been with for 2 years, who both have a great relationship with me AND with his mom, I'm living in Spokane, in a monogomous relationship with my partner, whom I adore who has a great relationship with my son and my exwife, and we are known and loved by at least THREE straight, CHRISTIAN couples, which whom we go to concerts, plays, and block parties together, and have one terrific existence together, and pea-brained religio-fascist antiChrists like Gansao and Easyrider (by the way, EZ, Peter Fonda and Jack Nicholson are prepping a lawsuit against you for defaming their franchise--did you even SEE that movie, f-head?) can blow it out their collective @sses, cuz I have a great life which I'm enjoying to the max NOW and they'll discover that their supposedly great \"afterlives\" will be nothin but ashes in an urn.\n\n \n Bully for you.Im all for sexual deviants having a happy life.\n As for the man having a baby BS..yes it may mean that eventually a man may be able to be pregnant.\n We may be able to create a human/animal hybid or sew a mans head on a donkey( this may have already been done actually) but what that has to do with gays is beyond me, except to make bitter homosexuals like Matthew and Provo feel better about themselves.", 
   {}, 
   436298, 
   null, 
   1312631520.0
  ], 
  [
   436305, 
   null, 
   "Accipiter", 
   "One day we might be able to beam the baby out of the womb.\n\n \n Comparing male pregnancy to the ability to beam people from one place to another is ridiculous.\n \n Safe male pregnancy is something we could see in 100 years. \n \n Beaming people around if it happens will certainly not happen any time soon, I think it's probably impossible anyway.", 
   {}, 
   436286, 
   null, 
   1312631940.0
  ], 
  [
   436306, 
   null, 
   "gansao", 
   "Maybe no one has tried. Pregnancy is pretty much plug and play. Just because there are billions of uteri around does not mean that is the only option available just that it is the easiest.\n \n Here is a run down of the world I imagine, and BTW is not as much a fantasy world as your \"volitional society\"\n \n 1 a stem cell is taken from me. \n 2 the stem cell is then forced to produce an egg\n 3 the egg is then fertilized with my husbands sperm\n 4 The fertilized egg is then implanted in me\n 5 I carry the baby to term\n 6 we produce a child that is biologically related to two men and carried to term by a man.\n\n \n Just as a matter of interest has steps 1 to 3 actually been achieved and the egg implanted into a woman?", 
   {}, 
   436292, 
   null, 
   1312632060.0
  ], 
  [
   436340, 
   null, 
   "Freedom", 
   "Comparing male pregnancy to the ability to beam people from one place to another is ridiculous.\n \n Safe male pregnancy is something we could see in 100 years. \n \n Beaming people around if it happens will certainly not happen any time soon, I think it's probably impossible anyway.\n\n I could put some effort into responding to this, but I must consider what you would do with my effort? Instead I think something more along the lines of your caliber is in order:\n \n \nRidiculous is what it is as well as impossible, just as utopia is impossible.\n", 
   {}, 
   436305, 
   null, 
   1312682580.0
  ], 
  [
   436350, 
   null, 
   "Accipiter", 
   "I could put some effort into responding to this, but I must consider what you would do with my effort? Instead I think something more along the lines of your caliber is in order:\n\n \n You are ignoring the fact that abdominal pregnancy is not only possible it has actually happened", 
   {}, 
   436340, 
   null, 
   1312693320.0
  ], 
  [
   436397, 
   null, 
   "Freedom", 
   "You are ignoring the fact that abdominal pregnancy is not only possible it has actually happened\n\n And you ignored the fact that voluntary transfers of money is not only possible it actually happens constantly.", 
   {}, 
   436350, 
   null, 
   1312743480.0
  ], 
  [
   436429, 
   null, 
   "Provocateaur", 
   "Bully for you.Im all for sexual deviants having a happy life.\n As for the man having a baby BS..yes it may mean that eventually a man may be able to be pregnant.\n We may be able to create a human/animal hybid or sew a mans head on a donkey( this may have already been done actually) but what that has to do with gays is beyond me, except to make bitter homosexuals like Matthew and Provo feel better about themselves.\n\n \n Lol, what a silly and cheap shot at me personally! How am I coming off as bitter? I didn't express any kind of personal interst in being a pregnant male, nor did I suggest it would be good for the gay community. Your prejudiced, quick to jump to conclusions, condescending attitude, is coming through again. I certainly don't need for men, gay or straight, nor for any woman to be pregnant, to feel good about myself. I wouldn't seek pregnancy for that purpose were it reasonably possible. Who do you think you are, by assuming these negative things about me? Think before you speak, or type, or else you are just being very silly. I'm gay and I already feel quite good about myself. Maybe I'm just too shallow to trade in my great gay abs for stretch marks, and wouldn't want my partner doing so either. That was just a joke.", 
   {
    "post_info": {
     "post_title": "All I did was share some information, OK??!!"
    }
   }, 
   436304, 
   null, 
   1312769340.0
  ], 
  [
   436456, 
   null, 
   "gansao", 
   "Lol, what a silly and cheap shot at me personally! How am I coming off as bitter? I didn't express any kind of personal interst in being a pregnant male, nor did I suggest it would be good for the gay community. Your prejudiced, quick to jump to conclusions, condescending attitude, is coming through again. I certainly don't need for men, gay or straight, nor for any woman to be pregnant, to feel good about myself. I wouldn't seek pregnancy for that purpose were it reasonably possible. Who do you think you are, by assuming these negative things about me? Think before you speak, or type, or else you are just being very silly. I'm gay and I already feel quite good about myself. Maybe I'm just too shallow to trade in my great gay abs for stretch marks, and wouldn't want my partner doing so either. That was just a joke.\n\n \n Well if you werent bitter then you seem quite bitter now:)\n \n \n I cant be condesending to clowns by laughing at them.", 
   {}, 
   436429, 
   null, 
   1312806960.0
  ], 
  [
   436612, 
   null, 
   "poet", 
   "Well if you werent bitter then you seem quite bitter now:)\n \n \n I cant be condesending  to clowns by laughing at them.\n\n \n I equate incorrect spelling and the omission of an apostrophe with a lack of intelligence. I'm just sayin'.", 
   {}, 
   436456, 
   null, 
   1313023860.0
  ], 
  [
   436613, 
   null, 
   "poet", 
   "Oh dearemoticon_xclown\n What do you call ' romantic love' sweetplums?\n Are you calling gay sex romantic love?\n For a rejected poet laureate you arent too brightemoticon_rolleyes\n\n \n Uh, there is love minus sex, and sex minus love. What are you calling it?\n Are you simply jealous because you lack writing skills and no one has considered you for anything outside of menial labor? LOL.", 
   {}, 
   436303, 
   null, 
   1313024040.0
  ], 
  [
   436615, 
   null, 
   "Freedom", 
   "Uh, there is love minus sex, and sex minus love. What are you calling it?\n Are you simply jealous because you lack writing skills and no one has considered you for anything outside of menial labor? LOL.\n\n Are you jealous because they won't let you out of the institution while gansao get's to run all over the place?", 
   {}, 
   436613, 
   null, 
   1313024280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  \"The End of Gays: Gay Marriage and the Decline of the Homosexual Population\"", 
  "url": "http://www.4forums.com/political/gay-rights-debates/15552-end-gays-gay-marriage-decline-homosexual-population.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 15552, 
  "discussion_files": [
   [
    "64.html", 
    "http://www.4forums.com/political/gay-rights-debates/15552-end-gays-gay-marriage-decline-homosexual-population-print.html"
   ], 
   [
    "65.html", 
    "http://www.4forums.com/political/gay-rights-debates/15552-end-gays-gay-marriage-decline-homosexual-population-5-print.html"
   ], 
   [
    "66.html", 
    "http://www.4forums.com/political/gay-rights-debates/15552-end-gays-gay-marriage-decline-homosexual-population-4-print.html"
   ], 
   [
    "67.html", 
    "http://www.4forums.com/political/gay-rights-debates/15552-end-gays-gay-marriage-decline-homosexual-population-3-print.html"
   ], 
   [
    "68.html", 
    "http://www.4forums.com/political/gay-rights-debates/15552-end-gays-gay-marriage-decline-homosexual-population-2-print.html"
   ]
  ], 
  "identifier": 15552
 }
]