[
 [
  [
   31432, 
   null, 
   "David2004", 
   "Peace Reform Initiative in the Middle East\n \n The first step to the Road Map to Peace is for the State of Israel to start to remove the Jewish Settlers from the West Bank and Gaza Strip. With International peace keeping forces helping the Palestinian people establish the Rule of Law. The words of both sides have to be match by their deeds and actions as we move toward implementing the Peace Plan. One of the major problems of the Oslo Accords was what was being said at the negotiating table did not reflect the actions on the streets. During the Oslo Accords the size of the Israeli settlements in the West Bank and Gaza Strip nearly doubled. The mantra of both side has to change as it does the extremist on both side will become inflamed. \n The State of Israel and the United States have to come to terms with the United Nations and the global community of nations. Realizing the only way the Road Map to Peace has a chance is on a multi-lateral platform. It is the make up of this platform that has to be decided and implemented. With NATO, United Nations, Arab Legion of Nations, Israel, and the United States developing a plan of action. With Egypt and Jordan having diplomatic connections with Israel they should be the founding members with this new group (MEP) with the United States being a supporting member. \n A new organization (MEP) Middle East Peace will be established from nations in the Middle East and the global community that are committed to peace and coexistences among their neighbors. The primary focus of the MEP will be network with other international organizations on implementing a regional master plan. The make up of the MEP board will be 1/3 Israeli, 1/3 Palestinian, and 1/3 International with half of them being Americans. Some of the same people that are on the Commission of the Old City of Jerusalem will also work for MEP. \n All of the member nations of MEP agree to normalize relations with the State of Israel as a non-occupying country living within International Laws and regional treaties. Israel will normalize relations with the members of MEP. MEP will be the platform for regional issues and areas of disagreements between MEP members. The Primary Members will be counties from the Middle East Region and Supporting Members will be other nation from outside the Middle East region. \n The Israeli government will agree to the following conditions with the United States guarantying the State of Israel security within their international recognized boarders. \n \n · The Israelis will demilitarize their society and live within the conditions of the Middle East Non-Nuclear Proliferation Treaty.\n \n · Israel will follow the guide lines (MEP) Middle East Peace\n \n · The Israeli settlers must move back to Israel proper or apply for a Settlement Stay that will be consider on individual cases.\n \n · The Jewish people migration to Israel will be limited to the number of Palestinian people Right to Return. In both cases the applicant will have to go before a review board. \n \n · The State of Israel will agree to recognize the Old City of Jerusalem as an International City for the foreseeable future. \n \n · Israel will revise their Property Laws and zoning within the State of Israel including the un-recognized Palestinian Villages.\n \n · The State of Israel will help in the re-construction of the infrastructure Palestinian State.\n \n · The State of Israel will leave the de-populated Israeli Settlements in tack as part of their contribution. \n \n The Palestinian Right to Return must be changed to Privilege to Return with two different ways. The first will be the privilege to return to the State of Palestine and the second will be the privilege to the State of Israel. In each case the applicant must apply for citizenship and go before one of two boards for approval. The Palestinian Board of Return and the Israeli Board of Return will be similar in make up with two Palestinian members and two Israeli members and one international member. The Boards will review the applicant?s application taking into consideration of the reason one wants to return. If an applicant is denied they have the right to go before the Board of Appeal that will review the case. \n \n There should be a moratorium place on the migration of Jewish people migrating to the State Israel until the resettlement of the Jewish Settlers from the West Bank, Gaza Strip and the settlements surrounding Jerusalem. When the moratorium is lifted then the Jewish people who were born in Israel and those who have first families move to the top of the list. Those who have citizenship to Palestine and Israel that are abroad will not be effected by the moratorium. Once the moratorium is lifted the number of new Jewish emigrates to the State of Israel will be determined by the formula to keep all in balance. Stabilizing the population in Israel and Palestine is very important because of the lack of fresh water in the region as well as developing a peaceful two state solution. \n \n The case why the Old City of Jerusalem should be an International City as outline in the United Nation Security Council Resolution 181of 1948 is clearer than ever before. Resolution 181 was the first step the international community of nations took towards the two state solution between the Moslems and Jewish people. Going on the premise ?What is right for one side should be for the other side too?. For one side to control the religious sites of the other would be unfair and wrong. With the recent actions of both sides and the current level of tension between the people it has become quite apparent that only with international intervention that is fair and neutral can peace and security have a chance. An international commission 1/3 Jewish, 1/3 Muslim, 1/3 Christen, with a 50% local people and 50% people from outside the region should be set up to run the Old City of Jerusalem. \n \n The Old City of Jerusalem Charter should be established and approve by the commission. This Charter should include some of the following; \n \n · The Old City of Jerusalem will be a weapon free zone.\n \n · All faiths will be able to practice their religion?s believes as long as it does not cause harm to others or themselves. \n \n \n · The politics of the Old City of Jerusalem will remain neutral between the State of Israel and the State of Palestine.\n \n · The Israeli government and Palestinian government will have representatives part of the International Old City of Jerusalem.\n \n \n The Jewish Settlements surrounding Jerusalem will be divided between the State of Israel and the Old City of Jerusalem. The former Jewish Settlements of Jerusalem that become part of the Old City of Jerusalem will have a different charter than the rest. Most of the Jewish Settlers will have to move back to the State of Israel. With 25% of the Jewish people staying, willing to live under the new coming conditions, with the Housing Boards approval. 25% of the housing will be opened to Palestinians who apply to the Housing Boards and get approved. For the foreseeable future the other 50% will be Internationalists that are part of the team to bring peace to the region. The Housing Board will be made up of three internationalists, one Israeli and one Palestinian. All may retain their respective country?s citizenship. \n \n The Israeli government will be responsible for the removal of the Jewish Settlers from Palestine and the Old City of Jerusalem. The Israeli government will establish new settlements within Israel for the settlers to relocate. The Jewish Settlers who cooperate in the re-settlement will have first priority in new housing and reimbursements. The Jewish Settlers that fight the changing times and ways will be handled by Israeli authorities until the agreed upon deadline. The State of Israel will be reasonable for any of the damages to the settlements until they are turned over to the International Forces. \n \n An International base for Peace Keeping Forces needs to be set up in East Jerusalem with the main base adjacent outside the city. The Old City of Jerusalem and East Jerusalem will become an International zone (weapon free) under international control. An airport under the control by the international forces will be setup for the humanitarian aid and workers that are needed. The international peacekeepers will then setup other bases throughout the West bank to help in creating safety zones for the international relief workers. The Israeli government will remain in control of their pre 1967 borders. The International forces will take over control of the Israel military post in the Golan Heights as well as the territory of the West Bank and the Gaza Strip. Any intelligence that the Israeli Government get or have on criminal activities of any Palestinians will be acted on by a special elite international forces. \n \n An international court has to be set up for the prosecution of personal non-criminal matters on both sides. Creating a platform to resolve disputes among the people on the different sides. The Israelis will need to set up a court to compensate the Israel settles that do no want to live in a Palestinian state under their laws. The Israeli Settles in the West Bank and Gaza Strip that do not recognized the new State of Palestine will be forcibly removed by the Israeli Government under the observation of the international monitors.\n \n The international force will monitor the governments on both sides to make sure they live within the treaties and resolutions of the global community. There will be a need for all side to change and compromise before there will be a long lasting peace between the two sides.\n \n There is much work, help and aid that is needed to help the Palestinian people rebuild their society. The International Charity will coordinate their aid threw the United Nation with some of the governments of the world assisting with transportation and logistics. \n \n Realizing than no final plan will be fare to all people but it must be fair to both greater societies as a whole. What is fair for one side should be for the other side as well. Logic and common sense have not been heard only a repeating of the same old rhetoric by the extremists on both sides. The conditions and circumstances combined with the religious indoctrination on both sides are what make it such a volatile situation silencing the voice of the moderates. There are no solutions that will right the wrongs of the past, only the possibility of changing the wrongs of today creating a chance for a better tomorrow for future generations to come. -David", 
   {
    "post_info": {
     "post_title": "First step to the Road Map to Peace i"
    }
   }, 
   null, 
   null, 
   1074224220.0
  ], 
  [
   31433, 
   null, 
   "SilentPoet", 
   "The first step to the Road Map to Peace is for the State of Israel to start to remove the Jewish Settlers from the West Bank and Gaza Strip. \n \n \n The first step is to for terrorists to be stopped by the Palestinian Authority. No progress twoards peace will occur when terrorists are killing men, women and children.", 
   {}, 
   31432, 
   null, 
   1074226080.0
  ], 
  [
   31462, 
   null, 
   "daewoo", 
   "I think it is interesting that after Israel has done everything it can to discredit the palestenian authority among the palestenian people that they now expect the palestenian authority (whose credibilty and power has been completely destroyed) to stop the bombings. \n \n At one point it might have been possible for the palestenian authority to stop the bombings. That time has long passed. The only way that the roadmap to peace will work is if Israel is forced to comply.", 
   {}, 
   31433, 
   null, 
   1074256560.0
  ], 
  [
   31707, 
   null, 
   "treat2", 
   "\n ...\n The State of Israel will help in the re-construction of the infrastructure Palestinian State.\n ...\n The State of Israel will leave the de-populated Israeli Settlements in tack as part of their contribution. \n ...\n \n\n \n To say that there are a certain specific # of problems with any proposed or exising peace plan is to oversimplify the situation, and as I don't have the time to cite every possible problem, nor think that approach is the best, I will say the following...\n \n I believe in a 1 State solution for Israel, the Palestinians, and the Israeli-Arabs. And aside from what I've mentioned in my threads above and below this thread, I'm not going to propose very much more details on how to do it,\n as I would prefer to address the issues of the utmost importance first, and not go too far into the details of my hypothetical solution. \n \n As indicated in my threads, I differ on the proposal above because I do believe in a 1 State solution, and have given my reasoning in those threads. \n \n As for the Arabs on the Occupied Territories, their land should be returned in return for nothing. What Israel gets out of that is a whole bunch of people not spending all of their waking hours planning or attacking Israel. Granted, some of them will anyway. However, the number of people being turned into extremists will decrease without the incentive to regain their homes.\n \n As for the proposal that \"The State of Israel will help in the re-construction of the infrastructure Palestinian State.\" ... Aside from not agreeing with a 2 State solution in which a scenario of this sort would occur, there is a much larger problem (aside from the largest problem that I have already clarified in on eof my threads) ...\n \n Unless I am unaware of oil deposits underneath the sections of land proposed for the new Palestinian State, or perhaps some huge mineral deposits on those lands, ....\n \n I don't understand how anyone expects this Palestinian State to be Economically viable. The proposed State has no resources that I'm aware of, and I'm certain that even if Israel was to pay reparations in the form of infrastracture to a State that doesn't even \"provide for\" the Arabs in the Occupied Territories, that 1) Israel would not want to support that new State's Economy, and 2) the \"reparations\" in the form of support for infrastructure, should go to the people whose lands were occupied! LOL!\n \n In any case, all plans have hundreds of problems seen and unforseen. However, I think all plans need to address the most basic issues first, and if an issue was ever important with founding new State, it should include economic viability, rather than leave that to \"inovation\", and that sort of thinking. Regardless of that little bug in the plan, I have far more important reasons for believing in the viability of a plan for a 1 State solution over a 2 State solution, having to do with things posted in my threads in this forum.", 
   {
    "post_info": {
     "post_title": "the re-construction of the infrastructure Palestinian State"
    }
   }, 
   31432, 
   null, 
   1074435240.0
  ], 
  [
   31848, 
   null, 
   "daewoo", 
   "There are two problems I see with the 1 state plan. The first is that I don't think that the current administration of israel would be willing to grant the Arabs equal rights, including equal representation in the government. I think that it would take a complete rebuild of their government INCLUDING THE DRAFTING OF A CONSTITUTION in order to change the way the Arabs are treated by the government.\n \n The second problem I see with the 1 state plan is that Palestine is a conqured territory. I live in the U.S. I can say absolutly without reservation that if Canada invaded the U.S., I would not stop fighting until they had been driven back to Canada. There would be no 1 state option. I think it can be agreed upon that the American people would continue to fight until the invaders had been driven back to the north. I ahve trouble envisioning the Palestenians being any less adamant than I would be.\n \n As far as economic viability of Palestine, the conquered territoris are the only ones that ARE economically viable, which is most likely why israel is so keen to hold on to them. Israel is mostly swamp, desert, and poor farmland. The olive groves of palestine have been a source of wealth for the Palestenians for generations. Many of them have been in place for over a thousand years. Before the invasion, Palestine was considered a rich land. \n \n It is not Palestine, but Israel that would suffer financially from a seperation of the two states. Since israel is pretty much a welfare state as is (mostly owing to their rediculous military expendetures) I don't see how they would suffer that much. They could downsize their military since their neiborghing states would not be so keen to destroy them, and live off the US taxpayer, suplemented with their meager GDP, just like they always have.", 
   {}, 
   31707, 
   null, 
   1074515820.0
  ], 
  [
   31888, 
   null, 
   "SilentPoet", 
   "I would not expect a reply from David2004 as I have seen this same article posted on many sites with no follow up or response.", 
   {}, 
   31848, 
   null, 
   1074538980.0
  ], 
  [
   31912, 
   null, 
   "daewoo", 
   "aaaahhh, a cut and paste forum terrorist. I have never been able to understand such folks. The fun is in the debate.", 
   {}, 
   31888, 
   null, 
   1074553560.0
  ], 
  [
   32568, 
   null, 
   "David2004", 
   "Looking at the Arab people as tribal similar to the American Indians. With the exception of their family leaders of their nations and Islamic fundamentalist the Arab people have been abused by the ways of the western modern world. Most of this abuse was to secure a steady cheap flow of oil to the industrial world. What the United States has done with their foreign policy to the Arab world over oil, the State of Israel has done to the Palestinian people over fresh water all in the name of their nation security and interest. It is this double standard that has put us at odds with the rest of the world when we use military might when to defend policy that are wrong.\n \n Most of my focus is on the current state of affairs and policies of the State of Israel and the United States in relationship to the Palestinians and the Arab nation. Accepting the fact that the United States and the State of Israel have more power and control in the direction of peace or war in the Palestinian-Israeli crisis than any other nation. Understanding that there are more Muslims in the world than North America and Europe combined. There are probably more Muslim or Christian fundamentalists extremists than there are Jewish people in the world. Religion is an ideology with no uniform or borders. \n \n Not until the United States changes its energy policies where less than 5% of the world?s population is consuming 25% of the world?s oil. And the State of Israel comes to terms with the Palestinian people where they can both live and coexist in peace. These two changes would do more to decrease the level of tension between nations and people around the world.", 
   {
    "post_info": {
     "post_title": "Double standard that has put us at odds with the rest of the world"
    }
   }, 
   31848, 
   null, 
   1074969060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  First step to the Road Map to Peace i", 
  "url": "http://www.4forums.com/political/peace-middle-east/1580-first-step-road-map-peace-i.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 1580, 
  "discussion_files": [
   [
    "26398.html", 
    "http://www.4forums.com/political/peace-middle-east/1580-first-step-road-map-peace-i-print.html"
   ]
  ], 
  "identifier": 1580
 }
]