[
 [
  [
   18, 
   null, 
   "admin", 
   "Does the Shrinking Sun prove that the earth is not as old as the evolutionist say?\n \n http://www.youdebate.com/DEBATES/creation_shrinking_sun.HTM", 
   {
    "post_info": {
     "post_title": "Shrinking Sun"
    }
   }, 
   null, 
   null, 
   1043621820.0
  ], 
  [
   51707, 
   null, 
   "Astronomer", 
   "Does the Shrinking Sun prove that the earth is not as old as the evolutionist say?\n \n http://www.youdebate.com/DEBATES/creation_shrinking_sun.HTM\n\n \n First of all, no solar astronomer is involved with the theory of biological evolution that I know of. These people are hardly \"evolutionists\" but they are well-trained enough to be able to tell us the age of the sun.\n \n No. The sun isn't shrinking at all. In fact, the sun is actually undergoing a sort of \"bobbing\" that is associated with the timescale of gravitational collapse. If nuclear fusion didn't happen, the sun would be limited in age by the fact that it is collapsing, but nuclear fusion is seen to exist in labs here on Earth. So the sun's total age is actually something near 10 billion years (it's halfway through its lifetime).\n \n The way the sun holds itself up is through a process called hydrostatic equilibrium. Gravity is balanced against by the pressure of the heat of the sun. If the pressure gets too great it actually pushes against the sun and causes it to expand. This in turn causes the outer layers of the sun to cool off and gravity wins causing the sun to collapse. This in turn causes the sun to heat up its outer layers which increases the pressure and you get another expansion. These waves take place over a periodic timescale that is far less than the age of the sun.\n \n It happens that the sun right now is in one of its contraction phases. Sometime in the future, it will expand again. If we had accidentally been in an era when the sun was expanding, the creationists may have declared that the sun would soon expand away to nothing meaning that the sun couldn't be as old as scientists claim it is!\n \n In short, we know the sun's core has the right temperature and densities for nuclear fusion to happen. We also know how much energy that will release and how long the sun can burn if that's with nuclear fusion as its energy source. To claim that the sun isn't undergoing nuclear fusion at its core is to deny the fundamental observed fact of physics that substances at that temperature and density undergo fusion.\n \n The basic answer to the question posed is, then, absolutely not, the sun has a much greater age than creationists want it to have.\n \n By the way, over in the old fora I posted a lengthy response to a creationist who had a beef with the Big Bang and other aspects of astronomy. If you have any questions about these subjects, I suggest reading the answers I posted to his \"objections\". Also, feel free to e-mail me questions concerning astronomy in regards to this subject.", 
   {}, 
   18, 
   null, 
   1085199900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Shrinking Sun", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/16-shrinking-sun.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 16, 
  "discussion_files": [
   [
    "32118.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/16-shrinking-sun-print.html"
   ]
  ], 
  "identifier": 16
 }
]