[
 [
  [
   31799, 
   null, 
   "Broker", 
   "I think it's quite hypocritical for everyone to call on Israel to form an additional Palestinian state with lands that they won in wars. Are they even obligated, and should they be pressured, to form an additional Palestinian state?\n \n What about the former powers of the world? Do they need to allow all their poessetions to become independent? Does the US need to return it's spoils from the Mexican-American and Spanish-American wars?\n \n The Palestinians dug their own hole. There is a Palestinian state--it's called Jordan. And before Jordan and a coalition of Arab states attacked Israel, there was no seperate West Bank, Gaza, or Golan Heights to form a state out of, they were parts of Jordan, Syria, and Egypt.\n \n So despite the history of similar situations throughout the world the US and Europe continously have encouraged Israel to give up even more of its land that was won in its own defense to give a group of people their own seperate state. Remember, they have already given up two-thirds of what was once Israel in returning the Sanai Peninsula to Egypt.\n \n So, forget all about forming another Palestinian state. Return the peoples living in Israel's lands to their home countries and let them be. It's not like Israel blocked them from returning to their nations, they stayed as Israel took control.", 
   {
    "post_info": {
     "post_title": "Is Israel Obligated to form a Palestinian state?"
    }
   }, 
   null, 
   null, 
   1074489060.0
  ], 
  [
   31815, 
   null, 
   "SilentPoet", 
   "You make a valid point and I tend to agree as of now.", 
   {}, 
   31799, 
   null, 
   1074497400.0
  ], 
  [
   31825, 
   null, 
   "daewoo", 
   "Israel is not required to form a palestenian state. Israel is required to remove their occupational forces from the palestenian state that they are illegally occupying. International law says that you cannot invade other countries, even if you are attacked. \n \n If Israel was a non-UN country, they could argue that since they did not agree to abide by those laws, they are not required to abide by them. This is what Iraq claimed when they invaded Kuwait, we all saw how well that argument worked for them. Israel is a UN country, which means that they agreed to play by a certain set of rules.\n \n Israel does not have the power to create a Palestenian state. Israel only has the power to remove their troops from the illegally occupied Palestenian territories.", 
   {}, 
   31815, 
   null, 
   1074502860.0
  ], 
  [
   31873, 
   null, 
   "Broker", 
   "Since when is Israel occupying Jordan?", 
   {}, 
   31825, 
   null, 
   1074534540.0
  ], 
  [
   31892, 
   null, 
   "SilentPoet", 
   " International law says that you cannot invade other countries, even if you are attacked. \n \n \n All UN resolutions are located on the internet. Please provide me to a reference with such an international law.\n \n \nIsrael only has the power to remove their troops from the illegally occupied Palestenian territories.\n\n \n I suppose the US should remove our people and \"force\" from illegally placed troops so that the Indians and British can make their own state too.", 
   {}, 
   31873, 
   null, 
   1074539400.0
  ], 
  [
   31922, 
   null, 
   "daewoo", 
   "You can start with the preable to the UN charter:\n \n Then look at chapter 1, article 2, section 4, which prohibits the use of force against the territorial integrity or political independance of any state. It does not say \"unless first attacked\". When we pushed Iraq out of Kuwait, we did not grant the territory of Iraq to Kuwait, thus creating a huge kuwait. The US just invaded Iraq (and yes, it was illegal), but we are not turning it into the 51st state.\n \n You can then take a look at The UN security council resolutions, starting at #242, which came into being on November 22, 1967 and required the withdrawal of israeli forces from their newly occupied territories. I can think, off the top of my head, of at least a dozen security council resolutions that israel is in direct defiance of. Israel is in defiance of more security council resolutions that Iraq ever was. I think we invaded the wrong country. The difference is, the US has always taken israels side and insured that military force was not used against them (this has to do with how the resolutions are classed).\n \n As far as the british-indian questions, I am not sure I understand the question. Are you talking about india as a british colony? If so, that ended a long time ago. You see, there was this guy named Ghandi. There was a hunger stirke and sea slat involved. I am sur that a search for \"ghandi\" in google will provide you with all the info you need.\n \n As far as US posessions, if thy want independance, I say let them have it. I don't see the Virgin Islands clamoring for independance. Puerto Rico has expressed some desire to be independant. The problem with their independance is that they want to have their cake and eat it too. They want become citizens of the \"republic of Puerto Rico\", but still allow their people to retain US citizenship (granted in congress in 1917).\n \n \n I don't have time to post direct web links right now (I am shooting form the hip here, so to speak). The UN charter is available at www.un.org as are copies of every security council resolution. Many security council reolutions can also be viewed at the Jewish virtual library (which I believe is at www.us-israel.org/jsource/UN if not, start at www.us-israel.org and work forward from there).\n \n I had this discussion with a good friend and excellent debating partner I know who is a congressional aid. She said \"Don't laugh at me....I'm not sure why, but I seem to remember that for some reason israel is good.\" This is the problem with US-israel relations. A lot of people seem to remember that for some reason israel is good.....but nobody seems able to remember exactly waht that reason is. They murder people, spit in the face of the international community, and then when they get called on it they go \"NO, WAIT! We are good......remember?\" And the american public rubs their collecitve chin and goes \"you know, I do seem to remember hearing that, but I cant remember where, or why they are good\".", 
   {}, 
   31892, 
   null, 
   1074556800.0
  ], 
  [
   32018, 
   null, 
   "Broker", 
   "The Iraq war wasn't illegal. See UNSCR 1441 and the terms of Iraq cease fire from 1991.\n \n The UN is clearly anti-Semetic. In EVERY resolution against discrimination the UN has voted down including discrimination against Jews. The UN refuses to condemn suicide bombings but has condemned Israel for launching missiles at terrorist training camps. The fact is that overall most hate crimes aren't against another race or Muslims, they are against the Jews, and after facing five Arab invasions just for existing I think Israel deserves our assistance. \n \n Put the populations of the US and Israel in proportion. It would be like losing 30,000 Americans. And if you think simply pulling out of the Israeli territories will end the violence you are gravely mistaken. Groups like Hamas want to drive the Jews into the sea, not establish an additional Palestinian state.\n \n The Palestinians have not met the requisites for Israeli withdraw. They have not proved their security forces and they have no economy.", 
   {}, 
   31922, 
   null, 
   1074637920.0
  ], 
  [
   32106, 
   null, 
   "daewoo", 
   "The war in Iraq was illegal there is no question of this. Even Bush has admitted it on several occasions, but he cited extenuating circumstances (terrorist threat, WMD's) to justify it. A nation, or even a colaboration of nations cannot launch a military invasion like that without implicit UN approval. Those are the terms of the UN, and they are the rules we agreed to. If we didn't want to follow the rules, we shouldn't have joined up.\n \n The UN is NOT anti-Semetic. They ae operating within the rule of international law. irael, in the occupied territories, is an anvasion force. The indiginous population of an occupied region have the right to attack the invading nation and theri troops. The Palestenians who are attacking the isralis meet absolutly every legal definition of \"freedom fighter\" that I have ever seen. Besides, the UN does not have the authority to issue resolutions to anybody but nations. The Palestenians are not a nation anymore, they are an illegally conqured people.\n \n Anti Semitism is a card the the isralis like to play when all else fails. I am not going ot say that there is no such thing, but I will say that it is a highly over-used excuse for those murdering terrorists (the zionists) to continue their rampage.\n \n I'm not sure what you mean by \"it would be like loosing 30,000 Americans\". Are you saying that loosing the occupied territories would be like loosing 30,000 Americans overnight? No, it wouldn't. It would be like if we illegally invaded Jamaica, and then returned their sovergnty/\n \n \n As far as the Palestenians not meeting the rewquirements for independance, israel has no right to GIVE them requirements for independance. You keep forgetting that you are not talking about Palestine seceedding from israel, you are talking about the withdrawal of troops from an illegally occupied territory. There is a big difference. It is interesting to e that israel makes these demands, and then does everything they can to ensure that the demands cannot be met.\n \n Why do you think israel wants palestine to begin with? It is because palestine is a much richer land than israel. Their olive groves are legendary. Israel wants to hold on to palestine because Palestine is the ONLY economically viable portion of israel.\n \n As far as Hamas is concerned, their stated goal is to remove israel from Palestine. No more, no less. If, in fact, israel did leave Palestine and Hamas continued their attacks, THEN, israel would have cause for complaint. Right now, groups like Hamas are seen by the international community as freedom fighters and will continueto get international support. \n \n Israel is not entitled to American support. DEFINATLY not legally. I would be willing to see America support israel through a transition period, but otherwise I say we pull support completely. \n \n I do know what that would lead to. Besides complete economic ruin of israel, it would open the gate for the Arabs to attack and destrroy israel. I see no problem with this, as israel stands now.", 
   {}, 
   32018, 
   null, 
   1074674580.0
  ], 
  [
   32390, 
   null, 
   "Broker", 
   "I want the quotes from Bush and three sources saying he said that. I doubt you can provide it. \n \n Technically this is not a new war. That was still Gulf War I. We did not sign a peace treaty, we signed a cease fire. Iraq breached the terms of the cease fire, and so hostilities were resumed. No new approval needed.\n \n \n I just showed you how they are anti-Semetic. You said nothing that could possibly justify it. Why are the Jews not included in any hate resolution because they've been voted off of it? Why does the UN not condemn suicide bombings but instead Israeli strikes against terrorist training camps?\n \n No no no, to terrorist attacks. Put Israel's population into porportion with the US population and take their losses. It's not 30,000 Israelis, it's comparable to us losing 30,000 of our citizens to terrorism. If you think any nation would sit idly by after losing so many people, it would be absurd. Israel has been quite restrained in fact. We invaded two countries and diposed two governments after losing 3,000 people!\n \n By Palestine I will assume you mean the occupied areas, because nothing else could be defined as \"illegally occupied.\" So some of the most impoverished areas in the world are in fact the only economically viable parts of Israel? :-\\ You know that that one's absurd. Israel has the highest standards of living in the region to begin with. I don't think they're walking in and stealing some olives to raise it. That sounds even more absurd.\n \n So Israel should take the risk? They should give up their ability to go after terrorism in their territories by allowing them independence? I think Hamas would like you to be their spokesperson for North America... that would be so perfect for them! They could pursue terrorism without anyone to stop them. And then what? They complain? And after more people blow themselves up people like you call foul when Israel breaches the new state to go after the terrorists?\n \n Hamas is not seen as a freedom-fighting organization. :-\\ They're seen as an Islamic extremist group that kills innocent civillians. That's not how they're seen, that's what they are. Military targets are one thing, but blowing innocent people up intentionally in the name of freedom is quite another. If you think that is a legitimate tactic...\n \n Too bad the US won't pull away. Had it not been for us there would never have been an Israel. But even if we did pull away the Arabs stand no chance against the IDF. They've tried five times and the IDF is only getting better....\n \n What is so wrong with Israel? :-\\", 
   {}, 
   32106, 
   null, 
   1074892440.0
  ], 
  [
   32430, 
   null, 
   "epaphras_faith", 
   "I don't think there is an actual obligation on the part of israel. Would it make sense to do so, I am not even certain of that. It seems like the palestinian state is a farce started by one man.........Arafat.", 
   {}, 
   32390, 
   null, 
   1074899760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is Israel Obligated to form a Palestinian state?", 
  "url": "http://www.4forums.com/political/peace-middle-east/1600-israel-obligated-form-palestinian-state.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 1600, 
  "discussion_files": [
   [
    "23734.html", 
    "http://www.4forums.com/political/peace-middle-east/1600-israel-obligated-form-palestinian-state-print.html"
   ]
  ], 
  "identifier": 1600
 }
]