[
 [
  [
   32416, 
   null, 
   "montalban", 
   "\"The Prophet (Muhammed) said, 'If anyone of you rouses from sleep and performs the ablution, he should wash his nose by putting water in it and then blowing it out thrice, because Satan has stayed in the upper part of his nose all the night.'\" (Hadith, Sahih Bukhari 4:54:516) \n \n \"The Prophet (Muhammed) said, 'Yawning is from Satan and if anyone of you yawns, he should check his yawning as much as possible, for if anyone of you (during the act of yawning) should say: 'Ha', Satan will laugh at him.'\" (Hadith, Sahih Bukhari 4:54:509)\n \n And yet Muslims claim that every single great scientific breakthrough is already covered by the Koran ? they say this because they believe it to be the word of their god, and he knows everything.\n \n Thus, one Muslim web-site will calmly state\"\n With fiber optic wire technowlogy (sic) we can now film the stages of a baby's growth whithin the womb however the muslim Holy book the Quran stated all of these stages in an amazing detail.\n In the name of God most gracious most merciful\n O mankind! If ye are in doubt concerning the resurection, the (sic) lo! We have created you from dust, then from a drop of seed, then from a clot, then from a bite of flesh shapely and shapeless, that We make it clear for you.\n REFERENCE: (Chapter 22) part of verse\"5\"\n Clot in the Arabic language can mean the name given to leaches which the baby resembles its looks during the very early stages of its developement then this subsequently developes to a shape simmilar to abite made impression when the spine of the little baby starts to form.\n (all spelling mistakes are as written http://members.tripod.com/~bensG/islam3.htm). Further it claims that the Koran explains\n *1)The Descending and the miracle of the physical properties of Iron \n *2)The Rose Nepular (sic) as viewed by the Hubble Telescope \n *3)The Reduction of matter from the Earth's outer layers \n *4)The Rounded shape of the Earth \n *5)The development of baby's growth in a mother's womb \n *6)The Big Bang theory \n *7)The ending of sensation at the erosion of skin at which the nerves end \n *8)The fact that the sun and the moon are moving each in its own orbital path \n *9)The fact that the light from the moon is a mere reflection of the light from the sun \n *10)There are three types of rain clouds and the Quran describes each in detail such as raining process and cloud shapes and after effects such as the growth of evoluting shaped plants \n *11)The womb enveloping a baby consists of three layers \n *12)Allah swears by the positioning of the stars which draws attention to the fact that their positioning is critical \n *13)The Quran implys that mountains are their as an anchor for the earth \n *14)The Quran States that the Universe is Expanding \n *15)The Quran predicts Space Exploration \n *16)The Quran states where the lowest point on Earth is \n *17)TEvery (sic) Word in The Holy Quran is counted for\n \n Furthermore\n The Centre does not construe \"Islam\" and \"science\" as two separate entities that need to be somehow related through an external process; rather, the Centre recognizes an underlying unity in all domains of knowledge. This is based on the concept of Tawhid, Unicity of God, which is the most fundamental principle of Islamic epistemology. (http://www.cis-ca.org/) emoticon_wow", 
   {
    "post_info": {
     "post_title": "Science and Islam"
    }
   }, 
   null, 
   null, 
   1074898560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Science and Islam", 
  "url": "http://www.4forums.com/political/religion-debates/1632-science-islam.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 1632, 
  "discussion_files": [
   [
    "5806.html", 
    "http://www.4forums.com/political/religion-debates/1632-science-islam-print.html"
   ]
  ], 
  "identifier": 1632
 }
]