[
 [
  [
   1518, 
   null, 
   "Stormin Norman", 
   "Why the U.S. Must Dispose of Saddam Hussein and the Current Iraqi Regime\n \n The situation in Iraq is disturbing. In 1990 Iraqi forces attacked Kuwait in an attempt to gain control of the oil resources of that country. This spawned the largest conglomeration of coalition forces in recent history. After a campaign comprised of mostly air sorties and a massive onslaught by U.S. armored divisions, likened to the German Blitzkrieg, Saddam agreed to a cease fire. \n \n This agreement allowed U.N. weapons inspectors to evaluate and destroy Iraqi weapons that violated the Geneva Convention. For years Saddam's government has been pursuing weapons of mass destruction in direct violation to this world-renowned treaty. The sophistication of his weapons program continues to baffle even the most experienced onlookers. Not only does Hussein place importance on becoming another nuclear power, but he is also in pursuit of some of the world's most deadly biological agents. The ability of a rouge nation, under the control of a severe degenerate, to produce such vile weapons poses a certain threat any nation in that region or beyond.\n \n Part of the cease fire agreement, drafted by the U.N., placed sanctions on the government until certain measures were met in full. The cooperation of Saddam in helping to destroy his deadly arsenal was a crucial element, and represents the main area of Iraq resistance to comply. Further compounding international relations, Saddam made a move to eliminate resistance groups in the north, mainly the Kurdish rebels. These efforts resulted in a brazen disregard for the fact the world's eyes were focused on him. Obviously, this blood bath should be recognized as Saddam's belief that he can carry out such operations with pure impunity. He was testing the waters to see if the U.N. resolutions held any coercive promise. The international community faltered in its resolve to deal with the difficulties this tyrant poses. In addition, Saddam deliberately withheld evidence and hid his top-level scientists in an effort to undermine UNSCOM. The extent of Iraq resistance to submit to inspection was so effective that UNSCOM had no choice but to leave. They concluded that their efforts were severely undermined and the extent of his program is still unknown.\n \n What is known; is that Iraq has Vx, Mustard, and other nerve gasses. Not only does he possess such weapons, but he has armed some of his intermediate range missiles with these elements. He also had an extensive biological weapons program that sought after Botulinum, small pox, camel pox, and hemmoragic agents. The main advantage these weapons have over their nuclear and chemical counterparts is their micro-nature. They can be hidden with relative ease, and deployed in small and large doses, producing catastrophic results. \n \n Recently, an Iraqi defector that headed up Iraq's nuclear weapons program has offered insight into the extent of Saddam's capability. He claims that they have all the technology and necessary components for producing a nuclear weapon. The only missing ingredient is the fissile material. \n \n Another troubling world event remains the press release by the Ukraine government regarding the amount of nuclear material missing from their stockpile. Ukraine has been unable to account for roughly 200 warheads. If Saddam acquires these materials, the nature of the game changes. He will have a particularly large bargaining chip by which to deal with the world. \n \n I have compiled some background on Iraq's history and weapons programs. When looking over the facts, I ask you to question whether or not the U.S. should allow such a man to continue to rule his people and pose an imminent threat to the world at large. Consider his record and his desire to obtain these weapons. What do you believe his motives to be? Should the U.S. turn the other way and allow him to heighten the extent of his power, or should we eliminate the possibility, considering the current threats we are facing?", 
   {
    "post_info": {
     "post_title": "Why Saddam Hussien Must Go:  Regime Change is Necessary"
    }
   }, 
   null, 
   null, 
   1044846300.0
  ], 
  [
   1520, 
   null, 
   "Stormin Norman", 
   "From the State Department:\n \n \"Iraq enjoyed a strong economy until Saddam Hussein took power and launched attacks against his neighbors - Iran in 1980 and Kuwait in 1990 - with devastating results for Iraq. It took 5 years for Saddam to accept the oil-for-food program. Saddam also has failed to implement policies that would boost economic growth and generate job opportunities to improve the population's living standards.\"\n \n \"Iraq's oil exports are approaching pre-war levels. Prior to the Gulf War, Iraq was exporting about 2.6 million barrels per day of crude oil. Its current crude oil exports have averaged about 2.2 million barrels per day in recent months, and the regime said it plans to increase exports to about 2.7 million barrels per day by yearend, which is higher than pre-war exports. In addition, Iraq is smuggling 2.8 million barrels of oil per month through the Persian Gulf.\"\n \n \"Oil-for-food has made significant improvements in the lives of the Iraqis and will continue to do so. The increase in revenue under the oil-for-food program from $4 billion in the first year of the program to a projected $20.4 billion this year means there is a tremendous amount of money available for humanitarian goods. The government of Iraq must choose to make that happen. In northern Iraq, where the UN controls the humanitarian relief programs, child mortality rates are lower than they were before the Gulf War. However, in southern and central Iraq, where the Iraqi Government controls the oil-for-food program, mortality rates have doubled.\"\n \n \"More than 13 million metric tons of foodstuffs have arrived in Iraq since the first deliveries of the oil-for-food program began in 1997. In fact, Baghdad has been caught exporting dates, corn, and grain outside of Iraq while claiming the Iraqi people are starving.\"\n \n \"Iraq has not complied with UN Security Council Resolutions that call for dismantling weapons of mass destruction programs, and returning Kuwaiti and other nations' missing persons and POWs and Kuwaiti property seized during the Gulf War.\"\n \n \"Saddam's gassing of the Kurds in northern Iraq in 1988 was one of the largest chemical weapon attacks ever waged against a civilian population. Even today, Saddam continues to practice systematic torture, executions, forced displacement, and repression against the Iraqi people. The U.S. is currently seeking an indictment of senior regime officials for these atrocities.\"\n \n \"As a result of its refusal to cooperate with the UN disarmament regime, Iraq maintains the capacity to produce missiles and chemical, biological, and nuclear weapons. The absence of UN inspectors from Iraq has afforded Saddam the opportunity to reconstitute his arsenal of weapons of mass destruction. Saddam has already launched two bloody wars; one against Iran in 1980 and the other against Kuwait in 1990. In the last couple of years, Saddam Hussein has repeatedly issued public threats against his neighbors, including calls for the overthrow of a number of regimes.\"\n \n source:State Department myths and facts about Iraq\n \n Australia Analysis Based on UNSCOM Reports:\n \n \"4,000 tonnes of chemical weapons raw materials are unaccounted for, which would provide a capability of producing hundreds of tonnes of chemical weapons agents to fill thousands of munitions. Indeed 31,000 chemical weapons munitions remain unaccounted for.\"\n \n \"Some 600 tonnes of raw materials for the deadly VX nerve agent are not accounted for, which would provide a capability of making 200 tonnes of VX...\n \n ...200 tonnes of VX could theoretically obliterate the entire global population.\"\n \n \"17 tonnes of growth media for biological weapons agents are unaccounted for. These media could produce at least three times the quantity of anthrax which Iraq has admitted it produced. Iraq has also not fully disclosed field trials it conducted of aerial bombs filled with botulinum toxin, simulant B or aflatoxin. These biological weapons are designed to incapacitate and kill...\n \n ...Botulinum toxin is the most poisonous substance known. \"\n \n \"One ounce of anthrax in an air conditioning system in a sports stadium could infect 70,000 people in one hour.\"\n \n \"It has been calculated that a missile warhead filled with 30 kg of anthrax used against unprotected civilians in a large city would result in between 20,000 and 80,000 fatalities.\"\n \n \"UNSCOM has repeatedly reported on Iraq's systematic concealment activities in proscribed weapons areas. Despite Iraq's obligations to provide full, final and complete declarations (FFCD) in the missile, chemical and biological fields in 1991, Iraq submitted such declarations five to six years later, and some of these have been inadequate. UNSCOM has particularly grave concerns about the inadequacy of information relating to Iraq's biological warfare program.\"\n \n source:materials unaccounted for\n \n \n Hamza's (Former Head of Iraq's Nuclear Weapons Program) Testimony before congress\n \n \"Citing German intelligence estimates, Hamza said Iraq had more than 10 tons of uranium and one ton of slightly enriched uranium. Hamza said that could give Iraq enough weapons-grade uranium to build three nuclear weapons within three years. \n \n In addition, Hamza said, Iraq is trying to extend the range of its missiles in order to reach Israel.\"\n \n Source:CNN\n \n Chemical and Biological Weapon Facts\n \n \"Nerve Agents -- These agents disrupt normal functioning of the central nervous system. They are colorless, tasteless, and odorless. Sarin is delivered as an aerosol and evaporates rather rapidly. Inhalation of 100 milligrams is lethal. VX is a persistent agent (effective for days or weeks depending upon climactic conditions) absorbed through the skin, 5- 10 milligrams are lethal. Exposure to nerve agents results in nausea, diarrhea, pulmonary edema, and convulsions leading to death by respiratory arrest in within one to fifteen minutes, depending on the concentration\"\n \n \"Mustard Gas\" -- \"Mustard gas\" is actually an oily brownish liquid with a smell similar to garlic. It is a vesicant or blister agent. It is generally severely incapacitating rather than lethal, though intense or prolonged exposure can lead to fatal pulmonary edema. An incapacitating dose is about 200 milligrams, and 1,500 milligrams inhaled is sufficient to kill. Mustard gas damages any tissue it contacts, causing extensive and large blisters which last several weeks. Permanent damage to the lungs and eyes can result.\n \n \n \"Agent-15\" -- The British government recently asserted that Iraq developed large stocks of an incapacitant gas dubbed \"Agent- 15\". It is apparently a glycollate similar in effect to the agent BZ, an incapacitant once produced by the United States. If this is correct, exposure to about 100 milligrams in aerosolized form would be sufficient to incapacitate. Symptoms, which begin within 30 minutes of exposure and may last several days, include dizziness, vomiting, confusion, stupor, hallucinations, and irrational behavior. The U.S. Army considered BZ to be too unpredictable in its effectiveness to be useful on the battlefield, and all U.S. stocks were destroyed.\"\n \n \"Botulinum Toxin -- Botulinum, produced by the clostridium botulinum bacteria, causes the food-poisoning \"botulism\". In pure form, it is a white crystalline substance, that is readily dissolvable in water, but decays rapidly in the open air. The symptoms of botulism begin 12-72 hours after exposure depending upon whether it is inhaled or ingested. Symptoms include nausea, diarrhea, paralysis of the throat, and convulsions, followed by death due to respiratory arrest. Vaccines are available, but again, their efficacy against abnormally high toxin dosages is uncertain. Early diagnosis and palliative treatment can\n prevent fatality.\"\n \n \"Anthrax -- Anthrax is a disease caused by the bacillus Anthracis. Infection can result from inhalation, ingestion, or absorption through the skin. Most effectively dispersed as an aerosol, anthrax spores decay in a matter of days in sunlight, but can contaminate soil for\n decades. 10,000 to 20,000 spores is a lethal dose -- \"something smaller than a speck of dust,\" according to a DOD biological warfare expert. Symptom onset occurs 3-4 days after exposure, and initially resembles that of a common cold. Symptoms do not become identifiable\n as anthrax until the fatal phase of the disease, when vomiting, severe head and joint aches, and respiratory distress lead to death within 1-3 days. Vaccines are available against some forms of anthrax, but their efficacy against abnormally high concentrations of the bacteria is uncertain. Antibiotic treatment can be effective, but only if administered prior to the onset of symptoms, otherwise the fatality rate can exceed 90%.\"\n \n Source:Iraqi Chemical and Biological Weapons\n \n Report from Dec. 2000\n \n \"SADDAM HUSSEIN has ordered his scientists to resume work on a programme aimed at making a nuclear bomb, a defector warned yesterday.\"\n \n source:London Sunday Times\n \n Nuclear weapons could be up and running in a matter of months:\n \n source:NPR\n \n 'Loose Nukes' from former Soviet Republics\n \n source:CNN\n \n Recent news suggests that we may have bigger problems than we first expected. Take a look.\n \n source:Ukraine missing 200 warheads? Who bought them? Where did they go?", 
   {
    "post_info": {
     "post_title": "Part II:  The supporting evidence"
    }, 
    "unicode_changes_made": true
   }, 
   1518, 
   null, 
   1044846420.0
  ], 
  [
   1522, 
   null, 
   "Stormin Norman", 
   "In light of the mountains of evidence and the overwhelming uncertainty regarding the Iraqi weapons capability, I ask that you consider the recent news and what is known about Hussein and his regime. Do any of you doubt that Al Quada could be working closely with elements of certain enemy nations in order to bring the U.S. to its knees? Is it a legitimate possibility that such weapons could be used on civilian populations in Europe and the United States? Since the amount of devastation that such weapons could cause is enormous, shouldn't we move to eliminate what can be considered a clear and present danger? What is more likely; Bush and the upper echelon of DOD officials believes Iraq to pose a serious danger to the safety of the people they took an oath to defend; or that he wants to maliciously control the oil of that region so he and his buddies can sit back and drink whine with the profits reaped by squandering Iraq's oil? Get real. Do any of you doubt that the murders of 9-11-01 would have used such methods if they had the chance?\n \n To conclude my presentation of the situation I will interject my own conclusions regarding this issue. Please consider them, for they are valid and backed with the facts.\n \n \n Hussein has had a nuclear weapons program since the 1970's. How long did it take Oppenheimer and the Manhattan Project to delivery nuclear weapons during World War II? Fact remains that Saddam Hussein has employed knowledgeable people to develop these capabilities for him. His regime does not have to start from scratch, as the work has already been completed by other developed nations. He has the blueprints, but lacks the materials. So we think. \n \n When the Soviet Union fell in the early 1990's one of the greatest concerns was the lack of security surrounding their arsenal. In the following economic instability many practical men in the U.S. intelligence community questioned whether or not fissile materials would make it to the black market. The Soviet biological weapons program was also of vital interest to the men who 'watch' these sorts of events. However, there is no declassified evidence linking Iraq to the Soviet's loose weapons of mass destruction. This conclusion is hardly 100%. Many starving scientists from the old communist regimes chose to work for rouge nations, developing their weapons programs. Whose to say that some Uranium-235 did not fall into the wrong hands?\n \n Nastradamus is considered by many to be some type of profit with a high degree of accuracy. Some analysts say that he foresaw the emergence of a man from the Middle East that use nuclear destruction in order to spawn World War III. This man was considered by him to be the third 'anti-Christ', the first two being Napoleon and Adolph Hitler. Of course, I don't place much credibility on the workings of a mystic. However, the events that he spoke of seem to be a possibility in this New World of former Soviet breakaway states. If such a disaster could be averted, we should seek to do so.\n \n No one can doubt the pure evil nature of Saddam. His record speaks for itself. People who claim that the U.S. has no right to defend itself against such an attack often sight the sovereignty of Iraq as a nation-state. This is a claim that grants the legitimacy of such a tyrant. Anyone who rules through such tactics lacks legitimacy in my mind and should be shot on sight. This is a man who threatens the safety and sovereignty of neighboring states and the world as a whole. Saddam's son is worse than he is; therefore we can not simply wait until Saddam dies in hopes of a change. His son will be his successor. Everyone at the top of this regime should be toppled, violently in necessary. The people through free and fair elections should replace Saddam's dictatorship. The newly elected representatives will then be tasked with the job of drafting a constitution that will provide a backbone to enable success of democratic ideals.\n \n Obviously, there are some changes in the political environment. Italy, Spain, and, after the election, Germany with join us in our fight. England has already claimed unwavering support. The United Arab Emirates has guaranteed use of the bases to stage from, and Saudi Arabia says they will back us if we have U.N. support. The climate is changing, which would indicate that the powers that be know something that the general public does not know. Could Saddam already have developed nuclear weapons? Regardless of what Scott Ritter says the answer is yes. It is entirely possible that Iraq has these weapons. He had enough time and the minds needed to obtain his goal. This has all the makings of World War III. Were do you stand in all of this? Are you still defending Saddam Hussein, or will you stand on the side of the just?\n \n More sources that you should look into:\n \n http://cns.miis.edu/research/wmdme/iraq.htm\n http://cns.miis.edu/research/wmdme/flow/iraq/index.htm\n http://cns.miis.edu/cns/dc/02rtable.htm", 
   {
    "post_info": {
     "post_title": "Part III:  Final Analysis and Conclusion"
    }, 
    "unicode_changes_made": true
   }, 
   1518, 
   null, 
   1044846600.0
  ], 
  [
   4140, 
   null, 
   "voiceofreason", 
   "I don't think that we should go to war with Iraq. I am glad that Bush wasn't the president during the cold war. His solution to the cold war would have been to wage a war with the Soviet Union and to disarm them by force. I think that we should stay out of the Middle East. So-called \"terrorists\" in the Middle East region are just trying to break free from the chains of American imperialism just like the US was trying to break free from the chains of British imperialism over 200 years ago. Arabs just want to be free and independent without having Americans interfering and trying to control what happens in the Middle East.\n \n -Voice of Reason", 
   {}, 
   1518, 
   null, 
   1047074040.0
  ], 
  [
   4163, 
   null, 
   "Broker", 
   "Oh, so you want us to reinstall your repressive regime? Ugh!\n \n Arabs love us! People in Turkey and Jordan are Western people! Iranian people have increasing pro-US feelings, Iraqis would love to be liberated, they've tried themselves three times! The \"Get out of the middle east!\" is an excuse by terrorists to carry out their murders. It's like the Nazis...they didn't have a reason, they made up a reason whenever they needed one. Terrorists will always have some reason to attack us. \n \n How are we being imperialist? We aren't taking Iraq over and making part of the US...we're allowing the people to create their own government and we're going to help them out a lot. If they want us to leave we will leave. They don't want their dictators, and they aren't free. If you think they are you are living in the Land of Oz. \n \n Iraq would not be cooperating if we didn't have troops on the border. Reagan moved his equipment close to the USSR too...Russia was a world power, Russia is not Iraq.", 
   {}, 
   1518, 
   null, 
   1047087060.0
  ], 
  [
   4347, 
   null, 
   "voiceofreason", 
   "We become imperialists when we rob the right of a country to rule itself. We shouldn't override another nation's sovereignty. That's what we're trying to do in the case of Iraq.", 
   {}, 
   1518, 
   null, 
   1047269040.0
  ], 
  [
   4350, 
   null, 
   "Broker", 
   "THe people don't rule Iraq, Saddam rules Iraq. There have been three tries to take him down...once they took 81% of the country, but he took it back. Saddam has robbed the right of Iraq to rule itself. \n \n And we're not making these places part of the US, it's hardly imperialism.", 
   {}, 
   1518, 
   null, 
   1047269580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why Saddam Hussien Must Go:  Regime Change is Necessary", 
  "url": "http://www.4forums.com/political/current-events-debates/167-why-saddam-hussien-must-go-regime-change-necessary.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 167, 
  "discussion_files": [
   [
    "836.html", 
    "http://www.4forums.com/political/current-events-debates/167-why-saddam-hussien-must-go-regime-change-necessary-print.html"
   ]
  ], 
  "identifier": 167
 }
]