[
 [
  [
   33882, 
   null, 
   "rapture", 
   "According to the psychiatrist, Heinrich Wilmer, the German cannibal Armin Meiwes, who killed Bernd Brandes and then ate at least 44 pounds of his flesh, is suffering from \"emotional problems.\" We might say the same, I suppose, of Brandes, who answered Meiwes's Internet advertisement for \"a young, well-built man who wants to be eaten\"-though his problems are now past curing. Brandes also had a slightly offbeat sense of humor. On discovering that both he and Meiwes were smokers, he reportedly said, \"Good, smoked meat lasts longer.\"\n http://www.city-journal.org/html/eon_01_05_04td.html\n \n \n \n \n \n Some things should just stay in horror flicks -\n Could you image lawmakers determining what the penalty should be for unconsentual cannibalism?Too bad the aten won't be around to testify....\n \n \n The reasons for cannibalism have varied. Sometimes there was simply limited food. Some groups liked the taste of human flesh. But mostly the reasons had to do with revenge or punishment for crimes, ceremony and ritual, or magic. Some victorious tribes ate their dead enemies. In some rituals the deceased body was eaten by relatives, as a manner of reverence for their ancestors, or in a pious desire for the soul of the dead to be reborn in the body of the consumer. This is called endocannibalism. In primitive rites that involved human sacrifice, parts of the body were often eaten. Headhunters, for example, often consumed certain parts of a body to gain powers of the dead person. Also, in Mexico, men representing the gods were periodically sacrificed and eaten to identify the participant with the deity........\n http://www.occultopedia.com/c/cannibalism.htm\n \n \n http://www.rotten.com/library/death/cannibalism/ ( scroll down to the photos)", 
   {
    "post_info": {
     "post_title": "Top of the food chain?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1075950600.0
  ], 
  [
   34882, 
   null, 
   "Josephine", 
   "I'm guessing that this has to come from two different fronts for two different situations. I think that if you simply mean people eating on another's flesh, then no, nothing can be done. It's just like those people who drink blood. However, if someone were to kill another person for the purpose of eating them, then there are going to be legal consequences. I mean, euthanasia is not allowed - and this, to me, would be a similar issue.", 
   {}, 
   33882, 
   null, 
   1076922600.0
  ], 
  [
   35175, 
   null, 
   "rapture", 
   "I'm guessing that this has to come from two different fronts for two different situations. I think that if you simply mean people eating on another's flesh, then no, nothing can be done. \n\n \n \n People?\n \n \n \n \n \n \n It's just like those people who drink blood. However, if someone were to kill another person for the purpose of eating them, then there are going to be legal consequences. I mean, euthanasia is not allowed - and this, to me, would be a similar issue.\n\n \n \n \n \n Somehow, I don't see a Canniable sitting back thinking about Consequences even if his meal is unconsentual", 
   {}, 
   34882, 
   null, 
   1077164460.0
  ], 
  [
   35808, 
   null, 
   "Adept", 
   "Well, of course the law can be used to stop people from eating one another, consentually or othewise. Make advertising of the type Armin Meiwes used illegal, make the taking of life illegal (If it isnt already) and all of the other attendant things also (eating of corpses, etc).\n \n The question is not 'Can we?' but 'Should we?'. If the two people are consenting, what right do we have to tell them no?", 
   {}, 
   35175, 
   null, 
   1077589620.0
  ], 
  [
   36359, 
   null, 
   "rapture", 
   "Well, of course the law can be used to stop people from eating one another, consentually or othewise. Make advertising of the type Armin Meiwes used illegal, make the taking of life illegal (If it isnt already) and all of the other attendant things also (eating of corpses, etc).\n \n The question is not 'Can we?' but 'Should we?'. If the two people are consenting, what right do we have to tell them no?\n\n \n \n Everything has rights, hey, rights to kill, rights to steal, rights to eat a corpse at meals, .......nightmarish\n \n \n I never thought the day would come, when one would have to get an alarm system for the grave", 
   {}, 
   35808, 
   null, 
   1077777480.0
  ], 
  [
   37187, 
   null, 
   "Tastyfish", 
   "Suppose it could come under humanely killed and treated meat as all food for human consumption comes under, hell they got Al Capone for tax evasion.", 
   {}, 
   36359, 
   null, 
   1078170300.0
  ], 
  [
   37704, 
   null, 
   "sundowner", 
   "I think the whole concept is fantastic. Imagine, one person wants to be killed and eaten, meats a cannibal, bam...dream fulfilled. Indeed, the question is why should we write laws to stop this sort of thing...look at the huge entertainment value here. Personally, I laugh at stories like this. It's not like this cannibal walked into the childrens ward at the hospital and held a youth BBQ, this was completely consentual. I say more power to them.", 
   {}, 
   37187, 
   null, 
   1078339440.0
  ], 
  [
   37734, 
   null, 
   "Tastyfish", 
   "Would be difficult to confirm consent, possibly if they had to alert some authority that this was their plan, though how this can be realy considered different from suicide I am not sure. Maybe if they wanted to keep it leagal they could require a certain period of counselling to make sure that it isn't merely a mental imbalance causing it in the same way a lot of suicides are caused by depression, and that they really want to go through with it. Get them and their cannibal to sign something making it official and clearly consenual, seems a little rare though for these kind of changes to be implemented.", 
   {}, 
   37704, 
   null, 
   1078346220.0
  ], 
  [
   37877, 
   null, 
   "Phunting", 
   "Everything has rights, hey, rights to kill, rights to steal, rights to eat a corpse at meals, .......nightmarish\n \n I never thought the day would come, when one would have to get an alarm system for the grave\n\n \n The whole point is that both people were consenting adults. If it is what they both wanted then what right do we have to say it makes us feel uncomfortable?\n \n And don't the 'fit for human consumption' laws only apply for the supply of meat, not meat killed, cooked and consumed individually. Might cause him a problem if he wanted to open a butcher shop but I don't think they'd be able to get him on that.", 
   {}, 
   36359, 
   null, 
   1078406580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Top of the food chain?", 
  "url": "http://www.4forums.com/political/crime-debates/1709-top-food-chain.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 1709, 
  "discussion_files": [
   [
    "21400.html", 
    "http://www.4forums.com/political/crime-debates/1709-top-food-chain-print.html"
   ]
  ], 
  "identifier": 1709
 }
]