[
 [
  [
   34744, 
   null, 
   "MikeH86", 
   "Every couple who wishes to be married should apply for a marriage liscence tomorrow, valentines day. If the town halls are inundated with requests then it will send a message that we GLBT people as a whole will not tolerate being made into 2nd class citizens", 
   {
    "post_info": {
     "post_title": "Support Gay Marriage"
    }
   }, 
   null, 
   null, 
   1076734620.0
  ], 
  [
   34753, 
   null, 
   "Parcum", 
   "Mike, I think you're misunderstanding the issue. Marriage's own DEFINITION means the union between a MAN and a WOMAN. It's not something where two random people who love eachother very much can do. This is different. I mean, Fred loves his mother very much, but they don't have marriage. \n \n Marriage is a privilage set for people who bring future generations into America. Homosexuals can't do this. If they want to have a civil union- so be it. I believe that they should have a right to do that- as would any couple who love eachother- be it two siblings (in a non sexual way of course) or two gays (in a sexual way). But saying they should have marriage is taking a sacred religious bond and making it simply a union between two people who want to have sex.\n \n This is not only for gays who cannot marry. If two people want to unite with no intentions on having children, they should have civil unions, not marriage.", 
   {}, 
   34744, 
   null, 
   1076745000.0
  ], 
  [
   34759, 
   null, 
   "mizmaxx", 
   "Marriage is a privilage set for people who bring future generations into America. \n\n Uh-oh. Is Parcum's next move going to be trying to \"counsel\" infertile couples to divorce?", 
   {}, 
   34753, 
   null, 
   1076746380.0
  ], 
  [
   34761, 
   null, 
   "Parcum", 
   "Mizmax, that's completely different. The infirtle couples who WANT to have children and are capable of doing so with sciencetific methods may be married. However, infirtle couples who don't have the capability and wont try to, shouldn't. Having children isn't a requirement for marriage- it's what marriage is all about.", 
   {}, 
   34759, 
   null, 
   1076747820.0
  ], 
  [
   34765, 
   null, 
   "daewoo", 
   "Mizmax, that's completely different. The infirtle couples who WANT to have children and are capable of doing so with sciencetific methods may be married. However, infirtle couples who don't have the capability and wont try to, shouldn't. Having children isn't a requirement for marriage- it's what marriage is all about.\n\n \n So, if having children isn't a requirement fro marriage, then gays should be OK, right? \n \n If it is what it is all about, if you marry a woman who is incapable of having children, even with scientific methods, then you are not really married?\n \n What about lesbians? They can have childre, with a little help from the local sperm bank. In facst, they can BOTH get pregnant. Does tht mean that a marriage between 2 lesbians is twice as valid?\n \n What if a couple of gay men adopt? Then is their marriage valid?\n \n If I have a vasectomy, am I divorced?\n \n You are confusing me. Please explain.", 
   {}, 
   34761, 
   null, 
   1076764620.0
  ], 
  [
   34780, 
   null, 
   "Parcum", 
   "If it is what it is all about, if you marry a woman who is incapable of having children, even with scientific methods, then you are not really married?\n \n\n \n Then you don't get married! You can be civilly united, but don't get married. \n \n \nWhat about lesbians? They can have childre, with a little help from the local sperm bank. In facst, they can BOTH get pregnant. Does tht mean that a marriage between 2 lesbians is twice as valid?\n\n \n But they didn't have sexual relations. This was from a sperm bank- there was nothing that made the two people create one being. \n \n Nonetheless, this is a side issue for future debates. My main point is homosexuality is a disorder that the government shouldn't be condoning. The government obviously doesn't condone pedophilia, poligamy, and incest. Why is the government condoning homosexuality?", 
   {}, 
   34765, 
   null, 
   1076785140.0
  ], 
  [
   34787, 
   null, 
   "daewoo", 
   "But they didn't have sexual relations. This was from a sperm bank- there was nothing that made the two people create one being. \n\n \n Sure there was, just one of the two people wasn't in the marriage. What if a man and a woman get married and he is sterile, and THEY use a sperm bank? \n \n \nNonetheless, this is a side issue for future debates. My main point is homosexuality is a disorder that the government shouldn't be condoning. The government obviously doesn't condone pedophilia, poligamy, and incest. Why is the government condoning homosexuality?\n\n \n Define \"disorder\". I haven't seen a bunch of gays running around yelling \"I'm cured, I'm cured. I have not seen them pawning hypnotic CD's on TV proclaiming \"you can QUIT being gay in one week\". I haven't seen gay-away pills. What do you supposes causes this disorder?\n \n My father in law has a dog that I beieve is gay. He is constantly trying to nail other male dogs. Even when there is a bitch in heat around, that dog is only interested in other males. Do you think if we took him to the vet he could give him somepills or something?", 
   {}, 
   34780, 
   null, 
   1076793600.0
  ], 
  [
   34791, 
   null, 
   "Parcum", 
   "Sure there was, just one of the two people wasn't in the marriage. What if a man and a woman get married and he is sterile, and THEY use a sperm bank? \n\n \n Though I generally define this as immoral, it would be better than two lesbians using a sperm bank. Why is this? It is unnatural in the human race and unusual in the Animal Kingdom (in some species, two mother raise the children while the fathers go mate with other women, or hunt, et cetera) for us to have two parents of the same sex. Obviously, mother nature made is in a way that a mom and dad make kids, and in the human race both parents raise the kids. There are specific studies that show that it causes the same disorder on children. According to the Associated press \"new study by two University of Southern California sociologists says children with lesbian or gay parents(..)are probably more likely to explore homosexual activity themselves(...)[and] grow up to be more open to homoerotic relations.\". Further, homosexuals have problematic households. According to Journal of the American Medical Association , \"[P]eople with same-sex sexual behavior are at greater risk for psychiatric disorders.\" Why should children have to suffer life with their parents having mental illnesses or they having these disorders as well?\n \n Homosexuals also don't live as long as heterosexuals. The average age among homosexuals is betweeen 55-65 years. When a child goes to college, he will need his parents to guide him... but they will be dead. He will have no guidance as a young adult. Children raised in homosexual lifestyles have higher chances of having gender confusion, sexual confusion, losing a parent to suicide, drug abuse, STDs, or mental illness. I stand firm in my belief that it is extremely nocuous for homosexuals to adopt children. \n \n \nDefine \"disorder\". I haven't seen a bunch of gays running around yelling \"I'm cured, I'm cured. I have not seen them pawning hypnotic CD's on TV proclaiming \"you can QUIT being gay in one week\". I haven't seen gay-away pills. What do you supposes causes this disorder?\n\n \n Homosexuality is a disorder. People certainly arn't born with this sexuality (or any sexuality for that matter... sexuality doesn't appear until the third adolecence. Before then, any remote \"sexual\" activity isn't really sexual at all, but simply childhood experimentation.) Homosexuality has to do with an inbalance of parental figures, it could be slight, it could be obvious. It doesn't matter. Some homosexuals come from families where they were exposed to both parents seemingly equally, other come from families where the parental exposure was not equal. It depends on how much the child needs to see one of the parents, and which parent was around when the child needed it's parent most. However, there are clear statistics show that an astounding number of homosexuals were abused as children. According to a research done by California School of Professional Psychology (an extremely pro-homosexual and liberal school), with 942 nonclinical adult homosexuals (Comparative data of childhood and adolescence molestation in heterosexual and homosexual persons, Archives of Sexual Behavior), 46% of homosexual men and 22% of homosexual women reported having been molested as children. This is compared to 7% of heterosexual men and 1% of heterosexual women who were moelsted as children. \n \n Contrary to your peurile belief, not all disorderes (especially mental ones) are treatable by pills. As a matter of fact, homosexuality is not treatable by pills. Neither is pedophilia. Does that mean pedophilia is not a disorder, but people are \"born\" pedophiles? Homosexuality, however, can be treated with meetings with psychologists. Event the liberal Howard Stern believes that homosexuality can be cured. \n \n The problems with the homosexual disorder are endless.", 
   {}, 
   34787, 
   null, 
   1076797020.0
  ], 
  [
   34803, 
   null, 
   "JakeCJB", 
   "Though I generally define this as immoral, it would be better than two lesbians using a sperm bank. Why is this? It is unnatural in the human race and unusual in the Animal Kingdom (in some species, two mother raise the children while the fathers go mate with other women, or hunt, et cetera) for us to have two parents of the same sex. Obviously, mother nature made is in a way that a mom and dad make kids, and in the human race both parents raise the kids. There are specific studies that show that it causes the same disorder on children. According to the Associated press \"new study by two University of Southern California sociologists says children with lesbian or gay parents(..)are probably more likely to explore homosexual activity themselves(...)[and] grow up to be more open to homoerotic relations.\".\n\n \n They are probably more likely to openly explore, because it is more accepted. It doesn't say it makes the children gay or lesbian.\n \n \nFurther, homosexuals have problematic households. According to Journal of the American Medical Association , \"[P]eople with same-sex sexual behavior are at greater risk for psychiatric disorders.\" Why should children have to suffer life with their parents having mental illnesses or they having these disorders as well?\n\n \n Results. Homosexual and bisexual individuals more frequently than heterosexual persons reported both lifetime and day-to-day experiences with discrimination. Approximately 42% attributed this to their sexual orientation, in whole or part. Perceived discrimination was positively associated with both harmful effects on quality of life and indicators of psychiatric morbidity in the total sample. Controlling for differences in discrimination experiences attenuated observed associations between psychiatric morbidity and sexual orientation. \n \n Conclusions. Higher levels of discrimination may underlie recent observations of greater psychiatric morbidity risk among lesbian, gay, and bisexual individuals.\n http://www.ajph.org/cgi/content/abstract/91/11/1869\n \n The lack of diagnosis and treatment of mental illness in African-American youths is particularly troubling in light of a 1998 study on suicide in African-American youths published by the Centers for Disease Control and Prevention (CDC). One of the major risk factors for suicide is untreated depression, and the CDC study revealed that the suicide rate for black youths ages 10-14 jumped 233% between 1980 and 1995, compared to an increase of 126% for whites. During that same period, the suicide rate for black adolescent males ages 15-19 increased 146%, compared to a 22% rise in white teenage boys.\n http://www.cbcfhealth.org/content/contentID/1099\n \n Differences in the health of blacks and whites are many and varied. Blacks have more undetected diseases, higher disease and illness rates (from infectious conditions such as tuberculosis and sexually transmitted diseases), more chronic conditions (such as hypertension and diabetes), and shorter life expectancies than whites (78,79,80,81). Morbidity and mortality rates for blacks from many conditions (cancer, HIV/AIDS, pneumonia, and homicide) exceed those for whites (80,82). These findings exist even though black females are generally less likely than white females to report risk behaviors such as smoking cigarettes, consuming alcohol, or using other substances (79,83,84,85). \n \n Hispanic and white women have a higher lifetime prevalence of depression (24 percent and 22 percent, respectively) than black women (16 percent). Furthermore, when surveyed in 1991, nearly twice as large a share of Hispanic women (11 percent) reported being depressed as did black and white women (nearly 6 percent and 5 percent, respectively) (80). \n \n A 1993 survey found Hispanic women (53 percent) more likely to suffer from severe depression than either non-Hispanic black (47 percent) or white (37 percent) women (13).\n http://www.4woman.gov/owh/pub/woc/toc.htm \n \n Apparently a lot of things can cause more mental illness and shorter life expectencies, disease, etc., in different groups of people. This does not mean these groups should not have children.\n \n \nHomosexuals also don't live as long as heterosexuals. The average age among homosexuals is betweeen 55-65 years. When a child goes to college, he will need his parents to guide him... but they will be dead.\n \n \n Which study was this from? This most certainly is not the average age of homosexuals. Sexual orientation does not determine life expectency\n \n \nHomosexuality is a disorder. People certainly arn't born with this sexuality (or any sexuality for that matter... sexuality doesn't appear until the third adolecence. Before then, any remote \"sexual\" activity isn't really sexual at all, but simply childhood experimentation.) Homosexuality has to do with an inbalance of parental figures, it could be slight, it could be obvious. It doesn't matter. Some homosexuals come from families where they were exposed to both parents seemingly equally, other come from families where the parental exposure was not equal.\n\n \n In other words, homosexuals do not come from one type of family, but from as many different types of families as any other group of people. Why do those who do not have the \"parental imbalance\" become homosexuals? Why aren't all those with parental imbalances homosexual?", 
   {}, 
   34791, 
   null, 
   1076811060.0
  ], 
  [
   34808, 
   null, 
   "mizmaxx", 
   "Uh-oh. Is Parcum's next move going to be trying to \"counsel\" infertile couples to divorce?\n\n \n \nThe infirtle couples who WANT to have children and are capable of doing so with sciencetific methods may be married. However, infirtle couples who don't have the capability and wont try to, shouldn't.\n\n AHA! Just as I suspected. Next, Parcum will be picketing people's homes that are married and have no kids by choice, joining his fanatic buddies in efforts to make the gov't include the words \"heterosexuals who to have children\" in the definition of marriage. Where does this zealotry end? Is there any limit to the amount of pompous window-peeking on all our sexual activities?\n \n \nHomosexuality has to do with an inbalance of parental figures, it could be slight, it could be obvious. It doesn't matter.\n\n It could even be so slight that nobody can see it! Maybe your mother wore pants! Maybe your father cried at sappy movies! Maybe it was little green men who made you gay! Who knows? Without evidence, it's all just conjecture, but let's police parents to make sure the Daddies are macho and the Mommies are feminine enough, or else it'll be a bit gay world! emoticon_rolleyes\n \n \nAccording to the Associated press \"new study by two University of Southern California sociologists says children with lesbian or gay parents(..)are probably more likely to explore homosexual activity themselves(...)[and] grow up to be more open to homoerotic relations.\"\n\n See, children raised by XXXXXX are actually heathier than those raised by straight parents! emoticon_xagree \n \n \nEvent (sic) the liberal Howard Stern believes that homosexuality can be cured. \n\n LOL! Well, if Howard Stern the \"liberal\" said it, it must be true! ROFL\n \n \nThis is compared to 7% of heterosexual men and 1% of heterosexual women who were moelsted as children. \n\n You forgot the part where it says \"molested by someone of the same sex in childhood\". Since homosexual molestion is as stigmatized as any consensual homosexual behavior, it makes sense to presume that people who are homosexual would be much more likely to disclose homosexual molestation that hets.\n \n In fact, same-sex child molestation in women is reported so rarely that it is doubtful that within a vast study one could make conclusions of causality. In other words, the smaller the sample population (and reports of same-sex female child molestation are very small in number), the more likely correlative factors are to distort the results. \n \n In the same publication (Archives of Sexual Behavior) a study claimed a relationship between penis size and male homosexual orientation. Who knew?\n \n \nDespite elevated rates of depression and risk of suicide attempts, most gays and lesbians suffer no psychological disorder (Sandfort & others, 2001).\n \n \n \nSee if you can anticipate the consensus that has emerged from hundreds of research studies by responding yes or no to the following questions:\n \n 1. Is homosexuality linked with problems in a child's relationships with parents, such as with a domineering mother and an\n Note that the scientific question is not \"What causes homosexuality?\" (or \"What causes heterosexuality?\") but \"What causes differing sexual orientation?\" In pursuit of answers, psychological science compares the backgrounds and physiology of people whose sexual orientations differ.\n ineffectual father, or a possessive mother and a hostile father?\n 2. Does homosexuality involve a fear or hatred of people of the other gender, leading individuals to direct their sexual desires toward members of their own sex?\n 3. Is sexual orientation linked with levels of sex hormones currently in the blood?\n 4. As children, were many homosexuals molested, seduced, or otherwise sexually victimized by an adult homosexual?\n \n The answer to all these questions appears to be no (Storms, 1983). Consider the findings of lengthy Kinsey Institute interviews with nearly 1000 homosexuals and 500 heterosexuals (Bell & others, 1981; Hammersmith, 1982). The investigators assessed nearly every imaginable psychological cause of homosexuality?parental relationships, childhood sexual experiences, peer relationships, dating experiences. Their findings: Apart from homosexuals' somewhat greater nonconformity, the reported backgrounds of homosexuals and heterosexuals were similar. Homosexuals were no more likely to have been smothered by maternal love, neglected by their father, or sexually abused. And consider this: If \"distant fathers\" were more likely to produce homosexual sons, then shouldn't boys growing up in father-absent homes more often be gay? (They are not.) And shouldn't the rising number of such homes have led to a noticeable increase in the gay population? (It has not.)\n", 
   {}, 
   34803, 
   null, 
   1076817360.0
  ], 
  [
   34823, 
   null, 
   "Parcum", 
   " AHA! Just as I suspected. Next, Parcum will be picketing people's homes that are married and have no kids by choice, joining his fanatic buddies in efforts to make the gov't include the words \"heterosexuals who to have children\" in the definition of marriage. Where does this zealotry end? Is there any limit to the amount of pompous window-peeking on all our sexual activities?\n\n \n This is not a religious belief. Catholicism encourages all- infertile or not- to marry. This is just my personal belief. Of course, I don't mean for it to be practiced. My point is that the government shouldn't encourage mental disorders.\n \n \n It could even be so slight that nobody can see it! Maybe your mother wore pants! Maybe your father cried at sappy movies! Maybe it was little green men who made you gay! Who knows? Without evidence, it's all just conjecture, but let's police parents to make sure the Daddies are macho and the Mommies are feminine enough, or else it'll be a bit gay world! \n\n \n Well understand this premise:\n \n 1) Homosexuality is not genetic.\n 2) Sexuality appears in the third adolescence\n 3) An astounding amount of people become homosexual on account of childhood molestation.\n \n We assert that homosexuality has to do with the psychological times in the childhood. \n \n Wow... I never have seen so much baloney before..", 
   {
    "unicode_changes_made": true
   }, 
   34808, 
   null, 
   1076832780.0
  ], 
  [
   34832, 
   null, 
   "mizmaxx", 
   "An astounding amount of people become homosexual on account of childhood molestation.\n\n You have one study that shows a possible correlation, whereas numerous studies do not- you haven't come anywhere near demonstating causality.\n \n \nWow? I never have seen so much baloney before..\n\n I don't know why you post on subjects you don't know anything about either... ;)", 
   {}, 
   34823, 
   null, 
   1076845020.0
  ], 
  [
   34852, 
   null, 
   "Parcum", 
   " \n \n You have one study that shows a possible correlation, whereas numerous studies do not- you haven't come anywhere near demonstating causality.\n \n\n \n Darling, I have many more. Journal of the American Medical Association did a study of 279 homosexual AIDS patients, and half experienced sexual activity with an adult at the age of 16, and about 20% by the age of 10. \n \n \n Results. Homosexual and bisexual individuals more frequently than heterosexual persons reported both lifetime and day-to-day experiences with discrimination. Approximately 42% attributed this to their sexual orientation, in whole or part. Perceived discrimination was positively associated with both harmful effects on quality of life and indicators of psychiatric morbidity in the total sample. Controlling for differences in discrimination experiences attenuated observed associations between psychiatric morbidity and sexual orientation.\n\n \n This goes back to my original argument- homosexuality is a disorder that the government shouldn't condone. Adoption agencies should take into consideration if a parent is homosexual just like if the parent is a pedophile, suffers from depression, et cetera. So what if they suffer 'discrimination'? They only suffer discrimination because they are so open about something horrible. If I were to go around the streets of San Francisco saying \"I'm conservative/catholic and proud!\" I would be shot. This, however, is straying off to a different issue altogether.\n \n Concerning your homosexual suicide-discrimination link, that's not the issue. Homosexuals are suffering from a mental disorder, yes, suicide is common. If we tell children that their experiences are normal, and genetically made, then they're going to think that because that is so, they will always be homosexual, and commit suicide. The truth is, homosexuality can be cured. If these teens were treated, or just spoken the truth, I guarantee suicide rates will decrease. \n \n \n Apparently a lot of things can cause more mental illness and shorter life expectencies, disease, etc., in different groups of people. This does not mean these groups should not have children.\n\n \n The problem is that homosexuals all have a direct problem that has to do with sexuality. You're putting children at risk. It's not like banning women from adopting- it's like banning women suffering from depression from adopting. \n \n \n Which study was this from? This most certainly is not the average age of homosexuals. Sexual orientation does not determine life expectancy.\n\n \n It has to do with promiscuity and thus leading to STDs. Homosexuals are generally more promiscuous- this is an undeniable fact. My sources come from all over- some say age 65, some say lower than that, so I generalized it. Why is it that 46% of AIDS patients contracted AIDS from homosexual intercourse, and only 27% of them by heterosexual intercourse, when heterosexuals make up 95% of the population? Obviously there's an issue of promiscuity. \n \n \n In other words, homosexuals do not come from one type of family, but from as many different types of families as any other group of people. Why do those who do not have the \"parental imbalance\" become homosexuals? Why aren't all those with parental imbalances homosexual?\n\n \n Every child is different. It really is all dependent. But we know for certain homosexuality isn't from birth, as that would mean people are also born pedophiles, born alcoholics, born narcotics, et cetera. This is practically saying some children are born evil and some children are born good. We also know from other genetic samples, and the distinction between the brain and DNA at conception.", 
   {
    "unicode_changes_made": true
   }, 
   34832, 
   null, 
   1076889000.0
  ], 
  [
   34863, 
   null, 
   "JakeCJB", 
   "Darling, I have many more. Journal of the American Medical Association did a study of 279 homosexual AIDS patients, and half experienced sexual activity with an adult at the age of 16, and about 20% by the age of 10.\n\n \n Those people who are sexually abused as children, are more likely to engage in sexually risky behaviour that would lead to AIDS. This only looks at a sample of homosexuals who have AIDS. There are many heterosexuals just under the age of consent(16)who engage in sex with young adults who are just past the age of consent. Actually, by 16 one has reached the age of consent in many countries. This study doesn't prove homosexuals are generally more the victims of abuse. If anyone is the victim of sexual abuse as a child, only the sexual predator who performs the abuse has any blame. \n \n \nThis goes back to my original argument- homosexuality is a disorder that the government shouldn't condone. Adoption agencies should take into consideration if a parent is homosexual just like if the parent is a pedophile, suffers from depression, et cetera.\n\n \n Homosexuality is not a disorder. The homosexual orientation itself does not cause depression, etc. Sometimes the way people are treated can cause depression, the key word being sometimes.\n \n \nSo what if they suffer 'discrimination'? They only suffer discrimination because they are so open about something horrible. If I were to go around the streets of San Francisco saying \"I'm conservative/catholic and proud!\" I would be shot.\n\n \n There was discrimination against gays and lesbians long before we were \"open\". So you keep your Catholicism to yourself, and you never reveal it to anyone? I have never had homosexuals at my door trying to recruit me, however I have had Christians at my door trying to recruit me. I've seen Christians downtown handing out pamphlets about their religion. \n \n \nConcerning your homosexual suicide-discrimination link, that's not the issue. Homosexuals are suffering from a mental disorder,\n\n \n No, homosexuals do not suffer from a mental disorder. It was a link about increased suicides among African-Americans.\n \n \nIf we tell children that their experiences are normal, and genetically made, then they're going to think that because that is so, they will always be homosexual, and commit suicide. The truth is, homosexuality can be cured.\n\n \n All major health professional organizations have rejected the notion homosexuality can be cured, because it is not a disease. But how do you think one would one go about \"curing\" homosexuality? \n \n \njust spoken the truth\n\n \n Why do you think so many have not been convinced by your \"truth\" that homosexuality is just simply, \"horrible\", \"not normal\", etc?\n \n \nThe problem is that homosexuals all have a direct problem that has to do with sexuality.\n\n \n Right. All simply have a \"problem\", all are simply \"horrible\", all are simply fill in the blank.\n \n \nIt has to do with promiscuity and thus leading to STDs. Homosexuals are generally more promiscuous- this is an undeniable fact. My sources come from all over- some say age 65, some say lower than that, so I generalized it. Why is it that 46% of AIDS patients contracted AIDS from homosexual intercourse, and only 27% of them by heterosexual intercourse, when heterosexuals make up 95% of the population? Obviously there's an issue of promiscuity.\n\n \n Lesbians are the least likely to have AIDS anywhere in the world. So with the logic you use, perhaps we should only allow lesbians to raise children. The proportion of heterosexuals with AIDS has increased dramatically over the years. AIDS deaths have also decreased dramatically over the last several years from better treatment. Much stats come from before this period when AIDS was hitting gay men hard, without good treatment. African-Americans have about half of the new cases of AIDS in the US. Contracting AIDS has nothing to do with the gender or skin colour of the partners. It is contracted through risky sexual behaviour. So why wouldn't one encourage monogomous marriages for gay men, or anyone else, including perhaps raising a child? That's one way to have safe sex. Another is to use a condom.\n \n \nEvery child is different. It really is all dependent. But we know for certain homosexuality isn't from birth, as that would mean people are also born pedophiles, born alcoholics, born narcotics, et cetera.\n\n \n Or born heterosexual, or born liking the colour yellow or green beans. Does it matter? We have good reasons for telling drug addicts and pedophiles to not do what they do. It's the trait itself that causes harm. There is no way to practice \"safe alcoholism\" nor is there a way to put a condom on or be in a mongomous relationship to practice \"safe pedophilia\" that is loving and non-harmful.", 
   {
    "unicode_changes_made": true
   }, 
   34852, 
   null, 
   1076903280.0
  ], 
  [
   34864, 
   null, 
   "JakeCJB", 
   "In other words, homosexuals do not come from one type of family, but from as many different types of families as any other group of people. Why do those who do not have the \"parental imbalance\" become homosexuals? Why aren't all those with parental imbalances homosexual?\n \n \n \nEvery child is different. It really is all dependent.\n\n \n So you don't know.", 
   {}, 
   34852, 
   null, 
   1076904240.0
  ], 
  [
   34880, 
   null, 
   "mizmaxx", 
   "Hey, Jake, have you seen the movie \"But I'm a Cheerleader!\" ? About a cheerleader whose family sends her to one of those \"ex-homosexual\" camps, where she meets her true love, and they live queerly ever after... Ru Paul stars, not in drag, as the male \"ex-gay\" role model- ROFLMAO! It's one of my fave romantic comedies, right up there with Benny & Joon...\n \n Not to mention that the butch lead is sooooooo hot! Very nice eye candy throughout- if you haven't seen it yet, drop everything and find it!", 
   {}, 
   34864, 
   null, 
   1076918880.0
  ], 
  [
   34883, 
   null, 
   "JakeCJB", 
   "Yes, mizmaxx, I saw the film. The lead was a very good actress. The son of the woman who ran the camp I found to be good eye candy.\n \n They taught the young men at the ex-homosexual camp to play sports and fix cars, and they taught the young women how to vacuum and change diapers.\n \n The funniest thing I've ever seen was a documentary(can't remember the title)on the subject of ex-gay and ex-lesbian camps. The lesbians were being given new hairstyles, because it was thought that making them very feminine and glamourous would make them heterosexual. It seems a lot to demand from a hairspray.", 
   {}, 
   34880, 
   null, 
   1076924280.0
  ], 
  [
   34900, 
   null, 
   "Hypocrit", 
   "Mike, I think you're misunderstanding the issue. Marriage's own DEFINITION means the union between a MAN and a WOMAN. It's not something where two random people who love eachother very much can do. This is different. I mean, Fred loves his mother very much, but they don't have marriage. \n \n Marriage is a privilage set for people who bring future generations into America. Homosexuals can't do this. If they want to have a civil union- so be it. I believe that they should have a right to do that- as would any couple who love eachother- be it two siblings (in a non sexual way of course) or two gays (in a sexual way). But saying they should have marriage is taking a sacred religious bond and making it simply a union between two people who want to have sex.\n \n This is not only for gays who cannot marry. If two people want to unite with no intentions on having children, they should have civil unions, not marriage.\n\n \n \n I'd be interested in finding out where you got the idea that marriage is based on child producing guidelines. That surely isn't Biblical. Marriage is a joining between a man and a woman. Children are never mentioned as part of the marriage process. NEVER. If you do find something in the Bible that says this, please, let me know.", 
   {}, 
   34753, 
   null, 
   1076958720.0
  ], 
  [
   35004, 
   null, 
   "VeniVedi", 
   "Every couple who wishes to be married should apply for a marriage liscence tomorrow, valentines day. If the town halls are inundated with requests then it will send a message that we GLBT people as a whole will not tolerate being made into 2nd class citizens\n\n I think we should not only allow GAYs to have legal marriage rights but also those who want to practice insist as well as all who want to practice polygamy. Let us not stop there let us sanction union between human and animals. After all I love my Dog and my Parrot. Why stop with GAYs? \n By the way where does the term GAY come from for homosexuals.", 
   {}, 
   34744, 
   null, 
   1077042480.0
  ], 
  [
   35024, 
   null, 
   "Hypocrit", 
   "I think we should not only allow GAYs to have legal marriage rights but also those who want to practice insist as well as all who want to practice polygamy. Let us not stop there let us sanction union between human and animals. After all I love my Dog and my Parrot. Why stop with GAYs? \n By the way where does the term GAY come from for homosexuals.\n\n \n Oh my. Where to begin. First of all, being homosexual has abso-f'n-lutely nothing to do with beastiality. I get so tired of that correlation. Homosexuals are humans that have sex with the humans of the same sex. Nothing to do with animals. Next time you eat a hamburger, let's arrest you for accessory to murder, after all, killing a cow is just as illegal as killing humans, at least according to your logic. \n As for the word \"gay\", it started as an insult towards the homosexual community. Similarly to \"nigger\", it was adopted by the very people it insulted to take some of the power out of the word. Now, with that said, I do NOT belittle the racist struggle by making that comparison. I know that the African-Americans have struggled thru much more than the homosexual community. I don't make the comparison according to scale, but to the logic of it.", 
   {}, 
   35004, 
   null, 
   1077058620.0
  ], 
  [
   35069, 
   null, 
   "Parcum", 
   " Those people who are sexually abused as children, are more likely to engage in sexually risky behaviour that would lead to AIDS. This only looks at a sample of homosexuals who have AIDS. There are many heterosexuals just under the age of consent(16)who engage in sex with young adults who are just past the age of consent. Actually, by 16 one has reached the age of consent in many countries. This study doesn't prove homosexuals are generally more the victims of abuse. If anyone is the victim of sexual abuse as a child, only the sexual predator who performs the abuse has any blame.\n\n \n Jake, that was one source out of many. First of all, of course many teenagers have premarital sex- they have \"raging hormones\"- basically, an excuse to be sexually active so often. Homosexuals, however, are always sexually active, regardless of age. Once again, 500/2000 homosexuals have AIDS compared to about 2/300. \n \n \n Homosexuality is not a disorder. The homosexual orientation itself does not cause depression, etc. Sometimes the way people are treated can cause depression, the key word being sometimes.\n\n \n I'm not at all saying that homosexuality causes disorders such as depression- I'm saying homosexuality in it's essence is a disorder. Depression is a disorder, and it obviously doesn't cause other disorders directly (although depression, like homosexuality, can lead to other disorders, but indirectly only). \n \n So why am I saying evolution is a disorder? First, generally speaking homosexuals are feminine. I cannot give you any solid evidence, because obviously you cannot call men up asking if they are feminine and gay, firstly because they wont want to admit it, and secondly because they usually don't realize it. Most of the population acknowledges that gay men are feminine- I have yet to meet one man who is not feminine. I will say this again, every single gay man I met in my life (and we're talking at least 3 dozen homosexuals here) was feminine. I have also never seen a masculine homosexual (and that's saying a lot since I live in San Francisco and see them all over. Of course, there are other ways to tell if somebody is feminine besides their voice), although I'm sure some of them exist. So how is this relevant to the disorder? The reason why people become homosexual is because they lack masculinity, and trying to regain masculinity by being close to other men. Unfortunately, the only way they know how is to have sexual relations with them. This is reason one.\n \n \n Secondly, homosexuality is against nature. We've already talked about Bagemihl's unfounded theories are homosexuals in the animal kingdom, and we all know now that he was wrong, and there is no evidence that animals are ever homosexual, though they may have sexual activity with the same sex. We must remember, same-sex sexual activity doesn't mean that you are homosexual- even the famous Saint, Augustine, participated in sexual acts with the same gender. He wasn't at all homosexual or bisexual. He was simply active sexually. If you were sexually passive, you had sex with women, and had sex less often. If you were sexually active, you had sex with men, women, Mexicans, dogs, whatever you can get your hands on. Clearly, evolution clearly defines sexual activity for reproduction. It is not, contrary to Bergmihl's invalid theory, simply coincidence that animals have sexual relations (if that was the case, everyone would be extinct!)\n \n \n There was discrimination against gays and lesbians long before we were \"open\". So you keep your Catholicism to yourself, and you never reveal it to anyone? I have never had homosexuals at my door trying to recruit me, however I have had Christians at my door trying to recruit me. I've seen Christians downtown handing out pamphlets about their religion.\n\n \n Yes, actually. I never tell people I'm Catholic or conservative. Ever. If I do I often get discriminated against. I learned my lesson at school last semester the hard way. My teacher was a full blown liberal atheist, I was a conservative Catholic. Well, to make a long story I ended up getting a C+ in English- which is one of my favorite subjects, next to only History. It brought my grade down from a 3.5 to a 3.25, which XXXXXX me off. \n \n Oddly enough, there are a lot of \"Recruitment\" centers for homosexuals. I mean obviously they don't go door to door, or say \"become homosexual because...\" They do it in much more passive ways- one way is by going to high schools on safe-sex day and telling teens that because they have homosexual thoughts they're automatically homosexual or bisexual. The left is trying to convince people that homosexuals are perfectly fine, which is simply not the case.\n \n \n All major health professional organizations have rejected the notion homosexuality can be cured, because it is not a disease. But how do you think one would one go about \"curing\" homosexuality?\n\n \n Get is straight- homosexuality isn't a disease, it's a mental disorder. \n \n First of all, simply because most major professional health organizations believe homosexuality is not a disorder (Some organizations believe homosexuality can be cured, though most of them are very liberal and believe homosexuality is not curable. NARTH, IHF...). WE must understand that all of these psychiatric organizations are liberal, so it's no wonder most mental health organizations believe homosexuality is a natural human event. Homosexuality is very curable, but very difficult. But simply because there's no special medication or clear war to treat homosexuality doesn't mean it's not curable. There are literally thousands of mental disorders that are not curable or treatable. \n \n \n Lesbians are the least likely to have AIDS anywhere in the world. So with the logic you use, perhaps we should only allow lesbians to raise children.\n\n \n AIDS is one STD among many. Lesbians get many other sexual diseases besides AIDS. Ovarian cancer, for instance, can be cause by lesbian sexual activity. But that's beside the issue- what kid wouldn't want a father? A father is very important in a child's life, and a mother can't ever replace that. A father is necessary to keep the child's balance with the mother. \n \n \nThe proportion of heterosexuals with AIDS has increased dramatically over the years. AIDS deaths have also decreased dramatically over the last several years from better treatment. Much stats come from before this period when AIDS was hitting gay men hard, without good treatment. African-Americans have about half of the new cases of AIDS in the US. Contracting AIDS has nothing to do with the gender or skin colour of the partners. It is contracted through risky sexual behaviour. So why wouldn't one encourage monogomous marriages for gay men, or anyone else, including perhaps raising a child? That's one way to have safe sex. Another is to use a condom.\n\n \n Once again, AIDS is one disorder among many that homosexuals get. Should blacks be allowed to adopt? If they have an illness, of course not, and the same goes for any other ethnicity. And if you as promiscuous as homosexuals are, then you shouldn't adopt. Marriage isn't going to solve the issue of promiscuity among homosexuals. While the average non-married heterosexual American has around 10-20 sexual partners, the average homosexual American has hundreds. Once again, this is evidence that homosexuality is simply not suitable for children. Children would have to see their parents suffer from a disorder, and decide whether what daddy and dad are doing is good or not. \n \n \n Or born heterosexual, or born liking the colour yellow or green beans. Does it matter? We have good reasons for telling drug addicts and pedophiles to not do what they do. It's the trait itself that causes harm. There is no way to practice \"safe alcoholism\" nor is there a way to put a condom on or be in a mongomous relationship to practice \"safe pedophilia\" that is loving and non-harmful.\n\n \n Once again, heterosexuality is evolutionarily sound. Liking the color yellow or green beans is also evolutionarily sound. Being homosexual and being prone to pedophila, is not.", 
   {
    "unicode_changes_made": true
   }, 
   34864, 
   null, 
   1077083700.0
  ], 
  [
   35089, 
   null, 
   "mizmaxx", 
   "Jake, that was one source out of many. \n\n So, where are they? Most of the studies I've ever seen disagree with you, as I posted.\n \n \n Most of the population acknowledges that gay men are feminine- I have yet to meet one man who is not feminine.\n\n That's empirical. emoticon_rolleyes I've met plenty of butch men. There's a whole fetish for manly men- they call them \"bears\". They just don't \"stick out\" as much as queens.\n \n \n Secondly, homosexuality is against nature. We?ve already talked about Bagemihl?s unfounded theories are homosexuals in the animal kingdom, and we all know now that he was wrong, and there is no evidence that animals are ever homosexual\n\n This argument is so tired, it's at death's door. Just because animals don't do something, doesn't mean it's \"against nature\". Animals don't marry heterosexually either, most are polygamous, is monogamous marriage against nature? You're pathetically grasping at straws...\n \n \nBut that?s beside the issue- what kid wouldn?t want a father?\n\n One who's perfectly happy with their parents as they are?\n \n \n Once again, heterosexuality is evolutionarily sound. Liking the color yellow or green beans is also evolutionarily sound. Being homosexual and being prone to pedophila, is not.\n\n LOL! Liking green isn't evolutionarily sound when yuor environment is snowy and your green coat makes you visible to predators. Being heterosexual is not \"evolutionarily sound\" (in terms of individual reproduction) if you're in love with a person who's infertile. \n \n Pedophiles are more commonly heterosexual than homosexual.", 
   {}, 
   35069, 
   null, 
   1077093180.0
  ], 
  [
   35092, 
   null, 
   "mizmaxx", 
   "The lead was a very good actress. The son of the woman who ran the camp I found to be good eye candy.\n\n LOL! Yeah, remember the scenes where he was doing all the maintenance work right beside the boys class? With his big rake pole and chain saw? ROFL! What was his character's name? Rocky? Something like that... \n \n \n The funniest thing I've ever seen was a documentary(can't remember the title)on the subject of ex-gay and ex-lesbian camps. The lesbians were being given new hairstyles, because it was thought that making them very feminine and glamourous would make them heterosexual. It seems a lot to demand from a hairspray.\n\n OMG! These things seriously scare me! I couln't believe it when I found out that these things actually exist, I thought for a while it was a joke. I actually have friends who met at such a thing- just like the movie! \n \n Anyway, I grew up pretty sheltered from religious zealots. Quebec is one of the least religious provinces in Canada by far, and going to the States is like crossing the line into some twisted parallel universe hell of bigots. Even going to the Prairies was totally shocking to me. My sister teaches at a school in the same town as a Bible college, and when she told me that some of the neighborhood kids were pulled out of school because the teacher talked about evolution, that was the first I had ever heard about ppl who thought that. I know lots of XXXXXX move to big cities, but I was lucky enough to grow up in one....", 
   {}, 
   35089, 
   null, 
   1077093660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Support Gay Marriage", 
  "url": "http://www.4forums.com/political/gay-rights-debates/1752-support-gay-marriage.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 1752, 
  "discussion_files": [
   [
    "20003.html", 
    "http://www.4forums.com/political/gay-rights-debates/1752-support-gay-marriage-print.html"
   ], 
   [
    "20004.html", 
    "http://www.4forums.com/political/gay-rights-debates/1752-support-gay-marriage-2-print.html"
   ]
  ], 
  "identifier": 1752
 }
]