[
 [
  [
   35119, 
   null, 
   "AMD4EVER", 
   "http://www.truemajority.org/oreo\n \n This guy really does make sense and does so using oreo cookies! Why exactly does our military need so much money when such vital programs as our school system and search for alternative energy get so little?", 
   {
    "post_info": {
     "post_title": "True Majority - high military spending"
    }
   }, 
   null, 
   null, 
   1077129540.0
  ], 
  [
   35568, 
   null, 
   "Morfos", 
   "Thats a very good point. I think we should spend perhapse 20 cookies on the Pentagon, that way we can use so much more on other things. Conservatives spend rediculous amounts on the military, leaving little money left to spend on everything else! Americans need to get brains to realize that we don't need this much military funding!", 
   {}, 
   35119, 
   null, 
   1077485460.0
  ], 
  [
   35619, 
   null, 
   "AMD4EVER", 
   "Thats a very good point. I think we should spend perhapse 20 cookies on the Pentagon, that way we can use so much more on other things. Conservatives spend rediculous amounts on the military, leaving little money left to spend on everything else! Americans need to get brains to realize that we don't need this much military funding!\n\n \n Also if we spent less on military we could both improve all those areas and lower taxes which in turn will boost our economy and help us pay down the debt faster. Efficiency would increase dramatically which in turn will give our government more tax money meaning that soon we would be able to increase military spending over time.", 
   {}, 
   35568, 
   null, 
   1077515100.0
  ], 
  [
   35648, 
   null, 
   "Broker", 
   "The role of the federal government is defense, not to fund education and healthcare.\n 1. Federal spending does nothing to improve schools. It keeps going up and schools keep getting worse. Money doesn't solve the problem.\n 2. Head start is a terrible program. No cookies for that. It doesn't help kids at all in the end, as studies have shown, which is why it has been scaled down.\n \n Yes, we are the world's top military spender, so good for us. That allows us to march onto a battlefield anywhere in the world within a few days and take entire countries with little loss of life.\n \n People didn't think Germany was a threat before WW II either. You never know what can happen.\n \n So moving cookies is just a waste of money... just menas less military technology for civillian use in the future.", 
   {}, 
   35619, 
   null, 
   1077543000.0
  ], 
  [
   35651, 
   null, 
   "AMD4EVER", 
   "Our money being spent on military is mostly wasted money. Sure we are able to take over entire countries with few lives lost but look at what it makes us do. To justify military spending we use our military far more often than we should ie Iraq. If we cut back on our military spending it would make us look a whole lot better to the rest of the world and provide us with more money to pay down the debt and cut taxes even if the federal government decided to do nothing else with the money. A paranoid fear that another Germany will arise is beyond crazy at this point. Think of what would happen if China decided they wanted to take over the world. They would be crushed by economic sanctions and nuclear missiles. Their government would fall inevitably and of course they are the ones who make the decisions. Do they really want to make a decision that not only puts them out of power but also destroys the country they love? War has been made almost impossible as shown by the Cold War and the fact that the most tense political fighting never lead to war at all. We can afford to cut our military budget considering our military budget is still as high as the 7-10 countries behind us in spending combined.", 
   {}, 
   35648, 
   null, 
   1077549060.0
  ], 
  [
   35735, 
   null, 
   "Broker", 
   "Then we lose our edge. Military technology is used for a lot more than fighting wars... the Pentagon is just like NASA. By cutting that budget you are only knocking down innovation.", 
   {}, 
   35651, 
   null, 
   1077572760.0
  ], 
  [
   35828, 
   null, 
   "Nallyo", 
   "I agree that there might be a little (understatement) too much money spent on the military. I won't try using the military version of the dumb elephant joke to justify it (\"Why are you painting that elephant's toenails red?\" \"So it can hide in the roses.\" \"I've never seen an elephant in the roses.\" \"See? It must work!\"). However, the military has provided us with many civilian uses of technology and has been a major player in many of our technological breakthroughs (like the space race, GPS satellites, JEEPS, Hummers, etc, etc). While 40 billion is a bit absurd, I do agree that money does not always make things better. Let me use an analogy.\n \n Say the extra money does go to the schools and we buy computers and better textbooks for every child. We repair the buildings and get better playground equipment. However, none of these things help a kid gain a significant advantage if they do not take the initiative and work to better their place in society. Carnegie (the steel millionaire of the late 19th century) started as a poor boy who worked hellish shifts in a factory. In his free time, he could not go to school because of his poverty and long work days. Instead, he went to the public library and read up on topics. Through his private initiative, which costed no money whatsoever, he was able to recognize an opportunity when he saw it and became the captain of industry that we learn about today.\n \n As for the other nations, they don't have our GNP and so cannot hope to match us in a spending war (that's what drove the Soviets to ruin). They can, however, use commercial espionage to steal the secrets that we have spent money developing and avoid all of the expenditures that show up on the nice charts. Or they could just wait for certain Democrat presidents to give them the secrets/software for free . . .", 
   {}, 
   35735, 
   null, 
   1077596220.0
  ], 
  [
   36381, 
   null, 
   "Mr Jack", 
   "America spends a lot on the military both as a % of GDP, and as an absolute figure. You could half your military budget and still have the scariest military on the planet.\n \n Someone mentioned something about Germany before WWII. Realistically large scale war like that isn't going to happen, and even if it did most of not all the other big military spenders (Japan, UK, France, Russia, Germany, etc.) would be on the US's side anyway. The only one who probably wouldn't line up alongside America is China and I find it highly unlikely they'd line up with whoever you were fighting either.", 
   {}, 
   35828, 
   null, 
   1077803580.0
  ], 
  [
   36385, 
   null, 
   "fracas", 
   "The role of the federal government is defense, not to fund education and healthcare.\n 1. Federal spending does nothing to improve schools. It keeps going up and schools keep getting worse. Money doesn't solve the problem.\n\n \n \n agree\n the primary responsibility of any national government is national security\n social programs and educations are all nice and important but should take secondary position to military defense\n \n besides, the military industrial complex is both good from an economic standpoint and a technological/science standpoint\n \n did you know the Dept of Defense is one of the biggest funding source for medical and cancer research? not bizzarro stuffs like how to use it for biowarfare but simple things like how to cure breast cancer\n \n the defense budget is more than guns and soldiers", 
   {}, 
   35648, 
   null, 
   1077807780.0
  ], 
  [
   36442, 
   null, 
   "Nallyo", 
   "It costs more to defend than to attack. The reason it costs so much to defend us is that the US government actually cares and is given the job of protecting its people, unlike China which could lose a million men and still not give a damn. Russia? It has so much open land that there is no way to guard it all, and they know it. And, as fracas and I pointed out earlier, the money goes to more than just guns and soldiers.", 
   {}, 
   36385, 
   null, 
   1077822480.0
  ], 
  [
   36723, 
   null, 
   "Broker", 
   "But I am telling you now that all the text books and computers in the world will do nothing. You can build new schools, you can buy new text books every year, and you can get new computers every week... but it will do next to nothing. The problem isn't money... though people like to say we don't spend enough, we spend plenty. Most kids just don't care... that's not the government's fault, that's society. And if they don't want to succeed you can't force them to.\n \n The US isn't the top military spender in terms of spending as a percent of GDP or per capita... and that's the number that matters. We spend a lot... but if Israel had the same economy and population as the US it would be spending 60 billion dollars compared to the 40 billion dollars we spend.\n \n Military technology is what has shaped the modern world. You're using the internet right now... Hmm... where did that come from... \n \n I think we can all agree that invention alone was worth the whole military budget.", 
   {}, 
   36442, 
   null, 
   1077949860.0
  ], 
  [
   38542, 
   null, 
   "hvozdany", 
   "Just in case it was not a type error, I thought that I would note to everyone that the defense budget is around 400 billion, not 40 billion...", 
   {}, 
   36723, 
   null, 
   1078642920.0
  ], 
  [
   38575, 
   null, 
   "jitobear", 
   "Broker - \n \n I agree, the greatest school in the world is useless to a kid that won't try. However, your outlook on and lack of willingness to invest in the future is pretty dang sad. Kids need a safe, up to date environment in which to learn, as well as the appropriate tools. Plus teachers need to eat. Nothing will make this nation stronger than have an intelligent, thinking populace. No amount of guns can help us if we don't bother to care for each other - especially the kids.\n \n I believe education is THE KEY to EVERYTHING. It gets you skills, experience, know-how and power. The more we know the stronger we are.\n \n And I am curious to see your studies on the Head Start program, as every study I have heard, and every kid I have heard who has been in the program says you are wrong.\n \n Military technology is what has shaped the modern world. You're using the internet right now... Hmm... where did that come from...  \n \n Bill Gates.... emoticon_smile \n \n However, don't bother to educate our kids and see how much technical innovation arises twenty years from now.", 
   {}, 
   38542, 
   null, 
   1078699680.0
  ], 
  [
   38580, 
   null, 
   "The_Comedian", 
   "Military technology is what has shaped the modern world. You're using the internet right now... Hmm... where did that come from... \n\n Liar! It was Al Gore's invention! :p\n \n Good post about the importance of education, jitobear.", 
   {
    "unicode_changes_made": true
   }, 
   36723, 
   null, 
   1078704360.0
  ], 
  [
   38711, 
   null, 
   "hvozdany", 
   "agree\n the primary responsibility of any national government is national security\n social programs and educations are all nice and important but should take secondary position to military defense\n \n besides, the military industrial complex is both good from an economic standpoint and a technological/science standpoint\n \n did you know the Dept of Defense is one of the biggest funding source for medical and cancer research? not bizzarro stuffs like how to use it for biowarfare but simple things like how to cure breast cancer\n \n the defense budget is more than guns and soldiers\n\n \n \n Then, according to your belief on the role of national government, isn't it wrong for the military to be doing research on things like breast cancer? If it is so much more important to have such an overhelming military, isn't the military doing exactlly what you say it the federal government should not be doing?", 
   {}, 
   36385, 
   null, 
   1078788120.0
  ], 
  [
   39571, 
   null, 
   "Dmann", 
   "The role of the federal government is defense, not to fund education and healthcare\n \n \n then we don't need to pay taxes for them right?", 
   {}, 
   38711, 
   null, 
   1079400540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  True Majority - high military spending", 
  "url": "http://www.4forums.com/political/politics-debates/1770-true-majority-high-military-spending.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 1770, 
  "discussion_files": [
   [
    "667.html", 
    "http://www.4forums.com/political/politics-debates/1770-true-majority-high-military-spending-print.html"
   ], 
   [
    "668.html", 
    "http://www.4forums.com/political/politics-debates/1770-true-majority-high-military-spending-2-print.html"
   ]
  ], 
  "identifier": 1770
 }
]