[
 [
  [
   35905, 
   null, 
   "XeoX", 
   "This is a thing that interest me about religon.\n Myself, I'm an atheist, I have seen no point, proof or purpose of any kind of divine power.\n But that's not the point of this thread.\n \n My question to religous people is: why worship god?\n Let's assume god exist.\n If there are no penalties for not worshipping him then why bother?\n And if you do go to hell if you do not love god is he really worthy of worship?\n Any kind of god that demanded worship is, in my opinion, not worthy of it.", 
   {
    "post_info": {
     "post_title": "What makes god worthy of worship?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1077640560.0
  ], 
  [
   35917, 
   null, 
   "unkerpaulie", 
   "And if you do go to hell if you do not love god is he really worthy of worship?\n\n I think this is definitely one of the main motivations right here. people sometimes worship God out of a fear of going to hell. I mean, if hell really existed as stated, then whether God was worthy or not, it would be in your best interested to get with the program and worship\n \n the other, more common, reason is that people who worship God love him, for the fact that he is God and for the fact that He loved them first. this is a bit more solid as a rationale.\n \n \nAny kind of god that demanded worship is, in my opinion, not worthy of it.\n\n point taken, but you can be worthy of recognition/praise and expect it, even to the point that youd be pretty upset if you didnt get it. imagine doing something really great for someone, and they never were grateful or even recognized your efforts...\n \n on the other hand, in any relationship where love is involved, one party worshiping the other always ends up in a one-sided unbalanced relationship, because by worshiping the other party you demean yourself to a servant status. this can work against you, because you have to put you total trust that the other person wont take advantage of you\n \n then again, its God. so as far as trust is concerned this is no problem. people that worship God are absolutely convinced that God seeks their best interest. and likewise, they are convinced by positioning themselves as servant status, they are also in the best position to recieve both the instructions of God and the blessings of God", 
   {}, 
   35905, 
   null, 
   1077642960.0
  ], 
  [
   35967, 
   null, 
   "Nallyo", 
   "Worship is also the returning of God's love to himself. We worship God because of all that he does for us, how much he cares for us, how much he loves us. We worship him because we are insignificant and so can give him nothing more than our souls and our praise.", 
   {}, 
   35917, 
   null, 
   1077653520.0
  ], 
  [
   35972, 
   null, 
   "epaphras_faith", 
   "True woprship is an act of love. I love God. I worship freely because of who he is and who he has made me. Kind of nebulous but for me it is true.", 
   {}, 
   35967, 
   null, 
   1077654000.0
  ], 
  [
   35993, 
   null, 
   "XeoX", 
   "Worship is also the returning of God's love to himself. We worship God because of all that he does for us, how much he cares for us, how much he loves us. We worship him because we are insignificant and so can give him nothing more than our souls and our praise.\n\n \n Let me get this straight. God loves us. If we don't love him back he sentences us to eternal damnation. What kind of love is that?\n And if we are insignificant then what was gods purpose in creating us? To get someone to worship him?\n \n \nTrue woprship is an act of love. I love God. I worship freely because of who he is and who he has made me. Kind of nebulous but for me it is true.\n\n \n I'm even with worshipping god of own free will. If it lends you comfort and it works for you I see no reason to condemn it.\n To worship god becuse you have too, or to claim it is the only right way I'm not confortable with however. You should never have to worship god out of fear.", 
   {
    "unicode_changes_made": true
   }, 
   35967, 
   null, 
   1077658380.0
  ], 
  [
   35998, 
   null, 
   "epaphras_faith", 
   "Let me get this straight. God loves us. If we don't love him back he sentences us to eternal damnation. What kind of love is that?\n And if we are insignificant then what was gods purpose in creating us? To get someone to worship him?\n \n \n \n I'm even with worshipping god of own free will. If it lends you comfort and it works for you I see no reason to condemn it.\n To worship god becuse you have too, or to claim it is the only right way I'm not confortable with however. You should never have to worship god out of fear.\n\n \n I don't think Nalyo or I said that one SHOULD do either. God has declared that one day everyone will recognize that he is god. But for now, you have the choice. Choose him or not. God gets to decide if you go to hell, not me. He is the creator. He is the only one that is, was, and will be. It would be illogical for him to create man to worship anything but him, wouldn't it?", 
   {
    "unicode_changes_made": true
   }, 
   35993, 
   null, 
   1077660060.0
  ], 
  [
   36017, 
   null, 
   "dreamweaver", 
   "It is neither His power nor His Necessity that makes me worship Him, but His Moral perfection.", 
   {}, 
   35998, 
   null, 
   1077666000.0
  ], 
  [
   36062, 
   null, 
   "XQsThaiPoes", 
   "You worship God because he told you to. It may be simple, but it is the truth. You understand he hates people that don't listen to him and you don't want to have him hate you. Its is just the basic rules of friendship. You don't want your friend to hate you, and so you do things they like. God likes worship.\n \n Yeah God did only create people to serve him. Worship was something he invented to prove you served him. If you don't serve God you are expendable.\n \n Since I don't have a hell to fear the only fear a person can have is God not caring that you don't exist anymore. Kinda makes you tear up if you get caught up in it.", 
   {}, 
   36017, 
   null, 
   1077674940.0
  ], 
  [
   36098, 
   null, 
   "XeoX", 
   "I don't think Nalyo or I said that one SHOULD do either. God has declared that one day everyone will recognize that he is god. But for now, you have the choice. Choose him or not. God gets to decide if you go to hell, not me. He is the creator. He is the only one that is, was, and will be. It would be illogical for him to create man to worship anything but him, wouldn't it?\n\n \n I know you didn't, that was not aimed specificly at you.\n And what I mean is that I feel it's not right to create man for the only purpose to worship god either. Or to create them with the purpose to worship at all.\n \n \nIt is neither His power nor His Necessity that makes me worship Him, but His Moral perfection.\n\n \n If god send those that neglect to worship him to hell, then I don't give much for his 'moral perfection'.\n \n \nYou worship God because he told you to. It may be simple, but it is the truth. You understand he hates people that don't listen to him and you don't want to have him hate you. Its is just the basic rules of friendship. You don't want your friend to hate you, and so you do things they like. God likes worship.\n\n \n Then god is not just. That is not friendship. True friendship is given, not required.", 
   {
    "unicode_changes_made": true
   }, 
   35998, 
   null, 
   1077707400.0
  ], 
  [
   36102, 
   null, 
   "XQsThaiPoes", 
   "I know you didn't, that was not aimed specificly at you.\n And what I mean is that I feel it's not right to create man for the only purpose to worship god either. Or to create them with the purpose to worship at all.\n \n \n \n If god send those that neglect to worship him to hell, then I don't give much for his 'moral perfection'.\n \n \n \n Then god is not just. That is not friendship. True friendship is given, not required.\n\n \n This is not required you don't have to do it. Most people don't care and nothing happens to them except their eventual death. You are asking God to be nice to total strangers for no reason.", 
   {
    "unicode_changes_made": true
   }, 
   36098, 
   null, 
   1077710100.0
  ], 
  [
   36110, 
   null, 
   "dreamweaver", 
   "You worship God because he told you to. It may be simple, but it is the truth. You understand he hates people that don't listen to him and you don't want to have him hate you. Its is just the basic rules of friendship. You don't want your friend to hate you, and so you do things they like. God likes worship.\n\n I don't know what God you are referring to, but I was referring to the God of Classical Theism. More specifically: the Christian God. The Christian God does not hate people; He is love. I don't worship God because He \"told me to\"; like I said, I think that people should reserve their worship for a being that morally perfect.\n \nYeah God did only create people to serve him. Worship was something he invented to prove you served him. If you don't serve God you are expendable.\n\n Assuming that you are once again referring to the Christian God, you're a little mislead in your thinking. God created people so that He might love us, and that we might love Him. You might say that God \"demands love\", but it would be better put to say, \"God responds to love\". \n \nIf god send those that neglect to worship him to hell, then I don't give much for his 'moral perfection'.\n\n It's their decision; they were granted with free moral agency. They chose to go to Hell.", 
   {
    "unicode_changes_made": true
   }, 
   36062, 
   null, 
   1077715800.0
  ], 
  [
   36112, 
   null, 
   "Eddie", 
   "It's their decision; they were granted with free moral agency. They chose to go to Hell.\n\n \n If I point a gun to your head saying that you can choose between worshipping me or be shot to death, would you argue that you where granted with \"free moral agency\" ?", 
   {}, 
   36110, 
   null, 
   1077716220.0
  ], 
  [
   36150, 
   null, 
   "plotter", 
   "There is obviously a certain amount of brainwashing involved as to why people worship in god.\n \n If you drum into a small child that you must beleve and worship god, is it no wonder so may people follow.\n \n And if you dont follow you go to hell, do as i say or go to hell, then make hell a nasty horrible place to frighten anyone, especially children, and the result is, children are brainwashed to believe what theyve been told.\n \n Although interestingly enough, Jehovas witnesses dont believe in hell.", 
   {}, 
   36112, 
   null, 
   1077731880.0
  ], 
  [
   36155, 
   null, 
   "epaphras_faith", 
   "There is obviously a certain amount of brainwashing involved as to why people worship in god.\n \n If you drum into a small child that you must beleve and worship god, is it no wonder so may people follow.\n \n And if you dont follow you go to hell, do as i say or go to hell, then make hell a nasty horrible place to frighten anyone, especially children, and the result is, children are brainwashed to believe what theyve been told.\n \n Although interestingly enough, Jehovas witnesses dont believe in hell.\n\n \n Plotter: Do you really think I am brainwashed? You have talked to me enough.\n \n \nAnd what I mean is that I feel it's not right to create man for the only purpose to worship god either. Or to create them with the purpose to worship at all.\n \n \n Xeox: God actually created man to share love. This may seem a little out there and XQ and Richard would argue as they don't believe in the trinity, but God the son, God the Father, and God the spirit existed before there was time. They loved perfectly. There love was so overwhelming they created man in order to share that love. But love must be freely given (which God did) AND freely accepted. God allowed man free choice. He allowed the possibility of evil so that free choice could exist so that He could love. It is not the sole purpose to worship him. Worship is an outflow of that love.", 
   {
    "unicode_changes_made": true
   }, 
   36150, 
   null, 
   1077732480.0
  ], 
  [
   36162, 
   null, 
   "plotter", 
   "Plotter: Do you really think I am brainwashed? You have talked to me enough.\n\n \n LOL, No E.F.\n \n I was making a general comment on why people worship, there is an amount of brainwashing involved, particularly to young children. Religious studies in school and so on, if you drum into a child that you will go to hell unless you worship god, well, thats a form of brainwashing.", 
   {}, 
   36155, 
   null, 
   1077732900.0
  ], 
  [
   36168, 
   null, 
   "epaphras_faith", 
   "LOL, No E.F.\n \n I was making a general comment on why people worship, there is an amount of brainwashing involved, particularly to young children. Religious studies in school and so on, if you drum into a child that you will go to hell unless you worship god, well, thats a form of brainwashing.\n\n \n What if instead, a child is taught the grace, mercy and love of God? I have never taught a child they go to hell if they don't worship God. That is judgement. God judges. Not me. I am 37 years old and became a christian only 27 years ago. I most certainly was not brainwashed. My training is in psychology and physics. I appreciate that you recognize I am not brainwashed. I am simply arguing your general statement to be incorrect. \n \n I think it CAN be true but not necessarily.", 
   {}, 
   36162, 
   null, 
   1077733320.0
  ], 
  [
   36172, 
   null, 
   "AMD4EVER", 
   "\n If there are no penalties for not worshipping him then why bother?\n And if you do go to hell if you do not love god is he really worthy of worship?\n Any kind of god that demanded worship is, in my opinion, not worthy of it.\n\n \n This is a very interesting point. It is interesting to see the type of leadership God is displaying. It is one of worship me or be miserable sort of like the Stalinist Communists would have people do. God was no fan of democracy where people would be rewarded simply for being good even if they didn't care for their leaders and even voiced out against their leaders (Kerry for one). Interesting how Gods vision of leadership is the same one that has failed in the face of logic already.", 
   {}, 
   35905, 
   null, 
   1077733920.0
  ], 
  [
   36174, 
   null, 
   "AMD4EVER", 
   "What if instead, a child is taught the grace, mercy and love of God? I have never taught a child they go to hell if they don't worship God. That is judgement. God judges. Not me. I am 37 years old and became a christian only 27 years ago. I most certainly was not brainwashed. My training is in psychology and physics. I appreciate that you recognize I am not brainwashed. I am simply arguing your general statement to be incorrect. \n \n I think it CAN be true but not necessarily.\n\n \n It isn't just about how you teach children about God. The Bible shows us that God does demand of us to believe in him or they will go to hell. You can leave this pleasant little detail out when teaching children about him but that doesn't make it go away.", 
   {}, 
   36168, 
   null, 
   1077734040.0
  ], 
  [
   36193, 
   null, 
   "epaphras_faith", 
   "It isn't just about how you teach children about God. The Bible shows us that God does demand of us to believe in him or they will go to hell. You can leave this pleasant little detail out when teaching children about him but that doesn't make it go away.\n\n \n God wants love. He does not demand it. He desires it, even commands it. He does not make you do it.\n \n The idea of going to hell is a choice we make. The choice is necessary otherwise it would not be love, it would be obligation.", 
   {}, 
   36174, 
   null, 
   1077736260.0
  ], 
  [
   36201, 
   null, 
   "AMD4EVER", 
   "God wants love. He does not demand it. He desires it, even commands it. He does not make you do it.\n\n \n A want is a weakness. How can something all powerful want anything? It is one of the many contradictions about God. Also, lets not play games. Of course God demands praise of you or there are consequences. If Bush said you had to praise him as a God or live in a state of hell would you interpret that as him demanding that you praise him? So yes, God does demand, desire, and command you to praise him and even does so by saying you will be punished if you do not do what he wants you to do. This type of rulership is utterly horrible if done by our worldly leaders yet you praise this type of rulership from God.\n \n \nThe idea of going to hell is a choice we make. The choice is necessary otherwise it would not be love, it would be obligation.\n\n \n Hell is a choice, I agree. The choice is either do what is demanded of you or go to hell. Again, this only goes to show that God is not that nice of a being assuming that he is all powerful and has no needs at all. He would only be asking for you to do something that is irrelevant to him or he will punish you for it. Again, just pretend that this type of leader was in charge of the US or any other country you lived in, how much would you love them then even if they truely were worthy of all the praise they demanded of you?", 
   {}, 
   36193, 
   null, 
   1077739980.0
  ], 
  [
   36212, 
   null, 
   "dreamweaver", 
   "If I point a gun to your head saying that you can choose between worshipping me or be shot to death, would you argue that you where granted with \"free moral agency\" ?\n\n I don't know how a human would grant an entity with free moral agency, even though I can understand one restricting it. Furthermore, assuming the existence of a Supreme, morally perfect being, the ultimate good would to be with Him, and the ultimate bad to be apart from Him. He \"responds to love\" and He provides us with the free will to love Him, since that is what is best for us. You could argue that it is otherwise, but a human is hardly in an appropriate position to argue with an omniscient being.", 
   {}, 
   36112, 
   null, 
   1077742140.0
  ], 
  [
   36213, 
   null, 
   "epaphras_faith", 
   "A want is a weakness. How can something all powerful want anything? It is one of the many contradictions about God. Also, lets not play games. Of course God demands praise of you or there are consequences. If Bush said you had to praise him as a God or live in a state of hell would you interpret that as him demanding that you praise him? So yes, God does demand, desire, and command you to praise him and even does so by saying you will be punished if you do not do what he wants you to do. This type of rulership is utterly horrible if done by our worldly leaders yet you praise this type of rulership from God.\n \n \n \n Hell is a choice, I agree. The choice is either do what is demanded of you or go to hell. Again, this only goes to show that God is not that nice of a being assuming that he is all powerful and has no needs at all. He would only be asking for you to do something that is irrelevant to him or he will punish you for it. Again, just pretend that this type of leader was in charge of the US or any other country you lived in, how much would you love them then even if they truely were worthy of all the praise they demanded of you?\n\n \n You assert that a want is a weakness. You are wrong. Therefore everything else you said also falls. Upon what do you base the assertion that a want is a weakness? Your own opinion? I assert it is a strength. No human is perfect. We are perfected (made complete) in our weaknesses. It is one of the ways that we love each other. A want is a desire is a feeling. God has feelings. We are made in his image and therefore we have feelings. \n \n Please support your assertion.", 
   {
    "post_info": {
     "post_title": "eidted for clarity"
    }
   }, 
   36201, 
   null, 
   1077742140.0
  ], 
  [
   36216, 
   null, 
   "XQsThaiPoes", 
   "I don't know what God you are referring to, but I was referring to the God of Classical Theism. More specifically: the Christian God. The Christian God does not hate people; He is love. I don't worship God because He \"told me to\"; like I said, I think that people should reserve their worship for a being that morally perfect.\n \n Assuming that you are once again referring to the Christian God, you're a little mislead in your thinking. God created people so that He might love us, and that we might love Him. You might say that God \"demands love\", but it would be better put to say, \"God responds to love\". \n \n It's their decision; they were granted with free moral agency. They chose to go to Hell.\n\n \n The last quote is not me.", 
   {}, 
   36110, 
   null, 
   1077742440.0
  ], 
  [
   36218, 
   null, 
   "AMD4EVER", 
   "You assert that a want is a weakness. You are wrong. Therefore everything else you said also falls. Upon what do you base the assertion that a want is a weakness? Your own opinion? I assert it is a strength. No human is perfect. We are perfected (made complete) in our weaknesses. It is one of the ways that we love each other. A want is a desire is a feeling. God has feelings. We are made in his image and therefore we have feelings. \n \n Please support this assertion.\n\n \n First off you claim that because you believe my assertion that a want is a weakness fails then all the rest must fail. I disagree with this for starters. I also broke off from that part of the debate by claiming that God's version of rulership is horrible if done on Earth even if he was worthy of all the worship he demanded. What do you have to say about this?\n \n To back up my claims that a want is a weakness lets look to the definition of the word. \"A state of extreme poverty\", \"the state of needing something that is absent or unavailable\", \"anything that is necessary but lacking\", \"a specific feeling of desire\". So is God in a state of extreme poverty? If so he surely is in a state of weakness. Is he in need of something that he in his all powerful nature cannot take care of? If so then he is weak. Is he in need of something that is lacking? If he needs something which he himself cannot provide then he is weak. Does have feel a desire to have something which his all powerful nature cannot provide? If so then he is displaying a weakness. On the other hand if he is just choosing to need something which his all powerful nature can take care of then what he is essentially doing is demanding that humans do what he could do all by himself and therefore actually burdening us for his own lazyness. For example, lets say I could make all the food I wanted just by thinking about it but instead of doing that I forced comparitively weaker and inferior beings to get food for me. Wouldn't that be one way to show how nice of a being I am. Then again I would be dependent on them for food at that time so I would be displaying a weakness even if there really wasn't a weakness to be displayed in which case I'm simply displaying laziness. Either way it doesn't make me look so powerful and great now does it? That is your God. Ruler of the human race demanding of them to love him because he either has a weakness in doing this himself or is too lazy to fulfill his own needs. Based on the fact that we are created in his image and have a drive to fulfill our own needs I would have to debate that since God is not fulfilling his own needs that he does infact have a weakness that cannot be filled without the help of humans hence the reason he would have created us.", 
   {}, 
   36213, 
   null, 
   1077742800.0
  ], 
  [
   36219, 
   null, 
   "AMD4EVER", 
   "Just to make sure we end this debate as to whether a want is a weakness or not, what definition do you specifically want to choose as your definition in want when it comes to God wanting to be loved?\n \n \"A state of extreme poverty\"\n \"the state of needing something that is absent or unavailable\"\n \"anything that is necessary but lacking\"\n \"a specific feeling of desire\"", 
   {}, 
   36218, 
   null, 
   1077742980.0
  ], 
  [
   36221, 
   null, 
   "XQsThaiPoes", 
   "This is a very interesting point. It is interesting to see the type of leadership God is displaying. It is one of worship me or be miserable sort of like the Stalinist Communists would have people do. God was no fan of democracy where people would be rewarded simply for being good even if they didn't care for their leaders and even voiced out against their leaders (Kerry for one). Interesting how Gods vision of leadership is the same one that has failed in the face of logic already.\n\n \n This is spot on. Jehovah's Witnesses were jailed and executed at first by the Nazi's for being communist. They derived this by dissecting our stance on Judeo-Christian theology. Also note 1 out of 3 angels became a demon so being totalitarian does breed decent even in heaven. That's the whole concept of the bible despotism 101.", 
   {
    "unicode_changes_made": true
   }, 
   36172, 
   null, 
   1077743160.0
  ], 
  [
   36222, 
   null, 
   "epaphras_faith", 
   "Just to make sure we end this debate as to whether a want is a weakness or not, what definition do you specifically want to choose as your definition in want when it comes to God wanting to be loved?\n \n \"A state of extreme poverty\"\n \"the state of needing something that is absent or unavailable\"\n \"anything that is necessary but lacking\"\n \"a specific feeling of desire\"\n\n \n AMD: Your last definition is acceptable. Where does it say that this is a weakness? God did not lack love. In fact, he had so much love that he created man to share it. He created that which was lacking so that it may also be made full (complete, or perfect). I am still looking for why this is a weakness. This is a judgement call on your part. There is nothing in any of the definitions you provided to say that those things are in and of themselves bad. The definition that says extreme poverty is not really close to the mark of what we have been discussing. That is a metaphorical usage. The other three are different.\n \n You have not put the matter to rest. You have completely not addressed it.", 
   {}, 
   36219, 
   null, 
   1077743460.0
  ], 
  [
   36224, 
   null, 
   "XQsThaiPoes", 
   " For example, lets say I could make all the food I wanted just by thinking about it but instead of doing that I forced comparitively weaker and inferior beings to get food for me. \n\n \n Uh God did except we are the food. Plus if you look at the psychology of Jesus he is almost equal (or equal in other faiths), but gets the food anyway even though no one asked him to.", 
   {}, 
   36218, 
   null, 
   1077743760.0
  ], 
  [
   36226, 
   null, 
   "AMD4EVER", 
   "AMD: Your last definition is acceptable. Where does it say that this is a weakness? God did not lack love. In fact, he had so much love that he created man to share it. He created that which was lacking so that it may also be made full (complete, or perfect). I am still looking for why this is a weakness. This is a judgement call on your part. There is nothing in any of the definitions you provided to say that those things are in and of themselves bad. The definition that says extreme poverty is not really close to the mark of what we have been discussing. That is a metaphorical usage. The other three are different.\n \n You have not put the matter to rest. You have completely not addressed it.\n\n \n I hope you still plan on responding to my previous post.\n \n But anyways I wasn't trying to put this matter to rest in one post. I just had to find out first what your opinion of want means when it comes to God wanting something.\n \n Now then back to something I stated in my previous post. You believe that God desires and wants worship. He is all powerful so he can fulfill his desires in countless ways and even in ways not related to humans at all. Yet he doesn't do this. This in turn shows laziness which shows weakness. Back to my previous scenario, if I could make all the food I ever needed yet made others make it for me and punished them for not doing it that sure doesn't make me look or seem all powerful. All I am doing is flexing my muscle and forcing others to do things for me that I could accomplish for myself. How could this not be seen as lazy, cruel, or just plain stupid? How can you see God as perfect, all powerful, and all knowing while he sits back and forces us to fulfill his needs when he could do so himself? In short, he displays not only weakness but in turn evil as well in displaying weakness if he is not truely weak.", 
   {}, 
   36222, 
   null, 
   1077743880.0
  ], 
  [
   36229, 
   null, 
   "XQsThaiPoes", 
   "Actually we are more like the chicken salad he conjured up; that went bad after some one pluged in the hair drier and shorted out the power grid.", 
   {}, 
   36224, 
   null, 
   1077744000.0
  ], 
  [
   36230, 
   null, 
   "AMD4EVER", 
   "Actually we are more like the chicken salad he conjured up; that went bad after some one pluged in the hair drier and shorted out the power grid.\n\n \n I'm not sure at all what you are getting at here. Are you somehow saying that God did create us because of his own weakness or laziness and his plans went wrong?", 
   {}, 
   36229, 
   null, 
   1077744180.0
  ], 
  [
   36232, 
   null, 
   "XQsThaiPoes", 
   "I hope you still plan on responding to my previous post.\n \n But anyways I wasn't trying to put this matter to rest in one post. I just had to find out first what your opinion of want means when it comes to God wanting something.\n \n Now then back to something I stated in my previous post. You believe that God desires and wants worship. He is all powerful so he can fulfill his desires in countless ways and even in ways not related to humans at all. Yet he doesn't do this. This in turn shows laziness which shows weakness. Back to my previous scenario, if I could make all the food I ever needed yet made others make it for me and punished them for not doing it that sure doesn't make me look or seem all powerful. All I am doing is flexing my muscle and forcing others to do things for me that I could accomplish for myself. How could this not be seen as lazy, cruel, or just plain stupid? How can you see God as perfect, all powerful, and all knowing while he sits back and forces us to fulfill his needs when he could do so himself? In short, he displays not only weakness but in turn evil as well in displaying weakness if he is not truely weak.\n\n \n I keep bringing up your metaphor is flawed. We are the fuel or the consumable resource. He is harvesting us. Look at all Jesus parables. Wheat and weeds, sheep and goat, grapes on the vine. Dude God is like Galactus he is eating the earth :p", 
   {}, 
   36226, 
   null, 
   1077744240.0
  ], 
  [
   36233, 
   null, 
   "epaphras_faith", 
   "I hope you still plan on responding to my previous post.\n \n But anyways I wasn't trying to put this matter to rest in one post. I just had to find out first what your opinion of want means when it comes to God wanting something.\n \n Now then back to something I stated in my previous post. You believe that God desires and wants worship. He is all powerful so he can fulfill his desires in countless ways and even in ways not related to humans at all. Yet he doesn't do this. This in turn shows laziness which shows weakness. Back to my previous scenario, if I could make all the food I ever needed yet made others make it for me and punished them for not doing it that sure doesn't make me look or seem all powerful. All I am doing is flexing my muscle and forcing others to do things for me that I could accomplish for myself. How could this not be seen as lazy, cruel, or just plain stupid? How can you see God as perfect, all powerful, and all knowing while he sits back and forces us to fulfill his needs when he could do so himself? In short, he displays not only weakness but in turn evil as well in displaying weakness if he is not truely weak.\n\n \n Wow! you assume a lot. Why does it show laziness? Perhaps it instead shows an intentional love. God has, on occasion, not used all of his power. You withold all of your power on your children (if you have kids of course). No father (who loved his kids) would wail away at the child with all of his power. That is not weakness nor would we consider that father lazy. \n \n As for God forcing us to do his whims, I think we have been down this road before. if it was not you I apologize. \n \n God does not force us. He does say if you do x then y will happen. A human father does the same with their kids. He doesn't do it just to inflict punishment and exact a price. He instead, is teaching the child. The choice is ours. God has set out the consequences for those choices. I may say to my child, don't run into the street. If you play in the yard and follow my instructions then you can go next door and play with your friend tomorrow. If you don't follow my instructions I will spank you. If he goes into the street then I say to the child \"you have chosen a spanking.\" \"You could have chosen to go to your friends, you did not.\" The choice is the child. I am not an evil person because of it. I did nothing wrong. The boundaries placed were for the protection of my child and the child chose to wander out of those boundaries.\n \n It is the same with us.", 
   {}, 
   36226, 
   null, 
   1077744360.0
  ], 
  [
   36234, 
   null, 
   "AMD4EVER", 
   "I keep bringing up your metaphor is flawed. We are the fuel or the consumable resource. He is harvesting us. Look at all Jesus parables. Wheat and weeds, sheep and goat, grapes on the vine. Dude God like Galactus he is eating the earth :p\n\n \n So does this accurately represent God as all powerful and good then?", 
   {}, 
   36232, 
   null, 
   1077744420.0
  ], 
  [
   36236, 
   null, 
   "XQsThaiPoes", 
   "So does this accurately represent God as all powerful and good then?\n\n \n All-powerful (He made you for him to eat), Good (see the problem of evil thread), and possibly malevolent or sadistic if you want to be \"weak\" and PC about it.", 
   {}, 
   36234, 
   null, 
   1077744720.0
  ], 
  [
   36239, 
   null, 
   "epaphras_faith", 
   "All-powerful (He made you for him to eat), Good (see the problem of evil thread), and possibly malevolent or sadistic if you want to be \"weak\" and PC about it.\n\n \n AMD:\n \n Re: the above. I am not comfortable responding in kind with XQ. I do not understand nor agree with his theology. JW's are not considered christian by protestant standards nor catholic standards as far as I know.", 
   {}, 
   36236, 
   null, 
   1077745020.0
  ], 
  [
   36242, 
   null, 
   "AMD4EVER", 
   "Wow! you assume a lot. Why does it show laziness? Perhaps it instead shows an intentional love. God has, on occasion, not used all of his power. You withold all of your power on your children (if you have kids of course). No father (who loved his kids) would wail away at the child with all of his power. That is not weakness nor would we consider that father lazy. \n\n \n I'm glad you asked this question. I am not assuming anything at all here. I am actually giving several possible reasons as to why he doesn't just fulfill his own wants. One possibility is that he is lazy. One possibility is because he can't and needs us to in which case he is weak. One possibility is that he doesn't know how and in which case he is weak. So I'll ask you, why do you think he doesn't fulfill his own needs and makes us do it for him? I know I'd only be asking you to make an assumption here but I won't slam you for doing so. I would only ask that you show me a reaons why he doesn't fulfill his own needs while not looking lazy or weak in the process. I don't think there is a good reason hence I am of the assumption that he is lazy or weak and possibly even evil as a result, but I could be completely wrong in all these assumptions.\n \n \nAs for God forcing us to do his whims, I think we have been down this road before. if it was not you I apologize.\n\n \n I've been down this road before and know where you want to take it. You want to claim that he is not forcing us to do anything yet you will not respond to my previous question. If Bush was to demand that you worship him or live a life of misery would you say that he is forcing us to do something? Isn't God doing this exact thing and you are not stating that he is forcing you to do something?\n \n \nGod does not force us. He does say if you do x then y will happen. A human father does the same with their kids. He doesn't do it just to inflict punishment and exact a price. He instead, is teaching the child. The choice is ours. God has set out the consequences for those choices. I may say to my child, don't run into the street. If you play in the yard and follow my instructions then you can go next door and play with your friend tomorrow. If you don't follow my instructions I will spank you. If he goes into the street then I say to the child \"you have chosen a spanking.\" \"You could have chosen to go to your friends, you did not.\" The choice is the child. I am not an evil person because of it. I did nothing wrong. The boundaries placed were for the protection of my child and the child chose to wander out of those boundaries.\n \n It is the same with us.\n\n \n Sure he isn't actually forcing us to do anything but he does threaten us with pain if we don't do something. The punishment for failure is the ultimate one. It would be like the father in your scenario killing the kid for not getting the paper or feeding the dog. Is that really love from God? Is that God not forcing us to do anything? If you had your life threatened if you didn't do something and the guy threatening you said he wasn't making any demands at all of you do you think he would sound a little crazy? This is how you sound to me when you are trying to explain how God is not forcing you to do anything. He is threatening everything about you in order to get you to do something yet you don't believe he is forcing anything. Sure he is not going to control you to do something unwillingly but this is practically what he is able to do simply by threatening what he does! It is rediculous! If your father was to threaten you with death or torture for the rest of your life if you didn't feed the dog I'm sure you would feed that dog every day because you would have no choice whatsoever. God is the father! What a nice guy he is not forcing us to do anything we don't want to, right?", 
   {}, 
   36233, 
   null, 
   1077745260.0
  ], 
  [
   36243, 
   null, 
   "AMD4EVER", 
   "All-powerful (He made you for him to eat), Good (see the problem of evil thread), and possibly malevolent or sadistic if you want to be \"weak\" and PC about it.\n\n \n All-powerful and perfect. If he was perfect he wouldn't need to eat the things he loved. He would simply satisfy is own needs and help those that he loved. So possibly nothing, if he was perfect things wouldn't be as they are according to the Bible.", 
   {}, 
   36236, 
   null, 
   1077745380.0
  ], 
  [
   36245, 
   null, 
   "AMD4EVER", 
   "AMD:\n \n Re: the above. I am not comfortable responding in kind with XQ. I do not understand nor agree with his theology. JW's are not considered christian by protestant standards nor catholic standards as far as I know.\n\n \n Thats fine with me. Anyways, what is your opinion about the God type of rulership? Do you agree that God rules like a communist or dictator rather than like the democratic countries of the world? The thing I like about the democratic nations is that you don't need to love the leader in order to succeed. Dictators and communists will kill you and starve you if you don't follow their rules and support them. Democratic nations do this to some extent but a much smaller extent than communists. I think it would be wonderful if God would be happy with people just living good lives even if they don't necessarily love him. I think this is a good reason not to believe that God is worthy of worship. He simply created a system which has failed here on earth and is proven to be horrific in it's results as noted with Stalin and even the rebellion in Heaven. How horrible it is that God supports this type of rulership.", 
   {}, 
   36239, 
   null, 
   1077745620.0
  ], 
  [
   36246, 
   null, 
   "epaphras_faith", 
   "I'm glad you asked this question. I am not assuming anything at all here. I am actually giving several possible reasons as to why he doesn't just fulfill his own wants. One possibility is that he is lazy. One possibility is because he can't and needs us to in which case he is weak. One possibility is that he doesn't know how and in which case he is weak. So I'll ask you, why do you think he doesn't fulfill his own needs and makes us do it for him? I know I'd only be asking you to make an assumption here but I won't slam you for doing so. I would only ask that you show me a reaons why he doesn't fulfill his own needs while not looking lazy or weak in the process. I don't think there is a good reason hence I am of the assumption that he is lazy or weak and possibly even evil as a result, but I could be completely wrong in all these assumptions.\n \n\n \n There is another option. He can but chooses not to. Why you may ask. Because it pleases him to do so. He is the creator of everything. HE is the definer of what is good not you and I.", 
   {}, 
   36242, 
   null, 
   1077745680.0
  ], 
  [
   36247, 
   null, 
   "epaphras_faith", 
   "Thats fine with me. Anyways, what is your opinion about the God type of rulership? Do you agree that God rules like a communist or dictator rather than like the democratic countries of the world? The thing I like about the democratic nations is that you don't need to love the leader in order to succeed. Dictators and communists will kill you and starve you if you don't follow their rules and support them. Democratic nations do this to some extent but a much smaller extent than communists. I think it would be wonderful if God would be happy with people just living good lives even if they don't necessarily love him. I think this is a good reason not to believe that God is worthy of worship. He simply created a system which has failed here on earth and is proven to be horrific in it's results as noted with Stalin and even the rebellion in Heaven. How horrible it is that God supports this type of rulership.\n\n \n Actually, true communism was founded on the idea of a benevolent dictatorship. And on the free expression of the individual to care for others. God is in charge. It would be wrong of the creator of the universe to put someone other than himself in charge. It is wrong for you or I to look at ourselves as the center of the universe. Why? Because we are not. He is. It would be wrong for Him to see anyone else at its center other than Him.", 
   {}, 
   36245, 
   null, 
   1077745860.0
  ], 
  [
   36248, 
   null, 
   "XeoX", 
   "Xeox: God actually created man to share love. This may seem a little out there and XQ and Richard would argue as they don't believe in the trinity, but God the son, God the Father, and God the spirit existed before there was time. They loved perfectly. There love was so overwhelming they created man in order to share that love. But love must be freely given (which God did) AND freely accepted. God allowed man free choice. He allowed the possibility of evil so that free choice could exist so that He could love. It is not the sole purpose to worship him. Worship is an outflow of that love.\n\n \n Can you not see that the existance of hell denies free will?\n If there was no punishment for not worshipping god, if it was like I belive XQ claims that god would remove his hand from us and that we would simply lose the option of an afterlife, then I could call it free will.\n But to be given the 'choice' of doing gods will or eternal suffering. That is not to allow 'free will'.", 
   {}, 
   36155, 
   null, 
   1077745860.0
  ], 
  [
   36250, 
   null, 
   "AMD4EVER", 
   "There is another option. He can but chooses not to. Why you may ask. Because it pleases him to do so. He is the creator of everything. HE is the definer of what is good not you and I.\n\n \n First of all I'd like you to tell me how this is not laziness. I don't want to take out the garabage so I have someone else do it. Is that what God is doing? This is what I've been trying to tell you. He is either lazy or weak, you have your choice. Our purpose is to serve him for a reason. He either has something he doesn't want to do himself making him lazy or he is unable to do something himself which means he is weak. This only goes to prove my point. You can try to spin it any way you please but he is ultimately no doing something that he is capable of and he is making us do it for him. He can make a square triangle but he is unable to satisfy one of his needs therefore he is having us do it.\n \n Now I'm not going to directly debate whether his being lazy is good or not. I really don't care right now because at least we have made a step forward in this debate. We can now define God as being lazy in at least the aspect of him needing us to love him. Now on a worldly level I would have to say his laziness is one which can only be precieved as bad. He is capable of doing something yet he threatens everything about us in order to make us do his bidding. Therefore I think we have answered the question of the debate. What makes God worthy of worship? Clearly as far as worldly logic is concerned he is not worthy of it. He is lazy and evil in at least this aspect.", 
   {}, 
   36246, 
   null, 
   1077746280.0
  ], 
  [
   36251, 
   null, 
   "AMD4EVER", 
   "Actually, true communism was founded on the idea of a benevolent dictatorship. And on the free expression of the individual to care for others. God is in charge. It would be wrong of the creator of the universe to put someone other than himself in charge. It is wrong for you or I to look at ourselves as the center of the universe. Why? Because we are not. He is. It would be wrong for Him to see anyone else at its center other than Him.\n\n \n Don't play games here again. You know the communism I spoke of was that of Stalinists and you would know this because I have already refered to this earlier in this debate if you have been reading it.\n \n God can be in charge just as Bush is in charge. It would be wrong for either God or Bush to not declare themselves in charge because it would be chaos from there on out. However, God forces others to praise in him and threatens those who do not love him. That is Stalinist Communism and Hardline Dictatorship. Bush forces others to simply be good regardless as to whether they praise Bush or not. This is Modern Day Democracy. Be good and you will be allowed to succeed is a good form of rulership as proven here on earth. Praise me or face torturous death is a proven failure on earth and in Heaven itself. How could God be so foolish?", 
   {}, 
   36247, 
   null, 
   1077746580.0
  ], 
  [
   36253, 
   null, 
   "AMD4EVER", 
   "Can you not see that the existance of hell denies free will?\n If there was no punishment for not worshipping god, if it was like I belive XQ claims that god would remove his hand from us and that we would simply lose the option of an afterlife, then I could call it free will.\n But to be given the 'choice' of doing gods will or eternal suffering. That is not to allow 'free will'.\n\n \n I've been trying to make epaphras see this for a few posts now. If you are given the option of do nothing and be tortured or love me and be happy then you are essentially being given no choice at all. Free will is destroyed when these types of options are present. You can surely find statistical data that will show when given the option of work and extreme success or laziness and extreme pain that almost 100% of all people will choose work and success. There just is no option here. One good pole here would be the one taken before the invasion of Iraq. Saddam was voted by 100% of the population to be their president. Good old Saddam took a lesson from the book of God for that election.", 
   {}, 
   36248, 
   null, 
   1077746760.0
  ], 
  [
   36268, 
   null, 
   "XQsThaiPoes", 
   "All-powerful and perfect. If he was perfect he wouldn't need to eat the things he loved. He would simply satisfy is own needs and help those that he loved. So possibly nothing, if he was perfect things wouldn't be as they are according to the Bible.\n\n \n He does help those he loves. He keeps them around forever like those sentimental photos people carry in their wallet. If you had an angry ex-wife would you keep her photo?\n \n Like a chief he can make the same dish over and over to eat again and again. Thats perfection. So if you think you are special. God can make a fleet of you if he wanted. I think that was his intentions with the nation if israel according to the bible he really liked Abraham. Infact he told Abraham to do crazy counter productive things just to see if Abraham was \"down with him\".", 
   {}, 
   36243, 
   null, 
   1077750300.0
  ], 
  [
   36276, 
   null, 
   "dreamweaver", 
   "The last quote is not me.\n\n Apologies. :)", 
   {}, 
   36216, 
   null, 
   1077752520.0
  ], 
  [
   36277, 
   null, 
   "AMD4EVER", 
   "He does help those he loves. He keeps them around forever like those sentimental photos people carry in their wallet. If you had an angry ex-wife would you keep her photo?\n\n \n Fine, lets deal with this aspect. What is the purpose of human life if he can simply satisify his own needs if he wants to while allowing all those he loved to come directly to him and live forever along side of him? To put this in worldly terms, this would be like you buying a computer that you really wanted and let it set in a room for three years virtually untouched. You couldn't use it for your purpose but you could do some maintence if necessary. If the computer didn't crash in this three year period too many times then you would actually start using it otherwise you would burn it. Wouldn't it make more sense to skip that three year period and simply start getting your use out of it while giving the computer a whole lot more purpose? This is the whole reason it makes no sense for humans to be here if God loves and is able to fulfill his own needs without us being here which an all powerful being would be able to do. Also if he was perfect he would develop an entirely new system that is a whole lot more efficient than the one he has today.\n \n \nLike a chief he can make the same dish over and over to eat again and again. Thats perfection. So if you think you are special. God can make a fleet of you if he wanted. I think that was his intentions with the nation if israel according to the bible he really liked Abraham. Infact he told Abraham to do crazy counter productive things just to see if Abraham was \"down with him\".\n\n \n If he can do such amazing things then how come he has us here in order to do his work for him? That is not perfection by any means. Perfection is an ideal instance. With his instance his needs are not being fulfilled without the help of others and he needs to threaten those others in order to get his needs fulfilled. If you had a car that would only work if you threatened it with removing its oil would you have an ideal car? Also if you were a God and had to depend on a questionable car just to get around would you call this an ideal instance?\n \n The deal with Abraham would have no impact on this debate as far as I can tell unless you are suggesting that God is worthy of worship due to the fact that he tells you to do counter productive thing. I think that actually goes against the worthiness of God to be worshipped.", 
   {}, 
   36268, 
   null, 
   1077753000.0
  ], 
  [
   36278, 
   null, 
   "plotter", 
   "This is turning into a very hectic debate, 46 posts in such a short time.\n \n I still think theres a certain amount of brainwashing involved, not only in christianity but other religions too.\n \n XQthaipoes, your a jehovas witness, what do you worship to, if anything? Why are you a jehovas witness, were you converted or brought up being one?\n \n In eastern europe, particularly the ex soviets states, church attendences are far lower than in western europe or other religios countries. People there are not so religious.\n \n During communist times they did not have religious education and church/religios gatherings were frowned on by the communists. \n \n Which is probably why people are not so religious, which in a way, although not conclusive, shows that preaching to children, brainwashes them to believe.", 
   {}, 
   36268, 
   null, 
   1077753060.0
  ], 
  [
   36279, 
   null, 
   "AMD4EVER", 
   "Which is probably why people are not so religious, which in a way, although not conclusive, shows that preaching to children, brainwashes them to believe.\n\n \n Either brainwashing is a necessary part of human life or that really isn't a case of brainwashing. For one if this is brainwashing then believing that your country is a great country is brainwashing, believing that your language or culture is important or that your money is actually worth something is brainwashing. You are simply going to learn based on what others around you display especially your parents. I don't consider this brainwashing. I think brainwashing is an intentional and forceful way to get someone to accept new ideas. If your culture is going to look down on religion they are not really forcefully or intentionally teaching you to not be religious either although that is likely what you will pick up about it. So more than anything I think this shows that humans are social creatures who learn based on what they see others around them are doing and nothing more.", 
   {}, 
   36278, 
   null, 
   1077753480.0
  ], 
  [
   36281, 
   null, 
   "XQsThaiPoes", 
   "Fine, lets deal with this aspect. What is the purpose of human life if he can simply satisify his own needs if he wants to while allowing all those he loved to come directly to him and live forever along side of him? To put this in worldly terms, this would be like you buying a computer that you really wanted and let it set in a room for three years virtually untouched. You couldn't use it for your purpose but you could do some maintence if necessary. If the computer didn't crash in this three year period too many times then you would actually start using it otherwise you would burn it. Wouldn't it make more sense to skip that three year period and simply start getting your use out of it while giving the computer a whole lot more purpose? This is the whole reason it makes no sense for humans to be here if God loves and is able to fulfill his own needs without us being here which an all powerful being would be able to do. Also if he was perfect he would develop an entirely new system that is a whole lot more efficient than the one he has today.\n \n \n \n If he can do such amazing things then how come he has us here in order to do his work for him? That is not perfection by any means. Perfection is an ideal instance. With his instance his needs are not being fulfilled without the help of others and he needs to threaten those others in order to get his needs fulfilled. If you had a car that would only work if you threatened it with removing its oil would you have an ideal car? Also if you were a God and had to depend on a questionable car just to get around would you call this an ideal instance?\n \n The deal with Abraham would have no impact on this debate as far as I can tell unless you are suggesting that God is worthy of worship due to the fact that he tells you to do counter productive thing. I think that actually goes against the worthiness of God to be worshipped.\n\n \n Actually I has reading a watchtower. It brought out that God was probally alone for a long time in idle bliss. Then out of \"love\" he started creating. What you discribe is what we believe. God being perfect does not need to create people to worship him, and can preoccupy himself in self absorbtion. \n Since he did create people it is illogical for him to like them if they decide to make him unhappy. \n \n The concept is he only wants pcs that never crash and cars that always run. Remember humans never got past the prototype stage. He made two and they both broke. If that pc or car was the first prototype then questioning the origin of failure is your job. BTW he is perfect and believes things fail on purpose to make him angry unless proven otherwise.", 
   {}, 
   36277, 
   null, 
   1077754020.0
  ], 
  [
   36285, 
   null, 
   "epaphras_faith", 
   "I've been trying to make epaphras see this for a few posts now. If you are given the option of do nothing and be tortured or love me and be happy then you are essentially being given no choice at all. Free will is destroyed when these types of options are present. You can surely find statistical data that will show when given the option of work and extreme success or laziness and extreme pain that almost 100% of all people will choose work and success. There just is no option here. One good pole here would be the one taken before the invasion of Iraq. Saddam was voted by 100% of the population to be their president. Good old Saddam took a lesson from the book of God for that election.\n\n \n It is not forced. Coerced perhaps (if we assume your understanding of god) but still the choice is yours. Free will does not mean that one gets to do what ever one wants at any time and any place. Free will is simply the ability to act in accordance with your nature. The ability to make a choice. Free will does not define the choices. God is good and loving. \n \n You say a God that loves would not even allow a hell. Do you not see, that if there is no hell then you have no choice but heaven? Where is the free will in that? You get no choice. You don't like God? Tough you have to go to heaven any way. Deal with it. That is not choice, free will or anything like it. \n \n God desires no one to go to hell. He wants all to go to heaven, but he will not force it. Why, why, why why would he send his only son to die the torturous death on the cross, to be beaten and ridiculed, and to suffer our sinful presence if he did not love us? Don't you see that Before there was a death on the cross all men were doomed to ritual sacrifices to appease God for a time. They could not please God as evidenced by the sacrifice being required every year. It only appeased him. Christ's death was satisfying of the wrath of God for the sin of man. The sin man chose. If the option wasn't there THEN we have no choice. Christ's death has given us the option we never had before.", 
   {}, 
   36253, 
   null, 
   1077755040.0
  ], 
  [
   36291, 
   null, 
   "epaphras_faith", 
   "Actually I has reading a watchtower. It brought out that God was probally alone for a long time in idle bliss. Then out of \"love\" he started creating. What you discribe is what we believe. God being perfect does not need to create people to worship him, and can preoccupy himself in self absorbtion. \n Since he did create people it is illogical for him to like them if they decide to make him unhappy. \n \n The concept is he only wants pcs that never crash and cars that always run. Remember humans never got past the prototype stage. He made two and they both broke. If that pc or car was the first prototype then questioning the origin of failure is your job. BTW he is perfect and believes things fail on purpose to make him angry unless proven otherwise.\n\n \n Somedays I am really slow! I just got what your handle meant. Very cute. ;)", 
   {}, 
   36281, 
   null, 
   1077755520.0
  ], 
  [
   36292, 
   null, 
   "AMD4EVER", 
   "Actually I has reading a watchtower. It brought out that God was probally alone for a long time in idle bliss.\n\n \n If I were to ever relate God to time I would get called on it right away so I guess I'll have to do the same to you. What make you think that God is at all related to time in any way? He is above time and is not constrained by it. So he probably hasn't been doing anything for any amount of time. Don't try to use that explaination to give a likely solution to why he created humans.\n \n \nThen out of \"love\" he started creating. What you discribe is what we believe. God being perfect does not need to create people to worship him, and can preoccupy himself in self absorbtion. \n Since he did create people it is illogical for him to like them if they decide to make him unhappy. \n\n \n Without going too deep into this I gather that what your basically saying is that he has done all this for his own amusement? Does this make God worthy of our worship?\n \n \nThe concept is he only wants pcs that never crash and cars that always run. Remember humans never got past the prototype stage. He made two and they both broke. If that pc or car was the first prototype then questioning the origin of failure is your job. BTW he is perfect and believes things fail on purpose to make him angry unless proven otherwise.\n\n \n ***************************************************\n If you only answer a couple questions in your reply please make it these.\n \n What is this about prototypes? Are you suggesting God the perfect needs prototypes? Are you also suggesting the things he created were unlike what he intended them to be?\n \n Let me make you aware that he knew what was going to happen long before making the first humans otherwise he wouldn't be all knowing. He created them exactly as he wanted to create them otherwise he would be all powerful. He also got exactly what he intended to get out of them otherwise he wouldn't be perfect. Try to debunk this statement.\n ***************************************************", 
   {}, 
   36281, 
   null, 
   1077755820.0
  ], 
  [
   36293, 
   null, 
   "plotter", 
   "Either brainwashing is a necessary part of human life or that really isn't a case of brainwashing. For one if this is brainwashing then believing that your country is a great country is brainwashing, believing that your language or culture is important or that your money is actually worth something is brainwashing. You are simply going to learn based on what others around you display especially your parents. I don't consider this brainwashing. I think brainwashing is an intentional and forceful way to get someone to accept new ideas. If your culture is going to look down on religion they are not really forcefully or intentionally teaching you to not be religious either although that is likely what you will pick up about it. So more than anything I think this shows that humans are social creatures who learn based on what they see others around them are doing and nothing more.\n\n So saying to, particularly a child, worship god or go to hell, is not brainwashing. If you believe you country is the best in the world is either ignorance or patriotism, thats not brainwashing.\n \n Take for example suicide bombers, they believe they will go to heaven if they carry out there mission, thats also brainwashing, would a patriot do something like that? I dont think so. \n \n Its interesting to note my earlier post, in places where theres no or little religious education, theres a lower number of religious people.", 
   {}, 
   36279, 
   null, 
   1077755940.0
  ], 
  [
   36296, 
   null, 
   "AMD4EVER", 
   "It is not forced. Coerced perhaps (if we assume your understanding of god) but still the choice is yours. Free will does not mean that one gets to do what ever one wants at any time and any place. Free will is simply the ability to act in accordance with your nature. The ability to make a choice. Free will does not define the choices. God is good and loving. \n\n \n Then answer me this. Would you with your hand placed on the Bible state that you believe that Saddam led an election based on the free will of the people because he followed a democratic process but also threatened to kill anyone who didn't vote as he wished for them to? I honestly couldn't do this because I know what that was. I also know what this threatening from God is as I'm sure you do as well. He threatens you with something you cannot go against and says he is giving you a choice. That is not free will and I'm sure you know it.\n \n \nYou say a God that loves would not even allow a hell. Do you not see, that if there is no hell then you have no choice but heaven? Where is the free will in that? You get no choice. You don't like God? Tough you have to go to heaven any way. Deal with it. That is not choice, free will or anything like it. \n\n \n Oh for crying out loud. You can layer heaven or even make it just heaven and earth. Earth could be considered the bad place. At least you get a second chance at that point and are not doomed so something so horrible and perminent as hell. There is your free will and there is a much better solution than the current one in place.\n \n \nGod desires no one to go to hell. He wants all to go to heaven, but he will not force it. Why, why, why why would he send his only son to die the torturous death on the cross, to be beaten and ridiculed, and to suffer our sinful presence if he did not love us? Don't you see that Before there was a death on the cross all men were doomed to ritual sacrifices to appease God for a time. They could not please God as evidenced by the sacrifice being required every year. It only appeased him. Christ's death was satisfying of the wrath of God for the sin of man. The sin man chose. If the option wasn't there THEN we have no choice. Christ's death has given us the option we never had before.\n\n \n I'll revert back to something I just touched on in my last post. If God desires that no one goes to hell and someone does then his perfect design has already failed. If his desires are not met then he has done something wrong. But that is just my opinion based on the fact that he should be all knowing, all powerful, and perfect. Do you see a flaw in my logic?\n \n Why did he need to send Jesus here in the first place is the real question. He planned for it to be this way otherwise it wouldn't have happened. He created something that was flawed in many ways, just as he intended it to be. It would be his own choice and he made the choice long before sending Jesus to Earth. Also know that sending Jesus to die would be like me sending my program to die by infecting with a virus while I know full good and well that I have a backup copy. God never sacraficed anything by sending Jesus here. The whole idea of this creating a family was his idea, not something that he was born with like we no Earth are. He created this system so it probably means very little to him in the first place especially when he knows that he cannot lose what he creates. It's like playing SimCity, building a huge city, and then burning only to be able to reload a saved game later. Burning it really doesn't even disturb you a bit because you can always just get it right back the way it was.\n \n Being that there was no choice at first then that proves that if there was only a heaven that the system would be just fine. There is no requirement for there to be a choice at all so you just answered your own question but left yourself open for another one. Way was there only initially a hell if God loved us so much rather than there just being a heaven?", 
   {}, 
   36285, 
   null, 
   1077756480.0
  ], 
  [
   36297, 
   null, 
   "epaphras_faith", 
   "***************************************************\n If you only answer a couple questions in your reply please make it these.\n \n What is this about prototypes? Are you suggesting God the perfect needs prototypes? Are you also suggesting the things he created were unlike what he intended them to be?\n \n Let me make you aware that he knew what was going to happen long before making the first humans otherwise he wouldn't be all knowing. He created them exactly as he wanted to create them otherwise he would be all powerful. He also got exactly what he intended to get out of them otherwise he wouldn't be perfect. Try to debunk this statement.\n ***************************************************\n\n \n AMD: The above statement I believe to be correct. It seems like we agree on something. I too am unsure about these prototypes. I find JW theology confusing at times. \n \n Can you relate the above statement to our discussion as well? (Pardon my butting in on this discussion).", 
   {}, 
   36292, 
   null, 
   1077756480.0
  ], 
  [
   36302, 
   null, 
   "AMD4EVER", 
   "So saying to, particularly a child, worship god or go to hell, is not brainwashing. If you believe you country is the best in the world is either ignorance or patriotism, thats not brainwashing.\n\n \n Not in my opinion. It is no different than teaching a child they have to do well in school or be a failure. It is the parent trying to teach the child a lesson they believe will be valuable to them in the future. It is necessary in my opinion to have such forms of teaching be available regardless as to whether this is brainwashing or not. Also teaching your child that you live in the best country in the world is an opinion just as is the opinion whether God exists or not. As long as your child is subjected to you as their primary teacher and you teach them your opinion I guess you could claim that it is a form of brainwashing.\n \n [QUOTE]Take for example suicide bombers, they believe they will go to heaven if they carry out there mission, thats also brainwashing, would a patriot do something like that? I dont think so. [/UOTE]\n \n I still think this is showing that humans are social and learn from what others like them do. May it be family or countrymen or those of similar race, creed, or origin, I think humans will just learn from what they see and be strongly influenced by it. It is not common that you see Americans going on suicide runs yet you see it a lot around Israel. It is the type of people who live there and the message they pass on as an entire group. It is not just an isolated case of brainwashing, it is a part of their culture I guess you could say.\n \n \nIts interesting to note my earlier post, in places where theres no or little religious education, theres a lower number of religious people.\n\n \n But this also deals with the fact that people are social and learn from those around them. If there are no religious centers then people have no place to go to socially learn to be religious therefore there are less religious people. Culture itself is a form of brainwashing you to believe that there are a certain set of things that you have to do to fit in. You learn what these things are socially, not by being set down and forced to learn these things. It is socially and culturally learned.", 
   {}, 
   36293, 
   null, 
   1077756900.0
  ], 
  [
   36304, 
   null, 
   "epaphras_faith", 
   "Then answer me this. Would you with your hand placed on the Bible state that you believe that Saddam led an election based on the free will of the people because he followed a democratic process but also threatened to kill anyone who didn't vote as he wished for them to? I honestly couldn't do this because I know what that was. I also know what this threatening from God is as I'm sure you do as well. He threatens you with something you cannot go against and says he is giving you a choice. That is not free will and I'm sure you know it.\n \n \n \n Oh for crying out loud. You can layer heaven or even make it just heaven and earth. Earth could be considered the bad place. At least you get a second chance at that point and are not doomed so something so horrible and perminent as hell. There is your free will and there is a much better solution than the current one in place.\n \n \n \n I'll revert back to something I just touched on in my last post. If God desires that no one goes to hell and someone does then his perfect design has already failed. If his desires are not met then he has done something wrong. But that is just my opinion based on the fact that he should be all knowing, all powerful, and perfect. Do you see a flaw in my logic?\n \n Why did he need to send Jesus here in the first place is the real question. He planned for it to be this way otherwise it wouldn't have happened. He created something that was flawed in many ways, just as he intended it to be. It would be his own choice and he made the choice long before sending Jesus to Earth. Also know that sending Jesus to die would be like me sending my program to die by infecting with a virus while I know full good and well that I have a backup copy. God never sacraficed anything by sending Jesus here. The whole idea of this creating a family was his idea, not something that he was born with like we no Earth are. He created this system so it probably means very little to him in the first place especially when he knows that he cannot lose what he creates. It's like playing SimCity, building a huge city, and then burning only to be able to reload a saved game later. Burning it really doesn't even disturb you a bit because you can always just get it right back the way it was.\n \n Being that there was no choice at first then that proves that if there was only a heaven that the system would be just fine. There is no requirement for there to be a choice at all so you just answered your own question but left yourself open for another one. Way was there only initially a hell if God loved us so much rather than there just being a heaven?\n\n \n You are wrong on several points of your assumptions. Also, you seem to be getting disturbed by the discussion (\"oh for crying out loud\" and the like) so I will only answer here and then cease. The people did have a choice to vote whatever way they wanted in Saddam's elections. He only gave them one choice. Him. He did not use anyone to run against him. He did not have to threaten anyone because there was no oponent.\n \n Heaven was the initial. God existed. Genesis records that God created heaven and earth. Note heaven comes first. Angels first disobeyed God. This is the fall of the angelic \"stars\" of the book of Isaiah. Satan was cast down to earth and out of heaven. Hell is simply separation from God. It is not a physical place. If you don't want to be with God then don't. If you do want to be with God, then do. That is a choice. God tells the consequences. Your other options don't answer my question. You say, levels of heaven. At what point do the levels of separation from God become hell? God made it clear. You either are against Him or for Him. \n \n He continues to give you chances. You have the opportunity right now even though you will not take it. You have all the chances in the world. You have a life full of them. You just cannot accept that you have a choice. That would mean you have to choose. \n \n I am done for now. If you have specific questions I will answer provided they are not attempts to reopen this discussion with me. We are getting nowhere.", 
   {}, 
   36296, 
   null, 
   1077757020.0
  ], 
  [
   36305, 
   null, 
   "AMD4EVER", 
   "AMD: The above statement I believe to be correct. It seems like we agree on something. I too am unsure about these prototypes. I find JW theology confusing at times. \n \n Can you relate the above statement to our discussion as well? (Pardon my butting in on this discussion).\n\n \n Why of course. Since God is only perfect if his plans are unfolding exactly as his all powerful intentions meant for them to then he is the cause of basically everything even if it is indirectly. He knew that there would be people who would suffer on Earth and that there would be those who would not listen to him and he would therefore have to send to hell. He knew who these people would be and he knew what it would mean to send them to hell. Therefore God must have wanted there to be a hell, wanted to people to go to hell, and that in itself shows that he is not all that well suited to be considered the God some Christians believe he is. Many Christians will say that he does not want anyone to go to hell but based on my analysis I would have to say that is incorrect. If this is the case then how can he be a God that is purely good and not have a dark side to him? If he has a darkside to him then is he truely worthy of worship?", 
   {}, 
   36297, 
   null, 
   1077757200.0
  ], 
  [
   36309, 
   null, 
   "AMD4EVER", 
   "You are wrong on several points of your assumptions. Also, you seem to be getting disturbed by the discussion (\"oh for crying out loud\" and the like) so I will only answer here and then cease.\n\n \n You have been playing games here with me and not really taking this debate seriously. I consider this to be one of the most serious debates possible and you are responding to my posts in such as way that you know you are intentionally trying to spin the argument. In other words I know you are smart enough to understand what I am saying without having to spell everything out to you over and over yet you are not acting like it. So yet I would so I am getting disturbed with how you are acting in this debate. I thought you would be someone who could really help us both get a lot more out of this than you really have.\n \n \nThe people did have a choice to vote whatever way they wanted in Saddam's elections. He only gave them one choice. Him. He did not use anyone to run against him. He did not have to threaten anyone because there was no oponent.\n\n \n This is another spin which just makes me shake my head but I'm not going to continue debating you at a near childish level.\n \n \nHeaven was the initial. God existed. Genesis records that God created heaven and earth. Note heaven comes first. Angels first disobeyed God. This is the fall of the angelic \"stars\" of the book of Isaiah. Satan was cast down to earth and out of heaven. Hell is simply separation from God. It is not a physical place. If you don't want to be with God then don't. If you do want to be with God, then do. That is a choice. God tells the consequences. Your other options don't answer my question. You say, levels of heaven. At what point do the levels of separation from God become hell? God made it clear. You either are against Him or for Him. \n\n \n This still doesn't address the problem that he created heaven but let everyone's sole be collected in hell until Jesus died. So why did he make the decision to do this if he really loved us? Was he unaware it was happening or didn't he care?\n \n \nHe continues to give you chances. You have the opportunity right now even though you will not take it. You have all the chances in the world. You have a life full of them. You just cannot accept that you have a choice. That would mean you have to choose. \n\n \n I do agree that there would be a choice to make if the Bible really was truthful but at this point I have to doubt it even more now than I have in the past. There are just so many things that don't add up. Even now you agreed that because of the combo of all knowing, all powerful, and perfect that everything is intentionally happening as God planned it to. This really does conflict with free will because for everything to happen perfectly God would have had to make us exactly correct for us to do everything we had to do. That means he created me to have this conversation with you right now and although it may seem as though free will has guided me here it couldn't have possibly done so.\n \n \nI am done for now. If you have specific questions I will answer provided they are not attempts to reopen this discussion with me. We are getting nowhere.\n\n \n I feel I have come about 10 light years in this one debate today. I am so glad that I decided to read this thread and continue diving into new ideas. I realize so much more now and I hope you do as well.", 
   {}, 
   36304, 
   null, 
   1077757860.0
  ], 
  [
   36313, 
   null, 
   "epaphras_faith", 
   "You have been playing games here with me and not really taking this debate seriously. I consider this to be one of the most serious debates possible and you are responding to my posts in such as way that you know you are intentionally trying to spin the argument. In other words I know you are smart enough to understand what I am saying without having to spell everything out to you over and over yet you are not acting like it. So yet I would so I am getting disturbed with how you are acting in this debate. I thought you would be someone who could really help us both get a lot more out of this than you really have.\n \n \n \n This is another spin which just makes me shake my head but I'm not going to continue debating you at a near childish level.\n \n \n \n This still doesn't address the problem that he created heaven but let everyone's sole be collected in hell until Jesus died. So why did he make the decision to do this if he really loved us? Was he unaware it was happening or didn't he care?\n \n \n \n I do agree that there would be a choice to make if the Bible really was truthful but at this point I have to doubt it even more now than I have in the past. There are just so many things that don't add up. Even now you agreed that because of the combo of all knowing, all powerful, and perfect that everything is intentionally happening as God planned it to. This really does conflict with free will because for everything to happen perfectly God would have had to make us exactly correct for us to do everything we had to do. That means he created me to have this conversation with you right now and although it may seem as though free will has guided me here it couldn't have possibly done so.\n \n \n \n I feel I have come about 10 light years in this one debate today. I am so glad that I decided to read this thread and continue diving into new ideas. I realize so much more now and I hope you do as well.\n\n \n AMD:\n \n I meant no disrespect. Haven't we done this before though. You won't accept my definition of free will. You call it spin. The definition you offer is not a good one as it defines doing what ever you want without any consequences. That is simply ridiculous. There is no such thing, with or without a God. \n \n You won't accept my concept of God. Neither will I accept the idea that God does not exist. What did you hope to gain out of this if we are only going to go back and forth and say the other is wrong. How is that helpful. Provide some information as to why your definition is better. You argue the nature of God well. I don't dispute that. I have given reason as to why he is worthy of worship. He is the definer of all things. You say no he is not and then blame me for not proving that he is. \n \n I CANNOT PROVE IT. to ask for this is useless. I stopped because we are getting nowhere. I know where you stand. Your current responses show that you have not changed your stance. \n \n As for spin, I could say the same about you. It is a non argument. I have provided a definition. Choice is choice. Regardless if it is a difficult or easy choice. \n \n As for the nature of God, I cannot actually answer all of the why questions you ask. Ask Him. I am a finite being with limited education and understanding. Why would you expect me to answer everything. I was hoping we could focus on the one issue. I gave you an overview of christian theology. You then argued the points of it. Not a fair thing to do since the question at hand is why. I have answered why. \n \n If you truly are looking for good answers then I will continue. It did not seem like it because of the kinds of responses you were making. You attacked with statements like \"and you know it\" and the like. Those are non arguments and frutiless. \n \n I have not attacked you. I have tried to answer the questions and you accuse me of evading them. I am not God and am doing the best I can. You asking me Why God did something. That is like me asking you why Joseph McMillian in Rhode Island did something. I can only tell you what the bible tells me. And we both know what you think of the bible. So............what am I left with?\n \n No one's soul was collected in hell till Jesus died. The new testament refers to them as asleep. I am not sure what that means and I don't thinbk the bible speaks to it.\n \n Please, do not accuse me of intentionally spinning anything. I do not do that. I hate that in fact. I will always answer to the best of my ability. If it seems like spin ask me to clarify. Ask a question or two but don't slam me and don't spam me with questions. I cannot keep up.", 
   {}, 
   36309, 
   null, 
   1077758760.0
  ], 
  [
   36317, 
   null, 
   "AMD4EVER", 
   "I meant no disrespect. Haven't we done this before though. You won't accept my definition of free will. You call it spin. The definition you offer is not a good one as it defines doing what ever you want without any consequences. That is simply ridiculous. There is no such thing, with or without a God. \n\n \n Where are you getting this from? I simply stated that in the very specific instance of the choice of either following God or not there really isn't a real choice to be made. If God came to everyone on this planet right now and gave them their options I don't think there would be one non-Christian left on the planet. There just is no real opportunity to make a choice when it comes to praising God or not considering that if you don't you will go to hell. That is all I stated. I never said anything about people being able to do whatever they want without any consquences. Find where I said this. You say you mean no disrespect but then you follow it up with this type of statement.\n \n \nYou won't accept my concept of God. Neither will I accept the idea that God does not exist. What did you hope to gain out of this if we are only going to go back and forth and say the other is wrong. How is that helpful. Provide some information as to why your definition is better. You argue the nature of God well. I don't dispute that. I have given reason as to why he is worthy of worship. He is the definer of all things. You say no he is not and then blame me for not proving that he is. \n\n \n How is it helpful? I am simply debating a brand new idea of mine. I started the day debating how God ruled like a communist. I end the day realizing that because God is all knowing, all powerful, and perfect, that everything that happens is actually linked directly to his own will. This is a concept I had dismissed long ago. Going back and forth allowed me to see a whole lot of new issues today and toy with a lot of different ideas. I don't go into a debate thinking that I am correct generally. I just state my views and hope to become better educated on a subject and that is exactly what happened today for me. So what you see as back and forth was really a list of very interesting and influential ideas to me.\n \n \nI CANNOT PROVE IT. to ask for this is useless. I stopped because we are getting nowhere. I know where you stand. Your current responses show that you have not changed your stance. \n\n \n I'm not sure what you are responding to here. I can't find the word prove in the post you are responding to.\n \n \nAs for spin, I could say the same about you. It is a non argument. I have provided a definition. Choice is choice. Regardless if it is a difficult or easy choice. \n\n \n I didn't call that spin. What I was refering to was the fact that you said Saddam didn't give people a choice. There was a choice to optionally write a name in if they wanted to so there was a choice. Of course there was a good chance that you would die trying this. So in your own opinion this should still be viewed as a choice and not anyone forcing a choice on you. This is not the way I see it though. I believe there was a choice but the choice was forced on the people. I can't even gather how you couldn't see it that way.\n \n \nAs for the nature of God, I cannot actually answer all of the why questions you ask. Ask Him. I am a finite being with limited education and understanding. Why would you expect me to answer everything. I was hoping we could focus on the one issue. I gave you an overview of christian theology. You then argued the points of it. Not a fair thing to do since the question at hand is why. I have answered why. \n\n \n Then I'll only ask you if it makes sense. So does it make sense that the loving and perfect God didn't allow people into heaven before the death of Jesus? If not then do you see this as a failure on any level considering those poor souls in hell right now who would have been in heaven under todays 'rules'?\n \n \nIf you truly are looking for good answers then I will continue. It did not seem like it because of the kinds of responses you were making. You attacked with statements like \"and you know it\" and the like. Those are non arguments and frutiless. \n\n \n I does upset me that I believe you know one thing but are debating another just to carry your debate. I think you do realize that we have a decision that is forced on us and that it really is unfair of God to give us the option of worship or hell.\n \n \nI have not attacked you. I have tried to answer the questions and you accuse me of evading them. I am not God and am doing the best I can. You asking me Why God did something. That is like me asking you why Joseph McMillian in Rhode Island did something. I can only tell you what the bible tells me. And we both know what you think of the bible. So............what am I left with?\n\n \n Logic is what we are all left with. Logic is what allowed me to come to the conclusion that God probably does display a weakness or lazy side to him based on what we know about him. Everything he does has a reason and the reasoning is perfect. A perfect reason for him to create us and have a heaven and hell is to get something that he needs done for him. That would explain why he will recreate a second earth after his second coming where only the good will live. It would explain the reason that we are all here today. We are here to do his work for him. Perhaps he really isn't all powerful and that would explain a whole lot about him including the mistakes he has made and the flaws that appear when you consider that he should be perfect and everything should be going as planned yet there is a hell and not everyone of his creations worships him the way it should have been meant to be. Maybe God is a much more like us than we think he is, maybe a scientist of the stars. This is at least what I'm starting to believe we may be dealing with here. It just seems to add up a lot more than the whole all powerful, all knowing, perfect God idea does.\n \n \nNo one's soul was collected in hell till Jesus died. The new testament refers to them as asleep. I am not sure what that means and I don't thinbk the bible speaks to it.\n\n \n I was probably misinformed on this subject. I was told that they had all gone to hell including Jesus until heaven was finally opened to them all. I was also told no sins were taken away from anyone but the living meaning they would all have to go to hell anyways.\n \n \nPlease, do not accuse me of intentionally spinning anything. I do not do that. I hate that in fact. I will always answer to the best of my ability. If it seems like spin ask me to clarify. Ask a question or two but don't slam me and don't spam me with questions. I cannot keep up.\n\n \n I haven't been intentionally spamming questions here. I have just had so many ideas I had to get them posted before forgetting what they were.", 
   {}, 
   36313, 
   null, 
   1077760260.0
  ], 
  [
   36320, 
   null, 
   "epaphras_faith", 
   "Where are you getting this from? I simply stated that in the very specific instance of the choice of either following God or not there really isn't a real choice to be made. If God came to everyone on this planet right now and gave them their options I don't think there would be one non-Christian left on the planet. There just is no real opportunity to make a choice when it comes to praising God or not considering that if you don't you will go to hell. That is all I stated. I never said anything about people being able to do whatever they want without any consquences. Find where I said this. You say you mean no disrespect but then you follow it up with this type of statement.\n \n \n \n How is it helpful? I am simply debating a brand new idea of mine. I started the day debating how God ruled like a communist. I end the day realizing that because God is all knowing, all powerful, and perfect, that everything that happens is actually linked directly to his own will. This is a concept I had dismissed long ago. Going back and forth allowed me to see a whole lot of new issues today and toy with a lot of different ideas. I don't go into a debate thinking that I am correct generally. I just state my views and hope to become better educated on a subject and that is exactly what happened today for me. So what you see as back and forth was really a list of very interesting and influential ideas to me.\n \n \n \n I'm not sure what you are responding to here. I can't find the word prove in the post you are responding to.\n \n \n \n I didn't call that spin. What I was refering to was the fact that you said Saddam didn't give people a choice. There was a choice to optionally write a name in if they wanted to so there was a choice. Of course there was a good chance that you would die trying this. So in your own opinion this should still be viewed as a choice and not anyone forcing a choice on you. This is not the way I see it though. I believe there was a choice but the choice was forced on the people. I can't even gather how you couldn't see it that way.\n \n \n \n Then I'll only ask you if it makes sense. So does it make sense that the loving and perfect God didn't allow people into heaven before the death of Jesus? If not then do you see this as a failure on any level considering those poor souls in hell right now who would have been in heaven under todays 'rules'?\n \n \n \n I does upset me that I believe you know one thing but are debating another just to carry your debate. I think you do realize that we have a decision that is forced on us and that it really is unfair of God to give us the option of worship or hell.\n \n \n \n Logic is what we are all left with. Logic is what allowed me to come to the conclusion that God probably does display a weakness or lazy side to him based on what we know about him. Everything he does has a reason and the reasoning is perfect. A perfect reason for him to create us and have a heaven and hell is to get something that he needs done for him. That would explain why he will recreate a second earth after his second coming where only the good will live. It would explain the reason that we are all here today. We are here to do his work for him. Perhaps he really isn't all powerful and that would explain a whole lot about him including the mistakes he has made and the flaws that appear when you consider that he should be perfect and everything should be going as planned yet there is a hell and not everyone of his creations worships him the way it should have been meant to be. Maybe God is a much more like us than we think he is, maybe a scientist of the stars. This is at least what I'm starting to believe we may be dealing with here. It just seems to add up a lot more than the whole all powerful, all knowing, perfect God idea does.\n \n \n \n I was probably misinformed on this subject. I was told that they had all gone to hell including Jesus until heaven was finally opened to them all. I was also told no sins were taken away from anyone but the living meaning they would all have to go to hell anyways.\n \n \n \n I haven't been intentionally spamming questions here. I have just had so many ideas I had to get them posted before forgetting what they were.\n\n \n Very well. I apologize for putting on you that which you have not done. I don't wish to do that. I will have to go back and look at things again.\n \n One thing to touch on, you say that if God showed up right here and now that there wouldn't be a non christian left. That is simply incorrect. The children of israel were lead by God as a pillar of fire and a cloud. They were given the manna, they were given water from a rock. They saw the glory of God fill the tent of meeting so much that it pushed Moses out. They saw Pharoa's (sic) army swallowed up by the sea after they crossed over and how they were protected by the pillar of fire that was God. He was there. They still made a golden calf to worship at the foot of sinai. Not all people will choose God. In spite of the potential for \"punishment\". You ever wonder why some don't choose with that choice in front of them. \n \n God made it clear. either for or against him. It may not seem like a choice to you, but it is the choice. \n \n Look at it this way. If it really is the only choice, heaven or hell, then which do you choose and why? If it isn't the choice then there is nothing and we are already in hell. I am not willing to accept that one.\n \n At some point we will simply get to an issue of faith. I am simply trying to cut to the chase.", 
   {}, 
   36317, 
   null, 
   1077760860.0
  ], 
  [
   36328, 
   null, 
   "AMD4EVER", 
   "One thing to touch on, you say that if God showed up right here and now that there wouldn't be a non christian left. That is simply incorrect. The children of israel were lead by God as a pillar of fire and a cloud. They were given the manna, they were given water from a rock. They saw the glory of God fill the tent of meeting so much that it pushed Moses out. They saw Pharoa's (sic) army swallowed up by the sea after they crossed over and how they were protected by the pillar of fire that was God. He was there. They still made a golden calf to worship at the foot of sinai. Not all people will choose God. In spite of the potential for \"punishment\". You ever wonder why some don't choose with that choice in front of them. \n\n \n Perhaps this is the case but I can't think of a reasonable person who would deny that fact that God existed and that a choice must be made if God was to appear to them. It is all that I ask that God show himself and prove his existance as it would end all the questioning and speculation. If it has to come in the form of the end days that is fine with me as well. I know that probable evidence is enough for me but physical would be much better and I think this would be the case for many people still looking for answers.\n \n \nLook at it this way. If it really is the only choice, heaven or hell, then which do you choose and why? If it isn't the choice then there is nothing and we are already in hell. I am not willing to accept that one.\n\n \n If there is no choice then life is as a scientist would expect it to be. It is simply existance and then nothing. That wouldn't make this hell. It makes this our one and only home. I'm not dead set against this being a possibility either as science would indicate that this is rather likely.\n \n \nAt some point we will simply get to an issue of faith. I am simply trying to cut to the chase.\n\n \n It really isn't just about faith to me. I have faith in myself and that I will find the correct answer as long as I keep looking. I am not pinning myself down to any single idea with out good solid proof.", 
   {}, 
   36320, 
   null, 
   1077761880.0
  ], 
  [
   36339, 
   null, 
   "XQsThaiPoes", 
   "If I were to ever relate God to time I would get called on it right away so I guess I'll have to do the same to you. What make you think that God is at all related to time in any way? He is above time and is not constrained by it. So he probably hasn't been doing anything for any amount of time. Don't try to use that explaination to give a likely solution to why he created humans.\n \n \n \n Without going too deep into this I gather that what your basically saying is that he has done all this for his own amusement? Does this make God worthy of our worship?\n \n \n \n ***************************************************\n If you only answer a couple questions in your reply please make it these.\n \n What is this about prototypes? Are you suggesting God the perfect needs prototypes? Are you also suggesting the things he created were unlike what he intended them to be?\n \n Let me make you aware that he knew what was going to happen long before making the first humans otherwise he wouldn't be all knowing. He created them exactly as he wanted to create them otherwise he would be all powerful. He also got exactly what he intended to get out of them otherwise he wouldn't be perfect. Try to debunk this statement.\n ***************************************************\n\n \n Time go fig. \n \n His own asmusement yeah. You got a problem with that? \n \n He is worthy cuz he said so. Look people give the state more authority than God. He ask the same thing the military does. This is one reason why my religion does not join the military.\n \n \n Prototypes whats wrong with that? Adam was the first generation a one off. Eve was extracted from him and probally was a female \"clone\" a test mule. They broke. Adam said it was Gods fault they broke he made the woman. God said \"You're kidding right? I told you if you ate that you would break. Warranty void. Next customer.\"\n \n How would God know what would happen? It was not his choice. If there is a fork in the road and God says pick a one then he is saying \"I don't know what is going to happen next you decide\" that is the concept of choice. If you don't beleave in choice fine. Then you should be an atheist. My religion was founded by idiology from a former presbytarian. They don't believe in choice. We logiced out long ago if there is no choice then God lied.\n \n (He also got exactly what he intended to get out of them otherwise he wouldn't be perfect. )\n \n He also created entropy and \"evil\" what's your point. How does perfect mean what you say. Satan is perfect. He is also evil.", 
   {}, 
   36292, 
   null, 
   1077766260.0
  ], 
  [
   36342, 
   null, 
   "AMD4EVER", 
   "As long as you believe that God is not all knowing (\"How would God know what would happen?\") how can he be perfect?", 
   {}, 
   36339, 
   null, 
   1077767820.0
  ], 
  [
   36343, 
   null, 
   "XQsThaiPoes", 
   "This is turning into a very hectic debate, 46 posts in such a short time.\n \n I still think theres a certain amount of brainwashing involved, not only in christianity but other religions too.\n \n XQthaipoes, your a jehovas witness, what do you worship to, if anything? Why are you a jehovas witness, were you converted or brought up being one?\n \n In eastern europe, particularly the ex soviets states, church attendences are far lower than in western europe or other religios countries. People there are not so religious.\n \n During communist times they did not have religious education and church/religios gatherings were frowned on by the communists. \n \n Which is probably why people are not so religious, which in a way, although not conclusive, shows that preaching to children, brainwashes them to believe.\n\n \n Plotter you are actually a bit off. Jehovah's Witnesses were all sent to labor camps in Siberia in a personal order from Stalin. Growth in the former Soviet Union is among greatest in the world, and attendance among the best.\n \n We worship Jehovah the Jew's God.\n \n My parents are Jehovah's Witnesses. I decided to become one as a teenager. My stepbrother thought he wanted to be one, but later left, then he decided to give it a try again, and was murdered in a spat with his gangland friends the day his decided to call it quits like some bad movie cliché. My sister is undecided and just hanging around.\n \n This is to AMD the things you are saying we have been saying as a religion for a long time. Even the sleep in death part. The mainstream Christian doctrine that's not in pop culture Christianity (in America we have this new MTV teeny bop Christianity that preys on kids in rural towns and the suburbs that is like day care for teens with raging hormones) doesn't make sense. Most Christian religions realized it is a logical fallacy and invent ways around it. Catholics hundreds of years ago for example sold indulgences, created purgatory, and put in confession booths to cope. \n \n We take the obvious path and just tell it like it is. People outside the bible made up most of \"Christian\" doctrine. If you read that lil black book you realized that God runs a simple holy monarchy. The reason that the bible is hard to relate to now is we don't live like that anymore, but for thousands of years God's system mirrored human government (there goes the made in his image thing). Even pagans isolated from the Middle East used this form of rule. The JW doctrine due to its origins is hard to crack unless you try to undermine \"credibility\". If you don't have an issue with credibility then there is no hell, and God is not Jesus so \"Christianity\" works. All the Jewish metaphors make sense.", 
   {
    "unicode_changes_made": true
   }, 
   36278, 
   null, 
   1077768600.0
  ], 
  [
   36347, 
   null, 
   "XQsThaiPoes", 
   "As long as you believe that God is not all knowing (\"How would God know what would happen?\") how can he be perfect?\n\n \n You are confused. Being omniscient, is not the same as predestination, nor is it prognostication. It is the difference of watching someone get hit by a car vs. pushing them into car to see them get hit vs. seeing someone on a cell phone driving while a kid chases a ball into the street. One is observation, the other is cause, and the latter is wisdom.\n \n Plus Jesus is not all knowing, and he is perfect. Before any Trinitarians get going Mark 13:32.", 
   {}, 
   36342, 
   null, 
   1077771180.0
  ], 
  [
   36350, 
   null, 
   "AMD4EVER", 
   "You are confused. Being omniscient, is not the same as predestination, nor is it prognostication. It is the difference of watching someone get hit by a car vs. pushing them into car to see them get hit vs. seeing someone on a cell phone driving while a kid chases a ball into the street. One is observation, the other is cause, and the latter is wisdom.\n \n Plus Jesus is not all knowing, and he is perfect. Before any Trinitarians get going Mark 13:32.\n\n \n I still don't see the connection here. Doesn't he need to be all knowing to be perfect? How can he be perfect at everything he does if he is unable to anticipate what is going to occur? If he were to develop the perfect world how would he actually accomplish this if he doesn't know whether there will be problems with it in the future? I think perfection demands knowing all including the future as well as being all powerful.", 
   {}, 
   36347, 
   null, 
   1077772500.0
  ], 
  [
   36352, 
   null, 
   "XQsThaiPoes", 
   "I still don't see the connection here. Doesn't he need to be all knowing to be perfect? How can he be perfect at everything he does if he is unable to anticipate what is going to occur? If he were to develop the perfect world how would he actually accomplish this if he doesn't know whether there will be problems with it in the future? I think perfection demands knowing all including the future as well as being all powerful.\n\n \n (Doesn't he need to be all knowing to be perfect?)\n \n \n No. You are using the term all knowing. Do you mean prognostication, omniscient, or predestination? \n \n (How can he be perfect at everything he does if he is unable to anticipate what is going to occur?)\n \n Um... you are sort of messed up man. How does eliminating choice or law make God perfect in your eyes? People that build planes know how it will fly before it takes off theoretically and they are not God. God knows what is happening, he knows what can happen,but if he knows exactly what will happen infinitely into the future then their is no choice. Everything is predestined.\n \n \n (I think perfection demands knowing all including the future as well as being all powerful.)\n Wow you are a harsher judge than God himself.", 
   {}, 
   36350, 
   null, 
   1077774840.0
  ], 
  [
   36370, 
   null, 
   "XeoX", 
   "Wow, this thread has seen a lot of activity.\n \n \nHeaven was the initial. God existed. Genesis records that God created heaven and earth. Note heaven comes first. Angels first disobeyed God. This is the fall of the angelic \"stars\" of the book of Isaiah. Satan was cast down to earth and out of heaven. Hell is simply separation from God. It is not a physical place. If you don't want to be with God then don't. If you do want to be with God, then do. That is a choice. \n\n \n I feel the defenition of hell has never became quite clear. If hell is not a physical place, is it a spiritual place? Is it a place where we suffer eternal torment or is it simply removal from god? (Becuse I don't feel those two are the same.)\n \n \nYou either are against Him or for Him. \n\n \n Many have said this. I found it as stupid every time.\n \n \nLook at it this way. If it really is the only choice, heaven or hell, then which do you choose and why? If it isn't the choice then there is nothing and we are already in hell. I am not willing to accept that one. \n\n \n Your world is only what you chose to make it. No more, no less.", 
   {
    "unicode_changes_made": true
   }, 
   36304, 
   null, 
   1077788400.0
  ], 
  [
   36382, 
   null, 
   "AMD4EVER", 
   "(How can he be perfect at everything he does if he is unable to anticipate what is going to occur?)\n \n Um... you are sort of messed up man. How does eliminating choice or law make God perfect in your eyes? People that build planes know how it will fly before it takes off theoretically and they are not God. God knows what is happening, he knows what can happen,but if he knows exactly what will happen infinitely into the future then their is no choice. Everything is predestined.\n\n \n Are you suggesting that we can make the perfect plane right now? Are you sure that if we could see the future that we couldn't design better planes than our current ones? Perhaps we could have even developed planes that would not have allowed a 9/11. That stands as our flaw right now. Sure our planes fly just fine but we have reason to fear them as well. They are not perfect. If we had known the future we could have found a way to defeat this flaw on every occassion. Perfection requires knowing the future.\n \n \n(I think perfection demands knowing all including the future as well as being all powerful.)\n Wow you are a harsher judge than God himself.\n\n \n I'm just trying to state the obvious. You can create something that seems perfect but unless you know exactly what is going to happen in the future you are going to be unable to control whether flaws will appear or not. You have to see the future to make things perfect otherwise you leave your 'perfection' open to random acts meaning you can only get to near perfection. If God is perfection he needs to see the future and be all powerful.", 
   {}, 
   36352, 
   null, 
   1077806940.0
  ], 
  [
   36419, 
   null, 
   "epaphras_faith", 
   "Perhaps this is the case but I can't think of a reasonable person who would deny that fact that God existed and that a choice must be made if God was to appear to them. It is all that I ask that God show himself and prove his existance as it would end all the questioning and speculation. If it has to come in the form of the end days that is fine with me as well. I know that probable evidence is enough for me but physical would be much better and I think this would be the case for many people still looking for answers.\n \n \n \n If there is no choice then life is as a scientist would expect it to be. It is simply existance and then nothing. That wouldn't make this hell. It makes this our one and only home. I'm not dead set against this being a possibility either as science would indicate that this is rather likely.\n \n \n \n It really isn't just about faith to me. I have faith in myself and that I will find the correct answer as long as I keep looking. I am not pinning myself down to any single idea with out good solid proof.\n\n \n I have been in that very spot. Believe nothing without seeing it. I will tell you that if you don't believe, you will not see it. You can call that brainwashing if you like, but it is true. \n \n If this is the end all be all of existence, this is hell. Take a look around you. Don't ignore the bum on the corner asking for money, look at him. You don't have to give to him, just look at him. Look at the wars and the death and carnage, the crime, the child porn etc. Evil exists to the nines in this world. You and I do not have what it takes within ourselves to deal with the evil that is present in us let alone the world. Haven't you ever done something or acted in a way that you were ashamed of? Why do you suppose that people do things that, in reality, they don't really want to do?", 
   {}, 
   36328, 
   null, 
   1077818040.0
  ], 
  [
   36479, 
   null, 
   "XeoX", 
   "If this is the end all be all of existence, this is hell. Take a look around you. Don't ignore the bum on the corner asking for money, look at him. You don't have to give to him, just look at him. Look at the wars and the death and carnage, the crime, the child porn etc. Evil exists to the nines in this world. You and I do not have what it takes within ourselves to deal with the evil that is present in us let alone the world. Haven't you ever done something or acted in a way that you were ashamed of? Why do you suppose that people do things that, in reality, they don't really want to do?\n\n \n The world is what we make it. Evil is in the eye of the beholder, there are no objectives and there are no values other than the ones we create. What you see as evil may be seen as good by someone else. (I guess you feel this is wrong and that god decides what's evil though, but that's my thoughs on the matter.)\n If 'evil' didn't exist who'd know the difference? (Yeah, I know, god obviously...) Suffering and pain will always exist in abundance, but that doesn't mean you can't relish the good things and that doesn't mean you can't try as hard as you can to make the world a better place.\n You and I can't make the world perfect, but we can make the world better. We can't succeed but we can do our best. It takes so little to spread som happiness. I have done things I'm ashamed of, sure, but the main thing is that we try.", 
   {
    "unicode_changes_made": true
   }, 
   36419, 
   null, 
   1077838080.0
  ], 
  [
   36492, 
   null, 
   "epaphras_faith", 
   "The world is what we make it. Evil is in the eye of the beholder, there are no objectives and there are no values other than the ones we create. What you see as evil may be seen as good by someone else. (I guess you feel this is wrong and that god decides what's evil though, but that's my thoughs on the matter.)\n If 'evil' didn't exist who'd know the difference? (Yeah, I know, god obviously...) Suffering and pain will always exist in abundance, but that doesn't mean you can't relish the good things and that doesn't mean you can't try as hard as you can to make the world a better place.\n You and I can't make the world perfect, but we can make the world better. We can't succeed but we can do our best. It takes so little to spread som happiness. I have done things I'm ashamed of, sure, but the main thing is that we try.\n\n \n So, do you believe there are any absolutes? Why is the main thing that we try?", 
   {
    "unicode_changes_made": true
   }, 
   36479, 
   null, 
   1077840840.0
  ], 
  [
   36577, 
   null, 
   "XeoX", 
   "So, do you believe there are any absolutes? Why is the main thing that we try?\n\n \n That's not an absolute. It's just my opinion.\n That we can't make the world perfect is not a reason for working towards making the world as nice a place as it can be made with our efforts. I have my own opinion of how the world could be better so naturally I work towards that, both for the sake of myself and all humanity.\n \n After thinking a bit I have deducted that if god existed I would be sent to hell regardless of what I 'chose'. If I didn't chose to worship god he would send me to hell. Even if I chose to worship god and accept him as my creator and lord I could not love him, since I would feel that sending anyone who didn't worship him to hell is horrid. I couldn't love a god like that, on the contrary I would hate him, so he would send me to hell regardless.", 
   {
    "unicode_changes_made": true
   }, 
   36492, 
   null, 
   1077878460.0
  ], 
  [
   36590, 
   null, 
   "epaphras_faith", 
   "That's not an absolute. It's just my opinion.\n That we can't make the world perfect is not a reason for working towards making the world as nice a place as it can be made with our efforts. I have my own opinion of how the world could be better so naturally I work towards that, both for the sake of myself and all humanity.\n \n After thinking a bit I have deducted that if god existed I would be sent to hell regardless of what I 'chose'. If I didn't chose to worship god he would send me to hell. Even if I chose to worship god and accept him as my creator and lord I could not love him, since I would feel that sending anyone who didn't worship him to hell is horrid. I couldn't love a god like that, on the contrary I would hate him, so he would send me to hell regardless.\n\n \n You haven't actually answered my questions. I asked if you believe in any absolutes. I wasn't saying what you said was an absolute. \n \n I also asked WHY is it important to try. You said it was the important thing. Why is it the important thing?", 
   {
    "unicode_changes_made": true
   }, 
   36577, 
   null, 
   1077897360.0
  ], 
  [
   36805, 
   null, 
   "XeoX", 
   "You haven't actually answered my questions. I asked if you believe in any absolutes. I wasn't saying what you said was an absolute. \n \n I also asked WHY is it important to try. You said it was the important thing. Why is it the important thing?\n\n \n The only absolute is that there is no absolutes.;)\n \n Why the important thing is that we try? Becuse the world could be a much happier place, we can't make it perfect but we can try. Why should we? Well why does people bother to improve things? I want to grant a happier existance to me and to everyone else. I feel that's important. That's why I feel it's important that we try. \n We should look to improving the existance we know we lead here on earth instead of spending our entire lives awating and preparing for an afterlife which existance is very doubtful.", 
   {
    "unicode_changes_made": true
   }, 
   36590, 
   null, 
   1078013760.0
  ], 
  [
   36811, 
   null, 
   "XQsThaiPoes", 
   "The only absolute is that there is no absolutes.;)\n \n Why the important thing is that we try? Becuse the world could be a much happier place, we can't make it perfect but we can try. Why should we? Well why does people bother to improve things? I want to grant a happier existance to me and to everyone else. I feel that's important. That's why I feel it's important that we try. \n We should look to improving the existance we know we lead here on earth instead of spending our entire lives awating and preparing for an afterlife which existance is very doubtful.\n\n \n Why you'll spend more time dead than alive? People only make the world better for their children. If they stop having kids whats the point?", 
   {
    "unicode_changes_made": true
   }, 
   36805, 
   null, 
   1078015560.0
  ], 
  [
   36876, 
   null, 
   "XeoX", 
   "Why you'll spend more time dead than alive? People only make the world better for their children. If they stop having kids whats the point?\n\n \n People spend no time dead at all since you cannot spend time if you doesn't exist.\n I make the world better, as I said, for myself and everyone around me. Betterments doesn't have to come in the next generation. Although I do care about the coming generations even if I won't be there to see their appreciation since I know I'm thankful for everyone that has done so before me.\n What's the point? The point is that there is no point exept those we make ourselfs. To some they make up the point of pleasing god. I make up the point of pleasing mankind.", 
   {
    "unicode_changes_made": true
   }, 
   36811, 
   null, 
   1078056180.0
  ], 
  [
   36880, 
   null, 
   "XQsThaiPoes", 
   "People spend no time dead at all since you cannot spend time if you doesn't exist.\n I make the world better, as I said, for myself and everyone around me. Betterments doesn't have to come in the next generation. Although I do care about the coming generations even if I won't be there to see their appreciation since I know I'm thankful for everyone that has done so before me.\n What's the point? The point is that there is no point exept those we make ourselfs. To some they make up the point of pleasing god. I make up the point of pleasing mankind.\n\n \n The people making things bad overpower the people making things good. It is useless to try to improve. The only system that remotely works like you describe is totalitarianism/absolutist but it breaks down often and is bloody.", 
   {
    "unicode_changes_made": true
   }, 
   36876, 
   null, 
   1078057920.0
  ], 
  [
   36921, 
   null, 
   "AMD4EVER", 
   "The people making things bad overpower the people making things good. It is useless to try to improve. The only system that remotely works like you describe is totalitarianism/absolutist but it breaks down often and is bloody.\n\n \n Do you even understand what you just said? Your just completely ignoring what XeoX stated and making up some baseless statements of your own. You state that bad is overpowering good but that is only an opinion that you state as a very general fact. Try to prove that bad is overpowering good and in doing so state what things you believe are good and what things you believe are bad. I'm probably correct in assuming your view of good and bad is harshly skewed to seeing the world as a negative place regardless of how good or bad it truely is. This can be seen in your second statement that states your bleak outlook on life. Psychologically you are probably just describing the state of your own life and blanketing that across your view of all life. But regardless of that you are still incorrect that it is useless to try to improve as improve doesn't even require total success. It only requires individual acts of any size that makes things better and I can garentee that this occurs. I'm also not sure what you are refering to when you state that only totalitarianism/absolutist works in the way XeoX described. I seen no remote reference to those types of government in the post your are refering to. Please enlighten me and point to the quotes that made you believe XeoX is pro-totalitarianism because of his beliefs. Personally I think your just pulling stuff out of thin air.", 
   {}, 
   36880, 
   null, 
   1078080660.0
  ], 
  [
   37016, 
   null, 
   "XQsThaiPoes", 
   "Do you even understand what you just said? Your just completely ignoring what XeoX stated and making up some baseless statements of your own. You state that bad is overpowering good but that is only an opinion that you state as a very general fact. Try to prove that bad is overpowering good and in doing so state what things you believe are good and what things you believe are bad. I'm probably correct in assuming your view of good and bad is harshly skewed to seeing the world as a negative place regardless of how good or bad it truely is. This can be seen in your second statement that states your bleak outlook on life. Psychologically you are probably just describing the state of your own life and blanketing that across your view of all life. But regardless of that you are still incorrect that it is useless to try to improve as improve doesn't even require total success. It only requires individual acts of any size that makes things better and I can garentee that this occurs. I'm also not sure what you are refering to when you state that only totalitarianism/absolutist works in the way XeoX described. I seen no remote reference to those types of government in the post your are refering to. Please enlighten me and point to the quotes that made you believe XeoX is pro-totalitarianism because of his beliefs. Personally I think your just pulling stuff out of thin air.\n\n \n I was saying it is a system in which one person can make a difference for every body. What is wrong being pro-totalitarian? It is not like a called him a racist or something.", 
   {}, 
   36921, 
   null, 
   1078105740.0
  ], 
  [
   37103, 
   null, 
   "epaphras_faith", 
   "The only absolute is that there is no absolutes.;)\n \n Why the important thing is that we try? Becuse the world could be a much happier place, we can't make it perfect but we can try. Why should we? Well why does people bother to improve things? I want to grant a happier existance to me and to everyone else. I feel that's important. That's why I feel it's important that we try. \n We should look to improving the existance we know we lead here on earth instead of spending our entire lives awating and preparing for an afterlife which existance is very doubtful.\n\n \n Keep going. The why's don't stop. Why do you WANT to make people happy? Why does it please you?", 
   {
    "unicode_changes_made": true
   }, 
   36805, 
   null, 
   1078159380.0
  ], 
  [
   37117, 
   null, 
   "WorldTraveller", 
   "Somehow I feel this gonna lead to GOD = CONSCIENCE...\n \n *head explodes*", 
   {}, 
   37103, 
   null, 
   1078160820.0
  ], 
  [
   37127, 
   null, 
   "epaphras_faith", 
   "Somehow I feel this gonna lead to GOD = CONSCIENCE...\n \n *head explodes*\n\n \n No, not really God equals concience. More along the lines of why do we have a concience if everything is predetermined and there are not absolutes?\n \n I don't think God is our concience. I do believe man is made in the image of God and therefore we have a concience (sic).\n \n However, I am not even going to God. Just asking the logical question, why? Unless nothing has a purpose. In which case that seems to contradict predetermination and the lack of absolutes as that is a statement that says there is no predetermination and it is an absolute statement.", 
   {}, 
   37117, 
   null, 
   1078162080.0
  ], 
  [
   37153, 
   null, 
   "WorldTraveller", 
   "I don't think God is our concience. I do believe man is made in the image of God and therefore we have a concience (sic).\n\n \n I spelled it right.\n \n In an amazing manoeuvre of mental acrobatics, I propose:\n \n *trumpets*\n \n \"Why not?\" \n \n Watch out he attempts the impossible:\n \n \"Because...\"\n \n emoticon_xgood \n \n apologies couldn't help myself...\n \n *proceeds to re-read thread for purposes of obtaining greater knowledge*", 
   {}, 
   37127, 
   null, 
   1078164840.0
  ], 
  [
   37175, 
   null, 
   "WorldTraveller", 
   "What makes God worthy of worship?\n \n Nothing.\n \n God deserves friendship...\n \n nothing more, nothing less. \n \n God deserve respect, as a creator.\n God deserves love, as a friend.\n Love and respect are qualities of friendship.\n \n I do not believe in hell, and the Bible is like Herodotus \"Histories\", stories that may have some basis in fact, but at the heart are just tall tales. I believe that the central tenant of friendship is faith. \n \n Translation of the \"Lord's Prayer\" in terms of my belief.\n \n Our father - God, our friend and creator\n who art in heaven - his home\n hallowed be thy name - we love our friend\n thy kingdom come - we wish to be with our friend in his home\n thy will be done - we will do as he asks because because he is our friend\n on earth as it is in heaven - we want our home to be like our friends home because it is very nice\n give us this day our daily bread - our friend provides for us\n and forgive us our trespasses - our friend forgives us when we screw up\n as we forgive those who trespass against us  - we wish our friend to follow in our example (note: this represents the equality of friendship)\n lead us not into temptation - as our friend we trust you to give us the right directions to your home\n but deliver us from evil - as our friend we trust you to look out for us\n for thine is the kingdom, the power and the glory - what is ours is yours\n forever and ever - \"\"\n Amen - Thankyou\n \n My relationship with God is mutualistic symbiosis, in which both benefit and are dependent. God is dependent on my faith to exist, I am dependent upon his provision and friendship to exist. We are NOT mutually exclusive.\n \n So what am I? Monotheistic. :P\n \n WT\n \n Note: My use of the Lord's Prayer comes from a Christian upbringing.", 
   {
    "post_info": {
     "post_title": "The tenants of my faith."
    }
   }, 
   37153, 
   null, 
   1078167540.0
  ], 
  [
   37182, 
   null, 
   "XeoX", 
   "The people making things bad overpower the people making things good. It is useless to try to improve. The only system that remotely works like you describe is totalitarianism/absolutist but it breaks down often and is bloody.\n\n \n It is not useless to try to improve. We can always improve even if we can't make perfect.\n That the evil outnumber the good, well I guess you may feel that way (even though I doubt you have counted). Since every person makes up by himself what is 'evil' or 'good' everyone would not agree that evil outnumber good. And even if it did, it's not a reason to give up.\n And what do totalitarism has to do with this? What do political systems have to do with it at all?\n \n \nKeep going. The why's don't stop. Why do you WANT to make people happy? Why does it please you?\n\n \n I don't know. That's just the way I am. \n Questions for you in return: Does it matter? Do we always need to know the reason? Does everything need a reason?\n \n \nHowever, I am not even going to God. Just asking the logical question, why? Unless nothing has a purpose. In which case that seems to contradict predetermination and the lack of absolutes as that is a statement that says there is no predetermination and it is an absolute statement.\n\n \n I don't belive in predetermination. Neither do I belive in a lack of purpose. Although I do belive that the only purpose is that which we create by ourselves.\n There are not only 'no objective purpose' there are not even the concept 'objective purpose' to begin with. We humans invented the abstraction 'purpose'. It matters only to us.", 
   {
    "unicode_changes_made": true
   }, 
   36880, 
   null, 
   1078169340.0
  ], 
  [
   37191, 
   null, 
   "unkerpaulie", 
   "What makes God worthy of worship?\n \n Nothing.\n \n God deserves friendship...\n \n nothing more, nothing less. \n \n God deserve respect, as a creator.\n God deserves love, as a friend.\n Love and respect are qualities of friendship.\n \n I do not believe in hell, and the Bible is like Herodotus \"Histories\", stories that may have some basis in fact, but at the heart are just tall tales. I believe that the central tenant of friendship is faith. \n\n Are you saying God is not worthy of worship, or he is? the comparison to a friend might mean He is not worthy, since you probably dont worship your friends\n \n If you dont believe whats in the Bible, what makes you think some parts are true? and how do you distinguish what is true and what is not? you know that is considered 'selective faith' (you only believe the parts of the bible most convenient to you) Im not accusing you of such, but Im curious as to how you know what to select as believable and what you dont (such as Hell, etc)...", 
   {}, 
   37175, 
   null, 
   1078170900.0
  ], 
  [
   37199, 
   null, 
   "epaphras_faith", 
   "I spelled it right.\n \n In an amazing manoeuvre of mental acrobatics, I propose:\n \n *trumpets*\n \n \"Why not?\" \n \n Watch out he attempts the impossible:\n \n \"Because...\"\n \n emoticon_xgood \n \n apologies couldn't help myself...\n \n *proceeds to re-read thread for purposes of obtaining greater knowledge*\n\n \n Yes you spelled it correctly, I did not and was not looking at your post when I was typing.\n \n Xeox: \nI don't know. That's just the way I am. \n \n and then, \nThere are not only 'no objective purpose' there are not even the concept 'objective purpose' to begin with. \n \n \n do you not see the contradiction? Your first statement is \"objective\" it is the way you are. It is the very essence of objectivity. You are and will be that way. Others can probably even say the same thing about you. Your second statement says it is not the way you are but is subjective, malleable to the moment.\n \n WT: My take on the lord's prayer.\n \n Our father - Creator of all\n who art in heaven - transcendant\n hallowed be thy name - may your name be honored\n thy kingdom come - imminent\n thy will be done - your desires are better\n on earth as it is in heaven - we want our home to be your home because it is very nice\n give us this day our daily bread - you provides for us\n and forgive us our trespasses - may we accept your forgiveness\n as we forgive those who trespass against us - to the extent we accept forgiveness we will forgive\n lead us not into temptation - we desire to do good\n but deliver us from evil - as our friend we trust you to look out for us\n for thine is the kingdom, the power and the glory - For you are in control of everything\n forever and ever - \"\"\n Amen - which is just the way it should be.\n \n I have tried to get the meanings as close as possible looking back at the greek text.", 
   {
    "unicode_changes_made": true
   }, 
   37153, 
   null, 
   1078173300.0
  ], 
  [
   37239, 
   null, 
   "WorldTraveller", 
   "Are you saying God is not worthy of worship, or he is? the comparison to a friend might mean He is not worthy, since you probably dont worship your friends\n \n \n Exactly, he is not worthy of worship, he is worthy of friendship. My relationship with God is an equal.\n \n \nIf you dont believe whats in the Bible, what makes you think some parts are true? and how do you distinguish what is true and what is not? you know that is considered 'selective faith' (you only believe the parts of the bible most convenient to you) Im not accusing you of such, but Im curious as to how you know what to select as believable and what you dont (such as Hell, etc)...\n \n \n I believe that some of the stories are based in fact, for example there is evidence to support there was a flood on the earth at one point, probably the origin of the Noah story. I do not accept the bible as the foundation of my faith.\n \n I guess after being a Christian in my childhood and it coming up inadequate/inconsistent/depressing I tried to form my own relationship with my God based on what I believed that relationship should be: as a friend, not worthy of worship, but worthy of respect and love.\n \n So I guess I could be considered a person of selective faith, if you wish.", 
   {}, 
   37199, 
   null, 
   1078185480.0
  ], 
  [
   37353, 
   null, 
   "XeoX", 
   "do you not see the contradiction? Your first statement is \"objective\" it is the way you are. It is the very essence of objectivity. You are and will be that way. Others can probably even say the same thing about you. Your second statement says it is not the way you are but is subjective, malleable to the moment.\n\n \n Nope. What I am is the cause of my subjective purpose. If what I am is objective or not si another matter.", 
   {}, 
   37199, 
   null, 
   1078218300.0
  ], 
  [
   37382, 
   null, 
   "epaphras_faith", 
   "Nope. What I am is the cause of my subjective purpose. If what I am is objective or not si another matter.\n\n \n No, it is precisely the matter. I am simply taking the subjective purpose back to its origin. I agree that it comes from who you are. However, that is factually setting an objective standard to say that.", 
   {}, 
   37353, 
   null, 
   1078244460.0
  ], 
  [
   37387, 
   null, 
   "unkerpaulie", 
   "Exactly, he is not worthy of worship, he is worthy of friendship. My relationship with God is an equal.\n\n thats contrary to what the Bible states concerning the relationship of man and God. man is supposed to be God's subjects and servant. man is nowhere near equal to God. in fact, man is supposed to revere God and consider themselves nothing before God.\n \n I guess this means you dont agree with the parts of the Bible that talk about how man should worship God... \n \n \nI believe that some of the stories are based in fact, for example there is evidence to support there was a flood on the earth at one point, probably the origin of the Noah story. I do not accept the bible as the foundation of my faith.\n \n I guess after being a Christian in my childhood and it coming up inadequate/inconsistent/depressing I tried to form my own relationship with my God based on what I believed that relationship should be: as a friend, not worthy of worship, but worthy of respect and love.\n \n So I guess I could be considered a person of selective faith, if you wish.\n\n fair enough...\n \n however, is there any reason for you why you would still think God exists at all? it doesnt have to be a scientific reason, it could be that 'man is so awesomely made' or 'evolution doesnt make sense' or maybe personal miracles in your own life. what Im trying to say is, after your belief in the bible fell off, what did you use to justify the existence of God?\n \n I think Im in the position you already passed: losing faith in the Bible itself. the problem is that the bible is the sole source of the life and teachings of Jesus Christ, so christianity itself, as far as I see, is foundationless without the bible. how do you still justify christianity without a bible?", 
   {}, 
   37239, 
   null, 
   1078245660.0
  ], 
  [
   37449, 
   null, 
   "XQsThaiPoes", 
   "\n fair enough...\n \n however, is there any reason for you why you would still think God exists at all? it doesnt have to be a scientific reason, it could be that 'man is so awesomely made' or 'evolution doesnt make sense' or maybe personal miracles in your own life. what Im trying to say is, after your belief in the bible fell off, what did you use to justify the existence of God?\n \n I think Im in the position you already passed: losing faith in the Bible itself. the problem is that the bible is the sole source of the life and teachings of Jesus Christ, so christianity itself, as far as I see, is foundationless without the bible. how do you still justify christianity without a bible?\n\n \n Very eloquent :).\n \n As religion has taught us through the years the bible is inert on the issue of faith. Most faith-based dogma is outside of the bible objectively. When people ask you do you have faith they are asking do you believe in magic powers. You don't need a bible to believe in magic powers. As for believing in God it is shallow to assume if one looses faith in the bible they will stop believing in God. The theism is the opposite of atheism; it is binary, you have to choose a belief, and if you believed in God before it is no tangible reason to roll back the odometer except for socio-political reasons.\n \n You can't justify a religion. Religions them selves are objective institutions (doctrine aside). Believing in one is no different than believing in the justice system.\n \n IMHO", 
   {}, 
   37387, 
   null, 
   1078255200.0
  ], 
  [
   37493, 
   null, 
   "unkerpaulie", 
   "Very eloquent :).\n \n As religion has taught us through the years the bible is inert on the issue of faith. Most faith-based dogma is outside of the bible objectively. When people ask you do you have faith they are asking do you believe in magic powers. You don't need a bible to believe in magic powers. As for believing in God it is shallow to assume if one looses faith in the bible they will stop believing in God. The theism is the opposite of atheism; it is binary, you have to choose a belief, and if you believed in God before it is no tangible reason to roll back the odometer except for socio-political reasons.\n \n You can't justify a religion. Religions them selves are objective institutions (doctrine aside). Believing in one is no different than believing in the justice system.\n \n IMHO\n\n thank you XQ\n \n but the thing is, the christian church's biggest boast is that it is the 'only true religion' serving the 'only true God'. when the Bible is suddenly exposed as not true, then it reduces christianity to the same level as any other \"Holy Book\" based religion (Islam, hinduism, Greek/Norse, etc). why should anyone rightly boast that their myth is better than the other guy's myth? if its all just myth, then none is real. why should we believe that God exists after continually demonstrating that Shiva, Lakshmi, Buddha, Zeus and Osirus are all false gods? what makes the Biblical God any more real, since He too is based on a book full of myths?", 
   {}, 
   37449, 
   null, 
   1078262880.0
  ], 
  [
   37560, 
   null, 
   "XQsThaiPoes", 
   "thank you XQ\n \n but the thing is, the christian church's biggest boast is that it is the 'only true religion' serving the 'only true God'. when the Bible is suddenly exposed as not true, then it reduces christianity to the same level as any other \"Holy Book\" based religion (Islam, hinduism, Greek/Norse, etc). why should anyone rightly boast that their myth is better than the other guy's myth? if its all just myth, then none is real. why should we believe that God exists after continually demonstrating that Shiva, Lakshmi, Buddha, Zeus and Osirus are all false gods? what makes the Biblical God any more real, since He too is based on a book full of myths?\n\n \n Their biggest boast is they are the largest religion on earth IMO. People take their religion so seriously because they are shallow. I know it may seem like an oxymoron that people that are \"deep\" in their respective faiths are shallow, but it is meta-physical materialism coined spirituality (a lie for humans can't be spiritual).\n \n Just because it is a myth does not mean there is anything wrong with it. For some reason modern humans see myths as bad evil primitive things; crutches for those inferior intellect and literacy. What is wrong with God being a myth? That is the whole concept of faith. I am going to buy a myth to cope with my immediate problems then hope it pays off my future problems. It is the same thing as trying to find a pot of gold at the end of a rainbow. Don't let anyone with faith lie to you and say that is based on reality, for if it was then there would be no need for faith. \n \n Objectively God is not \"more\" real than any other mythological god. This is shown when he butts heads with \"mythological\" gods in the bible. A god being real is just part of a religion. Look at Wiccans or better Hindus they are still around and you claim their gods are myths. Look at East Asia they are not concerned about gods as much as if grandma's or grandpa's spirit will come back and ruin their crops or pox their business. \n \n It all boils down to people manufacture their own alternate reality like a mulberry harbor to shelter their belief. If you build these atolls of \"faith\" strong enough you believe you'll be rewarded. I while I still have my faith I have opened my eyes. God is so big he barely notices us as individuals therefore he seems shallow and trivial when he smites us in mass. In reality we are his pets. He will probably ignore us until we bite one of the kids then he will take us off to get euthanized. We won't even see it coming the final offense won't even make our paltry local news.", 
   {
    "unicode_changes_made": true
   }, 
   37493, 
   null, 
   1078282440.0
  ], 
  [
   37578, 
   null, 
   "Darkest Shadow", 
   "You are extremely cynical. Why do you have such a scewed view of God? Why can't you accept that he loves  you?", 
   {}, 
   37560, 
   null, 
   1078288500.0
  ], 
  [
   37629, 
   null, 
   "XeoX", 
   "No, it is precisely the matter. I am simply taking the subjective purpose back to its origin. I agree that it comes from who you are. However, that is factually setting an objective standard to say that.\n\n \n Clever. I disagree though. The concept 'purpose' is subjective like all absract concepts invented by mankind. \n So in a way you are right. My purpose is objective. But there are no one objective purpose since we all create our own objective purpose. Thus, I claim 'purpose' as a concept are subjective.", 
   {}, 
   37382, 
   null, 
   1078309560.0
  ], 
  [
   37630, 
   null, 
   "XeoX", 
   "You are extremely cynical. Why do you have such a scewed view of God? Why can't you accept that he loves  you?\n\n \n If god loves me, why does he not want me to be happy? If god loved me, why would he condemn me for not loving me back?\n If I really loved a girl and she loved another, I would still wish her to be happy, not condemn her to hell.", 
   {}, 
   37578, 
   null, 
   1078309680.0
  ], 
  [
   37632, 
   null, 
   "WorldTraveller", 
   "fair enough...\n \n however, is there any reason for you why you would still think God exists at all? it doesnt have to be a scientific reason, it could be that 'man is so awesomely made' or 'evolution doesnt make sense' or maybe personal miracles in your own life. what Im trying to say is, after your belief in the bible fell off, what did you use to justify the existence of God?\n \n I think Im in the position you already passed: losing faith in the Bible itself. the problem is that the bible is the sole source of the life and teachings of Jesus Christ, so christianity itself, as far as I see, is foundationless without the bible. how do you still justify christianity without a bible?\n\n \n I no longer consider myself a Christian. I do not believe in Jesus Christ, nor do I believe the Bible to be anything more than stories of those trying (maybe unsuccessfully) to explain their faith and relationship with God. Perhaps in the overzealousness to share this \"amazing\" relationship, they forgot that each person relationship with God is individual and cannot be defined by another persons relationship.\n \n One of the fundamental problems with Christianity is that it seems to have created an unecessary end: Hell. I prefer to believe that when I die, I have remained faithful to God that I will become transcedent and join him in heaven, if not, I will die and thats the end of that. There is no punishment other than the self-concieved one. Perhaps early Christians thought that to die without transcedence was so horrible they had to create a name for it and over the years it has evolved to become this \"supreme punishment\".\n \n I think that rather than losing faith in the bible, I have come to a realization of what it really is. Peoples attempts to explain their individual relationships with God. Because the bible has so many authors, of course their are going to be contradictions, because not everyones relationship is the same. Simply compare my relationship with XQsThaiPoes. I am not suggest his is wrong, just different. However, if we were to try and amalgamate those views, it would just not make sense.", 
   {}, 
   37630, 
   null, 
   1078311900.0
  ], 
  [
   37638, 
   null, 
   "XQsThaiPoes", 
   "I no longer consider myself a Christian. I do not believe in Jesus Christ, nor do I believe the Bible to be anything more than stories of those trying (maybe unsuccessfully) to explain their faith and relationship with God. Perhaps in the overzealousness to share this \"amazing\" relationship, they forgot that each person relationship with God is individual and cannot be defined by another persons relationship.\n \n One of the fundamental problems with Christianity is that it seems to have created an unecessary end: Hell. I prefer to believe that when I die, I have remained faithful to God that I will become transcedent and join him in heaven, if not, I will die and thats the end of that. There is no punishment other than the self-concieved one. Perhaps early Christians thought that to die without transcedence was so horrible they had to create a name for it and over the years it has evolved to become this \"supreme punishment\".\n \n I think that rather than losing faith in the bible, I have come to a realization of what it really is. Peoples attempts to explain their individual relationships with God. Because the bible has so many authors, of course their are going to be contradictions, because not everyones relationship is the same. Simply compare my relationship with XQsThaiPoes. I am not suggest his is wrong, just different. However, if we were to try and amalgamate those views, it would just not make sense.\n\n \n Hey I don't believe in hell, most of the bible is stories, I believe in Jesus (the fleshly man), and barely in heaven for humans. I believe we can hypothetically make sense of merging views, but the reason for doing so is beyond me.\n \n It may just be a side effect of being gen x or my religion but I do think that people in general worship Jesus (everyone's favorite necromancer/ wonderful at parties and picknicks) and not the fire/war God of the old testament unless you're Jewish and even then they tone him down. Some place in those alleged 6 thousand years the real persona of the master of the universe was lost in the translation.", 
   {
    "unicode_changes_made": true
   }, 
   37632, 
   null, 
   1078315260.0
  ], 
  [
   37656, 
   null, 
   "unkerpaulie", 
   "Their biggest boast is they are the largest religion on earth IMO. People take their religion so seriously because they are shallow. I know it may seem like an oxymoron that people that are \"deep\" in their respective faiths are shallow, but it is meta-physical materialism coined spirituality (a lie for humans can't be spiritual).\n\n membership size is a result of people believing the myth, not the cause. people believe the Bible is true and therefore the membership goes up, not the other way around\n \n \nJust because it is a myth does not mean there is anything wrong with it. For some reason modern humans see myths as bad evil primitive things; crutches for those inferior intellect and literacy. What is wrong with God being a myth? That is the whole concept of faith. I am going to buy a myth to cope with my immediate problems then hope it pays off my future problems. It is the same thing as trying to find a pot of gold at the end of a rainbow. Don't let anyone with faith lie to you and say that is based on reality, for if it was then there would be no need for faith. \n\n this isnt the point. 'evil' and 'bad' is totally irrelevant and subjective anyway. Im talking about the fact that a myth is *FALSE*. why would you have faith (the belief that something is true without evidence) in something you already know is false??\n \nObjectively God is not \"more\" real than any other mythological god. This is shown when he butts heads with \"mythological\" gods in the bible. A god being real is just part of a religion. Look at Wiccans or better Hindus they are still around and you claim their gods are myths. Look at East Asia they are not concerned about gods as much as if grandma's or grandpa's spirit will come back and ruin their crops or pox their business. \n\n like I said, why would you have faith in a God if you are already convinced he doesnt exist? what would be the point?\n \n \nIt all boils down to people manufacture their own alternate reality like a mulberry harbor to shelter their belief. If you build these atolls of \"faith\" strong enough you believe you'll be rewarded. I while I still have my faith I have opened my eyes. God is so big he barely notices us as individuals therefore he seems shallow and trivial when he smites us in mass. In reality we are his pets. He will probably ignore us until we bite one of the kids then he will take us off to get euthanized. We won't even see it coming the final offense won't even make our paltry local news.\n\n but then belief in God as far as you see is just as valid as believing in santa claus. to give kids an incentive to be on their best behavior parents give kids faith in santa claus with the hopes of getting the toy they want for christmas. according to you, God is simply santa claus on a more widespread and influencial level. but if in fact God is just a make-believe dude that gives you hope in eternal life for behaving right, when in fact he doesnt exist at all. what is the point of faith in God?", 
   {
    "unicode_changes_made": true
   }, 
   37560, 
   null, 
   1078328520.0
  ], 
  [
   37657, 
   null, 
   "unkerpaulie", 
   "If god loves me, why does he not want me to be happy? If god loved me, why would he condemn me for not loving me back?\n If I really loved a girl and she loved another, I would still wish her to be happy, not condemn her to hell.\n\n If you really loved a girl and she was about to drink a cup of poison, would you tell her dont drink the poison because you love her? would you snatch the cup out of her hand? would you break her arm so she couldnt hold the cup? how far would you go to stop her from killing herself if she was intent on suicide?", 
   {}, 
   37630, 
   null, 
   1078328760.0
  ], 
  [
   37659, 
   null, 
   "unkerpaulie", 
   "I no longer consider myself a Christian. I do not believe in Jesus Christ, nor do I believe the Bible to be anything more than stories of those trying (maybe unsuccessfully) to explain their faith and relationship with God. Perhaps in the overzealousness to share this \"amazing\" relationship, they forgot that each person relationship with God is individual and cannot be defined by another persons relationship.\n\n yes but testimony is an essential part of sharing information about a product or service you use: you tell the person what it did for you. in fact, testimony is more effective in conveying the value of something than trying to describe the product/service in technical and accurate terms. hence the Bible is a collection of stories of what God did for those people, as a statement of what he can do for the reader, just as He did for the authors. you cannot downplay the value of testimonies. now of course it gives room for exageration, since the authors would obviously be biased, but to say the stories were based on nothing but fiction is a big accusation.\n \n \nOne of the fundamental problems with Christianity is that it seems to have created an unecessary end: Hell. I prefer to believe that when I die, I have remained faithful to God that I will become transcedent and join him in heaven, if not, I will die and thats the end of that. There is no punishment other than the self-concieved one. Perhaps early Christians thought that to die without transcedence was so horrible they had to create a name for it and over the years it has evolved to become this \"supreme punishment\".\n\n of course this is an unfounded and completely personal opinion you simply invented. believing that there is no hell doesnt make Hell non-existent\n \n \nI think that rather than losing faith in the bible, I have come to a realization of what it really is. Peoples attempts to explain their individual relationships with God. Because the bible has so many authors, of course their are going to be contradictions, because not everyones relationship is the same. Simply compare my relationship with XQsThaiPoes. I am not suggest his is wrong, just different. However, if we were to try and amalgamate those views, it would just not make sense.\n\n contrary to your perspective, I have never seen a single biblical contradiction. in fact, the stories always seem to confirm and reinforce each other rather than conflict\n \n my doubt in the validity of the bible mainly stems from 2 things. first, the notin that Genesis' creation may be false. it is obvious that many of the implications of the creation story simply does not correspond with real world evidence, in fact it is contrary to what the earth has shown. the other alternatives to creation (the Big Bang, abiogenesis, etc) are also on shaky theories and gap-filled logic, so Genesis currently still has a fighting chance. it is not the main reason for losing faith in the bible, but it is a vital component.\n \n second, and this is the single most serious greivience I have against the bible: the lack of miracles in the present. even if a universe of scientific evidence could be stacked against the possibility of supernatural phenomenon, it would take but one single physical miracle and the entire scientific community would fall flat on its face. If a book said that some 2000 years ago a man was healing sick, walking on water, commanding the weather and multiplying bread and fish in his hands, of course only the most gullible/fanatical would believe that such things could have really happened. the skeptic would have every reason to believe those stories were lies, because its not scientifically possible. but if today we could actually see someone walking on water, or through walls, or acsending into the air, then it wouldnt make a difference in the world how much scientific evidence you could provide. the phenomenon would always overpower scientific theory\n \n the thing is, there are no 'miraculous' events taking place, nor has there been any recorded since the bible. None. even Jesus himself said that works he did and even greater, his followers would be able to do. no-one is doing anything remotely near what the bible said people did. this means either 1) nobody is really a true disciple of christ, 2) Jesus lied because even if you truly followed him you cant do what he did, or 3) Jesus never did none of that stuff in the first place", 
   {}, 
   37632, 
   null, 
   1078330500.0
  ], 
  [
   37660, 
   null, 
   "unkerpaulie", 
   "Hey I don't believe in hell, most of the bible is stories, I believe in Jesus (the fleshly man), and barely in heaven for humans. I believe we can hypothetically make sense of merging views, but the reason for doing so is beyond me.\n \n It may just be a side effect of being gen x or my religion but I do think that people in general worship Jesus (everyone's favorite necromancer/ wonderful at parties and picknicks) and not the fire/war God of the old testament unless you're Jewish and even then they tone him down. Some place in those alleged 6 thousand years the real persona of the master of the universe was lost in the translation.\n\n or is it that he was just made up in the first place and never existed?\n \n and about Jesus, do you believe he did those wonderful miracles that the Gospels said he did?", 
   {
    "unicode_changes_made": true
   }, 
   37638, 
   null, 
   1078330680.0
  ], 
  [
   37664, 
   null, 
   "WorldTraveller", 
   "now of course it gives room for exageration, since the authors would obviously be biased, but to say the stories were based on nothing but fiction is a big accusation.\n\n \n exactly why I said that the stories have some foundation in fact in a previous post, they are fiction based on fact (historical fiction) you get an idea about what might have happened but it didn't necessarily happen as portrayed or for the reasons given.\n \n \nof course this is an unfounded and completely personal opinion you simply invented.\n\n \n unfounded no, personal probably.\n \n \nbelieving that there is no hell doesnt make Hell non-existent\n\n \n yup, just like believing that there is one won't make it exist. we will find out who is right eventually i suppose.\n \n \ncontrary to your perspective, I have never seen a single biblical contradiction. in fact, the stories always seem to confirm and reinforce each other rather than conflict\n\n \n For me I cannot rationalize the change in personality between old testatment and new, this is the fundamental contradiction for me. The presentation of God as omnicient and omni-potent doesn't work for me either (read: Calvinism)\n \n rather his knowledge is instantaneous and his power is limited by the strength of faith of his followers.", 
   {}, 
   37660, 
   null, 
   1078332000.0
  ], 
  [
   37727, 
   null, 
   "XeoX", 
   "If you really loved a girl and she was about to drink a cup of poison, would you tell her dont drink the poison because you love her? would you snatch the cup out of her hand? would you break her arm so she couldnt hold the cup? how far would you go to stop her from killing herself if she was intent on suicide?\n\n \n If she was completely convinced on commiting suicide I doubt I could stop her, but I would go as far as I could without actually hurting her.", 
   {}, 
   37657, 
   null, 
   1078345080.0
  ], 
  [
   37738, 
   null, 
   "epaphras_faith", 
   "Clever. I disagree though. The concept 'purpose' is subjective like all absract concepts invented by mankind. \n So in a way you are right. My purpose is objective. But there are no one objective purpose since we all create our own objective purpose. Thus, I claim 'purpose' as a concept are subjective.\n\n \n I see your point. However, I also disagree, and this may come down to faith and not be provable in any direction. It is my belief that while we all have individual purposes, we also have a purpose that does not deviate from person to person. I believe we were created to love and be loved. To be more specific, by God.\n \n I think there are examples in human behavior and psychology that could indirectly point to this, but I do not think I could argue it in a direct fashion as it necessarily depends upon faith. A non arguable subject.", 
   {}, 
   37629, 
   null, 
   1078347000.0
  ], 
  [
   37747, 
   null, 
   "unkerpaulie", 
   "I think you just answered your own question XeoX:\n \n \nIf god loves me, why does he not want me to be happy? If god loved me, why would he condemn me for not loving me back?\n If I really loved a girl and she loved another, I would still wish her to be happy, not condemn her to hell.\n\n \n its not that God doesnt want what's best for you. its that humans are nevertheless intent on doing things that are self-destructive. you cannot rationally expect God to intervene in saving mankind much more than you would to save humanity. He has provided a way for you to get help, but the choice is up to man to go get that help and cease their self-destructive behavior. how much more do you want than that?", 
   {}, 
   37630, 
   null, 
   1078347960.0
  ], 
  [
   37765, 
   null, 
   "epaphras_faith", 
   "I think you just answered your own question XeoX:\n \n \n \n its not that God doesnt want what's best for you. its that humans are nevertheless intent on doing things that are self-destructive. you cannot rationally expect God to intervene in saving mankind much more than you would to save humanity. He has provided a way for you to get help, but the choice is up to man to go get that help and cease their self-destructive behavior. how much more do you want than that?\n\n \n Thank you Mr. Paulie (an inside joke from another thread).\n \n However, the best question, Xeox, that you could ask is not If god loves me why doesn't he do.......Instead, say, \"God loves me\" what does that look like?", 
   {}, 
   37747, 
   null, 
   1078353060.0
  ], 
  [
   37808, 
   null, 
   "XQsThaiPoes", 
   "yes but testimony is an essential part of sharing information about a product or service you use: you tell the person what it did for you. in fact, testimony is more effective in conveying the value of something than trying to describe the product/service in technical and accurate terms. hence the Bible is a collection of stories of what God did for those people, as a statement of what he can do for the reader, just as He did for the authors. you cannot downplay the value of testimonies. now of course it gives room for exageration, since the authors would obviously be biased, but to say the stories were based on nothing but fiction is a big accusation.\n \n \n of course this is an unfounded and completely personal opinion you simply invented. believing that there is no hell doesnt make Hell non-existent\n \n \n contrary to your perspective, I have never seen a single biblical contradiction. in fact, the stories always seem to confirm and reinforce each other rather than conflict\n \n my doubt in the validity of the bible mainly stems from 2 things. first, the notin that Genesis' creation may be false. it is obvious that many of the implications of the creation story simply does not correspond with real world evidence, in fact it is contrary to what the earth has shown. the other alternatives to creation (the Big Bang, abiogenesis, etc) are also on shaky theories and gap-filled logic, so Genesis currently still has a fighting chance. it is not the main reason for losing faith in the bible, but it is a vital component.\n \n second, and this is the single most serious greivience I have against the bible: the lack of miracles in the present. even if a universe of scientific evidence could be stacked against the possibility of supernatural phenomenon, it would take but one single physical miracle and the entire scientific community would fall flat on its face. If a book said that some 2000 years ago a man was healing sick, walking on water, commanding the weather and multiplying bread and fish in his hands, of course only the most gullible/fanatical would believe that such things could have really happened. the skeptic would have every reason to believe those stories were lies, because its not scientifically possible. but if today we could actually see someone walking on water, or through walls, or acsending into the air, then it wouldnt make a difference in the world how much scientific evidence you could provide. the phenomenon would always overpower scientific theory\n \n the thing is, there are no 'miraculous' events taking place, nor has there been any recorded since the bible. None. even Jesus himself said that works he did and even greater, his followers would be able to do. no-one is doing anything remotely near what the bible said people did. this means either 1) nobody is really a true disciple of christ, 2) Jesus lied because even if you truly followed him you cant do what he did, or 3) Jesus never did none of that stuff in the first place\n\n \n I like number 1 IMHO but really thats not the case. Paul said mircales would end once christianity grew up.\n \n \n \n 1 Corinthians 12\n 4 Now there are (1) varieties of gifts, but the same Spirit. \n 5 And there are varieties of ministries, and the same Lord. \n 6 There are varieties of effects, but the same (2) God who works all things in all persons. \n 7 But to each one is given the manifestation of the Spirit (3) for the common good. \n 8 For to one is given the word of (4) wisdom through the Spirit, and to another the word of (5) knowledge according to the same Spirit; \n 9 to another (6) faith by the same Spirit, and to another (7) gifts of healing by the one Spirit, \n 10 and to another the effecting of (8) miracles, and to another (9) prophecy, and to another the (10) distinguishing of spirits, to another various (11) kinds of tongues, and to another the (12) interpretation of tongues. \n 11 But one and the same Spirit works all these things, (13) distributing to each one individually just as He wills. \n 27 Now you are (14) Christ's body, and (15) individually members of it. \n 28 And God has (16) appointed in (17) the church, first (18) apostles, second (19) prophets, third (20) teachers, then (21) miracles, then (22) gifts of healings, helps, (23) administrations, various (24) kinds of tongues. \n 29 All are not apostles, are they? All are not prophets, are they? All are not teachers, are they? All are not workers of miracles, are they? \n 30 All do not have gifts of healings, do they? All do not speak with tongues, do they? All do not (25) interpret, do they? \n 31 But (26) earnestly desire the greater gifts. And I show you a still more excellent way. \n \n NASB", 
   {}, 
   37659, 
   null, 
   1078365420.0
  ], 
  [
   37911, 
   null, 
   "XeoX", 
   "I see your point. However, I also disagree, and this may come down to faith and not be provable in any direction. It is my belief that while we all have individual purposes, we also have a purpose that does not deviate from person to person. I believe we were created to love and be loved. To be more specific, by God.\n \n I think there are examples in human behavior and psychology that could indirectly point to this, but I do not think I could argue it in a direct fashion as it necessarily depends upon faith. A non arguable subject.\n\n \n True, it comes down purely to faith.\n \n \nHowever, the best question, Xeox, that you could ask is not If god loves me why doesn't he do.......Instead, say, \"God loves me\" what does that look like?\n\n \n We'll see.\n God loves me. Then he should let me live the life I chose as long as I don't hurt anyone else.", 
   {
    "unicode_changes_made": true
   }, 
   37738, 
   null, 
   1078417380.0
  ], 
  [
   37919, 
   null, 
   "unkerpaulie", 
   "I like number 1 IMHO but really thats not the case. Paul said mircales would end once christianity grew up.\n\n I see where it says not everybody is going to be a miracle worker, but not where people will stop being miracle workers...\n \n and besides, wouldnt that nullify the promise that Jesus made in the first place to grant those powers to his followers?", 
   {}, 
   37808, 
   null, 
   1078418760.0
  ], 
  [
   37956, 
   null, 
   "epaphras_faith", 
   "True, it comes down purely to faith.\n \n \n \n We'll see.\n God loves me. Then he should let me live the life I chose as long as I don't hurt anyone else.\n\n \n He does love you and He will let you live the life you choose. However, if you had an adult child who was choosing something you knew to be harmful, would you not try to influence them to something better? Not control them or make them do what you wanted, but instead, try to help them understand. Would you not want them to change their way of thinking?", 
   {
    "unicode_changes_made": true
   }, 
   37911, 
   null, 
   1078423080.0
  ], 
  [
   38048, 
   null, 
   "XeoX", 
   "He does love you and He will let you live the life you choose. However, if you had an adult child who was choosing something you knew to be harmful, would you not try to influence them to something better? Not control them or make them do what you wanted, but instead, try to help them understand. Would you not want them to change their way of thinking?\n\n \n Yes, but not by threats of hell.", 
   {}, 
   37956, 
   null, 
   1078433160.0
  ], 
  [
   38112, 
   null, 
   "epaphras_faith", 
   "Yes, but not by threats of hell.\n\n \n What about by promises of heaven? Both are there.", 
   {}, 
   38048, 
   null, 
   1078444500.0
  ], 
  [
   38252, 
   null, 
   "XeoX", 
   "What about by promises of heaven? Both are there.\n\n \n Remove the threat of hell and keep the promise of heaven, yes, then I would find god 'worthy', even if I wouldn't belive in him.", 
   {
    "unicode_changes_made": true
   }, 
   38112, 
   null, 
   1078479120.0
  ], 
  [
   38253, 
   null, 
   "XQsThaiPoes", 
   "Remove the threat of hell and keep the promise of heaven, yes, then I would find god 'worthy', even if I wouldn't belive in him.\n\n \n Unfortunately EF has lied to himself enought to believe a finite amount of sin justifies an infinite amount of torture. Oh wait \"distance from God\"...", 
   {
    "unicode_changes_made": true
   }, 
   38252, 
   null, 
   1078480440.0
  ], 
  [
   38312, 
   null, 
   "epaphras_faith", 
   "Remove the threat of hell and keep the promise of heaven, yes, then I would find god 'worthy', even if I wouldn't belive in him.\n\n \n So you are saying that God should simply make everyone be with Him whether or not they want to be?", 
   {
    "unicode_changes_made": true
   }, 
   38252, 
   null, 
   1078507560.0
  ], 
  [
   38313, 
   null, 
   "epaphras_faith", 
   "Unfortunately EF has lied to himself enought to believe a finite amount of sin justifies an infinite amount of torture. Oh wait \"distance from God\"...\n\n \n XQ has lied to himself enough to believe that his finite amount of effort can reach across an infinite chasm to God.", 
   {}, 
   38253, 
   null, 
   1078507620.0
  ], 
  [
   38362, 
   null, 
   "XQsThaiPoes", 
   "XQ has lied to himself enough to believe that his finite amount of effort can reach across an infinite chasm to God.\n\n \n Luke 17:5-10\n \n 5*Now the apostles said to the Lord: \"Give us more faith.\" 6*Then the Lord said: \"If YOU had faith the size of a mustard grain, YOU would say to this black mulberry tree, 'Be uprooted and planted in the sea!' and it would obey YOU.\n \n 7*\"Who of YOU is there that has a slave plowing or minding the flock who will say to him when he gets in from the field, 'Come here at once and recline at the table'? 8*Rather, will he not say to him, 'Get something ready for me to have my evening meal, and put on an apron and minister to me until I am through eating and drinking, and afterward you can eat and drink'? 9*He will not feel gratitude to the slave because he did the things assigned, will he? 10*So YOU, also, when YOU have done all the things assigned to YOU, say, 'We are good-for-nothing slaves. What we have done is what we ought to have done.'\"\n \n I got my excuse whats yours?", 
   {
    "unicode_changes_made": true
   }, 
   38313, 
   null, 
   1078521960.0
  ], 
  [
   38446, 
   null, 
   "XeoX", 
   "So you are saying that God should simply make everyone be with Him whether or not they want to be?\n\n \n No, he should 'let' everyone be with him. The ones that didn't want that he could just let fade out into oblivion, not live in eternal torture.", 
   {
    "unicode_changes_made": true
   }, 
   38312, 
   null, 
   1078572060.0
  ], 
  [
   38659, 
   null, 
   "epaphras_faith", 
   "No, he should 'let' everyone be with him. The ones that didn't want that he could just let fade out into oblivion, not live in eternal torture.\n\n \n Here is part of the problem. You are defining hell as some place of infinite torture. I am defining it as eternal separation from God. The other problem is that we are eternal spiritual beings. We cannot simply cease. We were not made that way. That is why humans have a choice. We can choose to be with God or not. My personal belief is that separation from Him IS eternal torture. However, you may see it very differently. This is precisely why there is a choice. And precisely why it is not a threat. God never says be good or I will torture you forever. That would be a threat. Instead he says, and some of my JW friends will undoubtedly disagree, \"you are not able to do what it takes, but my Son can. Believe in Him and you will have life.\" (The word life here is used differently. It does not mean that you will live forever, instead it means that your living will not be merely drudgery but instead joyous. The word death in the bible refers to a state of misery, it does not mean ceasing to exist) .\n \n God's only condition is that you accept the help from the one who is actually able to give it. If you do not want it, you do not have to accept it. This is not a threat but a choice. Do you see the difference?", 
   {
    "unicode_changes_made": true
   }, 
   38446, 
   null, 
   1078773660.0
  ], 
  [
   38703, 
   null, 
   "XeoX", 
   "The other problem is that we are eternal spiritual beings. We cannot simply cease. We were not made that way. \n\n \n This is a point where we completely disagree.\n \n \nGod's only condition is that you accept the help from the one who is actually able to give it. If you do not want it, you do not have to accept it. This is not a threat but a choice. Do you see the difference? \n\n \n I could accept that. All people doesn't see it that way however. Or get it explained to them in that way.", 
   {
    "unicode_changes_made": true
   }, 
   38659, 
   null, 
   1078786860.0
  ], 
  [
   38713, 
   null, 
   "XQsThaiPoes", 
   "This is a point where we completely disagree.\n \n \n \n I could accept that. All people doesn't see it that way however. Or get it explained to them in that way.\n\n \n I agree with you the \"eternal spiritual\" humans is nonsense. I keep explaining to EF he doesn't believe in Hell he believes in death. Two totally different things.", 
   {
    "unicode_changes_made": true
   }, 
   38703, 
   null, 
   1078788780.0
  ], 
  [
   39992, 
   null, 
   "archimedes", 
   "Here is part of the problem. You are defining hell as some place of infinite torture. I am defining it as eternal separation from God. The other problem is that we are eternal spiritual beings. We cannot simply cease. We were not made that way. That is why humans have a choice. We can choose to be with God or not. This is precisely why there is a choice. And precisely why it is not a threat. God never says be good or I will torture you forever. That would be a threat. Instead he says, and some of my JW friends will undoubtedly disagree, \"you are not able to do what it takes, but my Son can. Believe in Him and you will have life.\"\n \n God's only condition is that you accept the help from the one who is actually able to give it. If you do not want it, you do not have to accept it. This is not a threat but a choice. Do you see the difference?\n\n \n You cannot accept God. You have no choice. You are left to be a worthless sinner. \n \n \"Believe in Him and you will have life.\" It just simply says believe. Nowhere does it say that we must choose to believe. Our faith is given to us from God, through the Holy Spirit.\n \n Consider the ways in which scripture refers to Christians:\n Choosen people (1 Pet 2:9) - who does the choosing? God.\n Adopted (Eph 1:5) - what person can make someone else adopt them?\n Those appointed for eternal life (Acts 13:48)\n The elect (2 Tim 2:10)\n Those who are pre-destined (Eph 1:5)", 
   {}, 
   38659, 
   null, 
   1079662860.0
  ], 
  [
   40061, 
   null, 
   "unkerpaulie", 
   "archmedes, did Adam have a choice to commit sin while he was in his sinless state?", 
   {}, 
   39992, 
   null, 
   1079710620.0
  ], 
  [
   40092, 
   null, 
   "archimedes", 
   "archmedes, did Adam have a choice to commit sin while he was in his sinless state?\n\n \n Yes. Remember the order in which things happened.\n \n In eternity, God decided to create mankind with free will. In eternity, God knew that mankind was going to choose to follow satan, thus falling into sin and rebellion, and free will was forever lost for them and for all their descendents (born in the natural way). In eternity, God chose certain people (who should be damned due to their own fault) to be saved.\n \n In time, God created Adam and Eve and gave them free will. In time, Adam and Eve chose to follow satan, losing their free will and passing their new, bound will onto their descendents. In time, each person born (in the natural way) hates God by nature and can only rebel against Him. In time, God sent His Son Jesus Christ (born of a virgin - born without original sin - born with free will) who chose to follow the will of His Father in all things. In time, each person who God pre-destined to be saved (which was done in eternity) will be given faith in Jesus, thus giving them the benefits of Jesus' choice of following the will of God in all things (namely, keeping all the commandments perfectly), as well as forgivness of sins because of His sacrificial death, and eternal life because of His glorious resurrection. On judgement day, each person will stand before the Father. Those who chose to follow Satan will get their own evil wish - they can be with Satan forever, in Hell. Those who have been chosen by God will get what He has graciously determined for them - to be in His presence forever, in Heaven.", 
   {}, 
   40061, 
   null, 
   1079725020.0
  ], 
  [
   40095, 
   null, 
   "XQsThaiPoes", 
   "Yes. Remember the order in which things happened.\n \n In eternity, God decided to create mankind with free will. In eternity, God knew that mankind was going to choose to follow satan, thus falling into sin and rebellion, and free will was forever lost for them and for all their descendents (born in the natural way). In eternity, God chose certain people (who should be damned due to their own fault) to be saved.\n \n In time, God created Adam and Eve and gave them free will. In time, Adam and Eve chose to follow satan, losing their free will and passing their new, bound will onto their descendents. In time, each person born (in the natural way) hates God by nature and can only rebel against Him. In time, God sent His Son Jesus Christ (born of a virgin - born without original sin - born with free will) who chose to follow the will of His Father in all things. In time, each person who God pre-destined to be saved (which was done in eternity) will be given faith in Jesus, thus giving them the benefits of Jesus' choice of following the will of God in all things (namely, keeping all the commandments perfectly), as well as forgivness of sins because of His sacrificial death, and eternal life because of His glorious resurrection. On judgement day, each person will stand before the Father. Those who chose to follow Satan will get their own evil wish - they can be with Satan forever, in Hell. Those who have been chosen by God will get what He has graciously determined for them - to be in His presence forever, in Heaven.\n\n \n I respect your belief, but it breaks down. If God lives in the future like you claim then there is no free will. The only way there would be free will in that case is if God gets things wrong, and had no idea Adam would sin. Also most of these ideas you talk about were added later in a doctrinal snowball effect. In the Old Testament God was flying by the seat of his eternal pants. \n \n I don't wana get into a hellfire debate, but just think of primitive Judaism writing about Adam and Eve. They thought of God, as an invisible man that talked to them and set things on fire, had no concept of an afterlife, and barely one of salvation. God also worked in real time. He had no \"eternal\" knowledge of events.", 
   {}, 
   40092, 
   null, 
   1079726100.0
  ], 
  [
   40098, 
   null, 
   "archimedes", 
   "I respect your belief, but it breaks down. If God lives in the future like you claim then there is no free will. The only way there would be free will in that case is if God gets things wrong, and had no idea Adam would sin.\n\n \n Ok, just let me say one thing. God, being in eternity and being omnipotent/omniscient, he is going to know what Adam and Eve decision is before they make it. However, that doesn't take away their free will. They still had the choice, God just knew which one they would pick. \n \n \nI don't wana get into a hellfire debate, but just think of primitive Judaism writing about Adam and Eve. They thought of God, as an invisible man that talked to them and set things on fire, had no concept of an afterlife, and barely one of salvation. God also worked in real time. He had no \"eternal\" knowledge of events.\n\n \n God can be in eternity, and work in real time. Real time began, when everything was created. God created real time, he can jump in whenever he pleases.", 
   {}, 
   40095, 
   null, 
   1079727240.0
  ], 
  [
   40110, 
   null, 
   "unkerpaulie", 
   "Yes. Remember the order in which things happened.\n \n In eternity, God decided to create mankind with free will. In eternity, God knew that mankind was going to choose to follow satan, thus falling into sin and rebellion, and free will was forever lost for them and for all their descendents (born in the natural way). In eternity, God chose certain people (who should be damned due to their own fault) to be saved.\n \n In time, God created Adam and Eve and gave them free will. In time, Adam and Eve chose to follow satan, losing their free will and passing their new, bound will onto their descendents. In time, each person born (in the natural way) hates God by nature and can only rebel against Him. In time, God sent His Son Jesus Christ (born of a virgin - born without original sin - born with free will) who chose to follow the will of His Father in all things. In time, each person who God pre-destined to be saved (which was done in eternity) will be given faith in Jesus, thus giving them the benefits of Jesus' choice of following the will of God in all things (namely, keeping all the commandments perfectly), as well as forgivness of sins because of His sacrificial death, and eternal life because of His glorious resurrection. On judgement day, each person will stand before the Father. Those who chose to follow Satan will get their own evil wish - they can be with Satan forever, in Hell. Those who have been chosen by God will get what He has graciously determined for them - to be in His presence forever, in Heaven.\n\n I have know idea where you got this from. as a matter of fact, the fruit adam and eve ate of was the fruit of the tree of the knowledge of good and evil. if adam and eve know had partaken of the knowledge of good and evil, how do you conclude that they lost their free will.\n \n and if adam and eve truly did have free will, the they were not destined to sin, and could have chosen to be obedient. this means that God must not have known whether adam and eve would sin beforehand\n \n you see, the thing with free will is that it cannot be predicted or set up, otherwise its simply not free will", 
   {}, 
   40092, 
   null, 
   1079731320.0
  ], 
  [
   40111, 
   null, 
   "XQsThaiPoes", 
   "I have know idea where you got this from. as a matter of fact, the fruit adam and eve ate of was the fruit of the tree of the knowledge of good and evil. if adam and eve know had partaken of the knowledge of good and evil, how do you conclude that they lost their free will.\n \n and if adam and eve truly did have free will, the they were not destined to sin, and could have chosen to be obedient. this means that God must not have known whether adam and eve would sin beforehand\n \n you see, the thing with free will is that it cannot be predicted or set up, otherwise its simply not free will\n\n Exactly! :)", 
   {}, 
   40110, 
   null, 
   1079731380.0
  ], 
  [
   40136, 
   null, 
   "archimedes", 
   "I have know idea where you got this from. as a matter of fact, the fruit adam and eve ate of was the fruit of the tree of the knowledge of good and evil. if adam and eve know had partaken of the knowledge of good and evil, how do you conclude that they lost their free will.\n \n and if adam and eve truly did have free will, the they were not destined to sin, and could have chosen to be obedient. this means that God must not have known whether adam and eve would sin beforehand\n \n you see, the thing with free will is that it cannot be predicted or set up, otherwise its simply not free will\n\n \n Ok, but you need to realize that God is in eternity; meaning, a time without beginning or end, he can see the beginning as well as the end. He has everything in front of Him. Therefore, He knew what Adam and Eve would choose, and just by Him knowing, doesn't take away from the fact they they did have free will. So it wasn't predicted, it was known.", 
   {}, 
   40110, 
   null, 
   1079741280.0
  ], 
  [
   40138, 
   null, 
   "XQsThaiPoes", 
   "Ok, but you need to realize that God is in eternity; meaning, a time without beginning or end, he can see the beginning as well as the end. He has everything in front of Him. Therefore, He knew what Adam and Eve would choose, and just by Him knowing, doesn't take away from the fact they they did have free will. So it wasn't predicted, it was known.\n\n \n Okay um that makes little sense, for God would be abusing himself, and that is out of character. He hates when people disobey him. If he knew ahead of time he would have made different people. Like shuffling in a bad hand of cards.", 
   {}, 
   40136, 
   null, 
   1079742000.0
  ], 
  [
   40140, 
   null, 
   "archimedes", 
   "Okay um that makes little sense, for God would be abusing himself, and that is out of character. He hates when people disobey him. If he knew ahead of time he would have made different people. Like shuffling in a bad hand of cards.\n\n \n No. The reason we are here is for Him to love us. He wouldn't have made different people; this gives Him the opportunity to show us His gracious love.", 
   {}, 
   40138, 
   null, 
   1079742300.0
  ], 
  [
   40190, 
   null, 
   "XQsThaiPoes", 
   "No. The reason we are here is for Him to love us. He wouldn't have made different people; this gives Him the opportunity to show us His gracious love.\n\n \n Thats called masochism.", 
   {}, 
   40140, 
   null, 
   1079761320.0
  ], 
  [
   40196, 
   null, 
   "archimedes", 
   "Thats called masochism.\n\n \n No it isn't. Please explain how masochism applies here...", 
   {}, 
   40190, 
   null, 
   1079768220.0
  ], 
  [
   40223, 
   null, 
   "unkerpaulie", 
   "Ok, but you need to realize that God is in eternity; meaning, a time without beginning or end, he can see the beginning as well as the end. He has everything in front of Him. Therefore, He knew what Adam and Eve would choose, and just by Him knowing, doesn't take away from the fact they they did have free will. So it wasn't predicted, it was known.\n\n archmedes, slow down a bit and look at this. if God knows the future, meaning that he knows what is going to happewn, then the future is predestined, and there is nothing anybody can do to change it. like for example, if God has seen in the future that on Monday Im going to squeeze my finger in the elevator at work at 8:25 am on my way upstairs, then I cannot choose to take the day off, or take a later train to get to work, or take the stairs instead of the elevator, because the future event has already been forseen by God. therefore the events that lead up to that event are also mapped out specifically. therefore the actions I make are not my choices, but they are confined to the preset path that God has already forseen as well.\n \n therefore I have no free will\n \n free will and predestiniation simply cannot coexist. it is impossible", 
   {}, 
   40136, 
   null, 
   1079800200.0
  ], 
  [
   40228, 
   null, 
   "XQsThaiPoes", 
   "archmedes, slow down a bit and look at this. if God knows the future, meaning that he knows what is going to happewn, then the future is predestined, and there is nothing anybody can do to change it. like for example, if God has seen in the future that on Monday Im going to squeeze my finger in the elevator at work at 8:25 am on my way upstairs, then I cannot choose to take the day off, or take a later train to get to work, or take the stairs instead of the elevator, because the future event has already been forseen by God. therefore the events that lead up to that event are also mapped out specifically. therefore the actions I make are not my choices, but they are confined to the preset path that God has already forseen as well.\n \n therefore I have no free will\n \n free will and predestiniation simply cannot coexist. it is impossible\n\n \n Like I borught out the only way you can have them coexist is if God is perpetualy wrong. Then that is random predestination, ie God has no idea what events will actually happen but a certain number will. Like I said this argument started the faith known as Jehovah's Witnesses.", 
   {}, 
   40223, 
   null, 
   1079801400.0
  ], 
  [
   40229, 
   null, 
   "XQsThaiPoes", 
   "No it isn't. Please explain how masochism applies here...\n\n God is hurting himself to feel love.", 
   {}, 
   40196, 
   null, 
   1079801460.0
  ], 
  [
   40264, 
   null, 
   "archimedes", 
   "archmedes, slow down a bit and look at this. if God knows the future, meaning that he knows what is going to happewn, then the future is predestined, and there is nothing anybody can do to change it. like for example, if God has seen in the future that on Monday Im going to squeeze my finger in the elevator at work at 8:25 am on my way upstairs, then I cannot choose to take the day off, or take a later train to get to work, or take the stairs instead of the elevator, because the future event has already been forseen by God. therefore the events that lead up to that event are also mapped out specifically. therefore the actions I make are not my choices, but they are confined to the preset path that God has already forseen as well.\n \n therefore I have no free will\n \n free will and predestiniation simply cannot coexist. it is impossible\n\n \n I know free will and predestination cannot co-exist. What I am saying is that there are two different types of free will; the type that gets one into Heaven, and the earthly type, for example, whether or not ro use an elevator. We have choices here on earth about everything, but we do not have the choice to choose to go to Heaven. Do you see the difference. God can just simply see everything, he doesnt choose for you, you make the choice, He just knows which one you will choose. He isnt intervening in your decisions.", 
   {}, 
   40223, 
   null, 
   1079820840.0
  ], 
  [
   40265, 
   null, 
   "archimedes", 
   "God is hurting himself to feel love.\n\n \n How is God hurting himself?", 
   {}, 
   40229, 
   null, 
   1079820840.0
  ], 
  [
   40322, 
   null, 
   "XQsThaiPoes", 
   "How is God hurting himself?\n\n \n I don't know how to explain.\n \n You create people who suppossedly love you, just so they can turn on you, so you can condem them, and then redeem them by punishing your self. Why? Because you are \"love\". Yet you knew you could have prevented it and did not.\n \n mas·och·ism \n \n 2)The deriving of pleasure, or the tendency to derive pleasure, from being humiliated or mistreated, either by another or by oneself. \n 3)A willingness or tendency to subject oneself to unpleasant or trying experiences.", 
   {}, 
   40265, 
   null, 
   1079851320.0
  ], 
  [
   40368, 
   null, 
   "archimedes", 
   "I don't know how to explain.\n \n You create people who suppossedly love you, just so they can turn on you, so you can condem them, and then redeem them by punishing your self. Why? Because you are \"love\". Yet you knew you could have prevented it and did not.\n\n \n How is God hurting Himself?", 
   {}, 
   40322, 
   null, 
   1079916060.0
  ], 
  [
   40375, 
   null, 
   "XQsThaiPoes", 
   "How is God hurting Himself?\n\n \n Okay maybe I am missing your point. If you are trinitarian and God is all knowing. He knew the things he made would hurt and kill him. It is suicidal and masochistic if he made them anyway. Unless you are saying God also has no free will and had to make the people because he know they would exist in the future. Anyone notice Achimedes is missing time travel 101?", 
   {}, 
   40368, 
   null, 
   1079921160.0
  ], 
  [
   40435, 
   null, 
   "unkerpaulie", 
   "I know free will and predestination cannot co-exist. What I am saying is that there are two different types of free will; the type that gets one into Heaven, and the earthly type, for example, whether or not ro use an elevator. We have choices here on earth about everything, but we do not have the choice to choose to go to Heaven. Do you see the difference. God can just simply see everything, he doesnt choose for you, you make the choice, He just knows which one you will choose. He isnt intervening in your decisions.\n\n if your destiny to go to heaven is forseen, then God has chosen for you, since you already said that you cannot choose for yourself.\n \n and again I ask: why do preachers preach? why do people make an effort to spread the gospel? if God does the choosing and he already predestined who he is going to choose, what point is there to spread God's word?", 
   {}, 
   40264, 
   null, 
   1079970840.0
  ], 
  [
   40459, 
   null, 
   "archimedes", 
   "if your destiny to go to heaven is forseen, then God has chosen for you, since you already said that you cannot choose for yourself.\n \n and again I ask: why do preachers preach? why do people make an effort to spread the gospel? if God does the choosing and he already predestined who he is going to choose, what point is there to spread God's word?\n\n \n One can't hear the gospal message and have the Holy Spirit bring them to faith if nobody is preaching or making an effort to spread it.", 
   {}, 
   40435, 
   null, 
   1079980260.0
  ], 
  [
   40462, 
   null, 
   "unkerpaulie", 
   "One can't hear the gospal message and have the Holy Spirit bring them to faith if nobody is preaching or making an effort to spread it.\n\n how does that affect who God chooses? if God already chose who he chose, what difference does it make if they hear the word or not? they cannot make the decision anyway, according to you", 
   {}, 
   40459, 
   null, 
   1079980920.0
  ], 
  [
   40470, 
   null, 
   "XQsThaiPoes", 
   "how does that affect who God chooses? if God already chose who he chose, what difference does it make if they hear the word or not? they cannot make the decision anyway, according to you\n\n This is the retoric loop that some denominations get stuck in. They construct conflicting docterines that do not work I have no idea why.\n Example.\n Is God Jesus? Yes.\n Is God all knowing? Yes.\n Is God the creator? Yes.\n Is God a masocist? No.\n \"?\"", 
   {}, 
   40462, 
   null, 
   1079983740.0
  ], 
  [
   40474, 
   null, 
   "XQsThaiPoes", 
   "God gave us the free will to choose between life an death. The fact that God already knows the outcome, and we don't, does not reduce the importance of us making that choice. \n The journey is just as important as the destination.\n \n Sandy emoticon_xangel\n\n \n You understand that makes God blood guilty. If he already knows the out come then he deliberately ruined everything. Unlike a human even if you knew everything you won't have the power to change anything, but God is the one making every thing. So basically he made the world how he wanted it. If he knew how it was going to turn out, and made it anyway it is his fault. Just like a Ford with an exploding gas tank. Why is this so hard to see? If God is omnipotent and omniscient he is maligned.", 
   {}, 
   40462, 
   null, 
   1079985660.0
  ], 
  [
   44561, 
   null, 
   "Trancelation", 
   "Here's my problem: God is Love, and yet there are numerous accounts in both the Old and New Testament of His cruelty and malice toward human beings, His creations, that have refused to follow the morals set forth for them. They are never offered a chance for redemption. And remember, these are not metaphors or symbols: these are historical accounts. These people will never have a second chance.\n \n And yet, there is room in Heaven for murderers, rapists, and child molesters who accept God. \n \n Furthermore, why would a cosmic being capable of creation find it necessary to intervene with our lives, and why would it wait so long before making its intentions known?", 
   {}, 
   40474, 
   null, 
   1082357880.0
  ], 
  [
   44662, 
   null, 
   "epaphras_faith", 
   "Here's my problem: God is Love, and yet there are numerous accounts in both the Old and New Testament of His cruelty and malice toward human beings, His creations, that have refused to follow the morals set forth for them. They are never offered a chance for redemption. And remember, these are not metaphors or symbols: these are historical accounts. These people will never have a second chance.\n \n And yet, there is room in Heaven for murderers, rapists, and child molesters who accept God. \n \n Furthermore, why would a cosmic being capable of creation find it necessary to intervene with our lives, and why would it wait so long before making its intentions known?\n\n \n \n There are several logical fallacies in your arguments.\n \n 1)begged question. You assume that you get to decide what is loving or not. Wrong. God does.\n 2) You assume that death or destruction of the flesh is the end. It is not. Only God knows the state of those so killed (individually, not collectively).\n 3) You assume that the cosmic being created creation for your enjoyment. He did not. He created it for his.\n 4) You assume God has waited a long time to intervene. Time is only one minor concept for God. He did not wait, he intervened in \"the fullness of time\" at the exact right moment. He sent his son to die on the cross so that we would have a second chance. Man's sin in the garden is what removed the choice in the first place. God sent Jesus to restore that choice.\n \n Attack christianity all you like, but at least use some logic.", 
   {}, 
   44561, 
   null, 
   1082408880.0
  ], 
  [
   44701, 
   null, 
   "Trancelation", 
   "There are several logical fallacies in your arguments.\n \n 1)begged question. You assume that you get to decide what is loving or not. Wrong. God does.\n 2) You assume that death or destruction of the flesh is the end. It is not. Only God knows the state of those so killed (individually, not collectively).\n 3) You assume that the cosmic being created creation for your enjoyment. He did not. He created it for his.\n 4) You assume God has waited a long time to intervene. Time is only one minor concept for God. He did not wait, he intervened in \"the fullness of time\" at the exact right moment. He sent his son to die on the cross so that we would have a second chance. Man's sin in the garden is what removed the choice in the first place. God sent Jesus to restore that choice.\n \n Attack christianity all you like, but at least use some logic.\n\n \n 1) Yes, I do get to decide what is loving to me, what isn't, and what I will tolerate. God might have given me life, but that doesn't give Him the right to tell me what to accept. \n 2) YOU assume that I assume that death of the flesh is the end. How you come to this conclusion is beyond me. I don't know what lies beyond physical death. And neither do you; you CLAIM to know, but there is absolutely no proof your knowledge except your faith. \n 3) So you admit that God created all that is for His amusement. We are nothing more than toys, objects for him to control. And you wonder why I've declared war against God.\n 4) God sent Jesus to restore our choice? Yeah, okay, if that's the case, then why isn't there more proof? None of us know if he died on the cross and was ressurected or not: we are being asked to follow with viels over our eyes, blind and drugged by promises of power. \n 5) Attack my reasoning all you want, but if you're going to do it, at least have the decency to understand what I'm saying and not twist it so that you can apply your need to be persecuted to be at your spiritual best. Peace.", 
   {}, 
   44662, 
   null, 
   1082420100.0
  ], 
  [
   45079, 
   null, 
   "Trancelation", 
   "Somehow, whenever I post on threads on message boards, mine always ends up being the last. Be that because everyone is tired of the fight or because I've said something of such powerful finality there's nothing else to say, I don't know. But anyway. I've found that religion and spirituality are two different things. The former steals answers from those who have come before, calls it their own, and refuses to accept any other possibility, much like the Empire of Star Wars mythology. The other yearns for answers and seeks them out, realizing that while no apparent answer may ever be discovered, and more likely that there is NO answer, the joy is in the journey, not the destination, and seeks to allow all viewpoints to be valid. Again, using the Star Wars mythology, this is like the Republic before its infestation with bitter and whiny Senators. We, that is, the agnostics and seekers of truth, should be careful not to become like the Republic before its fall.\n \n It can be said that God, or shall we say more preferrably, a cosmic creator, does not exist. And we all KNOW it doesn't; and yet simultaneously it is important for some of us to fill the void of doubt and fear that is the base of our weakness with false answers and meaningless hope. I respect humanity's right to do that, but I cannot allow the world to be ignorant. \"Belief is dangerous . . . believe in NOTHING.\" Peace.", 
   {}, 
   44701, 
   null, 
   1082581020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What makes god worthy of worship?", 
  "url": "http://www.4forums.com/political/religion-debates/1803-what-makes-god-worthy-worship.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 1803, 
  "discussion_files": [
   [
    "21377.html", 
    "http://www.4forums.com/political/religion-debates/1803-what-makes-god-worthy-worship-print.html"
   ], 
   [
    "21378.html", 
    "http://www.4forums.com/political/religion-debates/1803-what-makes-god-worthy-worship-11-print.html"
   ], 
   [
    "21379.html", 
    "http://www.4forums.com/political/religion-debates/1803-what-makes-god-worthy-worship-9-print.html"
   ], 
   [
    "21380.html", 
    "http://www.4forums.com/political/religion-debates/1803-what-makes-god-worthy-worship-7-print.html"
   ], 
   [
    "21381.html", 
    "http://www.4forums.com/political/religion-debates/1803-what-makes-god-worthy-worship-5-print.html"
   ], 
   [
    "21382.html", 
    "http://www.4forums.com/political/religion-debates/1803-what-makes-god-worthy-worship-4-print.html"
   ], 
   [
    "21383.html", 
    "http://www.4forums.com/political/religion-debates/1803-what-makes-god-worthy-worship-6-print.html"
   ], 
   [
    "21384.html", 
    "http://www.4forums.com/political/religion-debates/1803-what-makes-god-worthy-worship-8-print.html"
   ], 
   [
    "21385.html", 
    "http://www.4forums.com/political/religion-debates/1803-what-makes-god-worthy-worship-10-print.html"
   ], 
   [
    "21386.html", 
    "http://www.4forums.com/political/religion-debates/1803-what-makes-god-worthy-worship-3-print.html"
   ], 
   [
    "21387.html", 
    "http://www.4forums.com/political/religion-debates/1803-what-makes-god-worthy-worship-2-print.html"
   ]
  ], 
  "identifier": 1803
 }
]