[
 [
  [
   36139, 
   null, 
   "Mucusaur", 
   "Ok.I was wondering what the \"evidence\" offered for creationism is?\n \n I am not a creationist myself,and have little time for such pathological science.", 
   {
    "post_info": {
     "post_title": "The arguements for creationism."
    }
   }, 
   null, 
   null, 
   1077726720.0
  ], 
  [
   36141, 
   null, 
   "Gormless", 
   "Ok.I was wondering what the \"evidence\" offered for creationism is?\nExhibit A. One book: the Bible.\n \n Um, that's it though.", 
   {}, 
   36139, 
   null, 
   1077728220.0
  ], 
  [
   36159, 
   null, 
   "Mucusaur", 
   "No it definitly goes deeper than that.\n \n It is all based on the bible, but other\"evidence\" has been put up in support, such as an shrinking sun, mooon dust and the great flood causing the rock strata we find today.\n \n I was wondering if anyone could elaborate on this \"evidence\"", 
   {}, 
   36141, 
   null, 
   1077732720.0
  ], 
  [
   36184, 
   null, 
   "lurch", 
   "Are you looking for an answer from a creationist as to why they consider these things evidence? Or are you looking for an explanation as to why creationist arguments don't hold water?", 
   {}, 
   36159, 
   null, 
   1077735540.0
  ], 
  [
   36389, 
   null, 
   "Mucusaur", 
   "i suppose its the former.\n \n I would like to be famillar with the evidence they present, rather than hearing it for the first time from a creationist.\n \n I found a websitte anyway, so I found a few!", 
   {}, 
   36184, 
   null, 
   1077809580.0
  ], 
  [
   36402, 
   null, 
   "lurch", 
   "OK. Don't know what sites you found, but Talk Origins is full of information. To find what creationists argue, look at How Good Are Those Young-Earth Arguments?: A Close Look at Dr. Hovind's List of Young-Earth Arguments and Other Claims by Dave E. Matson.\n \n Another good source is An Index to Creationist Claims by Mark Isaak.\n \n Both of these pages are full of links to more interesting stuff. When you need information on specifics go to the Browse Page. Check out Creationism, Flood Geology, etc. items on the left.", 
   {}, 
   36389, 
   null, 
   1077814740.0
  ], 
  [
   36403, 
   null, 
   "WorldTraveller", 
   "Are Christians and Jews the only creationists? or are they merely the most prominent?", 
   {}, 
   36389, 
   null, 
   1077814860.0
  ], 
  [
   36411, 
   null, 
   "Mr Jack", 
   "I hadn't realised Jewish creationists were common? All the Jews I've discussed it with (very small sample) have been theistic evolutionists. There are Islamic creationists. They tend to be even nuttier than the Christian variety.\n \n I think it comes down to distribution of internet access, and language.", 
   {}, 
   36403, 
   null, 
   1077816480.0
  ], 
  [
   36421, 
   null, 
   "Gormless", 
   "Are Christians and Jews the only creationists? or are they merely the most prominent?\nThere are \"creationists\" of other religions that attempt to tie scientific evidence into their own creation myths. For example, in \"Forbidden Archeology: The Hidden History of the Human Race\", two Hindu creationists, Michael A. Cremo and Richard L. Thompson argue that not only is the Earth billions of years old, but that humans have been there from the beginning.\n \n The Judaic religions are more promenant on the internet, because its American dominated and the dominant religion in the US is Christianity. Plus Christianity et al have the disadvantage that their creation myth puts the world as being very young (to the extent of conflicting with the written histories of cultures such as the Chinese and Egyptians). So their attempts at shoehorning reality into that myth are orders of magnitude more preposterous than in other religions.", 
   {}, 
   36403, 
   null, 
   1077818520.0
  ], 
  [
   36572, 
   null, 
   "XQsThaiPoes", 
   "Exhibit A. One book: the Bible.\n \n Um, that's it though.\n\n \n Actually the bible really barely comments. Look how short and jumbled the Genesis account is. Genesis did not even fit what humans knew when it was written. So matching any creation theory to genesis is impossible. Unless you believe God created the heaven and earth twice, and created animals twice. Sure you can explain it away, but a verbal reading of the ACTUAL TEXT will make your head swim. \n \n I don't wana be sacrilegious, but some parts of Genesis makes God look like he was telling a fish story to a really dumb scribe too lazy to get on his camel and go to the library of Alexandria , or worse one of his interns. I am a irrational creationist btw.", 
   {
    "unicode_changes_made": true
   }, 
   36141, 
   null, 
   1077871380.0
  ], 
  [
   36585, 
   null, 
   "Mucusaur", 
   "Thanks Folks!", 
   {}, 
   36572, 
   null, 
   1077891720.0
  ], 
  [
   39744, 
   null, 
   "carla5010", 
   "Ok.I was wondering what the \"evidence\" offered for creationism is?\n \n Well, the creationists have long and elaborate statements of wishful thinking. the two dominat sources are Institute for Creation Research which is absolutely the most over-the-top site. The other one, Answers in Genesis is at least trying to be objective, having figured out that nutty, obviously unproven claims are not enhancing their credibility. But generally, they both are directed at those who are afraid of their salvation, rather than those who seek actual answers. Those people generally go to scientific sources. ;) \n \n http://www.icr.org/\n http://www.answersingenesis.org/home.aspx", 
   {}, 
   36139, 
   null, 
   1079515200.0
  ], 
  [
   39745, 
   null, 
   "XQsThaiPoes", 
   "Ok.I was wondering what the \"evidence\" offered for creationism is?\n \n Well, the creationists have long and elaborate statements of wishful thinking. the two dominat sources are Institute for Creation Research which is absolutely the most over-the-top site. The other one, Answers in Genesis is at least trying to be objective, having figured out that nutty, obviously unproven claims are not enhancing their credibility. But generally, they both are directed at those who are afraid of their salvation, rather than those who seek actual answers. Those people generally go to scientific sources. ;) \n \n http://www.icr.org/\n http://www.answersingenesis.org/home.aspx\n\n \n With friends like this who needs enimies? They deny thermodynamics among other things. This is why it sucks to be a creationist.", 
   {}, 
   39744, 
   null, 
   1079516880.0
  ], 
  [
   39749, 
   null, 
   "XQsThaiPoes", 
   "After reading their flim flam I am appauled. this is where creationist go for answers? Anyone that knows how to read should be sick. They are lying for God then try to make you feel extra guilty so you can believe them. They for intance all include the classic \"Jesus died for Barney\" arguement any \"true\" christian should be nausiated thinking that Jesus died for a dinosuar. Yet this is some of the \"evidence\" these sick sites use. \n \n \"If you believe the earth is billions of years old then you don't believe Jesus died for dinosaur?\"\n \n \"No duh.\" \n \n \"You are only trying to appease evolutionist by believing in an old earth.\" \n \n \"What about the early church fathers that believe in a old earth?\" \n \n \"They were trying to appease greeks and don't count.\"\n \n \"By incorporating beliefs of men you are distorting the word of God, now lets listen to beliefs of men that agree with us.\"\n ---\n Who listens to this? All of their arguments are not actually arguments they are commentaries with a paypal banner :p.", 
   {}, 
   39745, 
   null, 
   1079520240.0
  ], 
  [
   40073, 
   null, 
   "Mucusaur", 
   "Yeah, \"look at us were so correct, and God loves us\"\n \n thankfully, that site borders on the comical, for anyone with an appreciation for the absurd!\n \n \nJesus died for Barney\n\n \n I dont get where you are going with that, but hey! no matter!", 
   {}, 
   39749, 
   null, 
   1079717640.0
  ], 
  [
   40078, 
   null, 
   "XQsThaiPoes", 
   "Yeah, \"look at us were so correct, and God loves us\"\n \n thankfully, that site borders on the comical, for anyone with an appreciation for the absurd!\n \n \n \n I dont get where you are going with that, but hey! no matter!\n\n Barney the dacing purple dinosaur. Was a fad here in the states.", 
   {}, 
   40073, 
   null, 
   1079720040.0
  ], 
  [
   40081, 
   null, 
   "7th_Arty", 
   "This is why it sucks to be a creationist.\n\n No. It's great to be a creationist. If you work with reality you have to start from evidence. If you are a creationist you get to make it all up as you go.", 
   {}, 
   40073, 
   null, 
   1079721180.0
  ], 
  [
   40160, 
   null, 
   "Mucusaur", 
   "I know who barney is/ was.\n \n I still dont get you.\n \n \n \nIf you are a creationist you get to make it all up as you go.\n\n \n Must be a load of fun. then again, so do authors.", 
   {}, 
   40081, 
   null, 
   1079748480.0
  ], 
  [
   40200, 
   null, 
   "7th_Arty", 
   "Must be a load of fun. then again, so do authors.\n\n Exactly! Authors of fiction make it all up. So is there any evidence that the authors of the Bible weren't making it all up? It seems so. Two creation stories, two flood stories that are intermixed, the story of Jonah, the story of Job. Obviously invented by an author. What Bible literalists miss is the purpose of these moral tales - thus they miss the point.", 
   {}, 
   40160, 
   null, 
   1079770800.0
  ], 
  [
   40407, 
   null, 
   "carla5010", 
   "After reading their flim flam I am appauled. this is where creationist go for answers? Anyone that knows how to read should be sick. They are lying for God then try to make you feel extra guilty so you can believe them. \n \n That's the idea. They are not trying to convince us. they are trying to bolster the \"faithful,\" and at the same time sell them some books (like the \"how to protect your kids from Satan's influence on the trip to the science museum\" kind of stuff)\n \n Who listens to this? All of their arguments are not actually arguments they are commentaries with a paypal banner :p.\n \n And that banner is the most important part for them. Where the frightened ignorants support their figth against the evil science emoticon_frazzled", 
   {}, 
   39749, 
   null, 
   1079942400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The arguements for creationism.", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1814-arguements-creationism.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 1814, 
  "discussion_files": [
   [
    "4502.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1814-arguements-creationism-print.html"
   ], 
   [
    "4503.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1814-arguements-creationism-2-print.html"
   ]
  ], 
  "identifier": 1814
 }
]