[
 [
  [
   36482, 
   null, 
   "ElRojoGrande", 
   "The early 1920s found social patterns in chaos. Traditionalists, the older Victorians, worried that everything valuable was ending. Younger modernists no longer asked whether society would approve of their behavior, only whether their behavior met the approval of their intellect. Intellectual experimentation flourished. Americans danced to the sound of the Jazz Age, showed their contempt for alcoholic prohibition, debated abstract art and Freudian theories. In a response to the new social patterns set in motion by modernism, a wave of revivalism developed, becoming especially strong in the American South. \n Who would dominate American culture--the modernists or the traditionalists? Journalists were looking for a showdown, and they found one in a Dayton, Tennessee courtroom in the summer of 1925http://www.law.umkc.edu/faculty/projects/ftrials/scopes/SCOPE2.JPG\n \n I was under the impression that this had soved the debate on evolution vs. creation. The court has spoken all hail the justice system.\n emoticon_xbouncer", 
   {
    "post_info": {
     "post_title": "Scopes Monkey Trial"
    }
   }, 
   null, 
   null, 
   1077838800.0
  ], 
  [
   36486, 
   null, 
   "lurch", 
   "¿Qué pasa?\n \n No. It didn't solve anything. The rise of fundamentalism was a backlash against science. Astronomy was showing that the universe is old. Geology was showing that the earth is old. And of course, natural history showed that life is old and had evolved through the eons in a nested hierarchy. The fundamentalists tried to reject science and insist that the Bible was literal.\n \n As for the Scopes Trial, it was an effort not of journalists, but of the fledgling ACLU. They were the ones to push the issue and to stage a violation of the law against the teaching of evolution. Scopes lost, as was the plan. The question was had he violated the law and he admited that he had. The point was to challenge the Constitutionality of the law on appeal but that turned out to be a bust when the case was dismissed on a technicality. The judge made an error. He fined Scopes $100. The law specified that any fine of more than $50 had to be decided by a jury. The appeals court dismissed the case.\n \n However, there have been several other laws that have gone to the Supreme Court dealing with evolution and creationism in public schools. At first, creationists tried to make it illegal to teach evolution. Unconstitutional because our schools have an obligation to teach current science. Next they tried to get \"equal time\" for \"creation science.\" The SCOTUS found that evolution was science and was legitimate in science class while \"creation science\" was religion and therefore could not be taught.\n \n But the issue still is being debated. Now the new creationists want to pretend that Intelligent Design (ID) is scientific. Creationists won't be happy until U.S. society is reduced to a level of knowledge and a standard of living equivalent to that before Newton.", 
   {}, 
   36482, 
   null, 
   1077839880.0
  ], 
  [
   36488, 
   null, 
   "ElRojoGrande", 
   "¿Qué pasa?\n \n No. It didn't solve anything. The rise of fundamentalism was a backlash against science. Astronomy was showing that the universe is old. Geology was showing that the earth is old. And of course, natural history showed that life is old and had evolved through the eons in a nested hierarchy. The fundamentalists tried to reject science and insist that the Bible was literal.\n \n As for the Scopes Trial, it was an effort not of journalists, but of the fledgling ACLU. They were the ones to push the issue and to stage a violation of the law against the teaching of evolution. Scopes lost, as was the plan. The question was had he violated the law and he admited that he had. The point was to challenge the Constitutionality of the law on appeal but that turned out to be a bust when the case was dismissed on a technicality. The judge made an error. He fined Scopes $100. The law specified that any fine of more than $50 had to be decided by a jury. The appeals court dismissed the case.\n \n However, there have been several other laws that have gone to the Supreme Court dealing with evolution and creationism in public schools. At first, creationists tried to make it illegal to teach evolution. Unconstitutional because our schools have an obligation to teach current science. Next they tried to get \"equal time\" for \"creation science.\" The SCOTUS found that evolution was science and was legitimate in science class while \"creation science\" was religion and therefore could not be taught.\n \n But the issue still is being debated. Now the new creationists want to pretend that Intelligent Design (ID) is scientific. Creationists won't be happy until U.S. society is reduced to a level of knowledge and a standard of living equivalent to that before Newton.\n\n \n I agree with you. The evolution theory is still a better subject than biblical fiction. Atleast one can point to evolutionary change and demonstrate some logical proof of its existence.  ", 
   {}, 
   36486, 
   null, 
   1077840420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Scopes Monkey Trial", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1825-scopes-monkey-trial.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 1825, 
  "discussion_files": [
   [
    "15843.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1825-scopes-monkey-trial-print.html"
   ]
  ], 
  "identifier": 1825
 }
]