[
 [
  [
   37314, 
   null, 
   "Patrick Henry", 
   "Monday, March 1, 2004\n \n Vietnam Veterans Denounce 'Hanoi John'\n \n Hundreds of U.S. Army veterans and Vietnamese escapees demonstrated Saturday outside John Kerry's campaign headquarters in Manhattan to protest his betrayal of them.\n \n \"Waving American and South Vietnamese flags and singing the U.S. national anthem, they held up signs saying 'Hanoi John,' and 'Kerry Betrayed Vietnam Vets',\" Reuters reported.\n \n It claimed there were only 200 protesters, but New York Newsday reported twice that number.\n \n \"We won't sit by and let the American people think that we are going to stand by somebody who stabbed us in the back,\" said Jerry Kiley, a veteran and one of the protest's organizers.\n \n \"He betrayed us. He stabbed us in the back. We will never allow him to be our commander-in-chief. Ever!\" Kiley exclaimed to the crowd on Park Avenue. \n \n \"Veteran after veteran passionately lambasted Kerry,\" Newsday reported.\n \n \"Equally fervent in their disdain for Kerry were the Vietnamese-Americans, who hold the senator from Massachusetts responsible for thrice blocking a bill in 2001 and 2002 that would have tied U.S. aid to Vietnam to that country's human rights record.\"\n \n Nam Pham, 48, a banker from Boston who is working with the Massachusetts Human Rights Commission for Vietnam, observed: \"Sen. John Kerry has been working with the dictatorship in Vietnam. He lost the moral authority to lead the free world.\"", 
   {
    "post_info": {
     "post_title": "Vietnam Veterans Denounce 'Hanoi John'"
    }
   }, 
   null, 
   null, 
   1078200780.0
  ], 
  [
   37322, 
   null, 
   "Nallyo", 
   "One of my good friends is a Vietnam vet. Voting Bush all the way.", 
   {}, 
   37314, 
   null, 
   1078201560.0
  ], 
  [
   39723, 
   null, 
   "Dmann", 
   "McCain Fights Old Foe Who Now Fights Kerry\n \n \n February 14, 2004\n \n New York Times\n by Michael Janofsky\n \n Washington, DC - \n \n \n Senator John McCain came to the defense of a fellow Vietnam War veteran, Senator John Kerry, on Friday by attacking the credibility of a North Carolina veteran who has dedicated himself to defeating Mr. Kerry in his campaign for president.\n \n \n Mr. McCain, an Arizona Republican, called the man, Ted Sampley, \"one of the most despicable people I have ever had the misfortune to encounter.\"\n \n Mr. Sampley, a businessman from Kinston, N.C., has gained some attention in recent days for operating a Web site devoted to attacking Mr. Kerry, a Massachusetts Democrat, for his opposition to the war in Vietnam after his military service. The Web site, www.vietnamveteransagainstjohnkerry.com, includes pictures from the 1970's showing Mr. Kerry at antiwar protests. One shows Mr. Kerry at a rally, sitting several rows behind Jane Fonda, who was so outspoken against the war that she was labeled a Communist by her political opponents.\n \n In response to Mr. McCain's remarks about him, Mr. Sampley said in a telephone interview: \"It's not the first time he said that. That's his opinion. It's unbecoming of a senator to say things like that, but I'm fair game just like he is.\"\n \n In 1993, Mr. Sampley was convicted of misdemeanor assault and sentenced to 180 days' probation for attacking a legislative aide to Mr. McCain. \n \n A self-proclaimed champion for veterans' rights, Mr. Sampley has been criticizing Mr. Kerry for much the same reason he made Mr. McCain a target for years: Neither man, Mr. Sampley contends, has done enough to investigate his claim that American servicemen were left behind in Vietnam after the war.\n \n Mr. Sampley once called Mr. McCain, who was held captive for five years in North Vietnam, \"the Manchurian Candidate,\" a reference to a 1962 film in which a Communist-controlled candidate nearly becomes his party's candidate for president.\n \n In a recent statement posted on his Web site, Mr. Sampley made a similar suggestion, saying: \"I have personally dealt with John Kerry on the issue of U.S. P.O.W.s left behind in Vietnam. Kerry is not truthful and is not worthy of the support of U.S. veterans. Many Vietnam vets have been duped into thinking Kerry is their friend. He is not. To us, he is `Hanoi John.' \"\n \n In defending Mr. Kerry, Mr. McCain - who has campaigned for President Bush this year - said of Mr. Sampley: \"I consider him a fraud who preys on the hopes of family members of missing servicemen for his own profit. He is dishonorable, an enemy of the truth, and despite his claims, he does not speak for or represent the views of all but a few veterans.\"\n \n Mr. Sampley is not the only person actively seeking to discredit Mr. Kerry. In recent days, a picture showing Mr. Kerry at a podium with Ms. Fonda has circulated on the Internet. But the picture is a hoax, according to the photo agency that owns the original, Corbis. In the original photo, Mr. Kerry is alone at the podium.", 
   {
    "unicode_changes_made": true
   }, 
   37322, 
   null, 
   1079497740.0
  ], 
  [
   39724, 
   null, 
   "Dmann", 
   "The Veterans Brigade has been a powerful weapon in helping John Kerry charge to the front of the pack. Led by some of the crew from his swift boat tours in Vietnam, veterans have been traveling from state to state, getting on the phone, vet-to-vet, to turn out their fellow vets for caucuses and primaries. \n \n WATE TV in east Tennessee broadcast an insightful piece about two members of the Veterans Brigade, Del Sandusky and Gene Thorson, who were visiting the state before Tuesday's primary. \n \n Del and Gene both served under Kerry's command. On this video, Del and Gene make a very strong case for John's candidacy. Thorson is crystal clear about what Kerry's campaign means to him: \"We care for the man. We believe in what he is doing. It's like I tell people back home, if I can do one iota for this man to be president, I will do it, and I will try my best. \n \n Posted in Veterans | Entry link\n By DickBell on February 9, 2004 at 07:39 PM", 
   {}, 
   39723, 
   null, 
   1079497860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Vietnam Veterans Denounce 'Hanoi John'", 
  "url": "http://www.4forums.com/political/politics-debates/1864-vietnam-veterans-denounce-hanoi-john.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 1864, 
  "discussion_files": [
   [
    "14835.html", 
    "http://www.4forums.com/political/politics-debates/1864-vietnam-veterans-denounce-hanoi-john-print.html"
   ]
  ], 
  "identifier": 1864
 }
]