[
 [
  [
   37315, 
   null, 
   "Patrick Henry", 
   "Democrats Put Silencers on Their Anti-gun Agenda \n \n Monday, Mar. 1, 2004 \n \n WASHINGTON - Doug Hattaway tells a cautionary tale for the candidates of 2004 from the annals of the last campaign.\n Al Gore's presidential campaign spokesman was flying over the candidate's home state of Tennessee in 2000 when he overheard this complaint from a couple of men talking in business class: \"The problem with Al Gore is he'll take our guns away.\"\n \n \"I knew we were in trouble,\" said Hattaway. When he heard that exchange, he realized the rap against Democrats as anti-gun was taking hold, and not only among the stereotypical working-class Southerners drawn to National Rifle Association.\n \n This time around, Democrats have lunged toward the middle on gun control, avoiding edgy proposals such as gun registration and gun-owner licensing and sticking with stands that almost match, at least rhetorically, those of President Bush.\n \n \"The agenda has not changed so much, as their embracing of a principled agenda that can be enacted rather than throwing away elections on policies that are going nowhere,\" said Hattaway, now a consultant who helps a moderate gun-control group.\n \n Guns have been largely silent in this presidential campaign. But Congress is forcing the issue into the open with a vote scheduled Tuesday on renewing the ban on what critics call \"assault-type\" weapons and extending background checks to gun shows.\n \n Candidates John Kerry and John Edwards, the only Democrats to miss a Senate vote on another gun issue last week, have been summoned back from campaigning to bolster the party's ranks for what is expected to be a close vote.\n \n The vote comes up on the same day as the 10-state Super Tuesday contests for the Democrat nomination.\n \n The issue, while contentious, does not carry the same political stakes of Gore's gun positions in 2000. Edwards, a Southerner who grew up around firearms, speaks of his support for \"modest\" changes in gun control. Kerry often tells a crowd how much he likes to hunt. Wearing a flannel shirt and rubber boots, he shot pheasants on a recent hunting trip.\n \n \"I believe I can speak to that culture,\" he said.\n \n Not only are there few differences between the Democrat candidates on gun control, there is barely any difference between them and Bush, at least on the surface.\n \n Asked how they differ on guns, Hattaway said, \"Kerry is probably a better shot.\"\n \n The debate, if it can be called that, is over enforcing law, because enforcement has continued to lag under Bush as it did under former President Bill Clinton.\n \n Democrats are soft-pedaling the issue this time because \"it probably doesn't win them votes in states where they are trying to improve,\" said Earl Black, a political scientist at Rice University in Houston.\n \n Anyway, Black said, most people who are really interested in gun rights would back Bush. \"I don't think Edwards or Kerry will have the kind of records that would tempt many of the gun people away from the Republicans,\" he said.\n \n In the 2000 election, roughly half of voters were from gun-owner households, and they voted for Bush by 61 percent to 36 percent, according to exit polls. The voters from non-gun owner households voted for Gore by 58-39.\n \n Some strategists believe gun owners are more motivated to vote on gun issues than others are, and so pushing an agenda might be more of a risk for Democrats. A Pew poll in February found that Republicans were less likely to vote for someone who differed with their position on guns than Democrats were.\n \n Indeed, the poll suggests other social issues are more important to voters, and more divisive, than gun rights. For example, 40 percent of respondents said they would not vote for anyone who disagrees with them on gay marriage, and 34 percent felt the same about abortion. Only 32 percent ruled out voting for a candidate who differs with them on guns.\n \n Hattaway, the former Gore spokesman, doesn't anticipate the gun issue to flare up in the election campaign.\n \n \"The issues that are on the table are popular with gun owners and non-gun owners alike,\" he said. \"There's no point losing elections over proposals like registering handguns that are never going to see the light of day in Congress.\"", 
   {
    "post_info": {
     "post_title": "Democrats Put Silencers on Their Anti-gun Agenda"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1078201020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Democrats Put Silencers on Their Anti-gun Agenda", 
  "url": "http://www.4forums.com/political/gun-control-debates/1865-democrats-put-silencers-their-anti-gun-agenda.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 1865, 
  "discussion_files": [
   [
    "31797.html", 
    "http://www.4forums.com/political/gun-control-debates/1865-democrats-put-silencers-their-anti-gun-agenda-print.html"
   ]
  ], 
  "identifier": 1865
 }
]