[
 [
  [
   37693, 
   null, 
   "Rev. HellH0und", 
   "This is the future the lunatic fringe has in store for us. How can you libs justify this?!?!?!\n \n \n \n Tony Martin refused leave 'because of risk to burglars'\n By Daniel Foggo\n (Filed: 20/07/2003) \n \n \n Tony Martin, the farmer who killed a criminal who broke into his house, has been denied a preparatory home visit before his release on parole next week because he is considered to be a \"danger to burglars\".\n \n \n \n In a meeting last week with the wing governor at his prison and Annette Stewart, his probation officer, Martin was told that he had been refused a trial three-day home release because the authorities felt that he might reoffend even during that short space of time.\n \n It is normal practice for prisoners awaiting release to be given a few days outside to introduce them gradually to the prospect of regaining their liberty.\n \n It had been thought that Martin had previously not been given the home visit because of fears over the security of his property. Concerns have been raised about Martin's safety after his life was threatened by friends of the teenager he killed.\n \n The revelation that the probation authorities are still reluctant to let him go, even so close to his release, sparked fury from his supporters last night. Malcolm Starr, a close friend, said: \"This is the final insult.\"\n \n Henry Bellingham, Martin's MP, who visited the farmer in prison last week, will take up the snub with the Government. He said: \"I will be writing to the Home Secretary about this, it is quite extraordinary.\n \n \"Tony Martin has been turned into a political prisoner. The Probation Service is being vindictive. Even the matter of a house visit, a standard request for him to be treated normally, has been spiked and I find it stunning.\"\n \n The 58-year-old farmer related the conversation with Ms Stewart in a letter to Peter Sainsbury, the general secretary of the POW Trust, a charity which has been supporting Martin.\n \n In the correspondence, a copy of which has been supplied to this newspaper, Martin said: \"There was a meeting today after Malcolm [Starr] visited with the parole board for home visit. They still consider me dangerous.\"\n \n It is understood that Ms Stewart questioned Martin about his views on the burglar he shot dead, Fred Barras. Martin replied that he was \"not going down that route again\".\n \n Mr Sainsbury has now written to the governor of Highpoint, the category C prison in Suffolk where Martin is being held, demanding an explanation in writing.\n \n A reply to Mr Sainsbury's letter from the governor, which was handed to Martin directly on Friday, states that the home visit was not granted because he \"did not fit the criteria\".\n \n Ms Stewart has previously written a report on Martin which was submitted to the Parole Board before its ruling in January. In it she said that Martin's support base in the country had made him more likely to reoffend.\n \n \"This is a case which has attracted immense and ongoing media attention and public interest,\" she wrote. \"I believe this has had an impact on Mr Martin's own perceptions of his behaviour and his right to inflict punishment on those whom he perceives to be a threat to his own security.\n \n \"Indeed this may have contributed to his justification of the offending. This encapsulation of his views has served to disallow any rational contemplation by Mr Martin of his crimes and he does not express any remorse for the death of one so young.\"\n \n Martin was convicted of murdering Barras, 16, and wounding his accomplice, Brendan Fearon, 33, during a burglary at the farmer's home in Emneth Hungate, Norfolk, in August 1999. This was reduced on appeal to manslaughter. He became eligible for early release last autumn, at the discretion of the Parole Board, after having served half of his sentence.\n \n Although this was turned down he is now automatically entitled to parole having completed two thirds of his prison term. Fearon, who has more than 30 criminal convictions and is currently in jail, is seeking compensation from Martin under the Human Rights Act. Last night Mr Sainsbury described the refusal of a home visit for Martin as \"absolutely appalling\".\n \n \"There has been no process by the Prison Service to fit him back into the community,\" he said.\n \n \"Why is he not in an open prison now for a start? Normally prisoners are transferred to open conditions prior to their release to allow them to readjust, but not Mr Martin.\n \n \"The Parole Board have gone out of their way to stop him being released. He should have been released last September, which was his earliest possible release date.\n \n \"Then an idiot probation officer said he should not get it because he was a danger to burglars and now this. It is one insult after another.\"", 
   {
    "post_info": {
     "post_title": "Tony Martin refused leave 'because of risk to burglars'"
    }
   }, 
   null, 
   null, 
   1078337100.0
  ], 
  [
   37740, 
   null, 
   "sundowner", 
   "You don't happen to mention that he was released 8 days later. Also, that he shot and killed 1, shot the other, who crawled to the house next door for help. You don't mention that he then fled the scene, only to be arrested more than 24 hours later. If he firmly believed it was self defense, why did he run? Also, he shot them as they were attempting to flee through a window, obviously not providing a direct threat to his life. I am not saying what the criminals did was right, but neither was what Mr. Martin did. I have no problem with him killing them both, but then leaving the scene for the police to discover later and going to a hotel and hiding shows a little bit of self doubt in Mr. Martins mind as to if what he did was right. If he had just shot and killed them both, or killed one and wounded the other as it happened, he should have just called the police right then and there. You also don't mention that in an appeal Mr. Martin used the defense that he was not responsible for what he did by reason of mental defect. I understand that this man had been victimized prior to this incident, however this does not excuse his actions. According to local reports, he did not employ any methods of security to deny access to his home by criminals. Also, you don't mention that the pump shotgun that he had was illegally owned. Like I said, I would have shot them both too, but I would not have run from the scene. I also would have done more to protect my home from criminals in the first place. As far as the wounded criminal filing suit for damages and lost wages, I would not give him a dime. I respect him for what he did, and I think his time in jail was deserved. I am glad he was released. As far as him being denied the 3 day furlough, that was really rediculous.", 
   {}, 
   37693, 
   null, 
   1078347120.0
  ], 
  [
   37784, 
   null, 
   "JustAnotherGuy", 
   " I am not saying what the criminals did was right, but neither was what Mr. Martin did. I have no problem with him killing them both.\n\n \n You do have a problem with this person defending himself or you would not be attacking him. Fear made him do this. The fear was created in him by the buglers. \n \n You want unarmed passengers to attack armed terrorists on airplanes, but you have a problem with a home owner killing buglers.", 
   {}, 
   37740, 
   null, 
   1078358220.0
  ], 
  [
   37788, 
   null, 
   "sundowner", 
   "You do have a problem with this person defending himself or you would not be attacking him. Fear made him do this. The fear was created in him by the buglers. \n \n You want unarmed passengers to attack armed terrorists on airplanes, but you have a problem with a home owner killing buglers.\n\n \n I would prefer that terrorists not be armed on aircraft, that has been the point of what I have been trying to say. If I wanted unarmed passengers to attack armed terrorists, I would advocate finding terrorists, buying them tickets, and giving them guns before boarding. The point of it is that you do what you have to do. \n \n And I am not attacking him. I am simply responding to the previous post. I do not question his motives, I question his methods. I said that I have no problem with what he did, just how he went about it. Why must you attack me on every little point?", 
   {}, 
   37784, 
   null, 
   1078359060.0
  ], 
  [
   37795, 
   null, 
   "JustAnotherGuy", 
   "I would prefer that terrorists not be armed on aircraft, that has been the point of what I have been trying to say. If I wanted unarmed passengers to attack armed terrorists, I would advocate finding terrorists, buying them tickets, and giving them guns before boarding. The point of it is that you do what you have to do. \n \n And I am not attacking him. I am simply responding to the previous post. I do not question his motives, I question his methods. I said that I have no problem with what he did, just how he went about it. Why must you attack me on every little point?\n\n \n \n Fear created by buglers made the home owner do what he did! You have a problem because he shot them on their way out. I guess you have some way of knowing that these criminals would never return to once again create fear in the home owner. Making unarmed people live in fear is about all you demand of the law-abiding citizens. To bad you do not turn your attention to the criminals and leave the law-abiding citizens alone!", 
   {}, 
   37788, 
   null, 
   1078360080.0
  ], 
  [
   37805, 
   null, 
   "sundowner", 
   "Fear created by buglers made the home owner do what he did! You have a problem because he shot them on their way out. I guess you have some way of knowing that these criminals would never return to once again create fear in the home owner. Making unarmed people live in fear is about all you demand of the law-abiding citizens. To bad you do not turn your attention to the criminals and leave the law-abiding citizens alone!\n\n \n You are not worth the debate. If you refuse to acknowledge anything I say, it is worthless to continue spitting it back to you.", 
   {}, 
   37795, 
   null, 
   1078364820.0
  ], 
  [
   37812, 
   null, 
   "JustAnotherGuy", 
   "You are not worth the debate. If you refuse to acknowledge anything I say, it is worthless to continue spitting it back to you.\n\n \n Tuck tail and run when you cannot win your argument or debate!", 
   {}, 
   37805, 
   null, 
   1078366860.0
  ], 
  [
   37817, 
   null, 
   "sundowner", 
   "Tuck tail and run when you cannot win your argument or debate!\n\n \n That's not it at all. It just does absolutely no good to debate with you if you cannot logically debate back. I would bet that most rational, realistic, and sane people would say that I have already won the debate. Extremist logic does not impress me.", 
   {}, 
   37812, 
   null, 
   1078368000.0
  ], 
  [
   37820, 
   null, 
   "JustAnotherGuy", 
   "That's not it at all. It just does absolutely no good to debate with you if you cannot logically debate back. I would bet that most rational, realistic, and sane people would say that I have already won the debate. Extremist logic does not impress me.\n\n \n Extremist logic? You are the person that stated unarmed law-abiding passengers should attack armed terrorists!\n \n You are the one that attacked a home owner for shooting two burglars that entered his home without his permission!", 
   {}, 
   37817, 
   null, 
   1078368540.0
  ], 
  [
   37913, 
   null, 
   "Rev. HellH0und", 
   "You don't happen to mention that he was released 8 days later. \n \n\n \n After spending HOW long in jail????\n \n \n \n\n Also, that he shot and killed 1, shot the other, who crawled to the house next door for help.\n\n \n I would have done the same thing. You wouldn't have?\n \n \n\n You don't mention that he then fled the scene, only to be arrested more than 24 hours later. If he firmly believed it was self defense, why did he run? \n\n \n Did YOU not read... He had no idea how many there were, he has been threatened with reataliation etc. etc.\n \n \n\n Also, he shot them as they were attempting to flee through a window, obviously not providing a direct threat to his life. I am not saying what the criminals did was right, but neither was what Mr. Martin did. I have no problem with him killing them both, but then leaving the scene for the police to discover later and going to a hotel and hiding shows a little bit of self doubt in Mr. Martins mind as to if what he did was right.\n\n \n Once they violated his civil rights by invading his home they gave up thier right to life... Defense of property is protectable by lethal force in my book.. How would he know what they where going to do once outside? They have been in his house before... I already explained the hotel.... How the hell do you know whats in his mind.\n \n \n \n\n If he had just shot and killed them both, or killed one and wounded the other as it happened, he should have just called the police right then and there. You also don't mention that in an appeal Mr. Martin used the defense that he was not responsible for what he did by reason of mental defect. I understand that this man had been victimized prior to this incident, however this does not excuse his actions. \n\n \n You do what you can when you live in a police state. He does not need aANY excuse for his actions.... \n \n \n \nAccording to local reports, he did not employ any methods of security to deny access to his home by criminals. \n\n \n \n WHAT?!?!!?!?!? because I leave a window open does not give you the right to try to victimize me.. This is absurd!!!\n \n \n\n Also, you don't mention that the pump shotgun that he had was illegally owned. Like I said, I would have shot them both too, but I would not have run from the scene. I also would have done more to protect my home from criminals in the first place. As far as the wounded criminal filing suit for damages and lost wages, I would not give him a dime. I respect him for what he did, and I think his time in jail was deserved. I am glad he was released. As far as him being denied the 3 day furlough, that was really rediculous.\n\n \n \n \n The government by denying him the right to own that shotgun and made him a criminal should then be responsible for his saftey and be held criminally and civilly responsible if this happens again, right?", 
   {}, 
   37740, 
   null, 
   1078418280.0
  ], 
  [
   38032, 
   null, 
   "JustAnotherGuy", 
   "This person sundowner would have all law-abiding citizens live in fear of criminals.", 
   {}, 
   37913, 
   null, 
   1078431600.0
  ], 
  [
   38053, 
   null, 
   "The_Comedian", 
   "This person sundowner would have all law-abiding citizens live in fear of criminals.\n\n Did you ever spend your holidays outside the USA?", 
   {}, 
   38032, 
   null, 
   1078433460.0
  ], 
  [
   38072, 
   null, 
   "sundowner", 
   "I would have done the same thing. You wouldn't have?\n \n \n Yes I would have, and I have said that. I just would have done it differently. \n \n \nDid YOU not read... He had no idea how many there were, he has been threatened with reataliation etc. etc.\n \n \n So after he was safe at the hotel, locked in his room, he did not call the police for so many hours because...?\n \n \nOnce they violated his civil rights by invading his home they gave up thier right to life... Defense of property is protectable by lethal force in my book.. How would he know what they where going to do once outside? They have been in his house before... I already explained the hotel.... How the hell do you know whats in his mind.\n \n \n In your book. There is the problem. Laws are not written from your book. And while I agree with the principle that if I find someone in my house at 2AM, I shoot him, If my actions violate the law, I know that I will face the penalty for the action. Right or wrong, the law is still the law, and whether I knowingly or unknowingly violate the law (ignorance is not an excuse), I am responsible for my actions. Just because you think you are justified to do something, and you may be right, does not make it lawful.\n \n \nYou do what you can when you live in a police state. He does not need aANY excuse for his actions.... \n \n \n Is he being forced to live there? Anyway, no, he does not need any excuse for his actions, so why is it that everyone seems to try to make them up for him? (he was afraid, he had been robbed before, he could not rely on the police to protect him, he was only protecting himself) While these may be true, it does not change that he violated the law. Right or wrong...\n \n \nWHAT?!?!!?!?!? because I leave a window open does not give you the right to try to victimize me.. This is absurd!!!\n \n \n You're right. That is absurd. I did not suggest that this gave them a \"right to try to victimize him\". But it sure made it easier. If I leave my car sitting in Hialeah overnight with the doors unlocked and the windows rolled down, the criminal that steals it or its' contents is still responsible for the crime, but I made it a lot more tempting and easier for him to rip me off didn't I?\n \n \nThe government by denying him the right to own that shotgun and made him a criminal should then be responsible for his saftey and be held criminally and civilly responsible if this happens again, right?\n \n \n Wrong. What made him a criminal was his possessing the shotgun after the government said it was illegal to do so. They enacted the law, he chose not to follow it. That makes it his problem. And do you hold the state department of motor vehicles responsible if someone drives recklessly and crashes into you on the highway? Or do you look at the person directly responsible for the crash (the other XXXXX on the road). Do you blame the gun manufacturer for a shooting death, or do you blame the XXXXX holding the gun? So why blame the government for a crime committed by a criminal?", 
   {}, 
   38053, 
   null, 
   1078436340.0
  ], 
  [
   38074, 
   null, 
   "JustAnotherGuy", 
   "Are you kidding, he would have to leave the militia compound first, and could not take his gun with him. \n\n \n The only person demanding that people live in bunkers is the person named sundowner!\n \n \nSimply naming an area a gun free zone does not make it a gun free zone. If it is truely to be a gun free zone, the law must be enforced. To enforce the law, you must provide a means of security / controlled access to the zone, to screen for and prevent guns from entering the zone. If the law is enforced, the gun free zone will work. \n\n \n \nNo I don't . I want children (at least my children and family) to be placed in a school where they do not have to worry about one of their classmates pulling out a tech 9 and going on a rampage in the library. I don't think that is too much to ask. I think eliminating the risk of this makes a school a much more effective place to learn. How many people do you think actually learned anything at Columbine the day they came back to school, or perhaps were they a little distracted. \n\n \n \nBy enacting sensible yet effective methods of security.\n\n \n All of these quotes are from sundowner.\n Upon examination you will notice the person sundowner is calling for: \n provide a means of security / controlled access to the zone, \n to screen for and prevent guns from entering the zone\n I want children (at least my children and family) to be placed in a school where they do not have to worry about one of their classmates pulling out a tech 9 and going on a rampage in the library. \n I think eliminating the risk of this makes a school a much more effective place to learn. \n \n Now this is the person accusing me of living in a bunker for defending a persons right to defend themselves. This person sundowner wants kids placed in secure areas, check points, all items searched and all risk of people having guns prevented.", 
   {}, 
   38053, 
   null, 
   1078436760.0
  ], 
  [
   38085, 
   null, 
   "sundowner", 
   "The only person demanding that people live in bunkers is the person named sundowner!\n \n \n \n \n \n \n \n All of these quotes are from sundowner.\n Upon examination you will notice the person sundowner is calling for: \n provide a means of security / controlled access to the zone, \n to screen for and prevent guns from entering the zone\n I want children (at least my children and family) to be placed in a school where they do not have to worry about one of their classmates pulling out a tech 9 and going on a rampage in the library. \n I think eliminating the risk of this makes a school a much more effective place to learn. \n \n Now this is the person accusing me of living in a bunker for defending a persons right to defend themselves. This person sundowner wants kids placed in secure areas, check points, all items searched and all risk of people having guns prevented.\n\n \n In schools...yep I do. What I find sad is that you have a problem with this. You must like the idea of school shootings. So what would be your plan to prevent my children from getting shot at school?", 
   {}, 
   38074, 
   null, 
   1078438500.0
  ], 
  [
   38090, 
   null, 
   "JustAnotherGuy", 
   "In schools...yep I do. What I find sad is that you have a problem with this. You must like the idea of school shootings. So what would be your plan to prevent my children from getting shot at school?\n\n \n \n You want schools turned into bunkers! You want unarmed law-abiding citizens to attack armed terrorists. You attack home owners for defending themselves against burglars.", 
   {}, 
   38085, 
   null, 
   1078439460.0
  ], 
  [
   38097, 
   null, 
   "daewoo", 
   "Did you ever spend your holidays outside the USA?\n\n \n Americans, as a rule, do not travel. Unfortunatly, this leaves us wide opened to be brainwashed about what the rest of the world is like. The british arw a bunch of tea drinking pansys, the australians all live in the outback and wrestle crocodiles, asians all wear funy little straw hats and pull each other around in wagons. The french do nothing but eat crosoints all day. And, of course, nowhere else in the world is there any kind of freedom.\n \n Everything is cheaper in the US, the food is better and our taxes are lower (three lies all right in a row).", 
   {}, 
   38053, 
   null, 
   1078441440.0
  ], 
  [
   38099, 
   null, 
   "sundowner", 
   "Americans, as a rule, do not travel. Unfortunatly, this leaves us wide opened to be brainwashed about what the rest of the world is like. The british arw a bunch of tea drinking pansys, the australians all live in the outback and wrestle crocodiles, asians all wear funy little straw hats and pull each other around in wagons. The french do nothing but eat crosoints all day. And, of course, nowhere else in the world is there any kind of freedom.\n \n Everything is cheaper in the US, the food is better and our taxes are lower (three lies all right in a row).\n\n \n Many Americans have been to Canada, Mexico, The Bahamas, Bermuda, etc...\n Europe is a little different due to distance and cost to visit. I will bet that many French have been to England, Germany, Spain, etc...while considerably fewer have been to the US. Proximity and convenience make travel much more likely. I would think that this is a universal truth. And as far as stereotypes about other parts of the world, it is true that many people who have never left their own country know little about the rest of the world...no big surprise there. But don't forget that there are many misconceptions about the US also.", 
   {}, 
   38097, 
   null, 
   1078442580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Tony Martin refused leave 'because of risk to burglars'", 
  "url": "http://www.4forums.com/political/gun-control-debates/1874-tony-martin-refused-leave-because-risk-burglars.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 1874, 
  "discussion_files": [
   [
    "9508.html", 
    "http://www.4forums.com/political/gun-control-debates/1874-tony-martin-refused-leave-because-risk-burglars-print.html"
   ], 
   [
    "9509.html", 
    "http://www.4forums.com/political/gun-control-debates/1874-tony-martin-refused-leave-because-risk-burglars-2-print.html"
   ]
  ], 
  "identifier": 1874
 }
]