[
 [
  [
   1666, 
   null, 
   "Tim", 
   "Which do you believe in?\n 1)Creation of the world as told in the Bible.\n 2)Theistic Evolution (Evolution happened, but it was guided and directed by God. The account in the Bible is perhaps symbolic, not literal.)\n 3)Naturalistic Evolution (Evolution happened, and God was not involved)", 
   {
    "post_info": {
     "post_title": "What are your views on evolution and creationism?"
    }
   }, 
   null, 
   null, 
   1044926820.0
  ], 
  [
   1679, 
   null, 
   "fallingupwards", 
   "i used to believe in creation, but there is simply no evidence at all to support it. at least young-earth creation. MAYBE old-earth creation. but the fact that 98% of scientists believe in evolution, makes me think that evolution is the theory with the most validity. but it is impossible for all of this to happen by chance. someone had to guide the process. God was that someone.", 
   {}, 
   1666, 
   null, 
   1044934800.0
  ], 
  [
   1695, 
   null, 
   "Porky Pine", 
   "Natrualistic Evolution. I have not seen any evidence of a god nor does evolution require a god to function.\n \n BTW, your first choice is a bit misleading since evolution has nothing to do with how the world was created.", 
   {}, 
   1666, 
   null, 
   1044941880.0
  ], 
  [
   1696, 
   null, 
   "Porky Pine", 
   "Oh Falling, don't use the argument that you believe in evolution because the majority of scientists believe in it. One could accuse you of arguing by popularity. It would be better if you studied the evidence and came to the conclusion that evolution was the best scientific theory that answers the question of the diversity of life on this planet.", 
   {}, 
   1666, 
   null, 
   1044942120.0
  ], 
  [
   1697, 
   null, 
   "fallingupwards", 
   "i'm strong in most subjects, but i have never quite understood science. i apologize.\n \n it is impossible for life to have been created just by chance. there had to be a supreme being to be in charge of it. something does not come out of nothing. that is a scientific law.", 
   {}, 
   1666, 
   null, 
   1044942600.0
  ], 
  [
   1758, 
   null, 
   "Porky Pine", 
   "i'm strong in most subjects, but i have never quite understood science. i apologize.\n\n \n No need. I'm not exactly a rocket scientist myself.\n \n \nit is impossible for life to have been created just by chance.\n\n \n Who says it was chance? Is it just chance that snowflakes form as they do? No, they form from the laws of physics. Why can't life do the same?\n \n \nthere had to be a supreme being to be in charge of it.\n\n \n No, not necessarily. Once you start stuffing up the cracks in our knowledge of something with a untestable supernatrual agency, whatever you are pursuing ceases to be science.\n \n How did the universe form? No one knows.\n \n Was it a god that did it? Possibly, but until this god makes itself known or someone comes up with a way to scientifically test for a god, there's no real reason to pursue it. \n \n If you want to believe that a god created it, that's fine and dandy as long as you realise that it's just your faith and not scientific at all.\n \n \nsomething does not come out of nothing. that is a scientific law.\n\n \n Virtual particles have been observed to pop in and out of existence. Are they breaking \"scientific law\"?", 
   {}, 
   1666, 
   null, 
   1045006380.0
  ], 
  [
   1760, 
   null, 
   "fallingupwards", 
   "like i said, i am not exactly a scientist so i just wanted to clear something up that confuses me. it is a scientific law that \"matter can neither be created nor destroyed\" correct? but doesnt this contradict what you said about particles appearing and disappearing?\n \n this is actually a link that tim showed xyou in the religion forum. but i think it provides solid proof that a God does in fact exist. check it out:\n http://home.clear.net.nz/pages/bryanp/Other/atheis1.htm", 
   {}, 
   1666, 
   null, 
   1045006620.0
  ], 
  [
   1981, 
   null, 
   "lurch", 
   "like i said, i am not exactly a scientist so i just wanted to clear something up that confuses me. it is a scientific law that \"matter can neither be created nor destroyed\" correct? but doesnt this contradict what you said about particles appearing and disappearing?\n\n \n Actually, matter can be created and destroyed. It is total energy that is conserved. One example is in a nuclear reactor. The mass of the fission products is less than that of the original fuel. Matter has been \"destroyed.\" But ov course, it became a form of energy - eventually electricity. On the other side, virtual particles spring into existance all the time in a vacuum. But the are a particle and an anti-particle and the net energy is zero so energy is conserved. These ideas come from quantum mechanics. A virtual particle is a particle that can never be directly detected, but whose existence does have measurable effects. One of those effects is the Casimir effect. It is an attractive pressure between two flat, parallel metal plates placed very near to each other in a vacuum. The pressure is due to the reduced number of virtual particles between the plates. When the plates are very close, only particles of certain resonant wavelengths can exist between them. Thus, more particles on the outside push the plates together.\n \n Stephen Hawking talks a lot about virtual particle pairs in both A Brief History of Time and The Universe in a Nutshell. \n \n \nthis is actually a link that tim showed xyou in the religion forum. but i think it provides solid proof that a God does in fact exist.\n\n \n Not only does that site not offer proof, solid or otherwise, it isn't even evidence. As Porky Pine says, it is basically an argument from incredulity - \"I just can't believe.\"", 
   {}, 
   1666, 
   null, 
   1045196280.0
  ], 
  [
   2067, 
   null, 
   "sarablaze", 
   "I respect getting technical.\n But, my views are simple.\n I believe in evolution because there is physical proof in it. I am a spiritual person, so Id have to say that with or without physical proof, I believe in God. So I believe in evolution. And my God.\n I just found out from this post that there is a name for my views. Theistic Evolution", 
   {}, 
   1666, 
   null, 
   1045252560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What are your views on evolution and creationism?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/190-what-your-views-evolution-creationism.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 190, 
  "discussion_files": [
   [
    "9257.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/190-what-your-views-evolution-creationism-print.html"
   ]
  ], 
  "identifier": 190
 }
]