[
 [
  [
   39145, 
   null, 
   "voiceofreason", 
   "Here is a letter from those in the academic community to Charlton Heston. The letter is signed by nearly 50 historians and law professors. Basically the letter says that reasonable gun-control laws don't violate the second amendment.\n \n \"Dear Mr. Heston, \n We are law professors and historians who have a deep interest in the Second Amendment and its implications for the regulation of guns and of gun ownership. Our politics run the gamut. But we are united on the vital importance of putting to rest any misperception that the Second Amendment prohibits a wide range of effective and reasonable firearms regulations. \n \n \"There is room for debate about which firearms policies will best serve Americans. But the law is well-settled that the Second Amendment permits broad and intensive regulation of firearms, including laws that ban certain types of weapons, require safety devices on others, mandate registration and licensing and otherwise impose strict regulatory oversight of the firearms industry. These and similar regulations are fully consistent with the Second Amendment.\n \n \"The Second Amendment - quoted in full - states that 'A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear arms, shall not be infringed.' The United States Supreme Court and every federal appellate court to consider the issue have held that the Second Amendment permits a wide range of reasonable gun control laws. And although academic views differ regarding whether the Second Amendment does more than protect the state militia from being disarmed by federal law, we all agree that the Amendment plainly permits reasonable firearms regulations including those set forth above. \n \n \"The National Rifle Association's repeated suggestions that the Second Amendment somehow stands in the way of effective and reasonable regulation of guns and gun ownership is a distortion of legal precedent and a disservice to all Americans, the great majority of whom support thoughtful firearms policies. The issue at hand transcends the liberal/conservative divide: prominent conservatives like the late Chief Justice Warren Burger and the late Solicitor General Erwin Griswold allied themselves against the NRA's overbroad reading of the Second Amendment. Moreover, as this letter makes clear, it is false and misleading for the NRA to cite any of us or our scholarship as authority for the notion that the Second Amendment prohibits reasonable regulation of the manufacture, transfer, ownership and possession of guns. \n \n \"We encourage you and your supporters to focus on the real issue facing our country - and it isn't the Second Amendment. The central issue on which we all should focus is what sort of firearms legislation and policies will best prevent the killings and violence that plague our country today. \n \n Sincerely, \n (see attached list of endorsers)\" \n http://www.lcav.org/content/letternra.asp", 
   {
    "post_info": {
     "post_title": "A Letter to Mr. Heston"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1079010540.0
  ], 
  [
   39147, 
   null, 
   "Patrick Henry", 
   "Basically the letter says that reasonable gun-control laws don't violate the second amendment.\n\n \n LOL! And 'basically'.. banning firearms (as often proposed by many democRATS) is 'reasonable'? Get bent!", 
   {}, 
   39145, 
   null, 
   1079011800.0
  ], 
  [
   39149, 
   null, 
   "Eddie", 
   "LOL! And 'basically'.. banning firearms (as often proposed by many democRATS) is 'reasonable'? Get bent!\n\n \n Well, \"reasonable\" is clearly subjective... So the authors of the letter are practicly saying that any gun laws not interfering with the state militia would be permited according to the second amendment. But that gun laws obviously should be reasonable. But what reasonable is, is best left to the democratic will of the people. Or am I reading it wrong?", 
   {}, 
   39147, 
   null, 
   1079016900.0
  ], 
  [
   39177, 
   null, 
   "JustAnotherGuy", 
   "Here is a letter from those in the academic community to Charlton Heston. The letter is signed by nearly 50 historians and law professors. \n\n \n At one time many legal professionals, elected officials, and judges were KKK members. These people defend the separation but equal laws. These people defending the racist laws that kept black Americans from voting. \n \n \n \n\"We encourage you and your supporters to focus on the real issue facing our country - and it isn't the Second Amendment. The central issue on which we all should focus is what sort of firearms legislation and policies will best prevent the killings and violence that plague our country today. \n\n \n Notice that not one of the suggestions for preventing the killings is to keep the dangerous killers in prison. After all these dangerous killers have a long history of crimes against society.", 
   {
    "unicode_changes_made": true
   }, 
   39145, 
   null, 
   1079028540.0
  ], 
  [
   39186, 
   null, 
   "daewoo", 
   "WOW. 50 signatures. Out of the thousands of law and history professors in america, these folks only managed to come up with 50 signatures. This is pretty encouraging for us pro gunners. Looking at their list, the first signatory is from yale. Checking yales staff directory, there are 153 legal professors at yale, and 75 history professors of one ilk or another. So, we can safely say that 1/228 of yale professors are known to agree with this. Of course, we could do this with the other schools on the list, but I really don't have that kind of time. \n \n I have actually seen this before, and it was widely circulated (I was given a copy by a history professor at ESU, who thought I might find it as funny as he did).\n \n I do think it is intresting that they claim courts, including the supreme court, have unanomously adopted this view. To the best of my knowledge, the closest the supreme court has come to a ruling that the legality of a gun law is in Miller, when they stated that a short barreled shotgun might be able to be restricted as it is not a military weapon (though, had miller had a chance to go back to the lower court, it could easily have been proved that it was, as such weapons were used extensively during WWI).\n \n Lower courts have been split on the issue, as far as I know, and in cases where they bother to explain their decision, it is invariably one connected to the \"collective rights\" theory.\n \n Are these people really naive enough to believe that heston would not know this, or that Heston would not know that 50 signatures out of thousands of college professors is nothing but an indication of how eak their argument is? They managed to come up with more than 50 signatures from college professors on the petition that claimed that global warming does not exist!\n \n Things like this really bolster my belief that, in the end, the pro-gunners will win.", 
   {}, 
   39145, 
   null, 
   1079032020.0
  ], 
  [
   40947, 
   null, 
   "hvozdany", 
   "How many court decisions have said that it is unconstitutional to regulate guns in any way?", 
   {}, 
   39186, 
   null, 
   1080199680.0
  ], 
  [
   41013, 
   null, 
   "sundowner", 
   "Notice that not one of the suggestions for preventing the killings is to keep the dangerous killers in prison. After all these dangerous killers have a long history of crimes against society.\n \n \n That is not gun control, that is prisoner control. Different subject entirely. This was speaking of gun control.", 
   {}, 
   40947, 
   null, 
   1080245400.0
  ], 
  [
   41088, 
   null, 
   "Toxey", 
   "That is not gun control, that is prisoner control. Different subject entirely. This was speaking of gun control.\n\n \n \n Then what is the reason for gun control then?", 
   {}, 
   41013, 
   null, 
   1080276720.0
  ], 
  [
   41107, 
   null, 
   "sundowner", 
   "Then what is the reason for gun control then?\n\n \n If you need help with a concept this simple... emoticon_wow", 
   {}, 
   41088, 
   null, 
   1080283380.0
  ], 
  [
   41280, 
   null, 
   "Toxey", 
   "If you need help with a concept this simple... emoticon_wow\n\n \n \n Perhaps I might.\n Please explain to me how more gun control laws will make this a better world.Please keep in mind that laws are only obeyed by the law abiding citizens.", 
   {}, 
   41107, 
   null, 
   1080400680.0
  ], 
  [
   41385, 
   null, 
   "sundowner", 
   "Perhaps I might.\n Please explain to me how more gun control laws will make this a better world.Please keep in mind that laws are only obeyed by the law abiding citizens.\n\n \n So you seem to be saying that only laws will be obeyed by law abiding citizens (which everyone here agrees on), so why should we have any laws anyway? It's not as if the criminals will follow them anyway. Is this your philosphy?\n \n Why have speed limits...speeders will not follow them?\n Why require a drivers license, criminals will drive without them anyway? \n \n Why install theft prevention and detection technology at stores, people will just continue to find new ways to steal things?\n \n -just a few more examples of your type of logic.", 
   {}, 
   41280, 
   null, 
   1080521760.0
  ], 
  [
   41397, 
   null, 
   "Toxey", 
   "So you seem to be saying that only laws will be obeyed by law abiding citizens (which everyone here agrees on), so why should we have any laws anyway? It's not as if the criminals will follow them anyway. Is this your philosphy?\n \n Why have speed limits...speeders will not follow them?\n Why require a drivers license, criminals will drive without them anyway? \n \n Why install theft prevention and detection technology at stores, people will just continue to find new ways to steal things?\n \n -just a few more examples of your type of logic.\n\n \n Dont be silly,laws are put in place to keep citizens in place so that we can all live in harmony.\n Its those that break the laws that disrupt the harmony.\n In my opinion there are enough laws on the books concerning guns.Additional laws are only affecting the law abiding citizens.\n If the law makers would properly enforce the laws we have,and make adjustments in punishment where the need arises.We would all be better off.\n Instead of making new laws,increase the punishment.Does that sound crazy?", 
   {}, 
   41385, 
   null, 
   1080530940.0
  ], 
  [
   41671, 
   null, 
   "sundowner", 
   "Dont be silly,laws are put in place to keep citizens in place so that we can all live in harmony.\n \n \n Right. This includes gun control laws.\n \n \nIts those that break the laws that disrupt the harmony.\n \n \n Yes, the criminals, I understand.\n \n \nIn my opinion there are enough laws on the books concerning guns.Additional laws are only affecting the law abiding citizens.\n \n \n Perhaps. In my opinion most of the laws that are currently on the books are useless. Most \"gun control\" laws are nothing more than words on paper that have no bearing on guns in the real world, nor do they help to prevent gun related crimes. You say additional laws only affect LAC...well, depends on the law doesn't it? \n \n \nIf the law makers would properly enforce the laws we have,and make adjustments in punishment where the need arises.We would all be better off.\n \n \n Law makers do not enforce the law, they write the law. Law enforcement officers enforce the law. And as I had said, a good number of the laws we have are meaningless. Why enforce meaningless laws? That is a major part of the problem. And yes, I stand for tougher penalties for gun related crimes, but this is an after the fact issue. What we need to address is how to prevent the crime in the first place. Longer prison sentences have done little in the past to reduce crime rates and recidivism. Preventing the crime in the first place would make us all better off. So get rid of these rediculous gun control laws and write laws that: make sense, provide for the greatest amount of freedom for LAC, and prevent gun related crime where possible.", 
   {}, 
   41397, 
   null, 
   1080675900.0
  ], 
  [
   41766, 
   null, 
   "Toxey", 
   "Right. This includes gun control laws.\n \n \n \n Yes, the criminals, I understand.\n \n \n \n Perhaps. In my opinion most of the laws that are currently on the books are useless. Most \"gun control\" laws are nothing more than words on paper that have no bearing on guns in the real world, nor do they help to prevent gun related crimes. You say additional laws only affect LAC...well, depends on the law doesn't it? \n \n \n \n Law makers do not enforce the law, they write the law. Law enforcement officers enforce the law. And as I had said, a good number of the laws we have are meaningless. Why enforce meaningless laws? That is a major part of the problem. And yes, I stand for tougher penalties for gun related crimes, but this is an after the fact issue. What we need to address is how to prevent the crime in the first place. Longer prison sentences have done little in the past to reduce crime rates and recidivism. Preventing the crime in the first place would make us all better off. So get rid of these rediculous gun control laws and write laws that: make sense, provide for the greatest amount of freedom for LAC, and prevent gun related crime where possible.\n\n \n \n Sounds fair enough.\n I would be interested in knowing which laws you would do away with,and the new laws that you would put in place.", 
   {}, 
   41671, 
   null, 
   1080704340.0
  ], 
  [
   41823, 
   null, 
   "sundowner", 
   "Sounds fair enough.\n I would be interested in knowing which laws you would do away with,and the new laws that you would put in place.\n\n \n I think I mentioned these to you on another thread, but I did leave out a few, so for the benefit of those reading, I will give it a shot. \n \n Laws I support\n 1. I think most of us can agree that laws stating that using a gun while committing a criminal act should be punished in a more harsh manner than crimes without guns...this goes without saying. These are the kind of laws that add time to sentences for crimes in which a gun is used. These laws are simple common sense type things...but for the sake of use in the legal system, they stay. \n \n 2. Background checks that utilize state, federal, and even international criminal databases. These background checks will be preformed at the time of the purchase, and must be complete within 24 hours from the time that the information enters the system. The gun may only be issued after completion of the background check. Records are sealed and sent to a seperate database, only to be opened with court order during criminal investigation. Records may not be used to identify any gun user unless it involves a criminal investigation. Disqualifiers are: Prior felony offense (any...not limited by time), any other violent crime, history of mental illness, pending criminal charges. Also, a ballistic fingerprint of every rifled firearm taken, and sealed with the records, and only accessed within the confines of a criminal investigation with a court order. \n \n 3. Gun free schools, federal buildings, and aircraft. (other private property at owner/operators discretion) If an area is to be a gun free zone, it must be posted clearly at all points of entry. Penalties for committing a crime with a gun in the gun free zone are automatically double from what they would be elsewhere for the same crime. Possessing a gun unlawfully in the gun free zone is a felony. All points of entry to said property must be secured properly, and allow for expeditious and effective screening for guns and other weapons not deemed appropriate. The gun free zone is limited to on property, not so called \"within so many feet\" laws. \n \n 4. Mandatory proof of firearms safety training from any approved source...ie NRA, state/local police course, etc. This would not be a shooting clinic, only designed to provide the gun purchaser with basic safety information about firearm use, storage, maintanence, and firearms courtesy. Program would be no more than 6 hours, and readily available to all citizens at no charge.\n \n 5. Mandatory proof of marksmanship training and proficiency for those applying for a concealed carry permit. (Permits legal in all states, cities, and DC) I know that this would ruffle some feathers, but IMO, if you want to carry a gun on your person and be able to use it if needed for defence (potentially in crowded situations), you should be trained and accurate with it. Again, training programs readily available to all citizens at no charge.\n \n Laws I do not support (either current or proposed)\n \n Limits on number of firearms that may be owned, ban on assault weapons, ban on certain types of ammunition, limits on magazine capacity, ability for an entire municipality to declare itself gun free, registration of gun owners, and any other laws that do nothing to prevent or discourage gun related crimes. \n \n I am sure that there would be others for both sides, but this is my general platform on gun laws. Also, prior to writing these gun laws, a complete and modern interpretation of the 2nd amendment would be done by the US supreme court, and a new amendment written if deemed needed. (Amendment must fit within the scope of the laws above)", 
   {}, 
   41766, 
   null, 
   1080755340.0
  ], 
  [
   42252, 
   null, 
   "WMart", 
   "Laws I support\n 1. I think most of us can agree that laws stating that using a gun while committing a criminal act should be punished in a more harsh manner than crimes without guns...this goes without saying. These are the kind of laws that add time to sentences for crimes in which a gun is used. These laws are simple common sense type things...but for the sake of use in the legal system, they stay. \n\n This is not a gun control law. This law punishes a person for using a gun illegally. As with the laws that punish people for the abuse of the 1st amend. Laws as these do not limit a right. These laws punish a person for using a right to harm a person. \n \n2. Background checks that utilize state, federal, and even international criminal databases. These background checks will be preformed at the time of the purchase, and must be complete within 24 hours from the time that the information enters the system. The gun may only be issued after completion of the background check. Records are sealed and sent to a seperate database, only to be opened with court order during criminal investigation. Records may not be used to identify any gun user unless it involves a criminal investigation. Disqualifiers are: Prior felony offense (any...not limited by time), any other violent crime, history of mental illness, pending criminal charges. Also, a ballistic fingerprint of every rifled firearm taken, and sealed with the records, and only accessed within the confines of a criminal investigation with a court order. \n \n What other right makes a citizen wait 24 hours before they can exercise it? As for keeping guns from criminals. Since a law enforcement officer does not do the background check at the store but a citizen, i.e., the gun dealer does perform the background check. Does this gun dealer make the arrest when the background check notifies the gun dealer that a felon is attempting to buy a gun? The gun dealer has no arrest powers. Is it the gun dealers job do enforce laws? This can be compared to people driving. Is it the job of normal citizens to enforce laws?\n \n3. Gun free schools, federal buildings, and aircraft. (other private property at owner/operators discretion) If an area is to be a gun free zone, it must be posted clearly at all points of entry. Penalties for committing a crime with a gun in the gun free zone are automatically double from what they would be elsewhere for the same crime. Possessing a gun unlawfully in the gun free zone is a felony. All points of entry to said property must be secured properly, and allow for expeditious and effective screening for guns and other weapons not deemed appropriate. The gun free zone is limited to on property, not so called \"within so many feet\" laws. \n\n Sure whatever, what has happened to the people that have been arrested for having guns in these gun free zones? Give us some stats to defend your claim! If you have stats to defend your claim guess what this will do. Prove that criminals do not obey the laws pertaining to gun free zones! \n \n4. Mandatory proof of firearms safety training from any approved source...ie NRA, state/local police course, etc. This would not be a shooting clinic, only designed to provide the gun purchaser with basic safety information about firearm use, storage, maintanence, and firearms courtesy. Program would be no more than 6 hours, and readily available to all citizens at no charge.\n\n Mandatory proof of what? Where does the government provide a place for the law-abiding citizen to use a gun? Gun ranges? Sure there the government can demand that people meet certain requirements at government provided gun rangers to operate guns. If you are going to use the car analogy do people drive cars in their homes?\n \n5. Mandatory proof of marksmanship training and proficiency for those applying for a concealed carry permit. (Permits legal in all states, cities, and DC) I know that this would ruffle some feathers, but IMO, if you want to carry a gun on your person and be able to use it if needed for defence (potentially in crowded situations), you should be trained and accurate with it. Again, training programs readily available to all citizens at no charge.\n\n Check the required marksmanship training of police officers. It is the same for a citizen to get a ccw. What about the states like Alaska and Vermont that require no ccw to carry a gun concealed? Criminals do not obey the law forbidding the carrying of a gun concealed. \n \nLaws I do not support \n\n You do nothing to keep dangerous criminals off of the streets of America. Then again you could careless about keeping dangerous criminals off of the streets of America, all you want to is ban the right to bear arms!", 
   {}, 
   41823, 
   null, 
   1081095240.0
  ], 
  [
   43647, 
   null, 
   "WiseAker", 
   "\"Reasonable regulation?\" Depends on how reasonable. I didn't answer the poll.\n \n If it's reasonable as Kerry defines it NO! He gives the old bull story of being a hunter but not seeing why anyone needs an AK-47. As if the 2nd amendment has ANYTHING to do with hunting. \n \n I'd say the regulations now in place are reasonable. You can have a .50 cal for crying out loud! But those who want to start taking away one type of gun and then another type until we have few if any left can... Well, I can't say. :xcensored \n \n Anyone who votes for Kerry ought to realize he has no idea what the 2nd amendment is about. Or worse and more likely: He understands but couldn't care less.", 
   {
    "post_info": {
     "post_title": "Reasonable?"
    }
   }, 
   39145, 
   null, 
   1081816800.0
  ], 
  [
   43702, 
   null, 
   "Shooterman", 
   "One thing I've never quite figured out, is the why of the post, 'A letter to Mr Heston. Charlton Heston is no longer the president of the NRA. On top of that, he is suffering from Alzheimers disease.", 
   {}, 
   43647, 
   null, 
   1081838520.0
  ], 
  [
   53056, 
   null, 
   "voiceofreason", 
   "One thing I've never quite figured out, is the why of the post, 'A letter to Mr Heston. Charlton Heston is no longer the president of the NRA. On top of that, he is suffering from Alzheimers disease.\n\n You've totally missed the point. The point is that there are numerous scholars who disagree with the NRA's propaganda.", 
   {}, 
   43702, 
   null, 
   1086424440.0
  ], 
  [
   53060, 
   null, 
   "Shooterman", 
   "You've totally missed the point. The point is that there are numerous scholars who disagree with the NRA's propaganda.\n\n \n Please name a few of these scholars, and no, Sarah Brady, doesn't count. Please give their qualifications, and if lawyers or jurists, the Law Reviews they have published in, and a few links to their work. Also, be advised, Arthur E Kellerman is not acceptable either.\n \n Now, if you truly wish to be objective, list a few scholars that do agree with the NRA.\n \n Oh, and in case you've forgotten, you did address this thread to Mr Heston, and my question, as originally stated, stands.", 
   {}, 
   53056, 
   null, 
   1086451260.0
  ], 
  [
   53142, 
   null, 
   "daewoo", 
   "There are nearly fifty (out of the, what, 150,000 college professors we have in this country) listen in the link. \n \n Nearly 50. That is nearly enough to fill a bus, if it is a small bus.", 
   {}, 
   53060, 
   null, 
   1086540840.0
  ], 
  [
   53225, 
   null, 
   "voiceofreason", 
   "There are nearly fifty (out of the, what, 150,000 college professors we have in this country) listen in the link. \n \n Nearly 50. That is nearly enough to fill a bus, if it is a small bus.\n\n You only cited one person's analysis of the language of the second amendment in that other thread.", 
   {}, 
   53142, 
   null, 
   1086628020.0
  ], 
  [
   53284, 
   null, 
   "daewoo", 
   "You only cited one person's analysis of the language of the second amendment in that other thread.\n\n \n I wasn't trying to make some kind of point about how many scholars agreed with me. \n \n Realistically, Paul Finkleman and Tom Diaz are the best the anti gunners have to offer, and that's not saying a whole lot. Bellesiles was headed for the list, until he was proven to be a complete fraud. Now even finkleman won't quote him.", 
   {}, 
   53225, 
   null, 
   1086682680.0
  ], 
  [
   59090, 
   null, 
   "jefnvk", 
   "I support reasonable gun laws. But my reasonable is completly different. my reasonable: Convicted Felons and Mentally incapable, and non-citizens of the United States.\n \n Felons: These are people that would have been convicted of a felony 100 years ago. None of this 'he drove over some pigeons on purpose' ****, or corportae criminals. Murderers, rapist, and such. Violent contact felonies.\n \n Mentally Incapable: Deemed by a judge, jury and doctors incapable or a hazard to themselves or others.\n \n Non-citizens: Don't have background records on them\n \n After that, everyone should own a gun.\n \n Edit: whats up with the stars? I used a non-harsh word for a reason", 
   {}, 
   53284, 
   null, 
   1090368960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A Letter to Mr. Heston", 
  "url": "http://www.4forums.com/political/gun-control-debates/1925-letter-mr-heston.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 1925, 
  "discussion_files": [
   [
    "21171.html", 
    "http://www.4forums.com/political/gun-control-debates/1925-letter-mr-heston-print.html"
   ], 
   [
    "21172.html", 
    "http://www.4forums.com/political/gun-control-debates/1925-letter-mr-heston-2-print.html"
   ]
  ], 
  "identifier": 1925
 }
]