[
 [
  [
   39526, 
   null, 
   "syklopps61", 
   "The people of Spain have shown that they too have no spine, just like the French and Germans. The Socialist party wasn't even on the radar last week, and now they have swept into power. There is but one reason for this-the Spanish cowered in fear after the terrorist bombings there, and their plea for mercy was manifested by the election of people who share their same lack of spine. Now, sit back and watch other democracies (including ours) have their elections influenced by the terrorists, and when it happens, remember to thank the Spanish", 
   {
    "post_info": {
     "post_title": "Thanks alot Spain..for nothing"
    }
   }, 
   null, 
   null, 
   1079373540.0
  ], 
  [
   39528, 
   null, 
   "Phunting", 
   "I hardly think America can preach against reactionary attitudes to terrorism just because the said reactions are different.\n \n And just how will the Spanish be to blame for US election being influenced by terrorists? Somehow I can't see many Americans voting against coalition supporters 'because the Spanish did'.", 
   {}, 
   39526, 
   null, 
   1079374140.0
  ], 
  [
   39533, 
   null, 
   "fracas", 
   "1300 troops won't make a difference with iraq. there are 1500 marines in haiti that can easily be redeployed once the UN forces gather.\n \n the real tragedy is be whether the terrorists take advantage of this. it won't matter to them that Zapatero election platform included bringing the troops home. all it will matter is the lesson that 1) killing 200 people gets results and 2) manipulating a major western democratic electoral process.\n sadly, not only will al qaeda learn this lesson, but so will ETA and every other 2 bits terrorists wanna be in Europe.\n \n I would not travel to Europe anytime soon.", 
   {}, 
   39528, 
   null, 
   1079376120.0
  ], 
  [
   39535, 
   null, 
   "syklopps61", 
   "And just how will the Spanish be to blame for US election being influenced by terrorists\n\n \n Seems obvious to me, they have shown the terrorists that their methods CAN work", 
   {}, 
   39528, 
   null, 
   1079377860.0
  ], 
  [
   39536, 
   null, 
   "syklopps61", 
   "1300 troops won't make a difference with iraq. \n \n \n It's not the number that is important, it's the support, it's the message to the terrorists that there are others that are willing to fight back as well\n \n \nthe real tragedy is be whether the terrorists take advantage of this. \n \n \n WHETHER? Try WHEN, this was a huge victory for them. The American people (rather Liberals) are weak minded-when they see that other countries run, the heat placed on Bush to do likewise will be intensified. Frankly, I've never given much credit to the terrorists for being all that smart, but THIS was-like dominoes, all these smaller countries supporting us very well may weaken when they are attacked, and in such a way, by getting to the weak willed Americans (Liberals), we could very well lose this war.", 
   {}, 
   39533, 
   null, 
   1079378220.0
  ], 
  [
   39539, 
   null, 
   "fracas", 
   "i think the Spaniards are making a mistake. But its their democracy and they will either reapt the benefits of their decision, or suffer for it. I am not going to condemn their choices, regardless whether i think it is a good choice or not.", 
   {}, 
   39536, 
   null, 
   1079380800.0
  ], 
  [
   39542, 
   null, 
   "daewoo", 
   "Did it really not occur to you people that this was likely to happen? It is one thing to support another country when you are talking about sending less than 1500 support troops across the world. It is entirely another to support another country when you are taking civilian casualties at home.", 
   {}, 
   39536, 
   null, 
   1079383860.0
  ], 
  [
   39545, 
   null, 
   "fracas", 
   "Did it really not occur to you people that this was likely to happen? It is one thing to support another country when you are talking about sending less than 1500 support troops across the world. It is entirely another to support another country when you are taking civilian casualties at home.\n\n \n if you see it as a US war vs terrorism, then sure.\n \n but terrorism is a blight on mankind in general, and civilized men in particular. this has never been a war against arabs or islam. it is against the likes of bin laden who exploit the discontentment of arab disenfranchizement and pervert it with violence for violence and terror's sake.\n \n i doubt the killing will stop in spain or europe because of spain's choices. if i were a terrorist i would be emboldened to do more acts, whether i am al qaeda or not. kill a few hundreds, change an election to get what you want. if it worked once, it will again. for al qaeda in particular the second lesson is divide and conquer.\n \n but everyone has a right to make mistakes.", 
   {}, 
   39542, 
   null, 
   1079386080.0
  ], 
  [
   39549, 
   null, 
   "AMD4EVER", 
   "Without question the Spanish have let the terrorists see just how much influence they can have. The terrorists learned nothing but defeat after they attacked the US in having Afghanistan and the Taliban leadership fall and then Iraq go as well. If all acts of terrorism were followed up in such a way the very idea of terrorism would be foolish to consider as it would only hurt the terrorist cause in the end. The Spanish however have shown that the terrorists are going to be able to make a fine living attacking European countries and others who are likeminded. They have shown that the will of the people bow to them if they cause enough destruction. This is exactly the wrong message to send the terrorists as it will only bring more terrorist acts. I would suspect that the next major terrorist attack will occur on their side of the Atlantic because they have now proven themselves to be easy targets.", 
   {}, 
   39545, 
   null, 
   1079388240.0
  ], 
  [
   39551, 
   null, 
   "jitobear", 
   "My understanding is that the Spanish people were already 90% opposed to the war before this happened anyway. Of course this will have an impact on the voting there. \n \n But to condemn them is insane.\n \n Spain is not a country like the US. They don't have the same military might or resources. They deal with internal terrorism already and the fact that at least two parts of Spain want indepence. They are still healing from being under a dictator's foot for nearly half of the last century - socialism is about 180 from Franco as you can get. I am not surprised at all.\n \n And I HATE - just HATE the idea that the rest of the world owes the US some sort of autimatic allegiance anyway. They don't have to jump on our band-wagon. It's their own people they need to be accountable to.\n \n And quite frankly I'm not comfortable with all of Bush' tactics. This isn't a movie and he has behaved like a cowboy in a B western.", 
   {}, 
   39549, 
   null, 
   1079389620.0
  ], 
  [
   39567, 
   null, 
   "daewoo", 
   "if you see it as a US war vs terrorism, then sure\n.\n \n \n Al Queda, and Bin Ladens stated goal in the destruction of the united states. The Al Queda problem is a US problem, and is becoming a problem for those countries that support the US in our \"war on terror\".\n \n Look at who Al Queda has attacked. I don;t see france or Germany or Russia on their sh*$# list. This is because these countries are not supporting the US in our war. \n \n \nbut terrorism is a blight on mankind in general, and civilized men in particular. this has never been a war against arabs or islam. it is against the likes of bin laden who exploit the discontentment of arab disenfranchizement and pervert it with violence for violence and terror's sake.\n\n \n Did you C&P this directly form a Bush speech? The majority of the world is unaffected by terrorism. THe US didn't step up to combat this \"blight on mankind in general, and civilized men in particular\" until we were attacked on our own soil. Why should we expect other countries with no real stake in the game to do what we would not?\n \n \ni doubt the killing will stop in spain or europe because of spain's choices. if i were a terrorist i would be emboldened to do more acts, whether i am al qaeda or not. kill a few hundreds, change an election to get what you want. if it worked once, it will again. for al qaeda in particular the second lesson is divide and conquer.\n\n \n I would be willing to bet that Al Queda does not attack spain again. There would be no point. While the goal of terrorism is to terrorise, it is NOT to create random terror, nor is it \"violence for violence and terror's sake\". The terrorism we see is a focused set of attaqcks in an attempt to achieve a stated set of goals. Spain has effectively removed itself from the conflict. Further attacks by Al Queda would be pointless, and I seriously doubt they would waste the manpower and resources to carry them out.\n \n As far as the rest of europe, I think we can expect to see more attacks. Those who have alinged themselves with the US and entered themselves ito the game are goin to have to face the consequences of that decision. I am not saying they were wrong to side with the US, just that there will be consequences for their actions (as there are consequences for every action).\n \n \nbut everyone has a right to make mistakes.\n\n \n \n In this case, the mistake might have been for the government of spain to disregard such powerful anti-war sentiment in their country. Had they not supported the war and still been attacked, I think that spaniards would have rallied round their government rather than voting them out of office. Rulers in a democratic society are bound by the wishes of their constituency. For the government of Spain to support the US in Iraq despite the overwhelming public sentiment against such an action was WRONG. \n \n \n \nMy understanding is that the Spanish people were already 90% opposed to the war before this happened anyway. Of course this will have an impact on the voting there. \n \n \n The numbers I saw said 92%. We can use yours, though, makes no difference to me.\n \n \nSpain is not a country like the US. They don't have the same military might or resources. They deal with internal terrorism already and the fact that at least two parts of Spain want indepence. They are still healing from being under a dictator's foot for nearly half of the last century - socialism is about 180 from Franco as you can get. I am not surprised at all.\n\n \n \n Excellent point. I think that theri internal problems probably had a lot to do with their recent election. These are folks who have seen plenty of domestic terrorism, and I don't think they were keen to take a bigger bite out of the terroist pie.\n \n \nAnd I HATE - just HATE the idea that the rest of the world owes the US some sort of autimatic allegiance anyway. They don't have to jump on our band-wagon. It's their own people they need to be accountable to.\n\n \n This is something a lot of Americans have trouble accepting. To a large part of the world, America is not always considered the guys fighting for peace and justice and girl scout cookies and moms apple pie. The leaders of other democratic nations are slaves tot heir people, just like our elected leaders should be. IT fhtye do not act as such, there is the very real possibility that they will not be re-elected, and the next round of leaders will not be so pro US.", 
   {}, 
   39545, 
   null, 
   1079399760.0
  ], 
  [
   39579, 
   null, 
   "fracas", 
   "the majority of the world is indeed unaffected by terrorism by al qaeda\n \n first it was only the US\n then morroco\n saudi arabia\n indonesia\n turkey\n and now spain\n \n funny how the list grows\n even including vocal opponent of the war like turkey\n \n \n to think al qaeda will stop after the US is taken out is naive\n similar to thinking Hitler would stop with just the sudentenland.\n emoticon_rolleyes\n \n spain will be attacked again because al qaeda has won a battle there. it would be foolish not to exploit a victory, and also not apply it elsewhere.\n to think that anyone willing to kill 200 innocents (afterall, they could have bombed parliament or a military installation) could be assuaged with aquiessence and yielding to demands would be sated is to assume they are reasonable people to begin with. a foolish notion. and yes, they attack spain not because spain was so important to the war (1300 troops in iraq is barely 1% ) but because they could. so they will again.\n \n like it or not, like Bush or not, Al qaeda started this war. with or without iraq. and it will continue to be waged, whether bush remain in office or not, whether spain remains standing or not.\n \n \n if you don't do something when they come for your neighbor\n who will act when they come for you?", 
   {}, 
   39567, 
   null, 
   1079405040.0
  ], 
  [
   39583, 
   null, 
   "daewoo", 
   "the majority of the world is indeed unaffected by terrorism by al qaeda\n \n first it was only the US\n then morroco\n saudi arabia\n indonesia\n turkey\n and now spain\n \n funny how the list grows\n even including vocal opponent of the war like turkey\n\n \n Yep, all countries that have supported America. Even the ones that have not oind the \"coalition of the willing\" have been supportive of America in our war. The attack in turkey came after turkey agreed to allow the US use of a base there during hte attacks on Iraq. Yep, the list grows, and will most likely continue to.\n \n \nto think al qaeda will stop after the US is taken out is naive\n similar to thinking Hitler would stop with just the sudentenland.\n emoticon_rolleyes\n\n \n Uh Huh, because Al Queda is obviosly an empire hungry military superpower, jus like germany was. This is one of the most rediculous comparisons I have seen to date. Definatly a \"top tenner\"\n \n \n \nspain will be attacked again because al qaeda has won a battle there. it would be foolish not to exploit a victory, and also not apply it elsewhere.\n to think that anyone willing to kill 200 innocents (afterall, they could have bombed parliament or a military installation) could be assuaged with aquiessence and yielding to demands would be sated is to assume they are reasonable people to begin with. a foolish notion. and yes, they attack spain not because spain was so important to the war (1300 troops in iraq is barely 1% ) but because they could. so they will again.\n\n \n What exactly would be the point of further attack on Spain? I suppose it could be argued that they may wish to drive home the point that their enemies will be dealt with harshly, but considering the wide array of new enimies Al Queda seems to have, it would seem foolish to waste further resources now that Spain has absconded from the coalition? \n \n \nlike it or not, like Bush or not, Al qaeda started this war. with or without iraq. and it will continue to be waged, whether bush remain in office or not, whether spain remains standing or not.\n\n \n Of course, that would depend on when you percieve the war as having started. I'm not sure how Bush staying in office is pertinent to the arguent at hand. I am a little uncertain as to how who stated the war even comes into play here. I was under the impression we were discussing the likely fallout of Spains rection to the recent attacks there, with a little side debate regarding whether Al Queda is primarily an american problem or an international problem.\n \n \n \nif you don't do something when they come for your neighbor\n who will act when they come for you?\n\n \n If my neighbor was guilty of years of crappy foreign relations and propping up tyrannical dictatorships in order to stabilise his oil supply, perhapse I wouldn;t mind if they came for him.", 
   {}, 
   39579, 
   null, 
   1079407800.0
  ], 
  [
   39584, 
   null, 
   "syklopps61", 
   "My understanding is that the Spanish people were already 90% opposed to the war before this happened anyway. Of course this will have an impact on the voting there. \n \n \n And it's my understanding that prior to the terrorist attacks, many of those 90% plus still supported the government, then suddenly after the attacks, they didn't. Sounds to me like they just wussed out\n \n \nAnd I HATE - just HATE the idea that the rest of the world owes the US some sort of autimatic allegiance anyway. They don't have to jump on our band-wagon. It's their own people they need to be accountable to.\n\n \n I bet you do! I personally feel that the rest of the world should kiss our feet. What would you say if the U.S. withheld all of the humanitarian aid we provide to all these other countries? We certainly have no obligation, right? We are accountable to our own people, right? Frankly they OWE us because of the aid we provide, if not for other reasons. \n \n \nAnd quite frankly I'm not comfortable with all of Bush' tactics. This isn't a movie and he has behaved like a cowboy in a B western.\n\n \n You must be John Kerry incognito!! What \"tactics\" are so bad in your eyes, anyway?\n \n [QUOTE]Look at who Al Queda has attacked. I don;t see france or Germany or Russia on their sh*$# list. This is because these countries are not supporting the US in our war. [/QUOTE\n \n They haven't been attacked because those countries are too scared to get involved-basically they have given in to strong arm tactics. Let's cut the **** and tell it like it is-do any of you REALLY think that any other country in the world has a chance of defeating terrorism, other than the U.S.? Of course not, as we go, so goes the world. If we are defeated, who can stop the terrorists from taking complete control. So of course we are the targets. We did nothing to provoke the attacks on 9-11, yet they still happened. Whether anyone wants to admit it or not, this is the modern day crusades, and the one obstacle to Islam winning is the U.S.", 
   {}, 
   39579, 
   null, 
   1079408400.0
  ], 
  [
   39591, 
   null, 
   "fracas", 
   "Yep, all countries that have supported America. Even the ones that have not oind the \"coalition of the willing\" have been supportive of America in our war. The attack in turkey came after turkey agreed to allow the US use of a base there during hte attacks on Iraq. Yep, the list grows, and will most likely continue to.\n\n LOL\n and the indonesians supported the war how?\n or what troops were based in saudi arabia?\n and the turks did not allow attacks from turkish bases. look it up.\n \nUh Huh, because Al Queda is obviosly an empire hungry military superpower, jus like germany was. This is one of the most rediculous comparisons I have seen to date. Definatly a \"top tenner\"\n\n lame if you didn't get it. so i'll repeat it without analogies.\n anyone who intentionally kill civilians do not think like reasonable men. they do it for the power they aquire in the acts. to demonstrate their acts successful empowers them. and empowered they will use that same power for more acts of violence. get it? emoticon_rolleyes\n \nWhat exactly would be the point of further attack on Spain? I suppose it could be argued that they may wish to drive home the point that their enemies will be dealt with harshly, but considering the wide array of new enimies Al Queda seems to have, it would seem foolish to waste further resources now that Spain has absconded from the coalition? \n\n read the news again. Spain say they will pull out if the UN isn't more involved. thus for the sin of slow actions they must be punished! you realize that the only sin the Spaniards incurred was a vocal support, as they did not contributed to the invading force, and 1300 troops out of 130,000 in occupation. al qaeda attacked for a 1% factor! what make you think that a 0.1% won't make them attack, or just a vocal expression of solidarity?\n besides, if al qaeda won't attack, ETA could as well. they had already planned bombing of train stations. or do you not read the news? fortunately, these previous attempts have been foiled before it happened. but now that they see the political success Al Qaeda had, they will ask themselves why not them as well? why not kill a few hundreds and enjoy infamy and political success? sure they have been stopped, but obviously the security net is leaky, witness 311.\n \nOf course, that would depend on when you percieve the war as having started. I'm not sure how Bush staying in office is pertinent to the arguent at hand. I am a little uncertain as to how who stated the war even comes into play here. I was under the impression we were discussing the likely fallout of Spains rection to the recent attacks there, with a little side debate regarding whether Al Queda is primarily an american problem or an international problem.\n\n the question is pertinent. would al qaeda have attacked spain if spain not supported the US? spain is just a battleground. the rest of europe, including spain, will be attacked. but you are right in that it doesn't matter so much who started it, it matters more who will win it.\n \nIf my neighbor was guilty of years of crappy foreign relations and propping up tyrannical dictatorships in order to stabilise his oil supply, perhapse I wouldn;t mind if they came for him.\n\n yes, your neighbor has sinned.\n and you are free of sin then?\n it is morally bankrupt to side with indiscriminate killers over foolish thieves.\n and equally foolish to think those who have enjoyed the power of killing will cease because innocence. ask the dead of 911 and 311 whether they were guilty or innocent.\n lets hope your \"innocence\" shield you from harm. emoticon_rolleyes\n \n morally bankrupt.", 
   {}, 
   39583, 
   null, 
   1079410800.0
  ], 
  [
   39603, 
   null, 
   "daewoo", 
   "LOL\n and the indonesians supported the war how?\n or what troops were based in saudi arabia?\n and the turks did not allow attacks from turkish bases. look it up.\n\n \n Indonesia has had its own problems with muslim extremists, and the US has done quite a bit to support them in their struggle with them. \n \n There were no troops stationed in Saudi Arabia. Just because we didn't have a large military presence there doesn't mean they didn't support us, and they publicly announced their support on several occasions.\n \n YOu are right, the turks didn;t allow attacks from turkish bases. Initially they were going to allow S&R activities from those bases, then they withdrew that allowance after the terrorist attacks. They did continue to allow overflight by US planes and Tomahawk missiles until too many of them crashed. LOOK IT UP\n \n \nlame if you didn't get it. so i'll repeat it without analogies.\n anyone who intentionally kill civilians do not think like reasonable men. they do it for the power they aquire in the acts. to demonstrate their acts successful empowers them. and empowered they will use that same power for more acts of violence. get it? emoticon_rolleyes\n\n \n I do get the analogy you were trying to make, it was simply a pathetic analogy with no basis in reality or demonstratable relevance to the current situation. \n \n You really think that the whole campaign is about terror for hte sake of power? IF that was the case, it would seem like they would be less selective in the targets they chose, and why bother releasing all those tapes talkign abot their goals?\n \n \nread the news again. Spain say they will pull out if the UN isn't more involved. thus for the sin of slow actions they must be punished! you realize that the only sin the Spaniards incurred was a vocal support, as they did not contributed to the invading force, and 1300 troops out of 130,000 in occupation. al qaeda attacked for a 1% factor! what make you think that a 0.1% won't make them attack, or just a vocal expression of solidarity?\n besides, if al qaeda won't attack, ETA could as well. they had already planned bombing of train stations. or do you not read the news? fortunately, these previous attempts have been foiled before it happened. but now that they see the political success Al Qaeda had, they will ask themselves why not them as well? why not kill a few hundreds and enjoy infamy and political success? sure they have been stopped, but obviously the security net is leaky, witness 311.\n\n \n Spain was an important ally not becasue of the number of troops they provided (none of the coalition provided troops in numbers anywhere near what the US did). Spain was an important ally because they were one of the few industrilaised/1st world nations in our coalition.\n \n \nthe question is pertinent. would al qaeda have attacked spain if spain not supported the US? spain is just a battleground. the rest of europe, including spain, will be attacked. but you are right in that it doesn't matter so much who started it, it matters more who will win it.\n\n \n Then why did they not pick an easier target? Spain has anti-terrroism forces in place. THey are used to dealing with this kind of thing. IF it was ust a matter of hitting a Eurpean target, why not lichtenstein? Security is next to nothing, police are almost non-existant. Why not Germany? They also have more lax security tan Spain, and higher profile targets.\n \n Your ascertations do not stand up to evidetiary scrutiny.\n \n \nyes, your neighbor has sinned.\n and you are free of sin then?\n it is morally bankrupt to side with indiscriminate killers over foolish thieves.\n and equally foolish to think those who have enjoyed the power of killing will cease because innocence. ask the dead of 911 and 311 whether they were guilty or innocent.\n lets hope your \"innocence\" shield you from harm. emoticon_rolleyes\n\n \n It is inexcusably foolish to believe that those who would go to the ttime and trouble of attacking America and our allies do so for no reason. Do you honestly believe that the 9-11 hiackers got on those planes knowing they were going to die without any cause? Until we accept the fact that these people have a grievance with the untied states and our allies, we will continue to fight the war on terror, and continue to loose. You cannot fight a \"War on terror\" and win. The british proved this pretty suessfully in northern ireland. \n \n \nmorally bankrupt.\n\n \n \n If morally bankrupt means believing that people must take responsibility for their actions and nations should put the welfare of their people first, then I wear that badge with honor.\n \n To me, morally bankrupt in this context would be more along the lines of closing your eyes to what is going on and instead blindly following the propoganda of your government without analysing it for yourself.\n \n YOu seem to have this misconception that I support the terrorists in their atacks. I do not. You seem to have a problem with assinging motives to other peoples statements. You also seem to have a major problem with anybody who has anything negative or critical to say of the American government. That, my friend, is fascism.\n \n \n \n \nThey haven't been attacked because those countries are too scared to get involved-basically they have given in to strong arm tactics. Let's cut the **** and tell it like it is-do any of you REALLY think that any other country in the world has a chance of defeating terrorism, other than the U.S.? Of course not, as we go, so goes the world. If we are defeated, who can stop the terrorists from taking complete control. So of course we are the targets. We did nothing to provoke the attacks on 9-11, yet they still happened. Whether anyone wants to admit it or not, this is the modern day crusades, and the one obstacle to Islam winning is the U.S.\n\n \n I don't think any other country in the world has the problems with terrorism that the US has. Al Queda is the largest terrorist network ever, and their sole stated goal is to destroy the USA. IF we are defeated, the terrorists will more than likely go home and enoy living in the middle east wihtout western intervention. OF course, they will most likely overthrow the opressive regime in Saudi Arabia (you know, the one we have been propping up) and take back israel (that other criminal regime we have been propping up).\n \n YOu really believe there was nothing to incte the terrorists to attack te US? HAve you ever read a history book? HAve you ever taken a serious look at US foreign policy where it regards the middle east? Perhapse you should. Te terrorists are definatly in the wrong, but to claim their attacks were entirely unprovoked is crazy talk!\n \n You seem to think we can \"win\" the war on terror. How exactly does one go about combatting an enemy that is dispersed throughtout the entire world and operates cladestinely?", 
   {}, 
   39591, 
   null, 
   1079417160.0
  ], 
  [
   39609, 
   null, 
   "fracas", 
   "You really think that the whole campaign is about terror for hte sake of power? IF that was the case, it would seem like they would be less selective in the targets they chose, and why bother releasing all those tapes talkign abot their goals?\n\n don't tell me you believe that bin laden is noble and fighting a just cause by targetting civillians instead of military/political targets?\n \nSpain was an important ally not becasue of the number of troops they provided (none of the coalition provided troops in numbers anywhere near what the US did). Spain was an important ally because they were one of the few industrilaised/1st world nations in our coalition.\n\n so as a western industrialized power even if they pull out of iraq they would remain a western power lending their efforts against terrorism. they will remain a target.\n \nThen why did they not pick an easier target? Spain has anti-terrroism forces in place. THey are used to dealing with this kind of thing. IF it was ust a matter of hitting a Eurpean target, why not lichtenstein? Security is next to nothing, police are almost non-existant. Why not Germany? They also have more lax security tan Spain, and higher profile targets.\n\n not sure where you came from or going with this as a response to my quoted passage but hey, whatever. they pick spain because spain was an ally and was about to hold election. and because spain is relatively resurgent on the international stage, their resolve questionable. lichenstein is a nobody. germany had already lost resolve. (actually german security higher)\n \nYour ascertations do not stand up to evidetiary scrutiny.\n\n what scrutiny have you put forth?\n i countered your assertion the countries attacked were allies against iraq and you basically agreed.\n then i countered that spain was attack merely because they are an ally, not because their contribution to the war and you basically said the same now.\n better understand the words and not just use them indiscriminately.\n \nIt is inexcusably foolish to believe that those who would go to the ttime and trouble of attacking America and our allies do so for no reason. Do you honestly believe that the 9-11 hiackers got on those planes knowing they were going to die without any cause? Until we accept the fact that these people have a grievance with the untied states and our allies, we will continue to fight the war on terror, and continue to loose. You cannot fight a \"War on terror\" and win. The british proved this pretty suessfully in northern ireland. \n\n ofcourse they have reasons. never said otherwise.\n read history of revolutions and insurgencies. inevitably many who fought and risked their lives for the \"cause\" come to discover the \"cause\" not the same for those who lead and gain power as those who fought and died for them.\n \nIf morally bankrupt means believing that people must take responsibility for their actions and nations should put the welfare of their people first, then I wear that badge with honor.\n\n To me, morally bankrupt in this context would be more along the lines of closing your eyes to what is going on and instead blindly following the propoganda of your government without analysing it for yourself.[/quote]\n no, it is morally bankrupt to think that your innocence will protect those who seek power through violence, as your neighbor is taken away.\n it is perfectly reasonable to dissent. but to dissent while it is safe to do so, but not when your life, property, or liberty is at risk is morally bankrupt.\n \nYOu seem to have this misconception that I support the terrorists in their atacks. I do not. You seem to have a problem with assinging motives to other peoples statements. You also seem to have a major problem with anybody who has anything negative or critical to say of the American government. That, my friend, is fascism.\n\n being critical is not being a fascist. if so you too are a fascist.\n funny that you don't understand that. \n \nMerriam-Webster \n Main Entry: fas·cism \n Pronunciation: 'fa-\"shi-z&m also 'fa-\"si-\n Function: noun\n Etymology: Italian fascismo, from fascio bundle, fasces, group, from Latin fascis bundle & fasces fasces\n 1 often capitalized : a political philosophy, movement, or regime (as that of the Fascisti) that exalts nation and often race above the individual and that stands for a centralized autocratic government headed by a dictatorial leader, severe economic and social regimentation, and forcible suppression of opposition\n 2 : a tendency toward or actual exercise of strong autocratic or dictatorial control <early instances of army fascism and brutality -- J. W. Aldridge<\n \n\n since i am neither the government of have forcibly suppressed your viewpoints how am i a fascist? emoticon_rolleyes\n \nI don't think any other country in the world has the problems with terrorism that the US has. Al Queda is the largest terrorist network ever, and their sole stated goal is to destroy the USA. IF we are defeated, the terrorists will more than likely go home and enoy living in the middle east wihtout western intervention. OF course, they will most likely overthrow the opressive regime in Saudi Arabia (you know, the one we have been propping up) and take back israel (that other criminal regime we have been propping up).\n \n YOu really believe there was nothing to incte the terrorists to attack te US? HAve you ever read a history book? HAve you ever taken a serious look at US foreign policy where it regards the middle east? Perhapse you should. Te terrorists are definatly in the wrong, but to claim their attacks were entirely unprovoked is crazy talk!\n \n You seem to think we can \"win\" the war on terror. How exactly does one go about combatting an enemy that is dispersed throughtout the entire world and operates cladestinely?\n\n terrorism is quite new to the US.\n giving in to them only empowers them, not bring peace.", 
   {}, 
   39603, 
   null, 
   1079421060.0
  ], 
  [
   39611, 
   null, 
   "theLIBERTARIAN", 
   " ...kill a few hundreds, change an election to get what you want. \n\n \n Do you think the purpose of the terrorist attack was to influence the Spanish? \n \n Next, do you think the purpose of terrorism is change public policy?", 
   {
    "unicode_changes_made": true
   }, 
   39545, 
   null, 
   1079432760.0
  ], 
  [
   39626, 
   null, 
   "Phunting", 
   "I personally feel that the rest of the world should kiss our feet. \n\n And people wonder why other nations think the US is arrogant and full of itself.\n \n \n \nWhat would you say if the U.S. withheld all of the humanitarian aid we provide to all these other countries? \n The US provides one of the lowest ammounts of proportional aid of any developed country. And anyway just what aid was provided to Spain for them to owe any obligation?\n \n \n \nso as a western industrialized power even if they pull out of iraq they would remain a western power lending their efforts against terrorism. they will remain a target.\n\n I disagree. Whilst they do technically remain an enemy, I no longer think they are a target. I'm sure the goal of the bombing was to shake the US' support globally. Having done this in Spain there would be no reason to continue there.\n \n \n \nThe british proved this pretty suessfully in northern ireland.\n\n And quite how was that?", 
   {}, 
   39584, 
   null, 
   1079443560.0
  ], 
  [
   39635, 
   null, 
   "fracas", 
   "Do you think the purpose of the terrorist attack was to influence the Spanish? \n \n Next, do you think the purpose of terrorism is change public policy?\n\n \n yes. the timing suggest that it wasn't just an act of punishment. it was a good strategic move on al qaeda's part.\n before 311 Zapatero declare he would bring the spanish troops home. everyone knew this, including al qaeda. but he wasn't expected to win. so kill a few hundreds and change the election outcome. zapatero wins, spanish troops are recalled. al qaeda co-opted zapatero's platform (used him if you will) and declare themselves winner. winner for the act of viollence, winner for changing an major western power outcome, winner for weakening the coalition, winning for having spanish troops recalled. it doesn't matter whose idea it was originally to recall the spanish troops. it only matter if they can use it to their benefits. they are not stupid.\n if it was an act of punishment it could have come after the election.\n \n \n @Phunting\n \n spain was attacked because it was easier than the US. you go where the easy kill is.\n why is crime higher in the ghetto? everyone knows there is no money or wealth there. it happens in the ghetto because it is easier to commit crimes there.\n why attack spain again? because they could once already. because they were successful politically in doing so.\n who here thinks it is reasonable to kill 200 civilians because their government sent peace keeping troops after the war, and morally sided with the US leading up to the war?\n to those that think it is not reasonable, then why would the terrorist, having shown they are unreasonable, now do the reasonable thing and not attack spain again.\n and to those that think it was reasonable, then success leads to repetition.", 
   {}, 
   39611, 
   null, 
   1079450520.0
  ], 
  [
   39636, 
   null, 
   "Phunting", 
   "@Fracas\n \n I totally agree with the first half of your post.\n \n I don't personally think that the terrorists will strike Spain again any time soon. In fact their best way to capitalise on the attack would be to leave them alone, and attack a different ally to tempt them to back down as well. If they were to continue to attack Spain this would only show that there is no way to avoid attack and therefore strengthen resolve against the terrorists.", 
   {}, 
   39635, 
   null, 
   1079451240.0
  ], 
  [
   39639, 
   null, 
   "fracas", 
   "I don't personally think that the terrorists will strike Spain again any time soon. In fact their best way to capitalise on the attack would be to leave them alone, and attack a different ally to tempt them to back down as well. If they were to continue to attack Spain this would only show that there is no way to avoid attack and therefore strengthen resolve against the terrorists.\n\n \n i agree with this. al qaeda will turn elsewhere, for a while. but if elsewhere proves difficult, they will return sooner rather than later.\n there is still ETA, which will be encouraged by al qaeda victory.", 
   {}, 
   39636, 
   null, 
   1079452740.0
  ], 
  [
   39640, 
   null, 
   "Mr Jack", 
   "The Spanish people were against war in Iraq, but their government (like mine) acted undemocratically in taking them in anyway. Now this action has had consequences they have rid themselves of the government taking the action.\n \n That in doing so they have effectively ceeded to the terrorists wishes is rather disturbing, but I am unsure as to its influence.\n \n Spain has a long history with the muslim world, particularly if you go back as far as the crusades (which the terrorists named as a reason for the attack), I suspect this has something to do with why Spain was chosen. To view this as terrorists vs. America is naive and simplistic.", 
   {}, 
   39639, 
   null, 
   1079457060.0
  ], 
  [
   39641, 
   null, 
   "fracas", 
   "the only one who believes it is the US vs terrorism are the spaniards or the euros in general.\n by this thinking if they don't aide the US, then they will be left alone", 
   {}, 
   39640, 
   null, 
   1079457240.0
  ], 
  [
   39653, 
   null, 
   "syklopps61", 
   "IF we are defeated, the terrorists will more than likely go home and enoy living in the middle east wihtout western intervention.\n\n \n Are you really that naive? That's like saying Hitler would have stopped after taking over Europe\n \n \nYOu really believe there was nothing to incte the terrorists to attack te US? HAve you ever read a history book? HAve you ever taken a serious look at US foreign policy where it regards the middle east? Perhapse you should. Te terrorists are definatly in the wrong, but to claim their attacks were entirely unprovoked is crazy talk!\n\n \n Nope, never have, so why don't you enlighten me? Please tell me what awful things we did that would justify 9-11. Is it because we support Israel? So, we have to ask the terrorsist who we can be friends with and who we can't? Is it our culture? Hey, they can control their own culture and keep ours out, and if it's what the people want, then how is that our fault?\n \n \nYou seem to think we can \"win\" the war on terror. How exactly does one go about combatting an enemy that is dispersed throughtout the entire world and operates cladestinely\n\n \n You seem to be happy at the prospect that we may not. You'd make a great General in the Iraqi army-throw up your hands without even trying. I'd rather fight to the death and take as many of them with me as I can rather than surrender to those animals. YOU on the other hand don't believe there is anything worth fighting and dying for.", 
   {}, 
   39603, 
   null, 
   1079468760.0
  ], 
  [
   39656, 
   null, 
   "syklopps61", 
   "And people wonder why other nations think the US is arrogant and full of itself.\n\n \n Ask me if I give a S*** what these other nations think about us. I may be upset about their collective lack of courage, but I could care less what they think. And frankly, I think we have good reason to be arrogant. May not be the PC thing to say, but I really could care less about that either\n \n \nThe US provides one of the lowest ammounts of proportional aid of any developed country\n\n \n Don't feed me this \"proportional\" BS, we provide aid all around the world, just because we could and don't provide more doesn't mean that what we DO give is meaningless and should go unappreciated", 
   {}, 
   39626, 
   null, 
   1079469720.0
  ], 
  [
   39659, 
   null, 
   "nick", 
   "A Spaniard has been thrown in the works of defeating world terrorism with Spain's election result. The nation has administered itself a cojones bypass operation. \n \n These chickens are definitely coming home to roast.....", 
   {
    "post_info": {
     "post_title": "The Scum Also Rises"
    }
   }, 
   39526, 
   null, 
   1079470560.0
  ], 
  [
   39664, 
   null, 
   "jitobear", 
   "Skylopps - you sound like a diva! \"I am Mariah Carey - you should be grateful I poop in your space.\" I am glad you are not in charge of international relations for the US, we would run out of friends FAST. :p \n \n By the way, you have yet to answer exactly what we have done for Spain that they owe us.\n \n I mean, the world's greatest police force - the good ole USA - was distinctly quiet while Hitler's dictator buddy Franco stayed in power in Spain until his death in the mid 70s......", 
   {}, 
   39659, 
   null, 
   1079473380.0
  ], 
  [
   39669, 
   null, 
   "hvozdany", 
   "Are you really that naive? That's like saying Hitler would have stopped after taking over Europe\n \n Nope, never have, so why don't you enlighten me? Please tell me what awful things we did that would justify 9-11. Is it because we support Israel? ... Is it our culture? \n \n \n\n \n I think that everyone should be clear about what Al Queda wants. They have been very clear in their statements, but it has always suprised me that the media never cover it, and it seems that the vast number of Americans do not understand. They didn't attack us because they 'hate freedom,' though this is a very simplistic line that seems to have been very effective.\n Al Queda's problem with the US was its military presense in the middle east, in particualar Saudi Arabia at the time of 9/11.\n \n A quote from bin laden in '97:\n \n \"For this and other acts of aggression and injustice, we have declared jihad against the US, because in our religion it is our duty to make jihad so that God's word is the one exalted to the heights and so that we drive the Americans away from all Muslim countries...\"\n \n I have not seen any statements by al queda about the Spain attacks, but quite possibly, now they have the same problem with Spain as the have with the US...they are westerners in the middle east, their holy land.\n \n Also, it seems that people here are not making the distinction between the 'war on terror' and the invasion of Iraq. I think that most people here will agree that the Iraq war had nothing to do with al queda, at least directly.", 
   {}, 
   39653, 
   null, 
   1079476380.0
  ], 
  [
   39672, 
   null, 
   "syklopps61", 
   "I am glad you are not in charge of international relations for the US, we would run out of friends FAST. \n \n \n Sounds to me like you don't have the self confidence to stand alone when something is right. You turn your eyes to the all knowing Europeans and third world countries to seek their approval before we do anything\n \n \nyou should be grateful I poop in your space.\"\n\n \n Are you somehow insinuating that all the U.S. does is \"poop\" on other countries?\n \n \nBy the way, you have yet to answer exactly what we have done for Spain that they owe us... I mean, the world's greatest police force - the good ole USA - was distinctly quiet while Hitler's dictator buddy Franco stayed in power in Spain until his death in the mid 70s\n\n \n Well, just our friendship alone should be enough :-D Besides, I'm sure there is foreign aid to them in one form or another, plus disater relief, etc. I will ask you to answer the question I posed now...Why is it our responsibility to bail out all these other countries when they need help? i can tell by your sarcasm (good ole USA) that you despise this country-such a shame that all you can see is faults and negativity with a country that for the most part has done unbelievably good things for the world", 
   {}, 
   39664, 
   null, 
   1079477220.0
  ], 
  [
   39681, 
   null, 
   "daewoo", 
   "don't tell me you believe that bin laden is noble and fighting a just cause by targetting civillians instead of military/political targets?\n\n \n Bin Laden is not noble, but his cause is probably just. Do you remember when Clinton was running for pres and there was the big deal about the chinese giving campaign controbutions? People were up in arms because we didn't want a foreign country affecting th outcome of our elections. \n \n Compare that to American policy in the middle east. We spend billions propping up dictatorships and opprssive regimes. Middle easterners don't seem to be any more open to the idea of foreign countries meddling in their internal politics than Amricans were.\n \n \nso as a western industrialized power even if they pull out of iraq they would remain a western power lending their efforts against terrorism. they will remain a target.\n\n \n You assume much. I doubt that Spain will be a driving force in the war on terror after this. The new government ran on a policy of socialism and pseudo-isolationism.\n \n \nnot sure where you came from or going with this as a response to my quoted passage but hey, whatever. they pick spain because spain was an ally and was about to hold election. and because spain is relatively resurgent on the international stage, their resolve questionable. lichenstein is a nobody. germany had already lost resolve. (actually german security higher)\n\n \n Germany has lost resolve? I was unaware that they were ever that big a player in the \"War on terror\". AS far as their security being tighter, Spain spends over 85% of their law enforcement budget on counter terrorism programs due to their domestic terrorism problems. \n \n \ni countered your assertion the countries attacked were allies against iraq and you basically agreed.\n\n \n They were not just allies against IRaq, they were allies in the \"war on terror\"\n \n \nthen i countered that spain was attack merely because they are an ally, not because their contribution to the war and you basically said the same now.\n better understand the words and not just use them indiscriminately.\n\n \n MAybe we need to make a distinction between the war in iraq and the war on terror. The two are barely related. I am talking about hte \"War on terror\". The war in Iraq has only become a part of the war on terror insofar as it has become a symbol of sorts for the different extremist groups of US intervention in the middle east.\n \n \nofcourse they have reasons. never said otherwise.\n read history of revolutions and insurgencies. inevitably many who fought and risked their lives for the \"cause\" come to discover the \"cause\" not the same for those who lead and gain power as those who fought and died for them.\n\n \n So, you are sticking to your guns on this one? Bin Laden, who has hundreds of millions of dollars, is hiding in a cave in afghanistan, or a village in pakistan because of the great power that the terrorist attacks give him? If what he was after was simply power, he would be far better off having never left the middle east where with that kind of money you can pretty much do whatever you wish.\n \n \nno, it is morally bankrupt to think that your innocence will protect those who seek power through violence, as your neighbor is taken away.\n it is perfectly reasonable to dissent. but to dissent while it is safe to do so, but not when your life, property, or liberty is at risk is morally bankrupt.\n\n \n Power invariably comes from violence. The only power behind the laws of the united states is that they ca forcibly drag you off and stick you in a cell. THe very basis of democracy is that 51% of the people can beat the H#@$ out of 49%\n \n \nbeing critical is not being a fascist. if so you too are a fascist.\n funny that you don't understand that. \n \n \n Being critical is not fascism. There is an excellent section on fascism in the book \"Political systems: A difinitive comparison of the worlds governments\". They have about 300 pages on fascism. IT is well worth the read.\n \n \nsince i am neither the government of have forcibly suppressed your viewpoints how am i a fascist?\n\n \n You are right. You are not a fascist government. \n \n \nterrorism is quite new to the US.\n giving in to them only empowers them, not bring peace.\n\n \n How would you suggest \"defeating\" them? The problem with fighteing terrorists and radicals seems to be that for every one you martyr, 2 more pop up in their place. WE kill bin Laden, we create 50 more Bin Ladens. The enemy is everywhere, in every country in the world, including interspersed with your own population. How exactly do you combat an organisation like this?", 
   {}, 
   39609, 
   null, 
   1079480400.0
  ], 
  [
   39691, 
   null, 
   "daewoo", 
   "Are you really that naive? That's like saying Hitler would have stopped after taking over Europe\n\n \n Again, somebody is going to have to explain hw hitler has any relevance to Al Queda or Bin Laden. ON the one hand, you have a guy whose country had one of the largest and most advanced militaries of the era. Hitler also had expansionist visions of a unified europe. This was one of hitlers stated goals. On the other hand, you have a loose netowrk of terrorist fighters whose stated goals are to stop American meddling in middle eastern affairs (basically fighting for pseudo isolationism). How are these two comparable again?\n \n \n \nNope, never have, so why don't you enlighten me? Please tell me what awful things we did that would justify 9-11. Is it because we support Israel? So, we have to ask the terrorsist who we can be friends with and who we can't? Is it our culture? Hey, they can control their own culture and keep ours out, and if it's what the people want, then how is that our fault?\n\n \n IT is not just a question of Israel. It is a question of AMerica continually meddling in middle eastern affairs. W support the Saudi government, despite the fact that their population has tried for years to bring about democratic reforms in that country. We installed and supported Saddam Hussein. WHat \"the people\" in the middle east want has little or no bearing on what they get. There are no real democracies in the middle east. They can NOT control their own culture and keep ours out, and we have taken great pains to ensure that the same old dictatorial governments stay in power.\n \n \nYou seem to be happy at the prospect that we may not. You'd make a great General in the Iraqi army-throw up your hands without even trying. I'd rather fight to the death and take as many of them with me as I can rather than surrender to those animals. YOU on the other hand don't believe there is anything worth fighting and dying for.\n\n \n You should definatly join the military as soon as possible, and maybe you will get your chance. I doubt you really mean that, though. People are alsways willing to die for their convictions until the time actually comes, then there is a bunch of backpedaling and whining and begging.\n \n Would it really be surrendering to those \"animals\" (you will have to expalin how you decide who are \"people\" and who are \"animals\") to say \"OK, guys, you quite blowing stuff up, and we will quite working to block democratic elections in the middle east\". HOw about if we REALLY went crazy and said \"We will also take steps to make israel quite shelling civilian settlements and refuge camps\". \n \n Would that really be so bad? What do you think people are fighting and dying for< Do you think our \"way of life\" is being attacked here? It's not. The terrorists do not want to take away your right to own a gun, or say what you want, or sit on your couch and munch on big macks that you picked up in your SUV whil you watch PPV prono. They couldn't care less. IF it was a question of figthing and dying in order to defend our way of life, perhapse I might see it differently. IF what we are fighting for is the right of the US to install and prop up oppressive regimes in the middle east to stabilise our oil supply so standard oil can net 1.7 billion dollars a year instead of just 850 million, I would have to say that you are more than welcome to fight and die for that one, I think I will pass.\n \n \n \nI bet you do! I personally feel that the rest of the world should kiss our feet. What would you say if the U.S. withheld all of the humanitarian aid we provide to all these other countries? We certainly have no obligation, right? We are accountable to our own people, right? Frankly they OWE us because of the aid we provide, if not for other reasons. \n \n \n Les look at where that foreign aid goes. The biggest recipient of US foreign aid is Israel. THey use that money to buy F-18s and hellfire missiles, which they use against civilians in the occupied territories. They also use part of that money in \"civil\" programs, where they buy things like bulldozers, which they use to bury American peace activists alive whent hey bulldoze peoples houses. THe rest, well, we don;t know where it goes, because they are not frthcoming about what exactly happens to it. We acn assume they used no small part of it in the development of their nuclear arsenal.\n \n Ok, maybe israel is a bad example. Maybe columbia would be better. IN columbia, ther are millions starving to death. OUr foreign aid there hads largly consisted of spraying huge portions of their cropland with defoliation agents. BAsically, sprayed 70% of their cropland with roundup. As an added bonus, the stuff we used also has a high incidence of cancer and birth defects. Foreign aid at its finest!\n \n Other places, we actaull DO provide food for the hungry and medicine for the sick. All we require for these services is gaurantees by the governments of these regions that US companies will recieve preferential treatment, even in regards to local companies.\n \n MOst places, when the cost of recieving US foreign aid is calculated by the population, they certainly feel they owe us something, but is usually isn't friendship. Do you really go to bed at night feeling smug because your tax dollas are being used to feed the hungry and clothe the naked all over the world as the result of totally unselfish US aid packages?\n \n \nAnd quite how was that?\n\n \n THis was in relation to \"The british proved this pretty suessfully in northern ireland\"\n \n TEll you what, answer your own question. Look up how long the Briitish fought terrorism in N Ireland. PAy special attention to the lengths to which they went to combat it. Then come back.\n \n Guess what, THEY NEVER WON. Both sides made some concessions and a cease fire was born. THe british were in a much better situation to combat their terrorists than the US is. The british would never have beaten the IRA, the israelis will never beat the palestenians, America will never defeat Al Queda. This is just the way terrorism is. TO beat them, first you have to find them, then you have to take them down, ythen you have to find their sucessors, and take them down, then THEIR succesors and take THEM down. The problem is, every time you make a martyr out of one, two more pop up to replace them, and each new generation is a little harder to find, a little harder to beat, because each generation learns a few tricks from the one before and then invents a few of their own.", 
   {}, 
   39653, 
   null, 
   1079484000.0
  ], 
  [
   39698, 
   null, 
   "syklopps61", 
   "Again, somebody is going to have to explain hw hitler has any relevance to Al Queda or Bin Laden.\n\n \n Well, you seem like a relatively intelligent person, do you really believe that ALL the terrorists want is for us to leave the Middle East alone? And by leaving it alone, are you inferring that our support of Israel is meddling? If so, tough s###. The reference to Hitler, at least by me, was in the context of him, at the beginning, just saying I want a piece of this and it was given him, then he wanted a piece of that, and it was given to him. After he got what he wanted from the appeasers, he tokk the rest by force. You honestly think that if we left the Middle East alone, that the terrorists will just go away? All Christians are infidels to them and as such we are supposed to convert to Islam or die (according to the radicals, who are, afterall, the terrorists)\n \n \nIT is not just a question of Israel. It is a question of AMerica continually meddling in middle eastern affairs. W support the Saudi government, despite the fact that their population has tried for years to bring about democratic reforms in that country. We installed and supported Saddam Hussein. WHat \"the people\" in the middle east want has little or no bearing on what they get. There are no real democracies in the middle east. They can NOT control their own culture and keep ours out, and we have taken great pains to ensure that the same old dictatorial governments stay in power.\n\n \n I have never said we are perfect, and 20/20 hindsight is clear, as things have turned out, there were some mistakes made. We do have national security issues and we ARE a world power-other world powers have done the same thing. Our nation requires oil-we could have easily gone in in the '30's and taken over those dust bowl countries and taken their oil, but we chose to work with their governments to get the oil. IF we have interfered in democratic reforms it is out of fear of the people voting in even more radical governments. If you Liberals would let us get our own oil here in this country, we could let those people pour oil on their cereal LOL\n \n \nYou should definatly join the military as soon as possible, and maybe you will get your chance. I doubt you really mean that, though. People are alsways willing to die for their convictions until the time actually comes, then there is a bunch of backpedaling and whining and begging.\n\n \n Why would you assume that I am as spineless as you and others, ones that would beg and plead with the terrorists to leave us alone?\n \n \nWould it really be surrendering to those \"animals\" (you will have to expalin how you decide who are \"people\" and who are \"animals\") \n \n \n The terrorists are animals, sorry, I don't have the same compassion for them as you.\n \n \nLes look at where that foreign aid goes. The biggest recipient of US foreign aid is Israel. THey use that money to buy F-18s and hellfire missiles, which they use against civilians in the occupied territories. They also use part of that money in \"civil\" programs, where they buy things like bulldozers, which they use to bury American peace activists alive whent hey bulldoze peoples houses. THe rest, well, we don;t know where it goes, because they are not frthcoming about what exactly happens to it. We acn assume they used no small part of it in the development of their nuclear arsenal.\n\n \n I say let's give them more!!!!\n \n \nOther places, we actaull DO provide food for the hungry and medicine for the sick. All we require for these services is gaurantees by the governments of these regions that US companies will recieve preferential treatment, even in regards to local companies.\n\n \n Is that really so bad? Seems to me you think that we should just give everything to everybody and expect nothing in return\n \n \nTO beat them, first you have to find them, then you have to take them down, ythen you have to find their sucessors, and take them down, then THEIR succesors and take THEM down. The problem is, every time you make a martyr out of one, two more pop up to replace them, and each new generation is a little harder to find, a little harder to beat, because each generation learns a few tricks from the one before and then invents a few of their own\n\n \n HMMMMMMMMMM tactical nukes might work!!! LOL", 
   {}, 
   39691, 
   null, 
   1079489460.0
  ], 
  [
   39722, 
   null, 
   "daewoo", 
   "Well, you seem like a relatively intelligent person, do you really believe that ALL the terrorists want is for us to leave the Middle East alone? And by leaving it alone, are you inferring that our support of Israel is meddling? If so, tough s###. The reference to Hitler, at least by me, was in the context of him, at the beginning, just saying I want a piece of this and it was given him, then he wanted a piece of that, and it was given to him. After he got what he wanted from the appeasers, he tokk the rest by force. You honestly think that if we left the Middle East alone, that the terrorists will just go away? All Christians are infidels to them and as such we are supposed to convert to Islam or die (according to the radicals, who are, afterall, the terrorists)\n\n \n AH, so the analogy is based on a misconception of history then. I understand now. Although the \"appeasement\" theory in regards to Hitler is a nice little bit of revisionist history, in reality, we let hitler take neiboring countries to begin with because nobody though he could be beat. THe rest of the world had to wait until his military was spread thin before counter attacks were anything but suicidal. \n \n As far as muslims attacking and killing cristians for being infidels, it has never happened before, I fail to see why it is going to happen now. As far as I know, the only people to ever go to war based soley on religous idealogy are christians (rememebr the crusades?)/\n \n \n \n \nI have never said we are perfect, and 20/20 hindsight is clear, as things have turned out, there were some mistakes made. We do have national security issues and we ARE a world power-other world powers have done the same thing. Our nation requires oil-we could have easily gone in in the '30's and taken over those dust bowl countries and taken their oil, but we chose to work with their governments to get the oil. IF we have interfered in democratic reforms it is out of fear of the people voting in even more radical governments. If you Liberals would let us get our own oil here in this country, we could let those people pour oil on their cereal LOL\n\n \n Yes, hindsight is 20/20. It is not that hard to look at your actions as you commit them and see gross injustice. We are not talking little errors in foreign policy, we are talking a long term gross violation of our own alleged ideals in the name of corporate profits and continued access to cheap oil.\n \n AS far as taking them in the 30's, never would have happened. The NAzis couldn't do it during WWII. Ther is no way we were going to do it during the 30's. \n \n As far as interfering with democratic reforms, where did you get that impression? There has been a popular movement in many sections of the middle east since the 60's to remove religion from politics. In Saudi Arabia, after WWII they pushed really hard to get a government in that was free from religous intervention. The problem we see with real democracies in the middle east is that the we have to deal with a whole new set of folks. Right now we just have to deal with a few shieks who are motivated soley by self interest. IT is easy to deal with people who are motivated wholey by self interest, it is entirely different when you have to deal with a government that is also concerned with the welfare of the people.\n \n \n \nWhy would you assume that I am as spineless as you and others, ones that would beg and plead with the terrorists to leave us alone?\n\n \n I have done my service, buddy. How about you?\n \n \n \nThe terrorists are animals, sorry, I don't have the same compassion for them as you.\n\n \n So, at exactly what point do you become an animal? Easy question.\n \n \n \nIs that really so bad? Seems to me you think that we should just give everything to everybody and expect nothing in return\n\n \n No, but there is a differnce between expecting some return and imposing crippling economic requirements. THis policy has possibly made America more enemies than any other that we have. I know that many gun-ho type folks how many aenemies we make is irrelevant. This kind of thing tends to come back and bite you in the butt, though.\n \n \nHMMMMMMMMMM tactical nukes might work!!! LOL\n\n \n Good idea. We know there are some of them in Britian. Lets nuke them first. Then we can do France, GErmany, the Netherlands, Belguim and Saudi Arabia. After that, we can start isolating which parts of America we think they may be hiding out in, and we can nuke THEM. New York and LA both have fairly large Muslim populations. Of course, the terrorists could stop their attacks, since we would be destroying everything for them!", 
   {}, 
   39698, 
   null, 
   1079497740.0
  ], 
  [
   39725, 
   null, 
   "fracas", 
   "Bin Laden is not noble, but his cause is probably just. Do you remember when Clinton was running for pres and there was the big deal about the chinese giving campaign controbutions? People were up in arms because we didn't want a foreign country affecting th outcome of our elections. \n\n Bin Laden is bent on the destruction of the west in general, and the US in particular\n \nCompare that to American policy in the middle east. We spend billions propping up dictatorships and opprssive regimes. Middle easterners don't seem to be any more open to the idea of foreign countries meddling in their internal politics than Amricans were.\n\n i would really like more documentation of this common belief.\n iran? syria? yemen? chad? sudan? pakistan? lybia? algeria?\n kuwait and saudi are both independently wealthy because of oil. and if we didn't buy their oil someone else would.\n that leaves morocco, jordan and egypt, along with the lesser ones like qatar and UAE (both oil rich) and these are relatively mild compared to the likes of the other ME nations.\n \nYou assume much. I doubt that Spain will be a driving force in the war on terror after this. The new government ran on a policy of socialism and pseudo-isolationism.\n\n they don't need to be the spear tip in the war on terror to be part of the war on terror. they will remain on the hit list for this alone. and if you consider AQ scored a victory in spain greater than 911, then it is certain they will return.\n \nGermany has lost resolve? I was unaware that they were ever that big a player in the \"War on terror\". AS far as their security being tighter, Spain spends over 85% of their law enforcement budget on counter terrorism programs due to their domestic terrorism problems. \n \n Germany is riddled with muslim extremist. part of the reason they did not want to the visibility (much like france) of war on terror and iraq.\n if Spain spent 85% if their law enforcement budget to fight terrorism (can you post a link?) then it is even worse that 311 happened without warning to the spaniards.\n \nThey were not just allies against IRaq, they were allies in the \"war on terror\"\n\n one of the central tenet of the war against terrorism is to minimize the damage inflicted by terrorist acts. the worse case scenario always involve wmd. any unstable nation producing wmd must be made accountable. there are two ways to do so, iraq and lybia. \n \nMAybe we need to make a distinction between the war in iraq and the war on terror. The two are barely related. I am talking about hte \"War on terror\". The war in Iraq has only become a part of the war on terror insofar as it has become a symbol of sorts for the different extremist groups of US intervention in the middle east.\n\n see above\n \nSo, you are sticking to your guns on this one? Bin Laden, who has hundreds of millions of dollars, is hiding in a cave in afghanistan, or a village in pakistan because of the great power that the terrorist attacks give him? If what he was after was simply power, he would be far better off having never left the middle east where with that kind of money you can pretty much do whatever you wish.\n\n naturally the common perception from the west is that money brings power. this is not universal. it must have been incredibly frustrating to have all that money and unable to enact policy changes in saudi. besides, if monetary power was sufficient, why did he ever take up terrorism?\n \nPower invariably comes from violence. The only power behind the laws of the united states is that they ca forcibly drag you off and stick you in a cell. THe very basis of democracy is that 51% of the people can beat the H#@$ out of 49%\n\n power is what he seeks, and inevitably violence will be the means. he seeks to be the ME government, or at least one of his creation and blessing.\n btw, a constitutional republic is the safeguard against the oppression of the majority in a democracy.\n \nBeing critical is not fascism. There is an excellent section on fascism in the book \"Political systems: A difinitive comparison of the worlds governments\". They have about 300 pages on fascism. IT is well worth the read.\n\n i find the charge of fascism abused most by the dissenters when their own dissent is in turn challenged. it usually comes out when reason and logic are wanting in the defense of their stance.\n \nHow would you suggest \"defeating\" them? The problem with fighteing terrorists and radicals seems to be that for every one you martyr, 2 more pop up in their place. WE kill bin Laden, we create 50 more Bin Ladens. The enemy is everywhere, in every country in the world, including interspersed with your own population. How exactly do you combat an organisation like this?\n\n 1. undermine their cause and co-opt their agenda. they want a better ME? make that happen, just not on their terms. they want a fundamentalist state, give them democracy. (anvil)\n 2. fight them with absolute ruthlessness wherever they reveal themselves. (hammer)", 
   {}, 
   39681, 
   null, 
   1079498520.0
  ], 
  [
   39742, 
   null, 
   "daewoo", 
   "Bin Laden is bent on the destruction of the west in general, and the US in particular\n\n \n And he is doing this because he is what....bored? WE could ship him some jigsaw puzzels and crosswords and solve the problem then.\n \n \ni would really like more documentation of this common belief.\n iran? syria? yemen? chad? sudan? pakistan? lybia? algeria?\n kuwait and saudi are both independently wealthy because of oil. and if we didn't buy their oil someone else would.\n that leaves morocco, jordan and egypt, along with the lesser ones like qatar and UAE (both oil rich) and these are relatively mild compared to the likes of the other ME nations.\n\n \n No, we are talking more along the lines of Saudi Arabia, Kuwait and Iraq (yes, we propped up saddam). When I say we are propping up oppressive regimes I don;t mean we are funding them. I mean we are failing to apply the standards we generally apply when dealing with other countries, thus enabling them to continue their course of actions without reprocussions.\n \n \nthey don't need to be the spear tip in the war on terror to be part of the war on terror. they will remain on the hit list for this alone. and if you consider AQ scored a victory in spain greater than 911, then it is certain they will return.\n \n \n \n IF you consider their goal to be simply to kill people this is true. THt is not their goal, though.\n \n \nGermany is riddled with muslim extremist. part of the reason they did not want to the visibility (much like france) of war on terror and iraq.\n if Spain spent 85% if their law enforcement budget to fight terrorism (can you post a link?) then it is even worse that 311 happened without warning to the spaniards.\n\n \n Sorry, no link, the best I can do is \"fox news, sometime around midnight\". I checked their website and couldn't find the interview. Will keep looking, though. WHile germany may have quite a few muslim extremists, they do not have a bunch of muslim extremists attacking them. \n \n Te fact that they spend so much on CT and still took a hit like that underscores the fact that there is very little that can actually be done to combat terrorism. We can gaurd our airports, we can guard our trains, but what about our movie theaters, or our shopping malls, or our schools? The only way to really combat terrorism is to become a police state. The soviet Union never had trouble with terrorism. Are you really willing to accept that?\n \n \none of the central tenet of the war against terrorism is to minimize the damage inflicted by terrorist acts. the worse case scenario always involve wmd. any unstable nation producing wmd must be made accountable. there are two ways to do so, iraq and lybia. \n \n \n What about N Korea? That would seem like a third way to do it.\n \n \n \nnaturally the common perception from the west is that money brings power. this is not universal. it must have been incredibly frustrating to have all that money and unable to enact policy changes in saudi. besides, if monetary power was sufficient, why did he ever take up terrorism?\n\n \n MOney brings power is absolutly the case in the middle east. A wealthy Saudi businessman can have a poor man thrown in prison indefinately. Saudi s one of those places where you are pretty much either a millionair or living in poverty (With less than 2% of the population comprising the \"middle class\"). Those with the money absoltly make the rules in the middle east.\n \n \npower is what he seeks, and inevitably violence will be the means. he seeks to be the ME government, or at least one of his creation and blessing.\n btw, a constitutional republic is the safeguard against the oppression of the majority in a democracy.\n\n \n Bin Laden has always pushed for less American involvement in the middle east. What happens after that is of little consequence. IF we were to quite playing in their back yard, they wouldn;t have a beef with us.\n \n Thank you for pointing out hte difference between a constitutional republic and a pure democracy. People have so much trouble getting this through their heads.\n \n \ni find the charge of fascism abused most by the dissenters when their own dissent is in turn challenged. it usually comes out when reason and logic are wanting in the defense of their stance.\n\n \n I generally save the \"URA fascist\" for folks who unquestioningly support their government and are hyper critical of those who whom they even percieve might be insulting them (iraqi civilian deaths). \n \n \n1. undermine their cause and co-opt their agenda. they want a better ME? make that happen, just not on their terms. they want a fundamentalist state, give them democracy. (anvil)\n 2. fight them with absolute ruthlessness wherever they reveal themselves. (hammer)\n\n \n These are good ideas. Of course, I don't think we are going to see a whole lot of democracy going o in the middle east. We will continue to supprot our saudi prices and kuwaiti kings. We will have pseudo democracy in Iraq, a nice puppet government. We can't alow actual democracy there, since the majority of Iraqis are Shia, and we certainly don;t want them running things.", 
   {}, 
   39725, 
   null, 
   1079512560.0
  ], 
  [
   39771, 
   null, 
   "syklopps61", 
   "Although the \"appeasement\" theory in regards to Hitler is a nice little bit of revisionist history, in reality, we let hitler take neiboring countries to begin with because nobody though he could be beat. THe rest of the world had to wait until his military was spread thin before counter attacks were anything but suicidal. \n \n \n AHHH, so the world knew that Hitler would spread his force thin and therefore were just biding their time, meanwhile letting so many people die.\n \n \nAs far as muslims attacking and killing cristians for being infidels, it has never happened before, I fail to see why it is going to happen now.\n\n \n You may fail to see it, but does that mean it's outside the realm of possibility? We ARE dealing with a radical group, remember?\n \n \nWe are not talking little errors in foreign policy, we are talking a long term gross violation of our own alleged ideals in the name of corporate profits and continued access to cheap oil.\n\n \n I'm curious, are we the only country that has committed these atrocities?\n \n \nAS far as taking them in the 30's, never would have happened. The NAzis couldn't do it during WWII. Ther is no way we were going to do it during the 30's. \n \n \n Well, Germany WAS kinda preoccupied in WWII, I'm referring to prior to WWII. The Middle East, at least in modern times, has never been a formidable military opponent.\n \n \nI have done my service, buddy. How about you?\n \n \n \n I'm in law enforcement Ace, are you trying to say that only those who have served in the military are willing to give their life? Afterall, there have been deserters in the military, not sure there have been many in law enforcement\n \n \nSo, at exactly what point do you become an animal? Easy question\n.\n \n Easy answer-when you believe uncivilized. If you want to try to make a case for these animals actually being people, go for it\n \n \n \nGood idea. We know there are some of them in Britian. Lets nuke them first. Then we can do France, GErmany, the Netherlands, Belguim and Saudi Arabia. After that, we can start isolating which parts of America we think they may be hiding out in, and we can nuke THEM. New York and LA both have fairly large Muslim populations. Of course, the terrorists could stop their attacks, since we would be destroying everything for them!\n\n \n See, we CAN find common ground, but I was thinking more along getting them at the source, if you know what I mean ;-) After that, we can work on those individual countries!!", 
   {}, 
   39722, 
   null, 
   1079545500.0
  ], 
  [
   39772, 
   null, 
   "fracas", 
   "And he is doing this because he is what....bored? WE could ship him some jigsaw puzzels and crosswords and solve the problem then.\n \n No, we are talking more along the lines of Saudi Arabia, Kuwait and Iraq (yes, we propped up saddam). When I say we are propping up oppressive regimes I don;t mean we are funding them. I mean we are failing to apply the standards we generally apply when dealing with other countries, thus enabling them to continue their course of actions without reprocussions.\n\n we have not propped up iraq. iraq has always been in the russo-franco sphere of influence. saddam came to power before the US even got interested in iraq. we got interested when he provided a barrier to the spread of iranian fundamentalism. we cringed when he went to war with iran and did not take steps to stop him. but when he took kuwait we said enough. the actual support that went to saddam was miniscule compared to what he got from russia, france, and germany (just look at his arsenal, russian tanks, migs and mirages jets, and infrastructure and nuclear power plant with the help of franco-prussian firms).\n kuwait and saudi arabia are not propped up by the US, no money go to their government, no US troops defend their sovereigns. if we stop buying oil from them the europeans and the japanese would continue to do so. (you do also realize that ME oil helped to end the cold war by keeping prices low to minimize russian oil profit, right?)\n no, we actually are applying the same standard. we deal with the recognized and legitimate governments for any nation. we interact with them to maximize our benefit, and they do the same. we have not judged them due to cultural relativism. we have engaged them politically and at the same time has applied pressure for political changes. the alternative would have been to isolate and ignore them like say NK and iran. not particularly helpful either cases.\n but this then raises another question. by whose standards should we judge whether a nation is fit to associate with? and if they don't meet the standards we placed should we ignore them? isolate them? seek to apply our standards to improve them? cultural imperialism? moral imperialism?\n \nIF you consider their goal to be simply to kill people this is true. THt is not their goal, though.\n\n their goal is to destroy the west/US\n fracturing an alliance contributes to this goal. demonstrating power over a major western democracy contributes to this goal. the deaths are not the ends, just the means by which their power grow and is demonstrated.\n \nSorry, no link, the best I can do is \"fox news, sometime around midnight\". I checked their website and couldn't find the interview. Will keep looking, though. WHile germany may have quite a few muslim extremists, they do not have a bunch of muslim extremists attacking them.\n\n i don't watch fox news. \n \nTe fact that they spend so much on CT and still took a hit like that underscores the fact that there is very little that can actually be done to combat terrorism. We can gaurd our airports, we can guard our trains, but what about our movie theaters, or our shopping malls, or our schools? The only way to really combat terrorism is to become a police state. The soviet Union never had trouble with terrorism. Are you really willing to accept that?\n\n the soviet union and china do not have problems with terrorism is because they are willing to fight in the same arena, to be ruthless in tracking themdown and killing them. recently the russian killed a chechen leader in qatar with a car bomb. yup, but they were messy about it and now the qatari are unhappy about it.\n we do not need to become a police state to combat terrorism. we need to keep our resolve and determination to fight terrorism.\n \nWhat about N Korea? That would seem like a third way to do it.\n\n NK has been implicated to exporting both nuclear and missile technology to states like lybia, iran, and pakistan. which way NK goes remain to be seen. but containment has not worked.\n \nMOney brings power is absolutly the case in the middle east. A wealthy Saudi businessman can have a poor man thrown in prison indefinately. Saudi s one of those places where you are pretty much either a millionair or living in poverty (With less than 2% of the population comprising the \"middle class\"). Those with the money absoltly make the rules in the middle east.\n\n civil or economic power does not always translate to political power. bin laden does not want power to buy the latest mercedes, he does not want people thrown in jail, he wants to dictate the future of the ME. he is not a champion of the arabs. why not spend his wealth to buy food, medicine, education?\n \nBin Laden has always pushed for less American involvement in the middle east. What happens after that is of little consequence. IF we were to quite playing in their back yard, they wouldn;t have a beef with us.\n\n don't be so quick. read this.\n saudi struggles \n \nI generally save the \"URA fascist\" for folks who unquestioningly support their government and are hyper critical of those who whom they even percieve might be insulting them (iraqi civilian deaths). \n\n because someone agrees with the government that do not make them fascist. if they disagree with you it does not make them fascist. if they call you unpatriotic and report you to the authority, that makes them fascists.\n \nThese are good ideas. Of course, I don't think we are going to see a whole lot of democracy going o in the middle east. We will continue to supprot our saudi prices and kuwaiti kings. We will have pseudo democracy in Iraq, a nice puppet government. We can't alow actual democracy there, since the majority of Iraqis are Shia, and we certainly don;t want them running things.\n\n 1. we actually want to keep oil prices low, and this is in contradistinction to what kuwait and saudi arabia wants.\n 2. should we sponsor overthrow of these governments?\n 3. if we stop buying oil from them someone else would.\n 4. democracy in iraq has not even started yet.\n 5. why not the shiite? would it be wrong for christians to be the majority in the US government?\n \n i don't care to perpetuate the myth that the US is at fault for the ME mess.\n it takes two to tango, one to lead, one to follow.\n to suggest that they are victims perpetuate their sense of helplessness which they certainly are not. all individuals have the power to affect change in the world around them (and yes, how these changes are affect matters as well). otherwise they will always wait for someone else to fix their problem, and looks who is exploiting that now?\n perpetuating the myth empowers the terrorist in the west and the ME.\n \n i am not saying we cannot do better. but i refuse to accept full responsibility and be the fall guy.", 
   {}, 
   39742, 
   null, 
   1079546520.0
  ], 
  [
   39792, 
   null, 
   "hvozdany", 
   "I still don't udnerstand why there is the perception that the reason that al queda attacked us is simply because we are infedels, that they picked us to attack for no other reason than this...if someone could explain to me why this is, please do.\n Also, i believe that there is a misconception (although perhaps understandable) that all terrorist are simply lunatics bent on killing everyone that they can. The fact is most terror groups (al queda included) are not irrational lunatics. They have a stated goal, and they carry out terror attacks to try to produce an outcome. I understand why we would like to think that al queda is just a bunch of crazies, but sadly, they aren't. They are very intelligent and rational, and I think that is one of the reasons they are so dangerous.\n Anyway, again, if someone could post why they think that al queda wants to destroy america simply because we are not a nation of islamic fundamentalists, I would appreciate it. I have never quite understood why people believe this.", 
   {}, 
   39772, 
   null, 
   1079556000.0
  ], 
  [
   39795, 
   null, 
   "jitobear", 
   "i can tell by your sarcasm (good ole USA) that you despise this country-such a shame that all you can see is faults and negativity with a country that for the most part has done unbelievably good things for the world\n\n \n Wrong about me again. I love my country. I am proud of all the good we have done. We really are a great nation.\n \n But Spain owes us nothing.", 
   {}, 
   39672, 
   null, 
   1079556600.0
  ], 
  [
   39797, 
   null, 
   "syklopps61", 
   "But Spain owes us nothing\n\n \n Okay, fair enough, but do WE (the U.S.) owe anything to any other country?", 
   {}, 
   39795, 
   null, 
   1079557260.0
  ], 
  [
   39800, 
   null, 
   "hvozdany", 
   "Okay, fair enough, but do WE (the U.S.) owe anything to any other country?\n\n \n \n Perhaps we do not OWE anyone anything, but some feel, I think, that the wealthiest, most powerful nation in history has a greater responsibility than others to try to help those who are less fortunate.", 
   {}, 
   39797, 
   null, 
   1079557740.0
  ], 
  [
   39805, 
   null, 
   "syklopps61", 
   "Perhaps we do not OWE anyone anything, but some feel, I think, that the wealthiest, most powerful nation in history has a greater responsibility than others to try to help those who are less fortunate.\n\n \n Okay, so everything falls on us-we are supposed to give and give, but yet when it comes time to receive, suddenly, none of these countries owe US. I'm sorry, I don't accept that", 
   {}, 
   39800, 
   null, 
   1079558640.0
  ], 
  [
   39807, 
   null, 
   "hvozdany", 
   "Okay, so everything falls on us-we are supposed to give and give, but yet when it comes time to receive, suddenly, none of these countries owe US. I'm sorry, I don't accept that\n\n \n No, I dont think that everything should fall on us, but I do think that we are in a much better position than most others to help.\n Also, to be fair, much of our aid is essentially blackmail for countries to support us. Remember us wanting to give Turkey 26 billion in aid to allow our troops to go through their country?\n But yes, I do agree with you, I think, that when the request is reasonable, our allies, or those we help should try to help us.", 
   {}, 
   39805, 
   null, 
   1079559300.0
  ], 
  [
   39814, 
   null, 
   "fracas", 
   "I still don't udnerstand why there is the perception that the reason that al queda attacked us is simply because we are infedels, that they picked us to attack for no other reason than this...if someone could explain to me why this is, please do.\n Also, i believe that there is a misconception (although perhaps understandable) that all terrorist are simply lunatics bent on killing everyone that they can. The fact is most terror groups (al queda included) are not irrational lunatics. They have a stated goal, and they carry out terror attacks to try to produce an outcome. I understand why we would like to think that al queda is just a bunch of crazies, but sadly, they aren't. They are very intelligent and rational, and I think that is one of the reasons they are so dangerous.\n Anyway, again, if someone could post why they think that al queda wants to destroy america simply because we are not a nation of islamic fundamentalists, I would appreciate it. I have never quite understood why people believe this.\n\n \n yes and no.\n anyone who believes that killing hundreds of innocent civilians do not think as the rest of us. that does make them crazy relative to us, but not irrational perhaps. serial killers always have a reason to their madness, and can be meticulous in their plans. \n \n it is not that we are not islamic fundmentalist. it is that our culture is in contradistinction to their fundamentalist ways. the way we parade our women around un covered for instance, our increasingly secular ways. but this too isn't enough. it is also because our way of life spread in popularity and power while theirs seem besieged. it must be incredibly difficult to think that as they do that their way is better conceptually but losing ground rapidly in reality. western ways are insidious in all parts of the ME.", 
   {}, 
   39792, 
   null, 
   1079563020.0
  ], 
  [
   39821, 
   null, 
   "hvozdany", 
   "yes and no.\n anyone who believes that killing hundreds of innocent civilians do not think as the rest of us.\n\n \n Well, I guess that it depends on what you consider the definition of crazy to be...if I thought that were crazy we would have to consider our government crazy, I think, as we have done the same thing...\n \n \n \n \n \n \n \n\n \n it is not that we are not islamic fundmentalist. it is that our culture is in contradistinction to their fundamentalist ways. \n ...\n western ways are insidious in all parts of the ME.\n\n \n OK, but why do people think this is why al queda attacked us? This, to me, is generalizing about how we think people feel about us, and ignoring what they actually say. As I have said, al queda has been very clear as to why it declared war against us, and it wasn't because of our culture in the US...at least I have never seen them say this...", 
   {}, 
   39814, 
   null, 
   1079569380.0
  ], 
  [
   39822, 
   null, 
   "daewoo", 
   "Well, I guess that it depends on what you consider the definition of crazy to be...if I thought that were crazy we would have to consider our government crazy, I think, as we have done the same thing...\n \n OK, but why do people think this is why al queda attacked us? This, to me, is generalizing about how we think people feel about us, and ignoring what they actually say. As I have said, al queda has been very clear as to why it declared war against us, and it wasn't because of our culture in the US...at least I have never seen them say this...\n\n \n \n It never fails to amaze me how hypocritical people are on this point. WE fought communism to \"defend our way of life\" we fought WWII for the same reason. Defending our way of life seems to be something Americans are very comfortable with. \n \n When a bunch of muslims decide they want to defend THEIR way of life, they are evil animals.", 
   {}, 
   39821, 
   null, 
   1079570640.0
  ], 
  [
   39823, 
   null, 
   "daewoo", 
   "AHHH, so the world knew that Hitler would spread his force thin and therefore were just biding their time, meanwhile letting so many people die.\n\n \n No, we just didn't think he could be beat. After he had spread his forces thinner, some weaknesses became evident. The rest of the world hoped he would stop at poland, but it didn't really matter whether he did or not, there was nothing that could really be done about it. \n \n \n \nYou may fail to see it, but does that mean it's outside the realm of possibility? We ARE dealing with a radical group, remember?\n\n \n So, it has evcer happened before, it is not happening now, but we need to wipe the earth of them since they MIGHT someday do it. All men, line up for castration, it is an unfortuanly but neweded step because you MAY someday rape somebody.\n \n \n \nI'm curious, are we the only country that has committed these atrocities?\n\n \n Yep, pretty much. There is no such thing as free aid. It is pretty common for countries to demand social changes or humanitarian policies before granting aid. The US is the only country I am aware of tha usues foreign aid to establish market superiority.\n \n \nWell, Germany WAS kinda preoccupied in WWII, I'm referring to prior to WWII. The Middle East, at least in modern times, has never been a formidable military opponent.\n\n \n You are right in that they didn;t have a formidable military, wrong that they were not considered a formidable military opponent. THe tribal people of the midddle east (the middle east was still tribal prior to WWII) have always been considered some of the fiercest warriors in the world. They have long memories and they never forget when they are wronged. \n \n Look at the resistance in Iraq. IT seemed like people were surprised that those folks didn;t take their civilian casualties laying down, or that they are attacking the occupying army. DUH there are feuds int he middle east that go back thousands of years. \n \n \n \nI'm in law enforcement Ace, are you trying to say that only those who have served in the military are willing to give their life? Afterall, there have been deserters in the military, not sure there have been many in law enforcement\n\n \n I know lots of guys who have \"deserted\" from law enfocement. They get tired of writing tickets and find a different job. As far as giving your life in law enforcement, being a housewife is more dangerous (osha).\n \n \nEasy answer-when you believe uncivilized. If you want to try to make a case for these animals actually being people, go for it\n\n \n THese people had an operaing civilization with publicly lighted streets and public libraries with thousands of volumes when the English were still filing their teeth to points and putting orange clay int heir hair so they could fashion it into spikes. Yea, they attack civilian targets. In their situation, mounting an offensive against a superior military force, this is the only battle plan that is really an option.\n \n \nSee, we CAN find common ground, but I was thinking more along getting them at the source, if you know what I mean ;-) After that, we can work on those individual countries!!\n\n \n LOL", 
   {}, 
   39771, 
   null, 
   1079571660.0
  ], 
  [
   39826, 
   null, 
   "daewoo", 
   "we have not propped up iraq. iraq has always been in the russo-franco sphere of influence. saddam came to power before the US even got interested in iraq. we got interested when he provided a barrier to the spread of iranian fundamentalism. we cringed when he went to war with iran and did not take steps to stop him. but when he took kuwait we said enough. the actual support that went to saddam was miniscule compared to what he got from russia, france, and germany (just look at his arsenal, russian tanks, migs and mirages jets, and infrastructure and nuclear power plant with the help of franco-prussian firms).\n\n \n Here is a pretty good article by Steven Shalom about hte IRan Iraq war. http://www.zmag.org/zmag/articles/ShalomIranIraq.html\n \n Take a look. America cringed??? Where do you suppose he got all those ittle chemical and biological nasties (HINT- his anthrax is the Ames strain, as in Aimes, Iowa). \n \n PArt of the reason Saddam believed he had \"permission\" to invade Kuwait was that he felt he was owed a little something by the US for fighting their war at a cost of billions of dollars.\n \n Read some of Kissingers books. Some of them cover the ME situation during regans presidency pretty well.\n \n \n \nkuwait and saudi arabia are not propped up by the US, no money go to their government, no US troops defend their sovereigns. if we stop buying oil from them the europeans and the japanese would continue to do so. (you do also realize that ME oil helped to end the cold war by keeping prices low to minimize russian oil profit, right?)\n\n \n Uh, the russians were selling oil cheaper than the ME up until their induction into OPEC. COnvincing them to join opec (and raise the price of their oil) was seen as vital for protecting the interests of US oil companies We don;t support really low oil prices, because US producers cannot produce oil as cheaply as it is done int he rest of the world. \n \n \nno, we actually are applying the same standard. we deal with the recognized and legitimate governments for any nation. we interact with them to maximize our benefit, and they do the same. we have not judged them due to cultural relativism. we have engaged them politically and at the same time has applied pressure for political changes. the alternative would have been to isolate and ignore them like say NK and iran. not particularly helpful either cases.\n\n \n Or, we could do what we do with OTHER dictatorial governments with histories of humanitarian abuse, which is to impose trade restrictions on them.\n \n \nbut this then raises another question. by whose standards should we judge whether a nation is fit to associate with? and if they don't meet the standards we placed should we ignore them? isolate them? seek to apply our standards to improve them? cultural imperialism? moral imperialism?\n\n \n See above.\n \n \ntheir goal is to destroy the west/US\n fracturing an alliance contributes to this goal. demonstrating power over a major western democracy contributes to this goal. the deaths are not the ends, just the means by which their power grow and is demonstrated.\n\n \n They want to force the US to quit meddling in middle eastern affairs, end of story. \n \n \n \nthe soviet union and china do not have problems with terrorism is because they are willing to fight in the same arena, to be ruthless in tracking themdown and killing them. recently the russian killed a chechen leader in qatar with a car bomb. yup, but they were messy about it and now the qatari are unhappy about it.\n we do not need to become a police state to combat terrorism. we need to keep our resolve and determination to fight terrorism.\n\n \n That is the only way to combat terrorism without \"resorting\" to compromise and re-examining your policies. Keeping ur resolve and determination doesn't do squat, unless you can find the terrorists and bring them down, or put measures in place to stop their attacks. The British were pretty harsh when dealing with the IRA, and it didn;t seem to be effective. I guess to really beat terrorism, I mean to end it without having to stand up and go \"Ok, we screwed up some\", the Russina policy is the only way to go. Again, are you willing to resort to this?\n \n \nNK has been implicated to exporting both nuclear and missile technology to states like lybia, iran, and pakistan. which way NK goes remain to be seen. but containment has not worked.\n\n \n NK HAS proven that if you can get your nukes operational before the US can get wind of it, you will not see abrams tanks rolling up your street.\n \n \ncivil or economic power does not always translate to political power. bin laden does not want power to buy the latest mercedes, he does not want people thrown in jail, he wants to dictate the future of the ME. he is not a champion of the arabs. why not spend his wealth to buy food, medicine, education?\n\n \n He wants the ME to be able to create its own destiny wihtou US interference. HE wants to protect their way of life.\n \n \n \nbecause someone agrees with the government that do not make them fascist. if they disagree with you it does not make them fascist. if they call you unpatriotic and report you to the authority, that makes them fascists\n.\n \n There is a difference between \"agreeing with\" and blind faith.\n \n \n1. we actually want to keep oil prices low, and this is in contradistinction to what kuwait and saudi arabia wants.\n 2. should we sponsor overthrow of these governments?\n 3. if we stop buying oil from them someone else would.\n 4. democracy in iraq has not even started yet.\n 5. why not the shiite? would it be wrong for christians to be the majority in the US government?\n\n \n 1.WE do not want to keep oil prices low. We want oil prices to be at a level that allows AMerican companies to compete on the international market.\n 2. IS this in relation to #1?\n 3. So, this makes it right?\n 4. NOpe, and it most likely won't. It will probably be something like \"democracy\" in afghanistan.\n 5. BEcause theya re fundamentalists. There is a strong movement in the shiites in Iraq to form a single islamic state with IRan. We don;t want this.\n \n \n \ni don't care to perpetuate the myth that the US is at fault for the ME mess.\n it takes two to tango, one to lead, one to follow.\n to suggest that they are victims perpetuate their sense of helplessness which they certainly are not. all individuals have the power to affect change in the world around them (and yes, how these changes are affect matters as well). otherwise they will always wait for someone else to fix their problem, and looks who is exploiting that now?\n perpetuating the myth empowers the terrorist in the west and the ME\n.\n \n Yep, and the corrupt, money hungry leaders of these middle eastern nations are just a guilty as we are. Apparently the terrorists have figure this out (thus the bombings in Saudi and such).\n \n \nall individuals have the power to affect change in the world around them \n \n \n Thought this was worth quoting again. Incredible how so many Americans can only see the world through American eyes. How does an individual who lives in a society whewre they cannot vote, do not have the right of free speech, the right to bear arms, the right to assemble, or the right to a trial, have the power to change the world around them? HOw do you change yur government when publicly criticizing that govermewnt is likely to get you thrown in jail without a trial for the rest of your life (luckily, your life span in a Saudi jail can be expected to be pretty short).\n \n At that point, you are not a person, you have no more power to change the world around you than my dog does. As far as I know, my dog may think I am a tyranical dictator. I tell him when to pee, I decide when he eats, when he sleeps, when he sits. If he ever tries to \"change the world around him\" I will simply punish him and put him back in line. IF he ever had the audacity to actally BITE me, I would punish him so severely that he woudl never be tempted to do that again.\n \n As a free man with rights, you have the power to change the world around you. As a poor guy in the middle east, you have the \"power\" to shut the hell up and do what you are told.\n \n \ni am not saying we cannot do better. but i refuse to accept full responsibility and be the fall guy.\n\n \n IT is not about being the fall guy, it is simply about accepting responsibility for our actions.yes and no.\n \n \n \nanyone who believes that killing hundreds of innocent civilians do not think as the rest of us. that does make them crazy relative to us, but not irrational perhaps. serial killers always have a reason to their madness, and can be meticulous in their plans. \n \n \n Here is a direct quote from YOU regarding the civilian body count in Iraq\n \n \ni would actually accept twice the numbers! or more even!\n the pre-war estimates were 10x as high.\n i find the 11,000 regretable but acceptable.\n\n \n MAybe they are not so crazy, then. You say there that you would accept twice the numbers, or even more. \n \n Amazing how hypocritical some can be. 11,000 innocent civilians dead for OUR cause is \"regrettable, but acceptable\". A few thousand dead for their cause makes them obvioulsy crazy.", 
   {}, 
   39772, 
   null, 
   1079574300.0
  ], 
  [
   39839, 
   null, 
   "syklopps61", 
   "No, we just didn't think he could be beat. After he had spread his forces thinner, some weaknesses became evident. The rest of the world hoped he would stop at poland, but it didn't really matter whether he did or not, there was nothing that could really be done about it. \n \n \n It sounds like what you are saying is the world saw weaknesses AFTER concessions were made to Hitler. And by saying the rest of the world HOPED he would stop at Poland, that also infers the rest of the world was reluctant to fight and found that appeasement didn't work afterall.\n \n \nSo, it has evcer happened before, it is not happening now, but we need to wipe the earth of them since they MIGHT someday do it.\n\n \n Well, they ARE doing it now, you just seem to be bending over backwards, condemning the U.S. but finding some kind of sick honor in what they are doing. You seem to be knowledgeable of history to some degree, you don't see it repeating now? Granted, Al Qaeda is not a country, but you yourself have stated that they can't be defeated. Sounds a lot like the Germany analogy you have referenced here in these last few posts. So, why are you so quick to say that they DON'T have aspirations of defeating the West and kiling all the infidels?\n \n \nYep, pretty much.\n\n \n Funny, I saw a guy on Fox this morning who wrote a book called the Betrayal of the U.S. or something like that....anyway, he investigated how France actually stayed OUT of the war for oil and that's why they stonewalled our efforts in the U.N. and didn't join the coalition. There was an area in Iraq, some marshland where the people had lived for thousands of years. The French wanted to work there but did not want to be shot at, so they asked Hussein to get rid of them...and he did, draining the marshlands and destroying these peoples lives, probably killing many of them, all for the almighty buck. I know this may be shocking to Liberals, that the righteous French could do something for money like that, and I'm sure they will accuse this guy of making it all up. Makes a lot of sense though\n \n \nTHe tribal people of the midddle east (the middle east was still tribal prior to WWII) have always been considered some of the fiercest warriors in the world. They have long memories and they never forget when they are wronged. \n \n \n I wasn't aware that having a long memory made one a fierce warrior. \n \n \nI know lots of guys who have \"deserted\" from law enfocement. They get tired of writing tickets and find a different job. As far as giving your life in law enforcement, being a housewife is more dangerous \n \n \n HMMMMMM so apparently you ARE saying what I thought you said. Nobody else can give their life for a worthwhile cause other than those in the military. Plus, you have the nerve to make light of their sacrifice? Sounds like somebody has some issues\n \n \nTHese people had an operaing civilization with publicly lighted streets and public libraries with thousands of volumes when the English were still filing their teeth to points and putting orange clay int heir hair so they could fashion it into spikes. \n \n \n How far back are we going now? I didn't say that they never had a culture, but they certainly have not made any progress since. In fact, I think that is one of the reasons why they DO hate the West so much. The Middle East certainly did have a thriving culture centuries ago, but they have sat back and watched as Europe and then the U.S. dominate the world. And to make things worse, our military has shown their \"warriors\" to be spineless, and this is a slap in the face to them", 
   {}, 
   39823, 
   null, 
   1079583960.0
  ], 
  [
   39846, 
   null, 
   "fracas", 
   "It never fails to amaze me how hypocritical people are on this point. WE fought communism to \"defend our way of life\" we fought WWII for the same reason. Defending our way of life seems to be something Americans are very comfortable with. \n \n When a bunch of muslims decide they want to defend THEIR way of life, they are evil animals.\n\n \n there is a world of difference on defending a way of life and intentional killing of civilians to make a point. the war against terrorism isn't against the muslim way of life.\n \nHere is a pretty good article by Steven Shalom about hte IRan Iraq war. http://www.zmag.org/zmag/articles/ShalomIranIraq.html\n \n Take a look. America cringed??? Where do you suppose he got all those ittle chemical and biological nasties (HINT- his anthrax is the Ames strain, as in Aimes, Iowa). \n \n PArt of the reason Saddam believed he had \"permission\" to invade Kuwait was that he felt he was owed a little something by the US for fighting their war at a cost of billions of dollars.\n \n Read some of Kissingers books. Some of them cover the ME situation during regans presidency pretty well.\n\n good read, thanks. but it did say that the primary responsibility for the war was iran and iraq.\n i remember those days after iran fell out of our sphere of influence and the concern about the soviets as well as the oil supply. nothing was there that contradicted what i said. the US did cringed when he went to war and did not take steps to stop him. we didn't stop him because there was an opportunity to gain. and saddam was a fool to think the US would support him against iraq. a mistaken impression on his part does not make the US culpable. regarding anthrax, this a medical strain that was sold, not the biograde weapon strain.\n \nUh, the russians were selling oil cheaper than the ME up until their induction into OPEC. COnvincing them to join opec (and raise the price of their oil) was seen as vital for protecting the interests of US oil companies We don;t support really low oil prices, because US producers cannot produce oil as cheaply as it is done int he rest of the world. \n\n the oil was kept low inorder to undermine soviet income from their own oil sales. part of the economic aspect of the cold war. this was seen as more important than maintaining profit even.\n \nOr, we could do what we do with OTHER dictatorial governments with histories of humanitarian abuse, which is to impose trade restrictions on them.\n\n such as?\n \nThey want to force the US to quit meddling in middle eastern affairs, end of story. \n\n its not going to happen. the US will never withraw from the ME and the terrorist would not stop being terrorist even if we did.\n \nThat is the only way to combat terrorism without \"resorting\" to compromise and re-examining your policies. Keeping ur resolve and determination doesn't do squat, unless you can find the terrorists and bring them down, or put measures in place to stop their attacks. The British were pretty harsh when dealing with the IRA, and it didn;t seem to be effective. I guess to really beat terrorism, I mean to end it without having to stand up and go \"Ok, we screwed up some\", the Russina policy is the only way to go. Again, are you willing to resort to this?\n\n you speak as if its an either or response. you have to do both. and by declaring it an act of war rather than a criminal act, we should hunt them down and destroy them. \n \nNK HAS proven that if you can get your nukes operational before the US can get wind of it, you will not see abrams tanks rolling up your street.\n\n thus negotiation will get nowhere.\n you do realize there are plans for a winnable war against NK, right? its just that we haven't exhausted ourselves with negotiation yet.\n \nHe wants the ME to be able to create its own destiny wihtou US interference. HE wants to protect their way of life.\n\n nope. he doesn't want to protect their way of life other than his way of life. history and his own actions have demonstrated that its his ways or death. there is no protection there other than a protection racket. this is the myth of bin laden has built, just like every other radical despot coming to power through death and mayhem. the choices he make define his moral principles and predict his likely reign. if you thought it was a bad idea of empower saddam through tacit support and approval, empowering bin laden would be tenfold worse. the cries then would be why we didn't stop him when we had the chance. we didn't stop him because he promissed us oil in exchange for the ME.\n \nThere is a difference between \"agreeing with\" and blind faith.\n\n which goes both ways.\n \n1.WE do not want to keep oil prices low. We want oil prices to be at a level that allows AMerican companies to compete on the international market.\n 2. IS this in relation to #1?\n 3. So, this makes it right?\n 4. NOpe, and it most likely won't. It will probably be something like \"democracy\" in afghanistan.\n 5. BEcause theya re fundamentalists. There is a strong movement in the shiites in Iraq to form a single islamic state with IRan. We don;t want this.\n\n 1. the oil profit the US companies get from the ME is based on processing, not sales. higher oil prices may only help the oil companies but not the oil consuming manufacturing companies, or the service companies\n 2. yes\n 3. no, just that the cause for ME turmoil won't be alleviated if the US withraw.\n 4. funny your centric views. what is wrong with democracy in afghanistan?\n 5. the sunni have more radical fundamentalism than the shiite. the shiite are fundmentalist in the sense that they are more religious, but for the most part through history, they have been on the receiving end of abuse rather than the giving end. iran is an aberation and iranians realize that like communism, a fail experiment. the shiite in iraq knows this as well and have made no moves except by a few extremist, to gather dominance as the sunni have. they are more interested in worship than in ruling.\n \nYep, and the corrupt, money hungry leaders of these middle eastern nations are just a guilty as we are. Apparently the terrorists have figure this out (thus the bombings in Saudi and such).\n\n they are more guilty. it is one thing for foreigners to exploit your people, it is quite another to exploit your own. \n \nThought this was worth quoting again. Incredible how so many Americans can only see the world through American eyes. How does an individual who lives in a society whewre they cannot vote, do not have the right of free speech, the right to bear arms, the right to assemble, or the right to a trial, have the power to change the world around them? HOw do you change yur government when publicly criticizing that govermewnt is likely to get you thrown in jail without a trial for the rest of your life (luckily, your life span in a Saudi jail can be expected to be pretty short).\n\n you risk your life in revolution. been done over and over again. but if you rather live as a victim than change the system with your life than you deserve what you get. \n \nAt that point, you are not a person, you have no more power to change the world around you than my dog does. As far as I know, my dog may think I am a tyranical dictator. I tell him when to pee, I decide when he eats, when he sleeps, when he sits. If he ever tries to \"change the world around him\" I will simply punish him and put him back in line. IF he ever had the audacity to actally BITE me, I would punish him so severely that he woudl never be tempted to do that again.\n\n some dogs never let go once they have bitten.\n \nAs a free man with rights, you have the power to change the world around you. As a poor guy in the middle east, you have the \"power\" to shut the hell up and do what you are told.\n\n as a free man with rights there is no need to change the world, so you can sit an talk your way through things. as a poor guy in the ME you can rise. look at iran for instance.\n \nIT is not about being the fall guy, it is simply about accepting responsibility for our actions.yes and no.\n\n to accept full responsibility for partial conduct is to be the fall guy.\n \nHere is a direct quote from YOU regarding the civilian body count in Iraq\n \n \n \n MAybe they are not so crazy, then. You say there that you would accept twice the numbers, or even more. \n \n Amazing how hypocritical some can be. 11,000 innocent civilians dead for OUR cause is \"regrettable, but acceptable\". A few thousand dead for their cause makes them obvioulsy crazy.\n\n if you switch the numbers i would still be fine with it. if we lost 25,000 men in a war that can reverse the course of events and bring a better life for 25,000,000 iraqi, transform an entire region, and bring better security to the 250,000,000 americans then yeah.\n but the real difference is the intent of those deaths. one side intentionally kill civillians, the other does not. this was by deliberate choice on both sides. and the choices we make define who we are and this has moral and value implications.", 
   {}, 
   39826, 
   null, 
   1079588040.0
  ], 
  [
   39854, 
   null, 
   "jitobear", 
   "Okay, fair enough, but do WE (the U.S.) owe anything to any other country?\n\n \n Honestly, I don't know. It's a hard question. Unquestionalbly \"yes\" - but not necesarily in the form of aid. It's what we all owe each other and are all so bad at giving - a little respect.\n \n These are two editorials from the Mpls paper.\n \n I thought they were good.\n \n Some people are characterizing the results of the Spanish election as a victory for terrorism. After going through a horror comparable to 9/11, Spaniards are not receiving empathy, they are being portrayed as cowardly. Spain is being examined through the lens of a particular political agenda, the \"you are either for us or against us\" mentality. \n \n The Spanish election certainly was impacted by the terrorist attack, but the results were primarily due to the behavior of the government, not fear of terrorists. \n \n The vast majority of Spanish people opposed the invasion of Iraq and felt that they were dragged into war by Prime Minister Jose Maria Aznar. After the bombings in Madrid, the Aznar government immediately blamed ETA and attempted to manipulate the media to prevent speculation that an Islamic fundamentalist group was responsible.\n \n The Spanish people voted Aznar out because he arrogantly ignored their concerns about the war and they believe he lied to them after the bombings in Madrid. These are logical reasons for changing leaders.\n \n - Mary Anderson, Minneapolis.\n \n Many readers have commented on the supposed \"victory\" that the terrorists have gained in the recent Spanish national elections. They point to the fact that the new prime minister has vowed to pull out Spain's 1,300 troops from Iraq. \n \n These readers must have confused the idea of letting terrorists win with the idea of letting a democracy work. Because a country goes a different route than the United States does not mean that the people are weak or cowardly.\n \n If we are promoting democracy in Iraq, we should be praising its function in Spain, not berating the outcomes. \n \n - Tim Lindberg, Morris, Minn.", 
   {}, 
   39797, 
   null, 
   1079594040.0
  ], 
  [
   39861, 
   null, 
   "daewoo", 
   "Wow. Looks like AQ agrees with us. No reason to attack spain \n now\n \n http://www.reuters.co.uk/newsPackageArticle.jhtml?type=topNews&storyID=478050&section=news\n \n Guess they actually are working towards a set of stated goals as opposed to just attacking hte western world at random.", 
   {}, 
   39854, 
   null, 
   1079601900.0
  ], 
  [
   39869, 
   null, 
   "syklopps61", 
   "Honestly, I don't know. It's a hard question. Unquestionalbly \"yes\" - but not necesarily in the form of aid. It's what we all owe each other and are all so bad at giving - a little respect.\n\n \n Okay, don't you think that these other countries owe US respect as well? Afterall, there is no question that we are THE world leader and as such deserve respect-all we seem to get is criticism left and right. I used to work in D.C. in the mid 90's, and one day saw Clinton's motorcade drive by. I LOATHE the man but still got goosebumps because that was the PRESIDENT\n \n And regarding those editorials? I think they are wrong. When the bombings occurred, I felt for the Spaniards, it was after the election that my criticism began. The reason it was different for us was because our government/people didn't back down and give those animals a victory. The fact remains that although the people opposed the war, the socialist party was losing, and suddenly after the attacks, they win. THAT is why there is little sympathy-they gave in to terrorism, and in turn other democracies can/will be affected.", 
   {}, 
   39854, 
   null, 
   1079621520.0
  ], 
  [
   39874, 
   null, 
   "Phunting", 
   "Okay, don't you think that these other countries owe US respect as well?\n\n Of course not. Yes the US is THE world leader, so what? That doesn't mean they deserve respect. Democracy thrives on criticism, you need a critical eye to keep the powerful in check. Ever stop to think there may be a reason for that criticism?", 
   {}, 
   39869, 
   null, 
   1079624220.0
  ], 
  [
   39875, 
   null, 
   "Eddie", 
   "If the US had allowed a UN resolution on the Iraq issue, the spanish socialist government would have retained their trops in Iraq. Respect is not a one way street, support is not a one way street, friendship is not a one way street, an alliance is not a one way street....", 
   {}, 
   39874, 
   null, 
   1079624580.0
  ], 
  [
   39881, 
   null, 
   "syklopps61", 
   "Of course not. Yes the US is THE world leader, so what? That doesn't mean they deserve respect. Democracy thrives on criticism, you need a critical eye to keep the powerful in check. Ever stop to think there may be a reason for that criticism?\n\n\n \n OF COURSE NOT! This speaks volumes about you, you don't give this country ANY respect. And the reason for the criticism is envy. And does that critical eye of which you speak apply to Democrats/Liberals/Socialists in power, here and around the world?", 
   {}, 
   39874, 
   null, 
   1079629380.0
  ], 
  [
   39882, 
   null, 
   "syklopps61", 
   "If the US had allowed a UN resolution on the Iraq issue, the spanish socialist government would have retained their trops in Iraq. Respect is not a one way street, support is not a one way street, friendship is not a one way street, an alliance is not a one way street....\n\n\n \n Are you speaking of all of the umpteen resolutions the U.N. passed regarding Iraq? Oh wait, THAT'S right, just one more would have done the trick!! LOL\n \n Now, the latter part of your statement I agree with, everything is not a one way street. I will respect other countries when we are given the respect we deserve. As for the others (support, friendship, alliance)-seems to me we have demonstrated that over and over again and yet we get none in return", 
   {}, 
   39875, 
   null, 
   1079629620.0
  ], 
  [
   39887, 
   null, 
   "Eddie", 
   "Are you speaking of all of the umpteen resolutions the U.N. passed regarding Iraq? Oh wait, THAT'S right, just one more would have done the trick!! LOL\n \n\n \n I was refering to a UN resolution where UN would take control of the occupation of Iraq... Sorry if I caused any confusion.", 
   {}, 
   39882, 
   null, 
   1079631300.0
  ], 
  [
   39888, 
   null, 
   "Eddie", 
   "Now, the latter part of your statement I agree with, everything is not a one way street. I will respect other countries when we are given the respect we deserve. As for the others (support, friendship, alliance)-seems to me we have demonstrated that over and over again and yet we get none in return\n\n \n I`m sorry you feel this way.... I`ll try to find examples where we have stood up for eachother since 9/11. I`m quite confident that there are many, many examples where the alliance, support and friendship between europe and america has been honoured.", 
   {}, 
   39882, 
   null, 
   1079631480.0
  ], 
  [
   39889, 
   null, 
   "fracas", 
   "Wow. Looks like AQ agrees with us. No reason to attack spain \n now\n \n http://www.reuters.co.uk/newsPackageArticle.jhtml?type=topNews&storyID=478050&section=news\n \n Guess they actually are working towards a set of stated goals as opposed to just attacking hte western world at random.\n\n \n LOL\n 1. kill innocent without warnings\n 2. made demands / manipulate crisis to get demands\n 3. promise no more killing to allow time for demands to be met\n \n sounds like a great strategy for any group to follow!\n hell, why put anything up for legislative or political debate?\n \n next time i want congress to pass a bill i want, i'll just blow a bunch of people up and promis not to do so again if my demands are met\n \n at least until i have new demands\n \n LOL", 
   {}, 
   39861, 
   null, 
   1079631840.0
  ], 
  [
   39898, 
   null, 
   "syklopps61", 
   "I`m sorry you feel this way.... I`ll try to find examples where we have stood up for eachother since 9/11. I`m quite confident that there are many, many examples where the alliance, support and friendship between europe and america has been honoured.\n\n\n \n Don't mistake what I meant, I know there are a number of countries that have supported us. I am very much appreciative that the U.K., Italy, Poland, etc. have supported us. I am obviously referring to our so called allies France and Germany, plus all the Third World nations that constantly criticize and complain despite whatever assistance we give them", 
   {}, 
   39888, 
   null, 
   1079634120.0
  ], 
  [
   39899, 
   null, 
   "syklopps61", 
   "I was refering to a UN resolution where UN would take control of the occupation of Iraq... Sorry if I caused any confusion.\n\n\n \n After the debacle with the U.N. leading up to the war, why SHOULD we have turned over control to the U.N.? They wanted control so that the countries that stood by and watched us do the dirty work could benefit with reconstruction contracts", 
   {}, 
   39887, 
   null, 
   1079634240.0
  ], 
  [
   39907, 
   null, 
   "Eddie", 
   "Don't mistake what I meant, I know there are a number of countries that have supported us. I am very much appreciative that the U.K., Italy, Poland, etc. have supported us. I am obviously referring to our so called allies France and Germany, plus all the Third World nations that constantly criticize and complain despite whatever assistance we give them\n\n \n I think you would find that there have been a lot of support from Germany and France as well.", 
   {}, 
   39898, 
   null, 
   1079637540.0
  ], 
  [
   39912, 
   null, 
   "Eddie", 
   "After the debacle with the U.N. leading up to the war, why SHOULD we have turned over control to the U.N.? They wanted control so that the countries that stood by and watched us do the dirty work could benefit with reconstruction contracts\n\n \n Yes, but then the Zapato government would not have been forced to withdraw the Spanish troops... And this is actually my point. US do not want to hand over the control of the ocupation of Iraq to the UN, the spanish public do not want to support the ocupation of Iraq unless it is controled by the UN (or rather the current Spanish goverment pledged not to support the ocupation unless it was controled by the UN). There is nothing wrong with wanting two different things, and there is nothing wrong with acting on your own interests. Therefor US refused to give up the control of the ocupation and spain withdrew their forces. The fact that you seem to blame the Spanish government for acting on the will of their public (and their pledges to their voters) sounds like you assume that countries should unconditonally act according to american interests.. This is not how it works... It is not a one way street. Its a quagmire of national interests, domestic politics and international relations...", 
   {}, 
   39899, 
   null, 
   1079638140.0
  ], 
  [
   39919, 
   null, 
   "Phunting", 
   "This speaks volumes about you, you don't give this country ANY respect.\n\n How does it speak about me? And why do you say I give the states no respect?\n \n \n \nAnd the reason for the criticism is envy.\n\n And what do you base that upon?\n \n \n \nAnd does that critical eye of which you speak apply to Democrats/Liberals/Socialists in power, here and around the world?\n\n Of course. I may be many things but I am not a hypocrite.\n \n \n \nI will respect other countries when we are given the respect we deserve.\n\n From what you have posted I doubt it.\n \n \n \nI am obviously referring to our so called allies France and Germany\n \n They are doing what they think is best just as the US is. By the same token France or Germany could turn around and complain about the US not honouring their friendship by going against them. It is all subjective.\n \n \n \nwhy SHOULD we have turned over control to the U.N.? They wanted control so that the countries that stood by and watched us do the dirty work could benefit with reconstruction contracts\n\n Because this is not about (or should not be about) reconstruction contracts. This is about finding the best means to create a stable and peaceful Iraq.", 
   {}, 
   39881, 
   null, 
   1079638980.0
  ], 
  [
   39927, 
   null, 
   "fracas", 
   "@phunting\n \n comparing the UN reconstruction of Bosnia and Kosovo versus the reconstruction of afghanistan or iraq, taken in perspective of equivalent time (its been only 1 year with iraq)\n what makes you think the UN would do a better job?", 
   {}, 
   39919, 
   null, 
   1079641080.0
  ], 
  [
   39934, 
   null, 
   "Eddie", 
   "@phunting\n \n comparing the UN reconstruction of Bosnia and Kosovo versus the reconstruction of afghanistan or iraq, taken in perspective of equivalent time (its been only 1 year with iraq)\n what makes you think the UN would do a better job?\n\n \n Well, the most important pro of a UN administered occutpations would be that it would make the ocupation legitimate in the eyes of many of the world leaders (and population) that today see it as american imperialism (perhaps like Spain?).\n \n But then there are cons of course. It`s really a trade-off. And I don`t really know what would be more efficient or positive from the Iraqi view point.\n \n And then we have the issue with the re-building contracts. To allow any firm, regardless of nationality, to bid on the contracts would surely make the re-building process more efficient and/or cheaper.", 
   {}, 
   39927, 
   null, 
   1079641920.0
  ], 
  [
   39968, 
   null, 
   "nick", 
   "Guess it is time to boycot all Spanish goods, kick their fisherman out of the North Sea, the UK to leave the EU and to add the dagos to the list of axis of evil.\n \n What it is to have the Neighbours from Hell...", 
   {
    "post_info": {
     "post_title": "Sorry, he's from Barcelona"
    }
   }, 
   39934, 
   null, 
   1079655240.0
  ], 
  [
   39977, 
   null, 
   "jitobear", 
   "Okay, don't you think that these other countries owe US respect as well? Afterall, there is no question that we are THE world leader and as such deserve respect-all we seem to get is criticism left and right. I used to work in D.C. in the mid 90's, and one day saw Clinton's motorcade drive by. I LOATHE the man but still got goosebumps because that was the PRESIDENT\n\n \n I don't think we are due more or less respect than any other country. But respect does not necesarily mean you agree. I respect many people that I don't agree with.\n \n \nAnd regarding those editorials? I think they are wrong. When the bombings occurred, I felt for the Spaniards, it was after the election that my criticism began. The reason it was different for us was because our government/people didn't back down and give those animals a victory. The fact remains that although the people opposed the war, the socialist party was losing, and suddenly after the attacks, they win. THAT is why there is little sympathy-they gave in to terrorism, and in turn other democracies can/will be affected.\n\n \n And there are those who would say (including me) that the Patriot Acts, which blatantly ignore the Constitution - the very pricniples this country was founded on, is giving in to terrorism as well.", 
   {}, 
   39869, 
   null, 
   1079658420.0
  ], 
  [
   39978, 
   null, 
   "jim's trucking", 
   "How would you suggest \"defeating\" them? The problem with fighteing terrorists and radicals seems to be that for every one you martyr, 2 more pop up in their place. WE kill bin Laden, we create 50 more Bin Ladens. The enemy is everywhere, in every country in the world, including interspersed with your own population. How exactly do you combat an organisation like this?\n\n \n Apparently, you've not attended a good old fashioned rat-killin'. You seek them out, reduce their active population substantially, then go about your business. You may have to do it again later, but you keep on killin' rats until all the rats are DEAD!", 
   {}, 
   39681, 
   null, 
   1079659860.0
  ], 
  [
   39981, 
   null, 
   "jim's trucking", 
   "...People are alsways willing to die for their convictions until the time actually comes, then there is a bunch of backpedaling and whining and begging.\n\n \n The suicide bombers of late don't seem to be people then, do they? They are dutifully following their fearless leader's encouragements.\n \n The many thousands of brave soldiers that have died in past wars, for either side, seem to disprove your ridiculous theory also.\n \n Saddam sent his men off, encouraging them to fight to the death. Ahhh yes, Saddam, the fearless leader  who had promised the US the \"mother of all wars\". Then when he was discovered cowering in a RAT-HOLE with his pistol at his side, he offered no resistance and gave up like the chickenspit  he really is.\n \n (Many Iraqi people disdained him for not firing a shot.)\n \n He is just one of the many rats we have captured or killed. The rest will follow.", 
   {}, 
   39691, 
   null, 
   1079660760.0
  ], 
  [
   40005, 
   null, 
   "syklopps61", 
   "And there are those who would say (including me) that the Patriot Acts, which blatantly ignore the Constitution - the very pricniples this country was founded on, is giving in to terrorism as well\n.\n \n Can I ask, did you feel the same when Clinton's Justice Department was practically out of control? I remember all the talk of the jackbooted thugs or something like that-ATF, FBI-busting down doors of innocent people, even believe there was at least one killing of an innocent. As far as giving in to terrorism, I disagree. The Justice Department has to appear before Congress every six months to answer questions regarding the Patriot Act-there have been no abuses of this power. Unfortunately, this was a necessary evil to defend our way of life. And remember, Lincoln suspended habeas corpus during the Civil War, and this country bounced back just fine. We have an unbelievable system, something I am in awe of everyday", 
   {}, 
   39977, 
   null, 
   1079672580.0
  ], 
  [
   40010, 
   null, 
   "mizmaxx", 
   "anyone who intentionally kill civilians do not think like reasonable men. they do it for the power they aquire in the acts. to demonstrate their acts successful empowers them. and empowered they will use that same power for more acts of violence. get it?\n\n I guess that means that none of the US presidents have ever been \"reasonable men\". Or didn't you know that was what they meant when they said \"collateral damage\"?", 
   {}, 
   39591, 
   null, 
   1079675280.0
  ], 
  [
   40064, 
   null, 
   "fracas", 
   "I guess that means that none of the US presidents have ever been \"reasonable men\". Or didn't you know that was what they meant when they said \"collateral damage\"?\n\n \n \"intentionally\"", 
   {}, 
   40010, 
   null, 
   1079711820.0
  ], 
  [
   40072, 
   null, 
   "nick", 
   "This might be a tad tangential but...Isn't it odd that the people who are claiming that the war against Iraq was illegal and flouted international law by bypassing the UN were quite happy when that state of affairs prevailed in the Balkans war which was fought by the Western alliance without UN mandate? ie nothing was signed in triplicate.\n \n And what was that war about anyway? It seems like we fought for the wrong side. Instead of supporting the Serbs we sided with the islamafacists muslims. And now they are fighting again and Nato is going to get involved. Why? They love killing each other over there. It is their national pastime. They have been doing it for centuries.All we got out of it in the UK was a flood of scumbag Kossovans bringing with them crime, TB and a huge bill for British taxpayers supporting them on welfare. The Clintonistas supported the meaningless Western intervention in former Yugoslavia yet they question this wholly justifed war on terror in Iraq. Go figure.", 
   {
    "post_info": {
     "post_title": "pious cant and double standards of the liberal left"
    }
   }, 
   40064, 
   null, 
   1079717280.0
  ], 
  [
   40074, 
   null, 
   "Eddie", 
   "This might be a tad tangential but...Isn't it odd that the people who are claiming that the war against Iraq was illegal and flouted international law by bypassing the UN were quite happy when that state of affairs prevailed in the Balkans war which was fought by the Western alliance without UN mandate? ie nothing was signed in triplicate.\n \n And what was that war about anyway? It seems like we fought for the wrong side. Instead of supporting the Serbs we sided with the islamafacists muslims. And now they are fighting again and Nato is going to get involved. Why? They love killing each other over there. It is their national pastime. They have been doing it for centuries.All we got out of it in the UK was a flood of scumbag Kossovans bringing with them crime, TB and a huge bill for British taxpayers supporting them on welfare. The Clintonistas supported the meaningless Western intervention in former Yugoslavia yet they question this wholly justifed war on terror in Iraq. Go figure.\n\n \n Well I would say that the intervention in the Balkan conflict was a good example of power politics where NATO intervened to disturb the russian influence over the area. Just like Iraq, protection of human rights was just a way to legitimate the war. But that`s just my oppinion.\n \n I don`t know if you guys choose the wrong side... Islamofascists or stalinist/fascist dictator... I don`t think there was a wrong or right side in that conflict. They all tried to exterminate the other ethnic minoritees where possible.", 
   {}, 
   40072, 
   null, 
   1079717820.0
  ], 
  [
   40075, 
   null, 
   "The_Comedian", 
   "Imho parts of the Muslims on the balkan became fundamentalists because after the civil war, Saudi Arabia built lots of mosques and koran schools.\n Had the EU, UN or NATO done better in investing in education, there could be less problems with rising fundamentalism in Europe.", 
   {}, 
   40074, 
   null, 
   1079718660.0
  ], 
  [
   40157, 
   null, 
   "jitobear", 
   ".\n \n Can I ask, did you feel the same when Clinton's Justice Department was practically out of control? I remember all the talk of the jackbooted thugs or something like that-ATF, FBI-busting down doors of innocent people, even believe there was at least one killing of an innocent. As far as giving in to terrorism, I disagree. The Justice Department has to appear before Congress every six months to answer questions regarding the Patriot Act-there have been no abuses of this power. Unfortunately, this was a necessary evil to defend our way of life. And remember, Lincoln suspended habeas corpus during the Civil War, and this country bounced back just fine. We have an unbelievable system, something I am in awe of everyday\n\n \n I am currently unaware of the incidents you are referring to, but if they true - of course I am horrified. You really need to get over this idea that Clinton is some kind of hero for me. I think he was a better president than Bush, but he was still a snake.\n \n There is no excuse for the Patriot Act. None. To abondon the constitution, even (especially) in the face of danger, is the worst kind of cowardice for our president. I feel it is paramount to treason. And I have heard stories where it has been abused. Anytime the constitution is ignored it's abuse anyway. \n \n I think it's naive to believe that this harmless. A power granted is ALWAYS abused. The founding fathers knew this. That is why there are checks and balances, the Constitution and the Bill of rights in the first place. It doesn't matter how great the system is. It is still run by mere humans, and more often than not, humans aren't nice - especially when granted power.\n \n This is my issue in the next election. This is why I want Bush out. Nothing would convince me to vote for the man. I would rather gargle razor blades. The Patriot Act(s) make me so angry I get sick when I think of them. \n \n And Ashcroft ..... emoticon_angry", 
   {}, 
   40005, 
   null, 
   1079747040.0
  ], 
  [
   40161, 
   null, 
   "plotter", 
   "This might be a tad tangential but...Isn't it odd that the people who are claiming that the war against Iraq was illegal and flouted international law by bypassing the UN were quite happy when that state of affairs prevailed in the Balkans war which was fought by the Western alliance without UN mandate? ie nothing was signed in triplicate.\n \n And what was that war about anyway? It seems like we fought for the wrong side. Instead of supporting the Serbs we sided with the islamafacists muslims. And now they are fighting again and Nato is going to get involved. Why? They love killing each other over there. It is their national pastime. They have been doing it for centuries.All we got out of it in the UK was a flood of scumbag Kossovans bringing with them crime, TB and a huge bill for British taxpayers supporting them on welfare. The Clintonistas supported the meaningless Western intervention in former Yugoslavia yet they question this wholly justifed war on terror in Iraq. Go figure.\n\n \n Good points, as far as i remember there was a large vocal anti war movement against the illegal bombing of yugoslavia.\n \n Good points about kossovans, in reality theres no such thing, there albanians, serbs should have been left to it, probably would have solved half the crime rates in europe had the serbs werent stopped. \n \n Most of the asylum seekers, werent even from kosovo, they were lazy albanians from albania looking for a free ride, and idiot blair fell for it.", 
   {}, 
   40072, 
   null, 
   1079748780.0
  ], 
  [
   40173, 
   null, 
   "syklopps61", 
   "I am currently unaware of the incidents you are referring to, but if they true - of course I am horrified.\n\n \n Well, Waco for one, but I have to admit I can't recall specific other. I DO remember that jackbooted thugs thing going around during that time, as well as one person's door being busted down and someone being shot, turns out they were innocent\n \n \nYou really need to get over this idea that Clinton is some kind of hero for me. \n \n \n Well, you HAVE admitted you're a Liberal, and you all stick together :-P Funnny though, every Liberal I hear, other than pundits, always say that Clinton was scum, but during his troubles he was sure supported by the Liberals\n \n \nI think he was a better president than Bush, but he was still a snake.\n\n \n Sounds like something Kerry would say LOL How was he better? He had more integrity? LOL Better policies, foreign and domestic? LOL\n \n \nAnd I have heard stories where it has been abused. \n \n \n You can't come up with ONE because it hasn't happened. I believe even the ACLU is watching it closely and even THEY can't come up with one instance\n \n \nI think it's naive to believe that this harmless. A power granted is ALWAYS abused. The founding fathers knew this. That is why there are checks and balances, the Constitution and the Bill of rights in the first place. It doesn't matter how great the system is. It is still run by mere humans, and more often than not, humans aren't nice - especially when granted power.\n\n \n A power is NOT always abused-I refer to the above. And you're right, those checks and balances are still in play\n \n \nThis is my issue in the next election. This is why I want Bush out. Nothing would convince me to vote for the man. I would rather gargle razor blades. The Patriot Act(s) make me so angry I get sick when I think of them. \n \n \n It's your issue because it's the only one you Liberals have been able to come up with, and the Liberals even have to lie about it at that", 
   {}, 
   40157, 
   null, 
   1079751480.0
  ], 
  [
   40249, 
   null, 
   "jitobear", 
   "Sky - \n \n I no longer intend to debate or discuss anything with you. I generally welcome and encourage differing points of view that lead to critical thinking (on my part) and constructive conversation. However, you persistently put words in my mouth, make assumptions about my intentions, imply that I am a liar (and other slanderous ideas as to my chracter) and deny me the simple respect of acknowledging that I do my own thinking. You can't seem to see past your stereotype of liberals to see or hear a thing I am saying. All you seem to want is to preach to the choir and insult anyone who has a differing point of view. Consider our conversations over.\n \n - Leslie", 
   {}, 
   40173, 
   null, 
   1079812320.0
  ], 
  [
   40343, 
   null, 
   "syklopps61", 
   "Sky - \n \n I no longer intend to debate or discuss anything with you. I generally welcome and encourage differing points of view that lead to critical thinking (on my part) and constructive conversation. However, you persistently put words in my mouth, make assumptions about my intentions, imply that I am a liar (and other slanderous ideas as to my chracter) and deny me the simple respect of acknowledging that I do my own thinking. You can't seem to see past your stereotype of liberals to see or hear a thing I am saying. All you seem to want is to preach to the choir and insult anyone who has a differing point of view. Consider our conversations over.\n \n - Leslie\n\n\n \n Well, I'm sure sorry to hear that. We all have stereotypes, none of us are above that. However, in looking over my post, save for the one comment about all Liberals supporting Clinton (although I believe this to be true), I only asked for proof of these examples of the abuse of the Patriot Act that you have heard. And since there ARE none, one can only assume that it's an issue that those opposed to Bush are repeating over and over again in an attempt to have people believe that it's the truth", 
   {}, 
   40249, 
   null, 
   1079890800.0
  ], 
  [
   40512, 
   null, 
   "hvozdany", 
   "\"intentionally\"\n\n \n The US did intentioanally killed civilians in WWII...", 
   {}, 
   40064, 
   null, 
   1080005880.0
  ], 
  [
   42112, 
   null, 
   "fracas", 
   "The US did intentioanally killed civilians in WWII...\n\n \n oh? \n 1. what were the purely civilian targets? (both nagasaki and hiroshima were military industrial centers btw, to save you the trouble)\n 2. it was a different world then where total war was acceptable. notice we have tried to move away from that by limiting collateral civilian kills.\n \n \n btw, to those who argue that Spain would not be attacked for aceding to terrorist demands\n \n Bomb F\\ound on Spanish Highspeed Rail Track", 
   {}, 
   40512, 
   null, 
   1080936840.0
  ], 
  [
   44471, 
   null, 
   "Dwight", 
   "I'm always amazed by how some of you folks from the US have such a limited point of view, memory and attention span.\n \n I'm always amazed by the \"Germany doesn't support the war on terror\" argument.\n \n Really. \n \n It's not like the 3rd largest contingent of troops in the WAT comes from Germany.\n \n It's not like intelligence collaboration from Germany with the US has proven CRUCIAL in the WAT.\n \n It's not like we have been activley targeted by A-Q and Bin Laden has us on his list. The Germans were simply lucky or competent enough to foils SEVERAL attacks in the last 6 months.\n \n It's not like 30 of my countrymen have been killed in a attack on a tourist centre in Indonesia which intentionally targeted them.\n \n It's not like we DON`T have a naval battlegroup in the mediterranean and the indian ocean to assist US naval forces in combating Al-Q (and associated) smugglers.\n \n It's not like our troops guarded undermanned US bases on our soil.\n \n It's not like we put risked retaliation by allowing US troops to use our homeland as staging ground for the war against Iraq.\n \n It's not like we didn't give the Turks and Israelis PATRIOTS durting the Iraq war for free.\n \n It's not like we didn't pony up our troops presence in the Balkans relievening several thousand US troops and logisticans to fight in the war in Iraq.\n \n It's not like we didn't have a state-of-the-art NBC defense and dtection company in Kuwait to train and assist Kuwaiti authorities in the case Saddam has NBC weapons.\n \n It's not like we didn't provide medevac capabilites to the US during the Iraq war.\n \n It's not like we don't have a large contingent of troops in Afgahnistan to assist in the reconstruction.\n \n It's not like humanitarian organizations from my country don't work in Iraq or Afgahnistan.\n \n It's not like we didn't send commandoes in to fight in Enduring Freedom.\n \n \n \n As I said, I'm always amazed by how some of you folks can forget aboiut such things. Really.\n \n And you'd better respect the Spaniards decision and election. They've taken quite a beating from the US right for doing the right thing. They've lost 300 people.The last thing they need is a kick in the nads from you chickenhawks. \n \n Shame on you!\n \n - Dwight", 
   {
    "unicode_changes_made": true
   }, 
   42112, 
   null, 
   1082284920.0
  ], 
  [
   46439, 
   null, 
   "Maineiac", 
   "I can't say that I'm surprised these smaller countries are pulling out.They don't have the desire to fight terrorism that we do. They would rather stick their heads in the sand than confront terrorism.They also feel that this is our fight.They are more of a symbolic presence than anything,to show support for us.I believe we should show them the same support by cutting foreign aid to their countries,or perhaps put a duty on their products coming into the U.S.,perhaps for a few months,just to get our point across. emoticon_xchicken", 
   {}, 
   40064, 
   null, 
   1083177540.0
  ], 
  [
   46444, 
   null, 
   "Rev. HellH0und", 
   "I'm always amazed by how some of you folks from the US have such a limited point of view, memory and attention span.\n \n\n \n \n Unlight the enlightened Germans... We do not want to see the Germans mad....\n \n \n\n I'm always amazed by the \"Germany doesn't support the war on terror\" argument.\n \n Really. \n \n\n \n \n Governmental support and popular support are 2 different things.\n \n \n couple of questions...\n \n is your chancellor in favor or opposed to the war in iraq?\n \n What do your polls show in support or against?\n \n \nIt's not like the 3rd largest contingent of troops in the WAT comes from Germany.\n \n\n \n Thank you. No one ever claimed otherwise.\n \n \n\n It's not like intelligence collaboration from Germany with the US has proven CRUCIAL in the WAT.\n \n\n \n Thank you. No one ever claimed otherwise.\n \n \n\n It's not like we have been activley targeted by A-Q and Bin Laden has us on his list. The Germans were simply lucky or competent enough to foils SEVERAL attacks in the last 6 months.\n \n\n \n Implying that we are not as competent as those 'efficent' Germans?\n \n \n\n It's not like 30 of my countrymen have been killed in a attack on a tourist centre in Indonesia which intentionally targeted them.\n \n\n \n yet your people whine and scream like Frenchmen to do nothing.\n \n \n\n It's not like we DON`T have a naval battlegroup in the mediterranean and the indian ocean to assist US naval forces in combating Al-Q (and associated) smugglers.\n \n\n \n Thank you. No one ever claimed otherwise.\n \n \nIt's not like our troops guarded undermanned US bases on our soil.\n \n\n \n Thank you. No one ever claimed otherwise. We protect your soldiers over here. I was stationed at kirtland and have done joint training with your unit stationed thier.\n \n \nIt's not like we put risked retaliation by allowing US troops to use our homeland as staging ground for the war against Iraq.\n \n\n \n Your not an islamo-facist you would still be a target.\n \n \nIt's not like we didn't give the Turks and Israelis PATRIOTS durting the Iraq war for free.\n \n\n \n Thank you. No one ever claimed otherwise.\n \n \nIt's not like we didn't pony up our troops presence in the Balkans relievening several thousand US troops and logisticans to fight in the war in Iraq.\n\n \n Like you should have dealt with it in the 1st place instead of having the US clean up your back yard.\n \n \n \nIt's not like we didn't have a state-of-the-art NBC defense and dtection company in Kuwait to train and assist Kuwaiti authorities in the case Saddam has NBC weapons.\n \n\n \n Thank you. No one ever claimed otherwise.\n \n \n\n It's not like we didn't provide medevac capabilites to the US during the Iraq war.\n \n\n \n Thank you. No one ever claimed otherwise.\n \n \nIt's not like we don't have a large contingent of troops in Afgahnistan to assist in the reconstruction.\n\n \n Thank you. No one ever claimed otherwise. But I did not know this... have a link?\n \n \n \nIt's not like humanitarian organizations from my country don't work in Iraq or Afgahnistan.\n\n \n Thank you. No one ever claimed otherwise.\n \n \nIt's not like we didn't send commandoes in to fight in Enduring Freedom.\n\n \n Thank you. No one ever claimed otherwise.\n \n \n \n\n As I said, I'm always amazed by how some of you folks can forget aboiut such things. Really.\n \n\n \n sounds like sour grapes to me.\n \n \nAnd you'd better respect the Spaniards decision and election. They've taken quite a beating from the US right for doing the right thing. They've lost 300 people.The last thing they need is a kick in the nads from you chickenhawks. \n\n \n Ahh the kool-aid comes through! funny how you use 'chickenhawks' today just when the us liberal media is using the same terminology ad nauseum.... et tu? Skrew spain and those cowards. Enemies of freedom are killing thier citizens and they back down like Frenchmen... They are making thier own bed. \n \n \n\n Shame on you!\n \n - Dwight\n\n \n \n \n Shame on YOU! (this is funny.... SHAME! SHAME!) ;)", 
   {
    "unicode_changes_made": true
   }, 
   44471, 
   null, 
   1083178380.0
  ], 
  [
   46453, 
   null, 
   "Phunting", 
   "Ahh the kool-aid comes through!\nOne question: what the bloody hell is kool-aid? I've seen it used often enough here (drink the liberal kool-aid etc). Is it a drink? If so why would it 'come through' (ok maybe don't answer that!) and how would one drink a liberal one?", 
   {}, 
   46444, 
   null, 
   1083178980.0
  ], 
  [
   46456, 
   null, 
   "Rev. HellH0und", 
   "One question: what the bloody hell is kool-aid? I've seen it used often enough here (drink the liberal kool-aid etc). Is it a drink? If so why would it 'come through' (ok maybe don't answer that!) and how would one drink a liberal one?\n\n \n \n \n drink the Kool-Aid", 
   {}, 
   46453, 
   null, 
   1083179280.0
  ], 
  [
   46461, 
   null, 
   "JPSartre12", 
   "I'm always amazed by how some of you folks from the US have such a limited point of view, memory and attention span.......\n \n And you'd better respect the Spaniards decision and election. They've taken quite a beating from the US right for doing the right thing. They've lost 300 people.The last thing they need is a kick in the nads from you chickenhawks. \n \n Shame on you!\n \n - Dwight\n\n \n Who are these chickenhawks that you speak about? emoticon_confused", 
   {
    "unicode_changes_made": true
   }, 
   44471, 
   null, 
   1083179940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Thanks alot Spain..for nothing", 
  "url": "http://www.4forums.com/political/current-events-debates/1943-thanks-alot-spain-nothing.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 1943, 
  "discussion_files": [
   [
    "8833.html", 
    "http://www.4forums.com/political/current-events-debates/1943-thanks-alot-spain-nothing-print.html"
   ], 
   [
    "8834.html", 
    "http://www.4forums.com/political/current-events-debates/1943-thanks-alot-spain-nothing-7-print.html"
   ], 
   [
    "8835.html", 
    "http://www.4forums.com/political/current-events-debates/1943-thanks-alot-spain-nothing-5-print.html"
   ], 
   [
    "8836.html", 
    "http://www.4forums.com/political/current-events-debates/1943-thanks-alot-spain-nothing-4-print.html"
   ], 
   [
    "8837.html", 
    "http://www.4forums.com/political/current-events-debates/1943-thanks-alot-spain-nothing-6-print.html"
   ], 
   [
    "8838.html", 
    "http://www.4forums.com/political/current-events-debates/1943-thanks-alot-spain-nothing-3-print.html"
   ], 
   [
    "8839.html", 
    "http://www.4forums.com/political/current-events-debates/1943-thanks-alot-spain-nothing-2-print.html"
   ]
  ], 
  "identifier": 1943
 }
]