[
 [
  [
   39585, 
   null, 
   "Traveler", 
   "Newsmax.com. Saturday, March 13, 2004. 4:16 P.M. EST\n \n The Andreas McKenna Research group asked 800 registered voters last week which candidate they thought global terrorists would back in this year's election - and 60 percent said John Kerry.\n \n Only 25 percent of those surveyed said they thought terrorists wanted to see Bush win another term.\n \n http://www.newsmax.com/archives/ic/2004/3/13/162114.shtml\n \n No matter what you think of the poll numbers, it seems that most Americans instinctively know who would be soft on terrorism, and it isn't Bush, hence the poll numbers outcome....", 
   {
    "post_info": {
     "post_title": "Poll: More than 2/3 of Americans think that terrorists want Kerry to win election."
    }
   }, 
   null, 
   null, 
   1079408580.0
  ], 
  [
   39616, 
   null, 
   "Dmann", 
   "Hey! i read a poll where the majority of those polled believed Aunt Jemima was a real person. there was another poll that said 80% of Americans believed in UFO's. Shall I go on?", 
   {}, 
   39585, 
   null, 
   1079435640.0
  ], 
  [
   39671, 
   null, 
   "hvozdany", 
   "Hey! i read a poll where the majority of those polled believed Aunt Jemima was a real person. there was another poll that said 80% of Americans believed in UFO's. Shall I go on?\n\n \n \n I agree, and to add one, most ameicans thought that Iraq was resposible for 9/11...keeping this in mind would is it suprising that they think that Bush it 'tough on terrorism?'", 
   {}, 
   39616, 
   null, 
   1079476800.0
  ], 
  [
   39695, 
   null, 
   "Dmann", 
   "nope....there are alot of \"sheep\" out there.", 
   {}, 
   39671, 
   null, 
   1079488140.0
  ], 
  [
   39704, 
   null, 
   "AMD4EVER", 
   "I agree, and to add one, most ameicans thought that Iraq was resposible for 9/11...keeping this in mind would is it suprising that they think that Bush it 'tough on terrorism?'\n\n \n You make a fine point. Do you also believe that Bush will not be harder on terrorists than Kerry would be? I for one am not of that belief. That is not to say that Bush is doing the right thing by going after terrorism in a much more vicious way than Kerry however. I think Bush has been a little over zealous in his war on terrorism and I doubt that Kerry would act in such a way if elected. This may be a positive thing from international relations for the US.", 
   {}, 
   39671, 
   null, 
   1079490900.0
  ], 
  [
   39705, 
   null, 
   "Traveler", 
   "Hey! i read a poll where the majority of those polled believed Aunt Jemima was a real person. there was another poll that said 80% of Americans believed in UFO's. Shall I go on?\n\n \n I have no idea why Americans came to believe in Aunt Jemima being a real person, don't really care...Same for the UFO percentages.....\n \n Anyway, those are opinion polls conducted to find out what people believe. As well, this survey poll was conducted to get the 'pulse' of the nation.\n \n People care about their personal security, it's something that they no doubt take much more seriously than whether UFO's or Aunt Jemima are real or not. People care about the U.S.'s security,and theirs as well, and it seems that they instintively know that terrorists would rather have Kerry elected in 2004, than Bush. This survey poll shows that.\n \n It looks like they know that Kerry is a softy when it comes to fighting terrorism...", 
   {}, 
   39616, 
   null, 
   1079491020.0
  ], 
  [
   39707, 
   null, 
   "Traveler", 
   "I agree, and to add one, most ameicans thought that Iraq was resposible for 9/11...keeping this in mind would is it suprising that they think that Bush it 'tough on terrorism?'\n\n \n Most Americans did not think that Iraq was responsible for 9/11, Americans were polled in the recent past and it was discovered that 70% believed that Saddam was somehow/someway involved in 9/11, not responsible for.\n \n 70% believed that Saddam was involved in 9/11, not responsible for...Involved.....\n \n emoticon_rolleyes", 
   {}, 
   39671, 
   null, 
   1079491260.0
  ], 
  [
   39708, 
   null, 
   "Traveler", 
   "nope....there are alot of \"sheep\" out there.\n\n \n No, there are alot of people who evidently have a \"gut feeling\" on this issue. This survey poll shows that.", 
   {}, 
   39695, 
   null, 
   1079491380.0
  ], 
  [
   39709, 
   null, 
   "Traveler", 
   "You make a fine point\n\n \n If you agree with his statemnet, it just shows that you are ignorant concerning what Americans were polled to believe.\n \n 70% of Americans believe Saddam was involved in, not responsible for 9/11.", 
   {}, 
   39704, 
   null, 
   1079491500.0
  ], 
  [
   39713, 
   null, 
   "Dmann", 
   "goiod point traveler. also, when people throw out this 70% of AMericans....they should say 70% of Americans that were polled. Cause we don't know if they took a list of republican voters, or if they \"freeped\" the poll. So, it's not 70% of all Americans. That's just logic there.", 
   {}, 
   39709, 
   null, 
   1079492880.0
  ], 
  [
   39714, 
   null, 
   "Dmann", 
   "goiod point traveler. also, when people throw out this 70% of AMericans....they should say 70% of Americans that were polled. Cause we don't know if they took a list of republican voters, or if they \"freeped\" the poll. So, it's not 70% of all Americans. That's just logic there.\n\n \n \n this is what \"freeping\" is:\n \n Freep this Poll! \"Der Spiegel\" Exposes The Free Republic's \"Freeping\" Strategies\n \n A BUZZFLASH READER CONTRIBUTION\n Commentary and Summary Translation \n by BuzzFlash Reader Monica Friedlander\n \n Something funny happened to the online version of Germany's weekly newsmagazine \"Der Spiegel\" earlier this month. Starting on March 5, its normally Bush-allergic readership suddenly appeared to turn around 180 degrees, giving an enthusiastic thumbs up to the American president in the magazine's online poll.\n \n Fortunately, the editors of Der Spiegel didn't fall for the ruse, and unlike the mainstream U.S. media, they immediately alerted their readers to the growing right-wing menace: \"Freepers!\"\n \n In its March 15, 2004 issue, Spiegel Online [LINK] took the gloves off and put the spotlight on the Free Republic's guerilla warfare tactics, which range from disrupting Democratic rallies, to lies and intimidation techniques, and their most notorious claim to fame: fixing Internet polls. The Freepers goal is to drown out of the opposition in the United States and build support for conservative causes and candidates through whatever means necessary.\n \n The Free Republic website, owned by ultraconservative activist Jim Robinson, emerged as a political force in the late nineties. Der Spiegel traces the right-wing phenomenon from its Clinton-hating days through its tech-savy online voting manipulation techniques. \n \n The Call to Freep Der Spiegel \n \n On March 5 a call went out on the Free Republic website to freep --quote -- \"Germany's left-left-wing Spiegel Online.\" The magazine had asked readers to rate Bush's performance on a 1 to 6 scale. What's especially noteworthy about the post is that it did not come from an American member, but from German activist David Kaspar, who runs a right-wing web log of his own. The request, complete with instructions and screenshots of the online voting to date, read:\n \n \"Bush needs your help ... As of 5 March, 2004, 1 pm (Berlin time), Bush's results are rather miserable. Only 3.3 per cent for '1' and 1.47 per cent for '2.'\" (with \"1\" and \"2\" being the best ratings).\n \n Soon after the freepers went into action, Kaspar followed up with the following entry:\n \n \"As of 5 March, 2004, 10 pm (Berlin time), Bush's results are EXCELLENT. 41.23 per cent for '1' (= Bush did a great job as President) . Many thanks!! You guys are doing just great!! The Bush haters at Spiegel online will have a heart attack tomorrow morning ... Keep up the good work!!\"\n \n Two days later Kaspar not only bragged about the \"large pro-Bush base\" -- by that time giving Bush a 59% excellent rating -- but he even referred to an imaginary interview with an imaginary Spiegel online editor, and credited the Free Republic with changing the future course of the magazine's political line. He then followed up with further calls to \"drive the German left insane.\"\n \n Other freeper actions noted by Der Spiegel include the posting of John Kerry's campaign schedule on the Free Republic website on March 8, asking members to show up with digital cameras to take \"more realistic\" shots of the Democratic candidate. Poll manipulation, however, is freepers' specialty. Recent targets included polls on CNN and New York Times on gay marriage, Bush's 9/11 ads, and the greenhouse effect -- which does not exist, according to 86.5% of the respondents. Freeped! \n \n The tragic irony is that it took massive interference with a poll in a foreign site for this gross manipulation of public opinion by a fanatical fringe to be denounced in a major publication. But as always, not a peep in the mainstream American press. On this side of the Atlantic, awareness of Free Republic's cyberwarfare is limited largely to sophisticated online activists. Meanwhile major websites whose polls are freeped merely note that their polls are \"not scientific,\" giving readers no inkling that a massive and deliberate attempt at public opinion manipulation by the right wing is at play. \n \n Yet the publishing of online polls continues in spite of media's knowledge of the freeper attacks. That in itself is more ominous than the freepers themselves. The mainstream media is being used with its full consent. Shouldn't we ask, \"Why?\"\n \n \n __________________\n My urgent advice to you would be, not only to always think first of America, but always, also, to think first of humanity.\" --- President Woodrow Wilson\n \n \"By oft repeating an untruth, men come to believe it themselves.\" --Thomas Jefferson", 
   {
    "unicode_changes_made": true
   }, 
   39713, 
   null, 
   1079492940.0
  ], 
  [
   39715, 
   null, 
   "AMD4EVER", 
   "If you agree with his statemnet, it just shows that you are ignorant concerning what Americans were polled to believe.\n \n 70% of Americans believe Saddam was involved in, not responsible for 9/11.\n\n \n Do you not see a small connection between Saddam the dictator of Iraq and Iraq itself? Bush sure seemed to see a connection. Saddam was a threat so he attacked Iraq. I suppose in your logic Bush must be out of his mind.\n \n Suppose that a poll asked if Hitler was a threat to Europe and 70% of the people said yes. Wouldn't you agree that about 70% of the people would also agree that a Germany under the leadership of Hitler is a threat? This is the way I would interpret this but then again I have been proclaimed as ignorant.", 
   {}, 
   39709, 
   null, 
   1079493000.0
  ], 
  [
   39810, 
   null, 
   "hvozdany", 
   "Most Americans did not think that Iraq was responsible for 9/11, Americans were polled in the recent past and it was discovered that 70% believed that Saddam was somehow/someway involved in 9/11, not responsible for.\n \n 70% believed that Saddam was involved in 9/11, not responsible for...Involved.....\n \n emoticon_rolleyes\n\n \n \n Fair enough, I don't rememeber, you may be right. But my point still stands. THere has never been any evidence that he was 'somehow/someway involved.' They are still just as wrong.", 
   {}, 
   39707, 
   null, 
   1079559840.0
  ], 
  [
   39811, 
   null, 
   "hvozdany", 
   "You make a fine point. Do you also believe that Bush will not be harder on terrorists than Kerry would be? I for one am not of that belief. That is not to say that Bush is doing the right thing by going after terrorism in a much more vicious way than Kerry however. I think Bush has been a little over zealous in his war on terrorism and I doubt that Kerry would act in such a way if elected. This may be a positive thing from international relations for the US.\n\n \n Well, maybe, I guess I am not sure what you mean my tougher.\n I do believe that they would approach the war on terrorism differently, that Bush is more likely to use the miltary for thing like the Iraq war. So, I guess in a sense that is 'tougher.' However, some think that invading Iraq has created more terrorists, so although Bush may be 'tougher,' the may not be smarter about it, and I think that is at least as important.", 
   {}, 
   39704, 
   null, 
   1079560140.0
  ], 
  [
   40021, 
   null, 
   "Ghost", 
   "Look at this picture.\n \n http://www.umbc.edu/saf/sanews/volume2/world%20trade%20center%20fire.jpg\n \n Do you think that there are people in this world who want to kill Americans? There are, and there are a lot of them. We exist in a world filled with enemies who are trying to kill us.\n \n Now, isn't it a little bit disconcerting for you pro-Kerry people that the people who killed thousands of us a few years ago, and who are undoubtedly trying to do so again, want john kerry to win!? That sends up a glaring signal to me. The enemy is more afraid of Bush than they are of Kerry, because they know that Bush will try to hunt them down, and they know that Kerry is like-minded with Bill Clinton, who let them run amok for eight years. Just think about this;\n \n Kim Jong Il of North Korea voiced his support for John Kerry.\n Jacques Chirac and the French media voiced their support for John Kerry.\n Al-Jazeera voiced support for John Kerry.\n \n These people are kinda sorta biased against America and provide varying degrees of support to terrorists. Does that worry any of you?", 
   {}, 
   39811, 
   null, 
   1079683560.0
  ], 
  [
   40054, 
   null, 
   "AMD4EVER", 
   "Isn't it also a little disconcerning that Bush has taken US international opinion from a very high level of support after 9/11 to a rather low level due to his war on terror? Being hard on terrorists is one thing but many countries now see him as crossing the line. Having less supportive friends isn't going to help our war on terror. Also isn't it Bush who is in office and has done relatively little to protect our borders along Mexico which would be a prime spot to sneak across terrorists at this point?\n \n This isn't all to say that Bush is worse than Kerry in the war on terror but he surely does have his flaws and they cannot be ignored.", 
   {}, 
   40021, 
   null, 
   1079707560.0
  ], 
  [
   40069, 
   null, 
   "Eddie", 
   "I don`t know how accurate or even truthful this \"message\" is but anyway:\n \n http://www.reuters.com/newsArticle.jhtml?type=worldNews&storyID=4591197\n (scroll down)\n \n \"WE WANT BUSH TO WIN \n \n The statement said it supported President Bush in his reelection campaign, and would prefer him to win in November rather than the Democratic candidate John Kerry, as it was not possible to find a leader \"more foolish than you (Bush), who deals with matters by force rather than with wisdom.\" \n \n In comments addressed to Bush, the group said:\n \"Kerry will kill our nation while it sleeps because he and the Democrats have the cunning to embellish blasphemy and present it to the Arab and Muslim nation as civilization.\" \n \"Because of this we desire you (Bush) to be elected.\" \n \n The group said its cells were ready for another attack and time was running out for allies of the United States. \n \n \"Whose turn is it next? Will it be Japan or America, or Italy, Britain or Oslo or Australia?\" the statement said, adding Pakistan and Saudi Arabia were also targets. \n \n The group is named after Muhammed Atef, also known as Abu Hafs, a close bin Laden aide killed in the U.S.-led war in Afghanistan.\"\n \n - By Opheera McDoom (Reuters)\n \n Of course, it could be just a ploy, or XXXXXX talking out their ****.", 
   {}, 
   40054, 
   null, 
   1079714040.0
  ], 
  [
   40080, 
   null, 
   "Ghost", 
   "Everybody has their flaws, no doubt, and Bush has his. I firmly believe that more needs to be done along our Mexican border, and I think that Bush is too soft on that.\n \n I live in Arizona, however, and just recently it was decided that 200 more border guards would be hired, and that he Mexico-Arizona border would be patrolled by UAVs (unmanned aerial vehicles, like Predator drones).\n \n It is a little disconcerting that we have lost international support, but not like you. I think it's terribly worrying that Europe for the most part is following the path of appeasement and are acting cowardly. I think it's disconcerting that the UN passes all kinds of resolutions and doesn't enforce any of them. I think it's very disconcerting that a good portion of the world hates the United States even though they wouldn't exist anything like they do currently if it were not for America.", 
   {}, 
   40069, 
   null, 
   1079720880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Poll: More than 2/3 of Americans think that terrorists want Kerry to win election.", 
  "url": "http://www.4forums.com/political/politics-debates/1950-poll-more-than-2-3-americans-think-terrorists-want-kerry-win-election.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 1950, 
  "discussion_files": [
   [
    "24468.html", 
    "http://www.4forums.com/political/politics-debates/1950-poll-more-than-2-3-americans-think-terrorists-want-kerry-win-election-print.html"
   ], 
   [
    "24469.html", 
    "http://www.4forums.com/political/politics-debates/1950-poll-more-than-2-3-americans-think-terrorists-want-kerry-win-election-2-print.html"
   ]
  ], 
  "identifier": 1950
 }
]