[
 [
  [
   39712, 
   null, 
   "rapture", 
   "Though it was a terrible thing\n Pilate and Judas Iscariot one spirit in the same \n But the sacrifice was not in vain\n Nor the Jews should one blame\n Had not God ordained this thing\n Blinding Jewish eye's that day\n Which sinner amongst us could be saved?", 
   {
    "post_info": {
     "post_title": "Setting the Record Straight"
    }
   }, 
   null, 
   null, 
   1079492820.0
  ], 
  [
   39754, 
   null, 
   "Richard", 
   "He made the world for us to live,\n And to us life he loved to give.\n But ADAM sinned on one day,\n And by THAT action did God say;\n You, of the earth you will toil and sweat,\n You can't live without me I'd like to bet.\n \n Jehovah teaches people well,\n And gives them a nation in which to dwell.\n All the peace and all security,\n Is in my hand to give to thee.\n All I ask is you follow my law,\n And your salvation is at the door.\n \n Why are you disloyal to me?\n I'm here to help you can't you see.\n Here the messiah is sent to you,\n To teach about me and look what you do.\n I've had my fill with this wayward nation,\n The law will change by my operation.\n \n Preach and teach in every land,\n Bring all the meek into my hand.\n Follow my law in desperate times,\n I can't believe this poem rhymes.\n Some will fall and some will err,\n It amazes me that they do not care.\n \n When the time is right I'll bring you back,\n A Christian organization that does not lack.\n You will preach and teach on a global scale,\n And bring tears of joy to the old and frail.\n Some will hate you and even kill,\n Because you are the people that love my will.\n \n Teach the Bible and in the truth remain,\n Reprove teachers whom my name profane.\n Time is short I'm coming soon,\n Over all the earth will peace be strewn.\n A world accomplished for divine fitness,\n ALL MY LOVE, a loyal witness.", 
   {
    "unicode_changes_made": true
   }, 
   39712, 
   null, 
   1079536020.0
  ], 
  [
   39776, 
   null, 
   "dreamweaver", 
   "Neither. :D", 
   {}, 
   39754, 
   null, 
   1079549040.0
  ], 
  [
   39782, 
   null, 
   "Richard", 
   "Neither. :D\n\n who did kill him then?", 
   {}, 
   39776, 
   null, 
   1079552460.0
  ], 
  [
   39791, 
   null, 
   "Richard", 
   "God ordained it from the start\n Because He loves us with all His heart.\n\n God promised Adam that he would not die,\n all was his that he could see with his eye.\n Adam thought that he knew best,\n and decided to put god to the test.\n \nSon of God, sacrificial Lamb\n Offered up His life for the sinful man.\n\n God's law on justice was fulfilled,\n when his perfect son agreed to be killed.\n what I think you don't you understand,\n is that all this chaos was not planned.\n \nThere is no blame, only thanks to give\n For, by His death, son of man may live.\n\n God cannot make a world of sadness,\n it wasn't his plan that we all see badness.\n Where in the Bible does he suggest that thought,\n I cant understand why such a thing is taught.", 
   {}, 
   39712, 
   null, 
   1079555880.0
  ], 
  [
   39835, 
   null, 
   "XQsThaiPoes", 
   "who did kill him then?\n\n \n Satan\n \n John 13:2 \n \n 2*So, while the evening meal was going on, the Devil having already put it into the heart of Judas Is·car'i·ot, the son of Simon, to betray him, \n \n Luke 22:3-4 \n \n 3*But Satan entered into Judas, the one called Is·car'i·ot, who was numbered among the twelve; 4*and he went off and talked with the chief priests and [temple] captains about the effective way to betray him to them.", 
   {
    "unicode_changes_made": true
   }, 
   39782, 
   null, 
   1079581500.0
  ], 
  [
   39843, 
   null, 
   "Nallyo", 
   "WE killed Jesus. WE were the reason he died. Judas, the Jews, the Romans, and even Satan were just the tools by which he died.", 
   {}, 
   39835, 
   null, 
   1079584980.0
  ], 
  [
   39845, 
   null, 
   "XQsThaiPoes", 
   "WE killed Jesus. WE were the reason he died. Judas, the Jews, the Romans, and even Satan were just the tools by which he died.\n\n Whoah! Hold it homeboy. You were on a roll until you brought in the S man. Satan is not a tool of anyone, for that is why he is Satan a rebel. Give the devil his due. It was his idea to start this thing. I believe this generation loves Jesus too much if that is possible for they credit him with things that never were intended, such as dying for dinosaurs creatures not even in the bible.", 
   {}, 
   39843, 
   null, 
   1079585580.0
  ], 
  [
   39863, 
   null, 
   "Richard", 
   "Satan\n \n John 13:2 \n \n 2*So, while the evening meal was going on, the Devil having already put it into the heart of Judas Is·car'i·ot, the son of Simon, to betray him, \n \n Luke 22:3-4 \n \n 3*But Satan entered into Judas, the one called Is·car'i·ot, who was numbered among the twelve; 4*and he went off and talked with the chief priests and [temple] captains about the effective way to betray him to them.\n\n I thought that exact same thing, but then i remembered this parable\n From 'Insight on the Scriptures' pg. 1183\n (26) The murderous cultivators (Mt 21:33-44; Mr 12:1-11; Lu 20:9-18). Spoken in the temple in Jerusalem, just three days before Jesus, God's Son, was killed. This illustration, too, was in answer to the question about the source of Jesus' authority. (Mr 11:27-33) Immediately after the illustration, the Gospel accounts state that the religious leaders realized that he was speaking about them.-Mt 21:45; Mr 12:12; Lu 20:19.\n The fence around the vineyard might have been of stone (Pr 24:30, 31) or it might have been a hedge. (Isa 5:5) The wine vat was frequently excavated in the rock and consisted of two levels, the juice flowing from the upper one to the lower. The tower was a lookout place for the guard, who was to keep out thieves and animals. In some cases, the cultivators employed received a certain portion of the fruits. In other cases, the cultivators paid rent in money or agreed to give the owner a definite amount of the produce, the latter apparently being the case in the illustration. By murdering the son, the heir, they may have thought to seize the vineyard as their own, since the one who planted it was out of the country. In Isaiah 5:1-7 \"the vineyard of Jehovah\" is said to be \"the house of Israel.\" As shown by the Gospel writers, Jesus quoted Psalm 118:22, 23 as a key to understanding the illustration.\n \n Since Jehovah left the vineyard in the hands of the Jews and they murdered the son that means it was the Jews surely that were responsible, Satan was just the instigator, although he is to blame overall, the Jews still had free will.", 
   {
    "unicode_changes_made": true
   }, 
   39835, 
   null, 
   1079603160.0
  ], 
  [
   40012, 
   null, 
   "rapture", 
   "Satan tried his hardest to tempt Christ with any and everything, yet, and beyond my understanding God must of really loved a bunch of dust mammels to shed blood...........", 
   {}, 
   39863, 
   null, 
   1079676900.0
  ], 
  [
   40013, 
   null, 
   "XQsThaiPoes", 
   "Satan tried his hardest to tempt Christ with any and everything, yet, and beyond my understanding God must of really loved a bunch of dust mammels to shed blood...........\n\n \n Granted, but it is God so he had ulterior motives beside \"love\". Also considering Jesus basically came down and got mugged and murdered people really think he is gonna forget about that? Raise your hand if you want to be on the same planet as the humans that killed Jesus come judgement day.", 
   {}, 
   40012, 
   null, 
   1079678400.0
  ], 
  [
   41344, 
   null, 
   "rapture", 
   "Granted, but it is God so he had ulterior motives beside \"love\".\n\n \n \n What?..with or without humans \"Bliss is God\" nor will his creative powers cease \n \n \n \n \n \n \n Also considering Jesus basically came down and got mugged and murdered people really think he is gonna forget about that?\n Raise your hand if you want to be on the same planet as the humans that killed Jesus come judgement day.\n\n \n \n Witness the Supreme Judge, as an apprentice, and love his ways, likewise, amongst all the weeping mammals, patiently watching ever so keenly that the Lost angels DON'T miss the special occasion. This is my reason for wanting to be present at Judgement Day", 
   {}, 
   40013, 
   null, 
   1080488820.0
  ], 
  [
   41377, 
   null, 
   "carla5010", 
   "Well, Rapture. GOD killed Jesus. That was his plan all along, wasn't it! If Jesus hadn't died the way he did, there would be no Christianity, no religion for the gentiles.\n \n GOD deliberately had Jesus killed; that was part of God's masterplan.", 
   {}, 
   39712, 
   null, 
   1080515640.0
  ], 
  [
   41381, 
   null, 
   "rapture", 
   "=carla5010]Well, Rapture. GOD killed Jesus. That was his plan all along, wasn't it! If Jesus hadn't died the way he did, there would be no Christianity, no religion for the gentiles.\n\n \n \n \n Can't kill immortality, nevertheless, God sacrificed himself, if not, humans would technically and \"rightfully\" be Satan snacks.\n \n Through foreordination Pilate & Judas Iscariot was postioned perfectly in the scheme of things, the betrayal spirit, perhaps one could even replace Pilate with Hilter for fun? Same results? \n \n \nGOD deliberately had Jesus killed; that was part of God's masterplan.\n \n\n \n How does one see Jesus as anyone other than God himself?", 
   {}, 
   41377, 
   null, 
   1080518820.0
  ], 
  [
   41946, 
   null, 
   "carla5010", 
   "Actually, according to the bible, Jesus is God.\n \n\n \n OF COURSE. Well, let me clarify for you.\n \n God used the Jesus physical body to spread the message of the Bible on Earth. PArt of the plan was to have the physical body known as Jesus to be crucified. Of course God and jesus are one and the same, that was not the point. The point was that the physical cruzifiction of the physical body of Jesus was planned and carried out through God's will.\n \n There was no person guilty of killing Jesus. As you said, God=Jesus, and God can not be \"killed.\"", 
   {}, 
   41377, 
   null, 
   1080832860.0
  ], 
  [
   41947, 
   null, 
   "carla5010", 
   "Can't kill immortality, nevertheless, God sacrificed himself, if not, humans would technically and \"rightfully\" be Satan snacks.\n\n \n In that light, even the original question in this tread is silly. The only way the initial question makes sense is if we are talking about Jesus' physical body, not Jesus as God. There was no sacrifice of God. There was a sacrifice of the physical form That God had taken on this Earth. A form that was planned to be killed thorugh God's plan all along. As such, claiming that somebody \"murdered Jesus\" is silly.\n \n [QUOTE]Through foreordination Pilate & Judas Iscariot was postioned perfectly in the scheme of things, the betrayal spirit, perhaps one could even replace Pilate with Hilter for fun? Same results? \n \n Well, Pilate and Judas were doing God's bidding, carrying out God's plan. If they had NOT acted as they did, that plan would have faltered and we would not have Christianity.\n \n \nHow does one see Jesus as anyone other than God himself?\n\n \n We see the PHYSICAL body of Jesus as separate.", 
   {}, 
   41381, 
   null, 
   1080833100.0
  ], 
  [
   41948, 
   null, 
   "carla5010", 
   "\"Who killed Jesus?\" is not as important as \"Why was Jesus crucified?\"\n\n \n \"Who killed Jesus\" actually doesn't even make sense. Jesus wasn't killed, at least not according to the Christian Faith.", 
   {}, 
   41381, 
   null, 
   1080833160.0
  ], 
  [
   42008, 
   null, 
   "thebootfitter", 
   "\"Who killed Jesus\" actually doesn't even make sense. Jesus wasn't killed, at least not according to the Christian Faith.\n\n Yes, he was -- according to the Christian faith. He was, in fact, killed. Physically dead.\n \n And then, according to traditional Christian beliefs, he arose from the dead.", 
   {}, 
   41948, 
   null, 
   1080868260.0
  ], 
  [
   42235, 
   null, 
   "carla5010", 
   "Yes, he was -- according to the Christian faith. He was, in fact, killed. Physically dead.\n\n The body was dead. But Jesus=God as Sandycane mentioned, and God didn't die.\n \n \nAnd then, according to traditional Christian beliefs, he arose from the dead.\n\n God let the part of him that was Jesus stand back up and walk among man for awhile longer.", 
   {}, 
   42008, 
   null, 
   1081063920.0
  ], 
  [
   42278, 
   null, 
   "Tisthammerw", 
   "The issue is probably not monocausational. While Jesus had many Jewish followers (in fact, nearly all of the original followers were Jewish), there were evidently some Jews who did not have such a favorable view of him and likely wanted him executed. Nonetheless, it was the Romans who put the nails in his body and crucified him, thus it was the Romans who actually killed him. Pilate could have chosen not to execute him but in the end yielded to the will of the mob, fearing a riot. Also, we can't forget the role of Judas Iscariot. Satan (if he exists) also played a role of influence.", 
   {
    "unicode_changes_made": true
   }, 
   42235, 
   null, 
   1081122180.0
  ], 
  [
   43045, 
   null, 
   "carla5010", 
   " Also, we can't forget the role of Judas Iscariot. Satan (if he exists) also played a role of influence.\n\n \n But if God needed Jesus to die, then Judas was doing God's bidding. It is possible that Judas was the only one that God could rely on for this very important task of ensuring his arrest by the Romans. And if that is the case, then how is God's will and God's plan some kind of influence by Satan?\n \n If God needed Jesus to be crucified, if that was the plan all along, then everything that leads towards this is part of God's bidding, not anybody else's.", 
   {
    "unicode_changes_made": true
   }, 
   42278, 
   null, 
   1081437720.0
  ], 
  [
   50026, 
   null, 
   "Tisthammerw", 
   "But if God needed Jesus to die, then Judas was doing God's bidding. It is possible that Judas was the only one that God could rely on for this very important task of ensuring his arrest by the Romans. And if that is the case, then how is God's will and God's plan some kind of influence by Satan?\n \n\n \n One could argue that Satan influenced Judas Iscariot to betray Jesus. Perhaps he just wanted to see God (incarnated in the form of a Jewish carpenter) to suffer, or perhaps Satan was ignorant of God's plan. Who knows?", 
   {}, 
   43045, 
   null, 
   1084574880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Setting the Record Straight", 
  "url": "http://www.4forums.com/political/religion-debates/1956-setting-record-straight.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 1956, 
  "discussion_files": [
   [
    "21230.html", 
    "http://www.4forums.com/political/religion-debates/1956-setting-record-straight-print.html"
   ], 
   [
    "21231.html", 
    "http://www.4forums.com/political/religion-debates/1956-setting-record-straight-2-print.html"
   ]
  ], 
  "identifier": 1956
 }
]