[
 [
  [
   40116, 
   null, 
   "nick", 
   "Kind of ironic that in this war against terror the Liberals tend to sympathise with the Islamafascists isn't it? After all what can they expect if the folk who wear their washing on their heads prevail? Womens' rights will be obliterated. They won't be able to vote, or even be seen in public except covered in black, abortion will be banned and adultery will lead to public execution by stoning. \n \n Homosexuality will be outlawed, Democracy abolished, freedom of speech obliterated, thieves limbs will be dismembered. Yet such is the liberals self hatred and loathing, such is their visceral hatred of America and the globalist capitalist system that they are prepared to self immolate and side with the death worshipping cult of the Islamists on the desperate principle of 'the enemy of our enemy is our friend.' \n \n Pan arabic terrorism is indeed the enema within but its symbiotic liberal assist has to be the weirdest and most incongruous double act in recent history.", 
   {
    "post_info": {
     "post_title": "The Great Liberal Death Wish"
    }
   }, 
   null, 
   null, 
   1079735460.0
  ], 
  [
   40142, 
   null, 
   "The_Comedian", 
   "Liberals aren't pro-terrorists. But they can be anti-Bush as well.\n Maybe stubborn minds like some conservatives are doing more for an increase in terrorism than any liberal brain in the world...", 
   {
    "unicode_changes_made": true
   }, 
   40116, 
   null, 
   1079742540.0
  ], 
  [
   40185, 
   null, 
   "daewoo", 
   "So, if the terrorists win they plan to invade? Funny, I thought they were ust fighting for the right to be left alone, and I'm not even a liberal", 
   {}, 
   40116, 
   null, 
   1079756880.0
  ], 
  [
   40209, 
   null, 
   "The_Comedian", 
   "Daewoo. You are confused enough to be a liberal. Go and lie down in a dark room with some aspirins. (Take the Commiedian with you )\n\n Spelled:\n Comedian.\n \n Could you imagine that it is your kind of attitude that isolated the US from your allies so much during the last years?\n Not that you had any proof about the effectiveness of costly wars to reduce terrorism...", 
   {}, 
   40185, 
   null, 
   1079786760.0
  ], 
  [
   40225, 
   null, 
   "nick", 
   "My post was removed. Perhaps someone could explain why? It was only what Commiedian reposted anyway.", 
   {
    "post_info": {
     "post_title": "was it something I said?"
    }
   }, 
   40209, 
   null, 
   1079800440.0
  ], 
  [
   40227, 
   null, 
   "Eddie", 
   "My post was removed. Perhaps someone could explain why? It was only what Commiedian reposted anyway.\n\n \n I guess it was because you attacked the posters, not their arguments...", 
   {}, 
   40225, 
   null, 
   1079801160.0
  ], 
  [
   40275, 
   null, 
   "admin", 
   "your post was removed for name calling.\n Try and keep it friendly.", 
   {
    "post_info": {
     "post_title": "name calling"
    }
   }, 
   40227, 
   null, 
   1079824140.0
  ], 
  [
   40277, 
   null, 
   "nick", 
   "Before I had a computer I was told to get one because you could have great discussions on forums which unlike other media outlets were not subject to the flyblown philacteries of Political Correctness.\n \n A year later, having beeen thrown off 4 such forums by PC administrators - 2 from the US, I have learned the hollowness of such claims and the fallacy of the notion of free speech on the internet. It is a chimera and as rare as the Mauritius Dodo. (It only applies to Liberals.)\n \n Not that I am complaining. Forums are the intellectual property of their owners and if they choose to discriminate against beleagured Conservatives that is their prerogative. I just wish they wouldn't be so prissy and precious about it, and were more honest about their obvious liberal bias.", 
   {
    "post_info": {
     "post_title": "Left is right and Right is wrong"
    }
   }, 
   40275, 
   null, 
   1079825100.0
  ], 
  [
   40293, 
   null, 
   "Robbie", 
   "I don't have much experience with foruming, but my experience here has been that there isn't biased post removing.\n \n However, I've seen a LOT of name-calling elsewhere on this forum. Your's (as much as I can see from the reply quoting it) seems fairly typical. \n \n Name calling does stifle real debate and thought.", 
   {}, 
   40277, 
   null, 
   1079832480.0
  ], 
  [
   40312, 
   null, 
   "admin", 
   "Before I had a computer I was told to get one because you could have great discussions on forums which unlike other media outlets were not subject to the flyblown philacteries of Political Correctness.\n \n A year later, having beeen thrown off 4 such forums by PC administrators - 2 from the US, I have learned the hollowness of such claims and the fallacy of the notion of free speech on the internet. It is a chimera and as rare as the Mauritius Dodo. (It only applies to Liberals.)\n \n Not that I am complaining. Forums are the intellectual property of their owners and if they choose to discriminate against beleagured Conservatives that is their prerogative. I just wish they wouldn't be so prissy and precious about it, and were more honest about their obvious liberal bias.\n\n \n You should have no trouble staying on. Just follow the rules, you can find them in the FAQ section.", 
   {}, 
   40277, 
   null, 
   1079841960.0
  ], 
  [
   40313, 
   null, 
   "Eddie", 
   "My experience is that this forum is very lenient (sp?). And I have even recieved a warning and had posts removed, and even then I found the admin. very easy to talk to and completly without any from of bias.", 
   {}, 
   40312, 
   null, 
   1079842860.0
  ], 
  [
   40331, 
   null, 
   "Dmann", 
   "I see this post, almost verbatum, all over the web. it's really stupid. All liberals aren't anything. there is no black and white anymore. it's the year 2004...get a color television", 
   {}, 
   40313, 
   null, 
   1079860620.0
  ], 
  [
   40337, 
   null, 
   "daewoo", 
   "If it makes you feel any better, my reply to you got deleted, too. \n \n The proposition that 4000 al queda members are going to invade america and impose a muslim fundamentalist regime is rediculous.", 
   {}, 
   40331, 
   null, 
   1079865960.0
  ], 
  [
   40338, 
   null, 
   "Dmann", 
   "Kind of ironic that in this war against terror the Liberals tend to sympathise with the Islamafascists isn't it? After all what can they expect if the folk who wear their washing on their heads prevail? Womens' rights will be obliterated. They won't be able to vote, or even be seen in public except covered in black, abortion will be banned and adultery will lead to public execution by stoning. \n \n Homosexuality will be outlawed, Democracy abolished, freedom of speech obliterated, thieves limbs will be dismembered. Yet such is the liberals self hatred and loathing, such is their visceral hatred of America and the globalist capitalist system that they are prepared to self immolate and side with the death worshipping cult of the Islamists on the desperate principle of 'the enemy of our enemy is our friend.' \n \n Pan arabic terrorism is indeed the enema within but its symbiotic liberal assist has to be the weirdest and most incongruous double act in recent history.\n\n \n it seems you may be having a manic episode of some kind. i suggest you take your medication and calm down. It's not the end of everything....not even close. There may seem to be alot of turmoil in the world right now. It's been worse. Frieking out won't help. \n And...in case you didn't notice...they're ****** off at a republican right now. The \"liberals\" haven't been in power for more than 3 years. \n The difference, I'm starting to see, between the liberals and the right is, the right is extremely paranoid and afraid....the liberals seem to think this can be solved with a reduction of violence and common sense.", 
   {}, 
   40116, 
   null, 
   1079872200.0
  ], 
  [
   40340, 
   null, 
   "nick", 
   "If 'nothing is black or white' as Dman asserts, all dogmatic statements are false -including the statement that nothing is black or white. Ergo the statement is false. Another example of confused liberal thinking. \n \n I hope the admin has noted that Dman is calling into question my mental stability. As I got deleted for doing that regarding the libs will admin now delete Dman? (I won't hold my breath.) \n \n Daewoo, I never said al quaida will suceed in imposing Islamic law on the West. I said that is their avowed intent. It has been predicted however that some European countries will become Islamic if the present Demographic trends are not reversed.", 
   {
    "post_info": {
     "post_title": "Dogmatic pragmatism"
    }
   }, 
   40338, 
   null, 
   1079883480.0
  ], 
  [
   40341, 
   null, 
   "Eddie", 
   "It has been predicted however that some European countries will become Islamic if the present Demographic trends are not reversed.\n\n \n emoticon_confused \n \n There`s allready countries in europe where the largest religion is Islam...", 
   {}, 
   40340, 
   null, 
   1079886060.0
  ], 
  [
   40347, 
   null, 
   "daewoo", 
   "Daewoo, I never said al quaida will suceed in imposing Islamic law on the West. I said that is their avowed intent. It has been predicted however that some European countries will become Islamic if the present Demographic trends are not reversed.\n\n \n Their stated purpose is to force the US to quite meddling in middle eastern affairs. They don;t want to spread islam, they don't want to impose islamic law on the west. They want the ME to be left alone.\n \n If you didn't mean that you thought Al Queda was going to suceed in imposing Islamic law in the wet, what did you mean by\n \n \nAfter all what can they expect if the folk who wear their washing on their heads prevail? Womens' rights will be obliterated. They won't be able to vote, or even be seen in public except covered in black, abortion will be banned and adultery will lead to public execution by stoning. \n \n Homosexuality will be outlawed, Democracy abolished, freedom of speech obliterated, thieves limbs will be dismembered. \n \n \n As far as \"reversing demographic trends\", what would you suggest? Ethnic cleasing seems to be a popular way to do this.", 
   {}, 
   40340, 
   null, 
   1079897760.0
  ], 
  [
   40362, 
   null, 
   "nick", 
   "Sterilisation would be one answer. At the moment us white anglo saxons are being ethnically cleansed by the alien hordes flooding across our porous borders and if they ever gain the upper hand they won't show you liberals the same tolerance that you extend to them. As far as they are concerned you are just their useful XXXXXX. If you honestly think their intentions are pacific you really must believe at least six impossible things before breakfast.\n \n The people of Holland used to share your naieve views on multiculturalism. Not anymore. They have pulled up the drawbridge having seen their country disintegrate into a multicultural cesspit. Are al queda paying you to spout their propaganda?", 
   {}, 
   40347, 
   null, 
   1079911740.0
  ], 
  [
   40366, 
   null, 
   "Eddie", 
   "Sterilisation would be one answer. At the moment us white anglo saxons are being ethnically cleansed by the alien hordes flooding across our porous borders and if they ever gain the upper hand they won't show you liberals the same tolerance that you extend to them.\n\n \n Ethnicly cleansed? I didn`t know that anglo-saxons where being killed or expulled \"en masse\"... Or is this just pointless rethorics?\n \n Besides, you are about to be forced to deal with a massively aging population... Sterilisation for a part of the population is probably not the best idea I`ve heard...\n \n \nAs far as they are concerned you are just their useful XXXXXX. If you honestly think their intentions are pacific you really must believe at least six impossible things before breakfast.\n \n\n \n Are you talking about immigrants or terrorists? And if you are talking about immigrants, please explain how they even shares the same intent (other than trying to make a better living for themselves)\n \n \nThe people of Holland used to share your naieve views on multiculturalism. Not anymore. They have pulled up the drawbridge having seen their country disintegrate into a multicultural cesspit. \n\n \n So because the government in Holland (a country with 16 mil.) has become dependant on the support of the populistic right, \"pulling up the drawbridge\" is the obvious thing to do? emoticon_confused You`re examples are not making any sense", 
   {}, 
   40362, 
   null, 
   1079914200.0
  ], 
  [
   40515, 
   null, 
   "hvozdany", 
   "Sterilisation would be one answer. At the moment us white anglo saxons are being ethnically cleansed by the alien hordes flooding across our porous borders and if they ever gain the upper hand they won't show you liberals the same tolerance that you extend to them. As far as they are concerned you are just their useful XXXXXX. If you honestly think their intentions are pacific you really must believe at least six impossible things before breakfast.\n \n The people of Holland used to share your naieve views on multiculturalism. Not anymore. They have pulled up the drawbridge having seen their country disintegrate into a multicultural cesspit. Are al queda paying you to spout their propaganda?\n\n \n \n Was this meant to be serious????", 
   {}, 
   40362, 
   null, 
   1080006600.0
  ], 
  [
   40525, 
   null, 
   "syklopps61", 
   "[QUOTE]Are you talking about immigrants or terrorists? And if you are talking about immigrants, please explain how they even shares the same intent (other than trying to make a better living for themselves)[/QUOTE\n \n Are you 100% certain of this? I mean, afterall, the terrorists came here to \"make a better living\" or to get \"educated\". I can't recall the name of that group in Mexico that believes the Southwest is still part of Mexico, but how do you KNOW that the illegals coming over don't have an alterior motive. When they become the majority, who knows what could happen", 
   {}, 
   40366, 
   null, 
   1080010200.0
  ], 
  [
   40549, 
   null, 
   "sundowner", 
   "I don't think it is a matter of arab terrorists invading the United States. That would never happen. And I don't think it is nearly as simple as they want the US and allies out of the ME. I would wager that we could pull every christian out of the ME and in time, the terrorists would be right back at it demanding the next thing on the list. Very few people in the ME hate Americans, very few want to ban christians from the ME, very few are willing to kill Americans for goals that they themselves do not support. It is not the ME that is fighting for this...it is a small proportion of well funded, well connected, well trained, and highly motivated people who have rallied around extremist leaders who falsely claim that a Gihad against Christians (Americans especially) is the will of god and their responsibility. Isolationism and appeasement of terrorist states only tells them that their tactics will yield results, affirming their belief that terrorism is the way to affect political change. Just look at Spain for an example. Blow up a few trains, and suddenly Spain wants nothing to do with a war against terrorism. And terrorism is still \"bad\" right? Thinking that Spain is out of danger by simply backing out of Iraq and condeming the actions of the US is misguided in the least. The terrorists will be back on Spanish soil as soon as they need something else to go their way. The same as they will with any other nation who gives in to their tactics. Give a dog a bone to keep it from biting you, and it will go away and chew on it. As soon as it is gone, the dog will be back for another bone, and if you don't hand it over right away, you get bit again. I say kill the mean dog, save the bones for dogs that ask nicely.", 
   {}, 
   40525, 
   null, 
   1080022020.0
  ], 
  [
   40575, 
   null, 
   "hvozdany", 
   "I don't think it is a matter of arab terrorists invading the United States. That would never happen. And I don't think it is nearly as simple as they want the US and allies out of the ME.\n\n \n Well, I think it is important to look at what terrorists have demanded, and their stated goals....they have been clear, as far as I have seen, that their problem with the US is that we are occupying their holy land. Specifically, in the past, Saudi Arabia.", 
   {}, 
   40549, 
   null, 
   1080037680.0
  ], 
  [
   40576, 
   null, 
   "hvozdany", 
   "\n Are you 100% certain of this? I mean, afterall, the terrorists came here to \"make a better living\" or to get \"educated\". I can't recall the name of that group in Mexico that believes the Southwest is still part of Mexico, but how do you KNOW that the illegals coming over don't have an alterior motive. When they become the majority, who knows what could happen\n\n \n Not to be repetitive, but is this serious??? I hope this was meant to be ironic...if not, please post...", 
   {}, 
   40525, 
   null, 
   1080037800.0
  ], 
  [
   40577, 
   null, 
   "Eddie", 
   "[QUOTE=syklopps61]\nAre you talking about immigrants or terrorists? And if you are talking about immigrants, please explain how they even shares the same intent (other than trying to make a better living for themselves)[/QUOTE\n \n Are you 100% certain of this? I mean, afterall, the terrorists came here to \"make a better living\" or to get \"educated\". I can't recall the name of that group in Mexico that believes the Southwest is still part of Mexico, but how do you KNOW that the illegals coming over don't have an alterior motive. When they become the majority, who knows what could happen\n\n \n I`m talking about the fact that immigrants don`t migrate as a unified group with a unified intent. Are there some who migrate for dubious reasons? I`m sure they are. But that doesn`t exactly make immigrants as a group. an entity that is here to overthrow our way of life...", 
   {}, 
   40525, 
   null, 
   1080041160.0
  ], 
  [
   40618, 
   null, 
   "syklopps61", 
   "Not to be repetitive, but is this serious??? I hope this was meant to be ironic...if not, please post...\n\n\n \n Well, just a little food for thought. How do we KNOW that many of the illegals aren't coming here for that reason? Do you think they would tell us that? I mean, the terrorists didn't come here telling us they were members of a terrorist cell", 
   {}, 
   40576, 
   null, 
   1080061380.0
  ], 
  [
   40620, 
   null, 
   "Eddie", 
   "Well, just a little food for thought. How do we KNOW that many of the illegals aren't coming here for that reason? Do you think they would tell us that? I mean, the terrorists didn't come here telling us they were members of a terrorist cell\n\n \n Well, how do we know that Bush, Putin, Chirac, Schröder and Saddam isn`t controlled by sonic-death-monkeys from Pluto and wants to turn us into food for their warrior cat so that they can go out and battle other inteligent lifeforms in our galaxy? I mean, your theory is very, very far fetched...", 
   {}, 
   40618, 
   null, 
   1080061800.0
  ], 
  [
   40621, 
   null, 
   "sundowner", 
   "Well, just a little food for thought. How do we KNOW that many of the illegals aren't coming here for that reason? Do you think they would tell us that? I mean, the terrorists didn't come here telling us they were members of a terrorist cell\n\n \n Mexicans have not called for a Jihad against the christian infidels. There is a huge difference between illegal immigrants and terrorists. Try to keep your eye on the ball.", 
   {}, 
   40618, 
   null, 
   1080061860.0
  ], 
  [
   40623, 
   null, 
   "sundowner", 
   "Well, I think it is important to look at what terrorists have demanded, and their stated goals....they have been clear, as far as I have seen, that their problem with the US is that we are occupying their holy land. Specifically, in the past, Saudi Arabia.\n\n \n Actually, it involves the US support of Israel and the denial of a Palistinian state more than just getting the US out of the ME. You are right in a respect, but getting the US out of the ME is more of a rally cry to young Arab men to join the Jihad. While getting the US out of the ME (as well as all christians) is part of their grand dream, it is a small part. Again, If you think Bin Laden and the terrorists would stop if all of the chrisitians left the ME, you are sorely deluded.", 
   {}, 
   40575, 
   null, 
   1080062820.0
  ], 
  [
   40633, 
   null, 
   "syklopps61", 
   "Well, how do we know that Bush, Putin, Chirac, Schröder and Saddam isn`t controlled by sonic-death-monkeys from Pluto and wants to turn us into food for their warrior cat so that they can go out and battle other inteligent lifeforms in our galaxy? I mean, your theory is very, very far fetched...\n\n\n \n It MAY very well be, but I'm sure we would have said the same thing about the terrorists. Furthermore, the terrorists have shown the world that our open society can be easily used to defeat the U.S. Am I saying that ALL of the immigrants are coming here for this reason? Of course not.", 
   {}, 
   40620, 
   null, 
   1080065520.0
  ], 
  [
   40635, 
   null, 
   "syklopps61", 
   "Mexicans have not called for a Jihad against the christian infidels. There is a huge difference between illegal immigrants and terrorists. Try to keep your eye on the ball.\n\n\n \n I see just fine, but thanks for your concern. It's called thinking proactively instead of reactively. Isn't it clear the lesson the terrorists have taught? The U.S is very vulnerable to the type of attacks that Israel has endured. I'm not a fatalist, but do you really think that we can go on with our current lifestyle IF that type of terrorism hits us here? Is it beneath this Mexican group to do the same? I'm not saying it's GOING to happen, but are you telling me that it is NOT going to happen?", 
   {}, 
   40621, 
   null, 
   1080065880.0
  ], 
  [
   40637, 
   null, 
   "Eddie", 
   "It MAY very well be, but I'm sure we would have said the same thing about the terrorists.\n\n \n Perhaps, but that doesn`t make your claim any more true than mine.\n \n \n Furthermore, the terrorists have shown the world that our open society can be easily used to defeat the U.S. Am I saying that ALL of the immigrants are coming here for this reason? Of course not.\n\n \n Then what are you saying? That most immigrants migrate for dubious reasons, that many migrate for dubious reasons, that some migrate for dubious reasons or that very few migrate for dubios reasons? I mean you have to put thngs into perspective. Are there people out there buying cars for dubious reasons? Definatly. Is this a huge problem that can only be solved by closing down all car shops? Hardly. Should every car buyer be slumped into a group of potentially homocidal lunatics because some might buy their cars to commit crimes? And if those darn car buyers someday come into majority, will they start using their majority to implement laws to make us their little play toys? ;)", 
   {}, 
   40633, 
   null, 
   1080066060.0
  ], 
  [
   40728, 
   null, 
   "hvozdany", 
   "Actually, it involves the US support of Israel and the denial of a Palistinian state more than just getting the US out of the ME. You are right in a respect, but getting the US out of the ME is more of a rally cry to young Arab men to join the Jihad. While getting the US out of the ME (as well as all christians) is part of their grand dream, it is a small part. Again, If you think Bin Laden and the terrorists would stop if all of the chrisitians left the ME, you are sorely deluded.\n\n \n \n To my knowlege, the coflict in Palestine has recently been mentioned more in statements by Al Queda, but this is relativelly new. Bin Laden has been making statements against the US for a long time, and every one that I have seen has been focused primarily on US occupation of the middle east. In fact, I have read that bin laden has been criticized by memeber of al queda for ignoring the conflict in palestine. For example from the ITC web page...\n \n Bin Laden has been criticized by many of his constituents for neglecting the Palestinian issue in favor of his primary goal of ousting U.S. forces from Saudi Arabia. \n \n Here is the link.\n \n Why do you think that I am deluded because I read the statements of terrorsists to learn their intentions and demands?\n I am not sure why people think that terrorists are crazy and irrational, but the fact is, most of them aren't. They have a stated goal, and they carry out terrorist attacks in an attempt to get governments, etc,. to comply. This is true of most terrorist groups, not just Al Queda.\n Why do you feel that it is more dulusional to read statements by terrorist groups to learn their goals and intentions rather than simply divine what you think their motives are?", 
   {}, 
   40623, 
   null, 
   1080087720.0
  ], 
  [
   40729, 
   null, 
   "syklopps61", 
   "[QUOTE]\nPerhaps, but that doesn`t make your claim any more true than mine.\n\n \n Actually, since mine IS in the realm of possibility it does, at least in the 21st century LOL \n \n \nThen what are you saying? That most immigrants migrate for dubious reasons, that many migrate for dubious reasons, that some migrate for dubious reasons or that very few migrate for dubios reasons? I mean you have to put thngs into perspective. Are there people out there buying cars for dubious reasons? Definatly. Is this a huge problem that can only be solved by closing down all car shops? Hardly. Should every car buyer be slumped into a group of potentially homocidal lunatics because some might buy their cars to commit crimes? And if those darn car buyers someday come into majority, will they start using their majority to implement laws to make us their little play toys? \n \n \n All I'm saying is that it's possible, I don't think absurd analogies are necessary. I find it amazing that you don't see a trend, that what Nick was saying originally has some merit. By 2050 I think it is, White America will be the minority in this country (if we make it that far), and do you really think that the minorities and immigrants of today will take our concerns into account? Why WOULD it be so bad to greatly limit the number of immigrants entering this country? Seems to me, if the immigrants from those other countries want to improve their lives, the countries they come from will remain in squalor-all the most successful and most educated will be HERE instead of THERE where they are needed most so that their countries can become more stable and productive without the aid of other countries.", 
   {}, 
   40637, 
   null, 
   1080087780.0
  ], 
  [
   40731, 
   null, 
   "hvozdany", 
   "Well, just a little food for thought. How do we KNOW that many of the illegals aren't coming here for that reason? Do you think they would tell us that? I mean, the terrorists didn't come here telling us they were members of a terrorist cell\n\n \n \n If people really feel this way, I think it is very scary. The use of 'they' I guess...\n Do people really think that the Mexicans are so different than Americans? I lived in Mexico on and off for a couple of years, and maybe the whole country is just keeping me out of the loop, but I never heard of the great Mexican conspiracy to take over the US.", 
   {}, 
   40618, 
   null, 
   1080088020.0
  ], 
  [
   40733, 
   null, 
   "hvozdany", 
   "[QUOTE=syklopps61]\n\n \n By 2050 I think it is, White America will be the minority in this country (if we make it that far), and do you really think that the minorities and immigrants of today will take our concerns into account? \n\n \n \n Again, to me this is really scary. Why do you think that because a group of people have a different color skin their interests will be so different that 'white america?' Do you think that eveyone with dark skin thinks that same and is out to get whitey???", 
   {}, 
   40729, 
   null, 
   1080088260.0
  ], 
  [
   40738, 
   null, 
   "dsadevil", 
   "All I'm saying is that it's possible, I don't think absurd analogies are necessary. I find it amazing that you don't see a trend, that what Nick was saying originally has some merit. By 2050 I think it is, White America will be the minority in this country (if we make it that far), and do you really think that the minorities and immigrants of today will take our concerns into account? Why WOULD it be so bad to greatly limit the number of immigrants entering this country? Seems to me, if the immigrants from those other countries want to improve their lives, the countries they come from will remain in squalor-all the most successful and most educated will be HERE instead of THERE where they are needed most so that their countries can become more stable and productive without the aid of other countries.\n\n \n My first thought upon reading this \"disturbing\" fact was: so what? I believe the premise of our wonderful democracy is that the majority should rule, with minority rights. That doesn't change regardless of which race is in power. As a race (indeed, as humans) whites don't have any inherent political right to domination. We only have the natural rights afforded to everyone, ones which I believe are adequately enshrined in the constitution and should be protected.\n As for immigrants coming here, I'm all for it. I think it makes America stronger, not weaker, to have people with the drive and ambition to risk life and limb in pursuit of a better life. Hey, it worked for the past 200 years. If anything, we need more liberalization of immigration laws.\n \n And as for our war on terror, well, the dispute is primarily in terms of methodology, not in terms of moral justification. No liberal seriously claims we don't have the right (and i'd say duty) to go after terrorism (arabic or otherwise). What us liberals do is question the methodologies, both on moral and pragmatic grounds.\n So, if our dear conservative friends will indulge me for a moment, I'd like to critique the current administration's policies on the war on terror.\n In a global war on terror, multilateralism is a far superior option than unilateralism. Because the war on terror necessarily transcends national borders, the old rules that make unilateral action permissible tend to disappear. Unlike a classic war, the war on terror often has targets in nation's that do not in anyway support terror, but are unable to control terrorist actions within their own nation. Terrorist groups are transnational organization, and the mere prescence of them within a country does not necessarily make that county complecent (the Bush admins constant reminder that we may have Al Qaeda sleeper cells does not make the US a terrorist nation). However, it does mean that their has to be, to some degree, a respect for the role other nations play and must play for the war to succeed. This is especially clear considering the terrorists aren't just targeting us. Spain, Indonesia, India, and Israel among others have all faced terrorist threats (Israel to a far higher degree than us), and every democratic nation is threatened by the fundamentalist ideology of the terrorists. Thus, since every nation shares the harms, every nation must play a role in defeating the harms, but that REQUIRES consultation.\n The impact is twofold\n 1) Consultation yields cooperation, which is essential. We'd never have been able to accompolish what we have thus far without foreign aid. Whether its British airbases, Israeli intelligence, or Pakisitani assistance in Afghanistan, US action has depended heavily on the help of others. And yet, without consultation, we see that help withering away. Turkey refused to assist us on Iraq, as we wrongfully tried to fiat their help and paid the price. Lack of international troops has stretched US military power to the breaking point, we are woefully undermanned in Afghanistan and losing our grip on Iraq. Pro-US governments are losing ground, anti-US sentiment is on the rise, and it seems that more and more countries will follow Spain's route and withdraw assistance at the first oppurtunity. This cannot happen if we expect longterm success.\n 2) Mulitilateralism represents the best defense against charges of imperialist intent. Right now, the arab world sees us not as liberaters, but as hegemonic occupiers, and it isn't hard to see why. The US has steamrollered over international institutions which WE HELPED CREATE (and whose violation was a pretext for our war in the first place) to go into Iraq. Once their, our reconstruction effort has been marred by destablization and the rejection of Iraqi calls for immediate referendums. Iraqis are quite keenly aware that while looting was running rampant through Baghdad, US troops seized and defended the Ministry of Oil first. My point is not to question US motives (I don't think this was a war for oil, though I do think we were misled on WMDs) but rather to call out what it APPEARS like. So long as we act alone, we are vulnerable to charges that we are acting in our own interest and not in the global interest. \n The other major problem is with our focus on Iraq. This should have been worthy of suspicion at the outset, and now has been proven emprically false. I give kudos to Sen. Bob Graham and others like him who opposed the Iraqi war not b/c of Kucinich like peacenikism, but rather because so long as we don't have Osama, going after what was at best a secondary target on the war on terror could only distract us from the real deal. And what do you know? The result of the Iraq war was a swell in support for Al Qaeda, Osama still on the loose, far too few troops to stabilize Afghanistan, and the resurgence of the Taliban. In his last budget, President Bush FORGET to include any money for reconstructing Afghanistan (oops). Aside from the message it sends to the Afghans, it also is telling of what Iraq did to us: distracted us. Meanwhile, the other emerging threat to the US (and one far more dangerous than Iraq), North Korea, was allowed relative free reign during this time. Our war in Iraq perhaps more than anything else will damage our ability to defuse the Korean crisis. Why? Because the message the North Koreans got was that while oppressive regimes without nukes (Serbia, Iraq, Afghanistan) are vulnerable to US military intervention, those with nukes (NK, China) only get some harsh rhetoric every once in awhile. So long as the N.Koreans see the maintainance of a nuclear arsenal as the only possible check against US invasion, we'll never get them to disarm and never resolve the situation.", 
   {}, 
   40733, 
   null, 
   1080091560.0
  ], 
  [
   40778, 
   null, 
   "sundowner", 
   "By 2050 I think it is, White America will be the minority in this country (if we make it that far), and do you really think that the minorities and immigrants of today will take our concerns into account? \n \n \n I don't know, it could be silly old me, but I tend to think of Americans as Americans, not as whites, blacks, jews, christians, hispanics, etc. I would hope that Americans (especially those elected to public office) would take all Americans concern's into account, as outlined in the constitution. But then again, that's just me, I could be wrong.", 
   {}, 
   40738, 
   null, 
   1080109560.0
  ], 
  [
   40924, 
   null, 
   "syklopps61", 
   "I don't know, it could be silly old me, but I tend to think of Americans as Americans, not as whites, blacks, jews, christians, hispanics, etc. I would hope that Americans (especially those elected to public office) would take all Americans concern's into account, as outlined in the constitution. But then again, that's just me, I could be wrong.\n\n\n \n Oh c'mon, I wouldn't call you silly, maybe just naive and/or idealistic LOL. Take a look at the Black Caucus in Congress-I think it's a safe bet that they wouldn't vote for anything that benefited Whites. Look at the hatred that Blacks have for Whites for wrongs that were committed against their ANCESTORS-think THAT would go away if they had power? You think that the Mexicans coming here in droves would vote for anything that would be considered detrimental toward Mexico or any other Latino country? I invite you to watch Univision sometime LOL Most of the stories on there have an anti-American slant and a \"what will the U.S. give us now\" tone to it. I think what you are doing is looking at the immigrants of the PAST that made this country great, and assuming that the present day immigrants feel the same as they did. In the PAST, they considered themselves AMERICANS first, NOW we have all this hyphenated **** going around (thanks again, Liberals)", 
   {}, 
   40778, 
   null, 
   1080186840.0
  ], 
  [
   40927, 
   null, 
   "hvozdany", 
   "Oh c'mon, I wouldn't call you silly, maybe just naive and/or idealistic LOL. Take a look at the Black Caucus in Congress-I think it's a safe bet that they wouldn't vote for anything that benefited Whites. Look at the hatred that Blacks have for Whites for wrongs that were committed against their ANCESTORS-think THAT would go away if they had power? You think that the Mexicans coming here in droves would vote for anything that would be considered detrimental toward Mexico or any other Latino country? I invite you to watch Univision sometime LOL Most of the stories on there have an anti-American slant and a \"what will the U.S. give us now\" tone to it. I think what you are doing is looking at the immigrants of the PAST that made this country great, and assuming that the present day immigrants feel the same as they did. In the PAST, they considered themselves AMERICANS first, NOW we have all this hyphenated **** going around (thanks again, Liberals)\n\n \n \n Why do you believe that there are laws to help whites, and there are laws to help people with dark skin, and these laws are so different? You think that minorities want to make laws to enslave the white race???", 
   {}, 
   40924, 
   null, 
   1080187860.0
  ], 
  [
   40928, 
   null, 
   "syklopps61", 
   "Why do you believe that there are laws to help whites, and there are laws to help people with dark skin, and these laws are so different? You think that minorities want to make laws to enslave the white race???\n\n\n \n I never said that the laws today are to help Whites-I'm saying that based on attitudes of minorities and immigrants of today I believe that they very well may get involved in self interests and some degree of \"righting wrongs\"", 
   {}, 
   40927, 
   null, 
   1080188940.0
  ], 
  [
   40985, 
   null, 
   "Phunting", 
   "\n Why WOULD it be so bad to greatly limit the number of immigrants entering this country.\n\n Hang on, wasn't the ideal of America a land where people could come to from oppression and live in peace and happiness. That was the whole point.\n \n Now you have created that land and set yourselves up as the new elite society you want to stop people doing exactly what you did yourselves. Talk about hypocracy.", 
   {}, 
   40729, 
   null, 
   1080234840.0
  ], 
  [
   40998, 
   null, 
   "nick", 
   "It was supposed to be a melting pot not a balkanised ghetto. In the UK the immigrants don't even learn to speak English and 13 per cent of the Muslim population are pro al queda, many of whom are probably planning a 9\\11 in London ( or Londonistan ) right now. They will have been housed and serviced in every department by the UK tax payer. They only have to hit a nuclear installation and that will be UK RIP. At least in the States you can survive such an attack. Here there is nowhere to hide.\n \n For this reason I and many tens of thousand of Brits advocate immediate repatriation of the Muslim population, and the raizing of all mosques. They have their country, why do they want to live in the West ? Because its lax liberal society is an ideal training and breeding ground for their Islamafascist terrorist agenda to destroy us.", 
   {
    "post_info": {
     "post_title": "Mosques belong in the Middle East"
    }
   }, 
   40985, 
   null, 
   1080241500.0
  ], 
  [
   41000, 
   null, 
   "sundowner", 
   "Hang on, wasn't the ideal of America a land where people could come to from oppression and live in peace and happiness. That was the whole point.\n \n Now you have created that land and set yourselves up as the new elite society you want to stop people doing exactly what you did yourselves. Talk about hypocracy.\n\n \n It is not a matter of why they are coming to America, at least not from my point of view. I think anyone that wants to come here should be able to. The problem is the way they are coming here. If they came through legal channels, with proper documentation, many Americans would not see any problems. It is the people that arrive in the cargo holds of ships, rafts from Haiti and Cuba, and run across the border from Mexico that are a huge problem. Again, if these people went about it legally, and were properly documented, no problem.", 
   {}, 
   40985, 
   null, 
   1080241560.0
  ], 
  [
   41008, 
   null, 
   "Phunting", 
   "For this reason I and many tens of thousand of Brits advocate immediate repatriation of the Muslim population, and the raizing of all mosques.\n\n What stupid, hate-filled rubbish.\n \n Sundowner, I quite agree with you. Obviously there must be controls, I appreciate that. I don't agree with this paranoia and unjustified prejudice against immigrants that many espouse. It also seems doubly hypocritical coming from an American, due to the ideals on which the country was founded.", 
   {}, 
   40998, 
   null, 
   1080243840.0
  ], 
  [
   41044, 
   null, 
   "hvozdany", 
   "It is not a matter of why they are coming to America, at least not from my point of view. I think anyone that wants to come here should be able to. The problem is the way they are coming here. If they came through legal channels, with proper documentation, many Americans would not see any problems. It is the people that arrive in the cargo holds of ships, rafts from Haiti and Cuba, and run across the border from Mexico that are a huge problem. Again, if these people went about it legally, and were properly documented, no problem.\n\n \n \n I think that everyone would like all imigration to be though legal channels. What I was just saying that I think the fear that some people seem to have about white not being the majority in this county is paranoid, racist, and silly.", 
   {}, 
   41000, 
   null, 
   1080254760.0
  ], 
  [
   41045, 
   null, 
   "hvozdany", 
   "I never said that the laws today are to help Whites-I'm saying that based on attitudes of minorities and immigrants of today I believe that they very well may get involved in self interests and some degree of \"righting wrongs\"\n\n \n \n What do you think that minorities would do?? And what minorities are you talking about? (latin, black, asian, etc?)", 
   {}, 
   40928, 
   null, 
   1080254880.0
  ], 
  [
   41050, 
   null, 
   "sundowner", 
   "I think that everyone would like all imigration to be though legal channels. What I was just saying that I think the fear that some people seem to have about white not being the majority in this county is paranoid, racist, and silly.\n\n \n And I quite agree with you, did I give you any impression otherwise?", 
   {}, 
   41044, 
   null, 
   1080256800.0
  ], 
  [
   41052, 
   null, 
   "hvozdany", 
   "And I quite agree with you, did I give you any impression otherwise?\n\n \n No, I am sorry, I just meant to agree with you, but explain the point of my previous post... :)", 
   {}, 
   41050, 
   null, 
   1080257460.0
  ], 
  [
   41084, 
   null, 
   "syklopps61", 
   "What do you think that minorities would do?? And what minorities are you talking about? (latin, black, asian, etc?)\n\n\n \n I believe, like I said, that they would enact programs to benefit themselves. I know those of you on the left would say that is what White America has done, but looking more closely you would see that White America has bent over backwards to give minorities and immigrants a huge helping hand. \n \n I want to stress that in theory I don't have a problem with immigration; however, the immigrants of today are not as loyal to this country as those of the past. The reasons for coming here are different now-in the past it was for opportunity and today it is for freebies. They sit back and see the stupid Americans suing over hot coffee and they want a piece of the action too. OR it is the social programs. Why do these immigrants insist on keeping their lifesyles and in fact forcing it on us? They do not assimilate into the American culture like those of the past.", 
   {}, 
   41045, 
   null, 
   1080275520.0
  ], 
  [
   41091, 
   null, 
   "dsadevil", 
   "Oh c'mon, I wouldn't call you silly, maybe just naive and/or idealistic LOL. Take a look at the Black Caucus in Congress-I think it's a safe bet that they wouldn't vote for anything that benefited Whites. Look at the hatred that Blacks have for Whites for wrongs that were committed against their ANCESTORS-think THAT would go away if they had power? You think that the Mexicans coming here in droves would vote for anything that would be considered detrimental toward Mexico or any other Latino country? I invite you to watch Univision sometime LOL Most of the stories on there have an anti-American slant and a \"what will the U.S. give us now\" tone to it. I think what you are doing is looking at the immigrants of the PAST that made this country great, and assuming that the present day immigrants feel the same as they did. In the PAST, they considered themselves AMERICANS first, NOW we have all this hyphenated **** going around (thanks again, Liberals)\n\n \n This is almost laughably inaccurate. Let's start from the top. I defy you to name one thing the Congressional Black Caucus has proposed that is, from both a liberal and conservative perspective, \"bad\" for white americans. I say to both liberals and conservatives because the CBC is a liberal organization, so its unsurprising that conservatives would disagree with them mostly. But for the most part, I don't have a disagreement with their advocacies (and yes I'm white).\n Next is your flawed assumption that immigrants today are assimillating less readily than immigrants of the past. This is spectacularly egocentric. EVERY GENERATION has accused its influx of immigrants as being the \"bad apples\" while praising the previous generations of immigrants. German immigrants prior to the turn of the 20th century established almost entirely homogenous communities that had german schools, german churches, and german social halls. The great wave of immigration we had in the early 1900s established dozens of \"littles,\" little italy, chinatown, etc. that are every bit as ethnic and isolated as the innercity ghettos and barios we have today. And then just as now, we had anti-immigration zealots spreading hate. The \"know-nothing party\" of the pre-civil war era raved about the spread of catholicism on our previously \"homogenous\" protestant culture. Quotas in the 1920s sought to cut off the amount of immigration from southeast europe and russia in favor of nordic countries and england. And of course their loyalty was questioned then too. From the Palmer raids to the Japanese Internment, immigrants if anything were viewed more suspiciously than they are today. I don't say \"for good reason\" because I think then and now we are devoid of any good reason. People came to America for the same reasons in 1789, 1909, and 1999: A desire to live freely and earn their fortune in the greatest nation in the world. No amount of anti-immigration zealtry can change that.\n The \"horrors of hypens\" you refer to also strikes me as a misplaced fear. America isn't as strong as it is today because of some monolithic culture which immigrants are \"rejecting.\" America is strong because the strongest principle we have is a free marketplace of ideas, where anyone can advocate anything and we trust in the minds and voices of a free people to sort things out themselves. Implicit in this is two things. First, anyone can have any culture they want, and yes, they can and should do it here. Second, being the rational and intelligent people we are, we pick and choose to create a synthesis of all the best aspects of every culture (Hegelian Dialectic). This is why I can drive 5 minutes into town and choose between Chinese, Meditteranean, Italian, Japanese, Mexican, or Continental cuisine. More deeply, it is how we recieved many aspects of our music, literature, art, amd culture in general. Multiculturalism is America's greatest strength, both in terms of internal growth and external security. As Charles Ogletree, Professor of Law at Harvard University puts it \"The U.S. has not been a fertile breeding ground for terrorism... diversity, religious and ethnic tolerance, a reliance on legal proceedings open to public scrutiny... are all values make it hard to nurture in the U.S. the ethnic or religious hatred that fuels much terrorism.\" In contrast to European countries where ethnic and minority groups are made to feel as outsiders from the \"norm,\" the US holds as one of its chief moral values the ideal that immigrants are the norm, that the US is a nation made up of a amalgamation of other countries, ethnicities, religions, and opinions.\n \n Ultimately, I'd assert one would be hard pressed to identify an \"american\" culture that DIDN'T come through immigrants. After all, with the exception of native americans (who \"white america\" has spent the past 300 years oppressing), we are all immigrants to some degree. Abandoning that tradition now would be abandoning America.", 
   {
    "unicode_changes_made": true
   }, 
   40924, 
   null, 
   1080278760.0
  ], 
  [
   41092, 
   null, 
   "hvozdany", 
   "I believe, like I said, that they would enact programs to benefit themselves.\n ...\n The reasons for coming here are different now-in the past it was for opportunity and today it is for freebies. \n\n \n First, I want to thank Dsadevil for a great post.\n \n I am still wondering, though, like I said, what kind of laws are you afraid that minorities would pass that would benefit themselves?\n \n Also, does anyone really believe that 'come here to get the freebies' argument? I assume that with immigration now, we are mostly talking about Latin people in general, and Mexicans in particular. Does anyone really think that most Mexicans coming here are not extremely hard working?", 
   {}, 
   41084, 
   null, 
   1080280620.0
  ], 
  [
   41117, 
   null, 
   "sundowner", 
   "First, I want to thank Dsadevil for a great post.\n \n I am still wondering, though, like I said, what kind of laws are you afraid that minorities would pass that would benefit themselves?\n \n Also, does anyone really believe that 'come here to get the freebies' argument? I assume that with immigration now, we are mostly talking about Latin people in general, and Mexicans in particular. Does anyone really think that most Mexicans coming here are not extremely hard working?\n\n \n I second the great post by Dsadevil. Awesome man! Anyway, I don't buy the freebies argument either. I would wager syklopps does not live in an ethnically diverse area. Since I have been in S FL, I have been exposed to a large hispanic population. The people come from every country south of Miami, and they come in search of the American values that we take for granted. They are also some of the hardest working people I have ever met. (of course there are exceptions everywhere, but I speak of the masses) And as far as keeping their culture, that is their right as Americans. America is made up of diverse cultures from all over the world, and in time, they tend to blend together into the rising concept of an American culture. Now I do agree that they should learn english and strive for citizenship, but most do. It is a common misconception that everyone from Cuba or Haiti are here illegally and just waiting for la migra to come and get them. This is totally false. Since I have been here, I have met so many interesting people from Cuba it would simply amaze you. One of my closest friends is a Cuban immigrant who speaks english better than some natural American citizens. He has been here for 3 years, is working very hard to get his citizenship, a fact of which he is very proud. Once I asked him why he chose to come to America, and he simply said \"freedom\". This is a person who appreciates America more than most natural born citizens do, because he knows what it is like to have very little. Yes, America does have a large problem with illegals, however most are here for the same reasons, they just do not go about it legally. In Cuba, to come to the US legally, you must be selected through a lottery, and many Cubans desire freedom so bad, that the chose to risk their lives on rafts and boats to get to America rather than wait the years it may take to get here legally. I am sure it is the same with many Mexicans. So just be a little careful in your generalizations.", 
   {}, 
   41092, 
   null, 
   1080285060.0
  ], 
  [
   41137, 
   null, 
   "Phunting", 
   "And I third it.\n \n \n \nSince I have been in S FL,\n\n But forgive a Brit, what is SFL?", 
   {}, 
   41117, 
   null, 
   1080304380.0
  ], 
  [
   41160, 
   null, 
   "nick", 
   "No doubt you are a muslim. \n \n The admin must be as well, and he has warned me for saying nasty things about the French. I think admin must be clinically insane to remove my post.\n \n Who would want to be on a site forum full of liberals sucking up to terrorists and apologising for them? I want to vomit all over the lot of you. \n \n I am out of here. Please remove me from this vile pestilential forum.", 
   {
    "post_info": {
     "post_title": "Brit in name only"
    }
   }, 
   41137, 
   null, 
   1080318900.0
  ], 
  [
   41162, 
   null, 
   "Phunting", 
   "Brit in name only\n\n How dare you? I love my country, and do a damn site more for her than spouting hatefull racist rubish.\n \n \n \nNo doubt you are a muslim.\n\n No, sorry.\n \n \n \nThe admin must be as well, and he has warned me for saying nasty things about the French. I think admin must be clinically insane to remove my post.\n\n Yeah because only Muslims and the clinically insane would want to keep a debating website free of racism emoticon_rolleyes\n \n I think admin has been far too generous in fact not kicking you out on your arse long ago.\n \n edit: oh I see he has been, what a shame.\n \n \n \nWho would want to be on a site forum full of liberals sucking up to terrorists and apologising for them?\n\n I can't even lower myself to responding to that. Sort yourself out and come up with something proper to say.\n \n \n \nI want to vomit all over the lot of you.\n\n I assure you the feeling is more than mutual.\n \n \n \nI am out of here.\n\n Don't let the door hit you on the way out.\n \n What an idiot.", 
   {}, 
   41160, 
   null, 
   1080320100.0
  ], 
  [
   41165, 
   null, 
   "hvozdany", 
   "And I third it.\n \n \n \n But forgive a Brit, what is SFL?\n\n \n \n Not mine to answer, but I am pretty sure that he mean souther Florida. I apologize in advance if I am wrong as to what you meant.", 
   {}, 
   41137, 
   null, 
   1080324000.0
  ], 
  [
   41179, 
   null, 
   "sundowner", 
   "And I third it.\n \n \n \n But forgive a Brit, what is SFL?\n\n \n South Florida. Actually, Ft. Lauderdale / Miami. Sorry, sometimes I forget that this forum is global, I did not mean to be so myopic. And does anyone else feel the need to say \"ahhhhhh\"? :p", 
   {}, 
   41137, 
   null, 
   1080330300.0
  ], 
  [
   41185, 
   null, 
   "jim's trucking", 
   "Back to the death wish...\n \n ...is not liberalism akin to socialism?\n \n Can anyone list the successful socialist countries for me?\n \n (Experts only, please!)", 
   {}, 
   41179, 
   null, 
   1080334500.0
  ], 
  [
   41190, 
   null, 
   "hvozdany", 
   "Back to the death wish...\n \n ...is not liberalism akin to socialism?\n \n Can anyone list the successful socialist countries for me?\n \n (Experts only, please!)\n\n \n I don't think that they are the same thing, even though it is hard to say what, exactly, liberalism is. I think that just because many liberals believe that the rich should pay more taxes to to ease the burden on the poor, that does not mean that they want to switch to a system where there is no such thing as individual wealth. Isn't it making quite a jump to say that they are the same thing?\n If they are, I would say we are already a socialist county since we do have a progressive tax system.\n By the way, I am assuming this is mostly why you think they are the same (taxing). If not, sorry, and please clarify why you think they are the same.", 
   {}, 
   41185, 
   null, 
   1080336060.0
  ], 
  [
   41194, 
   null, 
   "syklopps61", 
   "I defy you to name one thing the Congressional Black Caucus has proposed that is, from both a liberal and conservative perspective, \"bad\" for white americans.\n\n \n Well, thank God they don't have the power to do so yet!!\n \n I can respect your post, but just happen to disagree. I realize the immigrants of the past had their mini cultures here, but they didn't expect the rest of the country to learn THEIR language. Those little mini societies were places they could go to be among people who were familiar with their culture, but they certainly didn't try to impose it on America. My grandparents immigrated from the Ukraine and immediately forced their kids to speak English and ONLY spoke Ukrainian to each other, because they were AMERICANS now, NOT Ukrainian-Americans\n \n \nMulticulturalism is America's greatest strength\n\n \n With all due respect, this is just not true, that's the BS espoused by Clinton and the Left. This country is strong because immigrants came together to become Americans first. All this hyphenated BS just weakens us, pits us against each other", 
   {}, 
   41091, 
   null, 
   1080336660.0
  ], 
  [
   41196, 
   null, 
   "jim's trucking", 
   "I don't think that they are the same thing, even though it is hard to say what, exactly, liberalism is. I think that just because many liberals believe that the rich should pay more taxes to to ease the burden on the poor, that does not mean that they want to switch to a system where there is no such thing as individual wealth. Isn't it making quite a jump to say that they are the same thing?\n If they are, I would say we are already a socialist county since we do have a progressive tax system.\n By the way, I am assuming this is mostly why you think they are the same (taxing). If not, sorry, and please clarify why you think they are the same.\n\n \n I did not mean to imply that I think they are the same...but essentially similar. The tendency to favor welfare programs and governmental giveaways leads me to say that. While I do not think the liberals want to abolish private ownership of property (after all, there are a lot of rich property owning liberals), I do see a tendency toward having the productive population provide support to those who choose not to work.\n \n ...and I am not feigning ignorance of socialist countries. I just need a list of supposedly successful socialist governments.", 
   {}, 
   41190, 
   null, 
   1080337080.0
  ], 
  [
   41204, 
   null, 
   "dsadevil", 
   " I can respect your post, but just happen to disagree. I realize the immigrants of the past had their mini cultures here, but they didn't expect the rest of the country to learn THEIR language. Those little mini societies were places they could go to be among people who were familiar with their culture, but they certainly didn't try to impose it on America. My grandparents immigrated from the Ukraine and immediately forced their kids to speak English and ONLY spoke Ukrainian to each other, because they were AMERICANS now, NOT Ukrainian-Americans \n\n \n As much as I respect your right to disagree (I'd be a bit of a hypocrite if I didn't! :) ), your answer was non-responsive. First of all, that the CBC doesn't have power NOW doesn't mean they can't ADVOCATE things. So once again, I ask you to support your assertion that what they advocate can qualitatively said to be monolithically good for blacks and monolithically bad for whites. It shouldn't be too hard, just visit their website!\n Second, I'm in half agreement with you on how immigrants behaved in years past, but I think you're creating a false distinction. The point I made in my last post was that even as immigrants in years past assimillated (as you say yourself, rather successfully), they were lambasted on all sides for being too ethnocentric and not being \"american\" enough. Today, I see the exact situation, immigrants working to become part of the American dream and being criticized for not trying hard enough. I honestly can see zero differnece in behavioral patterns between immigrants in the past and those now. The only difference from your standpoint: when your family was an immigrant you claimed you were assimillating fine thanks, and now as an observer from entrenched america, you assail those doing the same. Since all the \"examples\" you cited of immigrants not assimillating I showed you happened with every wave of immigration, your points are non-unique and empirically denied.\n \nWith all due respect, this is just not true, that's the BS espoused by Clinton and the Left. This country is strong because immigrants came together to become Americans first. All this hyphenated BS just weakens us, pits us against each other\n \n What is \"American\"? I need you to define that before you go any further, because I define America as an amalgamation of different cultures, ethnicities, beliefs etc. all here to enjoy the freedom to be different.\n \n \nI did not mean to imply that I think they are the same...but essentially similar. The tendency to favor welfare programs and governmental giveaways leads me to say that. While I do not think the liberals want to abolish private ownership of property (after all, there are a lot of rich property owning liberals), I do see a tendency toward having the productive population provide support to those who choose not to work.\n \n The problem with \"liberalism\" as a term is its somewhat vague. The \"classical\" definition of liberalism would be defined as libertarian, that is, total freedom for individuals and minimal government interference. On a modern left-right scale, \"liberalism\" is socially liberal and economically conservative. Modern liberals fuse an allowance for govt. interference in the economy with an abhorence for its interfence in social issues (conservatives tend to do the reverse). This type of liberalism, economically, is the moderate form of socialism (but this is no more meaningful than saying that modern conservatives, on social issues, is a moderate form of fascism). Whether or not there has been a successful socialist country depends on how expansive your definition is. Sweden and the rest of Scandanavia could be seen as successful socialism for example.\n What American liberals tend to advocate is very different than the qualities you lay out for them. Modern liberals realize that the free market, left to its own devices, is simply not an adequete mechanism for millions of hardworking human beings. The free market, contrary to conservative rhetoric, tends to minimize employment, minimize benefits, and minimize the amount of money that flows to the working class. Liberals don't wish to abolish the free market but merely reform it so it is more efficient. For example, traditional economic theory dictates that money has a higher multiplier effect (is more stimulative) when it is given to poor people as opposed to rich people. However, in a laissez-faire system, this isn't what occurs (look at the industrial revolution, millions of dollars held by a few barons as workers labor with almost no protections and pittance wages). Liberals recognize that is makes both social and economic sense to force some of that money to be redistributed, both because it gives people due reward for working (as my dear friend Bill Clinton put it \"if you work hard and play by the rules, no one should be forced to live in poverty\"), but it also is BETTER for the economy than laissez-faire is. Liberals don't tend to advocate paying people who can work but are too lazy to. We advocate paying people who can work but arent ABLE to because the market naturally has unemployement. Furthermore, true liberals would advocate aggressive job-training so that people who are thrown out of work can get back into the marketplace, especially in depressed areas where the old jobs simply aren't to be found.\n Welfare \"reform\" is an interesting case scenario. The old system was clearly problematic, for the reasons you imply, it would pay people who were lazy. The conservative solution, however, merely exacerbated the problem. By making the goal of welfare to get people off the welfare rolls (as opposed to on the job rolls), there was zero incentive for the states to spend the money to get these people employed. The impacts were obvious: states made draconian requirements to stay on welfare, and when people who were looking for a job, were unable to find one, they were kicked off welfare and conservatives declared victory. I would submit that if we are going to have poor people in despair with no job, its morally better to give them a certain amount of money then to leave them with zero hope, but that isn't the issue. The proper solution lies in the middle ground, where we create incentives to work, not punishments for not working. This is why the EITC is my favorite federal program ever, it rewards people for working hard and moving up the economic ladder WITHOUT hurting those who aren't able to (incidentally, EITC fraud is the only tax fraud issue that the Bush administration has expressed any interest in prosecuting. That thousands of poor americans who are unable to provide adequate documentation are being targeted for tax fraud that amounts to, at most, a few thousand dollars per person, by an administration that has done more than any other to exempt rich americans from paying their fair share to society is sick irony).", 
   {}, 
   41196, 
   null, 
   1080341340.0
  ], 
  [
   41254, 
   null, 
   "syklopps61", 
   "your answer was non-responsive. First of all, that the CBC doesn't have power NOW doesn't mean they can't ADVOCATE things. So once again, I ask you to support your assertion that what they advocate can qualitatively said to be monolithically good for blacks and monolithically bad for whites. It shouldn't be too hard, just visit their website!\n\n \n Well, I'm sorry my response isn't what you were looking for, but I'm not naive enough to believe that what they put on their website is the TRUTH. Afterall, I would venture a guess and say that you don't believe what the GOP has on their website :-D When every (or many) issue they address is racially motivated, then yes, I'm going to question their motives and have concerns about the future\n \n \nWhat is \"American\"? I need you to define that before you go any further, because I define America as an amalgamation of different cultures, ethnicities, beliefs etc. all here to enjoy the freedom to be different\n\n \n Expanding on your definition, that these people come together to form ONE country, not a bunch of mini-societies within that country. Despite what you think, that DOES weaken a country because the enemies are within rather than out. We become pitted against each other for any number of reasons. \n \n \nToday, I see the exact situation, immigrants working to become part of the American dream and being criticized for not trying hard enough. I honestly can see zero differnece in behavioral patterns between immigrants in the past and those now. \n \n \n I would say that you have only seen ONE wave, and read about others, and unfortunately since historical revisionism has been the in thing since the 90's, I'm not sure I would believe anything written today. The immigrants of today come here with an arrogance born of the Left, that we have to automatically accept them and place them high on a pedestal for their differences, and they flaunt that in the face of America. SPEAK ENGLISH!!! THAT would help immensely. DON'T REQUIRE AMERICANS TO SPEAK ANOTHER LANGUAGE TO MAKE THE IMMIGRANTS FEEL MORE WELCOME!!! THAT would also help\n \n \nThe only difference from your standpoint: when your family was an immigrant you claimed you were assimillating fine thanks, and now as an observer from entrenched america, you assail those doing the same.\n\n \n My wife is an immigrant from Peru and just received her citizenship. She values her citizenship more than life itself. It's touching to see someone actually cry EVERYtime the national anthem is played, because she truly understands what an honor it really is to be an American. Whenever another Hispanic says \"hola\" to her, she jumps down their throat and tells them to speak English-I LOVE IT!!! And I tend to think that MOST Americans feel this way. My kids are not raised with this Peruvian-American BS-they are AMERICANS. Anyway, I speak of my past and present.\n \n \ntraditional economic theory dictates that money has a higher multiplier effect (is more stimulative) when it is given to poor people as opposed to rich people.\n\n \n A question for all-how many work for somebody who is poor?\n \n And the rich pay MORE than their fair share, but no sense going there", 
   {}, 
   41204, 
   null, 
   1080361620.0
  ], 
  [
   41283, 
   null, 
   "dsadevil", 
   "Well, I'm sorry my response isn't what you were looking for, but I'm not naive enough to believe that what they put on their website is the TRUTH. Afterall, I would venture a guess and say that you don't believe what the GOP has on their website :-D When every (or many) issue they address is racially motivated, then yes, I'm going to question their motives and have concerns about the future\n \n \n \n Expanding on your definition, that these people come together to form ONE country, not a bunch of mini-societies within that country. Despite what you think, that DOES weaken a country because the enemies are within rather than out. We become pitted against each other for any number of reasons. \n \n \n \n I would say that you have only seen ONE wave, and read about others, and unfortunately since historical revisionism has been the in thing since the 90's, I'm not sure I would believe anything written today. The immigrants of today come here with an arrogance born of the Left, that we have to automatically accept them and place them high on a pedestal for their differences, and they flaunt that in the face of America. SPEAK ENGLISH!!! THAT would help immensely. DON'T REQUIRE AMERICANS TO SPEAK ANOTHER LANGUAGE TO MAKE THE IMMIGRANTS FEEL MORE WELCOME!!! THAT would also help\n \n \n \n My wife is an immigrant from Peru and just received her citizenship. She values her citizenship more than life itself. It's touching to see someone actually cry EVERYtime the national anthem is played, because she truly understands what an honor it really is to be an American. Whenever another Hispanic says \"hola\" to her, she jumps down their throat and tells them to speak English-I LOVE IT!!! And I tend to think that MOST Americans feel this way. My kids are not raised with this Peruvian-American BS-they are AMERICANS. Anyway, I speak of my past and present.\n \n \n \n A question for all-how many work for somebody who is poor?\n \n And the rich pay MORE than their fair share, but no sense going there\n\n Am I the only catching some conspiracy theory vibes? The CBC are lying in wait to destroy white America. Multiculturalism is a creation of the liberal left designed to destroy white America. The taco I ate this weekend is an example of white self hatred and will ultimately destroy America.\n If you aren't willing to believe anything the CBC says, then their is no way to prove you wrong. But I can't figure out their motive to lie. Let's examine this logically, because I think your position isn't really tenable even from your own assumptions.\n You assume two things:\n 1) \"Black\" interests will directly or indirectly harm whites\n 2) The CBC is a group dedicated to advancing those interests\n Now, if that's the case, why would they lie to make their positions more tenable to white america? Whites aren't their constituency. It serves absolutely no purpose to try to appeal to whites within your framework, because even if they fooled them once to get into power, they'd lose power in the next election when whites realized they were lying. You're theory only works if the CBC BOTH is totally beholden to \"black\" interests AND has a deep prevailing desire to gain white votes. Occam's razor would suggest the simpler solution: they are telling the truth and that \"black\" and \"white\" positions aren't the polar opposites you claim they are.\n \n Next: you say that America is lots of people from all over the place here to form ONE country. Fine. I think that one country is a nice, happy, multicultural salad bowl of different beliefs. But even buying your assumption that America is a monolithic culture, why does that culture have to be WASPish? Why can't I assert that the monolithic culture is latino? Or native american (which would make the most sense of all)? You are substituting the dominant culture for \"the\" culture, and that isn't a valid assumption. \n Then you claim that multiculturalism weakens us because it creates domestic enemies.\n 1) Why are seperate groups within America \"enemies\" of each other? I haven't seen a race riot in a while. Those \"uppity\" blacks seem relatively content with our wonderful society. I don't see the racial hatred you speak of, and where it IS present is in the locations most likely to espouse the anti-diversity rhetoric you talk of.\n 2) Not only this, but you ignore ALL the analysis I gave previously about the benefits of multiculturalism. I tell you that it has contributed to what \"american\" culture their is, I give you the food example, and I even gave you the quote by Prof. Ogletree of Harvard about how it makes us more safer. In response, you essentially say I'm just wrong without providing any analysis behind it. You've seen this yourself with your wife, why do you insist on viewing her as the exception rather than the rule?\n Your point on historical revisionism and current vs. past waves of immigration merely reinforces my point. I said, based on my observations of current immigration trends, modern immigrants are doing everything they are supposed to: they are fighting for freedom, building businesses, and, as you so convienantly cite, proud to be here. I then say that the divisive characteristics you cite were present in all waves of immigration, to which you claim I'm reading revisionist histories (warrant?). IF the books are revisionist however, it just means past immigrants are WORSE than they are today, the books are revising history to make them look better and more like the excellent immigrants I see today.\n Then you basically request of immigrants to SPEAK ENGLISH. Two responses:\n 1) Learning a new language is HARD. Speaking as someone who has tried with very little success to learn Spanish, I am reticent to criticize those who have trouble doing it as well (esp. considering English is extremely tough to learn).\n 2) Perhaps immigrants should learn the official language of the US. But since we don't have an official language (english is NOT the official language of america), that doesn't mean anything. English happens to be the language spoken by most Americans. But once again, that's no different then claiming that white is the skin color held by most americans? should all blacks get plastic surgery so they aren't seen as \"different\"? W/out an official language, there is zero reason to claim immigrants are worse humans because they dont speak english, and your arguement is merely based off of prejudice.\n \n And finally, not to jump into the economics debate, but the answer to your question is another question \"how many businesses are dependent on SPENDING from the poor?\" The reason that the economic law I cited (the law of diminishing returns) holds true is because the poor are more likely to spend than the rich. Money given to the poor is almost immediately pumped back in to the economy, money given to the rich is put in savings accounts, or if it is spent, it is spent on luxury goods which are often imported (buying a Ferrari helps Italians alot, but Americans very little). And to answer your question more directly: very few americans work for the rich. Many work for rich CORPORATIONS, but corporate tax brackets are seperate than individual tax brackets. Oh, and small businesses employ more people than mego-corps. So a responsible tax policy (and the liberal tax policy) is to cut taxes on the middle and lower class (so they spend more), and small businesses (so they hire more).", 
   {}, 
   41254, 
   null, 
   1080413760.0
  ], 
  [
   41365, 
   null, 
   "Eddie", 
   "...and I am not feigning ignorance of socialist countries. I just need a list of supposedly successful socialist governments.\n\n \n It all depends on how you view \"socialistic\" (and to a lesser extent, also success). If you are refering to the strict marxist definition of socialistic countries, I guess that would only leave former Soviet union, the east european countries, Kuba and China as any larger examples. And they where not terrible sucssfull (allthough they haven`t done that bad, ecp. not China. If you are refering to the more common usage of the word, as in liberal socialism. Countries with high taxes, extensive wellfare and more or less socialistic governments. I can provide a small, albeit strong list of (highly?) succesful countries: \n \n Norway\n GNP/capita: ca 30,000 dollars (2000)\n Unemployment: 3,4% (2000)\n HDI placement*: 1 (0,944) (2003)\n \n Iceland\n GNP/Capita: Ca 29,000 dollars (2000)\n Unemployment: 1,4% (2000)\n HDI placement: 2 (0,942) (2003)\n \n Source: http://www.leksikon.org/art.php?n=3089 (norweigan) and http://www.europaportalen.nu/statistik/fn-hdi.html\n \n Sweden\n GNP/capita: ca 27,000 dollars (2004)\n Unemployment: 5-6% (2003)\n HDI placement: 3 (0,941) (2003)\n \n Source: http://www.europaportalen.nu/statistik/fn-hdi.html and http://www.europaportalen.nu/statistik/aloshet.html (Arbetslöshet=Unemployment)\n \n Comparisson: USA\n GNP/capita: ca 34,000 dollars (2000)\n Unemployment: 6-6,5% (2003)\n HDI placement: 6 (0,937) (2003)\n \n Source http://www.leksikon.org/art.php?n=3073&t=257 and http://www.europaportalen.nu/statistik/fn-hdi.html and http://www.europaportalen.nu/statistik/aloshet.html\n \n * HDI= Human Development Index. An index to meassure the wellfare of one country based on GNP/capita, educational level, life expectancy, litteracy etc etc.", 
   {}, 
   41196, 
   null, 
   1080507360.0
  ], 
  [
   41444, 
   null, 
   "syklopps61", 
   "Am I the only catching some conspiracy theory vibes? \n \n \n I PRAY that you don't believe that only Conservatives are guilty of conspiracy theories!! LOL VAST RIGHT WING CONSPIRACY RING A BELL? How about HALIBURTON? LMAO Please, don't try to come across as trying to take the high road\n \n Anyway, rather than quote everything you posted, I will say that if my \"Right\" leaning views make my argument invalid, then your \"Left\" leaning views lack credibility as well. I mean, you would be predisposed to believe that the CBC truly want what's best for the country, so they can do no wrong. \n \n \n1) \"Black\" interests will directly or indirectly harm whites\n \n \n Do I believe that if Blacks had power they would weild it for the benefit of all? NNNOPE When and if you decide to open your eyes, you would see the hatred Blacks have for Whites is palpable. IF/WHEN Whites become the minority, how could we vote them OUT of power? Besides, there are enough Whites on the Left that are riddled with guilt that they would do what they could to have the \"oppressed Blacks\" have power for a change\n \n \nwhy does that culture have to be WASPish?\n\n \n Why SHOULDN'T it be? Why do you believe that our country should be for everyone ELSE? I have seen many posts on here that say the terrorists just want us out of their region so they don't have to be influenced by Western culture, and yet they view this as noble and honorable. When it comes to the U.S., suddenly it's a bad thing to allow these other cultures to take over. I have no problem with Mexican Restaurants, but I don't think I should be forced to learn Spanish so that the Mexicans can feel welcome\n \n \nWhy are seperate groups within America \"enemies\" of each other?\n\n \n We ARE only human ya know. We DO have differences that make us not like each other. I realize you are idealistic, but to believe that ALL people should just be able to set aside their differences and sing \"koombyah\" (sorry for the misspell, it's not in my collection) hand in hand is a joke \n \n \nNot only this, but you ignore ALL the analysis I gave previously about the benefits of multiculturalism. I tell you that it has contributed to what \"american\" culture their is, I give you the food example, and I even gave you the quote by Prof. Ogletree of Harvard about how it makes us more safer.\n\n \n I read your posts and all the analysis-I'm not sure driving down the road to get Chinese food is a great example of how strong our country is because it's there. And I will not take anything a professor at Harvard says as being even remotely close to the truth LOL\n \n \nIF the books are revisionist however, it just means past immigrants are WORSE than they are today, the books are revising history to make them look better and more like the excellent immigrants I see today.\n\n \n No, actually what it means is to make the CURRENT immigrants look like the wonderful immigrants of the PAST, the revisionists have to attribute characteristics of the current immigrants to those of the past, to give the appearance that they share the same noble intentions of being here in the U.S.\n \n \nLearning a new language is HARD. Speaking as someone who has tried with very little success to learn Spanish, I am reticent to criticize those who have trouble doing it as well (esp. considering English is extremely tough to learn).\n\n \n Ever hear of Immersion? My wife didn't speak a word of English when we met. I speak little Spanish. She is an average person-no Einstein but no dummy-and she learned it just fine. The immigrants of today are not being forced to learn and they should be. Why should a driver's license be given in different languages? Your contention is absurd and typical of the Left. It was tough on the immigrants of the past, and that is why they assimilated to America just fine. Today, the immigrants have no sacrifices, no difficulties that give them a \"right of passage\" to becoming a U.S. citizen\n \n \nPerhaps immigrants should learn the official language of the US. But since we don't have an official language (english is NOT the official language of america), that doesn't mean anything. English happens to be the language spoken by most Americans. .\n\n \n \n Oh c'mon, you on the Left would support this? LMAO You know as well as I do that the ACLU would fight this tooth and nail. You would love to have the Right try to propose this so you could say \"SEE, those racist pigs\" LOL \n \n \nW/out an official language, there is zero reason to claim immigrants are worse humans because they dont speak english, and your arguement is merely based off of prejudice\n\n \n I realize that the Administrator believes that Liberal is a four letter word, but I wonder what he thinks of calling someone prejudice and inferring that I have called anyone worse human beings for not speaking English. Anyway, you ARE a bleeding heart Liberal and throwing out those comments robs you of any credibility", 
   {}, 
   41283, 
   null, 
   1080576180.0
  ], 
  [
   41448, 
   null, 
   "Phunting", 
   "Do I believe that if Blacks had power they would weild it for the benefit of all? NNNOPE When and if you decide to open your eyes, you would see the hatred Blacks have for Whites is palpable. IF/WHEN Whites become the minority, how could we vote them OUT of power? \n Besides, there are enough Whites on the Left that are riddled with guilt that they would do what they could to have the \"oppressed Blacks\" have power for a change\n\n Why do you insist in seeing it as us vs them, white vs blacks? We are all Americans, so what if we have different skin colours? I vote for whoever I vote for because of political opinion, nothing to do with colour either way.\n \n \n \nWhy SHOULDN'T it be?\n\n Because that would be restricting/being preferential to a particular colour and religion. Which is exactly what the US claims to stand against.\n \n \n \nI don't think I should be forced to learn Spanish so that the Mexicans can feel welcome\n\n And who forces you to do that?\n \n \n \nWe ARE only human ya know. We DO have differences that make us not like each other. I realize you are idealistic, but to believe that ALL people should just be able to set aside their differences and sing \"koombyah\" (sorry for the misspell, it's not in my collection) hand in hand is a joke \nBeing human does not mean that you automatically see those of a different colour/race/religion/opinion as our enemy. That is called being prejudice.\n \n \n \nThe immigrants of today are not being forced to learn and they should be.\n\n Here I sort of agree with you. Immigrants can only benefit their new society if they can properly interact with it. While tests shouldn't necessarily be required for entry (it can be hard to learn abroad) I agree that once in they should be seen to be making an effort to learn. \n \n \n \nOh c'mon, you on the Left would support this?\n\n I'm becoming increasingly annoyed by the regularity the phrase 'you on the left'/'you liberals' is thrown about on these forums. I personally don't appreciate being stereotyped just because one particular view I hold falls within political policy opposed to your own. (Yes I know the comment wasn't at me, but still).\n \n \n \nI realize that the Administrator believes that Liberal is a four letter word,\n\n Not sure what you mean here.", 
   {}, 
   41444, 
   null, 
   1080577620.0
  ], 
  [
   41486, 
   null, 
   "syklopps61", 
   "Why do you insist in seeing it as us vs them, white vs blacks? We are all Americans, so what if we have different skin colours? I vote for whoever I vote for because of political opinion, nothing to do with colour either way.\n\n \n Believe it or not, so do I!! I live in GA, Herman Cain is running for the Senate and appears to be very Conservative-he's got my vote. And yes, he is Black and American, not an African-American. Check out the mayoral race in Philadelphia-when Street said the brothers were taking back the city, the Blacks came out of the woodwork, and much like Hussein, I believe he received 99% of the Black vote. One example I know, but it does show the possibility of similar patterns in the future \n \n \nBecause that would be restricting/being preferential to a particular colour and religion. Which is exactly what the US claims to stand against.\n\n \n I agree, but not at the cost of losing our country\n \n \nAnd who forces you to do that?\n\n \n Okay, forced was a strong word. If you go to Miami, however, you know what I mean. Americans should not have to feel like aliens in their own country \n \n \nI'm becoming increasingly annoyed by the regularity the phrase 'you on the left'/'you liberals' is thrown about on these forums. I personally don't appreciate being stereotyped just because one particular view I hold falls within political policy opposed to your own. (Yes I know the comment wasn't at me, but still).\n\n \n Well, I hope that you have the same annoyance at those who will stereotype Conservatives. \n \n \nBeing human does not mean that you automatically see those of a different colour/race/religion/opinion as our enemy. That is called being prejudice.\n\n \n I recongnize differences in people and see the reality that we are not all going to get along in complete peace. It's a lofty goal, but one that cannot be achieved. \n \n \nNot sure what you mean here.\n\n\n \n I've been the recipient of warnings privately and have seen some on the site, and many are referencing the negative connotation with the term Liberal, but haven't seen any that are geared toward protecting the feelings of Conservatives (I personally could care less if someone labels me a Conservative, I wear that label with pride. I understand that sticks and stones...)", 
   {}, 
   41448, 
   null, 
   1080586500.0
  ], 
  [
   41536, 
   null, 
   "Toukalos", 
   "I've been the recipient of warnings privately and have seen some on the site, and many are referencing the negative connotation with the term Liberal, but haven't seen any that are geared toward protecting the feelings of Conservatives (I personally could care less if someone labels me a Conservative, I wear that label with pride. I understand that sticks and stones...)\n\n \n Could you please explain the origins of the conservative \"victim\" complex? I see a trend of conservatives <the exception being Libertarians< feeling that they are somehow being persecuted in the U.S.A.; They control the Congress and the Presidency. Skylopps, if your theory of \"groups\" getting into power and then passing laws to benefit themselves hold true, then how are conservatives being assailed when they hold almost total federal power?", 
   {}, 
   41486, 
   null, 
   1080604140.0
  ], 
  [
   41580, 
   null, 
   "syklopps61", 
   "Could you please explain the origins of the conservative \"victim\" complex? I see a trend of conservatives <the exception being Libertarians< feeling that they are somehow being persecuted in the U.S.A.; They control the Congress and the Presidency. Skylopps, if your theory of \"groups\" getting into power and then passing laws to benefit themselves hold true, then how are conservatives being assailed when they hold almost total federal power?\n\n\n \n LMAO, you're kidding, right? I was obviously being sarcastic. I HAVE received these messages and saw some in other threads. I am able to handle name calling just fine, it's the Liberals (oooops) that seem to have a tough time with it. \n \n And regarding Conservatives in power? I couldn't be more disappointed in them generally. It's obvious that getting along with a group of politicians (Democrats) who have no honor and integrity is impossible, and the Conservatives don't have the spine to tell the Democrats to stick it!! LOL", 
   {}, 
   41536, 
   null, 
   1080621660.0
  ], 
  [
   41582, 
   null, 
   "Toukalos", 
   "LMAO, you're kidding, right? I was obviously being sarcastic. I HAVE received these messages and saw some in other threads. I am able to handle name calling just fine, it's the Liberals (oooops) that seem to have a tough time with it. \n \n And regarding Conservatives in power? I couldn't be more disappointed in them generally. It's obvious that getting along with a group of politicians (Democrats) who have no honor and integrity is impossible, and the Conservatives don't have the spine to tell the Democrats to stick it!! LOL\n\n \n heh. that post definately did not come across as sarcastic, but if you say so........of course the Democrats are getting along with the Republicans, they are equally corrupt (the vast majority; Paul Wellstone was not too bad, mores the pity he died)", 
   {}, 
   41580, 
   null, 
   1080622800.0
  ], 
  [
   41594, 
   null, 
   "hvozdany", 
   "I did not mean to imply that I think they are the same...but essentially similar. The tendency to favor welfare programs and governmental giveaways leads me to say that. While I do not think the liberals want to abolish private ownership of property (after all, there are a lot of rich property owning liberals), I do see a tendency toward having the productive population provide support to those who choose not to work.\n \n ...and I am not feigning ignorance of socialist countries. I just need a list of supposedly successful socialist governments.\n\n \n \n I think I understand what you are saying, but just to clarify, what is it that you are against, a progressive tax system or a government that has social welfare programs?", 
   {}, 
   41196, 
   null, 
   1080631740.0
  ], 
  [
   41606, 
   null, 
   "Phunting", 
   "Okay, forced was a strong word. If you go to Miami, however, you know what I mean. Americans should not have to feel like aliens in their own country.\n\n You forget that the US was not exclusively colonised by the English. Florida was originally a Spanish colony. Im sure those colonists were equally happy about immigrants entering their territory and making them feel like aliens in their own land.\n \n \n \nI recongnize differences in people and see the reality that we are not all going to get along in complete peace. It's a lofty goal, but one that cannot be achieved.\n\n There is a difference to disagreeing with someone with different views as your own and seeing them as an enemy. I disagree with your views, but I don't see you as my enemy.\n \n \n \nWell, I hope that you have the same annoyance at those who will stereotype Conservatives.\n\n Of course I would, however I really must admit I haven't seen it. Not once have I seen 'Conservative' used in a derogatory way, I have seen 'you liberals' used more times than I can count.\n \n No doubt you will claim I'm biased, but really I am not. In fact I do consider myself a Conservative. It's not name calling as such, it's the dissmissal of personal views by 'well you're a Liberal, so you would believe that' instead of actually looking at why they believe as they do.", 
   {}, 
   41486, 
   null, 
   1080647280.0
  ], 
  [
   41613, 
   null, 
   "admin", 
   " I am able to handle name calling just fine, it's the Liberals (oooops) that seem to have a tough time with it. \n \n\n \n I have a problem with people calling names or labeling other users. I asked you to stop doing that. \n \n \"it's the Liberals (oooops) that seem to have a tough time with it\" \n \n Some liberals may have a problem with it, but not all, the person asking you to stop is me.", 
   {
    "post_info": {
     "post_title": "oooops"
    }
   }, 
   41580, 
   null, 
   1080656340.0
  ], 
  [
   41761, 
   null, 
   "Robbie", 
   "It all depends on how you view \"socialistic\" (and to a lesser extent, also success). If you are refering to the strict marxist definition of socialistic countries, I guess that would only leave former Soviet union, the east european countries, Kuba and China as any larger examples. And they where not terrible sucssfull (allthough they haven`t done that bad, ecp. not China. If you are refering to the more common usage of the word, as in liberal socialism. Countries with high taxes, extensive wellfare and more or less socialistic governments. I can provide a small, albeit strong list of (highly?) succesful countries: \n \n Norway\n GNP/capita: ca 30,000 dollars (2000)\n Unemployment: 3,4% (2000)\n HDI placement*: 1 (0,944) (2003)\n \n Iceland\n GNP/Capita: Ca 29,000 dollars (2000)\n Unemployment: 1,4% (2000)\n HDI placement: 2 (0,942) (2003)\n \n Source: http://www.leksikon.org/art.php?n=3089 (norweigan) and http://www.europaportalen.nu/statistik/fn-hdi.html\n \n Sweden\n GNP/capita: ca 27,000 dollars (2004)\n Unemployment: 5-6% (2003)\n HDI placement: 3 (0,941) (2003)\n \n Source: http://www.europaportalen.nu/statistik/fn-hdi.html and http://www.europaportalen.nu/statistik/aloshet.html (Arbetslöshet=Unemployment)\n \n Comparisson: USA\n GNP/capita: ca 34,000 dollars (2000)\n Unemployment: 6-6,5% (2003)\n HDI placement: 6 (0,937) (2003)\n \n Source http://www.leksikon.org/art.php?n=3073&t=257 and http://www.europaportalen.nu/statistik/fn-hdi.html and http://www.europaportalen.nu/statistik/aloshet.html\n \n * HDI= Human Development Index. An index to meassure the wellfare of one country based on GNP/capita, educational level, life expectancy, litteracy etc etc.\n\n \n According to this socialist website, there are no socialist countries, not even communist ones count. \n \n http://www.socialistparty.org.uk/News2Frame.htm?socialistcountries.htm\n \n They define socialism basically as a planned economy \"democratically controlled by the workers\". No private property, or at least no private industry. I think this is an interesting topic. I've heard that Sweden was \"socialist\" previous to 1991, with a 72% tax rate, 1/3 of the population working for the gov't, 1/3 working out of government, and 1/3 living on welfare or other programs - but were taken out of office. \n \n Perhaps a better name for countries with high taxes and large welfare programs would be better called a \"Welfare State\". Do you think Canada would count? I beleive we have about a 50% top tax rate. (highest provincial + federal)", 
   {}, 
   41365, 
   null, 
   1080703080.0
  ], 
  [
   41790, 
   null, 
   "Eddie", 
   "According to this socialist website, there are no socialist countries, not even communist ones count. \n \n http://www.socialistparty.org.uk/News2Frame.htm?socialistcountries.htm\n \n They define socialism basically as a planned economy \"democratically controlled by the workers\". No private property, or at least no private industry. I think this is an interesting topic. \n\n \n Well, aparantly they go by the strict marxist definition, which makes it kind of hard to try to show examples off (as you pointed out, there have been no truly socialistic countries by that definition). But I would argue that just as some countries are called capitalistic when there is no true capitalistic system, or no perfectly free market, a country can be termed socialistic even with market sollutions and a capitalistic economic framework. \n \n \n I've heard that Sweden was \"socialist\" previous to 1991, with a 72% tax rate, 1/3 of the population working for the gov't, 1/3 working out of government, and 1/3 living on welfare or other programs - but were taken out of office. \n \n\n \n Nah, that is not true. Allthough there is some truth to it. Before the late eightees, Sweden was among the richest countries in the world. During the eightiees the Swedish social-democratic government made use of very employment oriented politics, and tried to \"trade\" low unemployment for high inflation (which in the long run has turned out to be impossible). The result was eventually disastrous and Swedish economy took a nosedive. In 1991 election the Liberal/conservative alliance won their first victory in a decade (and so took out the social democrats) and tried to deal with the crisis. It didn`t go so well, capital flight was a fact as the market didn`t trust the liberal/conservatives pledge to not devalue the Krona (swedish currency)and interest rates where raised to keep the value of the Krona, resulting in 500% short term interest rate for a weekend, at least three crise packages where outlined and agreed on by the liberal/conservative alliance and social democrats. But it was all for nothing. The swedish krona was cut loose and plummeted, resulting in a much reduced purchase power of the swedish public. This all led to a serious recession and a huge governmental debt. To combat the structural causes for the recession and to get rid of the debt, the liberal/conservative alliance did little to nothing. In the following election (1994) the social democrats (together with the communists and green party) won a majority in the parliament and started to cut down on governmental expenditures and governmental and communal employments without cutting taxes. I would think that the taxed percentage of the GDP is roughly around 50% (and have been so since the 70:ies). And the public sector has been shrunk, but are still the largest single employer by far. As for 1/3 being on wellfare programmes... Well, if you count elderly (with pension), students and terminally/temporally ill as being on wellfare programs, then sure. But I don`t think that is very different from any other country.\n \n Phew, sorry for the hisory lesson ;)\n \n \nPerhaps a better name for countries with high taxes and large welfare programs would be better called a \"Welfare State\". Do you think Canada would count? I beleive we have about a 50% top tax rate. (highest provincial + federal)\n\n \n Yeah, that is a good term. And I definatly would agree that Canada could be called a wellfare state (and highly succesfull as well) but it says little of the political and ideological base of the dominating parties. What makes most scandinavian wellfare state different from the german wellfare state is its socialistic base, Germany has a largely conservative base. And while it may not seem to matter while merely looking at figures, it has a large impact on how the wellfare state works.", 
   {}, 
   41761, 
   null, 
   1080726420.0
  ], 
  [
   42001, 
   null, 
   "Robbie", 
   "Well, aparantly they go by the strict marxist definition, which makes it kind of hard to try to show examples off (as you pointed out, there have been no truly socialistic countries by that definition). But I would argue that just as some countries are called capitalistic when there is no true capitalistic system, or no perfectly free market, a country can be termed socialistic even with market sollutions and a capitalistic economic framework. \n\n \n True. The ultimate goal of socialism apparently is to eliminate the difference between the lowest and highest employee in a company. They beleive that this way resources will be used for the good of the 'working' people rather than the interests of the greedy capitalists seeking maximum benefit to themselves. They also make a distinction between Government controlling the means of production and the People. I find that interesting since the average Leftist (which I generally equate with Socialist) seems to have little faith in the ability of Average Joe to live his life without help from them. \n \n It seems that the \"Welfare State\" (that's from \"The War Against the Family\" by William Gairdner) tends to have more government control of the means of production. Actually the control of these means by the People is quite radical (as you said, there's no example today) while the control by the Government is pretty commonplace. In my province the Gov't controls the Energy, Health, Telephone, and probably some other industries. (other telephone companies are allowed to compete, but I beleive private hospitals are illegal)\n \n I think we could call that \"totaltarian Socialism\", or \"concentrated Socialism\", or \"we know whats best\" Socialism... just joking. \n \"Welfare State\" works. The real socialism could be called \"Democratic Socialism\" or \"Grassroots Socialism\". \n \n Then again, its hard to know just what Marx meant when he said \"socialization of the means of production\". Ludwig von Mises, in \"Socialism\", says that Marx used the term social or community interchangably throughout his arguements (von Mises claims that this is what allowed him to \"prove the unprovable\") as meaning the State, the People, or simply a club of sorts. He could have meant the State should control industry, even if his ultimate vision was for the State to \"dissolve\".\n \n \n Nah, that is not true. Allthough there is some truth to it. Before the late eightees, Sweden was among the richest countries in the world. During the eightiees the Swedish social-democratic government made use of very employment oriented politics, and tried to \"trade\" low unemployment for high inflation (which in the long run has turned out to be impossible). The result was eventually disastrous and Swedish economy took a nosedive. In 1991 election the Liberal/conservative alliance won their first victory in a decade (and so took out the social democrats) and tried to deal with the crisis. It didn`t go so well, capital flight was a fact as the market didn`t trust the liberal/conservatives pledge to not devalue the Krona (swedish currency)and interest rates where raised to keep the value of the Krona, resulting in 500% short term interest rate for a weekend, at least three crise packages where outlined and agreed on by the liberal/conservative alliance and social democrats. But it was all for nothing. The swedish krona was cut loose and plummeted, resulting in a much reduced purchase power of the swedish public. This all led to a serious recession and a huge governmental debt. To combat the structural causes for the recession and to get rid of the debt, the liberal/conservative alliance did little to nothing. In the following election (1994) the social democrats (together with the communists and green party) won a majority in the parliament and started to cut down on governmental expenditures and governmental and communal employments without cutting taxes. I would think that the taxed percentage of the GDP is roughly around 50% (and have been so since the 70:ies). And the public sector has been shrunk, but are still the largest single employer by far. As for 1/3 being on wellfare programmes... Well, if you count elderly (with pension), students and terminally/temporally ill as being on wellfare programs, then sure. But I don`t think that is very different from any other country.\n \n Phew, sorry for the hisory lesson ;) \n\n \n Its an excellent history lesson! Interesting how the Liberal/Conservatives didn't work on the decifit at all. What I'm most curious about is the attempted trade between low employment and inflation. How is that done, what kind of programs were put in place? Gairdner talked about the Swedish government in \"The War Against the Family\" quite a bit. His main observation is that the more power you give to the government, the weaker \"bottom up\" organizations become... such as the nuclear and general family and local groups. People become dependent on the Gov't rather than themselves and the people around them. He said that family bonds had become quite weak in Sweden... partially on purpose and partially because the \"top down\" government weakens other power structures purposely or not. For instance, apartments were made small on purpose in some cases so that there wouldn't be enough room for a family to house their grandparents.\n \n I think that Sweden's numbers supported by the State must have been, and still are amoung the highest, since their tax as % of GDP is substantially higher than other countries. For instance, Canada's tax is about 35% of GDP and the US is about 30%. The money's got to go somewhere.\n \n Just learned a bit about Switzerland's political stucture lately... it's really interesting. They have a lot of direct democracy, and the local governments have a lot of freedom. Gairdner noted that they can call a referendum if the Gov't fails to meet the budget two years in a row. Apparently they have the highest per capita income in the world. No doubt that is because of their extremely stable currency, backed by gold, and their neutrality over the years. Then again, they're neutral because the people want it that way.", 
   {}, 
   41790, 
   null, 
   1080865140.0
  ], 
  [
   42830, 
   null, 
   "Eddie", 
   "Sorry for the late reply. I was away during the weekend and there was quite much to reply to :)\n \n \nTrue. The ultimate goal of socialism apparently is to eliminate the difference between the lowest and highest employee in a company. They beleive that this way resources will be used for the good of the 'working' people rather than the interests of the greedy capitalists seeking maximum benefit to themselves. \n\n \n There is some truth to this, allthough I would like to point out that socialism is in essence about owning the means of the productions. But as governmental ownersip is a bit problematic in some cases (not really economicly sound), correcting the flaws in the distribution of resoursec in a capitailistic economy might be the \"second best alternative\"\n \n \n They also make a distinction between Government controlling the means of production and the People. I find that interesting since the average Leftist (which I generally equate with Socialist) seems to have little faith in the ability of Average Joe to live his life without help from them.\n\n \n The disticntion they make is in line with traditional marxist thought of the state as an oppressive (abeit less oppressive than the capitalistic system) force (or class if you will). What puzzles me is that they seem to believe that the transistion from the capitalistic system to the utopian communistic can be achieved at once (not that they use that many words...) This is not something I would attibute to traditional socialists or communists... rather anarcho.socialists (your average left-wing anarchists).\n \n As for the little faith in Average Joe\n I think this has two dimension. First, we have the paternalistic idea of economics. That is, the idea that the government should encourage or discourage consumption or production of certain goods. Ths is basicly a sound strategy that is being used by any kind of government (most commonly used to encourage education and reasearch or used to discourage drugs or enviromentally harmful products). But it is quite possible that left winged government are more inclined to use these strategies (perhaps because they are most often financed through taxes)\n Secondly we have the idea of structuralism where individuals actions are not so much a product of their conciuos choice, but rather a product of structures, institutions, norms and other forms of social constructs. The most important structre according to traditional marxism is the economic system (today; capitalism). \n \n \n It seems that the \"Welfare State\" (that's from \"The War Against the Family\" by William Gairdner) tends to have more government control of the means of production. Actually the control of these means by the People is quite radical (as you said, there's no example today) while the control by the Government is pretty commonplace. In my province the Gov't controls the Energy, Health, Telephone, and probably some other industries. (other telephone companies are allowed to compete, but I beleive private hospitals are illegal)\n \n\n \n Yeah, the government is very important from a socialistic perspective. Its about political (democratic) control of the economy. Allthough I would like to point out that there is a form of capital that the government tries to increase with the sole intent of putting it in the hands of the people. Education.\n \n \n \n Then again, its hard to know just what Marx meant when he said \"socialization of the means of production\". Ludwig von Mises, in \"Socialism\", says that Marx used the term social or community interchangably throughout his arguements (von Mises claims that this is what allowed him to \"prove the unprovable\") as meaning the State, the People, or simply a club of sorts. He could have meant the State should control industry, even if his ultimate vision was for the State to \"dissolve\".\n \n\n \n That is a good point. I would argue that Marx:s idea of socialisation of the means of production should be seen as an ideal of a classless society. When the classes has been disolved through elimination of the ruling class, there will be no conflict of interests. The means of production will be used to further the interests of the populace (or the single class). How this should be organised could of course be argued. But I would say that the most probable solution would be through governmental ownership of the means of production due to the nature of state monopoly on violence.\n \n \n \n Interesting how the Liberal/Conservatives didn't work on the decifit at all.\n\n \n That`s probably some bias from my part ;). I`m sure they tried to do some, but I think they where quite paralyzed after the whole fiasko with maintaining the monetary system. In their defense I must also admit that their government relied on the support from a particulary untrustworthy and frankly worthless political party which was eliminated after the next election.\n \n \n \n\n Its an excellent history lesson!\n\n \n Thank you :)\n \n \n Interesting how the Liberal/Conservatives didn't work on the decifit at all.\n\n \n That`s probably some bias from my part ;). I`m sure they tried to do some, but I think they where quite paralyzed after the whole fiasko with maintaining the monetary system. In their defense I must also admit that their government relied on the support from a particulary untrustworthy and frankly worthless political party which was eliminated after the next election.\n \n \n. What I'm most curious about is the attempted trade between low employment and inflation. How is that done, what kind of programs were put in place?\n\n \n It was done through highly expansive financial politic through an high governmental expenditure and devaluation of the Krona during the oil crisis. While other countries suffered high unemployment, Sweden had low unemployment but increasing inflation.\n \n There is a short term relationship between unemployment and inflation. Really how this relationship works has yet to be proved, but it has been empiricly observed. This relationship is referred to as the phillips curve. But there has been empiricly proved that there is no relationship between inflation and unemployment in long term. Apparantly the trade of is succesful in short term as the emploers and employees are slow to predict the inflation. But in long term, they do predict the inflation and act accordingly. IE; if the inflation is 5%, the employees, or rather their unions will in the long run demand a wage increase that reflects the inflation. \n \n This was what happened in sweden. The employers and the unions predicted high inflation and future devalueations and this led to the eventual downfall of the Krona as well as high unemployment. \n \n \n Gairdner talked about the Swedish government in \"The War Against the Family\" quite a bit. His main observation is that the more power you give to the government, the weaker \"bottom up\" organizations become... such as the nuclear and general family and local groups. People become dependent on the Gov't rather than themselves and the people around them. He said that family bonds had become quite weak in Sweden... partially on purpose and partially because the \"top down\" government weakens other power structures purposely or not. For instance, apartments were made small on purpose in some cases so that there wouldn't be enough room for a family to house their grandparents.\n \n\n \n That`s an interesting take. I would argue that the most important aspect of govermnenal action concerning the \"weakening of the family bonds\" is the large public sector. This public sector has been dominated by women and has proved to be of great importance for the emancipation of the women (as it early offered women a way to get away from their economic dependance of their spouses). Perhaps there is some truth to the top-down argument as well, but to be honest, I don`t think the family ties in Sweden are any less strong than any other northern european or anglo-saxon culture with high living standards.\n \n As for building small apartments. I think it was more an issue of creating cheap apartments. We had a large housing problem that was solved by large social programs where the government created housing 1 million (which named it the \"millionprograme\"). But there may be some truth to the idea of specialising the workforce by re-locating the \"old folks\" ;)\n \n \n I think that Sweden's numbers supported by the State must have been, and still are amoung the highest, since their tax as % of GDP is substantially higher than other countries. For instance, Canada's tax is about 35% of GDP and the US is about 30%. The money's got to go somewhere. \n\n \n I think the big diffenece lie in how you use the taxes. The Swedish wellfare state is inclusive in the sence that all services and most monetary support is not based on income. For example in Sweden everyobody get child support from the state (assuming they have children) regardless of income and no-one has to pay for education (its in fact not permitted to attach a fee to schools apart from highly specialised educations on collage level). \n \n \n Just learned a bit about Switzerland's political stucture lately... it's really interesting. They have a lot of direct democracy, and the local governments have a lot of freedom. Gairdner noted that they can call a referendum if the Gov't fails to meet the budget two years in a row. Apparently they have the highest per capita income in the world. No doubt that is because of their extremely stable currency, backed by gold, and their neutrality over the years. Then again, they're neutral because the people want it that way. \n\n \n Yeah, Switzerland is a bit of an oddity when it comes to their democratic system. They have a representative system as well, and their government consists of all parties (instead of those parties who co-operate to achieve a majority in the parliament). I think it has to do with the heterogenous population (they have three or two different languages and three or two different cultures)", 
   {
    "unicode_changes_made": true
   }, 
   42001, 
   null, 
   1081363440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Great Liberal Death Wish", 
  "url": "http://www.4forums.com/political/current-events-debates/1972-great-liberal-death-wish.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 1972, 
  "discussion_files": [
   [
    "12522.html", 
    "http://www.4forums.com/political/current-events-debates/1972-great-liberal-death-wish-print.html"
   ], 
   [
    "12523.html", 
    "http://www.4forums.com/political/current-events-debates/1972-great-liberal-death-wish-6-print.html"
   ], 
   [
    "12524.html", 
    "http://www.4forums.com/political/current-events-debates/1972-great-liberal-death-wish-4-print.html"
   ], 
   [
    "12525.html", 
    "http://www.4forums.com/political/current-events-debates/1972-great-liberal-death-wish-5-print.html"
   ], 
   [
    "12526.html", 
    "http://www.4forums.com/political/current-events-debates/1972-great-liberal-death-wish-3-print.html"
   ], 
   [
    "12527.html", 
    "http://www.4forums.com/political/current-events-debates/1972-great-liberal-death-wish-2-print.html"
   ]
  ], 
  "identifier": 1972
 }
]