[
 [
  [
   40216, 
   null, 
   "Dmann", 
   "Bush Administration Thwarts Access\n Excerpt from The Buying of the President 2004 Shows the White House's Propensity for Secrecy\n \n If history is any guide, George W. Bush will not seek to undo the regulations that help shroud so many financial transactions from view. After all, his presidency has been characterized by a zeal for secrecy, an unrelenting push to stem the free flow of information. \n \n One particularly notable example has been the Administration's effort to undermine the Freedom of Information Act, the 1966 law that grants citizens access-although with some exceptions-to federal agency records. By statute, government FOIA officers may withhold records dealing with classified national security information, trade secrets, personnel or medical issues, and a handful of other matters-decisions that in each case are left to an official's own discretion (although those denied the requested information may appeal). In October 1993, to better standardize the process and create more openness in government, Attorney General Janet Reno dispatched a memorandum revamping the way the Act would be administered; from now on, the memo directed, FOIA officers should \"apply a presumption of disclosure.\" To drive home the point, Reno decreed that, in the event of FOIA-related litigation, the Justice Department would no longer defend an agency's withholding of information merely because there was a \"substantial legal basis\" for doing so. \"Where an item of information might technically or arguably fall within an exemption,\" she added, \"it ought not to be withheld from a FOIA requester unless it need be.\" \n \n But eight years later, in the aftermath of the September 11th terrorist attacks, Reno's successor renounced that presumption of disclosure. In a memo to the heads of federal departments and agencies, Attorney General John Ashcroft decreed that a well-informed citizenry may be vital to government oversight, but not at the expense of undermining national security. \"Any discretionary decision by your agency to disclose information protected under the FOIA should be made only after full and deliberate consideration of the institutional, commercial, and personal privacy interests that could be implicated by disclosure of the information,\" he wrote. And unlike Reno, whose policies engendered more government in the sunshine, Ashcroft promised legal cover for agencies coming down on the side of non-disclosure. \"When you carefully consider FOIA requests and decide to withhold records, in whole or in part, you can be assured that the Department of Justice will defend your decisions unless they lack a sound legal basis or present an unwarranted risk of adverse impact on the ability of other agencies to protect other important records,\" his memo added. In other words, Justice would bow out of litigation only if its participation might subsequently imperil the government's ability to withhold other information. \n \n \n \n While 9/11 was the presumed catalyst for the revamped FOIA guidelines, the policy change was actually in keeping with Bush's historical aversion to the release of government papers. In 1997, for example, Bush successfully championed legislation that allowed the governor of Texas to designate an in-state university or alternate institution, in lieu of the Texas State Library and Archives, as the repository for his or her papers. And he later exploited the law by ordering that his own gubernatorial papers be deposited in the George Bush Presidential Library and Museum, at Texas A & M University, which is home to his father's executive records. \n \n At the time, the shipment of Bush's documents received scant attention. But the relocation effort later generated consternation among reporters, historians, researchers, and others seeking access to the eighteen hundred boxes of not-yet-cataloged papers. The reason: because records at the presidential library are under the jurisdiction of the National Archives and Records Administration, which is a federal agency, there was confusion whether release of the younger Bush's papers was bound by the federal Freedom of Information Act or the Texas Public Information Act, which mandates a much speedier response time for requested records. \n \n Bush's attorney denied that the move reflected a desire to restrict public access to the papers. And in an interview with the Center, Chris LaPlante, the state archivist, also dismissed the conspiratorial claims of open-government activists: he and his colleagues, he said, knew that the governor's papers were destined for an alternate repository, and they assumed that the Bush library staff were equipped to deal with the documents. But Bush's action nonetheless imposed weeks-long, even months-long delays on the release of documents. And it left consumer advocacy organizations such as Public Citizen grumbling that the departed Texas governor lacked the legal authority to give away state records or place them beyond the reach of the state's open-records law. In May 2002, following protracted legal wrangling, Texas Attorney General John Cornyn agreed. He ruled that the disputed papers were indeed state property, and therefore subject to the Texas open-records law. \n \n But while Texans earned easier access to some historical records, the public at large was being saddled with a variety of new impediments to an open federal government. To wit: \n \n \n \n \n On November 1, 2001, President Bush signed Executive Order 13233, not-so-aptly titled \"Further Implementation of the Presidential Records Act.\" In truth, the executive order actually overrides the 1978 Presidential Records Act, the Watergate-inspired edict which stipulated that the papers of presidents and vice-presidents would be made available to the public twelve years after their leaving office. Under Bush's plan, however, former presidents or their heirs may veto the release of their presidential papers, as may the sitting president-a decision that vested George W. Bush with the authority to block release of his father's papers, for example, or even those of Bill Clinton. Bush's order drew fervent bipartisan condemnation on Capitol Hill (although not enough to force reinstatement of the '78 Act), and it particularly rankled librarians and historians. The comments of Steven Hensen, president of the Society of American Archivists, were typical. Writing in the Washington Post, he asked: \"How can a democratic people have confidence in elected officials who hide the records of their actions from public view?\" \n Following the September 11th terrorist attacks, the Bush Administration encouraged federal agencies to purge a wide array of potentially sensitive data from their Web sites-a decree that, for a time, removed the entire online presence of the Nuclear Regulatory Commission, and which ultimately resulted in hundreds of thousands of pages being deleted from sites maintained by the Department of Energy, the Environmental Protection Agency, the National Archives and Records Administration, and other federal entities. \"It is no longer possible for families and communities to get data critical to protecting themselves-information such as pipeline maps (that show where they are and whether they have been inspected), airport safety data, environmental data, and even documents that are widely available on private sites today were removed from government sites and have not reappeared,\" OMB Watch, which for two decades has been chronicling the activities of the Office of Management and Budget, noted in a paper released in October 2002. \n On March 25, 2003, President Bush signed an order that postponed, by three years, the release of millions of twenty-five-year-old documents slated for automatic declassification the following month. What's more, Executive Order 13292, which amended a Clinton Administration order, granted FOIA officers wider latitude to reclassify information that had already been declassified, and further eliminated a provision that instructed them not to classify information if there was \"significant doubt\" about the need to do so. While President Bush maintained that the order balanced national security with open government, some were not convinced. For example, the Washington Post quoted Thomas Blanton, executive director of the nonprofit National Security Archive, as saying that the order sends \"one more signal from on high to the bureaucracy to slow down, stall, withhold, stonewall.\" \n When the Reporters Committee for Freedom of the Press surveyed the post-September 11th landscape, the First Amendment watchdog concluded that the government had embarked on \"an unprecedented path of secrecy\" that stifled the press' and the public's right to know. Among the reporters ensnared by the government's flight from the traditional culture of openness is John Solomon, deputy bureau chief of the Associated Press. Solomon, who works out of the Washington, D.C. bureau, was twice victimized. In one incident, a package sent by Federal Express to Solomon from another AP bureau was intercepted by the U.S. Customs Service and forwarded to the FBI, where its contents-an eight-year-old, unclassified Bureau lab report previously made public in a court case-were seized and withheld for seven months. In a previous incident, the Justice Department subpoenaed Solomon's home phone records in an attempt to unearth his confidential source for a wire service story. Solomon, who only learned about the subpoena months later, told the Center it's his understanding that the traditional practice of subpoenaing reporters as an absolute last resort in a \"leaks\" investigation is no longer the department's modus operandi. \"I'm not quite sure it's gotten the public attention it deserves,\" Solomon told the Center. \"I don't think the profession has realized the importance of the change of standards that has occurred as a result of my case.\" \n \n These incidents were part of a much larger pattern. For example, in November 2001, President Bush signed an order decreeing that suspected terrorists may be tried in military tribunals instead of regular courts-a policy that kept secret the identities of more than seven hundred detainees. (In June 2003, a federal appeals court sided with the Justice Department and ruled that the government did not have to disclose the names of the detainees.) One month later, Bush invoked executive privilege to block a congressional subpoena related to the FBI's use of informants in Boston-area criminal investigations-an action that so enraged Republican Representative Dan Burton, chairman of the House Committee on Government Reform, that he labeled Bush a \"dictatorial president\" at a congressional hearing exploring the matter. In March 2002, White House Chief of Staff Andrew Card, Jr. instructed government agencies to safeguard \"sensitive but unclassified information,\" an overly vague directive that led to untold thousands of documents being pulled from government Web sites and library shelves. In September 2002, a General Accounting Office report revealed that backlogs of pending FOIA requests were rising at many executive branch agencies, despite the fact that FOIA requests were decreasing. When Vice President Dick Cheney repeatedly refused to provide the General Accounting Office with records related to his national energy task force, including the names of lobbyists and corporate executives with whom he met, the GAO took the unprecedented step of filing suit to get the records. \n \n And there was the Uniting and Strengthening America by Providing Appropriate Tools Required to Intercept and Obstruct Terrorism Act of 2001, better known by its acronym: USA PATRIOT. First introduced in the House on October 2, 2001, and signed into law just three-and-a-half weeks later, the measure decreased the ability of American citizens to obtain information about their government and, at the same time, gave the government the means to pry into the personal lives of those same citizens. \n \n In essence, the Patriot Act authorized a host of new law-enforcement and intelligence-gathering provisions sought by Attorney General John Ashcroft and the Bush Administration. For example, the Act includes changes to the laws regulating surveillance, making it easier for the government to surreptitiously gather information about individuals. It permits greater use of \"roving\" wiretaps, making it possible to intercept all of a person's phone conversations (no matter what equipment they use) or Internet communications (although not necessarily the actual content of e-mail messages). It allows for \"sneak and peek\" searches of homes without notifying residents until well after the fact. And it makes it easier for federal investigators to obtain court orders for domestic surveillance. \n \n On the day Bush signed the Act into law, Ashcroft praised its terrorism-fighting capabilities and, in a nod to the unfolding controversy, tried to soothe a skittish public. \"The American people,\" he said, \"can be assured law enforcement will use these new tools to protect our nation while upholding the sacred liberties expressed in the Constitution.\" Such promises hardly pacified civil libertarians, however, who charged that the law-rammed through Congress with scant debate-too greatly expanded the government's authority to spy on Americans and codified end-runs on traditional checks and balances. A year and a half later, those detractors were stunned to learn of a proposed sequel. \n \n The details were first revealed in February 2003, when the Center for Public Integrity published a leaked Department of Justice draft of legislation designed to strengthen and extend provisions of the Patriot Act. The \"Domestic Security Enhancement Act of 2003,\" dated January 9, 2003, included provisions that would further inflate government powers of surveillance and punishment, while at the same time decrease judicial review and public access to official information. \n \n Rumors of the proposed act, known informally on Capitol Hill as Patriot Act II, had swirled for months, but the advanced state of the January 9 draft took many by surprise. \"We haven't heard anything from the Justice Department on updating the Patriot Act,\" Jeff Lungren, spokesman for the House Judiciary Committee, told the Center. Senior members of the Senate Judiciary Committee minority staff inquired repeatedly about updates to the law, but were rebuffed at every turn. In fact, in the very week the Center posted the confidential draft on its Web site, these Democratic staffers were still being assured that no such legislation was in the works. \n \n Like its predecessor, Patriot II proposed some dramatic and sweeping changes to the law. For example, the government would be able to sentence people to death for various terrorist actions not currently covered by the death penalty and strip citizenship from Americans who provided material support to groups designated as \"terrorist\" organizations, even if those individuals didn't break the law or consider that group to be terrorist. \n \n What's more, the draft legislation would further impinge on privacy rights, giving federal investigators the ability to secretly request credit reports, authorize surveillance under certain circumstances without court approval, and sanction the creation of a DNA database for suspected terrorists-a long leap from current law, which permits the FBI to create such databases only from those actually convicted of certain crimes. The draft also sought to decrease public access to government information. Most notably, it proposed to modify the Freedom of Information Act to specifically bar the release of information about those detained on suspicion of terrorism-an end run to a lawsuit that sought information about those detained in the months following the September 11 attacks. But the legislative flimflam proved unnecessary, as a federal appeals court struck down the lawsuit in June 2003. \n \n On the heels of the Center's disclosure, Barbara Comstock, Director of Public Affairs at the Department of Justice, issued a statement insisting that no conclusions should be drawn from what was, after all, one of many \"discussions drafts.\" \"Department staff have not presented any final proposals to either the Attorney General or the White House,\" her statement said. \"It would be premature to speculate on any future decisions, particularly ideas or proposals that are still being discussed at staff levels.\" \n \n But in the months that followed, Attorney General John Ashcroft left no doubt about his wishes for Patriot Act revisions. For example, on June 5, 2003, in testimony before the House Committee on the Judiciary, Ashcroft maintained that it would be difficult, if not impossible, to prevent another catastrophic attack on American soil without the Patriot Act. \"Unfortunately,\" he added, \"the law has several weaknesses which terrorists could exploit, undermining our defenses.\" And with that, Ashcroft ticked off a series of weaknesses in the law that, coincidentally, were remedied in the confidential draft made public by the Center. \n \n As for George W. Bush, he stayed silent on the need for the Patriot Act upgrade. But four days after Ashcroft's remarks, presidential Press Secretary Ari Fleischer left open the possibility that Bush might one day press Ashcroft's case. Fleischer, who just weeks earlier had announced that he would soon resign his post, labeled the war on terrorism an ongoing issue that demanded continual review. \"And this is something that I think will be with us for quite some time,\" he told reporters. \"And this will also be, of course, done with an eye toward maintaining civil liberties and Constitutional protections.\"\n \n Home | International | National | State | About Us \n \n © 2004, The Center for Public Integrity. All rights reserved. \n IMPORTANT: Read our privacy policy and the terms under which this service is provided to you.", 
   {
    "post_info": {
     "post_title": "Bush Administration Thwarts Access"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1079792880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush Administration Thwarts Access", 
  "url": "http://www.4forums.com/political/politics-debates/1974-bush-administration-thwarts-access.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 1974, 
  "discussion_files": [
   [
    "20542.html", 
    "http://www.4forums.com/political/politics-debates/1974-bush-administration-thwarts-access-print.html"
   ]
  ], 
  "identifier": 1974
 }
]