[
 [
  [
   40296, 
   null, 
   "Robbie", 
   "Two recent judical rulings, in my opinion, clearly inhibit and threaten the free exercise of religion in the US:\n \n -the ruling against Judge Roy Moore and\n -the ruling forcing a Catholic charity to pay for contraceptives for employees\n (more on Catholic ruling here: http://www.mercurynews.com/mld/mercurynews/news/8084150.htm )\n \n For instance, in the case against Moore, the prosecuting Judge asked him if he would continue to acknowledge God if he continued in office. It wasn't about establishing a religion. \n \n As for the Catholic ruling, it seems self-evident to me that a law was made concerning an establishment of religion.\n \n Do you think that these laws are constutitional and why?", 
   {
    "post_info": {
     "post_title": "Free Excercise of Religion?"
    }
   }, 
   null, 
   null, 
   1079833920.0
  ], 
  [
   41073, 
   null, 
   "Tastyfish", 
   "Religions have to obey laws, I am all for not making things to deliberately target religions, but I think they should receive no special treatment regardless of whether their beliefs go against the law, or at least they need to get members to sign something saying that they will make a choice on some issues inline with the faith that they supposedly belong to.\n \n Don't mind making them ask people to make a choice to begin with, but they should always be allowed to make the choice.", 
   {}, 
   40296, 
   null, 
   1080269520.0
  ], 
  [
   41078, 
   null, 
   "Robbie", 
   "That's a good point, I think. For example, I do support the law against polygamy, although some Mormons say that it is part of their religion. Apparently, there was a certain amount of deliberation about it. The conclusion that I've read was that it was decided that the government could legislate against actions. Thus, polygamy is not allowed, regardless of what your religion says about it. \n \n Then again, this is not the same case - since the contraceptive law is telling the charity to do something... while the polygamy law is telling individuals not to do something. Its really not like it at all, come to think of it.\n \n The way I heard it (on WorldNetDaily), the court ruled that the Catholic charity was in fact not a religious organization... because they help everyone regardless of beleif! So, it would seem that the court realized they were either making an unconstutional ruling or the Catholic charity wasn't Catholic.", 
   {}, 
   41073, 
   null, 
   1080270780.0
  ], 
  [
   41176, 
   null, 
   "Toukalos", 
   "That's a good point, I think. For example, I do support the law against polygamy, although some Mormons say that it is part of their religion. Apparently, there was a certain amount of deliberation about it. The conclusion that I've read was that it was decided that the government could legislate against actions. Thus, polygamy is not allowed, regardless of what your religion says about it. \n \n Then again, this is not the same case - since the contraceptive law is telling the charity to do something... while the polygamy law is telling individuals not to do something. Its really not like it at all, come to think of it.\n \n The way I heard it (on WorldNetDaily), the court ruled that the Catholic charity was in fact not a religious organization... because they help everyone regardless of beleif! So, it would seem that the court realized they were either making an unconstutional ruling or the Catholic charity wasn't Catholic.\n\n \n Keep religious symbols out of public spaces in government buildings. Simple as that.", 
   {}, 
   41078, 
   null, 
   1080329280.0
  ], 
  [
   41183, 
   null, 
   "jim's trucking", 
   "Keep religious symbols out of public spaces in government buildings. Simple as that.\n\n \n Then would you be in favor of removing \"In God We Trust\" from all our currency?\n \n ...should a Christian be prohibited from wearing a crucifix in a public (government) school?\n \n ...would you be in favor of no longer asking a witness to place one hand on a bible for the swearing in?\n \n ...should we remove \"So help me God\" from all oathes?\n \n ...do you think our founding fathers actually meant for God and the mention thereof to be absent from all governmental operations?", 
   {}, 
   41176, 
   null, 
   1080333120.0
  ], 
  [
   41558, 
   null, 
   "Toukalos", 
   "Then would you be in favor of removing \"In God We Trust\" from all our currency?\n \n ...should a Christian be prohibited from wearing a crucifix in a public (government) school?\n \n ...would you be in favor of no longer asking a witness to place one hand on a bible for the swearing in?\n \n ...should we remove \"So help me God\" from all oathes?\n \n ...do you think our founding fathers actually meant for God and the mention thereof to be absent from all governmental operations?\n\n \n -Yes, I am in favour of removing \"In God We Trust\" from our money...it didn't get put there until the 1950's\n -No, Your body is not government property. Therefore, wear 100 crosses around your neck if you want.\n -Witnesses are no longer required to place their hand on a bible when taking the oath. They are asked to raise their right hand and intone the oath.\n -If you are an atheist or just choose not to, you do not have to say the \"So help me God\" portion of the oath. \n -Our greatest Founding Father's were not particularly devout, religious men. Read their works and their position on religion becomes very clear. \n \n \n http://religion.aynrand.org/quotes.html\n http://www.stephenjaygould.org/ctrl/quotes_appendix.html\n http://www.theology.edu/journal/volume1/ushistor.htm", 
   {}, 
   41183, 
   null, 
   1080611580.0
  ], 
  [
   41568, 
   null, 
   "galton", 
   "I am an atheist and am troubled by the arrogance of so many people who believe like I do. The 5% of Americans demanding that the environment of the public sphere be made to their liking rather than to the liking of the other 95% is plain arrogance. Like everyone else, I am exposed to public affirmations of God like \"In God We Trust\" all the time and couldn't care less about it. They are of so little an inconvenience to me, to insist that things that mean so much to people of faith be forcibly removed from the public square is to have the spirit of the tyrant.", 
   {}, 
   41558, 
   null, 
   1080614700.0
  ], 
  [
   41572, 
   null, 
   "Toukalos", 
   "I am an atheist and am troubled by the arrogance of so many people who believe like I do. The 5% of Americans demanding that the environment of the public sphere be made to their liking rather than to the liking of the other 95% is plain arrogance. Like everyone else, I am exposed to public affirmations of God like \"In God We Trust\" all the time and couldn't care less about it. They are of so little an inconvenience to me, to insist that things that mean so much to people of faith be forcibly removed from the public square is to have the spirit of the tyrant.\n\n \n In this debate it doesn't matter if you are an atheist or not <I am not, not that it has any bearing on this< What matters is that the government is ruled by majority while respecting the rights of the minority. In this case, even if your numbers were correct <though they are not< it is still the governments responsibility to provide as neutral forum as possible for the conduct of public affairs....thus no religious symbols. No one is impinging on their right of free exercise of religion, which is a private preference and therefore not in the public realm.", 
   {}, 
   41568, 
   null, 
   1080616260.0
  ], 
  [
   41575, 
   null, 
   "galton", 
   "In this debate it doesn't matter if you are an atheist or not <I am not, not that it has any bearing on this< What matters is that the government is ruled by majority while respecting the rights of the minority. In this case, even if your numbers were correct <though they are not< it is still the governments responsibility to provide as neutral forum as possible for the conduct of public affairs....thus no religious symbols. No one is impinging on their right of free exercise of religion, which is a private preference and therefore not in the public realm.\n\n \n Roughly 5% of Americans are atheists. \"Neutral forum\" is another phrase for \"atheistic forum.\" We atheists believe in a materialistic world where spirituality is non-existent. You are arguing for the removing spiritual expression from the public square, leaving nothing but a this-world sphere, exactly what us atheists would create if we had our way. You are advocating minority rights here, and the minority in this case are those who don't believe all these expressions of God, and I am telling you that we minorities don't need protection from this benign stuff (prosocial stuff really). What is 10 times more important is what the 95% get from having some of their most sacred feelings respected just a little. I am MUCH more concerned about the prosocial consequences of a healthy religious presence in society than my minority rights (in this case trivial).", 
   {}, 
   41572, 
   null, 
   1080617760.0
  ], 
  [
   41581, 
   null, 
   "Toukalos", 
   "Roughly 5% of Americans are atheists. \"Neutral forum\" is another phrase for \"atheistic forum.\" We atheists believe in a materialistic world where spirituality is non-existent. You are arguing for the removing spiritual expression from the public square, leaving nothing but a this-world sphere, exactly what us atheists would create if we had our way. You are advocating minority rights here, and the minority in this case are those who don't believe all these expressions of God, and I am telling you that we minorities don't need protection from this benign stuff (prosocial stuff really). What is 10 times more important is what the 95% get from having some of their most sacred feelings respected just a little. I am MUCH more concerned about the prosocial consequences of a healthy religious presence in society than my minority rights (in this case trivial).\n\n \n You stated that 5% of Americans do not want religion in the public sphere. This is erroneous.\n \n Religion in the Schools \n \n \"While many Americans seem to feel the nation has gone too far in removing religion from public schools, only 6 percent call for a school prayer tailored to the Christian majority.\"\n A slim majority (53%) want a moment of silence in the schools. Clearly, this is their solution to wanting to increase religiosity in their kids while still respecting religious diversity. A whopping 72% would favor either no prayer at all or only a moment of silence. So those who DO want prayer in school are in the minority (26%). \n \n 74% agreed that school prayer would teach kids that religion and God are important. 56% believe it would improve the values of young people. However, 57% acknowledge that prayer in school would be unfair to parents who want to decide what to teach their children about religion; 52% acknowledge that it would embarrass or isolate students whose religion is different; but amazingly, only 37% realize it would be unconstitutional. \n \n Religion in the public sphere \n \n When asked whether it is appropriate to bring up personal religious beliefs at, say, a party or social gathering, the vast majority (85%) feel this could be a problem, and suggest either avoiding it altogether or bringing it up \"only with care.\" Even more believe it is inappropriate in the workplace, with 30% opting for avoiding it entirely and 60% bringing it up only with care. When asked to evaluate the statement \"Deeply religious people are being inconsiderate when they always bring up religion when they deal with other people,\" 61% said that was either very close or close to the way they felt. So while they want people to be more religious, they want them to keep it to themselves. \n \n Religion in Government \n \n \"But the public's views on the role religion should play in political life are subtle, and the public seems almost intuitively wary of religion determining the substance of today's political debate.\"\n For example, a significant majority feel that \"deeply religious\" elected officials should compromise with other elected officials whose views are different on issues such as abortion, gay rights, the death penalty, and welfare reform. They want religious politicians, but they don't want them to vote based solely on their religious views. When electing officials, 58% of the public thinks it is \"wrong\" to base their decision on the religious affiliation of the official. In fact, religious affiliation means so little to the voters that 2/3 did not know the affiliation of either Al Gore or George Bush. Of course, they did know they were \"religious.\" However, when the question was posed a different way, the public showed a real schism. When asked which statement they agreed with more, a) \"If more politicians were religious, they would be more likely to be honest and have integrity\" or b) \"The nation needs more politicians who are honest and have integrity--it does not need more politicians who are religious,\" the public split right down the middle at 49% and 48%. So it would seem that while the public views religion as a positive influence on society, they are less enthusiastic about its influence on their politicians. http://www.americanatheist.org/supplement/courcey-survey.html\n \n another good one.\n http://pewforum.org/religion-politics/\n \n \n Furthermore, you claim to speak for all atheists? Hardly....Who are you to decide what is a \"trivial\" right and what is not? That power is left to the Constitution which denotes a clear separation of religion and state. Furthermore, you did not respond to the fact that religion is private and that no inhibits the free practice of religion. Also, America has a neutral forum for the specific reason that NO citizen should feel uncomfortable when freely participating in government.", 
   {
    "unicode_changes_made": true
   }, 
   41575, 
   null, 
   1080622380.0
  ], 
  [
   41590, 
   null, 
   "galton", 
   "You stated that 5% of Americans do not want religion in the public sphere. This is erroneous.\n \n Furthermore, you claim to speak for all atheists? Hardly....Who are you to decide what is a \"trivial\" right and what is not? That power is left to the Constitution which denotes a clear separation of religion and state. Furthermore, you did not respond to the fact that religion is private and that no inhibits the free practice of religion. Also, America has a neutral forum for the specific reason that NO citizen should feel uncomfortable when freely participating in government.\n\n \n I made no claim about what public opinion is concerning the separation of church and state. I was referring to the percent of atheists and the percent of believers when I referred to environments that are to people's natural liking. It appears I did not make that clear.\n \n Of course I was not attempting to speak for all atheists; I made no such claim. I assume that many would agree with you based on self-interest if nothing else. I was describing my experience of the issue from where I stand; if people find the points that flow from my experience appealing, fine; if not, fine. And who am I? Well I bring one thing to this dialogue that you do not; the experience of an atheist, a member of the minority group about which we are discussing. \n \n In my view, stripping all religious symbols from the public square is a radicalization of the Constitution, which does much more social harm than good. One example of this is that the radical removal of every whiff of God from the public space may very well result in the kind of backlash against atheists that I will NOT view as trivial.", 
   {}, 
   41581, 
   null, 
   1080628680.0
  ], 
  [
   41595, 
   null, 
   "Robbie", 
   "edit: I see that galton has replied as I was composing, saying, as I do, that he or she made no claim to speak for all atheists. Hopefully, very little of my post is redundant\n \n For starters, I think galton's point that removing religion from the public sphere means instituting Atheism is a very good one.\n \n I just wanted to reply to this... \n \n Furthermore, you claim to speak for all atheists? Hardly....Who are you to decide what is a \"trivial\" right and what is not? That power is left to the Constitution which denotes a clear separation of religion and state. Furthermore, you did not respond to the fact that religion is private and that no inhibits the free practice of religion. Also, America has a neutral forum for the specific reason that NO citizen should feel uncomfortable when freely participating in government.\n\n \n I hope you aren't saying that you speak for all atheists. I wonder whether galton actually said that, considering that he or she also says that it isn't right to remove religion from the public square just because 5% of Americans (atheists) think it should be. Apparantly, galton speaks against atheists.\n \n You say the Constitution denotes a clear separation of church and state. \n \n Where?\n \n And, how is the state considered the same as the public sphere? And how can you say that religion should be removed from that sphere, citing the Constitiution, when the purpose of the First Amendment was to promote the free exercise of religion? \n \n \"Congress shall make no law regarding an establishment of religion, or prohibiting the free exercise thereof\" \n \n The clear purpose of that statement is to prevent the Government from meddling with an \"establishment of religion\", or from prohibiting the free exercise of it. \n \n Finally, what do you mean by saying that \"NO citizen should feel uncomfortable when freely participating in government\"? What is a \"neutral forum\"? From what I've heard, debating gets pretty uncomfortable in legislature. Who ever said such a thing, no one should be \"uncomfortable when freely participating in government\"? How can you prevent this uncomfort? Should no one be able to say things someone disagrees with?\n \n I also want to reply to the survey you quote...\n \n \nYou stated that 5% of Americans do not want religion in the public sphere. This is erroneous.\n \n Religion in the Schools \n \n \"While many Americans seem to feel the nation has gone too far in removing religion from public schools, only 6 percent call for a school prayer tailored to the Christian majority.\"\n A slim majority (53%) want a moment of silence in the schools. Clearly, this is their solution to wanting to increase religiosity in their kids while still respecting religious diversity. A whopping 72% would favor either no prayer at all or only a moment of silence. So those who DO want prayer in school are in the minority (26%). \n\n \n 6% want only a Christian prayer.\n 53% want a moment of silence\n 72% want either a moment of silence or no prayer at all\n \n Therefore, only 26% do want prayer? Notice that the 72% who supposedly do not want prayer include those who would favor a moment of silence. These people don't want prayer? The above quote states \"Clearly, this is their solution to ... increase religiosity in their kids...\" So this is not true. The people who want a moment of silence do want prayer. They simply don't want a specific prayer of a specific religion(Christianity). As well, one wonders what is meant by a prayer \"tailored to the Christian majority\". It must mean a prayer that specificly mentions Christ. A prayer that mentioned God would not be specific to Christianity - since Muslims, Jews, and others beleive in God. So, the question of whether there should be a prayer tailored to the Christian majority leaves out anyone who might be in favor of a prayer acknowledging God, or any other specific prayer. This is either done on purpose, or is a serious flaw.\n \n Those who want either no prayer or a moment of silence are lumped together as opposed to putting those who want a Christian prayer with those who want a moment of silence. Why is that? It is a logical presumtion that someone who wants a moment of silence wants prayer, or \"increased Religosity\". Why are they put with those who explicitly don't want prayer?\n \n Re-examining the poll, putting the 53% who want a moment of silence with the 6% who want a Christian prayer gives us 59% who do want prayer in school. (or \"increased Religosity\") Thus, we actually have 41% who explicitly want no prayer at all.\n \n The bias of these questions and conclusions comes from asking people if specifically Christian things should be done, and then saying that this means people don't want religion in the public sphere. (ie, having \"In God We Trust\" on coins)\n \n Personally, I favor a moment of silence, or perhaps a prayer acknowledging God.\n \n \n Religion in the public sphere \n \n When asked whether it is appropriate to bring up personal religious beliefs at, say, a party or social gathering, the vast majority (85%) feel this could be a problem, and suggest either avoiding it altogether or bringing it up \"only with care.\" Even more believe it is inappropriate in the workplace, with 30% opting for avoiding it entirely and 60% bringing it up only with care. When asked to evaluate the statement \"Deeply religious people are being inconsiderate when they always bring up religion when they deal with other people,\" 61% said that was either very close or close to the way they felt. So while they want people to be more religious, they want them to keep it to themselves. \n\n \n These are no better.\n \n For example, the first question lumps together people who think you shouldn't bring up religion at all and those who say \"yes, but with care\". Why? That just doesn't make sense. I belong to a very conservative church and I doubt that there's any who thing you should bring religious beleifs up rudely. I can also vouch that they all think religion is an appropriate subject for conversation, and that some would not bring up the topic with out it being asked, because they don't want to be rude. Does my church want religion out of the public sphere? (no!)\n \n The next question says \"Even more beleive it is inappropriate in the workplace...\" 30 percent think you shouldn't bring up religion in the workplace, and that is \"Even more\". Re-interpreting the results again, I find that 70% think religion is appropriate conversation in the workplace, and more think so for a social gathering.\n \n The final question I find interesting. Rather than lumping together opposing groups, it simply asks a slanted question. (stunningly so) \n \n \"Deeply religious people are being inconsiderate when they always bring up religion when they deal with other people, 61% said that was either very close or close to the way they felt.\"\n \n Yeah. Guess what. I agree. \"Deeply religious\", \"always\", \"very close or close to\"... I mean, could you possibly get more slanted than that? Then there is the stunning result, 29% of people don't agree with that question. 29 percent. Really, I can hardly beleive it. I'm betting that they recognized a slanted question when they saw it and rejected it. Or maybe there really are 30% of people who think a \"deeply religious person\" is not \"being inconsiderate when they always bring up religion when they deal with other people\"\n \n Then the completely unwarranted conclusion that the 61% of people who think that is \"inconsiderate\" must want people to keep religion to themselves. Do I want people to keep religion to themselves? (no!)\n \n \n Religion in Government \n \n \"But the public's views on the role religion should play in political life are subtle, and the public seems almost intuitively wary of religion determining the substance of today's political debate.\"\n For example, a significant majority feel that \"deeply religious\" elected officials should compromise with other elected officials whose views are different on issues such as abortion, gay rights, the death penalty, and welfare reform. They want religious politicians, but they don't want them to vote based solely on their religious views. When electing officials, 58% of the public thinks it is \"wrong\" to base their decision on the religious affiliation of the official. In fact, religious affiliation means so little to the voters that 2/3 did not know the affiliation of either Al Gore or George Bush. Of course, they did know they were \"religious.\" However, when the question was posed a different way, the public showed a real schism. When asked which statement they agreed with more, a) \"If more politicians were religious, they would be more likely to be honest and have integrity\" or b) \"The nation needs more politicians who are honest and have integrity--it does not need more politicians who are religious,\" the public split right down the middle at 49% and 48%. So it would seem that while the public views religion as a positive influence on society, they are less enthusiastic about its influence on their politicians. http://www.americanatheist.org/supplement/courcey-survey.html\n \n\n \n This segment is better... it stays away from \"facts\" a bit and gives us more of that good rhetoric. Unfortunately they did include some...\n \n \"a significant majority feel that \"deeply religious\" elected officials should compromise with other elected officials whose views are different on issues such as abortion, gay rights, the death penalty, and welfare reform.\"\n \n First I would like to note the slight lumping action... abortion + gay rights + the death penalty + welfare reform. While I beleive that abortion, gay rights, and perhaps the death penalty are appropriately put together, I don't see wefare reform as part of this. However, that is not a blatant flaw (at least not as blatant as previous lumping), although a person who is especially opposed to any of the mentioned issues would probably support compromise. I wonder what the result would be if the question simply asked whether deeply religious elected officials should compromise with other elected officials whose views are different. I think that a majority of people would still say yes. I also question the \"significant majority\" statement. Considering the biased conclusions, I think this means anywhere from 54% to 60%. (remember that 53% is a \"slight majority\" if the authors wish to downplay it)\n \n Regardless, in this case I agree with the accuracy of the conclusion: \"They want religious politicians, but they don't want them to vote based solely on their religious views\". As the saying goes, \"politics is compromise\".\n \n It goes downhill from there.\n \n \"58% of the public thinks it is \"wrong\" to base their decision on the religious affiliation of the official. In fact, religious affiliation means so little to the voters that 2/3 did not know the affiliation of either Al Gore or George Bush. Of course, they did know they were \"religious.\" \"\n \n I agree with the first question. If you think that another official would be better, how can you justify voting against them? For instance, and only examining one issue, if someone else is going to actually give a restrained budget why would you vote for Bush because he's Christian? (I think that Bush is better than the alternatives, because of other issues, and they are no more likely to restrain spending) \n \n That's why I find it remarkable that 42% of people don't agree. \n \n The second stat is much more convincing... and may be the best support the authors have in this study. (to be more accurate - the only support) \n \n But. One wonders what exactly is meant by \"religious affiliation\". Does it mean Christian, Muslim, Jewish..., or does it mean Protestant, Catholic, Baptist...? One wonders whether the generally liberal media in the U.S. bothers to mention these religious affiliations. Note that it seems to be considered untoward for politicians to mention their religious beleifs. And note that \"of course\" the people did know that Gore and Bush \"are religious\". Presumably a vast majority there.\n \n And finally... \n \"when the question was posed a different way, the public showed a real schism. When asked which statement they agreed with more, a) \"If more politicians were religious, they would be more likely to be honest and have integrity\" or b) \"The nation needs more politicians who are honest and have integrity--it does not need more politicians who are religious,\" the public split right down the middle at 49% and 48%. So it would seem that while the public views religion as a positive influence on society, they are less enthusiastic about its influence on their politicians. \"\n \n This question claims that Americans are divided very evenly on whether religious beleif increases honesty and integrity. Yet you have to notice that the question doesn't ask that. Option A says \"If more politicians were religious, they would be more likely to be honest and have integrity\". Question B does not say \"If more politicians were religious, they would not be more likely to be honest and have integrity\". No, it says \"The nation needs more politicians who are honest and have integrity--it does not need more politicians who are religious\". Now that's a difficult choice. You might say that I'm evenly divided. I agree with A. I agree completely that \"The Nation needs more politicians who have honesty and integrity\". However, I feel that the second part of that statment contradicts the first... \"it does not need more politicians who are religious,\". So I have to decide, essentially, do I think religion or honest and integrity more important. (disregarding whether I beleive they are actually different)\n \n Apparently, 49% of people decided that religion is more important that honesty and integrity... or else that religion is so sure to make a person have honesty and integrity that it will do so without fail. \n \n Isn't that something. \n \n Most people are cynical about politicians. Personally, I don't have all that much faith that \"religion\" will infalliabaly produce honesty and integrity in anyone, much less a politician. After all, \"politics is compromise\".\n \n Thanks for this poll - I never knew that so many people want religion in the public sphere.", 
   {
    "unicode_changes_made": true
   }, 
   41581, 
   null, 
   1080635700.0
  ], 
  [
   41598, 
   null, 
   "Toukalos", 
   "Roughly 5% of Americans are atheists. \"Neutral forum\" is another phrase for \"atheistic forum.\" We atheists believe in a materialistic world where spirituality is non-existent. You are arguing for the removing spiritual expression from the public square, leaving nothing but a this-world sphere, exactly what us atheists would create if we had our way. You are advocating minority rights here, and the minority in this case are those who don't believe all these expressions of God, and I am telling you that we minorities don't need protection from this benign stuff (prosocial stuff really). What is 10 times more important is what the 95% get from having some of their most sacred feelings respected just a little. I am MUCH more concerned about the prosocial consequences of a healthy religious presence in society than my minority rights (in this case trivial).\n\n This is where you claimed to speak for atheists...\"You are arguing for the removing spiritual expression from the public square, leaving nothing but a this-world sphere, exactly what us atheists would create if we had our way.\" and here \"... and I am telling you that we minorities don't need protection from this benign stuff\"\n \n Furthermore I never condemned personal religious expression in public or private. But there should not be a picture of Jesus hanging in the courthouse lobby or a public school classroom.", 
   {}, 
   41575, 
   null, 
   1080638040.0
  ], 
  [
   41728, 
   null, 
   "galton", 
   "This is where you claimed to speak for atheists...\"You are arguing for the removing spiritual expression from the public square, leaving nothing but a this-world sphere, exactly what us atheists would create if we had our way.\" and here \"... and I am telling you that we minorities don't need protection from this benign stuff\" \n\n \n Robbie is right that the thrust of my argument was against what the supposed interests of atheists are. My first statment you quoted was referring to the interests of atheists; I was not claiming to know what their actual opinions are on this issue. I think I would be safe in presuming that most atheists are on your side of the aisle. The initial motivation of my argument was to claim that that desire of some atheists is arrogant.\n \n As for the second quote, once again I am not claiming that we atheists all think like this as you are claiming I was doing; I was giving my opinion of what I, emphasis on I, think is needed for people in this group in the way of legal protections. I see nothing wrong with giving an opinion about what the nature of the situation of people in this group is; one reason I do is because I have experience in this group. If others fail to find my opinion compelling, fine. I wonder how you would have responded had I been an atheist arguing that WE need protection against the tyranny of the religious majority. Would you have said who are you to claim to speak for all atheists?", 
   {}, 
   41598, 
   null, 
   1080695280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Free Excercise of Religion?", 
  "url": "http://www.4forums.com/political/current-events-debates/1978-free-excercise-religion.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 1978, 
  "discussion_files": [
   [
    "21837.html", 
    "http://www.4forums.com/political/current-events-debates/1978-free-excercise-religion-print.html"
   ]
  ], 
  "identifier": 1978
 }
]