[
 [
  [
   40336, 
   null, 
   "daewoo", 
   "AN intern aat work just finished a sociology experiment for school that I thought was interesting. His group went to 9 different malls in 5 differnt cities and surveyed every third adult that came off the escalator. In total they surveyed 2700 different people. The questions on the survey were:\n \n 1. Do you have jumper cables in your car?\n 2. Have you ever needed to jump start your car?\n 3. Have you ever stopped to help somebody that was broken down on the road?\n 4. Do you own a gun?\n 5. (If yes to #3 and #4) Did you have your gun with you when you stopped to help somebody on the road? \n The results:\n \n \n While gun owners and non-gun owners were equally likely to have needed to jump start their cars at some time (43% and 44%) gun owners were SEVEN (yes, SEVEN, (7)) times more likely to have a set of jumper cables in their car.\n \n While only 3% of gun owners (the survey was not done in a concealed carry state) reported having a gun with them when they stopped to help somebody ont he side of the road, they had stopped to help people on the road NINE times more frequently than non gun owners.\n \n As an interesting side note, 23% of non gun owners wished to change their answer to either question #1, question #3, or both after being asked question #4.\n \n I am hoping that once he gets his report graded he will post it on the internet. I thought it was pretty interesting.", 
   {
    "post_info": {
     "post_title": "An interesting item"
    }
   }, 
   null, 
   null, 
   1079865000.0
  ], 
  [
   42622, 
   null, 
   "emclean", 
   "please incurage him to post his report. or if he would not like to, would you ask him is people can request a copy?", 
   {}, 
   40336, 
   null, 
   1081285740.0
  ], 
  [
   42985, 
   null, 
   "daewoo", 
   "please incurage him to post his report. or if he would not like to, would you ask him is people can request a copy?\n\n \n Working on it. Apparently we are still waiting for to to be graded (it was really big, at leat 20 typed pages). I plan on buying from them when they get it back, and maybe putting up a whole page in honor of it. Partly because I think it is very telling, partly because I remember what it was like to be in college and get a little recognition for your work.", 
   {}, 
   42622, 
   null, 
   1081407360.0
  ], 
  [
   43409, 
   null, 
   "hvozdany", 
   "AN intern aat work just finished a sociology experiment for school that I thought was interesting. \n ...\n I am hoping that once he gets his report graded he will post it on the internet. I thought it was pretty interesting.\n\n \n Do you know what conclusions the person drew from this?\n What conclusions do you draw from this? That people that own guns are less scared? Or just nicer people? :)", 
   {}, 
   40336, 
   null, 
   1081662600.0
  ], 
  [
   43443, 
   null, 
   "daewoo", 
   "I am not entirely sure. I didn't have a chance to actually read the entire thing. I think that the basic thrust of the report (from what I saw) was that gun ownership is not fear based. As I understand it, the professor teaching the course likes to paint gun owners as big scaredy cats, and has even gone so far to try to use the \"little wanker\" arument in regards to them (how bad does your argument have to be before you have to resort to \"my wanker is bigger than yours\"). I also saw quite a bit about taking personal responsibility for ones self and ones situation. \n \n I am not sure about the advisability of doing a poin with the sole intent of contradicting a professor (can;t be real good for your grade), but I guess that's why colleges hav appeal processes. \n \n Persoanlly, I think that he is right on target regarding gunownership and fear. I posted a link here a while back that dealt witht he issue, and the results there were that non gun owners were geerally more fearful of crime and gun owners were more confident in their ability to deal with a criminal, even in the absence of a firearm. This guys report does a good job of verifying that on a local level and in terms that we can all understand.", 
   {}, 
   43409, 
   null, 
   1081697400.0
  ], 
  [
   44583, 
   null, 
   "Tastyfish", 
   "Do you know what conclusions the person drew from this?\n What conclusions do you draw from this? That people that own guns are less scared? Or just nicer people? :)\n\n Or that they tend to be better prepared, or even less willing to accept help from others or get breakdown cover. That's the trouble with these kind of stats, the interpretations are pretty open to debate.", 
   {}, 
   43409, 
   null, 
   1082385960.0
  ], 
  [
   44585, 
   null, 
   "Eddie", 
   "It would be interesting to see his paper. Does he cover other characteristics of those he questions, like age, gender, income bracket etc etc?. And has he made any distinction between the different malls, or is he assuming that the neighbourhoods are similiar? And for which class (collage or high school) is this report written?", 
   {}, 
   44583, 
   null, 
   1082386620.0
  ], 
  [
   44617, 
   null, 
   "daewoo", 
   "It would be interesting to see his paper. Does he cover other characteristics of those he questions, like age, gender, income bracket etc etc?. And has he made any distinction between the different malls, or is he assuming that the neighbourhoods are similiar? And for which class (collage or high school) is this report written?\n\n \n I don;t blieve he breaks it down by differnt shopping malls. We are in Kansas, a mall is a mall. There is nreal inner city here. I think it is broken down by age range and gender.\n \n It is writen for a college class (I don't think people usually hire high school kids a interns).\n \n I will start harassing him about it on wednesday (I am taking a couple days off work).", 
   {}, 
   44585, 
   null, 
   1082397840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  An interesting item", 
  "url": "http://www.4forums.com/political/gun-control-debates/1983-interesting-item.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 1983, 
  "discussion_files": [
   [
    "14057.html", 
    "http://www.4forums.com/political/gun-control-debates/1983-interesting-item-print.html"
   ]
  ], 
  "identifier": 1983
 }
]