[
 [
  [
   40429, 
   null, 
   "The_Comedian", 
   "So Israel finally killed Yassin:\n \n CNN \n \n BBC \n \n What do you think about this?\n Will Yassin become a martyr and the violence will increase again or will it prevent young Palestinians to start a terrorist carreer?\n \n I think the first will be the case as all organizations have sworn bitter and cruel revenge.", 
   {
    "post_info": {
     "post_title": "Start of new peace or start of a bitter war?"
    }
   }, 
   null, 
   null, 
   1079965860.0
  ], 
  [
   40537, 
   null, 
   "syklopps61", 
   "Frankly, I hope it's the beginning of a war. We should cut Israel loose and let them do what they are good at-killing terrorists!!! Couldn't be happier that they are on our side!!", 
   {}, 
   40429, 
   null, 
   1080014340.0
  ], 
  [
   40538, 
   null, 
   "syklopps61", 
   "Let me clarify! SInce I don't think peace is possible using the methods that have been tried for years, I think a full scale war would actually lead to peace eventually", 
   {}, 
   40537, 
   null, 
   1080014400.0
  ], 
  [
   40545, 
   null, 
   "daewoo", 
   "So Israel finally killed Yassin:\n \n \n What do you think about this?\n Will Yassin become a martyr and the violence will increase again or will it prevent young Palestinians to start a terrorist carreer?\n \n I think the first will be the case as all organizations have sworn bitter and cruel revenge.\n\n \n Martyr. YOu may also note that not only have the organizations sworn revenge against israel, they have sworn it against the US as well. With friends like isreal.....\n \n \n \nFrankly, I hope it's the beginning of a war. We should cut Israel loose and let them do what they are good at-killing terrorists!!! Couldn't be happier that they are on our side!!\n\n \n What would give you the impression that israel is good at killing terrorists? THese are people who have resorted to military strikes against their won population, and they STILL can't control terrorism (or freedom fighting, depending onw hich way you see it) in their country.\n \n So far, their best terrorism fighting tactic seems to be loading busses full of civilians and waiting for terrorists to commit suicide bombings. THis is a great plan, as long as you don;t run out of civilians who are willing to get on the bus before the other guys run out of people willing to commit suicide. \n \n From what we have seen so far, Israel migh possibly be the WORST country on the planet at combatting terrorism. Even the british did better in N ireland, and that was nothign to brag about.", 
   {}, 
   40429, 
   null, 
   1080017760.0
  ], 
  [
   40628, 
   null, 
   "syklopps61", 
   "What would give you the impression that israel is good at killing terrorists? \n \n \n Well, we haven't allowed them to take care of business for one. My personal opinion, I'm all for a Palestinian State-the terrorism won't stop and Israel would then have the right to annihilate them. I know, NO one is as fierce as the Arabs LOL That's right, the stunning victories Israel has enjoyed over the Arabs were just a fluke, right? LOL\n \n \nfreedom fighting, depending onw hich way you see it\n\n \n Man, you really do have a sick respect for these animals. Calling them freedom fighters gives them credibility, and they deserve none", 
   {}, 
   40545, 
   null, 
   1080063540.0
  ], 
  [
   40631, 
   null, 
   "daewoo", 
   "Well, we haven't allowed them to take care of business for one. My personal opinion, I'm all for a Palestinian State-the terrorism won't stop and Israel would then have the right to annihilate them. I know, NO one is as fierce as the Arabs LOL That's right, the stunning victories Israel has enjoyed over the Arabs were just a fluke, right? LOL\n\n \n Haven't allowed them to take care of business? They are in violation of 47 security council resolution. They use their military against their own population. They run raids into neiborghing countries. Not only does the US remain silent about this, we give them billions in aid. Exactly what measures do you think would be effective that they have not already implemented? THey have killed unarmed foreign peace activists, including Americans, and have not been forced to answer for it. Exactly what measures do you feel we are preventing them from implementing?\n \n \n AS far as Israels stunning victories, I would suggest we pull US aid and sponsorship from israel and see how long they last. \n \n \n \nMan, you really do have a sick respect for these animals. Calling them freedom fighters gives them credibility, and they deserve none\n\n \n IF it wasn't for the fact that Israel is illegally occupying palestine in direct violation of dozens of UN resolutions (all of which are available online at the UN's website) and the fact that Israel routinely uses their military forces against them, whihc routinely results in the deat5hs of inocents, the line would be a little more clear cut. As things stand, the line between freedom fighter and terrorist in this situation is a pretty blurry one.", 
   {}, 
   40628, 
   null, 
   1080064500.0
  ], 
  [
   40641, 
   null, 
   "Nallyo", 
   "If you want to talk about the deaths of innocents, look at the Palestinian registry. They seem to target buses filled with women and children going to markets, university students, and cafes. The Israelis? They target the military leaders. It is regretable that some people die as a result of collateral damage, but it is also unavoidable in any war.\n \n I agree. Set Israel loose. The sooner that they can clear out that den, the less people that die in the long run. And since this smiley has something to do with the topic, I'll post it emoticon_xkill emoticon_xkill", 
   {}, 
   40631, 
   null, 
   1080067920.0
  ], 
  [
   40689, 
   null, 
   "fracas", 
   "i think very little will change actually\n the palestinians don't need another martyr to kill, they have plenty \"reasons\" to already\n and israeli will continue to kill as long as they are being targetted.\n \n \nThe Fear Factor\n By BRET STEPHENS\n March*23,*2004\n \n JERUSALEM -- Are Palestinians weeds? It would seem many people think they are. Following Israel's assassination early yesterday morning of Ahmed Yassin, spiritual leader of Hamas, the gist of international reaction was that the strike would bring new converts to the Islamist cause and incite a fresh wave of terrorist violence against Israel. In other words, Palestinians are weeds: Mowing them down, as it were, only has the effect of making them grow back stronger and faster.\n \n There are moments (Monday morning was one of them) when I find myself tempted by the metaphor. As I write, my TV screen is filled with images of Palestinian mourners thronging the streets of Gaza, praising Yassin as a martyr and vowing deadly vengeance. This looks like the reaction of an emboldened people, not a frightened one. So what's the sense, in purely utilitarian terms, of further Israeli attacks? Alternatively, what's the sense of showing any restraint at all? If the weed metaphor is right, either Israel should sue for peace on whatever terms the Palestinians extend or it should resort to extreme measures like population transfer. Anything else just fruitlessly prolongs a cycle of violence.\n \n But of course Palestinians aren't weeds. They're human. They think in terms of costs and benefits, they calculate the odds, they respond more or less rationally to incentives and disincentives. And what makes us afraid can also make them afraid.\n \n This is a trite observation, but it's one Palestinians would rather have us forget. Over 42 months of conflict, their strategy has been to persuade Israelis that they, the Palestinians, are made of different stuff. Why else the suicide bombers? Not because of their proven capacity to kill civilians in greater numbers than any other weapon currently in the Palestinian arsenal. That's only a second-order effect. The deep logic of suicide bombing lies in the act of suicide itself. People who will readily die for their cause are, by definition, beyond deterrence. By showing that Israel's tanks and fighter jets are just so much scrap metal in the face of the Palestinians' superhuman determination, they aim to disarm Israel itself.\n \n How does one respond to such a logic? It helps not to be fooled by it. Again, allow me to make the trite observation that Palestinians love their children too. To date, there has not been a single instance in which a Hamas leader sent one of his own sons or daughters on a suicide mission. I once interviewed a Hamas leader, since deceased, as he bounced his one-year-old girl on his knee. Contrary to myth, this was not a man who was afraid of nothing. Unsparing as he was with the lives of others, he was circumspect when it came to the lives of his own.\n \n Indeed, when one looks closely at just who the suicide bombers are (or were), often they turn out to be society's outcasts. Take Reem Salah al-Rahashi, a mother of two, who in January murdered four Israeli soldiers at the Erez checkpoint on the Gaza-Israel border. In a prerecorded video, Rahashi said becoming a shaheed was her lifelong dream. Later it emerged she'd been caught in an extramarital affair, and that her husband and lover had arranged her \"martyrdom operation\" as an honorable way to settle the matter. It is with such people, not with themselves, that Palestinian leaders attempt to demonstrate their own fearlessness.\n \n In the early months of the intifada, this macho pretense was sustained by the Israeli government's tacit decision not to target terrorist ringleaders, for fear such attacks would inspire massive retaliation. Yassin and his closest associates considered themselves immune from Israeli reprisals and operated in the open. What followed was the bloodiest terrorist onslaught in Israeli history, climaxing in a massacre at Netanya in March 2002. After that, Israel invaded the West Bank and began to target terrorist leaders more aggressively.\n \n The results, in terms of lives saved, were dramatic. In 2003, the number of Israeli terrorist fatalities declined by more than 50% from the previous year, to 213 from 451. The overall number of attacks also declined, to 3,823 in 2003 from 5,301 in 2002, a drop of 30%. In the spring of 2003, Israel stepped up its campaign of targeted assassinations, including a failed attempt on Yassin's deputy, Abdel Aziz Rantisi. Wise heads said Israel had done nothing except incite the Palestinians to greater violence. Instead, Hamas and other Islamic terrorist groups agreed unilaterally to a cease-fire.\n \n In this context, it bears notice that between 2002 and 2003 the number of Palestinian fatalities also declined significantly, from 1,000 to about 700. The reason here is obvious: As the leaders of Palestinian terror groups were picked off and their operations were disrupted, they were unable to carry out the kind of frequent, large-scale attacks that had provoked Israel's large-scale reprisals. Terrorism is a top-down business, not vice versa. Targeted assassinations not only got rid of the most guilty but diminished the risk of open combat between Israeli soldiers and Palestinian foot soldiers.\n \n Now a few words about Yassin, the international reaction to his killing, and the likely result for Israel. It may be recalled that Israel released the good sheikh in 1997, after having sentenced him to life in prison, with the promise that he would never again promote terrorism. This was during the Oslo years, when serious people actually thought that such conciliatory gestures served the interests of peace. Today, that is beyond comprehension. At any rate, Yassin didn't keep his promise.\n \n Meanwhile, assorted foreign ministers are in full throat against Israel. \"All of us understand Israel's need to protect itself -- and it is fully entitled to do that -- against the terrorism that affects it, within international law,\" says British Foreign Minister Jack Straw. \"But it is not entitled to go in for this kind of unlawful killing.\"\n \n It would be interesting to know exactly what, according to Mr. Straw, Israel is lawfully allowed to do in self-defense. Perhaps it would be as well if the minister also reminded the Palestinian Authority of its obligations, under the Road Map, to \"undertake visible efforts . . . to arrest, disrupt, and restrain individuals and groups conducting and planning attacks on Israelis.\" But if Mr. Straw and his colleagues do not do so, it is not from an excess of respect for the Palestinians, but rather its lack. They will, after all, be viewing them merely as weeds, not as humans capable of acting in their own best interests.\n \n Mr. Stephens is editor in chief of the Jerusalem Post.\n URL for this article:\n http://online.wsj.com/article/0,,SB108000585017162510,00.html\n \n", 
   {}, 
   40641, 
   null, 
   1080077400.0
  ], 
  [
   40926, 
   null, 
   "syklopps61", 
   "They are in violation of 47 security council resolution.\n\n \n Oh, well then, whenever the U.N. speaks, they MUST be right LMAO Doesn't matter that they are anti-American and anti-Israeli, does it?\n \n \nThey use their military against their own population\n\n \n You've mentioned this several times, how do they do that? Don't get defensive, just curious\n \n \nThey run raids into neiborghing countries. \n \n \n Just for kicks, huh? You seem to have a problem with countries willing to take their national security into their own hands, and NOT relying on the U.N.\n \n \nHaven't allowed them to take care of business? Not only does the US remain silent about this, we give them billions in aid. Exactly what measures do you think would be effective that they have not already implemented? THey have killed unarmed foreign peace activists, including Americans, and have not been forced to answer for it. Exactly what measures do you feel we are preventing them from implementing?\n\n \n Full scale war!!! They could obliterate those animals without breaking a sweat and the world would have one less problem to deal with. I didn't realize you were an insider and knew all the conversations that occur between the U.S. and Israel. I think it's a safe bet that we are putting a great deal of pressure on them to show restraint\n \n \nAS far as Israels stunning victories, I would suggest we pull US aid and sponsorship from israel and see how long they last. \n \n \n LOL what in the world do you have against Israel anyway? It's obvious there's an issue here, because you can't even admit the victories they HAVE enjoyed, there has to be some OTHER reason for the victories. Hell, we could use your argument about practically every country then..gimme a break. The fact is, they defend themselves and to hell with the rest of the world. Maybe we could learn a thing or two from them", 
   {}, 
   40631, 
   null, 
   1080187860.0
  ], 
  [
   40932, 
   null, 
   "Broker", 
   "Israel should not obey the UN.\n \n Israel has NEVER been included in anti-hate resolutions. They fight and fight and fight to have Jews included, but it has never been allowed, each time one of these resolutions is passed.\n \n The UN condemns Israeli attacks on terrorist training camps that kill militants but refuses to condemn suicide bombings that kill innocent, unsuspecting civillians.\n \n \n And the Palestinians already have a state--Jordan. It is 77% of the historic Palestinian state... it is three times the size of Israel. 75% of the population is Palestinian! The Palestinians in Israel's territories chose to stay there. Millions of people fled back to Jordan, Egypt, or Syria. Those who did not accepted Israeli control. End of story.\n \n And I ask you this: are we obligated to return our Western territory to Mexico? Are we obligated to return Puerto Rico, Guam, all the other islands we still have to Spain? It's the same thing--territory confiscated in a war.", 
   {}, 
   40926, 
   null, 
   1080190200.0
  ], 
  [
   40934, 
   null, 
   "The_Comedian", 
   "Oh, well then, whenever the U.N. speaks, they MUST be right LMAO Doesn't matter that they are anti-American and anti-Israeli, does it?\n\n Thank god the UN is there to show how bad Saddam was and to justify a war with his broken resolutions ;) .\n \n \nYou've mentioned this several times, how do they do that? Don't get defensive, just curious\n\n Send tanks and soldiers into Gaza or the Westbank.\n \n \nJust for kicks, huh? You seem to have a problem with countries willing to take their national security into their own hands, and NOT relying on the U.N.\n\n That's an invitation for any country willing to take power in nearby regions. See Russia on how \"fighting terror\" changes the face of a war.\n \n \nFull scale war!!! They could obliterate those animals without breaking a sweat and the world would have one less problem to deal with. I didn't realize you were an insider and knew all the conversations that occur between the U.S. and Israel. I think it's a safe bet that we are putting a great deal of pressure on them to show restraint\n\n Maybe the US should make some of this pressure on Israel in public so the Arab world had less reason to think that the US is biased?\n Full scale war would mean that Israel had to fight a dozen muslimic countries. Do you want America to join this?\n \n \nLOL what in the world do you have against Israel anyway? It's obvious there's an issue here, because you can't even admit the victories they HAVE enjoyed, there has to be some OTHER reason for the victories. Hell, we could use your argument about practically every country then..gimme a break. The fact is, they defend themselves and to hell with the rest of the world. Maybe we could learn a thing or two from them\n\n We can learn that eye for an eye doesn't solve problems. Both sides of this conflict show us every day...", 
   {
    "unicode_changes_made": true
   }, 
   40926, 
   null, 
   1080190260.0
  ], 
  [
   40936, 
   null, 
   "syklopps61", 
   "[QUOTE]\nThank god the UN is there to show how bad Saddam was and to justify a war with his broken resolutions ;) .\n\n \n ALLLLLLLLLLRIGHTY then LOL\n \n \nSend tanks and soldiers into Gaza or the Westbank.\n\n \n With the intent of killing it's own citizens?\n \n \n \nThat's an invitation for any country willing to take power in nearby regions. See Russia on how \"fighting terror\" changes the face of a war.\n\n \n Israel could take over the entire Middle East, and they haven't done it, so one can only assume that they take these actions in self defense or for preemptive motivations\n \n \nFull scale war would mean that Israel had to fight a dozen muslimic countries. Do you want America to join this?\n\n \n LMAO we wouldn't need to!!!", 
   {
    "unicode_changes_made": true
   }, 
   40934, 
   null, 
   1080190980.0
  ], 
  [
   40939, 
   null, 
   "The_Comedian", 
   "\n With the intent of killing it's own citizens?\n\n Although they mainly don't have Israeli citizenship the Palestinans still live on Israeli soil. For me this makes them citizens in a way.\n \n \nIsrael could take over the entire Middle East, and they haven't done it, so one can only assume that they take these actions in self defense or for preemptive motivations\n\n I doubt they could. They could waste the ME with their nukes but if they conquered all that would leave a handful of soldiers for every Arab city to observe.\n And I admit that some of Israel's military actions in recent years (not wars but short attacks) were valid to be self defensive. But most are simply fire to the extremists.\n \n \nLMAO we wouldn't need to!!!\n\n You would ;) .\n At least with an imense increase in military aid and weapon sales; and sooner or later the first marine sets foot onto the holy land. Could cause more trouble.", 
   {
    "unicode_changes_made": true
   }, 
   40936, 
   null, 
   1080194460.0
  ], 
  [
   40942, 
   null, 
   "daewoo", 
   "Oh, well then, whenever the U.N. speaks, they MUST be right LMAO Doesn't matter that they are anti-American and anti-Israeli, does it?\n\n \n Israel is a UN nation, which means those are the rules they agree to play by. If they no longer want to be a UN nation, they are welcome to withdraw from the UN. They will loose the privelages that come with being a UN nation, but they would no longer be bound to follow UN mandates, as they are by their own choice now. \n \n \n \nYou've mentioned this several times, how do they do that? Don't get defensive, just curious\n\n \n IS this a joke? This is a thread about a palestenian who was assasinated using a helicopter gunship and a rocket barage. IF that is not using your military against your own population, I don't know what is. THey have also used tanks and troops extensively in the gaza strip and attacked palestenian headquarters buildings with cruise missiles.\n \n \nJust for kicks, huh? You seem to have a problem with countries willing to take their national security into their own hands, and NOT relying on the U.N.\n\n \n The last cross border attack they made was on a refuge camp in syria. They have also bombed nuclear facilities in Iran, even after the facilities had been certified as being related to power production NOT weapons production (like israel really has any room to take the moral high ground on nukes). YOu are NOT allowed to make unilateral cross border strikes under international law. THis is just the way it is. Of course, Israel could withdraw from the UN as outlined before, then they would actually have some fudge room to say \"we haven't agreed to those rules. \n \n \n \nFull scale war!!! They could obliterate those animals without breaking a sweat and the world would have one less problem to deal with. I didn't realize you were an insider and knew all the conversations that occur between the U.S. and Israel. I think it's a safe bet that we are putting a great deal of pressure on them to show restraint\n\n \n Again, since they are apparently already using their troops against the palestenians, what restrictions do you feel have been put on them? Showing a great deal of restraint generally does NOT include the use of gunships, fighter planes, tanks and mortars against your own population. THis would be the exact opposite of showing restraint.\n \n There would not be a full scale war in Israel, even if the international community was not looking on. The palestenians know they could not win, so things would continue as they are now, with gurilla attacks followed by executions without benifit of trial by the Israelis. Of course, the Israelis could \"ethnically cleanse\" their country. Just start shooting the palestenians on a larger scale than they already are now.\n \n \n \nLOL what in the world do you have against Israel anyway? It's obvious there's an issue here, because you can't even admit the victories they HAVE enjoyed, there has to be some OTHER reason for the victories. Hell, we could use your argument about practically every country then..gimme a break. The fact is, they defend themselves and to hell with the rest of the world. Maybe we could learn a thing or two from them\n\n \n What do I have against ISrael? THey are a terrorist state. THis thread is about the fact that they have assasinated a memebr of their population, plus those that were aorund him. THis guy was not sentenced to dreath in a court. HE was tried several years ago, sentenced to life in prson, then later released. THey launched a rocket barage against him. I am an American who firmly believes in the ideals behind the american constitution and our legal system. One of those is that you do not execute people without benifit of trial. When Mc Veigh blew up the federal building in oklahoma, our law enforcement officials found him. HE was tried and executed for his crimes. We did not scrambe a squad of apache helicopters to hunt him down and destroy him with anti tank rockets.\n \n For US officials, who have sworn to uphold our constituon, to support a terrorist state that engages in such tactics is reprehensible. While it is true that Israel is not bound by the ideals set forth in our constitution, our officials should be and should not support such a tyranical regime.\n \n A far as the great and fierce israli army, I say pull the billions and billions of dollars in US aid to israel and we can see how long they last. I would guess somewhere beteween 2 and 5 days. THis is bevcause ISrael is a welfare state. tHey cannot afford to feed themselves without the massive US subsudies they get now, and they certainly couldn't afford to fight any kind of war. Here is a page that covers US aid to Israel pretty well\n \n http://www.wrmea.com/html/us_aid_to_israel.htm\n \n Now, I am not against helping out US citizens who need a hand. I am not against sending food to starving nations in Africa that are suffering from a draught. I am not against lending a hand to stop large scale ethnic cleansing. I am absolutly, totally, 100% against providing billions to a welfare state that cannot support itself and realistically will most likely never be able to be independant. I am especially against this when it is a nation that has such racist and tyranical practices as Isreal. \n \n THat is my problem with ISrael. IT is time for the US to pull our unconditional support from ISrael and let them sink on thier own. You will note I don't say \"sink or swim\" becasue there is absolutly no possibility that ISrael can survive unless the US is there to babysit them. You are talking about a country with virtually no natural resources, a poor industrial infrastructure, and that has managed to alienate it's neiborighing countries completely which puts them in such a position of instability that no reasonable businessman anywhere in the world would want to take the chance of dealing with them. \n \n What exactly has Israel done that garners the deep degree of respect that you seem to give them? IS it simply the fact that after the US sunk billions of dollars into their military to ensure that they had a vast technological superiority over their neiborghing countries they managed to repel attacks and institute a land grab back in the 60's? \n \n At one time I thought that the rabid Israeli supporters here in the US were mostly Jewish fundamentalists, until I started talking to my Jewish friends and in laws and found that there is a very large jewish base in the US composed of individuals who find the thought that they are somehow connected to the terroristic and tyranical acts by the Israeli government abslutly offensive. \n \n I actually came to blows with an old and dear friend who was offended becasue I assumed he supported the \"zionist murderers\" (his words).\n \n Now, it seems that the the most vocal Israeli supporters in the US are neocons who see the Israeli conflict as some kind of \"big wanker\" contest and feel that Israel should fell free to do as they wish simply becaus ethe US says so.", 
   {}, 
   40926, 
   null, 
   1080196080.0
  ], 
  [
   40980, 
   null, 
   "Broker", 
   "That man was Israeli's Osama bin Laden. They were perfectly justified in killing him. He is personally responsible for hundreds and hundreds of murders of innocent civillians. What in the world do we have our military out looking for bin Laden for? Chances are they're going to have to shoot him... we can't do that! :-\\\n \n You're referring to two different situations. US law enforcement can take down anyone easily. The Israelis would have to send a convoy of armored vehicles just to be safe in the territory! And grabbing Yassin is not as easy as approaching him and getting him into a vehicle. He has bodyguards, he has supporters. Hundreds of Palestinians would have rushed to his assistance had they tried to arrest him. As soon as the convoy approached they would have rushed him back into the building and you'd see people gathering out in front.", 
   {}, 
   40942, 
   null, 
   1080234240.0
  ], 
  [
   41009, 
   null, 
   "Nallyo", 
   "I think that the problem is that people are saying that the Palestinians are citizens of Israel and treating every Palestinian as such. However, they are mistaken in that there is generally an agreed upon difference between a militant and a civilian in terms of citizenship. For example, if there was a group of people in the United States who were plotting to overthrow it, using suicide bombers aimed at women and children, they would be committing treason and would forfeit many of the rights that are afforded to citizens. Granted that we grant a lot more rights to people living within our borders than Israel does, and so it is an imperfect example.\n \n Look at intent. The Hamas group is working to achieve their aims through terror directed at civilians. If they directed their efforts toward the Israeli army or actual government, I might be more sympathetic. Yet when innocents are killed, on both sides, I tend to look at the other's point of view more. The Israelis have more of an excuse, as they use (semi) precision strikes to decapitate the leadership of the other's organization and end up causing collateral damage. The palestinians, on the other hand, actively try to increase such collateral damage.", 
   {}, 
   40980, 
   null, 
   1080244380.0
  ], 
  [
   41023, 
   null, 
   "daewoo", 
   "That man was Israeli's Osama bin Laden. They were perfectly justified in killing him. He is personally responsible for hundreds and hundreds of murders of innocent civillians. What in the world do we have our military out looking for bin Laden for? Chances are they're going to have to shoot him... we can't do that! :-\\\n \n You're referring to two different situations. US law enforcement can take down anyone easily. The Israelis would have to send a convoy of armored vehicles just to be safe in the territory! And grabbing Yassin is not as easy as approaching him and getting him into a vehicle. He has bodyguards, he has supporters. Hundreds of Palestinians would have rushed to his assistance had they tried to arrest him. As soon as the convoy approached they would have rushed him back into the building and you'd see people gathering out in front.\n\n \n Bin laden is the head of a multinational terrorist organisation. This guy was a quadrapalegic that hey have not been able to prove conclusively is still invloved in the operational side of ANY terrorist organisation. \n \n AS far as it being so difficult/impossible to get him, I would say put the guy who got him ast time in charge. They didn;t seem to have any problem then, nor have they had any real problem with arresting other palestenians. They have simply quite trying. NOw, they find you objectionable enough they send their military to murder you. Perhapse they don;t think they could get these people convicted in a court. The methedos of the Israeli government seem to be unpopular eve to their own people.\n \n \n \nI think that the problem is that people are saying that the Palestinians are citizens of Israel and treating every Palestinian as such. However, they are mistaken in that there is generally an agreed upon difference between a militant and a civilian in terms of citizenship. For example, if there was a group of people in the United States who were plotting to overthrow it, using suicide bombers aimed at women and children, they would be committing treason and would forfeit many of the rights that are afforded to citizens. Granted that we grant a lot more rights to people living within our borders than Israel does, and so it is an imperfect example.\n\n \n So the fact that Israel openly imposes racist standards in granting citizenship and thus rights is some kind of defense?\n \n \nLook at intent. The Hamas group is working to achieve their aims through terror directed at civilians. If they directed their efforts toward the Israeli army or actual government, I might be more sympathetic. Yet when innocents are killed, on both sides, I tend to look at the other's point of view more. The Israelis have more of an excuse, as they use (semi) precision strikes to decapitate the leadership of the other's organization and end up causing collateral damage. The palestinians, on the other hand, actively try to increase such collateral damage.\n\n \n Using mortars is NOT a preicion strike. Granted in recent times they have switched to aircraft and cruise missiles, that hardly provides justification for murdering memebers of your own populations without benefit of trial. Put yourself in the palestenians situation. YOu cannot reasonably expect to be able to hit fortified military bases, and the leadership of israel is made up of absolute cowards who order strikes like this and then disapear from public view for several weeks to ensure that they are not killed, leaving their population to take the brunt of the retaliation for their murderous acts.\n \n While striking civilians is unarguably a poor thing to do, it has always been the method used by those who are unable to strike back at an unreahable government.", 
   {}, 
   40980, 
   null, 
   1080247260.0
  ], 
  [
   41054, 
   null, 
   "Broker", 
   "Oh, please. Don't try to play off the man's disability to make him sound more innocent. He founded the organization! My gosh... how can you say there's no proof? Listen to anything the man has ever said. :-\\ Hamas has claimed responsibilty for every suicide bombing during the recent period of conflict. He was the top leader of Hamas!\n \n How many of those Palestinians have the profile of Yassin? :-\\ Not very many. Completely different to arrest some low level guy on the street and the top man at the organization.\n \n What the heck do we have our military in Afghanistan for? We're killing all of those terrorists without convicting them in a court! Oh my gosh! What're we dropping bombs on them for? We haven't proven their links to al Qaeda!\n \n Are you going to tell me that that is somehow different? I get the feeling you will.", 
   {}, 
   41023, 
   null, 
   1080258420.0
  ], 
  [
   41085, 
   null, 
   "syklopps61", 
   "Of course, the Israelis could \"ethnically cleanse\" their country. Just start shooting the palestenians on a larger scale than they already are now.\n\n \n NOW you're catching on!!! LOL", 
   {}, 
   40942, 
   null, 
   1080275760.0
  ], 
  [
   41095, 
   null, 
   "daewoo", 
   "Oh, please. Don't try to play off the man's disability to make him sound more innocent. He founded the organization! My gosh... how can you say there's no proof? Listen to anything the man has ever said. :-\\ Hamas has claimed responsibilty for every suicide bombing during the recent period of conflict. He was the top leader of Hamas!\n\n \n IN the begining, Hamas was a political organisation, not a terrorist one. The last time he was arrested, he was released after promising not to be involved in the administration of any terrorist group. It appears that he has kept his word. HE WAS NOT the current leader of Hamas.\n \n He was assasinated because he was an icon for the palestenians. He was murdured for ideals, not actions.\n \n \n \nWhat the heck do we have our military in Afghanistan for? We're killing all of those terrorists without convicting them in a court! Oh my gosh! What're we dropping bombs on them for? We haven't proven their links to al Qaeda!\n\n \n \n In afghanistan we are using military tactics against recognised combatants in a designated combat zone. You don't see the difference between this and assasinating a civilian member of your population? Besides, it doesn;'t matter whether they are Al Queda or not if they are enemies of the current afghan government, which we are assisting. Measures that are considered acceptable on the field of battle are NOT always acceptable in civil law enforcement.", 
   {}, 
   41054, 
   null, 
   1080281520.0
  ], 
  [
   41175, 
   null, 
   "Gator", 
   "HE WAS NOT the current leader of Hamas.\nWhere did you get such a hair-brained notion? The entire international media recognized Yassin as top leader. Even Hamas itself considered Yassin the top man in their group, which is why al-Jazeera reported this week that \"Rantisi was elected on Tuesday as the supreme leader of Hamas in Gaza, replacing the slain Shaikh Yasin.\" Do you think you know more than Hamas about who leads their organization?\n \n \n \nThe last time he was arrested, he was released after promising not to be involved in the administration of any terrorist group.\nPromises, promises! Such naivete perhaps explains your bewilderment.\n \n \n \nHe was assasinated because he was an icon for the palestenians. He was murdured for ideals, not actions.\nSure he was icon, just as Arafat is an icon. But Yassin is dead, while Arafat lives, because such iconic status is not the reason he was hit. Arafat at least gives occasional lip service to the nebulous peace process, whereas Yassin makes no pretense in his public determination to kill every Jew he can. For the very same reason, al-Rantisi and Muhammad Deif are now at the top of Israel's hit list.\n \n \n \nIn afghanistan we are using military tactics against recognised combatants in a designated combat zone. You don't see the difference between this and assasinating a civilian member of your population?\nSuch thinking is muddled. First, you err in assuming that Yassin was a member of Israel's population. Rather, he was a resident of neighboring Gaza, not a citizen of Israel. Second, even if one does assume Yassin was a member of Israel's population, in Yassin's worldview there are no Israeli civilians, and since all Israelis are presumed combatants, your reference to killing \"a civilian member\" of the population is pointless.\n \n Turning now to your comparison of U.S. tactics in Afghanistan or Iraq vs Israeli tactics in the territories, you seem to think there's a marked distinction. In our war on terror, our fighters do their best to kill or arrest the enemy behind the violence perpetrated against us. Same as Israel! The enemy we fight does not wear uniforms. Same as Israel's enemy! The enemy we fight mingles with civilians and compromises their safety. Same as Israel's enemy. Really, I don't see a noteworthy difference, and since you neglected to explain yourself, perhaps you'll elaborate on your meaning.\n \n \n \nMeasures that are considered acceptable on the field of battle are NOT always acceptable in civil law enforcement.\nThere is no 'field of battle' apart from the towns and villages where the enemy finds shelter. And what is the role of 'civil law enforcement' when it comes to taking down al-Qaeda recruits, or Baathist insurrectionists, or Hamas operatives? When NY and DC were hit on 9-11, did you find our response was left to the police. Civil law enforcement certainly has a role in the fight against terror, but anyone can see that the heavy lifting is not done by civilians but by our military.", 
   {}, 
   41095, 
   null, 
   1080328560.0
  ], 
  [
   41186, 
   null, 
   "Gator", 
   "I think that the problem is that people are saying that the Palestinians are citizens of Israel\nYes, I've noticed some writers in this forum have that problem. I'm not sure why that is. The nomenclature used to be fairly simple. In 1948 when Israel was founded, Palestinian Jews began referring to themselves as Israelis. Palestinian Arabs residing within Israel's borders were called Israeli-Arabs. Palestinian Arabs residing under Jordanian and Egyptian occupation in the Gaza Strip, West Bank, and East Jerusalem gradually began to refer to themselves simply as Palestinians. The situation was a bit more confused after 1967 when Israel assumed the administration of East Jerusalem and gave Israeli identity cards to the residents there for the purpose of voting in municipal elections.\n \n \n \nthere is generally an agreed upon difference between a militant and a civilian in terms of citizenship.\nI never heard of such thing. Who are the parties to any such agreement that distinguishes between militants and civilians, and why would one's status as militant have any bearing on citizenship?\n \n \n \nFor example, if there was a group of people in the United States who were plotting to overthrow it, using suicide bombers aimed at women and children, they would be committing treason and would forfeit many of the rights that are afforded to citizens.\nI'm not clear if your discussion applies equally to Israel or just the U.S. In any event, I'm a little bit familiar with treason in U.S. law, since many people wondered whether John Walker (the American Taliban) would be charged with treason. He wasn't. Interestingly, treason is the only word that is specifically defined in the U.S. Constitution. The issue was an important matter of discussion among the Founding Fathers. The concept of treason in English common law had often been abused by the king. There was not only considerable debate at the Convention in Philadelphia, but also remarks in the ratifying conventions of the various states, as well as contemporaneous public comment. The final result makes clear that a restrictive concept of the crime was imposed. I'm not entirely certain, but I think that no charges of treason have been prosecuted in at least 50 years, since the WW2 era. As was the case with Walker a year or so ago, acts that might ordinarily be treasonable in nature are generally punished under a different label.\n \n In any event, a link to Section 3 of Article III of the Constitution is found here. It's concise, but note that Congress alone has the power to declare the punishment of treason.\n \n You noted above that treason is a sufficient cause of forfeiture of \"many of the rights that are afforded to citizens.\" Congress did deal with the question of punishment. Whoever is guilty of treason shall suffer death, or shall be imprisoned not less than five years and fined not less than $10,000; and shall be incapable of holding any office in the U.S. I'm not sure when Congress last revisited this section of the U.S. Code. It is found in Title 18: Section 2381.\n \n \n \nGranted that we grant a lot more rights to people living within our borders than Israel does, and so it is an imperfect example.\nDid you mean citizens instead of residents? Either way, I ask that you please provide specific examples of what you mean that people living in the U.S. have a lot more rights than people in Israel.", 
   {}, 
   41009, 
   null, 
   1080335400.0
  ], 
  [
   41219, 
   null, 
   "Broker", 
   "Gator said it about Yassin being leader...it's clear that he was.\n \n And Hamas still is a political group, too. It's both! That's how the Syrians are trying to get around kicking them out. The fact is that Hamas is also a terrorist group. So what if it's also political? That doesn't allow them to kill hundreds of innocent civillians.\n \n \n I see... because Israel doesn't recognize members of Hamas and other groups as combatants... right. Please, there's no difference. \n \n And Yassin isn't an Israeli citizen, is he? :-\\ Don't try to say they're all citizens of Israel, they aren't. Just as people in our territories haven't been considered citizens in the past...\n \n What is the difference between bin Laden's al Qaeda attacking us and Yassin's Hamas attacking Israel? Tell me that, that's what I want to know. What is the difference?", 
   {}, 
   41186, 
   null, 
   1080345420.0
  ], 
  [
   41227, 
   null, 
   "Gator", 
   "Bin laden is the head of a multinational terrorist organisation. This guy was a quadrapalegic that hey have not been able to prove conclusively is still invloved in the operational side of ANY terrorist organisation.\nThe \"operational\" side? So you're an apologist for terror who still fancies a distinction between field operatives and the administrators who fund and guide them. While it's true that most Western democracies onced fell for that phony distinction between a terrorist organization's \"military wing\" and \"political wing,\" you should note that the democracies have finally wised up. The U.S., Canada, and the EU no longer make such distinction. Get a hankie and shed a tear for the terrorists' fund-raising charities and bank accounts now shut down.\n \n Labeling Yassin as \"Israel's Bin Laden\" is an apt comparison. Both were the founders and funders of their respective organizations. It wasn't their role to dirty their hands in the field. Indeed, by your criteria we should simply leave Bin Laden alone, since he was merely an inspirational figure--what you call an icon--while the real military head of al-Qaeda was Khalid Shaikh Mohammed, the mastermind of the 9-11 attacks, as well as the U.S. embassy bombings in Africa. Sorry, it ain't gonna happen.\n \n \n \nAS far as it being so difficult/impossible to get him... They have simply quite trying.\nYou have no idea what you're talking about when you suggest the IDF can just slip into Gaza and arrest him. It's not like the six bodyguards killed in the attack were meant to protect him from a warrant for an outstanding parking ticket. Not only is there a heightened risk of IDF casualties, but the collateral damage to Palestinian civilians and property from such a ground operation would be many times greater than having used the Hellfire missiles. Either way, you're going to object to Israeli efforts to root out terror, no matter if Israel goes in by ground or by air. Still, it's curious that you prefer a tactic that is certain to cause greater destruction and suffering to innocent bystanders and their property.\n \n \n \nNOw, they find you objectionable enough they send their military to murder you.\nIndeed, that is sometimes exactly the way it is done. It's no different for our soldiers in Iraq. In Yassin's case, with IAF jets overhead to muffle the sound of the approaching choppers, he and his bodyguards never saw it coming. I don't think your alternative plan to arrest Yassin would have met with much cooperation from his Hamas bodyguards. On the other hand, in Marwan Barghouti's case two years ago--he was leader of Al-Aqsa Brigades--when the IDF first moved back into the West Bank they were able to trap him in a compound and force his surrender to save his life to stand trial. Every case proceeds on its own merits. \n \n \n \nPerhaps they don't think they could get these people convicted in a court. The methods of the Israeli government seem to be unpopular even to their own people.\nYou're just thinking out loud with no real basis for your comments. Contrary to your imagining, the newspaper polls in Israel on Tuesday showed around 60% of the people supported the killing of Yassin. There's no immediate concern with conviction in court. Administrative detention in the interim will be sufficient to keep him in jail.\n \n \n \nSo the fact that Israel openly imposes racist standards in granting citizenship...\nEvery nation imposes standards in granting citizenship, but to assert as 'fact' that Israel's standard is based on race is merely to display once again your poor fund knowledge regarding Israeli citizenship law. In our previous exchanges you have never once been willing to support such misstatements of 'fact' with credible evidence, but please feel free not to wimp out again.\n \n \n \nGranted in recent times they have switched to aircraft and cruise missiles, that hardly provides justification for murdering members of your own populations without benefit of trial.\nDo you mean to never learn something so simple as the fact that Sheikh Yassin was neither an Israeli, nor even a resident of Israel? Why do you persist in counting him among Israel's population? Even hearing the very name of Israel was enough to give him an allergic reaction, but (Praise Be Unto Allah) the Zionist entity did cure him. I don't read Arabic, but I assume here is a tribute to the man who was the brains behind the founding of Hamas. Scroll down at your own risk.\n \n \n \nPut yourself in the palestenians situation... While striking civilians is unarguably a poor thing to do, it has always been the method used by those who are unable to strike back at an unreachable government.\nThe Palestinian Arabs had no real need to pick a fight at all. The 'arguably best thing' to have done was to do as the Jews did: abide by the 1947 UN recommendation to live side-by-side in peace and economic cooperation. If the Palestinian leadership then had been willing to share the land, declare their own state alongside Israel in accordance with Res 181, and recognize the legitimate aspirations of Jews to live in their historic homeland as a free and independent people, then I think Arab Palestine would have developed into the most prosperous and free of all the Arab states. Even now, it may not be too late, but with groups around like Hamas, who sole purpose for existence is to annihilate the Jewish state, I don't suppose we'll get a chance to find out.", 
   {}, 
   41023, 
   null, 
   1080348480.0
  ], 
  [
   41235, 
   null, 
   "plotter", 
   "Ooooppppps, here we go again.\n \n Pro israeli propogandinist at it again. Firstly yassin was a spiritual leader, not an active member, he wasnt involved in anything, apart from offering spiritual guidance. yes he founded hamas, so what, he was perfectly entitled to create an organisation to defend his peoples rights. Agree with them or not, they are entitled to defend themselves.\n \n So israel sees him as an enemy, fine, so they assasinate him, fine too, but its also fine for pallestinians to assasinate any israeli they see fit. If israel sees it as morally right to assasinate, no murder, a person they feel is a threat to there security, then its also fine for pallestinians to murder any israeli they see as a threat to them. \n \n Now this may sound bad, but that also includes women and children, those children could be future soldiers that will kill pallestinians, women could bear children that could become soldiers that kill pallestinians. Pallestinians cant prove that every israeili child will become a soldier. And israel cant prove that yassin was directly involved in terrorist activity.\n \n Maybe someone should assasinate bush, he ordered the illegal murder of thousands of iraqis.", 
   {}, 
   41227, 
   null, 
   1080354840.0
  ], 
  [
   41243, 
   null, 
   "Broker", 
   "Yassin was the top man, not just spiritual leader. He was the overall head of the group. Fact. Period.\n \n Defense is not the murder of innocent, unsuspecting civillians. There is such a thing as acceptable civillian casualties in a war, but Hamas is actively targeting civillians. That is not defense, that is terrorism.\n \n Those comparisons are absurd. Israel is a sovreign state fighting because its citizens are being blown up or shot every other day, and their war is against terrorists. The Palestinians are not killed in that manner. The Israelis target terrorists and militants who are killing innocent people.\n \n If Hamas wants to only attack soldiers, that would be different. But they attack civillians.\n \n You act as if the Israelis run in and shoot out the Palestinians. That just doesn't happen. Why don't you go find out how many Palestinians have died in the FIGHTING. That excludes the camps and everything else, just combat. Now tell me, who has more deaths?\n \n As I said before, there is a difference between the intentional targetting of civillians and actively seeking them out.", 
   {}, 
   41235, 
   null, 
   1080357780.0
  ], 
  [
   41247, 
   null, 
   "plotter", 
   "Yassin was the top man, not just spiritual leader. He was the overall head of the group. Fact. Period.\n\n He was just a spritual leader, nothing else, he was stuck to a wheel chair how could he be a threat? If the isrealis didnt like what he preached then the israelis had the a problem with him. He was just a spiritual leader. Fact. Period.\n \n \nDefense is not the murder of innocent, unsuspecting civillians. There is such a thing as acceptable civillian casualties in a war, but Hamas is actively targeting civillians. That is not defense, that is terrorism.\n\n Hamas is not targeting any one but the illegal occupier of there lands. You quote it yourself, defence is not the murder of an innicent wheelchair bound old man.\n \n \nThose comparisons are absurd. Israel is a sovreign state fighting because its citizens are being blown up or shot every other day, and their war is against terrorists. The Palestinians are not killed in that manner. The Israelis target terrorists and militants who are killing innocent people.\n If Hamas wants to only attack soldiers, that would be different. But they attack civillians.\n\n No the comparisons are spot on, israel uses the latest weaponry, and they used it indiscriminately against pallestinian women and children, how many innocent women and children have been murdered by israeli soldiers targetting so called terrorists. thousands upon thousands of innocent pallestinians murdered.", 
   {}, 
   41243, 
   null, 
   1080358860.0
  ], 
  [
   41255, 
   null, 
   "syklopps61", 
   "Pro israeli propogandinist at it again. Firstly yassin was a spiritual leader, not an active member, he wasnt involved in anything, apart from offering spiritual guidance. yes he founded hamas, so what, he was perfectly entitled to create an organisation to defend his peoples rights. Agree with them or not, they are entitled to defend themselves.\n\n \n LMAO, spiritual leader? Pro-Arab propaganda at it's finest!! What kind of spiritual guidance to a bunch of murderous thugs require may I ask?\n \n \nSo israel sees him as an enemy, fine, so they assasinate him, fine too, but its also fine for pallestinians to assasinate any israeli they see fit. If israel sees it as morally right to assasinate, no murder, a person they feel is a threat to there security, then its also fine for pallestinians to murder any israeli they see as a threat to them. \n \n \n Please attempt to at least give the appearance of being rational! Using your argument, Israel then has the right to kill any and all Palestinians...HMMMM but WAIT, they HAVEN'T, have they? No, Israel selects targets that are of significance and yes, assassinates them. Yes, there are innocents that are occasionally killed, but they are not the intended target. Palestinians indisctiminately kill ANY Israeli that happens to be just living their life (no matter how worthless you may think it is).\n \n \nMaybe someone should assasinate bush, he ordered the illegal murder of thousands of iraqis.\n[/QUOTE]\n \n I WOULD say that it should be YOU instead of Bush, but you aren't even worth the bullett", 
   {}, 
   41235, 
   null, 
   1080362160.0
  ], 
  [
   41262, 
   null, 
   "SilentPoet", 
   "Hello.\n I'm participating much earlier than I expected. But I will stick to this thread. \n All who reply to this:\n Please excuse delays in my responses and if you feel you have been wating to long feel free to email me: BlindArtist326@netscape.net\n \n I'd like to express my view of the IDF strike that killed Yassin. As some of you may know I support Israel. \n I was displeased with the killing of Yassin..... it should have been done long ago. Yassin was a terrorist leader. He advocated and religiously vindicated terrorist acts that left hundreds of innocent men, women and children dead. \n A terrorist is a terrorist and he deserved to die just as Osama does. \n If the USA had a chance at killing Osama we would grab it. There would be no hesitation. Furthermore we should realize there would be no great condemnation from the world community. \n \n Speaking of the world community.\n They sicken me. I'm sick of the UN and have long lost all respect for them. They have earned my hatred. They wanted to keep the Iraqi people under oppressive rule, Arafat protected and now they wish to condemn the only free country in the middle east for protecting its citizens and delivering justice.\n Every world leader (with the exception of the US) has called the killing of Yassin \"horrific\" \"disturbing\" and Kofi Annan went as far as to call it \"contrary to international law\". \n Can not one world leader stand up and point out the obvious double standard given to Israel. Israel like every other country has the right to confront terrorism and eleminate terrorists. \n The US can invade Afghanistan in seek of justice and the world stands behind them but when Israel launches a missle and kills a terrorist leader the world condemns them? How dare they. Its illogical and ridiculous. \n \n I have heard those who disagree with me say \"but Israel only acheived delaying the peace process\". And I say to you: You fools. There was no peace process in action. Only within the past weeks a suicide bombing killed innocent people. Where was this rush to condemn such an action? \n With such actions constantly taking place there can be no peace. Its a complete contradiction to the idea. With terrorists such as Yassin and Arafat holding primary positions and influence there will be no peace and no negotiations.\n Hammas' well known goal was the destruction of Israel and the killing of Jews. The PLO and PA refused to act against them. What is Israel to do?\n \n Thats all for now...", 
   {
    "post_info": {
     "post_title": "In Defense of Israel"
    }
   }, 
   41255, 
   null, 
   1080365700.0
  ], 
  [
   41265, 
   null, 
   "daewoo", 
   "The \"operational\" side? So you're an apologist for terror who still fancies a distinction between field operatives and the administrators who fund and guide them. While it's true that most Western democracies onced fell for that phony distinction between a terrorist organization's \"military wing\" and \"political wing,\" you should note that the democracies have finally wised up. The U.S., Canada, and the EU no longer make such distinction. Get a hankie and shed a tear for the terrorists' fund-raising charities and bank accounts now shut down.\n\n \n So, the IRA and the RIRA are the same thing? YAssin was a spiritual leader, a figurehead, nothing more. YOu really think this guy was planning attacks and organising fundraisers?\n \n \nLabeling Yassin as \"Israel's Bin Laden\" is an apt comparison. Both were the founders and funders of their respective organizations. It wasn't their role to dirty their hands in the field. Indeed, by your criteria we should simply leave Bin Laden alone, since he was merely an inspirational figure--what you call an icon--while the real military head of al-Qaeda was Khalid Shaikh Mohammed, the mastermind of the 9-11 attacks, as well as the U.S. embassy bombings in Africa. Sorry, it ain't gonna happen.\n\n \n Bin laden is apparently actively involved in plannig attacks and organising Al Queda. The same can not be said for Yassin, whose biggest contribution to Hamas in recent years seems to be leading prayer services.\n \n \nYou have no idea what you're talking about when you suggest the IDF can just slip into Gaza and arrest him. It's not like the six bodyguards killed in the attack were meant to protect him from a warrant for an outstanding parking ticket. Not only is there a heightened risk of IDF casualties, but the collateral damage to Palestinian civilians and property from such a ground operation would be many times greater than having used the Hellfire missiles. Either way, you're going to object to Israeli efforts to root out terror, no matter if Israel goes in by ground or by air. Still, it's curious that you prefer a tactic that is certain to cause greater destruction and suffering to innocent bystanders and their property.\n\n \n Again, you are conveniently forgetting that they have captured him before. Yes, it would have been riskier to the Israelis to capture him so he could be properly tried. NO, this is not a good excuse for them to use such tactics. IT would have been safer for ATF agents to shell the Branch Dividians from the next county. NO, they did not do this because it is just not how civilized people conduct themselves.\n \n \nIndeed, that is sometimes exactly the way it is done. It's no different for our soldiers in Iraq. In Yassin's case, with IAF jets overhead to muffle the sound of the approaching choppers, he and his bodyguards never saw it coming. I don't think your alternative plan to arrest Yassin would have met with much cooperation from his Hamas bodyguards. On the other hand, in Marwan Barghouti's case two years ago--he was leader of Al-Aqsa Brigades--when the IDF first moved back into the West Bank they were able to trap him in a compound and force his surrender to save his life to stand trial. Every case proceeds on its own merits. \n \n \n The acts of pathetic cowards can rarely be justified, and certainly cannot in this case. As I stated above it would certainly have been more difficult to capture him than it was to simply murder him. \n \n \nYou're just thinking out loud with no real basis for your comments. Contrary to your imagining, the newspaper polls in Israel on Tuesday showed around 60% of the people supported the killing of Yassin. There's no immediate concern with conviction in court. Administrative detention in the interim will be sufficient to keep him in jail.\n\n \n It wasn;t that long ago that over 100,000 israelis jews took to the streets (at least according to the media) to protest the actions of the current administration.\n \n Keep who in jail? Yassin? They killed him, I certainly hope they didn;t pick up the bits and pieces and put them in administrative detention.\n \n \nEvery nation imposes standards in granting citizenship, but to assert as 'fact' that Israel's standard is based on race is merely to display once again your poor fund knowledge regarding Israeli citizenship law. In our previous exchanges you have never once been willing to support such misstatements of 'fact' with credible evidence, but please feel free not to wimp out again.\n\n \n \"Following the mass exodus and displacement of the indigenous Palestinian Arab population in 1948, Israel adopted discriminatory citizenship, nationality and residency laws that effectively denationalized Palestinian refugees and prevented them from returning to their places of origin. Citizenship and nationality in Israel is based on a two-tier system, one for Jews and the other for &#8216;non-Jews.&#8217; On the one hand, any Jew can acquire automatic citizenship and residency, based on the notion of &#8216;historical residence,&#8217; under the 1950 Law of Return. The law grants all Jews, regardless of their national origin or citizenship, the right to citizenship and residency in Israel. \n \n On the other hand, the indigenous Palestinian Arab population including refugees must be able to prove (among a list of 5 conditions for those born before the establishment of the state of Israel and 3 conditions for those born after) that they were in the state of Israel on or after 14 July 1952, or the offspring of a Palestinian who meets this condition. Due to the fact that most Palestinian refugees were displaced outside the borders of the state of Israel on or after 14 July 1952, they are unable to resume domicile in their homeland. In practice, naturalization only occurs in extraordinary cases. Israeli citizenship is almost never granted to non-Jews. \"\n \n THe cato institute has a pretty good article about it on their page at http://www.cato.org/dailys/03-23-04-2.html\n \n \nDo you mean to never learn something so simple as the fact that Sheikh Yassin was neither an Israeli, nor even a resident of Israel? Why do you persist in counting him among Israel's population? Even hearing the very name of Israel was enough to give him an allergic reaction, but (Praise Be Unto Allah) the Zionist entity did cure him. I don't read Arabic, but I assume here is a tribute to the man who was the brains behind the founding of Hamas. Scroll down at your own risk.\n\n \n Really? I was under the impression that he was born in Ashkelon in either 1929 or 1938 (passport says 29, he claims 38) where they lived unil 1948, when they were forced out during the creation of the state fo israel. After that he lived in gaza refuge camps. I also thought he was killed in Gaza city, whihc I believe is located in te Gaza strip, whihc to the best of my knowledge is part of the occupied territories. Yes, I am almost certain of it. YOu can take a look at http://www.cia.gov/cia/publications/factbook/geos/gz.html it is the CIA world factbook and does some expalining about the region, such as where it is.\n \n Not exactly a tribute, though definatly supportive. You should really learn to read/speak arabic and hebrew if you are going to try to undersand these things, unless of course you are just in it for the gory pictures. You get a lttle different perspective when you actually look at the news coming directly from both sdes, as opposed to traslated clips in english speaking media.\n \n \nThe Palestinian Arabs had no real need to pick a fight at all. The 'arguably best thing' to have done was to do as the Jews did: abide by the 1947 UN recommendation to live side-by-side in peace and economic cooperation. If the Palestinian leadership then had been willing to share the land, declare their own state alongside Israel in accordance with Res 181, and recognize the legitimate aspirations of Jews to live in their historic homeland as a free and independent people, then I think Arab Palestine would have developed into the most prosperous and free of all the Arab states. Even now, it may not be too late, but with groups around like Hamas, who sole purpose for existence is to annihilate the Jewish state, I don't suppose we'll get a chance to find out.\n\n \n Surely this is a joke, right? \n \n It is pretty clear why Israel chose to assasinate Yassin, and why they chose to do it now. They have agreed to a withdrawal of forces from the gaza strip and to turn over ruling authority to the Palesteniain authority. They have attached a condition to this, namely that the PAlestenian authority clamp down on attacks. A while back, Arrafat was in a position to do so, and even issued several public statements calling for an end to attacks. Shortly after, Arrafat was attacked and his authority weakened to the point thta he could no longer control the militants. THe palestenian Authority has worked vary hard to gain some degree of control in regards to these groups. Of late it has appeared that they had a good chance of being able to deliver on Israels condition. \n \n Now, Israel does not want to pull ou of Gaza, and they don't want the attacks to stop. Israel is a worthless land with few natural resources and no real chance of developing any type of decent industrial complex. Gaza, on the other hand, is capable of being self sustaining due to their centuries old olive market. Israel needs to hold onto gaza, and needs the attacks to continue so they can continue to recieve billions of dollars in welfare from the US. Do you really think that the US government could justify spending so much money on a worthless country that will never be capable of sustaining itself if they weren;t able to cite the terrorist attacks as a reason for aid?\n \n Facing the loss of the only protion of Israel which is inherently profitable, and the possibility of reduced US welfare, they did the only logical thing, which was to murder an old spiritaul leader so they could ensure that the attacks would continue.", 
   {}, 
   41227, 
   null, 
   1080369180.0
  ], 
  [
   41273, 
   null, 
   "Broker", 
   "See, there you go again. JUST BECAUSE YOU ARE IN A WHEELCHAIR DOES NOT MAKE YOU ANY LESS A MURDERER. My gosh... if bin Laden was in a wheel chair it makes me wonder if you would be attacking the US for making hide in caves. :-\\ He's been in the wheel chair since he was a child. Why is al Jazeera and all the other news organizations reporting that he was head of the organization then? A massive lie? Why is Hamas saying that they elected the new guy as their top leader? If Yassin wasn't him where did the top leader go?\n \n *Big grin* You know that Yassin just recently when on a huge fundraising tour of the Middle East, do you not? In 1998 he visited Iran, Saudi Arabia, and many other nations seeking money to continue his jihad. He raised 100 million dollars in those two countries alone. So to answer your question, yes, he was actively involved in fundraising. I think you need to read up more on Yassin...\n \n Oh, really? That woman and her baby are the illegal occupiers of Palestinian lands? That is not military target. I said before that military targets are different. They don't target the military, they target innocent civillians.\n \n I am so sick of this myth that Israel is the big bad wolf. Jordan holds 77% of historic Palestine. Jordan is 75% Palestinian. Jordan was created as the Palestinian state. Why in the world isn't Hamas attacking the real occupier of Palestinian lands? Because they aren't Jewish?\n \n When you stack up CONFLICT deaths of innocent civillians the Israelis are the ones hard hit, not the Palestinians. Again, another myth--that more innocent Palestinians die. To use your words, the Israelis are equipped with the latest technology. It's quite misleading to count a Palestinian who pointed a rifle at an Israeli soldier as an innocent civillian killed.", 
   {}, 
   41265, 
   null, 
   1080373980.0
  ], 
  [
   41446, 
   null, 
   "plotter", 
   "LMAO, spiritual leader? Pro-Arab propaganda at it's finest!! What kind of spiritual guidance to a bunch of murderous thugs require may I ask?\n \n \n \n Please attempt to at least give the appearance of being rational! Using your argument, Israel then has the right to kill any and all Palestinians...HMMMM but WAIT, they HAVEN'T, have they? No, Israel selects targets that are of significance and yes, assassinates them. Yes, there are innocents that are occasionally killed, but they are not the intended target. Palestinians indisctiminately kill ANY Israeli that happens to be just living their life (no matter how worthless you may think it is).\n \n \n\n \n I WOULD say that it should be YOU instead of Bush, but you aren't even worth the bullett[/QUOTE]\n \n Ho Ho, no im not worth a bullit, but im worthy of your time and effort for a response.", 
   {}, 
   41255, 
   null, 
   1080577440.0
  ], 
  [
   41483, 
   null, 
   "Ghost", 
   "Israelis do try to minimize civilian damage mostly, an dthey do use surgical strikes and assasinations, which is exactly what they should do. The Palestinians do kill any Israeli they can.\n \n The Palestinians feel like their land was stolen by and their livelihood was wrecked by invading Jews...which in a way is exactly what happened. I don't think it's right that Israel was created on top of Palestine and then the Palestinians were given the boot (let's try not to make anything which may be misconstrued as anti-semitic comments here, people have a phobia of that). The Israelis want security in a land which is not rightfully theirs, and the Palestinians want their own homeland back. I can sympathise with the Palestinian cause. That's also irrelevant. Israel exists, and it's not going anywhere. Likewise, the Palestinians are there, and they're not going anywhere either. The Palestinians do have a legitimate cause, they just don't go about it in a legitimate way. Suicide bombing and killing of innocents is disgusting, it needs to stop if there is a hope of peace.\n \n I think, unfortunately, that after they're done with all of the idiotic dancing, chanting, and waving AKs in the street, the Palestinians will strike back, and hard. Then Israel will retaliate for it's dead civilians, but that'll XXXX off the Palestinians, so they'll hit Israel...no :xcensored this problem perpetuates itself.", 
   {}, 
   41446, 
   null, 
   1080586260.0
  ], 
  [
   41510, 
   null, 
   "remrem", 
   "I don't condone Yassin's actions in the past or the fact that he helped further the violence. However I do think his assassination will have negative effects, contrary to the effects that greater Israel is looking for. I have a new website, poeticinjustice.net, that talks about the Palestinian/Israeli conflict along with American domestic politics and societal issues. Check it out. I have a forums page as well. Take care\n \n Remi", 
   {}, 
   41265, 
   null, 
   1080594780.0
  ], 
  [
   41532, 
   null, 
   "Broker", 
   "I missed one of your earlier posts, Plotter. Don't know how, but I'd like to dissect it.\n \n Israel gets only 3% of its GDP from agriculture. Let alone olives... they are in no way dependent on olives. ISRAEL, not Gaza or the other territories, has been very successful in agriculture. The only thing they import really is wheat. They export other things they produce.\n \n Israel's economy is primarily based on high technology (medical, CAD, aviation, communications). 97% of its GDP comes from services and industry. They have more researchers than any other nation per capita. \n \n ____________________\n \n You say Arafat has no control? Absurd. Arafat always condemns in English. The statements in Arabic are different. Arafat could stop all of this at any time he wished with a statement and telling his forces to stop it. He won't.\n \n And just so you know... Sharon didn't drop the plan to pull out of Gaza. He's still trying to push it and his party is now in serious danger because most people want the violence to stop before Israel pulls out of its territory. He has not dropped the plan.\n \n __________________\n \n Do you really think another Palestinian state would solve anything? Of course it wouldn't.\n \n What would happen? Without Israel to police Palestine would become Terrorist Headquarters, Inc. Every group out there would be rushing in, paying the state so they wouldn't have to leave, and being able to start a new jihad against Israel to boost their popularity and get money for their operations.\n \n Then what happens? The terrorists start sneaking across the border every day, group after group, bomb after bomb, shots being fired everywhere at everyone. And Israel could not enter Palestine to do anything about what was happening. They couldn't kill those conspiring to get them (at first I used plotters... but I don't want someone getting paranoid. ;)), they couldn't bomb the bomb factories, and they couldn't raid.\n \n Now tell me how many people die then? 100 a day? 200 a day?\n \n Anyone who thinks this is over that little plot of land is way out there. The Palestinians already have a state that is four or five times what they want from Israel. Do you really think that's the issue? Of course it isn't. Giving them what they want only shows them that they can have anything they want if they kill enough people.", 
   {}, 
   41510, 
   null, 
   1080603000.0
  ], 
  [
   41543, 
   null, 
   "plotter", 
   "I missed one of your earlier posts, Plotter. Don't know how, but I'd like to dissect it.\n \n Israel gets only 3% of its GDP from agriculture. Let alone olives... they are in no way dependent on olives. ISRAEL, not Gaza or the other territories, has been very successful in agriculture. The only thing they import really is wheat. They export other things they produce.\n \n Israel's economy is primarily based on high technology (medical, CAD, aviation, communications). 97% of its GDP comes from services and industry. They have more researchers than any other nation per capita. \n \n ____________________\n \n You say Arafat has no control? Absurd. Arafat always condemns in English. The statements in Arabic are different. Arafat could stop all of this at any time he wished with a statement and telling his forces to stop it. He won't.\n \n And just so you know... Sharon didn't drop the plan to pull out of Gaza. He's still trying to push it and his party is now in serious danger because most people want the violence to stop before Israel pulls out of its territory. He has not dropped the plan.\n \n __________________\n \n Do you really think another Palestinian state would solve anything? Of course it wouldn't.\n \n What would happen? Without Israel to police Palestine would become Terrorist Headquarters, Inc. Every group out there would be rushing in, paying the state so they wouldn't have to leave, and being able to start a new jihad against Israel to boost their popularity and get money for their operations.\n \n Then what happens? The terrorists start sneaking across the border every day, group after group, bomb after bomb, shots being fired everywhere at everyone. And Israel could not enter Palestine to do anything about what was happening. They couldn't kill those conspiring to get them (at first I used plotters... but I don't want someone getting paranoid. ;)), they couldn't bomb the bomb factories, and they couldn't raid.\n \n Now tell me how many people die then? 100 a day? 200 a day?\n \n Anyone who thinks this is over that little plot of land is way out there. The Palestinians already have a state that is four or five times what they want from Israel. Do you really think that's the issue? Of course it isn't. Giving them what they want only shows them that they can have anything they want if they kill enough people.\n\n Ermm Broker, i never made a post such as the one above, i think you got me mixed up with someone else.", 
   {}, 
   41532, 
   null, 
   1080607500.0
  ], 
  [
   41544, 
   null, 
   "Broker", 
   "Whoops... mixed up usernames there. Well, easy to confuse... you both argue the same direction. ;)", 
   {}, 
   41543, 
   null, 
   1080607620.0
  ], 
  [
   41549, 
   null, 
   "plotter", 
   "Whoops... mixed up usernames there. Well, easy to confuse... you both argue the same direction. ;)\n\n Really, what direction is that?\n \n Listen, what most people would like to see, including myself, is a fair solution, i dont know where youve been getting your information from, but its obvious from your posts that you really dont know much about the situation there, the arabs want just equal rights and equal opportunitys, the right to live without fear or prejudice.\n \n The israelis, not all, are keeping them suppressed, they deny them there basic human rights, a right to govern themselves, just think about it for a second, if you were treated as a second class citizen, wouldnt you want to fight for your rights, of course you would.\n \n Ive been there ive seen it, i know and understand both sides of the story, jewish fears and pallestinian anger, its all there, but the israelis are just as much to blame as the pallestinians, in fact more so.\n \n Dont listen to the propoganda, if you can, go there, and im 100% sure you will understand the situation of the palestinians, and you will understand why, they do what they do.", 
   {}, 
   41544, 
   null, 
   1080609240.0
  ], 
  [
   41553, 
   null, 
   "Broker", 
   "The Palestinians who stayed in Gaza and the West Bank had their chance to leave and they didn't. From my standpoint there should be zero controversy. There should not even be a Palestinian Authority. Just as we took lands in wars we've one, so did Israel. \n \n And the only controvery left is the Golan Heights, which Israel and Syria have never resolved. Jordan let the West Bank go. Egypt let Gaza go. So be it, it's done. That's Israeli territory now, the people who controlled the territory dropped their claim to it.\n \n Can I buy a plot of land and leave the United States to create my own country? Hmm?\n \n When people denounce Israel for defending itself it makes me angry. It's hypocritical of everyone who does it. If these nations were losing hundreds of citizens every year (let alone hundreds in a nation of only 6 million) they would be in all out war against the people doing it. It's not one bombing, it's not one shooting, it's every single day. To have your people die from terrorism almost every single day... and to know where the terrorists are and where they're making the weapons and to be denounced for acting is absurd.\n \n It seems like everyone who had seen it and understands both sides of the story has a different viewpoint. That's not much of an argument.", 
   {}, 
   41549, 
   null, 
   1080610980.0
  ], 
  [
   41559, 
   null, 
   "plotter", 
   "The Palestinians who stayed in Gaza and the West Bank had their chance to leave and they didn't. From my standpoint there should be zero controversy. There should not even be a Palestinian Authority. Just as we took lands in wars we've one, so did Israel. \n\n Just goes to show how biased you are, and i have to say, you are also uninformed of the situation, just listen to your self, \n \"The Palestinians who stayed in Gaza and the West Bank had their chance to leave and they didn't\"\n WHY should they leave there homes? would you leave your home? be serious for a minute, if some stranger told you to leave your home would you tuck your tail between your legs and go, or would you stay and fight for your home. I dont know about you, but ill stay and fight, and thats what the pallestinians are doing.\n \n Interesting how you have not responded to the rest of my post, maybe you simply cant.\n \n On a final point, what wars that youve won?", 
   {}, 
   41553, 
   null, 
   1080611640.0
  ], 
  [
   41561, 
   null, 
   "Broker", 
   "The vast majority of the population did leave rather than be under Israeli control. That's a fact.\n I wouldn't want to leave me home, true. But once your nation capitulates and makes peace you either go back home or you stay in a territory under someone else's control. It's a difficult choice to make, yes.\n \n The only reason all of this has been so difficult is because the Palestinians have fought. Israel has had to wall up and tightly control the territories to protect its people. How sad! The Palestinians are their own worst enemies. All these years they have fought and fought and fought, yet they are 100% completely dependent on the Israelis for survival. If Israel cut off the borders everyone would starve and die.\n \n As for being treated as second class citizens... you must be referring to those in the territories. The Palestinian Authority assumed the duties of making those lives better when it was created.\n \n 20% of Israelis are Arabs. 12% of the voters are Arabs. One out of five Israelis is being treated as a second class citizen? Those who can vote are just happily taking it?", 
   {}, 
   41559, 
   null, 
   1080612420.0
  ], 
  [
   41564, 
   null, 
   "plotter", 
   "The vast majority of the population did leave rather than be under Israeli control. That's a fact.\n I wouldn't want to leave me home, true. But once your nation capitulates and makes peace you either go back home or you stay in a territory under someone else's control. It's a difficult choice to make, yes.\n \n The only reason all of this has been so difficult is because the Palestinians have fought. Israel has had to wall up and tightly control the territories to protect its people. How sad! The Palestinians are their own worst enemies. All these years they have fought and fought and fought, yet they are 100% completely dependent on the Israelis for survival. If Israel cut off the borders everyone would starve and die.\n \n As for being treated as second class citizens... you must be referring to those in the territories. The Palestinian Authority assumed the duties of making those lives better when it was created.\n \n 20% of Israelis are Arabs. 12% of the voters are Arabs. One out of five Israelis is being treated as a second class citizen? Those who can vote are just happily taking it?\n\n \n Broker, there you go, your in a way agreeing with me. The arabs have not capitulated thats why they are still fighting. Why are they fighting?\n \n Israel controls them, and so makes them second class citizens, thats why.\n \n Broker, you really have no idea do you, i would bet you have all your information from either israeli friends or right wing propoganda sources, just think for yourself for a second, why would someone be prepared to die for there cause, because they have nothing else, its all been taken from them, thats why you have pallestinian suicide bombers.\n \n All they want is a right to govern themselves, all they want is freedom, something americans enjoy and thats ok, but not for anyone else.", 
   {}, 
   41561, 
   null, 
   1080613260.0
  ], 
  [
   41566, 
   null, 
   "daewoo", 
   "The only reason all of this has been so difficult is because the Palestinians have fought. Israel has had to wall up and tightly control the territories to protect its people. How sad! The Palestinians are their own worst enemies. All these years they have fought and fought and fought, yet they are 100% completely dependent on the Israelis for survival. If Israel cut off the borders everyone would starve and die.\n\n \n How do you figure? There is a reason Israel wants those territories. They want the olive groves, whihc provide more income to the state of Israel than the rest of he country combined. Again (in case you missed in the umpteen other times I have pointed it out), Israel is pretty much a vast, worthless expanse of land. The ONLY profitable agricultural enterpirse is the olive market and the olive oil market. Whikle that may not seem like a big deal to the US, when it is the ONLY portion of your economy where you are not operating under a trade deficit, it becomes a big deal.\n \n \nAs for being treated as second class citizens... you must be referring to those in the territories. The Palestinian Authority assumed the duties of making those lives better when it was created.\n\n \n The palestenian authority cannot do this without funding or power of taxation, which Israel has denied them. \n \n \n20% of Israelis are Arabs. 12% of the voters are Arabs. One out of five Israelis is being treated as a second class citizen? Those who can vote are just happily taking it?\n\n \n There isn't a whole lot you can do with 12% of the vote. \n \n Luckily, it looks like Sharon will be indicted and be forced to step down. Once he is gone, the biggest obstacle to peace in the region will be gone. If not, we can only hope he will be assasinated.", 
   {}, 
   41561, 
   null, 
   1080614220.0
  ], 
  [
   41569, 
   null, 
   "Broker", 
   "Plotter:\n You make it sound as if Israel doesn't have to close down the territories. That's just not reality.\n \n It's not Israel's fault that the Palestinians wanted to manage their own affairs. They wanted the Palestinian Authority and it was created. That's their own problem to deal with.\n \n I have never met or spoken to anyone that I knew was an Israeli. Chances are I have never spoken to one at all. Nor have I spoken to a Palestinian. I am basing my opinions on the facts and my own obervations. Quit with the propaganda... what propaganda? Give me some specifics.\n \n \n \n Daewoo:\n First, sorry for confusing you and Plotter. You two mix around in my mind...\n \n I addressed this earlier. 97% of Israeli GDP comes from SERVICES AND INDUSTRY. AGRICULTURE, not olives specifically, accounts for only 3% of GDP. Israel is a big exporter of food products. Very little of that 3% of GDP is olives. How can you deny this? :-\\ \n \n Heh, there's nothing to tax. Palestinians don't make money in \"Palestine\" they make it in Israel.\n \n That 12% can decide an election. Israelis have been very divided recently on where to go. \n \n Remember that the Israelis elected Sharon knowing he was the hardliner. And they elected him in a landslide. The Israelis want someone to stop the violence, and I'm afraid of what might happen if they go for someone more of a hardliner than Sharon.", 
   {}, 
   41566, 
   null, 
   1080615360.0
  ], 
  [
   41587, 
   null, 
   "remrem", 
   "Broker:\n \n You state roughly before that, \"Israel has taken over these territories through means of war- so be done with it, Israel is now the land owner.\" But if that line of thinking is true, then the Palestinians can say \"Hey, the war isn't over and we are killing your women and children through methods of war.\" If war is war, then how's it wrong for Hamas and Islamic Jihad to what it's doing. Your words only continue and feul the cycle of violence.", 
   {}, 
   41569, 
   null, 
   1080627000.0
  ], 
  [
   41588, 
   null, 
   "Robbie", 
   "Just thought I'd toss this article from WorldNetDaily in.\n \n \n\n The satanic sheik and the enablers of evil\n Posted: March 26, 2004\n 1:00 a.m. Eastern\n \n © 2004 WorldNetDaily.com\n \n Nothing about Sheikh Ahmed Yassin, founder of Hamas, the Murder Inc. of the Middle East, was divinely inspired. Contrary to the descriptions, Yassin was not the Dalai Lama of Gaza. Yet this wicked bag of bones was - and still is - labeled as a \"spiritual leader.\"\n \n To call him a \"moderate\" is no less of a misrepresentation, unless one is referring to unforeseen developments in theology. This (now gratefully) dead yahoo had deigned to accept a Palestinian state in the West Bank and Gaza - only if it were to be used as a temporary base to destroy Israel.\n \n Both al-Qaida and the native Palestinian terror networks are comprised of killers who target innocent non-combatants. Their mission and tactics are identical. Yet al-Qaida is referred to appropriately and almost unanimously in the media as \"a terrorist network,\" and its capo di tutti capi - bin Laden - is dubbed \"Public Enemy No. 1.\" Yet, Hamas - the organization that pioneered and perfected the diabolical \"suicide attack\" - is mostly given a free pass in news reports.\n \n Hamas' ghastly acts are seldom spoken of as \"terrorism,\" or its agents of death as \"terrorists.\" The Agence France-Presse went so far as to finesse a recent Hamas bloodbath as \"a joint operation carried out by hardline Palestinian groups\" (emphasis mine). When describing Palestinian terrorists, the American media generally prefer such labels as \"suicide attacks\" or \"suicide bombings.\" These are invariably committed by \"militants,\" not murderers - tough guys, not terrorists.\n \n Since September 2000, Hamas has murdered 377 \"Israelis,\" wounding over 2,000 more. Members of the press like the unqualified term, \"Israelis.\" It exempts them from reporting that the slaughtered are all innocent civilians. Which is exactly the point.\n \n In \"The Case for Israel,\" Alan Dershowitz, Harvard law professor and indefatigable civil libertarian, elucidates the moral components of the vortex of terror and counterterror, action and reaction into which the Palestinians have plunged Israel. He observes that the number of innocent Israelis killed intentionally by Palestinians is considerably higher than the number of innocent Palestinians who have been killed accidentally by the Israel Defense Force.\n \n The vast majority of Palestinians killed by Israelis are directly involved in terrorist activity. Those not directly involved were killed accidentally in the course of legitimate military actions against terrorists. \"Israel's moral responsibility for these accidental, although often foreseeable, casualties of war,\" he avers, \"is in no way comparable to the responsibility of Palestinian terrorists who have deliberately targeted every single Israeli civilian victim.\"\n \n This distinction, one would presume, is a no-brainer: \"Every reasonable school of philosophy, theology, jurisprudence and common sense distinguishes between deliberately targeting civilians and inadvertently killing civilians while targeting terrorists who hide among them\" (emphasis mine). Nevertheless, anti-Zionist bigots, who understand the difference between accidental death and willful murder in \"other contexts,\" embrace moral relativism when it comes to the Jewish state.\n \n Professor Dershowitz makes one other particularly chilling observation:\n \n Israel has nothing to gain and everything to lose from inflicting civilian casualties. The opposite is true for the Palestinian terrorists. Palestinian casualties play in their favor, and Israeli casualties play in their favor.\n \n Indeed, the reason quite a few pundits, the United Nations and other masters of moral equivalence look benignly on those who target Israelis with \"anti-personnel bombs made of nails soaked in rat poison\" is (partly) that they blame Israel for Palestinian depravity. Thus, when Hamas or the Al-Aqsa Martyrs Brigades kills innocents, the \"civilized\" world mitigates their monstrosities with root-causes rhetoric, thus nurturing the soil for further flowers of evil.\n \n This is to be expected from liberals. They are, after all, determinists who reject personal responsibility. To such flaming Freudians, traumatic toilet training is a sufficient justification for anything. But what excuse do those on the far right and on the (often far-out) libertarian side have? These factions pretend to have a coherent philosophy, central to which are free will and personal responsibility - except when it comes to their precious Palestinians.\n \n Members of the Jews-Control-America crowd, in particular, have lost their moral bearings completely and go so far as to call Palestinian terrorists \"freedom fighters.\" In doing so, they have adopted the post-modernist leftist view of morality as a \"cultural construct.\" Ask any liberal, and he'll tell you: Historical baggage exempts the \"oppressed\" forever from being held to the same standards as other (non-murderous) mortals.\n \n In addition to their international exculpators, Palestinians reward their terrorists for the massacres they perpetrate. The residents of the West Bank and Gaza house, hide and canonize killers as \"martyrs.\"\n \n Conversely, Israeli soldiers who are implicated in the accidental death of civilians face a critical public. Unlike the Palestinians, whose politics are nothing more than genocide, Israel is a moral society. Israeli soldiers must answer to military boards of inquiry. Israel is blessed with a free (and mostly liberal media). And, incredibly, a great many Israelis are sympathetic to the Palestinian cause.\n \n Yassin's ghoulish \"spirit\" guided many an atrocity. His assassination was not in breach of international law - it was not an \"extra-judicial killing.\" \"Under international law and the laws of war,\" Professor Dershowitz reminds us, \"it is entirely legal to target and kill an enemy combatant who had not surrendered. Nor need he be given the opportunity to surrender.\"\n \n Is the utility of the Yassin assassination a legitimate subject for debate? Certainly. But can we debate its justice? Only if we are prepared to grant the late Sheikh Yassin legitimacy he in no way deserves. \n\n \n Lot of good posts, I think the best in this thread was the article on the first page regarding the effect of Isreal's targeting of terrorist leaders. Quite an effect... It's an excellent arguement on the utility of assasinations like Yassin's.", 
   {
    "unicode_changes_made": true
   }, 
   41569, 
   null, 
   1080627120.0
  ], 
  [
   41592, 
   null, 
   "The_Comedian", 
   "Yassin's ghoulish \"spirit\" guided many an atrocity. His assassination was not in breach of international law ? it was not an \"extra-judicial killing.\" \"Under international law and the laws of war,\" Professor Dershowitz reminds us, \"it is entirely legal to target and kill an enemy combatant who had not surrendered. Nor need he be given the opportunity to surrender.\"\n\n Afaik a combatant has to wear a uniform and bear a weapon openly.\n Neither was the case in Yassin's case.\n \n Also very kind of the professor to remind us that as soon as you are critizising Israel you are also justifying terrorist acts emoticon_rolleyes .", 
   {
    "unicode_changes_made": true
   }, 
   41588, 
   null, 
   1080630780.0
  ], 
  [
   41637, 
   null, 
   "Ghost", 
   "I think the definition of 'combatant' is changing. See, we don't fight armies much any more. It's guerilla warfare, and most of the time your enemy will be wearing civilian clothes and carrying concealed weapons. This happened in Vietnam, and it's happening in Iraq. You can't think of it in terms of uniforms anymore.", 
   {}, 
   41592, 
   null, 
   1080669840.0
  ], 
  [
   41640, 
   null, 
   "The_Comedian", 
   "I think the definition of 'combatant' is changing. See, we don't fight armies much any more. It's guerilla warfare, and most of the time your enemy will be wearing civilian clothes and carrying concealed weapons. This happened in Vietnam, and it's happening in Iraq. You can't think of it in terms of uniforms anymore.\n\n That's clear.\n But that wasn't what professor D. wrote.\n He reffered to the classical term of a combatant and that one simply doesn't fit on Yassin.\n And if he meant to introduce a new term then the \"argument\" has no relevance at all.", 
   {
    "unicode_changes_made": true
   }, 
   41637, 
   null, 
   1080670200.0
  ], 
  [
   41691, 
   null, 
   "Broker", 
   "Remrem:\n \n Israel has resolved the conflict over the land with the nations that controlled it. The Palestinians weren't in control to begin with (well, the Jordanian Palestinians... but apparently they don't want their state anymore)!\n \n Egypt and Jordan gave up Gaza and the West Bank, the two places at issue. While true that Syria still claims the Golan Heights, Israel is justified in holding it because it was being used by militants to attack them. Once Syria has some control over them maybe they'll get an agreement.\n \n Here's my thought... compare it to the Mexican-American war. Say California decides it doesn't like the US, but it doesn't want to go back to Mexico, either. Do we let California leave? Of course we wouldn't. They don't have claim to that land... or in this case, the two groups both have claim to the lands. But \"Greater Israel\" is under Arab control now... they have far more of the land than Israel does.", 
   {}, 
   41640, 
   null, 
   1080685560.0
  ], 
  [
   41703, 
   null, 
   "remrem", 
   "Broker:\n \n The point I think you are missing is that the Palestinians are not fighting with the Arabs to regain Palestine, if anything Arabs have hindered the autonomy of Palestine or a Palestinian state. Israel has only existed for 56 years. You can't claim that there was a war and it has won because then Palestinians can claim that the war isn't over. If Israel continues to pursue an imperialistic agenda it will only jeopordize the security of Israel and its citizens. Israeli conservatives don't care when Palestinians suffer and die, however a lot of conservatives care when Israeli citizens die, and I do think that there are a number of conservatives that will jeopordize Israeli lives by unnecessarily fueling the violence, for \"the greater goal\" - Eretz Israel. If anything, Israel should be making nice with its neighbors, because it is only a matter of time when Palestinians and non Jews out number the Jewish majority in Israel. Supreme imperialism will never work as well as peace and imperialism, always catches up, if you look throughout history. If you want check out my new website at poeticinjustice.net, I have a forum's page too, I'm trying to get controversial dialogue going. Take care\n \n Remi", 
   {
    "post_info": {
     "post_title": "Broker"
    }
   }, 
   41691, 
   null, 
   1080688260.0
  ], 
  [
   41705, 
   null, 
   "Broker", 
   "The Arabs already have Palestine. Jordan sits on 76% of the historic Palestinian state. 75% of the people living there are Palestinians. Jordan was created to be the Palestinian state.", 
   {}, 
   41703, 
   null, 
   1080688680.0
  ], 
  [
   41748, 
   null, 
   "Gator", 
   "\n [Dershowitz] reffered to the classical term of a combatant and that one simply doesn't fit on Yassin.\n\n \n Quite the contrary. The limitations you impose are of your own making. Look again at the quote in Ilana Mercer's column that she attributes to Dershowitz in his book: Under international law and the laws of war, it is entirely legal to target and kill an enemy combatant who has not surrendered.\n \n Your argument that Dershowitz is referring to the \"classical term of a combatant\" appears without basis, as no such reference is expressed or even implied. It's no secret that Dershowitz believes the killing of Yassin was both legal and moral, so why attempt to confine his remarks to a narrow context?\n \n Furthermore, you provide no source or clear indication of what constitutes the classical definition of combatant or even why the classical definition should still be our concern in the 21st century. I assume that international agreement, like the numerous Geneva Conventions dating back to 1864, is your basis for the law of armed conflict. Which convention, treaty, or protocol illustrates the 'classical combatant', in your opinion?\n \n In accordance with international law and the laws of war, the armed conflict between Israel and the Palestinians requires that Israel divide the Palestinian population into two general classes, combatants and noncombatants. The noncombatants are generally synonymous with the civilian population--those individuals who are not members of an armed force and do not otherwise directly support the commission of hostile acts.\n \n With that distinction in mind, and regardless of any notion of 'classical' combatants, Yassin clearly was a combatant by any reasonable definition of the term. He founded a terrorist organization and was active as its leader. His wheelchair confinement was irrelevant to his culpability. There was nothing ambiguous in his personal approval of acts of terrorism against civilians. Indeed, he publicly vowed to continue the terrorism, even if Israel should end the occupation and dismantle all settlements.\n \n A combatant, simply put, is a soldier or guerilla member who is waging war. The qualifiers you cited--that he has to wear a uniform and bear his weapon openly--are not required elements. Even the Geneva Convention suggests that wearing a uniform and carrying a weapon are not determining factors in who may be considered a combatant. Rather, they are simply two of four characteristics used to determine if the combatant is entitled to be protected by the laws of war.\n \n Protocol I of the Convention, Part III, Section II, Article 43 states: The armed forces of a Party to a conflict consist of all organized armed forces, groups and units which are under a command responsible to that Party for the conduct or its subordinates, even if that Party is represented by a government or an authority not recognized by an adverse Party... Members of the armed forces of a Party to a conflict (other than medical personnel and chaplains covered by Article 33 of the Third Convention) are combatants, that is to say, they have the right to participate directly in hostilities.\n \n Hamas is an armed party to the conflict, formerly under the command of Yassin, a godfather of terror, who incited and exhorted his forces to engage in relentless martyrdom operations to kill as many Jews and Israelis as possible--soldiers and civilians alike. Yassin's successor in Gaza, the pediatrician Rantissi, follows closely in the footsteps of his predecessor. Upon taking over the top command of Hamas in Gaza, Rantissi immediately issued a directive to his fighters: \"The door is open for you to strike all places, all the time and using all means.\"\n \n As was Yassin, so is Rantissi a combatant.", 
   {
    "unicode_changes_made": true
   }, 
   41640, 
   null, 
   1080698520.0
  ], 
  [
   41762, 
   null, 
   "Gator", 
   "remrem, your characterization of Israel pursuing an imperialistic agenda is in contrast with Israel's actual agenda to survive and prosper as an independent Jewish state surrounded by an assemblage of Arab autocrats, dictators, and monarchies.\n \n With the dissolution of Pax Britannica and the collapse of the Soviet empire in the last century, perhaps the U.S. and Israel are the only imperialistic bogeymen left.\n \n Of course none should ever construe that the Arab aggrandizement of greater power, at the expense of Israel's tiny existence, has any of the hallmarks and trappings of imperialism. Nor should one reflect on the world's first breach of the UN Charter, when Arab states combined their forces with the hope of snuffing out the newborn Jewish state. Nor should one take note that the imperialistic label tacked to Israel is profoundly undercut by an awareness that Israel is either compelled to fight in self-defense or disappear altogether. NO, DO NOT LOOK BEHIND THAT CURTAIN. OZ SPEAKS!", 
   {}, 
   41703, 
   null, 
   1080703200.0
  ], 
  [
   41764, 
   null, 
   "AMD4EVER", 
   "Of course none should ever construe that the Arab aggrandizement of greater power, at the expense of Israel's tiny existence, has any of the hallmarks and trappings of imperialism. Nor should one reflect on the world's first breach of the UN Charter, when Arab states combined their forces with the hope of snuffing out the newborn Jewish state. Nor should one take note that the imperialistic label tacked to Israel is profoundly undercut by an awareness that Israel is either compelled to fight in self-defense or disappear altogether. NO, DO NOT LOOK BEHIND THAT CURTAIN. OZ SPEAKS!\n\n \n It is just shocking to me how people can believe that Israel is at fault for simply fighting to exist. If Canada were to the US as Palestine is to Israel I don't think any American would blame the US government for retaliating for attacks against us or fighting a war to protect ourselves even if it means preemptive strikes against an impending war. The Israeli conflict is just so far away that no one ever considers what it would be like for it to happen to them. Israel has only one friend and a world full of enemies hoping for it to fall. Thank goodness there is a country like the US in the world.", 
   {}, 
   41762, 
   null, 
   1080703620.0
  ], 
  [
   41772, 
   null, 
   "Gator", 
   "If you want check out my new website at poeticinjustice.net, I have a forum's page too, I'm trying to get controversial dialogue going.\n\n \n It rather looks like you're getting a budding reputation for gullibility, considering how easily you bought into the absurd \"Sharon quote\" hoax perpetrated by the pro-Palestinian media.\n \n It's clear that you really do believe that this bogus exchange between Sharon and Peres took place. Else, why would you post it as 'fact' to start a new discussion. Even when asked to provide evidence of the alleged quote's veracity, you still didn't find the truth but rather provided a link to a pro-Palestinian web site that continues to mislead readers two years after the hoax was exposed.\n \n Credit goes to The_Comedian for showing sense enough to voice suspicions regarding the fabrication.\n \n It turns out the quote originated with a pro-Hamas American group, the Islamic Association for Palestine in an Oct. 13, 2001 press release.", 
   {}, 
   41703, 
   null, 
   1080707940.0
  ], 
  [
   41942, 
   null, 
   "The_Comedian", 
   "Quite the contrary. The limitations you impose are of your own making. Look again at the quote in Ilana Mercer's column that she attributes to Dershowitz in his book: Under international law and the laws of war, it is entirely legal to target and kill an enemy combatant who has not surrendered.\n \n Your argument that Dershowitz is referring to the \"classical term of a combatant\" appears without basis, as no such reference is expressed or even implied. It's no secret that Dershowitz believes the killing of Yassin was both legal and moral, so why attempt to confine his remarks to a narrow context?\n \n Furthermore, you provide no source or clear indication of what constitutes the classical definition of combatant or even why the classical definition should still be our concern in the 21st century. I assume that international agreement, like the numerous Geneva Conventions dating back to 1864, is your basis for the law of armed conflict. Which convention, treaty, or protocol illustrates the 'classical combatant', in your opinion?\n \n In accordance with international law and the laws of war, the armed conflict between Israel and the Palestinians requires that Israel divide the Palestinian population into two general classes, combatants and noncombatants. The noncombatants are generally synonymous with the civilian population--those individuals who are not members of an armed force and do not otherwise directly support the commission of hostile acts.\n \n With that distinction in mind, and regardless of any notion of 'classical' combatants, Yassin clearly was a combatant by any reasonable definition of the term. He founded a terrorist organization and was active as its leader. His wheelchair confinement was irrelevant to his culpability. There was nothing ambiguous in his personal approval of acts of terrorism against civilians. Indeed, he publicly vowed to continue the terrorism, even if Israel should end the occupation and dismantle all settlements.\n \n A combatant, simply put, is a soldier or guerilla member who is waging war. The qualifiers you cited--that he has to wear a uniform and bear his weapon openly--are not required elements. Even the Geneva Convention suggests that wearing a uniform and carrying a weapon are not determining factors in who may be considered a combatant. Rather, they are simply two of four characteristics used to determine if the combatant is entitled to be protected by the laws of war.\n \n Protocol I of the Convention, Part III, Section II, Article 43 states: The armed forces of a Party to a conflict consist of all organized armed forces, groups and units which are under a command responsible to that Party for the conduct or its subordinates, even if that Party is represented by a government or an authority not recognized by an adverse Party... Members of the armed forces of a Party to a conflict (other than medical personnel and chaplains covered by Article 33 of the Third Convention) are combatants, that is to say, they have the right to participate directly in hostilities.\n \n Hamas is an armed party to the conflict, formerly under the command of Yassin, a godfather of terror, who incited and exhorted his forces to engage in relentless martyrdom operations to kill as many Jews and Israelis as possible--soldiers and civilians alike. Yassin's successor in Gaza, the pediatrician Rantissi, follows closely in the footsteps of his predecessor. Upon taking over the top command of Hamas in Gaza, Rantissi immediately issued a directive to his fighters: \"The door is open for you to strike all places, all the time and using all means.\"\n \n As was Yassin, so is Rantissi a combatant.\n\n Hmm, you are right. I really confused the part about POWs and the war \"rules\" in general. Sorry about that.\n \n But couldn't the generalization made by D. about the \"laws of war\" (whatever he means in particular) be used by the Palestinians as well to justify an attack on Sharon or other Israeli politicians?\n \n P.S.:\n Compliment that you took yourself so much time to write such a long reply; this is rarely seen (*pointing finger on myself*).", 
   {
    "unicode_changes_made": true
   }, 
   41748, 
   null, 
   1080822240.0
  ], 
  [
   43026, 
   null, 
   "remrem", 
   "This goes out to the pro-Israeli supporters. I think people have to think back before the second intifada. Suicide bombings have only been occuring for a short period of time. While I highly disagree with suicide bombings and the administering of such violence, I think people have to ask themselves why this type of violence is happening. I don't think it is for Allah or 72 virgins or to be a martyr. I think it is out of desperation. The Israeli's like to forget what the conditions were like during the supposed time of peace, the Oslo Accords. Unemployment tripled due to Israel closing it's doors while illegal land expansion in the West Bank and Gaza doubled. Israel was building it's case and foundation for occupation, long before true occupation. The Palestinians have endured suffering on a daily basis, while Israeli's deal with a suicide bombing here or there. I don't think you can compare the two degrees of pain. I would like to see the violence stop on both sides. And let us not forget who has broken cease fires with Palestinian militant groups, the answer is Israel. The fact is under the conservative power, they don't want peace or a two state solution. They want to recover Eretz Israel and put the Palestinians in as much pain as necessary while sacrificing the safety of Israel and it's civilians.\n \n Remi\n Check out my new website, poeticinjustice.net, I have a forums page as well", 
   {
    "post_info": {
     "post_title": "I think someone is forgetting about history"
    }
   }, 
   41942, 
   null, 
   1081423560.0
  ], 
  [
   45227, 
   null, 
   "SilentPoet", 
   "This goes out to the pro-Israeli supporters. I think people have to think back before the second intifada. Suicide bombings have only been occuring for a short period of time. While I highly disagree with suicide bombings and the administering of such violence, I think people have to ask themselves why this type of violence is happening. I don't think it is for Allah or 72 virgins or to be a martyr. I think it is out of desperation. The Israeli's like to forget what the conditions were like during the supposed time of peace, the Oslo Accords. Unemployment tripled due to Israel closing it's doors while illegal land expansion in the West Bank and Gaza doubled. Israel was building it's case and foundation for occupation, long before true occupation. The Palestinians have endured suffering on a daily basis, while Israeli's deal with a suicide bombing here or there. I don't think you can compare the two degrees of pain. I would like to see the violence stop on both sides. And let us not forget who has broken cease fires with Palestinian militant groups, the answer is Israel. The fact is under the conservative power, they don't want peace or a two state solution. They want to recover Eretz Israel and put the Palestinians in as much pain as necessary while sacrificing the safety of Israel and it's civilians.\n\n \n Desperation does not justify terrorism.\n \n Nothing does. Do you understand that?", 
   {}, 
   43026, 
   null, 
   1082607720.0
  ], 
  [
   45284, 
   null, 
   "georged", 
   "Desperation does not justify terrorism.\n \n Nothing does. Do you understand that?\n\n \n No. Nor did the French or Russians during Germany's WWII occupation or the Vietnamese during our occupation of a portion of their country. Do you actually believe honorable conduct and rules of engagement as described by treaties and agreements have any reality when indigents feel they have their back to the wall against a militarily superior force pressing 180-degree opposite ideologies or unfavorable real estate policies on them? If so, I suggest you refrain from walking the streets unarmed in a majority of US inner cities, particularly after dark.", 
   {}, 
   45227, 
   null, 
   1082646960.0
  ], 
  [
   45446, 
   null, 
   "SilentPoet", 
   "georged,\n \n \nNo. Nor did the French or Russians during Germany's WWII occupation or the Vietnamese during our occupation of a portion of their country. \n \n \n I state again. Terrorism has no justification.\n \n \nDo you actually believe honorable conduct and rules of engagement as described by treaties and agreements have any reality when indigents feel they have their back to the wall against a militarily superior force pressing 180-degree opposite ideologies or unfavorable real estate policies on them?\n\n \n You illustrated desperation. Your attempting to justify terrorism by illustration desperation to which I have already said does not justify terrorism.", 
   {}, 
   45284, 
   null, 
   1082691900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Start of new peace or start of a bitter war?", 
  "url": "http://www.4forums.com/political/peace-middle-east/1989-start-new-peace-start-bitter-war.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 1989, 
  "discussion_files": [
   [
    "10712.html", 
    "http://www.4forums.com/political/peace-middle-east/1989-start-new-peace-start-bitter-war-print.html"
   ], 
   [
    "10713.html", 
    "http://www.4forums.com/political/peace-middle-east/1989-start-new-peace-start-bitter-war-5-print.html"
   ], 
   [
    "10714.html", 
    "http://www.4forums.com/political/peace-middle-east/1989-start-new-peace-start-bitter-war-4-print.html"
   ], 
   [
    "10715.html", 
    "http://www.4forums.com/political/peace-middle-east/1989-start-new-peace-start-bitter-war-3-print.html"
   ], 
   [
    "10716.html", 
    "http://www.4forums.com/political/peace-middle-east/1989-start-new-peace-start-bitter-war-2-print.html"
   ]
  ], 
  "identifier": 1989
 }
]