[
 [
  [
   2, 
   null, 
   "fallingupwards", 
   "home schooling is one of the worst things that a parent can do to a child. one of the purposes of going to school is learning how to cope with other kids your age. if a kid is cooped up inside his house all the time with a parent teaching him (who most likely isnt as qualified as a real teacher). the student needs to interact with other kids their age and needs to be exposed to more ideas.", 
   {
    "post_info": {
     "post_title": "Home Schooling"
    }
   }, 
   null, 
   null, 
   1043610000.0
  ], 
  [
   116, 
   null, 
   "Broker", 
   "I know some homeschooled people... they learn a lot more than they would in a school. It doesn't really matter how qualified a teacher is, because they have to keep up with the lowest, not the highest, students in the class. If there's only one student you can keep to their pace of learning and they'll take a lot more from it. \n \n Most homeschooled children do some kind of other activity for interaction, like sports.", 
   {}, 
   2, 
   null, 
   1043679780.0
  ], 
  [
   117, 
   null, 
   "Broker", 
   "I'd like to stay home for school...", 
   {}, 
   2, 
   null, 
   1043679840.0
  ], 
  [
   119, 
   null, 
   "thistownwilleat", 
   "I agree that homeschooled children learn more than the public counterpart, but I also believe that although Math, Science, etc. is extremely important the lack of any social adeptness hinders the application of these things. A few of my friends were homeschooled on the elementary level and somewhat into middle school and took several years to find a place and who they were socially speaking.", 
   {}, 
   2, 
   null, 
   1043694840.0
  ], 
  [
   127, 
   null, 
   "Calligirl", 
   "I know so many people who are homeschooled, and they are at least one grade ahead of the kids their age in public school. Public school is not necessary for socialization. Sports, art, drama, these are just a few of the ways that kids can be socialized. Homeschooling's great 'cause you can do your work anywhere. On your bed, outside on a swing, in the kitchen. It's so much more interesting then getting a sore rear-end sitting on some hard wooden desk chair all day!", 
   {}, 
   2, 
   null, 
   1043726340.0
  ], 
  [
   137, 
   null, 
   "American", 
   "A good case on this is People v. DeJonge 442 Mich. 266, 501 N.W.2d 127 (1993). You should be able to find it on www.findlaw.com", 
   {}, 
   2, 
   null, 
   1043728440.0
  ], 
  [
   159, 
   null, 
   "Calligirl", 
   "American:\n What is the exact adress to the website? I'm having trouble finding it. :)", 
   {}, 
   2, 
   null, 
   1043737260.0
  ], 
  [
   172, 
   null, 
   "American", 
   "I am sorry Calligirl. I don't seem to be able to find the opinion on the internet. I have a hard copy of the opinion so that is how I know about the case.", 
   {}, 
   2, 
   null, 
   1043804820.0
  ], 
  [
   193, 
   null, 
   "Maynard", 
   "it all depends, i was home-schooled for 7 years and i turned out fine, and i know others who have, but it is not for everyone, some cant go without the social aspect that schools bring. i was luckly, my dad is self-employed, so i allways had someone around to teach me, and i learned very good social skills through being with him whilst he was dealing with customers, plus i learned how to turn a wrench.", 
   {}, 
   2, 
   null, 
   1043864760.0
  ], 
  [
   202, 
   null, 
   "ghettocracka", 
   "i agree that kids do learn more being home schooled\n but part of learning is being around other people and interacting with them\n if you can afford it, private school is a good option", 
   {}, 
   2, 
   null, 
   1043875920.0
  ], 
  [
   240, 
   null, 
   "Calligirl", 
   "Private school is a good option, but not many parents can afford it. Just another good reason to homeschool--it's very affordable!", 
   {}, 
   2, 
   null, 
   1043898240.0
  ], 
  [
   247, 
   null, 
   "fallingupwards", 
   "99% of parents are not qualified to teach eight totally different subjects to their children. Just another good reason to go to public school!", 
   {}, 
   2, 
   null, 
   1043898960.0
  ], 
  [
   253, 
   null, 
   "Calligirl", 
   "Public school teachers have sexually molested and raped their students. Just another good reason to be homeschooled!", 
   {}, 
   2, 
   null, 
   1043899680.0
  ], 
  [
   255, 
   null, 
   "fallingupwards", 
   "ok calli, i have given you facts and then you throw a low-blow like that. what you said is so meaningless. i'm going to be a teacher, and i'm one of the strongest christians on this site. i'm not going to freakin rape my students. so when your ready to have a sensible and logical debate, then tell me. thanks.", 
   {}, 
   2, 
   null, 
   1043899860.0
  ], 
  [
   259, 
   null, 
   "thistownwilleat", 
   "Parents rape and molest their children far more than teachers. And if you're intent on using dizzingly minute tiny statistics, then some abusive parents use home-schooling as a form of control, to keep their kids from going to school and telling teachers or showing their bruises.", 
   {}, 
   2, 
   null, 
   1043900160.0
  ], 
  [
   272, 
   null, 
   "fallingupwards", 
   "i'm going to use Calli's logic:\n \n Parents have sexually molested and raped their children MUCH more than teachers have to their students. Just another good reason to go to public schools!", 
   {}, 
   2, 
   null, 
   1043902320.0
  ], 
  [
   322, 
   null, 
   "Broker", 
   "Ok, I think the socilization argument was countered. Leave it alone. \n \n I feel so held back in public school. The teachers are keeping up with the bottom of the class and we can't delve deeper. That's why homeschooling is a good thing... you can go at a much faster pace or much slower pace. You can adapt it to how your child learns best. \n \n I think private school is also good...I don't know wish I'd prefer. But most people can't afford it. I used to be against vouchers, but I think that may be a good idea. The average child is fine in public school... they run around all day looking for amusement instead of concentrating on learning. Exceptional students should be given the chance to go to a private school with public money if they can't afford it. The top 10% of people make around 60% of change, the bottom 50% around 10% of change. Who should you spend more money educating? \n \n I myself am an exceptional student. My district gets money because I attend their schools. Yet our gifted class never sees that money. That money goes to educate the other exceptional students... disabled, behaviorally or educationally challenged. It isn't fair and we can't do anything about it.", 
   {}, 
   2, 
   null, 
   1043976360.0
  ], 
  [
   2151, 
   null, 
   "sarablaze", 
   "I think it's different strokes for different folks.\n I would have to agree with Falling though.\n Kids need to socialize on a daily basis with their peers.", 
   {}, 
   2, 
   null, 
   1045302180.0
  ], 
  [
   2429, 
   null, 
   "Truth Seeker", 
   "I believe that socialization is overrated. Think about it. \n \n Parents are responsible for their child's well being are they not? What does sending them off to public school do for them? They get to spend all day hanging around a lot of children their own age. Is this good? It is unbelievable how cruel children can be. Doesn't matter whether you attend a private or public school. Even brothers and sisters can be nasty towards each other. The difference is, that at home the nastiness can be stopped and put into check. Who is looking out for your child at school? The teachers can't possibly be at all places at all times. Maybe, you say, this is part of life's lessons. Life isn't fair. We must get used to teasing. No child should be exposed to bitterness and cynicism simply for the sake of an education. \n \n Another problem I have with public schools is the utter godlessness of them. I am a Christian and I would want my children (if I had any) to grow up having Godly principles. Don't tell me that children must be exposed to new ideas. Don't tell parents they have to take the risk of losing their child's heart and soul in the anti-Christian environment he would be inundated day in and day out. \n \n Fallingupwards, one thing I would be interested in knowing is how you came to the conclusion that 99% of all parents are not qualified to teach their children all the subjects they need to learn.", 
   {}, 
   2, 
   null, 
   1045523700.0
  ], 
  [
   2431, 
   null, 
   "fallingupwards", 
   "somehow i doubt that most parents are experts in calculus, european history, physics, chemistry, algebra, world history, us history, biology, trigonometry and all the other subjects all at the same time. because they would have to be if they homeschool their child.\n \n hey lieseeker, you say that if a kid goes to school he might not be excepted by everyone and such. WELCOME TO THE REAL WORLD. PART OF GOING TO SCHOOL IS TO LEARN HOW TO BE WITH OTHER PEOPLE WHO ARE NOT LIKE YOU. YOU ARE NOT GOING TO LIVE WITH YOUR PARENTS YOUR WHOLE LIFE. SOCIALIZATION IS VERY KEY.", 
   {}, 
   2, 
   null, 
   1045526640.0
  ], 
  [
   2437, 
   null, 
   "Patriot", 
   "Falling, broker, thistown etc: \n \n I have been homeschooled all my life. Am I having trouble interacting with you guys? I think not. \n \n Nix the socialization argument. It is perhaps the silliest reason to not homeschool i know of.", 
   {}, 
   2, 
   null, 
   1045529760.0
  ], 
  [
   2440, 
   null, 
   "sarablaze", 
   "Well now that you have said that I stress no home schooling! LOL \n I am not saying it is wrong I'm saying it is better to be around others.", 
   {}, 
   2, 
   null, 
   1045530480.0
  ], 
  [
   2442, 
   null, 
   "fallingupwards", 
   "patriot, i dont consider chatting online to be socialization. computers are fine, but what really counts is how you interact with people in your real life.\n \n can someone please respond to my previous post?", 
   {}, 
   2, 
   null, 
   1045530840.0
  ], 
  [
   2443, 
   null, 
   "Patriot", 
   "That post was mostly aimed at falling, sarablaze. I'll leave the socialization debate alone for right now. \n \n Do you think i'm having trouble interacting with you sarablaze?", 
   {}, 
   2, 
   null, 
   1045530840.0
  ], 
  [
   2445, 
   null, 
   "fallingupwards", 
   "patriot, if you do a good job at socializing with people IN PERSON, then you are an exception to the role. you cannot judge how socialable you are to how well you can type online", 
   {}, 
   2, 
   null, 
   1045531200.0
  ], 
  [
   2446, 
   null, 
   "Patriot", 
   "So you think I type like this, but i'm a dumb ox in person? I think this is a good test of how well I can interact. \n \n The point is that statement if yours is the most ignorant one you've made to date. I suppose you don't know any homeschoolers?", 
   {}, 
   2, 
   null, 
   1045532520.0
  ], 
  [
   2450, 
   null, 
   "sarablaze", 
   "LOL, I was kidding around with you.", 
   {}, 
   2, 
   null, 
   1045537020.0
  ], 
  [
   2452, 
   null, 
   "Patriot", 
   ":D", 
   {}, 
   2, 
   null, 
   1045537680.0
  ], 
  [
   2453, 
   null, 
   "sarablaze", 
   "But! I still think that way more than the mojority of kids out there need to learn with others.\n I have a friend who was home schooled and when it comes to almost everything, the guy is a control freak!!!\n I'm ganna try to not get technical, but I think that home schooling turned him into a controlling brat.", 
   {}, 
   2, 
   null, 
   1045538700.0
  ], 
  [
   2460, 
   null, 
   "fallingupwards", 
   "actually, i know a lot of homeschoolers that went to my church. they are all very very socially incapable of doing much of all. i'm sorry, but thats how it is. i know almost as a fact that they would be much better off if they were not protected by their parents and allowed to live in the real world. maybe you are in the minority.\n \n will someone please respond to my previous post???:\n somehow i doubt that most parents are experts in calculus, european history, physics, chemistry, algebra, world history, us history, biology, trigonometry and all the other subjects all at the same time. because they would have to be if they homeschool their child.", 
   {}, 
   2, 
   null, 
   1045542060.0
  ], 
  [
   2462, 
   null, 
   "Truth Seeker", 
   "Interesting comments :)\n \n I don't consider getting offered drugs a necessary childhood experience. Is it great having your five and six year old cuss and swear? How is sending out your child to deal with the wolves of this world before he is trained and prepared, good. What right does the government have to brainwash my child? Would you ever throwing a child in a ten foot deep pool without first teaching him how to swim. Sure, maybe he will pick it up while he is flailing in the water, but there is no way I am going to take that chance. Why should I let my child learn how to be an immature brat who doesn't even know how to address an adult let alone speak to one. Sure, I know not all public school children are creeps. Should I take a chance on the ones who are? and then let them influence my child. As a parent I would have a responsibility to see that my child socialized with good Christian children. Do you think homeschoolers stay home all day and never leave the house? A lot of towns have homeschool groups. They network the homeschooling families in the community and get their children together. \n \n BTW: Fallingupwards what is your idea of socialization?\n \n You still say that 99% of parents are not capable of teaching their children all the necessary subjects. First of all most of the subjects you mentioned are not elementary school level. Parents are not so stupid that they can't even teach a little child to read, write, and basic arithmetic. On to middle school, this period in a child's life is one of the most testing for the parents. Middle school children question everything. Does it make sense for me to send my child to public school so he can learn from his peers that his parents are losers, complete XXXXXX, and are really mean because they won't let him do whatever he wants to do. If most parents are so stupid that they can't teach their middle school age children the necessary subjects, then we have a lot of stupid people floating around. Now, considering high school subjects it may seem that you have a point. Then again maybe not. Who says homeschool parents must be proficient and have some degree in every single solitary subject that his child might want to study? What is so hard about teaching history? Or English? literature? That is why we have textbooks. Now speaking as someone who is not quite as good in the area of Chemistry and Calculus, I can say that teaching these subjects might be hard. However, if my child is smart enough he can figure out a lot of things for himself. And if he isn't gifted in this area why push it? Another alternative is community college. If he must, take a subject from a pro. He is not all day at community college. By the time he is 16 or 17, if he is mature enough to face the world's bombardment I don't see why he can't take a couple classes. \n \n The point I am trying to make is that people should not send their children to public school to be harassed, told their Christian values are stupid, mocked, and be inundated with secular government imposed teachings. Maybe these public schools teachers are excellent at what they do. Maybe they could teach circles around me. However, this whole debate is not entirely about children getting educated. It is about whose worldview is being imposed on them. I don't care if my child is learning from some man who has a PhD. If that man is not a Christian he will not espouse to my Christian values and will most definitely not teach history, English, science, etc. the way I want my child to learn it. Yes, there are Christian teachers in the public school, but they aren't allowed to teach Christian values.\n Children are very impressionable creatures. I would keep mine at home and make sure they learn my values and my morals. Then, when they were spiritually mature enough, I could send them out into the world to be IN it and pray to God that they will not become PART of it. If other people want to send their children to public school that is their business and their right. Keeping mine home is my right. Praise the Lord the government hasn't been able to make homeschooling illegal!", 
   {
    "post_info": {
     "post_title": "Very interesting comments..."
    }, 
    "unicode_changes_made": true
   }, 
   2, 
   null, 
   1045542420.0
  ], 
  [
   2468, 
   null, 
   "fallingupwards", 
   "its usually a good idea for the teacher to know what he/she is teaching. a child should not have to rely on a textbook to learn, the child needs a teacher who KNOWS what he/she is talking about.\n \n if you are so concerned about your children being in the real world, then send them to a christian private school. at least the kid will have real teachers. schools teach kids how to live in the real world. if someone has been protected by their parents their whole life and then all of a sudden is out on their own, that is going to be a huge change for that person. you cannot protect your kids forever. let them learn with real teachers and with other students.\n \n oh no!!!! they might cuss!!! what are we going to do???????? the government brainwashing students??? how??", 
   {}, 
   2, 
   null, 
   1045544760.0
  ], 
  [
   2469, 
   null, 
   "sarablaze", 
   "When it coms to a child's questioning,if they ask their parents a question about trigonometry(spell check)\n they might not answer that as well as a teacher does. \n When a child asks a teacher or another student a question pertaining to sex or drugs, even though the parent might not want them to know, they may be wrongly or naively informed.\n There is an up and a down, but you Truthseeker seem to want keep children so safe from the outside world, that it turns into a joke. As a parent I would want my child to grow up knowing that the real world is full of people who are ignorant and rude, and for them to know how to deal with people or situations like that. I'm saying that schooling and parenting are two totally different parts of a kid's life. A good parent would try to make it comfortable for a child to come to them and ask questions about things that come up in school. Nobody can escape the real world.\n If my 6 year old comes home swearing, I can deal with that a lot better than my 22 year old coming home crying because someone at college made fun of him or tried to start a fight and he didn'''t know how to deal with the situation at all, let alone the right way!", 
   {}, 
   2, 
   null, 
   1045544820.0
  ], 
  [
   2474, 
   null, 
   "fallingupwards", 
   "thank you sarablaze!! finally, someone here speaks some common sense!!!", 
   {}, 
   2, 
   null, 
   1045548000.0
  ], 
  [
   2475, 
   null, 
   "sarablaze", 
   "Y Thanks!", 
   {}, 
   2, 
   null, 
   1045548240.0
  ], 
  [
   2477, 
   null, 
   "Equity", 
   "This discussion is just so interesting that I think I must join in! ;)\n First, to address your question, Falling:\n \n \nOriginally posted by fallingupwards \n will someone please respond to my previous post???:\n somehow i doubt that most parents are experts in calculus, european history, physics, chemistry, algebra, world history, us history, biology, trigonometry and all the other subjects all at the same time. because they would have to be if they homeschool their child. \n\n \n The truth is, they do not \"have to be\". One of the great things about homeschooling is that we learn how to teach ourselves the facts that we need to know. How to find answers. Who do you think is going to be more valuable out in the \"REAL WORLD\": a person who must be taught everything necessary to do a job (just as in a public school) or a person who can be depended on to do the job without specific instructions on every detail (which instruction upper-grade homeschooled students don't usually have ;) )?\n \n To briefly illustrate (in case you don't agree with my point above): I am the child of a high school dropout and a former drug pusher, who neither one ever (surprise, surprise!!) went to any kind of college. According to you, they could not homeschool. But they did, and, without any other teachers (except in music), I went on to get a 33 on the ACT in my sophomore year of high school, start two home businesses, and (currently) become the primary salesperson at a retail greenhouse business. (I'm waiting for the scores from my latest ACT; mathematics is the only subject that I haven't gotten a perfect score in, which I'm working for.)\n My point in all this is disproval of your mistaken general statements. We don't \"rely on textbooks to learn\". There are a huge variety of sources of information these days, and they are all available to those who know how to use them. I know that my parents don't know enough to answer my questions about most higher level subjects, so what do I do about it? I do what any functioning adult must do in the \"REAL WORLD\", find someone who can give me the answer I need.\n \n The only thing about the \"REAL WORLD\", Falling and Sarablaze, is that it in no way parallels the modern public school classroom. Will you ever (after K-12) be required to spend most of the day, every day, in a roomful of people your own age, who are at basically the same academic, social, and mental level? Will you ever again have the option of just asking your teacher and getting a quick, thorough answer? No, I'm sorry, Falling, but schools do not teach kids how to live in the \"REAL WORLD\". You'll probably realize this when you leave the comfort of your college dorm someday, but until then, you might be careful what you say about a \"REAL WORLD\" that you have never really had to experience. Frankly, my family doesn't worry about socialization, about the \"REAL WORLD\", we don't have to. My four siblings and I know and have good relationships with people of every age, in all sorts of professions. Yes, I have been protected to some degree, but believe me, my real-life experiences have taught me alot more than a classroom ever could about what the world is really all about. Seriously, Sarablaze, no homeschooler I have ever known has the kind of insecurity you portray, and, if they did, I seriously doubt that the public school system could be counted on to help such a deep psychological problem.\n \n The point is, my family and I are not exceptions to the rule! The people most prepared to function in the \"REAL WORLD\" are unquestionably those that have lived in that world all their lives, not in an artifical environment created by those who cannot possibly develop each individual's greatest potential.\n \n \nOriginally posted by fallingupwards \n actually, i know a lot of homeschoolers that went to my church. they are all very very socially incapable of doing much of all. i'm sorry, but thats how it is. i know almost as a fact that they would be much better off if they were not protected by their parents and allowed to live in the real world. maybe you are in the minority.\n \n \n Falling, the fact that the homeschoolers you mentioned don't choose to socialize with you, doesn't mean they're not far more capable of functioning in the \"REAL WORLD\" than you might think. I would not choose to socialize with you in the \"REAL WORLD\", and you most likely would not choose to socialize with me, but that does not make me your social inferior!", 
   {}, 
   2, 
   null, 
   1045548600.0
  ], 
  [
   2481, 
   null, 
   "sarablaze", 
   "Different strokes for different folks. I myself led a life like your parent, but the little bit of time I had spent in school helped me out, in ways I can't describe. I give props to you and your parents.\n There are many jobs out there were you will work side by side with other people. Jobs ranging from fast food McDonalds, to Office environments. I'm not implying that you sat in your house all day everyday, and was never exposed to sunlight.LOL\n I'm simply saying that most home schooled kids usually have more trouble adapting to the \"real world\" than kids who were schooled side by side, because they have been either a little bit or a whole lot more, sheltered from it.\n That doesn't mean every kid....I mean, look at you, and what you have accomplished. I said most of them, NOT all of them.", 
   {}, 
   2, 
   null, 
   1045551960.0
  ], 
  [
   2484, 
   null, 
   "Truth Seeker", 
   "I would have nothing against explaining to my children how to deal with the REAL WORLD. I could do that much better by keeping them at home and by keeping them away from the influences that would surround them at a public school. This is not about whether they have \"certified\" teachers or not. This is about them learning about the true God and Creator of the world. This is about the right worldview of the material taught. How could I expect my children to actually be able to face the world if they have no solid foundation?\n \n Send them to a private school. I have nothing against a private Christian school. However, I am afraid that many Christian schools across the country wouldn't measure up to my standards. \n \n Like I said before this is a choice. If parents want to send their children to public school that is their problem. Perhaps you think I would be an irresponsible, and overprotective parent by homeschooling my children. You have a perfect right to believe so, but I have a perfect right to believe that you are wrong. :) :)", 
   {}, 
   2, 
   null, 
   1045557480.0
  ], 
  [
   2485, 
   null, 
   "sarablaze", 
   "If my 6 year old comes home swearing, I can deal with that a lot better than my 22 year old coming home crying because someone at college made fun of him or tried to start a fight and he didn'''t know how to deal with the situation at all, let alone the right way!\n \n Are you overprotective?-----<VERY!", 
   {}, 
   2, 
   null, 
   1045561500.0
  ], 
  [
   2512, 
   null, 
   "Patriot", 
   "Originally posted by sarablaze \n I'm simply saying that most home schooled kids usually have more trouble adapting to the \"real world\" than kids who were schooled side by side, because they have been either a little bit or a whole lot more, sheltered from it.\n That doesn't mean every kid....I mean, look at you, and what you have accomplished. I said most of them, NOT all of them. \n \n \n why do you say that? Do you know the majority of homeschoolers? what \"trouble adapting\" have you witnessed? Let's have some examples here.", 
   {}, 
   2, 
   null, 
   1045605060.0
  ], 
  [
   2513, 
   null, 
   "sarablaze", 
   "Let us analyze a bit!\n I don't know all of them, lol\n but I do know a few and they are very gaurded people.\n They haven't really worked side by side with anyone so they are very controling.\n They have never really been able to share an idea, and for the ones I know they are very selfish. Im not saying all who are home schooled are selfish or controlling.\n The ones I know certanly are.\n Different strokes for different folks.\n Where's falling?emoticon_confused", 
   {}, 
   2, 
   null, 
   1045605480.0
  ], 
  [
   2515, 
   null, 
   "Patriot", 
   "I'm the eldest of 7. you think I work alone? How selfish could I possibly be without driving my mother to insanity? \n \n What do you mean by \"guarded\"?", 
   {}, 
   2, 
   null, 
   1045605960.0
  ], 
  [
   2522, 
   null, 
   "sarablaze", 
   "Gaurded meaning protected, or babied.\n Im not saying this stuff about YOU.\n I'm saying this stuff about others. You are in the minority.", 
   {}, 
   2, 
   null, 
   1045616100.0
  ], 
  [
   2530, 
   null, 
   "Truth Seeker", 
   "In my last post I said that \"many Christian schools across the country wouldn't measure up to my standards.\" I would like to change the \"my\" to \"God's\". It came to my attention that saying something like that sounds rather arrogant and I do apologize.", 
   {
    "post_info": {
     "post_title": "Correction..."
    }
   }, 
   2, 
   null, 
   1045618200.0
  ], 
  [
   2531, 
   null, 
   "sarablaze", 
   "World's not perfect.:)", 
   {}, 
   2, 
   null, 
   1045618320.0
  ], 
  [
   2534, 
   null, 
   "Patriot", 
   "\"guarded,\" \"babied\" like what you do to something you value? \n \n If i'm in the minority, than every homeschooling family I know is also in the minority.", 
   {}, 
   2, 
   null, 
   1045621740.0
  ], 
  [
   10044, 
   null, 
   "katie5890", 
   "\"I agree that homeschooled children learn more than the public counterpart\"--thistownwilleat\n \n i go to a private school and im more educated than the public schoolers....but thats only cuz im given the material. and i DO have a Social life....dont say that it costs more , becuz being homeschooled is pretty expensive.", 
   {}, 
   2, 
   null, 
   1055819280.0
  ], 
  [
   12079, 
   null, 
   "Qualcar", 
   "patriot, if you do a good job at socializing with people IN PERSON, then you are an exception to the role. you cannot judge how socialable you are to how well you can type online\n\n \n And I am a exeption too?\n \n I've been homeschooled for 4 years and I've had at least as much socilation as the public school kids.", 
   {}, 
   2445, 
   null, 
   1058638200.0
  ], 
  [
   12081, 
   null, 
   "Qualcar", 
   "The public education system has been declining rapidly, even though more and more funding has been going to them. The only thing they have been asking for is more money.\n \n But I'd like to discuss the public education system from a different point of view. The point of view of the children. Being that I am 12, I should accomplish this.\n \n Well, mainly, I'm very pro-homeschool, and it has worked very well for me. In 3rd grade my mom pulled me out of homeschool, because they decided I had ADD. Well, that shows how much they know. Tell me now; can you say that if you stick an 8 year old in a desk for six hours making him do things that are mainly considered boring, that he wouldn't be fidgety and distracted? Possibly talking to other students? Now, I'm not making an excuse for myself. I  WAS  distracted and fidgety knew it.\n \n But what did that mean? It meant that I was bored, not that I had a  disorder . My best friend now, who has been diagnosed with ADD, has fallen prey to people who will diagnose him with more things. Because of the ADD (or ADHD, I think) he has mood swings, and his growth is stunted, he's either deeply and disturbingly depressed, serious, normal (or what I think to be at a middle standing in the swing) funny, crazy, or absolutely insane. And because of that, people believe he has other disorders, and he believes it too. How can I prove that those effects are related to the Ritalin and Strattera he has been taking? Well, because the other side effects are present too. Ritalin, which he has been taking for years, has been known to stunt growth. Well, he's as tall as an eight year old, and is nearly twelve, he has no appetite, and you can count his spinal discs. Probably not healthy. Now, on the subject of home schooling. . .\n \n Home schooling seems to work really well, and it is not for everyone, but the people who are willing to do it can. Most people say: \"Oh, I'm not smart enough\" or \"I just don't have the time\", but if they were willing to try it, they would, anything you wanted to teach your child you could learn along with him. And it's just crazy enough to work. And I can tell you it works, because I speak to you now. I have turned 12 very recently, and I am communicating with you at 50 to 60 words-per-minute, I had an interest in computers, and I am now a \"Junior Programmer\" and have made quite a few programs. The art of home schooling is all about the art of teaching a child how to learn for himself, and how to be able to harvest knowledge from places like libraries, a skill that is under-rated and rare. The plan was that I was going to go to college at 12, but when you have friends that arent in college, you hardly get to see them.\n As I said, I just very recently turned 12, and have been accepted into high school.\n \n    Flame Me, LOL!    ", 
   {
    "post_info": {
     "post_title": "The Public Education System Fails"
    }, 
    "unicode_changes_made": true
   }, 
   12079, 
   null, 
   1058638560.0
  ], 
  [
   14111, 
   null, 
   "So Heaven Dies?", 
   "home schooling is one of the worst things that a parent can do to a child. one of the purposes of going to school is learning how to cope with other kids your age. if a kid is cooped up inside his house all the time with a parent teaching him (who most likely isnt as qualified as a real teacher). the student needs to interact with other kids their age and needs to be exposed to more ideas.\n\n \n \n Children do not just socialise in school. I'm postive homeschooled children are not restricted to their homes. They probably interact with their neighbours etc. A school is not the only place where children 'learn to cope with other kids their age'.\n \n The majority of homeschooled children are taught by qualified persons. ", 
   {}, 
   2, 
   null, 
   1062527760.0
  ], 
  [
   14125, 
   null, 
   "fallingupwards", 
   "\n The majority of homeschooled children are taught by qualified persons. \n\n \n In many states, its not even a law for the \"teacher\" to be qualified. And answer this question, how is it possible for the \"teacher\" to be an expert in calculus, biology, chemistry, us history, world history, art, music, literature, physics, and so on all at the same time. You would have to be an Einstein to be an expert in all of these fields. Thus, a child needs separate teachers for each separate subject.\n \n \nChildren do not just socialise in school. I'm postive homeschooled children are not restricted to their homes. They probably interact with their neighbours etc. A school is not the only place where children 'learn to cope with other kids their age'.\n\n \n Sure a kid can learn to cope outside of school, but its important to interact with other children in a learning environment. Kids that actually go to school also interact with neighbors on top of that. \n \n Home schooling is an excuse to give your child an education based on religious principles. Its not used necessarily because parents want their child to learn more, but its used so they can \"protect\" their child from the world and so-called \"liberal\" school-teachers. I dont think its right to put your child in a box. They're going to have to enter the real world at some point in their life.", 
   {}, 
   14111, 
   null, 
   1062538440.0
  ], 
  [
   14135, 
   null, 
   "So Heaven Dies?", 
   "In many states, its not even a law for the \"teacher\" to be qualified. And answer this question, how is it possible for the \"teacher\" to be an expert in calculus, biology, chemistry, us history, world history, art, music, literature, physics, and so on all at the same time. You would have to be an Einstein to be an expert in all of these fields. Thus, a child needs separate teachers for each separate subject.\n \n \n \n Sure a kid can learn to cope outside of school, but its important to interact with other children in a learning environment. Kids that actually go to school also interact with neighbors on top of that. \n \n Home schooling is an excuse to give your child an education based on religious principles. Its not used necessarily because parents want their child to learn more, but its used so they can \"protect\" their child from the world and so-called \"liberal\" school-teachers. I dont think its right to put your child in a box. They're going to have to enter the real world at some point in their life.\n\n \n Research now validates the wisdom of keeping boys and girls in a protected environment until they have achieved a greater degree of maturity. Not only do they benefit emotionally from that delay, but they typically make better progress academically. That's why home-schooled individuals often gain entrance to the most prestigious universities and colleges in the country (therefore the teacher does not have to be an expert in every subject, if they are making the grades then their teachinf is sufficient). What parents can teach young children in informal one-on-one interactions surpasses what their little minds can absorb sitting among twenty-five age-mates in a classroom. Homeschooled children aren't rejecting the real world. I have never seen a homeschooled child become a social outcast due to one's upbringing.", 
   {}, 
   14125, 
   null, 
   1062540960.0
  ], 
  [
   14148, 
   null, 
   "fallingupwards", 
   "Researchers have also become increasingly convinced that interactive approaches to instruction with peers of their own age rather than in isolation, can be highly effective in promoting both cognitive development and classroom achievement. When you are homeschooled, you do not experience that peer interaction while you are being instructed.\n \n What is your response to the points I made about unqualified homeschool \"teachers\"?", 
   {}, 
   14135, 
   null, 
   1062552060.0
  ], 
  [
   14243, 
   null, 
   "So Heaven Dies?", 
   "That's why home-schooled individuals often gain entrance to the most prestigious universities and colleges in the country (therefore the teacher does not have to be an expert in every subject, if they are making the grades then their teachinf is sufficient).\n\n \n I have already made that point.", 
   {}, 
   14135, 
   null, 
   1062620580.0
  ], 
  [
   14256, 
   null, 
   "fallingupwards", 
   "Researchers have also become increasingly convinced that interactive approaches to instruction with peers of their own age rather than in isolation, can be highly effective in promoting both cognitive development and classroom achievement. When you are homeschooled, you do not experience that peer interaction while you are being instructed.\n\n \n ...........", 
   {}, 
   14148, 
   null, 
   1062629220.0
  ], 
  [
   14266, 
   null, 
   "SilentPoet", 
   "For some kids homeschooling is probably a good thing for various reasons.\n For some kids its probably a bad reason for reasons.\n \n Some parents choose homeschooling because they want to have a greater interaction with their child. Religious reasons are also possible.\n Parents for whatever reason also beleive home school is better their child.\n \n Some parents choose public school because they have to work. Thats probably the most common reason. Parents for different reason may beleive public school is better for their child.\n \n .....\n \n Thanks for reading this\n \n Always Stay OPen Minded", 
   {}, 
   14256, 
   null, 
   1062631140.0
  ], 
  [
   24201, 
   null, 
   "witzelcheck", 
   "First off, how did homeschooling get to child molestation?....\n \n For those of you who speak out against homeschooling.... Have you been homeschooled? Don't knock it till you've tried it. \n I was homeschooled, and I think it saved my mind, personally. I wasn't introduced to material obsession, violence, and everything along with it at that 'gullible stage' of life. So far (though I'm sure there are exceptions) every homeschooled person that I've met is able to function perfectly well in society. Just because you're homeschooled doesn't mean that you are unconnected from society. (though sometimes I think it would be a good idea until we all reach a certain age) When you are homeschooled, you are taught to think for yourself, not for the teacher and the other students. If you make a mistake, you move on, without getting made fun of by classmates. If you learn quickly, you can move ahead without being labled 'geek'. \n I know social life is important, but it is only part of learning, not all of it. \n Many of the students I see around me would rather adopt someone elses opinion, rather than form their own. In school, we are taught that team work is everything. So is independence. \n Now, this entire issue raises another question. Who is fit to homeschool their child? Not every parent is. There are abusive parents, parents who don't care if their children learn, and quite simply parents that cannot teach. In some cases it may be better to send a child to school. \n But, if the circumstance would allow for a child to be homeschooled, I'd say take it.", 
   {
    "post_info": {
     "post_title": "Good - for the most part"
    }
   }, 
   259, 
   null, 
   1069910520.0
  ], 
  [
   24211, 
   null, 
   "witzelcheck", 
   "yeah. that child molestation was for another page on another topic. sorry. multitasking not good", 
   {}, 
   24201, 
   null, 
   1069913760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Home Schooling", 
  "url": "http://www.4forums.com/political/education-debates/2-home-schooling.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 2, 
  "discussion_files": [
   [
    "24287.html", 
    "http://www.4forums.com/political/education-debates/2-home-schooling-print.html"
   ], 
   [
    "24288.html", 
    "http://www.4forums.com/political/education-debates/2-home-schooling-4-print.html"
   ], 
   [
    "24289.html", 
    "http://www.4forums.com/political/education-debates/2-home-schooling-3-print.html"
   ], 
   [
    "24290.html", 
    "http://www.4forums.com/political/education-debates/2-home-schooling-2-print.html"
   ]
  ], 
  "identifier": 2
 }
]