[
 [
  [
   40736, 
   null, 
   "rapture", 
   "Footsteps that rot the flesh?\n Pathways that led to Hell?\n Through unbelief are all corrupt paths made visible\n Through unbelief is every crime/ and perverse thing seen\n Through unbelief we are slayed through are own devices\n Through unbelief \" forgiveness\" we do not seek\n \n \n \n Unbelief? The best Satan has achieved", 
   {
    "post_info": {
     "post_title": "The worst ever?"
    }
   }, 
   null, 
   null, 
   1080090840.0
  ], 
  [
   40745, 
   null, 
   "Richard", 
   "Rapture, you forgot to mention stubborn religious belief in your list.", 
   {}, 
   40736, 
   null, 
   1080093060.0
  ], 
  [
   40749, 
   null, 
   "Ghost", 
   "I'd say that 'unbelief,' which I believe you're using to say not believeing in God or Jesus, isn't a sin. I don't see how it could be...a person's religious views are not sinful if they don't coincide with your own...whoever said that your religion was the right one, and what proof do you have?\n \n People who follow different religions from you but who believe in something, are they sinners? Buddhists, for example. Sinners or not?\n \n And I find it amazing that when compared to things like murder and aldutery, you pick unbelief as the most sinful? How is that worse than cold-blooded murder or cheating on someone?", 
   {}, 
   40745, 
   null, 
   1080096180.0
  ], 
  [
   40785, 
   null, 
   "Ghost", 
   "Well, obviously you think your religion is the right one, I don't object to that. But where do you find the 'Word of God?' The Bible, I would assume. Did you know that the Bible was commissioned, and the different sections were selected for inclusion by, a pagan? Did you know it came into being as a political tool? Did you know that anyone who held onto the estimated 80 or so other gospels were labeled heretics and killed because they conflicted with the political goals of the roman emperor? Did you know the roman emperor wanted Jesus to appear a certain way...even though he was pagan?\n \n I don't mean to attack your religion, I'm not trying to. But have you ever considered the fact that this 'proof in your heart' could very easily be simple psychology?\n \n I'm just sick and tired of the ignorance and intolerance brought about by most religions, especially Christianity and Islam (in my experience).", 
   {}, 
   40749, 
   null, 
   1080117240.0
  ], 
  [
   40796, 
   null, 
   "Mr Jack", 
   "I chose other - I do not believe in sin.", 
   {}, 
   40785, 
   null, 
   1080142560.0
  ], 
  [
   40798, 
   null, 
   "Phunting", 
   "Didn't vote, as I don't believe in sin either.\n \n But the worst of those actions? Well murder obviously. As I have committed and enjoy commiting all the others. \n \n Well ok not adultery yet, but hey I'm still young :)", 
   {}, 
   40796, 
   null, 
   1080144060.0
  ], 
  [
   40802, 
   null, 
   "unkerpaulie", 
   "I'd say that 'unbelief,' which I believe you're using to say not believeing in God or Jesus, isn't a sin. I don't see how it could be...a person's religious views are not sinful if they don't coincide with your own...whoever said that your religion was the right one, and what proof do you have?\n \n People who follow different religions from you but who believe in something, are they sinners? Buddhists, for example. Sinners or not?\n \n And I find it amazing that when compared to things like murder and aldutery, you pick unbelief as the most sinful? How is that worse than cold-blooded murder or cheating on someone?\n\n you need to recognize the difference between \"sin\" and \"wrong\", as it may surprise you to learn that they are not always the same.\n \n sin: Transgression of the law of God; disobedience of the divine command; any violation of God's will, either in purpose or conduct.\n \n wrong: Unacceptable or undesirable according to social convention; Contrary to conscience, morality, or law; immoral or wicked.\n \n the difference is while \"sin\" is defined solely by the commands of God according to the Bible, \"wrong\" is subject to culture, society and current norm. so while unbelief may not be \"wrong\" by modern social standanrds, it is most definitely a \"sin\"\n \n i hope you see the distinction", 
   {}, 
   40749, 
   null, 
   1080145020.0
  ], 
  [
   40845, 
   null, 
   "Phunting", 
   "I think if God Himself had hand written the bible and dropped millions of copies from heaven to the earth, the same people would still say it is not the Word of God. Don't you agree?\n\n Possibly, but I don't see the relevance.\n \n \n \nI did not choose to bevieve in God- Jesus Christ- Holy Spirit, He made His presence known to me.\n\n There is a huge difference between believing in god and believing in the bible. The two are not one and the same.\n \n \n \nPeople who say they don't think He exists are not looking for Him.\n\n Well of course, why would you look for something if you don't believe it exists?\n \n \n \n Well done, you addressed his post by nicely ignoring every single one of his points!", 
   {}, 
   40802, 
   null, 
   1080157500.0
  ], 
  [
   40848, 
   null, 
   "Ghost", 
   "Sandycane, you should know the history of how the Bible came into being. I don't see how the Bible is the word of God, when there are dozens of other gospels, many written by apostles and other eyewitnesses, which have been burnt or hidden. Are any of these the word of God? What if they say something completely different from the current Bible? With what we've discovered so far of them, they do.\n \n If all of a sudden millions of copies of the Bible dropped to earth...I'd look for a plane flying overhead first :) . I'm not saying it's not the word of God, I just don't see how the Bible is any more valid than the Koran, or Buddhist philosophy, etc etc.\n \n Unkerpaulie, I do understand the literal difference between the two, but most people, many Christians in fact, don't see that. Sin is religious, wrong is moral. Morality isn't necessarily defined by social conventions at the time...and contrary to conscience? Um, no. I'm not talking about things which you were taught by your parents or your church as wrong, I'm talking about things that a human being intrinsically knows are either right or wrong.\n \n Lol, Phunting, you're awesome. I don't know if murder is the worst of them, I guess that depends hugely on circumstance and definition of 'murder.'", 
   {}, 
   40802, 
   null, 
   1080158040.0
  ], 
  [
   40865, 
   null, 
   "Phunting", 
   "phunting,\n The \"relevance\" of that statement is...that there are some people who would deny the existance of God, no matter what.\n\n Possibly, but I doubt there would be many who would deny it if there was direct proof. But there isn't, there isn't any proof. Which is why people the people I guess you're talking about deny it.\n \n \n \nLet me ask a question to you and Ghost, Do you believe in a god? If so, describe \"it\", if not, why don't you?\n\n I don't.\n \n Let me say that that is not the reason that I am cynical of the bible. As I say they are two distinct entities. I have a lot of time for Christians who believe in god but not the strict interpretation of the bible, we may disagree but in the end I am an atheist through faith so can understand their choice. What I have a problem with is the strict adherence to the bible, especially when, as Ghost points out, it is so obviously problematic as the literal word of god. I also strongly disagree with much of what it says, and find it strange how people can claim to worship a loving god considering all the atrocities he carries out in it.\n \n Why I don't? I'd admit that it is based largely on faith. I don't claim to be agnostic, because I believe there is no god. \n \n I believe that he was invented by priests in order for the masses to put up with oppression through the promise of eternal happiness; I believe that he comes from mankind's desire to understand what is inconceivable, and at the time it may have been a logical explanation but it has been outgrown by modern science; and finally I believe that it is comforting for us to feel that life has some point instead of facing the fact that it is arbitrary.", 
   {}, 
   40848, 
   null, 
   1080160680.0
  ], 
  [
   40875, 
   null, 
   "rapture", 
   "God is infinite, in every creation, dimension, space, and time, in every dream, thought and nightmare - burn every Bible, blow up the churches, if you will, won't make no difference.", 
   {}, 
   40865, 
   null, 
   1080164460.0
  ], 
  [
   40906, 
   null, 
   "Ghost", 
   "Let me ask a question to you and Ghost, Do you believe in a god? If so, describe \"it\", if not, why don't you?\n\n \n I do believe in God, depending on which view of God you hold. I look around at different things in my life, just simple things like my cat walking through the backyard, or up at the sky at night, and I believe that this does have to be the result of intelligent design.\n \n I don't believe in the western religions' view of God though. Mainstream Christianity believes that the only way to avoid Hell and enter Heaven is to accept Jesus Christ as your savior, correct? If you don't accept Christ, you endure unbearable agony for all eternity. If there is a god which has this system, why would you worship something so cruel?\n \n I believe in almost a Buddhist-style god (I'm aware of the contradiction, as the Buddhists don't acknowledge a god per se). Think Nirvana. I don't think I see God as as much of a person as you do, more of an abstract energy.\n \n What I have a problem with is religion. Just look at Christianity, because that'll be the most predominant one in here I think. The Bible was indeed commissioned by the roman emperor Constantine, who was a pagan for nearly all of his life until he is believed to have been forcibly baptised on his deathbed. Constantine called the Council of Nicea and used it to declare Christ's divinity, and only selected works for inclusion into the Bible which coincided with this. He wanted one religion to unify the roman empire, which was at the time split between fledgling Christianity and paganism. He made Christianity the official religion, because they had what they perceived as a living God walking amongst them only three hunderd years before. Constantine melded the two religions together to make them more appealing to everyone. Why is it you celebrate Christ's birthday on Dec. 25th? According to Biblical scholars, Christ was born most likely in early October. The 25th was picked because that was the birthday of a pagan god. The Christmas tree, the Easter bunny? Both from pagan ritual. The idea of a god being entombed in a cave and resurrected 3 days later? That was the story of a pagan god hundreds of years before Christ.\n \n Religion is fabricated. It is manmade. It is created by human beings for furthering agendas, it breeds ignorance and intolerance, and it breeds violence. Don't believe me? Think of some of the bloodiest periods in human history...the Crusades ring a bell? How about the Inquisitions? Holocaust?", 
   {}, 
   40848, 
   null, 
   1080180720.0
  ], 
  [
   40950, 
   null, 
   "Ghost", 
   "I don't really think that God punishes or rewards people who 'obey' him. If he does punish and reward people, I would hope it's based on what kind of person they are, not on whether or not they believe or obey him. I gotta tell you, I don't really obey everything in the Bible, which is 'God's word,' but I am a good human being. I don't hurt people, try not to at least, and I try to help people when I can. According to your religion, I'm bound to burn in hell for eternity.\n \n Worship? I dunno, I guess you call it that. I have tons of respect for whatever 'god' there is, but worship? I couldn't worship something which I don't understand enough.\n \n You were 'enlightened?' Umm, I may be wrong, but with what I know about Buddhism, enlightenment is an exceptionally difficult place to reach, like full Buddhahood.\n \n After the traumatic thing happened to you, it's basic psychology to turn away from something where you're entirely dependent on yourself (Buddhism) to turn your life over to another being (Christianity). I'm not saying that's not a valid way to live, I'm just saying that it is psychologically motivated. I'm very happy for you that you found something which makes you happy.\n \n I'm sorry, but I don't see the Bible as the word of God. With what I know of it, and where it came from, I can't see that. I think it 'speaks' to people when they read it because they want to hear it. People don't like the idea of being alone, and Christianity offers companionship.", 
   {}, 
   40906, 
   null, 
   1080200520.0
  ], 
  [
   41017, 
   null, 
   "jitobear", 
   "The worse sin? Hate.", 
   {}, 
   40950, 
   null, 
   1080246000.0
  ], 
  [
   41025, 
   null, 
   "sundowner", 
   "The worst \"sin\" (from a strictly secular point of view, as I don't really believe in \"sin\") is any act, thought, or word that hurts others. -An it harm none, do as ye will.", 
   {}, 
   41017, 
   null, 
   1080248220.0
  ], 
  [
   41033, 
   null, 
   "Tastyfish", 
   "Torture I would say is the worst, murder is pretty much irrleelvant to the person afterwards while torture causes lasting damage over a long period of time and can break a person's mind. But this is wat I think is worse, rather than a sin, as far as sins go I would probably agree that unbelief is the worst as it makes the idea of a sin irrelevant and is the worst thing for a religion (though not for individual people).\n \n \"Yes, I too, see God all around me (I have 7 cats, 5 in, 2 out)\"\n Ok you lost me here, God takes the form of inner cats for you? emoticon_confused \n Not sure I understand what you are getting at (though the image I have of this is amazing;))", 
   {}, 
   41025, 
   null, 
   1080250860.0
  ], 
  [
   41055, 
   null, 
   "Tastyfish", 
   "Ahh, I see, makes more sense. \n Just the one cat for me at the moment (in addition to however many 'inner cats' I feel I have;)).", 
   {}, 
   41033, 
   null, 
   1080258720.0
  ], 
  [
   41067, 
   null, 
   "Ghost", 
   "Tastyfish, I might regret asking...but what image did you haev in your head?", 
   {}, 
   41055, 
   null, 
   1080267600.0
  ], 
  [
   41070, 
   null, 
   "Tastyfish", 
   "A whole load of cats in someones head whispering things (though just meow) to them and you praying to cats. \n That and a god who when asked to do mircles responding with \"I don't do that kind of thing anymore...I just do cats now. You want some cats?\"\n \n Probably just my inner cat telling me I need to start sleeping properly again now I have finsished my essays;)", 
   {}, 
   41067, 
   null, 
   1080268980.0
  ], 
  [
   41129, 
   null, 
   "Ghost", 
   "Tasty, you're hilarious.", 
   {}, 
   41070, 
   null, 
   1080290280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The worst ever?", 
  "url": "http://www.4forums.com/political/religion-debates/2001-worst-ever.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 2001, 
  "discussion_files": [
   [
    "13628.html", 
    "http://www.4forums.com/political/religion-debates/2001-worst-ever-print.html"
   ], 
   [
    "13629.html", 
    "http://www.4forums.com/political/religion-debates/2001-worst-ever-2-print.html"
   ]
  ], 
  "identifier": 2001
 }
]