[
 [
  [
   41202, 
   null, 
   "Rodeo", 
   "While some would argue that because the book of Leviticus comes from the old testiment, it is no longer relevant or applied when the \"new testiment\" supercedes the old. However, in a recent federal court ruling, which I will post in another thread... such clearly demonstrates that the book of Leviticus is alive and actively used to denounce homosexuality by the religous right wing organizations. Therefore, following is a relevant article in respect to the book of Leviticus.\n \n By Unknown Author:\n \n I find it difficult to accept the fact that people are trying to use the Bible to deny gay and lesbian people from having equal rights. They want to use the Bible as a weapon of intolerance against gay and lesbian people and then simply ignore the other &#8220;inconvenient&#8221; or politically incorrect scriptures. \n \n They quote the book of Leviticus where it says, \"You shall not lie with a man as with a woman, it is an abomination\" (Leviticus 20:13) but fail to consider the scripture within its context, which shows us that the book of Leviticus says that: \n \n &#8226; It is an abomination to wear clothes of mixed fibers (cotton/polyester blends are the most popular fabric today); \n \n &#8226; It is an abomination to eat pork; \n \n &#8226; It is an abomination to eat shell fish; \n \n &#8226; It is an abomination to drink milk; \n \n &#8226; It is an abomination to have a blood transfusion; \n \n Unfortunately people have a long-standing habit to read into Scriptures what is not there to justify their own sins or to justify their judgmental nature. Most of these people follow the same path: they pick and choose the parts of the Bible that they want to believe, while ignoring the parts that they find &#8220;inconvenient.&#8221; For example, \n \n &#8226; \"For everyone who curses his father or his mother shall surely be put to death. He has cursed his father or his mother. His blood shall be upon him.\" (Leviticus 20:9) \n \n Imagine what would happen today if we killed every child who was disrespectful to his parents and cursed them. \n \n &#8226; Leviticus 20:10 says that &#8220;If a man commits adultery with another man's wife that both the adulterer and the adulteress must be put to death.&#8221; \n \n Imagine what would happen today if we killed every man who and woman who committed adultery! Most people conveniently choose to ignore this verse! \n \n &#8226; \"If a man lies with a woman during her sickness and uncovers her nakedness, he has discovered her flow, and she has uncovered the flow of her blood. Both of them shall be cut off from her people.\" (Leviticus 20:18) \n \n Imagine what would happen today if we deported every man and woman who had ever had sex together while the woman was having her period, which is exactly what the above verse commands. \n \n &#8226; \"Your male and female slaves are to come from the nations around you; from them you may buy slaves. You may also buy some of the temporary residents living among you and members of their clans born in your country, and they will become your property.\" (Leviticus 25:44-45) \n \n According to this scripture, if I may buy Mexicans, Canadians, Cubans, Koreans, etc., will they still be illegal aliens or will they be considered my personal property? This might be an interesting way of resolving the illegal alien issues we face today. But what are the tax implications with this purchase? \n \n To further demonstrate the absurdity of some biblical scriptures, \"A marriage shall be considered valid only if the wife is a virgin. If the wife is not a virgin, she shall be stoned to death.\" (Deut 22:13-21) Why then did the Christian world go to arms about the proposed stoning of an Iranian woman who was accused of having a child out of wedlock. After all, the Iranians were following biblical scripture just like the religious right wants to follow and enforce Leviticus 20:13. \n \n Also, \"If a married man dies without children, his brother shall marry the widow. If he refuses to marry his brother's widow or deliberately does not give her children, he shall pay a fine of one shoe and be otherwise punished in a manner to be determined by law.\" (Gen. 38:6-10; Deut 25:5-10). I don&#8217;t know of many religious organizations enforcing this law, and it is stated twice! \n \n But even worse, my neighbor is a fireman who insists on working on the Sabbath. Exodus 35:2 clearly states he should be put to death. Am I morally obligated to kill him myself or is there a religious organization that will take &#8220;moral&#8221; responsibility for fulfilling this biblical commandment? (Oh wait, I forgot! We passed legislation that now makes permissible to work on the Sabbath.) \n \n Exodus 21:7 says that I may sell my daughter into slavery, but Family Services frowned upon that when I asked what a fair price would be for her. They said they would put me in jail if I tried to sell her into slavery even though the Bible clearly says that I can. \n \n Many Christians argue that these verses are from the old &#8220;Mosaic law\" and that it is NOT OK to own slaves and that it IS OK to shave or wear clothes with two different fibers. They say that these scriptures are not meant to be taken literally for our modern day. I agree completely! \n \n THAT IS THE POINT!!! \n \n If these verses are NOT meant for today, then the anti-gay verses can not be meant for today, EITHER. You can't say on one hand that, \"Those verses are part of the old Mosaic Code\" while selectively using OTHER verses in that same code against another group of people. \n \n The Old Mosaic code forbade homosexuality for a very simple, logical reason. The Jews believed that it was a sin for a man \"to waste his seed\". They believed that a man only had a limited number of sperm and once it was used up he could never have children again. \n \n Therefore, since the Jews did not have the benefit of modern science, they declared that sex must only be used for procreation. This is completely understandable since they were in desperate need to grow the Jewish population. Today, however, it is foolish to take that verse out of context, given our historical understanding of its purpose. It is also foolish to apply a 4,000 year old admonition against homosexuality to our modern day, especially when we understand the reasons why it was made Old Testament law. \n \n But it is not only the old Mosaic law that is being followed randomly: \n \n &#8226; \"Women should be silent in the churches, for they are not permitted to speak, but should be submissive, as the law also says.\" (1 Corinthians 14:34) \n \n This verse says that women must not speak in church. This verse is completely ignored today. Applying this verse to the modern day church would be ancient, absurd and nonsensical. When it comes to the verses about homosexuality, however, Christians insist that they must be interpreted literally, word for word. (Oh wait, this is the scripture that the Catholic church uses to degrade women and deny them the right to be priests.) \n \n &#8226; \"Slaves, obey your human masters with fear and trembling, in the sincerity of your heart, as to Christ.\" (Ephesians 6:5) \n \n &#8226; \"Slaves, obey your human masters in everything; don't work only while being watched, in order to please men, but work wholeheartedly, fearing the Lord.\" (Colossians 3:22) \n \n &#8226; \"Slaves are to be submissive to their masters in everything, and to be well-pleasing, not talking back.\" (Titus 2:9) \n \n &#8226; \"Slaves, submit yourselves to your masters with all respect, not only to the good and gentle but also to the cruel.\" (1 Peter 2:18) \n \n Slaves should obey their masters? Hardly. Slavery was one of the most offensive institutions to ever befall humanity. Sadly, the scriptures condoned it, and, as you can see from the above verses, demanded that slaves obey their masters...even cruel ones! \n \n Many Christians \"pick and choose\" which Bible verses that they like to declare as \"the infallible Word of God\" while quietly ignoring or even explaining away the ones that appear above. When it comes to the verses about homosexuality, however, they constantly assert that what is being said is to be taken literally and without exception. \n \n If the Bible is the literal Word of God, then every verse in it must be taken literally. Some verses cannot be taken word-for-word while others are dismissed outright. That is called hypocrisy!!! \n \n The above verses prove that a fundamentalist interpretation of scripture produces irrationalities, profound inconsistencies and double standards. \n \n In light of the discussions that I have had over the past few days, I come back to my original question: Is there a logical &#8230; repeat &#8220;LOGICAL&#8221; &#8230; not religious reason why gays should not be allowed to marry? \n \n So far, EVERY argument that has been made against gay and lesbian marriage has focused on one reason and one reason only: the Bible. As shown above, the religious right attempting to use ideas and ideologies that were written before airplanes and cars were built, before man walked on the moon, before we had penicillin, and before we even had refrigeration. Therefore these biblical scriptures must be interpreted in light of their language, their living conditions, and their understanding of the world at that time, because as we have shown above, the old &#8220;laws&#8221; are not applicable in our day and age! \n \n For example, the admonitions not to eat pork and shell fish (Leviticus 10:10) were based on microbial and parasitic foodborne illnesses of the time, not a directive from God! But since it is in the Bible, why aren&#8217;t we seeking a constitutional amendment to close down Joe&#8217;s Crab Shack, Red Lobster, and so forth? Or are there lesser and greater abominations? \n \n The Bible can NOT be the sole authority for denying anyone&#8217;s rights: slave, gay and lesbian, man or woman. And we simply cannot let activist religious zealots redefine the US Constitution for their bigoted, discriminatory ideas and use it as a divisive tool to further their religious agenda! \n \n Have we already forgotten that Hitler used similar bigoted, discriminatory divisive ideas to separate, persecute and kill millions of Gays, Jews, gypsies, Soviet POWs, the mentally and physically handicapped, and so on? \n \n I have read and studied the US Constitution very carefully, and I have not found a single &#8211; or even a remote -- reference where certain rights are reserved for a single class of people -- for example, &#8220;marriage&#8221; to be reserved for a man and a woman &#8211; or that the bible could be used as a underpinning for laws limiting the rights of others. (Besides, which translation would be used?) More specifically, the US Constitution explicitly prohibits laws to be passed that deny rights for one class of people. \n \n According to the Bill of Rights, Amendment 1, &#8220;Congress shall make no law respecting an establishment of religion&#8230;.&#8221; This amendment forbids Congress to set up or in any way endorse, aid, or enforce religious doctrines. Yet President Bush, Senate Majority Leader Bill Frist, Rep. Marilyn Musgrave and others are seeking to use the Constitution to limit the rights and liberties of gays and lesbians in the United States based upon their personal fundamentalist religious views. \n \n I truly believe that the actions of these individuals are politically motivated by the religious right in an effort to obtain political favor. \n \n There are at least 1,049 protections, benefits and responsibilities extended to married couples under federal law. These same protections, benefits and responsibilities MUST be guaranteed to gays and lesbians as well, and NOT limited because of a religious faith-based initiative!!! \n \n Marriage equality DOES build on America&#8217;s tradition of moving civil rights forward and erasing the inequities of the past. \n \n I am a gay man of Native American heritage, I would LOVE to share with you the stories my grandmother told about inequities based on white man&#8217;s politics and religious views!!! Her tribe was almost totally eradicated because of religious faith-based initiatives in the late 1800s! \n \n More than 10 nations already allow same-sex couples to get married. The fact that excluding same-sex couples from marriage has a long history in this country doesn&#8217;t mean that this policy is in keeping with &#8220;American&#8221; values. The real tradition in this country has been to pass laws to safeguard the American people and to expand laws where they leave citizens unprotected. It is also an American tradition to abandon discriminatory laws, even if they are popular &#8211; as were bans on interracial marriage until 1960. \n \n The Constitution promises liberty and justice to all Americans, not just the religious. Opponents of marriage equality are pushing a divisive measure that would amend the U.S. Constitution to state that marriage &#8220;shall consist only of the union of a man and a woman.&#8221; The Constitution has been used throughout American history to ensure, protect and expand the individual liberties of Americans. It has never been amended to single out a class of people for unequal treatment, but it has been amended to grant freedom of speech, religious liberty and voting rights for women. The Constitution was written to secure equality, not restrict it. \n \n As voting, tax-paying citizens, we must all take immediate action to stop prejudice inspired by religious fanatics, to put an end to ignorance and intolerance, and to protect and guarantee the Constitutional rights of ALL Americans whether they are gay or straight!", 
   {
    "post_info": {
     "post_title": "Bibilical Scriptures v. Hypocritical Positions"
    }
   }, 
   null, 
   null, 
   1080340740.0
  ], 
  [
   41333, 
   null, 
   "mizmaxx", 
   "Hi Rodeo,\n \n I agree whole-heartedly. I think it's absurd the way some people pick and choose Bible verses out of context to legitimize their bigotry. They are the same ones who said it was their God that gave them the right to colonize us! They don't even bother to follow their own rules. emoticon_angry \n \n There are going to be people who will argue from a Christian perspective that is based on writings other than the Bible (for example, my pal Montalban). I have yet to see any reason for persecuting homosexuals that isn't based on religious or secular bigotry. \n \n BTW what nation are you? I'm Eastern Metis myself... I hope you stick around these forums...", 
   {}, 
   41202, 
   null, 
   1080466560.0
  ], 
  [
   41372, 
   null, 
   "carla5010", 
   "Great post. While being a Christian myself, I am greatly disturbed by the very right-wing leaning that many Chruches in America have taken, and I am finding myslef taking sides that generally go against those of the prevailing religious argument.", 
   {}, 
   41202, 
   null, 
   1080514020.0
  ], 
  [
   41522, 
   null, 
   "iwakar", 
   "While some would argue that because the book of Leviticus comes from the old testiment, it is no longer relevant or applied when the \"new testiment\" supercedes the old. However, in a recent federal court ruling, which I will post in another thread... such clearly demonstrates that the book of Leviticus is alive and actively used to denounce homosexuality by the religous right wing organizations. Therefore, following is a relevant article in respect to the book of Leviticus.\n \n By Unknown Author:\n \n I find it difficult to accept the fact that people are trying to use the Bible to deny gay and lesbian people from having equal rights. They want to use the Bible as a weapon of intolerance against gay and lesbian people and then simply ignore the other \"inconvenient\" or politically incorrect scriptures. \n \n They quote the book of Leviticus where it says, \"You shall not lie with a man as with a woman, it is an abomination\" (Leviticus 20:13) but fail to consider the scripture within its context, which shows us that the book of Leviticus says that: \n \n \u0095 It is an abomination to wear clothes of mixed fibers (cotton/polyester blends are the most popular fabric today); \n \n \u0095 It is an abomination to eat pork; \n \n \u0095 It is an abomination to eat shell fish; \n \n \u0095 It is an abomination to drink milk; \n \n \u0095 It is an abomination to have a blood transfusion; \n \n Unfortunately people have a long-standing habit to read into Scriptures what is not there to justify their own sins or to justify their judgmental nature. Most of these people follow the same path: they pick and choose the parts of the Bible that they want to believe, while ignoring the parts that they find \"inconvenient.\" For example, \n \n \u0095 \"For everyone who curses his father or his mother shall surely be put to death. He has cursed his father or his mother. His blood shall be upon him.\" (Leviticus 20:9) \n \n Imagine what would happen today if we killed every child who was disrespectful to his parents and cursed them. \n \n \u0095 Leviticus 20:10 says that \"If a man commits adultery with another man's wife that both the adulterer and the adulteress must be put to death.\" \n \n Imagine what would happen today if we killed every man who and woman who committed adultery! Most people conveniently choose to ignore this verse! \n \n \u0095 \"If a man lies with a woman during her sickness and uncovers her nakedness, he has discovered her flow, and she has uncovered the flow of her blood. Both of them shall be cut off from her people.\" (Leviticus 20:18) \n \n Imagine what would happen today if we deported every man and woman who had ever had sex together while the woman was having her period, which is exactly what the above verse commands. \n \n \u0095 \"Your male and female slaves are to come from the nations around you; from them you may buy slaves. You may also buy some of the temporary residents living among you and members of their clans born in your country, and they will become your property.\" (Leviticus 25:44-45) \n \n According to this scripture, if I may buy Mexicans, Canadians, Cubans, Koreans, etc., will they still be illegal aliens or will they be considered my personal property? This might be an interesting way of resolving the illegal alien issues we face today. But what are the tax implications with this purchase? \n \n To further demonstrate the absurdity of some biblical scriptures, \"A marriage shall be considered valid only if the wife is a virgin. If the wife is not a virgin, she shall be stoned to death.\" (Deut 22:13-21) Why then did the Christian world go to arms about the proposed stoning of an Iranian woman who was accused of having a child out of wedlock. After all, the Iranians were following biblical scripture just like the religious right wants to follow and enforce Leviticus 20:13. \n \n Also, \"If a married man dies without children, his brother shall marry the widow. If he refuses to marry his brother's widow or deliberately does not give her children, he shall pay a fine of one shoe and be otherwise punished in a manner to be determined by law.\" (Gen. 38:6-10; Deut 25:5-10). I don't know of many religious organizations enforcing this law, and it is stated twice! \n \n But even worse, my neighbor is a fireman who insists on working on the Sabbath. Exodus 35:2 clearly states he should be put to death. Am I morally obligated to kill him myself or is there a religious organization that will take \"moral\" responsibility for fulfilling this biblical commandment? (Oh wait, I forgot! We passed legislation that now makes permissible to work on the Sabbath.) \n \n Exodus 21:7 says that I may sell my daughter into slavery, but Family Services frowned upon that when I asked what a fair price would be for her. They said they would put me in jail if I tried to sell her into slavery even though the Bible clearly says that I can. \n \n Many Christians argue that these verses are from the old \"Mosaic law\" and that it is NOT OK to own slaves and that it IS OK to shave or wear clothes with two different fibers. They say that these scriptures are not meant to be taken literally for our modern day. I agree completely! \n \n THAT IS THE POINT!!! \n \n If these verses are NOT meant for today, then the anti-gay verses can not be meant for today, EITHER. You can't say on one hand that, \"Those verses are part of the old Mosaic Code\" while selectively using OTHER verses in that same code against another group of people. \n \n The Old Mosaic code forbade homosexuality for a very simple, logical reason. The Jews believed that it was a sin for a man \"to waste his seed\". They believed that a man only had a limited number of sperm and once it was used up he could never have children again. \n \n Therefore, since the Jews did not have the benefit of modern science, they declared that sex must only be used for procreation. This is completely understandable since they were in desperate need to grow the Jewish population. Today, however, it is foolish to take that verse out of context, given our historical understanding of its purpose. It is also foolish to apply a 4,000 year old admonition against homosexuality to our modern day, especially when we understand the reasons why it was made Old Testament law. \n \n But it is not only the old Mosaic law that is being followed randomly: \n \n \u0095 \"Women should be silent in the churches, for they are not permitted to speak, but should be submissive, as the law also says.\" (1 Corinthians 14:34) \n \n This verse says that women must not speak in church. This verse is completely ignored today. Applying this verse to the modern day church would be ancient, absurd and nonsensical. When it comes to the verses about homosexuality, however, Christians insist that they must be interpreted literally, word for word. (Oh wait, this is the scripture that the Catholic church uses to degrade women and deny them the right to be priests.) \n \n \u0095 \"Slaves, obey your human masters with fear and trembling, in the sincerity of your heart, as to Christ.\" (Ephesians 6:5) \n \n \u0095 \"Slaves, obey your human masters in everything; don't work only while being watched, in order to please men, but work wholeheartedly, fearing the Lord.\" (Colossians 3:22) \n \n \u0095 \"Slaves are to be submissive to their masters in everything, and to be well-pleasing, not talking back.\" (Titus 2:9) \n \n \u0095 \"Slaves, submit yourselves to your masters with all respect, not only to the good and gentle but also to the cruel.\" (1 Peter 2:18) \n \n Slaves should obey their masters? Hardly. Slavery was one of the most offensive institutions to ever befall humanity. Sadly, the scriptures condoned it, and, as you can see from the above verses, demanded that slaves obey their masters...even cruel ones! \n \n Many Christians \"pick and choose\" which Bible verses that they like to declare as \"the infallible Word of God\" while quietly ignoring or even explaining away the ones that appear above. When it comes to the verses about homosexuality, however, they constantly assert that what is being said is to be taken literally and without exception. \n \n If the Bible is the literal Word of God, then every verse in it must be taken literally. Some verses cannot be taken word-for-word while others are dismissed outright. That is called hypocrisy!!! \n \n The above verses prove that a fundamentalist interpretation of scripture produces irrationalities, profound inconsistencies and double standards. \n \n In light of the discussions that I have had over the past few days, I come back to my original question: Is there a logical ... repeat \"LOGICAL\" ... not religious reason why gays should not be allowed to marry? \n \n So far, EVERY argument that has been made against gay and lesbian marriage has focused on one reason and one reason only: the Bible. As shown above, the religious right attempting to use ideas and ideologies that were written before airplanes and cars were built, before man walked on the moon, before we had penicillin, and before we even had refrigeration. Therefore these biblical scriptures must be interpreted in light of their language, their living conditions, and their understanding of the world at that time, because as we have shown above, the old \"laws\" are not applicable in our day and age! \n \n For example, the admonitions not to eat pork and shell fish (Leviticus 10:10) were based on microbial and parasitic foodborne illnesses of the time, not a directive from God! But since it is in the Bible, why aren't we seeking a constitutional amendment to close down Joe's Crab Shack, Red Lobster, and so forth? Or are there lesser and greater abominations? \n \n The Bible can NOT be the sole authority for denying anyone's rights: slave, gay and lesbian, man or woman. And we simply cannot let activist religious zealots redefine the US Constitution for their bigoted, discriminatory ideas and use it as a divisive tool to further their religious agenda! \n \n Have we already forgotten that Hitler used similar bigoted, discriminatory divisive ideas to separate, persecute and kill millions of Gays, Jews, gypsies, Soviet POWs, the mentally and physically handicapped, and so on? \n \n I have read and studied the US Constitution very carefully, and I have not found a single - or even a remote -- reference where certain rights are reserved for a single class of people -- for example, \"marriage\" to be reserved for a man and a woman - or that the bible could be used as a underpinning for laws limiting the rights of others. (Besides, which translation would be used?) More specifically, the US Constitution explicitly prohibits laws to be passed that deny rights for one class of people. \n \n According to the Bill of Rights, Amendment 1, \"Congress shall make no law respecting an establishment of religion....\" This amendment forbids Congress to set up or in any way endorse, aid, or enforce religious doctrines. Yet President Bush, Senate Majority Leader Bill Frist, Rep. Marilyn Musgrave and others are seeking to use the Constitution to limit the rights and liberties of gays and lesbians in the United States based upon their personal fundamentalist religious views. \n \n I truly believe that the actions of these individuals are politically motivated by the religious right in an effort to obtain political favor. \n \n There are at least 1,049 protections, benefits and responsibilities extended to married couples under federal law. These same protections, benefits and responsibilities MUST be guaranteed to gays and lesbians as well, and NOT limited because of a religious faith-based initiative!!! \n \n Marriage equality DOES build on America's tradition of moving civil rights forward and erasing the inequities of the past. \n \n I am a gay man of Native American heritage, I would LOVE to share with you the stories my grandmother told about inequities based on white man's politics and religious views!!! Her tribe was almost totally eradicated because of religious faith-based initiatives in the late 1800s! \n \n More than 10 nations already allow same-sex couples to get married. The fact that excluding same-sex couples from marriage has a long history in this country doesn't mean that this policy is in keeping with \"American\" values. The real tradition in this country has been to pass laws to safeguard the American people and to expand laws where they leave citizens unprotected. It is also an American tradition to abandon discriminatory laws, even if they are popular - as were bans on interracial marriage until 1960. \n \n The Constitution promises liberty and justice to all Americans, not just the religious. Opponents of marriage equality are pushing a divisive measure that would amend the U.S. Constitution to state that marriage \"shall consist only of the union of a man and a woman.\" The Constitution has been used throughout American history to ensure, protect and expand the individual liberties of Americans. It has never been amended to single out a class of people for unequal treatment, but it has been amended to grant freedom of speech, religious liberty and voting rights for women. The Constitution was written to secure equality, not restrict it. \n \n As voting, tax-paying citizens, we must all take immediate action to stop prejudice inspired by religious fanatics, to put an end to ignorance and intolerance, and to protect and guarantee the Constitutional rights of ALL Americans whether they are gay or straight!\n\n \n Joe Conason is great.", 
   {
    "post_info": {
     "post_title": "Was that Joe Conason?"
    }, 
    "unicode_changes_made": true
   }, 
   41202, 
   null, 
   1080598740.0
  ], 
  [
   41554, 
   null, 
   "plotter", 
   "Great post,\n \n What can one say? The silence from the right wing religous fanatics is deafening.", 
   {}, 
   41522, 
   null, 
   1080610980.0
  ], 
  [
   41573, 
   null, 
   "galton", 
   "Great post,\n \n What can one say? The silence from the right wing religous fanatics is deafening.\n\n \n I don't believe the Bible is factual, yet I am dead set against legalizing gay marriage. Your claim that only right wing religious fanatics would argue against legalizing gay marriage is belied by poll after poll shows that at least 60% of Americans are against homosexual marriage. And for many of the rest, it is just an attitude of tolerance, not that they positively value homosexual marriage. It is just this attitude of \"whatever people want to do\" or \"anything goes\" that is a major problem in our culture right now. That is just plain nihilism: there are no authoritative values, no right and wrong. If you want to move in with a goat, who am I to question it? Personally, I have nothing against homosexuality, but it is high time we said enough nihilism! For the last 40 years, we have been unable to tell anyone \"NO!\" If we destroy all the traditional restraints, there will be nothing in the way of every imaginable impulse from having free reign. Freud said \"Civilization is only made possible by individual renouncement.\" He knew that unchecked animal passions will eventually lead to the destruction of civilization. On our present course, we will one day see the ruins of a once great society. But at least we'll be able to say, \"Well at least we didn't judge anybody!\" \n \n Any healthy society requires an authoritative moral structure to lead people to prosocial behavior. The bedrock of that structure in the U.S. has been the Bible, and when you discredit it, people find themselves in a moral vacuum where there are only personal tastes and preferences, and Freud was right that people run only by their ids ends up in chaos. As I said before, gay marriage itself is not that big of a deal to me, and I might go along with the cultural nihilists if they would promise me this was the very LAST time they would destroy another traditional value. But I know them too well; their logic will never let them stop.", 
   {}, 
   41554, 
   null, 
   1080616440.0
  ], 
  [
   41782, 
   null, 
   "mizmaxx", 
   " Personally, I have nothing against homosexuality, but it is high time we said enough nihilism! For the last 40 years, we have been unable to tell anyone \"NO!\" If we destroy all the traditional restraints, there will be nothing in the way of every imaginable impulse from having free reign.\n\n Galton, I would just like to thank you so much for writing that- it kept me entertained for a good half an hour. My friend and I were laughing and laughing! It has to be one of the funniest things I've seen in a long time. I'm saving it.\n \n \nAs I said before, gay marriage itself is not that big of a deal to me, and I might go along with the cultural nihilists if they would promise me this was the very LAST time they would destroy another traditional value.\n\n Awww..... come on! Just one more! I really wanna make people stop walking around with clothes on. Then, I promise I'll stop... Please?", 
   {}, 
   41573, 
   null, 
   1080720600.0
  ], 
  [
   41826, 
   null, 
   "sundowner", 
   "\u0095 It is an abomination to have a blood transfusion; \n \n \n I liked the post, however I must point out that at the time Leviticus was written, there were no such things as blood transfusions. I don't know where this comes from, could you explain? Or is this an interpretation of some scripture stating you may not mix your blood with others? If so, what about auto-transfusion?", 
   {}, 
   41782, 
   null, 
   1080756120.0
  ], 
  [
   41892, 
   null, 
   "thelostmarble", 
   "Originally posted by Galton:\n \n Your claim that only right wing religious fanatics would argue against legalizing gay marriage is belied by poll after poll shows that at least 60% of Americans are against homosexual marriage. And for many of the rest, it is just an attitude of tolerance, not that they positively value homosexual marriage. It is just this attitude of \"whatever people want to do\" or \"anything goes\" that is a major problem in our culture right now. That is just plain nihilism: there are no authoritative values, no right and wrong. If you want to move in with a goat, who am I to question it? Personally, I have nothing against homosexuality, but it is high time we said enough nihilism! For the last 40 years, we have been unable to tell anyone \"NO!\" If we destroy all the traditional restraints, there will be nothing in the way of every imaginable impulse from having free reign.\n\n \n Yeah, I know. Society has really gone downhill over the years. Remember good, old-fashioned slavery? How about witch hunts? Good times, eh? Heck, I feel like protesting nihilism right about now, let's go rape and torture some Native Americans for trespassing on our land. \n \n But you know what really makes me mad? The Civil Rights movement! What makes those fraggin' (insert offensive racial slur) think they deserve equal rights like us smarter white people? Or how about Title IX! I mean, come on! A bunch of (insert offensive term for female dog) think they should be able to play sports? Hey, did you know they're letting people have biracial marriages now? They can even have kids!\n \n I won't deny that our society has some serious issues, Galton. Like maybe prejudice. What bothers me is that you believe homosexual marriage will make things worse. If anything, I think it would help prevent our apparently imminent dissolution into anarchy, by instituting order. Homosexuality is already recognized by society. It's time for thee government to do that also. And it doesn't matter if 60% of Americans disagree with that, the majority cannot take away the rights of the minority, or refuse to give them to it in the first place. Our government, if it carries out its promises in the Constitution, doesn't-- or shouldn't-- allow that. \n \n \nunchecked animal passions will eventually lead to the destruction of civilization.\n\n \n Oh sure. Yep, I totally belive that you have nothing against homosexuality.", 
   {}, 
   41826, 
   null, 
   1080773520.0
  ], 
  [
   41918, 
   null, 
   "galton", 
   "Yeah, I know. Society has really gone downhill over the years. Remember good, old-fashioned slavery? How about witch hunts? Good times, eh? Heck, I feel like protesting nihilism right about now, let's go rape and torture some Native Americans for trespassing on our land. \n \n But you know what really makes me mad? The Civil Rights movement! What makes those fraggin' (insert offensive racial slur) think they deserve equal rights like us smarter white people? Or how about Title IX! I mean, come on! A bunch of (insert offensive term for female dog) think they should be able to play sports? Hey, did you know they're letting people have biracial marriages now? They can even have kids!\n \n I won't deny that our society has some serious issues, Galton. Like maybe prejudice. What bothers me is that you believe homosexual marriage will make things worse. If anything, I think it would help prevent our apparently imminent dissolution into anarchy, by instituting order. Homosexuality is already recognized by society. It's time for thee government to do that also. And it doesn't matter if 60% of Americans disagree with that, the majority cannot take away the rights of the minority, or refuse to give them to it in the first place. Our government, if it carries out its promises in the Constitution, doesn't-- or shouldn't-- allow that. \n \n Oh sure. Yep, I totally belive that you have nothing against homosexuality.\n\n \n \n It is telling that 3 of the injustices that you pick happened more than 100 years ago and, while my comments were concerining the last 40 years. And those old injustices were done more in spite of the influence of traditional morals (Christianity) than through the influence of traditional morality. Christianity more often than not took up charge against these injustices. For example, abolition of slavery would have never occurred without Chistian abolitionists fighting against it. \n \n But in last 40 years, while people like some in this thread have trashed Chistianity and the traditional moral foundation of American society, a tidal wave of social problems the likes of we've never seen before has swept over the country. Crime is several times what it was pre-1960. In the 60s there were a few thousand gang members in the country who were about as nasty as the dancing guys in \"West Side Story\"; now there are 1 million Tech 9-toting gangbangers, dealing drugs to kids and killing them in drive-bys. Addictions are of control: drugs--legal and illegal--gambling, sex, pornography, you name it. The porn industry was underground in the 60s and now it's a multi-billion dollar industry. We supply the world with porn these days. STDS were at low levels; AIDS was non-existent. Now 25% of women have genital herpes and hundreds of thousands are HIV positive. The percent of kids under 15 having sex several times higher than in the past. More than 1 million abortions are performed every year, half of them on fetuses more than 2 months old. Divorce and out-of-wedlock births exploded in the 60s were now 1/2 of kids grow up with little involvement by dad; 70% of blacks kids are born to an unwed mom. Infidelity is way up. I could go on and on, but the list of social ills is getting tedious. \n \n Of course there are a number of reasons why we are in deep moral decline, but one important reason for this is the loss of respect for tradtional notions of right and wrong, with nothing but a moral vacuum remaining. \n \n I'm out of time but will address your other points later.", 
   {}, 
   41892, 
   null, 
   1080782940.0
  ], 
  [
   41923, 
   null, 
   "Nallyo", 
   "\n \u0095 It is an abomination to drink milk; \n \n\n \n Actually I believe that it reads \"A goat (or other animal) cooked in its mother's milk\" which is really not the same thing.", 
   {}, 
   41202, 
   null, 
   1080788520.0
  ], 
  [
   41961, 
   null, 
   "galton", 
   "Yeah, I know. Society has really gone downhill over the years. Remember good, old-fashioned slavery? How about witch hunts? Good times, eh? Heck, I feel like protesting nihilism right about now, let's go rape and torture some Native Americans for trespassing on our land. \n \n But you know what really makes me mad? The Civil Rights movement! What makes those fraggin' (insert offensive racial slur) think they deserve equal rights like us smarter white people? Or how about Title IX! I mean, come on! A bunch of (insert offensive term for female dog) think they should be able to play sports? Hey, did you know they're letting people have biracial marriages now? They can even have kids!\n \n I won't deny that our society has some serious issues, Galton. Like maybe prejudice. What bothers me is that you believe homosexual marriage will make things worse. If anything, I think it would help prevent our apparently imminent dissolution into anarchy, by instituting order. Homosexuality is already recognized by society. It's time for thee government to do that also. And it doesn't matter if 60% of Americans disagree with that, the majority cannot take away the rights of the minority, or refuse to give them to it in the first place. Our government, if it carries out its promises in the Constitution, doesn't-- or shouldn't-- allow that. \n \n \n \n Oh sure. Yep, I totally belive that you have nothing against homosexuality.\n\n \n Thelostmarble: To continue my point: After reading my list of social problems, your implication that the real problem of the present day is prejudice is just not tenable. To illustrate this, hate crimes are about 1% of all crimes committed in the U.S., which shows that general crime is a MUCH bigger problem. This hysteria over prejudice is so disproportionate; way too many people today still are acting like it's still the 1950s when prejudice was of central importance. The culture has everyone so hysterical, you can't help but focus like a laser beam to find prejudice in my comments, which only leads you to misunderstand my argument. \n \n When I wrote of animal passions, I was laying out the argument that a moral structure is needed because there exists many destructive instincts in humans. A powerful morality helps one to resist negative impulses. The is a general argument which is intended to reveal how nihilism is so dangerous. This argument had nothing to do with homosexuality, and I was not referring to homosexuality when I spoke of animal passions. \n \n I am not saying homosexual marriage is what will make things worse. What makes things worse is nihilism. What will happen if we legitimize gay marriage is that we will feed and affirm the nihilism, as we reject tradtional morality and leave a moral vacuum in its wake. \n \n I think you make an excellent point that if a marriage culture took over in the homosexual community, it would exert a positive, stabilizing influence. You are making an argument here that is consistent with my view that traditional values lead to prosocial behavior. If homosexuals were, say, half the community, I would favor homosexual mariage. But the best research shows that less than 3% of men are gay and less than 2% of women are gay, so I am much more concerned about the moral behavior of the 97%. With respect to homosexuality, what the gay community deserves is tolerance. The best traditional morality has always encouraged people to respect differences. Really, the movement that you are part of that wants all people to be treated equally in every way, just stems from the Christian view, but which has been secularized and radicalized. An example of this radicalization is the view that somehow the Constitution guarantees any group anything they feel they deserve.", 
   {}, 
   41892, 
   null, 
   1080844500.0
  ], 
  [
   42010, 
   null, 
   "thelostmarble", 
   "To Galton:\n \n Morality is defined as adherence to a moral code or belief system. This country's traditional morals are Christian. Christianity is centered on the Bible. As the first post in this thread points out, the Bible is flawed. By taking examples from US history I was pointing out that our moral system, too, has had some very obvious flaws. \n \n \n\u0095 \"Slaves, obey your human masters with fear and trembling, in the sincerity of your heart, as to Christ.\" (Ephesians 6:5) \n \n \u0095 \"Slaves, obey your human masters in everything; don't work only while being watched, in order to please men, but work wholeheartedly, fearing the Lord.\" (Colossians 3:22) \n \n \u0095 \"Slaves are to be submissive to their masters in everything, and to be well-pleasing, not talking back.\" (Titus 2:9) \n \n \u0095 \"Slaves, submit yourselves to your masters with all respect, not only to the good and gentle but also to the cruel.\" (1 Peter 2:18) \n \n \n Just a little review that slave owners were Christians, too.\n \n Neither is Christianity the same in its various sects. Look at Catholocism versus Baptism. They have starkly different beliefs. \n \n Our country is shifting from its Christian foundations and yeah, I acknowledge that there is a moral vaccum in its place (nice choice of words by the way, that was very well put). I also agree that allowing homosexual marriage may undermine those ideas and the already weakening bearing they have on society. But not by much. Abolitionists put a stop to slavery, and that did not incite nihilism. Neither did any of the other examples in my previous post. \n \n Also, the condemnation of homosexuality is made in the Old Testament, which (as was pointed out in the beginning of this thread) is outdated and interpreted laxly by many churches. Example:\n \n \n\"If a married man dies without children, his brother shall marry the widow. If he refuses to marry his brother's widow or deliberately does not give her children, he shall pay a fine of one shoe and be otherwise punished in a manner to be determined by law.\" (Gen. 38:6-10; Deut 25:5-10). \n \n \n Few people if any in the Western world practice that religious law today. It is extremely hard to define common morals today unless you revert to the basics like honesty and don't steal, rape, murder, etc.\n \n People have exaggerated the Christisn sinfulness of homosexuality, which is minimally referred to in the Bible and is included under the umbrella term \"sodomy,\" which originally meant sexual perversion. Homophobia is less a law of Christianity than it is an opinion held by the majority. That it is a common value may be true, but the fact is, our traditional morality is not perfect, and corrections such as the Civil Rights movement, Title IX and the Separation of Church and State did not contribute to nihilism; even if they did, it's a price I'm willing to pay if it means social and legal justice, equality for all under the law. Those principles seem to be held in much higher esteem in this nation than any one idea that Christianity provides. If gay marriage ruins this generation's sense of morality any more than it has already been eroded, I will be surprised but not regretful. A homophobic system of values is not worth protecting.\n \n \nOriginally posted by Galton:\n \n The best traditional morality has always encouraged people to respect differences. Really, the movement that you are part of that wants all people to be treated equally in every way, just stems from the Christian view, but which has been secularized and radicalized. An example of this radicalization is the view that somehow the Constitution guarantees any group anything they feel they deserve.\n\n \n Part of respecting differences is not denying them rights that are endowed to the rest of America. Homosexuals do \"deserve\" the right to marry because heterosexuals have that right. I'm gay. I want to know that I will not be discriminated against under the law. I want to know that when I am ready to start a family, my partner and I will be recognized by the government as being committed to each other. I want to know that we will receive the same rights as heterosexual couples do. I want to know that I, as a contributing member of society, will not be denied those rights because gay marriage can be dismissed as the downfall of morality.", 
   {}, 
   41961, 
   null, 
   1080869700.0
  ], 
  [
   42150, 
   null, 
   "galton", 
   "To Galton:\n \n Morality is defined as adherence to a moral code or belief system. This country's traditional morals are Christian. Christianity is centered on the Bible. As the first post in this thread points out, the Bible is flawed. By taking examples from US history I was pointing out that our moral system, too, has had some very obvious flaws. \n \n \n \n Just a little review that slave owners were Christians, too.\n \n Neither is Christianity the same in its various sects. Look at Catholocism versus Baptism. They have starkly different beliefs. \n \n Our country is shifting from its Christian foundations and yeah, I acknowledge that there is a moral vaccum in its place (nice choice of words by the way, that was very well put). I also agree that allowing homosexual marriage may undermine those ideas and the already weakening bearing they have on society. But not by much. Abolitionists put a stop to slavery, and that did not incite nihilism. Neither did any of the other examples in my previous post. \n \n Also, the condemnation of homosexuality is made in the Old Testament, which (as was pointed out in the beginning of this thread) is outdated and interpreted laxly by many churches. Example:\n \n \n \n Few people if any in the Western world practice that religious law today. It is extremely hard to define common morals today unless you revert to the basics like honesty and don't steal, rape, murder, etc.\n \n People have exaggerated the Christisn sinfulness of homosexuality, which is minimally referred to in the Bible and is included under the umbrella term \"sodomy,\" which originally meant sexual perversion. Homophobia is less a law of Christianity than it is an opinion held by the majority. That it is a common value may be true, but the fact is, our traditional morality is not perfect, and corrections such as the Civil Rights movement, Title IX and the Separation of Church and State did not contribute to nihilism; even if they did, it's a price I'm willing to pay if it means social and legal justice, equality for all under the law. Those principles seem to be held in much higher esteem in this nation than any one idea that Christianity provides. If gay marriage ruins this generation's sense of morality any more than it has already been eroded, I will be surprised but not regretful. A homophobic system of values is not worth protecting.\n \n \n \n Part of respecting differences is not denying them rights that are endowed to the rest of America. Homosexuals do \"deserve\" the right to marry because heterosexuals have that right. I'm gay. I want to know that I will not be discriminated against under the law. I want to know that when I am ready to start a family, my partner and I will be recognized by the government as being committed to each other. I want to know that we will receive the same rights as heterosexual couples do. I want to know that I, as a contributing member of society, will not be denied those rights because gay marriage can be dismissed as the downfall of morality.\n\n \n \n One important point I am trying to make is that any social reform which uses the strategy of discrediting Christianity to advance itself hurts our society overall because it weakens our moral structure, which is necessary to encourage prosocial behavior. You frequently make comparisons with slavery or aspects of the civil rights movement, and there are similarities with the gay rights movement, but those movements did not attempt to disprove Christianity to help them win. Rather, they used Christian beliefs to fight their cause, and thereby affiirmed Christianity. \n \n I think you often see gay rights advocates attack Christianity because they know much of the resistance they face is from Christians. I am much more comfortable when someone tries to argue that true Christianity permits homosexuality because this strategy does not attempt to descredit traditional morality, rather it reinterprets it, and does not move us closer to a situation of a moral vacuum. \n \n I could be wrong, but I think the current strategy of the homosexual movement may be counterproductive for that community. Much of the reason why we've seen an incredible resurgence of fundamental Christianity (there are what, maybe 90 million born-agains in the U.S now?) is because of all the social problems I described above. Those social problems do not appear to be dissipating much, and as long as they persist and grow, so will the religious response to it grow. Homosexuals have frequently adopted an in-your-face approach, and have projected a very decadent image, and even when they are trying to do something conventional like marriage, they turn it into civil disobedience and a mockery for the rule of law. It appears that they have chosen a path of war with religious America, and this is a risky choice, and they may very well lose, and it is possible that the future will be worse than the present. \n \n Maybe it is impossible to ever gain acceptance from conservative religious folks, but someone like myself would be much more likely to support a movement that worked within the traditional moral structure and didn't attempt to knock it down. If it is impossible to reconcile Christianity with gay marriage, well then I am in favor of a policy of tolerance toward the gay community--something I am confident can be achieved among religious people--but a tolerance that comes short of gay marriage.", 
   {}, 
   42010, 
   null, 
   1080963960.0
  ], 
  [
   42157, 
   null, 
   "thelostmarble", 
   "One important point I am trying to make is that any social reform which uses the strategy of discrediting Christianity to advance itself hurts our society overall because it weakens our moral structure, which is necessary to encourage prosocial behavior. You frequently make comparisons with slavery or aspects of the civil rights movement, and there are similarities with the gay rights movement, but those movements did not attempt to disprove Christianity to help them win. Rather, they used Christian beliefs to fight their cause, and thereby affiirmed Christianity. \n \n I think you often see gay rights advocates attack Christianity because they know much of the resistance they face is from Christians. I am much more comfortable when someone tries to argue that true Christianity permits homosexuality because this strategy does not attempt to descredit traditional morality, rather it reinterprets it, and does not move us closer to a situation of a moral vacuum. \n \n I could be wrong, but I think the current strategy of the homosexual movement may be counterproductive for that community. Much of the reason why we've seen an incredible resurgence of fundamental Christianity (there are what, maybe 90 million born-agains in the U.S now?) is because of all the social problems I described above. Those social problems do not appear to be dissipating much, and as long as they persist and grow, so will the religious response to it grow. Homosexuals have frequently adopted an in-your-face approach, and have projected a very decadent image, and even when they are trying to do something conventional like marriage, they turn it into civil disobedience and a mockery for the rule of law. It appears that they have chosen a path of war with religious America, and this is a risky choice, and they may very well lose, and it is possible that the future will be worse than the present. \n \n Maybe it is impossible to ever gain acceptance from conservative religious folks, but someone like myself would be much more likely to support a movement that worked within the traditional moral structure and didn't attempt to knock it down. If it is impossible to reconcile Christianity with gay marriage, well then I am in favor of a policy of tolerance toward the gay community--something I am confident can be achieved among religious people--but a tolerance that comes short of gay marriage.\n\n \n Excellent post, Galton. I understand what you're trying to get at. But I also believe that nihilism is impossible to avoid in a civil government. Religiously-based ethics systems are endorsed by our government at the expense of religious equality. I respect Christianity for the morals it introduces into society, because I've been raised, as have many Americans, in them. Unfortunately Christians have beliefs that conflict with the rights of others that are guaranteed by the simple concept of civil government. Recognition for all, despite philosophy/religion/lifestyle. \n \n If society is defined as being irrevocably Christian, then I can see where gay marriage conflicts with social stability. Society and government are reflections of each other. It comes down to this: shake the foundations of the values of society or do nothing to patch up a crack in the foundations of government. When I consider how far nihilism has progressed, I think that gay marriage won't do much to stem the tide or release it further. Either way it would be part of the process of reconciling our social ethics system to our civil government or reinforcing the government's religious associations. The question is which will lead to a greater decline in the overall quality of life for American citizens. \n \n Social unity is an important aspect of quality of life and the gay marriage-inspired culture war is extremely destructive to that. The greatest unifying factor in our diverse nation is our devotion to civil government. Be you Muslim or Jew or Christian or New Age or Pagan or Agnostic, the obviously common respect for individuality is our social glue. And that glue is a thousand times more binding than ever-shifting and rather undefinable (think of all the denominations, the outdated Bible verses) Christian ethics ever will be.\n \n We are in the middle of a social shift, one that is less nihilism so much as a change in what society values altogether. That results in social problems. A Christian revival won't help the situation-- it perpetuates the culture war that Christianity is losing. But unity is attainable, through common faith in the equality provided by the government and tolerance of our fellow citizens. \n \n The traditional morals just don't work anymore. Times are changing, and so is American social structure. Christian codes are morphing into what society needs. The fact that gay marriage is even being considered is evidence of that.", 
   {}, 
   42150, 
   null, 
   1080977820.0
  ], 
  [
   42491, 
   null, 
   "galton", 
   "Excellent post, Galton. I understand what you're trying to get at. But I also believe that nihilism is impossible to avoid in a civil government. Religiously-based ethics systems are endorsed by our government at the expense of religious equality. I respect Christianity for the morals it introduces into society, because I've been raised, as have many Americans, in them. Unfortunately Christians have beliefs that conflict with the rights of others that are guaranteed by the simple concept of civil government. Recognition for all, despite philosophy/religion/lifestyle. \n \n If society is defined as being irrevocably Christian, then I can see where gay marriage conflicts with social stability. Society and government are reflections of each other. It comes down to this: shake the foundations of the values of society or do nothing to patch up a crack in the foundations of government. When I consider how far nihilism has progressed, I think that gay marriage won't do much to stem the tide or release it further. Either way it would be part of the process of reconciling our social ethics system to our civil government or reinforcing the government's religious associations. The question is which will lead to a greater decline in the overall quality of life for American citizens. \n \n Social unity is an important aspect of quality of life and the gay marriage-inspired culture war is extremely destructive to that. The greatest unifying factor in our diverse nation is our devotion to civil government. Be you Muslim or Jew or Christian or New Age or Pagan or Agnostic, the obviously common respect for individuality is our social glue. And that glue is a thousand times more binding than ever-shifting and rather undefinable (think of all the denominations, the outdated Bible verses) Christian ethics ever will be.\n \n We are in the middle of a social shift, one that is less nihilism so much as a change in what society values altogether. That results in social problems. A Christian revival won't help the situation-- it perpetuates the culture war that Christianity is losing. But unity is attainable, through common faith in the equality provided by the government and tolerance of our fellow citizens. \n \n The traditional morals just don't work anymore. Times are changing, and so is American social structure. Christian codes are morphing into what society needs. The fact that gay marriage is even being considered is evidence of that.\n\n \n \n thelostmarble: thought-provoking post. I think the plot thickens as you go beyond talking about traditional morality and nihilism and introduce the new source of morality, secular humanism. I think much goverment action has been morally grounded in secular humanism, and as you say it exercises a powerful effect on society now. \n \n In my view, secular humanism has been effective at encouraging a specific kind of prosocial behavior: kindness toward disempowered groups. As secular humanism has come increasingly to dominate, sympathy for these groups has grown. Unfortunately, as secular humanism has grown in power, so have levels of all the social problems I described above. Evidence indicates that secular humanism has been ineffective at encouraging the kind of prosocial behavior traditional morality has been concerned with. Secular humanism seems quite cozy with the nihilism I am condeming, as the two have grown in tandem and eclipsed traditional Christianity in recent decades. \n \n I also think the evidence contradicts the argument that a revival of Christianty won't reduce all these social problems. In the U.S. in the last 3 decades, especially in the last 15 years, we have seen an explosion of evangelical Christianity, and at the same time, we have seen either a slowing in the growth of social problems, a leveling off, or even a small decrease, as with teen pregnancy for example. I am not advocating a literal return to old Christianity because as the saying goes, you can never go home. But with the evangelical version for example, we see another reinvention of Christianity, another renewal. (By the way, I don't concern myself what is ultimately true or untrue about these beliefs; I am interested in the consequences of beliefs).", 
   {}, 
   42157, 
   null, 
   1081233480.0
  ], 
  [
   42501, 
   null, 
   "JakeCJB", 
   "I also think the evidence contradicts the argument that a revival of Christianty won't reduce all these social problems. In the U.S. in the last 3 decades, especially in the last 15 years, we have seen an explosion of evangelical Christianity, and at the same time, we have seen either a slowing in the growth of social problems, a leveling off, or even a small decrease, as with teen pregnancy for example.\n\n \n Others would argue the fewer social problems and less teen pregnancy were the results of an ageing population, and better economic opportunities. The U.S. is still at the top of the list for teen pregnancy and social ills, compared to other less religious Western countries. Not that religion is the only variable to consider.", 
   {}, 
   42491, 
   null, 
   1081237260.0
  ], 
  [
   42645, 
   null, 
   "galton", 
   "Others would argue the fewer social problems and less teen pregnancy were the results of an ageing population, and better economic opportunities. The U.S. is still at the top of the list for teen pregnancy and social ills, compared to other less religious Western countries. Not that religion is the only variable to consider.\n\n \n Rates of teenage pregnancy have decreased, and rates take the aging of the population into account. Declining unemployment in the 90s may explain some of the improvement in teen pregnancies. Your most compelling fact is Europe. They have managed to keep lower levels of social problems in spite of apparently lower levels of religiosity. One fact that goes in the other direction is that, while Europe has lower levels of social problems than us, they have had an explosion of them over the past few decades just like we have. And this has occurred in tandem with a decline in religion in those countries, just like the U.S. It may be that the U.S. is simply different than Europe in many ways, and that it is more valid to compare the U.S. with itself in the past, rather than against dissimilar countries.", 
   {}, 
   42501, 
   null, 
   1081300020.0
  ], 
  [
   42677, 
   null, 
   "JakeCJB", 
   "Actually, I meant that an ageing population in the U.S. may explain lower levels of social ills such as violent crime and murder. I should have been more clear.", 
   {}, 
   42645, 
   null, 
   1081317780.0
  ], 
  [
   42709, 
   null, 
   "galton", 
   "Actually, I meant that an ageing population in the U.S. may explain lower levels of social ills such as violent crime and murder. I should have been more clear.\n\n \n You're right, good point; Baby Boomers are now in their 40s and 50s, past the prime years for crime. It may be, however, that one reason why older people are more law abiding is that they mature and get the big picture, and get more religious. The most irreligious years--late teens and 20s--are also the most criminal years.", 
   {}, 
   42677, 
   null, 
   1081328100.0
  ], 
  [
   42894, 
   null, 
   "JakeCJB", 
   "All the statistics I've seen indicate that atheists make up a very small number of prison inmates...\n \n http://holysmoke.org/icr-pri.htm", 
   {}, 
   42709, 
   null, 
   1081383360.0
  ], 
  [
   42918, 
   null, 
   "galton", 
   "All the statistics I've seen indicate that atheists make up a very small number of prison inmates...\n \n http://holysmoke.org/icr-pri.htm\n\n \n Since only 5% of Americans are atheists, they make up a small percent of anything. Most people believe in God, and most are affiliated with some denomination, but what matters is how important religion is to them, what is there level of conviction. The vast majority of inmates were not attending services every week prior to incarceration. \n \n Atheists tend to be well educated, very intelligent people, and this type of person has others assests that result in more prosocial behavior. The average inmate has an IQ 0f 90, and it is exactly this kind of person who benefits most from a deep faith.", 
   {}, 
   42894, 
   null, 
   1081390560.0
  ], 
  [
   43085, 
   null, 
   "thelostmarble", 
   "thelostmarble: thought-provoking post. I think the plot thickens as you go beyond talking about traditional morality and nihilism and introduce the new source of morality, secular humanism. I think much goverment action has been morally grounded in secular humanism, and as you say it exercises a powerful effect on society now. \n \n In my view, secular humanism has been effective at encouraging a specific kind of prosocial behavior: kindness toward disempowered groups. As secular humanism has come increasingly to dominate, sympathy for these groups has grown. Unfortunately, as secular humanism has grown in power, so have levels of all the social problems I described above. Evidence indicates that secular humanism has been ineffective at encouraging the kind of prosocial behavior traditional morality has been concerned with. Secular humanism seems quite cozy with the nihilism I am condeming, as the two have grown in tandem and eclipsed traditional Christianity in recent decades. \n \n I also think the evidence contradicts the argument that a revival of Christianty won't reduce all these social problems. In the U.S. in the last 3 decades, especially in the last 15 years, we have seen an explosion of evangelical Christianity, and at the same time, we have seen either a slowing in the growth of social problems, a leveling off, or even a small decrease, as with teen pregnancy for example. I am not advocating a literal return to old Christianity because as the saying goes, you can never go home. But with the evangelical version for example, we see another reinvention of Christianity, another renewal. (By the way, I don't concern myself what is ultimately true or untrue about these beliefs; I am interested in the consequences of beliefs).\n\n \n Galton, you say you don't concern yourself with the truth or falsehood of these beliefs. Does that encourage you to follow them in any way? Do you personally believe in Christianity? Or do you follow your own, separate code of morals (be it the one you were raised in or one you have adopted or developed or whatever) ? Even if your ethics are derived from Christianity, your lack of faith in the Christian god proves that religious faith is not necessary to have a sense of right and wrong. \n \n What makes you believe that the rest of America needs specifically Christian faith in order to be morally upstanding? \n \n Maybe our IQs are too low?\n \n \nBut in last 40 years, while people like some in this thread have trashed Chistianity and the traditional moral foundation of American society, a tidal wave of social problems the likes of we've never seen before has swept over the country.\n\n \n I'm a little lost here. I thought social problems were slowing down and levelling off in the past 15 years? And if they are, then you only have 25 years of un-Christian, chaotic, moral degradation to compare it to. It sounds like a pretty short period of time in which to register such extreme trends. \n And if the apparent upward trend is so light, then what's to say that it was the influence of evangelical Christianity that caused it? What's to say that it hasn't been the advance of secular humanism?", 
   {}, 
   42491, 
   null, 
   1081458300.0
  ], 
  [
   43513, 
   null, 
   "galton", 
   "Galton, you say you don't concern yourself with the truth or falsehood of these beliefs. Does that encourage you to follow them in any way? Do you personally believe in Christianity? Or do you follow your own, separate code of morals (be it the one you were raised in or one you have adopted or developed or whatever) ? Even if your ethics are derived from Christianity, your lack of faith in the Christian god proves that religious faith is not necessary to have a sense of right and wrong. \n \n What makes you believe that the rest of America needs specifically Christian faith in order to be morally upstanding? \n \n Maybe our IQs are too low? \n\n Bringing up my personal experience offers evidence, albeit anecdotal, of what I am arguing for. I was raised in a deeply religious home and was a very moral person through my mid-20s. But over the years I read many of the kinds of arguments you see on a website like this one, arguments discrediting Christianity. I came to be very skeptical of religion and general, and the consequences of that have been generally negative. My behavior is not as moral as it was when I was religious, and I am often plagued with a sense of purposelessness. I think the reason why I remain a more or less moral person is that a strong conscience was developed in my during childhood by parents deeply concerned with morality because they were very religious. I also think that I am more or less moral because I have always been sensitive to ethical issues (out of time--will finish later).", 
   {}, 
   43085, 
   null, 
   1081748820.0
  ], 
  [
   43608, 
   null, 
   "galton", 
   "Galton, you say you don't concern yourself with the truth or falsehood of these beliefs. Does that encourage you to follow them in any way? Do you personally believe in Christianity? Or do you follow your own, separate code of morals (be it the one you were raised in or one you have adopted or developed or whatever) ? Even if your ethics are derived from Christianity, your lack of faith in the Christian god proves that religious faith is not necessary to have a sense of right and wrong. \n \n What makes you believe that the rest of America needs specifically Christian faith in order to be morally upstanding? \n \n Maybe our IQs are too low? \n\n As I was saying, skepticism concerning religion has hurt me morally, spiritually, and psychologically (and in this thread I have not even addressed the spiritual loss and loss of meaning that result from undermining religion). When it comes to behavior, I tend to be more selfish than when I was religious because other non-religious rationales for unselfish behavior behavior are simply not as compelling as the belief that there are absolute rights and wrongs; that God commands or forbids such and such behavior; that your life and the role you play is part of a eternal, transcendent plan, etc. I agree with William James that religious folks are more motivated to sacrifice self than the rest of us are. \n \n As I wrote, I think I have a greater than average concern for moral issues, not only because of my upbringing, but because of a natural procilivity for thinking about abstract principles. It seems to me that people who are very interested in and concerned about abstract issues like ethics tend to be more careful in their behavior, and are more likely to act prosocially. I think people like me benefit from religion too, but there are several other things they frequently draw on that produce good behavior. People who aren't naturally interested in abstract principles tend to fall back on rules to guide behavior, and this is where religion is particularly salient. \n \n I sense that you may be trying to discredit this line of argument by implying that it is elitist, but whether an idea validly reflects the reality of the situation has absolutely nothing to do with what the messenger thinks of himself in comparison with others. The only relevant issues are the evidence and internal consistency of arguments. This kind of argument that attempts to make the other side look bad will not work on me, and it shouldn't work on anyone else. \n \n \n\n I'm a little lost here. I thought social problems were slowing down and levelling off in the past 15 years? And if they are, then you only have 25 years of un-Christian, chaotic, moral degradation to compare it to. It sounds like a pretty short period of time in which to register such extreme trends. \n And if the apparent upward trend is so light, then what's to say that it was the influence of evangelical Christianity that caused it? What's to say that it hasn't been the advance of secular humanism?\n\n \n In my view, the evidence shows a dramatic shift in values starting in the 60's. For example, the percentage of people who felt there is nothing wrong with premarital sex went from a minority to majority percentage in only the last 5 years of the 60's. All the social problems I listed above exploded at the same time. This is evidence that a shift away from traditional values to modern views was part of the reason for the explosion of social problems we saw in the 60s. Those trends have tended to peak in the 80's, and overall have through to the present times. Why the leveling the last 20 years? It must be something that counteracts the impact of the modern views that were unleashed in the 60s. What would that counteveiling trend be? Did the \"do whatever feels good\" mentality of the 60's somehow completely reverse its momemtum and by the 90's was persuasively telling teenagers to not get pregnant? It seems to me that a much more likely explanation was the growth of evangelical Christianity, especially the fantastic growth we have seen during the same period of time that social problems have levelled. Why a leveling and not a complete reversal? Because Christianity is not dominant; it is competing with the forces which were set off in the 60's and which are still very prevalent. \n \n If the traditional social problems I have focused on were produced by a lack of secular humanism or were reduced by its dominance, we would have observed a different trend. Let's take attitudes towards race as a measure of secular humanism. In the 1950's, most whites were against interracial marriage. That attitude gradually changed up to the present day, where only 10% or less of Americans now feel that interracial marriage should be forbidden. Attitudes grew more favorable most rapidly during the 60's and 70's. If traditional social problems went down as secular humanism became more dominant, we should have seen a gradual reduction in these problems over the last 50 years, with the most rapid improvements occuring during the 60's and 70's. But just the opposite is true. The growth of secular humanism has paralleled the growth in traditional social problems. One could argue from these facts that secular humanism actually caused the higher level of social ills, but I would argue that, as I wrote before, that nihilism has shown a cozy relationship with secular humanism, and nihilism is an important cause of social problems. The two have grown together over the past few decades. \n \n I would argue that they have grown together because secular humanism worships humans, but such a belief lacks the authority of a belief system which bases its authority on God. Lacking transcendant authority, some people will opt for an \"anything goes\" morality rather than a \"treat each and every person with dignity\" morality of secular humanism. \n \n The same thing can be shown of trends 100 years ago. Traditional social problems were at an all time during the Victorian age in America in the latter part of the 19th century and early 20th century. That period of time was characterized by a very moralistic Christian culture. But things changed during the Roaring 20's, when teenagers and young adults started to challenge traditions, and for the first time starting hanging out unsupervised in movie theaters, dance halls, and speak-easies, and fooling around in parked cars. Now, to our standards this seems totally tame and benign, but my point is that behavior changes with a rejection of tradtional values, and this rejection can be seen in small ways (like homosexual marriage) but the consequences of this rejection can also be severe. Along with teenage rebellion, the 20's saw a rapid explosion of crime rates, especially murder.", 
   {}, 
   43085, 
   null, 
   1081802940.0
  ], 
  [
   52658, 
   null, 
   "galton", 
   "Galton, I would just like to thank you so much for writing that- it kept me entertained for a good half an hour. My friend and I were laughing and laughing! It has to be one of the funniest things I've seen in a long time. I'm saving it.\n\n I was digging for an old quote and ran across this post. At the time I let it slide because I didn't understand the snickering malice behind the comment. I know the writer better now. Actually, this post helps me know the writer even better because I have observed that little groups of children like to sit around and giggle. \n \n I strongly suspected that I have been debating, say, a 12 year old who, for example, just learned in her history class that Jefferson owned slaves who frowns and says, \"Now I know what a bad man he is.\" Research shows that humans have developed full cognitive capacity by 12 or 13; common sense, on the other hand, is congenitally absent in some folks, and is something that for them doesn't improve with age.", 
   {}, 
   41782, 
   null, 
   1086044820.0
  ], 
  [
   52744, 
   null, 
   "Tastyfish", 
   "Sounds a little ends justify the means to me, what you are proposing would be the descrimination against a minority for the sake of the majority, I'm not sure that attitude is really in the interests of the greater good. \n \n You have mentioned yourself the biggest problem with your ideas though, their is a lot of information out there that conflicts with 'truths' the bible says. If not brought up in a culture that recognises the existance of mystical beings I doubt very much that you would be able to convince them to convert. \n \n It is really impossible to beleive the Bible is 100% accurate but should other 'anti-bibical' things like archeology, cosmology and modern biology be supressed to increase the average morality of the nation? While given if everyone was a devout christian there would be less crime that is pretty much teh same for every belief if everyone is the same. Its impossible to carry out anything like this in reality (even with promoting the church and sticking closer to the teachings with respect to laws) so perhaps other ways of changing the attitudes of the population should be looked at (including promoting acceptance of others over possibly out-dated traditional views).", 
   {}, 
   52658, 
   null, 
   1086134460.0
  ], 
  [
   53044, 
   null, 
   "mana'ia", 
   "While some would argue that because the book of Leviticus comes from the old testiment, it is no longer relevant or applied when the \"new testiment\" supercedes the old. However, in a recent federal court ruling, which I will post in another thread... such clearly demonstrates that the book of Leviticus is alive and actively used to denounce homosexuality by the religous right wing organizations. Therefore, following is a relevant article in respect to the book of Leviticus.\n \n By Unknown Author:\n \n I find it difficult to accept the fact that people are trying to use the Bible to deny gay and lesbian people from having equal rights. They want to use the Bible as a weapon of intolerance against gay and lesbian people and then simply ignore the other \"inconvenient\" or politically incorrect scriptures. \n \n They quote the book of Leviticus where it says, \"You shall not lie with a man as with a woman, it is an abomination\" (Leviticus 20:13) but fail to consider the scripture within its context, which shows us that the book of Leviticus says that: \n \n \n\n \n \n I find it very funny how people think they understand the scriptures when they don't. If you don't read teh entirety of the scriptures then you won't understand the works. It's like tryuing to understand Calculus when they don't understand simple addition.\n \n I'm not claiming to understsand the scriptures completely but I have graduated seminary and did two years of scripture study after high school. So I do have more extensive knowledge of the scriptures thaqn the average person.\n \n First of all the Law of Moses is no longer needed. The purpose of the laws of moses was to correct the sons of Israel.\n \n \n Ex. 18: \n \n \n 15 And Moses said unto his father in law, Because the people come unto me to aenquire\u0095 of God:\n \n 16 When they have a amatter\u0095, they come unto me; and I judge between one and another, and I do make them know the statutes of God, and his laws.\n \n 17 And Moses' father in law said unto him, The thing that thou doest is not good.\n \n 18 Thou wilt surely wear away, both thou, and this people that is with thee: for this thing is atoo\u0095 heavy for thee; thou art not able to perform it thyself alone.\n \n 19 Hearken now unto my voice, I will give thee counsel, and God shall be with thee: aBe\u0095 thou for the people to bGod-ward\u0095, that thou mayest bring the causes unto God:\n \n 20 And thou shalt ateach\u0095 them bordinances\u0095 and claws, and shalt shew them the dway\u0095 wherein they must ewalk, and the work that they must do.\n \n 21 Moreover thou shalt provide out of all the people aable\u0095 men, such as bfear\u0095 God, cmen\u0095 of truth, hating dcovetousness\u0095; and place such over them, to be erulers of thousands, and rulers of fhundreds\u0095, rulers of fifties, and rulers of tens:\n \n 22 And let them ajudge the people at all seasons: and it shall be, that every great matter they shall bring unto thee, but every small matter they shall judge: so shall it be easier for thyself, and they shall bear the bburden with thee.\n \n Mos 13:\n \n 29 And now I say unto you that it was expedient that there should be a law given to the children of Israel, yea, even a very astrict\u0095 law; for they were a stiffnecked people, bquick\u0095 to do iniquity, and slow to remember the Lord their God;\n \n 30 Therefore there was a law\u0095 given them, yea, a law of performances and of ordinances, a law which they were to observe\u0095 strictly from day to day, to keep them in remembrance of God and their duty towards him.\n \n Now Christ came and fulfilled this law\n \n Matt 5\n 17 ¶ Think not that I am come to destroy\u0095 the law, or the prophets: I am not come to destroy, but to fulfil.\n \n 18 For verily I say unto you, Till heaven and earth pass, one jot or one tittle shall in no wise pass from the alaw, till all be fulfilled\u0095.\n \n Luke 24\n \n 44 And he said unto them, These are the words which I spake unto you, while I was yet with you, that all things must be afulfilled, which were written in the law of Moses, and in the prophets, and in the psalms, concerning me.\n \n 45 Then opened he their aunderstanding, that they might understand the scriptures,\n \n Rom 7:\n \n 4 Wherefore, my brethren, ye also are become adead\u0095 to the blaw\u0095 by the body of Christ; that ye should be married to another, even to him who is raised from the dead, that we should bring forth fruit unto God.\n \n 5 aFor\u0095 when we were in the flesh, the bmotions\u0095 of sins, which were by the law, did work in our members to bring forth fruit unto cdeath\u0095.\n \n 6 But now we are adelivered\u0095 from the law, that being bdead\u0095 wherein we were held; that we should serve in newness of cspirit\u0095, and not in the oldness of the letter.\n \n \n Now even after the law of Moses was fulfilled it homosexuality was till condemned.\n \n Col 3\n \n 4 When Christ, who is our alife\u0095, shall bappear\u0095, then shall ye also appear with him in cglory\u0095.\n \n 5 aMortify\u0095 therefore your bmembers\u0095 which are upon the earth; fornication, uncleanness, inordinate affection, evil concupiscence, and dcovetousness, which is eidolatry:\n \n 6 For which things' sake the awrath of God cometh on the children of disobedience:\n \n Tim 3:\n \n 1 THIS know also, that in the alast\u0095 days perilous btimes\u0095 shall come.\n \n 2 For men shall be lovers of their own selves, acovetous, boasters, bproud, blasphemers, cdisobedient to parents, dunthankful, unholy,\n \n 3 Without natural\u0095 affection, ctrucebreakers, dfalse\u0095 accusers, eincontinent\u0095, fierce, despisers of those that are good,\n \n 4 aTraitors, bheady\u0095, chighminded\u0095, lovers of dpleasures more than lovers of God;\n \n So you see there is no hiprocrisy./ Homosexuality is wrong. EVen though we are not perfect Christians strive to obey the commandments. It is a process not an event. \n \n I'll respond to other posts when I get a chance.", 
   {
    "post_info": {
     "post_title": "I'm really busy but I had to respond to this one"
    }, 
    "unicode_changes_made": true
   }, 
   41202, 
   null, 
   1086395880.0
  ], 
  [
   53171, 
   null, 
   "thelostmarble", 
   "Humans translated the Bible. They are not perfect. See below, from the NIV translation:\n \n Colossians 3:5\n 5Put to death, therefore, whatever belongs to your earthly nature: sexual immorality, impurity, lust, evil desires and greed, which is idolatry.\n \n From the NKJV:\n \n Colossians 3:5\n 5Therefore put to death your members which are on the earth: fornication, uncleanness, passion, evil desire, and covetousness, which is idolatry.\n \n From the NASB:\n \n Colossians 3:5\n 5 (3) Therefore consider (4) the members of your earthly body as dead to (5) immorality, impurity, passion, evil desire, and greed, which amounts to idolatry. \n \n From the MSG:\n \n Colossians 3:5\n 5And that means killing off everything connected with that way of death: sexual promiscuity, impurity, lust, doing whatever you feel like whenever you feel like it, and grabbing whatever attracts your fancy. That's a life shaped by things and feelings instead of by God.\n \n Gosh. There are so many different translations, it's almost like you can pick and choose the ones that say what you want. Or maybe I just don't understand these scriptures well enough.", 
   {}, 
   53044, 
   null, 
   1086569160.0
  ], 
  [
   53241, 
   null, 
   "mana'ia", 
   "Humans translated the Bible. They are not perfect. See below, from the NIV translation:\n \n Colossians 3:5\n 5Put to death, therefore, whatever belongs to your earthly nature: sexual immorality, impurity, lust, evil desires and greed, which is idolatry.\n \n From the NKJV:\n \n Colossians 3:5\n 5Therefore put to death your members which are on the earth: fornication, uncleanness, passion, evil desire, and covetousness, which is idolatry.\n \n From the NASB:\n \n Colossians 3:5\n 5 (3) Therefore consider (4) the members of your earthly body as dead to (5) immorality, impurity, passion, evil desire, and greed, which amounts to idolatry. \n \n From the MSG:\n \n Colossians 3:5\n 5And that means killing off everything connected with that way of death: sexual promiscuity, impurity, lust, doing whatever you feel like whenever you feel like it, and grabbing whatever attracts your fancy. That's a life shaped by things and feelings instead of by God.\n \n Gosh. There are so many different translations, it's almost like you can pick and choose the ones that say what you want. Or maybe I just don't understand these scriptures well enough.\n\n Why is it those that have no religious education insist on trying to detroy religion? Why is it that people post something up that they have no comprehension about. \n \n \n Those translations are translations off of translations. They aren't based upon what the original text said it was menat to simplify the scriputres for people with less comprehension of the original translations and also were self serving to some churches. They aren't translations of the untranslated parts. I do agree do to the fact that printing presses weren't invented until 1400s it did hurt the translation of of scriptures. Therefore it is necessary to reconcile the translations flaws with the different translations (different languages).\n \n Also it is through prophets not the scriptures themselves that men received their information. That is how you can determine which one is right.\n \n Have you found your marble yet?", 
   {}, 
   53171, 
   null, 
   1086640860.0
  ], 
  [
   53244, 
   null, 
   "thelostmarble", 
   "Those translations are translations off of translations. They aren't based upon what the original text said it was menat to simplify the scriputres for people with less comprehension of the original translations and also were self serving to some churches.\n\n \n Soooo... if we all agree that the Bible has been mistranslated many times in many ways, then how can you claim that such an obviously flawed source is God's word, verbatim? Especially on a topic like homosexuality, which is referenced in very few places.\n \n \nAlso it is through prophets not the scriptures themselves that men received their information. That is how you can determine which one is right.\n\n \n Please clarify. I can't gain comprehension if your post is incomprehensible. If you mean God spoke through prophets who wrote down his word, well, duh, even I've been forced through Sunday school enough times to figure that out. That just increases the margin of error. Today there is no completely accepted authority on the word of God unless you're Catholic and believe in the Pope. \n \n \nHave you found your marble yet?\n\n \n Honey, I am your lost marble, meant to fill in that little empty space in your brain where God forgot to give you logic.", 
   {}, 
   53241, 
   null, 
   1086642660.0
  ], 
  [
   53310, 
   null, 
   "mana'ia", 
   " Soooo... if we all agree that the Bible has been mistranslated many times in many ways, then how can you claim that such an obviously flawed source is God's word, verbatim? Especially on a topic like homosexuality, which is referenced in very few places.\n\n Obviously it isn't verbatim because the scriptures were written primarily in Hebrew and Greek. Also we don't know if God said those words verbatim or it was paraphrased by the Prophets but it is definitely what the Lord said to His prophets. The fact that it has been referenced to various times and that it was never changed is enough. He doesn't have to refer to it various times to make His point. He destroyed Sodom and Gomorrah and condemned it in the New Testament. He is the same yesterday, today and forever. He does not change but men do. So he changes His laws for them and their needs as He did in the law of moses.\n \n yes even though it has translation flaws does not mean it is unreliable. Sceince itself is contradictory and imperfect. Yet we teach it because most of it is correct. Scientist all the time contradicat and disagree with each other yet we as individuals need to determine for ourselves what is true.\n \n \n \n Please clarify. I can't gain comprehension if your post is incomprehensible. If you mean God spoke through prophets who wrote down his word, well, duh, even I've been forced through Sunday school enough times to figure that out. That just increases the margin of error. Today there is no completely accepted authority on the word of God unless you're Catholic and believe in the Pope. \n\n Prophets today can help us to understand. Even during Biblical times prophets taught from the scriputres as well as preached. They primarily taught from revelations from God. That is how it should still be taught. \n \n \n \n \n Honey, I am your lost marble, meant to fill in that little empty space in your brain where God forgot to give you logic. \n\n If you're my lost marble then I must be your lost softball. Just playing. I like it htat you called me honey. Keep it up, I'm assuming you're a girl.", 
   {}, 
   53244, 
   null, 
   1086723780.0
  ], 
  [
   53421, 
   null, 
   "thelostmarble", 
   "Obviously it isn't verbatim because the scriptures were written primarily in Hebrew and Greek. Also we don't know if God said those words verbatim or it was paraphrased by the Prophets but it is definitely what the Lord said to His prophets. The fact that it has been referenced to various times and that it was never changed is enough.\n\n \n These are the verses you cited:\n \n \n5 Mortify\u0095 therefore your members\u0095 which are upon the earth; fornication, uncleanness, inordinate affection, evil concupiscence, and covetousness, which is idolatry:\n \n 3 Without natural\u0095 affection, trucebreakers, false\u0095 accusers, incontinent\u0095, fierce, despisers of those that are good,\n\n \n Not only are they vague and open to interpretation, but different translations use different phrases that do not refer to homosexuality even obliquely. See one of my previous posts for examples. The New Testament is for the most part, if not totally, silent on this issue.\n \n \nFirst of all the Law of Moses is no longer needed. The purpose of the laws of moses was to correct the sons of Israel.\n\n \n \nHe does not change but men do. So he changes His laws for them and their needs as He did in the law of moses.\n\n \n In the story of Sodom and Gomorrah, Lot offers his two virgin daughters to the mob in front of his house to be raped and beaten (Genesis 19:8). Elsewhere he is described as \"a righteous man\" (2 Peter 2:7). I doubt that God or the church would approve of that action today, believing, as you say, that God and/or the church have seen fit to change His rules to meet the needs of modern humanity. Sodom and Gomorrah is outdated and does not necesssarily apply to today.\n \n Not that any of that even matters. The mob wanted to rape the angels/strangers. They did not want to form committed, consensual relationships. Isn't it possible that God is condemning the act of rape, and not homosexuality?\n \n So, to return to my original point, the Bible has very few valid references to homosexuality. It is also impossible to judge the authenticity of modern-day prophets, so they are not acceptable sources on the word of God.\n \n \nIf you're my lost marble then I must be your lost softball. Just playing. I like it htat you called me honey. Keep it up, I'm assuming you're a girl.\n\n \n Ouch. Nice comeback. Sorry to disappoint you, but while I am a girl, I'm also a lesbian and about ten years younger than you. Guess it's time to fill out my profile.", 
   {}, 
   53310, 
   null, 
   1086827760.0
  ], 
  [
   53423, 
   null, 
   "Tastyfish", 
   "In all fairness though I would guess that Paul at least could well mean homosexuality with the various quoted references. Same with a fair few of the older testament ones. A lot of the passages they come from are hardly shinign beacons of purity, 'Women should be their husband's slaves, but gays, yeah they're fine' seems an odd point of view to me.\n \n \nOuch. Nice comeback. Sorry to disappoint you, but while I am a girl, I'm also a lesbian and about ten years younger than you. Guess it's time to fill out my profile.\n [Dirty mind] Damn...even better [/Dirty mind]...um I mean yeah there are apparent changes in attitude anyway though, just whether this paticular issue is a good one I don't know. Possibly a better one would be teh attitude toward non-isrealites/beleivers changing from 'kill them and rape their women' to 'convert them to save them.'", 
   {}, 
   53421, 
   null, 
   1086828720.0
  ], 
  [
   53591, 
   null, 
   "mana'ia", 
   " These are the verses you cited:\n Not only are they vague and open to interpretation, but different translations use different phrases that do not refer to homosexuality even obliquely. See one of my previous posts for examples. The New Testament is for the most part, if not totally, silent on this issue.\n\n If you understood what the speaker's in the NT were trying to do you'd understand why they sid the things that they did. Prophets and apsotles speak about things that are problems then. Since homosexuality was a big probelm in the Old Testament as evident in Soddom and Gomorrah and not such a problem in Nt times then there wasn't a need for the emphasis then. All prohets taguht according to their times. Paul makes refernce to this that in the lst days there will be homosexuality prevalent Tim 3. That was tio be the sign. How could it be a sign if ti were prevlent then as well? It became prevalent among the ROmans later but his letter were directed at the Jews.\n \n Also as i pointed out earlier thos translations aren't translations. They're simplifications of the KJV. They aren't translated off of the original text. So saying that it's open to the different translations isn't really valid. yes we can receive our own personal interpretations thta doesn't men it's the Lord's meaning though for everyone. \n \n \n \n \n \n \n In the story of Sodom and Gomorrah, Lot offers his two virgin daughters to the mob in front of his house to be raped and beaten (Genesis 19:8). Elsewhere he is described as \"a righteous man\" (2 Peter 2:7). I doubt that God or the church would approve of that action today, believing, as you say, that God and/or the church have seen fit to change His rules to meet the needs of modern humanity. Sodom and Gomorrah is outdated and does not necesssarily apply to today.\n \n Not that any of that even matters. The mob wanted to rape the angels/strangers. They did not want to form committed, consensual relationships. Isn't it possible that God is condemning the act of rape, and not homosexuality?\n \n So, to return to my original point, the Bible has very few valid references to homosexuality. It is also impossible to judge the authenticity of modern-day prophets, so they are not acceptable sources on the word of God.\n\n Lot knew that the mob wanted to sodomize the Angels. As a God fearing man he was willing to do whatever he could to protect the Lord's servants including sacrificng his own daughters. He didnt' want to do it but anyoen that has that love and respect for the Lord wuld be willig to do anything. he knew the sacredness of the Angel's and refused to let harm come to them.\n \n God is codemning Homosexuality becasue he destroyed Soddom and Gomorrah becasue of the prevalence of homosexuality. \n \n How could the people judge the authenticity of prophets during the Biblical times? How can we ever test the authenticity of prophets? The same way we did then we can do now. By their fruits they shall be known.\n \n \n \n Ouch. Nice comeback. Sorry to disappoint you, but while I am a girl, I'm also a lesbian and about ten years younger than you. Guess it's time to fill out my profile. \n\n \n It's all good. You can still hook me up wiht your lesbian freinds that are over 18....just playing.", 
   {}, 
   53421, 
   null, 
   1086983280.0
  ], 
  [
   53592, 
   null, 
   "mana'ia", 
   "In all fairness though I would guess that Paul at least could well mean homosexuality with the various quoted references. Same with a fair few of the older testament ones. A lot of the passages they come from are hardly shinign beacons of purity, 'Women should be their husband's slaves, but gays, yeah they're fine' seems an odd point of view to me.\n \n [Dirty mind] Damn...even better [/Dirty mind]...um I mean yeah there are apparent changes in attitude anyway though, just whether this paticular issue is a good one I don't know. Possibly a better one would be teh attitude toward non-isrealites/beleivers changing from 'kill them and rape their women' to 'convert them to save them.'\n\n Teh whole rape their women thing is an inference that you might get but the scriptures dont' support that point of view.\n \n Also it refers to women letting their husbands lead nto be slaves to them. It also talks about how much husbands shoudl love their wives and treat them kindly. We are all led by world leaders but we are not slaves to them.", 
   {}, 
   53423, 
   null, 
   1086983460.0
  ], 
  [
   53995, 
   null, 
   "terral03", 
   "Greetings to Plotter and All:\n \n Plotter wrote << What can one say? The silence from the right wing religious fanatics is deafening.\n \n Terral's reply << And this from a group of people trying desperately to gain more rights because of their sexual orientation. Have you heard of the words \"We the people . . .?\" That does not say \"We the heterosexual people . . .\" Homosexuals have the same rights as bible teachers in this country. So do not sit here and complain, because the world is not willing lavish you with extra rewards for the deviant behavior of a depraved mind. And, let's not pretend that this is just an Old Testament issue. BTW, Gentiles have never been under Mosaic Law (See Romans 2:14), those laws apply only to Israel of the flesh. \n \n The fact that God believes homosexuals are worthy of death is included in the Apostle Paul's very first chapter to the Romans in your New Testament. The description is a bit lengthy, so please bear with me. Also note that this topic is about much more than just sexual acts. As it is written, \n \n \"For since the creation of the world His invisible attributes, His eternal power and divine nature, have been clearly seen, being understood through what has been made, so that they are without excuse. For even though they knew God, they did not honor Him as God or give thanks, but they became futile in their speculations, and their foolish heart was darkened. Professing to be wise, they became fools, and exchanged the glory of the incorruptible God for an image in the form of corruptible man and of birds and four-footed animals and crawling creatures. Therefore God gave them over in the lusts of their hearts to impurity, so that their bodies would be dishonored among them. For they exchanged the truth of God for a lie, and worshiped and served the creature rather than the Creator, who is blessed forever. Amen. FOR THIS REASON God gave them over to degrading passions; for their women exchanged the natural function for that which is unnatural, and in the same way also the men abandoned the natural function of the woman and burned in their desire toward one another, men with men committing indecent acts and receiving in their own persons THE DUE PENALTY OF THEIR ERROR. And just as they did not see fit to acknowledge God any longer, God gave them over to a depraved mind, to do those things which are not proper, being filled with all unrighteousness, wickedness, greed, evil; full of envy, murder, strife, deceit, malice; {they are} gossips, slanderers, haters of God, insolent, arrogant, boastful, inventors of evil, disobedient to parents, without understanding, untrustworthy, unloving, unmerciful; and although they know the ordinance of God, that those who practice such things are worthy of death, they not only do the same, but also give hearty approval to those who practice them.\" Rom. 1:20-32.\n \n Terral continues << This is the Scriptural reason that homosexuals and professing Christians will never 'get along.' However, there is a deeper reason that I believe deserves even greater attention. Scripture records that the Lord God fashioned Adam from the dust of the ground (Gen. 2:7). Then Eve was taken from his side (Gen. 2:22). The two then joined to become one flesh. \"For this reason a man shall leave his father and his mother, and be joined to his wife; and they shall become one flesh.\" Gen. 2:24. The two joined together as one (Adam knew Eve) to beget children (seed), i.e. life. Gen. 4:1.\n \n Scripture records that there are three that bear witness \"For there are three that testify: the spirit and the water and the blood; and the three are into the one.\" 1John 5:7+8. Visualize Adam (before Eve was taken) as having all three of these witnesses within his being. Then, Eve was taken (water part) with the Seed (blood part). The same thing happened to the Last Adam on the cross. \"But one of the soldiers pierced His side with a spear, and immediately blood and water came out.\" John 19:34. \n \n At that time in Genesis, Adam is found in the position of spirit. Woman is in the water position, and the seed is in the blood position. This explains why man is the head of woman. 1Cor. 11:3. That triune relationship is in the image of the heavens (spirit) and the earth (water); Gen. 1:1, and heaven (blood) Gen. 1:8, and the relationship of the Father, Son and Holy Spirit (Matt. 28:19). So the natural family unit has the same features represented by the triune relationship of God Himself. Homosexuality is an abomination to the very framework and structure of an orderly universe. \n \n All natural male/female marriages are based upon this spirit/water/blood relationship described by God's Word. The joining of two homosexual men represents the bonding of one spirit to another, which does not produce life. In like manner the joining homosexual women represents the bonding of two bodies (without spirit), which also does not produce life. Therefore, they are dishonoring their bodies by the practice of these abominations. Those 'professing' Christians who practice such things are deluding themselves (2Thes. 2:7-12 (10)). \n \n God bless,\n \n Terral", 
   {
    "post_info": {
     "post_title": "Real Marriage Produces New Citizens"
    }, 
    "unicode_changes_made": true
   }, 
   41554, 
   null, 
   1087319940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bibilical Scriptures v. Hypocritical Positions", 
  "url": "http://www.4forums.com/political/gay-rights-debates/2019-bibilical-scriptures-v-hypocritical-positions.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 2019, 
  "discussion_files": [
   [
    "4185.html", 
    "http://www.4forums.com/political/gay-rights-debates/2019-bibilical-scriptures-v-hypocritical-positions-print.html"
   ], 
   [
    "4186.html", 
    "http://www.4forums.com/political/gay-rights-debates/2019-bibilical-scriptures-v-hypocritical-positions-3-print.html"
   ], 
   [
    "4187.html", 
    "http://www.4forums.com/political/gay-rights-debates/2019-bibilical-scriptures-v-hypocritical-positions-2-print.html"
   ]
  ], 
  "identifier": 2019
 }
]