[
 [
  [
   41334, 
   null, 
   "Dmann", 
   "Could 9/11 Have Been Prevented?\n Long before the tragic events of September 11th, the White House debated taking the fight to al-Qaeda. It didn't happen and soon it was too late. The saga of a lost chance \n By MICHAEL ELLIOTT \n \n \n \n ERIC DRAPER/WHITE HOUSE/AP\n Bush meets with his senior staff at his ranch one month prior to Sept. 11\n \n \n \n \n Sunday, Aug. 04, 2002\n Sometimes history is made by the force of arms on battlefields, sometimes by the fall of an exhausted empire. often when historians set about figuring why a nation took one course rather than another, they are most interested in who said what to whom at a meeting far from the public eye whose true significance may have been missed even by those who took part in it.\n \n One such meeting took place in the White House situation room during the first week of January 2001. The session was part of a program designed by Bill Clinton's National Security Adviser, Sandy Berger, who wanted the transition between the Clinton and George W. Bush administrations to run as smoothly as possible. With s bitterness, Berger remembered how little he and his colleagues had been helped by the first Bush Administration in 1992-93. Eager to avoid a repeat of that experience, he had set up a series of 10 briefings by his team for his successor, Condoleezza Rice, and her deputy, Stephen Hadley.\n \n Berger attended only one of the briefings-the session that dealt with the threat posed to the U.S. by international terrorism, and especially by al-Qaeda. \"I'm coming to this briefing,\" he told Rice, \"to underscore how important I think this subject is.\" Later, alone in his office with Rice, Berger says he told her, \"I believe that the Bush Administration will spend more time on terrorism generally, and on al-Qaeda specifically, than any other subject.\" The terrorism briefing was delivered by Richard Clarke, a career bureaucrat who had served in the first Bush Administration and risen during the Clinton years to become the White House's point man on terrorism. As chair of the interagency Counter-Terrorism Security Group (CSG), Clarke was known as a bit of an obsessive-just the sort of person you want in a job of that kind. Since the bombing of the U.S.S. Cole in Yemen on Oct. 12, 2000-an attack that left 17 Americans dead-he had been working on an aggressive plan to take the fight to al-Qaeda. The result was a strategy paper that he had presented to Berger and the other national security \"principals\" on Dec. 20. But Berger and the principals decided to shelve the plan and let the next Administration take it up. With less than a month left in office, they did not think it appropriate to launch a major initiative against Osama bin Laden. \"We would be handing (the Bush Administration) a war when they took office on Jan. 20,\" says a former senior Clinton aide. \"That wasn't going to happen.\" Now it was up to Rice's team to consider what Clarke had put together.\n \n Berger had left the room by the time Clarke, using a Powerpoint presentation, outlined his thinking to Rice. A senior Bush Administration official denies being handed a formal plan to take the offensive against al-Qaeda, and says Clarke's materials merely dealt with whether the new Administration should take \"a more active approach\" to the terrorist group. (Rice declined to comment, but through a spokeswoman said she recalled no briefing at which Berger was present.) Other senior officials from both the Clinton and Bush administrations, however, say that Clarke had a set of proposals to \"roll back\" al-Qaeda. In fact, the heading on Slide 14 of the Powerpoint presentation reads, \"Response to al Qaeda: Roll back.\" Clarke's proposals called for the \"breakup\" of al-Qaeda cells and the arrest of their personnel. The financial support for its terrorist activities would be systematically attacked, its assets frozen, its funding from fake charities stopped. Nations where al-Qaeda was causing trouble-Uzbekistan, the Philippines, Yemen-would be given aid to fight the terrorists. Most important, Clarke wanted to see a dramatic increase in covert action in Afghanistan to \"eliminate the sanctuary\" where al-Qaeda had its terrorist training camps and bin Laden was being protected by the radical Islamic Taliban regime. The Taliban had come to power in 1996, bringing a sort of order to a nation that had been riven by bloody feuds between ethnic warlords since the Soviets had pulled out. Clarke supported a substantial increase in American support for the Northern Alliance, the last remaining resistance to the Taliban. That way, terrorists graduating from the training camps would have been forced to stay in Afghanistan, fighting (and dying) for the Taliban on the front lines. At the same time, the U.S. military would start planning for air strikes on the camps and for the introduction of special-operations forces into Afghanistan. The plan was estimated to cost \"several hundreds of millions of dollars.\" In the words of a senior Bush Administration official, the proposals amounted to \"everything we've done since 9/11.\"\n \n And that's the point. The proposals Clarke developed in the winter of 2000-01 were not given another hearing by top decision makers until late April, and then spent another four months making their laborious way through the bureaucracy before they were readied for approval by President Bush. It is quite true that nobody predicted Sept. 11-that nobody guessed in advance how and when the attacks would come. But other things are true too. By last summer, many of those in the know-the spooks, the buttoned-down bureaucrats, the law-enforcement professionals in a dozen countries-were almost frantic with worry that a major terrorist attack against American interests was imminent. It wasn't averted because 2001 saw a systematic collapse in the ability of Washington's national-security apparatus to handle the terrorist threat. \n \n The winter proposals became a victim of the transition process, turf wars and time spent on the pet policies of new top officials. The Bush Administration chose to institute its own \"policy review process\" on the terrorist threat. Clarke told Time that the review moved \"as fast as could be expected.\" And Administration officials insist that by the time the review was endorsed by the Bush principals on Sept. 4, it was more aggressive than anything contemplated the previous winter. The final plan, they say, was designed not to \"roll back\" al-Qaeda but to \"eliminate\" it. But that delay came at a cost. The Northern Alliance was desperate for help but got little of it. And in a bureaucratic squabble that would be farfetched on The West Wing, nobody in Washington could decide whether a Predator drone-an unmanned aerial vehicle (UAV) and the best possible source of real intelligence on what was happening in the terror camps-should be sent to fly over Afghanistan. So the Predator sat idle from October 2000 until after Sept. 11. No single person was responsible for all this. But \"Washington\"-that organic compound of officials and politicians, in uniform and out, with faces both familiar and unknown-failed horribly. \n \n Could al-Qaeda's plot have been foiled if the U.S. had taken the fight to the terrorists in January 2001? Perhaps not. The thrust of the winter plan was to attack al-Qaeda outside the U.S. Yet by the beginning of that year, Mohamed Atta and Marwan Al-Shehhi, two Arabs who had been leaders of a terrorist cell in Hamburg, Germany, were already living in Florida, honing their skills in flight schools. Nawaf Alhazmi and Khalid Almihdhar had been doing the same in Southern California. The hijackers maintained tight security, generally avoided cell phones, rented apartments under false names and used cash-not wire transfers-wherever possible. If every plan to attack al-Qaeda had been executed, and every lead explored, Atta's team might still never have been caught. \n \n But there's another possibility. An aggressive campaign to degrade the terrorist network worldwide-to shut down the conveyor belt of recruits coming out of the Afghan camps, to attack the financial and logistical support on which the hijackers depended-just might have rendered it incapable of carrying out the Sept. 11 attacks. Perhaps some of those who had to approve the operation might have been killed, or the money trail to Florida disrupted. We will never know, because we never tried. This is the secret history of that failure.\n \n UNFINISHED BUSINESS\n Berger was determined that when he left office, Rice should have a full understanding of the terrorist threat. In a sense, this was an admission of failure. For the Clinton years had been marked by a drumbeat of terror attacks against American targets, and they didn't seem to be stopping. \n \n In 1993 the World Trade Center had been bombed for the first time; in 1996 19 American servicemen had been killed when the Khobar Towers, in Dhahran, Saudi Arabia, was bombed; two years later, American embassies in Kenya and Tanzania were attacked. As the millennium celebrations at the end of 1999 approached, the CIA warned that it expected five to 15 attacks against American targets over the New Year's weekend. But three times, the U.S. got lucky. The Jordanians broke up an al-Qaeda cell in Amman; Ahmed Ressam, an Algerian based in Montreal, panicked when stopped at a border crossing from Canada while carrying explosives intended for Los Angeles International Airport; and on Jan. 3, 2000, an al-Qaeda attack on the U.S.S. The Sullivans in Yemen foundered after terrorists overloaded their small boat. \n \n From the start of the Clinton Administration, the job of thwarting terror had fallen to Clarke. A bureaucratic survivor who now leads the Bush Administration's office on cyberterrorism, he has served four Presidents from both parties-staff members joke that the framed photos in his office have two sides, one for a Republican President to admire, the other for a Democrat. Aggressive and legendarily abrasive, Clarke was desperate to persuade skeptics to take the terror threat as seriously as he did. \"Clarke is unbelievably determined, high-energy, focused and imaginative,\" says a senior Clinton Administration official. \"But he's totally insensitive to rolling over others who are in his way.\" By the end of 2000, Clarke didn't need to roll over his boss; Berger was just as sure of the danger.\n \n The two men had an ally in George Tenet, who had been appointed Director of Central Intelligence in 1997. \"He wasn't sleeping on the job on this,\" says a senior Clinton aide of Tenet, \"whatever inherent problems there were in the agency.\" Those problems were immense. Although the CIA claims it had penetrated al-Qaeda, Republican Congressman Saxby Chambliss of Georgia, chairman of the House Intelligence Subcommittee on Terrorism and Homeland Security, doubts that it ever got anywhere near the top of the organization. \"The CIA,\" he says, \"were not able to recruit human assets to penetrate al-Qaeda and the al-Qaeda leadership.\" Nobody pretends that such an exercise would have been easy. Says a counterterrorism official: \"Where are you going to find a person loyal to the U.S. who's willing to eat dung beetles and sleep on the ground in a cave for two or three years? You don't find people willing to do that who also speak fluent Pashtu or Arabic.\" \n \n In the absence of men sleeping with the beetles, the CIA had to depend on less reliable allies. The agency attempted to recruit tribal leaders in Afghanistan who might be persuaded to take on bin Laden; contingency plans had been made for the CIA to fly one of its planes to a desert landing strip in Afghanistan if he was ever captured. (Clinton had signed presidential \"findings\" that were ambiguous on the question of whether bin Laden could be killed in such an attack.) But the tribal groups' loyalty was always in doubt. Despite the occasional abortive raid, they never seemed to get close to bin Laden. That meant that the Clinton team had to fall back on a second strategy: taking out bin Laden by cruise missile, which had been tried after the embassy bombings in 1998. For all of 2000, sources tell Time, Clinton ordered two U.S. Navy submarines to stay on station in the northern Arabian Sea, ready to attack if bin Laden's coordinates could be determined. \n \n But the plan was twice flawed. First, the missiles could be used only if bin Laden's whereabouts were known, and the CIA never definitively delivered that information. By early 2000, Clinton was becoming infuriated by the lack of intelligence on bin Laden's movements. \"We've got to do better than this,\" he scribbled on one memo. \"This is unsatisfactory.\" Second, even if a target could ever be found, the missiles might take too long to hit it. The Pentagon thought it could dump a Tomahawk missile on bin Laden's camp within six hours of a decision to attack, but the experts in the White House thought that was impossibly long. Any missiles fired at Afghanistan would have to fly over Pakistan, and Pakistan's Inter-Services Intelligence agency (ISI) was close to the Taliban. White House aides were sure bin Laden would be tipped off as soon as the Pakistanis detected the missiles. \n \n Berger and Clarke wanted something more robust. On Nov. 7, Berger met with William Cohen, then Secretary of Defense, in the Pentagon. The time had come, said Berger, for the Pentagon to rethink its approach to operations against bin Laden. \"We've been hit many times, and we'll be hit again,\" Berger said. \"Yet we have no option beyond cruise missiles.\" He wanted \"boots on the ground\"-U.S. special-ops forces deployed inside Afghanistan on a search-and-destroy mission targeting bin Laden. Cohen said he would look at the idea, but he and General Hugh Shelton, Chairman of the Joint Chiefs of Staff, were dead set against it. They feared a repeat of Desert One, the 1980 fiasco in which special-ops commandos crashed in Iran during an abortive mission to rescue American hostages. \n \n It wasn't just Pentagon nerves that got in the way of a more aggressive counterterrorism policy. So did politics. After the U.S.S. Cole was bombed, the secretive Joint Special Operations Command at Fort Bragg, N.C., drew up plans to have Delta Force members swoop into Afghanistan and grab bin Laden. But the warriors were never given the go-ahead; the Clinton Administration did not order an American retaliation for the attack. \"We didn't do diddly,\" gripes a counterterrorism official. \"We didn't even blow up a baby-milk factory.\" In fact, despite strong suspicion that bin Laden was behind the attack in Yemen, the CIA and FBI had not officially concluded that he was, and would be unable to do so before Clinton left office. That made it politically impossible for Clinton to strike-especially given the upcoming election and his own lack of credibility on national security. \"If we had done anything, say, two weeks before the election,\" says a former senior Clinton aide, \"we'd be accused of helping Al Gore.\"\n \n For Clarke, the bombing of the Cole was final proof that the old policy hadn't worked. It was time for something more aggressive-a plan to make war against al-Qaeda. One element was vital. The Taliban's control of Afghanistan was not yet complete; in the northeast of the country, Northern Alliance forces led by Ahmed Shah Massoud, a legendary guerrilla leader who had fought against the Soviet invaders of Afghanistan in the 1980s, were still resisting Taliban rule. Clarke argued that Massoud should be given the resources to develop a viable fighting force. That way, terrorists leaving al-Qaeda's training camps in Afghanistan would have been forced to join the Taliban forces fighting in the north. \"You keep them on the front lines in Afghanistan,\" says a counterterrorism official. \"Hopefully you're killing them in the process, and they're not leaving Afghanistan to plot terrorist operations. That was the general approach.\" But the approach meant that Americans had to engage directly in the snake pit of Afghan politics. \n \n THE LAST MAN STANDING\n In the spring of 2001, afghanistan was as rough a place as it ever is. Four sets of forces battled for position. Most of the country was under the authority of the Taliban, but it was not a homogeneous group. Some of its leaders, like Mullah Mohammed Omar, the self-styled emir of Afghanistan, were dyed-in-the-wool Islamic radicals; others were fierce Afghan nationalists. The Taliban's principal support had come from Pakistan-another interested party, which wanted a reasonably peaceful border to its west-and in particular from the hard men of the isi. But Pakistan's policy was not all of a piece either. Since General Pervez Musharraf had taken power in a 1999 coup, some Pakistani officials, desperate to curry favor with the U.S.-which had cut off aid to Pakistan after it tested a nuclear device in 1998-had seen the wisdom of distancing themselves from the Taliban, or at the least attempting to moderate its more radical behavior. The third element was the Northern Alliance, a resistance movement whose stronghold was in northeast Afghanistan. Most of the Alliance's forces and leaders were, like Massoud, ethnic Tajiks-a minority in Afghanistan. Massoud controlled less than 10% of the country and had been beaten back by the Taliban in 2000. Nonetheless, by dint of his personality and reputation, Massoud was \"the only military threat to the Taliban,\" says Francesc Vendrell, who was then the special representative in Afghanistan of the U.N. Secretary-General. \n \n And then there was al-Qaeda. The group had been born in Afghanistan when Islamic radicals began flocking there in 1979, after the Soviets invaded. Bin Laden and his closest associates had returned in 1996, when they were expelled from Sudan. Al-Qaeda's terrorist training camps were in Afghanistan, and bin Laden's forces and money were vital to sustaining the Taliban's offensives against Massoud. \n \n By last spring, the uneasy equilibrium among the four forces was beginning to break down. \"Moderates\" in the Taliban-those who tried to keep lines open to intermediaries in the U.N. and the U.S.-were losing ground. In 2000, Mullah Mohammed Rabbani, thought to be the second most powerful member of the Taliban, had reached out clandestinely to Massoud. \"He understood that our country had been sold out to al-Qaeda and Pakistan,\" says Ahmad Jamsheed, Massoud's secretary. But in April 2001, Rabbani died of liver cancer. By that month, says the U.N.'s Vendrell, \"it was al- Qaeda that was running the Taliban, not vice versa.\" \n \n A few weeks before Rabbani's death, Musharraf's government had started to come to the same conclusion: the Pakistanis were no longer able to moderate Taliban behavior. To worldwide condemnation, the Taliban had announced its intention to blow up the 1,700-year-old stone statues of the Buddha in the Bamiyan Valley. Musharraf dispatched his right-hand man, Interior Minister Moinuddin Haider, to plead with Mullah Omar for the Buddhas to be saved. The Taliban's Foreign Minister and its ambassador to Pakistan, says a Pakistani official close to the talks, were in favor of saving the Buddhas. But Mullah Omar, says a member of the Pakistani delegation, listened to what Haider had to say and replied, \"If on Judgment Day I stand before Allah, I'll see those two statues floating before me, and I know that Allah will ask me why, when I had the power, I did not destroy them.\" A few days later, the Buddhas were blown up. \n \n By summer, Pakistan had a deeper grievance. The country had suffered a wave of sectarian assassinations, with gangs throwing grenades into mosques and murdering clerics. The authorities in Islamabad knew that the murderers had fled to Afghanistan (one of them was openly running a store in Kabul) and sent a delegation to ask for their return. \"We gave them lists of names, photos and the locations of training camps where these fellows could be found,\" says Brigadier Javid Iqbal Cheema, director of Pakistan's National Crisis Management Cell, \"but not a single individual was ever handed over to us.\" The Pakistanis were furious.\n \n As the snows cleared for the annual spring military campaign, a joint offensive against Massoud by the Taliban and al-Qaeda seemed likely. But the influence of al-Qaeda on the Taliban was proving deeply unpopular among ordinary Afghans, especially in the urban centers. \"I thought at most 20% of the population supported the Taliban by early summer,\" says Vendrell. And bin Laden's power made Massoud's plea for outside assistance more urgent. \"We told the Americans-we told everyone-that al-Qaeda was set upon a transnational program,\" says Abdullah Abdullah, once a close aide to Massoud and now the Afghan Foreign Minister. In April, Massoud addressed the European Parliament in Strasbourg, France, seeking support for the Northern Alliance. \"If President Bush doesn't help us,\" he told a reporter, \"these terrorists will damage the U.S. and Europe very soon.\" \n \n But Massoud never got the help that he needed-or that Clarke's plan had deemed necessary. Most of the time, Northern Alliance delegates to Washington had to be satisfied with meeting low-level bureaucrats. The Alliance craved recognition by the U.S. as a \"legitimate resistance movement\" but never got it, though on a visit in July, Abdullah did finally get to meet some top National Security Council (NSC) and State Department officials for the first time. The best the Americans seemed prepared to do was turn a blind eye to the trickle of aid from Iran, Russia and India. Vendrell remembers much talk that spring of increased support from the Americans. But in truth Massoud's best help came from Iran, which persuaded all supporters of the Northern Alliance to channel their aid through Massoud alone. \n \n Only once did something happen that might have given Massoud hope that the U.S. would help. In late June, he was joined in Dushanbe, Tajikistan, by Abdul Haq, a leading Pashtun, based in Dubai, who was opposed to the Taliban. Haq was accompanied by someone Massoud knew well: Peter Tomsen, a retired ambassador who from 1989 to '92 had been the U.S. State Department's special envoy to the Afghan resistance. Also present was James Ritchie, a successful Chicago options trader who had spent part of his childhood in Afghanistan and was helping bankroll the groups opposed to the Taliban. (Haq was captured and executed by the Taliban last October while on a quixotic mission to Afghanistan.) Tomsen insists that the June 2001 trip was a private one, though he had told State Department officials of it in advance. Their message, he says, was limited to a noncommittal \"good luck and be careful.\" \n \n The purpose of the meeting, according to Tomsen, was to see if Massoud and Haq could forge a joint strategy against the Taliban. \"The idea,\" says Sayeed Hussain Anwari, now the Afghan Minister of Agriculture, who was present at the meeting, \"was to bring Abdul Haq inside the country to begin an armed struggle in the southeast.\" Still hoping for direct assistance from Washington, Massoud gave Tomsen all the intelligence he had on al-Qaeda and asked Tomsen to take it back to Washington. But when he briefed State Department officials after his trip, their reaction was muted. The American position was clear. If anything was to be done to change the realities in Afghanistan, it would have to be done not by the U.S. but by Pakistan. Massoud was on his own. \n \n CLARKE: CRYING WOLF\n In Washington, dick clarke didn't seem to have a lot of friends either. His proposals were still grinding away. No other great power handles the transition from one government to another in so shambolic a way as the U.S.-new appointments take months to be confirmed by the Senate; incoming Administrations tinker with even the most sensible of existing policies. The fight against terrorism was one of the casualties of the transition, as Washington spent eight months going over and over a document whose outline had long been clear. \"If we hadn't had a transition,\" says a senior Clinton Administration official, \"probably in late October or early November 2000, we would have had (the plan to go on the offensive) as a presidential directive.\" \n \n As the new Administration took office, Rice kept Clarke in his job as counterterrorism czar. In early February, he repeated to Vice President Dick Cheney the briefing he had given to Rice and Hadley. There are differing opinions on how seriously the Bush team took Clarke's wwarnings. Some members of the outgoing Administration got the sense that the Bush team thought the Clintonites had become obsessed with terrorism. \"It was clear,\" says one, \"that this was not the same priority to them that it was to us.\"\n \n For other observers, however, the real point was not that the new Administration dismissed the terrorist theat. On the contrary, Rice, Hadley and Cheney, says an official, \"all got that it was important.\" The question is, How high a priority did terrorism get? Clarke says that dealing with al-Qaeda \"was in the top tier of issues reviewed by the Bush Administration.\" But other topics got far more attention. The whole Bush national-security team was obsessed with setting up a national system of missile defense. Secretary of Defense Donald Rumsfeld was absorbed by a long review of the military's force structure. Attorney General John Ashcroft had come into office as a dedicated crime buster. Rice was desperately trying to keep in line a national-security team-including Rumsfeld, Cheney and Secretary of State Colin Powell-whose members had wildly different agendas and styles. \"Terrorism,\" says a former Clinton White House official, speaking of the new Administration, \"wasn't on their plate of key issues.\" Al-Qaeda had not been a feature of the landscape when the Republicans left office in 1993. The Bush team, says an official, \"had to learn about (al-Qaeda) and figure out where it fit into their broader foreign policy.\" But doing so meant delay.\n \n Some counterterrorism officials think there is another reason for the Bush Administration's dilatory response. Clarke's paper, says an official, \"was a Clinton proposal.\" Keeping Clarke around was one thing; buying into the analysis of an Administration that the Bush team considered feckless and naive was quite another. So Rice instructed Clarke to initiate a new \"policy review process\" on the terrorism threat. Clarke dived into yet another round of meetings. And his proposals were nibbled nearly to death. \n \n This was, after all, a White House plan, which means it was resented from the moment of conception. \"When you look at the Pentagon and the cia,\" says a former senior Clinton aide, \"it's not their plan. The military will never accept the White House staff doing military planning.\" Terrorism, officials from the State Department suggested, needed to be put in the broader context of American policy in South Asia. The rollback plan was becoming the victim of a classic Washington power play between those with \"functional\" responsibilities-like terrorism-and those with \"regional\" ones-like relations with India and Pakistan. The State Department's South Asia bureau, according to a participant in the meetings, argued that a fistful of other issues-Kashmir, nuclear proliferation, Musharraf's dictatorship-were just as pressing as terrorism. By now, Clarke's famously short fuse was giving off sparks. A participant at one of the meetings paraphrases Clarke's attitude this way: \"These people are trying to kill us. I could give a f___ if Musharraf was democratically elected. What I do care about is Pakistan's support for the Taliban and turning a blind eye to this terrorist cancer growing in their neighbor's backyard.\"\n \n It was Bush who broke the deadlock. Each morning the CIA gives the Chief Executive a top-secret Presidential Daily Brief (PDB) on pressing issues of national security. One day in early spring, Tenet briefed Bush on the hunt for Abu Zubaydah, al-Qaeda's head of international operations, who was suspected of having been involved in the planning of the attack on the U.S.S. Cole. After the PDB, Bush told Rice that the approach to al-Qaeda was too scattershot. He was tired of \"swatting at flies\" and asked for a comprehensive plan for attacking terrorism. According to an official, Rice came back to the nsc and said, \"The President wants a plan to eliminate al-Qaeda.\" Clarke reminded her that he already had one. \n \n But having a plan isn't the same as executing it. Clarke's paper now had to go through three more stages: the Deputies' Committee, made up of the No. 2s to the main national-security officials; the Principals' Committee, which included Cheney, Rice, Tenet, Powell and Rumsfeld; and finally, the President. Only when Bush had signed off would the plan become what the Bush team called a national-security presidential directive.\n \n On April 30, nearly six weeks after the Administration started holding deputies' meetings, Clarke presented a new plan to them. In addition to Hadley, who chaired the hour-long meeting, the gathering included Cheney's chief of staff, Lewis Libby; Richard Armitage, the barrel-chested Deputy Secretary of State; Paul Wolfowitz, the scholarly hawk from the Pentagon; and John McLaughlin from the cia. Armitage was enthusiastic about Clarke's plan, according to a senior official. But the CIA was gun-shy. Tenet was a Clinton holdover and thus vulnerable if anything went wrong. His agency was unwilling to take risks; it wanted \"top cover\" from the White House. The deputies, says a senior official, decided to have \"three parallel reviews-one on al-Qaeda, one on the Pakistani political situation and the third on Indo-Pakistani relations.\" The issues, the deputies thought, were interrelated. \"They wanted to view them holistically,\" says the senior official, \"and not until they'd had three separate meetings on each of these were they able to hold a fourth integrating them all.\" \n \n There was more. Throughout the spring, one bureaucratic wrangle in particular rumbled on, poisoning the atmosphere. At issue: the Predator.\n \n The Predator had first been used in Bosnia in 1995. Later, the CIA and the Pentagon began a highly classified program designed to produce pictures-viewable in real time-that would be fine-grained enough to identify individuals. The new, improved Predator was finally ready in September 2000, and the CIA flew it over Afghanistan in a two-week \"test of concept.\" First results were promising; one video sent to the White House showed a man who might have been bin Laden. For the first time, the CIA now had a way to check out a tip by one of its agents among the Afghan tribes. If there was a report that bin Laden was in the vicinity, says a former aide to Clinton, \"we could put the Predator over the location and have eyes on the target.\" \n \n But in October 2000, the Predator crashed when landing at its base in a country bordering Afghanistan. The unmanned aerial vehicle needed repairs, and in any event, the CIA and the Pentagon decided that the winter weather over Afghanistan would make it difficult to take good pictures. The Clinton team left office assuming that the Predator would be back in the skies by March 2001.\n \n In fact, the Predator wouldn't fly again until after Sept. 11. In early 2001 it was decided to develop a new version that would not just take photos but also be armed with Hellfire missiles. To the frustration of Clarke and other White House aides, the CIA and the Pentagon couldn't decide who controlled the new program or who should pay for it-though each craft cost only $1 million. While the new uav was being rapidly developed at a site in the southwestern U.S., the CIA opposed using the old one for pure surveillance because it feared al-Qaeda might see it. \"Once we were going to arm the thing,\" says a senior U.S. intelligence official, \"we didn't want to expose the capability by just having it fly overhead and spot a bunch of guys we couldn't do anything about.\" Clarke and his supporters were livid. \"Dick Clarke insisted that it be kept in the air,\" says a Bush Administration official. The counterterrorism team argued that the Taliban had shot at the uav during the Clinton test, so its existence was hardly a secret. Besides, combined with on-the-ground intelligence, a Predator might just gather enough information in time to get a Tomahawk off to the target. But when the deputies held their fourth and final meeting on July 16, they still hadn't sorted out what to do with the Predator. Squabbles over who would pay for it continued into August. \n \n Administration sources insist that they were not idle in the spring. They set up, for example, a new center in the Treasury to track suspicious foreign assets and reviewed Clinton's \"findings\" on whether the CIA could kill bin Laden. But by the summer, policy reviews were hardly what was needed.\n \n Intelligence services were picking up enough chatter about a terrorist attack to scare the pants off top officials. On June 22, the Defense Department put its troops on full alert and ordered six ships from the Fifth Fleet, based in Bahrain, to steam out to sea, for fear that they might be attacked in port. U.S. officials thought an attack might be mounted on American forces at the nato base at Incirlik, Turkey, or maybe in Rome or Belgium, Germany or Southeast Asia, perhaps the Philippines-anywhere, it seems, but in the U.S. When Independence Day passed without incident, Clarke called a meeting and asked Ben Bonk, deputy director of the CIA's counterterrorism center, to brief on bin Laden's plans. Bonk's evidence that al-Qaeda was planning \"something spectacular,\" says an official who was in the room, \"was very gripping.\" But nobody knew what or when or where the spectacular would be. As if to crystallize how much and how little anyone in the know actually knew, the counterterrorism center released a report titled \"Threat of Impending al- Qaeda Attack to Continue Indefinitely.\"\n \n Predictably, nerves frayed. Clarke, who was widely loathed in the cia, where he was accused of self-aggrandizement, began to lose credibility. He cried wolf, said his detractors; he had been in the job too long. \"The guy was reading way too many fiction novels,\" says a counterterrorism official. \"He turned into a Chicken Little. The sky was always falling for Dick Clarke. We had our strings jerked by him so many times, he was simply not taken seriously.\" Clarke wasn't the only one living on the edge. So, say senior officials, was Tenet. Every few days, the CIA director would call Tom Pickard, who had become acting director of the FBI in June, asking \"What do you hear? Do you have anything?\" Pickard never had to ask what the topic was. \n \n In mid-July, Tenet sat down for a special meeting with Rice and aides. \"George briefed Condi that there was going to be a major attack,\" says an official; another, who was present at the meeting, says Tenet broke out a huge wall chart (\"They always have wall charts\") with dozens of threats. Tenet couldn't rule out a domestic attack but thought it more likely that al-Qaeda would strike overseas. One date already worrying the Secret Service was July 20, when Bush would arrive in Genoa for the G-8 summit; Tenet had intelligence that al-Qaeda was planning to attack Bush there. The Italians, who had heard the same report (the way European intelligence sources tell it, everyone but the President's dog \"knew\" an attack was coming) put frogmen in the harbor, closed airspace around the town and ringed it with antiaircraft guns. \n \n But nothing happened. After Genoa, says a senior intelligence official, there was a collective sigh of relief: \"A lot of folks started letting their guard down.\" After the final deputies' meeting on Clarke's draft of a presidential directive, on July 16, it wasn't easy to find a date for the Principals' Committee to look at the plan-the last stage before the paper went to Bush. \"There was one meeting scheduled for August,\" says a senior official, \"but too many principals were out of town.\" Eventually a date was picked: the principals would look at the draft on Sept. 4. That was about nine months after Clarke first put his plan on paper.\n \n A BURNED-OUT CASE\n Clarke wasn't the only person having a bad year. In New York City, John O'Neill led the FBI's National Security Division, commanding more than 100 experienced agents. By spring they were all overloaded. O'Neill's boss, Assistant FBI Director Barry Mawn, spent part of his time pleading with Washington for more agents, more linguists, more clerical help. He got nowhere. O'Neill was a legend both in New York, where he hung out at famous watering holes like Elaine's, and in the counterterrorism world. Since 1995, when he helped coordinate the arrest in Pakistan of Ramzi Yousef, the man responsible for the 1993 bombing of the World Trade Center, O'Neill had been one of the FBI's leading figures in the fight against terrorism. Brash, slick and ambitious, he had spent the late 1990s working closely with Clarke and the handful of other top officials for whom bin Laden had become an obsession.\n \n Now O'Neill was having a lousy few months. The New York City field office had primary responsibility for the investigation of the attack on the U.S.S. Cole. But the case had gone badly from the start. The Yemeni authorities had been lethargic and uncooperative, and O'Neill, who led the team in Aden, had run afoul of Barbara Bodine, then the U.S. ambassador to Yemen, who believed the FBI's large presence was causing political problems for the Yemeni regime. When O'Neill left Yemen on a trip home for Thanksgiving, Bodine barred his return. Seething, O'Neill tried to supervise the investigation from afar. At the same time, his team in New York City was working double time preparing for the trial in January 2001 of four co-conspirators in the case of the 1998 African embassy bombings. That involved agents shuttling between Nairobi, Dar es Salaam and New York, escorting witnesses, ferrying documents and guarding al-Qaeda turncoats who would give evidence for the prosecution. \n \n Yet the FBI as a whole was ill equipped to deal with the terrorist threat. It had neither the language skills nor the analytical savvy to understand al-Qaeda. The bureau's information-technology capability dated to pre-Internet days. Chambliss says the counterterrorism investigations were decentralized at the bureau's 56 field offices, which were actually discouraged from sharing information with one another or with headquarters. \n \n That was if the cases ever got started. An investigation by Chambliss's subcommittee found that the FBI paid \"insufficient attention\" to tracking terrorists' finances. Most agents in the field were assigned to criminal units; few field squads were dedicated to gathering intelligence on radical fundamentalists. During the Clinton Administration, says a former senior aide, Clarke became so frustrated with the bureau that he began touring its field offices, giving agents \"al- Qaeda 101\" classes. The bureau was, in fact, wiretapping some suspected Islamic radicals and debriefing a few al-Qaeda hands who had flipped. But at the end of the Clinton years, the aide says, the FBI told the White House that \"there's not a substantial al-Qaeda presence in the U.S., and to the extent there was a presence, they had it covered.\" The FBI didn't, and O'Neill must have known that it didn't. So, as it happens, did some of his key allies, who were not in the U.S. at all but overseas. In Europe and especially in France the threat of Islamic terrorism had been particularly sharp ever since the Algerian Armed Islamic Group launched a bombing campaign in Paris in 1995. By 2000, counterterrorism experts in Europe knew the Islamic diaspora communities in Europe were seeded with cells of terrorists. And after the arrest of Ressam, European officials were convinced that terrorists would soon attack targets in the U.S. Jean-Louis Bruguire, a French magistrate who has led many of the most prominent terrorist cases, says Ressam's arrest signaled that the U.S. \"had to join the rest of the world in considering itself at acute risk of attack.\" \n \n Throughout the winter and spring of 2001, European law-enforcement agencies scored a series of dramatic hits against al-Qaeda and associated radical Islamic cells, with some help from the cia. The day after Christmas 2000, German authorities in Frankfurt arrested four Algerians on suspicion of plotting to bomb targets in Strasbourg. Two months later, the British arrested six Algerians on terrorism charges. In April, Italian police busted a cell whose members were suspected of plotting to bomb the American embassy in Rome. Two months later, the Spanish arrested Mohammed Bensakhria, an Algerian who had been in Afghanistan and had links to top al-Qaeda officials, including bin Laden. Bensakhria, the French alleged, had directed the Frankfurt cell involved in the Strasbourg plot. And in the most stunning coup of all, on July 28, Djamel Beghal, a Frenchman of Algerian descent who had been on France's terrorist watch list since 1997, was arrested in Dubai on his way back from Afghanistan. After being persuaded of terrorism's evil by Islamic scholars, Beghal told of a plot to attack the American embassy in Paris and gave investigators new details on al-Qaeda's top leadership, including the international-operations role of Abu Zubaydah. (Now back in France, he has tried to recant his confession.) French sources tell Time they believe U.S. authorities knew about Beghal's testimony.\n \n This action by cops in Europe was meat and drink to O'Neill. The problem was that it convinced some U.S. antiterrorism officials that if there was going to be an attack on American interests that summer, it would take place outside the U.S. In early June, for example, the FBI was so concerned about threats to investigators left in Yemen that it moved the agents from Aden to the American embassy in Sana'a. Then came a second, very specific warning about the team's safety, and Washington decided to pull out of Yemen entirely. \"John (O'Neill) would say, 'There's a lot of traffic,'\" recalls Mawn. \"Everybody was saying, 'The drumbeats are going; something's going to happen.' I said, 'Where and what?' And they'd say, 'We don't know, but it seems to be overseas, probably.'\"\n \n continued----<", 
   {
    "post_info": {
     "post_title": "The saga of a lost chance"
    }
   }, 
   null, 
   null, 
   1080467100.0
  ], 
  [
   41335, 
   null, 
   "Dmann", 
   "continued:\n \n Some didn't lose sight of the threat at home. On Aug. 6, while on vacation in Crawford, Texas, Bush was given a PDB, this one on the possibility of al-Qaeda attacks in the U.S. And not one but two FBI field offices had inklings of al-Qaeda activity in the U.S. that, had they been aggressively pursued, might have fleshed out the intelligence chatter about an upcoming attack. But the systemic weaknesses in the FBI's bureaucracy prevented anything from being done. \n \n The first warning came from Phoenix, Ariz. On July 10, agent Kenneth Williams wrote a paper detailing his suspicions about some suspected Islamic radicals who had been taking flying lessons in Arizona. Williams proposed an investigation to see if al-Qaeda was using flight schools nationwide. He spoke with the voice of experience; he had been working on international terrorism cases for years. The Phoenix office, according to former FBI agent James Hauswirth, had been investigating men with possible Islamic terrorist links since 1994, though without much support from the FBI's local bosses. Williams had started work on his probe of flight schools in early 2001 but had spent much of the next months on nonterrorist cases. Once he was back on terrorism, it took only a few weeks for alarm bells to ring. He submitted his memo to headquarters and to two FBI field offices, including New York City. In all three places it died. \n \n Five weeks after Williams wrote his memo, a second warning came in from another FBI field office, and once again, headquarters bungled the case. On Aug. 13, Zacarias Moussaoui, a 33-year-old Frenchman of Moroccan ancestry, arrived at Pan Am International Flight Academy in Minnesota for simulator training on a Boeing 747. Moussaoui, who had been in the U.S. since February and had already taken flying lessons at a school in Norman, Okla., was in a hurry. John Rosengren, who was director of operations at Pan Am until February this year, says Moussaoui wanted to learn how to fly the 747 in \"four or five days.\" After just two days of training, Moussaoui's flight instructor expressed concern that his student didn't want it known that he was a Muslim. One of Pan Am's managers had a contact in the FBI; should the manager call him? \"I said, 'No problem,'\" says Rosengren. \"The next day I got a call from a Minneapolis agent telling me Moussaoui had been detained at the Residence Inn in Eagan.\"\n \n Though Moussaoui is the only person to be indicted in connection with the Sept. 11 attacks, his role in them is as clear as mud. (He is detained in Alexandria, Va., awaiting trial in federal district court.) German authorities have confirmed to Time that-as alleged in the indictment-Ramzi Binalshibh, a Hamburg friend of Atta and Al-Shehhi, wired two money transfers to Moussaoui in August. Binalshibh, who was denied a visa to visit the U.S. four times in 2000, is thought to have been one of the conduits for funds to the hijackers, relaying cash that originated in the Persian Gulf. But no known telephone calls or other evidence links the hijackers directly to Moussaoui.\n \n Whatever Moussaoui's true tale may be, the Minnesota field office was convinced he was worth checking out. Agents spent much of the next two weeks in an increasingly frantic-and ultimately fruitless- effort to persuade FBI headquarters to authorize a national-security warrant to search Moussaoui's computer. From Washington, requests were sent to authorities in Paris for background details on the suspect. Like most things having to do with Moussaoui, the contents of the dossier sent over from Paris are in dispute. One senior French law-enforcement source told Time the Americans were given \"everything they needed\" to understand that Moussaoui was associated with Islamic terrorist groups. \"Even a neophyte,\" says this source, \"working in some remote corner of Florida, would have understood the threat based on what was sent.\" But several officials in FBI headquarters say that before Sept. 11 the French sent only a three-page document, which portrayed Moussaoui as a radical but was too sketchy to justify a search warrant for his computer.\n \n The precise wording of the French letter isn't the issue. The extraordinary thing about Moussaoui's case-like the Phoenix memo-is that it was never brought to the attention of top officials in Washington who were, almost literally, sleepless with worry about an imminent terrorist attack. Nobody in the FBI or CIA ever informed anybody in the White House of Moussaoui's detention. That was unforgivable. \"Do you think,\" says a White House antiterrorism official, \"that if Dick Clarke had known the FBI had in custody a foreigner who was learning to fly a plane in midair, he wouldn't have done something?\"\n \n In blissless ignorance, Clarke and Tenet waited for the meeting of the Principals. But the odd little ways of Washington had one more trick to play. Heeding the pleas from the FBI's New York City office, where Mawn and O'Neill were desperate for new linguists and analysts, acting FBI director Pickard asked the Justice Department for some $50 million for the bureau's counterterrorism program. He was turned down. In August, a bureau source says, he appealed to Attorney General Ashcroft. The reply was a flat no. \n \n Pickard got Ashcroft's letter on Sept. 10. A few days before, O'Neill had started a new job. He was burned out, and he knew it. Over the summer, he had come to realize that he had made too many enemies ever to succeed Mawn. O'Neill handed in his papers, left the FBI and began a new life as head of security at the World Trade Center. \n \n THE TWO VISITORS\n As the first cool nights of fall settled on northeast Afghanistan, Ahmed Shah Massoud was barely hanging on. His summer offensive had been a bust. An attempt to capture the city of Taloqan, which he had lost to the Taliban in 2000, ended in failure. But old allies, like the brutal Uzbek warlord Abdul Rashid Dostum, had returned to the field, and Massoud still thought the unpopularity of the Taliban might yet make them vulnerable. \"He was telling us not to worry, that we'd soon capture Kabul,\" says Shah Pacha, an infantry commander in the Northern Alliance. \n \n Around Sept. 1, Massoud summoned his top men to his command post in Khoja Bahauddin. The intention was to plan an attack, but Zahir Akbar, one of Massoud's generals, remembers a phone call after which Massoud changed his plans. \"He'd been told al-Qaeda and the Pakistanis were deploying five combat units to the front line,\" says Akbar. Northern Alliance soldiers reported a buildup of Taliban and al-Qaeda forces; there was no big push from the south, although there were a number of skirmishes in the first week in September. \"We were puzzled and confused when they didn't attack,\" says a senior Afghan intelligence source. \"And Taliban communications showed the units had been ordered to wait.\" \n \n What were they waiting for? Some of Massoud's closest aides think they know. For about three weeks, two Arab journalists had been waiting in Khoja Bahauddin to interview Massoud. The men said they represented the Islamic Observation Center in London and had a letter of introduction from its head, Yasser al-Siri. The men, who had been given safe passage through the Taliban front lines, \"said they'd like to document Islam in Afghanistan,\" recalls Faheem Dashty, who made films with the Northern Alliance and is editor in chief of the Kabul Weekly newspaper. By the night of Sept. 8, the visitors were getting antsy, pestering Massoud's officials to firm up the meeting with him and threatening to return to Kabul if they could not see Massoud in the next 24 hours. \"They were so worried and excitable they were begging us,\" says Jamsheed, Massoud's secretary. \n \n The interview was finally granted just before lunch on Sunday, Sept. 9. Dashty was asked to record it on his camera. Massoud sat next to his friend Masood Khalili, now Afghanistan's ambassador to India. \"The commander said he wanted to sit with me and translate,\" says Khalili. \"Then he and I would go and have lunch together by the Oxus River.\" The Arabs entered and set up a TV camera in front of Massoud; the guests, says Khalili, were \"very calm, very quiet.\" Khalili asked them which newspaper they represented. When they replied that they were acting for \"Islamic Centers,\" says Khalili, he became reluctant to continue, but Massoud said they should all go ahead.\n \n Khalili says Massoud asked to know the Arabs' questions before they started recording. \"I remember that out of 15 questions, eight were about bin Laden,\" says Khalili. \"I looked over at Massoud. He looked uncomfortable; there were five worry lines on his forehead instead of the one he usually had. But he said, 'O.K. Let's film.'\" Khalili started translating the first question into Dari; Dashty was fiddling with the lighting on his camera. \"Then,\" says Dashty, \"I felt the explosion.\" The bomb was in the camera, and it killed one of the Arabs; the second was shot dead by Massoud's guards while trying to escape. Khalili believes he was saved by his passport, which was in his left breast pocket-eight pieces of shrapnel were found embedded in it. Dashty remembers being rushed to a helicopter with Massoud, who had terrible wounds. The chopper flew them both to a hospital in Tajikistan. By the time they arrived, Massoud was dead. The killers had come from Europe, and they were members of a group allied with al-Qaeda. Massoud's enemies had been waiting for the news. Within hours, Taliban radio began to crackle: \"Your father is dead. Now you can't resist us.\" \"They were clever,\" says a member of Massoud's staff. \"Their offensive was primed to begin after the assassination.\" That night the Taliban attacked Massoud's front lines. One last time, his forces held out on their own. \n \n As the battle raged, Clarke's plan awaited Bush's signature. Soon enough, the Northern Alliance would get all the aid it had been seeking-U.S. special forces, money, B-52 bombers, and, of course, as many Predators as the CIA and Pentagon could get into the sky. The decision that had been put off for so long had suddenly become easy because a little more than 50 hours after Massoud's death, Atta, sitting on American Airlines Flight 11 on the runway at Boston's Logan Airport, had used his mobile phone to speak for the last time to his friend Al-Shehhi, on United Flight 175. Their plot was a go. \n \n That morning, O'Neill, Clarke's former partner in the fight against international terrorism, arrived at his new place of work. He had been on the job just two weeks. After Atta and Al-Shehhi crashed their planes into the World Trade Center, O'Neill called his son and a girlfriend from outside the Towers to say he was safe. Then he rushed back in. His body was identified 10 days later. \n \n - Reported by Massimo Calabresi, John F. Dickerson, Elaine Shannon, Mark Thompson, Douglas Waller and Michael Weisskopf/Washington; Hannah Bloch and Tim McGirk/Islamabad; Cathy Booth Thomas/Dallas; Wendy Cole and Marguerite Michaels/ Chicago; Bruce Crumley/Paris; James Graff/Brussels; David Schwartz/Phoenix; and Michael Ware/Kabul", 
   {
    "unicode_changes_made": true
   }, 
   41334, 
   null, 
   1080467640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The saga of a lost chance", 
  "url": "http://www.4forums.com/political/politics-debates/2029-saga-lost-chance.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2029, 
  "discussion_files": [
   [
    "32589.html", 
    "http://www.4forums.com/political/politics-debates/2029-saga-lost-chance-print.html"
   ]
  ], 
  "identifier": 2029
 }
]