[
 [
  [
   41643, 
   null, 
   "Rev. HellH0und", 
   "Second Amendment Rights\n Rights, Privileges, England, and Just Who Has the Guns? \n \n March 27, 2004\n \n \n --------------------------------------------------------------------------------\n by Jan Ireland\n \n --------------------------------------------------------------------------------\n \n Self defense is a right given to humanity by God. Because it is a right, it cannot be taken away by man, state, country, or the United Nations. But it can be surrendered, which is what gun control bites are designed to bring about. \n \n It is not necessary to believe in God to recognize the instinctive drive for survival in the human species. We see it in the recovery from illnesses that should have been fatal; survival from a high fall that should have killed; mothers lifting automobiles single handedly to rescue a child underneath. The drive to protect and continue the human race is inherent. \n \n Part of the ruse in gun control is the language used to quiet that drive. Gun \"owners\" in England suffer from that ruse now. Perhaps we should clarify that the \"England\" many Americans refer to is a bit of a misnomer. The United Kingdom is made up of England, Scotland, Wales and Ireland. Gun laws are nuanced differently throughout those areas. \n \n But in all cases, registering guns for so-called safety; granting access to guns only from locked cabinets at Rifle Clubs; \"approving\" a few visible rifles or black powder guns; removing self defense as a legal answer - are all examples of rights having been surrendered. Ask Tony Martin how he feels about having been imprisoned for using a firearm to protect himself and his property, after multiple robberies. \n \n That a \"Second Amendment\" is not ensconced in English historical documents is immaterial. The tremendous contributions England has made to history are immensely laudable. America is closer to England than any other country on earth, and owes a tremendous debt of gratitude to our closest ally. Many of the original supporters of the Second Amendment were from England. \n \n That the distinguished historical contributions of England happened not to include a \"Second Amendment\" has no bearing on whether or not that right exists. We need only note that the American Founders thought it important enough to encase in the Bill of Rights of the United States Constitution. \n \n History has many times lived through the destruction caused by gun control extremists. They pop out at every gun-related tragedy, hoping to bring about just one more \"reasonable\" limitation on guns - and therefore self defense.\n \n It bears repeating. History is replete with examples of despots - who first disarmed the populace. What the state grants you one day, it can take away the next. \n \n In response to a recent article (\"Second Amendment Set To Go Global With First Stop England\"), I heard from a reader in England who misunderstood the difference in rights and privileges. He holds that he \"owns\" several guns, that there are more than a hundred members in his rifle club, and that none of them are criminals. I don't doubt this at all.\n \n But he also mentions a Firearms Certificate. \n \n I have to contend - the state is letting him \"play\" with his guns. How would the state react if he wanted to use \"his\" guns in a way the state did not sanction? And what does he say to someone who wants a \"certificate\" but is denied? Likely nothing, since speaking out could very well have him deemed \"inappropriate\" for further \"owning\" of guns. \n \n America has a plethora of gun regulations, and they vary widely from state to state. John R. Lott, Jr., has written THE BIAS AGAINST GUNS: Why Almost Everything You've Heard About Gun Control Is Wrong. It is a collection of superb research - empirical proof of how guns are used to save lives and protect property in America. \n \n Laws should not be broken - neither in America, nor in England. That does not mean the truth about imprudent laws cannot be brought forth. The branch office being opened in England by Alan Gottlieb of the Citizens Committee for the Right to Keep and Bear Arms needs the support of all gun owners, in all of Great Britain. \n \n Self defense is at stake. \n \n \n Jan Ireland", 
   {
    "post_info": {
     "post_title": "Rights, Privileges, England, and Just Who Has the Guns?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1080670740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Rights, Privileges, England, and Just Who Has the Guns?", 
  "url": "http://www.4forums.com/political/gun-control-debates/2042-rights-privileges-england-just-who-has-guns.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 2042, 
  "discussion_files": [
   [
    "620.html", 
    "http://www.4forums.com/political/gun-control-debates/2042-rights-privileges-england-just-who-has-guns-print.html"
   ]
  ], 
  "identifier": 2042
 }
]