[
 [
  [
   41763, 
   null, 
   "AMD4EVER", 
   "http://www.abc.net.au/news/newsitems/s1075509.htm\n \n Isn't it interesting that the first ever collapse of a scheduled meeting of the Arab Summit happened leading up to talks about democracy. Talk about a touchy subject. But with Iraq heading towards democracy and a better way of life the Arab nations will eventually have to face the fact that they have fallen well behind the times and are going to have to seriously consider making the step to democracy. Personally I think it is going to take in Iraq after a few years and it will have a strong influence on the surrounding countries in the Middle East. If the Middle East ever actually become predominantly democratic I would have to say that would end much of the instability there and as a result finally bring peace to the area. I think the impending failure of the Arab League is the beginning of a move toward democracy.", 
   {
    "post_info": {
     "post_title": "A Democratic Middle East?"
    }
   }, 
   null, 
   null, 
   1080703260.0
  ], 
  [
   42174, 
   null, 
   "theLIBERTARIAN", 
   "AMD, I hope you are right.", 
   {}, 
   41763, 
   null, 
   1080992580.0
  ], 
  [
   42194, 
   null, 
   "Broker", 
   "If we're successful in Iraq it will be the beginning of the end...\n \n If we can show that democracy means prosperity and higher living standards stable nations will form. That also means the Mohammed Attas of the world, whose views were influenced through extreme poverty, might be far fewer.", 
   {}, 
   42174, 
   null, 
   1081028580.0
  ], 
  [
   56208, 
   null, 
   "terral03", 
   "Greetings:\n \n AMD4EVER << Personally I think it is going to take in Iraq after a few years and it will have a strong influence on the surrounding countries in the Middle East. If the Middle East ever actually became predominantly democratic I would have to say that would end much of the instability there and as a result finally bring peace to the area. I think the impending failure of the Arab League is the beginning of a move toward democracy.\n \n Terral's reply << I believe our efforts to force Iraq into a republican type of government will fail and cause a bloody civil war. The people of Iraq now working with the USA (we are infidels to them) in the area are perceived by the rest as traitors. The bad guys are waiting in the wings for us to leave the region, before they begin taking back their country. And you can bet that they have infiltrated the ranks of the forces we are now training. The Arab leader who finally takes power will make Saddam Hussein look like Mr. Rogers.\n \n Terral", 
   {
    "post_info": {
     "post_title": "AMD, I Hope You Are Right Too, but"
    }, 
    "unicode_changes_made": true
   }, 
   41763, 
   null, 
   1088627220.0
  ], 
  [
   56214, 
   null, 
   "jim's trucking", 
   "Greetings:\n \n AMD4EVER << Personally I think it is going to take in Iraq after a few years and it will have a strong influence on the surrounding countries in the Middle East. If the Middle East ever actually became predominantly democratic I would have to say that would end much of the instability there and as a result finally bring peace to the area. I think the impending failure of the Arab League is the beginning of a move toward democracy.\n \n Terral&#8217;s reply << I believe our efforts to force Iraq into a republican type of government will fail and cause a bloody civil war. The people of Iraq now working with the USA (we are infidels to them) in the area are perceived by the rest as traitors. The bad guys are waiting in the wings for us to leave the region, before they begin taking back their country. And you can bet that they have infiltrated the ranks of the forces we are now training. The Arab leader who finally takes power will make Saddam Hussein look like Mr. Rogers.\n \n Terral\n\n \n I REALLY hope you are wrong!", 
   {
    "post_info": {
     "post_title": "And I hope you are WRONG!"
    }
   }, 
   56208, 
   null, 
   1088629500.0
  ], 
  [
   56365, 
   null, 
   "georged", 
   "Greetings:\n \n AMD4EVER << Personally I think it is going to take in Iraq after a few years and it will have a strong influence on the surrounding countries in the Middle East. If the Middle East ever actually became predominantly democratic I would have to say that would end much of the instability there and as a result finally bring peace to the area. I think the impending failure of the Arab League is the beginning of a move toward democracy.\n \n Terral's reply << I believe our efforts to force Iraq into a republican type of government will fail and cause a bloody civil war. The people of Iraq now working with the USA (we are infidels to them) in the area are perceived by the rest as traitors. The bad guys are waiting in the wings for us to leave the region, before they begin taking back their country. And you can bet that they have infiltrated the ranks of the forces we are now training. The Arab leader who finally takes power will make Saddam Hussein look like Mr. Rogers.\n \n Terral\n\n \n Terral's reply offers a realistic scenario. We seem to forget the force it took for Saddam to control the ethnic and opposing belief systems mixture of Iraq, using 400,000 troops and I believe a national police force of about 15,000 with unlimited powers. By the nature of the beast the Shias, with Iran's support, will take control creating a civil war with the Kurds. I think the only question is when. And dread the results when our 'security' is considered enough rationalization to invade and occupy third tier nations who threaten our special interests.", 
   {
    "unicode_changes_made": true
   }, 
   56208, 
   null, 
   1088709720.0
  ], 
  [
   56387, 
   null, 
   "daewoo", 
   "Froma logical standpoint, I too think terrals prediction is most likely to be proven correct.\n \n In addition to the points made by georged, there are also some pretty significant cultural factors that come into play when discussing the future of the ME. Arab culture and religous doctorine tend to lean towards a dictatorship or a monarchy. Many in the ME consider this to be a superior form of government for th simple fact that if you don't like your government, you have a very definate target for your agression. You only have to take out a few guys and you are gauranteed change. \n \n We in America have trouble understandgin this, as we are raised to believe that democracy is by far a superior form of government. I can see where if you were an Arab, there would be a very definate appeal to a monarchy. \n \n The other consideration is economic. A nation that only really has one natural resource which comprises the vast majority of the nations wealth is a somewhat poor canidate for capitolism.", 
   {}, 
   56365, 
   null, 
   1088722560.0
  ], 
  [
   56450, 
   null, 
   "georged", 
   "The other consideration is economic. A nation that only really has one natural resource which comprises the vast majority of the nations wealth is a somewhat poor canidate for capitolism.\n\n \n Especially when consumption of that finite resource is expected to reach the peak of production 2010-2015 and then decline until the resource is exhausted or no longer consumed. That's not a pretty scenario for a single product capitalistic system, being able to watch your decline. And by that point in time the US will have far greater concerns than tending to the well-being of former special interest projects.", 
   {}, 
   56387, 
   null, 
   1088782440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A Democratic Middle East?", 
  "url": "http://www.4forums.com/political/peace-middle-east/2050-democratic-middle-east.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 2050, 
  "discussion_files": [
   [
    "24561.html", 
    "http://www.4forums.com/political/peace-middle-east/2050-democratic-middle-east-print.html"
   ]
  ], 
  "identifier": 2050
 }
]