[
 [
  [
   42309, 
   null, 
   "Dmann", 
   "Neocon 101\n \n Some basic questions answered.\n \n What do neoconservatives believe? \n \"Neocons\" believe that the United States should not be ashamed to use its unrivaled power - forcefully if necessary - to promote its values around the world. Some even speak of the need to cultivate a US empire. Neoconservatives believe modern threats facing the US can no longer be reliably contained and therefore must be prevented, sometimes through preemptive military action.\n \n Most neocons believe that the US has allowed dangers to gather by not spending enough on defense and not confronting threats aggressively enough. One such threat, they contend, was Saddam Hussein and his pursuit of weapons of mass destruction. Since the 1991 Gulf War, neocons relentlessly advocated Mr. Hussein's ouster. \n \n Most neocons share unwavering support for Israel, which they see as crucial to US military sufficiency in a volatile region. They also see Israel as a key outpost of democracy in a region ruled by despots. Believing that authoritarianism and theocracy have allowed anti-Americanism to flourish in the Middle East, neocons advocate the democratic transformation of the region, starting with Iraq. They also believe the US is unnecessarily hampered by multilateral institutions, which they do not trust to effectively neutralize threats to global security. \n \n What are the roots of neoconservative beliefs? \n The original neocons were a small group of mostly Jewish liberal intellectuals who, in the 1960s and 70s, grew disenchanted with what they saw as the American left's social excesses and reluctance to spend adequately on defense. Many of these neocons worked in the 1970s for Democratic Senator Henry \"Scoop\" Jackson, a staunch anti-communist. By the 1980s, most neocons had become Republicans, finding in President Ronald Reagan an avenue for their aggressive approach of confronting the Soviet Union with bold rhetoric and steep hikes in military spending. After the Soviet Union's fall, the neocons decried what they saw as American complacency. In the 1990s, they warned of the dangers of reducing both America's defense spending and its role in the world. \n \n Unlike their predecessors, most younger neocons never experienced being left of center. They've always been \"Reagan\" Republicans. \n \n What is the difference between a neoconservative and a conservative? \n \n Liberals first applied the \"neo\" prefix to their comrades who broke ranks to become more conservative in the 1960s and 70s. The defectors remained more liberal on some domestic policy issues. But foreign policy stands have always defined neoconservatism. Where other conservatives favored détente and containment of the Soviet Union, neocons pushed direct confrontation, which became their raison d'etre during the 1970s and 80s. \n \n Today, both conservatives and neocons favor a robust US military. But most conservatives express greater reservations about military intervention and so-called nation building. Neocons share no such reluctance. The post 9/11-campaigns against regimes in Afghanistan and Iraq demonstrate that the neocons are not afraid to force regime change and reshape hostile states in the American image. Neocons believe the US must do to whatever it takes to end state-supported terrorism. For most, this means an aggressive push for democracy in the Middle East. Even after 9/11, many other conservatives, particularly in the isolationist wing, view this as an overzealous dream with nightmarish consequences. \n \n How have neoconservatives influenced US foreign policy? \n \n Finding a kindred spirit in President Reagan, neocons greatly influenced US foreign policy in the 1980s. \n \n But in the 1990s, neocon cries failed to spur much action. Outside of Reaganite think tanks and Israel's right-wing Likud Party, their calls for regime change in Iraq were deemed provocative and extremist by the political mainstream. With a few notable exceptions, such as President Bill Clinton's decision to launch isolated strikes at suspected terrorist targets in Afghanistan and Sudan in 1998, their talk of preemptive military action was largely dismissed as overkill. \n \n Despite being muted by a president who called for restraint and humility in foreign affairs, neocons used the 1990s to hone their message and craft their blueprint for American power. Their forward thinking and long-time ties to Republican circles helped many neocons win key posts in the Bush administration. \n \n The terrorist attacks of September 11, 2001 moved much of the Bush administration closer than ever to neoconservative foreign policy. Only days after 9/11, one of the top neoconservative think tanks in Washington, the Project for a New American Century, wrote an open letter to President Bush calling for regime change in Iraq. Before long, Bush, who campaigned in 2000 against nation building and excessive military intervention overseas, also began calling for regime change in Iraq. In a highly significant nod to neocon influence, Bush chose the American Enterprise Institute (AEI) as the venue for a key February 2003 speech in which he declared that a US victory in Iraq \"could begin a new stage for Middle Eastern peace.\" AEI - the de facto headquarters for neconservative policy - had been calling for democratization of the Arab world for more than a decade. \n \n What does a neoconservative dream world look like? \n \n Neocons envision a world in which the United States is the unchallenged superpower, immune to threats. They believe that the US has a responsibility to act as a \"benevolent global hegemon.\" In this capacity, the US would maintain an empire of sorts by helping to create democratic, economically liberal governments in place of \"failed states\" or oppressive regimes they deem threatening to the US or its interests. In the neocon dream world the entire Middle East would be democratized in the belief that this would eliminate a prime breeding ground for terrorists. This approach, they claim, is not only best for the US; it is best for the world. In their view, the world can only achieve peace through strong US leadership backed with credible force, not weak treaties to be disrespected by tyrants. \n \n Any regime that is outwardly hostile to the US and could pose a threat would be confronted aggressively, not \"appeased\" or merely contained. The US military would be reconfigured around the world to allow for greater flexibility and quicker deployment to hot spots in the Middle East, as well as Central and Southeast Asia. The US would spend more on defense, particularly for high-tech, precision weaponry that could be used in preemptive strikes. It would work through multilateral institutions such as the United Nations when possible, but must never be constrained from acting in its best interests whenever necessary. --Christian Science Monitor", 
   {
    "post_info": {
     "post_title": "Meet The Neocons"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1081169400.0
  ], 
  [
   42321, 
   null, 
   "AMD4EVER", 
   "So now that we know what one is, do you support them or not and why? Would you support them over the far left or should we be trying to elect a government that is more centralist/independent than either far right or far left?", 
   {}, 
   42309, 
   null, 
   1081172940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Meet The Neocons", 
  "url": "http://www.4forums.com/political/politics-debates/2078-meet-neocons.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2078, 
  "discussion_files": [
   [
    "20782.html", 
    "http://www.4forums.com/political/politics-debates/2078-meet-neocons-print.html"
   ]
  ], 
  "identifier": 2078
 }
]