[
 [
  [
   42311, 
   null, 
   "Dmann", 
   "The Training-Wheel President\n \n By Robert Parry\n May 20, 2002\n \n \n Major national news outlets are continuing to coddle George W. Bush even as new disclosures show that Bush and his senior advisers failed to respond effectively to warnings last year about Osama bin Laden's plans to attack the United States.\n \n \n \n This defensiveness about Bush was apparent in the immediate framing of the revelations as \"The Blame Game,\" a title used by CNN on May 16, as the stories broke, and atop a New York Times lead editorial on May 17. The implication to the public was that Democrats were trying to make political hay from the Sept. 11 tragedy by blaming Bush.\n \n The Times editorial conceded that \"the White House should long ago have told the country about the briefing that Mr. Bush received.\" But the Times still shifted blame away from the Oval Office, arguing that so far, \"everything points to a much broader government failure to recognize that the bin Laden network might attack targets within the United States after years of conducting its operations overseas.\"\n The Washington Post concurred in a similar editorial on May 17. \"The tempest seems overblown,\" the Post said.\n \n For two newspapers that hammered Bill Clinton for years over such issues as the firing of Travel Office staff and his Whitewater real estate investment - not to mention his sex life - it may seem strange for them to shelter Bush from a failure to take any meaningful action to head off the biggest single-day loss of civilian life on U.S. soil, ever.\n \n Training Wheels\n \n Yet that has been the pattern since Election 2000. Bush has rarely been treated like a national leader who should be held to account for mistakes and misdeeds. It's as if major news outlets are set on treating Bush like a toddler wobbling off on a two-wheel bike kept aright by training wheels, with an adult hand at his back and only upbeat words of encouragement in his ears. \n \n During and after the Florida recount battle, for instance, the news media seemed to fear that a serious examination of Bush's electoral tactics might further divide the country. When disclosures surfaced about Republican shenanigans - such as the disqualification of hundreds of black voters falsely labeled felons or the double-standard used in counting overseas ballots depending on whether the votes were from Republican or Democratic counties - the stories were treated as historical footnotes or turned back on Vice President Al Gore for failing to be more aggressive. Bush was never deemed responsible.\n \n After Bush's inauguration, national news outlets acted as if it was their patriotic duty to protect Bush's fragile legitimacy. The kid-glove treatment has continued ever since, even now after the Bush administration was caught hiding the fact that Bush was personally briefed on bin Laden's intention to attack targets inside the United States more than a month before those attacks killed some 3,000 people.\n \n The principal argument of Bush's defenders now is that he got only one warning on Aug. 6 and that it didn't specifically say that al-Qaeda operatives would hijack planes and turn them into missiles aimed at major U.S. landmarks. Bush made that argument himself in one of the most unusual statements ever uttered by an American president.\n \n \"Had I known that the enemy was going to use airplanes to kill on that fateful morning, I would have done everything in my power to protect the American people,\" Bush declared in at a Rose Garden ceremony on May 17.\n \n Coming from any other president, such a remark would have been viewed as self-serving and obvious. Would any president given detailed information about enemy plans to hijack planes with the goal of murdering thousands do anything but try hard \"to protect the American people?\" Would the president, say, go play golf? The problem in the Sept. 11 case was that Bush supplied little or no leadership when the evidence was alarming, though still imprecise.\n \n 'Wag the Dog'\n \n The press also has done little to bring into focus how the Clinton administration succeeded twice in thwarting planned terrorist attacks by bin Laden operatives on U.S. soil, while the Bush administration failed.\n \n In 1995, Abdul Hakim Murad, a Pakistani terrorist tied to bin Laden, was arrested in the Philippines and admitted under interrogation coordinated with the FBI and CIA that he planned to use pilot training in the United States to fly an explosives-packed plane into CIA headquarters in Langley, Virginia. Murad was convicted in New York on other charges that he had plotted to hijack and destroy 12 American jumbo jets over the Pacific Ocean. [NYT, May 18, 2002]\n \n That case tipped off the U.S. government to the possibility that al-Qaeda operatives were considering the use of their own pilots to hijack planes and crash them into targets. Citing the Murad case, a 1999 report for the CIA's National Intelligence Council said \"suicide bomber(s) belonging to al-Qaeda's Martyrdom Battalion could crash land an aircraft packed with high explosives (C-4 and semtex) into the Pentagon, (CIA), or the White House.\" [Washington Post, May 18, 2002]\n \n Later in 1999, prior to the millennial celebrations, a plot to bomb targets in Los Angeles and New York was stopped when an alert customs agent caught a terrorist infiltrating from Vancouver, Canada. The arrest of Ahmed Ressam touched off a rapid reaction from the Clinton administration, which tracked down Ressam's accomplices and broke up the planned attacks. The millennial celebrations proceeded peacefully.\n \n At other times -- after attacks on U.S. targets overseas -- Clinton ordered the firing of missiles at targets in Africa and Afghanistan, including one attack that apparently narrowly missed killing bin Laden. Republicans and Washington commentators, however, mocked Clinton for playing \"wag the dog,\" cheap tricks to distract public attention from the Republican efforts to impeach him.\n \n In the late 1990s, the impeachment of Bill Clinton deeply divided the nation and held the U.S. up to international ridicule. But in the Clinton case, the national news media adopted the pose of hardheaded professionals doing their job, no matter how distasteful, to give the public the full story. By bashing a Democratic president, Washington reporters also bought themselves protection from the conservative charge that the national press corps is \"liberal,\" a tag line that can damage or destroy a journalist's career.\n \n This media attitude continued into the 2000 campaign. The news media pounded perceived missteps by Gore, from the earth-tone color of his sweaters to his portrayal as dishonest or delusional for making statements that turned out to be misquotes, such as the apocryphal claim that he \"invented\" the Internet or that \"I was the one that started it all\" in reference to the Love Canal toxic waste case. [For details, see Consortiumnews.com \"Al Gore v. the Press.\"]\n \n By contrast, candidate Bush was portrayed as somewhat dimwitted but honest and underrated, a man who was a natural leader and comfortable in his own skin. The American voters were assured, too, that Bush would surround himself with experienced hands who would compensate for any shortcomings the little-traveled Texas governor might have with foreign policy. In a phrase favored by Washington journalists, \"the adults would be back in charge.\"\n \n In early 2001, the new Bush administration rejected nearly everything associated with Clinton, including his foreign policy. Clinton's pressure on Israeli and Palestinian leaders to reach an agreement was repudiated. Bush made clear he would concentrate on passing his $1.3 trillion tax cut and other domestic issues, such as whether to fund stem-cell research.\n \n Deaf Ear\n \n From his opening days in office, Bush also rebuffed the recommendations from a bipartisan terrorism commission headed by former Sens. Gary Hart and Warren Rudman. On Jan. 31, 2001, just 11 days after Bush's inauguration, Hart and Rudman unveiled their commission's final report that bluntly warned that urgent steps were needed to prevent a terrorist attack on U.S. cities.\n \n \"States, terrorists and other disaffected groups will acquire weapons of mass destruction, and some will use them,\" the report said. \"Americans will likely die on American soil, possibly in large numbers.\" Hart specifically noted that the nation was vulnerable to \"a weapon of mass destruction in a high-rise building.\"\n \n Little, however, was done. Between a news media that still obsessed over \"Clinton scandals,\" such as the later debunked stories of his aides \"trashing\" the White House, and a new Bush administration focused on domestic concerns, the warning drew scant attention. When congressional hearings on the findings were set for early May, the Bush administration intervened to stop them, an article in the Columbia Journalism Review reported. Presumably, Bush did not want to seem behind the curve.\n \n So, instead of embracing the Hart-Rudman findings and getting to work on the recommendations, Bush set up a White House committee, headed by Vice President Dick Cheney, to examine the issue again and submit a report in the fall. Former Republican House Speaker Newt Gingrich, who had joined Clinton in creating the Hart-Rudman panel, acknowledged that Bush's actions delayed progress. \"The administration actually slowed down response to Hart-Rudman when momentum was building in the spring,\" said Gingrich in an interview cited by the CJR study of press coverage of the terrorism issue.\n \n Alarm Bells\n \n By late spring 2001, other alarm bells were ringing.\n \n Credible evidence of what became the World Trade Center/Pentagon attacks began pouring in to U.S. intelligence agencies. \"It all came together in the third week of June,\" said Richard Clarke, who was the White House coordinator for counter-terrorism. \"The CIA's view was that a major terrorist attack was coming in the next several weeks.\" [See The New Yorker, Jan. 14, 2002]\n \n In late June, CIA Director George Tenet was reported \"nearly frantic\" about the likelihood of an al-Qaeda attack, the Washington Post reported. On June 28, a written intelligence summary to Bush's national security adviser Condoleezza Rice warned that \"It is highly likely that a significant al-Qaeda attack is in the near future, within several weeks.\"\n \n On July 5, at a meeting in the White House Situation Room, Clarke told officials from a dozen federal agencies that \"something really spectacular is going to happen here, and it's going to happen soon.\" [Washington Post, May 17, 2002]\n \n Yet, on Aug. 6 when confronted with a stark warning about bin Laden's plans to attack U.S. targets, Bush continued with his month-long \"working vacation\" at his ranch in Crawford, Texas, one of the longest breaks from Washington for a president in modern U.S. history. The Washington Post reported that the warning memo was entitled \"Bin Laden Determined to Strike the United States in U.S.,\" although in discussing the warning recently, Bush's spokesman Ari Fleischer has left off the important last two words. [Washington Post, May 18, 2002].\n \n Despite the extraordinary warning, what concentration the Bush administration may have devoted to the threat soon wavered. There is no indication that Bush personally took any significant action in response. As Mohammed Atta and his murderous crew put the finishing touches on their plans, Bush clomped about his ranch clearing brush, studied up on the moral philosophy of stem-cell research and took side trips to praise \"heartland values.\"\n \n Missed Signals\n \n An effective president might have demanded - or even provided - the high-level coordination needed to connect the dots that then were scattered around the country. An FBI report about al-Qaeda's training of pilots inside the U.S. was languishing in Arizona. A computer belonging to pilot-trainee-and-terrorist-suspect Zacarias Moussaoui went unexamined in Minnesota. The discovery that two al-Qaeda suspects had penetrated the U.S. prompted only an ineffectual search, before the pair ended up as Sept. 11 hijackers.\n \n The Aug. 6 alert caused no noticeable shift in Bush's schedule. Besides handling some photogenic chores around the ranch, Bush worked on his stem-cell-research speech that was intended to demonstrate his Solomon-like judgment. He also took day trips from his ranch to give speeches in several non-coastal states, flattering them for their \"heartland values.\"\n \n As late as Sept. 6, former Sen. Hart was still trying to galvanize the Bush administration into showing some urgency about the terrorist threat. Hart met with Rice and urged the White House to move faster. Rice agreed to pass on Hart's concerns to higher-ups.\n \n Five days later, on Sept. 11, Bush and his advisers were caught flatfooted as bin Laden-connected operatives, armed with box-cutters, seized four jetliners at three different U.S. airports. Two of the planes slammed into the World Trade Center towers, touching off fires that collapsed the buildings. Another plane swept over Washington before crashing into the Pentagon. On the fourth plane, passengers battled the hijackers for control before the plane crashed into the Pennsylvania countryside. More than 3,000 people were dead.\n \n Bush, who was reading to a classroom in Florida when the first planes hit the Twin Towers, responded shakily to the events. Aboard Air Force One, he was whisked off to Louisiana and then to a bunker in Nebraska. A photo of Bush aboard Air Force One talking to Cheney recently has been sold by the Republican National Committee as a fund-raising device.\n \n While Bush was flying away from Washington, rescue workers rushed to the burning buildings in New York to evacuate thousands of workers and into the Pentagon to pull victims from the fiery wreckage. When the Twin Towers collapsed, hundreds of New York firefighters and policemen died.\n \n Even as rumors spread of follow-up attacks, millions of Americans stayed put in New York and Washington, cities that supposedly lacked \"heartland values.\" By evening, Bush returned to Washington and started talking tough about those responsible for the slaughter. The nation rallied around Bush, who won praise for unleashing the U.S. military against Afghanistan where bin Laden was based. The Sept. 11 attacks that Bush had done nothing to stop boosted Bush's approval ratings to historically high levels.\n \n In a Dec. 20 interview with the Washington Post, Bush acknowledged that he had misjudged bin Laden, \"I knew he was a menace and I knew he was a problem,\" Bush said. \"But I didn't feel the sense of urgency.\" [Washington Post, May 17, 2002]\n \n Historical Question\n \n An unanswerable question from Sept. 11 remains whether history might have played out differently if the U.S. Supreme Court had let all of Florida's votes be counted and if the voters' choice, Al Gore, had been allowed to become president.\n \n Initially, it appeared that a President Gore would likely have ended up in the same spot that Bush had. Militant Islamic fundamentalists despised Clinton as well as George W. Bush and his father, George H.W. Bush. All three were put on a hit list read by bin Laden's spokesman, Suleiman Abu Gheith, on Oct. 13, according to CNN.\n \n Under Clinton, the United States and Uzbekistan had collaborated on covert operations against Afghanistan's ruling Taliban regime and its terrorist allies, the Washington Post reported on Oct. 14, 2001. Clinton also continued the stationing of U.S. troops in Saudi Arabia, bin Laden's homeland. Bin Laden has denounced the presence of those U.S. troops and their defense of the corrupt Saudi royal family. Presumably, the hatred of Clinton would have carried over to his vice president, Al Gore.\n \n Another argument for believing that the Sept. 11 attack would have happened anyway is that its early planning dated back about two years, as several of the conspirators arrived in the United States to take flying lessons. The initial bank transfer of $100,000 was sent to Atta, the presumed ringleader of the hijackings, in June 2000. [Wall Street Journal, Oct. 16, 2001]\n \n But the new disclosures have cast a different light on the possible outcome if Gore were president. Drawing from his Clinton administration experience, Gore and his advisers might have better understood the seriousness of the threat and what was needed to stop it. Gore's team might have been able to connect some of the dots that remained a mystery to Bush and his administration. \n \n As for the national news media, top editors may still think it's patriotic to shield George W. Bush's limitations from the eyes of the world. But a greater danger might rest in creating an image of Bush as a competent leader when the reality is different.\n \n Even at a time of crisis, the professional duty of the press corps is to lay out the facts and provide the context as fully and as fairly as possible. What Bush and his advisers succeeded in covering up for eight months was the fact that they had a lot more forewarning about the Sept. 11 attack than the public knew. That should have been part of the historical record all along -- and ending the cover-up is no \"blame game.\"\n \n In the 1980s, as a correspondent for The Associated Press and Newsweek, Robert Parry broke many of the stories now known as the Iran-contra scandal. His latest book is entitled, Lost History.", 
   {
    "post_info": {
     "post_title": "The Training-Wheel President"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1081169640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Training-Wheel President", 
  "url": "http://www.4forums.com/political/politics-debates/2080-training-wheel-president.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2080, 
  "discussion_files": [
   [
    "6344.html", 
    "http://www.4forums.com/political/politics-debates/2080-training-wheel-president-print.html"
   ]
  ], 
  "identifier": 2080
 }
]