[
 [
  [
   42489, 
   null, 
   "Johnny", 
   "Hi\n \n Can you tell me which one you pick, and why?\n \n (its kinda like a poll)", 
   {
    "post_info": {
     "post_title": "Bush or Kerry?"
    }
   }, 
   null, 
   null, 
   1081232100.0
  ], 
  [
   42512, 
   null, 
   "Dmann", 
   "kerry. there's ample reason to believe that would be my choice here.", 
   {}, 
   42489, 
   null, 
   1081245060.0
  ], 
  [
   42513, 
   null, 
   "Oliphaunt", 
   "i'm voting Kerry...\n i'm sure Bush would be a wonderful person to go bowling with but i dont think he's \"leader of the free world\" material.. his enviromental record is absolutely ABYSMAL.. he's managed to alienate even our closest allies against us.. he started a war that was based on a lie.. 600 of our countrymen have died for his lie.. he inherited a surplus of 129 billion dollars and promptly converted it into a deficit that our children will have to pay off.. \n somewhere in his world it made sense to him to cut taxes (for votes) while increasing spending.. that kind of recklessness makes for a disastrous president economically... \n (jumps behind sandbags and waits for all comers..)", 
   {}, 
   42512, 
   null, 
   1081245840.0
  ], 
  [
   42514, 
   null, 
   "Dmann", 
   "OLI!!!!!!!!YAY...you are the shite man. they won't be in here untill tomorrow....do you have your CP set up to get instant e-mails and all that?", 
   {}, 
   42513, 
   null, 
   1081246140.0
  ], 
  [
   42516, 
   null, 
   "Oliphaunt", 
   "no i dont.. should i? \n \n in regards to my earlier post.. i dont mean to say you SHOULDNT vote for Bush.. maybe you're into unnecessary wars and pollution and all that.. \n in which case emoticon_xgood", 
   {}, 
   42514, 
   null, 
   1081246440.0
  ], 
  [
   42517, 
   null, 
   "Dmann", 
   "yeah...cause war is good...and them there terrowrists are everywhere. you don't live in fear OLI? Cause Bush says they're gonna get you. You don't believe that?", 
   {}, 
   42516, 
   null, 
   1081247040.0
  ], 
  [
   42533, 
   null, 
   "Phunting", 
   "There is another thread on this, interestingly that one has Bush way in the lead, this one has Kerry. Spose it just shows how unreliable these polls can be.\n \n Anyway. I'm for Kerry. Not that I really like Kerry, I don't. But he's better than Bush. Sure he's untrustworthy, but he's a politician, that's part of the job description.\n \n But Bush is a bigoted fanatic. The most important issue to me is homosexual rights, Bush is trying to destroy church/state separation in order to destroy basic freedoms. This is unacceptable in a president. I also despise his naive, religious inspired views on abstinence and abortion. He's gotta go.", 
   {}, 
   42517, 
   null, 
   1081258920.0
  ], 
  [
   42536, 
   null, 
   "Dmann", 
   "maybe things are going to balance out here Phunting...I hear some people are going to be posting here tomorrow....a hint is here already....that may alleviate some of the right wing slant.\n I'm not crazy about kerry either....but I agree...Bush has got to go.\n we're gonna bring the fight to 'em. let's see how it goes.\n I know some of these folks will NEVER get it. they can't see that their party loyalties are akin to being \"good little germans\". we can wise some folks up though. Doin' the best we can emoticon_xagree", 
   {}, 
   42533, 
   null, 
   1081259820.0
  ], 
  [
   42618, 
   null, 
   "European1979", 
   "If I was a citizen of the USA, I would definetely vote for Kerry. Actually, I don't know Kerry that well, but Bush is simply too primitive. He believes in 100% separation of good and evil, he is unable to see his own mistakes, and je is desperately trying to impose his way viewing on everybody else on the world. Not to mention that he refused to ratify the Kyoto Protcol. \n Though, I have to confess that I was not against the war in general.", 
   {}, 
   42536, 
   null, 
   1081283160.0
  ], 
  [
   42620, 
   null, 
   "Oliphaunt", 
   "i certainly dont believe that Kerry is the next face on Mt. Rushmore or anything.. but i think he'd be more than adequate. i mean, i CRINGE whenever i hear Bushes name on the radio or the tv.. because i just know it will be something bad.. as Nader says \"He's a corporation in the white house with a human face..\" and thats true.. Bush is just frightening", 
   {}, 
   42618, 
   null, 
   1081284360.0
  ], 
  [
   42624, 
   null, 
   "Ghost", 
   "Bush, hands down. He's a good guy and he's done good things. I don't agree with him on everything, but I firmly agree with him on national security and foreign policy, and I think that's the most important issue.", 
   {}, 
   42620, 
   null, 
   1081286220.0
  ], 
  [
   42625, 
   null, 
   "Oliphaunt", 
   "i'm sure he's a good guy.. he's pretty funny and he can be kinda charming in a way.. \n i just dont think he has the intelligence or the temprament to be the president of the most powerful country on earth.. i'm still hoping against all logic that the republicans will nominate McCain instead. i can get behind him. \n the main problem with the Iraq war )for instance, was mostly that the months preceding it were handles so incompetantly, you wont get allies by alienating the world.. \n we can argue about whether Bush lied about the WMD's or whether it was a mistake.. but if it was \"just a mistake\" then he should still be out for starting a war on such faulty intelligence 600 american dead, nearly 4,000 wounded, thousands of Iraqi dead.. thats a pretty big gaffe..", 
   {}, 
   42624, 
   null, 
   1081286640.0
  ], 
  [
   42685, 
   null, 
   "Dmann", 
   "i just dont think he has the intelligence or the temprament to be the president of the most powerful country on earth\n \n \n he doesn't read either. isn't that weird? considering his wife was a librarian? and his Mom supports all sorts of reading programs?", 
   {}, 
   42625, 
   null, 
   1081322580.0
  ], 
  [
   42691, 
   null, 
   "Ghost", 
   "Well Oli, I'm glad to see you're not one of the anti-Bush zealots out there. Too many people hate the man and they have no actual basis for it. You're right though, he is pretty funny. Did you see him showing pictures of himself looking through the Oval Office for WMDs?\n \n True, W probably doesn't have the highest IQ of some of our other presidents. He isn't the best public speaker. I don't think he's stupid, though. I think he's pretty bright, I think he has a moral compass (unlike some other presidents we've had *cough*clinton*cough). I don't always agree with his morality, but I'd rather have someone in office using his morality to make decisions than making decisions based on popularity and politics. Bush does have the wisdom to appoint some really good people to his team; Cheney, Rumsfeld, Rice, Powell, and there are others. There are a few things he's done which really make me like him though... 1) The speech he made in the ruins of the WTC, 2) the fact that he flew into Baghdad to spend Thanksgiving with the troops, and 3) when he was asked about how he would fight the war in Iraq, he said that's up to the generals, not him, they just needed to tell him what they wanted to do and he'd support them. What do these things show me? He's a strong figure to look to in times of chaos. He's bold and isn't afraid to take action which may be dangerous. And he knows his own limitations, he doesn't seem to have an overinflated ego an dthe feeling that he can do anything.", 
   {}, 
   42685, 
   null, 
   1081325460.0
  ], 
  [
   42695, 
   null, 
   "Oliphaunt", 
   "i never really had a problem with Clinton getting a blowjob myself.. i just dont see how a presidents private sexual life has anythign to do with how well we can run the country. i have a far bigger problem with Bush misleading the country, intentionally or unintentionally, into a war that didnt need to be fought. if it was intentional then he's a liar, if it was unintentional then he's an honest fool. either way, no good for us. \n i dont think Bush is an evil man by any means, but i also think he's in WAY over his head. i realize that he runs on intuition more than intelligence but unless someone is anointed by god with an amazing sense of \"RIGHT\", then presidents should be analytical and logical intheir actions.. this is a qoute from Bush..\n \"do you know, i'm not very analytical. i dotn spend much time thinkign about myself or why i do things..\" emoticon_xdonno", 
   {}, 
   42691, 
   null, 
   1081326480.0
  ], 
  [
   42698, 
   null, 
   "Dmann", 
   "he doesn't read. \n \n nothing.\n \n no reading. emoticon_wow \n \n \n we've never had a more anti-intellectual president in our entire history...or at least in the last century. \n \n I don't hate the man either. i just think he needs to be doing something else, like running another of his friends business' into the ground...instead of running the American economy into the ground...to benefit his friends business'", 
   {}, 
   42695, 
   null, 
   1081327200.0
  ], 
  [
   42699, 
   null, 
   "Ghost", 
   "Oli, my problem with Clinton isn't that he got a blowjob. I don't care much about that. What I do care about is the fact that he lied to the American people, obstructed justice, things like that. Oh yeah, and the fact that he never had the balls to fight terrorism even after they attacked us numerous times.\n \n As far as the intelligence goes...Bush wasn't the only 'honest fool' drawn in by that. Other people have said that Saddam had WMDs, let's see, people like... Bill Clinton, Hillary Clinton, Al Gore, John Kerry, Howard Dean, France, Russia, Germany, the entire UN security council, the US military, the CIA, the FBI...and a few thousand dead Kurds..oh yeah, and a few more thousand dead Iranians. I heard him say the quote you put there. If I remember correctly, that's entirely out of context to what he was talking about.", 
   {}, 
   42695, 
   null, 
   1081327260.0
  ], 
  [
   42701, 
   null, 
   "Dmann", 
   "he doesn't read. \n \n nothing.\n \n no reading. emoticon_wow \n \n \n we've never had a more anti-intellectual president in our entire history...or at least in the last century. \n \n I don't hate the man either. i just think he needs to be doing something else, like running another of his friends business' into the ground...instead of running the American economy into the ground...to benefit his friends business'\n\n \n \n here's a guy who wouldn't go to war himself....In comparison to kerry, and this isn't an endorsement, while he was in vietnam getting shot and fighting alongside his brothers, george was driving drunk and snorting coke.\n We have a president who did coke...admits it was a problem....i can't belive that. do you know what that stuff does to you? \n I remeber the right getting all up in arms about the \"did not inhale\" thing Clinton said. But, they get a bit hypocritical when it comes to Bush's coke deal. What's good for the goose....", 
   {}, 
   42698, 
   null, 
   1081327500.0
  ], 
  [
   42702, 
   null, 
   "Dmann", 
   ". Oh yeah, and the fact that he never had the balls to fight terrorism even after they attacked us numerous times.\n \n \n fact? really? we're just gonna throw that word around now are we?\n \n \n :xcensored :xcensored :xcensored :xcensored :xcensored \n \n where do you get your info...that's either a case of being uninformed...or, a purposeful attempt at misinformation. Which is it?", 
   {}, 
   42701, 
   null, 
   1081327620.0
  ], 
  [
   42704, 
   null, 
   "Oliphaunt", 
   "Oli, my problem with Clinton isn't that he got a blowjob. I don't care much about that. What I do care about is the fact that he lied to the American people, obstructed justice, things like that. Oh yeah, and the fact that he never had the balls to fight terrorism even after they attacked us numerous times.\n \n As far as the intelligence goes...Bush wasn't the only 'honest fool' drawn in by that. Other people have said that Saddam had WMDs, let's see, people like... Bill Clinton, Hillary Clinton, Al Gore, John Kerry, Howard Dean, France, Russia, Germany, the entire UN security council, the US military, the CIA, the FBI...and a few thousand dead Kurds..oh yeah, and a few more thousand dead Iranians. I heard him say the quote you put there. If I remember correctly, that's entirely out of context to what he was talking about.\n\n \n \n mayeb the reason those other countries didnt take such a hard tack with Iraq is because they knew the intelligence wasnt good enough to justify it. Bush instigated this war, based on intelligence that the CIA TOLD him at the time wasnt that reliable. i mean, before this all started i thought Saddam probably had soem WMD's, my problem was i wasnt seign any true evidence.", 
   {}, 
   42699, 
   null, 
   1081327680.0
  ], 
  [
   42710, 
   null, 
   "Oliphaunt", 
   "i dont know.. Clinton certainly wasnt perfect and i dont mean to defend everything he did.. but he did strike back after the embassy bombing and the USS Cole. it isnt liek we had 4 9-11's on his watch so we cant reall expect him to have just pulled out the marines, point east and say \"kill them all\".. i would have to say that retaliations are proportional to the offending act. this is all neither here-nor-there though as Clinton is no longer president and didnt start this war.\n Bush has done more harm to this country in regards to fighting terrorism then Clinton ever did. i was all for Afghanistan, but this administration shot our country in the trigger finger when it invaded Iraq. most of our resources and attention is going there instead of where it should be going which is fighting terrorism, the actual terrorists and the root causes of it. \n the war in Iraq wasnt part of the war on terror as far as i can see.", 
   {}, 
   42704, 
   null, 
   1081328100.0
  ], 
  [
   42711, 
   null, 
   "Oliphaunt", 
   "here's a guy who wouldn't go to war himself....In comparison to kerry, and this isn't an endorsement, while he was in vietnam getting shot and fighting alongside his brothers, george was driving drunk and snorting coke.\n We have a president who did coke...admits it was a problem....i can't belive that. do you know what that stuff does to you? \n I remeber the right getting all up in arms about the \"did not inhale\" thing Clinton said. But, they get a bit hypocritical when it comes to Bush's coke deal. What's good for the goose....\n\n \n aye, i have to say i still see somethign of the frat boy in Bush..", 
   {}, 
   42701, 
   null, 
   1081328160.0
  ], 
  [
   42818, 
   null, 
   "AMD4EVER", 
   "What does everyone think that Kerry would have done after 9/11? I don't think he would have gone in nearly as hard as Bush did. Maybe that is a good thing and maybe not, but I would rather have the terrorists worried about possible repercussions than try and please the rest of the world with how we handle our problems.", 
   {}, 
   42698, 
   null, 
   1081360380.0
  ], 
  [
   42831, 
   null, 
   "Dmann", 
   "I would rather have the terrorists worried about possible repercussions than try and please the rest of the world with how we handle our problems.\n \n \n \n \n I wonder if they're actually scared of repercussiions. They seem to welcome death. It's a tough problem with no easy answers.", 
   {}, 
   42818, 
   null, 
   1081363560.0
  ], 
  [
   42832, 
   null, 
   "Rev. HellH0und", 
   "OLI!!!!!!!!YAY...you are the shite man. they won't be in here untill tomorrow....do you have your CP set up to get instant e-mails and all that?\n\n \n \n \n I guess we are all still waiting in anticipation for the liberal calvary to arrive....", 
   {}, 
   42514, 
   null, 
   1081363740.0
  ], 
  [
   42842, 
   null, 
   "jim's trucking", 
   "Bush is honest; Kerry is not.\n Bush has helped the economy; Kerry will not.\n Bush will keep our defense systems strong; Kerry will not.\n \n The first reason listed is good enough for me. The others are fringe benifits.\n \n I'm quite certain that America will not be led astray by the lies and misrepresentations of the liberal Bush-haters. They (libs) actually think that people in general are stupid enough to believe their tripe.\n \n Bush will win.", 
   {
    "post_info": {
     "post_title": "Bush Bush Bush Bush Bush Bush Bush Bush Bush Bush"
    }
   }, 
   42695, 
   null, 
   1081364580.0
  ], 
  [
   42844, 
   null, 
   "jim's trucking", 
   "I guess we are all still waiting in anticipation for the liberal calvary to arrive....\n\n \n The liberal propoganda army is on the way? The man  must be lonesome!", 
   {}, 
   42832, 
   null, 
   1081364760.0
  ], 
  [
   42913, 
   null, 
   "jitobear", 
   "Clinton was better than Bush or Kerry. Funny thing - so was Bob Dole.\n \n Why are we left with complete ijuts!!!!\n \n Mickey Mouse in 2004!!!!!", 
   {}, 
   42844, 
   null, 
   1081390080.0
  ], 
  [
   42920, 
   null, 
   "Dmann", 
   "jito....the answer is $$$$$", 
   {}, 
   42913, 
   null, 
   1081390860.0
  ], 
  [
   42993, 
   null, 
   "Ghost", 
   "How win the hell was Clinton beter than Bush or Kerry? Kerry is hard to tell, they're both dirty bastards, but Bush? Clinton didn't actively fight terrorism, and al-Qaeda gained most of it's strength under his watch. He gave the US a terrible reputation in the world, worse than what you accuse Bush of (how do I come to that conclusion? Under Clinton, we had the French and Germans as friends, but we were seen as a paper tiger and that's why we had all these attacks. No one is seeing the US like that anymore, and ruffling a few Euro-liberal feathers is an acceptable price to pay). Don't complain about the economy, just don't. We've just had the best quarter of economic growth in 20 years. We've come back strong from a recession, a terrorist attack, and increased defense spending. The only economic point you can make against Bush is the deficit. Fine, so we have a deficit...that's to be expected when you deal with 2 wars, a terrorist act, and give people tax cuts to stimulate the economy (which is working very well, btw). Oh yeah, and that little thing about Clinton being impeached for breaking a few laws while president, and putting troops into harm's way without supporting them and then pulling them out without accomplishing anything.", 
   {}, 
   42920, 
   null, 
   1081409940.0
  ], 
  [
   43000, 
   null, 
   "Dmann", 
   "Clinton had Bin laden on a shoot to kill list. He ordered his death by asissination.. It was high prioity. Like I've said before....his hands were tied by other, less important matters.", 
   {}, 
   42993, 
   null, 
   1081411320.0
  ], 
  [
   43011, 
   null, 
   "Oliphaunt", 
   "i wasnt aware Clinton was running for president again...\n i know Bush is though.. does it really matter what Clinton did or did not accomplish in regards to terrorism? Did Bush like-wise do anything at all about terrorism before those 3,000 people came hurtling down inside that building? No he didnt.. he did nothing. I know liberals are supposed to be spineless etc but really i cant see how any president (including the evil Clinton) would prove incapable of pointing at Afghanistan on the map and saying \"kill it\". It was the obvious course of action and any president would have ben obliged to take it. \n the blanket use of military force does nothing in this kind of war. i supported Afghanistan, but this Iraq fiasco was nothing but a defeat of our own making. we shot ourselves in the foot plain and simple. all we did was create more terrorists and alienate and inflame a good portion of the world (which really ISNT a smart thing to do when its terrorism you say you're fighting)", 
   {}, 
   43000, 
   null, 
   1081413840.0
  ], 
  [
   43017, 
   null, 
   "Dmann", 
   "it'll be interesting to see how these hearings with condasleaza turn out to tommorow. I doubt much will be revealed...but, there may be a slip up. i think there's ample evidence that Clinton did all he thought he could. he could have done more. there's no argument there. But, at least he got who the real enemy was.", 
   {}, 
   43011, 
   null, 
   1081415220.0
  ], 
  [
   43027, 
   null, 
   "Phunting", 
   "He gave the US a terrible reputation in the world, worse than what you accuse Bush of (how do I come to that conclusion? Under Clinton, we had the French and Germans as friends, but we were seen as a paper tiger and that's why we had all these attacks. No one is seeing the US like that anymore, and ruffling a few Euro-liberal feathers is an acceptable price to pay).\nI'm sorry but this is totally wrong. As a Britain I know that Europe and Australia at the very least had so much more respect for Clinton and the US then than it does for Bush. You see Clinton had foreign diplomatic skills, he new how to talk to the international community. Bush is totally ignorant of the international community. We see him as a symbol of the unthinking American, the one who doesn't know, and doesn't care about anything outside of his own country. \n \n This has nothing to do with Iraq, the so called 'ruffling a few Euro-liberal feathers'. Long before that Bush has been viewed as arrogant and ignorant internationally, and a lot worse than Clinton. The US under Clinton had a fairly good international rep, after a few months of Bush he destroyed it.", 
   {}, 
   42993, 
   null, 
   1081424100.0
  ], 
  [
   43029, 
   null, 
   "Dmann", 
   "I'm with you phunting. bush has screwed up everything this country had built up....in terms of influence, domestically? in tems ofthe economy..\n he's made the dicvision between the right and the left here almost unresolvable...and trust, it's gonna get worse.", 
   {}, 
   43027, 
   null, 
   1081425180.0
  ], 
  [
   43032, 
   null, 
   "Oliphaunt", 
   "I'm with you phunting. bush has screwed up everything this country had built up....in terms of influence, domestically? in tems ofthe economy..\n he's made the dicvision between the right and the left here almost unresolvable...and trust, it's gonna get worse.\n\n \n \n nuh-uh... he's a uniter, not a divider remember? he said so..", 
   {}, 
   43029, 
   null, 
   1081427160.0
  ], 
  [
   43059, 
   null, 
   "Rev. HellH0und", 
   "nuh-uh... he's a uniter, not a divider remember? he said so..\n\n \n \n Actually he compromised with Kennedy and the no child left behind in which kennedy turned around and attacked him.\n \n \n He is (unfortunatly) working on a prescription drug program.\n \n He has tried to reach out in the past to democrats over and over again and has been slapped each time. \n \n Its funny how the democrats had that slogan... \"lets stop the politics of personal destruction\" If they could only see the dems now... Wait they are the same dems! Who would of guessed it only applied to republicans commenting on democrats and not the other way around....", 
   {}, 
   43032, 
   null, 
   1081443540.0
  ], 
  [
   43103, 
   null, 
   "AMD4EVER", 
   "I'm with you phunting. bush has screwed up everything this country had built up....in terms of influence, domestically? in tems ofthe economy..\n he's made the dicvision between the right and the left here almost unresolvable...and trust, it's gonna get worse.\n\n \n I agree with you that Bush has not done everything that he could have done to maintain good relations with the rest of the world. But I also believe that we should put our needs head of those in the international community. I don't wish for the US to be ruled by popular opinion over seas so if you do wish for this to happen then I can't say that I share your view. So while Bush is less internationally inclined than I'd like him to be I do believe Kerry is positioning himself to be more than I'd like him to be. In the end I am going to support the one who will do what is best for ourselves first just as the rest of the world is doing.\n \n As for economics, do you think that Bush's tax cuts or Kerry's idea to raise taxes will do best for the economy? I am not concerned with how the economy went south at this point since it doesn't matter who was at fault. What matters to me is how we should get out of this hole. We seem to be climbing out as we speak which would of course spell doom for the Kerry campaign if it continues into November. I personally think that keeping taxes low is key to economic growth and Kerry's plans would fail because of this.\n \n As for the division between right and left, thank goodness there is a division. I would hate to see the sight of our country if it becomes a one party system or even a two party system where both sides agree with each other. Either we would become a green, internationalist country or an over polluted, police state. Let the two sides have opposing views. They keep each other in check.", 
   {}, 
   43029, 
   null, 
   1081470240.0
  ], 
  [
   43131, 
   null, 
   "Dmann", 
   "I don't support kerry either. \n \n i don't care if we are popular overseas either. I don't think they should dictate policy....But, a decent amount of communication and diplomacy is in order. they don't believe in bush. that's his fault. ...i don't belive it's theirs.\n \n other countries seem to do fine with high taxes and a smart government that spends wisely. So you want to be in debt forever? you have to make sacrifices. sometimes it's out of pocket sacrifice. i'n tired of hearing the \"high taxes\" are bad argument. it's been thoroughly proven wrong.", 
   {}, 
   43103, 
   null, 
   1081483140.0
  ], 
  [
   43142, 
   null, 
   "Ghost", 
   "The average American works about 5 months a year just to pay taxes...and the government doesn't spend the money intelligently (every government does, regardless of party or time).\n \n Look, if the international community were fans of Clinton's...maybe it's a very good thing they don't like Bush.\n \n \nAs for the division between right and left, thank goodness there is a division. I would hate to see the sight of our country if it becomes a one party system or even a two party system where both sides agree with each other. Either we would become a green, internationalist country or an over polluted, police state. Let the two sides have opposing views. They keep each other in check.\n\n \n Damn straight, man. We need opposing political parties. I consider myself a moderate conservative, but I would never want to see conservatism be the only political philosophy or voice, just like I wouldn't want to see liberalism be the only one.", 
   {}, 
   43131, 
   null, 
   1081486620.0
  ], 
  [
   43146, 
   null, 
   "AMD4EVER", 
   "i don't care if we are popular overseas either. I don't think they should dictate policy....But, a decent amount of communication and diplomacy is in order. they don't believe in bush. that's his fault. ...i don't belive it's theirs.\n\n \n Decent communication is fine as well as diplomacy. That is where Bush has gone wrong. But Bush has shown he will do what he thinks is best for the US and not back down to international pressure. That alone is going to help keep us safer from terrorist nations who think that maybe the UN will step in and stop the US from invading them if they continue to harbor terrorists.\n \n \nother countries seem to do fine with high taxes and a smart government that spends wisely. So you want to be in debt forever? you have to make sacrifices. sometimes it's out of pocket sacrifice. i'n tired of hearing the \"high taxes\" are bad argument. it's been thoroughly proven wrong.\n\n \n Which countries seem to do fine with high taxes and who are these governments who spend wisely? High taxes are a corner stone of socialism and based on how that is working out in Europe, I don't think we want to find ourselves in that boat.\n \n Clinton used our economic boom to help lower the debt but the economic bust reversed all that and more with the occurrance of 9/11 and the ensuing wars. If we get this economy turned around we can work our way out of debt without raising taxes. However we first have to turn the economy around and that does require spending our way out of this slow period.\n \n When have high taxes resulted in an improving economy during a slow period? The higher taxes are the less money people can make and spend. If the big guys on top decide they cannot make money anymore because of higher taxes and less spending then they move elsewhere. Lower taxes result in higher consumer spending which requires businesses to expand and hire more people which results in more consumer spending. Increased government spending does the same to boost the economy. Perhaps I'm just ignorant of how raising taxes can improve an economy so explain to me how this can work.", 
   {}, 
   43131, 
   null, 
   1081487460.0
  ], 
  [
   43147, 
   null, 
   "Dmann", 
   "I've been to canada, holland, and england...they do all right over there. the average citizen, for the most part, seems to be doing well....and they can go to a doctor when they are sick....easily....when they're sick...as oppossed to when they have the spare cash... their taxes pay for that...i\n t's just not privatized ....which, seems to work OK...they could use better dentists though", 
   {}, 
   43146, 
   null, 
   1081487760.0
  ], 
  [
   43148, 
   null, 
   "Ghost", 
   "If we get this economy turned around we can work our way out of debt without raising taxes. However we first have to turn the economy around and that does require spending our way out of this slow period.\n\n \n The economy is turning around...we've just had the best quarter of growth we've had in 20 years. Unemployment is where it was for most of the 90s. There have been tens of thousands of new jobs. The economy is doing pretty good right now and it's getting better.", 
   {}, 
   43146, 
   null, 
   1081488540.0
  ], 
  [
   43149, 
   null, 
   "Dmann", 
   "yeah...now your \"career emoticon_rolleyes at Jack in the Box is counted as part of the job's growth programs. they made service jobs into manufacturing jobs...slick....but no cigar", 
   {}, 
   43148, 
   null, 
   1081489200.0
  ], 
  [
   43181, 
   null, 
   "Rev. HellH0und", 
   "yeah...now your \"career emoticon_rolleyes at Jack in the Box is counted as part of the job's growth programs. they made service jobs into manufacturing jobs...slick....but no cigar\n\n \n \n uh they are jobs... are they not? would not ANY president repub or dem NOT count them... I would bet even the commie nader would count them as jobs.", 
   {}, 
   43149, 
   null, 
   1081500600.0
  ], 
  [
   43187, 
   null, 
   "Dmann", 
   "they are jobs. but, if you use them , when they weren't previously counted, to pump up your jobs growth numbers, then that has to be mentioned.\n \n and the nader /commie thing is unneccessary. really. think about it. let's try a new tact...civility. instead of looking for the thing that seperates people. we should explore common ground occassionally. i see we agree on kerry for the most part. \n \n That's the thing, if WE were running the country, or were just co-representatives on opposite sides of the aisle...we'd have to find common ideals...to make things better...not worse.\n everything doesn't have to big bomabastic anti -everything the other guy says.\n \n \n \n I'm sure you got the same moderator notice I did. Let's try huh?", 
   {}, 
   43181, 
   null, 
   1081500960.0
  ], 
  [
   43253, 
   null, 
   "jitobear", 
   "Economy Shemononemy.\n \n I work for one of the largest and most reconginized financial services companies in the world. I am well aware of the realities of the economy. I do not give credit or blame to any single man or group for the state of the economy. Too many factors. Taxes and money are dead drop bottom on my list of reasons to vote or not vote for someone.\n \n Bush is trashing the constitution. It's unforgivable. Far less so than lieing to the American public about having an affair. (Where are our priorities????)\n \n The Patriot Act(s) and his proposed marriage ammendment have gauranteed that I will jump off something tall before casting my vote for him. To pass laws in direct opposition to our constitution and Bill of Rights - he has no business being president. Things get scary and he undermines freedom at home - talk about cowardice!", 
   {}, 
   43187, 
   null, 
   1081564500.0
  ], 
  [
   43255, 
   null, 
   "Ghost", 
   "What aspect of the Constitution is Bush trashing?", 
   {}, 
   43253, 
   null, 
   1081567680.0
  ], 
  [
   43325, 
   null, 
   "jitobear", 
   "The new ammendment is both a breach of seperation of church and state as well as discriminatory. To use the constitution to discriminate infuriates me.\n \n The Patriot Act(s):\n Grant sweeping powers to government aganencies.\n Your financial records, library and other records can be searched by the FBI without a warrant and furthermore you are not to be told.\n Your car or person can be searched without cause by the TSA at an airport, and they can take your kids away for the search. Protest to this can and has resulted in arrest.\n All that is required to be named an unlawful combattant is a signed affidavit from a Pentagon employee who does not have to provide rationale, the individual can then be held for an indefinate amount of time without being told why or being allowed access to representation.\n \n There are courts that have already ruled that parts of the Patriot Act are unconstitutional.\n \n Some feel these sacrifices are needed for safety. I think the founding fathers are turning in their graves. \n \n For a president of United States to turn on the constitution - ESPECIALY in a time of danger is utterly unforgivable. I will not vote for tha man. Period.\n \n \"They that can give up essential liberty to obtain a little temporary safety deserve neither liberty nor safety. \" Benjamin Franklin", 
   {}, 
   43255, 
   null, 
   1081623960.0
  ], 
  [
   43326, 
   null, 
   "jim's trucking", 
   "If I was a citizen of the USA, I would definetely vote for Kerry. Actually, I don't know Kerry that well, ... \n\n \n \n That makes a lot of sense. :xbanghead \n \n Elections of presidents are important enough that one should know all that one can about the serious candidates and what they intend to do while in office.\n \n Bush has shown that he can improve our economy and that he will not weaken our defenses or slack off on the war against terrorism.\n \n Kerry has indicated that he would weaken the economy and weaken our defenses and begin apologizing to the terrorists.\n \n Now who would actually have a problem deciding which one of these is best for the country?", 
   {}, 
   42618, 
   null, 
   1081624620.0
  ], 
  [
   43331, 
   null, 
   "hvozdany", 
   "\n Bush has shown that he can improve our economy and that he will not weaken our defenses or slack off on the war against terrorism.\n \n\n \n I think that at this point at least, Bush helping the economy is a tough sell, unless you don't think jobs are important. I know that he had a good month, but I am not sure one good month is going to help him.\n \n Some would argue that he has not been that great on terrorism. The Iraq war, for one thing, some people argue may have hurt our war on terrorism.\n \n \n\n Kerry has indicated that he would weaken the economy and weaken our defenses and begin apologizing to the terrorists.\n \n\n \n What do you mean by this?\n \n \n \n\n \n Now who would actually have a problem deciding which one of these is best for the country?\n\n \n Well, if everyone believe what you just stated, of course not. But I am not sure that everyone believes what you seem to hold as fact.", 
   {}, 
   43326, 
   null, 
   1081626420.0
  ], 
  [
   43335, 
   null, 
   "hvozdany", 
   "By the way, I think that there have been a few points on the tax debate that people are not mentioning for some reason. \n First, as far as I know the only tax cuts that Kerry said he will roll back are the ones for people who make over 200,000 dollars, I believe.\n I think that most people agree that cutting taxes will stimulate the economy, but it is also important, many argue, who recieves the tax cuts.\n Also, a criticism of Bush which seems to be valid is that while cutting taxes, he is not cutting spending. It seems to me, if you want to be responsible, if you are going to cut taxes, you also have to cut spending as well. I thought that most conservatives agreed with this. Am i wrong to assume that? Or do deficits not matter anymore, in spite of what conservatives used to say?", 
   {}, 
   43181, 
   null, 
   1081626840.0
  ], 
  [
   43341, 
   null, 
   "jim's trucking", 
   "I think that at this point at least, Bush helping the economy is a tough sell, unless you don't think jobs are important. I know that he had a good month, but I am not sure one good month is going to help him.\n\n \n There are other indicators of the health and forecast of economic growth besides the current jobs conditions. I am not an economist and cannot argue these points well. I trust the economists that I hear and read of in the news. I have not seen or heard of any really negative effects of Bush policies.\n \n \nSome would argue that he has not been that great on terrorism. The Iraq war, for one thing, some people argue may have hurt our war on terrorism.\n\n \n His war on terrorism is happening. Clinton's war was a nothing more than words and a few cruise missiles, the timing of which was intended to take the heat off him on the home front. Terrorism appears to be escalating because the terrorists now know they are in deep trouble. We will eventually get them ALL.\n \n \n \n\n What do you mean by this?\n\n \n I mean that Kerry's proposed tax increases will hurt the economy and that his history regarding the support of our fighting forces and weapons programs is deplorable. He is anti-military, anti-strength. He wants to gut the defense systems even more than Bill Clinton did.\n \n I have not heard any economists say that Kerry's plans would improve the economy.\n \n \n \nWell, if everyone believe what you just stated, of course not. But I am not sure that everyone believes what you seem to hold as fact.\n\n \n Don't believe me. Do some research and form your own opinion based on what you know to be true.\n \n \n \n \n \nBy the way, I think that there have been a few points on the tax debate that people are not mentioning for some reason. \n First, as far as I know the only tax cuts that Kerry said he will roll back are the ones for people who make over 200,000 dollars, I believe.\n I think that most people agree that cutting taxes will stimulate the economy, but it is also important, many argue, who recieves the tax cuts.\n Also, a criticism of Bush which seems to be valid is that while cutting taxes, he is not cutting spending. It seems to me, if you want to be responsible, if you are going to cut taxes, you also have to cut spending as well. I thought that most conservatives agreed with this. Am i wrong to assume that? Or do deficits not matter anymore, in spite of what conservatives used to say?\n\n \n Bush is having to fund a war machine and should not cut off that money. I agree that there are other areas where spending could be cut. Again, I'm not privy to all of the political dealings that surround spending bills. I do know that there's this \"you scratch my back, I'll scratch yours\" mentality that causes a lot of pork to be funded.\n \n If I had copy of a detailed budget, I could go through it and slash a lot of items that I would think unnecessary. (Can you post a link?) However, there would be opposition to every cut proposed.", 
   {}, 
   43331, 
   null, 
   1081628820.0
  ], 
  [
   43344, 
   null, 
   "hvozdany", 
   "There are other indicators of the health and forecast of economic growth besides the current jobs conditions. I am not an economist and cannot argue these points well. I trust the economists that I hear and read of in the news. I have not seen or heard of any really negative effects of Bush policies.\n \n\n \n I agree, but jobs are important. I am not sure that the loss of jobs are even Bush's fault, but to most people, I think, it is going to be hard to tell them that Bush is doing a good job on the economy if they lost their job.\n \n \n \n \n\n His war on terrorism is happening. Clinton's war was a nothing more than words and a few cruise missiles, the timing of which was intended to take the heat off him on the home front. Terrorism appears to be escalating because the terrorists now know they are in deep trouble. We will eventually get them ALL.\n \n\n \n Well, of course Bush has done much more then Clinton did after 9/11...do you really think that anyone wouldn't have invaded Afghanastan? However, some argue that because of Bush's seeming obsession with Iraq, he may not be doing as much to fight terrorism as he could be...\n \n \n \n\n \n I mean that Kerry's proposed tax increases will hurt the economy and that his history regarding the support of our fighting forces and weapons programs is deplorable. He is anti-military, anti-strength. He wants to gut the defense systems even more than Bill Clinton did.\n \n\n \n I think that it is very misleading to say that Kerry is anti-military. I assume you are talking about the Bush attack ads saying that he voted against, the Abrams tank, etc. Keep in mind these attack ads are not meant to be truthful, they are meant to get votes. Both sides seem to take a lot of liberty with the truth. An excellent site, I think is factcheck.org. It is nonpartison, as is obvious if you see how they attack both sides. With regards to his voting on the military here is one of their articles. Personally, I think that it is OK to cut the military, even though it is obvius that it is practical politcal suicide. Sure, everyone agrees that we need a strong military, but does that mean that you have to vote for every military project that is ever proposed?\n I am also not sure which tax increases you are talking about. Like I said, as far as I know he has only said that he will roll back the tax cut on people that make over $200,000. If you know something I don't, please post.\n \n \n\n \n Bush is having to fund a war machine and should not cut off that money. \n \n \n\n \n Keep in mind that the deficits that Bush are running to not even include the money that he is spending in Iraq. I think that it is hard to say that Bush has been fiscally conservative.\n \n \n\n \n \n If I had copy of a detailed budget, I could go through it and slash a lot of items that I would think unnecessary. (Can you post a link?) However, there would be opposition to every cut proposed.\n\n \n For a site with the federal budget I kind of like this because it is simple, and there is kind of a neat part of the site that lets you play with the budget. I assume it to be accurate, though I have never checked.\n I also agree that the budget could be cut...and I guess I am very liberal because I think that the defense budget can be cut. Obviously we need a strong military, in particualr to fight terrorism, but do really need all of the systems that we have that are designed to fight a large war with Russia? I believe that we have 12 carrier groups now...wouldn't 10, perhaps, be enough?", 
   {}, 
   43341, 
   null, 
   1081632300.0
  ], 
  [
   43345, 
   null, 
   "Ghost", 
   "I don't think that the gay marriage amendment is a church/state issue. You do have a lot of the support coming to it from the right-wing Christian organizations, but not exclusively. I also don't think it is discrimination, provided gay couples could get the same legal benefits, such as in civil unions. This is a touchy issue, because you have two diametrically opposed sides arguing this, and both of them feel very strongly and have some very valid points. What we need is a compromise. Myself, I'm pretty much against a gay-marriage amendment, I don't think the constitution is the place to do it.\n \n I have no problem with the FBI gbeing able to go through my financial, library, internet records, things like that, if the only use for it is to combat terrorism. It is unconstitutional to use these powers to find out if you've commit some other crime and then bust you for it. Provided these powers are used solely to fight terrorism, I'm okay with it. I will admit, there needs to be a lot of supervision with this, because it is easy to abuse. Sadly, I think it's necessary.\n \n The bit about the being seen as a combatant without rationale and then held indefinately does worry me. I don't know much about this, I think I'll have to go do some research.", 
   {}, 
   43344, 
   null, 
   1081634580.0
  ], 
  [
   43348, 
   null, 
   "jitobear", 
   "I have no problem with the FBI gbeing able to go through my financial, library, internet records, things like that, if the only use for it is to combat terrorism. It is unconstitutional to use these powers to find out if you've commit some other crime and then bust you for it. Provided these powers are used solely to fight terrorism, I'm okay with it. I will admit, there needs to be a lot of supervision with this, because it is easy to abuse. Sadly, I think it's necessary.\n\n \n I don't. Plus there are no rules as to when they can and can't use this power. They simply can. Call me jaded, but history has proven that a power given will eventually become a power abused. Quite frankly this scares me more than terrorism (not saying we should do NOTHING about terrorism - just not this).\n \n \nThe bit about the being seen as a combatant without rationale and then held indefinately does worry me. I don't know much about this, I think I'll have to go do some research.\n\n \n Well I believe that this is not applicable to US citizens - although they were going to have it be. Regardless, it's foul. No matter who you are you should know your accuser, the accusation and have the opportunity to defend yourself.", 
   {}, 
   43345, 
   null, 
   1081637160.0
  ], 
  [
   43358, 
   null, 
   "hvozdany", 
   "\n Well I believe that this is not applicable to US citizens - although they were going to have it be. Regardless, it's foul. No matter who you are you should know your accuser, the accusation and have the opportunity to defend yourself.\n\n \n I think that you are right, it doesn't apply to US citizens...and I think that they recently released some of the people held at Guantanamo Bay. Presumeably, that means they are not guilty of anything, and that means that we held them for a year at a militray base for no reason.", 
   {}, 
   43348, 
   null, 
   1081639980.0
  ], 
  [
   43719, 
   null, 
   "Phunting", 
   "His war on terrorism is happening. Clinton's war was a nothing more than words and a few cruise missiles, the timing of which was intended to take the heat off him on the home front.\nErr what? Clinton's war on terrorism didn't exist because there was a totally different situation before 9/11. Are you saying that Bush is a good president because we are at war? \n \n \n \nTerrorism appears to be escalating because the terrorists now know they are in deep trouble. We will eventually get them ALL.\nAnd this shows just how deluded people have become. How will we 'get them all' pray tell? We won't, not without invading the vast majority of the world, and even them probably not.\n \n \n \nI don't think that the gay marriage amendment is a church/state issue. You do have a lot of the support coming to it from the right-wing Christian organizations, but not exclusively.\nI disagree. I have yet to see anyone on these forums, or anywhere else really whose main argument against homosexuality is not because 'it is against God'. Sure they come up with other reasons as well, but that's always the main one. And regardless of the church/state issue, it is still butchering the constitution.\n \n \n \nI have no problem with the FBI gbeing able to go through my financial, library, internet records, things like that, if the only use for it is to combat terrorism. It is unconstitutional to use these powers to find out if you've commit some other crime and then bust you for it. Provided these powers are used solely to fight terrorism, I'm okay with it. I will admit, there needs to be a lot of supervision with this, because it is easy to abuse. Sadly, I think it's necessary.\n I agree in theory, but the proposed system seems far to open to exploitation. I agree greater powers are needed but they must be kept in check.", 
   {
    "unicode_changes_made": true
   }, 
   43345, 
   null, 
   1081855920.0
  ], 
  [
   44366, 
   null, 
   "dragonfly", 
   "Well, I'm new to this forum, but I still have an opinion. I will be supporting Kerry in this next election. I do not understand how any thinking person could possibly support Bush. He obviously doesn't have the intelligence to fulfill the duties of the office of President. He has lied to the American public and has gotten us into an unnecessary war and has no plans for getting us out. Bush has got to go in November!", 
   {
    "post_info": {
     "post_title": "Kerry or Bush?"
    }
   }, 
   43719, 
   null, 
   1082219880.0
  ], 
  [
   44398, 
   null, 
   "faeden", 
   "Without repeating what you have heard from others who don't know Bush, how is it 'obvious' to you that he lacks intelligence?\n \n He may not be the smartest president ever (maybe he is, I don't know him), but he has a BA from Yale and a MBA from Harvard. Those degrees require intelligence of some degree.\n \n I have no problems with your other points, except a thinking person might support Bush when the alternative is even worse....\n \n Welcome to the forum!", 
   {
    "post_info": {
     "post_title": "obvious?"
    }
   }, 
   44366, 
   null, 
   1082237760.0
  ], 
  [
   44432, 
   null, 
   "jim's trucking", 
   "Well, I'm new to this forum, but I still have an opinion. I will be supporting Kerry in this next election. I do not understand how any thinking person could possibly support Bush. He obviously doesn't have the intelligence to fulfill the duties of the office of President. He has lied to the American public and has gotten us into an unnecessary war and has no plans for getting us out. Bush has got to go in November!\n\n \n Perhaps you are an impressionable person, easily duped by the bashing that goes on between two candidates and their supporters. There are a lot of lies floating around that never seem to get a rest.\n \n Number one, Bush did not lie to you about WMD.\n \n Number two, he is far from unintelligent.\n \n If you tend believe everything you hear or see on the net and TV that supports how you already feel, you have a problem.\n \n While there's probably not a truly unbiased political information site ANYWHERE, the following link comes close. You can read both sides and find links to all sorts of sites, liberal, conservative and others.\n \n http://www.politics1.com\n \n \n \n \n I suggest you do some reading before judging candidates intelligence. Neither Kerry nor Bush is unintelligent. They both have told lies. They both have switched positions. Kerry just lies more and switches more.\n \n Bush is helping the economy grow. Kerry will turn it around (backwards progress).\n \n Bush is strong on defense. Kerry is not.", 
   {}, 
   44366, 
   null, 
   1082248740.0
  ], 
  [
   44522, 
   null, 
   "Maineiac", 
   "I guess I'll be going with Kerry.Bush is spending money faster than we can print it.He's never met a spending bill he couldn't sign.He took us into Iraq,a place we never should have been sent,for the sake of nothing more than bad inteligence.His enery policy consists of invading an oil rich nation.He is constantly finding new ways of making the Arab world mad at us.His endorsement of the Israel position on West Bank and Gaza Strip is sure to stir things up even more.He lets China deal with N.Korea,yet allows the U.S. to sell Taiwan missle defense systems,which in turn gets China mad at us.This is just the short list. emoticon_xgood", 
   {}, 
   44432, 
   null, 
   1082332920.0
  ], 
  [
   44571, 
   null, 
   "Phunting", 
   "Without repeating what you have heard from others who don't know Bush, how is it 'obvious' to you that he lacks intelligence?\n \n He may not be the smartest president ever (maybe he is, I don't know him), but he has a BA from Yale and a MBA from Harvard. Those degrees require intelligence of some degree.\nI quite agree. Whilst I dislike Bush immensely, and will defiantly vote for Kerry to get rid of him, the 'unintelligent' claim is made far too often.\n \n Bush is intelligent, what he is not is a very eloquent speaker. He stumbles over his words sometimes, that does not make him stupid, but it is something that can be leapt upon and used to make him look stupid.", 
   {}, 
   44398, 
   null, 
   1082375520.0
  ], 
  [
   44609, 
   null, 
   "fracas", 
   "Kerry's statements on foreign policy and homeland security, for example, have attacked Bush as a wet. Kerry said in February: \"I do not fault George Bush for doing too much in the war on terror. I believe he's done too little.\" \n \n Kerry voted for the war on Iraq and continues to support it wholeheartedly. He said last December that those who continue to oppose the war \"don't have the judgment to be president -- or the credibility to be elected president\". Kerry does not even say that Bush has jeopardised US security by attacking Iraq instead of facing down the al-Qa'ida threat; he is not Richard Clarke. Instead, Kerry says: \"No one can doubt that we are safer -- and Iraq is better -- because Saddam Hussein is now behind bars.\" \n \n On December 17, Kerry lent credence to the loony theory that Iraq was the author of the September 11 attacks, something Bush has done at least twice. Yet in February Kerry attacked Bush for planning to hand back power to the Iraqis too quickly -- what he called \"a cut and run\" strategy -- even though Bush intends the US embassy in Iraq to be the biggest US embassy in the world and even though 110,000 US troops are to remain stationed there indefinitely. \n \n Above all, Kerry is, like Bush, committed to the world military supremacy of the US. \"We must never retreat from having the strongest military in the world,\" says the possible future president. Kerry claims that Bush has weakened the military and so he has promised 40,000 more active-duty army troops. \n \n Kerry is more hawkish than Bush about the threat from Islam in general and about Saudi Arabia in particular. Both of these are favourite neo-conservative themes. While Bush has often emphasised that the US has no quarrel with Islam, Kerry happily speaks about the specific danger to the US from the Islamic world, using language that is not substantially different from that in the latest neo-con manifesto, An End to Evil by Richard Perle and David Frum. \n \n Kerry explicitly lists certain populations as representing a special danger to the US - Saudi Arabians, Egyptians, Jordanians, Palestinians, Indonesians and Pakistanis - and he reproaches Bush's grandiose plan to democratise the entire Middle East not for its overweening ambition but for its timidity. \n \n Kerry has attacked the Bush administration for adopting a kid gloves approach to the Saudi kingdom, which he has repeatedly accused of complicity in the funding of Islamic extremism and terror, and he has said the Saudi interior minister is guilty of \"hate speech\" and of promoting \"wild anti-Semitic conspiracy theories\". This recalls Frum and Perle's surprising classification of Saudi Arabia as \"an unfriendly power\". Serious neo-cons, indeed, might be calculating that the bungling Bush is more of a liability than an asset for their desire to remodel the Middle East and to consolidate the US's unchallenged military power. \n \n Kerry might be just what they need to draw the sting of that left-wing anti-Americanism around the world and in the US that inspires so much anti-war feeling. The Kosovo war showed that a war for human rights and against oppression, fought by a slick Democrat, plays far better with world public opinion than all that red-neck bull about dangers to national security. It will be far easier for president Kerry to fight new wars than for the mistrusted and discredited Bush. So to those who think that the election of a Democratic president will put an end to US militarism, I say: You ain't seen nothin' yet.\n\n \n John Laughland is a trustee of the British Helsinki Human Rights Group. A longer version of this appeared in The Spectator. \n \n the Australian", 
   {}, 
   44571, 
   null, 
   1082396340.0
  ], 
  [
   44730, 
   null, 
   "dragonfly", 
   "Jim's Trucking:\n \n I do believe that Bush did lie. I believe that he deliberately mislead the American public as to the reasons for going to war with Iraq.\n \n I am also not convinced that Bush is nearly as intelligent as you seem to think. I base this mainly on the fact that his policies have been a disaster.\n \n I will be supporting Mr. Kerry this November.", 
   {}, 
   44609, 
   null, 
   1082431080.0
  ], 
  [
   44908, 
   null, 
   "faeden", 
   "Jim's Trucking:\n \n I do believe that Bush did lie. I believe that he deliberately mislead the American public as to the reasons for going to war with Iraq.\n \n I am also not convinced that Bush is nearly as intelligent as you seem to think. I base this mainly on the fact that his policies have been a disaster.\n \n I will be supporting Mr. Kerry this November.\n\n \n \n If I base my opinion of Clinton's intelliegnce upon the fact that his infidelity almost cost him the presidency, then he was certianly the dumbest president ever. (I don't know him, so this is humor/sarcasm)\n emoticon_xdonno", 
   {
    "post_info": {
     "post_title": "disaster?"
    }
   }, 
   44730, 
   null, 
   1082518020.0
  ], 
  [
   45641, 
   null, 
   "sglaine", 
   "Jim's Trucking:\n \n I do believe that Bush did lie. I believe that he deliberately mislead the American public as to the reasons for going to war with Iraq.\n \n I am also not convinced that Bush is nearly as intelligent as you seem to think. I base this mainly on the fact that his policies have been a disaster.\n \n I will be supporting Mr. Kerry this November.\n\n Amen: I am glad to see someone here has done there homework.. emoticon_xagree", 
   {}, 
   44730, 
   null, 
   1082835840.0
  ], 
  [
   45647, 
   null, 
   "jim's trucking", 
   "Amen: I am glad to see someone here has done there  homework.. emoticon_xagree\n\n \n Apparently, they did their homework in the dark.", 
   {}, 
   45641, 
   null, 
   1082837760.0
  ], 
  [
   45648, 
   null, 
   "jim's trucking", 
   "Jim's Trucking:\n \n I do believe that Bush did lie. I believe that he deliberately mislead the American public as to the reasons for going to war with Iraq.\n \n I am also not convinced that Bush is nearly as intelligent as you seem to think. I base this mainly on the fact that his policies have been a disaster.\n \n I will be supporting Mr. Kerry this November.\n\n \n Bush acted on the same faulty intelligence system that caused all those other people to \"lie\" to you, too.\n \n Please explain how, in light of the recent announcements that the current rate of economic growth is greater than in the last 20 years, Bush's policies have been disatrous.", 
   {}, 
   44730, 
   null, 
   1082838060.0
  ], 
  [
   45650, 
   null, 
   "faeden", 
   "Jim's Trucking:\n \n I do believe that Bush did lie. I believe that he deliberately mislead the American public as to the reasons for going to war with Iraq.\n \n I am also not convinced that Bush is nearly as intelligent as you seem to think. I base this mainly on the fact that his policies have been a disaster.\n \n I will be supporting Mr. Kerry this November.\n\n \n If someone else was running against Kerrry (and you still intended to vote for him), WHY would you vote FOR Kerry (instead of AGAINST Bush)?\n \n It seems that many Democrats only want to defeat Bush and have no plan/concept of what they want/expect from the next president.", 
   {
    "post_info": {
     "post_title": "anti-vote?"
    }
   }, 
   44730, 
   null, 
   1082838540.0
  ], 
  [
   45673, 
   null, 
   "sglaine", 
   "Apparently, they did their homework in the dark.\n\n No they did not they my friend are not one way. Bush and his corhorts have lied to us since day one. do your homework. :xbanghead", 
   {}, 
   45647, 
   null, 
   1082854800.0
  ], 
  [
   45676, 
   null, 
   "billsco", 
   "We may see Kerry implode yet. As of this writing everything is going against Bush -- the increased hostilities and death toll in Iraq, Richard Clarke, the 9/11 commission, Bob Woodward's new book -- and yet Bush is walking away in the polls of late. What would need to occur for Kerry to win I must ask?", 
   {}, 
   42489, 
   null, 
   1082856600.0
  ], 
  [
   45677, 
   null, 
   "sglaine", 
   "Quick throw a siver spoon in Kerrys mouth. Like Bush was born with. emoticon_xbye", 
   {}, 
   45676, 
   null, 
   1082856780.0
  ], 
  [
   45679, 
   null, 
   "billsco", 
   "\n I am also not convinced that Bush is nearly as intelligent as you seem to think. \n \n \n\n \n Hi dragonfly,\n \n I think presidential intelligence is an overrated quality. Our most successful presidents were the ones with simple messages who had the ability to get us to see things in more black and white terms. May I suggest Truman and Reagan to make my case. Our worst presidents, IMO, are those who overanalyzed the issues and were, in effect, frozen into inaction. I'll suggest Wilson and Carter.\n \n Bush's message to date has been very simple. It bodes well for him, in my estimation, to be viewed favorably by historians.\n \n regards", 
   {}, 
   44730, 
   null, 
   1082858100.0
  ], 
  [
   45799, 
   null, 
   "sglaine", 
   "Hi dragonfly,\n \n I think presidential intelligence is an overrated quality. Our most successful presidents were the ones with simple messages who had the ability to get us to see things in more black and white terms. May I suggest Truman and Reagan to make my case. Our worst presidents, IMO, are those who overanalyzed the issues and were, in effect, frozen into inaction. I'll suggest Wilson and Carter.\n \n Bush's message to date has been very simple. It bodes well for him, in my estimation, to be viewed favorably by historians.\n \n regards\n\n I agree it is overrated just like the media they blow things out of wack too.", 
   {}, 
   45679, 
   null, 
   1082935440.0
  ], 
  [
   45832, 
   null, 
   "fracas", 
   "Bob Woodward of watergate fame did not believe Bush lied as told in his book \"Plan of Attack\"", 
   {}, 
   45799, 
   null, 
   1082957160.0
  ], 
  [
   45896, 
   null, 
   "Ghost", 
   "People aren't going to vote for Kerry because they like him. Who would? Even if you're going to vote for him, you gotta see him as a pompous ***. He inspires no passion, he doesn't get people excited, he's just the guy running who isn't Bush.\n \n Bush is a charismatic guy. You might disagree with him, but he does come across as a genuinely nice guy with a sense of humor. I think that, combined with his self-confidence and commitment, will win the day for him.", 
   {}, 
   45832, 
   null, 
   1083012360.0
  ], 
  [
   46548, 
   null, 
   "sglaine", 
   "People aren't going to vote for Kerry because they like him. Who would? Even if you're going to vote for him, you gotta see him as a pompous ***. He inspires no passion, he doesn't get people excited, he's just the guy running who isn't Bush.\n \n Bush is a charismatic guy. You might disagree with him, but he does come across as a genuinely nice guy with a sense of humor. I think that, combined with his self-confidence and commitment, will win the day for him.\n\n Nope they might not like him you got that one right. Now they are going to vote for him because he answers hi ??s honestly and openly wow. I know some folks do not understand the word HONESTLY. Real people dont care about the nice guy approch. They want the HONEST approch.", 
   {}, 
   45896, 
   null, 
   1083194940.0
  ], 
  [
   46730, 
   null, 
   "Ghost", 
   "Now they are going to vote for him because he answers hi ??s honestly and openly wow. I know some folks do not understand the word HONESTLY. Real people dont care about the nice guy approch. They want the HONEST approch.\n\n \n \n Sglaine, I'm going to give you the award for the funniest person here. You think that JOHN KERRY IS HONEST?!?!?! \n \n :xbanghead :xbanghead :xbanghead :xbanghead :xbanghead \n \n Have you paid ANY attention to what's been going on? Or what he's said? I guess you haven't. John Kerry is the antithesis of the honest approach.", 
   {}, 
   46548, 
   null, 
   1083266580.0
  ], 
  [
   46749, 
   null, 
   "sglaine", 
   "Sglaine, I'm going to give you the award for the funniest person here. You think that JOHN KERRY IS HONEST?!?!?! \n \n :xbanghead :xbanghead :xbanghead :xbanghead :xbanghead \n \n Have you paid ANY attention to what's been going on? Or what he's said? I guess you haven't. John Kerry is the antithesis of the honest approach.\n\n Hey pal we are all intitled to our opion I think he has more class then you know who I hate to say it but at least when you ask him a ??? you dont have to wait. he will look you right in the eye and tell it to you straight. Unlike Bush who lied about the Iraqy war. And spending money like drunken bums.", 
   {}, 
   46730, 
   null, 
   1083280680.0
  ], 
  [
   46755, 
   null, 
   "jim's trucking", 
   "...when asked by a group he was speaking to on Earth Day if he owned any SUVs, Kerry said that he didn't.\n \n When reminded of pictures of SUVs in some of his many driveways, Kerry said that they don't belong to him, they belong to his family.\n \n Ha! Ha! Ha!\n \n What a joke John Kerry is.", 
   {
    "post_info": {
     "post_title": "Kerry's version of the truth..."
    }
   }, 
   46749, 
   null, 
   1083281880.0
  ], 
  [
   46762, 
   null, 
   "sglaine", 
   "...when asked by a group he was speaking to on Earth Day if he owned any SUVs, Kerry said that he didn't.\n \n When reminded of pictures of SUVs in some of his many driveways, Kerry said that they don't belong to him, they belong to his family.\n \n Ha! Ha! Ha!\n \n What a joke John Kerry is.\n\n What a joke George W. Bush is Haaa haaaa haaaa haaa haaaa haaaa haaaa emoticon_xagree And what in the world does SUVs in Kerrys driveway have to do with how Kerry is going to win or not. Also Bush has a lot of SUVs on his ranch so whats the big deal.", 
   {}, 
   46755, 
   null, 
   1083283740.0
  ], 
  [
   46839, 
   null, 
   "Phunting", 
   "Alright, alright none of that thank you.\n \n I must admit however that despite the fact I am intending to vote for him, I don't particularly view Kerry as honest either.", 
   {}, 
   46762, 
   null, 
   1083325200.0
  ], 
  [
   46951, 
   null, 
   "sglaine", 
   "Now I think Kerry lies BUSH defiantly lies I think a change is needed then when those Bozos screw up things a little more maybe DEAN will be accepted and fix things to the way America should be.", 
   {}, 
   46839, 
   null, 
   1083366660.0
  ], 
  [
   46971, 
   null, 
   "jim's trucking", 
   "Kerry's answers to the SUV question were important to the Green Party \"Earth Day\" advocates. They don't think anyone needs to have an SUV....so Kerry said he didn't own one. He deliberately misled them, similar to Slick Willy's statement that \"That depends on what your definition of is is.\"\n \n Kerry proves once again his political opportunism.", 
   {}, 
   46951, 
   null, 
   1083374940.0
  ], 
  [
   46998, 
   null, 
   "sglaine", 
   "Kerry's answers to the SUV question were important to the Green Party \"Earth Day\" advocates. They don't think anyone needs to have an SUV....so Kerry said he didn't own one. He deliberately misled them, similar to Slick Willy's statement that \"That depends on what your definition of is is.\"\n \n Kerry proves once again his political opportunism.\n\n Come on Jim That is not a big deal now let reverse if it was Bush that was asked that ?? and he said the same thing you would not even be posting on this issue. It is not a big deal. I hope he has 30 of them in his driveway. I think you are just being picky une. I know you are.", 
   {}, 
   46971, 
   null, 
   1083380040.0
  ], 
  [
   47029, 
   null, 
   "jskufan", 
   "Kerry's answers to the SUV question were important to the Green Party \"Earth Day\" advocates. They don't think anyone needs to have an SUV....so Kerry said he didn't own one. He deliberately misled them, similar to Slick Willy's statement that \"That depends on what your definition of is is.\"\n \n Kerry proves once again his political opportunism.\n\n \n Here's a list of all the politicians that haven't deceived the voting public in some way, shape, or form:\n \n 1)__________________________________", 
   {}, 
   46971, 
   null, 
   1083382920.0
  ], 
  [
   47061, 
   null, 
   "jim's trucking", 
   "You guys need to face up to the fact that Kerry is a deceptive political opportunist.", 
   {}, 
   47029, 
   null, 
   1083397380.0
  ], 
  [
   47065, 
   null, 
   "Maineiac", 
   "You guys need to face up to the fact that Kerry is a deceptive political opportunist.\n In all fairness Jim, I think we do realize it. At the same time, I think Bush is no better or worse. It's just the way our political system works.", 
   {}, 
   47061, 
   null, 
   1083419220.0
  ], 
  [
   47068, 
   null, 
   "sglaine", 
   "You guys need to face up to the fact that Kerry is a deceptive political opportunist.\n\n I'm sorry but you cant sell us that line of Bull we aready got that with Bush.", 
   {}, 
   47061, 
   null, 
   1083421920.0
  ], 
  [
   47073, 
   null, 
   "jim's trucking", 
   "A lie is a lie is a lie! It makes no difference that owning an SUV is not a big deal. It's a matter of principle.\n \n Bill Clinton's lie under oath concerned an insignificant \"deal\", but was enough to get him impeached, as it should have.\n \n John Kerry makes Bill Clinton look like a choir boy singing Amazing Grace.\n \n When you tell two groups two opposing views in your campaign speeches, you are pandering.\n \n Bush presents his one-sided views whether you like them or not. His so-called \"lie\" about WMDs was a result of poor intelligence transmitted to him.\n \n Kerry's lies are intended to obtain votes.\n \n Kerry Took BOTH Sides In First Gulf War In Separate Letters To Same Constituent. &#8220;Rather than take a side--albeit the one he thought was most expedient--Kerry actually stood on both sides of the first Gulf war, much like he did this time around. Consider this &#8216;Notebook&#8217; item from TNR&#8217;s March 25, 1991 issue, which ran under the headline &#8216;Same Senator, Same Constituent&#8217;: &#8216;Thank you for contacting me to express your opposition ... to the early use of military force by the US against Iraq. I share your concerns. On January 11, I voted in favor of a resolution that would have insisted that economic sanctions be given more time to work and against a resolution giving the president the immediate authority to go to war.&#8217; --letter from Senator John Kerry to Wallace Carter of Newton Centre, Massachusetts, dated January 22 [1991] &#8216;Thank you very much for contacting me to express your support for the actions of President Bush in response to the Iraqi invasion of Kuwait. From the outset of the invasion, I have strongly and unequivocally supported President Bush&#8217;s response to the crisis and the policy goals he has established with our military deployment in the Persian Gulf.&#8217; --Senator Kerry to Wallace Carter, January 31 [1991]&#8221; (Noam Scheiber, &#8220;Noam Scheiber&#8217;s Daily Journal of Politics, The New Republic Online, 1/28/04) \n \n \n On another issue...\n \n \n October 2003: Kerry Calls Fence &#8220;Barrier To Peace.&#8221; &#8220;And I know how disheartened Palestinians are by the Israeli government&#8217;s decision to build a barrier off the green line, cutting deeply into Palestinian areas. We do not need another barrier to peace. Provocative and counterproductive measures only harm Israel&#8217;s security over the long- term, they increase hardships to the Palestinian people, and they make the process of negotiating an eventual settlement that much harder.&#8221; (Sen. John Kerry, Remarks Before Arab American Institute National Leadership Conference, Dearborn, MI, 10/17/03)\n \n \n \n February 2004: Kerry Calls Fence &#8220;Legitimate Act Of Self-Defense.&#8221; &#8220;US Senator John Kerry of Massachusetts, the frontrunner in the race for the Democratic presidential nomination, described Israel&#8217;s construction of a security barrier as a &#8216;legitimate act of self defense&#8217; after Sunday&#8217;s suicide bombing in Jerusalem, clarifying a position he took in October when he told an Arab American audience, &#8216;We don&#8217;t need another barrier to peace.&#8217;&#8221; (Janine Zacharia, &#8220;Kerry Defends Security Fence,&#8221; The Jerusalem Post, 2/25/04)\n \n \n \n John Kerry is a dangerous man.", 
   {}, 
   47068, 
   null, 
   1083425280.0
  ], 
  [
   47076, 
   null, 
   "sglaine", 
   "A lie is a lie is a lie! It makes no difference that owning an SUV is not a big deal. It's a matter of principle.\n \n Bill Clinton's lie under oath concerned an insignificant \"deal\", but was enough to get him impeached, as it should have.\n \n John Kerry makes Bill Clinton look like a choir boy singing Amazing Grace.\n \n When you tell two groups two opposing views in your campaign speeches, you are pandering.\n \n Bush presents his one-sided views whether you like them or not. His so-called \"lie\" about WMDs was a result of poor intelligence transmitted to him.\n \n Kerry's lies are intended to obtain votes.\n \n Kerry Took BOTH Sides In First Gulf War In Separate Letters To Same Constituent. \"Rather than take a side--albeit the one he thought was most expedient--Kerry actually stood on both sides of the first Gulf war, much like he did this time around. Consider this 'Notebook' item from TNR's March 25, 1991 issue, which ran under the headline 'Same Senator, Same Constituent': 'Thank you for contacting me to express your opposition ... to the early use of military force by the US against Iraq. I share your concerns. On January 11, I voted in favor of a resolution that would have insisted that economic sanctions be given more time to work and against a resolution giving the president the immediate authority to go to war.' --letter from Senator John Kerry to Wallace Carter of Newton Centre, Massachusetts, dated January 22 [1991] 'Thank you very much for contacting me to express your support for the actions of President Bush in response to the Iraqi invasion of Kuwait. From the outset of the invasion, I have strongly and unequivocally supported President Bush's response to the crisis and the policy goals he has established with our military deployment in the Persian Gulf.' --Senator Kerry to Wallace Carter, January 31 [1991]\" (Noam Scheiber, \"Noam Scheiber's Daily Journal of Politics, The New Republic Online, 1/28/04) \n \n \n On another issue...\n \n \n October 2003: Kerry Calls Fence \"Barrier To Peace.\" \"And I know how disheartened Palestinians are by the Israeli government's decision to build a barrier off the green line, cutting deeply into Palestinian areas. We do not need another barrier to peace. Provocative and counterproductive measures only harm Israel's security over the long- term, they increase hardships to the Palestinian people, and they make the process of negotiating an eventual settlement that much harder.\" (Sen. John Kerry, Remarks Before Arab American Institute National Leadership Conference, Dearborn, MI, 10/17/03)\n \n \n \n February 2004: Kerry Calls Fence \"Legitimate Act Of Self-Defense.\" \"US Senator John Kerry of Massachusetts, the frontrunner in the race for the Democratic presidential nomination, described Israel's construction of a security barrier as a 'legitimate act of self defense' after Sunday's suicide bombing in Jerusalem, clarifying a position he took in October when he told an Arab American audience, 'We don't need another barrier to peace.'\" (Janine Zacharia, \"Kerry Defends Security Fence,\" The Jerusalem Post, 2/25/04)\n \n \n \n John Kerry is a dangerous man.\n Thats a matter of opion what Clinton did was very little compared to Bush. What I can't furger out is why do the Conservatives want to be in someones bedroom anyways.And that is what Clinton's deal was minor. the thing of it is Jim I would be for Bush and I used to be the WMDs did it for me he also under minded the UN we are going to screw ourselves in the end and mark my word. If the rest of the world and the UN supported this war I would not be typing. But we all need to take a long hard look at this matter. I just don't care for Conservatives to censer what goes on in our home ether. Jim it go's be on the war. I feel that we are losing our constitustion it is not a pretty sight further more religion Doe's not belong in politics ether.", 
   {
    "unicode_changes_made": true
   }, 
   47073, 
   null, 
   1083426540.0
  ], 
  [
   47148, 
   null, 
   "Rev. HellH0und", 
   "...when asked by a group he was speaking to on Earth Day if he owned any SUVs, Kerry said that he didn't.\n \n When reminded of pictures of SUVs in some of his many driveways, Kerry said that they don't belong to him, they belong to his family.\n \n Ha! Ha! Ha!\n \n What a joke John Kerry is.\n\n \n \n \n Two weeks before that he was in detroit ragging about all the SUV's HE owns...\n \n \n Not to mention the $7000 an hour aircraft he jet sets around in!", 
   {}, 
   46755, 
   null, 
   1083470220.0
  ], 
  [
   47151, 
   null, 
   "jskufan", 
   "Two weeks before that he was in detroit ragging about all the SUV's HE owns...\n \n \n Not to mention the $7000 an hour aircraft he jet sets around in!\n\n \n Would that be the big black suburbans or the 747 known as \"Air Force One\". Oh, I forgot that's your candidate touring the USA campaigning on the taxpayer's dollar. I wonder what Air Force One costs us per hour???", 
   {}, 
   47148, 
   null, 
   1083470700.0
  ], 
  [
   47171, 
   null, 
   "DangerousMann", 
   "Bush and cheney's lies aren't significant? of course they aren't....drink the kool aid...be a zombie for bush", 
   {}, 
   47151, 
   null, 
   1083498900.0
  ], 
  [
   47172, 
   null, 
   "DangerousMann", 
   "Bush isn't even conservative...fiscally he spends like a drunken trophy wife.", 
   {}, 
   47171, 
   null, 
   1083499020.0
  ], 
  [
   47178, 
   null, 
   "sglaine", 
   "Bush and cheney's lies aren't significant? of course they aren't....drink the kool aid...be a zombie for bush\n\n Haaaa Haaaa Haaaa Haaaaa haaaaaa I like that one emoticon_xbouncer", 
   {}, 
   47171, 
   null, 
   1083508680.0
  ], 
  [
   47179, 
   null, 
   "Maineiac", 
   "Bush isn't even conservative...fiscally he spends like a drunken trophy wife.\n I'll drink to that! emoticon_xhoho", 
   {}, 
   47172, 
   null, 
   1083508980.0
  ], 
  [
   47182, 
   null, 
   "sglaine", 
   "Bush isn't even conservative...fiscally he spends like a drunken trophy wife.\n\n Welcome aboard dangerous Mann I have been saying that ever since I have joined. Enjoy yourself. emoticon_xgood emoticon_xgood", 
   {}, 
   47172, 
   null, 
   1083512040.0
  ], 
  [
   47207, 
   null, 
   "jim's trucking", 
   "Would that be the big black suburbans or the 747 known as \"Air Force One\". Oh, I forgot that's your candidate touring the USA campaigning on the taxpayer's dollar. I wonder what Air Force One costs us per hour???\n\n \n Any airplane carrying the President is called Air Force One. The helicopter is called Marine One.\n \n The President deserves a large protective force. Even ex-Presidents get SS protection for life.\n \n There's nothing wrong with owning an SUV. What is wrong is claiming that they are bad while you still own several. Kerry is a political opportunist and you can't change that.", 
   {}, 
   47151, 
   null, 
   1083519720.0
  ], 
  [
   47213, 
   null, 
   "sglaine", 
   "i never really had a problem with Clinton getting a blowjob myself.. i just dont see how a presidents private sexual life has anythign to do with how well we can run the country. i have a far bigger problem with Bush misleading the country, intentionally or unintentionally, into a war that didnt need to be fought. if it was intentional then he's a liar, if it was unintentional then he's an honest fool. either way, no good for us. \n i dont think Bush is an evil man by any means, but i also think he's in WAY over his head. i realize that he runs on intuition more than intelligence but unless someone is anointed by god with an amazing sense of \"RIGHT\", then presidents should be analytical and logical intheir actions.. this is a qoute from Bush..\n \"do you know, i'm not very analytical. i dotn spend much time thinkign about myself or why i do things..\" emoticon_xdonno\n\n Yes yes yes I like that view point.", 
   {}, 
   42695, 
   null, 
   1083520560.0
  ], 
  [
   47214, 
   null, 
   "jim's trucking", 
   "There's quite a difference between saying that someone spends money like a trophy wife and pointing out expenditures that you believe unnecessary.\n \n There's a difference between just saying that someone lies and pointing out a lie that person said.\n \n The only \"lie\" I've seen posted regarding Bush is that tired old, \"He lied about WMDs.\"\n \n When pointing out Kerry's opportunistic lies, I show you where he made two different statements each in opposition to the other. Why can't you and Dmann do the same?", 
   {}, 
   47182, 
   null, 
   1083520740.0
  ], 
  [
   47215, 
   null, 
   "sglaine", 
   "There's quite a difference between saying that someone spends money like a trophy wife and point out expenditures that you believe unnecessary.\n \n There's a difference between just saying that someone lies and pointing out a lie that person said.\n \n The only \"lie\" I've seen posted regarding Bush is that tired old, \"He lied about WMDs.\"\n \n When pointing out Kerry's opportunistic lies, I show you where he made two different statements each in opposition to the other. Why can't you and Dmann do the same?\n Kerrys lies are very minor in nature campred to Bushs missleading BS.", 
   {}, 
   47214, 
   null, 
   1083520920.0
  ], 
  [
   47216, 
   null, 
   "jim's trucking", 
   "Clinton's lie was minor also, but it got him impeached. It's a principle thing, not a magnitude thing. Kerry has been proven a liar. Bush has not.", 
   {}, 
   47215, 
   null, 
   1083521040.0
  ], 
  [
   47220, 
   null, 
   "jim's trucking", 
   "It just goes to show that you do not like opposition... goes like this try the 1st amendment witch ...\n\n \n I don't mind opposition at all. Simply because I disagree with most of what they say, doesn't mean I don't like opposition.\n \n Debate without opposition is not debate.\n \n Debate without worthy opposition is a waste of time.\n \n If I could find the 1st amendment witch, I'd certainly try her.\n \n When stating opinions about the habits or character of a public figure, one should accompany them with supporting facts.", 
   {}, 
   47182, 
   null, 
   1083522420.0
  ], 
  [
   47221, 
   null, 
   "sglaine", 
   "Clinton's lie was minor also, but it got him impeached. It's a principle thing, not a magnitude thing. Kerry has been proven a liar. Bush has not.\n\n There was nothing impeachable offence though. Now here is the problem is the Republicans want to metal in peoples business. And that is not right all I have seen is a lot of dirty pool they do not know what clean game is. And that is why I changed partys. In lue of Bushs misleading us. In the old days they were honest but now adays I think they forgot what that means. And yes Jims trucking they all lie in one form or another.", 
   {}, 
   47216, 
   null, 
   1083522840.0
  ], 
  [
   47224, 
   null, 
   "sglaine", 
   "I don't mind opposition at all. Simply because I disagree with most of what they say, doesn't mean I don't like opposition.\n \n Debate without opposition is not debate.\n \n Debate without worthy opposition is a waste of time.\n \n If I could find the 1st amendment witch, I'd certainly try her.\n \n When stating opinions about the habits or character of a public figure, one should accompany them with supporting facts.\n Oh like you making a Federal case out of Kerry's SUVs. Nit picking is what I call it. And because you don't like someone you call it character I call it nit picking vice-avarice. And it goes back and forth..", 
   {}, 
   47220, 
   null, 
   1083523980.0
  ], 
  [
   47227, 
   null, 
   "Maineiac", 
   "When thinking of Bush lies,the first thing that comes to mind is the photo op aboard the ship that had a banner that read,\"Mission Accomplished\". \n \n I'm not aware of any mission that Bush has accomplished up to this point. He certainally hasn't won any wars. This event would lead me to believe that Bush tends to overstate facts, and attempts to mislead the public.\n \n A lot of soldiers have lost their lives in 2 ongoing wars that we are currently fighting,with no end in sight,since his declaration.\n \n Another statement made by Bush was that \"We are not into nation building\". It seems to me that Iraq is certainally a case of nation building in all aspects. At the Rate of $1 billion a week or more,I can think of at least one nation the money could have helped.", 
   {}, 
   47221, 
   null, 
   1083525180.0
  ], 
  [
   47230, 
   null, 
   "jim's trucking", 
   "When thinking of Bush lies,the first thing that comes to mind is the photo op aboard the ship that had a banner that read,\"Mission Accomplished\". \n \n I'm not aware of any mission that Bush has accomplished up to this point. He certainally hasn't won any wars. This event would lead me to believe that Bush tends to overstate facts, and attempts to mislead the public.\n\n \n I'm not 100% confident in my recollection of the timing, but it may have been refering to the defeat of Saddam's army. I don't think it was meant to imply that we were through in Iraq.\n \n Besides that, I don't know who ordered the banner put up or that Bush was aware of its being there.\n \n \n \n \n\n A lot of soldiers have lost their lives in 2 ongoing wars that we are currently fighting,with no end in sight,since his declaration.\n\n \n There was no end in sight for a long time for WWI and WWII. Do you think we should have given up when it became evident that a lot of soldiers had died and that a lot more probably would?\n \n \n \n \n\n Another statement made by Bush was that \"We are not into nation building\". It seems to me that Iraq is certainally a case of nation building in all aspects. At the Rate of $1 billion a week or more,I can think of at least one nation the money could have helped.\n\n \n I believe what he meant is that we are not into fashioning nations after ourselves. We are not installing a government. We will leave the Iraqis to govern themselves after relative stability is restored. This is happening slowly, but it is happening.", 
   {}, 
   47227, 
   null, 
   1083526440.0
  ], 
  [
   47232, 
   null, 
   "sglaine", 
   "I am sure that banner was intend for a political stunt to gain votes for Bush.", 
   {}, 
   47230, 
   null, 
   1083527760.0
  ], 
  [
   47237, 
   null, 
   "jim's trucking", 
   "Can you offer any proof? If not, it remains your unsubstantiated opinion.", 
   {}, 
   47232, 
   null, 
   1083529080.0
  ], 
  [
   47239, 
   null, 
   "sglaine", 
   "Can you offer any proof? If not, it remains your unsubstantiated opinion.\n\n It's called common sense read the wrighting on the wall. this war probably wont be over for years. The mission is not over and wont be as long as we keep thowing gas on the fire.", 
   {}, 
   47237, 
   null, 
   1083529380.0
  ], 
  [
   47240, 
   null, 
   "Maineiac", 
   "I just came across another interesting outlook on the Bush presidency.\n \n As of 4-09-04, Bush has visited his ranch 33 times.He has spent all or part of 233 days on his ranch in Texas since taking office.\n \n Adding to his 78 visits to Camp David, and his 5 visits to Kennebunkport,Maine, Bush has spent all or part of 500 days in office at 1 of his 3 retreats, or more than 40% of his presidency.\n \n Since this is an election year,I would think that Bush is spending very little time doing what he was elected to do,seeing how he is jet-setting around the country for personal appearances.\n \n Personally I would think that Bush should be spending more time dictating policy from the White House,vs.tele-conferencing important matters from a barbeque pit.", 
   {}, 
   47232, 
   null, 
   1083529380.0
  ], 
  [
   47241, 
   null, 
   "sglaine", 
   "Wow that is something now I like how that man came up with that intresting issue. carry on Maineiac Yep and we are paying for all of that jetsetting. Wasted money indeed.", 
   {}, 
   47240, 
   null, 
   1083529740.0
  ], 
  [
   47242, 
   null, 
   "jim's trucking", 
   "I just came across another interesting outlook on the Bush presidency.\n \n As of 4-09-04, Bush has visited his ranch 33 times.He has spent all or part of 233 days on his ranch in Texas since taking office.\n \n Adding to his 78 visits to Camp David, and his 5 visits to Kennebunkport,Maine, Bush has spent all or part of 500 days in office at 1 of his 3 retreats, or more than 40% of his presidency.\n \n Since this is an election year,I would think that Bush is spending very little time doing what he was elected to do,seeing how he is jet-setting around the country for personal appearances.\n \n Personally I would think that Bush should be spending more time dictating  policy from the White House,vs.tele-conferencing important matters from a barbeque pit.\n\n \n Bush is not a dictator.\n \n You make it sound as if a man's brain stops working unless he is at his office.\n \n I believe some of his trips to the ranch and to Camp David have included meetings with foreign dignitaries.\n \n A lot of good business deals are made over a game of golf.\n \n You could apply the same argument to Kerry's (one of the CURRENT SENATORS from Massachusetts) traveling all over the country while he is supposed to be doing Senator's work in Washington...but I'm sure you won't.", 
   {}, 
   47240, 
   null, 
   1083530160.0
  ], 
  [
   47243, 
   null, 
   "sglaine", 
   "Bush is not a dictator.\n \n You make it sound as if a man's brain stops working unless he is at his office.\n \n I believe some of his trips to the ranch and to Camp David have included meetings with foreign dignitaries.\n \n A lot of good business deals are made over a game of golf.\n \n You could apply the same argument to Kerry's (one of the CURRENT SENATORS from Massachusetts) traveling all over the country while he is supposed to be doing Senator's work in Washington.\n\n Sorry but slamming Kerry again has no merit. Bush could have done most of this at the Whitehorse. And yes Bush's brain does stop even if he is at the Whitehorse. And as far as Ferry traveling thats called campaigning everybodys done that so whats the big deal?", 
   {}, 
   47242, 
   null, 
   1083530460.0
  ], 
  [
   47244, 
   null, 
   "jim's trucking", 
   "Sorry but slamming Kerry again has no merit. Bush could have done most of this at the Whitehorse. And yes Bush's brain does stop even if he is at the Whitehorse. And as far as Ferry traveling thats called campaigning everybodys done that so whats the big deal?\n\n \n Last time I went to the Whitehorse Saloon, I got knee-walking drunk, ran through the front doors and fell right into the waterin' trough! emoticon_xhoho", 
   {}, 
   47243, 
   null, 
   1083530760.0
  ], 
  [
   47247, 
   null, 
   "Maineiac", 
   "Bush seems to be going backwards on the enviroment also. \n \n The Bush addministration is cleaning up 31% fewer Superfund sites than Clinton did.\n \n Polluters are paying 64% less in fines per month than they did in the late 1990's.\n \n These are just a coulple of examples of how Bush has been weak on enviroment issues.", 
   {}, 
   47244, 
   null, 
   1083532440.0
  ], 
  [
   47252, 
   null, 
   "sglaine", 
   "Go.es to show that Bush is not a Conservative because he goes back to Texas to run his ranch at the tax payers expense. I do not think it is fair in that aspect. Also you have a lot of conflict of interest with Cheney hardly ever around he stays hid up some wares helping the contractors in Iraq making money on the side with that one. At least Clinton went to the hearings lately by him self he did not need a puppet like George W. did. I don't know folks but if you have the right frame of mind I would investigate how your country is being ruined. I think it is a shame on how things are being handled by this administration. Bush gave the very rich a big tax break so he could get out of paying less then 1/3 of what he paid last year. So he gave him self a fat raise.", 
   {}, 
   47247, 
   null, 
   1083537240.0
  ], 
  [
   47349, 
   null, 
   "jim's trucking", 
   "Go.es to show that Bush is not a Conservative because he goes back to Texas to run his ranch at the tax payers expense. I do not think it is fair in that aspect. Also you have a lot of conflict of interest with Cheney hardly ever around he stays hid up some wares helping the contractors in Iraq making money on the side with that one. At least Clinton went to the hearings lately by him self he did not need a puppet like George W. did. I don't know folks but if you have the right frame of mind I would investigate how your country is being ruined. I think it is a shame on how things are being handled by this administration. Bush gave the very rich a big tax break  so he could get out of paying less then 1/3 of what he paid last year. So he gave him self a fat raise.\n\n \n My understanding is that Clinton had two advisors with him. He also declined to testify under oath.\n \n Everybody that paid taxes got a tax break.", 
   {}, 
   47252, 
   null, 
   1083605580.0
  ], 
  [
   47357, 
   null, 
   "sglaine", 
   "My understanding is that Clinton had two advisors with him. He also declined to testify under oath.\n \n Everybody that paid taxes got a tax break.\nPlain & simple not like BUSH'S tax break for him self. You don't see my point do you. I will also tell you that I think Bush & Cheney are covering something up but you know it will come out before Nov.", 
   {}, 
   47349, 
   null, 
   1083606660.0
  ], 
  [
   47360, 
   null, 
   "jim's trucking", 
   "Plain & simple not like BUSH'S tax break for him self. You don't see my point do you. I will also tell you that I think Bush & Cheney are covering something up but you know it will come out before Nov.\n\n \n Everybody that paid taxes got a tax break.", 
   {}, 
   47357, 
   null, 
   1083607200.0
  ], 
  [
   47369, 
   null, 
   "sglaine", 
   "Jim you obviously missing my point Bush gave a bigger break for the wealthy & spacial interest and then he sides with big suckup drug companys so every body pays more.", 
   {}, 
   47360, 
   null, 
   1083608520.0
  ], 
  [
   47372, 
   null, 
   "jim's trucking", 
   "Jim you obviously missing my point Bush gave a bigger break for the wealthy & spacial interest and then he sides with big suckup drug companys so every body pays more.\n\n \n People who pay more taxes should get a bigger tax break.\n \n I'm not familiar with his drug policy, but I certainly don't agree with every single thing he does.\n \n However, there should be no refering to his tax break as a \"tax break for the wealthy\". It applied to everybody that paid taxes. Those who pay the most taxes should obviously get more money in the way of a tax break.\n \n Those who advocate socialism and redistribution of wealth will never see it this way. Those people think the rich \"do not need the money\".", 
   {}, 
   47369, 
   null, 
   1083608880.0
  ], 
  [
   47374, 
   null, 
   "Waxy", 
   "Jim you obviously missing my point Bush gave a bigger break for the wealthy & spacial interest and then he sides with big suckup drug companys so every body pays more.\n\n \n Here's a little story for you sglaine. -\n \n I was having lunch at PJ's with one of my favorite clients last week and the conversation turned to the Bush government's recent round of tax cuts. \"I'm opposed to those tax cuts,\" the retired college instructor declared, \"because they benefit the rich. The rich get much more money back than ordinary taxpayers like you and I and that's not fair.\"\n \n \"But the rich pay more in the first place,\" I argued, \"so it stands to\n reason that they'd get more money back.\" I could tell that my friend was unimpressed by this meager argument. Even college instructors are a prisoner of the myth that the \"rich\" somehow get a free ride in USA. Nothing could be further from the truth.\n \n Let's put tax cuts in terms everyone can understand. Suppose that everyday 10 men go to PJ's for dinner, The bill for all ten comes to $100. If it was paid the way we pay our taxes, the first four men would pay nothing; the fifth would pay $1; the sixth would pay $3; the seventh $7; the eighth $12; the ninth $18. The tenth man (the richest) would pay $59.\n \n The 10 men ate dinner in the restaurant every day and seemed quite happy with the arrangement until the owner threw them a curve. Since you are all such good customers, he said, I'm going to reduce the cost of your daily meal by $20. Now dinner for the 10 only costs $80.\n \n The first four are unaffected. They still eat for free. Can you figure out how to divvy up the $20 savings among the remaining six so that everyone gets his fair share? The men realize that $20 divided by 6 is $3.33, but if they subtract that from everybody's share, then the fifth man and the sixth man would end up being paid to eat their meal. The restaurant owner suggested that it would be fair to reduce each man's bill by roughly the same amount and he proceeded to work out the amounts each should pay.\n \n And so the fifth man paid nothing, the sixth pitched in $2, the seventh paid $5, the eighth paid $9, the ninth paid $12, leaving the tenth man with a bill of $52 instead of $59. Outside the restaurant, the men began to compare their savings.\n \n \"I only got a dollar out the $20,\" declared the sixth man pointing to the tenth, \"and he got $7!\" \"Yeah, that's right,\" exclaimed the fifth man. I only saved a dollar, too. It's unfair that he got seven times more than me! \"That's true,\" shouted the seventh man. \"Why should he get $7 back when I got only $2? The wealthy get all the breaks.\" \"Wait a minute,\" yelled the first four men in unison. \"We didn't get anything at all. The system exploits the poor.\" \n \n The nine men surrounded the tenth and beat him up. The next night he didn't show up for dinner, so the nine sat down and ate without him. But when it came time to pay the bill, they discovered something important. They were $52 short!\n \n And that, boys and girls, and college instructors, is how the US's tax system works. The people who pay the highest taxes get the most benefit from a tax reduction. Tax them too much, attack them for being wealthy, and they just may not show up at the table anymore. There are lots of good restaurants in Switzerland and the Caribbean.\n \n Waxy", 
   {}, 
   47369, 
   null, 
   1083608940.0
  ], 
  [
   47377, 
   null, 
   "jim's trucking", 
   "Here's a little story for you sglaine. -\n \n I was having lunch at PJ's with one of my favorite clients last week and the conversation turned to the Bush government's recent round of tax cuts. \"I'm opposed to those tax cuts,\" the retired college instructor declared, \"because they benefit the rich. The rich get much more money back than ordinary taxpayers like you and I and that's not fair.\"\n \n \"But the rich pay more in the first place,\" I argued, \"so it stands to\n reason that they'd get more money back.\" I could tell that my friend was unimpressed by this meager argument. Even college instructors are a prisoner of the myth that the \"rich\" somehow get a free ride in USA. Nothing could be further from the truth.\n \n Let's put tax cuts in terms everyone can understand. Suppose that everyday 10 men go to PJ's for dinner, The bill for all ten comes to $100. If it was paid the way we pay our taxes, the first four men would pay nothing; the fifth would pay $1; the sixth would pay $3; the seventh $7; the eighth $12; the ninth $18. The tenth man (the richest) would pay $59.\n \n The 10 men ate dinner in the restaurant every day and seemed quite happy with the arrangement until the owner threw them a curve. Since you are all such good customers, he said, I'm going to reduce the cost of your daily meal by $20. Now dinner for the 10 only costs $80.\n \n The first four are unaffected. They still eat for free. Can you figure out how to divvy up the $20 savings among the remaining six so that everyone gets his fair share? The men realize that $20 divided by 6 is $3.33, but if they subtract that from everybody's share, then the fifth man and the sixth man would end up being paid to eat their meal. The restaurant owner suggested that it would be fair to reduce each man's bill by roughly the same amount and he proceeded to work out the amounts each should pay.\n \n And so the fifth man paid nothing, the sixth pitched in $2, the seventh paid $5, the eighth paid $9, the ninth paid $12, leaving the tenth man with a bill of $52 instead of $59. Outside the restaurant, the men began to compare their savings.\n \n \"I only got a dollar out the $20,\" declared the sixth man pointing to the tenth, \"and he got $7!\" \"Yeah, that's right,\" exclaimed the fifth man. I only saved a dollar, too. It's unfair that he got seven times more than me! \"That's true,\" shouted the seventh man. \"Why should he get $7 back when I got only $2? The wealthy get all the breaks.\" \"Wait a minute,\" yelled the first four men in unison. \"We didn't get anything at all. The system exploits the poor.\" \n \n The nine men surrounded the tenth and beat him up. The next night he didn't show up for dinner, so the nine sat down and ate without him. But when it came time to pay the bill, they discovered something important. They were $52 short!\n \n And that, boys and girls, and college instructors, is how the US's tax system works. The people who pay the highest taxes get the most benefit from a tax reduction. Tax them too much, attack them for being wealthy, and they just may not show up at the table anymore. There are lots of good restaurants in Switzerland and the Caribbean.\n \n Waxy\n\n \n I was hoping someone would remember that and post it! emoticon_xhoho", 
   {}, 
   47374, 
   null, 
   1083609120.0
  ], 
  [
   47384, 
   null, 
   "sglaine", 
   "Waxy: your story is a good one. I amused by it but if for an example we pay 33% for taxes why should Bush only pay 23% see my point. And that my friend is not paying his full share. Also hoe can anybody support someone that is for Corporate suck ups like the drug company's that are selling drugs to foreigns cheaper than us. What is going on here is that unless you have full coverage your scewed. And a lot of people in America do not have a plan because ether it's too expensive or they are poor and they would have too give up eating. I think what the problem is some of you are well off and dont care about others The Conservatives think like that. I was brought up that fairness should be for everybody but the Conservatives think ha-ray for me and the *** with you. You need to take a better look at hoe things really are in this country.", 
   {}, 
   47377, 
   null, 
   1083610140.0
  ], 
  [
   47387, 
   null, 
   "jim's trucking", 
   "Waxy: your story is a good one. I amused by it but if for an example we pay 33% for taxes why should Bush only pay 23% see my point. And that my friend is not paying his full share. Also hoe can anybody support someone that is for Corporate suck ups like the drug company's that are selling drugs to foreigns cheaper than us. What is going on here is that unless you have full coverage your scewed. And a lot of people in America do not have a plan because ether it's too expensive or they are poor and they would have too give up eating. I think what the problem is some of you are well off and dont care about others The Conservatives think like that. I was brought up that fairness should be for everybody but the Conservatives think ha-ray for me and the *** with you. You need to take a better look at hoe things really are in this country.\n\n \n So, do you think everyone should pay the same percentage in tax?\n \n I don't know what your 33% or Bush's 23% amount to, but it's possible that his 23% is more than your 33%.", 
   {}, 
   47384, 
   null, 
   1083610620.0
  ], 
  [
   47388, 
   null, 
   "Waxy", 
   "You were amused by the story, but you obviously didn't understand it.\n \n Let's say you make $50,000 and Bush makes $500,000.\n \n You paid $16,500 in tax, Bush paid $115,000. So, who's not paying their share again?\n \n Waxy", 
   {}, 
   47384, 
   null, 
   1083610680.0
  ], 
  [
   47410, 
   null, 
   "Eddie", 
   "I think you`ll have to give up the idea of finding some form of \"naturally fair share\" of tax. The income distribution is artificially created regardless your tax rate. Try to find the tax system that you think is the most fair based on your values instead... just a friendly tip to both sides ;)", 
   {}, 
   47388, 
   null, 
   1083618840.0
  ], 
  [
   47416, 
   null, 
   "sglaine", 
   "So, do you think everyone should pay the same percentage in tax?\n \n I don't know what your 33% or Bush's 23% amount to, but it's possible that his 23% is more than your 33%.\n\n Jim if you read my post I said example and yes I think the very weathy should pay more in taxes.", 
   {}, 
   47387, 
   null, 
   1083620580.0
  ], 
  [
   47421, 
   null, 
   "jim's trucking", 
   "Jim if you read my post I said example and yes I think the very weathy should pay more in taxes.\n\n \n They do. They do. They do.", 
   {}, 
   47416, 
   null, 
   1083620880.0
  ], 
  [
   47422, 
   null, 
   "sglaine", 
   "They do. They do. They do.\n\n No they dont pal.", 
   {}, 
   47421, 
   null, 
   1083620940.0
  ], 
  [
   47426, 
   null, 
   "jim's trucking", 
   "No they dont pal.\n\n \n I don't know the exact percentage, but it's something like the top 10% wage earners pay 90% of the total collected income tax. If that's not correct, I'm sure I can find out what is. Regardless of some minute error, it indicates that the high income people pay more tax than the low income people.\n \n Do you have any proof in the opposite?", 
   {}, 
   47422, 
   null, 
   1083621240.0
  ], 
  [
   47445, 
   null, 
   "sglaine", 
   "I don't know the exact percentage, but it's something like the top 10% wage earners pay 90% of the total collected income tax. If that's not correct, I'm sure I can find out what is. Regardless of some minute error, it indicates that the high income people pay more tax than the low income people.\n \n Do you have any proof in the opposite?\n\n Yes I do have proof that fact of the matter is the tax break he gave did not amount but only a small % rate to the middle class. The very wealthy received a generous tax break so that bush could get almost a 1/3 off on his taxes. this was said on ABC, CBS, and CNN This was about 2 moths ago I am not that good in research on the INTERNET maybe you can find it. But I'm telling you Jim I heard it. So Bush gave him self a very healthy raise at our expense.", 
   {}, 
   47426, 
   null, 
   1083623400.0
  ], 
  [
   47446, 
   null, 
   "jim's trucking", 
   "Yes I do have proof that fact of the matter is the tax break he gave did not amount but only a small % rate to the middle class. The very wealthy received a generous tax break so that bush could get almost a 1/3 off on his taxes. this was said on ABC, CBS, and CNN This was about 2 moths ago I am not that good in research on the INTERNET maybe you can find it. But I'm telling you Jim I heard it. So Bush gave him self a very healthy raise at our expense.\n\n \n How much of the total income tax collected do you think comes from the wealthiest (top 10%) of wage earners?", 
   {}, 
   47445, 
   null, 
   1083623580.0
  ], 
  [
   47458, 
   null, 
   "sglaine", 
   "Hey Jims Trucking; Check out this link of proof www.mediaresearch.org/cyberalerts/2003/cyb20030107.asp#1 And I think you will see what I am getting at here.", 
   {}, 
   47446, 
   null, 
   1083625320.0
  ], 
  [
   47475, 
   null, 
   "jim's trucking", 
   "Hey Jims Trucking; Check out this link of proof www.mediaresearch.org/cyberalerts/2003/cyb20030107.asp#1 And I think you will see what I am getting at here.\n\n \n If you read carefully the entire text of the link you posted, I think you will see that you have shot yourself in the foot with a failed quickdraw.\n \n The article exposes the liberal bias in the attacks on the rich and their taxes.\n \n It also mentions the proportionate amounts of taxes paid by the rich that I mentioned earlier.\n \n It also exposes the fact that the so-called experts used by CBS are actually supporters on the DNC.\n \n Thanks for the link.\n \n \n \n < Top 1%: Adjusted Gross Income of more than $313,469, pays 37.42 percent of all income tax collected\n \n < Top 5%: $128,336, pays 56.47 percent\n \n < Top 10%: $92,144, pays 67.33 percent\n \n < Top 25%: $55,225, pays 84.01 percent\n \n < Top 50%: $27,682, pays 96.09 percent\n \n < Bottom 50%: less than $27,682, pays a mere 3.91 percent\n \n For the press release with those numbers: http://www.house.gov/jec/press/2002/10-24-02.htm\n \n \n \n \n \n The broadcast networks on Monday night, especially CBS, advanced the liberal spin that the Bush tax cut proposals, to accelerate the income tax rate reductions and eliminate the tax on dividends, will unfairly benefit the rich.  No story bothered to put the dollar value of tax reductions by income level into the context of how the wealthier bear the burden of paying most of the income taxes collected while at least a third of Americans pay no income tax and, therefore, cannot pay any less.\n \n \n CBS&#8217;s John Roberts adopted the liberal construct as he described how &#8220;the President's proposal would accelerate tax cuts already planned for the years 2004-2006 across the board, including tax cuts for the wealthiest Americans.&#8221; A tax cut does not &#8220;give&#8221; anything to anyone, it simply means less will be taken by the government, but that&#8217;s not how Roberts painted it as he insisted that &#8220;the President's plan would give the most to the rich.&#8221; (The Democratic plan would &#8220;give&#8221; money to people since people who did not pay income taxes would still get a rebate.)\n \n \n \n CBS followed Roberts with a piece from Byron Pitts devoted to showing how the Bush plan helps only the rich. Pitts focused on the views of &#8220;a middle class wife&#8221; who saw Bush&#8217;s plan as &#8220;little more than a feel-good gift that won't give much to most Americans -- especially the middle class.\" Pitts supported her jealousy: \"We asked accountant Avery Neumark  to do the math. Under the President's overall tax plan, a person earning $175,000 per year could save $3,500. Someone earning $50,000 could expect to get back an extra $1,000. Anyone earning $25,000 -- zero.\" Pitts let Neumark proclaim: \"If you went to summarize this tax proposal as we see it today, the winners are the wealthy.\"\n \n Of course, the more you pay in taxes the more a cut of an equal percentage provides in tax reduction dollar-wise, but Pitts didn&#8217;t bother to examine how much each taxpayer in his example pays currently.\n \n \n \n \n \n [Web Update: CPA Avery Neumark, featured as an expert by the CBS Evening News story above as supporting the liberal premise that Bush&#8217;s tax cut helps the rich while abandoning the poor, is a financial supporter of a liberal Democratic Congressman and the DNC. For details: http://www.mediaresearch.org/cyberalerts/2003/cyb20030108.asp#4]\n \n \n \n \n \n For six pages of detailed IRS tables, in PDF format: http://www.house.gov/jec/press/2002/irs2.pdf\n \n I think I&#8217;ll keep running these numbers until a network decides to inform its viewers of how the income tax burden disproportionately falls on a limited number of taxpayers and so giving them a larger tax break dollar-wise is hardly unfair.\n \n \n Thanks for the help in defeating your argument!", 
   {}, 
   47458, 
   null, 
   1083627000.0
  ], 
  [
   47478, 
   null, 
   "sglaine", 
   "If you read carefully the entire text of the link you posted, I think you will see that you have shot yourself in the foot with a failed quickdraw.\n \n The article exposes the liberal bias in the attacks on the rich and their taxes.\n \n It also mentions the proportionate amounts of taxes paid by the rich that I mentioned earlier.\n \n It also exposes the fact that the so-called experts used by CBS are actually supporters on the DNC.\n \n Thanks for the link.\n \n \n \n < Top 1%: Adjusted Gross Income of more than $313,469, pays 37.42 percent of all income tax collected\n \n < Top 5%: $128,336, pays 56.47 percent\n \n < Top 10%: $92,144, pays 67.33 percent\n \n < Top 25%: $55,225, pays 84.01 percent\n \n < Top 50%: $27,682, pays 96.09 percent\n \n < Bottom 50%: less than $27,682, pays a mere 3.91 percent\n \n For the press release with those numbers: http://www.house.gov/jec/press/2002/10-24-02.htm\n \n \n \n \n \n The broadcast networks on Monday night, especially CBS, advanced the liberal spin that the Bush tax cut proposals, to accelerate the income tax rate reductions and eliminate the tax on dividends, will unfairly benefit the rich.  No story bothered to put the dollar value of tax reductions by income level into the context of how the wealthier bear the burden of paying most of the income taxes collected while at least a third of Americans pay no income tax and, therefore, cannot pay any less.\n \n \n CBS's John Roberts adopted the liberal construct as he described how \"the President's proposal would accelerate tax cuts already planned for the years 2004-2006 across the board, including tax cuts for the wealthiest Americans.\" A tax cut does not \"give\" anything to anyone, it simply means less will be taken by the government, but that's not how Roberts painted it as he insisted that \"the President's plan would give the most to the rich.\" (The Democratic plan would \"give\" money to people since people who did not pay income taxes would still get a rebate.)\n \n \n \n CBS followed Roberts with a piece from Byron Pitts devoted to showing how the Bush plan helps only the rich. Pitts focused on the views of \"a middle class wife\" who saw Bush's plan as \"little more than a feel-good gift that won't give much to most Americans -- especially the middle class.\" Pitts supported her jealousy: \"We asked accountant Avery Neumark  to do the math. Under the President's overall tax plan, a person earning $175,000 per year could save $3,500. Someone earning $50,000 could expect to get back an extra $1,000. Anyone earning $25,000 -- zero.\" Pitts let Neumark proclaim: \"If you went to summarize this tax proposal as we see it today, the winners are the wealthy.\"\n \n Of course, the more you pay in taxes the more a cut of an equal percentage provides in tax reduction dollar-wise, but Pitts didn't bother to examine how much each taxpayer in his example pays currently.\n \n \n \n \n \n [Web Update: CPA Avery Neumark, featured as an expert by the CBS Evening News story above as supporting the liberal premise that Bush's tax cut helps the rich while abandoning the poor, is a financial supporter of a liberal Democratic Congressman and the DNC. For details: http://www.mediaresearch.org/cyberalerts/2003/cyb20030108.asp#4]\n \n \n \n \n \n For six pages of detailed IRS tables, in PDF format: http://www.house.gov/jec/press/2002/irs2.pdf\n \n I think I'll keep running these numbers until a network decides to inform its viewers of how the income tax burden disproportionately falls on a limited number of taxpayers and so giving them a larger tax break dollar-wise is hardly unfair.\n \n \n Thanks for the help in defeating your argument!\nWho made you a JUDGE?", 
   {
    "unicode_changes_made": true
   }, 
   47475, 
   null, 
   1083627540.0
  ], 
  [
   47480, 
   null, 
   "jim's trucking", 
   "Who made you a JUDGE?\n\n \n I'm not a judge. It is clear that you will not believe even your own sources. This single link disproves your whole argument, regardless of who judges it.\n \n Thanks again!\n \n The liberal spin comes from CBS and ABC all the time.\n \n Clinton Broadcasting Service\n \n All Biased Commentary", 
   {}, 
   47478, 
   null, 
   1083627840.0
  ], 
  [
   47481, 
   null, 
   "sglaine", 
   "I'm not a judge. It is clear that you will not believe even your own sources. This single link disproves you whole argument, regardless of who judges it.\n \n Thanks again!\n \n The liberal spin comes from CBS and ABC all the time.\n \n Clinton Broadcasting Service\n \n All Biased Commentary\n\n So you are saying that the Right Radical Concervative lieing channel Fox is any better. I dont think so. They lie lie.", 
   {}, 
   47480, 
   null, 
   1083628080.0
  ], 
  [
   47487, 
   null, 
   "sglaine", 
   "Bush's ads claim that Kerry voted to do away with upgrading the military weapons, jets etc etc. But what they failed to tell you is so did VP.Cheney I find that ad bogus. Who calling the kettle black thats right Cheney voted against the same things.", 
   {}, 
   47481, 
   null, 
   1083629460.0
  ], 
  [
   47490, 
   null, 
   "jim's trucking", 
   "Bush's ads claim that Kerry voted to do away with upgrading the military weapons, jets etc etc. But what they failed to tell you is so did VP.Cheney I find that ad bogus. Who calling the kettle black thats right Cheney voted against the same things.\n\n \n Please post a link showing where your information comes from.\n \n (You see, I have a hard time believing anything you say.)\n \n Are you listening to liberal talk radio, NPR, CBS, ABC....or what?", 
   {}, 
   47487, 
   null, 
   1083629700.0
  ], 
  [
   47492, 
   null, 
   "jim's trucking", 
   "Bush's ads claim that Kerry voted to do away with upgrading the military weapons, jets etc etc. But what they failed to tell you is so did VP.Cheney I find that ad bogus. Who calling the kettle black  thats right Cheney voted against the same things.\n\n \n The point of the \"pot calling the kettle black\" thing is that they are BOTH BLACK!", 
   {}, 
   47487, 
   null, 
   1083629820.0
  ], 
  [
   47493, 
   null, 
   "Big Orn", 
   "I wish that the spitting contest would end.....\n \n You can always tell the character of a man by what it takes to get his goat.", 
   {}, 
   47492, 
   null, 
   1083629940.0
  ], 
  [
   47494, 
   null, 
   "sglaine", 
   "Please post a link showing where your information comes from.\n \n (You see, I have a hard time believing anything you say.)\n \n Are you listening to liberal talk radio, NPR, CBS, ABC....or what?\n\n Look I am asking you what make you think that your right wing source are credible. What make your sources credible for the second time so you under stand me. I will tell you that NPR,CBS and ABC tell the truth and give both sides and don't lean to the right or the left. where your bend to far to the right thats like a overloaded truck to the right side. So what makes your FOX better then the rest?", 
   {}, 
   47490, 
   null, 
   1083630060.0
  ], 
  [
   47497, 
   null, 
   "jim's trucking", 
   "Look I am asking you what make you think that your right wing source are credible. What make your sources credible for the second time so you under stand me. I will tell you that NPR,CBS and ABC tell the truth and give both sides and don't lean to the right or the left. where your bend to far to the right thats like a overloaded truck to the right side. So what makes your FOX better then the rest?\n\n \n I think we covered news sources before. I never said Fox was the best of anything. I have just recently pointed out the bias of CBS and ABC on the very link that you guided me to...and you still don't get the point.\n \n I read and listen to both sides, then I make up my own mind about what I think is relevant and true. Sometimes I jump the gun and think erroneously for a while, but I have learned over the years not to take liberal TV as a reliable source of truth.", 
   {}, 
   47494, 
   null, 
   1083630540.0
  ], 
  [
   47498, 
   null, 
   "jim's trucking", 
   "I wish that the spitting contest would end.....\n \n You can always tell the character of a man by what it takes to get his goat.\n\n \n What makes you think that just because a man continues to oppose a relentless poster of untruths that his \"goat has been gotten\"? I'm actually somewhat amused.", 
   {}, 
   47493, 
   null, 
   1083630780.0
  ], 
  [
   47500, 
   null, 
   "Maineiac", 
   "Wow. I think I know what Big Orn meant by goat.lol.\n \n Jim, Sean, you guys are stubborn.", 
   {}, 
   47498, 
   null, 
   1083631080.0
  ], 
  [
   47504, 
   null, 
   "jim's trucking", 
   "Wow. I think I know what Big Orn meant by goat.lol.\n \n Jim, Sean, you guys are stubborn.\n\n \n Perhaps relentless beyond reason. I'm not stubborn though...I have changed my mind before. I used to be a Democrat! emoticon_xhoho", 
   {}, 
   47500, 
   null, 
   1083632220.0
  ], 
  [
   47505, 
   null, 
   "sglaine", 
   "I think we covered news sources before. I never said Fox was the best of anything. I have just recently pointed out the bias of CBS and ABC on the very link that you guided me to...and you still don't get the point.\n \n I read and listen to both sides, then I make up my own mind about what I think is relevant and true. Sometimes I jump the gun and think erroneously for a while, but I have learned over the years not to take liberal TV as a reliable source of truth.\n Well Jim I was brought to be honest and unfortunately I have not found a reason why This republican administration is saying the truth on a lot of things yes Clinton was a lier but the Right wing radicals all so had no business in his bedroom life. And thats what I mean by Communism. But getting back to ABC and CBS they do bring out both sides and also they do not cover up anything like I have seen fox do. Well I have learned over the years that do not take the Conservative channel as a reliable source for truth because I have yet to find it. Also while we are on this subject I think Conservative whining shows like Rush L. and Bill O'Rilley are arrogant need to grow up a little. I have yet to see a liberal show that acts as dumb as they do.You know Jim I know you don't respect me but I respect you because you are entitled to your opinion like anyone else here.", 
   {}, 
   47497, 
   null, 
   1083632340.0
  ], 
  [
   47509, 
   null, 
   "jim's trucking", 
   "Well Jim I was brought to be honest and unfortunately I have not found a reason why This republican administration is saying the truth on a lot of things yes Clinton was a lier but the Right wing radicals all so had no business in his bedroom life. And thats what I mean by Communism. But getting back to ABC and CBS they do bring out both sides and also they do not cover up anything like I have seen fox do. Well I have learned over the years that do not take the Conservative channel as a reliable source for truth because I have yet to find it. Also while we are on this subject I think Conservative whining shows like Rush L. and Bill O'Rilley are arrogant need to grow up a little. I have yet to see a liberal show that acts as dumb as they do.You know Jim I know you don't respect me  but I respect you because you are entitled to your opinion like anyone else here.\n\n \n My disagreement with your thoughts has nothing to do with respect. You are no less respectable than anyone else simply because of your political views.\n \n My opinion is that you've had too much of the liberal kool-aid. There's medicine for that... you know?", 
   {}, 
   47505, 
   null, 
   1083633120.0
  ], 
  [
   47515, 
   null, 
   "sglaine", 
   "My disagreement with your thoughts has nothing to do with respect. You are no less respectable than anyone else simply because of your political views.\n \n My opinion is that you've had too much of the liberal kool-aid. There's medicine for that... you know?\n\n Oh like A Mickey Mouse runned Conservative communism theres medicine for that called lighten up right wingers you don't need to bring way to this world and tell everybody how to live and be so called rollmodles because there ethics are very questionable. I do find them kinda funny for what I don't know. But I do get a kick out of Bush's ads that also reflect on his staff.", 
   {}, 
   47509, 
   null, 
   1083633960.0
  ], 
  [
   47529, 
   null, 
   "ChapaquidickTed", 
   "The Incumbant: President George W. Bush\n He has stood his ground on the issues and is prepared to defend The United States of America from an attack. I also love eating oil for breakfast [for all you libs out there, that was sarcasm].", 
   {
    "post_info": {
     "post_title": "Easy"
    }
   }, 
   42489, 
   null, 
   1083635280.0
  ], 
  [
   47539, 
   null, 
   "Maineiac", 
   "The Incumbant: President George W. Bush\n He has stood his ground on the issues and is prepared to defend The United States of America from an attack. I also love eating oil for breakfast [for all you libs out there, that was sarcasm].\n I'm not sure if they think alike, but they both seem to know what they are talking about. emoticon_xgood", 
   {}, 
   47529, 
   null, 
   1083637020.0
  ], 
  [
   47607, 
   null, 
   "Big Orn", 
   "...a man continues to oppose a relentless poster of untruths....I'm actually somewhat amused.\n\n I rest my case. ;) \n \n I'm just looking from the outside in, jim. No offense meant, believe me.\n \n But, this argument is echoed in each pass you two make. There is no doubt where you stand.\n Just a little constructive criticism.\n \n No harm, no foul&#8230;I hope.", 
   {}, 
   47498, 
   null, 
   1083675780.0
  ], 
  [
   47619, 
   null, 
   "jim's trucking", 
   "I rest my case. ;) \n \n I'm just looking from the outside in, jim. No offense meant, believe me.\n \n But, this argument is echoed in each pass you two make. There is no doubt where you stand.\n Just a little constructive criticism.\n \n No harm, no foul&#8230;I hope.\n\n \n Certainly not. It takes a lot more than that to tick me off.\n \n It's a shame we can't convey facial expressions when we type into cyberspace. :) \n \n You have your opinion, I have mine. emoticon_xhoho", 
   {}, 
   47607, 
   null, 
   1083686100.0
  ], 
  [
   47696, 
   null, 
   "sglaine", 
   "Certainly not. It takes a lot more than that to tick me off.\n \n It's a shame we can't convey facial expressions when we type into cyberspace. :) \n \n You have your opinion, I have mine. emoticon_xhoho\n\n I find that hard to believe you get tick off at me every day. Haaa", 
   {}, 
   47619, 
   null, 
   1083708720.0
  ], 
  [
   47699, 
   null, 
   "jim's trucking", 
   "I find that hard to believe you get tick off at me every day. Haaa\n\n \n You wish!\n \n Apparently, you are suffering from delusions of adequacy. emoticon_xbye", 
   {}, 
   47696, 
   null, 
   1083709320.0
  ], 
  [
   47706, 
   null, 
   "sglaine", 
   "You wish!\n \n Apparently, you are suffering from delusions of adequacy. emoticon_xbye\n\n Yes Jim you should know because you are also suffering from it too. emoticon_xagree emoticon_xagree emoticon_xagree", 
   {}, 
   47699, 
   null, 
   1083710700.0
  ], 
  [
   47719, 
   null, 
   "Waxy", 
   "Yes Jim you should know because you are also suffering from it too. emoticon_xagree emoticon_xagree emoticon_xagree\n\n \n This is like being in a forum with my sister's kids, nerve wracking sons a bitches. :p \n \n Anyone know where the quote is from? emoticon_smile \n \n Waxy", 
   {}, 
   47706, 
   null, 
   1083714000.0
  ], 
  [
   47724, 
   null, 
   "sglaine", 
   "This is like being in a forum with my sister's kids, nerve wracking sons a bitches. :p \n \n Anyone know where the quote is from? emoticon_smile \n \n Waxy\n\n Yea right !!!!!!!!!!!.", 
   {}, 
   47719, 
   null, 
   1083715800.0
  ], 
  [
   47763, 
   null, 
   "Ghost", 
   "Oh like A Mickey Mouse runned Conservative communism theres medicine for that called lighten up right wingers you don't need to bring way to this world and tell everybody how to live and be so called rollmodles because there ethics are very questionable. I do find them kinda funny for what I don't know. \n\n \n I know he's trying to say something here, I just can't figure it out...\n \n At dictionary.com there is a free language translator, might help.", 
   {}, 
   47515, 
   null, 
   1083728700.0
  ], 
  [
   47960, 
   null, 
   "sglaine", 
   "I know he's trying to say something here, I just can't figure it out...\n \n At dictionary.com there is a free language translator, might help.\n\n Well if I agreed with you I would be a hero. But that fact is there are two sides I can not for the life of me figure out the republicans now adays they are getting slicker by the day. I can not trust dishonesty and unfounded wars over spending Bush jet setting to Crawford all the time when he should be in DC. The Republican party should be a shame of them selves for they way things are going. I used to be a republican and thought they were great but the republicans have lost touch with reality. they want to censor your lives take away your rights. That is not what true America is about. So ghost you go to dictionary.com Ghost everybody here has there own opion.", 
   {}, 
   47763, 
   null, 
   1083798000.0
  ], 
  [
   48026, 
   null, 
   "jskufan", 
   "Well if I agreed with you I would be a hero. But that fact is there are two sides I can not for the life of me figure out the republicans now adays they are getting slicker by the day. I can not trust dishonesty and unfounded wars over spending Bush jet setting to Crawford all the time when he should be in DC. The Republican party should be a shame of them selves for they way things are going. I used to be a republican and thought they were great but the republicans have lost touch with reality. they want to censor your lives take away your rights. That is not what true America is about. So ghost you go to dictionary.com Ghost everybody here has there own opion.\n\n \n I get a kick out of the continual bashing the \"liberals\" get from the \"Republican Conservatives\". If you try to waste taxpayer money here domestically on programs to help Americans, you're a Liberal. If you waste hundreds of billions of taxpayer moneys trying to help foreign countries (like Iraq), you're a Republican. It's all about symantics.", 
   {}, 
   47960, 
   null, 
   1083820740.0
  ], 
  [
   48032, 
   null, 
   "daewoo", 
   "I get a kick out of the continual bashing the \"liberals\" get from the \"Republican Conservatives\". If you try to waste taxpayer money here domestically on programs to help Americans, you're a Liberal. If you waste hundreds of billions of taxpayer moneys trying to help foreign countries (like Iraq), you're a Republican. It's all about symantics.\n\n \n It seems like this is just a recent occurance, though. When I first decided the war in Iraq was BS is when I heard bush refer to it as a \"humanitarian war\" I said to myself \"Not under a republican president, no way\".\n \n The democrats were always the ones who wanted the save the world. What has happened to the republican party? It seems like bush has led them astray and they are following like a bunch of cattle after a feed truck.", 
   {}, 
   48026, 
   null, 
   1083823020.0
  ], 
  [
   48054, 
   null, 
   "sglaine", 
   "It seems like this is just a recent occurance, though. When I first decided the war in Iraq was BS is when I heard bush refer to it as a \"humanitarian war\" I said to myself \"Not under a republican president, no way\".\n \n The democrats were always the ones who wanted the save the world. What has happened to the republican party? It seems like bush has led them astray and they are following like a bunch of cattle after a feed truck.\n\n Wow wow wow Very well put deawoo. emoticon_xhoho", 
   {}, 
   48032, 
   null, 
   1083855660.0
  ], 
  [
   48751, 
   null, 
   "witzelcheck", 
   "I guess when it comes down to the origional quesiton on this forum, it can easily be reworded as:\n who do we want? someone with seemingly dumb ideas, or someone with seemingly good ideas who changes his mind completely depending on temperature of the day?\n Well, I don't support Bush completely. I loathe some of his plans. But quite frankly, who knows what messes Kerry could easily get us into? \n It's come down to process of elimination for me.", 
   {}, 
   48032, 
   null, 
   1084157400.0
  ], 
  [
   48819, 
   null, 
   "sglaine", 
   "I guess when it comes down to the origional quesiton on this forum, it can easily be reworded as:\n who do we want? someone with seemingly dumb ideas, or someone with seemingly good ideas who changes his mind completely depending on temperature of the day?\n Well, I don't support Bush completely. I loathe some of his plans. But quite frankly, who knows what messes Kerry could easily get us into? \n It's come down to process of elimination for me.\n Yea but grasshopper did you forget the mess bush got us into. We have two evils I think we should change the evils.", 
   {}, 
   48751, 
   null, 
   1084210260.0
  ], 
  [
   48852, 
   null, 
   "Ghost", 
   "I can not trust dishonesty and unfounded wars over spending Bush jet setting to Crawford all the time when he should be in DC. The Republican party should be a shame of them selves for they way things are going. I used to be a republican and thought they were great but the republicans have lost touch with reality. they want to censor your lives take away your rights. That is not what true America is about. So ghost you go to dictionary.com Ghost everybody here has there own opion.\n\n \n I've been to dictionary.com, that's how I know they have the translator... ;) \n \n You're right, everyone does have their own opinion. I'm just hoping that people can present it logically, coherently, and respectfully.\n \n You bring up the issue of Bush going to Crawford alot. So what? Do you think he's really on vacation? Or that he's out of touch with the rest of the administration? Come on. There is nothing he can do in Washington that he can't do in Texas. In fact, his ranch makes for a really good meeting place with foreign dignitaries, which he does quite often.\n \n Republicans don't want to censor your lives or take away your rights. That's ridiculous....\n \n PS-We just want your braaaaaiiiiinnn!!! :p", 
   {}, 
   47960, 
   null, 
   1084216740.0
  ], 
  [
   48859, 
   null, 
   "sglaine", 
   "I've been to dictionary.com, that's how I know they have the translator... ;) \n \n You're right, everyone does have their own opinion. I'm just hoping that people can present it logically, coherently, and respectfully.\n \n You bring up the issue of Bush going to Crawford alot. So what? Do you think he's really on vacation? Or that he's out of touch with the rest of the administration? Come on. There is nothing he can do in Washington that he can't do in Texas. In fact, his ranch makes for a really good meeting place with foreign dignitaries, which he does quite often.\n \n Republicans don't want to censor your lives or take away your rights. That's ridiculous....\n \n PS-We just want your braaaaaiiiiinnn!!! :p\n I don't think he should be allowed to run his ranch while he is in office and you & I know that is what he is doing. To meet with foreign dignitaries that is what Camp David is for not Crawford TX. As far as respectfully I think you need to practice it. We want your clear Braaaaaiiiiiiin. I also think as far as censor issue is that is not ridiculous because we have separation church & state in politics.", 
   {}, 
   48852, 
   null, 
   1084217700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush or Kerry?", 
  "url": "http://www.4forums.com/political/politics-debates/2087-bush-kerry.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2087, 
  "discussion_files": [
   [
    "23656.html", 
    "http://www.4forums.com/political/politics-debates/2087-bush-kerry-print.html"
   ], 
   [
    "23657.html", 
    "http://www.4forums.com/political/politics-debates/2087-bush-kerry-12-print.html"
   ], 
   [
    "23658.html", 
    "http://www.4forums.com/political/politics-debates/2087-bush-kerry-10-print.html"
   ], 
   [
    "23659.html", 
    "http://www.4forums.com/political/politics-debates/2087-bush-kerry-8-print.html"
   ], 
   [
    "23660.html", 
    "http://www.4forums.com/political/politics-debates/2087-bush-kerry-6-print.html"
   ], 
   [
    "23661.html", 
    "http://www.4forums.com/political/politics-debates/2087-bush-kerry-4-print.html"
   ], 
   [
    "23662.html", 
    "http://www.4forums.com/political/politics-debates/2087-bush-kerry-5-print.html"
   ], 
   [
    "23663.html", 
    "http://www.4forums.com/political/politics-debates/2087-bush-kerry-7-print.html"
   ], 
   [
    "23664.html", 
    "http://www.4forums.com/political/politics-debates/2087-bush-kerry-9-print.html"
   ], 
   [
    "23665.html", 
    "http://www.4forums.com/political/politics-debates/2087-bush-kerry-11-print.html"
   ], 
   [
    "23666.html", 
    "http://www.4forums.com/political/politics-debates/2087-bush-kerry-3-print.html"
   ], 
   [
    "23667.html", 
    "http://www.4forums.com/political/politics-debates/2087-bush-kerry-2-print.html"
   ]
  ], 
  "identifier": 2087
 }
]