[
 [
  [
   42583, 
   null, 
   "Rev. HellH0und", 
   "Sit back and reflect for a moment.\n \n \n The Blood of Heros", 
   {
    "post_info": {
     "post_title": "The Blood of Heros"
    }
   }, 
   null, 
   null, 
   1081270560.0
  ], 
  [
   42682, 
   null, 
   "Toukalos", 
   "melodramatic patriotism", 
   {}, 
   42583, 
   null, 
   1081320900.0
  ], 
  [
   42697, 
   null, 
   "Oliphaunt", 
   "it should never be forgotten.\n but we also cant lash out at the world blindly because of it..", 
   {}, 
   42682, 
   null, 
   1081326780.0
  ], 
  [
   42743, 
   null, 
   "Rev. HellH0und", 
   "melodramatic patriotism\n\n \n \n \n Predictable Anti-Americanism", 
   {}, 
   42682, 
   null, 
   1081349700.0
  ], 
  [
   42946, 
   null, 
   "Toukalos", 
   "Predictable Anti-Americanism\n\n \n hahah yeah just because I don't have an appreciation for the politization of tradegy, I'm not only predictable, I'm anti-American too?! Thats rich!\n \n Let the victims grieve in private and not use their loss to whip up fervor....rest assured their nation is working on settling their score.", 
   {}, 
   42743, 
   null, 
   1081396440.0
  ], 
  [
   42954, 
   null, 
   "Rev. HellH0und", 
   "hahah yeah just because I don't have an appreciation for the politization of tradegy, I'm not only predictable, I'm anti-American too?! Thats rich!\n \n Let the victims grieve in private and not use their loss to whip up fervor....rest assured their nation is working on settling their score.\n\n \n \n \n I commented in kind to your 2 word post...\n \n \n BTW Im in NJ... I had friends AND family die in these attacks so don't lecture me on politization of tradegy. All I did was post a link to what I thought was a fitting tribute. YOU politisized it...", 
   {}, 
   42946, 
   null, 
   1081400280.0
  ], 
  [
   43228, 
   null, 
   "mamboni", 
   "I had a relative perish in this tragedy, and I can't say I really agree with the approach of this flash movie.", 
   {}, 
   42954, 
   null, 
   1081538700.0
  ], 
  [
   43240, 
   null, 
   "Toukalos", 
   "I commented in kind to your 2 word post...\n \n \n BTW Im in NJ... I had friends AND family die in these attacks so don't lecture me on politization of tradegy. All I did was post a link to what I thought was a fitting tribute. YOU politisized it...\n\n \n show me where I politisized it, I'd be interested to know....the clip politisized it not me.", 
   {}, 
   42954, 
   null, 
   1081552140.0
  ], 
  [
   43241, 
   null, 
   "jim's trucking", 
   "It's not just American patriotism that should be aroused by those images. There were people from other countries that died in the attacks. We should all  be incensed by the random killings of innocent people everywhere on the planet. People of every nation represented in the list of victims should be incensed and driven toward retaliation against the terrorism that brings this kind of grief to the world.\n \n If we could succeed in killing all of the gutless terrorist rats, the world would be a much better place. Their blood  needs to be spilled, not that of innocent children.\n \n That is not likely to happen, but a rejuvenation of patriotism, American or other, is not going to hurt.\n \n A country without patriotism is just a place to exist. A country full of patriotism is a place to live.\n \n Since patriotism is basically an emotional thing, there's not much wrong with being melodramatic in drumming it up. The quotes by our forefathers are somewhat dramatically put because they had no images to use, other than what they could create in the minds of those who heard them speak. The horror of the day and the grief of the survivors is quite evident in the pictures shown. There's hardly any other way to describe it fully.\n \n Of course, there will always be those insensitive people who think grief should not be shared. I will go to my grave wondering why.", 
   {
    "post_info": {
     "post_title": "People from other countries also died in the Towers!"
    }
   }, 
   43228, 
   null, 
   1081552440.0
  ], 
  [
   43906, 
   null, 
   "Rev. HellH0und", 
   "I had a relative perish in this tragedy, and I can't say I really agree with the approach of this flash movie.\n\n \n \n So did I and I can say that I DO agree with this aproach.", 
   {}, 
   43228, 
   null, 
   1081969440.0
  ], 
  [
   43907, 
   null, 
   "Rev. HellH0und", 
   "show me where I politisized it, I'd be interested to know....the clip politisized it not me.\n\n \n \n All it says is never forget. Or ask have you forgotten? I do not consider that political.\n \n However you stated: \"hahah yeah just because I don't have an appreciation for the politization of tradegy\" you then immediatly politisize it. ;)", 
   {}, 
   43240, 
   null, 
   1081969560.0
  ], 
  [
   43912, 
   null, 
   "JPSartre12", 
   ".....\n \n A country without patriotism is just a place to exist. A country full of patriotism is a place to live.\n \n Since patriotism is basically an emotional thing, there's not much wrong with being melodramatic in drumming it up. The quotes by our forefathers are somewhat dramatically put because they had no images to use, other than what they could create in the minds of those who heard them speak. .....\n\n \n You mean like: \"Give me Liberty, or give me death!\" \"Don't tread on me!\" \"54'40\" or fight!\" emoticon_xkill", 
   {}, 
   43241, 
   null, 
   1081970580.0
  ], 
  [
   43915, 
   null, 
   "syklopps61", 
   "You mean like: \"Give me Liberty, or give me death!\" \"Don't tread on me!\" \"54'40\" or fight!\" emoticon_xkill\n\n\n \n Is there something wrong with those words?", 
   {}, 
   43912, 
   null, 
   1081970880.0
  ], 
  [
   43927, 
   null, 
   "oldskool79", 
   "I disagree with the idea that we should \"never forget\" 9/11 or any other tragedy. All that does is create more hatred and violence.\n \n Imagine if your parents or friends remembered everything you ever did wrong in your life and constantly reminded you of it. Would that improve anything for anyone? I don't think so.\n \n What ever happened to \"forgive and forget\"?", 
   {}, 
   43915, 
   null, 
   1081975980.0
  ], 
  [
   43941, 
   null, 
   "Valthonis", 
   "Imagine if your parents or friends remembered everything you ever did wrong in your life and constantly reminded you of it. Would that improve anything for anyone? I don't think so.\n What ever happened to \"forgive and forget\"?\n\n \n Yeah, they may not always remember the small stuff but if you killed somebody close to them, do you think they would forgive and forget. No, you would not be acknowledged by them. Or at least that would be my family. Something like this is not one of those forgive and forget situations. emoticon_mad", 
   {}, 
   43927, 
   null, 
   1081980000.0
  ], 
  [
   43945, 
   null, 
   "mamboni", 
   "So did I and I can say that I DO agree with this aproach.\n\n \n \n To me, it seems like a guilt-injecting, sympathy arousing ploy to empty pockets. I'm all for charity to the victims, but this is not a good approach, in my opinion. When watching this flash video I felt what was insinuated is that I was somehow responsible for this tragedy. I didn't like that feeling, therefore, I condemn this type of approach.\n I've also always felt it's wrong to show the hordes of people leaping to their death, especially for this kind of thing. That seems to me like it's taking advantage of someone else's misfortunes. The person in my family who died in this tragedy leapt to this death. I think any of these photos showing victims leaping to their deaths should be exempt from this kind of flash video. It's insensitive and it's there for no other reason but to invoke feelings of sorrow and pity and to then empty one's pockets. \n Wrong approach for this kind of thing. Very wrong.", 
   {}, 
   43906, 
   null, 
   1081980900.0
  ], 
  [
   44142, 
   null, 
   "Toukalos", 
   "All it says is never forget. Or ask have you forgotten? I do not consider that political.\n \n However you stated: \"hahah yeah just because I don't have an appreciation for the politization of tradegy\" you then immediatly politisize it. ;)\n\n \n Please come up with some type of rational argument for your position before you just throw these posts out....explain how my statement politicizes the issue...PLEASE!", 
   {}, 
   43907, 
   null, 
   1082086980.0
  ], 
  [
   44144, 
   null, 
   "Toukalos", 
   "To me, it seems like a guilt-injecting, sympathy arousing ploy to empty pockets. I'm all for charity to the victims, but this is not a good approach, in my opinion. When watching this flash video I felt what was insinuated is that I was somehow responsible for this tragedy. I didn't like that feeling, therefore, I condemn this type of approach.\n I've also always felt it's wrong to show the hordes of people leaping to their death, especially for this kind of thing. That seems to me like it's taking advantage of someone else's misfortunes. The person in my family who died in this tragedy leapt to this death. I think any of these photos showing victims leaping to their deaths should be exempt from this kind of flash video. It's insensitive and it's there for no other reason but to invoke feelings of sorrow and pity and to then empty one's pockets. \n Wrong approach for this kind of thing. Very wrong.\n\n \n very true...you did not see this kind of pandering after the Oklahoma City bombing, in fact, there was no \"relief\" given to the victims other than standard government compensation for death/unemployment/etc.... its a pity they were not given the same consideration. In addtion, many fraudulant \"charitites\" used video very much like that one to scam money from patriotic americans....I wonder if Rev. HellHound would say that they too are just making sure we never forget....", 
   {}, 
   43945, 
   null, 
   1082087280.0
  ], 
  [
   44189, 
   null, 
   "Phunting", 
   "Y'know, I'm gonna agree with the Rev! emoticon_rolleyes emoticon_xdonno emoticon_rolleyes\n \n While it's not to my personal taste, and I retain my healty cinicsm over the motives, I don't really see anything wrong with the film at all.", 
   {}, 
   44144, 
   null, 
   1082120760.0
  ], 
  [
   44253, 
   null, 
   "faeden", 
   "The film is appropriate, in my opinion.\n \n In every major case of national REACTION to an event such as 911, there has been a theame of \"Remember the....\" (Maine, Alamo, Boston Massacre, ect.). Therefore, the movie is to be expected. \n \n In my opinion, we NEED to be reminded! The US has been attacked repeatedly by terrorists! (WTC #1, Embasy in Nirobi (sp?), Embasy in Kenya, Kaioushi (sounds like) Towers in Saudi Arabia, and the USS Cole were all attacks on the US before 911.)\n \n The war in Iraq IS a part of the open war that has been waged upon us. Many people who will probably rejoice in the result of the Iraq War, seem to lend assistance (or at least acceptance) to those that would prevent a democratic Iraq. If you have a problem with the status quo, at least present an alternative that is rational.", 
   {
    "post_info": {
     "post_title": "Our attention span"
    }
   }, 
   44189, 
   null, 
   1082158080.0
  ], 
  [
   44256, 
   null, 
   "Haulingboat", 
   "I disagree with the idea that we should \"never forget\" 9/11 or any other tragedy. All that does is create more hatred and violence.\n \n Imagine if your parents or friends remembered everything you ever did wrong in your life and constantly reminded you of it. Would that improve anything for anyone? I don't think so.\n \n What ever happened to \"forgive and forget\"?\n\n Yeah you are right. Lets forgive and forget Bin Laden. Killing three thousand Americans is a minor offense anyway. \n \n Maybe he'll forget that he hates America and leave us alone. \n \n It's attitudes like yours that get people killed.", 
   {}, 
   43927, 
   null, 
   1082160360.0
  ], 
  [
   44527, 
   null, 
   "Maineiac", 
   "While this was a reminder of the 9-11 event,it's also a reminder that we didn't concentrate all our resources into capturing or killing the people who masterminded it.I don't think any of us can truly forget the event,but we certainally got sidetracked.IMO", 
   {}, 
   43941, 
   null, 
   1082337780.0
  ], 
  [
   44550, 
   null, 
   "Rev. HellH0und", 
   "Please come up with some type of rational argument for your position before you just throw these posts out....explain how my statement politicizes the issue...PLEASE!\n \n \n\n \n \n You first.....\n \n \nvery true...you did not see this kind of pandering after the Oklahoma City bombing, in fact, there was no \"relief\" given to the victims other than standard government compensation for death/unemployment/etc.... its a pity they were not given the same consideration. In addtion, many fraudulant \"charitites\" used video very much like that one to scam money from patriotic americans....I wonder if Rev. HellHound would say that they too are just making sure we never forget....\n\n \n \n \n Are you now insinuating that these firefighters that started this sight are now scamming people or are you just trying to lump them (and me) in with criminals because you disagree with me? Had I had family in OK perhaps I would have posted something like this on that subject... From your posts you seem all to happy to downplay the attacks on 9-11, makes me wonder if my initial response to you was actually dead on....", 
   {}, 
   44144, 
   null, 
   1082352000.0
  ], 
  [
   44555, 
   null, 
   "Toukalos", 
   "You first.....\n \n Are you now insinuating that these firefighters that started this sight are now scamming people or are you just trying to lump them (and me) in with criminals because you disagree with me? Had I had family in OK perhaps I would have posted something like this on that subject... From your posts you seem all to happy to downplay the attacks on 9-11, makes me wonder if my initial response to you was actually dead on....\n\n \n \"You first\" ??? You claimed that I politisized it, which is a false statement. My statement was that I thought the film politisized it...get your facts straight. That is my opinion of the film and it stands...\n \n As for your further rambling, I was merely agreeing with mamboni that some people use images like this for exploitative purposes....I was disparaging the politization of tragedy...", 
   {}, 
   44550, 
   null, 
   1082356200.0
  ], 
  [
   44588, 
   null, 
   "Rev. HellH0und", 
   "\"You first\" ??? You claimed that I politisized it, which is a false statement. My statement was that I thought the film politisized it...get your facts straight. That is my opinion of the film and it stands...\n\n \n My statment was an opinion of your 2 word rant \"and it stands\". \n \n \nAs for your further rambling, I was merely agreeing with mamboni\n that some people use images like this for exploitative purposes....I was disparaging the politization of tragedy...\n\n \n And yet you were the one who politisized it.....\n \n I am so sorry if my \"rambling\" is not up to your intellectual prowess. I guess because I fall somewhere to the right of you I must be handicapped, my fault... Please forgive me. \n \n \n Now are you going to continue to insult me or are we going to move on and try to have a civil discourse? I can go either way, its up to you...", 
   {}, 
   44555, 
   null, 
   1082388660.0
  ], 
  [
   44594, 
   null, 
   "Phunting", 
   "Guys, cool it!\n \n The issue has political repercussions, I think that is more than evident with everything that has happened in the last few years. That does not mean that anyone has 'politicised' anything. It was political from the outset.\n \n Let's keep speculation about each other's intelligence to ourselves, huh?\n \n Now I agree with the Rev., let's stop the insults and have a civilised discussion.", 
   {}, 
   44588, 
   null, 
   1082391420.0
  ], 
  [
   44611, 
   null, 
   "fracas", 
   "melodramatic patriotism\n\n \n emoticon_rolleyes \n \n \n my suggestion is that we forget all of history and start anew\n and not only that, we should also forget yesterday while we are at it.\n every day is a brand new world!!!", 
   {}, 
   42682, 
   null, 
   1082396700.0
  ], 
  [
   44660, 
   null, 
   "Toukalos", 
   "I didn't mean to be \"insulting\" (though I didn't insult anyone to the best of my knowledge, I stated my opinion and never called Rev. any names, even after he somehow came up with the idea that I was a Liberal, which he called me on the first page...I disagreed with his view on the politization of tragedy). However, I still want an explanation of how I politisized it and Rev. is dodging the question because he is wrong on this matter. My opinion of the video was that it politisized that and so I commented on it...this does NOT mean that I politisized it! \n \n Furthermore, I did not question anyone's intelligence...the \"rambling\" comment was aimed at getting Rev. to answer the question I posed several times...(and when has calling someone's post \"rambling\" been insulting to intelligence, the word means not concise, which is what I was looking for in an answer to the repeated query).\n \n Finally Rev., how do you have any clue where I stand on the political spectrum....just because I'm not a Bushie Republican does not automatically discount me being conservative....though I would like to hear how you deduced that you are farther \"right\" than me.", 
   {}, 
   44611, 
   null, 
   1082408640.0
  ], 
  [
   44770, 
   null, 
   "Rev. HellH0und", 
   "To me, it seems like a guilt-injecting, sympathy arousing ploy to empty pockets. I'm all for charity to the victims, but this is not a good approach, in my opinion. When watching this flash video I felt what was insinuated is that I was somehow responsible for this tragedy. I didn't like that feeling, therefore, I condemn this type of approach.\n I've also always felt it's wrong to show the hordes of people leaping to their death, especially for this kind of thing. That seems to me like it's taking advantage of someone else's misfortunes. The person in my family who died in this tragedy leapt to this death. I think any of these photos showing victims leaping to their deaths should be exempt from this kind of flash video. It's insensitive and it's there for no other reason but to invoke feelings of sorrow and pity and to then empty one's pockets. \n Wrong approach for this kind of thing. Very wrong.\n\n \n \n I disagree. It should be shown over and over again lest we marginalize the true nature of the tradegy. Did you see the documentary of the french guy who was at a firestation when it happened. when they were in the lobby you could hear the bodies hitting the overhangs. I do not mean to be insensitive but close your eyes to nothing lest you are doomed to suffer the same fate. This website is from a fire department, I hardly think they are taking advantage of anyone.\n \n \n \n \n \n \n \n The Truth of Battle\n \n \"There were young knights among them who had never been present at a stricken field. Some could not look upon it, some could not speak. They held themselves apart from the others who were cutting down prisoners at my lord's orders, for the prisoners were a body too numerous to be guarded by those of us who were left. \n \n Then jean de rye, an aged knight of burgundy who had been sore wounded in the fight, rode up to the group of young knights and said: \"are ye maidens with your downcast eyes? Look well upon it. See all of it. Close your eyes to nothing. For the battle is fought to be won, and this is what happens if you lose.\"", 
   {}, 
   43945, 
   null, 
   1082475120.0
  ], 
  [
   44776, 
   null, 
   "Rev. HellH0und", 
   "I didn't mean to be \"insulting\" (though I didn't insult anyone to the best of my knowledge, I stated my opinion and never called Rev. any names, even after he somehow came up with the idea that I was a Liberal, which he called me on the first page...I disagreed with his view on the politization of tragedy). However, I still want an explanation of how I politisized it and Rev. is dodging the question because he is wrong on this matter. My opinion of the video was that it politisized that and so I commented on it...this does NOT mean that I politisized it! \n \n Furthermore, I did not question anyone's intelligence...the \"rambling\" comment was aimed at getting Rev. to answer the question I posed several times...(and when has calling someone's post \"rambling\" been insulting to intelligence, the word means not concise, which is what I was looking for in an answer to the repeated query).\n \n Finally Rev., how do you have any clue where I stand on the political spectrum....just because I'm not a Bushie Republican does not automatically discount me being conservative....though I would like to hear how you deduced that you are farther \"right\" than me.\n\n \n \n 1. 2 word rant in response to a post can come across as dismissive and hostile. \n \n 2. I never called you a liberal I just suggested that you fall somewhere to the left of me.\n \n 3. I answered you on how I thought you politisized the issue. Just because you disagree with me does not mean I am \"dodging\" you (also hostile in some circles)\n \n 4. Rambling indicates a long winded speach that has many tangents and no coherent argument. I guess comparing my responses to a 2 word rant can be considered rambling if we are simply counting words.\n \n rambling\n \n adj 1: (of e.g. speech and writing) tending to depart from the main point or cover a wide range of subjects; \"amusingly digressive with satirical thrusts at women's fashions among other things\"; \"a rambling discursive book\"; \"his excursive remarks\"; \"a rambling speech about this and that\" [syn: digressive, discursive, excursive] 2: of a path e.g.; \"meandering streams\"; \"rambling forest paths\"; \"the river followed its wandering course\"; \"a winding country road\" [syn: meandering(a), wandering(a), winding]\n \n 5. Add the rambling to the \"come up with a rational argument\" indicating my irationalality (is that a word?) and we begin to see a pattern of attacking my abilities to hang with the intellectuals such as yourself. \n \n 6. Instead of challenging me on how I came to the conclusion that I fall \"somewhere\" to the Right of you why don't you explain your positions instead of calling my arguments irrational and debating me instead of the topic?", 
   {}, 
   44660, 
   null, 
   1082478060.0
  ], 
  [
   44804, 
   null, 
   "georged", 
   "While this was a reminder of the 9-11 event,it's also a reminder that we didn't concentrate all our resources into capturing or killing the people who masterminded it.I don't think any of us can truly forget the event,but we certainally got sidetracked.IMO\n\n \n Did we ever get sidetracked. While I consider the event memorable and cause for like retaliation against Bin Laden, using it to solicit donations for victims already amply compensated in a financial manner seems pretty cheesy. Using patriotism to drag in even more money seems even cheesier. \n \n Terrorist activity being waged against us, including events before 9/11, are a direct result of our foreign policy regarding Israel and Mideast oil interests. I find it difficult to invoke patriotism in support of issues we've created out of self-interest, much less donate to victims of our own policies of aggression.\n \n I'm not making a political statement, most wars have been fought over control of natural resources, but I'll let others donate to victims of situations we create and wave the flag over to garner public support.", 
   {}, 
   44527, 
   null, 
   1082488560.0
  ], 
  [
   44816, 
   null, 
   "Toukalos", 
   "1. 2 word rant in response to a post can come across as dismissive and hostile. \n \n 2. I never called you a liberal I just suggested that you fall somewhere to the left of me.\n \n 3. I answered you on how I thought you politisized the issue. Just because you disagree with me does not mean I am \"dodging\" you (also hostile in some circles)\n \n 4. Rambling indicates a long winded speach that has many tangents and no coherent argument. I guess comparing my responses to a 2 word rant can be considered rambling if we are simply counting words.\n \n rambling\n \n adj 1: (of e.g. speech and writing) tending to depart from the main point or cover a wide range of subjects; \"amusingly digressive with satirical thrusts at women's fashions among other things\"; \"a rambling discursive book\"; \"his excursive remarks\"; \"a rambling speech about this and that\" [syn: digressive, discursive, excursive] 2: of a path e.g.; \"meandering streams\"; \"rambling forest paths\"; \"the river followed its wandering course\"; \"a winding country road\" [syn: meandering(a), wandering(a), winding]\n \n 5. Add the rambling to the \"come up with a rational argument\" indicating my irationalality (is that a word?) and we begin to see a pattern of attacking my abilities to hang with the intellectuals such as yourself. \n \n 6. Instead of challenging me on how I came to the conclusion that I fall \"somewhere\" to the Right of you why don't you explain your positions instead of calling my arguments irrational and debating me instead of the topic?\n\n \n rambling is not insulting, it means exactly what the definition you put up states, \"rambling\n \n adj 1: (of e.g. speech and writing) tending to depart from the main point \"\n \n I used it in context to you not answering the question, which you claimed to have answered. I went and reviewed the posts and found no such response. \n In review, I apologize, you did not call me liberal, you indicated that I was anti-american. \n Since when has saying someone is dodging a question been hostile? I have never seen anyone banned for saying someone is dodging a question. \n \n Again, if I came across as hostile in my \"2 word rant\" I did not intend to, but I did intend to be dismissive, because I did not have a great appreciation for that particular video. \n As to my own personal, political outlook am more in line with a Libertarian philosophy than either of the two major parties, but I do disagree with Libs on some issues too <lol I have a tough time finding any particular outlook to be completely satisfactory< but there are other threads which I espouse my political views, but I don't want to hijack this thread for a politcal theory debate.\n I admit that the rational argument statement, while not directly insulting, could be construed in a slightly hostile manner, so I rescind in and replace it with an \"elaboration on your argument\". (but just FYI, indicating that someone is being rational does not question their intelligence, I know plenty of irrational, intelligent people) emoticon_xbouncer", 
   {}, 
   44776, 
   null, 
   1082491860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Blood of Heros", 
  "url": "http://www.4forums.com/political/current-events-debates/2097-blood-heros.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 2097, 
  "discussion_files": [
   [
    "31935.html", 
    "http://www.4forums.com/political/current-events-debates/2097-blood-heros-print.html"
   ], 
   [
    "31936.html", 
    "http://www.4forums.com/political/current-events-debates/2097-blood-heros-3-print.html"
   ], 
   [
    "31937.html", 
    "http://www.4forums.com/political/current-events-debates/2097-blood-heros-2-print.html"
   ]
  ], 
  "identifier": 2097
 }
]