[
 [
  [
   42587, 
   null, 
   "Rev. HellH0und", 
   "Hollywood \"Reach The Stars\" Campaign: Jewish Civil Rights Group Asks Stars to Stop Supporting Genocidal Policies\n \n 4/1/2004 2:01:00 PM \n \n \n --------------------------------------------------------------------------------\n \n To: National Desk \n \n Contact: Aaron Zelman of Jews for the Preservation of Firearms Ownership, 262-673-9745 or jpfo@netwurx.net\n \n HARTFORD, Wisc., April 1 /U.S. Newswire/ -- What do Arnold Schwarzenegger, Michael Douglas, Michael Moore, Sylvester Stallone and many other Hollywood celebrities have in common with Hitler, Stalin, Mao, and Pol Pot? That question is asked -- and answered - - by Aaron Zelman, executive director of Jews for the Preservation of Firearms Ownership (JPFO). \n \n \"Absolutely nothing,\" is the answer, according to Zelman. \"Except that they all advocate 'gun control.' So do hundreds of other stars, directors, and producers. It's a historic fact that governments disarm citizens before committing genocide. Laws in Nazi Germany, China, the Soviet Union, Guatemala, Rwanda, and other murderous countries were like the 'reasonable gun control' that fashionable moviemakers want.\"\n \n JPFO has launched a campaign to persuade Hollywood personalities to stop supporting government policies that lead directly to police states and genocide. Through a photo gallery, links to celebrities' own statements, and contact information that enables anyone to Reach the Stars, the group hopes to change Hollywood's understanding of this vital human rights issue. \n \n Everyone is invited to join the campaign by going to http://www.jpfo.org/hollywood.htm.\n \n Some of Hollywood's most gun-toting stars are vocal about wanting to take arms from other people. Sly \"Rambo\" Stallone called for house-to-house confiscation of firearms in the U.S. Arnold \"Terminator\" Schwarzenegger publicly advocates every measure promoted by \"gun control\" groups while still saying that he believes in the Second Amendment.\n \n Zelman challenges Hollywood figures to view JPFO's video documentary, Innocents Betrayed (http://www.jpfo.org/ib.htm), which has been making waves in the gun-owning community. \"Unlike Michael Moore's Bowling for Columbine,\" Zelman says, \"Innocents Betrayed uses historic research and quotes from laws to show how 'gun control' enables the murder of millions.\"\n \n Innocents Betrayed has been called \"graphic,\" \"poignant,\" \"grisly,\" \"vital,\" \"stunning and disturbing\" and the biggest eye- opener many viewers have ever seen.\n \n Zelman hopes filmmakers will view JPFO's documentary and \"do the right thing\" by acknowledging that guns save far more lives than they take. He adds that moviemakers might also help themselves by changing their minds.\n \n \"America has 80 million gun owners,\" Zelman concludes. \"Most of them also go to movies. I wonder whether they'd be willing to pay to see the latest action film from these big stars if they knew those stars wanted to take away their human right to self defense.\"\n \n \n http://www.usnewswire.com/", 
   {
    "post_info": {
     "post_title": "Jewish Civil Rights Group Asks Stars to Stop Supporting Genocidal Policies"
    }
   }, 
   null, 
   null, 
   1081270920.0
  ], 
  [
   42607, 
   null, 
   "The_Comedian", 
   "I bet as soon as guns would get banned in the US (although they never will) the government sends out its troops to kill the Hispanics and maybe some Chinese.\n \n Please, no more of this ridiculous \"gun control = sign for genocide attempt\" talk. Do some people really believe that the Nazis needed gun control to start the Holocaust?\n \n \n\"America has 80 million gun owners,\" Zelman concludes. \"Most of them also go to movies. I wonder whether they'd be willing to pay to see the latest action film from these big stars if they knew those stars wanted to take away their human right to self defense.\"\n\n As long as these stars solve problems with guns the audience will stay satisfied...emoticon_rolleyes", 
   {}, 
   42587, 
   null, 
   1081279740.0
  ], 
  [
   42617, 
   null, 
   "emclean", 
   "Do you believe that if (lets play make believe) all firearms are outlawed, that the &#8220;hate&#8221; originations will give up there weapons? Assuming they don&#8217;t, do you think that maybe, they would start going after the now unarmed &#8220;(insert group they hate)&#8221;.\n \n I do trust the government as a whole, they are doing what they believe is best, but history has shown that there those who will abuse there power. Me I would like to have a fighting chance.\n \n And whose life are you willing to bet on it?", 
   {}, 
   42607, 
   null, 
   1081283100.0
  ], 
  [
   42628, 
   null, 
   "Rev. HellH0und", 
   "Do you believe that if (lets play make believe) all firearms are outlawed, that the \"hate\" originations will give up there weapons? Assuming they don't, do you think that maybe, they would start going after the now unarmed \"(insert group they hate)\".\n \n I do trust the government as a whole, they are doing what they believe is best, but history has shown that there those who will abuse there power. Me I would like to have a fighting chance.\n \n And whose life are you willing to bet on it?\n\n \n \n \n Piggy backing off this point... Serbia is case and point. Do you think if you asked at the sarejvo olyimpics that the bosnians would be massacred they would have laughed at you.\n \n \n Or the Rwandans who after they surrendered their weapons were SLAUGHTERED!", 
   {
    "unicode_changes_made": true
   }, 
   42617, 
   null, 
   1081287000.0
  ], 
  [
   42734, 
   null, 
   "The_Comedian", 
   "Piggy backing off this point... Serbia is case and point. Do you think if you asked at the sarejvo olyimpics that the bosnians would be massacred they would have laughed at you.\n\n More would have laughed at me if I had told them that during the next 10 years the Cold War would come to an end and that the 'Terminator' will be governor. ;)\n \n Think about the reasons for all this hatred on the Balkan and you see that the war was inevitable thanks to our handling of the situation (and I would highly exclude the US from guilt in this case).\n Point is, that although some people might have defended themselves, the overall result would have stayed the same.\n \n \n \nOr the Rwandans who after they surrendered their weapons were SLAUGHTERED!\n\n Down there, people slaughtered each other with machetes and clubs. With guns the whole mess would have been the same.\n Also see the reson for their hatred again if we want to handle such situations better in the future. There also was a reason why the West encouraged the officials there to collect guns.", 
   {}, 
   42628, 
   null, 
   1081348440.0
  ], 
  [
   42951, 
   null, 
   "emclean", 
   "all i want to know is who's life are you willing to bet on it?\n \n sorry, i am not willing to bet my childrens lives.", 
   {}, 
   42734, 
   null, 
   1081396920.0
  ], 
  [
   43290, 
   null, 
   "Tim", 
   "Private ownership of machine guns was common in Iraq while Hussein was in power, but it didn't stop Hussein from committing genocide. And why hasn't gun-control in Canada led to genocide?\n \n Gun control laws were passed in Germany to disarm the Nazi militia and keep the Nazis from gaining power. I don't oppose gun-control laws that are designed to disarm the bad guys.\n \n \"A commonly heard argument against gun control is that the National Socialists of Germany (the Nazis) used it in their ascent to and maintenance of power. A corollary argument is sometimes made that had the Jews (and presumably the other targeted groups) been armed, they could have fought off Nazi tyranny. This tract seeks to counter these misassumptions about Nazi gun control. \n Gun control, the Law on Firearms and Ammunition, was introduced to Germany in 1928 under the Weimar regime (there was no Right to Arms in the Constitution of 1919) in large part to disarm the nascent private armies, e.g. the Nazi SA (aka \"the brownshirts\"). The Weimar government was attempting to bring some stability to German society and politics (a classic \"law and order\" position). Violent extremist movements (of both the Left and Right) were actively attacking the young, and very fragile, democratic state. A government that cannot maintain some degree of public order cannot sustain its legitimacy. Nor was the German citizenry well grounded in Constitutional, republican government (as was evidenced in their choices at the ballot box). Gun control was not initiated at the behest or on behalf of the Nazis - it was in fact designed to keep them, or others of the same ilk, from executing a revolution against the lawful government. In the strictest sense, the law succeeded - the Nazis did not stage an armed coup. \n \n The 1928 law was subsequently extended in 1938 under the Third Reich (this action being the principal point in support of the contention that the Nazis were advocates of gun control). However, the Nazis were firmly in control of Germany at the time the Weapons Law of 1938 was created. Further, this law was not passed by a legislative body, but was promulgated under the dictatorial power granted Hitler in 1933. Obviously, the Nazis did not need gun control to attain power as they already (in 1938) possessed supreme and unlimited power in Germany. The only feasible argument that gun control favored the Nazis would be that the 1928 law deprived private armies of a means to defeat them. The basic flaw with this argument is that the Nazis did not seize power by force of arms, but through their success at the ballot box (and the political cunning of Hitler himself). Secondary considerations that arise are that gun ownership was not that widespread to begin with, and, even imagining such ubiquity the German people, Jews in particular, were not predisposed to violent resistance to their government. \n \n The Third Reich did not need gun control (in 1938 or at any time thereafter) to maintain their power. The success of Nazi programs (restoring the economy, dispelling socio-political chaos) and the misappropriation of justice by the apparatus of terror (the Gestapo) assured the compliance of the German people. Arguing otherwise assumes a resistance to Nazi rule that did not exist. Further, supposing the existance of an armed resistance also requires the acceptance that the German people would have rallied to the rebellion. This argument requires a total suspension of disbelief given everything we know about 1930s Germany. Why then did the Nazis introduce this program? As with most of their actions (including the formation of the Third Reich itself), they desired to effect a facade of legalism around the exercise of naked power. It is unreasonable to treat this as a normal part of lawful governance, as the rule of law had been entirely demolished in the Third Reich. Any direct quotations, of which there are several, that pronounce some beneficence to the Weapons Law should be considered in the same manner as all other Nazi pronouncements - absolute lies. (See Bogus Gun Control Quotes and endnote [1].) \n \n A more farfetched question is the hypothetical proposition of armed Jewish resistance. First, they were not commonly armed even prior to the 1928 Law. Second, Jews had seen pogroms before and had survived them, though not without suffering. They would expect that this one would, as had the past ones, eventually subside and permit a return to normalcy. Many considered themselves \"patriotic Germans\" for their service in the first World War. These simply were not people prepared to stage violent resistance. Nor were they alone in this mode of appeasement. The defiance of \"never again\" is not so much a warning to potential oppressors as it is a challenge to Jews to reject the passive response to pogrom. Third, it hardly seems conceivable that armed resistance by Jews (or any other target group) would have led to any weakening of Nazi rule, let alone a full scale popular rebellion; on the contrary, it seems more likely it would have strengthened the support the Nazis already had. Their foul lies about Jewish perfidy would have been given a grain of substance. To project backward and speculate thus is to fail to learn the lesson history has so painfully provided. \n \n The simple conclusion is that there are no lessons about the efficacy of gun control to be learned from the Germany of the first half of this century. It is all too easy to forget the seductive allure that fascism presented to all the West, bogged down in economic and social morass. What must be remembered is that the Nazis were master manipulators of popular emotion and sentiment, and were disdainful of people thinking for themselves. There is the danger to which we should pay great heed. Not fanciful stories about Nazi's seizing guns.\"\n http://www.guncite.com/gun_control_gcnazimyth.html", 
   {}, 
   42607, 
   null, 
   1081600800.0
  ], 
  [
   43299, 
   null, 
   "emclean", 
   "Private ownership of machine guns was common in Iraq while Hussein was in power, but it didn't stop Hussein from committing genocide.\n \n Who had the weapons? The Kurds did not have the heavy weapons needed to defend against aircraft, and no gun stops NBC weapons\n \n \nGun control laws were passed in Germany to disarm the Nazi militia and keep the Nazis from gaining power. I don't oppose gun-control laws that are designed to disarm the bad guys.\n \n I do not either, but how do you know who is a \"bad guy\" or just someone having a bad day.\n \n I cant disagree that anything else you wrote, but I will point out that the first time any thing like the holocaust, or pearl harbor, or terrorist bombing in a country, it is a lot easier, must people would have believed it cant happen here.\n \n Disarming the population will not cause genocide, but an armed population will make it easier to stop", 
   {}, 
   43290, 
   null, 
   1081612440.0
  ], 
  [
   43301, 
   null, 
   "The_Comedian", 
   "Who had the weapons? The Kurds did not have the heavy weapons needed to defend against aircraft, and no gun stops NBC weapons\n\n The Kurds were quite safe because of the non-flight zone and while I agree that guns indeed won't stop NBC weapons, I'd also like to add that guns stand a bad chance against a whole army that uses planes, tanks and whole divisions of soldiers.\n \n \n \nI do not either, but how do you know who is a \"bad guy\" or just someone having a bad day.\n\n Right-wing groups killed their political opponents and the courts didn't do a thing to stop this. They didn't just have a \"bad day\".", 
   {
    "unicode_changes_made": true
   }, 
   43299, 
   null, 
   1081613100.0
  ], 
  [
   43339, 
   null, 
   "emclean", 
   "When you get into \"right wing\" or \"left wing\" you are getting away from \"bad guys\" and getting into politics.\n \n \nThe Kurds were quite safe because of the non-flight zone and while I agree that guns indeed won't stop NBC weapons, I'd also like to add that guns stand a bad chance against a whole army that uses planes, tanks and whole divisions of soldiers.\n \n Did you ever hear what happened to the Russians in Afghanistan? Did you ever hear of a movie called Blackhawk Down? An armed and motivated civilian force can do some nasty things. Don't believe that people with nothing to loose cant stop an army.", 
   {
    "unicode_changes_made": true
   }, 
   43301, 
   null, 
   1081627080.0
  ], 
  [
   43357, 
   null, 
   "The_Comedian", 
   "When you get into \"right wing\" or \"left wing\" you are getting away from \"bad guys\" and getting into politics.\n\n To understand that time period you have to get into politics.\n \n \nDid you ever hear what happened to the Russians in Afghanistan? Did you ever hear of a movie called Blackhawk Down? An armed and motivated civilian force can do some nasty things. Don't believe that people with nothing to loose cant stop an army.\n\n I don't think you want to imply that the Russians and the US were about to commit a genocide? ;)\n \n A genocide committed by a government can't be stopped that simple and it is also hard to compare the culture and mentality of people in Somalia and Afghanistan to that of Western countries.", 
   {
    "unicode_changes_made": true
   }, 
   43339, 
   null, 
   1081639980.0
  ], 
  [
   43381, 
   null, 
   "RooK", 
   "emclean was making the point of people being able to rise up and fight an invading and better equipped enemy. I see nothing mentioned of genocide in that.\n \n I think it's very easy to compare such mentalities, no matter the location under those circumstances. It's desperate people using simplistic guerilla warfare to fight the enemy. It started in Vietnam and is being used in Iraq. People know their home land better than any invading force and thus can adapt and hide among those doing no harm. Also, so many substances exist that one can make their own bombs to take out armored vehicles. You don't have to destroy them, just disable. Following this, determind people could stop all attacks except those by aircraft. And even those could be taken out with heavy caliber guns taken from the enemy if they're flying low and slow (US A10s and helis are a good example).", 
   {}, 
   43357, 
   null, 
   1081648800.0
  ], 
  [
   43396, 
   null, 
   "emclean", 
   "A genocide committed by a government can't be stopped that simple\n \n true, if a goverment is willing to expend all resorces to do it. in the US all it would take is a few nuke's.\n \n \nI don't think you want to imply that the Russians and the US were about to commit a genocide?\n \n you are correct, i was not trying to imply that. i have never said that disarming will start a genocide. all i am trying to get across is an unarmed population is not ABLE to defend themself's. the abilty was not there in nazi Germany. weather the will was there or not dose not matter, the abilaty was taken away.\n \n \n \"To secure these [inalienable] rights [to life, liberty, and the pursuit of happiness], governments are instituted among men, deriving their just powers from the consent of the governed... Whenever any form of government becomes destructive of these ends, it is the right of the people to alter or abolish it, and to institute new government, laying its foundation on such principles, and organizing its powers in such form, as to them shall seem most likely to effect their safety and happiness.\" --Thomas Jefferson: Declaration of Independence, 1776. Papers, 1:429\n \n the framers of the Constitution felt that having an armed population would help keep the goverment on the right track, it is odd how hard some of them are trying to disarm us now.", 
   {
    "unicode_changes_made": true
   }, 
   43381, 
   null, 
   1081651800.0
  ], 
  [
   43397, 
   null, 
   "The_Comedian", 
   "true, if a goverment is willing to expend all resorces to do it. in the US all it would take is a few nuke's.\n\n Most of the population aren't affected by governmental actions in situations when one could speak of genocide as long as they don't belong to a target group of the genocide or are resisting against the government.\n Few are willing to risk their families'lives for a minority in a desperate fight. \n \n \nyou are correct, i was not trying to imply that. i have never said that disarming will start a genocide. all i am trying to get across is an unarmed population is not ABLE to defend themself's. the abilty was not there in nazi Germany. weather the will was there or not dose not matter, the abilaty was taken away.\n\n See above why I don't think that 'armed or unarmed' is much of a difference.\n \n \nthe framers of the Constitution felt that having an armed population would help keep the goverment on the right track, it is odd how hard some of them are trying to disarm us now.\n\n Nobody who had the power currently wants to remove the 2nd amendment afaik. ;)", 
   {
    "unicode_changes_made": true
   }, 
   43396, 
   null, 
   1081652400.0
  ], 
  [
   43404, 
   null, 
   "RooK", 
   "Remove it? No. Modify it and pass laws that ignore it and make it useless? Yes.\n \n I would say that just about any law restricting firearm ownership from the NFA to the GCA and the AWB, all are unconstitutional. As found in the US v. Miller case of the 1940's, any weapon with militia value (military arms) is protected under the 2nd amdendment. In other words, we should be allowed to have newly manufacturered machine guns at LEO prices instead of the expensive pre-'86 firearms, as we wish. In fact, it would be constitutional for them to ban all hunting rifles and most handguns. I just don't see why these laws aren't automatically declared null and void due to their violation of the constitution. Other laws doing the same to other amendments have been.\n \n I have no problem with truly instant background checks (no waiting periods, like here in KY) or even the process required for obtaining Class III weapons (with exception of CLEO sign off). It's the fact they outright ban you from owning some type or form of firearm, whether you abide by the law or not.\n \n Too bad we can't organize a nation-wide movement of civil disobedience. Over a million people spread throughout every state turning a legally owned military arm from semi-auto to full-auto should make a statement.", 
   {}, 
   43397, 
   null, 
   1081656060.0
  ], 
  [
   43457, 
   null, 
   "emclean", 
   "I just don't see why these laws aren't automatically declared null and void due to their violation of the constitution. Other laws doing the same to other amendments have been.\n \n I just don't see why these laws aren't automatically declared null and void due to their violation of the constitution. Other laws doing the same to other amendments have been.", 
   {}, 
   43404, 
   null, 
   1081702680.0
  ], 
  [
   43486, 
   null, 
   "RooK", 
   "Eh? Forget to add something?", 
   {}, 
   43457, 
   null, 
   1081725300.0
  ], 
  [
   43503, 
   null, 
   "emclean", 
   "yep emoticon_emb \n When is the last time that the Supreme Court heard a 2nd case?\n \n (I usually write my replies in word for the spell checker, I copied the wrong thing.)", 
   {}, 
   43486, 
   null, 
   1081738500.0
  ], 
  [
   43505, 
   null, 
   "RooK", 
   "AFAIK, they haven't and they probably won't. They have the right to accept or deny any cases, and seeing how politically involved firearms are nowadays, it's highly unlikely they'll accept one.\n \n The 9th district recently ruled that some guy had the right to legally own a machine gun of his own design/manufacture if it didn't involve interstate commerce. Seeing as this takes a huge chunk out of the NFA, it would make a big statemnt if upheld. After hearing of this ruling, thousands of people sent in Form 1's (and $200 each) to the ATF requesting approval for make a machine gun. Although the ATF cashed the checks, they're currently holding the forms (last I heard) until they could appeal the ruling. The bad thing about this is there is no time limit on how long the ATF can hold forms, and appeals can get bogged down for years.", 
   {}, 
   43503, 
   null, 
   1081741020.0
  ], 
  [
   43550, 
   null, 
   "Tim", 
   "A second amendment challenge to a gun control law has never been successful in the federal court system throughout US history. I don't see why that would change. \n \n I don't think the Constitution protects a right to rebel. The constitution forbids treason. Samuel Adams said this about the Shays rebellion. \"The man who dares rebel against the laws of a republic ought to suffer death.\" \n The government didn't recognize a right of the people in the southern states to rebel in the civil war. Neither did it recognize any such right in the case of Timothy McVeigh.", 
   {}, 
   43505, 
   null, 
   1081784760.0
  ], 
  [
   43569, 
   null, 
   "daewoo", 
   "A second amendment challenge to a gun control law has never been successful in the federal court system throughout US history. I don't see why that would change.\n\n \n For the most part the challenges in the federal court system have invloved prohibited classes of owners (felons, dihonorably discharged military, etc...). U.S. v Bowdach found that \"possession of the shotgun by a non-felon has no legal consequences. U.S. Const. Amend. II.\" U.S. v. Graves states that \"arguably, any regulation of firearms may be violative of this constitutional provision.\"\n \n Of the 8 appeals courts who have ruled on the second ammendment, it is my understading that half of them have recognised the second amendment as conveying an individual right, and the other half going the other way. One of them has gone both ways on different occasions. \n \n We can definatly say from looking at lower court cases that a felon can be barred from owning a firearm. We also can say that the courts like to apply Miller to the cases, so you had better prove that the weapon has some relation to a well regulated militia (by the standards set forth in Miller, this means a weapon that would be useful to the military, NOT that you are in a militia). \n \n It seems that with the appeals courst so evenly split on this issue, it would be ripe for a supreme court review. THe supreme court applies different standards (read that, higher standards) to constitutional interpetation than the lower courts. THe supreme court relies heavily on original intent and historical evidence in the interpetation. If this is the standard, the gun haters would have a difficult time in the supreme court.\n \n \n There is a survey going on at RKBA right now that asks \"Do you believe it is possible to restore the right of the people to keep and bear arms through civil, peaceful means?\"\n \n 45% of those who have responded answered \"Nope. As Thomas Jefferson said, \"No tyrannical government has ever been made to stop but by force.\"\n \n So far there have only been 131 votes, so it may change as the survey progresses.\n \n They have done several surveys in the past with over 2000 respondents that have had similar results. I see this as something as a problem. IT would appear that a fairly large, and armed portion of the population has decided that it is perhaps best to start killing people. \n \n \n \nI don't think the Constitution protects a right to rebel. The constitution forbids treason. Samuel Adams said this about the Shays rebellion. \"The man who dares rebel against the laws of a republic ought to suffer death.\" \n The government didn't recognize a right of the people in the southern states to rebel in the civil war. Neither did it recognize any such right in the case of Timothy McVeigh.\n\n \n Of course you do not have a government recognised right to rebel, nor is there a right to resist tyranny recognised. Our foundimg fathers DID give us the tools to do so, and made it pretty clear that it was for that purpose that those tools were gauranteed to us. The moral of the story to date is \"If you are going to rebel, you had better win\". Ths has been the case throughout histoy all over the world.", 
   {}, 
   43550, 
   null, 
   1081793280.0
  ], 
  [
   43606, 
   null, 
   "RooK", 
   "so you had better prove that the weapon has some relation to a well regulated militia (by the standards set forth in Miller, this means a weapon that would be useful to the military, NOT that you are in a militia).\n\n \n It would be hard to find a gun that doesn't have some past or present military use. Back in '39 with the Miller case, they mentioned that they would have to find evidence that a sawed-off shotgun had military use... now the US military has ordered one to attach under their M4's like the M203. Even back in the various wars shotguns were used. Patton carried Colt SAAs and many people had S&W revolvers privately throughout the various wars. I can't really find a firearm that wouldn't have a military use. Even the lowly 10/22 is used by Israeli Defense Forces.\n \n I'm also with you on the point that, although not expressed in words, it was implied that people could rebel against their nation and fight the government. The whole reason behind the second amendment was to give the people power so that the politicians wouldn't be so gunhoe in making them follow unpleasent laws (or tax them in a hole). Thus we come back to the nexus of the right to bear arms and why the constitution is so cryptic, for good or bad.", 
   {}, 
   43569, 
   null, 
   1081802280.0
  ], 
  [
   43614, 
   null, 
   "daewoo", 
   "It would be hard to find a gun that doesn't have some past or present military use. Back in '39 with the Miller case, they mentioned that they would have to find evidence that a sawed-off shotgun had military use... now the US military has ordered one to attach under their M4's like the M203. Even back in the various wars shotguns were used. Patton carried Colt SAAs and many people had S&W revolvers privately throughout the various wars. I can't really find a firearm that wouldn't have a military use. Even the lowly 10/22 is used by Israeli Defense Forces.\n\n \n Realistically, had miller not died, there is a better than average chance that his case would have been reversed as sawed off shotguns were used extensively during WWI in the trenches. None of the supreme court justices at the time had served in WWI, so there is a good chance they really didn;t know this.\n \n \nI'm also with you on the point that, although not expressed in words, it was implied that people could rebel against their nation and fight the government. The whole reason behind the second amendment was to give the people power so that the politicians wouldn't be so gunhoe in making them follow unpleasent laws (or tax them in a hole). Thus we come back to the nexus of the right to bear arms and why the constitution is so cryptic, for good or bad.\n\n \n Our poliical system is based on aaseries of checks and balances. The seconond mmendment ensures that the population at large gets the final word on all matters.", 
   {}, 
   43606, 
   null, 
   1081803900.0
  ], 
  [
   43768, 
   null, 
   "Tim", 
   "For the most part the challenges in the federal court system have invloved prohibited classes of owners (felons, dihonorably discharged military, etc...). U.S. v Bowdach found that \"possession of the shotgun by a non-felon has no legal consequences. U.S. Const. Amend. II.\" U.S. v. Graves states that \"arguably, any regulation of firearms may be violative of this constitutional provision.\"\n \n Of the 8 appeals courts who have ruled on the second ammendment, it is my understading that half of them have recognised the second amendment as conveying an individual right, and the other half going the other way. One of them has gone both ways on different occasions. \n \n We can definatly say from looking at lower court cases that a felon can be barred from owning a firearm. We also can say that the courts like to apply Miller to the cases, so you had better prove that the weapon has some relation to a well regulated militia (by the standards set forth in Miller, this means a weapon that would be useful to the military, NOT that you are in a militia). \n \n It seems that with the appeals courst so evenly split on this issue, it would be ripe for a supreme court review. THe supreme court applies different standards (read that, higher standards) to constitutional interpetation than the lower courts. THe supreme court relies heavily on original intent and historical evidence in the interpetation. If this is the standard, the gun haters would have a difficult time in the supreme court.\n \n\n Evenly split on the issue? As I understand, only the 5th Circuit Court has sided with the individual interpretation of the second amendment. \n The 5th Circuit Court recognized that none of the other federal courts of appeal had accepted the individual rights view. \n \"The third model is simply that the Second Amendment\n recognizes the right of individuals to keep and bear arms. This\n is the view advanced by Emerson and adopted by the district\n court. None of our sister circuits has subscribed to this\n model, known by commentators as the individual rights model or\n the standard model. The individual rights view has enjoyed\n considerable academic endorsement, especially in the last two\n decades.\" United States v. Emerson (2001)\n http://laws.lp.findlaw.com/5th/9910331cr0.html \n \n Also consider how these lower federal courts have interpreted Miller:\n \n \"Appellant, Peter B. Thomas, argues that the City of Portland, Maine, and various city officials infringed his constitutional rights by denying him a permit to carry a concealed handgun. Established case law makes clear that the federal Constitution grants appellant no right to carry a concealed handgun. See, e.g., United States v. Miller, 307 U.S. 174, 178, 59 S.Ct. 816, 818, 83 L.Ed. 1206 (1939) (second amendment applies only to weapons that have a 'reasonable relationship to the preservation or efficiency of a well regulated militia.')....\" \n Thomas v. Members of City Council of Portland (1st Cir. 1984) \n \n \"The rule emerging from Miller is that, absent a showing that the possession of a certain weapon has 'some reasonable relationship to the preservation or efficiency of a well-regulated militia,' the Second Amendment does not guarantee the right to possess the weapon. Miller, 307 U.S. at 178, 59 S.Ct. at 818....After carefully examining the principles and implications of the then recent Miller decision, the First Circuit concluded that the existence of any 'reasonable relationship to the preservation of a well regulated militia' was best determined from the facts of each individual case. Id. Thus, it is not sufficient to prove that the weapon in question was susceptible to military use. Indeed, as recognized in Cases, most any lethal weapon has a potential military use.[fn4] Id. Rather, the claimant of Second Amendment protection must prove that his or her possession of the weapon was reasonably related to a well regulated militia. See id. at 923. Where such a claimant presented no evidence either that he was a member of a military organization or that his use of the weapon was 'in preparation for a military career', the Second Amendment did not protect the possession of the weapon. Id. Since the Miller decision, no federal court has found any individual's possession of a military weapon to be 'reasonably related to a well regulated militia.' 'Technical' membership in a state militia (e.g., membership in an 'unorganized' state militia) or membership in a non-governmental military organization is not sufficient to satisfy the 'reasonable relationship' test.\" U.S. v. Hale, 978 F.2d 1016 (8th Cir. 1992) \n \n \"We note first that however clear the Court's suggestion that the firearm before it lacked the necessary military character, it did not state that such character alone would be sufficient to secure Second Amendment protection. In fact, the Miller Court assigned no special importance to the character of the weapon itself, but instead demanded a reasonable relationship between its 'possession or use' and militia related activity....Rybar's invocation of this statute does nothing to establish that his firearm possession bears a reasonable relationship to 'the preservation or efficiency of a well regulated militia,' as required in Miller, 307 U.S. at 178. \" \n U.S. v. Rybar (3rd. Cir. 1996) \n \n \"Wright claims that he has a constitutional right to possess machineguns and pipe bombs because these weapons are used by contemporary militia fighting forces....A careful reading of Miller, however, strongly suggests that only militias actively maintained and trained by the states can satisfy the 'well regulated militia' requirement of the Second Amendment. As the Miller Court emphasized, the 'obvious purpose' of the Second Amendment was to 'render possible the effectiveness of' the governmental militia described in the Militia Clauses of the Constitution.\" U.S. v. Wright (11th Cir. 1997) \n \n \"The purpose of the second amendment as stated by the Supreme Court in United States v. Miller, supra at 178, 59 S.Ct. 816, was to preserve the effectiveness and assure the continuation of the state militia. The Court stated that the amendment must be interpreted and applied with that purpose in view. Id. To apply the amendment so as to guarantee appellant's right to keep an unregistered firearm which has not been shown to have any connection to the militia, merely because he is technically a member of the Kansas militia, would be unjustifiable in terms of either logic or policy. This lack of justification is even more apparent when applied to appellant's membership in 'Posse Comitatus,' an apparently nongovernmental organization. \" United States v. Oakes (10th Cir. 1977)", 
   {}, 
   43569, 
   null, 
   1081885860.0
  ], 
  [
   43832, 
   null, 
   "daewoo", 
   "http://www.nraila.org/Issues/FactSheets/Read.aspx?ID=52", 
   {}, 
   43768, 
   null, 
   1081915080.0
  ], 
  [
   324964, 
   null, 
   "Brady", 
   "Private ownership of machine guns was common in Iraq while Hussein was in power, but it didn't stop Hussein from committing genocide. And why hasn't gun-control in Canada led to genocide?\n \n Gun control laws were passed in Germany to disarm the Nazi militia and keep the Nazis from gaining power. I don't oppose gun-control laws that are designed to disarm the bad guys.\n \n \"A commonly heard argument against gun control is that the National Socialists of Germany (the Nazis) used it in their ascent to and maintenance of power. A corollary argument is sometimes made that had the Jews (and presumably the other targeted groups) been armed, they could have fought off Nazi tyranny. This tract seeks to counter these misassumptions about Nazi gun control. \n Gun control, the Law on Firearms and Ammunition, was introduced to Germany in 1928 under the Weimar regime (there was no Right to Arms in the Constitution of 1919) in large part to disarm the nascent private armies, e.g. the Nazi SA (aka \"the brownshirts\"). The Weimar government was attempting to bring some stability to German society and politics (a classic \"law and order\" position). Violent extremist movements (of both the Left and Right) were actively attacking the young, and very fragile, democratic state. A government that cannot maintain some degree of public order cannot sustain its legitimacy. Nor was the German citizenry well grounded in Constitutional, republican government (as was evidenced in their choices at the ballot box). Gun control was not initiated at the behest or on behalf of the Nazis - it was in fact designed to keep them, or others of the same ilk, from executing a revolution against the lawful government. In the strictest sense, the law succeeded - the Nazis did not stage an armed coup. \n \n The 1928 law was subsequently extended in 1938 under the Third Reich (this action being the principal point in support of the contention that the Nazis were advocates of gun control). However, the Nazis were firmly in control of Germany at the time the Weapons Law of 1938 was created. Further, this law was not passed by a legislative body, but was promulgated under the dictatorial power granted Hitler in 1933. Obviously, the Nazis did not need gun control to attain power as they already (in 1938) possessed supreme and unlimited power in Germany. The only feasible argument that gun control favored the Nazis would be that the 1928 law deprived private armies of a means to defeat them. The basic flaw with this argument is that the Nazis did not seize power by force of arms, but through their success at the ballot box (and the political cunning of Hitler himself). Secondary considerations that arise are that gun ownership was not that widespread to begin with, and, even imagining such ubiquity the German people, Jews in particular, were not predisposed to violent resistance to their government. \n \n The Third Reich did not need gun control (in 1938 or at any time thereafter) to maintain their power. The success of Nazi programs (restoring the economy, dispelling socio-political chaos) and the misappropriation of justice by the apparatus of terror (the Gestapo) assured the compliance of the German people. Arguing otherwise assumes a resistance to Nazi rule that did not exist. Further, supposing the existance of an armed resistance also requires the acceptance that the German people would have rallied to the rebellion. This argument requires a total suspension of disbelief given everything we know about 1930s Germany. Why then did the Nazis introduce this program? As with most of their actions (including the formation of the Third Reich itself), they desired to effect a facade of legalism around the exercise of naked power. It is unreasonable to treat this as a normal part of lawful governance, as the rule of law had been entirely demolished in the Third Reich. Any direct quotations, of which there are several, that pronounce some beneficence to the Weapons Law should be considered in the same manner as all other Nazi pronouncements - absolute lies. (See Bogus Gun Control Quotes and endnote [1].) \n \n A more farfetched question is the hypothetical proposition of armed Jewish resistance. First, they were not commonly armed even prior to the 1928 Law. Second, Jews had seen pogroms before and had survived them, though not without suffering. They would expect that this one would, as had the past ones, eventually subside and permit a return to normalcy. Many considered themselves \"patriotic Germans\" for their service in the first World War. These simply were not people prepared to stage violent resistance. Nor were they alone in this mode of appeasement. The defiance of \"never again\" is not so much a warning to potential oppressors as it is a challenge to Jews to reject the passive response to pogrom. Third, it hardly seems conceivable that armed resistance by Jews (or any other target group) would have led to any weakening of Nazi rule, let alone a full scale popular rebellion; on the contrary, it seems more likely it would have strengthened the support the Nazis already had. Their foul lies about Jewish perfidy would have been given a grain of substance. To project backward and speculate thus is to fail to learn the lesson history has so painfully provided. \n \n The simple conclusion is that there are no lessons about the efficacy of gun control to be learned from the Germany of the first half of this century. It is all too easy to forget the seductive allure that fascism presented to all the West, bogged down in economic and social morass. What must be remembered is that the Nazis were master manipulators of popular emotion and sentiment, and were disdainful of people thinking for themselves. There is the danger to which we should pay great heed. Not fanciful stories about Nazi's seizing guns.\"\n http://www.guncite.com/gun_control_gcnazimyth.html\n\n Do I hear people like Grizzly and O-megalomaniac who claimed gun control caused Jews to die saying oops?", 
   {}, 
   43290, 
   null, 
   1222260960.0
  ], 
  [
   324965, 
   null, 
   "Brady", 
   "http://www.nraila.org/Issues/FactSheets/Read.aspx?ID=52\n\n proof that progun people use progun sources", 
   {}, 
   43832, 
   null, 
   1222261020.0
  ], 
  [
   324972, 
   null, 
   "Flyboy_451", 
   "proof that progun people use progun sources \n\n \n wow, drag a post up from four years back, all to make that point???\n \n JW", 
   {}, 
   324965, 
   null, 
   1222265280.0
  ], 
  [
   324983, 
   null, 
   "Omegamon_X", 
   "Do I hear people like Grizzly and O-megalomaniac who claimed gun control caused Jews to die saying oops?\n\n \n http://www.answers.com/topic/german-weapons-law\n \n On November 11, 1938, the Minister of the Interior, Wilhelm Frick, passed Regulations Against Jews' Possession of Weapons. This regulation effectively deprived all Jews of the right to possess firearms or other weapons.", 
   {}, 
   324964, 
   null, 
   1222268220.0
  ], 
  [
   325004, 
   null, 
   "Bryan", 
   "A second amendment challenge to a gun control law has never been successful in the federal court system throughout US history. I don't see why that would change. \n\n \n I assume this comment was meant to be qualified with the statement \"until this year,\" because that statement is no longer accurate after June 26, 2008. \n \n See: http://www.supremecourtus.gov/opinions/07pdf/07-290.pdf \n \n It was primarily the split that had arisen amongst the Circuit Courts of Appeals which forced SCOTUS to decide the individual/collective right question once and for all. All lower circuit and district courts are now compelled to abandon the futility of misapplying Miller as they have done for decades. Like it or not, Heller now controls the issue.\n \n ---\n \n \"And I cannot see, why arms should be denied to any man who is not a slave, since they are the only true badges of liberty. . . .The possession of arms is the distinction between a freeman and a slave. He who has nothing, and belongs to another, must be defended by him, and needs no arms: but he who thinks he is his own master, and has anything he may call his own, ought to have arms to defend himself and what he possesses, or else he lives precariously and at discretion. And though for a while those who have the sword in their power abstain from doing him injury; yet, by degrees, he will be awed into submission to every arbitrary command. Our ancestors, by being always armed, and frequently in action, defended themselves against the Romans, Danes, and English; and maintained their liberty against encroachments of their own princes.\" Andrew Fletcher, Political Works, pp. 35 and 221 (1749).", 
   {
    "post_info": {
     "post_title": "The issue is decided"
    }, 
    "unicode_changes_made": true
   }, 
   43550, 
   null, 
   1222272480.0
  ], 
  [
   325092, 
   null, 
   "Ethmi", 
   "Do I hear people like Grizzly and O-megalomaniac who claimed gun control caused Jews to die saying oops?\n\n \n First off, I CAN'T BELIEVE THAT YOU DRAGGED A POST FROM FOUR YEARS AGO JUST TO BOTHER US WITH YOUR LITTLE PERSONAL EXPERIENCE-BASED EMOTIONS!!!\n \n But aside from that, I do believe that you support guns in the hands of military and police only, but us ordinary vermin are too \"incompetant\" or whatever to own them. Back then, the military and police were Nazis, and the ordinary people who were to incompetant to own them were the Jews, blacks, or anybody else whom Hitler didn't like. So you are essentially saying \"The laws I support got Jews and blacks killed!\" Next time, know what you're saying.\n \n I'm half expecting you to whine about racism, since you always refuse to read my posts. \n \n And finally, you omitted my username from this insulting post? I'm flattered.", 
   {}, 
   324964, 
   null, 
   1222295580.0
  ], 
  [
   325094, 
   null, 
   "Ethmi", 
   "proof that progun people use progun sources\n\n \n You didn't even read it, did you? Ah, who am I kidding? You won't even read the tables I post!", 
   {}, 
   324965, 
   null, 
   1222295940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Jewish Civil Rights Group Asks Stars to Stop Supporting Genocidal Policies", 
  "url": "http://www.4forums.com/political/gun-control-debates/2098-jewish-civil-rights-group-asks-stars-stop-supporting-genocidal-policies.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 2098, 
  "discussion_files": [
   [
    "13919.html", 
    "http://www.4forums.com/political/gun-control-debates/2098-jewish-civil-rights-group-asks-stars-stop-supporting-genocidal-policies-print.html"
   ], 
   [
    "13920.html", 
    "http://www.4forums.com/political/gun-control-debates/2098-jewish-civil-rights-group-asks-stars-stop-supporting-genocidal-policies-3-print.html"
   ], 
   [
    "13921.html", 
    "http://www.4forums.com/political/gun-control-debates/2098-jewish-civil-rights-group-asks-stars-stop-supporting-genocidal-policies-2-print.html"
   ]
  ], 
  "identifier": 2098
 }
]