[
 [
  [
   42679, 
   null, 
   "maximus", 
   "The DaVinci Code is fiction, not history:\n \n http://www.crisismagazine.com/specialreport.htm", 
   {
    "post_info": {
     "post_title": "Beware the DaVinci Code"
    }
   }, 
   null, 
   null, 
   1081319280.0
  ], 
  [
   42688, 
   null, 
   "Ghost", 
   "I'll be honest, I'm not a historian. Much of what Brown writes very well may be fictitious as it relates to history. I read the book, though, and I don't think it's 'anti-Christian' at all. Teabing says that the truth 'in no way diminishes from the majesty of Christ's life, or the fact that he has inspired millions to lead better lives' (I'm paraphrasing, but that's pretty close). Brown never once takes the position that Christ was false, he just takes the position that people throughout history have twisted around the actual meanings, which they have.\n \n Constantine did call the Council of Nicea to debate the issue of Christ's divinity. Constantine did in fact commission the Bible, and as such, he had a hand to play in what was included in it. Constantine was a pagan for most of his life. The idea of Christ's divinity did indeed strengthen the Emeror's control. And there is a lot of pagan symbolism and rituals in Christianity. None of these things can be disputed, even the Catholic archives online will back these up.\n \n What I will say, is that Brown wrote a very influential book, despite what misgivings you may have about it's accuracy. It is critical of the Catholic church's history, and there is definately a lot there to be critical of. What I see in this article you linked to is a Catholic website hosting a very anti-Brown article written by a Catholic writer. That, to me, smacks of bias. I have a hard time believing most of the points brought up by the author because of this. I think what's closer to the truth of this is that the Catholic leadership is rather upset about this book because it raises issues they'd rather not have out in the open.", 
   {}, 
   42679, 
   null, 
   1081323240.0
  ], 
  [
   43140, 
   null, 
   "maximus", 
   "Ghost,\n \nConstantine did call the Council of Nicea to debate the issue of Christ's divinity. Constantine did in fact commission the Bible, and as such, he had a hand to play in what was included in it. Constantine was a pagan for most of his life. The idea of Christ's divinity did indeed strengthen the Emeror's control. And there is a lot of pagan symbolism and rituals in Christianity. None of these things can be disputed, even the Catholic archives online will back these up.\n\n \n Concerning the above and your post on \"Who is Jesus\" thread...Didn't you present part of Brown's book concerning Constantine as factual history on the \"Who is Jesus\" thread? You put it out there as if you were quoting from a history book and not a work of fiction. But that \"history\" is incomplete.It is true that Constantine commissioned copies of scripture for his empire from Bishop Eusebius. But this is not the canon of the Bible that currently exists--it was close but not exact. Copies of scripture predating Constantine are available. Constantine did not create the Bible and he did not change the writings of scripture. \n \n Constantine surely DID NOT come up with the idea of Christ's divinity as earlier writings attest:\n \n http://www.catholic.com/library/Divinity_of_Chirst.asp \n \n \nWhat I will say, is that Brown wrote a very influential book, despite what misgivings you may have about it's accuracy. It is critical of the Catholic church's history, and there is definately a lot there to be critical of. What I see in this article you linked to is a Catholic website hosting a very anti-Brown article written by a Catholic writer. That, to me, smacks of bias. I have a hard time believing most of the points brought up by the author because of this. I think what's closer to the truth of this is that the Catholic leadership is rather upset about this book because it raises issues they'd rather not have out in the open.\n\n The problem I have with Brown's book is that people take it for history instead of fiction. It has even led people away from the faith based on this supposed history. I want people to know that it is fiction. If he wants to criticize the Catholic Church in fiction than that is fine.\n \n I don't think the Catholic leadership is upset about the book because of the issues it raises because many of them are false claims or bad history as the article states. They may be upset because it is being treated as history instead of fiction. (If they are upset at all--I have thus far only heard comment from the laity, not the leadership)\n \n I think your dismissal of the article I submitted due to the author being Catholic should be reconsidered--not in its reference to anti-catholicism but in its attempt to present accurate history. Is a Catholic historian to be disqualified from discussing Catholic history? If you researched Brown's side and the Catholic side would you find bias in the article or would you find a more accurate history?", 
   {}, 
   42688, 
   null, 
   1081486320.0
  ], 
  [
   43144, 
   null, 
   "maximus", 
   "Here is another extensive article breaking down the DaVinci Code. It is in 2 parts (Catholic author also):\n \n \n http://www.envoymagazine.com/planetenvoy/Review-DaVinci-part1.htm \n \n http://www.envoymagazine.com/planetenvoy/Review-DaVinci-part2-Full.htm \n \n Ghost,\n You may want to read Part 2 first as the 1st paragraph deals with Constantine's divinizing Christ and also mentions Teabing.", 
   {}, 
   43140, 
   null, 
   1081486680.0
  ], 
  [
   43155, 
   null, 
   "Ghost", 
   "Maximus, the catholic archives are not a reliable source of factual history. The church has rewritten and slanted certain parts of history, they have a history of this. The Vatican is pretty experienced at cover-ups.\n \n I never once said that Constantine wrote the Bible or changed the scriptures. I never said that he was the first to declare Christ's divinity. What I will say is that he did commission the Bible and had a say in what went into it. He did call the Council of Nicea and backed the popular position that Christ was divine, which did in fact solidify his power. I do firmly believe, knowing these things, that Constantine used the Bible and Christianity as a political tool and threw in many pagan rituals and symbolism into it to widen it's appeal.\n \n I didn't dismiss the article flat out just because it's written by a catholic. I read the entire article, I considered it, and formed my opinion on it. What the guy writes in it very well may be historically accurate, and there is a good chance that some of what Brown wrote could be innaccurate or plain fiction. I just read it and see that it's written by a guy who obviously has a pronounced bias.", 
   {}, 
   43144, 
   null, 
   1081495920.0
  ], 
  [
   43254, 
   null, 
   "jitobear", 
   "\n The problem I have with Brown's book is that people take it for history instead of fiction. It has even led people away from the faith based on this supposed history. I want people to know that it is fiction. \n\n \n It's a mystery novel. I am not sure how anyone reading could possibily mistake it for a history text.\n \n He takes art and religious history for a spin. It's fun. There are TONS of \"historical\" novels/plays/movies that are only loosely based on the facts. It's OK - it's fiction - made up. Heck, some writers even make up whole new universes and creatures - it's called Science Fiction.\n \n I have read this book and it was a well-crafted little adventure. The main thing he wanted to do was get people thinking about women and the divine. And he has done that quite succesfully.\n \n Anyone who doesn't get that fiction isn't REAL ought not to breed.", 
   {}, 
   43140, 
   null, 
   1081564980.0
  ], 
  [
   43492, 
   null, 
   "maximus", 
   "I never once said that Constantine wrote the Bible or changed the scriptures. I never said that he was the first to declare Christ's divinity. What I will say is that he did commission the Bible and had a say in what went into it. He did call the Council of Nicea and backed the popular position that Christ was divine, which did in fact solidify his power. I do firmly believe, knowing these things, that Constantine used the Bible and Christianity as a political tool and threw in many pagan rituals and symbolism into it to widen it's appeal.\n\n \n You didn't say that Constantine changed the scriptures? Not in so many words.\n \n You did not say that Constantine was the first to declare Christ's divinity? Not in so many words but you said it. You proposed the divinity of Christ as a unilateral decision of an emperor in the \"Who Is Jesus\" thread Post 593, Page 119:\n \n \nAs for making up a religion, that's partially true. Whatever the validity of the writings in the Bible, it is known that the Bible was commisioned by the Roman emperor Constantine 300 years after Christ's death. Constantine was a pagan emperor of an empire that was strongly divided between the older religion(s) and up and coming Christiantity. Keep in mind, at this point in time, people didn't know if Christ was God or man. Constantine called the Council of Nicea to determine the truth about Christ's divinity, and he basically decided Christ was God. He then commisioned the Bible to portray Jesus in this light, so only the writings that agreed with this were put in it. The other texts were outlawed, gathered and burned, and the people who still read, believed, or preached them were treated as heretics. Many of these heretical texts supposedly have to do with Mary Magdelene, her pregnancy with Jesus' child, and other things which portray him as of this world, not devine.\n \n Constantine wanted to consolidate his power. Under one religion, believing in a God among men, he would be seen as Christ's emissary, and in fact he was. Rome became stronger, Christianity became dominant (and started persecuting other religions much like they had been persecuted themselves).\n \n The Bible was designed as a political tool, to be used by a man who was a pagan. \n \n ( bold and italics emphasis mine)\n \n You seemed to sum up the totality of Christianity and scripture as simply a political ploy of Constantine. \n \n The canon of the Bible was set at the Council of Carthage in 397 with the guidance of St. Augustine (based on the decress of the Coucil of Hippo in 393). This canon was reaffirmed at the second Council of Carthage in 419. This is the Bible that we have today (although collections of scripture did exist previously as I have already acknowledged in previous posts).\n \n \nI didn't dismiss the article flat out just because it's written by a catholic. I read the entire article, I considered it, and formed my opinion on it. What the guy writes in it very well may be historically accurate, and there is a good chance that some of what Brown wrote could be innaccurate or plain fiction. I just read it and see that it's written by a guy who obviously has a pronounced bias\n\n Thanks for being open-minded.", 
   {}, 
   43155, 
   null, 
   1081726980.0
  ], 
  [
   44387, 
   null, 
   "carla5010", 
   "The problem I have with Brown's book is that people take it for history instead of fiction. It has even led people away from the faith based on this supposed history. I want people to know that it is fiction. If he wants to criticize the Catholic Church in fiction than that is fine.\nWell, that is no different than creationist fables being taken for accurate rather than fiction. I have yet to see any claim that the book is actually a historical document or evidence for same. It is a novel. You are threatened by a novel?", 
   {}, 
   43140, 
   null, 
   1082234580.0
  ], 
  [
   44547, 
   null, 
   "maximus", 
   "Well, that is no different than creationist fables being taken for accurate rather than fiction. I have yet to see any claim that the book is actually a historical document or evidence for same. It is a novel. You are threatened by a novel?\n\n I am not threatened by a novel. I am concerned when a work of fiction is treated as a work of history. That's all I wanted to clear up.", 
   {}, 
   44387, 
   null, 
   1082351700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Beware the DaVinci Code", 
  "url": "http://www.4forums.com/political/religion-debates/2103-beware-davinci-code.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 2103, 
  "discussion_files": [
   [
    "2742.html", 
    "http://www.4forums.com/political/religion-debates/2103-beware-davinci-code-print.html"
   ]
  ], 
  "identifier": 2103
 }
]