[
 [
  [
   1850, 
   null, 
   "ProlifeNet", 
   "Hi. My name is Mandy. I am 100% against abortions and I have been for as long as I can remember. I don't understand how women have the right to choose to kill an innocent little baby that is only there because of their actions. Women and men both need to be more responsible in using birth control. If one isn't effective enough, then use 2 or 3. That's what I did to make sure I wouldn't get pregnant until I was ready. There are so many women who would love to have a baby and try so hard to get pregnant, and then you have 4,000 babies a day that are being murdered by women who just don't care. Their only concern is what is good for them at the moment. I just don't understand how a woman can be so selfish. Once, they are pregnant the choice should be over. The actual \"choice\" should be whether or not they are sexually active. And yes, I understand that married women have to have sex, but like I said earlier, you can use more than 1 form of birth control and make it even less likely that you will become pregnant. I have put a lot of my time into creating a pro-life website so anyone interested can become more educated on the subject of abortion. I describe each of the types and I have a special section with graphic pictures that show the truth of what abortion really does to an unborn child. If anyone would like to see my site here is the link. \n \n www.prolifenet.com \n \n I also have a forum on my site where you can talk about abortion/pregnancy/adoption/and other issues. And even though I am pro-life I also have a pro-choice forum. If anyone does go to my site could you post a message and let me know what you think of it? And hopefully I can get some regulars to start coming to my forum! :) Thanks!", 
   {
    "post_info": {
     "post_title": "Pro-Life Website"
    }
   }, 
   null, 
   null, 
   1045071360.0
  ], 
  [
   2623, 
   null, 
   "Parcum", 
   "Meh... I made one too!\n \n Mine's better! Lol\n \n http://www.torchx.com\n \n We should probably share forums or something, to get more people...", 
   {}, 
   1850, 
   null, 
   1045774740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Pro-Life Website", 
  "url": "http://www.4forums.com/political/abortion-debates/211-pro-life-website.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 211, 
  "discussion_files": [
   [
    "25167.html", 
    "http://www.4forums.com/political/abortion-debates/211-pro-life-website-print.html"
   ]
  ], 
  "identifier": 211
 }
]