[
 [
  [
   42763, 
   null, 
   "Dmann", 
   "Officials at Defenders of Wildlife, one of the nation's premiere environmental groups, are expressing increasing frustration over the failure of the U.S. Forest Service to release documents which may confirm that logging industry executives wielded the same kind of influence over proposed forest policy that the energy industry enjoyed with Vice President Cheney's secretive energy task force.\n \n Early in its tenure, the Bush Administration began work on an overhaul of the National Forest Management Act, which governs 200 million acres of publicly owned forests. Seeking evidence that would shed light on the motivations behind the overhaul, Defenders of Wildlife and the Endangered Species Coalition filed a Freedom of Information Act lawsuit in October, 2002.\n \n Defenders charges that Mark Rey, a longtime timber trade association official who is now President Bush's undersecretary for natural resources and environment in the U.S. Department of Agriculture (USDA), has been deliberately dragging his feet in response to requests for the documents.\n \n \"Bush's NFMA overhaul is the biggest-ever rewrite of our nation's forest management policies,\" said Defenders President Rodger Schlickeisen. \"These regulations govern every decision that is made about every acre of national forest, and the Bush reforms cater precisely and blatantly to requests that have been made for years by the logging industry.\" Schlickeisen says the rewritten policies diminish public and scientific input in the planning process, gut many key wildlife protections, and allow increased logging on public land.\n \n \"They reverse even the protections that were put in place by the Reagan administration, including basic [National Environmental Policy Act] reviews and biodiversity standards,\" he added.\n \n Defenders was further irked that Rey's office seemed to come down with a sudden case of amnesia when it told the U.S. District Court for the District of Columbia that it had no records whatsoever -- no transcripts, memos, emails, or calendar records -- documenting meetings between the agency and industry groups (or anyone else, for that matter) during the process of revising the forest policies.\n \n The court agreed with Defenders' claim that USDA did \"not meet their burden of conducting a reasonable search and justifying non-disclosure of exempted information.\" The court requested that Rey's office do a further search for information and give a more reasonable explanation for why certain documents should be withheld.\n \n \"We're going to comply with the court order,\" said Rey, but he insisted that \"there's no need to reach beyond that to broader theories of bad faith and conspiracy, because the court didn't find them and they don't exist.\"\n \n Defenders' Schlickeisen has his doubts. Last month, Rey told the Senate Energy and Natural Resources Committee that substantial \"modifications\" are in the works, and the final draft is likely to be released in the next several months.\n \n \"They're probably consulting lawyers to try and make themselves least vulnerable to legal challenge,\" said Schlickeisen. \"Because clearly if these new modifications are anything like what we've seen, they're illegal. And we've made it clear that we'll do what's necessary to prove it.\"\n \n \n \n SOURCES:\n [1] Defenders of Wildlife press release.\n \n - bushgreenwatch", 
   {
    "post_info": {
     "post_title": "Watchdogs Blast Proposed Bush Forest Policy Overhaul"
    }
   }, 
   null, 
   null, 
   1081353600.0
  ], 
  [
   43453, 
   null, 
   "JPSartre12", 
   "Officials at Defenders of Wildlife, one of the nation's premiere environmental groups, are expressing increasing frustration over the failure of the U.S. Forest Service to release documents which may confirm that logging industry executives wielded the same kind of influence over proposed forest policy that the energy industry enjoyed with Vice President Cheney's secretive energy task force........\n SOURCES:\n [1] Defenders of Wildlife press release.\n \n - bushgreenwatch\n\n \n Since you mentioned it, our policy on logging is not very well thought out and downright dangerous. For example, the current policy doesn't allow for clearing out underbrush or thinning forests. This has led to some of the most disasterous wildfires in our nation's history. Oregon lost over 1/2Million acres in just one such fire. Doesn't it make more sense to allow the thinning of forests by loggers instead of watching the forests burn to the ground from unstoppable forest fires? Thinning trees is better for old growth forests, but irresponsible environmentalism threatens to destory these forests. \n I guess the old adage \"They can't see the forest for the trees\" is correct after all. \n emoticon_rolleyes", 
   {}, 
   42763, 
   null, 
   1081702260.0
  ], 
  [
   44848, 
   null, 
   "sinjin", 
   "Since you mentioned it, our policy on logging is not very well thought out and downright dangerous. For example, the current policy doesn't allow for clearing out underbrush or thinning forests. This has led to some of the most disasterous wildfires in our nation's history. Oregon lost over 1/2Million acres in just one such fire. Doesn't it make more sense to allow the thinning of forests by loggers instead of watching the forests burn to the ground from unstoppable forest fires? Thinning trees is better for old growth forests, but irresponsible environmentalism threatens to destory these forests. \n I guess the old adage \"They can't see the forest for the trees\" is correct after all. \n emoticon_rolleyes\n\n \n Question- How much of what Oregon lost was virgin(never logged) forest?", 
   {}, 
   43453, 
   null, 
   1082499480.0
  ], 
  [
   44849, 
   null, 
   "sinjin", 
   "Since you mentioned it, our policy on logging is not very well thought out and downright dangerous. For example, the current policy doesn't allow for clearing out underbrush or thinning forests. This has led to some of the most disasterous wildfires in our nation's history. Oregon lost over 1/2Million acres in just one such fire. Doesn't it make more sense to allow the thinning of forests by loggers instead of watching the forests burn to the ground from unstoppable forest fires? Thinning trees is better for old growth forests, but irresponsible environmentalism threatens to destory these forests. \n I guess the old adage \"They can't see the forest for the trees\" is correct after all. \n emoticon_rolleyes\n\n \n Question- How much of what Oregon lost was virgin(never logged) forest?\n \n I honestly don't know but I can tell you that what regenerates after logging has many differences from a \"climax\" old growth forest including a more dense understory. More sunlight reaches the ground than had previously since the forest grew in the first place encouraging species that had long since disappeared or were sparsely represented.", 
   {}, 
   43453, 
   null, 
   1082499660.0
  ], 
  [
   47554, 
   null, 
   "DangerousMann", 
   "I think it's the cronyism that bothers me. \n \n \n i agree the policy needs an overhaul...although fires are a part of the natural course of large forests in dry climates. It grows back, enriches the soil, etc. fires are good for the earth. they may not be so good for the atmosphere though...I'd have to get exact stats. but, i'v e heard this theory bandies about", 
   {}, 
   44849, 
   null, 
   1083640560.0
  ], 
  [
   47557, 
   null, 
   "JPSartre12", 
   "I think it's the cronyism that bothers me. \n \n \n i agree the policy needs an overhaul...although fires are a part of the natural course of large forests in dry climates. It grows back, enriches the soil, etc. fires are good for the earth. they may not be so good for the atmosphere though...I'd have to get exact stats. but, i'v e heard this theory bandies about\n\n \n Fires may be natural, but uncontrolled fires burn out peoples' homes and create very dangerous conditions over large areas.", 
   {}, 
   47554, 
   null, 
   1083640920.0
  ], 
  [
   47566, 
   null, 
   "sglaine", 
   "I think it's the cronyism that bothers me. \n \n \n i agree the policy needs an overhaul...although fires are a part of the natural course of large forests in dry climates. It grows back, enriches the soil, etc. fires are good for the earth. they may not be so good for the atmosphere though...I'd have to get exact stats. but, i'v e heard this theory bandies about\n\n Yea but don't forget the mudslides it can cause after. We do need a overhaul on this one seems like the fires get bigger every year.", 
   {}, 
   47554, 
   null, 
   1083642120.0
  ], 
  [
   47622, 
   null, 
   "Eddie", 
   "Fires may be natural, but uncontrolled fires burn out peoples' homes and create very dangerous conditions over large areas.\n\n \n From an enviromental perspective, forest fires are crucial for certain species to survive. Man made influences has created a situation where forest fires are too uncommon that certain species and plants are facing extinction. Forest fires also serves the purpose of revitalise the forests and make them more \"healthy\".\n \n But as I said, this is from the enviromental point of view. You are indeed correct that uncontralable forest fires are hazardous for humans who live nearby (as well as property).\n \n As always, a trade-off must be made.", 
   {}, 
   47557, 
   null, 
   1083687660.0
  ], 
  [
   48613, 
   null, 
   "Maineiac", 
   "I'm not really surprised at the Bush administrations lack of a forest management plan. He known for not being an enviromentally-friendly president.\n Forest fires are usually a natural occurance. They are often good for the eco-systems.It's the man made disasters that are the problem.\n We can't stop forest fires, but we can keep the property damage to a minimum by thining forests, building access roads where posible to fight the fires, and have stricter control over timber harvests.\n Often the timber companies over-cut certain areas, leaving the lanscape a barren, lifeless terrain, not suited for wildlife habitat.\n Soil erosion can become a problem also, as the silt from the soil erosion pollutes the streams and damages the fish habitat.\n The government needs a good forest management plan for public lands, and more funding for personel to impliment the current programs of forest management.", 
   {}, 
   47622, 
   null, 
   1084073460.0
  ], 
  [
   48617, 
   null, 
   "JPSartre12", 
   "I'm not really surprised at the Bush administrations lack of a forest management plan. He known for not being an enviromentally-friendly president.\n Forest fires are usually a natural occurance. They are often good for the eco-systems.It's the man made disasters that are the problem.\n We can't stop forest fires, but we can keep the property damage to a minimum by thining forests, building access roads where posible to fight the fires, and have stricter control over timber harvests.\n Often the timber companies over-cut certain areas, leaving the lanscape a barren, lifeless terrain, not suited for wildlife habitat.\n Soil erosion can become a problem also, as the silt from the soil erosion pollutes the streams and damages the fish habitat.\n The government needs a good forest management plan for public lands, and more funding for personel to impliment the current programs of forest management.\n\n \n I agree. We do need a forest management plan. There is far too much forest lost due to irresponsible environmentalism. emoticon_xgood", 
   {}, 
   48613, 
   null, 
   1084073880.0
  ], 
  [
   48998, 
   null, 
   "jskufan", 
   "Actually, it seems that man-made forest fires (arson or accidental) are causing considerable damage to forests and property. I'm not sure you can effect a forest management plan that offsets this non-natural occurrence. As usual, we have a man-made problem and we're looking to our government with it's extensive knowledge (sarcasm) to solve it by rewriting the laws of nature. I'd just as soon not clearcut the United States to make up for all the careless smokers, campers, off roaders, and arsonists that can't or won't use common sense. Remember, the forests existed long before we were here, let's not try to reinvent the wheel. Leave the government to what they're good at: spending tax money and spreading democracy! emoticon_xgood", 
   {}, 
   48617, 
   null, 
   1084244640.0
  ], 
  [
   49075, 
   null, 
   "Eddie", 
   "@ jskufan\n \n What do you mean by \"considerable damage to forest\"? I mean, just because there are trees that dies does not mean that the forest is damaged. Quite the contrary actually. Forest fires re-vitalise the forest and weed out the sick, dead and damaged trees so that the forest can grow even \"stronger\". Not to mention that it give rise to plants and animals that can only thrive in a newly burnt forest and thus increasing the specie-plurality (don`t really know the correct english word...).", 
   {}, 
   48998, 
   null, 
   1084295040.0
  ], 
  [
   51228, 
   null, 
   "drone001", 
   "I think they need to put a dampener between the wild forest and private property at least 100 yards wide, and anyone who chooses to live beyond the dampener. Well, they know the risks. Just like living by large rivers. If you choose to live there, you have to just deal with the consequences.", 
   {}, 
   49075, 
   null, 
   1085028240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Watchdogs Blast Proposed Bush Forest Policy Overhaul", 
  "url": "http://www.4forums.com/political/environmental-debates/2111-watchdogs-blast-proposed-bush-forest-policy-overhaul.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 2111, 
  "discussion_files": [
   [
    "12890.html", 
    "http://www.4forums.com/political/environmental-debates/2111-watchdogs-blast-proposed-bush-forest-policy-overhaul-print.html"
   ]
  ], 
  "identifier": 2111
 }
]