[
 [
  [
   42783, 
   null, 
   "Rev. HellH0und", 
   "First of two parts. \n Democratic presidential candidate John Kerry complains that President Bush pursued a unilateralist foreign policy that gave short shrift to the concerns of the United Nations and our allies when it came to taking military action against Saddam Hussein. But the mounting evidence of scandal that has been uncovered in the U.N. Oil For Food program suggests that there was never a serious possibility of getting Security Council support for military action because influential people in Russia and France were getting paid off by Saddam. After the fall of Baghdad last spring, France and Russia tried to delay the lifting of sanctions against Iraq and continue the Oil for Food program. That's because France and Russia profited from it: The Times of London calculated that French and Russian companies received $11 billion worth of business from Oil for Food between 1996 and 2003. \n Most disturbing are Iraqi records that suggest Benon Sevan, the executive director of the Oil for Food office, received a voucher for 11.5 million barrels of oil from Saddam's manipulation of the program - enough to yield a profit of between $575,000 and $3.5 million. \n In a series of articles published earlier this year, the Iraqi independent newspaper al Mada reported on a list of several hundred individuals, corporations and political parties that benefited from Saddam's oil vouchers and explained how the system worked. The intent of the program was to sell Iraqi oil to pay for food and medicine for the Iraqi people, who were suffering due to sanctions. Instead, vouchers were doled out as gifts or as payment for goods imported into the country in violation of U.N. sanctions. The recipient would then turn the voucher over to one of a number of firms operating in the United Arab Emirates, in exchange for commissions ranging anywhere from 5 cents to 30 cents per barrel, depending on market conditions. (This translates into a profit of $50,000 on the low end and $300,000 on the high end for every 1 million barrels worth of oil vouchers.) \n The beneficiary list (found in the archives of the Iraqi Oil Ministry and translated into English by the Middle East Media Research Institute) should be deeply embarrassing to many prominent people. In the United States, those listed include Iraqi American businessman Shaker Al-Khaffaji, who put up $400,000 to produce a film by ex-U.N. weapons inspector Scott Ritter, which aimed to discredit weapons inspections in Iraq. Also, British Labor MP George Galloway, a strident foe of taking action against Saddam, is listed as a recipient or co-recipient of 19.5 million barrels. \n Other recipients include: former French Interior Minister Charles Pasqua (12 million barrels); Patrick Maugein, CEO of the oil company Soco International and financial backer of French President Jacques Chirac (25 million); former French Ambassador to the United Nations Jean-Bernard Merimee (11 million); Indonesian President Megawati Sukarnoputri (10 million); and Syrian businessman Farras Mustafa Tlass, the son of longtime Syrian Defense Minister Mustafa Tlass (6 million). Leith Shbeilat, chairman of the anti-corruption committee of the Jordanian Parliament, received 15.5 million. \n Right now, Claude Hankes-Drielsma, a British investigator, is auditing the program on behalf of the Iraqi government. His findings, and the records reported on in the Iraqi press, deserve serious scrutiny. If it turns out that prominent politicians and businessmen profiteered while Iraqis were deprived of basic necessities that the Oil for Food program was supposed to pay for, there should be serious consequences, up to and including criminal prosecution.", 
   {
    "post_info": {
     "post_title": "The U.N. Oil for Food scandal"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1081356480.0
  ], 
  [
   44089, 
   null, 
   "syklopps61", 
   "the silence is deafening LOL", 
   {}, 
   42783, 
   null, 
   1082070240.0
  ], 
  [
   44434, 
   null, 
   "Eddie", 
   "What do you want to debate, I don`t see any question and I hardly see any un-disputable facts... I think we`ll have to wait and see how all of this turns out before we can have any meaningful debate on this particular issue.", 
   {}, 
   44089, 
   null, 
   1082249400.0
  ], 
  [
   44443, 
   null, 
   "jim's trucking", 
   "Maybe he's just posting food for thought. It is interesting to learn how the sorry French and others work in the UN and how they use their veto power for their own singular gain.\n \n If the French had their way, we'd still be reading about thousands of rapes and murders in Iraq and we wouldn't know that the French were helping in the ripoff of the oil for food program.", 
   {}, 
   44434, 
   null, 
   1082255580.0
  ], 
  [
   44473, 
   null, 
   "Eddie", 
   "Maybe he's just posting food for thought. \n\n \n \n I was more commenting on the \"the silence is deafening LOL!1!\" post than the original post which was fairly good.\n \n \n It is interesting to learn how the sorry French and others work in the UN and how they use their veto power for their own singular gain.\n \n\n \n Well, democraticly elected politicians tend to use their political power for their own singular gain. After all, re-election is what drives most (sucessful) politicians. But this is how democracy must work so I don`t see any problem with this.\n \n \n\n If the French had their way, we'd still be reading about thousands of rapes and murders in Iraq and we wouldn't know that the French were helping in the ripoff of the oil for food program.\n\n \n American companies where involved as well. But Exxon got to greedy and where banned as they where caught smuggling oil. Perhaps that was the real reason for the whole Iraqi bussiness. American companies where no longer able to rip-off the oil for food programme so their country invaded and made sure that american companies could make some money?\n \n Or do only these kind of shady bussiness practices apply to the \"sorry\" French emoticon_rolleyes\n \n Disclaimer: I do not think that the US actions in gulf war II was driven by economic interests. But I very much doubt that the actions of France, Germany or Russia had anything to do with economic gain. Take a look at their public oppinion on the Gulf war and I think you`ll find the true reason why countries like France and Germany criticised the Bush administration. Why Putin acted like he did is a another issue though. But I would be surprised if he payed any heed to economic gain for \"his\" country.", 
   {}, 
   44443, 
   null, 
   1082285940.0
  ], 
  [
   44489, 
   null, 
   "AMD4EVER", 
   "Well, democraticly elected politicians tend to use their political power for their own singular gain. After all, re-election is what drives most (sucessful) politicians. But this is how democracy must work so I don`t see any problem with this.\n\n \n Did Bush use the war in Iraq for his own or the US's own singular gain? Bush had to know this would hurt him in the long run and it has and he had to know the US would lose troops as well which hurt us. In turn we would spend a great deal of money to rebuild a nation and bring democracy to it. The only selfish part of it that I see is use reducing the threat posed by them.\n \n The UN was looking out for itself with Iraq as Hellhound shows us. Somehow this is now seen as the norm for democracies. I don't see it that way. The US went out and did what was right and stopped part of the corruption of the UN in doing so. So this brings us to an election based decision as well. Bush wants the US to carry on without a lot of direction from the UN. Kerry wants the US to follow the direction of the UN. Which one do you support?", 
   {}, 
   44473, 
   null, 
   1082308620.0
  ], 
  [
   44506, 
   null, 
   "Eddie", 
   "Did Bush use the war in Iraq for his own or the US's own singular gain? \n\n \n I would say that the most pressing issue was national security, or rather, the political gain from increasing (or creating an impression of increasing) national security. \n \n \nDid Bush had to know this would hurt him in the long run and it has and he had to know the US would lose troops as well which hurt us. In turn we would spend a great deal of money to rebuild a nation and bring democracy to it. \n\n \n As for Bush:s political gain\n I would say that waging wars are always risky business for a politician, but it is far from certain (political) death. The war might have backfired lately due to failiures in finding any substantial amounts of WMD`s, but I`m not so sure that the gulf war actually had any negative impact on Bush:s poltical and popular support. Had substantial amounts of WMD`s been found and links to al queda had been proven I think that the war had been a resounding political success. (but admitedly, its just a guess).\n \n As for US gain\n There are many aspects of this war that could potentially benefit the US as a country. Obviously there is the gain of increased national security through dismantling a dictatorship that was ruled by someone who hated and feared the US. The fact that the US troops didn`t find any WMD`s was a set-back though, but the opportunity to install a (democratic) friendly goverment in the ME is very benefitial in the War against terror. The fact that the US government appeared to be more than itching for waging further wars after Afghanistan could be viewed as a threat towards any state or organisation that harbours ill fellings towards the US, and plans to do anything about it. \n \n The long term economic gains connected to the increase of oil supply on the world market might actually out-weigh the short term costs for waging war. The \"boosting\" effect on the american economy that the war and perhaps even more importantly, the re-construction process could have been used as a tool to get out of the recession.\n \n \n \nThe UN was looking out for itself with Iraq as Hellhound shows us. Somehow this is now seen as the norm for democracies. \n\n \n \n For democratic governments the norm has always been to \"please\" the public. This is the essance of democracy. I don`t see how this has changed lately.\n \n \n The US went out and did what was right and stopped part of the corruption of the UN in doing so. \n\n \n If you ask me, the ocupation of Iraq is quite corrupt as well. The only thing is that the US argues that it is \"within their rights\" as the occupier to be corrupt... And as I said in prior posts, it will be interesting to see how much substance there actually is to all of these accusations.\n \n \nSo this brings us to an election based decision as well. Bush wants the US to carry on without a lot of direction from the UN. Kerry wants the US to follow the direction of the UN. Which one do you support?\n\n \n I`m not an american citizen so I can`t cast my vote on the subject. However, if it was up to me, I would let UN take care of the re-building process through international agents (and among other agents, the US).", 
   {}, 
   44489, 
   null, 
   1082325480.0
  ], 
  [
   44686, 
   null, 
   "syklopps61", 
   "What do you want to debate, I don`t see any question and I hardly see any un-disputable facts... .\n\n\n \n Hey dude, I just thought it was interesting that those on the Left don't hesitate to comment on anything Bush has done, well before all the facts have come out, and here their beloved UN has very well got their hands caught in the cookie jar, and they have nothing to say. I wasn't expecting any debate, because I don't thjink there IS any", 
   {}, 
   44434, 
   null, 
   1082415720.0
  ], 
  [
   44689, 
   null, 
   "jim's trucking", 
   "\n \n Or do only these kind of shady bussiness practices apply to the \"sorry\" French emoticon_rolleyes\n \n Disclaimer: I do not think that the US actions in gulf war II was driven by economic interests. But I very much doubt that the actions of France, Germany or Russia had anything to do with economic gain. \n\n You denied facts presented in the recent thread about the French oil contracts. It was a very good revelation of their billions of dollars contracts with Saddam Hussein...contracts that they stood to lose when a war started.", 
   {}, 
   44473, 
   null, 
   1082417520.0
  ], 
  [
   44703, 
   null, 
   "Eddie", 
   "You denied facts presented in the recent thread about the French oil contracts. It was a very good revelation of their billions of dollars contracts with Saddam Hussein...contracts that they stood to lose when a war started.\n\n \n I`m not sure which thread you are refering to, but I don`t think that I have denied any facts on the issue. I do however deny the notion that these contracts had any significant importance when it came to the stance the french, german (and russian?) governments took on the issue. Just look at the public oppinion of the war in these countries. \n \n Isn`t this a case of Okhams razor? I mean, the simplest explanation for any democraticly elected (and hoping to be elected again) politician ought to be to do what the public oppinion wants, no? \n \n Lets say that there had been no oil for food programe, or even oil in Iraq. Do you really think that France and Germany (and Russia?) would have acted any different?", 
   {}, 
   44689, 
   null, 
   1082420280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The U.N. Oil for Food scandal", 
  "url": "http://www.4forums.com/political/current-events-debates/2112-u-n-oil-food-scandal.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 2112, 
  "discussion_files": [
   [
    "25902.html", 
    "http://www.4forums.com/political/current-events-debates/2112-u-n-oil-food-scandal-print.html"
   ]
  ], 
  "identifier": 2112
 }
]