[
 [
  [
   42845, 
   null, 
   "Dmann", 
   "The Senator's Inner Nixon\n Which Way John Kerry?\n By JOHN STANTON\n \n John Kerry recently chided the incoming Spanish government of Jose Luis Rodriguez Zapatero for promising to fulfill a campaign promise to bring back to Spain its troops and support personnel deployed in Iraq. Agence France Press reported that Kerry's view was that if Spain did bring its soldiers home at this point in the US occupation, \"it would leave behind a failed state that inevitably would become a haven for terrorists.\" With this statement, he seems to have some Richard Nixon in him. On the John Kerry for President website, a section outlines Kerry's plan for \"Winning the Peace in Post-Saddam Iraq\" which is eerily similar to phrasing used in Nixon's Cambodia Incursion Address delivered in 1970 to the American people. Nixon indicated that his plans to expand the war while ostensibly bringing US troops home would result in \"winning the just peace we all desire\". Winning the Peace would be a constant refrain of Nixon's as would Peace with Honor. The longer the US stays on Iraq the closer its leaders will come to uttering those phrases.\n \n Why would John Kerry want to prolong the misery of US troops in Iraq and their families here in the USA with such a strangely Nixonesqe policy?\n \n Fiasco\n \n John Kerry must know, or at least his advisors should know, that Iraq is, indeed, \"a fiasco\" as Zapatero put it. An estimated 10,000 or more non-combatant Iraqi men, women and children have been slaughtered or maimed by US ordnance delivered from air, sea and land. Roughly 10,000 US troops have either been slaughtered (KIA), maimed (WIA) or have contracted illnesses (depleted uranium syndrome among them) that are filling VA hospitals all over the country. The cold-blooded and very capitalist US practice of mistakenly killing an Iraqi family member and subsequently offering $5000 in cash as a replacement for a human soul is sure to make more enemies in Iraq. The use by US forces of time-tested Israeli urban warfare tactics for retribution against rebel attacks--to include destroying homes in urban areas where suspected rebels live and in rural areas plowing up the farms of suspected rebel families-creates more enmity between occupation forces and the general population.\n \n Perhaps most stingingly, no one at the helm is listening to what the Israelis are telling the grand brains running the US military/political apparatus. As reported by MSNBC, Martin Van Creveld-an Israeli urban warfare expert--indicated that the US would eventually be forced to leave Iraq because the occupation is doomed to failure. \"They are already doing things that we [Israel] have been doing for years to no avail, like demolishing buildings, like closing off villages in barbed wire. The Americans are coming here to try to mimic all kinds of techniques, but it's not going to do them any good. I don't see how on earth the U.S. can win. I think this is going to end the same way Vietnam did. They are going to flee the country hanging on the strings of helicopters.\"\n \n When the Going Gets Tough, Chalabi Runs\n \n The Iraqi Governing Council (IGC) created by the US is generally reviled by the Iraqi people not so much because they are the marionettes of the US government but because the composition of the IGC is guaranteed to lead to further rebel activity against Iraqi occupation forces and the cronies who work for them. Iraqi civilians will continue to suffer. The IGC is a trademark American shake-and-bake government. It's artificial to the core and guaranteed to rot under pressure.\n \n According to islamonline.net, some of the most powerful members of the IGC, like Ahmed Chalabi, are not even Iraqi citizens. \"The first president of the IGC, Ibrahim Al-Jaafari, trained in medicine at Mosul University, did not consider Iraq to be his home. In an interview with the Associated Press, Al-Jaafari admitted that he considered London, England to be his home.\" Moreover, according to islamonline.net, the very design of the IGC is guaranteed to ensure sectarian conflict and further rebel attacks aimed at occupation forces. \"The very members of the IGC show us just what the United States intends to do...the Kurds have never been in a stronger position to call for secession and the creation of an independent Kurdistan. In-fighting will eventually tear the council apart, with each faction withdrawing to the protections of its armed militias. Those with foreign passports like Chalabi...will run as soon as the situation worsens.\"\n \n Read Nixon's Speech, Learn About John Kerry?\n \n What is most frightening about Kerry's negativity towards Spain's intention withdraw its military personnel from Iraq, is that he seems to endorse the view that if an electorate votes against the US occupation of Iraq (and the perpetual war on terror) then one is engaging in appeasement with the \"terrorists\". Setting aside the tortured logic in this thought, it's clear he agrees with prominent US warlords President Bush, Speaker of the US House Hastert, and the Chair of the US Joint Chiefs of Staff General Myers that somehow the Spanish people are assisting the terrorists by exercising their right to vote out a government whose policies they did not support.\n \n With US political and military leaders condemning the voters and the incoming government of Spain as evil appeasers, they display their contempt for the will of the people and of the individual citizen everywhere. Why does John Kerry side with them?\n \n Now that John Kerry has the Democratic nomination in hand, those Americans who support him must be vigilant and keep his feet to the fire on the issue of the occupation of Iraq. If not, sometime in the term of President Kerry, he will make the following remarks given by Nixon in the turbulent year that was 1970.\n \n \"My fellow Americans, we live in an age of anarchy, both abroad and at home. We see mindless attacks on all the great institutions which have been created by free civilizations in the last 500 years...Small nations all over the world find themselves under attack from within and from without. If, when the chips are down, the world's most powerful nation -- the United States of America -- acts like a pitiful, helpless giant, the forces of totalitarianism and anarchy will threaten free nations and free institutions throughout the world.\n \n It is not our power, but our will and character that is being tested tonight. The question all Americans must ask and answer tonight is this: Does the richest and strongest nation in the history of the world have the character to meet a direct challenge by a group which rejects every effort to win a just peace, ignores our warning, tramples on solemn agreements, violates the neutrality of an unarmed people, and uses our prisoners as hostages? If we fail to meet this challenge, all other nations will be on notice that despite its overwhelming power the United States when a real crisis comes will be found wanting.\"\n \n Don't take America there John Kerry.\n \n John Stanton is a Virginia Based writer specializing in political and military matters. He is the author-with Wayne Madsen-of America's Nightmare: The Presidency of George Bush II.. Reach him at cioran123@yahoo.com.", 
   {
    "post_info": {
     "post_title": "The Senator's Inner Nixon"
    }
   }, 
   null, 
   null, 
   1081364760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Senator's Inner Nixon", 
  "url": "http://www.4forums.com/political/government-debates/2119-senators-inner-nixon.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 2119, 
  "discussion_files": [
   [
    "4385.html", 
    "http://www.4forums.com/political/government-debates/2119-senators-inner-nixon-print.html"
   ]
  ], 
  "identifier": 2119
 }
]