[
 [
  [
   42866, 
   null, 
   "rapture", 
   "To believe Christ is not God, is too accept that the Virgin Mary is a lying whore-", 
   {
    "post_info": {
     "post_title": "Think about It!"
    }
   }, 
   null, 
   null, 
   1081369800.0
  ], 
  [
   42943, 
   null, 
   "Dmann", 
   "christ says he is the way...to god...not god...he says do not worship him...he says worship his father", 
   {}, 
   42866, 
   null, 
   1081396140.0
  ], 
  [
   42944, 
   null, 
   "Dmann", 
   "you left out SON of God as a choice", 
   {}, 
   42943, 
   null, 
   1081396200.0
  ], 
  [
   42998, 
   null, 
   "Relient Halo", 
   "Jesus Christ, although a part of God, is not God. God is God, not Jesus. I praise Jesus for what he did for me, but I praise His Father even more for sending Him. Remember, Jesus said that not even He knows when the end times will be, but His Father. Gives you something to think about.", 
   {}, 
   42944, 
   null, 
   1081410600.0
  ], 
  [
   43955, 
   null, 
   "rapture", 
   "Jesus Christ, although a part of God, is not God. God is God, not Jesus. I praise Jesus for what he did for me, but I praise His Father even more for sending Him. Remember, Jesus said that not even He knows when the end times will be, but His Father. Gives you something to think about.\n\n \n \n So do believe Mary is a lying whore?", 
   {}, 
   42998, 
   null, 
   1081983300.0
  ], 
  [
   43992, 
   null, 
   "Darkest Shadow", 
   "Jesus is part of God, he IS God, but separate....\n \n \n \n \n Yes that was very strange, it's nearly impossible to explain. :)", 
   {}, 
   43955, 
   null, 
   1082003340.0
  ], 
  [
   44006, 
   null, 
   "Phunting", 
   "Jesus would be an aspect of God, an avatar if you will. Part of, but not equal to the whole. Just as your arm is not 'you', but it is part of you.\n \n This is what people (IMHO) mean when they say Jesus is not God. They don't mean he has nothing to do with and is unconnected to God, just that he is not commensurate to the whole. I don't see why this would mean Mary was a lying whore.\n \n (Oh and of course, personal opinion? Myth all the way baby!)", 
   {}, 
   43992, 
   null, 
   1082029080.0
  ], 
  [
   44052, 
   null, 
   "Ghost", 
   "Jesus would be an aspect of God, an avatar if you will.\n\n \n LOL, nothing beats 40k references.", 
   {}, 
   44006, 
   null, 
   1082056800.0
  ], 
  [
   44258, 
   null, 
   "dreamweaver", 
   "To believe Christ is not God, is too accept that the Virgin Mary is a lying whore-\n\n How very charming of you. emoticon_rolleyes", 
   {}, 
   42866, 
   null, 
   1082160720.0
  ], 
  [
   44563, 
   null, 
   "Trancelation", 
   "Christ is a mystery. Nothing more. Faith has its own set of logic outside the realm which requires scientific validation. Before I hand mine over, I expect more credible answers.", 
   {}, 
   44258, 
   null, 
   1082358240.0
  ], 
  [
   44572, 
   null, 
   "Phunting", 
   "LOL, nothing beats 40k references.\n\n :) I was going to put Greater Daemon, but thought thats probably pushing the analogy a bit too far!", 
   {}, 
   44052, 
   null, 
   1082375640.0
  ], 
  [
   44582, 
   null, 
   "Tastyfish", 
   "Greater Daemon would be more along the lines of Archangels I think, formed from the gods power but having a inteligence seperate from it. If the body of Christ was human though then possession of a body by the holy spirit could be an alternative. Some intertsting theories put him as having to take over both the roles of king and high priest after John the Baptist was killed (who was possibily the original religous leader while Jesus would have been the political leader) based off traditions learned while in Egypt.\n \n Either that...or Jesus was a C'tan! (sorry, couldn't resist)", 
   {}, 
   44572, 
   null, 
   1082385540.0
  ], 
  [
   44600, 
   null, 
   "Big Orn", 
   "On earth, things that cannot be accepted or understood, need to be killed or, at least, dishonored/disgraced. That is not really the intelligent, civil way of handling it, but common none the less.\n \n John 1:1 &#8211; In the beginning was the Word, and the Word was with God, and the Word was God.\n \n We seem to take all things as we can digest them physically and that being Cradle to the Grave. The Word was not born, but has always been. Jesus is = I Am. When Moses asked who God was, God said, &#8220;I Am&#8221;. All through the Gospels, Jesus says, &#8220;I Am&#8230;&#8221;. What we as humans seem to miss is that the promise God made was fulfilled when He sent His son Jesus to be born of the human race. We &#8220;miss&#8221; it because we cannot understand it. As long as we continue to misunderstand the basics of Christ, we will always have the wrong idea(s) of who He was and still is.\n \n There is no Triune God (Trinity). There is only one: Isaiah 45:5, &#8220;I Am&#8230;the Lord, and there is no other; there is no God besides Me.&#8221;\n To explain what God meant when He said, &#8220;Let us make man in our image&#8230;&#8221;, He is talking about His Majesty.\n \n Of course, this resides in that bubble between our ears, put there either by the written word or orally. If you cannot digest it in your Spirit-man, then you cannot digest John 10:30 where Jesus says. &#8220;I and Father are one.&#8221;\n \n Jesus is God.", 
   {}, 
   44582, 
   null, 
   1082393640.0
  ], 
  [
   44632, 
   null, 
   "Ghost", 
   ":) I was going to put Greater Daemon, but thought thats probably pushing the analogy a bit too far!\n\n \n Maybe he's one of the two missing Primarchs...", 
   {}, 
   44572, 
   null, 
   1082400480.0
  ], 
  [
   45995, 
   null, 
   "rapture", 
   "Rev 3:1\n \n And unto the angel of the church in Sardis write; These things saith he(?) that hath the seven Spirits of God, and the seven stars\n \n Rev 5:6 \n \n And I beheld ,and lo, in the midst of the throne and of the four beasts, and in the midst of the elders, stood a Lamb as it had been  slain (CHRIST), having seven horns and seven eyes,  Which are the seven spirits of God sent forth into all the earth", 
   {}, 
   44632, 
   null, 
   1083029820.0
  ], 
  [
   46054, 
   null, 
   "Phunting", 
   "Rev 3:1\n \n And unto the angel of the church in Sardis write; These things saith he(?) that hath the seven Spirits of God, and the seven stars\n \n Rev 5:6 \n \n And I beheld ,and lo, in the midst of the throne and of the four beasts, and in the midst of the elders, stood a Lamb as it had been  slain (CHRIST), having seven horns and seven eyes,  Which are the seven spirits of God sent forth into all the earth\nWhat is your point? \n \n Are you noting an inconstancy in the Bible where it says God has seven and not three aspects?\n \n Good on ya Rapture, I knew we'd make an atheist of you eventually!", 
   {}, 
   45995, 
   null, 
   1083068340.0
  ], 
  [
   46593, 
   null, 
   "Debate_Queen615", 
   "I put down myth because I think that Christ could eaily have been made up. A", 
   {}, 
   46054, 
   null, 
   1083199620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Think about It!", 
  "url": "http://www.4forums.com/political/religion-debates/2123-think-about.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 2123, 
  "discussion_files": [
   [
    "10267.html", 
    "http://www.4forums.com/political/religion-debates/2123-think-about-print.html"
   ], 
   [
    "10268.html", 
    "http://www.4forums.com/political/religion-debates/2123-think-about-2-print.html"
   ]
  ], 
  "identifier": 2123
 }
]