[
 [
  [
   42879, 
   null, 
   "Broker", 
   "The forums are being filled with articles.\n \n From now on why doesn't everyone NOT post articles unless they give their opinions on them. It's just really annyoing to login and see 10 new articles clogging the boards. Or one thread could be made for everyone to post articles in.\n \n What does everyone have to say?", 
   {
    "post_info": {
     "post_title": "No More Articles"
    }
   }, 
   null, 
   null, 
   1081379340.0
  ], 
  [
   42884, 
   null, 
   "jim's trucking", 
   "The forums are being filled with articles.\n \n From now on why doesn't everyone NOT post articles unless they give their opinions on them. It's just really annyoing to login and see 10 new articles clogging the boards. Or one thread could be made for everyone to post articles in.\n \n What does everyone have to say?\n\n \n I can't speak for everyone, but...\n \n ...that would be construed as censorship by some. The liberals seem to have no opinions of their own. The sheep rely on copies of liberal journalism and cannot answer questions with their own thoughts. When they have no legitimate response, they resort to name calling or ridiculous attacks on the intelligence of the opposition.\n \n I don't mind reading an article that has backup contained within it...like the \"Kerry supporters should CHECK THIS OUT\" thread that I posted. It's not really an article, but an email message.\n \n And the article \"Open letter to John F Kerry\" is a good article with backup contained within. It's not just an opinion as are most of the lengthy liberal tripe sheets posted recently.\n \n Any author worth his salt will provide links or at least list his sources such as \"Washington Times June 5, 1999\".\n \n I agree that we need less copying of opinions and more individual expressions of posters opinions.\n \n However, getting the liberals to fight fairly is nearly impossible.\n \n You might try giving the poster a negative rep every time you see a page full of his article posts. Maybe he'll get banned and go to another site where tripe is welcomed. emoticon_xhoho", 
   {}, 
   42879, 
   null, 
   1081380960.0
  ], 
  [
   42887, 
   null, 
   "The_Comedian", 
   "I think that both, liberals and conservatives (to stick to these boring terms) post too many biased articles here.\n Backing up arguments with links to an article is much better to read and takes less capacity.\n And if people still want to post articles then they can do so by starting a topic with their own opinion about an article's content and post a link to the article too.\n \n Just my 2 cents...", 
   {
    "unicode_changes_made": true
   }, 
   42884, 
   null, 
   1081381740.0
  ], 
  [
   42888, 
   null, 
   "jim's trucking", 
   "I think that both, liberals and conservatives (to stick to these boring terms)  post too many biased articles here....\n\n \n Just so we'll know, what terms would you prefer instead of those used here?", 
   {}, 
   42887, 
   null, 
   1081381920.0
  ], 
  [
   42892, 
   null, 
   "The_Comedian", 
   "Just so we'll know, what terms would you prefer instead of those used here?\n\n I'd recommend to use none because as soon as these terms are involved, the discussion is likely to get down to personal insults just based on each others political stance.\n \n I don't know which other terms are normally used in the political life of the US but isn't there a bit more differece than just 'liberal' or 'conservative'?\n For me, Clinton was conservative in some points, as is Kerry.\n Understand why I find this terms boring (and sometimes simply not fitting)?", 
   {
    "unicode_changes_made": true
   }, 
   42888, 
   null, 
   1081382580.0
  ], 
  [
   42895, 
   null, 
   "jim's trucking", 
   "I'd recommend to use none because as soon as these terms are involved, the discussion is likely to get down to personal insults just based on each others political stance.\n \n I don't know which other terms are normally used in the political life of the US but isn't there a bit more differece than just 'liberal' or 'conservative'?\n For me, Clinton was conservative in some points, as is Kerry.\n Understand why I find this terms boring (and sometimes simply not fitting)?  \n\n \n \n Yes. They do tend to sterotype. It has become common to attach liberalism to the Democrats and conservatism to the Republicans when using the terms. Fiscal conservatism is not the same as moral conservatism though. Bill Clinton is about about as morally liberal as I'd want to meet. (not that I really want to meet him)\n \n Do you think that Bill's \"surplus\" is a sign of his fiscal conservatism, or did he just slash enough out of the military to save up a wad?", 
   {
    "unicode_changes_made": true
   }, 
   42892, 
   null, 
   1081384020.0
  ], 
  [
   42900, 
   null, 
   "The_Comedian", 
   "Do you think that Bill's \"surplus\" is a sign of his fiscal conservatism, or did he just slash enough out of the military to save up a wad?\n\n I am not well versed in financial questions.\n \n From what I've read in German papers and mags he maybe was what you call a 'fiscal conservative'.\n This and the rise in certain sectors of economy (like the I-net boom) helped your economy a lot. That any surplus would result out of a dried out military is a myth imo. You spent a lot more than any other country in the world on your military under Clinton, you already had the most powerful army ever and you already developed new weapons and technical equipment.\n Bush only tries to tell you that your military needs more money. You could save lots of money in this sector wthout any nation standing the slightest chance to ever threaten you (at least with conventional military strength). \n \n Sorry, but I couldn't resist to include some Bush-bashing (it suited too well).\n ;)", 
   {
    "unicode_changes_made": true
   }, 
   42895, 
   null, 
   1081385340.0
  ], 
  [
   42902, 
   null, 
   "Dmann", 
   "I'm going to ignore this thread completely. people post articles on every board on the web. get real.", 
   {}, 
   42900, 
   null, 
   1081386120.0
  ], 
  [
   42906, 
   null, 
   "Dmann", 
   " people post articles on every board on the web. get real.\n\n things change. i know you think because you've been here a long time that you now can tell newcomers....who have been posting all over the web for years, how to post, ...how this board has always been the way you want it to be.But your little clique is over folks. that's how i see it.\n \n if a few of you excepted facts fromm other posters ...then people like me wouldn't have to repeat ourselves ad naseum and use articles as a way to say, well, if you don't belive me, here's another voice that says the same thing. two of you demand proof endlessly. i just save you the time. On the one hand, you don't want proof...then you do....then you don't ....then you do...\n nobody is going to dictate how I post. That's my two cents\n \n It's also a great way to start a debate. If it's bias, then you argue against the bias.", 
   {}, 
   42902, 
   null, 
   1081386780.0
  ], 
  [
   42924, 
   null, 
   "Broker", 
   "The problem is that today when I went to the forum there were literally 15 new posts in this forum. Very few were topics, most were articles that no one has replied to and no one is going to reply to.\n \n The only articles posted are usually from partisan web sites... why don't we try to limit it to legitimate news sources so we don't get these \"Bush Planned 9/11\" and \"Democrats are really from Mars\" crazy articles...", 
   {}, 
   42906, 
   null, 
   1081392120.0
  ], 
  [
   42925, 
   null, 
   "fracas", 
   "posting articles that support your argument is all fine and useful.\n posting articles just to post articles without any comment is SPAM.\n \n Dboyy is particulary guilty of this.\n i've stopped reading his threads.", 
   {}, 
   42924, 
   null, 
   1081392360.0
  ], 
  [
   42936, 
   null, 
   "Dmann", 
   "if no one responds to them, they go away. stop trying to control everything. it works out on it's own", 
   {}, 
   42925, 
   null, 
   1081393080.0
  ], 
  [
   42938, 
   null, 
   "Dmann", 
   "if no one responds to them, they go away. stop trying to control everything. it works out on it's own\n\n \n \n AND...legitimate news sources don't always have the angles and nuance that commentary have. you know that. they couldn't report everything if they wanted to. They are owned by big business...and the right seems to believe they are owned by the left...but i've posted something that proves that wrong if you look around. \n \n \n I'm a professional writer, as well as graphic designer. I own my own local (free)paper that covers news and local arts and entertainment. I like articles. I make a living off of them.\n \n I actually make money off the ads...but... you get the point I'm trying to make.", 
   {}, 
   42936, 
   null, 
   1081393380.0
  ], 
  [
   42990, 
   null, 
   "Ghost", 
   "Posting articles is fine...but Broker's right, there were a ton of simply idiotic, rediculously biased articles posted here lately and there were like no comments or opinions. Post a few noteworthy articles, fine, but don't try to clog the boards with every little tidbit you find.", 
   {}, 
   42938, 
   null, 
   1081408440.0
  ], 
  [
   43318, 
   null, 
   "hvozdany", 
   "The forums are being filled with articles.\n \n From now on why doesn't everyone NOT post articles unless they give their opinions on them. It's just really annyoing to login and see 10 new articles clogging the boards. Or one thread could be made for everyone to post articles in.\n \n What does everyone have to say?\n\n \n \n Wow, I don't think that I agree with you on much,Broker, but I am in total agreement with you on this. As has been said, the problem is that the articles that are posted are usually just articles written by political hacks. I often like many of these articles, but why not just link to them?\n \n Also, I hope that both sides realize that these articles (written by Micheal Moore or Ann Culter, for example) are not going to convince the other side of anything. Not only are these people not credible with the other side, but if nothing else, they are just often so long that I doubt many people read the whole thing.\n \n So, for what it's worth, in my opinion article excerpts are fine, but if it is a long article, just summerize what the article is, and post a link.", 
   {}, 
   42879, 
   null, 
   1081621620.0
  ], 
  [
   43336, 
   null, 
   "mamboni", 
   "I'd like to see a decrease in these articles, too. It's monotonous and not very productive. I rarely see any responses, and they're often too biased to refute. Personally, I don't think anyone has the power to dictate what should be and what shouldn't be posted, except for the forum supervisors.\n \n I'm just growing weary of the \"liberals are idealistic XXXXXX\", and the \"conservatives are simplistic ignoramuses with religious foundations\".", 
   {}, 
   43318, 
   null, 
   1081626900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  No More Articles", 
  "url": "http://www.4forums.com/political/politics-debates/2125-no-more-articles.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2125, 
  "discussion_files": [
   [
    "28029.html", 
    "http://www.4forums.com/political/politics-debates/2125-no-more-articles-print.html"
   ], 
   [
    "28030.html", 
    "http://www.4forums.com/political/politics-debates/2125-no-more-articles-2-print.html"
   ]
  ], 
  "identifier": 2125
 }
]