[
 [
  [
   43537, 
   null, 
   "TMA68", 
   "If I'm not a senior concerned about the cost of presciption drugs, a student concerned about the cost of college tuition, or a middle class parent concerned about the ongoing problems with the government school system, but am simply a childless wage-earner who wants relief from the terribly regressive payroll tax, from artificially high rents (caused by land speculation), and from the parasitic plague of compound interest, what do Democratic candidates have to offer besides occasional obligatory lip service?\n \n Todd Altman", 
   {
    "post_info": {
     "post_title": "A question for Democrats"
    }
   }, 
   null, 
   null, 
   1081760640.0
  ], 
  [
   44012, 
   null, 
   "jskufan", 
   "Well, no one said the choice would be easy, or even clear cut. Anyone promising to lower your taxes is a dreamer. As long as our government and it's \"programs\" here and abroad continue to run the debt higher and higher, you and I will be called upon to pay for them. I wont obligate myself to any party for more than one election at a time because it requires you to \"rubber stamp\" their candidates whether you believe in them or not. As far as the upcoming election goes, if you're happy with the state of our country and the direction we're going, vote Republican. If you believe we need some change, whatever that may be, you'll have to take a chance and vote Democrat. In all fairness to either candidate, some of our countries problems go beyond the scope of the Presidential responsibilities.", 
   {}, 
   43537, 
   null, 
   1082037840.0
  ], 
  [
   44224, 
   null, 
   "hvozdany", 
   "...am simply a childless wage-earner who wants relief from the terribly regressive payroll tax...\n \n Todd Altman\n\n \n \n Thanks for the post...payroll taxes are something that I have not really looked at much or understand much about...do you (ar anyones else) have any other good articles about it (and perhaps why or why it shouldnt' be reformed)? Thanks.", 
   {}, 
   43537, 
   null, 
   1082140800.0
  ], 
  [
   44304, 
   null, 
   "faeden", 
   "Hi Todd, good post...\n \n The concept of compound interest is a miracle for those who are saving, but a plague for those who borrow. (Cavet Emptor = Buyer beware). Every American should be saving for their retirement, even if they have debt.\n \n As for land speculation, you too can try your hand at speculation. Be careful though! The opportunity to make a fortune is coupled with the possibility that you could loose all your money.\n \n As for taxes, no one pays much attention. Americans should be forced to SEND in their taxes. When the government takes the money out of our checks before we see it, many folks fail to notice! Also, a flat tax IS progressive and completely FAIR!\n \n The public schools are another matter, but I'm working on it!\n \n Pete", 
   {
    "post_info": {
     "post_title": "interest"
    }
   }, 
   44224, 
   null, 
   1082177820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A question for Democrats", 
  "url": "http://www.4forums.com/political/politics-debates/2157-question-democrats.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2157, 
  "discussion_files": [
   [
    "29748.html", 
    "http://www.4forums.com/political/politics-debates/2157-question-democrats-print.html"
   ]
  ], 
  "identifier": 2157
 }
]