[
 [
  [
   43789, 
   null, 
   "emclean", 
   "What do you believe will be accomplished by outlawing all firearms? I do not want to flame you or insult your opinion, I just truly do not under stand what you are trying to accomplish, and how banning all guns would accomplish that end.\n \n Please help me to at least see where you are coming from.", 
   {
    "post_info": {
     "post_title": "i don't understand banning guns."
    }
   }, 
   null, 
   null, 
   1081889700.0
  ], 
  [
   43796, 
   null, 
   "emclean", 
   "I posted this question to find out why people who favor banning all guns except those used by cops, and troops feel that way. If you do not believe this, it is not aimed at you.\n I have posted this same question on another site, and have been jumped on for my wording.\n I am only trying to understand another view point, if you can please help me to.", 
   {}, 
   43789, 
   null, 
   1081900560.0
  ], 
  [
   43799, 
   null, 
   "The_Comedian", 
   "Do you also want to hear an European opinion about pro gun-ban?", 
   {}, 
   43796, 
   null, 
   1081903500.0
  ], 
  [
   43803, 
   null, 
   "emclean", 
   "I would be happy to hear any gun ban opinion", 
   {}, 
   43799, 
   null, 
   1081905960.0
  ], 
  [
   43814, 
   null, 
   "The_Comedian", 
   "I would be happy to hear any gun ban opinion\n\n Here we go:\n First of all, I don't want to ban guns in the USA; I'd favor restrictions there.\n \n But in Europe we do very well with our gun laws. After WW2 the people in Europe were tired of fighting and as a result of this the Western European countries stated strict gun laws; in effect, nearly nobody owns a gun legally.\n In addition, penalties for crimes are much higher when committed with guns. Imo this lead to a different kind of mentality among criminals (I know this sounds weird) because it was harder to obtain a gun and even if you had one it would bring you into very big trouble as soon as police suspected you (as the criminal is rated as more dangerous and therefore gets more attention). The common criminals who commit crimes (and now I am talking for Germany only, I don't got stats from other countries) don't use guns. The risk is too high and the effect is not worth it. Real criminals try to get a gun and they always find a way to acquire one but these guys aren't scared of armed resistance too much either.\n That's why I (and most Europeans) don't see any need for more guns in our society. The first ones that would make use of a new law would be the criminals. Gun accidents would also inevitably rise and these numbers alone would maybe exceed the numbers of gun crime victims we have nowadays.\n \n But as I said at the beginning, this is only about Europe; the US already have too many guns around to get rid of them all.", 
   {
    "unicode_changes_made": true
   }, 
   43803, 
   null, 
   1081907700.0
  ], 
  [
   43826, 
   null, 
   "daewoo", 
   "Here we go:\n First of all, I don't want to ban guns in the USA; I'd favor restrictions there.\n \n But in Europe we do very well with our gun laws. After WW2 the people in Europe were tired of fighting and as a result of this the Western European countries stated strict gun laws; in effect, nearly nobody owns a gun legally.\n In addition, penalties for crimes are much higher when committed with guns. Imo this lead to a different kind of mentality among criminals (I know this sounds weird) because it was harder to obtain a gun and even if you had one it would bring you into very big trouble as soon as police suspected you (as the criminal is rated as more dangerous and therefore gets more attention). The common criminals who commit crimes (and now I am talking for Germany only, I don't got stats from other countries) don't use guns. The risk is too high and the effect is not worth it. Real criminals try to get a gun and they always find a way to acquire one but these guys aren't scared of armed resistance too much either.\n That's why I (and most Europeans) don't see any need for more guns in our society. The first ones that would make use of a new law would be the criminals. Gun accidents would also inevitably rise and these numbers alone would maybe exceed the numbers of gun crime victims we have nowadays.\n \n But as I said at the beginning, this is only about Europe; the US already have too many guns around to get rid of them all.\n\n \n While I do not agree with making guns illegal in general, the German gun control laws do actually contain a component that American gun control laws do not. They actually contain a crime control component. \n \n Making guns illegal, requiring background checks, banning scary looking guns, banning certain bullets and reestricting concealed carry to those who are willing to put their name, fingerprints, and such on file does nothing to control crime. They are simply annoying restrictions on gun owners who are willing to follow the law.\n \n Strict punishments for those caught in the commision of a crime while in posession of a gun is actually a law that has the potential to impact crime, not just annoy law abiding citizens. Most of the \"gun control\" laws we have in the US have no potential to impact crime at all, except perhaps making the streets safer for criminals who have an unarmed public to prey upon.", 
   {
    "unicode_changes_made": true
   }, 
   43814, 
   null, 
   1081913880.0
  ], 
  [
   43833, 
   null, 
   "The_Comedian", 
   "Something about German gun laws (I hope I remember them correctly):\n \n You have the right to own a gun if you have a hunter's license or you are doing shooting as a sport. Still, there's a restriction to the guns you can use while on hunt or on the shooting range.\n You have the right to own and carry a gun if your job includes high risks. This includes bodyguards but also jewelers as well. No other jobs come to my mind right now but I think you know what I mean.\n \n @daewoo:\n Imo the middle part of your post can be applied only to countries like the US where gun control wasn't existent in first place.\n Although I don't know if you were refering about US gun laws already.", 
   {
    "unicode_changes_made": true
   }, 
   43826, 
   null, 
   1081915860.0
  ], 
  [
   43842, 
   null, 
   "daewoo", 
   "Something about German gun laws (I hope I remember them correctly):\n \n You have the right to own a gun if you have a hunter's license or you are doing shooting as a sport. Still, there's a restriction to the guns you can use while on hunt or on the shooting range.\n You have the right to own and carry a gun if your job includes high risks. This includes bodyguards but also jewelers as well. No other jobs come to my mind right now but I think you know what I mean.\n \n @daewoo:\n Imo the middle part of your post can be applied only to countries like the US where gun control wasn't existent in first place.\n Although I don't know if you were refering about US gun laws already.\n\n \n I was refering to US gun control laws already on the books. One of the biggest differences I have noted between countries with high rates of gun crime and low rates of gun crime is that the ones with lower rates of gun crime tend to have \"Common sense\" gun contol laws that actually have a crime prevention element such as harsh penalties for criminal use of a gun. In the US the concept of attaching a crime prevention component to our gun control laws has eluded those to whom gun control is important.", 
   {
    "unicode_changes_made": true
   }, 
   43833, 
   null, 
   1081918200.0
  ], 
  [
   43880, 
   null, 
   "Phunting", 
   "I totally agree with The Comedian, in the UK the situation seems pretty much the same. Guns are so rare to anyone that making them legal or restricted would mean that the criminals would gain immediate advantages with minimal advantages to a few enthusiasts (myself included, I shoot but don't own the guns involved or ever remove them from the range or other secure locations).\n \n But I agree this only works if guns aren't generally available in the first place, they are in the states so similar measures wouldn't work. The anti-gun lobbyists fail to recognise this distinction when making the 'it works in Europe' argument.", 
   {}, 
   43842, 
   null, 
   1081954620.0
  ], 
  [
   44340, 
   null, 
   "Tim", 
   "I don't understand banning gun-control. What do you think to accomplish by getting rid of all gun-control? \n \n Canada has millions of privately owned guns and far less gun deaths than the US. But they also have quite strict national gun control laws. \n \n I've heard that the most common way that criminals obtain guns in the US is that they have someone who can pass a background check purchase a gun for them. This is known as a strawman purchase. We should try to reduce the number of strawman purchases.", 
   {}, 
   43880, 
   null, 
   1082195820.0
  ], 
  [
   44369, 
   null, 
   "daewoo", 
   "THe biggest difference btwn canadian and American gun control laws is their registration scheme. Beyond that, they are abut the same as US gun control laws. In fact, US gun control laws are much stricter in certain areas (sucha s importation of assault weapons).\n \n Stopping straw man purchases sounds like a good idea up front, but how do you do it? THere isn;t really a way I can think of to do so without infringing on the rights of law abiding gun owners. \n \n Why shoud we repeal gun control laws? That's a simple on. they cost us a lot to enforce and apparently do nothing to curb crime. That being the case, why have them? In the end, controlling guns shoudl not be the goal, controlling crime should be. A gun control law that doesn't have a crime control component is just annoying law abiding citizens.", 
   {}, 
   44340, 
   null, 
   1082224020.0
  ], 
  [
   44371, 
   null, 
   "emclean", 
   "I do not believe that we need to ban gun control, the insta-checks it a good idea, I really like the concealed carry laws that require training before you get one. There is a lot of bad law out there also, when is the last time there was a case of a bayoneting? Why can I not legally buy a gun for my son?", 
   {}, 
   44369, 
   null, 
   1082225700.0
  ], 
  [
   47027, 
   null, 
   "pyromattiac", 
   "I see the restrictions and gun \"control\" laws on the books in the US as ridiculous and ineffective. If someone was intent on using a gun in a crime, they wouldn't choose to go through all of the red tape, they would simply buy a gun illegally, because what do they care, they're already planning on breaking the law.", 
   {}, 
   44371, 
   null, 
   1083382800.0
  ], 
  [
   48051, 
   null, 
   "Jeffersonian", 
   "I do not believe that we need to ban gun control, the insta-checks it a good idea, I really like the concealed carry laws that require training before you get one. There is a lot of bad law out there also, when is the last time there was a case of a bayoneting? Why can I not legally buy a gun for my son?\n\n \n You can not buy a gun for your son, legally that is called a strawman purchase and is the most common way criminals obtain guns. They have a friend or relative with a clean criminal record, go through the background check, purchase the gun at a gun store, then the pass money and gun back and forth in the parking lot of the gun store. The reason why this is highly illegal is the legal gun owner is passing the gun to a person whith full knowledge that his \"firend\" can not pass the background check.\n \n You can buy a gun. Keep it. Change your mind, then give it to anyone you wish who you know can legally own a gun. If your son meets all the legal requirements and you know he does, that your not breaking any law when you gift the gun to your son. The whole point is when you first bought the gun, you had no intent to buy it for someone else.\n \n BTW, Sarah Brady did EXACTLY that, she bought a gun for someone else and broke a law that she is trying to have passed herself. Talk about hypocrite.", 
   {}, 
   44371, 
   null, 
   1083855180.0
  ], 
  [
   48074, 
   null, 
   "emclean", 
   "there shpuld be a way to put on the fourm that the weapon is a present, IMO.", 
   {}, 
   48051, 
   null, 
   1083865140.0
  ], 
  [
   48144, 
   null, 
   "Sigma", 
   "I see the restrictions and gun \"control\" laws on the books in the US as ridiculous and ineffective. If someone was intent on using a gun in a crime, they wouldn't choose to go through all of the red tape, they would simply buy a gun illegally, because what do they care, they're already planning on breaking the law.\n\n \n \n That sort of shows that the laws are working as intended... a criminal intent on using a gun in an unlawful manner is unable to legally obtain a gun. \n \n That he/she is able to get a gun illegally is another issue that should be addressed.", 
   {}, 
   47027, 
   null, 
   1083881940.0
  ], 
  [
   48203, 
   null, 
   "Jeffersonian", 
   "there shpuld be a way to put on the fourm that the weapon is a present, IMO.\n\n \n You can give away a gun as present. Your not prohibited to do so. You just have to make sure you give it to someone who can legally have one.\n \n You can not purchase a gun for the purpose of giving it away, plus giving it away to someone you know can not legally pass a background check.", 
   {}, 
   48074, 
   null, 
   1083897180.0
  ], 
  [
   48207, 
   null, 
   "emclean", 
   "i know, and that is what bothers me, there is no way for me to liegaly do that. i know a father that have broken the law by giving his sons matching guns, and i think there should be a way to do that with in the law.", 
   {}, 
   48203, 
   null, 
   1083898020.0
  ], 
  [
   48258, 
   null, 
   "Shooterman", 
   "A few words on the points being made about the buying, selling, and giving of firearms. I bought my first .22 at about 15 years of age. Walked into the best sporting goods store in my town, and walked out with the weapon. I wasn't asked if I had been trained properly, ( I had ) nor was I asked any questions. Unfortunately, I traded it years later. I wish I hadn't. I bought another .22 at age 17, which I still have, and which I will pass on to one of my grandchildren. \n \n Personally, I find the age restriction, to be stupid and basically uncalled for. See above. Are kids really any different now than then. Some are, but most aren't. \n \n GGs are caught up, and gun owners have gone along with, in this silly argument about background checks, to the point of being rediculous. Some people are criminals, but most aren't. Some people do stupid things, and though all do at certain times, most are not perennially eaten up with a case pf the 'stupids'. Laws against being stupid or doing stupid things would have all of us in jail.\n \n A law can not look into the future and see who will commit a crime, nor can it predetermine who may go nuts. God help this country if technology ever gets to the level where such things can occur.\n \n Life is a crapshoot, at best. The only guarantee is we must die. What may happen after that is where one's faith plays a part of their lives. \n \n Firearms are still a legal commodity in our country. Hopefully it will always remain so, and as such, if we are to regulate them as dangerous products, let's be honest and regulate all dangerous products as some wish to regulate firearms. As long as that commodity remains legal, it should remain legal for an individual to buy and sell them, unencumbered by some law determined by the fears of those believing otherwise. I include two classes in those with such fears. Those instigating those fears by lies, distortions, half truths, and inuendo, into those succeptible to such fears. Those ( the instigators ) are the ones that should be feared in this country. Simply ask, what is the driving agenda of those instigating fear into the public. Fifty years ago, I doubt seriously, if one person in a hundred would have the phobia against firearms, you see expressed on these forums. Yet, this underlying fear seem pervasive now. What's changed? \n \n Just a few thoughts from an firm believer in the right of individuals to control their own personal destiny, free from the encumberances imposed by the fearful, who believing government should protect us from cradle to grave, would try to determine what is best for all of us.", 
   {}, 
   48074, 
   null, 
   1083941040.0
  ], 
  [
   48293, 
   null, 
   "Jeffersonian", 
   "i know, and that is what bothers me, there is no way for me to liegaly do that. i know a father that have broken the law by giving his sons matching guns, and i think there should be a way to do that with in the law.\n\n \n Sorry, but this is a free country. You can do anything you want. You can even choose to break the law. As a free citizen you can do anything you want then you must reap the rewards or suffer the consequences. That is freedom, the freedom to risk for a reward. The reward is to do what you wish, giving a gun as a gift. If your caught and prosecuted, your not instantly guilty. Ask yourself, is a group of your peers really going to send you to jail for something that lots of people already do? That is give guns as presents to sons? Plus is the gun for junior to own? but it is in Dad's gun safe? and junior doesn't have the combination? Or is junior 30 years old and with no criminal history? It would be hard for the police and prosecutor to press a case if junior is 30 years old and you gave him a gun, even if you bought the gun just yesterday. These are all personal decisions that all free men must make for themselves, not just for guns, but for all personal decisions that have personal risks.", 
   {}, 
   48207, 
   null, 
   1083951720.0
  ], 
  [
   48307, 
   null, 
   "daewoo", 
   "That sort of shows that the laws are working as intended... a criminal intent on using a gun in an unlawful manner is unable to legally obtain a gun. \n \n That he/she is able to get a gun illegally is another issue that should be addressed.\n\n \n It has always been illegal to purchase a gun for the intention of using it in an unlawful maner (conspiracy to commit....fill in the balnk). They keep doing it.", 
   {}, 
   48144, 
   null, 
   1083954840.0
  ], 
  [
   48367, 
   null, 
   "Sigma", 
   "It has always been illegal to purchase a gun for the intention of using it in an unlawful maner (conspiracy to commit....fill in the balnk). They keep doing it.\n\n \n I guess I'm not understanding... the fact that a person who was going to use it illegally and knowing he couldn't get one legally was presented as a case that gun laws (which would prevent him from obtaining the gun) don't work, when they seemed to work in this case.\n \n The fact that a criminal can get a gun illegally is a different issue.", 
   {}, 
   48307, 
   null, 
   1083964980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  i don't understand banning guns.", 
  "url": "http://www.4forums.com/political/gun-control-debates/2167-i-dont-understand-banning-guns.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 2167, 
  "discussion_files": [
   [
    "17481.html", 
    "http://www.4forums.com/political/gun-control-debates/2167-i-dont-understand-banning-guns-print.html"
   ], 
   [
    "17482.html", 
    "http://www.4forums.com/political/gun-control-debates/2167-i-dont-understand-banning-guns-2-print.html"
   ]
  ], 
  "identifier": 2167
 }
]