[
 [
  [
   44367, 
   null, 
   "WiseAker2", 
   "WiseAker2 here. I have been involved in a discussion/debate on the thread called the Silent Scream as \"WiseAker\". Apparently, if the pro-life arguments are too strong they are removed from 4Forums as this one has been. What happened to the Silent Scream thread?\n \n Liberals love to claim that they are open-minded and for free speech but that's only if they're not losing the debate. If arguments against choice are too strong they are shut down and removed. I wonder how many others who've demolished the so-called reasoning of the pro-choicers here have been kicked out as I've been or had their posts removed as mine have been.\n \n Yeah, the left is for free speech as long as they agree with it. Good luck to all of you who want to run in the woods with blinders on! \n \n Read The Unaborted Socrates by Kreeft freethinkers!\n \n Every liberal a wanted liberal.", 
   {
    "post_info": {
     "post_title": "4Forums practices censorship"
    }
   }, 
   null, 
   null, 
   1082221320.0
  ], 
  [
   44378, 
   null, 
   "carla5010", 
   "Well, you ARE the one advocating the murder of physicians.", 
   {}, 
   44367, 
   null, 
   1082229720.0
  ], 
  [
   44379, 
   null, 
   "Haulingboat", 
   "Well, you ARE the one advocating the murder of physicians.\n\n \n \n And that would make you the one that IS advocating the murder of our future generation.", 
   {}, 
   44378, 
   null, 
   1082232240.0
  ], 
  [
   44380, 
   null, 
   "carla5010", 
   "And that would make you the one that IS advocating the murder of our future generation.\n\n \n Your lie about me is duly noted.", 
   {}, 
   44379, 
   null, 
   1082232780.0
  ], 
  [
   44383, 
   null, 
   "Haulingboat", 
   "Your lie about me is duly noted.\n\n \n Which lie is that?", 
   {}, 
   44380, 
   null, 
   1082233140.0
  ], 
  [
   44384, 
   null, 
   "carla5010", 
   "Which lie is that?\n\n That would be your outright lie that I advocate murder of anybody.", 
   {}, 
   44383, 
   null, 
   1082233980.0
  ], 
  [
   44389, 
   null, 
   "Haulingboat", 
   "That would be your outright lie that I advocate murder of anybody.\n\n \n I don't partake in your word play games. So lets call it like it is.", 
   {}, 
   44384, 
   null, 
   1082234700.0
  ], 
  [
   44390, 
   null, 
   "carla5010", 
   "I don't partake in your word play games. So lets call it like it is.\n\n Yes, we have already called it to be your lies. Nothing more to add.", 
   {}, 
   44389, 
   null, 
   1082234760.0
  ], 
  [
   44394, 
   null, 
   "Haulingboat", 
   "Yes, we have already called it to be your lies. Nothing more to add.\n\n Hey, I am all for the right to murder an unborn child. Someday I may choose to due just that. I am also for calling like it is. If your technical terms help you justify the process then you are hiding from the way that you truely feel.", 
   {}, 
   44390, 
   null, 
   1082235180.0
  ], 
  [
   44395, 
   null, 
   "whistler", 
   "Wiseaker--get over yourself. Silent Scream was pulled not because you are a supreme debater and developed an irrefutable position against abortion. It was pulled because you advocated the killing of physicians who perform abortions.\n \n Furthermore, I did not report the thread at all and I certainly would never do something like that because I felt I was losing a debate. \n \n Regardless, I think there is an important distinction that should be made here. \n \n Murdering a physician is illegal and that will never change. \n An abortion, while you might believe it to be murder, is currently legal. \n \n Thus promoting abortion is legal while promoting the murder of adults isn't. I can certainly see why that thread was locked down. I wouldn't be suprised if this one wasn't too far behind.\n \n \n Whistler", 
   {}, 
   44390, 
   null, 
   1082235900.0
  ], 
  [
   44396, 
   null, 
   "Haulingboat", 
   "Wiseaker--get over yourself. Silent Scream was pulled not because you are a supreme debater and developed an irrefutable position against abortion. It was pulled because you advocated the killing of physicians who perform abortions.\n \n Furthermore, I did not report the thread at all and I certainly would never do something like that because I felt I was losing a debate. \n \n Regardless, I think there is an important distinction that should be made here. \n \n Murdering a physician is illegal and that will never change. \n An abortion, while you might believe it to be murder, is currently legal. \n \n Thus promoting abortion is legal while promoting the murder of adults isn't. I can certainly see why that thread was locked down. I wouldn't be suprised if this one wasn't too far behind.\n \n \n Whistler\n\n OK lets stop calling it murder and start calling it killing. Whatever you call it it is 6 of one half dozen of the other.", 
   {}, 
   44395, 
   null, 
   1082236320.0
  ], 
  [
   44407, 
   null, 
   "carla5010", 
   "Hey, I am all for the right to murder an unborn child.\nReally? You are supporting illegal killings? Well, to each their own.\n \n \nSomeday I may choose to due just that. I am also for calling like it is.\nGood, then you are all for not calling abortion \"murder\" (funny though, as you just did that. That must have been an oversight of yours, then) and thus is not supportive of the anti-choice revisionist linguistics. That's encouraging; that you are going to change your ways from calling things what they are not.\n \n \nIf your technical terms help you justify the process\nEh? What gave you that idea? My support for the right of women to chose what happens to their own bodies rather than have fundie misogynists enslave them, that has nothing to do with technical language. Your outright lies about me, though, does have something to do with your recent use of revisionist linguistics. It is encouraging, though, that you now have forsaken that silly approacha and will deal with reality instead.\n \n \nthen you are hiding from the way that you truely feel.\nGiven your false premise to begin with, I am sure you can see the error of your claim. :)", 
   {}, 
   44394, 
   null, 
   1082241720.0
  ], 
  [
   44408, 
   null, 
   "carla5010", 
   "OK lets stop calling it murder and start calling it killing. Whatever you call it it is 6 of one half dozen of the other.\nNot at all, as only the second description is accurate, while the first description was false. But I applaud you seeking the clarity of precise language rather than the revisionist linguistics of the anti-choice movement.", 
   {}, 
   44396, 
   null, 
   1082241840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  4Forums practices censorship", 
  "url": "http://www.4forums.com/political/abortion-debates/2191-4forums-practices-censorship.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 2191, 
  "discussion_files": [
   [
    "27783.html", 
    "http://www.4forums.com/political/abortion-debates/2191-4forums-practices-censorship-print.html"
   ]
  ], 
  "identifier": 2191
 }
]