[
 [
  [
   44452, 
   null, 
   "triplestandard2", 
   "We have our own definition of life. \n Some people's lives are full of killing, while some people's lives are full of healing. \n Does free will play a role in our definition of \"life\"? \n Or was everything decided for us before we were born?", 
   {
    "post_info": {
     "post_title": "Life"
    }
   }, 
   null, 
   null, 
   1082260320.0
  ], 
  [
   44464, 
   null, 
   "faeden", 
   "IMO, we have free will and God has already 'seen' what choices we will make.\n \n emoticon_xbye", 
   {
    "post_info": {
     "post_title": "opinion"
    }
   }, 
   44452, 
   null, 
   1082269620.0
  ], 
  [
   47551, 
   null, 
   "pyromattiac", 
   "We have free will, but it's not beyond his power to see what choices we will make.", 
   {}, 
   44464, 
   null, 
   1083639600.0
  ], 
  [
   47821, 
   null, 
   "Tedster", 
   "How is it we have free will but God sees what we'll do already? I mean that if he already sees what we're going to do can't he have some influence on it ot manipulate what we're going to do? Then this should bring up the question of ones belief in God. Do you really beleive in something that will manipulate you to it's own will? If we truly have free will and it can truly affect our lives there should be no being above or below that can truly see whats going to happen.", 
   {}, 
   47551, 
   null, 
   1083773520.0
  ], 
  [
   47843, 
   null, 
   "jim's trucking", 
   "How is it we have free will but God sees what we'll do already? I mean that if he already sees what we're going to do can't he have some influence on it ot manipulate what we're going to do? Then this should bring up the question of ones belief in God. Do you really beleive in something that will manipulate you to it's own will? If we truly have free will and it can truly affect our lives there should be no being above or below that can truly see whats going to happen.\n\n \n Why not????", 
   {}, 
   47821, 
   null, 
   1083776760.0
  ], 
  [
   47848, 
   null, 
   "Valthonis", 
   "Why not????\n\n I don't know what his answer will be but I have my own. If he can already see what we are going to do, then it has already been foreordained.", 
   {}, 
   47843, 
   null, 
   1083777600.0
  ], 
  [
   48512, 
   null, 
   "Lily", 
   "I don't know what his answer will be but I have my own. If he can already see what we are going to do, then it has already been foreordained.\n\n \n Not necessarily.\n \n God is outside time. He sees what we did, what we're doing, and what we're going to do all at once. That doesn't mean He controls it. He can intervene where he chooses, though.\n \n That's what I believe, anyway. *shrug*", 
   {}, 
   47848, 
   null, 
   1084033560.0
  ], 
  [
   48516, 
   null, 
   "galton", 
   "I don't know about God's role in it, but there is hard evidence for at least some free will. Very thorough studies of human behavior usually can only explain about one-half of the factors that cause us to do things. The other half is random which is science's way of saying that you are freely choosing (within the constraints of that other half).", 
   {}, 
   48512, 
   null, 
   1084034160.0
  ], 
  [
   48602, 
   null, 
   "Sigma", 
   "Not necessarily.\n \n God is outside time. He sees what we did, what we're doing, and what we're going to do all at once. That doesn't mean He controls it. He can intervene where he chooses, though.\n \n That's what I believe, anyway. *shrug*\n\n \n Then he already sees how he is going to intervene, so he is unable to change what he will do unless he was incorrect in seeing how he was going to intervene", 
   {}, 
   48512, 
   null, 
   1084069980.0
  ], 
  [
   48614, 
   null, 
   "Lily", 
   "Then he already sees how he is going to intervene, so he is unable to change what he will do unless he was incorrect in seeing how he was going to intervene\n\n \n No. Because He is outside time. He can't be incorrect. He knows what He will do.", 
   {}, 
   48602, 
   null, 
   1084073520.0
  ], 
  [
   48629, 
   null, 
   "SilentPoet", 
   "I am a believer in free will and a disbeliever in an all powerful diety.", 
   {}, 
   48614, 
   null, 
   1084075740.0
  ], 
  [
   48654, 
   null, 
   "Sigma", 
   "No. Because He is outside time. He can't be incorrect. He knows what He will do.\n\n \n And he can do no different than what he knows he will do.\n \n Neither can we do any different than what he knows we're going to do. It all plays out exactly how god planned it to be. So the question is why didn't god plan me to believe in him?", 
   {}, 
   48614, 
   null, 
   1084093260.0
  ], 
  [
   48678, 
   null, 
   "Lily", 
   "And he can do no different than what he knows he will do.\n \n Neither can we do any different than what he knows we're going to do. It all plays out exactly how god planned it to be. So the question is why didn't god plan me to believe in him?\n\n \n No.\n \n We choose our fate. He just knows what it is. And He chooses to act accordingly.\n \n God didn't plan for anyone to believe in Him. He wants everyone to, but you can choose whether you want to. *shrug*", 
   {}, 
   48654, 
   null, 
   1084121280.0
  ], 
  [
   48689, 
   null, 
   "Sigma", 
   "No.\n \n We choose our fate. He just knows what it is. And He chooses to act accordingly.\n \n God didn't plan for anyone to believe in Him. He wants everyone to, but you can choose whether you want to. *shrug*\n\n \n Ah, and I thought that god had a plan for the world. If he does not, what is the point to living?", 
   {}, 
   48678, 
   null, 
   1084125120.0
  ], 
  [
   48690, 
   null, 
   "Lily", 
   "Ah, and I thought that god had a plan for the world. If he does not, what is the point to living?\n\n \n What's the point of existing? We're just kind of... here.", 
   {}, 
   48689, 
   null, 
   1084125240.0
  ], 
  [
   48813, 
   null, 
   "Valthonis", 
   "[QUOTE=Lily]God is outside time. He sees what we did, what we're doing, and what we're going to do all at once. That doesn't mean He controls it. He can intervene where he chooses, though.QUOTE]\n \n Still doesn't sound like free will. Sounds like it can be laid out in front of him so it has already been decided.", 
   {}, 
   48512, 
   null, 
   1084209540.0
  ], 
  [
   48942, 
   null, 
   "Lily", 
   "Still doesn't sound like free will. Sounds like it can be laid out in front of him so it has already been decided.\n\n \n Not quite. To simplify it, it's almost like He can see the future. He knows what we're going to do. He does decide it, He just knows.", 
   {}, 
   48813, 
   null, 
   1084230900.0
  ], 
  [
   48977, 
   null, 
   "Tastyfish", 
   "If he can see into the future, then it is set. As far as quantum is concerned there is no free will -you make every possible choice available but only percieve on our huge, simpified level the most common results. \n \n Free will is not about God controlling it or not, it is about whether you can actually make a choice or whether your action is predertirmined by your past experiences and the current situation. If God knows how you will respond then you can not respond in any other way thus you have no free will, God has nothing to do with it but your own experinces mean you will defintely make that choice. If you did not then God is not all knowing.", 
   {}, 
   48942, 
   null, 
   1084241700.0
  ], 
  [
   48981, 
   null, 
   "Lily", 
   "If he can see into the future, then it is set. As far as quantum is concerned there is no free will -you make every possible choice available but only percieve on our huge, simpified level the most common results. \n \n Free will is not about God controlling it or not, it is about whether you can actually make a choice or whether your action is predertirmined by your past experiences and the current situation. If God knows how you will respond then you can not respond in any other way thus you have no free will, God has nothing to do with it but your own experinces mean you will defintely make that choice. If you did not then God is not all knowing.\n\n \n In the end, you make your own choice. Period. God is outside time - He can see the past, the present and the future all at once.\n \n Just because the future is known to some, does not mean it is set in stone. If you've read Harry Potter and the Prisoner of Azkaban, it'd make more sense.", 
   {}, 
   48977, 
   null, 
   1084242600.0
  ], 
  [
   48986, 
   null, 
   "Tastyfish", 
   "I've done and read a fair bit about quantum physics, all time existing at once is not a problem for me- it is merely an additional dimension. However because of this, things are always the same at each time, 4 inutes in the future won't be any different if you could see it now as if the saem time was 4 minutes in the past.\n Seeing the future and knowing it is different, if you know the future then it can not change. You make no choices but feel you have (as what you consider choice is just the brain working out which thing it will do, it is a machine, set it up in a certain way and feed the same information in and it will always react the same way). Everyone makes their own choice, but they would never have made a different one (well they may have but not often enough for it to have an effect on the majority of the rest of the choices consquences- if playing with quantum choice then one of the choices might effect a consquence of a different choice- essentially in one universe the paritcle moves through an open gap, whereas in the a door has been put i the way. One object goes through the gap and the other can not, however sometimes the object that went through the gap will appear on the otherside of the door as it replaces the object that did not in a different place. The object both went and did not go through the gap at the same time, this isn't a case where we can't tell if it did or not, it did both. This is the schrodingers cat experiment though it is often misunderstood.)", 
   {}, 
   48981, 
   null, 
   1084243260.0
  ], 
  [
   48997, 
   null, 
   "Lily", 
   "I've done and read a fair bit about quantum physics, all time existing at once is not a problem for me- it is merely an additional dimension. However because of this, things are always the same at each time, 4 inutes in the future won't be any different if you could see it now as if the saem time was 4 minutes in the past.\n Seeing the future and knowing it is different, if you know the future then it can not change. You make no choices but feel you have (as what you consider choice is just the brain working out which thing it will do, it is a machine, set it up in a certain way and feed the same information in and it will always react the same way). Everyone makes their own choice, but they would never have made a different one (well they may have but not often enough for it to have an effect on the majority of the rest of the choices consquences- if playing with quantum choice then one of the choices might effect a consquence of a different choice- essentially in one universe the paritcle moves through an open gap, whereas in the a door has been put i the way. One object goes through the gap and the other can not, however sometimes the object that went through the gap will appear on the otherside of the door as it replaces the object that did not in a different place. The object both went and did not go through the gap at the same time, this isn't a case where we can't tell if it did or not, it did both. This is the schrodingers cat experiment though it is often misunderstood.)\n\n \n So says human science. *shrug* What it all comes down to, really, is whether you believe in God or not. \"A man alone can do nothing; a man and God can do everything.\"", 
   {}, 
   48986, 
   null, 
   1084244400.0
  ], 
  [
   49077, 
   null, 
   "Valthonis", 
   "*shrug*\n\n \n This makes you seem unsure", 
   {}, 
   48997, 
   null, 
   1084296000.0
  ], 
  [
   49079, 
   null, 
   "Valthonis", 
   "If you've read Harry Potter and the Prisoner of Azkaban, it'd make more sense.\n\n \n That involves magic. Do we have magic to change time with?", 
   {}, 
   48981, 
   null, 
   1084296360.0
  ], 
  [
   49087, 
   null, 
   "99%BEEF", 
   "I wonder whether it is possible to have freewill without a God being present.\n \n If I am just a bioloigcal organism then I am just the result of my experiences and my internal chemical reactions. Unless there is part of me that is somehow removed from the physical exsistance (i.e spirit) then I am just another process within it.\n \n Anyway I think I believe in pre-determinism", 
   {}, 
   49079, 
   null, 
   1084297320.0
  ], 
  [
   49407, 
   null, 
   "Phunting", 
   "Gagh not again! Personally I still fail to see how if the future is defined we can possibly have an option in changing it. However last time I got into this debate we just went round in circles getting nowhere but annoyed. So I won't start...\n \n As this is asking for an opinion I believe that we have no free will anyway, even without god's existence. I believe the choices I make I will be 'destined' to make, and that I really can never choose any other way no matter how much it may feel like a choice at the time.", 
   {}, 
   49087, 
   null, 
   1084386480.0
  ], 
  [
   50138, 
   null, 
   "sglaine", 
   "I personally think the end is some what near. It is not a pretty sight but as long as we have terrorist. And people like Bush that want to be in a war this world could self destruct at some point and time.", 
   {}, 
   48690, 
   null, 
   1084648740.0
  ], 
  [
   50142, 
   null, 
   "Sigma", 
   "I wonder whether it is possible to have freewill without a God being present.\n \n If I am just a bioloigcal organism then I am just the result of my experiences and my internal chemical reactions. Unless there is part of me that is somehow removed from the physical exsistance (i.e spirit) then I am just another process within it.\n \n Anyway I think I believe in pre-determinism\n\n \n Exactly :D I fail to see how that changes if there is a god.", 
   {}, 
   49087, 
   null, 
   1084652820.0
  ], 
  [
   50148, 
   null, 
   "pyromattiac", 
   "And people like Bush that want to be in a war this world could self destruct at some point and time.\n\n \n That's the second dumbest thing I've ever heard! No one wants to be in a war. I suppose that you don't see that the terrorists want to kill us. It has nothing to do with us attacking them. They want to kill us for being here, being us, and not being radical Islamists. The worst possible thing that you could do is sit back and not do anything. That is what was happening from the first terrorist attack up until September 10, 2001!", 
   {}, 
   50138, 
   null, 
   1084658700.0
  ], 
  [
   50160, 
   null, 
   "sglaine", 
   "That's the second dumbest thing I've ever heard! No one wants to be in a war. I suppose that you don't see that the terrorists want to kill us. It has nothing to do with us attacking them. They want to kill us for being here, being us, and not being radical Islamists. The worst possible thing that you could do is sit back and not do anything. That is what was happening from the first terrorist attack up until September 10, 2001!\n\n Well pal this is the 4th dumbist thing I ever heard you say. Were in the **** do you get off on me like that for. Let me tell The end is near with all of these Yahoos in office that keep adding fuel to the fire. No I dont expect us to sit back and take it. Here is the deal we did not need to go to Iraq. And yes Bush did want a war even before he got in office. Afghan yes I could see us over there I supported it a 100%. But Iraq no all because Bush sr did not do the job the first time does not give us the right to go there and start shooting up the town come on now. You must have checks and balances here and that is something that our government has not learned yet. Because of the U.S actions we are going to pay some day for them. They way you go off pal you sound like you are perfect or something. And as long as we have XXXXXX in office this world can self destuct. emoticon_rolleyes", 
   {}, 
   50148, 
   null, 
   1084664520.0
  ], 
  [
   50376, 
   null, 
   "Valthonis", 
   "But Iraq no all because Bush sr did not do the job the first time does not give us the right to go there and start shooting up the town come on now \n\n \n You said that Bush sr did not do his job correctly before. That does give us the right. We needed to complete what we started. And from what I can tell fro the way you are saying things, am I to assume that you hate all the men over there because they are all \"shooting up towns\". That is pretty disrespectful in my opinion.", 
   {}, 
   50160, 
   null, 
   1084814580.0
  ], 
  [
   50500, 
   null, 
   "unkerpaulie", 
   "this thread sure bounced around from whether life is for good or bad, to whether we have free will, to whether we should be at war...\n \n anyway, getting back to the real topic\n \n i believe that life is what you choose to make it to be, both by your physical actions and by your mental perspective. \n \n look at how perspective changes life as a whole\n \n scenario: say you get caught stealing office supplies and you lose you job.\n \n 1. \"hey, i never liked this job anyway, my boss sucks. ill find something better\"\n 2. \"hmmm... I got to be smarter when i steal office supplies so next time i wont get caught\"\n 3. \"man, my life was heading down the wrong path. i need to stop stealing and get myself in order\"\n 4. \"noooo! you think you can fire me???? i'll come back in here on monday and kill everybody then kill myself!\"\n \n whether losing your job is a good thing or a bad thing (as well as most everything in life) always comes down to your own perspective and the actions you choose to commit as a result\n \n thats my philosophy anyway", 
   {}, 
   50376, 
   null, 
   1084833120.0
  ], 
  [
   68428, 
   null, 
   "faeden", 
   "this thread sure bounced around from whether life is for good or bad, to whether we have free will, to whether we should be at war...\n \n anyway, getting back to the real topic\n \n i believe that life is what you choose to make it to be, both by your physical actions and by your mental perspective. \n \n look at how perspective changes life as a whole\n \n scenario: say you get caught stealing office supplies and you lose you job.\n \n 1. \"hey, i never liked this job anyway, my boss sucks. ill find something better\"\n 2. \"hmmm... I got to be smarter when i steal office supplies so next time i wont get caught\"\n 3. \"man, my life was heading down the wrong path. i need to stop stealing and get myself in order\"\n 4. \"noooo! you think you can fire me???? i'll come back in here on monday and kill everybody then kill myself!\"\n \n whether losing your job is a good thing or a bad thing (as well as most everything in life) always comes down to your own perspective and the actions you choose to commit as a result\n \n thats my philosophy anyway\n\n \n \n I like your example.... I believe that my degree of success and/or happiness is mostly a result of how I cope with life's ups and downs. I now realize that one of the only things that I can control is how I choose to REACT to things. By keeping an attitude of gratitude (= positive perspective a.k.a. glass is half full) I can - and do - handle events in a way that result in a minimum of stress. Obviously, some things can't be viewed through \"rose colored glasses\" all the time; however, since I choose not to concentrate on the negatives of day-to-day life, I can better handle life's true tragedies.\n \n As for your example, I choose to recognize that stealing was a poor choice (not because I got caught, but because the experience did not reenforce my set of values {esteem}) and I recognize that I can learn and grow from the experience. The negative experience becomes a positive one because I know I have gained knowledge/understanding.\n \n **If I do not learn & adapt as a result of a negative experience, then the negative aspects become amplified and (more) regettable. **\n \n regards.....\n \n P. S. Sorry for any spelling misakes (is there a spell checker tool here?)", 
   {
    "post_info": {
     "post_title": "perception and its effects"
    }
   }, 
   50500, 
   null, 
   1096108800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Life", 
  "url": "http://www.4forums.com/political/philosophy-debates/2196-life.html", 
  "breadcrumbs": [
   "Philosophy"
  ], 
  "id_number": 2196, 
  "discussion_files": [
   [
    "14258.html", 
    "http://www.4forums.com/political/philosophy-debates/2196-life-print.html"
   ], 
   [
    "14259.html", 
    "http://www.4forums.com/political/philosophy-debates/2196-life-3-print.html"
   ], 
   [
    "14260.html", 
    "http://www.4forums.com/political/philosophy-debates/2196-life-2-print.html"
   ]
  ], 
  "identifier": 2196
 }
]