[
 [
  [
   44456, 
   null, 
   "triplestandard2", 
   "It is common for children to forget about what they were fighting about while they are fighting. \n \n Has everyone forgotten about what the Israeli-\"Jews\" and the Palestinian-\"Muslims\" were fighting for?\n \n Some Muslims kill Jews just because they're Jewish. Some Muslims kill Jews to stand out and say Hey we're still here.\n \n Some Jews kill Muslims because they're Muslims. Some Israelis, political leaders especially, don't see the Palestinians as people. Some Israelis, kill Muslims because they think they're trying to take over their land.\n \n Are they fighting a political or a religious war? What do you think of it? Opinions welcome.", 
   {
    "post_info": {
     "post_title": "A Religious War or a Political War?"
    }
   }, 
   null, 
   null, 
   1082261580.0
  ], 
  [
   44465, 
   null, 
   "faeden", 
   "Hi trip,\n \n I believe that most of those involved are motivated by what the other side has done most recently. Why 'it' was done (motivation for the most recent event) does not seem to be considered. Revenge seems to be the order of the day....\n \n I wonder, do the Isralies or Palestininans have a realistic goal (or idea) for what peace between the two might be like?\n \n I think that many people the world over have no idea WHY they believe what they believe!", 
   {
    "post_info": {
     "post_title": "short memories"
    }
   }, 
   44456, 
   null, 
   1082269980.0
  ], 
  [
   44488, 
   null, 
   "AMD4EVER", 
   "Are they fighting a political or a religious war? What do you think of it? Opinions welcome.\n\n \n I think that they are fighting because it has been going on for so long they cannot quit. Israel won't allow the Muslims to win and the Muslims won't allow the Jews to win. As it stands right now the Israelis would be the winners in the eyes of the Muslims so they cannot go through with any peace agreement. So I would say this is a war of pride for each religion.", 
   {}, 
   44456, 
   null, 
   1082308200.0
  ], 
  [
   44510, 
   null, 
   "plotter", 
   "Im neither pallestinian nor jew, but in this war if i was one or the other i could easily fight.\n \n What i mean is, a pallestinian fights for the right to govern himself and to achieve his identity, which he might believe the jewish israelis have taken from him, so its understandable why palestinians may hate and fight jews.\n \n On the other hand a jewish israeli may fear pallestinians are trying to take whats his, and so a jew may hate and fight pallestinians. Is this hate religious based? maybe its an easy line to draw between the two sides.\n \n I dont think an opressed or occupied people care what religion the other side is.", 
   {}, 
   44488, 
   null, 
   1082326560.0
  ], 
  [
   44558, 
   null, 
   "Ghost", 
   "Going back some 50-60 years, I don't think it was right to have Israel created on top of the Palestinian state and to force the Palestinians out. Israel shouldn't have been created, not like that at least...but now, that's a moot point. The Palestinians have legitimate gripes, but so do the Israelis. They Israelis are there now, and they're settled, you can't just kick them out. At the core of this, I think both sides have entirely legitimate cases, but I think that for the majority of Israelis and Palestinians, all they really care about is hostility towards the other side.\n \n I don't think it's a religious war as much as it is a cultural war...or maybe just a revenge war?", 
   {}, 
   44510, 
   null, 
   1082357160.0
  ], 
  [
   44663, 
   null, 
   "Toukalos", 
   "Going back some 50-60 years, I don't think it was right to have Israel created on top of the Palestinian state and to force the Palestinians out. Israel shouldn't have been created, not like that at least...but now, that's a moot point. The Palestinians have legitimate gripes, but so do the Israelis. They Israelis are there now, and they're settled, you can't just kick them out. At the core of this, I think both sides have entirely legitimate cases, but I think that for the majority of Israelis and Palestinians, all they really care about is hostility towards the other side.\n \n I don't think it's a religious war as much as it is a cultural war...or maybe just a revenge war?\n\n \n I agree with you for the most part, but just to be accurate there never was a true Palestinian \"state\" by international standards...however this does not justify the expulsion and occupation of a whole people and their lands...", 
   {}, 
   44558, 
   null, 
   1082409060.0
  ], 
  [
   44690, 
   null, 
   "daewoo", 
   "Going back some 50-60 years, I don't think it was right to have Israel created on top of the Palestinian state and to force the Palestinians out. Israel shouldn't have been created, not like that at least...but now, that's a moot point. The Palestinians have legitimate gripes, but so do the Israelis. They Israelis are there now, and they're settled, you can't just kick them out. At the core of this, I think both sides have entirely legitimate cases, but I think that for the majority of Israelis and Palestinians, all they really care about is hostility towards the other side.\n \n I don't think it's a religious war as much as it is a cultural war...or maybe just a revenge war?\n\n \n I think at this point you may be right. Both sides have legitimate gripes, and both sides behave reprehensibly. It is a bad situation all around. I persoanlyl think the Isralis should withdraw from the occupied teritories. If, after they did this, they were still attacked, then they would have cause to get in there and really get to business, and they would enjoy some international support as well. INstead, both sides attack,which feeds counter attacks, which feeds the fire and you get even more attacks. \n \n I realsie the isralies don;t want to look weak, but the time comes that you have to decide how many civilian casualties are acceptable.", 
   {}, 
   44558, 
   null, 
   1082417940.0
  ], 
  [
   44825, 
   null, 
   "Ghost", 
   "Thanks for clarifying that, Toukalos.\n \n Wow, me and Daewoo agree...first time for everything, huh? ;) \n \n But I really do think that they need to compromise. The Palestinians aren't going anywhere, and neither are the Israelis. That, to me, means that both sides are going to have to give in a little bit. Someone has to step out of the cycle of revenge for there to be any hope.", 
   {}, 
   44690, 
   null, 
   1082496000.0
  ], 
  [
   44930, 
   null, 
   "Aries", 
   " Are they fighting a political or a religious war? What do you think of it? Opinions welcome.\n\n \n Here is a decent example. Back in the time of the roman empire, when gladiators and soldiers were put to death or spared, a thumbs up meant death and a thumbs down meant life. The way this was inverted was during the french renaissance movements, an artist painted a satirical piece pointing out the irony of a thumbs up and someone living. Thus our entire generation believes thumbs up goes hand in had with good. We dont know why is means good, we dont know its past, but it is that way still because so many people believe in it and practice it.", 
   {}, 
   44456, 
   null, 
   1082527740.0
  ], 
  [
   58257, 
   null, 
   ".Uniform.", 
   "Both... Extremists in some of these terrorists groups think they are doing jihad and pleasing things in thier god's eyes... you can see that by just watching the news. For Americans mainly this is political. We think \"Lets prove to the world that they better not screw with us...\", and Bush I believe thinks this war might score him some votes in the next election... and it very well might.", 
   {}, 
   44930, 
   null, 
   1089933000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A Religious War or a Political War?", 
  "url": "http://www.4forums.com/political/peace-middle-east/2198-religious-war-political-war.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 2198, 
  "discussion_files": [
   [
    "3149.html", 
    "http://www.4forums.com/political/peace-middle-east/2198-religious-war-political-war-print.html"
   ]
  ], 
  "identifier": 2198
 }
]