[
 [
  [
   44633, 
   null, 
   "jim's trucking", 
   "How 9-11 happened \n http://wwwNewsAndOpinion.com\n \n http://wwwNewsAndOpinion.com\n \n We don't need a \"commission\" to find out how 9-11 happened. The truth is in the timeline: \n \n PRESIDENT CARTER, DEMOCRAT \n \n In 1979, President Jimmy Carter allowed the Shah of Iran to be deposed by a mob of Islamic fanatics. A few months later, Muslims stormed the U.S. Embassy in Iran and took American Embassy staff hostage. \n \n \n Carter retaliated by canceling Iranian visas. He eventually ordered a disastrous and humiliating rescue attempt, crashing helicopters in the desert. \n \n PRESIDENT REAGAN, REPUBLICAN \n \n The day of Reagan's inauguration, the hostages were released. \n \n \n In 1982, the U.S. Embassy in Beirut was bombed by Muslim extremists. \n \n \n President Reagan sent U.S. Marines to Beirut. \n \n \n In 1983, the U.S. Marine barracks in Beirut were blown up by Muslim extremists. \n \n \n Reagan said the U.S. would not surrender, but Democrats threw a hissy fit, introducing a resolution demanding that our troops be withdrawn. Reagan caved in to Democrat caterwauling in an election year and withdrew our troops - bombing Syrian-controlled areas on the way out. Democrats complained about that, too. \n \n \n In 1985 an Italian cruise ship, the Achille Lauro, was seized and a 69-year-old American was shot and thrown overboard by Muslim extremists. \n \n \n Reagan ordered a heart-stopping mission to capture the hijackers after \"the allies\" promised them safe passage. In a daring operation, American fighter pilots captured the hijackers and turned them over to the Italians - who then released them to safe harbor in Iraq. \n \n \n On April 5, 1986, a West Berlin discotheque frequented by U.S. servicemen was bombed by Muslim extremists from the Libyan Embassy in East Berlin, killing an American. \n \n \n Ten days later, Reagan bombed Libya, despite our dear ally France refusing the use of their airspace. Americans bombed Qaddafi's residence, killing his daughter, and dropped a bomb on the French Embassy \"by mistake.\" \n \n \n Reagan also stoked a long, bloody war between heinous regimes in Iran and Iraq. All this was while winning a final victory over Soviet totalitarianism. \n \n PRESIDENT BUSH I, MODERATE REPUBLICAN \n \n \n President-elect George Bush claimed he would continue Reagan's policy of retaliating against terrorism, but did not. Without Reagan to gin her up, even Prime Minister Margaret Thatcher went wobbly, saying there would be no revenge for the bombing. \n \n \n In 1990, Saddam Hussein invaded Kuwait. \n \n \n In early 1991, Bush went to war with Iraq. A majority of Democrats opposed the war, and later complained that Bush didn't \"finish off the job\" with Saddam. \n \n PRESIDENT BILL CLINTON, DEMOCRAT \n \n In February 1993, the World Trade Center was bombed by Muslim fanatics, killing five people and injuring hundreds. \n \n \n Clinton, advised by Dick Clarke, did nothing. \n \n \n In October 1993, 18 American troops were killed in a savage firefight in Somalia. The body of one American was dragged through the streets of Mogadishu as the Somalian hordes cheered. \n \n \n Clinton responded by calling off the hunt for Mohammed Farrah Aidid and ordering our troops home. Osama bin Laden later told ABC News: \"The youth ... realized more than before that the American soldier was a paper tiger and after a few blows ran in defeat.\" \n \n \n In November 1995, five Americans were killed and 30 wounded by a car bomb in Saudi Arabia set by Muslim extremists. \n \n \n Clinton, advised by Dick Clarke, did nothing. \n \n \n In June 1996, a U.S. Air Force housing complex in Saudi Arabia was bombed by Muslim extremists. \n \n \n Clinton, advised by Dick Clarke, did nothing. \n \n \n Months later, Saddam attacked the Kurdish-controlled city of Erbil. \n \n \n Clinton, advised by Dick Clarke, lobbed some bombs into Iraq hundreds of miles from Saddam's forces. \n \n \n In November 1997, Iraq refused to allow U.N. weapons inspections to do their jobs and threatened to shoot down a U.S. U-2 spy plane. \n \n \n Clinton, advised by Dick Clarke, did nothing. \n \n \n In February 1998, Clinton threatened to bomb Iraq, but called it off when the United Nations said no. \n \n \n On Aug. 7, 1998, U.S. embassies in Kenya and Tanzania were bombed by Muslim extremists. \n \n \n Clinton, advised by Dick Clarke, did nothing. \n \n \n On Aug. 20, Monica Lewinsky appeared for the second time to testify before the grand jury. \n \n \n Clinton responded by bombing Afghanistan and Sudan, severely damaging a camel and an aspirin factory. \n \n \n On Dec. 16, the House of Representatives prepared to impeach Clinton the next day. \n \n \n Clinton retaliated by ordering major air strikes against Iraq, described by The New York Times as \"by far the largest military action in Iraq since the end of the Gulf War in 1991.\" \n \n \n The only time Clinton decided to go to war with anyone in the vicinity of Muslim fanatics was in 1999 - when Clinton attacked Serbians who were fighting Islamic fanatics. \n \n \n In October 2000, our warship, the USS Cole, was attacked by Muslim extremists. \n \n \n Clinton, advised by Dick Clarke, did nothing. \n \n \n \n PRESIDENT GEORGE BUSH, REPUBLICAN \n \n Bush came into office telling his national security adviser, Condoleezza Rice, he was \"tired of swatting flies\" - he wanted to eliminate al-Qaida. \n \n \n On Sept. 11, 2001, when Bush had been in office for barely seven months, 3,000 Americans were murdered in a savage terrorist attack on U.S. soil by Muslim extremists. \n \n \n Since then, Bush has won two wars against countries that harbored Muslim fanatics, captured Saddam Hussein, immobilized Osama bin Laden, destroyed al-Qaida's base, and begun to create the only functioning democracy in the Middle East other than Israel. Democrats opposed it all - except their phony support for war with Afghanistan, which they immediately complained about and said would be a Vietnam quagmire. And now they claim to be outraged that in the months before 9-11, Bush did not do everything Democrats opposed doing after 9-11. \n \n \n What a surprise.", 
   {
    "post_info": {
     "post_title": "How 9-11 happened...."
    }
   }, 
   null, 
   null, 
   1082400600.0
  ], 
  [
   44644, 
   null, 
   "Phunting", 
   "Oh come on, please. You know full well the whole issue is so much more complicated than 'all democrats are pathetic cowardly XXXXXX and all republicans are heroic patriots trying to save the world', which seems the point all that was trying to make. \n \n If you really want to look into the origins, why are you using such blatantly biased and aggressive 'information'?\n \n And yes, we do need a commission. It is only right that an issue of this controversy is investigated, if only to show that the right thing was done.", 
   {}, 
   44633, 
   null, 
   1082402880.0
  ], 
  [
   44647, 
   null, 
   "jim's trucking", 
   "Oh come on, please. You know full well the whole issue is so much more complicated than 'all democrats are pathetic cowardly XXXXXX and all republicans are heroic patriots trying to save the world', which seems the point all that was trying to make. \n \n If you really want to look into the origins, why are you using such blatantly biased and aggressive 'information'?\n \n And yes, we do need a commission. It is only right that an issue of this controversy is investigated, if only to show that the right thing was done.\n\n \n It's not far from the truth as I see it.\n \n Aren't most sources arguing a point blantantly biased? What's wrong with being aggressive? Look at Richard Clarke and Bob Woodward, two of the most biased and aggressive liars I can think of.\n \n The right things were not done. That's the problem.\n \n I agree we need the commission to expose the truth to the public, but the obvious attempts of the Bush-whackers have been to cover up the background that was laid down for years before Bush got to his post. They're trying to make it sound as if Bush's being on vacation in August is a reason to say he could have prevented it had he been in his office.\n \n ...and they want to excuse the role of that liberal atty general Gorelick.\n \n The foundation for the action was laid by history, all of which is important, not just the immediately preceding 7 months.", 
   {}, 
   44644, 
   null, 
   1082403660.0
  ], 
  [
   44656, 
   null, 
   "Eddie", 
   "I think you missed a couple of important events:\n \n Iran \n 1953: (Eisenhower - Republican) \n In a joint operation brittish and american inteligence agencies, deposed the pupular and nationalistic Iranian ruler Mosaddegh and propped up a murderous dictator named Reza Pahlevi (also known as the \"american Sha\"). Mysterious deaths, random arrests and tortures became incresingly common under Reza Pahlevi`s rule.\n \n 1978-1979 (Carter - Democrat)\n The \"american Sha\" was overthrown by a popular revolution based on conservative ideals (not a mob of islamistic fanatics). \n \n \n Iraq (Reagan - Republican)\n First supporting Iraq in the Iran-Iraq conflict by officially levelling an arms embargo against Iran without taking any actions towards Iraqi arm purchase. In 1988 the Iraqi government found out that USA had been secretly selling weapons to Iran (no doubt infuriating Saddam Hussein).\n \n Afghanistan (Carter - Democrat and Reagan - Republican)\n Supported the feudalistic and fundamentalistic counter-revolution of the Talibans in 1980. In 1979 an internal revolution backed up by Soviet military had suceeded in ousting the feudalistic and fundamentalistic regime and installed a regime that had the ambition to modernize afghanistan (very similiar to what the US led coalition of occupants are doing at the moment). Some argue that US acted after the Soviet intervention, other have pointed out that CIA officers where in place allready before the Soviet intervention and that the US used Afghanistan as a pawn to lure Soviet military into the conflict. 3 billion US dollars was spent to create the fundamentalistic forces of the Talliban A side effect of all of this was, as we all know, the support of the terrorist leader Osama Bin Laden\n \n (Reagan, Bush SR, Clinton and Bush JR -Republicans and Democrat)\n But it did not end there. US continued to collaborate with the Tallibans through the Pakistani intel organisation ISI. As late as march 2001 US officials in the UN refused to agree to the Russian proposition to create an effective weapons embargo towards Afghanistan (US refused to any sanctions towards non-compliance).\n \n And to clarify. The hostages was freed because all the demands of the Iranian terroists had been met. Not because they somehow feared Reagan (if that was what you where getting at). I also disagree that was Reagan can claim credit for the demise of the totalitarian Soviet union. I think there is a thread about this somewhere on this forum.", 
   {}, 
   44633, 
   null, 
   1082406540.0
  ], 
  [
   44753, 
   null, 
   "Phunting", 
   "Aren't most sources arguing a point blantantly biased?\nThere's biased and there's biased. Sure most things are to some extent, but when every single item in that 'history' had been selected and worded with the sole purpose of making the Reps look good and the Dems look bad I don't think it can be counted as acceptably biased.\n \n \n \nI agree we need the commission to expose the truth to the public, but the obvious attempts of the Bush-whackers have been to cover up the background that was laid down for years before Bush got to his post. They're trying to make it sound as if Bush's being on vacation in August is a reason to say he could have prevented it had he been in his office.\n \n ...and they want to excuse the role of that liberal atty general Gorelick.\n \n The foundation for the action was laid by history, all of which is important, not just the immediately preceding 7 months.\nI totally agree with you, I just wish you wouldn't do it in such a manner. By making your argument look like it's sole purpose is to attack the democrats, instead of bringing factual evidence to light, all it does is discredit the argument.", 
   {
    "unicode_changes_made": true
   }, 
   44647, 
   null, 
   1082462160.0
  ], 
  [
   44759, 
   null, 
   "plotter", 
   "Jims trucking, thats an interesting name.\n \n Well, i have to agree with phunting and eddie on this one, you are being a bit too biased and selective on putting the blame on someone else other than the bush government.\n \n Obviously your very pro republican and i think your blinkering yourself by not really examining the evidence in a unbiased way, much was said by people with inside knowledge that bush ignored warnings and instead diverted valuable manpower and resources of the intellegence agencies towards iraq. \n \n Wouldnt you really want to know the truth, you wont find the truth with such a biased view, just because there democrats, or they dont agree with bush or republican ideas doesnt mean there wrong.\n \n Theres one little detail you over looked, americas somewhat immoral and dubious support of israel, that also fuels anti american hate in the arab world.", 
   {}, 
   44753, 
   null, 
   1082470020.0
  ], 
  [
   44798, 
   null, 
   "jim's trucking", 
   "Jims trucking, thats an interesting name.\n \n Well, i have to agree with phunting and eddie on this one, you are being a bit too biased and selective on putting the blame on someone else other than the bush government.\n \n Obviously your very pro republican and i think your blinkering yourself by not really examining the evidence in a unbiased way, much was said by people with inside knowledge that bush ignored warnings and instead diverted valuable manpower and resources of the intellegence agencies towards iraq. \n \n Wouldnt you really want to know the truth, you wont find the truth with such a biased view, just because there democrats, or they dont agree with bush or republican ideas doesnt mean there wrong.\n \n Theres one little detail you over looked, americas somewhat immoral and dubious support of israel, that also fuels anti american hate in the arab world.\n\n \n I consider our support of Israel to be neither immoral nor dubious. Israel has a right to exist and to defend itself against all comers. It also has the same right that the USA is now taking advantage of in seeking out and killing terrorists. More power to them!\n \n I'm sorry the links didn't work in my first post, but you surely must understand that I am not the author of the article. I agree that it is biased as are most political articles on the topic of \"who do we blame for 9-11\". It does point out many errors of omission on the part of preceding administrations, especially Clinton's. That is the driving point of the article.\n \n I don't know that we should go as far back as Eisenhower in setting this situation up.\n \n I certainly want to know the truth, but we'll never get to it while sitting commissioners should be on the other side of the table answering questions instead of leading the general public toward a false conclusion in their obvious attempt to blame Bush.", 
   {}, 
   44759, 
   null, 
   1082487000.0
  ], 
  [
   44800, 
   null, 
   "Waxy", 
   "You say you want the truth, and yet, you can't seem to handle the truth.\n \n Any \"fact/info\" not given to you directly by the Bush administration is immediately dismissed as Democratic bull puckey or outright lies. \n \n When party affiliation becomes the basis of determining truth and right and wrong, no actual truth will ever be attained. There's nothing more effective at obscuring the truth than partisan political blinders.\n \n Waxy", 
   {}, 
   44798, 
   null, 
   1082487600.0
  ], 
  [
   44805, 
   null, 
   "Phunting", 
   "I consider our support of Israel to be neither immoral nor dubious. Israel has a right to exist and to defend itself against all comers. It also has the same right that the USA is now taking advantage of in seeking out and killing terrorists. More power to them!\nUS support is both. \n \n Israel has constantly flouted UN regulations. It continues to illegally occupy East Jerusalem after it's annexation, it regularly carries out construction of Jewish-only settlements, deportations, demolition of homes, collective punishment and seizure of private property against the Geneva convention. All of these resolutions were passed with US backing or abstention yet are still being flouted. \n \n The US has also agreed to help fund Israel's construction of Jewish-only \"bypass roads\" to connect the illegal settlements with Israel puts in violation of Article 7 of Resolution 465, which prohibits member states from facilitating Israel's colonisation drive. \n \n The US backed Israeli peace offers consistently propose Israel to annex large swaths of land in the West Bank, control of most of Arab East Jerusalem and its environs, maintain most of the illegal settlements in a pattern that would have divided the West Bank into non-contiguous cantons, and deny Palestinian refugees the right of return. The US has been consistently unwilling to join with international opinion in calling for a compromise, instead putting continued pressure on Palestine to recede to Israel's demands.\n \n The US has constantly sided with Israel in blaming Palestine for all terrorism despite the vast majority of International government, as well as reputable human rights movements saying that the bulk of the violence has come from Israeli occupation forces and settlers. \n \n This is not Israel 'defending itself from all comers', it is the repeated invasion and occupation of territory and the flouting of international law, UN regulations, human rights and the Geneva convention. All with US backing and continued aid. If that's not immoral and dubious, please tell me what is?", 
   {}, 
   44798, 
   null, 
   1082488680.0
  ], 
  [
   44831, 
   null, 
   "Toukalos", 
   "US support is both. \n \n Israel has constantly flouted UN regulations. It continues to illegally occupy East Jerusalem after it's annexation, it regularly carries out construction of Jewish-only settlements, deportations, demolition of homes, collective punishment and seizure of private property against the Geneva convention. All of these resolutions were passed with US backing or abstention yet are still being flouted. \n \n The US has also agreed to help fund Israel's construction of Jewish-only \"bypass roads\" to connect the illegal settlements with Israel puts in violation of Article 7 of Resolution 465, which prohibits member states from facilitating Israel's colonisation drive. \n \n The US backed Israeli peace offers consistently propose Israel to annex large swaths of land in the West Bank, control of most of Arab East Jerusalem and its environs, maintain most of the illegal settlements in a pattern that would have divided the West Bank into non-contiguous cantons, and deny Palestinian refugees the right of return. The US has been consistently unwilling to join with international opinion in calling for a compromise, instead putting continued pressure on Palestine to recede to Israel's demands.\n \n The US has constantly sided with Israel in blaming Palestine for all terrorism despite the vast majority of International government, as well as reputable human rights movements saying that the bulk of the violence has come from Israeli occupation forces and settlers. \n \n This is not Israel 'defending itself from all comers', it is the repeated invasion and occupation of territory and the flouting of international law, UN regulations, human rights and the Geneva convention. All with US backing and continued aid. If that's not immoral and dubious, please tell me what is?\n\n \n good post!", 
   {}, 
   44805, 
   null, 
   1082497200.0
  ], 
  [
   44851, 
   null, 
   "jim's trucking", 
   "US support is both. \n \n Israel has constantly flouted UN regulations. It continues to illegally occupy East Jerusalem after it's annexation, it regularly carries out construction of Jewish-only settlements, deportations, demolition of homes, collective punishment and seizure of private property against the Geneva convention. All of these resolutions were passed with US backing or abstention yet are still being flouted. \n \n The US has also agreed to help fund Israel's construction of Jewish-only \"bypass roads\" to connect the illegal settlements with Israel puts in violation of Article 7 of Resolution 465, which prohibits member states from facilitating Israel's colonisation drive. \n \n The US backed Israeli peace offers consistently propose Israel to annex large swaths of land in the West Bank, control of most of Arab East Jerusalem and its environs, maintain most of the illegal settlements in a pattern that would have divided the West Bank into non-contiguous cantons, and deny Palestinian refugees the right of return. The US has been consistently unwilling to join with international opinion in calling for a compromise, instead putting continued pressure on Palestine to recede to Israel's demands.\n \n The US has constantly sided with Israel in blaming Palestine for all terrorism despite the vast majority of International government, as well as reputable human rights movements saying that the bulk of the violence has come from Israeli occupation forces and settlers. \n \n This is not Israel 'defending itself from all comers', it is the repeated invasion and occupation of territory and the flouting of international law, UN regulations, human rights and the Geneva convention. All with US backing and continued aid. If that's not immoral and dubious, please tell me what is?\n\n \n I support Israel. The UN is not always right. Israel deserves the spoils of war and whatever they can hold on to that already belonged to it.\n \n I don't disagree that violence has come from both sides, but I haven't been exposed to any proof that Israel has been using terrorist tactics such as suicide bombers and attacks on totally innocent crowds. Israel's targets have mainly been the terrorists and their camps...and they don't strap bombs to kids and send them off to school.\n \n Yasser Arafat is a pig in Arab clothing!", 
   {}, 
   44805, 
   null, 
   1082500740.0
  ], 
  [
   44852, 
   null, 
   "Haulingboat", 
   "Why are all of you having such a hard time asigning blame for 9/11. IT WAS OSAMA BIN LADEN. Not Bush, not Carter, not Reagan.", 
   {}, 
   44831, 
   null, 
   1082501220.0
  ], 
  [
   44854, 
   null, 
   "jim's trucking", 
   "Why are all of you having such a hard time asigning blame for 9/11. IT WAS OSAMA BIN LADEN. Not Bush, not Carter, not Reagan.\n\n \n Quite so, as President Bush pointed out in his speech. However, the political tone of the \"inquisition\" is to point fingers in this election year rather than find where the overall system failures were.\n \n It also has little to do with Israel.", 
   {}, 
   44852, 
   null, 
   1082501460.0
  ], 
  [
   44855, 
   null, 
   "jim's trucking", 
   "When party affiliation becomes the basis of determining truth and right and wrong, no actual truth will ever be attained. There's nothing more effective at obscuring the truth than partisan political blinders.\n \n Waxy\n\n \n This is exactly what is happening with the partisan politics being played by this pitiful excuse for an inquiry we call the 9-11 commission. It's nothing more than election year antics accompanied by the Clarke/Woodward fictional publications attempting to unseat Bush.", 
   {}, 
   44800, 
   null, 
   1082501760.0
  ], 
  [
   44866, 
   null, 
   "emclean", 
   "Why are all of you having such a hard time asigning blame for 9/11. IT WAS OSAMA BIN LADEN. Not Bush, not Carter, not Reagan\n \n \n True, but the idea that if we were hit hard, we would cave come from Somalia. The last time we were hit in a big way, by supprise he hit back, hard. It took the dropping of two atomic bombs to end that sad chapter. Clinton changed that legacy by running.\n \n \nI support Israel. The UN is not always right. Israel deserves the spoils of war and whatever they can hold on to that already belonged to it.\n \n I do not, the UN is not always right, ok but Israel has become the aggressor, parking tanks in the compound of Arafat is not a defensive move.", 
   {}, 
   44855, 
   null, 
   1082505240.0
  ], 
  [
   44876, 
   null, 
   "jim's trucking", 
   "True, but the idea that if we were hit hard, we would cave come from Somalia. The last time we were hit in a big way, by supprise he hit back, hard. It took the dropping of two atomic bombs to end that sad chapter. Clinton changed that legacy by running.\n \n \n I do not, the UN is not always right, ok but Israel has become the aggressor, parking tanks in the compound of Arafat is not a defensive move.\n\n \n Not? If they were not simply containing him, what do you call defense? Do you think defense is simply parking your tanks around your own headquarters and waiting for the next bomb to go off? \n \n Had they not been taunted into the drastic action they took, had the \"peace\" promises of Yassir,-\"I lie a lot with a silly grin on my face\"-Arafat been honored, Israel would not have to pound his hiding place to get his attention. They should have blown his sorry carcass to meet the virgins. You and I both know they could kill the bastard any time they want.", 
   {}, 
   44866, 
   null, 
   1082507940.0
  ], 
  [
   44938, 
   null, 
   "Toukalos", 
   "I support Israel. The UN is not always right. Israel deserves the spoils of war and whatever they can hold on to that already belonged to it.\n \n I don't disagree that violence has come from both sides, but I haven't been exposed to any proof that Israel has been using terrorist tactics such as suicide bombers and attacks on totally innocent crowds. Israel's targets have mainly been the terrorists and their camps...and they don't strap bombs to kids and send them off to school.\n \n Yasser Arafat is a pig in Arab clothing!\n\n \n Terrorism is not limited to suicide bombers, it is all violence against civilians for political, religious, racial, etc. goals. Here is the UN definition of terrorism.\n \n http://www.unodc.org/unodc/terrorism_definitions.html\n \n By the definition both the IDF and the Palestinian resistance groups are guilty of terrorism and Israel has a much higher body count on its record. Other states are also guilty of terror (including us unfortunately) and are not held accountable because of their dominance in the international order. Just because one side wears uniforms and fights with tanks and bombers doesn't make their violence against civilians any more justified.", 
   {}, 
   44851, 
   null, 
   1082540700.0
  ], 
  [
   44952, 
   null, 
   "Phunting", 
   "The UN is not always right.\nYou're correct, it isn't always right. That doesn't mean it is never right. These resolutions were passed with US backing, there have been dubious UN resolutions passed before, these are not amongst them. Israel is violating basic human rights and international law.\n \n \n \nIsrael deserves the spoils of war and whatever they can hold on to that already belonged to it.\nSo any force that occupies land is immediately deserving of that land and should keep it as 'spoils of war'?\n \n \n \nI don't disagree that violence has come from both sides, but I haven't been exposed to any proof that Israel has been using terrorist tactics such as suicide bombers and attacks on totally innocent crowds. Israel's targets have mainly been the terrorists and their camps...and they don't strap bombs to kids and send them off to school.\n \n Yasser Arafat is a pig in Arab clothing!\nIsrael is as guilty of performing terrorist attacks. It is undeniable that it has killed and attacked the innocent to a much greater extent than Palestine.\n \n Just because Palestine uses suicide bombers this does not excuse Israel. Both sides use totally immoral tactics, both should be condemned for this. Yet Israel still benefits from US support.", 
   {}, 
   44851, 
   null, 
   1082550420.0
  ], 
  [
   44953, 
   null, 
   "Eddie", 
   "I don't disagree that violence has come from both sides, but I haven't been exposed to any proof that Israel has been using terrorist tactics such as suicide bombers and attacks on totally innocent crowds. Israel's targets have mainly been the terrorists and their camps...and they don't strap bombs to kids and send them off to school.\n \n\n \n Hmmm.. not quite.\n \n Have a look at these allegations:\n \n http://members.fortunecity.com/911/palestine/jewish-terrorism.htm\n \n Granted, the site might not be un-biased, and there may be some factual wrongs (but I couldn`t find any by skimming the text). I would suggest that you check it out. There are some parts that are undisputed facts.", 
   {}, 
   44851, 
   null, 
   1082552520.0
  ], 
  [
   44972, 
   null, 
   "jim's trucking", 
   "Hmmm.. not quite.\n \n Have a look at these allegations:\n \n http://members.fortunecity.com/911/palestine/jewish-terrorism.htm\n \n Granted, the site might not be un-biased, and there may be some factual wrongs (but I couldn`t find any by skimming the text). I would suggest that you check it out. There are some parts that are undisputed facts.\n\n \n That is interesting and enlightening. It doesn't describe the current situation. What I have seen recently is that Israel targets the terrorists while the terrorists target large crowds.", 
   {}, 
   44953, 
   null, 
   1082561580.0
  ], 
  [
   44987, 
   null, 
   "Eddie", 
   "That is interesting and enlightening. It doesn't describe the current situation. What I have seen recently is that Israel targets the terrorists while the terrorists target large crowds.\n\n \n This is true, and two wrong do not make a right. But I think its quite telling how one change tactics when going from an underdog to the dominating force. If Israelis resorted to terrorist activities when their lifes and existance is threatened, is it so surprising that palestinians do it as well?", 
   {}, 
   44972, 
   null, 
   1082563560.0
  ], 
  [
   44989, 
   null, 
   "faeden", 
   "Has anyone else noticed that there are two different camps of Democrats that attack President Bush?\n \n Some Democrats say that Bush is an idiot and a liar who went to war in Iraq for a reason that didn't exist.\n \n Others say (especially recently) that Bush is some genius who is masterminding the cost of gas with the help of Saudi Arabia and that the war was part of his 'master plan' for world domination.\n \n Right or wrong, I think Bush is honestly doing what he thinks is best for the LONG-TERM interest of the U.S. since 911 (the sixth islamic terrorist attack on our interests in ten years).\n \n Who amoung us can honestly say they could do better? (How?)", 
   {
    "post_info": {
     "post_title": "irony"
    }
   }, 
   44866, 
   null, 
   1082563860.0
  ], 
  [
   44994, 
   null, 
   "jim's trucking", 
   "This is true, and two wrong do not make a right. But I think its quite telling how one change tactics when going from an underdog to the dominating force. If Israelis resorted to terrorist activities when their lifes and existance is threatened, is it so surprising that palestinians do it as well?\n\n \n It is not surprising to hear of terrorism happening anywhere by anyone group or individual. It is sometimes shocking and horrifying, but not really surprising. I contend that it will never stop. Crazed people are born daily.\n \n The only defense is to seek them out and neutralize them either by detention or killing. If they resist capture, they should be killed. Israel is only doing what they consider necessary to diminish the threat.\n \n The atom bombs dropped on Japan killed thousands of innocent people, though they were directed at military targets. There were more lives saved by the stoppage of the war than were killed by the bombs.", 
   {}, 
   44987, 
   null, 
   1082564580.0
  ], 
  [
   44995, 
   null, 
   "Phunting", 
   "Has anyone else noticed that there are two different camps of Democrats that attack President Bush?\n \n Some Democrats say that Bush is an idiot and a liar who went to war in Iraq for a reason that didn't exist.\n \n Others say (especially recently) that Bush is some genius who is masterminding the cost of gas with the help of Saudi Arabia and that the war was part of his 'master plan' for world domination.\nWell I think there are a lot more than just two.\n \n I am a democrat who supports the war (though with a fair amount of skepticism in some parts) but think that Bush is bad for the long term of the country through his attacks on civil liberties.", 
   {}, 
   44989, 
   null, 
   1082564820.0
  ], 
  [
   45310, 
   null, 
   "emclean", 
   "I am a democrat who supports the war (though with a fair amount of skepticism in some parts) but think that Bush is bad for the long term of the country through his attacks on civil liberties.\n \n \n Dose that mean you also support Tony Bliar?\n \n Who controlled the lands that are now Israli in 1940? Who decides if some one is a terrorists or a freedom fighter? There are some fundamental problems in that region that stare from the UN coming in and saying that this land belongs to them now, and revenge issues. There are going to be problems surrounding the religious sites as long as there are religions.\n \n I have said for years that IF we nuked the whole area, they (religious zealots) would fight over the glass.", 
   {}, 
   44995, 
   null, 
   1082655180.0
  ], 
  [
   45311, 
   null, 
   "Phunting", 
   "Dose that mean you also support Tony Bliar?\nI do, and will actually change my vote to him from the Tories next election.", 
   {}, 
   45310, 
   null, 
   1082655480.0
  ], 
  [
   45674, 
   null, 
   "sglaine", 
   "Jims trucking, thats an interesting name.\n \n Well, i have to agree with phunting and eddie on this one, you are being a bit too biased and selective on putting the blame on someone else other than the bush government.\n \n Obviously your very pro republican and i think your blinkering yourself by not really examining the evidence in a unbiased way, much was said by people with inside knowledge that bush ignored warnings and instead diverted valuable manpower and resources of the intellegence agencies towards iraq. \n \n Wouldnt you really want to know the truth, you wont find the truth with such a biased view, just because there democrats, or they dont agree with bush or republican ideas doesnt mean there wrong.\n \n Theres one little detail you over looked, americas somewhat immoral and dubious support of israel, that also fuels anti american hate in the arab world.\n\n Gee I see a pattern here, like Foxnews they are the same too. emoticon_xclown emoticon_xclown", 
   {}, 
   44759, 
   null, 
   1082855100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  How 9-11 happened....", 
  "url": "http://www.4forums.com/political/politics-debates/2204-how-9-11-happened.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2204, 
  "discussion_files": [
   [
    "18408.html", 
    "http://www.4forums.com/political/politics-debates/2204-how-9-11-happened-print.html"
   ], 
   [
    "18409.html", 
    "http://www.4forums.com/political/politics-debates/2204-how-9-11-happened-2-print.html"
   ]
  ], 
  "identifier": 2204
 }
]