[
 [
  [
   44806, 
   null, 
   "rapture", 
   "+\u0002.gpidity of the Bible? Starting With The Genesis\n \n *Locate, photograph & converse with the guardian of Eden, gain entrance and wisdom, before exploring deeply the Garden of Eden, in search of rare plants(medicinal) and of course secrets, the origin, intelligence level, lifestyle..etc of the seemly former intelligent rulers of Earth before humans came(?) on the scene? Explore that era deeply, Pre Human Times? And the parallelism to the present? Purge the area, even looking beneath & within the mysteries of the dimensions of the pyramids? Seemly digging backwards in infinite time...\n \n *Arrive at the other end of the Bermuda Triangle? A little wet, but O.K.\n \n * Walk forward into the paranormal leaving fear behind.\n \n *Explore every nook & cranny/ mystery of Earth then move on[Color=blue]!\n \n \n \n If you had the funds/ ability/ power\" what expedition would you choose\"?", 
   {
    "post_info": {
     "post_title": "A Expedition?"
    }
   }, 
   null, 
   null, 
   1082488920.0
  ], 
  [
   46008, 
   null, 
   "Tastyfish", 
   "Assuming all were possible, why stop at just looking for rare plants in the Garden of Eden, if you had the power why not invade and return the species to its rightful home? If we are going for the incredable crazy ideas, lets go all the way.\n \n Really though I would pick the future, or whatever parallel version quantum physics permts- bring back as much information as possible to try to solve as much of the worlds problems or steer the course of history along the best possible course of action", 
   {}, 
   44806, 
   null, 
   1083032940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A Expedition?", 
  "url": "http://www.4forums.com/political/science-math-debates/2211-expedition.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 2211, 
  "discussion_files": [
   [
    "31747.html", 
    "http://www.4forums.com/political/science-math-debates/2211-expedition-print.html"
   ]
  ], 
  "identifier": 2211
 }
]