[
 [
  [
   45211, 
   null, 
   "georged", 
   "Due to Homeland Security measures, foreign travel into the US is down 30%. Those were new dollars formerly pumped into our economy, not the same old recycled consumer and government debt dollars. According to those in the travel industry, many foreign travelers are saying our airport and visa hassles just aren't worth it. And that report doesn't include the new request of photos and fingerprints upon entry.\n \n Does anyone actually believe our vastly expensive fumbling federal airport doorshaker type security efforts (my shoes, please), foreign entry inconvenience and cute rainbow alert system would stop a dedicated terrorist with two oceans, two huge land borders and virtually unlimited private boat and aircraft entry readily available? What terrorist would be stupid enough to use those well-publicized bottlenecks? To me, it sounds like more 'your government is taking care of you' spin. Your papers pleeze.", 
   {
    "post_info": {
     "post_title": "US Travel industry down by 30%"
    }
   }, 
   null, 
   null, 
   1082599620.0
  ], 
  [
   45219, 
   null, 
   "jskufan", 
   "We have some real consistency issues here. If you arrive to the United States in an airplane, we want to fingerprint you, scan you, X-ray your luggage, and possibly question you. If you are one of the nameless, faceless, illegals that sneak over the border in the dark of night, this administration wants to grant you citizenship and collect taxes from you. Forget the fact that we know nothing about your background or why you really want to be here. Personally, I think we could have solved a large part of our airline security issues simply by locking the cockpit doors. If the would be terrorists can't get control of the aircraft and use the plane as a weapon, it greatly deminishes the magnitude of their attack.", 
   {}, 
   45211, 
   null, 
   1082603220.0
  ], 
  [
   46436, 
   null, 
   "Maineiac", 
   "While 30% sounds like quite a few people,we can't just sit back and let it happen without some sort of security measures.If people don't want to go through the hassle at airports,let them land in Mexico,then walk over and catch a bus or a train.I understand their security measures aren't quite as strict.", 
   {}, 
   45219, 
   null, 
   1083176460.0
  ], 
  [
   46570, 
   null, 
   "georged", 
   "While 30% sounds like quite a few people,we can't just sit back and let it happen without some sort of security measures.If people don't want to go through the hassle at airports,let them land in Mexico,then walk over and catch a bus or a train.I understand their security measures aren't quite as strict.\n\n \n Depends. If you're a country currently supporting US foreign policy, you've probably experienced a similar drop in tourism, with or without increased security measures. And you can expect to eventually be touched by terrorist activities. Not only have our useless, cumbersome airport security measures turned off foreign visitors, I think our foreign policy that generates that terrorism is the primary factor with airport security being a convenient excuse. Who knows if terrorists plan to use a Mexicana Airliner in their next mission and crash it on the approach to say Los Angeles or San Francisco, so the bus wouldn't matter. A majority of the world believes we've made a bad call using our military in an attempt to stabilize one of our oil sources, a former sovereign nation, for the sake of special interests, so we're actually fighting wars on two fronts, Iraq and our economy. As our conventional military might is unquestioned, that leaves our financial flank exposed. We're bleeding heavily from flank wounds in terms of national wealth and a drop in foreign currency revenue from the travel industry (new money, not the same old GDP churned debt) just adds to the losses. There's more to our world situation than what can be solved by waving our flag and expecting all people to bow to our military power. World travelers are also often stock and bond investors.", 
   {}, 
   46436, 
   null, 
   1083197460.0
  ], 
  [
   46576, 
   null, 
   "Eddie", 
   "While 30% sounds like quite a few people,we can't just sit back and let it happen without some sort of security measures.If people don't want to go through the hassle at airports,let them land in Mexico,then walk over and catch a bus or a train.I understand their security measures aren't quite as strict.\n\n \n I think we rather spend our vaccation somewhere else, thank you very much ;)", 
   {}, 
   46436, 
   null, 
   1083198000.0
  ], 
  [
   46586, 
   null, 
   "Maineiac", 
   "I hear what your saying George.I was just spouting off.lol.It's just frustrating that some people don't fully realize what we went through with 9-11,and that those security measures that are in place are for their protection as well as ours.It's also kind of frustrating to know that even the systems that are now in place are still flawed.", 
   {}, 
   46576, 
   null, 
   1083198900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  US Travel industry down by 30%", 
  "url": "http://www.4forums.com/political/current-events-debates/2234-us-travel-industry-down-30-a.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 2234, 
  "discussion_files": [
   [
    "8539.html", 
    "http://www.4forums.com/political/current-events-debates/2234-us-travel-industry-down-30-a-print.html"
   ]
  ], 
  "identifier": 2234
 }
]