[
 [
  [
   45476, 
   null, 
   "sinjin", 
   "How about we define this term since I'm not sure I believe in it. I am primarily Irish by descent and know that when St. Patrick came to Ireland the inhabitants were nearly \"savage\". Surely many of those people never assimilated into the \"civilized\" society forced upon them and died. It seems commonly held now that something about \"whiteness\" makes it possible to exist and succeed in our culture. Am I getting it?", 
   {
    "post_info": {
     "post_title": "What the heck is &quot;white culture&quot;?"
    }
   }, 
   null, 
   null, 
   1082738820.0
  ], 
  [
   45478, 
   null, 
   "Waxy", 
   "I've never heard the term before, where did it come up?\n \n Waxy", 
   {}, 
   45476, 
   null, 
   1082740020.0
  ], 
  [
   45481, 
   null, 
   "sinjin", 
   "mana'ia, a polynesian I assume, and therefore technically a \"white\" guy threw it out for starters in his \"affirmative action\" thread.", 
   {}, 
   45478, 
   null, 
   1082740560.0
  ], 
  [
   45482, 
   null, 
   "Waxy", 
   "mana'ia, a polynesian I assume, and therefore technically a \"white\" guy threw it out for starters in his \"affirmative action\" thread.\n\n \n Oh, I see. emoticon_rolleyes \n \n That's the definition of a meaningless term to me. \n \n Perhaps he can \"define\" it, I know I can't.\n \n Waxy", 
   {}, 
   45481, 
   null, 
   1082740860.0
  ], 
  [
   45860, 
   null, 
   "Big Orn", 
   "White Culture - Being placed in a bracket where only the skin color can be seen. Outside said bracket, you are a just a human being. When in said bracket you are the ruler of the universe, king of all lands, standard of light. You are placed there from time to time to prove to the world that you are better than everyone else. When the point has been made you are ripped from said bracket and thrown into the tumultuous land of pain, fear, doubt and hate&#8230;just like everyone else.\n Ruler of the universe &#8211; You know the origin of the species, the development of planets and their placing, the beginning and ending of time.\n King of all lands &#8211; All that you touch, whether it be with sword or plowshare, you dominate, manipulate, convert, and beat into submission all those who cannot comprehend.\n Standard of Light &#8211; Your very essence is a paradigm. All things must measure up or be cast out into the outer darkness.\n \n Of course, White Culture is a myth and all the above is just a waste of bandwidth.", 
   {}, 
   45482, 
   null, 
   1083000660.0
  ], 
  [
   45886, 
   null, 
   "galton", 
   "White Culture - Being placed in a bracket where only the skin color can be seen. Outside said bracket, you are a just a human being. When in said bracket you are the ruler of the universe, king of all lands, standard of light. You are placed there from time to time to prove to the world that you are better than everyone else. When the point has been made you are ripped from said bracket and thrown into the tumultuous land of pain, fear, doubt and hate...just like everyone else.\n Ruler of the universe - You know the origin of the species, the development of planets and their placing, the beginning and ending of time.\n King of all lands - All that you touch, whether it be with sword or plowshare, you dominate, manipulate, convert, and beat into submission all those who cannot comprehend.\n Standard of Light - Your very essence is a paradigm. All things must measure up or be cast out into the outer darkness.\n \n Of course, White Culture is a myth and all the above is just a waste of bandwidth.\n\n I think I can safely say that this post does not clarify the issue. Culture in its broadest sense means a way of life. If there is a white culture, it would be a way of life that is distinguishable from other groups.", 
   {
    "unicode_changes_made": true
   }, 
   45860, 
   null, 
   1083010020.0
  ], 
  [
   45903, 
   null, 
   "Big Orn", 
   "If there is a white culture, it would be a way of life that is distinguishable from other groups.\n\n Hence the reason for my post. There is no \"White Culture\" that I am aware of.\n \n galton - a little humor never hurts...okay?", 
   {}, 
   45886, 
   null, 
   1083013440.0
  ], 
  [
   45905, 
   null, 
   "galton", 
   "Hence the reason for my post. There is no \"White Culture\" that I am aware of.\n \n galton - a little humor never hurts...okay?\n\n I guess both of our attempts at humor were a little too subtle. Do you mean to say there are no observable differences between whites and others? Seems like blindness or wishful thinking to me to think so.", 
   {}, 
   45903, 
   null, 
   1083013680.0
  ], 
  [
   45910, 
   null, 
   "Big Orn", 
   "I guess both of our attempts at humor were a little too subtle. Do you mean to say there are no observable differences between whites and others? Seems like blindness or wishful thinking to me to think so.\n\n It depends on where you live and what you do, I suppose.\n \n There are mixed colors of people here, mostly black and white, but Latino and Mexican is not far away.\n \n The farmers/ranchers are the same black or white. We do the same things, talk about the same things, gripe about the same things - in general.\n \n The others are distant-like; a more withdrawn, sad-looking lot. There are no rich people here (money-wise).\n \n Sometimes a group of the racists (black and white) fall in off the interstate, but they just hang for awhile, find us boring, working folk, and move on.\n \n There are some interracial marriages, but they also stay to themselves.\n \n All-in-all, we all fall under the canopy of one culture, though, no matter what race.", 
   {}, 
   45905, 
   null, 
   1083014880.0
  ], 
  [
   45935, 
   null, 
   "galton", 
   "It depends on where you live and what you do, I suppose.\n \n There are mixed colors of people here, mostly black and white, but Latino and Mexican is not far away.\n \n The farmers/ranchers are the same black or white. We do the same things, talk about the same things, gripe about the same things - in general.\n \n The others are distant-like; a more withdrawn, sad-looking lot. There are no rich people here (money-wise).\n \n Sometimes a group of the racists (black and white) fall in off the interstate, but they just hang for awhile, find us boring, working folk, and move on.\n \n There are some interracial marriages, but they also stay to themselves.\n \n All-in-all, we all fall under the canopy of one culture, though, no matter what race.\n\n Well, when we talk about \"white culture\" the thing to do is to take a world/historical perspective and see if there are noticeable differences. Taking this view, I would hypothesize that compared to other groups, whites have tended to be more scientific, more innovation-oriented (more anti-tradition), more exploration-oriented, and have valued the individual more than other cultures. \n \n People critical of white cultures say, compared to others, whites are cold; goal-oriented rather than people-oriented; oppressors; that they are belliocose, and are prone to committing genocide. While there are plenty of instances of these negative things, I don't think they are more common among whites than others, but evidence could convince me otherwise. If anything, I think whites have tended to lead the way in humanitarianism.", 
   {}, 
   45910, 
   null, 
   1083018960.0
  ], 
  [
   45961, 
   null, 
   "Big Orn", 
   "It is really not that hard for me to get past that &#8220;White Culture&#8221; misconception. On a creek bank fishing, in a field hunting quail, on the street corner, in a restaurant, or at a ballgame it makes no difference. I am as white as it gets and I know how I will be accepted by those who are not. I know that and am mindful of it always. I can choose to let that misconception (let&#8217;s say that it is real) sway my approach to them or I can ignore it. I choose to ignore it. I shake hands, talk normally &#8211; not like most white folk that want to &#8220;fit in&#8221; at that precise moment by using some slang term, body language, or an accent. It doesn&#8217;t matter what they think of me. If it did I wouldn&#8217;t waste my time or theirs. After a moment of talking, bragging, griping, and the like, I can tell whether this person feels belittled by my color/race or feels comfortable with his/her own. The latter I would prefer, but it&#8217;s not always that way.\n I have been PO&#8217;d by some of the most arrogant, self-centered, but that&#8217;s few and far between. There are those &#8220;rapper&#8221; types (all races, I suppose) that irritate me&#8230;but they irritate my black friends also.", 
   {}, 
   45935, 
   null, 
   1083024420.0
  ], 
  [
   46244, 
   null, 
   "galton", 
   "It is really not that hard for me to get past that \"White Culture\" misconception. On a creek bank fishing, in a field hunting quail, on the street corner, in a restaurant, or at a ballgame it makes no difference. I am as white as it gets and I know how I will be accepted by those who are not. I know that and am mindful of it always. I can choose to let that misconception (let's say that it is real) sway my approach to them or I can ignore it. I choose to ignore it. I shake hands, talk normally - not like most white folk that want to \"fit in\" at that precise moment by using some slang term, body language, or an accent. It doesn't matter what they think of me. If it did I wouldn't waste my time or theirs. After a moment of talking, bragging, griping, and the like, I can tell whether this person feels belittled by my color/race or feels comfortable with his/her own. The latter I would prefer, but it's not always that way.\n I have been PO'd by some of the most arrogant, self-centered, but that's few and far between. There are those \"rapper\" types (all races, I suppose) that irritate me...but they irritate my black friends also.\n\n When most people talk about \"white culture\", it is meant as a put down--it is something that has oppressed minorities, or minorities are made to join, or that it is not cool. The connotation is usually negative. But if they are arguing that there is something real called \"white culture\", well all cultures have postiive qualities as well as negative, so if the culture is a real thing, it must have positive qualities, but we never hear about that.", 
   {
    "unicode_changes_made": true
   }, 
   45961, 
   null, 
   1083106980.0
  ], 
  [
   46257, 
   null, 
   "Big Orn", 
   "When most people talk about \"white culture\", it is meant as a put down--it is something that has oppressed minorities, or minorities are made to join, or that it is not cool. The connotation is usually negative. But if they are arguing that there is something real called \"white culture\", well all cultures have postiive qualities as well as negative, so if the culture is a real thing, it must have positive qualities, but we never hear about that.\n\n I don&#8217;t think it will ever get recognition, do you? I have never believed that anyone should stick to a certain culture when moving from one place to the next. It can lead to problems &#8220;fitting in&#8221;, especially for kids.\n As far as white culture is concerned, if it is a reality to some, it is based on the cultures that people brought with them long ago, which has uncontrollably advanced into what it is today.\n Uncontrolled development can be based on anything, I suppose, but not by a single race. People that tend to believe in a &#8220;white culture&#8221; are those that feel their own is somehow set apart from the rest. Perhaps these people can somehow divide the Western Culture into certain components, but it would be an exhausting if not futile task.", 
   {}, 
   46244, 
   null, 
   1083109260.0
  ], 
  [
   46263, 
   null, 
   "galton", 
   "I don't think it will ever get recognition, do you? I have never believed that anyone should stick to a certain culture when moving from one place to the next. It can lead to problems \"fitting in\", especially for kids.\n As far as white culture is concerned, if it is a reality to some, it is based on the cultures that people brought with them long ago, which has uncontrollably advanced into what it is today.\n Uncontrolled development can be based on anything, I suppose, but not by a single race. People that tend to believe in a \"white culture\" are those that feel their own is somehow set apart from the rest. Perhaps these people can somehow divide the Western Culture into certain components, but it would be an exhausting if not futile task.\n\n I don't think attempting to isolate differences among whites and others is futile. I don't think my attempt in post #10 is a bad first stab.", 
   {
    "unicode_changes_made": true
   }, 
   46257, 
   null, 
   1083109680.0
  ], 
  [
   46274, 
   null, 
   "Big Orn", 
   "I don't think attempting to isolate differences among whites and others is futile. I don't think my attempt in post #10 is a bad first stab.\n\n It will only prolong the inevitable. Soon, like Haulingboat said in another thread, there will be no distinction. And, it will lead to further civil unrest.\n If you had to list the qualities of your culture &#8211; good and bad &#8211; could you? I think we all (those who are established Americans, not the hyphenated variety) would have the same list, fundamentally.\n \n The hyphenated Americans are stubborn anyway, clinging to that other place, that place they left.\n \n BTW &#8211; I am an American, not an Irish-American, and we have not been here that long.", 
   {}, 
   46263, 
   null, 
   1083110700.0
  ], 
  [
   46286, 
   null, 
   "galton", 
   "It will only prolong the inevitable. Soon, like Haulingboat said in another thread, there will be no distinction. And, it will lead to further civil unrest.\n If you had to list the qualities of your culture - good and bad - could you? I think we all (those who are established Americans, not the hyphenated variety) would have the same list, fundamentally.\n \n The hyphenated Americans are stubborn anyway, clinging to that other place, that place they left.\n \n BTW - I am an American, not an Irish-American, and we have not been here that long.\n\n Interesting. In post #10 I gave a few differences for whites, and they seem pretty positive. As for negative, I would say whites might tend to be more eggheadish, less realistic, more idealistic, at least in the realm of human affairs. They may tend to be nerdier, less gregarious (not sure about these last two).", 
   {
    "unicode_changes_made": true
   }, 
   46274, 
   null, 
   1083111900.0
  ], 
  [
   46293, 
   null, 
   "Eddie", 
   "Are you sure you`re not making the misstake of labeling american \"white culture\" as \"white culture\"? I mean, I think its obvious that there are a huge cultural differences between different countries with caucassian population.", 
   {}, 
   46286, 
   null, 
   1083112500.0
  ], 
  [
   46298, 
   null, 
   "galton", 
   "Are you sure you`re not making the misstake of labeling american \"white culture\" as \"white culture\"? I mean, I think its obvious that there are a huge cultural differences between different countries with caucassian population.\n\n Well, you can speak of \"white culture\" at different levels. I have been looking at the issue following the strict meaning of \"white\"--whites are in many countries, not just in the U.S. I think even at my level you can tease out differences from other races, but you are right, people often mean American whites when they say \"white culture\". And the differences between white Americans and other Americans are abundant. I spent 4 years in grad school being taught ALL the ways that racial groups differ dramatically in the U.S. My teachers' point, however, was not to highlight how different the races are; rather, their objective was to show that non-whites are very different from whites because white racism made them so very different.", 
   {}, 
   46293, 
   null, 
   1083112920.0
  ], 
  [
   46306, 
   null, 
   "Eddie", 
   "To be honest, I think the racial issue is a bit weak. Ethnicity would probably serve the purpose better. The racial differences are as I understand it pretty confusing in europe and do not really correlate to cultural differences. The cultural differences are more correlated to geography and historic connections between populations and nations.\n \n If I understand it correctly I`m cultrually very similiar to someone from Finland, racially I`m more similiar to someone from Germany.", 
   {}, 
   46274, 
   null, 
   1083113460.0
  ], 
  [
   46313, 
   null, 
   "galton", 
   "To be honest, I think the racial issue is a bit weak. Ethnicity would probably serve the purpose better. The racial differences are as I understand it pretty confusing in europe and do not really correlate to cultural differences. The cultural differences are more correlated to geography and historic connections between populations and nations.\n \n If I understand it correctly I`m cultrually very similiar to someone from Finland, racially I`m more similiar to someone from Germany.\n\n If you're racilly similar to a German, you are racially similar to a Finn--they are both white. Racial differences among white Europeans are not large at all. \n \n I think both race and ethnicity are realities and you can talk about both. Differences you see between Europeans of different countries are ethnic. Differences you see among whites, black and Asians in the U.S. are racial because we are talking about different races of the same nationality. Trust me, those differences are not weak, they are substantial. As I did above, you can also look to see if there are worldwide racial differences. I think you can identify them as I tried to do.", 
   {}, 
   46306, 
   null, 
   1083115440.0
  ], 
  [
   46368, 
   null, 
   "Eddie", 
   "If you're racilly similar to a German, you are racially similar to a Finn--they are both white. Racial differences among white Europeans are not large at all.\n \n\n \n Ok. I don`t have a clue about these things. I`m just speculating. But I have another question on this topic. How is the racial difference with Samer (indegenous population in scandinavia), Slavs (sp?) and southern europeans/northern europeans,\n \n \nI think both race and ethnicity are realities and you can talk about both. Differences you see between Europeans of different countries are ethnic. Differences you see among whites, black and Asians in the U.S. are racial because we are talking about different races of the same nationality. As I did above, you can also look to see if there are worldwide racial differences. I think you can identify them as I tried to do.\n\n \n I think the problem is that you are trying to apply american \"race-specific\" cultural traits on a whole race. It`s very possible that you might find cultural traits that are different between afro-americans and caucassians in the US. But I`ll doubt you`ll find cultrual traits that are not only different, but also the similliar for ever \"white nation\" in the world. When you for example point out that valuing the individual is a \"white\" cultural trait I think you are only speaking for certain \"white\" cultures. Scandinavians are in this regard quite different from continental europeans. Russians and east europeans are also very different in this regard (allthough towards the other extreme, most probably an effect of the Soviet era). Even historicly, simmilarities seems doubtful. For example In scottland you had clans that where very important, placing the clan over the individual. In scandinavia you also had forms of clans (\"ätter\"). \n \n My poit is that I think you are taking to much on when trying to defne a \"white culture\". I think you will find that there are to many differences among whites to actually find a \"white\" culture that has any value.", 
   {}, 
   46313, 
   null, 
   1083148500.0
  ], 
  [
   46437, 
   null, 
   "Waxy", 
   "Like Eddie, IMHO, cultures are based on ethnicity, geography, economics, and a myriad of other factors, including to a degree, BUT CERTAINLY NOT LIMITED TO, race.\n \n IMHO, the idea of there being a \"white culture\" is ridiculous, just as ridiculous as there being a \"black culture\" or an \"Asian culture\". We can make some very broad generalizations about each, and they are no doubt rooted in some truth, but beyond that, they don't hold up. Especially if you examine the stereotypes outside of the US.\n \n To lump the culture of Scots, Pols, Russians, Swedes, Italians, the French, etc... together as one \"white culture\" is non-sense IMHO. There are greater cultural differences between these groups than there are between blacks and whites living in the US.\n \n \"American culture\" is perhaps more closely what we're discussing.\n \n IMHO, \"white culture\" is nothing more than a buzz word (generally with a negative connotation) used to describe anything and everything \"non-minority\" if you will, and it's meaningless.\n \n Waxy", 
   {}, 
   46368, 
   null, 
   1083176940.0
  ], 
  [
   46510, 
   null, 
   "galton", 
   "Ok. I don`t have a clue about these things. I`m just speculating. But I have another question on this topic. How is the racial difference with Samer (indegenous population in scandinavia), Slavs (sp?) and southern europeans/northern europeans,\n \n\n I am not very familiar with the slight racial diferrences you can find among European group except that I know southern Europeans have a greater proportion of their ancestry from Mediterrean peoples. European racial history is very complicated, but there are many writings on the subject you could look up. \n \n \n \n I think the problem is that you are trying to apply american \"race-specific\" cultural traits on a whole race. It`s very possible that you might find cultural traits that are different between afro-americans and caucassians in the US.\n \n\n It is not very possible that you might find cultural traits that are different between blacks and whites; those differences are WELL documented in social science research. \n \n \n\n But I`ll doubt you`ll find cultrual traits that are not only different, but also the similliar for ever \"white nation\" in the world. When you for example point out that valuing the individual is a \"white\" cultural trait I think you are only speaking for certain \"white\" cultures. Scandinavians are in this regard quite different from continental europeans. Russians and east europeans are also very different in this regard (allthough towards the other extreme, most probably an effect of the Soviet era). Even historicly, simmilarities seems doubtful. For example In scottland you had clans that where very important, placing the clan over the individual. In scandinavia you also had forms of clans (\"ätter\").\n \n My poit is that I think you are taking to much on when trying to defne a \"white culture\". I think you will find that there are to many differences among whites to actually find a \"white\" culture that has any value.\n\n \n [/QUOTE]\n Of course there are many intra-racial differences for all races, but that does not mean you can't isolate world-level racial differences as well. And by the way, I am not implying those cultural differences are caused by genetic differences; they may very well be environmental in origin. \n \n I speculated about differences earlier when I said whites may tend to be more scientific/technological/engineering-oriented than others; they may be more innovation-oriented (less tradition oriented); more prone to explore; place greater emphasis on the individual over the group; and possibly more eggheaded. This is just speculation, but don't you think history shows these differences? Once again, I'm not saying if they were real that they are genetic.", 
   {}, 
   46368, 
   null, 
   1083188160.0
  ], 
  [
   46515, 
   null, 
   "galton", 
   "Like Eddie, IMHO, cultures are based on ethnicity, geography, economics, and a myriad of other factors, including to a degree, BUT CERTAINLY NOT LIMITED TO, race.\n \n IMHO, the idea of there being a \"white culture\" is ridiculous, just as ridiculous as there being a \"black culture\" or an \"Asian culture\". We can make some very broad generalizations about each, and they are no doubt rooted in some truth, but beyond that, they don't hold up. Especially if you examine the stereotypes outside of the US.\n \n To lump the culture of Scots, Pols, Russians, Swedes, Italians, the French, etc... together as one \"white culture\" is non-sense IMHO. There are greater cultural differences between these groups than there are between blacks and whites living in the US.\n \n \"American culture\" is perhaps more closely what we're discussing.\n \n IMHO, \"white culture\" is nothing more than a buzz word (generally with a negative connotation) used to describe anything and everything \"non-minority\" if you will, and it's meaningless.\n \n Waxy\n\n I don' think the concept of white culture is nonsense at all. I think one meaningful way to carve up the history of the world is using concepts like European, traditional Christendom, Western, or alternatively, sub-Saharan African, or Chinese or Arab, etc. I mean the peoples in these categories historically share the same region of the world. Why wouldn't we see similarities among these people living in the same region, and see average differences between one region and the next? You mean to tell me we should expect Danes to be as similar to Australian aboriginese as they are to the English? That sounds like nonsense to me.\n \n I agree with you that \"white culture\" is meaningful in the American context; I also think it is meaningful in the world context as well, in spite of national differences. Do you think a Yanomamo indian in Venezuela thinks the French and Germans have nothing in common?", 
   {}, 
   46437, 
   null, 
   1083188820.0
  ], 
  [
   46517, 
   null, 
   "Eddie", 
   "\n I speculated about differences earlier when I said whites may tend to be more scientific/technological/engineering-oriented than others; they may be more innovation-oriented (less tradition oriented); more prone to explore; place greater emphasis on the individual over the group; and possibly more eggheaded. This is just speculation, but don't you think history shows these differences? \n\n \n I think that you would find more similarities and differences if you looked at certain ethnic, national or even religous groupings. I suspect (allthough I cannot say for sure) that the only racial similarities you will find are trivial at best. As I said in my previous post, the value of the individual is not similliar across europe. As for invention, I think you will find differences between eastern europe and western europe. The same would apply to exploration and view of tradition. I don`t really know what eggheaded is though emoticon_confused ;)\n \n Edit: The real problem with race is that it is such a large grouping. And it is not always geographicly centered.", 
   {}, 
   46510, 
   null, 
   1083189180.0
  ], 
  [
   46531, 
   null, 
   "galton", 
   "I think that you would find more similarities and differences if you looked at certain ethnic, national or even religous groupings. I suspect (allthough I cannot say for sure) that the only racial similarities you will find are trivial at best. As I said in my previous post, the value of the individual is not similliar across europe. As for invention, I think you will find differences between eastern europe and western europe. The same would apply to exploration and view of tradition. I don`t really know what eggheaded is though emoticon_confused ;)\n \n Edit: The real problem with race is that it is such a large grouping. And it is not always geographicly centered and in many of those places where certain racial groups have co-existed alongside other races, the cultural differences have been quite negligable (there are of course expeptions to this as certain groups of gypsies in central europe).\n\n A large grouping is better than a small one for analysis, as long as it is meaningful. Analysts try to boil down the very complex world using categories that bring order to chaos. The broader the concept, the broader its explanatory power. One thing you learn is any theory class is the broader the scope of the theory, the better the theory. \n \n I won't deny that ethnicity is an important concept, but I think the racial idea should be considered more because, for one thing, I never see people considering things in these terms. It is an interesting question, and looking at the sweep of history, I'm not so sure the differences are trivial. \n \n By eggheadism, I am thinking of things like unrealistic idealism and nerdishness. By the way, there may be many other possible differences; my list was just off the top of my nerdish head.", 
   {}, 
   46517, 
   null, 
   1083192480.0
  ], 
  [
   46538, 
   null, 
   "whistler", 
   "Of course there are many intra-racial differences for all races, but that does not mean you can't isolate world-level racial differences as well. And by the way, I am not implying those cultural differences are caused by genetic differences; they may very well be environmental in origin.(emphasis added)\n\n \n \n Are you then suggesting that African Americans in North America constitute a different racial group that Africans still living in Africa?\n \n Or are you obfuscating the issue by throwing in the word cultural?\n \n \n Whistler", 
   {}, 
   46510, 
   null, 
   1083193740.0
  ], 
  [
   46539, 
   null, 
   "sinjin", 
   "Do any of you honestly believe there is one cultural context that anyone from the Orient is able to relate to and prosper in regardless of their specific country or ethnicity? Or maybe more importantly, one cultural context that they could relate to even though they were raised somewhere on the other side of the planet by virtue of their racial identity?\n \n If we are really talking about \"western\" culture then to use the term \"white\" is simply divisive and inflammatory.", 
   {}, 
   46531, 
   null, 
   1083193860.0
  ], 
  [
   46541, 
   null, 
   "Waxy", 
   "I don' think the concept of white culture is nonsense at all. I think one meaningful way to carve up the history of the world is using concepts like European, traditional Christendom, Western, or alternatively, sub-Saharan African, or Chinese or Arab, etc. I mean the peoples in these categories historically share the same region of the world. Why wouldn't we see similarities among these people living in the same region, and see average differences between one region and the next? You mean to tell me we should expect Danes to be as similar to Australian aboriginese as they are to the English? That sounds like nonsense to me.\n \n I agree with you that \"white culture\" is meaningful in the American context; I also think it is meaningful in the world context as well, in spite of national differences. Do you think a Yanomamo indian in Venezuela thinks the French and Germans have nothing in common?\n\n \n I just don't think you can lump all whites into a category any more than you can lump all blacks or Asians. You would find as many differences within each racial group as you would in comparing them to one another. Again, I don't deny there are differences based on race, I just question how valid they are compared to the other factors I listed that I feel truly define a culture.\n \n Are the difference between Danes, Aboriginees and the English racial? Or due to their environments? \n \n How can we expect the cultures of two closely related geoprapically and economic (and even socially and historically blood intermingled) cultures to compare to a culture developed in complete isolation on an island continent? How is race a factor in that at all? Even if Aboriginees were white as snow, their culture would be drastically different.\n \n I don't think your point is valid, at least not using the ethnic groups you used. \n \n I don't think I stated that \"white culture\" is meaningful in the US, if I did, I didn't mean to. I don't feel it is valid in anything but the most superficial of ways.\n \n Waxy", 
   {}, 
   46515, 
   null, 
   1083194280.0
  ], 
  [
   46546, 
   null, 
   "Eddie", 
   "A large grouping is better than a small one for analysis, as long as it is meaningful. Analysts try to boil down the very complex world using categories that bring order to chaos. The broader the concept, the broader its explanatory power. One thing you learn is any theory class is the broader the scope of the theory, the better the theory. \n \n\n \n There is often a trade-off between validity and reliability . And in this case I suspect that you gain very little validity for giving up much reliability ..", 
   {}, 
   46531, 
   null, 
   1083194640.0
  ], 
  [
   46552, 
   null, 
   "galton", 
   "I just don't think you can lump all whites into a category any more than you can lump all blacks or Asians. You would find as many differences within each racial group as you would in comparing them to one another. Again, I don't deny there are differences based on race, I just question how valid they are compared to the other factors I listed that I feel truly define a culture.\n \n Are the difference between Danes, Aboriginees and the English racial? Or due to their environments? \n \n How can we expect the cultures of two closely related geoprapically and economic (and even socially and historically blood intermingled) cultures to compare to a culture developed in complete isolation on an island continent? How is race a factor in that at all? Even if Aboriginees were white as snow, their culture would be drastically different.\n \n I don't think your point is valid, at least not using the ethnic groups you used. \n \n I don't think I stated that \"white culture\" is meaningful in the US, if I did, I didn't mean to. I don't feel it is valid in anything but the most superficial of ways.\n \n Waxy\n\n \n You are confusing race as concept with genetics as a cause of differences. I am not arguing that there are racial differences in the sense that there are white genes causing different behavior. I am saying that if we classify the world in racial categories, it is possible to see in those categoroies differences in behavior, attitude, belief, etc. What the causes of those differences would be--who knows, I am not addressing that here now. \n \n As for cultural differences in the U.S. you are simply mistaken there. You pick ANY important behavior, and chances are there are large racial differences. First one to pop in my head: family instability. Very high for blacks, lower for whites, really low for Asians. I could give examples all day; if you doubt this assertion, I will.", 
   {}, 
   46541, 
   null, 
   1083195120.0
  ], 
  [
   46553, 
   null, 
   "Big Orn", 
   "I don't think I stated that \"white culture\" is meaningful in the US, if I did, I didn't mean to. I don't feel it is valid in anything but the most superficial of ways.\n \n Waxy\n\n No, you said it was a \"buzz word\", which I agree.\n \n Going back a few steps, let me explain what I was talking about earlier. The hyphenated peoples (I think that flourishes in the US because it too is a buzz word) tend to want to break themselves out of a certain mold. This could be due to the advantages and recognition they receive for doing so. Like I said in post #9, we (blacks and whites) in our community are of the same mold, and likewise in many other communities. So, it can&#8217;t be a racial matter because the blacks are no more interested in the hyphen than the whites are. And it can&#8217;t be a &#8220;white culture&#8221; aspect because&#8230;well it&#8217;s not all white.\n I do believe that anyone who feels there is such a thing could be racist.", 
   {}, 
   46546, 
   null, 
   1083195180.0
  ], 
  [
   46557, 
   null, 
   "Waxy", 
   "You are confusing race as concept with genetics as a cause of differences. I am not arguing that there are racial differences in the sense that there are white genes causing different behavior. I am saying that if we classify the world in racial categories, it is possible to see in those categoroies differences in behavior, attitude, belief, etc. What the causes of those differences would be--who knows, I am not addressing that here now. \n \n As for cultural differences in the U.S. you are simply mistaken there. You pick ANY important behavior, and chances are there are large racial differences. First one to pop in my head: family instability. Very high for blacks, lower for whites, really low for Asians. I could give examples all day; if you doubt this assertion, I will.\n\n \n I have no idea what race as a concept vs genetics as a cause of differences means. You lost me in that paragraph. \n \n I'd like to see a list of a few more. I'd like to see if the connection to socio-economic status that I suspect is there follows through.\n \n Waxy", 
   {}, 
   46552, 
   null, 
   1083195540.0
  ], 
  [
   46566, 
   null, 
   "galton", 
   "I have no idea what race as a concept vs genetics as a cause of differences means. You lost me in that paragraph. \n \n I'd like to see a list of a few more. I'd like to see if the connection to socio-economic status that I suspect is there follows through.\n \n Waxy\n\n It seems anytime I write about racial behavioral differences, you interpret that to mean he is saying races tend to behave differently because of different genes. I am claiming no such thing. \n \n As for racial behavioral differences in the U.S., I am NOT saying that they are not due to something like SES. I am only documenting that the behavioral differences exist.\n \n I'll find time for a list later.", 
   {}, 
   46557, 
   null, 
   1083197040.0
  ], 
  [
   46574, 
   null, 
   "Eddie", 
   "It seems anytime I write about racial behavioral differences, you interpret that to mean he is saying races tend to behave differently because of different genes. I am claiming no such thing. \n \n\n \n Well, from my part it has to do with the word \"race\". In my language, race (ras) is not very often used. It is in fact a quite shunned word even in sociological studies. \"Ras\" is refering to biological differences. A \"rasskillnad\" (race difference) is in swedish a genetical difference, not a cultural or social difference.", 
   {}, 
   46566, 
   null, 
   1083197880.0
  ], 
  [
   46581, 
   null, 
   "galton", 
   "Well, from my part it has to do with the word \"race\". In my language, race (ras) is not very often used. It is in fact a quite shunned word even in sociological studies. \"Ras\" is refering to biological differences. A \"rasskillnad\" (race difference) is in swedish a genetical difference, not a cultural or social difference.\n\n Oh I see--the confusion is understandable. English speakers have had that problem with me as well. The concept of race has become increasingly controversial here too.", 
   {}, 
   46574, 
   null, 
   1083198420.0
  ], 
  [
   46582, 
   null, 
   "Waxy", 
   "It seems anytime I write about racial behavioral differences, you interpret that to mean he is saying races tend to behave differently because of different genes. I am claiming no such thing. \n \n As for racial behavioral differences in the U.S., I am NOT saying that they are not due to something like SES. I am only documenting that the behavioral differences exist.\n \n I'll find time for a list later.\n\n \n I assume by he you meant I? Otherwise I've REALLY lost.\n \n I'm not sure how you're separating race from the genes that cause race? So your point is that races act differently, but it has no correlation to the genetics that make races unique biologically?\n \n So you're saying that \"race\"? may not be factor, that it is in fact SES that causes the differences?\n \n Again, I'm lost. Sorry.\n \n Waxy", 
   {}, 
   46566, 
   null, 
   1083198480.0
  ], 
  [
   46583, 
   null, 
   "sinjin", 
   "Well, from my part it has to do with the word \"race\". In my language, race (ras) is not very often used. It is in fact a quite shunned word even in sociological studies. \"Ras\" is refering to biological differences. A \"rasskillnad\" (race difference) is in swedish a genetical difference, not a cultural or social difference.\n\n This is how I understand it also. Hence my original question.", 
   {}, 
   46574, 
   null, 
   1083198600.0
  ], 
  [
   46584, 
   null, 
   "galton", 
   "I assume by he you meant I? Otherwise I've REALLY lost.\n \n I'm not sure how you're separating race from the genes that cause race? So your point is that races act differently, but it has no correlation to the genetics that make races unique biologically?\n \n So you're saying that \"race\"? may not be factor, that it is in fact SES that causes the differences?\n \n Again, I'm lost. Sorry.\n \n Waxy\n\n Actually, I am not interested in this thread about cause. I am interested in whether races act differently or not--the relavent issue when you are discussing whether there is a \"white culture\" or not. The cause of such a culture is a different matter.", 
   {}, 
   46582, 
   null, 
   1083198660.0
  ], 
  [
   50055, 
   null, 
   "mana'ia", 
   "This is what I condier the problem with \"white culture\" in America. They think they're views, traditions, protocols, and customs are the \"american\" way. That is what is what makes the idea of intolerance so unbelieveable. I'm all about learning english btu i dont' agree wiht abandoning a culture to suscribe with the idea that most \"white americans\" are the country's culture.\n \n \n \n Maryland governor stands by criticism of multiculturalism\n ANNAPOLIS, Md. (AP) - Gov. Robert Ehrlich is standing by his dismissal of multiculturalism as \"bunk,\" a statement that angered immigration advocates and prompted a county council to demand an apology. \n \n Maryland Gov. Robert Ehrlich calls his views \"common sense.\" \n By Don Wright, AP \n \n On a conservative radio talk show last week, the Republican governor said he \"rejects the idea of multiculturalism\" and that young immigrants should learn English and assimilate into American culture. \n \n That prompted a Montgomery County Council resolution asking Ehrlich to apologize, saying the comments may contribute to \"a climate of intolerance.\" \n \n Ehrlich has since tried to clarify his position. \"We celebrate our ethnicities,\" Ehrlich said after a bill signing ceremony Tuesday, but Americans share a \"singular culture.\" \n \n \"The last message we want to send out is to separate ourselves in different cultures,\" the governor said. \"This is a melting pot.\" \n \n But Ehrlich stood by his comments, saying his stance is a \"common sense view\" that \"95 percent of Americans and Marylanders agree with.\" \n \n On the radio, Ehrlich referred to multiculturalism as \"****.\" His remarks came after state Comptroller William Donald Schaefer complained at a public meeting that he had trouble understanding a restaurant worker who spoke poor English. \n \n \"I don't want to adjust to another language,\" the 82-year-old Schaefer complained. \"This is the United States. I think they ought to adjust to us.\" \n \n Ehrlich said on the radio that his views are \"very similar\" to Schaefer's. \n \n Immigrant advocates from CASA de Maryland bristled at the implication that newcomers to the United States don't try to learn English. \n \n \"I think the governor should put his money where his mouth is,\" said Kim Propeack, a CASA advocate. \"If he wants people to learn to speak English, he should be funding (English as a Second Language) classes at a considerably greater rate.\"", 
   {
    "post_info": {
     "post_title": "This is an example of White culture. I&quot;ll be more specific later."
    }, 
    "unicode_changes_made": true
   }, 
   46584, 
   null, 
   1084585080.0
  ], 
  [
   50066, 
   null, 
   "galton", 
   "This is what I condier the problem with \"white culture\" in America. They think they're views, traditions, protocols, and customs are the \"american\" way. That is what is what makes the idea of intolerance so unbelieveable. I'm all about learning english btu i dont' agree wiht abandoning a culture to suscribe with the idea that most \"white americans\" are the country's culture.\n \n\n Multiculturalism is bunk, not because it advocates appreciating other cultures or because it encourages people to hold onto elements of their cultures. It is bunk because it demonizes traditional American culture and heritage, and it seeks to use the government to extinguish that traditional culture and install one instead that assumes that all cultures are equally valid except for the traditional American one which is wicked, and all cultures except the traditional American one should have an equal presence in the public sphere, creating a tower of Babel of ethnic conflict.\n \n I've got an idea. Let's all move to Tonga and organize to snuff out Tongan culture by installing a multicultural society where we institute the cultures of Japan, Mexico, China, Loas, Pakistan, Zimbabwe, India, Indonesia, Ghana, El Salvador, Russia, Latvia, Taiwan, and a 100 others all equally, but most of the time our celebration will be spent discussing how horrible Tongan culture is, and isn't so wonderful we're getting rid of that for our multicultural paradise. Everyone will be happy because they get to live their ethnic identity which multicultural studies teaches us is so important for mental health. The only sad people will be the Tongans who now don't have a clue who they are or what their identity is. The only time they are allowed to feel like Tongans is when they wring their hands over their evil history of oppression over such and such Polynesians, and they spend a great deal of time doing this.", 
   {}, 
   50055, 
   null, 
   1084586940.0
  ], 
  [
   50214, 
   null, 
   "mana'ia", 
   "Multiculturalism is bunk, not because it advocates appreciating other cultures or because it encourages people to hold onto elements of their cultures. It is bunk because it demonizes traditional American culture and heritage, and it seeks to use the government to extinguish that traditional culture and install one instead that assumes that all cultures are equally valid except for the traditional American one which is wicked, and all cultures except the traditional American one should have an equal presence in the public sphere, creating a tower of Babel of ethnic conflict.\n \n I've got an idea. Let's all move to Tonga and organize to snuff out Tongan culture by installing a multicultural society where we institute the cultures of Japan, Mexico, China, Loas, Pakistan, Zimbabwe, India, Indonesia, Ghana, El Salvador, Russia, Latvia, Taiwan, and a 100 others all equally, but most of the time our celebration will be spent discussing how horrible Tongan culture is, and isn't so wonderful we're getting rid of that for our multicultural paradise. Everyone will be happy because they get to live their ethnic identity which multicultural studies teaches us is so important for mental health. The only sad people will be the Tongans who now don't have a clue who they are or what their identity is. The only time they are allowed to feel like Tongans is when they wring their hands over their evil history of oppression over such and such Polynesians, and they spend a great deal of time doing this.\n\n \n So tell me what is the \"traditional American culture\"? Can you define it for me?\n \n Was there a culture in America when teh pilgrims came or did they bring culture to a cultureless place?", 
   {}, 
   50066, 
   null, 
   1084703460.0
  ], 
  [
   50316, 
   null, 
   "mizmaxx", 
   "Lol mana'ia- you've got him now.\n \n If we were to follow galton's logic, Americans should all have assimilated into various \"Indian\" cultures. Unless he just thinks \"white culture\" is superior, and the entire world should assimilate into it.\n \n I say, right on! Let's really do this \"melting pot\" thing right, and properly assimilate into native cultures, learn their languages, follow their laws, etc. If you want to speak English, go to England! ;)", 
   {}, 
   50214, 
   null, 
   1084784460.0
  ], 
  [
   50793, 
   null, 
   "emclean", 
   "\"melting pot\" means that we ALL come together. i could not care less what language you speek in your home, or when having a privet conversation. if you want to include part of what outhers are doing, then it should be your choice, it should not be forced on anyone. but do not tell me i have to respect what ever you do. if you want to mock what i do, it is your right, or if i want to do the same.", 
   {}, 
   50316, 
   null, 
   1084914660.0
  ], 
  [
   50811, 
   null, 
   "Waxy", 
   "Lol mana'ia- you've got him now.\n \n If we were to follow galton's logic, Americans should all have assimilated into various \"Indian\" cultures. Unless he just thinks \"white culture\" is superior, and the entire world should assimilate into it.\n \n I say, right on! Let's really do this \"melting pot\" thing right, and properly assimilate into native cultures, learn their languages, follow their laws, etc. If you want to speak English, go to England! ;)\n\n \n LOL. :p \n \n When immigrants (whether they're from Mexico, China, wherever) overthrow, no actually conquer, the USA as we know it, then we'll all assimilate to their culture, whatever, and however they would like.\n \n PC or not, Europeans didn't immigrate to North America to join the native tribes at their invitation. They conquered the Native Americans and took the land. That's the way the world works. The victor gets to make the rules. We seem to have lost sight of that reality in our \"modern\" view of the world.\n \n No one has forced people to immigrate to the US, they do so of their own free will. The only thing required in return is that you learn to function as an AMERICAN. Being an American has nothing to do with skin colour, but it does require that you speak english (for the most part) and that you accept and live by the laws and accepted moral norms that are in place for all Americans.\n \n It has nothing to do with any culture being superior, and even less to do with \"white culture\". \n \n Waxy", 
   {}, 
   50316, 
   null, 
   1084917600.0
  ], 
  [
   50837, 
   null, 
   "galton", 
   "Lol mana'ia- you've got him now.\n \n If we were to follow galton's logic, Americans should all have assimilated into various \"Indian\" cultures. Unless he just thinks \"white culture\" is superior, and the entire world should assimilate into it.\n \n I say, right on! Let's really do this \"melting pot\" thing right, and properly assimilate into native cultures, learn their languages, follow their laws, etc. If you want to speak English, go to England! ;)\n\n \n I would have gladly assimilated to one of the indigenous cultures if their culture would have provided me the abundance, freedom, health, and longevity that American culture has provided me. I don't know about you but I'm not a big hunter, don't really enjoy gardening, am glad to see that I am not likely to lose one of my two children to a premature death, and like living past 30. Apparently, much of the Thirld World feels the same way about Western culture, as it imitates it so much, and hundreds of thousands from all around the world break into the U.S. each year to partake of it. You'll have a lot easier time convincing your trendy friends of American cultural inferiority than the rest of the world.", 
   {}, 
   50316, 
   null, 
   1084923060.0
  ], 
  [
   50908, 
   null, 
   "mizmaxx", 
   "I don't know about you but I'm not a big hunter, don't really enjoy gardening, am glad to see that I am not likely to lose one of my two children to a premature death, and like living past 30.\n\n Hunting and gardening aren't the only parts of indigenous culture. Neither is early death a cultural thing, prior to colonization death rates were equal to or better than Europeans. In fact many Europeans (the smart ones IMO) chose to leave their settler communities to join local First Nations for the higher level of freedom from bureaucracy, European \"morality\", and other disagreeable aspects of European culture.\n \n \nApparently, much of the Thirld World feels the same way about Western culture, as it imitates it so much, and hundreds of thousands from all around the world break into the U.S. each year to partake of it.\n\n LOL, you're just embarrassing yourself every time you make assumptions about me galton. I can safely say I know far more than you about what people from the \"Third World\" as you call it (the majority of the world, that is) think about American culture. Few of my friends are exclusively European descendants, and I've lived in all kinds of places you couldn't imagine. The honest truth is that the majority of the world is being force-fed \"American culture\", and they are on the whole not impressed.\n \n All that aside, I notice that you aren't bothering to disguise your opinion that Euro-American cultural is superior with calls to \"assimilate into local culture\" anymore. At least that's honest.", 
   {}, 
   50837, 
   null, 
   1084946100.0
  ], 
  [
   51149, 
   null, 
   "mana'ia", 
   "\"melting pot\" means that we ALL come together. i could not care less what language you speek in your home, or when having a privet conversation. if you want to include part of what outhers are doing, then it should be your choice, it should not be forced on anyone. but do not tell me i have to respect what ever you do. if you want to mock what i do, it is your right, or if i want to do the same.\n\n Melting pot refers to the fact that we are made up of many. How are we made up of many if we're suppose to be once culture? Language is not culture. I agree we should all learen english but to say other cultures are unacceptable is not American unless you beleive AMerica is for white assimilation only!", 
   {}, 
   50793, 
   null, 
   1085014500.0
  ], 
  [
   51150, 
   null, 
   "mana'ia", 
   "LOL. :p \n \n When immigrants (whether they're from Mexico, China, wherever) overthrow, no actually conquer, the USA as we know it, then we'll all assimilate to their culture, whatever, and however they would like.\n \n PC or not, Europeans didn't immigrate to North America to join the native tribes at their invitation. They conquered the Native Americans and took the land. That's the way the world works. The victor gets to make the rules. We seem to have lost sight of that reality in our \"modern\" view of the world.\n \n No one has forced people to immigrate to the US, they do so of their own free will. The only thing required in return is that you learn to function as an AMERICAN. Being an American has nothing to do with skin colour, but it does require that you speak english (for the most part) and that you accept and live by the laws and accepted moral norms that are in place for all Americans.\n \n It has nothing to do with any culture being superior, and even less to do with \"white culture\". \n \n\n So this idea of a meltiung pot only refers to Europeans?\n \n So America is for european only? Minorites aren't Americans unless we become liek europeans?\n \n What is functioning as Aemrican? What is American?", 
   {}, 
   50811, 
   null, 
   1085014620.0
  ], 
  [
   51151, 
   null, 
   "mana'ia", 
   "I would have gladly assimilated to one of the indigenous cultures if their culture would have provided me the abundance, freedom, health, and longevity that American culture has provided me. I don't know about you but I'm not a big hunter, don't really enjoy gardening, am glad to see that I am not likely to lose one of my two children to a premature death, and like living past 30. Apparently, much of the Thirld World feels the same way about Western culture, as it imitates it so much, and hundreds of thousands from all around the world break into the U.S. each year to partake of it. You'll have a lot easier time convincing your trendy friends of American cultural inferiority than the rest of the world.\n\n \n Galton first off you need to understand what is culture, technology, and democracy.\n \n When until the industial revolution everyone was a hunter or farmer basically. Thre were few bankers but that was about it.\n \n Also you are referring to technology and freedom that has made america great. Not culture. The culture that white is superior has really hurt America. It isn't until the idea not the culture of tolerance evovled did America progress more.\n \n Also it the freedoms here in America that has lured many of the best minds in teh world here not the culture.", 
   {}, 
   50837, 
   null, 
   1085014860.0
  ], 
  [
   51204, 
   null, 
   "emclean", 
   "I agree we should all learen english but to say other cultures are unacceptable is not American unless you beleive AMerica is for white assimilation only!\n \n I don't know where I said that other cultures are unacceptable, I said that I do not have to except them, personally! if they want to practices what ever culture they want, just don't tell me I have to also. It works the same for they; there is no reason that as long as no one is breaking the law that any one has to except anyone's couture. As an example, I was upset to see the Mexican flag flying above the American flag on the 5th of May, and the city was called about it. Dose this show that I dislike the Mexican's? No, the re is a law that says that the US flag will always fly above a foreign flag in the US.", 
   {
    "unicode_changes_made": true
   }, 
   51151, 
   null, 
   1085024160.0
  ], 
  [
   51232, 
   null, 
   "whistler", 
   "Galton first off you need to understand what is culture, technology, and democracy.\n\n \n \"Hello Pot? This is Kettle calling...\"\n \n Hahahahahha \n \n :p \n \n You might want to check up on what is meant by melting pot.\n \n Whistler", 
   {}, 
   51151, 
   null, 
   1085029020.0
  ], 
  [
   51246, 
   null, 
   "mizmaxx", 
   "When immigrants (whether they're from Mexico, China, wherever) overthrow, no actually conquer, the USA as we know it, then we'll all assimilate to their culture, whatever, and however they would like.\n\n Sure you would. emoticon_rolleyes So when Ossama Bin Laden takes over America, you will just send your children to their Muslim studies with a smile? Yeah, right.\n \n \nPC or not, Europeans didn't immigrate to North America to join the native tribes at their invitation. They conquered the Native Americans and took the land. \n\n How refreshingly honest. I hope you won't take it personally when a Native person shows up on your doorstep with a gun to take their land back. After all, that's how the world works! ;)", 
   {}, 
   50811, 
   null, 
   1085041080.0
  ], 
  [
   51297, 
   null, 
   "whistler", 
   "How refreshingly honest. I hope you won't take it personally when a Native person shows up on your doorstep with a gun to take their land back. After all, that's how the world works!.;)\n\n \n I won't take it personally, no. Of course I hope they don't take it personally if I manage to kill them in the ensuing struggle. ;)\n \n Actually this brings up an interesting point only peripherally related to the topic of white culture. How does the world work? \n \n Unlike everything, say, before about about 100 years ago the world doesn't really operate on a strict might-makes-right philosophy. Back when the Europeans took the land from Native Americans there was no UN to moderate the conflict. The (primarily European) world community didn't much care if millions of 'savages' were killed to make way for militarily and economically mightier nations. No protest, nada, not even a bit.\n \n In modern times, might-makes-right-sort-of. For example, I don't think we should be in Iraq, an opinion I share with much of the world community. However because we are the economic and military powerhouse of the world, everyone else can only grumble about it not being right. They are somewhat powerless to do anything about it. \n \n However, in other places around the world (e.g. the Balkans, Israel and Palestine) the attempts of one group to anhilate/subjugate another has been severely curbed by the international community. \n \n Of course this is a gross oversimplification. But I see it as a related issue to 'white hegemony' in the United States, one that is at least worth pondering. \n \n Whistler", 
   {}, 
   51246, 
   null, 
   1085069520.0
  ], 
  [
   51366, 
   null, 
   "Waxy", 
   "So this idea of a meltiung pot only refers to Europeans?\n \n So America is for european only? Minorites aren't Americans unless we become liek europeans?\n \n What is functioning as Aemrican? What is American?\n\n \n mana'ia, you're so dramatic.\n \n Spare me your theatrics.\n \n It refers to anyone regardless of race, creed, or sex that immigrates to the USA. They have to assimiliate into American culture. What is American culture? I can't begin to define it, it encompasses everything from subtle physical gestures to the vehicles we drive and our politics. You know what American culture is, you're surrouned by it every day. \n \n Does this culture have strong European roots? Of course it does, the country was founded by Europeans. \n \n Minorities are Americans, and as Americans, they are expected to act as other Americans. That's a pretty simple concept.\n \n My personal opinion on this is simple. You want to live here? You play be the rules. It doesn't matter who made them, they exist, take it or leave it. You knew the rules before you arrived, don't expect me to change them because you don't like them. \n \n I think hyphenated-Americans are one of the biggest \"problems\" facing America. I have no problem with maintaining one's cultural identity, but you should be an American first.\n \n Waxy", 
   {}, 
   51150, 
   null, 
   1085087100.0
  ], 
  [
   51368, 
   null, 
   "Waxy", 
   "Sure you would. emoticon_rolleyes So when Ossama Bin Laden takes over America, you will just send your children to their Muslim studies with a smile? Yeah, right.\n \n How refreshingly honest. I hope you won't take it personally when a Native person shows up on your doorstep with a gun to take their land back. After all, that's how the world works! ;)\n\n \n Again with the theatrics and drama. Spare me.\n \n If, like the American Indian, my population was wiped out, and my only other choice was death for both myself and my children, yeah, I'd send them to Muslim school. \n \n Like Whistler said, he better be prepared for a fight. \n \n Also, as Whistler has said, up until the last ~100, that's EXACTLY how the world worked.\n \n Waxy", 
   {}, 
   51246, 
   null, 
   1085087580.0
  ], 
  [
   51380, 
   null, 
   "Big Orn", 
   "I think hyphenated-Americans are one of the biggest \"problems\" facing America. I have no problem with maintaining one's cultural identity, but you should be an American first.\n \n Waxy\n\n Bravo, again, Waxy.\n \n And, this is not just a \"white\" stance on the issue, many, many \"blacks\" are sick of the hyphenated BS.\n \n Wanna be an American? Voila! There you go. It's as easy as accepting it.", 
   {}, 
   51366, 
   null, 
   1085091060.0
  ], 
  [
   51727, 
   null, 
   "galton", 
   "Hunting and gardening aren't the only parts of indigenous culture. Neither is early death a cultural thing, prior to colonization death rates were equal to or better than Europeans. \n\n Death rates tended to be lower among American Indians than people in Europe because they did not have the technology and social organization to produce enough food to support large, dense populations that spread disease--hardly a compliment to the Indians.\n \n \n\n In fact many Europeans (the smart ones IMO) chose to leave their settler communities to join local First Nations for the higher level of freedom from bureaucracy, European \"morality\", and other disagreeable aspects of European culture.\n \n\n Since your type is so enamored with American Indians I'll have to cite them when arguing against big government. Yeah, I might have joined the Indians too; farming is much harder work than hunting and gardening; I wouldn't have been too keen on the whole infanticide thing though.\n \n \n\n LOL, you're just embarrassing yourself every time you make assumptions about me galton. I can safely say I know far more than you about what people from the \"Third World\" as you call it (the majority of the world, that is) think about American culture. Few of my friends are exclusively European descendants, and I've lived in all kinds of places you couldn't imagine. The honest truth is that the majority of the world is being force-fed \"American culture\", and they are on the whole not impressed.\n \n\n Yeah, using the term \"Third World\"--god, is that out of left field or what?! And I why am I not surprised that you have few European-descended friends--you're not the type that likes to go slumming, right? And that is a real shocker that the type of people you would gravitate to wouldn't care for America. \n \n \n\n All that aside, I notice that you aren't bothering to disguise your opinion that Euro-American cultural is superior with calls to \"assimilate into local culture\" anymore. At least that's honest.\n\n When it comes to culture, I am basically a pragmatist. I don't believe that any way of life is intrinsically superior, but cultures differ in what they produce, and American (and European) culture best provide me what I value which are shown in the following facts:\n \n From http://nebula.worldbank.org/Website/index.htm#\n \n Health: America has one of the highest levels of life expectancy and one of the lowest levels of infant mortality in the world.\n \n From www.freedomhouse.org/research/freeworld/2003/table.pdf\n \n Freedom: America scores at the highest level for both political rights and civil liberties.\n \n From www.uis.unesco.org\n \n Education: America has among the highest levels of education in the world. \n \n Science: America has among the highest number of scientists and engineers in the world and devotes resources to science, research, and development at the highest level in the world.\n \n Yeah, I could see why other countries wouldn't want our way of life (or that of European countries); I'm an odd duck in valuing health, freedom, education, and science.", 
   {}, 
   50908, 
   null, 
   1085218020.0
  ], 
  [
   51729, 
   null, 
   "galton", 
   "Galton first off you need to understand what is culture, technology, and democracy.\n\n That's rich--you schooling me in what culture means. Culture is a vague term and can be used to mean many things, but the textbook definition is a \"way of life,\" and a way of life includes technological culture and political culture as well as other dimensions. You're just engaging in semantics here anyway; the Europeans brought technologies and political tradition with them that differed from the Indians, along with other differences. Call it what you want.", 
   {}, 
   51151, 
   null, 
   1085218860.0
  ], 
  [
   51731, 
   null, 
   "mana'ia", 
   "I don't know where I said that other cultures are unacceptable, I said that I do not have to except them, personally! if they want to practices what ever culture they want, just don't tell me I have to also. It works the same for they; there is no reason that as long as no one is breaking the law that any one has to except anyone's couture. As an example, I was upset to see the Mexican flag flying above the American flag on the 5th of May, and the city was called about it. Dose this show that I dislike the Mexican's? No, the re is a law that says that the US flag will always fly above a foreign flag in the US.\n\n \n No is saying tht you have to practice someone else's culture. Teh fact is that most people only recognize mainstream european white culture. \n \n Hosptials don't allow anyone except immediate families. Most cultures don't have the concept of immediate families yet they have to abide by this cultural bias.\n \n Most setting have to be serious if it is professional. Many other cultures casual or humor is usually appropriate. Serious doesn't mean it's better.\n \n Also we look at the endwoment for the arts. What does it recognize? Ballet, symphonies, European or \"white\" art paintings. Does it give grants for Asian operas? Does it recognize Hispanic music? Does it display African art? Almost never. This is what we are referring to cultural bias. At my school graduations sometimes they have tried to prevent me from wearing a lei. A lei? Yet I'm allowed to wear honor tassles? If that isn't culturally bias what is?\n \n Yet we msut give it up to becaome one culture that is suppose to be a melting pot of our culture?\n \n I thought America is about equality. That my cultural past is as American as anyone else's cultural past? Is that not true? Is America's cultural past determined by our ancestry?", 
   {
    "unicode_changes_made": true
   }, 
   51204, 
   null, 
   1085221920.0
  ], 
  [
   51732, 
   null, 
   "mana'ia", 
   "\"Hello Pot? This is Kettle calling...\"\n \n Hahahahahha \n \n :p \n \n You might want to check up on what is meant by melting pot.\n \n\n I think you might want to check.", 
   {}, 
   51232, 
   null, 
   1085222220.0
  ], 
  [
   51733, 
   null, 
   "mana'ia", 
   "Sure you would. emoticon_rolleyes So when Ossama Bin Laden takes over America, you will just send your children to their Muslim studies with a smile? Yeah, right.\n \n \n How refreshingly honest. I hope you won't take it personally when a Native person shows up on your doorstep with a gun to take their land back. After all, that's how the world works! ;)\n\n \n Watch it. You're starting to sound like Galton. Don't let emotions rule your judgment. I'm not the best at it so learn from my mistakes.", 
   {}, 
   51246, 
   null, 
   1085222340.0
  ], 
  [
   51734, 
   null, 
   "mana'ia", 
   "mana'ia, you're so dramatic.\n \n Spare me your theatrics.\n \n It refers to anyone regardless of race, creed, or sex that immigrates to the USA. They have to assimiliate into American culture. What is American culture? I can't begin to define it, it encompasses everything from subtle physical gestures to the vehicles we drive and our politics. You know what American culture is, you're surrouned by it every day. \n \n Does this culture have strong European roots? Of course it does, the country was founded by Europeans. \n \n Minorities are Americans, and as Americans, they are expected to act as other Americans. That's a pretty simple concept.\n \n My personal opinion on this is simple. You want to live here? You play be the rules. It doesn't matter who made them, they exist, take it or leave it. You knew the rules before you arrived, don't expect me to change them because you don't like them. \n \n I think hyphenated-Americans are one of the biggest \"problems\" facing America. I have no problem with maintaining one's cultural identity, but you should be an American first.\n\n \n I know whta you think American culture is. I've noticed something about America. That most Americans have no culture. I go to California. Most everyone there acts the same. I go to Texas, the same thing. I go to Pittsburgh. The same thing.\n \n I visit Mexicans is Mexico. I visit Mexicans in the California. They act liek Mexicans in Mexico. I visit Mexicans in North DAkota. They act like Mexicans in California and Mexico.\n \n I see the kids around me. They act the same as each other. I go somewhere new in teh US. The kids are similar geographically. They are influenced by things regional more than anything.\n \n I visit my cousins ins Hawaii, Cali, and TExas. Guess what they act like me. None of us act like the kids around us. Why? Because we share the same culture. We sahre the same technology as everyone else but have different culture.\n \n Minorities are Americans, and as Americans, they are expected to act as other Americans. That's a pretty simple concept.\n Minorities act as other Americans. So Blacks, Asians, Hispanics, Polynesians, and every other minority si suppose to act like other Americans, which leaves us with....? What? Whites? Europeans? That is how we're suppose to act? So much for the melting pot. \n \n I thought the rule was everyone and every culture is equally American except Native American (they're the only true Americans). Is that true? Or is America another extension of europe?\n \n I think hyphenated Aemricans are the problem. WE're all from somewhre else. So let's guess say we're Italian, japanese, Nigerian, Hawaiian, Cuban, and whatever else we are. WE are all Americans with roots somewhere else. You may believe that you're roots are meaningless. I do not. I do not want to give up my identity for someone else's. I'm as much American as someone that's been here since 1776. That's what Aemrica is all about.", 
   {}, 
   51366, 
   null, 
   1085223420.0
  ], 
  [
   51735, 
   null, 
   "mana'ia", 
   "That's rich--you schooling me in what culture means. Culture is a vague term and can be used to mean many things, but the textbook definition is a \"way of life,\" and a way of life includes technological culture and political culture as well as other dimensions. You're just engaging in semantics here anyway; the Europeans brought technologies and political tradition with them that differed from the Indians, along with other differences. Call it what you want.\n\n \n Yes and you're proving why I need to school you. Culture is influenced by technology, religion, government, economics, and everything else. I'm not engaging in semantics, I'm teaching you about semantics. How can you call culture semantics. We're talking about culture or we're not.", 
   {}, 
   51729, 
   null, 
   1085223960.0
  ], 
  [
   51789, 
   null, 
   "galton", 
   "Yes and you're proving why I need to school you. Culture is influenced by technology, religion, government, economics, and everything else. I'm not engaging in semantics, I'm teaching you about semantics. How can you call culture semantics. We're talking about culture or we're not.\n\n My post clarified what we are talking about--Europeans brought a range of practices that differed from the indigenous people's. Your post here, on the other hand, is barely coherent. You are just playing with definitions and not advancing the debate, just like you do with the whole discrimination/preference thing. You need a new act.", 
   {}, 
   51735, 
   null, 
   1085250000.0
  ], 
  [
   51792, 
   null, 
   "CCR1994", 
   "At what point does it become obvious that individual preference will override cultural norms? I read Bill Cosby's speech to the NAACP and I have to wonder how it become a \"culture\" thing for blacks to talk a certain way. I don't think their ancestors talked this way in their so called native countries or their grandparents or even parents talked this way here. It's personal preference people. They talk that way because they want to.", 
   {}, 
   51789, 
   null, 
   1085251320.0
  ], 
  [
   51814, 
   null, 
   "galton", 
   "Does the shoe fit???? Also lets talk about coherence for a min. You need to go to the Websters and look it up after you come down off you clowd.\n\n Well let's see, \"Yuppie\" means young urban professional. I'm not so young, I'm not really in a urban setting, and I'm probably too casual to be called professional, so nope, I'm afraid I do not have that honor. \n \n That last sentence is an example of coherence. Each part of the sentence goes together, making an intelligible whole. Are you surprised that a sentence is supposed to be like that?", 
   {}, 
   51789, 
   null, 
   1085267100.0
  ], 
  [
   51881, 
   null, 
   "mana'ia", 
   "My post clarified what we are talking about--Europeans brought a range of practices that differed from the indigenous people's. Your post here, on the other hand, is barely coherent. You are just playing with definitions and not advancing the debate, just like you do with the whole discrimination/preference thing. You need a new act.\n\n Galton that's funny. You jsut dismiss my posts without addressing them when everyone else can.\n \n I explained why there is no American culture. And that any culture is American. Whites (not all but many) think that what they do in this country is \"American\". I'm saying that isn't true, it's white.", 
   {}, 
   51789, 
   null, 
   1085307000.0
  ], 
  [
   51905, 
   null, 
   "sglaine", 
   "Galton that's funny. You jsut dismiss my posts without addressing them when everyone else can.\n \n I explained why there is no American culture. And that any culture is American. Whites (not all but many) think that what they do in this country is \"American\". I'm saying that isn't true, it's white.\n\n Yea thats typical isn't it. That is a Yup thing to do. Haaa Haaa.", 
   {}, 
   51881, 
   null, 
   1085327460.0
  ], 
  [
   51932, 
   null, 
   "galton", 
   "Galton that's funny. You jsut dismiss my posts without addressing them when everyone else can.\n \n I explained why there is no American culture. And that any culture is American. Whites (not all but many) think that what they do in this country is \"American\". I'm saying that isn't true, it's white.\n\n Oh, I didn't realize it was incumbent on me to answer posts not addressed to me. I wasn't aware that your points were so valuable that I needed to find the time to go through the entire thread to weed through the dross in order to find your gems. So now that I've been straightened out, I'll go back and see what you wrote to someone else and respond to it.", 
   {}, 
   51881, 
   null, 
   1085350500.0
  ], 
  [
   51937, 
   null, 
   "galton", 
   "I know whta you think American culture is. I've noticed something about America. That most Americans have no culture. I go to California. Most everyone there acts the same. I go to Texas, the same thing. I go to Pittsburgh. The same thing.\n \n I thought you just said that everyone in CA acts like everyone in TX or PA; now you are saying some people in CA act like people in Mexico, so which is it?\n \n I see the kids around me. They act the same as each other. I go somewhere new in teh US. The kids are similar geographically. They are influenced by things regional more than anything.\n \n I visit my cousins ins Hawaii, Cali, and TExas. Guess what they act like me. None of us act like the kids around us. Why? Because we share the same culture. We sahre the same technology as everyone else but have different culture.\n \n Minorities are Americans, and as Americans, they are expected to act as other Americans. That's a pretty simple concept.\n Minorities act as other Americans. So Blacks, Asians, Hispanics, Polynesians, and every other minority si suppose to act like other Americans, which leaves us with....? What? Whites? Europeans? That is how we're suppose to act? So much for the melting pot. \n \n I thought the rule was everyone and every culture is equally American except Native American (they're the only true Americans). Is that true? Or is America another extension of europe?\n \n I think hyphenated Aemricans are the problem. WE're all from somewhre else. So let's guess say we're Italian, japanese, Nigerian, Hawaiian, Cuban, and whatever else we are. WE are all Americans with roots somewhere else. You may believe that you're roots are meaningless. I do not. I do not want to give up my identity for someone else's. I'm as much American as someone that's been here since 1776. That's what Aemrica is all about.\n\n It is not clear to me what you are saying here. You seem to be saying that, while we share the same social system (like the level of technology for example), any general culture should be a combination of all groups. Well I'm all for everyone working together toward a common culture that keeps America great, but an essential aspect of any general culture is how it sees its past and heritage. And the truth is that the people, the ideas, the religion, the technology, the traditions. etc. that were the basis of the social system that led to the development of one of the leading countries in the world were European, specifically English. Those early folks were the architects of the great structure we see now that is called America. Many groups over the years have been adopted into that system, and we have evolved and changed with each new generation, but the design that has led to all the success we have seen has always been there.\n \n So yes, a person whose family has been in the country only a generation can be as American as someone who can trace his ancestors to the Mayflower. In truth, he can be more of an American, because in my view, you are an American to the extent that you love the nation's architects. You are an American if your chest swells with pride as you contemplete America's flowering over the centuries. You are an American if you get misty-eyed as you witness her Spirit rolling forth. You are an American if your deepest desire is to see her prosper and succeed into the future. If these are you feelings, you and I are comrades, and we have no conflicts over culture. \n \n If on the other hand, your devote your energies to finding ways to demonize the nation's architects, its history, its heritage, its way of life, the elements of its past that were essential in making it the success it is; if your desire is to take a wrecking ball to its foundations, so you can erect a different structure in its place, then you and I are rivals, and I will contest you at every opportunity.\n \n What I can't stand is the native-born citzen who hates the American system but who makes his living here anyway, or the immigrant who comes here, not because he has an affinity for America, but because he sees it as a big fat ATM. They have a word for someone who sells herself for money; they call her a whore.", 
   {}, 
   51734, 
   null, 
   1085353980.0
  ], 
  [
   51998, 
   null, 
   "whistler", 
   "I think hyphenated Aemricans are the problem. WE're all from somewhre else.\n\n \n I am not from somewhere else. I was born in America, I will live here my whole life (hopefully) and I will (again, hopefully) die here. I am not anything but American. \n \n I do agree, (assuming that you are an American Citizen) that you are as American as I am. No more and certainly no less. We deserve the same treatment under the law and we should enjoy the same freedoms under the law. \n \n Whistler", 
   {}, 
   51734, 
   null, 
   1085417640.0
  ], 
  [
   52001, 
   null, 
   "whistler", 
   "Melting pot refers to the fact that we are made up of many. How are we made up of many if we're suppose to be once culture? Language is not culture. I agree we should all learen english but to say other cultures are unacceptable is not American unless you beleive AMerica is for white assimilation only!\n\n \n The concept of 'the melting pot' was fashionable about 100 years ago. It stated that due to massive immigration, multiple cultures should come together in America, get mixed, and then melded so one uniform culture would emerge. This new culture will consist of only the best qualities of each component culture. The poorer elements will be dropped from each culture. Over time a culture superior to that anywhere else in the world will emerge, solely because American culture is an amalgam of only the superior elements of all of those cultures. This new culture will enable America to become the dominant force on the planet to do good and lift the rest of the world above themselves. \n \n Note, this view mandates that 'European Americans' assimilate the best qualities of other cultures. Teddy Roosevelt, an ardent 'Melting Pot' proponent, believed that Native Americans had quite a lot to offer from their culture such as bravery, love of strenous activity, and an indominatable fighting spirit. Similarly, other 'Melting Pot' theorists also looked towards other non-European Cultures to add desirable traits. Jews for their love of learning and scholarship, Africans for their musical and artistical ability, East Asians for their strong work ethic, and so on.\n \n Note: I am not espousing these theories as personal belief. I am merely presenting the information as edification.\n \n Taking a more critical look at this theory, one would clearly realize that it didn't quite pan out that way. A more recently used analogy to describe American culture is \"Salad Bowl\" (or the 'hotdish' model if you are from Minnesota). In this analogy there are many componants to American culture that don't meld together but through remaining unique add to the experience. \n \n If you are looking for a pretty thorough deconstruction and critical analysis of the 'melting pot' theory of culture in the United States I would suggest \"The American Crucible\" by Gary Gerstle. I realize this book has some shortcomings, (notably that it is incredibly liberal in outlook) but he does make some valid points regarding the nature of the 'melting pot' theory.\n \n Whistler", 
   {}, 
   51149, 
   null, 
   1085419680.0
  ], 
  [
   52005, 
   null, 
   "billsco", 
   " A more recently used analogy to describe American culture is \"Salad Bowl\" (or the 'hotdish' model if you are from Minnesota). \n\n \n \n Uff da, that reminds me, we should start a thread about good hotdish recipes. Other than that, you got a pretty good post der, ya know.", 
   {}, 
   52001, 
   null, 
   1085420700.0
  ], 
  [
   52093, 
   null, 
   "Waxy", 
   "I know whta you think American culture is. I've noticed something about America. That most Americans have no culture. I go to California. Most everyone there acts the same. I go to Texas, the same thing. I go to Pittsburgh. The same thing.\n \n I visit Mexicans is Mexico. I visit Mexicans in the California. They act liek Mexicans in Mexico. I visit Mexicans in North DAkota. They act like Mexicans in California and Mexico.\n \n I see the kids around me. They act the same as each other. I go somewhere new in teh US. The kids are similar geographically. They are influenced by things regional more than anything.\n \n I visit my cousins ins Hawaii, Cali, and TExas. Guess what they act like me. None of us act like the kids around us. Why? Because we share the same culture. We sahre the same technology as everyone else but have different culture.\n\n \n Sounds about right to me. As diverse as the US is geographically and even culturally, there are common ties of culture that bind all Americans, and IMHO, those ties are what make Americans Americans.\n \n The fact that you and your family are different is not bad, it's good. I'm a 5ht or 6th generation Scot, marrying a 2nd generation Italian, and let me tell you, culturally, we couldn't be much more different. We have no problems, each has their family identity, and each is accepted, neither tries to force their culture upon the other, neither is viewed as superior. Most importantly, we are both strong CANADIAN families. We both realize that we are Canadians first. \n \n \nMinorities are Americans, and as Americans, they are expected to act as other Americans. That's a pretty simple concept.\n Minorities act as other Americans. So Blacks, Asians, Hispanics, Polynesians, and every other minority si suppose to act like other Americans, which leaves us with....? What? Whites? Europeans? That is how we're suppose to act? So much for the melting pot. \n \n \n Exactly. \n \n Like I said before, America has a strong European influence, it comes with the territory. The simple fact is, Europeans founded this nation, and as such they made the rules and those rules defined our culture. Many other aspects of other cultures have been incorporated into the European model, and that combination is what makes America distinct.\n \n American is too geographical diverse to have one single dominant culture, it obviously varies considerably according to geography.\n \n \nI think hyphenated Aemricans are the problem. WE're all from somewhre else. So let's guess say we're Italian, japanese, Nigerian, Hawaiian, Cuban, and whatever else we are. WE are all Americans with roots somewhere else. You may believe that you're roots are meaningless. I do not. I do not want to give up my identity for someone else's. I'm as much American as someone that's been here since 1776. That's what Aemrica is all about.\n\n \n I believe my roots are VERY important, but not more important than my allegiance to my current country of residence and its associated culture. If I was a Scot first, then I guess I should be moving back to Scotland. I realize that I can't expect the majority to change to my wishes and background, but that I instead must conform to, even tolerate, the majority.\n \n No one is persecuting you or asking you to abandon your heritage, that's a misconception.\n \n Waxy", 
   {}, 
   51734, 
   null, 
   1085504220.0
  ], 
  [
   52095, 
   null, 
   "Valthonis", 
   "Yes and you're proving why I need to school you. Culture is influenced by technology, religion, government, economics, and everything else. I'm not engaging in semantics, I'm teaching you about semantics. How can you call culture semantics. We're talking about culture or we're not.\n\n \n you just said the wrong thing right there. You say that your environ changes your culture (I'm sorry, influences) Then you say that mexicans have the same culture even if they are in different places. They have the same culture in mexico and alaska. That is what you are saying. I want to tell us which one it really is instead of trying to say that we don't know what culture is. We know what culture is, you need to learn.", 
   {}, 
   51735, 
   null, 
   1085505840.0
  ], 
  [
   52100, 
   null, 
   "unkerpaulie", 
   "i didnt follow through the whople discussion, but ill just make a small input. first of all, wouldnt it be easiest to just agree on a definition of what culture is? from dictionary.com, culture is the predominating behavior and beliefs common to a group, community or organization. \n \n culture obviously can be transferred, learned, dropped, created, and altered. but as long as its a common change among the majority of the group, then it can be considered as a cultural change.\n then again, culture changes with time as well as population\n \n with that said, i dont think America as a whole has a single culture, except perhaps 'be different', which is a common philosphy among youths, and the belief in free enterprise. other than that there are so many influences and variations that it may be hard to find a single common belief or behavior among all or most americans.\n \n also, there are beliefs and behaviors that white people possess that are different from other races. watch comedy central at prime time for a few examples ;)", 
   {}, 
   52095, 
   null, 
   1085507460.0
  ], 
  [
   52126, 
   null, 
   "galton", 
   "i didnt follow through the whople discussion, but ill just make a small input. first of all, wouldnt it be easiest to just agree on a definition of what culture is? from dictionary.com, culture is the predominating behavior and beliefs common to a group, community or organization. \n \n culture obviously can be transferred, learned, dropped, created, and altered. but as long as its a common change among the majority of the group, then it can be considered as a cultural change.\n then again, culture changes with time as well as population\n \n with that said, i dont think America as a whole has a single culture, except perhaps 'be different', which is a common philosphy among youths, and the belief in free enterprise. other than that there are so many influences and variations that it may be hard to find a single common belief or behavior among all or most americans.\n \n also, there are beliefs and behaviors that white people possess that are different from other races. watch comedy central at prime time for a few examples ;)\n\n Exactly. It is clear and very well-documented that ethnic groups in the U.S. have differences in \"the predominating behavior and beliefs common to a group.\" What we need to work against is groups developing such different and conflicting cultures that it gets increasingly difficult to work harmoniously toward common goals. In my view, the current version of multiculturalism moves us more and more toward ethnic separatism. If the trends continue, we might end up someday like Canada with various Quebecs.", 
   {}, 
   52100, 
   null, 
   1085527680.0
  ], 
  [
   52178, 
   null, 
   "Valthonis", 
   "Exactly. It is clear and very well-documented that ethnic groups in the U.S. have differences in \"the predominating behavior and beliefs common to a group.\" What we need to work against is groups developing such different and conflicting cultures that it gets increasingly difficult to work harmoniously toward common goals. In my view, the current version of multiculturalism moves us more and more toward ethnic separatism. If the trends continue, we might end up someday like Canada with various Quebecs.\n\n \n that is stupid. I'm not saying you galton, just the thing yousaid about various quebecs, are you serious?", 
   {}, 
   52126, 
   null, 
   1085591940.0
  ], 
  [
   52186, 
   null, 
   "unkerpaulie", 
   "that is stupid. I'm not saying you galton, just the thing yousaid about various quebecs, are you serious?\n\n he is talking about a possible fallout of the states if the cultural gaps keep getting better. its not a stupid analogy if you understood what he meant\n \n i dont see that happening, because to me the cultural differences are more related to financial class and race rather than location as such. at the same time i dont think we need a cultural melting pot for people to be cooperative. i think its better than cultures and customs be preserved rather than assimilated. yes, the division will exist, and yes, friction will exist between cultures on different levels. but cooperation can be acheived. it depends on what you want to accomplish though.\n \n im sure the heads looking at the \"big picture\" would prefer a single global culture. i prefer the variety, and its not simply because im against globalisation/new world order (although i am)", 
   {}, 
   52178, 
   null, 
   1085592960.0
  ], 
  [
   52187, 
   null, 
   "sinjin", 
   "In my view, the current version of multiculturalism moves us more and more toward ethnic separatism.\n\n \n My view as well. It is one thing to celebrate the things that make us different and value them but without a larger American identity that all are expected to want to participate in we are \"Balkanizing\". \n \n Silly example from my own history:\n \n When I was a kid in Los Angeles I lived in a very culturally diverse neighborhood and everyone strung up Christmas lights and made the place look great for the kids. Nowadays hardly any immigrant families in my neighborhood do this and the holiday is the poorer for it IMO. Shame.\n I should say that the countries of origin for recent immigrants have changed substantially over the years.\n \n It seems all too many people are coming to at least my part of the country to take and not to give. They seem to want to recreate the \"old country\" here and have actual contempt for the natives and their customs.\n \n I have always viewed American culture as an amalgam of European and other cultures , all of which contribute to who we are. Assimilation is not the order of the day, amalgamation is.", 
   {}, 
   52126, 
   null, 
   1085593980.0
  ], 
  [
   52190, 
   null, 
   "Big Orn", 
   "...all of which contribute to who we are.\n\n Well said, sinjin.\n \n If we are ever to reach that peaceful posture, we should give without thought of what we get in return &#8211; a lesson that&#8217;s not as popular as it once was. Along those lines, if implemented, we would find ourselves in a mutual balance.", 
   {}, 
   52187, 
   null, 
   1085594580.0
  ], 
  [
   52208, 
   null, 
   "galton", 
   "that is stupid. I'm not saying you galton, just the thing yousaid about various quebecs, are you serious?\n\n Wow, what a powerful argument--I guess we can all go home now folks: Valthonis has proclaimed the concern about of ethnic separatism dumb. We have no idea why, but if Valthonis says it, what more do we need to say? I would love to address your points, except that you haven't made any. So I guess all I can say back is no, concern about ethnic separatism is...smart.", 
   {}, 
   52178, 
   null, 
   1085604060.0
  ], 
  [
   52318, 
   null, 
   "Valthonis", 
   "Wow, what a powerful argument--I guess we can all go home now folks: Valthonis has proclaimed the concern about of ethnic separatism dumb.\n did I ever say this??? It seems you are putting words in my mouth.\n \nWe have no idea why, but if Valthonis says it, what more do we need to say? I would love to address your points, except that you haven't made any.\n I wasn't making a point of it, I was asking a question out of disbelief. Again, words in my mouth.\n \nSo I guess all I can say back is no, concern about ethnic separatism is...smart.\n\n Did I say it wasn't smart? Wow, he has amazed me by pulling words out of my mouth when they were never there. I was saying it is stupid to have different Quebecs. Please think before you write next time unless you are incapable. Back to what we are talking about. \n \n Now I have a question. You getting this galton, If you don't understand at anypoint through this, send me a message, maybe I can draw a picture for you. Is this white culture thing saying that whites all have the same culture? Now galton, here is a new thing called actually answering the question. Please do it.", 
   {}, 
   52208, 
   null, 
   1085678760.0
  ], 
  [
   52392, 
   null, 
   "galton", 
   "I was saying it is stupid to have different Quebecs. Please think before you write next time unless you are incapable. Back to what we are talking about. \n \n\n After I expressed concern about ethnic separatism leading to a Quebec-type situation, you said, \"That is stupid, I don't mean you Galton, just the thing about the various Quebecs. Are you are serious?\" Both unkperpaulie and I took those words to mean that my idea that the country could someday be Balkanized was a stupid idea; how could I even seriously entertain such an idea? Not only I interpreted it that way--unkerpaulie did too. If your words sound--to others, not only me--like you're accusing my ideas of being stupid, you're going to get smartassiness from me. You can hardly blame me; you are now giving me smartassiness even when you know that my smartassiness was based on my misinterpreting (as well as unkerpaulie) your unclear words. \n \n \n\n Now I have a question. You getting this galton, If you don't understan\n d at anypoint through this, send me a message, maybe I can draw a picture for you. Is this white culture thing saying that whites all have the same culture? Now galton, here is a new thing called actually answering the question. Please do it.\n\n Well since you said please: First of all, do you mean whites everywhere, or in the U.S.? Culture is made up of values, attitudes, customs, behaviors, traditions, outlooks, worldviews, tastes, pasttimes, etc. Do whites tend to differ on these things from others? In the U.S. many average differences between whites and other groups have been well-documented. Looking world-round, that hasn't been examined much, but a rough comparison would be the difference between Western nations and non-Western nations. Those differences are clear as well. Of course there is a great deal of commonality around the world, but nobody denies national cultural differences--they are obvious. But even Western/non-Western or European/non-European differences seem apparent to me. \n \n One example to give a flavor of what I mean: do a correlation between the countries that score highest on political rights and civil liberties on the one hand and whether they are predominantly white countries or not. The correlation I'm sure would be very high. If you are skeptical I will examine it.", 
   {}, 
   52318, 
   null, 
   1085698980.0
  ], 
  [
   52394, 
   null, 
   "Eddie", 
   "One example to give a flavor of what I mean: do a correlation between the countries that score highest on political rights and civil liberties on the one hand and whether they are predominantly white countries or not. The correlation I'm sure would be very high. If you are skeptical I will examine it.\n\n \n Check out: http://www.freedomhouse.org/research/index.htm and their \"map of freedom\" (PDF). No need for an extensive survey when it has allready been made and is even presented in colour ;)", 
   {}, 
   52392, 
   null, 
   1085700360.0
  ], 
  [
   52451, 
   null, 
   "Valthonis", 
   "After I expressed concern about ethnic separatism leading to a Quebec-type situation, you said, \"That is stupid, I don't mean you Galton, just the thing about the various Quebecs. Are you are serious?\" Both unkperpaulie and I took those words to mean that my idea that the country could someday be Balkanized was a stupid idea; how could I even seriously entertain such an idea? Not only I interpreted it that way--unkerpaulie did too. If your words sound--to others, not only me--like you're accusing my ideas of being stupid, you're going to get smartassiness from me. You can hardly blame me; you are now giving me smartassiness even when you know that my smartassiness was based on my misinterpreting (as well as unkerpaulie) your unclear words. \n \n \n Well since you said please: First of all, do you mean whites everywhere, or in the U.S.? Culture is made up of values, attitudes, customs, behaviors, traditions, outlooks, worldviews, tastes, pasttimes, etc. Do whites tend to differ on these things from others? In the U.S. many average differences between whites and other groups have been well-documented. Looking world-round, that hasn't been examined much, but a rough comparison would be the difference between Western nations and non-Western nations. Those differences are clear as well. Of course there is a great deal of commonality around the world, but nobody denies national cultural differences--they are obvious. But even Western/non-Western or European/non-European differences seem apparent to me. \n \n One example to give a flavor of what I mean: do a correlation between the countries that score highest on political rights and civil liberties on the one hand and whether they are predominantly white countries or not. The correlation I'm sure would be very high. If you are skeptical I will examine it.\n\n Thank you, I'm sorry about my smartassiness. I was just annoyed but now I realize we both misunderstood each other. Back to the actual conversation, I can actually see that happening, the whole quebec thing we were talking about. Many people do not want their \"culture\" messed with. Another thing, mana'ia said that people with the same technology, government, etc... all have the same culture. Does that mean that everyone in say anchorage, AK have the same culture??? They all have the same oppurtunity.", 
   {}, 
   52392, 
   null, 
   1085764740.0
  ], 
  [
   52567, 
   null, 
   "galton", 
   "Thank you, I'm sorry about my smartassiness. I was just annoyed but now I realize we both misunderstood each other. Back to the actual conversation, I can actually see that happening, the whole quebec thing we were talking about. Many people do not want their \"culture\" messed with. Another thing, mana'ia said that people with the same technology, government, etc... all have the same culture. Does that mean that everyone in say anchorage, AK have the same culture??? They all have the same oppurtunity.\n\n The one advantage the U.S has over a country like Canada is that we don't have regions where only one kind of people live--people are more mixed up all around the country. So instead of regional separation, you get white flight out of the big cities as minorities have moved in, producing somewhat segregated neighborhoods. \n \n The one region that could grow increasingly separate in its culture and people is the Southwest. There are very large Hispanic--mostly Mexican--populations in states like CA and NM. Whites are leaving CA for other states as immigrants move in, so the day could arrive when the southwest is largely immigrant and mostly of Mexican ancestry. It is possible that multiculturalism will encourage them to maintain a Mexican culture, and it is even conceivably that decades from now that region will become unhappy with the domination from the rest of the country, and some might desire to secede like the Southern U.S. 150 years ago. Now this may seem farfetched now, but I'm talking about trends that if continued could lead to something like this in several decades.", 
   {}, 
   52451, 
   null, 
   1085888820.0
  ], 
  [
   53343, 
   null, 
   "mana'ia", 
   "Oh, I didn't realize it was incumbent on me to answer posts not addressed to me. I wasn't aware that your points were so valuable that I needed to find the time to go through the entire thread to weed through the dross in order to find your gems. So now that I've been straightened out, I'll go back and see what you wrote to someone else and respond to it.\n\n \n You said my post wasn't very coherent. And I said it must have been if others understand it.", 
   {}, 
   51932, 
   null, 
   1086747000.0
  ], 
  [
   53344, 
   null, 
   "mana'ia", 
   "It is not clear to me what you are saying here. You seem to be saying that, while we share the same social system (like the level of technology for example), any general culture should be a combination of all groups. Well I'm all for everyone working together toward a common culture that keeps America great, but an essential aspect of any general culture is how it sees its past and heritage. And the truth is that the people, the ideas, the religion, the technology, the traditions. etc. that were the basis of the social system that led to the development of one of the leading countries in the world were European, specifically English. Those early folks were the architects of the great structure we see now that is called America. Many groups over the years have been adopted into that system, and we have evolved and changed with each new generation, but the design that has led to all the success we have seen has always been there.\n \n So yes, a person whose family has been in the country only a generation can be as American as someone who can trace his ancestors to the Mayflower. In truth, he can be more of an American, because in my view, you are an American to the extent that you love the nation's architects. You are an American if your chest swells with pride as you contemplete America's flowering over the centuries. You are an American if you get misty-eyed as you witness her Spirit rolling forth. You are an American if your deepest desire is to see her prosper and succeed into the future. If these are you feelings, you and I are comrades, and we have no conflicts over culture. \n \n If on the other hand, your devote your energies to finding ways to demonize the nation's architects, its history, its heritage, its way of life, the elements of its past that were essential in making it the success it is; if your desire is to take a wrecking ball to its foundations, so you can erect a different structure in its place, then you and I are rivals, and I will contest you at every opportunity.\n \n What I can't stand is the native-born citzen who hates the American system but who makes his living here anyway, or the immigrant who comes here, not because he has an affinity for America, but because he sees it as a big fat ATM. They have a word for someone who sells herself for money; they call her a whore.\n\n \n Other cultures are demon izing the nations architects. They're demonizing the inequalities and the imperfections of the country. You can be an immigrant here to this country and beleive lvoe it with all your heart. Does that mean love all the problems of this country? Of course it doesn't. If people think they are demonizing the country as a whole then they have a eprception problem. \n \n We ahve free speech to say what isn't popular so taht there might be change. That is the America we all love.", 
   {}, 
   51937, 
   null, 
   1086747180.0
  ], 
  [
   53345, 
   null, 
   "mana'ia", 
   "I am not from somewhere else. I was born in America, I will live here my whole life (hopefully) and I will (again, hopefully) die here. I am not anything but American. \n \n I do agree, (assuming that you are an American Citizen) that you are as American as I am. No more and certainly no less. We deserve the same treatment under the law and we should enjoy the same freedoms under the law. \n \n Whistler\n\n Unless you are Native American you are from somewhere else. I was born in this country too.", 
   {}, 
   51998, 
   null, 
   1086747240.0
  ], 
  [
   53346, 
   null, 
   "mana'ia", 
   "At what point does it become obvious that individual preference will override cultural norms? I read Bill Cosby's speech to the NAACP and I have to wonder how it become a \"culture\" thing for blacks to talk a certain way. I don't think their ancestors talked this way in their so called native countries or their grandparents or even parents talked this way here. It's personal preference people. They talk that way because they want to.\n\n \n culture is a living thing. All cultures adapt to technology and other innovations. Black culture is something that I believe isn't really culture. Just becasue many do it doesn't mean it's culture. What is black culture? That's hard to define. Is it the thug on the street? Is it the man in the smooth business suit? Is it the kid who relates everything to Africa? It's impossible to tell. That is why I feel there are some cultures and some mainstream ideas among certain groups.", 
   {}, 
   51792, 
   null, 
   1086747420.0
  ], 
  [
   53388, 
   null, 
   "whistler", 
   "Unless you are Native American you are from somewhere else. I was born in this country too.\n\n \n The ancestors of modern Native Americans came from somewhere else. As did my ancestors. \n \n However, I am not from somewhere else. I was born in Minnesota and have lived here all my life. Given this, I am as native to Minnesota as the Indians who currently live on the reservation. \n \n Whistler", 
   {}, 
   53345, 
   null, 
   1086802680.0
  ], 
  [
   53414, 
   null, 
   "Anastasia", 
   "Unless you are Native American you are from somewhere else. I was born in this country too.\n\n I thought Indians came from China\n emoticon_frazzled \n Born in Colorado=Native American\n Touche Whistler :)", 
   {}, 
   53345, 
   null, 
   1086822900.0
  ], 
  [
   53455, 
   null, 
   "mana'ia", 
   "The ancestors of modern Native Americans came from somewhere else. As did my ancestors. \n \n However, I am not from somewhere else. I was born in Minnesota and have lived here all my life. Given this, I am as native to Minnesota as the Indians who currently live on the reservation. \n \n\n If you beleive that Native Americans came from somewhere else than I guess we should eliminate indigenous from the dictionary becaue nothing would be indigenous to America.", 
   {}, 
   53388, 
   null, 
   1086853920.0
  ], 
  [
   53456, 
   null, 
   "mana'ia", 
   "The concept of 'the melting pot' was fashionable about 100 years ago. It stated that due to massive immigration, multiple cultures should come together in America, get mixed, and then melded so one uniform culture would emerge. This new culture will consist of only the best qualities of each component culture. The poorer elements will be dropped from each culture. Over time a culture superior to that anywhere else in the world will emerge, solely because American culture is an amalgam of only the superior elements of all of those cultures. This new culture will enable America to become the dominant force on the planet to do good and lift the rest of the world above themselves. \n \n Note, this view mandates that 'European Americans' assimilate the best qualities of other cultures. Teddy Roosevelt, an ardent 'Melting Pot' proponent, believed that Native Americans had quite a lot to offer from their culture such as bravery, love of strenous activity, and an indominatable fighting spirit. Similarly, other 'Melting Pot' theorists also looked towards other non-European Cultures to add desirable traits. Jews for their love of learning and scholarship, Africans for their musical and artistical ability, East Asians for their strong work ethic, and so on.\n \n Note: I am not espousing these theories as personal belief. I am merely presenting the information as edification.\n \n Taking a more critical look at this theory, one would clearly realize that it didn't quite pan out that way. A more recently used analogy to describe American culture is \"Salad Bowl\" (or the 'hotdish' model if you are from Minnesota). In this analogy there are many componants to American culture that don't meld together but through remaining unique add to the experience. \n \n If you are looking for a pretty thorough deconstruction and critical analysis of the 'melting pot' theory of culture in the United States I would suggest \"The American Crucible\" by Gary Gerstle. I realize this book has some shortcomings, (notably that it is incredibly liberal in outlook) but he does make some valid points regarding the nature of the 'melting pot' theory.\n \n\n I agree to your view for the mostpart. The part I think is different is that we don't come to this oucntry and drop ours and pick up another. I think immigrants come here and teach their kids and then their kids pick up new things and add it to their culture. Then the country is full of poeple that are different in many ways but yet have similarities.\n \n I don't know how this is suppose to be a melting pot if someone comes to this country and is suppose to be given culture but never gets to shar theirs.", 
   {}, 
   52001, 
   null, 
   1086854220.0
  ], 
  [
   53459, 
   null, 
   "mana'ia", 
   "Sounds about right to me. As diverse as the US is geographically and even culturally, there are common ties of culture that bind all Americans, and IMHO, those ties are what make Americans Americans.\n \n The fact that you and your family are different is not bad, it's good. I'm a 5ht or 6th generation Scot, marrying a 2nd generation Italian, and let me tell you, culturally, we couldn't be much more different. We have no problems, each has their family identity, and each is accepted, neither tries to force their culture upon the other, neither is viewed as superior. Most importantly, we are both strong CANADIAN families. We both realize that we are Canadians first. \n \n \n \n Exactly. \n \n Like I said before, America has a strong European influence, it comes with the territory. The simple fact is, Europeans founded this nation, and as such they made the rules and those rules defined our culture. Many other aspects of other cultures have been incorporated into the European model, and that combination is what makes America distinct.\n \n American is too geographical diverse to have one single dominant culture, it obviously varies considerably according to geography.\n \n \n \n I believe my roots are VERY important, but not more important than my allegiance to my current country of residence and its associated culture. If I was a Scot first, then I guess I should be moving back to Scotland. I realize that I can't expect the majority to change to my wishes and background, but that I instead must conform to, even tolerate, the majority.\n \n No one is persecuting you or asking you to abandon your heritage, that's a misconception.\n \n \n\n \n Waxy I think we agree on it for the most part. I think fundametally we see everything the same. Weird huh? We agree on something.", 
   {}, 
   52093, 
   null, 
   1086854640.0
  ], 
  [
   53460, 
   null, 
   "mana'ia", 
   "you just said the wrong thing right there. You say that your environ changes your culture (I'm sorry, influences) Then you say that mexicans have the same culture even if they are in different places. They have the same culture in mexico and alaska. That is what you are saying. I want to tell us which one it really is instead of trying to say that we don't know what culture is. We know what culture is, you need to learn.\n\n I think you do not know what culture is. Protocols for cultures usually expand all regions. Here in the US most \"white Americans\" don't have a strong sense of culture because their protocols are mostly influenced by local factors as opposed to people wiht strong cultural identities that are the same regardless of geography.", 
   {}, 
   52095, 
   null, 
   1086854760.0
  ], 
  [
   53470, 
   null, 
   "whistler", 
   "I agree to your view for the mostpart. The part I think is different is that we don't come to this oucntry and drop ours and pick up another. I think immigrants come here and teach their kids and then their kids pick up new things and add it to their culture. Then the country is full of poeple that are different in many ways but yet have similarities.\n \n I don't know how this is suppose to be a melting pot if someone comes to this country and is suppose to be given culture but never gets to shar theirs.\n\n \n A critical part of melting pot theory was that as new cultures arrived in America they shared their best traits with the whole of the country. In turn they assimilated the best traits of all the other cultures before them. It is a bi-directional model in theory. \n \n In practice the 'melting pot' transformation never occured. Immigrants and non-immigrants did not mix together and forge a coherent 'American culture' in the classic sense of the word. (One could make a pretty strong argument that America's current primary cultural marker is consumerism, but that is not seen as a traditional cultural-esque value.) There are many reasons for this lack of melding on all sides of the issue. Certain groups wished to remain together, other groups wished for those groups to remain separate unto themselves, blatent racism/ethnicism, geographic obstacles, linguistic barriers, and so on.\n \n The primary reason, in my opinion, the melting pot theory didn't work is explained by the dual nature of culture. While culture is a group phenomenon it is transmitted through an individual's interactions with others. This can be as simple as parent-to-child or as complex as businessperson to employee. But without a uniform distribution of individuals, with respect to cultural background, throughout the population as a whole this model cannot work. It is my guess that people at the time didn't quite understand the mechanisms of acculturation otherwise they would not have proposed such a far-fetched theory.\n \n Whistler", 
   {}, 
   53456, 
   null, 
   1086883740.0
  ], 
  [
   53471, 
   null, 
   "whistler", 
   "If you beleive that Native Americans came from somewhere else than I guess we should eliminate indigenous from the dictionary becaue nothing would be indigenous to America.\n\n \n A more appropriate term to describe Native Americans would be Aboriginal Americans. The definition of aboriginal from Merriam-Webster is \"being the first or earliest known of its kind present in a region\".\n \n The term native is more associated with the circumstances of one's birth. Native, as reported by Merriam-Webster, is : \"belonging to a particular place by birth...and...belonging to or associated with one by birth\". \n \n In the strictest sense of the words you and I are both native Americans. However the political meaning of the words is quite different than the literal meaning. \n \n The meaning of indigenous is more vague that either aboriginal or native: having originated in and being produced, growing, living, or occurring naturally in a particular region or environment. In the most common sense of the word the human specie is not indiginous to the Americas, Europe, Asia, or Australia. Rather our species is indiginous to Africa alone (according to our best understanding of anthropology).\n \n Whistler\n \n \n \n \n PS I will say it chirps me off when someone refers to me as being European American.", 
   {}, 
   53455, 
   null, 
   1086884700.0
  ], 
  [
   53476, 
   null, 
   "Big Orn", 
   "PS I will say it chirps me off when someone refers to me as being European American.\n\n You forgot the hyphen, Whistler. How do you expect to get attention without it? emoticon_emb", 
   {}, 
   53471, 
   null, 
   1086885360.0
  ], 
  [
   53479, 
   null, 
   "whistler", 
   "You forgot the hyphen, Whistler. How do you expect to get attention without it? emoticon_emb\n\n \n Well, being a hyphenated American also chirps me off. I had to leave it out so my blood pressure could get back to normal. ;) \n \n \n Whistler", 
   {}, 
   53476, 
   null, 
   1086885480.0
  ], 
  [
   53675, 
   null, 
   "CCR1994", 
   "This discussion topic would be of no value and of no interest to anyone if we simply accepted the obvious: nobody has to adopt the rituals, customs, tastes or lifestyle choices of a particular culture. We are not forced to act like our \"color\" whatever in god's name that might mean. My skin color does not govern my taste in music, my dietary choices do not alter my ethnicity. The primary characteristic of our culture is freedom of choice. Does this settle anything?", 
   {
    "post_info": {
     "post_title": "Is one compelled or coerced?"
    }
   }, 
   53479, 
   null, 
   1087063440.0
  ], 
  [
   53684, 
   null, 
   "CCR1994", 
   "Something else I've been meaning to address. I've heard that some minority advocates think the SAT test is culturally biased. This is supposed to explain why whites outperform blacks on the test. I have to ask myself what is meant by this. Are they implying that blacks should be answering a different set of questions or given credit for different answers to the same questions? The SAT was to my knowledge supposed to help eliminate bias in college admissions and now the test itself is considered biased. How nice. It seems to me that blacks are not knowledgeable enough to take the test. This could be the result of poor schooling which in turn could be the result of discrimination. I fully accept that as a possibility. So why don't we focus on how to better educate blacks so they can perform better on the test as it is? Changing the test while not addressing the schooling they recieve will only serve to handicap black students.", 
   {}, 
   53675, 
   null, 
   1087067640.0
  ], 
  [
   53685, 
   null, 
   "whistler", 
   "This discussion topic would be of no value and of no interest to anyone if we simply accepted the obvious: nobody has to adopt the rituals, customs, tastes or lifestyle choices of a particular culture. We are not forced to act like our \"color\" whatever in god's name that might mean. My skin color does not govern my taste in music, my dietary choices do not alter my ethnicity. The primary characteristic of our culture is freedom of choice. Does this settle anything?\n\n \n Very much like how nobody has to accept English as their language of choice, right? I mean, if wanted to I could choose to eat only authentic Maori cuisine. After all, it is about freedom of choice as you say.\n \n Well that freedom of choice is fine and dandy but there is also a matter of expediency involved. While I could choose to learn and speak only Tagalog if I so chose, it would be quite a foolish choice. Nobody around me speaks it (except my friend's neighbors, nice people by the way), nobody at work speaks it, and I would be functionally useless if I chose to take on certain aspects of this Philipino culture. \n \n If you are surrounded by people who think and behave in certain ways it behooves you to think and act like them. The consequences of not doing so can be far ranging and vary from mildly uncomfortable to quite dangerous. Imagine if you chose to only speak Klingon--I'm pretty sure that you would be an inpatient at a mental hospital before long. Think about ethnic cleansing or genocide--it is all about one group with power 'punishing' people for not being like them.\n \n It boils down to this: 1. You have a choice to do anything you wish, 2. All your decisions have consequences, some of them negative, 3. Rational thinking people avoid making decisions that lead to negative consequences, 4. Thus, rational people don't functionally have a full freedom of choice in all aspects of their lives.\n \n So when you say people don't need to act their 'color', that is not true. In order to survive and thrive in an environment where everyone is the same 'color' as you are, you better be able to walk the walk and talk the talk. Because if you can't, the group will cut you off. Or, in the worst case scenario, cut you up.\n \n Whistler", 
   {}, 
   53675, 
   null, 
   1087067700.0
  ], 
  [
   53686, 
   null, 
   "CCR1994", 
   "Very much like how nobody has to accept English as their language of choice, right? I mean, if wanted to I could choose to eat only authentic Maori cuisine. After all, it is about freedom of choice as you say.\n \n Well that freedom of choice is fine and dandy but there is also a matter of expediency involved. While I could choose to learn and speak only Tagalog if I so chose, it would be quite a foolish choice. Nobody around me speaks it (except my friend's neighbors, nice people by the way), nobody at work speaks it, and I would be functionally useless if I chose to take on certain aspects of this Philipino culture. \n \n If you are surrounded by people who think and behave in certain ways it behooves you to think and act like them. The consequences of not doing so can be far ranging and vary from mildly uncomfortable to quite dangerous. Imagine if you chose to only speak Klingon--I'm pretty sure that you would be an inpatient at a mental hospital before long. Think about ethnic cleansing or genocide--it is all about one group with power 'punishing' people for not being like them.\n \n It boils down to this: 1. You have a choice to do anything you wish, 2. All your decisions have consequences, some of them negative, 3. Rational thinking people avoid making decisions that lead to negative consequences, 4. Thus, rational people don't functionally have a full freedom of choice in all aspects of their lives.\n \n So when you say people don't need to act their 'color', that is not true. In order to survive and thrive in an environment where everyone is the same 'color' as you are, you better be able to walk the walk and talk the talk. Because if you can't, the group will cut you off. Or, in the worst case scenario, cut you up.\n \n Whistler\n\n \n We may be discussing two different things. Of course it is imperative that we speak the same language if we are to understand each other. But my point is more on the level of disputing the idea that our DNA or genes govern in any way shape or form our lifestyle choices. This is what is meant by acting ones color. I find it odd incidentally that a black person would be ostracized for say listening to Frank Sinatra or Britney Spears as opposed to Snoop Dog or Arethra Franklin. Why would or should anyone care? I eat Mexican, Chinese and Italian food from time to time. Does this alienate my German roots?", 
   {}, 
   53685, 
   null, 
   1087068780.0
  ], 
  [
   53701, 
   null, 
   "whistler", 
   "We may be discussing two different things. Of course it is imperative that we speak the same language if we are to understand each other. But my point is more on the level of disputing the idea that our DNA or genes govern in any way shape or form our lifestyle choices. This is what is meant by acting ones color. I find it odd incidentally that a black person would be ostracized for say listening to Frank Sinatra or Britney Spears as opposed to Snoop Dog or Arethra Franklin. Why would or should anyone care? I eat Mexican, Chinese and Italian food from time to time. Does this alienate my German roots?\n\n \n I think we are perhaps thinking about different things.\n \n Culture has very little, if anything, to do with DNA. Culture is defined as a set of norms, beliefs and behaviors that identify and set apart a group of people. Teenagers have their own distinct culture. As do doctors and university professors. Elderly in nursing homes have a distinct culture just like each professional sports team. More importantly a person can belong to several cultures at once. I could be a student, a parent, a member of my community softball team and a construction worker. Each of those 'hats' places me in a different culture where I would be expected to act or behave in certain ways.\n \n Ethnicity is different. Ethnicity is typically seen as a genetically defined group. That is, you are a member of this group based on some inherited charicteristics. It is not a choice. \n \n Ethnicity and culture are not synonymous. I could be a black male who is a doctor that vehemently rejects the street culture of rap artists (with whom I share ethnicity). However, while ethnicity and culture are not synonymous, there is a tremendous amount of overlap--I think. Jewish people for example, are an ethnic group that show a substantial amount of cultural cohesiveness. Again, though this is not a perfect relationship. There are many different Jewish sub-cultures: Ultra-Orthodox, Askanazic(sp) Jews, reform Jews, non-practicing Jews, etc.\n \n However being a member of these Jewish sub-cultures is not a function of genetics by any means--perhaps a function of birth, but not genes.\n \n I think you can also say the same for other any other ethnicity on the planet. Many of these people share many elements of a common culture but the relationship is less than perfect. And while you are right, someone could reject the elements of that culture if they so choose, it is clear they will lose the support of people within that culture. (Think about a teenager who defies the school culture, either by being a goth, being gay, or enjoying Frank Sinatra. Yep, these kids are going to have it rough.)\n \n Whether you find it 'odd' or not doesn't change this simple fact.\n \n \n \n Whistler", 
   {}, 
   53686, 
   null, 
   1087084200.0
  ], 
  [
   53732, 
   null, 
   "CCR1994", 
   "I think we are perhaps thinking about different things.\n \n Culture has very little, if anything, to do with DNA. Culture is defined as a set of norms, beliefs and behaviors that identify and set apart a group of people. Teenagers have their own distinct culture. As do doctors and university professors. Elderly in nursing homes have a distinct culture just like each professional sports team. More importantly a person can belong to several cultures at once. I could be a student, a parent, a member of my community softball team and a construction worker. Each of those 'hats' places me in a different culture where I would be expected to act or behave in certain ways.\n \n Ethnicity is different. Ethnicity is typically seen as a genetically defined group. That is, you are a member of this group based on some inherited charicteristics. It is not a choice. \n \n Ethnicity and culture are not synonymous. I could be a black male who is a doctor that vehemently rejects the street culture of rap artists (with whom I share ethnicity). However, while ethnicity and culture are not synonymous, there is a tremendous amount of overlap--I think. Jewish people for example, are an ethnic group that show a substantial amount of cultural cohesiveness. Again, though this is not a perfect relationship. There are many different Jewish sub-cultures: Ultra-Orthodox, Askanazic(sp) Jews, reform Jews, non-practicing Jews, etc.\n \n However being a member of these Jewish sub-cultures is not a function of genetics by any means--perhaps a function of birth, but not genes.\n \n I think you can also say the same for other any other ethnicity on the planet. Many of these people share many elements of a common culture but the relationship is less than perfect. And while you are right, someone could reject the elements of that culture if they so choose, it is clear they will lose the support of people within that culture. (Think about a teenager who defies the school culture, either by being a goth, being gay, or enjoying Frank Sinatra. Yep, these kids are going to have it rough.)\n \n Whether you find it 'odd' or not doesn't change this simple fact.\n \n \n \n Whistler\n\n \n What do you make of the rift between Bill Cosby and the civil rights leadership? Obviously you have a clash of sub-cultures here, one side saying that young blacks should shape up and fly right and the other essentially dismissing this as elitist and an effort to blame the \"victim\". I think this may be at least partly generational with Cosby representing the grandparents and the civil rights leaders the youth. I can picture a conversation between Cosby and some young hip black teen going something like this: Cosby \"why must you talk that way? How do you expect to make in the real world? You can't become a doctor or a lawyer or a business owner with that kind of language and attitude!\" young black teen \"screw you Mr Cosby, you aint got nuthin to say to me. I don't want none of that what you call college and all. I got better things to do than become some doctor or lawyer **** like that.\"", 
   {}, 
   53701, 
   null, 
   1087138740.0
  ], 
  [
   57200, 
   null, 
   "mana'ia", 
   "Something else I've been meaning to address. I've heard that some minority advocates think the SAT test is culturally biased. This is supposed to explain why whites outperform blacks on the test. I have to ask myself what is meant by this. Are they implying that blacks should be answering a different set of questions or given credit for different answers to the same questions? The SAT was to my knowledge supposed to help eliminate bias in college admissions and now the test itself is considered biased. How nice. It seems to me that blacks are not knowledgeable enough to take the test. This could be the result of poor schooling which in turn could be the result of discrimination. I fully accept that as a possibility. So why don't we focus on how to better educate blacks so they can perform better on the test as it is? Changing the test while not addressing the schooling they recieve will only serve to handicap black students.\n\n \n just to expand your mind.\n \n \n Cross-Cultural Communication:\n An Essential Dimension of Effective Education\n \n --------------------------------------------------------------------------------\n \n Table VI:\n Sources of Communication Biases and Communication Related Biases in Tests and Assessment Procedures\n \n --------------------------------------------------------------------------------\n \n Situational Bias Mismatches between examiner and examinee regarding the societal rules of language, e.g., sarcastic answers to obvious questions. (Examiner: What time does the clock say? Examinee: Everybody knows clocks don't talk.) \n Directions Bias Test directions involve linguistic complexities unfamiliar to the examinee, e.g., \"None of the following is true except . . .\" is incorrectly interpreted as \"all of the following are true except . . .\" \n Value Bias Examinee is required to exhibit a particular moral or ethical preference, e.g., \"One who is dishonest is a) an offender, b) a politician, c) an ambassador, d) an officer.\" One might presume each choice to be reasonable. \n Linguistic Bias Test presumes that examinee is competent in standard English, e.g., \"Which sentence is ungrammatical? a) They saw Rose. b) You done it wrong. c) My brother has never eaten. d) Don't use too much.\" A nonstandard English speaker might see each as grammatical. \n Format Bias Test procedures or requirements are inconsistent with examinee's cognitive and/or learning style, e.g., \"Select the best answer to the following . . .\" One might consider answers to be either right or wrong, thereby no such thing as a best answer if all are correct. \n Cultural Misinterpretation Examiner erroneously interprets cultural practices of examinee, e.g., a child who exhibits silence as a natural reaction to an unfamiliar adult examiner is diagnosed as nonverbal, or a child who does not respond quickly to test items is labeled unknowledgeable. \n Stimulus Bias Examiner presents stimuli rich in objects and analytical materials to an examinee who prefers a field dependent cognitive style, and is more likely to be responsive to materials rich in social content \n \n http://www.nwrel.org/cnorse/booklets/ccc/table6.html\n \n A widely-cited example of possible cultural bias appeared in the Scholastic Aptitude Test in the early 90s: \n \n Runner: marathon\n A) Envoy: embassy\n B) Martyr: massacre\n C) Oarsman: regatta \n D) Referee: tournament \n E) Horse: stable. \n \n (Herrnstein and Murray, 1994) According to many, the answer, C), is more likely to be answered correctly by upper class children (predominantly white) because they are more inclined to know the definition of regatta. \n \n http://pkstyle.jangness.com/PKIQ.html", 
   {}, 
   53684, 
   null, 
   1089385080.0
  ], 
  [
   57203, 
   null, 
   "manuel", 
   "just to expand your mind.\n \n \n Cross-Cultural Communication:\n An Essential Dimension of Effective Education\n \n --------------------------------------------------------------------------------\n \n Table VI:\n Sources of Communication Biases and Communication Related Biases in Tests and Assessment Procedures\n \n --------------------------------------------------------------------------------\n \n Situational Bias Mismatches between examiner and examinee regarding the societal rules of language, e.g., sarcastic answers to obvious questions. (Examiner: What time does the clock say? Examinee: Everybody knows clocks don't talk.) \n Directions Bias Test directions involve linguistic complexities unfamiliar to the examinee, e.g., \"None of the following is true except . . .\" is incorrectly interpreted as \"all of the following are true except . . .\" \n Value Bias Examinee is required to exhibit a particular moral or ethical preference, e.g., \"One who is dishonest is a) an offender, b) a politician, c) an ambassador, d) an officer.\" One might presume each choice to be reasonable. \n Linguistic Bias Test presumes that examinee is competent in standard English, e.g., \"Which sentence is ungrammatical? a) They saw Rose. b) You done it wrong. c) My brother has never eaten. d) Don't use too much.\" A nonstandard English speaker might see each as grammatical. \n Format Bias Test procedures or requirements are inconsistent with examinee's cognitive and/or learning style, e.g., \"Select the best answer to the following . . .\" One might consider answers to be either right or wrong, thereby no such thing as a best answer if all are correct. \n Cultural Misinterpretation Examiner erroneously interprets cultural practices of examinee, e.g., a child who exhibits silence as a natural reaction to an unfamiliar adult examiner is diagnosed as nonverbal, or a child who does not respond quickly to test items is labeled unknowledgeable. \n Stimulus Bias Examiner presents stimuli rich in objects and analytical materials to an examinee who prefers a field dependent cognitive style, and is more likely to be responsive to materials rich in social content \n \n http://www.nwrel.org/cnorse/booklets/ccc/table6.html\n \n A widely-cited example of possible cultural bias appeared in the Scholastic Aptitude Test in the early 90s: \n \n Runner: marathon\n A) Envoy: embassy\n B) Martyr: massacre\n C) Oarsman: regatta \n D) Referee: tournament \n E) Horse: stable. \n \n (Herrnstein and Murray, 1994) According to many, the answer, C), is more likely to be answered correctly by upper class children (predominantly white) because they are more inclined to know the definition of regatta. \n \n http://pkstyle.jangness.com/PKIQ.html\n\n \n \n You must be kidding me with this post. I can't believe someone could be so ignorant as to justify that African-Americans don't perform as well because \"upper class children (predominantly white)...are more inclined to know the definition of regatta\". That just shows that the test is biased towards people who are more intelligent. You actually believe that the SAT is biased toward whites? No matter what any white person does, someone will always try and find something wrong with it or claim that it's racist or biased. I personally think someone who can't figure out how to interpet \"None of the following is true except\" and thinks it is \"all of the following are true except\" shouldn't even bother taking the SAT. That is not being biased toward whites, it's just learning how to read the English language.\n \n \nLinguistic Bias Test presumes that examinee is competent in standard English, e.g., \"Which sentence is ungrammatical? a) They saw Rose. b) You done it wrong. c) My brother has never eaten. d) Don't use too much.\" A nonstandard English speaker might see each as grammatical\n\n \n \n There are whites out there who are the same way. You shouldn't be applying to Harvard or Yale if you can't speak English properly. This will show in your test results.\n \n \n \nFormat Bias Test procedures or requirements are inconsistent with examinee's cognitive and/or learning style, e.g., \"Select the best answer to the following . . .\" One might consider answers to be either right or wrong, thereby no such thing as a best answer if all are correct. \n\n \n \n This is used to make people think about what the best answer is. It used to see how they will react to certain situations. I can't believe you actually believe that some of these things are biased. If you have to claim that \"standardized\" tests are biased to help out other people, you have serious problems. The test is actually biased towards people who are smart; it separates the elite from the average. Get some help.", 
   {}, 
   57200, 
   null, 
   1089386040.0
  ], 
  [
   59111, 
   null, 
   "mana'ia", 
   " You must be kidding me with this post. I can't believe someone could be so ignorant as to justify that African-Americans don't perform as well because \"upper class children (predominantly white)...are more inclined to know the definition of regatta\". That just shows that the test is biased towards people who are more intelligent. You actually believe that the SAT is biased toward whites? No matter what any white person does, someone will always try and find something wrong with it or claim that it's racist or biased. I personally think someone who can't figure out how to interpet \"None of the following is true except\" and thinks it is \"all of the following are true except\" shouldn't even bother taking the SAT. That is not being biased toward whites, it's just learning how to read the English language.\n\n Why is it then that teh biggest correlation then is not race but income? it jsut happens taht most minorities are lower income so they do worse? \n http://www.sq.4mg.com/IQincome.htm\n \n \n \n \n There are whites out there who are the same way. You shouldn't be applying to Harvard or Yale if you can't speak English properly. This will show in your test results.\n\n that is true but when you use subject matter such as regattas, investments, and other things commonly associated wiht higher incomes it is bias.\n \n \n \n \n \n \n This is used to make people think about what the best answer is. It used to see how they will react to certain situations. I can't believe you actually believe that some of these things are biased. If you have to claim that \"standardized\" tests are biased to help out other people, you have serious problems. The test is actually biased towards people who are smart; it separates the elite from the average. Get some help. \n\n \n If you can;t copmprehend how tehre could be a bias then how can I help you out. If you jsut say oh teh people taht do the best are the smartest then of course you don;t see teh bias. Men do better than women on the SAT's but way out perform them in college. /so what does that mean?", 
   {}, 
   57203, 
   null, 
   1090375260.0
  ], 
  [
   60461, 
   null, 
   "Mach", 
   "Sorry, but:\n regatta\n \n is pure ivy-leage language. Most people would get this from either being a very, very avid reader, or by having gone to a school where you have a boat team. I think most low-income schools have boat teams, what gives? That's certainly a good example. \n \n -mach", 
   {
    "post_info": {
     "post_title": "regatta"
    }
   }, 
   59111, 
   null, 
   1091253600.0
  ], 
  [
   60463, 
   null, 
   "Bush Is The Man", 
   "Wow, I tried to read your post, but somehow your lack of grammar made it hard to do so. So, I am going to do my best to interpret it.\n \n \n \n \nWhy is it then that teh biggest correlation then is not race but income? it jsut happens taht most minorities are lower income so they do worse? \n http://www.sq.4mg.com/IQincome.htm?\n\n \n \n The SAT is a STANDARDIZED test. So if you claim that words like \"regatta\" are only going to be known by those with higher incomes, what do you propose to do to fix that? Only allow those under a certain income to take it? Give the poor a certain number of points extra to compensate? I am not rich nor do I own a boat, but I know what a regatta is. That is a terrible example of trying to explain what biased is. And then having the guts to say \"Directions Bias Test directions involve linguistic complexities unfamiliar to the examinee, e.g., \"None of the following is true except . . .\" is incorrectly interpreted as \"all of the following are true except\"\". If you can speak any lick of English, you should be able to understand that. My 10 year old cousin knows what that says. And don't blame how you were brought up or in what environment you were brought up in as a means to show bias. \n \"Linguistic Bias Test presumes that examinee is competent in standard English, e.g., \"Which sentence is ungrammatical? a) They saw Rose. b) You done it wrong. c) My brother has never eaten. d) Don't use too much.\" A nonstandard English speaker might see each as grammatical.\" Just because the people they grew up with or the environment they grew up in made them speak a certain way, that doesn't make the test biased. In US schools, US English is taught. If your first language isn't English, then you take a TOEFL (Test of English as a Foreign Language) instead of the SAT. Maybe they need to make one for those who speak Ebonics, that way those who don't speak US English can stop complaining about the SAT being biased.\n \n \n \nthat is true but when you use subject matter such as regattas, investments, and other things commonly associated wiht higher incomes it is bias.\n\n \n \n Those words aren't too difficult. Loan, regatta, boat, stock, etc. Those are fairly common words. Shouldn't you know those words by the time you are in 11th grade (age 17)? If not, you're not going to learn it in college. They will expect that you know what they are. The test is to separate the elite from the average, and the average from the weak. If there were words like \"house\" and \"car\", everyone would do extremely well and there would be no point for the test because it wouldn't show anything.\n \n \n \n \n \nIf you can;t copmprehend how tehre could be a bias then how can I help you out. If you jsut say oh teh people taht do the best are the smartest then of course you don;t see teh bias. Men do better than women on the SAT's but way out perform them in college. /so what does that mean?\n\n \n \n \n First, try to at least spell the words close to their proper way. That said, I can comprehend bias. Using the word \"regatta\" is by no means biased. How do women outperform men in college? What do you base that on? GPA, exit exams, graduate prep tests (GMAT, LSAT, etc), or what? There is no way to gauge that. Even if women did best, what are you trying to prove by that. My argument was that the SAT is about as standardized as it can get. I didn't say anything about women or men in it.", 
   {}, 
   59111, 
   null, 
   1091256240.0
  ], 
  [
   60465, 
   null, 
   "Bush Is The Man", 
   "Sorry, but:\n regatta\n \n is pure ivy-leage language. Most people would get this from either being a very, very avid reader, or by having gone to a school where you have a boat team. I think most low-income schools have boat teams, what gives? That's certainly a good example. \n \n -mach\n\n \n \n Dumbest statement ever. So should we eliminate all \"Ivy-Leage language\" from the curriculum? Or maybe even all words over 10 letters for that matter, since most low-income children won't know what they are since they aren't \"Ivy-League\"? You might also hear the word \"regatta\" by reading a book, going to English class, or maybe even just being ALIVE. Are we becoming prejudice towards words? Are some words \"bad\"? I can't believe you think the SAT is biased because low-income people don't know what a regatta is. I guess there are people out there who will complain about everything possible, and by any means possible.", 
   {}, 
   60461, 
   null, 
   1091256480.0
  ], 
  [
   60618, 
   null, 
   "Mach", 
   "Dumbest statement ever. So should we eliminate all \"Ivy-Leage language\" from the curriculum? Or maybe even all words over 10 letters for that matter, since most low-income children won't know what they are since they aren't \"Ivy-League\"? You might also hear the word \"regatta\" by reading a book, going to English class, or maybe even just being ALIVE. Are we becoming prejudice towards words? Are some words \"bad\"? I can't believe you think the SAT is biased because low-income people don't know what a regatta is. I guess there are people out there who will complain about everything possible, and by any means possible.\n\n \n I'd argue that the statement \"Bush Is The Man\" is the dumbest statement ever, but that would be off-topic.\n \n \ncan't believe you think the SAT is biased because low-income people don't know what a regatta is. \n\n \n I don't doubt you can't believe that, since I never said anything like that. You assumed...anything else?", 
   {
    "post_info": {
     "post_title": "bitm"
    }
   }, 
   60465, 
   null, 
   1091405280.0
  ], 
  [
   60628, 
   null, 
   "Bush Is The Man", 
   "I'd argue that the statement \"Bush Is The Man\" is the dumbest statement ever, but that would be off-topic.\n\n \n \n I guess you had to resort to that comment because you had no response to what I said. I guess I was right emoticon_xbye \n \n \n \n \nI don't doubt you can't believe that, since I never said anything like that. You assumed...anything else?\n\n \n \n \n Ok, what do you consider \"Ivy-League\", in terms of words? Sorry, let me correct myself. You think the SAT is biased because lower income people might not be familiar with \"Ivy-League\" jargon. I guess since some people just can't perform well on the test, they have to find some excuse to cover up for their stupidity.", 
   {}, 
   60618, 
   null, 
   1091414880.0
  ], 
  [
   63523, 
   null, 
   "Rick", 
   "I tend to think that the general american white man (or argueable any man) is a void at birth, with no specific attributes as inherent; these are earned or boasted on them with experience, time, and knowledge. Out of all the races, white people seem to be outside of all the boxes, yet we have our own new paradigms of living. \n \n In the coarse of thirty years, think about how the general culture of white people has changed. I do not believe most countries have changed as much as America, and mostly because of it's dynamics. I do believe this won't be isolated to white people only, yet I believe the white culture has embraced an individualist view, more so than any other--perhaps more appropriately a rebellious point of view.\n \n \n I live in the most diverse area in the world, and I can honestly tell you that many people within certain races seem almost stereotypical, (this is even true of white people). Although with each new generation there seems to be a different perspective, and a relief from past traditions; where each individual is forced to ask themself, 'what am I? what should I do with my life?'\n \n Within every other country or culture it's assigned to you, but for white people it's less than, (atleast from what I've seen). 'Making yourself' isn't a natural part of the human trend, it's a survival characteristic that involves the use of the brain. I tend to think that white people that have been here for sometime, are better off, since they must fill that void with their own interests, and desires. \n \n For better or for worse, the white culture is the leading component in America--maybe the world; and I happen to believe that this brand of 'individualism' is grand, just because it invokes the conciousness. Now only if it remains rational and social.", 
   {
    "post_info": {
     "post_title": "Individualism"
    }
   }, 
   46274, 
   null, 
   1093176900.0
  ], 
  [
   83544, 
   null, 
   "caicos2", 
   "For whatever it's worth culture is the way of life of a people including its customs, traditions, dress, food, technology, social institutions, and language. Language is the cornerstone of the culture of a people. There is no such thing as a \"white culture\". What most posters are referring to is \"American culture\". Dominant members (those in power) of a society are those who set the standards and establish the values and norms of that society. In the case of America, the dominant members were Europeans, especially those from England. They established the culture based on what they agreed with from their original countries or what they disagreed with from same countries. The culture was set based on their perception of their world at the time. This is not to say what they did or did not do is good or bad, it just is. As groups from other parts of the world moved in the culture changed in some ways to reflect the newcomers (especially in the areas of food and dress). Each new group arriving impacted the culture in some way. The first thing groups used to do (up until about 50 years ago) was to anglocise their name and to learn English so they would fit in better and have more opportunities. BTW there were no ESL classes back then, so it was even more inconvenient to learn the language. I personally love the additions and changes to our culture over the years that have come from the various immigrant groups. \n \n There is still, however, going to be an undeniable European/English flavor to the American culture because the constructs of the main social institutions were developed by that particular group. Americans who already live here and immigrants who move here have one of two choices, either adapt to the standards of the society or change them. Adapting to a culture does not mean that one has to give up their original culture, it means that one adds to their total culture. Surely, most of us have had to adapt to the majority around us at some point in time. One thing a society has to have to survive is cohesion on basic principles, better known as group concensus.\n \n In addressing the standardized test issue, one thing that has happened in schools is that we have \"dummied down\" the curriculum so much that students don't have to perform to pass because this might hurt their self-esteem. I am continually amazed at my students lack of general vocabulary when trying to explain a concept in Sociology or World History. I define more general vocabulary than I do jargon associated with the actual field of study.", 
   {}, 
   63523, 
   null, 
   1103688720.0
  ], 
  [
   86670, 
   null, 
   "Tigerlilly", 
   "Who cares what a Regatta is? Do you know how many words are in the English Language? Do you know them all? Hmm? I sincerely doubt it. I know many words, including more antidiluvial versions of words. I know lots of stupid ****. It doesn't mean I am the Oxford New Lexicon.\n \n You can't possible comprehend and know everything people throw at you. That's why they write dictionaries and the Thesaurus.\\\n \n Can't say you learn much in Highschool English. It's quite drab and boring. The curriculae aren't usually that competent. Most, if anything, I learned outside of class, but not everyone had that same luxury and freetime to **** away like I did. I had nothing more important to do than to do work/book/read, etc.", 
   {}, 
   83544, 
   null, 
   1105719480.0
  ], 
  [
   96248, 
   null, 
   "zelma", 
   "From what I am reading, seems there is a lot prejudice against white people. I wonder if you too are also white skinned. \n If I were to describe the white culture, based on my own culture, I would say:\n white people have a sense of family with the father as the head of the unit\n basically two elements of white culture, agricultural or city slicker\n white culture is innovative and creative in technology and machinery (won't list the many articles that whites have invented\n food suppliers for commerce (beef industry)\n traditionally soldiers and defenders of family and their country\n constantly berated by other cultures due to an imagined superiority (by other culture)they deem on themselves\n constantly being mentally punished for historical events\n diet consists of beans, cornbread, potatoes, meat\n commonly known as rednecks, if they take up for their own kind, a trait of the culture that dissimenation is bleeding from white culture\n that is enough... :p \n \n I wonder which culture mulattos, coyotes, etc. identify with--the mothers culture or the fathers culture\n \n white people really aren't bad people, there are bad people of every color and speaking of prejudice, blacks can be very prejudice and discrimmination occurs daily as proven on Black TV, Black Ms America, Ebony magazine--\n whites must include people of other color in all areas-or discrimmination is screamed,\n \n My father witnessed that a white man and a black man took a civil service exam to work for the post office--though the white man had the better score-the job was given to the black--merit tests for employment are supposed to go to the highest score--", 
   {}, 
   46274, 
   null, 
   1110326940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What the heck is \"white culture\"?", 
  "url": "http://www.4forums.com/political/civil-rights-debates/2241-what-heck-white-culture.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 2241, 
  "discussion_files": [
   [
    "24573.html", 
    "http://www.4forums.com/political/civil-rights-debates/2241-what-heck-white-culture-print.html"
   ], 
   [
    "24574.html", 
    "http://www.4forums.com/political/civil-rights-debates/2241-what-heck-white-culture-8-print.html"
   ], 
   [
    "24575.html", 
    "http://www.4forums.com/political/civil-rights-debates/2241-what-heck-white-culture-6-print.html"
   ], 
   [
    "24576.html", 
    "http://www.4forums.com/political/civil-rights-debates/2241-what-heck-white-culture-4-print.html"
   ], 
   [
    "24577.html", 
    "http://www.4forums.com/political/civil-rights-debates/2241-what-heck-white-culture-5-print.html"
   ], 
   [
    "24578.html", 
    "http://www.4forums.com/political/civil-rights-debates/2241-what-heck-white-culture-7-print.html"
   ], 
   [
    "24579.html", 
    "http://www.4forums.com/political/civil-rights-debates/2241-what-heck-white-culture-3-print.html"
   ], 
   [
    "24580.html", 
    "http://www.4forums.com/political/civil-rights-debates/2241-what-heck-white-culture-2-print.html"
   ]
  ], 
  "identifier": 2241
 }
]