[
 [
  [
   45604, 
   null, 
   "JPSartre12", 
   "North Korea is now saying that the train which caused over 154 deaths and well over a thousand injuries was caused by negligence in handling ammonium nitrate fertilizer. Reports from the area said that the blast zone was ~1 mile in diameter.\n Do you buy their line of BS or do you think it was a train full of munitions? or rocket fuel as some have speculated?\n emoticon_rolleyes", 
   {
    "post_info": {
     "post_title": "Do You Believe N. Korean Train Contained Fertilizer"
    }
   }, 
   null, 
   null, 
   1082816040.0
  ], 
  [
   45609, 
   null, 
   "billsco", 
   "I'm sure intelligence agencies have sent spy planes aloft to sniff the air and have a good idea what has occurred. I'm in the skeptical camp when it comes to communist party veracity, but my conspiracy meter hasn't moved on this one. It appears genuine to date. \n \n Ammonium nitrate is a powerful explosive -- it was used in Oklahoma City I believe.", 
   {}, 
   45604, 
   null, 
   1082818260.0
  ], 
  [
   45614, 
   null, 
   "georged", 
   "What difference does it make? Are they not still a sovereign nation allowed to do as they want? I view them as China's gunslinger, much like we use Israel.", 
   {}, 
   45609, 
   null, 
   1082820660.0
  ], 
  [
   45618, 
   null, 
   "Haulingboat", 
   "It is very suspicous that Kim had just past thru the area. Perhaps a coincidence. Perhaps a narrow escape.", 
   {}, 
   45614, 
   null, 
   1082825160.0
  ], 
  [
   45625, 
   null, 
   "daewoo", 
   "You would have to mishandle the hell out of the fertilizer to get it to explode like that. First, you would have to mix it with a binding agent (usually they use fuel oil), then you would have to introduce a powerful charge in order for it to actually explode (dynamite is commonly used as a booster charge).\n \n Not saying it couldn't happen by accident, it would just be hard to do.", 
   {}, 
   45618, 
   null, 
   1082828100.0
  ], 
  [
   45683, 
   null, 
   "AMD4EVER", 
   "I wouldn't put it past the North Korea's to be able to make a mistake such as blowing themselves up with fertilizer but I still doubt this is what happened unless it was somehow intentionally done. But who really cares what was on the train anyways? I'm sure they ship rocket fuel around and ammuntion all the time. They are a very militaristic country.", 
   {}, 
   45604, 
   null, 
   1082861460.0
  ], 
  [
   46048, 
   null, 
   "sundowner", 
   "I wouldn't put it past the North Korea's to be able to make a mistake such as blowing themselves up with fertilizer but I still doubt this is what happened unless it was somehow intentionally done. But who really cares what was on the train anyways? I'm sure they ship rocket fuel around and ammuntion all the time. They are a very militaristic country.\n\n \n It is of great interest for the US to know what N Korea is doing at every minute. They have an absolute lunatic as a dictator, and share tight diplomatic relations with the Chinese...as well as a border. Didn't that train actually originate in China? Korea, a country that despite UN warnings, toys with the idea of building a nuclear arsenal (which they may already have, or potentially buy or borrow from China), is an unstable threat...especially with dictator lunatic and his hair in office. And remember China, that nation that is supposedly our friend...do you think for one minute that they would turn their backs on N. Korea in favor of the US? Not likely. Unfortunately, out of precedent, we will probably be forced with facing an Iraq-like situation in the future with N. Korea, one that will be a real threat to world peace. Sooner or later, we will catch them with nukes or components used to make nukes, and be expected to eliminate the threat. Just think about it, with so many eyes focused on Iraq, Afganistan, and Israel, it would be the perfect time for N. Korea to make a couple ICBM's.", 
   {}, 
   45683, 
   null, 
   1083054600.0
  ], 
  [
   46051, 
   null, 
   "daewoo", 
   "It is of great interest for the US to know what N Korea is doing at every minute. They have an absolute lunatic as a dictator, and share tight diplomatic relations with the Chinese...as well as a border. Didn't that train actually originate in China? Korea, a country that despite UN warnings, toys with the idea of building a nuclear arsenal (which they may already have, or potentially buy or borrow from China), is an unstable threat...especially with dictator lunatic and his hair in office. And remember China, that nation that is supposedly our friend...do you think for one minute that they would turn their backs on N. Korea in favor of the US? Not likely. Unfortunately, out of precedent, we will probably be forced with facing an Iraq-like situation in the future with N. Korea, one that will be a real threat to world peace. Sooner or later, we will catch them with nukes or components used to make nukes, and be expected to eliminate the threat. Just think about it, with so many eyes focused on Iraq, Afganistan, and Israel, it would be the perfect time for N. Korea to make a couple ICBM's.\n\n \n Supposedly N korea already has missiles that can reach the US, as well as a nuclear arsenal. This is why we haven't moved agressively against them. We don;t want to see several large cities disapear under a mushroom cloud.\n \n Unfortunatly, the greatest lesson other countries may have learned under Bush is not \"don't mess with America or we will steamroll you\" it is instead \"You had better develope your nukes quickly, because unles you pose an actual threat, we will steamroll you in the name of imaginary ones\".\n \n I don;t think \"catching\" them with nukes is a problem. They already admitted to posession of several of them to the UN. They know that we will seek a \"diplomatic\" solution rather than employ force, because unlike Iraq, N Korea can actually hit back in a big way. Realistically, IRaq was a defenseless nation that posed no threat at all to the US, and had no real backing form any other country. N Korea is a country that has already beat us in one war, apparently has nuclear weapons aimed at some of our cities, and has the backig of the most populated country on the planet. We are having trouble with the situation in Iraq. It is unwise to look at an attack on N Korea as some dirty little chore we may get handed to us.", 
   {}, 
   46048, 
   null, 
   1083055980.0
  ], 
  [
   46057, 
   null, 
   "AMD4EVER", 
   "Supposedly N korea already has missiles that can reach the US, as well as a nuclear arsenal. This is why we haven't moved agressively against them. We don;t want to see several large cities disapear under a mushroom cloud.\n\n \n Just to clear things up the nuclear missiles that North Korea supposedly has are about 1/7th the strength of our common nuclear missile. Theirs would take care of a few city blocks while ours would actually take care of entire cities especially when it comes to our larger ones.\n \n [/QUOTE]I don;t think \"catching\" them with nukes is a problem. They already admitted to posession of several of them to the UN. They know that we will seek a \"diplomatic\" solution rather than employ force, because unlike Iraq, N Korea can actually hit back in a big way. Realistically, IRaq was a defenseless nation that posed no threat at all to the US, and had no real backing form any other country. N Korea is a country that has already beat us in one war, apparently has nuclear weapons aimed at some of our cities, and has the backig of the most populated country on the planet. We are having trouble with the situation in Iraq. It is unwise to look at an attack on N Korea as some dirty little chore we may get handed to us.[/QUOTE]\n \n We are only forced to deal with North Korea diplomatically because they have China backing them. If Iran was to make nuclear weapons then chances are that we would be making war threats to them. Nukes and alliances are going to make North Korea hard to deal with. However China doesn't want North Korea to bring any trouble their way either so they may end up being the stabilizing force in this issue.\n \n I wouldn't give them credit for beating us in a war. They were pushed back to the Chinese border before China began to support them and helped them regain some land. In the end even the combined efforts ended with them getting only half of what they had originally taken control of before we arrived.", 
   {}, 
   46051, 
   null, 
   1083074220.0
  ], 
  [
   46096, 
   null, 
   "sundowner", 
   "Supposedly N korea already has missiles that can reach the US, as well as a nuclear arsenal. This is why we haven't moved agressively against them. We don;t want to see several large cities disapear under a mushroom cloud.\n \n Unfortunatly, the greatest lesson other countries may have learned under Bush is not \"don't mess with America or we will steamroll you\" it is instead \"You had better develope your nukes quickly, because unles you pose an actual threat, we will steamroll you in the name of imaginary ones\".\n \n I don;t think \"catching\" them with nukes is a problem. They already admitted to posession of several of them to the UN. They know that we will seek a \"diplomatic\" solution rather than employ force, because unlike Iraq, N Korea can actually hit back in a big way. Realistically, IRaq was a defenseless nation that posed no threat at all to the US, and had no real backing form any other country. N Korea is a country that has already beat us in one war, apparently has nuclear weapons aimed at some of our cities, and has the backig of the most populated country on the planet. We are having trouble with the situation in Iraq. It is unwise to look at an attack on N Korea as some dirty little chore we may get handed to us.\n\n \n You said the key word. Supposedly. We don't have proof that they exist, and N. Korea stating that they already have them could be nothing more than a smokescreen designed to keep us at bay...after all...like you said, who want's to attack them if they can fire something back at us. We do know by fact, at least up until the summer of 2003, that there is enough missing material from their reactors and extrusion facility that they may have enough weapons grade material to make up to 4 small warheads. We also know that the missiles N. Korea is developing have not actually been flight tested yet, and previous attempts to test such missiles (done in Iran) failed with the missile exploding at 105 seconds of the flight. When operational, these missiles might have the capability to reach the US, but currently it is doubtful that they now have any missiles capable of attacking the continental US.", 
   {}, 
   46051, 
   null, 
   1083086520.0
  ], 
  [
   46492, 
   null, 
   "emclean", 
   "We also know that the missiles N. Korea is developing have not actually been flight tested yet, and previous attempts to test such missiles (done in Iran) failed with the missile exploding at 105 seconds of the flight. When operational, these missiles might have the capability to reach the US, but currently it is doubtful that they now have any missiles capable of attacking the continental US.\n \n \n And the intelligence services told Bush there were WMD all through out Iraq. They are either XXXXXX, or know what they are talking about, not both.", 
   {}, 
   46096, 
   null, 
   1083185100.0
  ], 
  [
   46600, 
   null, 
   "JPSartre12", 
   "You would have to mishandle the hell out of the fertilizer to get it to explode like that. First, you would have to mix it with a binding agent (usually they use fuel oil), then you would have to introduce a powerful charge in order for it to actually explode (dynamite is commonly used as a booster charge).\n \n Not saying it couldn't happen by accident, it would just be hard to do.\n\n \n A freighter in Texas City Galveston Bay containing ammonium nitrate exploded and took out half of Galveston many, many years ago. http://web1.caryacademy.org/chemistry/rushin/StudentProjects/CompoundWebSites/2001/AmmoniumNitrate/history.htm", 
   {}, 
   45625, 
   null, 
   1083201480.0
  ], 
  [
   46635, 
   null, 
   "daewoo", 
   "WE actually studied that when I took Hazmat training years ago. Apparently the fuel tanks of the freighter ruptured becasue of the heat from the dock fire, and ended up follding the cargo bay (where hte ammonium nitrate was stored). While fuel oil is a prefered binder, diesel fuel works just fine. Something ont he ship exploded (we never did find out exactly what) and acted as a primer charge for the ammonuim nitrate.\n \n THis would pretty much fit my definition of \"mishandeling the hell out of\".", 
   {}, 
   46600, 
   null, 
   1083219180.0
  ], 
  [
   46645, 
   null, 
   "sundowner", 
   "And the intelligence services told Bush there were WMD all through out Iraq. They are either XXXXXX, or know what they are talking about, not both.\n\n \n It's not that simple. It's not like if they are wrong on one point that they are completely wrong on the other. Intelligence is a human endeavor, and as such, cannot be perfect. Looking at the history of Iraq in the preceding 20 years prior to today, it is not hard to imagine that they do have WMD, or at least had them right up until the point of the war. Where they are now...hard to say. Either burried somewhere, or one of their \"friends\" is hiding them. It's not like we are searching Egypt, Iran, Jordan...etc. They might be there, they might not, but I could care less. Better to deal with Saddam now than wait another ten years until he had stockpiles of scuds with chemical warheads or anthrax. Sooner or later he would have used them on one of his neighbors, or invaded another country and used them on us when we had to beat him back into Iraq. Regardless of whether they were there or not, Saddam and his regime were ticking timebombs, and I am glad he is gone.", 
   {}, 
   46492, 
   null, 
   1083221100.0
  ], 
  [
   46647, 
   null, 
   "sundowner", 
   "A freighter in Texas City Galveston Bay containing ammonium nitrate exploded and took out half of Galveston many, many years ago. http://web1.caryacademy.org/chemistry/rushin/StudentProjects/CompoundWebSites/2001/AmmoniumNitrate/history.htm\n\n \n Yes, believe it or not, ammonium nitrate is really a stable substance if it is not mixed with a binding agent, and even when it is, it needs a pretty good charge to detonate it. Isn't N. Korea claiming that a static charge from some power lines ignited the ammonium nitrate that was stored in tank cars? Not likely. Not even possible.", 
   {}, 
   46600, 
   null, 
   1083221400.0
  ], 
  [
   46668, 
   null, 
   "JPSartre12", 
   "Yes, believe it or not, ammonium nitrate is really a stable substance if it is not mixed with a binding agent, and even when it is, it needs a pretty good charge to detonate it. Isn't N. Korea claiming that a static charge from some power lines ignited the ammonium nitrate that was stored in tank cars? Not likely. Not even possible.\n\n \n I'm very familiar with ammonium nitrate. Many of my fellow rocket hobbyists use it in their propellant. Ammonium nitrate is classified as an explosive, but under \"normal\" conditions, it is relatively stable. To make solid rocket propellant, the prills or granules are ground finer. The finer the powder, the more reactive it is. Ammonium nitrate melts at a low temperature and easily forms pools of liquid in a fire. If it is confined, it will detonate as it did in Texas City, without a fuel source present. In bagged prill form it should be very safe to handle and NOT a static detonation risk unless a fine dust is present in enclosed tank cars. Under those conditions, even grain is an explosion risk.\n That being said, I don't believe N. Korea for a second. I think a munitions or rocket fuel train coming from China blew up.", 
   {}, 
   46647, 
   null, 
   1083247800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Do You Believe N. Korean Train Contained Fertilizer", 
  "url": "http://www.4forums.com/political/current-events-debates/2252-do-you-believe-n-korean-train-contained-fertilizer.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 2252, 
  "discussion_files": [
   [
    "20836.html", 
    "http://www.4forums.com/political/current-events-debates/2252-do-you-believe-n-korean-train-contained-fertilizer-print.html"
   ], 
   [
    "20837.html", 
    "http://www.4forums.com/political/current-events-debates/2252-do-you-believe-n-korean-train-contained-fertilizer-2-print.html"
   ]
  ], 
  "identifier": 2252
 }
]