[
 [
  [
   45636, 
   null, 
   "sglaine", 
   "We just learned this week a Nuclear power plant is missing fueling rods. this power plant is 15 miles from where we live. It is one of the oldist running nuclear plants in the country. 30 years going I think they should shut it down. I am afraid the we will be a nother 3 mile aileland. What are your thoughts on the subject? emoticon_rolleyes I wonder if Homer Simpson is running the show there?", 
   {
    "post_info": {
     "post_title": "Nuclear power!!!"
    }
   }, 
   null, 
   null, 
   1082834160.0
  ], 
  [
   46691, 
   null, 
   "emclean", 
   "If you don&#8217;t like the plant, move. I don&#8217;t have a problem with nuc power. If you want electricity, you get the consciences.", 
   {}, 
   45636, 
   null, 
   1083256080.0
  ], 
  [
   46732, 
   null, 
   "JPSartre12", 
   "We just learned this week a Nuclear power plant is missing fueling rods. this power plant is 15 miles from where we live. It is one of the oldist running nuclear plants in the country. 30 years going I think they should shut it down. I am afraid the we will be a nother 3 mile aileland. What are your thoughts on the subject? emoticon_rolleyes I wonder if Homer Simpson is running the show there?\n\n \n I think that they should run it until your neighborhood glows. :)\n Seriously, if it's 30 years old, it probably is getting close to the end of its life cycle.", 
   {}, 
   45636, 
   null, 
   1083268020.0
  ], 
  [
   46794, 
   null, 
   "daewoo", 
   "We just learned this week a Nuclear power plant is missing fueling rods. this power plant is 15 miles from where we live. It is one of the oldist running nuclear plants in the country. 30 years going I think they should shut it down. I am afraid the we will be a nother 3 mile aileland. What are your thoughts on the subject? emoticon_rolleyes I wonder if Homer Simpson is running the show there?\n\n \n Don't worry about it. A nuke plant loosing a few fuel rods is not that uncommon. They almost always find them later, usually misbundled. Not too long ago the nuke plant not far from my house lost quite a few rods. Apparentlt the standard tracking protocalls utilized by US nuke plants have some flaws (namely that they are WAY over complicated and a small error anywhere in the process can make fuel rods \"disapear\"). They do an inventory, actually open the containers and count material (instead of just reying on the bar code on the container) and they find the missing rods. At the plant near me, they actually found MORE rods than were missing. THis is what happens when you have guidlines set by commitee.\n \n Nuke power is safe, clean and efficient. There can not be another 3 mile island in the us (or most of the rest of the world). Now we have improved instrumentation and better secondary systems, included automated shut down systems. The accident at 3 mile island was caused by a faulty pressure valve. You would NEVER find a crucial component like that without a backup in a currently operating nuclear plant.", 
   {}, 
   45636, 
   null, 
   1083290880.0
  ], 
  [
   46801, 
   null, 
   "sglaine", 
   "Dawoo where is your plant located Mine is in VT. This plant also has other issues I hope they shut it down before something happens. this place is runned by Homer Simpson. I swear emoticon_cool", 
   {}, 
   46794, 
   null, 
   1083292020.0
  ], 
  [
   46815, 
   null, 
   "daewoo", 
   "Dawoo where is your plant located Mine is in VT. This plant also has other issues I hope they shut it down before something happens. this place is runned by Homer Simpson. I swear emoticon_cool\n\n \n The one by me is Wolf Creek (in kansas). I think that some of the big issues w/ nuclear power plants is that every little burp or problem at the plant turns into a huge deal.\n \n Last year, our local paper carried news about a safety system failure at wolf creek. They questioned the safety of nuclear power, and made a big deal about how important the sfety systems at a nuke power plant,m and how we were all in danger if they failed.\n \n The \"safety system failure\" was a bad fire alarm door switch (you know the doors that say \"alarm will sound\"). It was found during a safety inspection, and as per NRC regulations, the pertinent paperwork was done. In most places it never would have been found, and if it was, a new $4 switch would have been installed. No big deal. But since it was at the nuclear plant, they turned it onto some kind of big fiasco. According to the NRC (nuclear regulatory comission) there are 0.10 serious problems per nuclear plant per year. Even their definition of \"serios problem\" errs pretty heavily on the side of safety. A pressure relief valve failing today still counts as a \"Serios proble\" though there is now triple redundancy on these, special sensors installed so the people in the control room know EXACTLY what is goin on with them, plus TWO manual systems in case all FOUR of the primary systems fail. Most plants also have systems in place so any time anything unusual happens (like a pressure valve popping) somebody is sent to visually inspect the unit (When possible) until the situation is green boarded (declared over).", 
   {}, 
   46801, 
   null, 
   1083296460.0
  ], 
  [
   46855, 
   null, 
   "Waxy", 
   "Dawoo where is your plant located Mine is in VT. This plant also has other issues I hope they shut it down before something happens. this place is runned by Homer Simpson. I swear emoticon_cool\n\n \n sglaine, your paranoia regarding nuclear power is unfounded. The nuclear power generation sector has the best safety record of ANY industrial, commercial, private, or service industry, PERIOD.\n \n Waxy", 
   {}, 
   46801, 
   null, 
   1083342120.0
  ], 
  [
   46954, 
   null, 
   "sglaine", 
   "sglaine, your paranoia regarding nuclear power is unfounded. The nuclear power generation sector has the best safety record of ANY industrial, commercial, private, or service industry, PERIOD.\n \n Waxy\n\n Paranoia no way you need to do some studies on this plant it's history etc. Now waxy I am not against nuclear power I am against poor management it is real bad. it is a Homer Simpson environment. It has been open for 30 years it needs a overhaul or a permanent shutdown.", 
   {}, 
   46855, 
   null, 
   1083367140.0
  ], 
  [
   46956, 
   null, 
   "sglaine", 
   "I think that they should run it until your neighborhood glows. :)\n Seriously, if it's 30 years old, it probably is getting close to the end of its life cycle.\n\n Yea there going to see if they can get 20 more out of her. That in my book is scary.", 
   {}, 
   46732, 
   null, 
   1083367260.0
  ], 
  [
   46961, 
   null, 
   "Waxy", 
   "Paranoia no way you need to do some studies on this plant it's history etc. Now waxy I am not against nuclear power I am against poor management it is real bad. it is a Homer Simpson environment. It has been open for 30 years it needs a overhaul or a permanent shutdown.\n\n \n What are you basing this opinion on? Have you seen safety studies? Can you give me some specific examples of management problems? \n \n Do you understand how a nuclear reactor works?\n \n Waxy", 
   {}, 
   46954, 
   null, 
   1083369840.0
  ], 
  [
   46968, 
   null, 
   "sglaine", 
   "What are you basing this opinion on? Have you seen safety studies? Can you give me some specific examples of management problems? \n \n Do you understand how a nuclear reactor works?\n \n Waxy\n\n Two missing fuel rods last week. Security issues in the past They saying possible cracks were there should not be there. They have a lot of unanswered ?? to the community. The thing of it is its old and needs to be reevaluated. I do not know were you live but see my point its time to retire the plant. emoticon_xdonno The thing of it is I really don't understand how a reactor works but I can tell that as a concern citizen the community wants it shut down. We smell a dead rat on this one also would you want a 30 year old car running rampat that has not been cared for much?", 
   {}, 
   46961, 
   null, 
   1083373440.0
  ], 
  [
   47044, 
   null, 
   "galton", 
   "I'm no scientist, but isn't it true that while nuclear power may have a certain risk of danger to area like we saw with 3 mile island, other energy sources like coal and oil put off radiation when being burned?", 
   {}, 
   46968, 
   null, 
   1083386400.0
  ], 
  [
   47379, 
   null, 
   "Tedster", 
   "I'm no scientist, but isn't it true that while nuclear power may have a certain risk of danger to area like we saw with 3 mile island, other energy sources like coal and oil put off radiation when being burned?\n\n I beleive your right galton. Even if thats not true think of the worst nuclear accident to date. You come up with chyrnobel(forgive my spelling). There were an immediate 31 deaths from it and 20 acres of land were made unhinabitable for a long time. Thats pretty good for any energy source for their \"major\" accident. Even gas(items relating to gas) has a higher death rate in the past year than nuclear has boasted it's entire life span. Fears against nuclear energy are understandable but so is anything that we aren't willing to take a shot at.", 
   {}, 
   47044, 
   null, 
   1083609240.0
  ], 
  [
   47479, 
   null, 
   "galton", 
   "I beleive your right galton. Even if thats not true think of the worst nuclear accident to date. You come up with chyrnobel(forgive my spelling). There were an immediate 31 deaths from it and 20 acres of land were made unhinabitable for a long time. Thats pretty good for any energy source for their \"major\" accident. Even gas(items relating to gas) has a higher death rate in the past year than nuclear has boasted it's entire life span. Fears against nuclear energy are understandable but so is anything that we aren't willing to take a shot at.\n\n Right. Like so much of our public policy, it is biased a great deal by dramatic, emotional events, as opposed to hard facts and the big picture.", 
   {}, 
   47379, 
   null, 
   1083627600.0
  ], 
  [
   47522, 
   null, 
   "pyromattiac", 
   "It seems more like the attitude toward nuclear power is one of not quite understanding how it works and the immediate association it has the everyones image of the atomic bomb.", 
   {}, 
   47479, 
   null, 
   1083634620.0
  ], 
  [
   47528, 
   null, 
   "sglaine", 
   "The reason for starting this thread is that I don't want a disaster in my backyard from this 30 year old run down plant. I thought the life on those was 15-20 years not 30. I don't trust it...", 
   {}, 
   47522, 
   null, 
   1083635160.0
  ], 
  [
   85460, 
   null, 
   "jim's trucking", 
   "The reason for starting this thread is that I don't want a disaster in my backyard from this 30 year old run down plant. I thought the life on those was 15-20 years not 30. I don't trust it...\nThey likely have some components that could last forever and some that need replacement/refurbishment now and then. I doubt your plant would be operated with known safety issues unattended.\n \n Fear not. The Lord is with thee.", 
   {}, 
   47528, 
   null, 
   1105133940.0
  ], 
  [
   85697, 
   null, 
   "skeeter", 
   "emoticon_xclown hi ole jim how yu", 
   {}, 
   85460, 
   null, 
   1105320120.0
  ], 
  [
   91226, 
   null, 
   "sketerpot", 
   "The reason for starting this thread is that I don't want a disaster in my backyard from this 30 year old run down plant. I thought the life on those was 15-20 years not 30. I don't trust it...\n\n \n Your fears are completely groundless. Assuming that the nuclear plant you're talking about uses a pressurized water reactor, it would be ludicrously hard for it to even melt down like Three Mile Island, which didn't hurt anybody, even if all the safety systems were somehow miraculously disabled. Those things are designed to be safe. I recommend reading up on how they actually work. Even with a really poor reactor design, Chernobyl required breathtakingly poor handling (which wouldn't even be possible anymore since we don't use Chernobyl-style manual controls) to blow up (in a chemical explosion). Why are you worrying?", 
   {}, 
   47528, 
   null, 
   1108335360.0
  ], 
  [
   92066, 
   null, 
   "Duo_Maxwell", 
   "While his fears are overblown, Nuclear power as of now is risky. First of all, we got nowhere to store it. Second of all, they present perfect targets for terrorists. \n \n Bush hasn't done much to make our nuclear grid safe, from the plant down to the railroad shipments, it's amazing we haven't got hit yet. Even worse, several publicized reports of security tests on plants across the country found that virtually every one that passed the test was cheating. Amazing. And we simply cannot forget that many are next to small airfields, capable to housing a plane packed with high yield explosives. Until we find a way to properly store the stuff and make it more secure, nuclear power is going to be risky.", 
   {}, 
   91226, 
   null, 
   1108695180.0
  ], 
  [
   92281, 
   null, 
   "sketerpot", 
   "While his fears are overblown, Nuclear power as of now is risky. First of all, we got nowhere to store it.\n\n \n How is that risky? We have temporary storage facilities that should be sufficient to hold the waste until we can find someplace to bury it, and there's not a lot of risk attached to this. And if we were to reprocess our waste, that would decrease its radioactivity significantly.\n \n \nSecond of all, they present perfect targets for terrorists. \n\n \n No, they're really stupid targets for terrorists. Here are some scenarios:\n \n 1. Terrorists fly a plane at the plant, 9/11 style. The heavy steel-reinforced concrete containment structure around the plant was designed to withstand direct hits from military jets. And even if it broke, the reactor is still encased in concrete and an 8 inch thick steel reactor vessel (not to mention the steel casing around the fuel rods). And suddenly we have a few more martyrs winning the Darwin award.\n \n 2. Al Qaida commandos with machine guns and a backpack of high explosives suddenly materialize outside a nuclear power plant and try to blow up the reactor. They have to get through the security, which is no small task. First you have to get through the outer perimeter, then sprint a few hundred yards to get to the powerhouse, then get past the security and radiation checkpoints, then get through the guarded vault-like door to the containment building, all without being spotted by someone who can hit the emergency shutdown switch (which takes effect almost instantly and can't be stopped once started), and then they can try to blow up the reactor, which as I mentioned is protected by heavy reinforced concrete.\n \n 3. They somehow manage to get ahold of some nuclear waste as it's being transported. Assuming that they manage to get past the guards somehow, they are left with... really sturdy steel and concrete casks with some older nuclear waste (which is quite a bit less radioactive than the new stuff). They then have to get the waste out, which is no small task. Someone smashed a 120-ton train going 80 MPH into one of these casks. The train was demolished, but the cask was barely dented.\n \n And, in any case, what would they do with nuclear waste? They can't make nuclear bombs without enrichment facilities (like Iran might be making) and dirty bombs are remarkably ineffective at actually hurting anyone. Terrorists would have to be complete XXXXXX to suicidally attack nuclear plants and fuel transport.", 
   {}, 
   92066, 
   null, 
   1108839840.0
  ], 
  [
   92322, 
   null, 
   "Duo_Maxwell", 
   "How is that risky? We have temporary storage facilities that should be sufficient to hold the waste until we can find someplace to bury it, and there's not a lot of risk attached to this. And if we were to reprocess our waste, that would decrease its radioactivity significantly.\n\n \n Problems: We have no suitable place to bury the stuff. The location in Nevada won't be built for decades, if not at all. Plus there is no real stable geological place for the stuff in the world. Not a lot of risk attacked to it? Are you sure, you do realize what the byproduct of nuclear fuel is right? And as for reprocessing, the US doesn't have the capabilities to do so. Actually only a few countries have the means to reprocess waste, one being france. \n \n \n\n No, they're really stupid targets for terrorists. Here are some scenarios:\n \n 1. Terrorists fly a plane at the plant, 9/11 style. The heavy steel-reinforced concrete containment structure around the plant was designed to withstand direct hits from military jets. And even if it broke, the reactor is still encased in concrete and an 8 inch thick steel reactor vessel (not to mention the steel casing around the fuel rods). And suddenly we have a few more martyrs winning the Darwin award.\n\n \n Actually they are designed to take hits from fighter places, such as F-4s, not jumbo jets. Besides, as the article states, the spent fuel contaimers are much weaker, and while harder to hit, are still a problem. \n \n http://msnbc.msn.com/id/3072967\n \n \n\n 2. Al Qaida commandos with machine guns and a backpack of high explosives suddenly materialize outside a nuclear power plant and try to blow up the reactor. They have to get through the security, which is no small task.\n\n \n Why do you say that? Almost every plant that passed security tests cheated heavily. They knew when and where. Therefore they were able to keep a higher then normal number of guards, and knew exactly where the attack would come from and when. That is not going to happen in real life with a real attack. It is going to be completely by suprise with absoltely no warning. \n \n Do you have a link about the SCRAM system? \n \n Alright, alright alright, so it's not that easy to take it apart from the inside, but that doesn't necessarily mean they couldn't pull a 9/11 jumbo jet attack upon a reactor. No one really knows how much damage the plant can take.", 
   {}, 
   92281, 
   null, 
   1108861620.0
  ], 
  [
   92360, 
   null, 
   "sketerpot", 
   "Problems: We have no suitable place to bury the stuff. The location in Nevada won't be built for decades, if not at all. Plus there is no real stable geological place for the stuff in the world. Not a lot of risk attacked to it? Are you sure, you do realize what the byproduct of nuclear fuel is right? And as for reprocessing, the US doesn't have the capabilities to do so. Actually only a few countries have the means to reprocess waste, one being france.\n\n \n Nuclear waste starts out dangerous, but in a few years it becomes much less radioactive as the most radioactive isotopes decay quickly. There is very little harm in leaving waste sitting around the storage ponds for quite a while longer. Is it unimaginable that we may, decades from now, find a place to put that waste for longer periods of time? Until then, there's no reason to worry. And in the long term, nuclear waste isn't the Scourge of the Future that it is sometimes portrayed as; in 500 years it will be less radioactive than the uranium it was mined from. The huge thousands-of-years figures that you hear are the result of setting high standards and letting exponential decay stretch out the time.\n \n \nActually they are designed to take hits from fighter places, such as F-4s, not jumbo jets. Besides, as the article states, the spent fuel contaimers are much weaker, and while harder to hit, are still a problem. \n \n http://msnbc.msn.com/id/3072967\n\n \n I didn't see anything about spent fuel containers in the article, but I did notice this quote from someone working for the NRC: \"There's nothing in the research so far nothing to suggest these commercial airliners would be able to penetrate the containment building\". And, as I stated before, the containment building isn't the only thick layer guarding the reactor. There's also the heavy concrete around the reactor, which is almost as thick.\n \n But even if the improbable happened and terrorsts flew a plane into a nuclear plant and broke through all that concrete and steel, all that would happen is that the plant would shut down. Nuclear plants aren't so fragile that they melt down when something bad happens. The control rods would come down and stop the reaction. In some reactors, if that didn't work, other scramming systems would come into play. And American pressurized-water reactors have a very negative void coefficient, so excessive heat would decrease the efficacy of the moderator, making the reactor inherently self-regulating.\n \n \n \nWhy do you say that? Almost every plant that passed security tests cheated heavily. They knew when and where. Therefore they were able to keep a higher then normal number of guards, and knew exactly where the attack would come from and when. That is not going to happen in real life with a real attack. It is going to be completely by suprise with absoltely no warning.\n\n \n Do you have specifics about how terrorists are supposed to get into a nuclear plant and do any damage? The reactor itself is behind all those layers of concrete that I keep mentioning, and you can't do much with waste in on-site storage. I suppose that it's possible for terrorists to get lucky and steal some waste, but as I mentioned before dirty bombs mostly just scare people and it would be easier to get material for them from smaller, less security-conscious countries, possibly with terrorist sympathies. Attacking a nuclear plant is still stupid.\n \n \nDo you have a link about the SCRAM system?\n\n \n Unfortunately, I spoke too soon about the emergency shutdown. I was referring to scramming by injecting moderator poison, which is one of the scram systems in CANDU-style heavy water reactors. American nuclear plants use various different designs, so it's hard to speak for all of them, but they have at least a system that rapidly inserts the control and safety rods into the reactor. Those things are heavy, so terrorists are going to have one hell of a time getting them out, especially since most plants have the control rods held up by an electromagnetic field generated by the reactor itself, so once it's shut off there's nothing to hold the rods up. Not quite as nice as the CANDU setup (unless another scram system is added, as is sometimes the case), but still pretty near foolproof.\n \n \nAlright, alright alright, so it's not that easy to take it apart from the inside, but that doesn't necessarily mean they couldn't pull a 9/11 jumbo jet attack upon a reactor. No one really knows how much damage the plant can take.\n\n \n People are still just specilating that it might be possible to break the containment structure. If the containment structure was broken then the plant would be screwed, but the reactor would still be protected. And if the reactor broke for some unknown reason, the fuel rods would be far enough from each other that the reaction would stop (and the moderator would drain, which would also stop the reaction even if the fuel rods were still together).\n \n What do you expect the worst-case scenario to be if a 9/11 jumbo jet managed to break through the containment structure, and what mechanisms would it use?", 
   {
    "unicode_changes_made": true
   }, 
   92322, 
   null, 
   1108873800.0
  ], 
  [
   92981, 
   null, 
   "GreenMtnBoy", 
   "Since three mile island happened, not one single reacotr has been built. I think that shows they way most people feel.\n \n There is one in VT too, but it's alot closer to you than me.", 
   {}, 
   92360, 
   null, 
   1109067780.0
  ], 
  [
   93058, 
   null, 
   "Waxy", 
   "Since three mile island happened, not one single reacotr has been built. \n\n \n In the USA.\n \n Waxy", 
   {}, 
   92981, 
   null, 
   1109101080.0
  ], 
  [
   93087, 
   null, 
   "sketerpot", 
   "Since three mile island happened, not one single reacotr has been built. I think that shows they way most people feel.\n\n \n And that is relevant to nuclear power's safety... how? Billions of people can be wrong, and often have. This is just an appeal to popularity.", 
   {}, 
   92981, 
   null, 
   1109103540.0
  ], 
  [
   94650, 
   null, 
   "Tastyfish", 
   "Coal and oil fired reactors kill far more people every year than nuclear ones.", 
   {}, 
   93087, 
   null, 
   1109730660.0
  ], 
  [
   95598, 
   null, 
   "Toxey", 
   "I beleive your right galton. Even if thats not true think of the worst nuclear accident to date. You come up with chyrnobel(forgive my spelling). There were an immediate 31 deaths from it and 20 acres of land were made unhinabitable for a long time. Thats pretty good for any energy source for their \"major\" accident. Even gas(items relating to gas) has a higher death rate in the past year than nuclear has boasted it's entire life span. Fears against nuclear energy are understandable but so is anything that we aren't willing to take a shot at.\n\n \n \n If you think 31 people died and ONLY 20 acres of land is all this accident has ruined for hundreds of years.Check out this site http://www.kiddofspeed.com/default.htm \n You will have a new respect for Nuclear power!\n I am all for Nuclear power ,but to dismiss its potential is very fool hearted.", 
   {}, 
   47379, 
   null, 
   1109991240.0
  ], 
  [
   95945, 
   null, 
   "Silent_eko", 
   "Yea there going to see if they can get 20 more out of her. That in my book is scary.\n\n \n From what i have heard it is a fairly safe way of making energy", 
   {}, 
   46956, 
   null, 
   1110223080.0
  ], 
  [
   123052, 
   null, 
   "Wez", 
   "\"Nuclear power station\" is one of those words like \"paedophile\" and \"terrorist\" that cause most people's IQ to drop by 50points, their heartbeat rate to double and sweat to form on their brow.\n \n Maybe, if they did a bit more research into the subject they'd realise how safe nuclear power is compared to most other forms of generating electricity. Of course that's not going to happen, because that would require independent research (heavens no! That's just ridiculous... you mean thinking for yourself, rather than just believing your newspaper blindly?!). The mass-media, on the other hand, can print some story (using as many long words the reader won't understand, but will assume to be synonyms of \"you will die in 10minutes\") about how something may happen and sell it to the people whose IQ just plummeted. This whips up a nice frenzy and as this thread shows nicely, huge paranoia ensues.\n \n -Wez", 
   {}, 
   95945, 
   null, 
   1116172200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Nuclear power!!!", 
  "url": "http://www.4forums.com/political/environmental-debates/2253-nuclear-power.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 2253, 
  "discussion_files": [
   [
    "20075.html", 
    "http://www.4forums.com/political/environmental-debates/2253-nuclear-power-print.html"
   ], 
   [
    "20076.html", 
    "http://www.4forums.com/political/environmental-debates/2253-nuclear-power-2-print.html"
   ]
  ], 
  "identifier": 2253
 }
]