[
 [
  [
   45997, 
   null, 
   "sglaine", 
   "Can someone please tell me what Bush has done for the health care for Americans? Can someone tell me what has Bush done about taxing the rich other that giving them more money? Can someone tell me what Bush has done for the working class folks. Can someone Please tellme why I should VOTE for him. One last thing will someone please tell me what his plans for PEACE is?", 
   {
    "post_info": {
     "post_title": "What has Bush done!!!!!!"
    }
   }, 
   null, 
   null, 
   1083030060.0
  ], 
  [
   46009, 
   null, 
   "JPSartre12", 
   "Can someone please tell me what Bush has done for the health care for Americans? \n\n he pushed for and signed into law the LARGEST increase in Entitlements since the inception of SS. Where have you been?!\n \n\n Can someone tell me what has Bush done about taxing the rich other that giving them more money? \n\n They're alreay paying over half of all of the income taxes now. How much is enough for you?\n \n\n Can someone tell me what Bush has done for the working class folks. \n\n Hello! TAX CUT! Increase in Child Credit....Hello!\n \n\n Can someone Please tellme why I should VOTE for him. \n\n We don't want YOU to vote for him; we want informed people only to vote for him. :)\n \n\n One last thing will someone please tell me what his plans for PEACE is?\n\n \n His plan is to kill all of the people who don't like us. \n emoticon_xgood emoticon_xhoho", 
   {}, 
   45997, 
   null, 
   1083033480.0
  ], 
  [
   46011, 
   null, 
   "jskufan", 
   "Oh, I'd be careful about casually brushing off any votes considering he won in 2000 by the \"hanging chads\". I'm sure George would be happy to accept any and all votes. Let's face it, this presidency and re-election are all about the war in Iraq and the perception of fighting terrorism. The economy would run itself if politicians would be smart enough to get out of its way. Domestically, this administration blends into the landscape, they haven't accomplished anything notable that won't cost us all dearly. It all hinges on Iraq: if you think it was the right call, you'll vote for Bush. If you disagree, you won't.", 
   {}, 
   46009, 
   null, 
   1083034620.0
  ], 
  [
   46014, 
   null, 
   "JPSartre12", 
   "Oh, I'd be careful about casually brushing off any votes considering he won in 2000 by the \"hanging chads\". I'm sure George would be happy to accept any and all votes. Let's face it, this presidency and re-election are all about the war in Iraq and the perception of fighting terrorism. The economy would run itself if politicians would be smart enough to get out of its way. Domestically, this administration blends into the landscape, they haven't accomplished anything notable that won't cost us all dearly. It all hinges on Iraq: if you think it was the right call, you'll vote for Bush. If you disagree, you won't.\n\n \n You forgot the tax cut. Unlike Daddy Bush, Junior learned his lesson. Never trust a Democrat when it comes to taxes. George, Sr. was convinced by a democratic Congress that he HAD to raise taxes despite his campaign promise and the Dems nailed him to the cross with it. Junior learned Daddy Bush's hard lesson about Dems and taxes. That's why he cut them amongst Democrtic screams.\n emoticon_xgood", 
   {}, 
   46011, 
   null, 
   1083035520.0
  ], 
  [
   46020, 
   null, 
   "jskufan", 
   "Oh I didn't forget the famous tax cuts. The federal government basically shifted financial responsibilities down to the state, county, city, and local level by cutting down on federal funding. That's a \"good news, bad news\" proposition: the good news is you got a federal tax cut, the bad news is every other municipality will be raising your taxes to make up for the difference in revenues collected. Cutting our taxes would only be a good thing if the government could excercise a little restraint and cut their spending. Otherwise, their just shifting the enormous burden to the local levels. This administration has had a champaign taste on a beer budget, thus the enormous deficit. I know for some that doesn't matter, for me personally, I'm expected to live within my means, kinda silly. I know, I know, the Democrats are forcing George to spend all that money, that goes without saying.", 
   {}, 
   46014, 
   null, 
   1083037380.0
  ], 
  [
   46023, 
   null, 
   "jim's trucking", 
   "Largest economic growth factor in 20 years...must be doin' somethin' right!", 
   {}, 
   46020, 
   null, 
   1083038580.0
  ], 
  [
   46028, 
   null, 
   "jskufan", 
   "Largest economic growth factor in 20 years...must be doin' somethin' right!\n\n \n Jim, exactly which growth factor are you referring? GDP, GNP, ?????", 
   {}, 
   46023, 
   null, 
   1083039600.0
  ], 
  [
   46040, 
   null, 
   "jim's trucking", 
   "Jim, exactly which growth factor are you referring? GDP, GNP, ?????\n\n \n \n http://www.grandforks.com/mld/sunnews/7410593.htm\n \n http://money.cnn.com/2004/01/02/news/economy/ism/\n \n http://netscape.marketwatch.com/news/story.asp?dist=feed&siteid=netscape&guid={E977F17F-D020-4392-84E1-E06D19C54A36}\n \n http://money.cnn.com/2003/10/30/news/economy/gdp/?cnn=yes\n \n http://news.scotsman.com/topics.cfm?tid=737&id=1202562003\n \n http://www.grandforks.com/mld/sunnews/7410593.htm\n \n http://money.cnn.com/2004/01/02/news/economy/ism/\n \n \n The following link explains the relationship between taxes and growth rates. Do you really want Kerry's tax increases?\n \n http://www.ncpa.org/studies/s159/s159.html", 
   {}, 
   46028, 
   null, 
   1083045540.0
  ], 
  [
   46045, 
   null, 
   "daewoo", 
   "Oh I didn't forget the famous tax cuts. The federal government basically shifted financial responsibilities down to the state, county, city, and local level by cutting down on federal funding. That's a \"good news, bad news\" proposition: the good news is you got a federal tax cut, the bad news is every other municipality will be raising your taxes to make up for the difference in revenues collected. Cutting our taxes would only be a good thing if the government could excercise a little restraint and cut their spending. Otherwise, their just shifting the enormous burden to the local levels. This administration has had a champaign taste on a beer budget, thus the enormous deficit. I know for some that doesn't matter, for me personally, I'm expected to live within my means, kinda silly. I know, I know, the Democrats are forcing George to spend all that money, that goes without saying.\n\n \n Yes, he cut our taxes. Yes, municipalities and states are feeling the heat. I live in kansas, and maybe wherever you live the state/local governments just raised taxes. Here, they cut government. It was amazing, this year our counties road and bridge deaprtment got a 20% cut in their budget. They re-assesed what they really \"needed\". THere is a bridge betwen my house and town that they were planning on replacing. THere is nothing wrong with the birdge as it is now, but our road and bridge department has decided they should replace ALL bridges every 5 years, whether they have signs of wear or not. This is just plain STUPID. After they got their lower budget, they re-assesed this policy. They brought in some experts to examine the brideges that thy were planing to replace this year, and of the 17 they were going to replace, they found that only one really needed it. The experts they brought in said the bridge btwn my house and town should be good for another 18 or 20 YEARS. In the last 15 years, they have replaced that bridge 3 times.\n \n Our police dept also got a budget cut. They have always had their cruisers on a 2 year rotation schedule. Once they have had a cruiser for 2 years, they auction it and, of course, used police cruisers sell for next to nothing. Now, they have decided to actually keep the cruisers until there is actually a reason to sell them. They were planning to replace 18 cruisers this year, now they are replacing none. THey already have 3 cruisers from last year that they have not outfitted yet with lights. Instead of putting the LED light bars on them at $1800 each, they are going back to the more traditional light abrs, which cost $240 and perform the same function. They are just not as cool looking.\n \n I am on the local school board and we are building a new high school this year and next. We cut over 2 million dollars from the job by removing some cosmetic features from the school. The new school will not have 2 decorative marble bands around it (the marble pieces were $600 each, and only 4' long). We cut $240,000 from the job by switching from natural brick to a pre stressed concrete brick. WE switched from light fixtures in the library that cost $400 each to light fixtures that cost $80 each. The problem is that they were building a monument to education, when what they needed was a SCHOOL. Spending $240,000 extra dollars on natural brick does NOT help kids learn better. A couple of marble accent bands runnign around the building does NOT increase brain activity. THe kids don't care whether the lights in the library are made of brass or not. \n \n Our county built a new couthouse a while back, and are in the process of furnishing it and getting the county offices moved into it. IT turns out that the judges are going to have to live without granite desktops. The county commisioners are going to have to live without a hand polished marble meeting table. The clerks are not going to get the $500 chairs they wanted. Computers are NOT going to be replaced every year, they are instead going to have to last until they won't perform their desired function any more, like they do in a corporate environment. Projectors will NOT be popping out of the ceiling on custom made racks that cost $2400 each.\n \n I went to a meeting at a government (federal) building in Kansas City a while back, and as I watched them lay the new marble floor, it occured to me that what we need is a lot MORE tax cuts. Federal buildings do not need marble floors. Cops do not need new cars every 2 years, schools do not need 2 million dollars worth of cosmetic features, and county commissioners do not need hand rubbed marble conference tables. Our governments spending is out of control. I have set on enough public commisions (I am setting my sights on the county commision next) to understand the mentality behind this stuff. IF you are building a public building, why not build a monument. After all, it's all free. \n \n What we need is not just more tax cuts, we need a government to realise that if Sprint, one of the largest companies in America, cannot afford to put marble floors in their world headquarters, then they (the government) cannot afford to put them in a federal building.\n \n I really thought bush was on the right track on this kind of thing, but he cut taxes, then spent MORE money.", 
   {}, 
   46020, 
   null, 
   1083051960.0
  ], 
  [
   46062, 
   null, 
   "JPSartre12", 
   "Oh I didn't forget the famous tax cuts. The federal government basically shifted financial responsibilities down to the state, county, city, and local level by cutting down on federal funding. That's a \"good news, bad news\" proposition: the good news is you got a federal tax cut, the bad news is every other municipality will be raising your taxes to make up for the difference in revenues collected. \n\n Shifting taxes from the Federal Government to local government is ALWAYS a good thing. I wish that most of the unconstitutional Federal social programs were sent back to the States to decide if they wanted to fund them locally. The Federal Government was never intended to be a Nanny; it has just morphed into one as a result of socialist policies starting with FDR.\n \n\n Cutting our taxes would only be a good thing if the government could excercise a little restraint and cut their spending. Otherwise, their just shifting the enormous burden to the local levels. This administration has had a champaign taste on a beer budget, thus the enormous deficit. I know for some that doesn't matter, for me personally, I'm expected to live within my means, kinda silly. I know, I know, the Democrats are forcing George to spend all that money, that goes without saying.\n\n I share your concern. The fact is that GW is spending money like a drunken sailor, not like a fiscally-conservative Republican and that bothers me. While I can see the reason for SOME of the increased spending (Iraq, military, economy stimulus), I certainly don't support giving another $700Billion to Seniors for drugs or spending additional Federal $$ on Ted Kennedy's NCLB fiasco. And we can't blame it all on Bush. There is a Republican-controlled House and Senate that should also be shouldering the blame for this bizarre spending from \"so-called\" Republican Conservatives.\n Right now, the difference between a tax and spend Liberal Democrat and a Republican is cents on the dollar. The Right has moved to the Left and the Left is now crying for fiscal restraint. Cats and dogs sleeping together....It's Apocalyptic!! emoticon_wow", 
   {}, 
   46020, 
   null, 
   1083076200.0
  ], 
  [
   46063, 
   null, 
   "sglaine", 
   "Let me clue you folks on a few things here. This is what I have seen Bush done Increased the size of the goverment by 28% We went from a surpluse to a Big National debt. Put religion in politics . Conducted a war under false premise with out proper planning. Gave most of the tax breaks to the very rich. Failed to go to one service for our dead service man banned photos of the caskets. Embraced the Neo-Conservatives radicals. Failed to take his physical last years in service so he would not have to fly. Cut funding for anti-terrorism before 9-11", 
   {}, 
   46045, 
   null, 
   1083076260.0
  ], 
  [
   46067, 
   null, 
   "JPSartre12", 
   "........\n \n I went to a meeting at a government (federal) building in Kansas City a while back, and as I watched them lay the new marble floor, it occured to me that what we need is a lot MORE tax cuts. Federal buildings do not need marble floors. Cops do not need new cars every 2 years, schools do not need 2 million dollars worth of cosmetic features, and county commissioners do not need hand rubbed marble conference tables. Our governments spending is out of control. I have set on enough public commisions (I am setting my sights on the county commision next) to understand the mentality behind this stuff. IF you are building a public building, why not build a monument. After all, it's all free. \n \n What we need is not just more tax cuts, we need a government to realise that if Sprint, one of the largest companies in America, cannot afford to put marble floors in their world headquarters, then they (the government) cannot afford to put them in a federal building.\n \n I really thought bush was on the right track on this kind of thing, but he cut taxes, then spent MORE money.\n\n \n Daewoo, BRAVO!!! Let me know when you intend to run for President. I'll help with your campaign. \n When it comes to common sense, we know that governments have none. As long as we keep handing them more and more money without questioning the \"WIIFM\" (what's in it for me?), they will find new ways to waste money. IMO, the best thing that can happen to a government is to have the money allotment reduced by a fixed % annually. You'd find that a lot of \"needed things\" suddenly become \"not necessary\" after all.\n I applaud your astute read on the issues and your continued diligence in holding politicians accountable for how they use OUR money. emoticon_xgood", 
   {}, 
   46045, 
   null, 
   1083077040.0
  ], 
  [
   46068, 
   null, 
   "JPSartre12", 
   "Let me clue you folks on a few things here. This is what I have seen Bush done Increased the size of the goverment by 28% We went from a surpluse to a Big National debt. Put religion in politics . Conducted a war under false premise with out proper planning. Gave most of the tax breaks to the very rich. Failed to go to one service for our dead service man banned photos of the caskets. Embraced the Neo-Conservatives radicals. Failed to take his physical last years in service so he would not have to fly. Cut funding for anti-terrorism before 9-11\n\n \n And the mantra goes on, bada boom bada bing.......", 
   {}, 
   46063, 
   null, 
   1083077160.0
  ], 
  [
   46070, 
   null, 
   "sglaine", 
   "And the mantra goes on, bada boom bada bing.......\n\n JPSatre I see you do not like the truth. Haa.", 
   {}, 
   46068, 
   null, 
   1083077760.0
  ], 
  [
   46075, 
   null, 
   "Rev. HellH0und", 
   "Can someone please tell me what Bush has done for the health care for Americans?\n\n \n \n too much. Government is not here to care for you cradle to grave. Name one program that the government runs well.\n \n \n Can someone tell me what has Bush done about taxing the rich other that giving them more money? \n\n \n Different tax rates for different economic classes is redistribution of wealth that would make marx proud. What is it the to 10% pay 90% of the taxes already?\n \n \n \n\n Can someone tell me what Bush has done for the working class folks.\n\n \n What do you wan't him to do? move his ketchup factories to europe? (oh wait thats kerry\\'s suggar daddy wife.\n \n \n \n Can someone Please tellme why I should VOTE for him.\n\n \n \n Because if you don\\'t we will find you.\n \n \n \n One last thing will someone please tell me what his plans for PEACE is?\n\n \n \n Uh to sit around and pass anemic resolutions so the likes of france and russia can reap billions of dollars while Iraqi citizens suffer.... Yes thats peace emoticon_rolleyes", 
   {}, 
   45997, 
   null, 
   1083079920.0
  ], 
  [
   46086, 
   null, 
   "sglaine", 
   "too much. Government is not here to care for you cradle to grave. Name one program that the government runs well.\n \n \n \n Different tax rates for different economic classes is redistribution of wealth that would make marx proud. What is it the to 10% pay 90% of the taxes already?\n \n \n \n \n What do you wan't him to do? move his ketchup factories to europe? (oh wait thats kerry's suggar daddy wife.\n \n \n \n \n \n Because if you don't we will find you.\n \n \n \n \n \n Uh to sit around and pass anemic resolutions so the likes of france and russia can reap billions of dollars while Iraqi citizens suffer.... Yes thats peace emoticon_rolleyes\n What does Kerrys kactup wife got to do with this election not a darn thing. And as far as Bushs tax cuts where intended for the very wealthy not the middle class or the low income. Reigion in politics come on. A National debt that our grandkids will be paying on for the rest of there lives that is what Bush means by no child left behind. It is not our place to be a ruler of the world and that is what the Radicals want. And last thing Rev. Hellhound what do you mean if I dont vote for BUSH you will find me?", 
   {}, 
   46075, 
   null, 
   1083083340.0
  ], 
  [
   46087, 
   null, 
   "Rev. HellH0und", 
   "What does Kerrys kactup wife got to do with this election not a darn thing. \n\n \n Johnnyboy Kerryp Hypocritically talks about keeping jobs here yet his wifes AMERICAN company employs more foriegn workers.\n \n \nAnd as far as Bushs tax cuts where intended for the very wealthy not the middle class or the low income.\n\n \n \n Really will you offer up any evidence to back this up? Kerry thinks a couple thats a teacher and a firefighter are the evil \"rich\"\n \n \n Reigion in politics come on. \n\n \n huh?\n \n \n A National debt that our grandkids will be paying on for the rest of there lives that is what Bush means by no child left behind.\n\n \n Just like Reagans debt right? Never happened...\n \n \n\n It is not our place to be a ruler of the world and that is what the Radicals want. \n\n \n yes it is.\n \n \n \nAnd last thing Rev. Hellhound what do you mean if I dont vote for BUSH you will find me?\n\n \n \n I think you know what I mean, You just make the smart choice and pull the lever for Bush if you know whats good for you.......\n \n Its Called a JOKE.....", 
   {}, 
   46086, 
   null, 
   1083083880.0
  ], 
  [
   46088, 
   null, 
   "Nallyo", 
   "How is the phrase \"across the board tax cuts\" twisted to mean \"tax cuts for the richest people with no benefit whatsoever for anyone else\"?\n \n Radicals? So it was radicals that got us involved in World War 1? That wouldn't have effected us. Radicals got us involved in World War 2? Korea? Vietnam? The Gulf War? The War on Terrorism? If you look at the statistics, it has been a majority at all times. If anything, it is the radicals that are the ones out protesting all of the time trying to brainwash others to their cause.\n \n \n And I'm sure that Gore would have been such a better choice emoticon_rolleyes . . . Just like Kerry.", 
   {}, 
   46086, 
   null, 
   1083084120.0
  ], 
  [
   46092, 
   null, 
   "jim's trucking", 
   "http://www.grandforks.com/mld/sunnews/7410593.htm\n \n http://money.cnn.com/2004/01/02/news/economy/ism/\n \n http://netscape.marketwatch.com/news/story.asp?dist=feed&siteid=netscape&guid={E977F17F-D020-4392-84E1-E06D19C54A36}\n \n http://money.cnn.com/2003/10/30/news/economy/gdp/?cnn=yes\n \n http://news.scotsman.com/topics.cfm?tid=737&id=1202562003\n \n http://www.grandforks.com/mld/sunnews/7410593.htm\n \n http://money.cnn.com/2004/01/02/news/economy/ism/\n \n \n The following link explains the relationship between taxes and growth rates. Do you really want Kerry's tax increases?\n \n http://www.ncpa.org/studies/s159/s159.html\n\n \n Is there any rebuttle from the left?\n \n Have you bothered to read the links?", 
   {}, 
   46040, 
   null, 
   1083085080.0
  ], 
  [
   46099, 
   null, 
   "sglaine", 
   "Is there any rebuttle from the left?\n \n Have you bothered to read the links?\n\n Yea read this link. www.npr.com", 
   {}, 
   46092, 
   null, 
   1083086700.0
  ], 
  [
   46104, 
   null, 
   "Rev. HellH0und", 
   "Yea read this link. www.npr.com\n\n \n \n Giving someone an ENTRE website is not condusive to making ANY points.", 
   {}, 
   46099, 
   null, 
   1083087240.0
  ], 
  [
   46115, 
   null, 
   "jim's trucking", 
   "Yea read this link. www.npr.com\n\n \n Ah, yes. NPR National Partisan Radio, funded in part by the Corporation for Public Broadcasting, National Science Foundation and the National Endowment for the Arts.\n \n No wonder you appear to have been brainwashed (as you say)!\n \n Did you bother to read my posted links <(plural) ?\n \n Can you answer this question?\n \n Will you answer this question?\n \n When will you answer this question?", 
   {}, 
   46099, 
   null, 
   1083088440.0
  ], 
  [
   46116, 
   null, 
   "JPSartre12", 
   "How is the phrase \"across the board tax cuts\" twisted to mean \"tax cuts for the richest people with no benefit whatsoever for anyone else\"?\n\n \n It's called Kerryspeak. The lips move but nothing of value (or true) comes out. Just because the Top 10% pay over 50% of the Income taxes is no reason that people who pay NOTHING shouldn't get a tax refund.....Huh???\n Don't you have to pay INTO something BEFORE you can get a reduction or are we dealing in \"imaginary numbers\" here? What's a 10% rebate on $0 paid equal? \n Of course, if you instituted an across-the-board tax reduction the wealthier would receive more back. They paid more in the first place. :xbanghead :xbanghead :xbanghead :xbanghead", 
   {}, 
   46088, 
   null, 
   1083088500.0
  ], 
  [
   46117, 
   null, 
   "sglaine", 
   "Johnnyboy Kerryp Hypocritically talks about keeping jobs here yet his wifes AMERICAN company employs more foriegn workers.\n \n \n \n \n Really will you offer up any evidence to back this up? Kerry thinks a couple thats a teacher and a firefighter are the evil \"rich\"\n \n \n \n huh?\n \n \n \n Just like Reagans debt right? Never happened...\n \n \n \n yes it is.\n \n \n \n \n \n I think you know what I mean, You just make the smart choice and pull the lever for Bush if you know whats good for you.......\n \n Its Called a JOKE.....\n No I dont think it is a joke. It goes to show how simple minded you are. That sounded more like a threat. I did pull the lever for BUSH the first time and that was not smart on my part. I,m glad you think it is ok to invade a nother counrty with out justcause and lie about. I am glad you think that it is ok to have big tax cuts for the wealthy. I am glad you think Bush has done a good job on other issues like health care. These my friend is all justifyable grips that any American has about Bush. I have not seen anything that he has done other than driveup the National debt.", 
   {}, 
   46087, 
   null, 
   1083088560.0
  ], 
  [
   46119, 
   null, 
   "jim's trucking", 
   "Yea read this link. www.npr.com\n\n \n Do you have any comments in rebuttal of the information shown in the links I posted? Do you not see that George Bush has done good things for the economy of this nation?\n \n The largest economic growth rate in 20 years  is bad news for the Kerry backers. That's why they don't want to talk about it!", 
   {}, 
   46099, 
   null, 
   1083088680.0
  ], 
  [
   46120, 
   null, 
   "jim's trucking", 
   "... I have not seen anything that he has done other than driveup the National debt.\n\n \n How about the largest economic growth factor in 20 years?\n \n Care to comment on that?", 
   {}, 
   46117, 
   null, 
   1083088860.0
  ], 
  [
   46125, 
   null, 
   "jim's trucking", 
   "... I am glad you think that it is ok to have big tax cuts for the wealthy. \n\n \n There you go, using the Kerry propoganda phrase.\n \n You seem to forget that everybody that pays taxes got a tax cut, not just the wealthy.\n \n You also seem to deny the fact that the wealthy pay the most in taxes and should get the biggest tax cut.\n \n You also seem to not fathom the concept that more money in the hands of investors will create more jobs for those who need them.\n \n Please read this link ALL THE WAY THROUGH!\n \n \n http://www.ncpa.org/studies/s159/s159.html \n \n \n Your idea of fairness seems to be redistribution of wealth, which is clearly a socialistic view. \"Let's take money from the rich and give it to the non-working, lazy-assed poor. After all, the rich don't need it as bad as they do.\"", 
   {}, 
   46117, 
   null, 
   1083089400.0
  ], 
  [
   46126, 
   null, 
   "sglaine", 
   "How about the largest economic growth factor in 20 years?\n \n Care to comment on that?\n\n Yea shure Changing Mc Donald jobs into Manufacturing jobs. If you beleve that it is the larest growth in 20 years how come the stocks are diving. Sorry but wrong answer. Oh by the way I did check out that progoverment link you though at me.", 
   {}, 
   46120, 
   null, 
   1083089400.0
  ], 
  [
   46128, 
   null, 
   "JPSartre12", 
   "Ah, yes. NPR National Partisan Radio, funded in part by the Corporation for Public Broadcasting, National Science Foundation and the National Endowment for the Arts.\n \n No wonder you appear to have been brainwashed (as you say)!\n\n \n I always thought that NPR was an acronym for National Propaganda Radio.\n I tune in once in a while when my blood pressure is low. emoticon_rolleyes", 
   {}, 
   46115, 
   null, 
   1083089460.0
  ], 
  [
   46135, 
   null, 
   "jim's trucking", 
   "Yea shure Changing Mc Donald jobs into Manufacturing jobs. If you beleve that it is the larest growth in 20 years how come the stocks are diving. Sorry but wrong answer. Oh by the way I did check out that progoverment link you though at me.\n\n \n I fail to see the link between reduction of taxes and progovernmentalism. However, if you want to understand progovernment, take a deep long look inside the Democratic party.", 
   {}, 
   46126, 
   null, 
   1083090960.0
  ], 
  [
   46147, 
   null, 
   "sglaine", 
   "I always thought that NPR was an acronym for National Propaganda Radio.\n I tune in once in a while when my blood pressure is low. emoticon_rolleyes\n\n Fox News is the biggist rightwing Neo-Conservative Radical Propaganda channel. They do not know fair and balanced means because they are one way Rightwing. NPR Trustworthy un bias news not suppressed by the goverment.", 
   {}, 
   46128, 
   null, 
   1083092100.0
  ], 
  [
   46149, 
   null, 
   "jim's trucking", 
   "Fox News is the biggist rightwing Neo-Conservative Radical Propaganda channel. They do not know fair and balanced means because they are one way Rightwing. NPR Trustworthy un bias news not suppressed by the goverment.\n\n \n ...paid for in part by the government (the taxpayers) and funded for the most part by rich liberals.\n \n Why else would they be so one-sided?\n \n One should observe several sources of news, not just NPR.\n \n Why, I'd much rather read Mad Magazine than listen to NPR! It makes more sense! LOL", 
   {}, 
   46147, 
   null, 
   1083092400.0
  ], 
  [
   46150, 
   null, 
   "Rev. HellH0und", 
   "Fox News is the biggist rightwing Neo-Conservative Radical Propaganda channel. They do not know fair and balanced means because they are one way Rightwing. NPR Trustworthy un bias news not suppressed by the goverment.\n\n \n \n You have YET to offer up any evidence to support this assertion of yours...", 
   {}, 
   46147, 
   null, 
   1083092460.0
  ], 
  [
   46155, 
   null, 
   "sglaine", 
   "...paid for in part by the government (the taxpayers) and funded for the most part by rich liberals.\n \n Why else would they be so one-sided?\n \n One should observe several sources of news, not just NPR.\n \n Why, I'd much rather read Mad Magazine than listen to NPR! It makes more sense! LOL\n\n Mad mag is good thats where you came from. But the bottom line here the truth is that news is suppressed so most of you do not know the truth and the goverment does not want you to know the truth. You can watch your Fox and I will listen to NPR the channel that does not do personal attacts like you Conservative like to do.", 
   {}, 
   46149, 
   null, 
   1083093180.0
  ], 
  [
   46158, 
   null, 
   "Rev. HellH0und", 
   " You can watch your Fox and I will listen to NPR the channel that does not do personal attacts like you Conservative like to do.\n\n \n \n \n Kind of like calling someone Rev. Heelh0und Like you did in that other thread eh?", 
   {}, 
   46155, 
   null, 
   1083093360.0
  ], 
  [
   46163, 
   null, 
   "JPSartre12", 
   "Yea shure Changing Mc Donald jobs into Manufacturing jobs. If you beleve that it is the larest growth in 20 years how come the stocks are diving. Sorry but wrong answer.\n\n \n Rather than just spouting Democratic claptrap, I would suggest that you get some facts to back up those claims. From what I've read, \"insourcing\" has far exceeded \"outsourcing\" and the majority of the jobs lost have been attributable to increases in worker productivity in US companies.\n Add the fact that 18 million Americans change jobs yearly, IIRC, and you see that employment isn't an easy statistic to track.", 
   {}, 
   46126, 
   null, 
   1083093660.0
  ], 
  [
   46165, 
   null, 
   "JPSartre12", 
   "Fox News is the biggist rightwing Neo-Conservative Radical Propaganda channel. They do not know fair and balanced means because they are one way Rightwing. NPR Trustworthy un bias news not suppressed by the goverment.\n\n \n Tough to argue with a troll. I'll pass.... emoticon_xbye", 
   {}, 
   46147, 
   null, 
   1083093780.0
  ], 
  [
   46177, 
   null, 
   "sglaine", 
   "Rather than just spouting Democratic claptrap, I would suggest that you get some facts to back up those claims. From what I've read, \"insourcing\" has far exceeded \"outsourcing\" and the majority of the jobs lost have been attributable to increases in worker productivity in US companies.\n Add the fact that 18 million Americans change jobs yearly, IIRC, and you see that employment isn't an easy statistic to track.\n\n Yea JPSatre12 busineeses are laying off everday folks are losing there jobs. The point you do not get in the real world is the stock market is falling not doing well if that is not doing well nether is the economy. the economy figgers by the goverment are padded to make simple minds think that they are going. This is the real world know it and live it. Mickey Mouse has kicked you out of Disney world. I do agree with you on one thing that is Employment statistic are hard to track. But so are the rest of the goverment statistics too. The facts are they will only tell you what they want you to know that is why we as Americans need to look at other media sourses insted of TV all the time. emoticon_xdonno", 
   {}, 
   46163, 
   null, 
   1083095280.0
  ], 
  [
   46183, 
   null, 
   "jim's trucking", 
   "Yea JPSatre12 busineeses are laying off everday folks are losing there jobs. The point you do not get in the real world is the stock market is falling not doing well if that is not doing well nether is the economy. the economy figgers by the goverment are padded to make simple minds think that they are going. This is the real world know it and live it. Mickey Mouse has kicked you out of Disney world. I do agree with you on one thing that is Employment statistic are hard to track. But so are the rest of the goverment statistics too. The facts are they will only tell you what they want you to know that is why we as Americans need to look at other media sourses insted of TV all the time. emoticon_xdonno\n\n \n The stock market is volatile. It has been creeping steadily upwards lately. It will rise and fall forever and ever, Amen.", 
   {}, 
   46177, 
   null, 
   1083096180.0
  ], 
  [
   46184, 
   null, 
   "sglaine", 
   "The stock market is volatile. It has been creeping steadily upwards lately. It will rise and fall forever and ever, Amen.\n\n But it has taking bigger falls with Bush in office and that cost profits for investors. Am I right?", 
   {}, 
   46183, 
   null, 
   1083096480.0
  ], 
  [
   46188, 
   null, 
   "jim's trucking", 
   "But it has taking bigger falls with Bush in office and that cost profits for investors. Am I right?\n\n \n I don't track the market. If you're trying to blame the market drops on Bush, you're misguided. He doesn't control the price of gasoline either.\n \n 9-11 had a great negative impact on the market. That wasn't Bush. That was Osama.\n \n Why don't you print out the market closing numbers for the last 20 years and let's see who we can blame for the dips.", 
   {}, 
   46184, 
   null, 
   1083096960.0
  ], 
  [
   46193, 
   null, 
   "sglaine", 
   "I don't track the market. If you're trying to blame the market drops on Bush, you're misguided. He doesn't control the price of gasoline either.\n \n 9-11 had a great negative impact on the market. That wasn't Bush. That was Osama.\n \n Why don't you print out the market closing numbers for the last 20 years and let's see who we can blame for the dips.\n\n Yep 9-11 did have a impact on the market I will give you that one big deal but if they where doing there job when they get the word about possible attact when Clark had said someting maybe just maybe. The out come would have been better. It is plain and simple coverup after coverup after coverup on the Repubicans side of things", 
   {}, 
   46188, 
   null, 
   1083097620.0
  ], 
  [
   46194, 
   null, 
   "Ghost", 
   "I,m glad you think it is ok to invade a nother counrty with out justcause and lie about. I am glad you think that it is ok to have big tax cuts for the wealthy.\n\n \n We had plenty of just cause...besides the numerous UN resolutions and treaties Saddam broke and violated, the man was a danger to the entire world. I don't think Bush lied about a single thing in Iraq\n \n The wealthy should have tax cuts. Let me just say, before you jump me, I am in no ways wealthy. My family is working middle class. The fact is that the wealthiest Americans pay a disgustingly unproportionate share of the taxes, and that's not fair. They should have a tax break.\n \n \nThese my friend is all justifyable grips that any American has about Bush.\n\n \n I don't have those gripes, because they're not legitimate.\n \n \nI have not seen anything that he has done other than driveup the National debt.\n\n \n Hows about...actively going after al-Qaeda by killing or capturing 2/3rds of their leaders, shutting down funds, and denying them safe refuge? How about toppling the Baathist government in Iraq? How about the fact that Saddam is in a cage and his sons are dead? How about starting to set up a democracy in the middle east? How about creating a new cabinet position devoted entirely to defending the American homeland? How about tax cuts across the board? How about the fact that the economy was in a recession when he took office, took a severe hit from 9/11, but is now recovering with the greatest quarter of economic growth we've had in twenty years? How about the fact that the unemployment rate is down?\n \n Oh yeah, and he also had a hand to play in getting Muammar Khadafi to disarm, a fact which is often overlooked.", 
   {}, 
   46117, 
   null, 
   1083097920.0
  ], 
  [
   46197, 
   null, 
   "jim's trucking", 
   "Yep 9-11 did have a impact on the market I will give you that one big deal but if they where doing there job when they get the word about possible attact when Clark had said someting maybe just maybe. The out come would have been better. It is plain and simple coverup after coverup after coverup on the Repubicans side of things\n\n \n Likewise, I can say to you that Clarke worked for the previous THREE administrations including your all knowing Slick Willy Clinton who stood by and did virtually nothing after we were repeatedly attacked by Osama's boys.", 
   {}, 
   46193, 
   null, 
   1083098340.0
  ], 
  [
   46200, 
   null, 
   "sglaine", 
   "We had plenty of just cause...besides the numerous UN resolutions and treaties Saddam broke and violated, the man was a danger to the entire world. I don't think Bush lied about a single thing in Iraq\n \n The wealthy should have tax cuts. Let me just say, before you jump me, I am in no ways wealthy. My family is working middle class. The fact is that the wealthiest Americans pay a disgustingly unproportionate share of the taxes, and that's not fair. They should have a tax break.\n \n \n \n I don't have those gripes, because they're not legitimate.\n \n \n \n Hows about...actively going after al-Qaeda by killing or capturing 2/3rds of their leaders, shutting down funds, and denying them safe refuge? How about toppling the Baathist government in Iraq? How about the fact that Saddam is in a cage and his sons are dead? How about starting to set up a democracy in the middle east? How about creating a new cabinet position devoted entirely to defending the American homeland? How about tax cuts across the board? How about the fact that the economy was in a recession when he took office, took a severe hit from 9/11, but is now recovering with the greatest quarter of economic growth we've had in twenty years? How about the fact that the unemployment rate is down?\n Well if Bush did not lie he would have had the backing from the UN plain and simple. Now he has done nothing for heath care. Gee he wants to do away with the headstart program for kids thats his way of no child left behind. I think the rich should be taxed like anybody else they are no different than anybody else in fact Bush is giving money back to them. It is plain as day Bush has taken care of him self & rich one alike. Iraq was invaded without approval from the UN. There was no WMDs like Bush said at the start of the war. He lied.", 
   {}, 
   46194, 
   null, 
   1083098640.0
  ], 
  [
   46202, 
   null, 
   "Ghost", 
   "The UN did supply approval, Resolution 1441 allowed for action to be taken if Iraq failed to comply and was voted on unanimously by all 15 member nations. Iraq failed to comply. Over 20 nations formed a coalition and invaded Iraq.\n \n You can read 1441 here: http://usinfo.state.gov/topical/pol/terror/02110803.htm\n \n And come on, be serious. Everyone knows that Saddam had WMDs, Republican and Democrats alike. Hell, even France said so. One of the Inspectors, Kay, said that before the invasion, there was a lot of truck movement going across the Iraq-Syria border...and Syria was a friendly country to Iraq, controlled by the Baath party.\n \n Like I've been saying, the rich for too long have been paying way too much, it's not fair to them. Absolutely they should pay taxes just like the rest of us, but when you're taking an unfair amount from them, I've got a problem with that.", 
   {}, 
   46200, 
   null, 
   1083099240.0
  ], 
  [
   46203, 
   null, 
   "Waxy", 
   "\n And come on, be serious. Everyone knows that Saddam had WMDs, Republican and Democrats alike. Hell, even France said so. One of the Inspectors, Kay, said that before the invasion, there was a lot of truck movement going across the Iraq-Syria border...and Syria was a friendly country to Iraq, controlled by the Baath party.\n\n \n Do they really? emoticon_wow \n \n How? emoticon_confused \n \n Waxy", 
   {}, 
   46202, 
   null, 
   1083099420.0
  ], 
  [
   46204, 
   null, 
   "Eddie", 
   "http://www.grandforks.com/mld/sunnews/7410593.htm\n \n http://money.cnn.com/2004/01/02/news/economy/ism/\n \n http://netscape.marketwatch.com/news/story.asp?dist=feed&siteid=netscape&guid={E977F17F-D020-4392-84E1-E06D19C54A36}\n \n http://money.cnn.com/2003/10/30/news/economy/gdp/?cnn=yes\n \n http://news.scotsman.com/topics.cfm?tid=737&id=1202562003\n \n http://www.grandforks.com/mld/sunnews/7410593.htm\n \n http://money.cnn.com/2004/01/02/news/economy/ism/\n \n\n \n Now, I do not live in the US so I`m not so well versed in this particular area. All I do know is some basic economics so this is what I will try to apply. I may indeed be incorrect on certain issues as I lack the knowledge of the whole picture.\n \n This being said, I also want to point out that those articles brings up the same thing, over and over again (in fact, two of them are the same article...). Now, what do they really say?\n \n This is how I understood it: \n Growth for the fourth quarter: 8,2-7,4% (highest quarterly growth in 20 years)\n Caused by: increased productivity, increased consumption and increased terms of trade.\n Problem: Low increase in employment\n \n These things are great. But they must be evaluated from a larger perspective. A quarter is not that long a time. The actual US GDP growth for 2003 was, according to your links 3,5% (OECD claims it was 2,9%. But what do they know? ;)). This is still a good figure. Allthough not the best in 20 years (best in 3 years though...). \n \n All in all, I think you are right. 2003 was a pretty decent year for american economy. But arguably not the best in 20 years. Perhaps it was the best in 3 years (how long has Bush been in office?).\n \n \n[url]\n The following link explains the relationship between taxes and growth rates. Do you really want Kerry's tax increases?\n \n http://www.ncpa.org/studies/s159/s159.html\n\n \n First of all, according to that particular study, the US could sharply increase its tax rate without lowering tax revenue.\n \n Secondly; The study claims that informal markets are much less productive than formal markets. This is not really true. The only real drawback of informal production could be lack of specialisation. But by merely looking at figures (like GDP), informal markets or production is non-existant, making it appear to be much less productive. If you and your wife sold house hold services to eachother, this would be recorded and would add to national gross production. But its not really any more productive than simply exchanging the household services without charging eachother. Now, the author points out some other problems with informal markets, but these are specific to developing countries and do not apply to countries as the US\n \n Thirdly; He argues that the reason why tax rates are damaging for the growth rate is because the public sector is less productive than the private sector. While this is often true (assuming there is healthy competition on the private market... which is far from true in many cases), he do not seem to make a difference of public sectors that makes use of market sollutions. This I find very weird and makes his study obsolete in many respects.\n \n Fourthly; The author claims that \"economic growth slows to zero at a tax rate of about 45 percent and becomes negative at higher tax rates\". This is obviously not true. By merely looking at the example in the study of Sweden with a tax rate at about 59% in 1988 and then look at the economic growth for sweden in 1988 which was in fact 2%*... This made me loose pretty all of the confidence I had left in the study. I`m sure there are more problems with this study, but these will have to do for now.\n \n * Source: http://www.google.se/search?q=cache:O51oJYRGfkEJ:www.ratioinstitutet.nu/pdf/wp/re_tillv%25E4xt.pdf+sverige+ekonomisk+tillv%C3%A4xt+1988&hl=sv\n (In Swedish, but if you want, I could translate certain passages... the figures are the same BNP=GDP)\n \n \n Edit: typos", 
   {}, 
   46040, 
   null, 
   1083099540.0
  ], 
  [
   46205, 
   null, 
   "sglaine", 
   "The UN did supply approval, Resolution 1441 allowed for action to be taken if Iraq failed to comply and was voted on unanimously by all 15 member nations. Iraq failed to comply. Over 20 nations formed a coalition and invaded Iraq.\n \n You can read 1441 here: http://usinfo.state.gov/topical/pol/terror/02110803.htm\n \n And come on, be serious. Everyone knows that Saddam had WMDs, Republican and Democrats alike. Hell, even France said so. One of the Inspectors, Kay, said that before the invasion, there was a lot of truck movement going across the Iraq-Syria border...and Syria was a friendly country to Iraq, controlled by the Baath party.\n \n Like I've been saying, the rich for too long have been paying way too much, it's not fair to them. Absolutely they should pay taxes just like the rest of us, but when you're taking an unfair amount from them, I've got a problem with that.\nWhere are the WMDs? There was none.", 
   {}, 
   46202, 
   null, 
   1083099540.0
  ], 
  [
   46208, 
   null, 
   "daewoo", 
   "Daewoo, BRAVO!!! Let me know when you intend to run for President. I'll help with your campaign. \n When it comes to common sense, we know that governments have none. As long as we keep handing them more and more money without questioning the \"WIIFM\" (what's in it for me?), they will find new ways to waste money. IMO, the best thing that can happen to a government is to have the money allotment reduced by a fixed % annually. You'd find that a lot of \"needed things\" suddenly become \"not necessary\" after all.\n I applaud your astute read on the issues and your continued diligence in holding politicians accountable for how they use OUR money. emoticon_xgood\n\n \n I don't think I would have a snowballs chance in hell of winning a big political election. Fortunatly, where I live, common sense is not entirely dead. NOt too long ago one of our high school prinicipals went to a convention for a week. He stayed in a $350/night suite and spent over $4100.00 on \"entertainment expenses\" including a monsterous bar tab from the hotel bar, where apparently he felt compelled to buy rounds for the other guys attending the convention. HAlfway through his presentation of whining about how stressful his job was and how great it was that he made all these new contacts in the education world, I lost control and blurted out \"********. We wll give you $100 per night hotel expenses and $25.00 per meal. Youhave 90 days to refund the rest to us or we will have you arrested and I will personally make sure you NEVER find another job\". Our school board is pretty much a bunch of spinless wimps that will just follow along, so the threat actually had some merit. 3 members of our school board are housewives who have NEVER had a job, do not understand how bond issues work at ALL, and cannot even begin to comprehend the budget.\n \n Around here, I can get away with that kind of thing. In a bigger audience, you end up with differnet types of people. There are those that believe that teachers should be cut slack because their job sucks, even though THEY chose that line of work knowing full well the job sucked. There are even people who think that the government is somehow automatically entitled to a big bite out of every dollar you make.\n \n I hold no particular reverance for teachers, law enforcement folk, firefighters, doctors, and certainly not politicians. Tenure for teachers? Not on my watch, It encourages laziness. Cops who steal should go to jail. I don't care if they are cops. Little electronic gadgets and plush offices are executive perks for people who do their jobs well and make heir companies money. I have yet to see a government official that deserves any of that stuff.\n \n No company in the world could stay in business spending money and handing out favors like our government does, yet there seems to be a large number of people who think that our governemtn does just fine in the budgeting department. I, for one, don't think that law enforcement officers and government officials should be given new cars every two years unless every taxpayer int he country can also afford a new car every two years. Why should the taxpayers have to subsidize things for the government that they themselves can not afford?\n \n In business, the cost/benifit analysis rules everything. I un a litle company, and before we buy new vehicles, new equipment, institute new policies, or hire new people, we do a little CBA to ensure that we are not just throwing money down the drain. IT seems somebody in our governemtn should be able to do a CBA. When I do a personaly CBA on my taxes, I am pretty disapointed. IT seems I pay an awful lot in taxes, but I can not think of any real benifits I get from the government. I see where they fush an awful lot of my money down the toilet, though.", 
   {}, 
   46067, 
   null, 
   1083099900.0
  ], 
  [
   46209, 
   null, 
   "jim's trucking", 
   "Where are the WMDs? There was none.\n\n \n Apparently, you will be asking this same inane question over and over, followed by the same inane statement that there were none until somebody actually finds some of the weapons and proves that they came from Iraq.\n \n Even if that happens and is proved beyond any reasonable doubt, you will likely say it was a movie made by the right wing conspirators in the Mohave Desert.\n \n The man had the weapons. The man hid or moved the weapons. We will find them or they will find us...bet your last dollar on that. If they find us, it won't make any difference who was right. We'll all be dead.\n \n Why don't you take up knitting to pass the time of day instead of flooding the boards with your ridiculous repetitions?", 
   {}, 
   46205, 
   null, 
   1083100680.0
  ], 
  [
   46210, 
   null, 
   "sglaine", 
   "Apparently, you will be asking this same inane question over and over, followed by the same inane statement that there were none until somebody actually finds some of the weapons and proves that they came from Iraq.\n \n Even if that happens and is proved beyond any reasonable doubt, you will likely say it was a movie made by the right wing conspirators in the Mohave Desert.\n \n The man had the weapons. The man hid or moved the weapons. We will find them or they will find us...bet your last dollar on that. If they find us, it won't make any difference who was right. We'll all be dead.\n \n Why don't you take up knitting to pass the time of day instead of flooding the boards with your ridiculous repetitions?\n\n Very good I keep asking that ???over and over because that is why we went to war or did you forget. There was none so there for we had no right in going to Iraq. It is not ridiculous this is the truth and we got lied to by the Bush admin. They changed there tune foe why we where there after the war was full blowen. Coverup after coverup.", 
   {}, 
   46209, 
   null, 
   1083101040.0
  ], 
  [
   46212, 
   null, 
   "Ghost", 
   "Okay, sglaine, I have a question for you...what will you say if we do find substantial amounts of chemical and biological weapons from Iraq, either in Iraq, or in Syria, or anywhere else?", 
   {}, 
   46210, 
   null, 
   1083101340.0
  ], 
  [
   46213, 
   null, 
   "jim's trucking", 
   "Very good I keep asking that ???over and over because that is why we went to war or did you forget. There was none so there for we had no right in going to Iraq. It is not ridiculous this is the truth and we got lied to by the Bush admin. They changed there tune foe why we where there after the war was full blowen. Coverup after coverup.\n\n \n As mentioned before, there were several reasons for going to war. Inexplained whereabouts of known WMDs was just one of them. :xbanghead", 
   {}, 
   46210, 
   null, 
   1083101520.0
  ], 
  [
   46215, 
   null, 
   "sglaine", 
   "Okay, sglaine, I have a question for you...what will you say if we do find substantial amounts of chemical and biological weapons from Iraq, either in Iraq, or in Syria, or anywhere else?\n The point is they have not been found. So we cant jump to conclutions and start a war unless you ahve the evidence. What I am saying is that would be the same thing if the cops nailed and convicting you of a crime that there was no evidence.", 
   {}, 
   46212, 
   null, 
   1083101580.0
  ], 
  [
   46217, 
   null, 
   "jim's trucking", 
   "The point is they have not been found. So we cant jump to conclutions and start a war unless you ahve the evidence. What I am saying is that would be the same thing if the cops nailed and convicting you of a crime that there was no evidence.\n\n \n You still haven't answered the question.\n \n What will you say if and when we do find the weapons?", 
   {}, 
   46215, 
   null, 
   1083101820.0
  ], 
  [
   46218, 
   null, 
   "Ghost", 
   "The point is they have not been found. So we cant jump to conclutions and start a war unless you ahve the evidence. What I am saying is that would be the same thing if the cops nailed and convicting you of a crime that there was no evidence.\n\n \n No offense, but you're lousy at dodging questions. I'm not asking you to jump to any conclusions, I'm not asking about evidence, this is purely hypothetical. Now, would you mind simply answering the question?", 
   {}, 
   46215, 
   null, 
   1083101820.0
  ], 
  [
   46220, 
   null, 
   "sglaine", 
   "As mentioned befroe, there were several reasons for going to war. Inexplained whereabouts of known WMDs was just one of them. :xbanghead\n The point was WMDS for the war. there was none so that means it does not give us a right to invade Iraq.\n Did you know that Tony Blair is under fire for nonsupport from his people did not agree with Bushs foreign policy. They think we are wrong so does a lot of other people in the world. I hate to say it but we have lost a lot of our friends in this world because of this war.", 
   {}, 
   46213, 
   null, 
   1083102180.0
  ], 
  [
   46227, 
   null, 
   "Waxy", 
   "Correct me if I'm wrong, as I'm not about to go dig up any links, but haven't several high ranking Bush officials gone on record as saying there were/are no WMD's in Iraq, and that evidence of their existence was greatly exaggerated?\n \n To answer a question, if they find them, GREAT, I'm all for it, and Bush will have my mea culpas, until then, any staunch belief in their existence is undefendable IMHO. It's like trying to prove God exists. \n \n Waxy", 
   {}, 
   46220, 
   null, 
   1083104880.0
  ], 
  [
   46234, 
   null, 
   "jim's trucking", 
   "Correct me if I'm wrong, as I'm not about to go dig up any links, but haven't several high ranking Bush officials gone on record as saying there were/are no WMD's in Iraq, and that evidence of their existence was greatly exaggerated?\n \n To answer a question, if they find them, GREAT, I'm all for it, and Bush will have my mea culpas, until then, any staunch belief in their existence is undefendable IMHO. It's like trying to prove God exists.  \n \n Waxy\n\n \n Hardly a valid comparison. They did exist. They existed in Iraq. They have not been accounted for or found. That is all we know.\n \n Where they are? I don't know.\n When we'll find them? I don't know.\n How we'll learn of their whereabouts? I don't know.\n \n Do they exist? YES!", 
   {}, 
   46227, 
   null, 
   1083105960.0
  ], 
  [
   46241, 
   null, 
   "Waxy", 
   "Hardly a valid comparison. They did exist. They existed in Iraq. They have not been accounted for or found. That is all we know.\n \n Where they are? I don't know.\n When we'll find them? I don't know.\n How we'll learn of their whereabouts? I don't know.\n \n Do they exist? YES!\n\n \n How do you KNOW this? How do you know they ever did exist? Can you prove they existed? (beyond the few he used on the Kurds, which I know will be your first response.)\n \n No one set eyes on them during the build up, despite EXTENSIVE searches by VERY competent people, and even some of Saddam's general's have admitted they didn't exist and they were afraid to tell Saddam.\n \n You seem EXTREMELY confident in your knowledge, to the point that IMHO, it's much closer to blind faith.\n \n Waxy", 
   {}, 
   46234, 
   null, 
   1083106680.0
  ], 
  [
   46246, 
   null, 
   "jim's trucking", 
   "How do you KNOW this? How do you know they ever did exist? Can you prove they existed? (beyond the few he used on the Kurds, which I know will be your first response.)\n \n No one set eyes on them during the build up, despite EXTENSIVE searches by VERY competent people, and even some of Saddam's general's have admitted they didn't exist and they were afraid to tell Saddam.\n \n You seem EXTREMELY confident in your knowledge, to the point that IMHO, it's much closer to blind faith.\n \n Waxy\n\n Was it you that addressed this same need for an individual to actually see something to believe it existed? Seems like deja vu here. I don't need to go to the Lockheed manufacturing plant in Marietta to know that the next prototype jet fighter exists. I've been told by people who work there that it does.\n \n There have been accounts from people who should know regarding canisters of chemical weapons. Saddam used some on his own people. Do I have to know somebody who died from it to believe that it happened? If it did happen, how could it be that he had no WMDs?\n \n Weapons have just recently been seized by the Jordanians. (weapons that could have killed thousands upon thousands of people) These weapons likely came from Iraq through Syria. Convoys of midnight shipments from Iraq to Syria were recorded immediately prior to our invasion. (granted I did not actually witness them, but...) \n \n I suppose the only proof you will accept will come when some of them are actually demonstrated.", 
   {}, 
   46241, 
   null, 
   1083108000.0
  ], 
  [
   46273, 
   null, 
   "Waxy", 
   "Was it you that addressed this same need for an individual to actually see something to believe it existed? Seems like deja vu here. I don't need to go to the Lockheed manufacturing plant in Marietta to know that the next prototype jet fighter exists. I've been told by people who work there that it does.\n \n There have been accounts from people who should know regarding canisters of chemical weapons. Saddam used some on his own people. Do I have to know somebody who died from it to believe that it happened? If it did happen, how could it be that he had no WMDs?\n \n Weapons have just recently been seized by the Jordanians. (weapons that could have killed thousands upon thousands of people) These weapons likely came from Iraq through Syria. Convoys of midnight shipments from Iraq to Syria were recorded immediately prior to our invasion. (granted I did not actually witness them, but...) \n \n I suppose the only proof you will accept will come when some of them are actually demonstrated.\n\n \n That's a cop out answer and a VERY lame attempt to mix apples and oranges in an effort deflect the question on to one of my integrity. Give me a break, unlike some others here, I'm not in any way interested in tossing insults and mud back and forth.\n \n This has nothing to do with MY need to physically put my hands on them, only my need to hear some credible sources tell me that there is strong evidence that they did/do exist. So far I've only heard that they might have existed, but we can't prove it, and that he did use a few of them on the Kurds, which I freely accept.\n \n You're stating this \"mystery train in the night\" theory as though it was gospel, my recollection of the news story after I researched it, and it has come up many times before, is that some officials \"discovered\" a small caravan of vehicles in the desert moving towards Syria (which they managed to lose). When pressed, these officials admitted that it ws purely speculation that these vehicles were carrying WMDs, and that they had no proof to that effect.\n \n Waxy", 
   {}, 
   46246, 
   null, 
   1083110640.0
  ], 
  [
   46278, 
   null, 
   "sglaine", 
   "That's a cop out answer and a VERY lame attempt to mix apples and oranges in an effort deflect the question on to one of my integrity. Give me a break, unlike some others here, I'm not in any way interested in tossing insults and mud back and forth.\n \n This has nothing to do with MY need to physically put my hands on them, only my need to hear some credible sources tell me that there is strong evidence that they did/do exist. So far I've only heard that they might have existed, but we can't prove it, and that he did use a few of them on the Kurds, which I freely accept.\n \n You're stating this \"mystery train in the night\" theory as though it was gospel, my recollection of the news story after I researched it, and it has come up many times before, is that some officials \"discovered\" a small caravan of vehicles in the desert moving towards Syria (which they managed to lose). When pressed, these officials admitted that it ws purely speculation that these vehicles were carrying WMDs, and that they had no proof to that effect.\n \n Waxy\n Well put veary well put glad to see someone doing there homework around here. emoticon_xhoho", 
   {}, 
   46273, 
   null, 
   1083111000.0
  ], 
  [
   46288, 
   null, 
   "daewoo", 
   "\n There have been accounts from people who should know regarding canisters of chemical weapons. Saddam used some on his own people. Do I have to know somebody who died from it to believe that it happened? If it did happen, how could it be that he had no WMDs?\n\n \n I think we have examined this before, and it is most likely that the weapons he used were the ones we had provided him. They would have been at the end of their shelf life, which is why there were realtively few casualties despite the fat that he apparently used so much of them.\n \n \nWeapons have just recently been seized by the Jordanians. (weapons that could have killed thousands upon thousands of people) These weapons likely came from Iraq through Syria. Convoys of midnight shipments from Iraq to Syria were recorded immediately prior to our invasion. (granted I did not actually witness them, but...) \n \n \n Even the nes link you posted specifically states that the weapons those guys had were home brewed. They bought 20 tons of chemicals and made the weapons themselves. I suppose you could argue that they bought the raw chemicals in syria, but so what? You can buy everthing you need to make VX gas at your local hardware store, supermarket, and auto parts store.\n \n As far as \"midnight shipments\" I am not buying it. It seems that it is asking quite a bit of the American public to be stupid enough to believe that with all thesats we have, and all the intel overflights we were doing over Iraq, and we \"lost\" several trucks carrying WMD's? Even supposing they were all painted up with camo (which doesn't help much when it comes to evading satellite imagery) they would still stick out like a sore thumb on the IR.\n \n \nI suppose the only proof you will accept will come when some of them are actually demonstrated.\n\n \n How about if they just found some? Or even if they just found some facilities that tested positive for them? The UN inspectors only wanted 2 weeks to finish up inspecting the last of the IRaqi sites, and they had not managed to find any operational production facilities. The last places they wanted to look were not even suspected production facilities, they were possible storage sites. So far, we have found nothing at all. IF they really had the hundreds of tons of chemical and biological weapons that Bush claimed before the war, don't you think that in all this time we would have at least found SOME trace of them? \n \n The problem is, all the geniuses that are running the show were listening to Iraqi expats. They were apparently not bright enough to understand that these anti Saddam expats were telling them what they thought they wanted to hear, and trying to get saddam ousted. The problem is that they WANTED to believe.\n \n It is painfully clear by now thta there are no WMD's, and it is pretty unlikely that Saddams WMD programs ever existed at anywhere near the capacity our leaders claimed. It appears that the bulk of his chemical and biological arsenal was restricted to the weapons we gave him to fight the war with Iran.", 
   {}, 
   46246, 
   null, 
   1083112080.0
  ], 
  [
   46292, 
   null, 
   "JPSartre12", 
   "But it has taking bigger falls with Bush in office and that cost profits for investors. Am I right?\n\n \n No, you're wrong. My In-Laws lost their @#$ in the stock market under Clinton.\n Does that make it HIS fault? I've yet to see a scientific study anywhere that demonstrates a causal relationship between the President and the stock market.\n If you know of one, post the link.\n The stock market tanked as a result of several factors: speculation in dot coms, crooks running big energy companies, poor accounting practices, a recession and especially 9-11. Look at the largest drops and they were directly related to 9-11.", 
   {}, 
   46184, 
   null, 
   1083112500.0
  ], 
  [
   46303, 
   null, 
   "JPSartre12", 
   "How do you KNOW this? How do you know they ever did exist? Can you prove they existed? (beyond the few he used on the Kurds, which I know will be your first response.)\n \n No one set eyes on them during the build up, despite EXTENSIVE searches by VERY competent people, and even some of Saddam's general's have admitted they didn't exist and they were afraid to tell Saddam.\n \n You seem EXTREMELY confident in your knowledge, to the point that IMHO, it's much closer to blind faith.\n \n Waxy\n\n \n Not blind faith at all. Here is a summary of the National Security Archive Electronic Briefing Book No. 80\n http://www.gwu.edu/~nsarchiv/NSAEBB/NSAEBB80/#docs", 
   {}, 
   46241, 
   null, 
   1083113340.0
  ], 
  [
   46312, 
   null, 
   "jim's trucking", 
   "I think we have examined this before, and it is most likely that the weapons he used were the ones we had provided him. \n\n \n I haven't seen a list of weapons we provided to Iraq, but I seriously doubt that we gave him chemicals or gas.\n \n Can you provide any evidence that we did?\n \n Never mind. I found it. Shame on us!", 
   {}, 
   46288, 
   null, 
   1083115140.0
  ], 
  [
   46320, 
   null, 
   "jim's trucking", 
   "That's a cop out answer and a VERY lame attempt to mix apples and oranges in an effort deflect the question on to one of my integrity. Give me a break, unlike some others here, I'm not in any way interested in tossing insults and mud back and forth.\n \n This has nothing to do with MY need to physically put my hands on them, only my need to hear some credible sources tell me that there is strong evidence that they did/do exist. So far I've only heard that they might have existed, but we can't prove it, and that he did use a few of them on the Kurds, which I freely accept.\n \n You're stating this \"mystery train in the night\" theory as though it was gospel, my recollection of the news story after I researched it, and it has come up many times before, is that some officials \"discovered\" a small caravan of vehicles in the desert moving towards Syria (which they managed to lose). When pressed, these officials admitted that it ws purely speculation that these vehicles were carrying WMDs, and that they had no proof to that effect.\n \n Waxy\n\n \n I'm not questioning your integrity, just your reluctance to recognize that the weapons existed in Iraq prior to our invasion. I think there is sufficient proof from reliable sources to say that they did exist. There was enough to convince the UN.\n \n Since there is no proof from any source that they were destroyed, it is logical to assume that they still exist.", 
   {}, 
   46273, 
   null, 
   1083116940.0
  ], 
  [
   46322, 
   null, 
   "sglaine", 
   "No, you're wrong. My In-Laws lost their @#$ in the stock market under Clinton.\n Does that make it HIS fault? I've yet to see a scientific study anywhere that demonstrates a causal relationship between the President and the stock market.\n If you know of one, post the link.\n The stock market tanked as a result of several factors: speculation in dot coms, crooks running big energy companies, poor accounting practices, a recession and especially 9-11. Look at the largest drops and they were directly related to 9-11.\n\n JPSater I hate too burst your bubble but the market was very stable when Clinton. And not as many people lost there shirts during that time. Yes 9-11 did play a big factor in the mess yes I am not disppueting that claim. But how ever the Iraqy war is a big player now. Maybe your In-laws had bad investments I do not know or care to know. But as far as we go here we were better off when CLINTON was there. The dot com companys was a big flopp we all knew that was going to happen when they started. This whole thing is like a bad freeway pileup in a fog storm. The free trade is a mess too and that I will blame Clinton for.", 
   {}, 
   46292, 
   null, 
   1083117480.0
  ], 
  [
   46331, 
   null, 
   "Rev. HellH0und", 
   "Do they really? emoticon_wow \n \n How? emoticon_confused \n \n Waxy\n\n Fr\n \n \n From another thread:\n \n \n \n If The Bush Administration Lied About WMD, So Did These People -- Version 3.0\n by John Hawkins\n Since we haven't found WMD in Iraq, a lot of the anti-war/anti-Bush crowd is saying that the Bush administration lied about Iraq's weapons of mass destruction. Well, if they're going to claim that the Bush administration lied, then there sure are a lot of other people, including quite a few prominent Democrats, who have told the same \"lies\" since the inspectors pulled out of Iraq in 1998. Here are just a few examples that prove that the Bush administration didn't lie about weapons of mass destruction... \n \n \"[W]e urge you, after consulting with Congress, and consistent with the U.S. Constitution and laws, to take necessary actions (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" -- From a letter signed by Joe Lieberman, Dianne Feinstein, Barbara A. Milulski, Tom Daschle, & John Kerry among others on October 9, 1998 \n \n \"This December will mark three years since United Nations inspectors last visited Iraq. There is no doubt that since that time, Saddam Hussein has reinvigorated his weapons programs. Reports indicate that biological, chemical and nuclear programs continue apace and may be back to pre-Gulf War status. In addition, Saddam continues to refine delivery systems and is doubtless using the cover of a licit missile program to develop longer- range missiles that will threaten the United States and our allies.\" -- From a December 6, 2001 letter signed by Bob Graham, Joe Lieberman, Harold Ford, & Tom Lantos among others \n \n \"Whereas Iraq has consistently breached its cease-fire agreement between Iraq and the United States, entered into on March 3, 1991, by failing to dismantle its weapons of mass destruction program, and refusing to permit monitoring and verification by United Nations inspections; Whereas Iraq has developed weapons of mass destruction, including chemical and biological capabilities, and has made positive progress toward developing nuclear weapons capabilities\" -- From a joint resolution submitted by Tom Harkin and Arlen Specter on July 18, 2002 \n \n \"Saddam's goal ... is to achieve the lifting of U.N. sanctions while retaining and enhancing Iraq's weapons of mass destruction programs. We cannot, we must not and we will not let him succeed.\" -- Madeline Albright, 1998 \n \n \"(Saddam) will rebuild his arsenal of weapons of mass destruction and some day, some way, I am certain he will use that arsenal again, as he has 10 times since 1983\" -- National Security Adviser Sandy Berger, Feb 18, 1998 \n \n \"Iraq made commitments after the Gulf War to completely dismantle all weapons of mass destruction, and unfortunately, Iraq has not lived up to its agreement.\" -- Barbara Boxer, November 8, 2002 \n \n \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retained some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capability. Intelligence reports also indicate that he is seeking nuclear weapons, but has not yet achieved nuclear capability.\" -- Robert Byrd, October 2002 \n \n \"There's no question that Saddam Hussein is a threat... Yes, he has chemical and biological weapons. He's had those for a long time. But the United States right now is on a very much different defensive posture than we were before September 11th of 2001... He is, as far as we know, actively pursuing nuclear capabilities, though he doesn't have nuclear warheads yet. If he were to acquire nuclear weapons, I think our friends in the region would face greatly increased risks as would we.\" -- Wesley Clark on September 26, 2002 \n \n \"What is at stake is how to answer the potential threat Iraq represents with the risk of proliferation of WMD. Baghdad's regime did use such weapons in the past. Today, a number of evidences may lead to think that, over the past four years, in the absence of international inspectors, this country has continued armament programs.\" -- Jacques Chirac, October 16, 2002 \n \n \"The community of nations may see more and more of the very kind of threat Iraq poses now: a rogue state with weapons of mass destruction, ready to use them or provide them to terrorists. If we fail to respond today, Saddam and all those who would follow in his footsteps will be emboldened tomorrow.\" -- Bill Clinton in 1998 \n \n \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including Al Qaeda members, though there is apparently no evidence of his involvement in the terrible events of September 11, 2001. It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons. Should he succeed in that endeavor, he could alter the political and security landscape of the Middle East, which as we know all too well affects American security.\" -- Hillary Clinton, October 10, 2002 \n \n \"I am absolutely convinced that there are weapons...I saw evidence back in 1998 when we would see the inspectors being barred from gaining entry into a warehouse for three hours with trucks rolling up and then moving those trucks out.\" -- Clinton's Secretary of Defense William Cohen in April of 2003 \n \n \"Iraq is not the only nation in the world to possess weapons of mass destruction, but it is the only nation with a leader who has used them against his own people.\" -- Tom Daschle in 1998 \n \n \"Saddam Hussein's regime represents a grave threat to America and our allies, including our vital ally, Israel. For more than two decades, Saddam Hussein has sought weapons of mass destruction through every available means. We know that he has chemical and biological weapons. He has already used them against his neighbors and his own people, and is trying to build more. We know that he is doing everything he can to build nuclear weapons, and we know that each day he gets closer to achieving that goal.\" -- John Edwards, Oct 10, 2002 \n \n \"The debate over Iraq is not about politics. It is about national security. It should be clear that our national security requires Congress to send a clear message to Iraq and the world: America is united in its determination to eliminate forever the threat of Iraq's weapons of mass destruction.\" -- John Edwards, Oct 10, 2002 \n \n \"I share the administration's goals in dealing with Iraq and its weapons of mass destruction.\" -- Dick Gephardt in September of 2002 \n \n \"Iraq does pose a serious threat to the stability of the Persian Gulf and we should organize an international coalition to eliminate his access to weapons of mass destruction. Iraq's search for weapons of mass destruction has proven impossible to completely deter and we should assume that it will continue for as long as Saddam is in power.\" -- Al Gore, 2002 \n \n \"We are in possession of what I think to be compelling evidence that Saddam Hussein has, and has had for a number of years, a developing capacity for the production and storage of weapons of mass destruction.\" -- Bob Graham, December 2002 \n \n \"Saddam Hussein is not the only deranged dictator who is willing to deprive his people in order to acquire weapons of mass destruction.\" -- Jim Jeffords, October 8, 2002 \n \n \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" -- Ted Kennedy, September 27, 2002 \n \n \"There is no doubt that Saddam Hussein's regime is a serious danger, that he is a tyrant, and that his pursuit of lethal weapons of mass destruction cannot be tolerated. He must be disarmed.\" -- Ted Kennedy, Sept 27, 2002 \n \n \"I will be voting to give the president of the United States the authority to use force - if necessary - to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" -- John F. Kerry, Oct 2002 \n \n \"The threat of Saddam Hussein with weapons of mass destruction is real, but as I said, it is not new. It has been with us since the end of that war, and particularly in the last 4 years we know after Operation Desert Fox failed to force him to reaccept them, that he has continued to build those weapons. He has had a free hand for 4 years to reconstitute these weapons, allowing the world, during the interval, to lose the focus we had on weapons of mass destruction and the issue of proliferation.\" -- John Kerry, October 9, 2002 \n \n \"(W)e need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime. We all know the litany of his offenses. He presents a particularly grievous threat because he is so consistently prone to miscalculation. ...And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction. That is why the world, through the United Nations Security Council, has spoken with one voice, demanding that Iraq disclose its weapons programs and disarm. So the threat of Saddam Hussein with weapons of mass destruction is real, but it is not new. It has been with us since the end of the Persian Gulf War.\" -- John Kerry, Jan 23, 2003 \n \n \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandates of the United Nations and is building weapons of mass destruction and the means of delivering them.\" -- Carl Levin, Sept 19, 2002 \n \n \"Every day Saddam remains in power with chemical weapons, biological weapons, and the development of nuclear weapons is a day of danger for the United States.\" -- Joe Lieberman, August, 2002\n \n \"Over the years, Iraq has worked to develop nuclear, chemical and biological weapons. During 1991 - 1994, despite Iraq's denials, U.N. inspectors discovered and dismantled a large network of nuclear facilities that Iraq was using to develop nuclear weapons. Various reports indicate that Iraq is still actively pursuing nuclear weapons capability. There is no reason to think otherwise. Beyond nuclear weapons, Iraq has actively pursued biological and chemical weapons.U.N. inspectors have said that Iraq's claims about biological weapons is neither credible nor verifiable. In 1986, Iraq used chemical weapons against Iran, and later, against its own Kurdish population. While weapons inspections have been successful in the past, there have been no inspections since the end of 1998. There can be no doubt that Iraq has continued to pursue its goal of obtaining weapons of mass destruction.\" -- Patty Murray, October 9, 2002 \n \n \"As a member of the House Intelligence Committee, I am keenly aware that the proliferation of chemical and biological weapons is an issue of grave importance to all nations. Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" -- Nancy Pelosi, December 16, 1998 \n \n \"Even today, Iraq is not nearly disarmed. Based on highly credible intelligence, UNSCOM [the U.N. weapons inspectors] suspects that Iraq still has biological agents like anthrax, botulinum toxin, and clostridium perfringens in sufficient quantity to fill several dozen bombs and ballistic missile warheads, as well as the means to continue manufacturing these deadly agents. Iraq probably retains several tons of the highly toxic VX substance, as well as sarin nerve gas and mustard gas. This agent is stored in artillery shells, bombs, and ballistic missile warheads. And Iraq retains significant dual-use industrial infrastructure that can be used to rapidly reconstitute large-scale chemical weapons production.\" -- Ex-Un Weapons Inspector Scott Ritter in 1998 \n \n \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years. And that may happen sooner if he can obtain access to enriched uranium from foreign sources -- something that is not that difficult in the current world. We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" -- John Rockefeller, Oct 10, 2002 \n \n \"Saddam's existing biological and chemical weapons capabilities pose a very real threat to America, now. Saddam has used chemical weapons before, both against Iraq's enemies and against his own people. He is working to develop delivery systems like missiles and unmanned aerial vehicles that could bring these deadly weapons against U.S. forces and U.S. facilities in the Middle East.\" -- John Rockefeller, Oct 10, 2002 \n \n \"Whether one agrees or disagrees with the Administration's policy towards Iraq, I don't think there can be any question about Saddam's conduct. He has systematically violated, over the course of the past 11 years, every significant UN resolution that has demanded that he disarm and destroy his chemical and biological weapons, and any nuclear capacity. This he has refused to do. He lies and cheats; he snubs the mandate and authority of international weapons inspectors; and he games the system to keep buying time against enforcement of the just and legitimate demands of the United Nations, the Security Council, the United States and our allies. Those are simply the facts.\" -- Henry Waxman, Oct 10, 2002", 
   {
    "unicode_changes_made": true
   }, 
   46203, 
   null, 
   1083120240.0
  ], 
  [
   46332, 
   null, 
   "Rev. HellH0und", 
   "JPSater I hate too burst your bubble but the market was very stable when Clinton. And not as many people lost there shirts during that time. Yes 9-11 did play a big factor in the mess yes I am not disppueting that claim. But how ever the Iraqy war is a big player now. Maybe your In-laws had bad investments I do not know or care to know. But as far as we go here we were better off when CLINTON was there. The dot com companys was a big flopp we all knew that was going to happen when they started. This whole thing is like a bad freeway pileup in a fog storm. The free trade is a mess too and that I will blame Clinton for.\n\n \n \n The economy ytanked during clinton's presidency not bush's....", 
   {}, 
   46322, 
   null, 
   1083120540.0
  ], 
  [
   46334, 
   null, 
   "sglaine", 
   "The economy ytanked during clinton's presidency not bush's....\n\n Prove it without a Conservative news sourse.", 
   {}, 
   46332, 
   null, 
   1083120780.0
  ], 
  [
   46335, 
   null, 
   "sglaine", 
   "Bush has done nothing on the demestic side of things like health care. For education he has done nothing. He has rased the national debt. He also wanted war before he got elected. Oh yes he has done zip zip.", 
   {}, 
   46334, 
   null, 
   1083121080.0
  ], 
  [
   46339, 
   null, 
   "Rev. HellH0und", 
   "Prove it without a Conservative news sourse.\n\n \n \n \n ok.... hows this... Ultra lefty socialist website\n \n \n \"The situation appeared so dire to the Federal Reserve at the end of the year that they called an emergency meeting and reduced interest rates by a substantial one half of one percent. They are desperate to prevent the economic slowdown from spreading into the still growing construction industry and service sector. Whether this happens will depend on what shocks hit the system as the year proceeds. The California energy crisis is still escalating, layoffs are increasing, and consumer confidence has fallen substantially. This attempt by the Federal Reserve to prevent a recession by lowering interests rates will fail as all others have. A new economic downturn is inevitable under capitalism - it's just a question of when. We will have to see whether the economy can stagger along with slow growth or will collapse into a full-blown recession before the year is out. \"\n \n \n \n And:\n \n Grizzly's Growlings Current Report\n \n \n \"Well, maybe that stunning front-page photo of the SWAT team commando brandishing an automatic weapon in the face of little Elian Gonzalez hiding in the closet may come to haunt Clinton-Gore even more than a catastrophic market crash.\"\n \n \n See thats how you provide evidence for your posts. Try it sometime emoticon_cool", 
   {}, 
   46334, 
   null, 
   1083123180.0
  ], 
  [
   46340, 
   null, 
   "Rev. HellH0und", 
   "Bush has done nothing on the demestic side of things like health care. For education he has done nothing. He has rased the national debt. He also wanted war before he got elected. Oh yes he has done zip zip.\n\n \n \n ok your turn... \n provide 1 non lefty source that says Bush wanted war before \"he got elected\"", 
   {}, 
   46335, 
   null, 
   1083123360.0
  ], 
  [
   46342, 
   null, 
   "JPSartre12", 
   "ok your turn... \n provide 1 non lefty source that says Bush wanted war before \"he got elected\"\n\n \n Please don't feed the trolls.", 
   {}, 
   46340, 
   null, 
   1083123720.0
  ], 
  [
   46361, 
   null, 
   "daewoo", 
   "I haven't seen a list of weapons we provided to Iraq, but I seriously doubt that we gave him chemicals or gas.\n \n Can you provide any evidence that we did?\n \n Never mind. I found it. Shame on us!\n\n \n This is an important point that is deserving of some thought (and thanks for doing your own research). The big \"evidence\" f his weapons programs to date is the fact he used them (chem/bio) against the kurds, and during the Iran/Iraq war. We know he had them and used them during the Iran/Iraq war, because we were supplying them. The big question is, where the ones he used against the kurds leftovers, or was he producing his own?\n \n Looking at eye witness accounts, it would seem that Iraqi fighters dropped chemical weapons on Halabja for 3 days. There were reports by several eye witnesses that they dropped hundreds of chemical weapons as well as conventional bombs on the city, as well as launching chem/bio shells from the surrounding countryside into the city. THe result....5000 dead, 7000 injured or with long term illnesses (BBC). In a city of 40-50,000, 500 dead and 7000 injured is nothing. AFter droppign nerve agents on the city for 3 days (specifically sarin, tabun, and VX) there should have been a MUCH higher casualty figure. Even the most liberal estimates only put the high end casualty figure at 12,000 (kurdistan regional government). So, why weren't more poeple killed? We can say in almost complete confidence that he DID in fact have hundreds of chemical munitions dropped ont he city. \n \n THe only plausible explanation is that the stuff he was using was old. Chemical weapons have a shelf life, just like anything else. Over time, they loose their effectiveness. This is the only plausable explanation I hav heard for why the casualties were so much lower than one would expect form such an attack. HE WAS USING THE WEAPONS WE HAD GIVEN HIM YEARS EARLIER. He had noit created his own, he was using the leftovers from the war. Saddam knew they had a limited shelf life, and that they were about dead.\n \n Our intelligence people also know what the shelf life of these weapons is. THey kow the effects of using old weapons. They know what kind of fatalities SHOULD have occured in Halabja. There is really no other explanation for the events as they occured other than that he was using old weapons, i.e the ones we provided him.\n \n This is why I accuse the bushies of lying. THEY KNEW where the weapons came from. THEY KNEW they were the old ones we gave him, yet they cited the attacks on the kurds as proof that he had WMD capability, knowing full well it proved nothing of the kind, and in fact it would point to the exact opposite conclusion. If he had the capability to create his own chem/bio weapons, why would he use old junk that he knew full well would not be very effective?\n \n MAybe they still believed that he had since then established his own programs, and maybe thye believed that he was producing weapons (though I doubt it, since the UN inspectors were close enough to finished to give a reasonable report). Even if they did believe the above, I think that using the gassing of the kurds as \"proof\" of Saddams weapons capabilities was dishonest, and I think that a nation faced with war has the right to expect complete honesty from its leaders.", 
   {}, 
   46312, 
   null, 
   1083137040.0
  ], 
  [
   46377, 
   null, 
   "jim's trucking", 
   "Please don't feed the trolls.\n\n \n For some unknown reason, I think it makes no difference with this one.", 
   {}, 
   46342, 
   null, 
   1083157260.0
  ], 
  [
   46381, 
   null, 
   "sglaine", 
   "I ask you Rev.Hellhound what has BuSh done for the workig class? Jims Trucking what has BuSh done for health care? BuSh has done nothing it is plain as day has done nothing Oh he has he has been feeding the rich.", 
   {}, 
   46377, 
   null, 
   1083160680.0
  ], 
  [
   46383, 
   null, 
   "Rev. HellH0und", 
   "I ask you Rev.Hellhound what has BuSh done for the workig class? Jims Trucking what has BuSh done for health care? BuSh has done nothing it is plain as day has done nothing Oh he has he has been feeding the rich.\n\n \n \n \n Uh uh not until you answer me first... We have already addressed these things.... ad nauseum...", 
   {}, 
   46381, 
   null, 
   1083161520.0
  ], 
  [
   46385, 
   null, 
   "Rev. HellH0und", 
   "Daewoo,\n \n \n I have to disagree with you on this one. Some agents have a very long shelf life and some agents do not. The effectivness of Chemical weapons is a slave to the weather. A change in wind direction, a strong up draft, rain, whatever can nulify the effects of most chemical weapons if conditions were right. This Link offers some information.\n \n \n \"THE STOCKPILE PROBABLY IS FAIRLY EVENLY DIVIDED BETWEEN BLISTER AND NERVE AGENTS. THE MOST LIKELY AGENTS ARE THE BLISTER AGENT SULFUR MUSTARD AND THE NERVE AGENTS SARIN AND GF. WE ASSESS THAT MOST OF THE SARIN AND GF ARE WEAPONIZE IN BINARY FORM AND DO NOT SUFFER FROM THE LIMITED SHELF-LIFE\n \n \n Also from the mouth of the traitor Scott Ritter:\n \n \n \"VX is a different subject altogether. Iraq lied to us from day one about VX. They said they never had a VX program. But we uncovered their entire research-and-development plant, which had been bombed during Desert Storm and destroyed. Using documentation recovered from that, we were able to track down and discover Iraq's stockpile of VX, confirming that it had been destroyed. We also exposed another Iraqi lie -- that they had never stabilized VX. We even proved that they put it in warheads, contrary to what they had declared. \"\n \n \n But how does he know he got it all? besides he changed his tune to suit his personal gains: \n \n \"Ritter accepted over $400,000 from an American businessman with ties to Saddam's government to make a documentary film. Ritter acknowledged to the Washington Post this benefactor \"opened the door\" to the Iraqi government. The head of the Iraqi National Monitoring Directorate, Hussam Mohammed Amin, told Reuters that Ritter was in Iraq \"to film a documentary on the impact of the unjust embargo on the Iraqi people and (show) that Iraq has no more weapons of mass destruction.\" ", 
   {}, 
   46361, 
   null, 
   1083162480.0
  ], 
  [
   46459, 
   null, 
   "jim's trucking", 
   "I ask you Rev.Hellhound what has BuSh done for the workig class? Jims Trucking what has BuSh done for health care? BuSh has done nothing it is plain as day has done nothing Oh he has he has been feeding the rich.\n\n \n As I have pointed to many links in another thread where Bush's policies have led to the largest economic growth rate in 20 years, I think you should point out how Kerry's \"Let's roll back the tax cuts for the wealthy\" Plan will help the working man. What do you think will happen to the economy then?\n \n One of the differences between the Democrats and Republicans is this:\n \n The Democrats will offer you $10 per vote to vote for them.\n \n The Republicans will help you get a job that pays $10 an hour.", 
   {}, 
   46381, 
   null, 
   1083179880.0
  ], 
  [
   46470, 
   null, 
   "Waxy", 
   "I'm not questioning your integrity, just your reluctance to recognize that the weapons existed in Iraq prior to our invasion. I think there is sufficient proof from reliable sources to say that they did exist. There was enough to convince the UN.\n \n Since there is no proof from any source that they were destroyed, it is logical to assume that they still exist.\n\n \n I think Daewoo handled the assertion that the weapons existed in Iraq prior to the invasion better than I could have done myself. Check out his post.\n \n There was never enough to convince the UN, that's why they didn't come along for the ride. (I know, I know, they were all in bed with Saddam, yadda yadda) I can't even believe you typed that. They consistently reported that they were unable to find any evidence of WMD's, let alone any WMD's themselves.", 
   {}, 
   46320, 
   null, 
   1083182340.0
  ], 
  [
   46472, 
   null, 
   "sglaine", 
   "I think Daewoo handled the assertion that the weapons existed in Iraq prior to the invasion better than I could have done myself. Check out his post.\n \n There was never enough to convince the UN, that's why they didn't come along for the ride. (I know, I know, they were all in bed with Saddam, yadda yadda) I can't even believe you typed that. They consistently reported that they were unable to find any evidence of WMD's, let alone any WMD's themselves.\n\n Yea Waxy they keep skipping and skipping like a broken record on this one.", 
   {}, 
   46470, 
   null, 
   1083182520.0
  ], 
  [
   46473, 
   null, 
   "sglaine", 
   "As I have pointed to many links in another thread where Bush's policies have led to the largest economic growth rate in 20 years, I think you should point out how Kerry's \"Let's roll back the tax cuts for the wealthy\" Plan will help the working man. What do you think will happen to the economy then?\n \n One of the differences between the Democrats and Republicans is this:\n \n The Democrats will offer you $10 per vote to vote for them.\n \n The Republicans will help you get a job that pays $10 an hour.\n\n What in the hect is that propergander supposed to be? REPUBLICANS will not do sqaut for you keep dreaming. Your getting funner every day.", 
   {}, 
   46459, 
   null, 
   1083182640.0
  ], 
  [
   46474, 
   null, 
   "Waxy", 
   "Rev. Hellhound,\n \n I know you probably feel that your post proves your point, I'd suggest otherwise. What it does prove, is that every politician and talking head in Washington read the same memo. Simply because they were told and believed that WMD's were there, often based on incomplete or misleading intel from both US and coalition sources, and went on record as saying so, proves nothing as to theactual existence of WMDs.\n \n I know you greatly enjoyed the partisan aspect of your post, but quite frankly I could care less, Rep or Dem, Bush or Clinton/Kerry, makes no difference to me.\n \n Waxy", 
   {}, 
   46470, 
   null, 
   1083182640.0
  ], 
  [
   46476, 
   null, 
   "Waxy", 
   "JP, \n \n That's a huge link, it'd take hours, maybe days, to wade through all that. On first skim of the \"executive summaries\" it appears that there are a fair number of links both for and against the presence of WMD, or more specifically, their stated numbers/deployability.\n \n I'll try to wade through some of it.\n \n Waxy", 
   {}, 
   46474, 
   null, 
   1083182760.0
  ], 
  [
   46478, 
   null, 
   "Ghost", 
   "Some of you people don't seem to be able to accept the fact that people from both ends of the political spectrum (see the quotes) and across the world believed Iraq had WMDs. He used them, and there was much of it never accounted for. The logical assumption is that he still had them.\n \n So we haven't found them...do you really think Saddam would leave his weapons in a place where we could easily find them and have justification for the war? Of course not. He would try to hide them (which is ridiculously easy in a FLIPPPIN DESERT, all he would have to do is bury a few containers the size of briefcases) or hand them off to someone. Who, you might ask? Well, Syria shares a border with Iraq, and they were both controlled by the Baath party. And oh yeah, Kay said that while the invasion seemed imminent, there was a huge amount of truck traffic along the border...seem suspicious to anyone? He could have easily handed them off to terrorist groups. He's known to have funded Palestinian terror groups.\n \n And the economy? We've had the greatest quarter of economin growth in 20 years, and unemployment I believe is around 5.7%, right where it was in the mid 90s during the height of Clinton's presidency. And keep in mind that Bush inherited a recession, the economy had to endure 9/11 and the effects of that, and that jobs are always the lagging indicator of economic recovery...I'd say that the economy is pretty damned good right now, chief.", 
   {}, 
   46474, 
   null, 
   1083183600.0
  ], 
  [
   46484, 
   null, 
   "sglaine", 
   "Some of you people don't seem to be able to accept the fact that people from both ends of the political spectrum (see the quotes) and across the world believed Iraq had WMDs. He used them, and there was much of it never accounted for. The logical assumption is that he still had them.\n \n So we haven't found them...do you really think Saddam would leave his weapons in a place where we could easily find them and have justification for the war? Of course not. He would try to hide them (which is ridiculously easy in a FLIPPPIN DESERT, all he would have to do is bury a few containers the size of briefcases) or hand them off to someone. Who, you might ask? Well, Syria shares a border with Iraq, and they were both controlled by the Baath party. And oh yeah, Kay said that while the invasion seemed imminent, there was a huge amount of truck traffic along the border...seem suspicious to anyone? He could have easily handed them off to terrorist groups. He's known to have funded Palestinian terror groups.\n \n And the economy? We've had the greatest quarter of economin growth in 20 years, and unemployment I believe is around 5.7%, right where it was in the mid 90s during the height of Clinton's presidency. And keep in mind that Bush inherited a recession, the economy had to endure 9/11 and the effects of that, and that jobs are always the lagging indicator of economic recovery...I'd say that the economy is pretty damned good right now, chief.\n\n Seckulations Ilove that. would you like being convicted of something without evidence of corse you would not. And BuSh did not inerit a receesion he caused it. Nice try to convince us but it did not work. The receesion started when he took office.", 
   {}, 
   46478, 
   null, 
   1083184260.0
  ], 
  [
   46486, 
   null, 
   "jim's trucking", 
   "I think Daewoo handled the assertion that the weapons existed in Iraq prior to the invasion better than I could have done myself. Check out his post.\n \n There was never enough to convince the UN, that's why they didn't come along for the ride. (I know, I know, they were all in bed with Saddam, yadda yadda) I can't even believe you typed that.  They consistently reported that they were unable to find any evidence of WMD's, let alone any WMD's themselves.\n\n \n I don't understand why you can't believe I typed that...you read it.\n \n Why did the UN require proof of destruction of certain weapons if they didn't think he had them?", 
   {}, 
   46470, 
   null, 
   1083184560.0
  ], 
  [
   46502, 
   null, 
   "Waxy", 
   "I don't understand why you can't believe I typed that...you read it.\n \n Why did the UN require proof of destruction of certain weapons if they didn't think he had them?\n\n \n The key being \"certain weapons\", aka his missile program. Also, the belief, as many on the board share (myself included to some extent), that he may have had US and Russian supplied weapons left over from the Iran/Iraq war.\n \n Why did Hans Blix consistently report that there was no evidence of WMD's?\n \n Waxy", 
   {}, 
   46486, 
   null, 
   1083187020.0
  ], 
  [
   46503, 
   null, 
   "jim's trucking", 
   "The key being \"certain weapons\", aka his missile program. Also, the belief, as many on the board share (myself included to some extent), that he may have had US and Russian supplied weapons left over from the Iran/Iraq war.\n \n Why did Hans Blix consistently report that there was no evidence of WMD's?\n \n Waxy\n\n \n Perhaps because Saddam hid them well or sent them to Syria.", 
   {}, 
   46502, 
   null, 
   1083187380.0
  ], 
  [
   46506, 
   null, 
   "jim's trucking", 
   "Seckulations Ilove that. would you like being convicted of something without evidence of corse you would not. And BuSh did not inerit a receesion he caused it. Nice try to convince us but it did not work. The receesion started when he took office.\n\n \n Apparently, you didn't read the LEFTIST/SOCIALIST SOURCE that said Clinton did it.\n \n economy tanked under Clinton\n http://www.socialistalternative.org/justice23/4.html\n \n http://www.bearmarketcentral.com/GrizzlysGrowlings/042400.htm\n \n \n \n Apparently, you don't read much at all. You just spout your gibberish for the sake of being in someone's face.", 
   {}, 
   46484, 
   null, 
   1083187620.0
  ], 
  [
   46509, 
   null, 
   "Waxy", 
   "Perhaps because Saddam hid them well or sent them to Syria.\n\n \n You put your faith in Saddam's abilities, I put mine in those of the UN inspectors and the US military to date. I guess that's the difference.\n \n Waxy", 
   {}, 
   46503, 
   null, 
   1083188040.0
  ], 
  [
   46514, 
   null, 
   "jim's trucking", 
   "You put your faith in Saddam's abilities, I put mine in those of the UN inspectors and the US military to date. I guess that's the difference.\n \n Waxy\n\n \n It doesn't take the mind of a rocket scientist to bury weapons in the sand.\n \n The inspectors were allowed to look where Saddam permitted.\n \n Oh...that explains why we found 30 Mig fighters only after the wind blew the sand off their tails.\n \n It's not hard to find a place to bury something in a desert...it's not hard to cover up the traces...and it is hard to detect its presence.", 
   {}, 
   46509, 
   null, 
   1083188520.0
  ], 
  [
   46522, 
   null, 
   "mamboni", 
   "If it's buried, that basically means to me that they're complying. They've, in a sense, subverted their weapons and they're no longer of any use. \n \n I think it stands that their claims were over-exaggerated, and I believe our intelligence was misled. There won't be any significant findings in Iraq, because these WMD's simply cease to exist. I think the U.N. was basically correct, but they're not always reliable so the U.S. decided to try it's hand and unmasking those evasive WMD's. I don't think they'll be discovered, but if they are, then great. Bush was right, his rationale for the war is justified and it was a sensible endeavor. \n \n Either way, Iraq is better-off without Saddam Hussein, but who knows what kind of despot we'll put in to power this time. :/", 
   {}, 
   46514, 
   null, 
   1083191040.0
  ], 
  [
   46526, 
   null, 
   "JPSartre12", 
   "JP, \n \n That's a huge link, it'd take hours, maybe days, to wade through all that. On first skim of the \"executive summaries\" it appears that there are a fair number of links both for and against the presence of WMD, or more specifically, their stated numbers/deployability.\n \n I'll try to wade through some of it.\n \n Waxy\n\n \n Waxy,\n You're right, it is a huge report and there are references both for and against the assertion that Iraq had WMDs. That's part of the problem, contradictory reports and info and lots of disconnected observations.\n We know that Iraq used WMDs on his own people. We know that he used Scuds in the Gulf War. We know that he HAD a nuclear program at some point. We know that he dabbled in Sarin and other chemical agents and we know that hsi own scientists lied to him about their WMD programs.\n IMO, it came down to a risk/benefit analysis. Do we take him out now or wait until we're 100% sure that he has WMDs. In light of 9-11, GW chose not to wait. I won't second guess that decision.", 
   {}, 
   46476, 
   null, 
   1083191700.0
  ], 
  [
   46527, 
   null, 
   "sglaine", 
   "If it's buried, that basically means to me that they're complying. They've, in a sense, subverted their weapons and they're no longer of any use. \n \n I think it stands that their claims were over-exaggerated, and I believe our intelligence was misled. There won't be any significant findings in Iraq, because these WMD's simply cease to exist. I think the U.N. was basically correct, but they're not always reliable so the U.S. decided to try it's hand and unmasking those evasive WMD's. I don't think they'll be discovered, but if they are, then great. Bush was right, his rationale for the war is justified and it was a sensible endeavor. \n \n Either way, Iraq is better-off without Saddam Hussein, but who knows what kind of despot we'll put in to power this time. :/\n\n Yes yes yes it could be like throwing more fuel on the fire.", 
   {}, 
   46522, 
   null, 
   1083191700.0
  ], 
  [
   46532, 
   null, 
   "Waxy", 
   "It doesn't take the mind of a rocket scientist to bury weapons in the sand.\n \n The inspectors were allowed to look where Saddam permitted.\n \n Oh...that explains why we found 30 Mig fighters only after the wind blew the sand off their tails.\n \n It's not hard to find a place to bury something in a desert...it's not hard to cover up the traces...and it is hard to detect its presence.\n\n \n I disagree. You don't give the US military or the UN much credit. They have, radar, seismic, geomag, etc, as well as sophisticated detection equipment, it's not that difficult to sweep the desert. Is it 100% effective, especially for small items? Of course not. \n \n Answer me this though, if we have all of these reports and intelligence of WMDs existing, how can these same sources not provide any indication of where to look for them now, or how they got away? How can all of these puported weapons disappear over a short period of time, right under our noses, without a trace? (I know, the night convoys to Syria, check Kay's official position, he's anything but definitive.)\n \n In the months leading up to the invasion, UN inspectors had free reign. They found nothing. The US military has been scouring Iraq and intelligence officials are working around the clock, still nothing. I have great difficulty believing that Saddam and his incompetent generals have the ability to completely fool that many highly trained people. \n \n You obviously don't.\n \n Waxy", 
   {}, 
   46514, 
   null, 
   1083192600.0
  ], 
  [
   46533, 
   null, 
   "Waxy", 
   "Waxy,\n You're right, it is a huge report and there are references both for and against the assertion that Iraq had WMDs. That's part of the problem, contradictory reports and info and lots of disconnected observations.\n We know that Iraq used WMDs on his own people. We know that he used Scuds in the Gulf War. We know that he HAD a nuclear program at some point. We know that he dabbled in Sarin and other chemical agents and we know that hsi own scientists lied to him about their WMD programs.\n IMO, it came down to a risk/benefit analysis. Do we take him out now or wait until we're 100% sure that he has WMDs. In light of 9-11, GW chose not to wait. I won't second guess that decision.\n\n \n Great post JP, no political BS, just logic and facts. I wish we could all, myself included, debate things in this manner. \n \n I think that link does illustrate the problem. We were unsure then, and we're unsure now.\n \n I also agree with the risk analysis assessment, but we're not talking the stock market, we're talking the lives of our fighting men and women. I'd want to be VERY sure of the situation before I went in. I don't feel that Bush allowed for that in his rapid escalation toward war. (I'm very aware of UN res 1441)\n \n Waxy", 
   {}, 
   46526, 
   null, 
   1083192900.0
  ], 
  [
   46554, 
   null, 
   "daewoo", 
   "So we haven't found them...do you really think Saddam would leave his weapons in a place where we could easily find them and have justification for the war? Of course not. He would try to hide them (which is ridiculously easy in a FLIPPPIN DESERT, all he would have to do is bury a few containers the size of briefcases) or hand them off to someone. Who, you might ask? Well, Syria shares a border with Iraq, and they were both controlled by the Baath party. And oh yeah, Kay said that while the invasion seemed imminent, there was a huge amount of truck traffic along the border...seem suspicious to anyone? He could have easily handed them off to terrorist groups. He's known to have funded Palestinian terror groups.\n\n \n Where do you hide things in a desert? We are not talking a few briefcases of chem/bio weapons, we are talking hundreds of tons of the stuff. A few briefcases of WMD's is more like weapons of minor destruction, unless it is a tactical nuke. \n \n As far as the cross border traffic, I am going to keep my faith in the remote surveilance abilities of the US. Besides, with war emminent, and the US already having stated we were absolutly going to remove saddam, it would be rather stupid for saddam to send the only weapons he dad that would have given him a fightingg chance out of country.", 
   {}, 
   46478, 
   null, 
   1083195360.0
  ], 
  [
   46559, 
   null, 
   "jim's trucking", 
   "If it's buried, that basically means to me that they're complying. They've, in a sense, subverted their weapons and they're no longer of any use. \n \n I think it stands that their claims were over-exaggerated, and I believe our intelligence was misled. There won't be any significant findings in Iraq, because these WMD's simply cease to exist. I think the U.N. was basically correct, but they're not always reliable so the U.S. decided to try it's hand and unmasking those evasive WMD's. I don't think they'll be discovered, but if they are, then great. Bush was right, his rationale for the war is justified and it was a sensible endeavor. \n \n Either way, Iraq is better-off without Saddam Hussein, but who knows what kind of despot we'll put in to power this time. :/\n\n \n Just because they may be buried doesn't necessarily make them useless. They could be recovered and used later.\n \n WMDs don't just mysteriously \"cease to exist\". If they existed at one time, they were either destroyed or moved. Since no proof of destruction has been shown, I want to know where they went...don't you?", 
   {}, 
   46522, 
   null, 
   1083196140.0
  ], 
  [
   46561, 
   null, 
   "mamboni", 
   "\n \n WMDs don't just mysteriously \"cease to exist\". If they existed at one time, they were either destroyed or moved. Since no proof of destruction has been shown, I want to know where they went...don't you?\n\n \n Proof of destruction is going to be less evident than proof of existence will be. Also, if you can salvage a MiG from being buried under feet of sand and make it operational, then please let me know your secret.\n \n If they are indeed ever unearthed, and we do find those caches of WMDs, then great.\n \n But until then, they are either:\n \n A.) Destroyed\n B.) still \"missing\", or submerged in a body of water, or shielded from vision by sand or dirt.\n C.) The ones that existed were all used in prior conflicts.\n I'm going to go with A., because our technology is too great to miss such a salient problem in Iraq. B. is still possible, I'm sure, but I doubt it. C. is also believable, but I doubt they desisted in their research entirely after the Iraqi-Iranian war.", 
   {}, 
   46559, 
   null, 
   1083196380.0
  ], 
  [
   46564, 
   null, 
   "jim's trucking", 
   "Not blind faith at all. Here is a summary of the National Security Archive Electronic Briefing Book No. 80\n http://www.gwu.edu/~nsarchiv/NSAEBB/NSAEBB80/#docs\n\n \n For some reason, I can't make this link work. Could it be a conspiracy, trying to keep me from the truth?", 
   {}, 
   46303, 
   null, 
   1083196740.0
  ], 
  [
   46571, 
   null, 
   "jim's trucking", 
   " Also, if you can salvage a MiG from being buried under feet of sand and make it operational, then please let me know your secret.\n \n \n\n \n Quite simply, you plug all the holes as best you can before burying, you clean it up after retrieval, and you put fuel in it and crank it up.\n \n Surely, you remember the WWII planes that have been recovered and flown after being buried over forty years under hundreds of feet of ICE.", 
   {}, 
   46561, 
   null, 
   1083197520.0
  ], 
  [
   46578, 
   null, 
   "mamboni", 
   "Quite simply, you plug all the holes as best you can before burying, you clean it up after retrieval, and you put fuel in it and crank it up.\n \n Surely, you remember the WWII planes that have been recovered and flown after being buried over forty years under hundreds of feet of ICE.\n\n \n If only it were so simple. Ice is different from sand, and jets are more complex than World War II-era airplanes.", 
   {}, 
   46571, 
   null, 
   1083198120.0
  ], 
  [
   46588, 
   null, 
   "jim's trucking", 
   "If only it were so simple. Ice is different from sand, and jets are more complex than World War II-era airplanes.\n\n \n You point out the obvious. I know ice is different from sand. I also know that if you open the back of a Rolex, bury it in sand, retrieve it, clean it thoroughly, and oil it ever so gently, it will work again.\n \n I didn't say the cleaning of the jet would amount to a mere dusting off. It would take some time, but it could be done.\n \n Also, it doesn't take much space to bury enough nerve gas or ricin to kill thousands of people.", 
   {}, 
   46578, 
   null, 
   1083199380.0
  ], 
  [
   46589, 
   null, 
   "JPSartre12", 
   "Proof of destruction is going to be less evident than proof of existence will be. Also, if you can salvage a MiG from being buried under feet of sand and make it operational, then please let me know your secret.\n\n \n No problem. As long as the intakes are sealed and you are diligent against the ingress of sand, it'll be like new after years of being buried in dry sand. It's not the same as burying a dead animal in a temperate zone patch of mud. Dry sand is inert to corrosive effects. It also is used to nuke-proof objects that we want to survive WWIII.", 
   {}, 
   46561, 
   null, 
   1083199440.0
  ], 
  [
   46594, 
   null, 
   "mamboni", 
   "No problem. As long as the intakes are sealed and you are diligent against the ingress of sand, it'll be like new after years of being buried in dry sand. It's not the same as burying a dead animal in a temperate zone patch of mud. Dry sand is inert to corrosive effects. It also is used to nuke-proof objects that we want to survive WWIII.\n\n \n \n I see, thank you for the correction and the clarification.\n \n You may be correct in that aspect, but that still doesn't prove to me they planned on using them again. You can only hypothesize from there on out.", 
   {}, 
   46589, 
   null, 
   1083199740.0
  ], 
  [
   46652, 
   null, 
   "daewoo", 
   "regarding proof of detruction of WMDs. There was plenty of this. THe UN inspectors spent weeks on end counting decomissioned artilery shells and confirming incineration of equipment. Interestingly enough, most of the artillery shells they found were very old (like, maybe from the mid 80's, when we were providing hte nasties to go in them).", 
   {}, 
   46594, 
   null, 
   1083222780.0
  ], 
  [
   46669, 
   null, 
   "Rev. HellH0und", 
   "Rev. Hellhound,\n \n I know you probably feel that your post proves your point, I'd suggest otherwise. What it does prove, is that every politician and talking head in Washington read the same memo. Simply because they were told and believed that WMD's were there, often based on incomplete or misleading intel from both US and coalition sources, and went on record as saying so, proves nothing as to theactual existence of WMDs.\n \n I know you greatly enjoyed the partisan aspect of your post, but quite frankly I could care less, Rep or Dem, Bush or Clinton/Kerry, makes no difference to me.\n \n Waxy\n\n \n \n So the UN and the world all had the same memo? I am glad you believe saddam over the US. We acted after the UN failed to. We could not risk the proliferation of WMD in that region. To blame bush for the intelligence is a partisan which hunt. That is my point.", 
   {}, 
   46474, 
   null, 
   1083248220.0
  ], 
  [
   46671, 
   null, 
   "Rev. HellH0und", 
   "Seckulations Ilove that. would you like being convicted of something without evidence of corse you would not. And BuSh did not inerit a receesion he caused it. Nice try to convince us but it did not work. The receesion started when he took office.\n\n \n \n \n See now... Ignoring proof from a socialist leftist website shows your not interested in the truth.", 
   {}, 
   46484, 
   null, 
   1083248880.0
  ], 
  [
   46682, 
   null, 
   "sglaine", 
   "See now... Ignoring proof from a socialist leftist website shows your not interested in the truth.\n\n Try NPR.org", 
   {}, 
   46671, 
   null, 
   1083252240.0
  ], 
  [
   46683, 
   null, 
   "Rev. HellH0und", 
   "Try NPR.org\n\n \n \n \n I am sorry. I did what you wanted and provided 2 links to non rightwing sights to bolster my points., You have yet to back up ANY of your posts with anything of substance....\n \n \n ***RING RING***\n \n \n Pick up that clue phone, its for you!", 
   {}, 
   46682, 
   null, 
   1083252960.0
  ], 
  [
   46716, 
   null, 
   "Ghost", 
   "And BuSh did not inerit a receesion he caused it. Nice try to convince us but it did not work. The receesion started when he took office.\n\n \n Not true, actually. Market analysts and economists believe the recession started in the last half of 2000...which, if you'll remember, is before Bush took office. And then you need to learn some thing about economics...economic trends take place over YEARS. Bush did not come in to office and cause a recession. It's not his fault. Hell, I can't stand Bill Clinton, but the recession wasn't really Clinton's fault even though it started during his time in office. And one more thing about the economy...THERE WAS A LITTLE THING CALLED 9/11! When you shut down the transportation industry for awhile and your tourism industry takes a major hit, you're bound to see economic reprecussions, and that's what we saw. I think it speaks well of Bush's handling that the economy hasn't totally tanked and is actually on the mend.", 
   {}, 
   46683, 
   null, 
   1083262980.0
  ], 
  [
   46717, 
   null, 
   "jim's trucking", 
   "Not true, actually. Market analysts and economists believe the recession started in the last half of 2000...which, if you'll remember, is before Bush took office. And then you need to learn some thing about economics...economic trends take place over YEARS. Bush did not come in to office and cause a recession. It's not his fault. Hell, I can't stand Bill Clinton, but the recession wasn't really Clinton's fault even though it started during his time in office. And one more thing about the economy...THERE WAS A LITTLE THING CALLED 9/11! When you shut down the transportation industry for awhile and your tourism industry takes a major hit, you're bound to see economic reprecussions, and that's what we saw. I think it speaks well of Bush's handling that the economy hasn't totally tanked and is actually on the mend.\n\n \n Ghost,\n \n You can present all sorts of evidence that the economy started a nose dive under Clinton's watch. The Rev has done it repeatedly, even with left-leaning sources. It doesn't make any difference what you present to sg, it's not going to keep him from repeating the same old tired claims. They sound too good to him.", 
   {}, 
   46716, 
   null, 
   1083263400.0
  ], 
  [
   46718, 
   null, 
   "JPSartre12", 
   "I see, thank you for the correction and the clarification.\n \n You may be correct in that aspect, but that still doesn't prove to me they planned on using them again. You can only hypothesize from there on out.\n\n \n I think that the fact that they were carefully buried indicates that they expected to reuse them. You don't go through the trouble of carefully removing a jet's wings if all you want to do is get rid of it. You could easily crush the wings into smaller pieces, making the jets easier to bury. That's not what was done from the photos that I saw.", 
   {}, 
   46594, 
   null, 
   1083264000.0
  ], 
  [
   46721, 
   null, 
   "JPSartre12", 
   "I am sorry. I did what you wanted and provided 2 links to non rightwing sights to bolster my points., You have yet to back up ANY of your posts with anything of substance....\n \n \n ***RING RING***\n \n \n Pick up that clue phone, its for you!\n\n \n Throw the small fish back; go after bigger gamefish. emoticon_xgood", 
   {}, 
   46683, 
   null, 
   1083264120.0
  ], 
  [
   46748, 
   null, 
   "sglaine", 
   "Not true, actually. Market analysts and economists believe the recession started in the last half of 2000...which, if you'll remember, is before Bush took office. And then you need to learn some thing about economics...economic trends take place over YEARS. Bush did not come in to office and cause a recession. It's not his fault. Hell, I can't stand Bill Clinton, but the recession wasn't really Clinton's fault even though it started during his time in office. And one more thing about the economy...THERE WAS A LITTLE THING CALLED 9/11! When you shut down the transportation industry for awhile and your tourism industry takes a major hit, you're bound to see economic reprecussions, and that's what we saw. I think it speaks well of Bush's handling that the economy hasn't totally tanked and is actually on the mend.\n\n Sorry to burst your bubble it happen right after Bush came along.The tourisim has taken a huge blow and will remain that way as long as we want war. It isint going to get better ether aslong as we those Yahoos in office. Yes we had to go to Affganasten but not Iraq. With all of the troops in Iraq leaves us open for more attacts. Have you figgered that one out yet.", 
   {}, 
   46716, 
   null, 
   1083280380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What has Bush done!!!!!!", 
  "url": "http://www.4forums.com/political/politics-debates/2263-what-has-bush-done.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2263, 
  "discussion_files": [
   [
    "13538.html", 
    "http://www.4forums.com/political/politics-debates/2263-what-has-bush-done-print.html"
   ], 
   [
    "13539.html", 
    "http://www.4forums.com/political/politics-debates/2263-what-has-bush-done-8-print.html"
   ], 
   [
    "13540.html", 
    "http://www.4forums.com/political/politics-debates/2263-what-has-bush-done-6-print.html"
   ], 
   [
    "13541.html", 
    "http://www.4forums.com/political/politics-debates/2263-what-has-bush-done-4-print.html"
   ], 
   [
    "13542.html", 
    "http://www.4forums.com/political/politics-debates/2263-what-has-bush-done-5-print.html"
   ], 
   [
    "13543.html", 
    "http://www.4forums.com/political/politics-debates/2263-what-has-bush-done-7-print.html"
   ], 
   [
    "13544.html", 
    "http://www.4forums.com/political/politics-debates/2263-what-has-bush-done-3-print.html"
   ], 
   [
    "13545.html", 
    "http://www.4forums.com/political/politics-debates/2263-what-has-bush-done-2-print.html"
   ]
  ], 
  "identifier": 2263
 }
]