[
 [
  [
   46021, 
   null, 
   "jim's trucking", 
   "I heard on the news that Bush's approval rating is up for April '04. Why do you think that is?", 
   {
    "post_info": {
     "post_title": "Hey! What's up besides Bush's approval rating?"
    }
   }, 
   null, 
   null, 
   1083037920.0
  ], 
  [
   46290, 
   null, 
   "Maineiac", 
   "Perhaps they polled more republicans than democrats. emoticon_smile", 
   {}, 
   46021, 
   null, 
   1083112320.0
  ], 
  [
   47550, 
   null, 
   "pyromattiac", 
   "Perhaps they polled more republicans than democrats. emoticon_smile\n\n \n I think Kerry's making a fool of himself.\n It ALSO seems that the economy is recovering.", 
   {}, 
   46290, 
   null, 
   1083639420.0
  ], 
  [
   47552, 
   null, 
   "DangerousMann", 
   "americans are the laziest bunch of people considering the rights and priviledges they are alotted. There are citizens all over this planet who envy the opportunity to vote. I just wish more people cared. i'm not saying pro-bush or kerry on this. it just seems they don't care about voting unless it's for the new American Idol. then they pay attention. That must be frustrating for anyone on either side of the aisle....i would think. am i wrong?", 
   {}, 
   47550, 
   null, 
   1083640020.0
  ], 
  [
   47553, 
   null, 
   "DangerousMann", 
   "But, it's clear that kerry isn't doing very well. There are mutterings of some shake ups for the dems convention. Who could they replace him with? Do they really think Hillary is the answer? I won't vote for her either.", 
   {}, 
   47552, 
   null, 
   1083640140.0
  ], 
  [
   47559, 
   null, 
   "sglaine", 
   "americans are the laziest bunch of people considering the rights and priviledges they are alotted. There are citizens all over this planet who envy the opportunity to vote. I just wish more people cared. i'm not saying pro-bush or kerry on this. it just seems they don't care about voting unless it's for the new American Idol. then they pay attention. That must be frustrating for anyone on either side of the aisle....i would think. am i wrong?\n\n Yea and they also want to peir into your bedroom. .", 
   {}, 
   47552, 
   null, 
   1083641160.0
  ], 
  [
   47564, 
   null, 
   "sglaine", 
   "I heard on the news that Bush's approval rating is up for April '04. Why do you think that is?\n\n Because of the suppression of the truth by the government believe me it wont last long then Kerry is going to the White house Yaaaaaahoooooooooo!!!! And Crawford will have there village idiot back. emoticon_xagree emoticon_xagree", 
   {}, 
   46021, 
   null, 
   1083641580.0
  ], 
  [
   47595, 
   null, 
   "Ghost", 
   "I think there are two reasons why Bush is ahead in the polls. First, is that Kerry inspires no passion in anyone...he's boooooring, like Al Gore was. Then throw in the fact that his voting records have been brought into the light, and most Americans really aren't as liberal as he is.\n \n Second, Bush has stayed strong. Agree or disagree, he said something and he's sticking to it, regardless of political pressure. Gotta admire that. I think that Americans right now want a strong, resolute leader. That sure as hell isn't John Kerry. A lot of people disagree with and some even despise Bush, but an even greater number respect his committment.\n \n Bush is simply more likeable than Kerry is.", 
   {}, 
   47564, 
   null, 
   1083654480.0
  ], 
  [
   47641, 
   null, 
   "georged", 
   "The US is almost evenly split between democrats and republicans, as evidenced by the last presidential election. All the opinions I read on the election say it will, again, come down to the economy for the swing vote. As far as polls are concerned, you can spin any poll by geographical location or demographics. When polls are added up and averaged, the economy is still the deciding factor in public concern for any election. Most of past big hits of job layoffs will exhaust their unemployment benefits by the first week in June. That will effectively 'reduce' unemployment, but the public is getting wise to those numbers that don't include if those workers are still unemployed or are back working under the new jobs numbers, creating zero job growth. Prices are beginning to jump in big chunks, especially in domestic construction, our bright economic star. The fed, supposedly an independent entity, is under immense pressure to not increase interest rates more than a point or it will crush the housing market, even when anyone who shops at a grocery market can see prices rising (inflation) from a soft dollar driving both domestic and imported goods. All the political planning is in place, now it becomes a matter of time as to whether the economy can hang on through the election. \n \n As for Bush staying strong, his polls put him right at historical poll points of losing the election. The next four months will be the determining factor, as will the month before the election. September, as October won't be reported until after the election.\n \n Image has little to do with close elections. Bush and Cheney have repeatedly lied to the public, been caught and it hasn't changed their polls. In public speaking Bush comes across like a stuttering pre-teen XXXXX seeking his first date, and that hasn't harmed his polls. As far as Bush remaining strong regarding public image, his handlers based his reelection campaign on being a 'war president' right after 9/11 and the invasion and occupation of Iraq. That hasn't changed, nor will Bush change. That's the way you run effective political campaigns. The general American public votes on an emotional basis, often without measurable reason other than political affiliation. Change confuses emotions.", 
   {}, 
   47595, 
   null, 
   1083692940.0
  ], 
  [
   47642, 
   null, 
   "jim's trucking", 
   "The US is almost evenly split between democrats and republicans, as evidenced by the last presidential election. All the opinions I read on the election say it will, again, come down to the economy  for the swing vote. As far as polls are concerned, you can spin any poll by geographical location or demographics. When polls are added up and averaged, the economy  is still the deciding factor in public concern for any election. Most of past big hits of job layoffs will exhaust their unemployment benefits by the first week in June. That will effectively 'reduce' unemployment, but the public is getting wise to those numbers that don't include if those workers are still unemployed or are back working under the new jobs numbers, creating zero job growth. Prices are beginning to jump in big chunks, especially in domestic construction, our bright economic star. The fed, supposedly an independent entity, is under immense pressure to not increase interest rates more than a point  or it will crush the housing market, even when anyone who shops at a grocery market can see prices rising (inflation) from a soft dollar driving both domestic and imported goods. All the political planning is in place, now it becomes a matter of time as to whether the economy  can hang on through the election. \n \n As for Bush staying strong, his polls put him right at historical poll points of losing the election. The next four months will be the determining factor, as will the month before the election. September, as October won't be reported until after the election.\n \n Image has little to do with close elections. Bush and Cheney have repeatedly lied to the public, been caught and it hasn't changed their polls. In public speaking Bush comes across like a stuttering pre-teen XXXXX seeking his first date, and that hasn't harmed his polls. As far as Bush remaining strong regarding public image, his handlers based his reelection campaign on being a 'war president' right after 9/11 and the invasion and occupation of Iraq. That hasn't changed, nor will Bush change. That's the way you run effective political campaigns. The general American public votes on an emotional basis, often without measurable reason other than political affiliation. Change confuses emotions.\n\n \n I believe you have mentioned the prevailing factor...the economy. Maybe you could point out some ideas that Kerry has that will improve the economy even more.\n \n I hope the Fed Res works in quarter-points when going back up with the interest rates.\n \n You claim that Bush and Cheney have lied repeatedly, but you don't list any of the \"lies\". Please do.\n \n Perhaps Bush comes across as a XXXXX to you because you are predisposed to that perception. He's not an eloquent speaker, but he does stand behind his principles and endeavors to provide what he says he will. He is far from being a XXXXX.", 
   {}, 
   47641, 
   null, 
   1083694080.0
  ], 
  [
   47648, 
   null, 
   "georged", 
   "I believe you have mentioned the prevailing factor...the economy. Maybe you could point out some ideas that Kerry has that will improve the economy even more.\n \n I hope the Fed Res works in quarter-points when going back up with the interest rates.\n \n You claim that Bush and Cheney have lied repeatedly, but you don't list any of the \"lies\". Please do.\n \n Perhaps Bush comes across as a XXXXX to you because you are predisposed to that perception. He's not an eloquent speaker, but he does stand behind his principles and endeavors to provide what he says he will. He is far from being a XXXXX.\n\n \n The economy, other than military expenses and debt, is relatively unaffected by any standing president or candidate. They use highly polished GDP numbers for political purposes, but the economy is affected by too many factors to control with 4-8 year policies. Due to our electoral process, we have no long-range planning that could affect our economy. \n \n WMD? Protect the constitution? I voted for both of the Bush presidents. My opinions are based on perception. I know politicians on a personal basis and would never view their professional endeavors in a 'human' light as to principles, ability or thoughts as they're all pure party products regardless of political affiliation. That's what politics are all about. He is a crummy public speaker.", 
   {}, 
   47642, 
   null, 
   1083695340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Hey! What's up besides Bush's approval rating?", 
  "url": "http://www.4forums.com/political/current-events-debates/2264-hey-whats-up-besides-bushs-approval-rating.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 2264, 
  "discussion_files": [
   [
    "21815.html", 
    "http://www.4forums.com/political/current-events-debates/2264-hey-whats-up-besides-bushs-approval-rating-print.html"
   ]
  ], 
  "identifier": 2264
 }
]