[
 [
  [
   46395, 
   null, 
   "billsco", 
   "Hello,\n \n A recent survey found that 54% of Americans believe atheism presents the greatest threat to our society, even more than non-Christian religions such as Islam.\n \n \n http://www.mndaily.com/articles/2004/04/27/9453#repeat\n \n That has me wondering what our fellow forum members think about the matter. I've included a poll which I hope you'll take time to vote in, and I am looking forward to any and all comments.\n \n regards", 
   {
    "post_info": {
     "post_title": "Atheists - America's greatest threat?"
    }
   }, 
   null, 
   null, 
   1083166560.0
  ], 
  [
   46397, 
   null, 
   "Eddie", 
   "Now I`m sure this is all due to neglience and I bet they asked questions about threat, but I found this a bit odd.\n \n \"When questioned about what religious or nonreligious group doesn't share their vision of American society, survey participants indicated that atheists - with 54 percent - provided the greatest threat, Hartmann said. Survey participants said Muslims create the second-highest threat. \"\n \n \"Not sharing views of society\" does not equal \"providing greatest threat\", does it?", 
   {
    "unicode_changes_made": true
   }, 
   46395, 
   null, 
   1083167520.0
  ], 
  [
   46403, 
   null, 
   "billsco", 
   "\n \"Not sharing views of society\" does not equal \"providing greatest threat\", does it?\n\n \n Hi Eddie,\n \n A fair enough question I suppose. I have no further info about the news article or the wording of their poll. \n \n What I'm personally looking for is to try to understand if Christians feel their way of life is endangered by atheists, and what the nature of their feeling of endangerment is, i.e., dwindling church attendance, complete repudiation, etc. I don't for a moment think believers feel physically threatened and the word \"threatened\" might better be thought of as \"concerned\".\n \n regards", 
   {}, 
   46397, 
   null, 
   1083169320.0
  ], 
  [
   46406, 
   null, 
   "Big Orn", 
   "Good post, billsco.\n \n Concerned? I can&#8217;t conceive any way that atheism can concern me or my environment. I personally know several that contribute to the community in positive ways just as much or more so than those that believe in God.\n \n I do feel concerned for them, though. My belief system carries me beyond the physical and into the spiritual, which forces me (spiritually) to grieve for them. I am not a religious nut insofar as religion is concerned, but am towards Christ. I have no methods, no rituals, or scheming routines so I am free to express my belief with compassion. Nuff said on that.\n \n If a person is &#8220;good&#8221;, he or she is acceptable, if not they are a menace to society. Religionists are not good people, whether they are so-called Christians, Muslims, Buddhists, etc.\n \n If I worship the Truck God and treat people with respect, show love, honor and am trustworthy, then my faith in my Truck God is irrelevant. When I love my wife and kids with all my heart and provide for them the best I can, when I participate in social functions, help feed the poor, take care of the elderly, it makes no difference if there is a god, I am not a threat.\n \n Of course, if I am a religionist, and my livelihood depends on how many people believe in God, then I could count all atheists as enemies. Heck, I might start a petition around my neighborhood to prevent those kinds of people from buying homes here. I would have a reason to discriminate, right? Yea &#8211; right.\n \n Again, good post. Am anxious to see the replies.", 
   {}, 
   46403, 
   null, 
   1083171480.0
  ], 
  [
   46409, 
   null, 
   "Phunting", 
   "Well as a die-hard atheist, I'm obviously coming down on the benificial side. But not just because I believe in it myself, but because I believe that society is strongest through diversity, to place the blame at a specific religion is wrong. They all have potential for benifit and destruction.", 
   {}, 
   46406, 
   null, 
   1083172140.0
  ], 
  [
   46410, 
   null, 
   "sinjin", 
   "As an atheist I will give religion the benefit of the doubt and so I voted neutral. I have long felt that a \"moral\" atheist is the more \"evolved\" being. Can't see how that could offend someone who believes not in evolution.", 
   {}, 
   46409, 
   null, 
   1083172320.0
  ], 
  [
   46417, 
   null, 
   "billsco", 
   " \n My belief system carries me beyond the physical and into the spiritual, which forces me (spiritually) to grieve for them.\n \n\n \n Hi Big Orn,\n \n Well as long as it's spiritual grieving then. Nothing worse than watching a big guy physically sobbing. haha\n \n \n \n Of course, if I am a religionist, and my livelihood depends on how many people believe in God, then I could count all atheists as enemies. Heck, I might start a petition around my neighborhood to prevent those kinds of people from buying homes here. I would have a reason to discriminate, right? Yea - right.\n \n \n\n \n Are you going so far as to condemn organized religion? If so, care to put a name to it, like say Southern Baptists, or Evangelical Lutherans? How far out on that limb are you willing to go? \n \n regards", 
   {
    "unicode_changes_made": true
   }, 
   46406, 
   null, 
   1083173280.0
  ], 
  [
   46434, 
   null, 
   "Big Orn", 
   "Are you going so far as to condemn organized religion? If so, care to put a name to it, like say Southern Baptists, or Evangelical Lutherans? How far out on that limb are you willing to go? \n \n regards\n\n Is it time to go fishing? Let's wet a hook. :p \n \n I don't see one religion taking the blame, nor can I point out those that completely fall away from the Truth. This church here may follow the true teaching, while that one over yonder under the same denomination, are far out into left field.\n For example: I visited a Pentecostal church that the preacher (egotistical I might add) said that it was a sin to dip snuff, and the people agreed with him with a big AMEN, yet I saw him drink 3 cups of coffee before service. Another Pentecostal church, another preacher, another set of believers, says something different.\n \n A Baptist minister preaches about markings on the body (tattoos), but allows the women of his congregation, including his dear wife, to get boob jobs.\n \n I could go on and on.\n \n Are there any two-faced atheists? :p emoticon_xangel", 
   {}, 
   46417, 
   null, 
   1083176040.0
  ], 
  [
   46442, 
   null, 
   "sinjin", 
   "\n Are there any two-faced atheists? :p emoticon_xangel\n\n I have been known to say \"God bless\". Does that count?", 
   {}, 
   46434, 
   null, 
   1083178140.0
  ], 
  [
   46447, 
   null, 
   "AMD4EVER", 
   "Well as a die-hard atheist, I'm obviously coming down on the benificial side. But not just because I believe in it myself, but because I believe that society is strongest through diversity, to place the blame at a specific religion is wrong. They all have potential for benifit and destruction.\n\n \n Look at post #2 here. The actual question didn't actually involved atheists being threats in any way. It basically stated that people believe atheists are part of the least typical American religion. The Christian majority can essentially relate better with Islams who are part of a real religion than they can with atheists who are not religious. That is all this poll shows.\n \n I am also with you as far as religious diversity goes. It is good to have a diverse base of religions here. None are more destructive or better than the others as far as I can tell.", 
   {}, 
   46409, 
   null, 
   1083178560.0
  ], 
  [
   46457, 
   null, 
   "Phunting", 
   "Look at post #2 here. The actual question didn't actually involved atheists being threats in any way. It basically stated that people believe atheists are part of the least typical American religion. The Christian majority can essentially relate better with Islams who are part of a real religion than they can with atheists who are not religious. That is all this poll shows.\nI realise that. I meant that as far as I'm concerned, diversity is part of what typifies American/Western culture. Hence Athiesm is a part of that and generally helps it.", 
   {}, 
   46447, 
   null, 
   1083179340.0
  ], 
  [
   46475, 
   null, 
   "mamboni", 
   "Taking a neutral standpoint, I'd say that atheism is, in a way, beneficial to society. AS suggested above, diversity molds us into a better society. You can't have everyone believing the same thing, then forums like these would not exist. It would also be wrong to suppress certain views because you disagree with them.\n \n Honestly, I can see why christians may see this as a veritable threat. For one, many atheists will make postulations-some of them valid, some of them simply blather, about inconsistencies in the bible and deceitful things your parents told you. They also study a very sacred item and ideology; through theology they may discover a few things that gnaw away at the bible's relevancy and credibility. This, to me, seems to irritate christians and make them feel a bit questionable about their beliefs. Atheism, to many christians, is rightfully conceived as an attempt to undermine everything christianity stands for and has done throughout the course of history. I'm sure that's why christians feel threatened by atheistic espousings.", 
   {}, 
   46457, 
   null, 
   1083182700.0
  ], 
  [
   46500, 
   null, 
   "billsco", 
   " Atheism, to many christians, is rightfully conceived as an attempt to undermine everything christianity stands for and has done throughout the course of history. I'm sure that's why christians feel threatened by atheistic espousings.\n\n \n Hi mamboni,\n \n How could atheists like myself do a better job of not grating on Christians? \n \n regards", 
   {}, 
   46475, 
   null, 
   1083186660.0
  ], 
  [
   46516, 
   null, 
   "mamboni", 
   "Hi mamboni,\n \n How could atheists like myself do a better job of not grating on Christians? \n \n regards\n\n \n \n I guess it's all about perception, and many atheists are maligned by christians because they question what is/has been sacred and undebatable to many for eons. There's really no way for an atheist to soften the blow he inflicts on a christian, it's basically the premise of atheism - which is to deny the existence of a deity. I don't think it's the attitude or the way you come off, but simply because they're so offended by your beliefs. \n \n Again, I'm neither atheist nor christian, so I am indifferent on this. I hold no preference to either religion, or non-religion in atheism's case.", 
   {}, 
   46500, 
   null, 
   1083189060.0
  ], 
  [
   46861, 
   null, 
   "billsco", 
   " The Christian majority can essentially relate better with Islams who are part of a real religion than they can with atheists who are not religious. \n\n \n Hi AMD4EVER,\n \n I guess that's correct, it's what the poll shows, but like so much in religion it makes no sense. Christians are willing to hop in bed with Muslim jihadists, but will see to it their son doesn't play baseball with an atheist's son. They'll go to lengths to praise Islamists as peaceful people despite the thunderous silence from the Muslim community, and yet shun their ex-Christian brother and neighbor as a seditious traitor. They will try to get him fired from his job, write nasty letters to the editor, and block any attempt to hold elective office, all the while espousing Christian compassion. All the above are true examples of what it has been like since I lost my faith.\n \n I can't believe I asked what atheists can do to not grate on Christians. \n \n regards", 
   {}, 
   46447, 
   null, 
   1083344460.0
  ], 
  [
   46862, 
   null, 
   "Phunting", 
   "Thankfully I have never seen such prejudice and hypocracy from the Christian community, I'm sorry that you've been so unlucky.\n \n I'm not sure what you mean by 'the thunderous silence from the Muslim community'. 'Islamists' are on the whole peaceful people.", 
   {}, 
   46861, 
   null, 
   1083344940.0
  ], 
  [
   46867, 
   null, 
   "emclean", 
   "A good person is a good person; no religion has a monopoly on it. The reason atheist&#8217;s bug Christians is, IMO, that we ask the unanswerable questions, and wants an answer. That is my experience with my wife, if I ask a question she can&#8217;t answer, I am attacking her religion.", 
   {}, 
   46861, 
   null, 
   1083345480.0
  ], 
  [
   46878, 
   null, 
   "Phunting", 
   "Yes thats exactly the same experience I've had, especially with family who seem to feel I'm making a really personal attack on them just by trying to ask questions.", 
   {}, 
   46867, 
   null, 
   1083346800.0
  ], 
  [
   46911, 
   null, 
   "galton", 
   "Let me play devil's advocate and argue against religious diversity. In my view, a very important role of religion is to give people certainty about the meaning of life and also for the rules of right and wrong behavior. Religious heterogeneity subverts the authority, the persuasiveness, and positive influence of these beliefs, so they no longer do as well what they are intended to do; they no longer do what people need them to do. Beliefs becomes mushy, tepid, tentative, and somewhat arbitrary as people adjust them in order to get along with everyone else. And people frankly begin to adopt illogical beliefs like that all paths lead to God. I was raised in a religion which taught that if you were not a faithful member, you do not go to heaven. There are other religions that teach the same thing, so all these people in a religiously diverse society like the U.S. are saying all paths lead to Heaven, but how can the exclusive religions all be right? \n \n On the other hand, I will concede that religious diversity tends to soften religions, and sometimes they need that. For example, from what I see, Muslims born and raised in the U.S. tend to have a more moderate, healthy oritentation than a Muslim raised in an exclusively Muslim country. So I guess my advocacy as a devil is not a particularly aggressive one.", 
   {}, 
   46878, 
   null, 
   1083353580.0
  ], 
  [
   46919, 
   null, 
   "billsco", 
   "\n I'm not sure what you mean by 'the thunderous silence from the Muslim community'. 'Islamists' are on the whole peaceful people.\n\n \n Where are the Muslim Billy Grahams denouncing with all their conviction the violence of their right wing? Where is the Islamic equivalent of the Right Reverend Jerry Falwell going on The Most Reverend Pat Robertson's TV show to bare his soul about how to get his violent wayward brethren back into the peaceful flock?", 
   {}, 
   46862, 
   null, 
   1083355080.0
  ], 
  [
   46922, 
   null, 
   "jim's trucking", 
   "I think atheism is no better for society than any one or the other of the organized religious groups. The world is full of people trying to get others to think like they do, to join their group, to identify as one of them.\n \n An atheist questioning a Christian's belief is no different than proselyting by way of an evangelical membership drive.\n \n To me, it is a sign of weakness and insecurity that you cannot leave others alone in their religious beliefs. I don't really care what you worship or that you worship nothing as long as you leave me alone. I'm not out to save your soul.", 
   {}, 
   46911, 
   null, 
   1083355440.0
  ], 
  [
   46976, 
   null, 
   "billsco", 
   "To me, it is a sign of weakness and insecurity that you cannot leave others alone in their religious beliefs. \n\n \n I agree with you to the exact degree that it shows weakness and insecurity to discuss political ideas to those of other persuasions.", 
   {}, 
   46922, 
   null, 
   1083375480.0
  ], 
  [
   46989, 
   null, 
   "jim's trucking", 
   "I agree with you to the exact degree that it shows weakness and insecurity to discuss political ideas to those of other persuasions.\n\n Since I believe in total separation of church and state, I cannot carry the argument of peaceful coexistence into politics. Weak political parties lose control.\n \n There is merit in trying to persuade one's political foes to switch sides, but there is no need to mess with their inconsequential religious views.\n \n What you believe about God doesn't affect me. What you believe about how the country should be run does.", 
   {}, 
   46976, 
   null, 
   1083377460.0
  ], 
  [
   47042, 
   null, 
   "billsco", 
   "\n There is merit in trying to persuade one's political foes to switch sides, but there is no need to mess with their inconsequential religious views. \n\n \n Makes me wonder what you're doing in a religious forum with such open contempt of a subject as that.", 
   {}, 
   46989, 
   null, 
   1083385920.0
  ], 
  [
   47064, 
   null, 
   "billsco", 
   " Religious heterogeneity subverts the authority, the persuasiveness, and positive influence of these beliefs, so they no longer do as well what they are intended to do; they no longer do what people need them to do. Beliefs becomes mushy, tepid, tentative, and somewhat arbitrary as people adjust them in order to get along with everyone else.\n \n\n \n Hi galton,\n \n I agree. It reminds me of a theory I have which I would like to trot out for the first time anywhere.\n \n I think when Martin Luther posted his 95 theses on the church door he inflicted a fatal blow to Christianity. In my mind's eye I see him in a boxing ring with the pope, delivering an unexpected solid right to the solar plexus which at first stuns the pope, and then sends him reeling and staggering about the ring uncontrollably and dazed. All these centuries since Luther we are simply waiting for the inevitable to occur.\n \n regards", 
   {}, 
   46911, 
   null, 
   1083419220.0
  ], 
  [
   47070, 
   null, 
   "jim's trucking", 
   "Makes me wonder what you're doing in a religious forum with such open contempt of a subject as that.\n\n \n I have no contempt for the subject. I simply do not care what you believe as long as it doesn't affect politics. Whether or not you believe in any or all gods has no bearing on my daily life.\n \n How do you translate that to contempt?", 
   {}, 
   47042, 
   null, 
   1083424200.0
  ], 
  [
   47081, 
   null, 
   "billsco", 
   "How do you translate that to contempt?\n\n \n Hi jim's trucking,\n \n Religious discussion is a passion of mine, as I can see political discussion is to you. if I were to insert into one of your threads that in my opinion \"inconsequential political views\" were being discussed here, would you accept the statement or would your blood pressure begin to rise as mine is? I happily discuss my differences with my friends on the opposite side of the fence all day and never have to deal with condescension from them. I feel that was your intent.\n \n If you think religious views have no bearing on modern political thought, I will be happy to disabuse you of that notion.\n \n regards", 
   {}, 
   47070, 
   null, 
   1083429180.0
  ], 
  [
   47082, 
   null, 
   "jim's trucking", 
   "Hi jim's trucking,\n \n Religious discussion is a passion of mine, as I can see political discussion is to you. if I were to insert into one of your threads that in my opinion \"inconsequential political views\" were being discussed here, would you accept the statement or would your blood pressure begin to rise as mine is? I happily discuss my differences with my friends on the opposite side of the fence all day and never have to deal with condescension from them. I feel that was your intent.\n \n If you think religious views have no bearing on modern political thought, I will be happy to disabuse you of that notion.\n \n regards\n\n \n Political views are not inconsequential.\n \n As I stated, I believe in total separation of church and state. It is true that religion has and always will affect politics. It's just that I think it should not do so. Therefore, I can separate discussions of religion from those of politics by saying that I truly do not care whether one worships or not, as long as it doesn't affect my daily life.\n \n If your political views are determined by your religion, I will still argue against your political views, but not against your religion. I also would argue that you should try to divorce the two.\n \n There are certain things that I believe are absolutely silly about some religions, but I choose not to point them out.\n \n It took us a long time to elect a Catholic president for fear that the Vatican would then control our political posture. However, JFK turned out to do us well.", 
   {}, 
   47081, 
   null, 
   1083429840.0
  ], 
  [
   47084, 
   null, 
   "jim's trucking", 
   "I happily discuss my differences with my friends on the opposite side of the fence all day and never have to deal with condescension from them. I feel that was your intent.\n \n \n\n \n You inferred wrongly. I simply have a non-confrontational approach to religious differences. That does not mean that I condescend to others having at it. I have more pleasing things to do.\n \n I do enjoy reading religious views. I may sometimes express mine, but hardly ever try to argue that mine should be preferred by someone else.", 
   {}, 
   47081, 
   null, 
   1083430680.0
  ], 
  [
   47086, 
   null, 
   "billsco", 
   "\n \n Political views are not inconsequential.\n \n \n\n \n Nor are religious views IMO.\n \n \n\n \n You inferred wrongly. I simply have a non-confrontational approach to religious differences. That does not mean that I condescend to others having at it. I have more pleasing things to do.\n \n\n \n \n Thank you for clarifying.", 
   {}, 
   47082, 
   null, 
   1083438240.0
  ], 
  [
   47386, 
   null, 
   "Ghost", 
   "The reason atheist's bug Christians is, IMO, that we ask the unanswerable questions, and wants an answer. That is my experience with my wife, if I ask a question she can't answer, I am attacking her religion.\n\n \n I've experienced that too. If you start asking questions of some people like this, they get angry that you're 'attacking their religion.'\n \n I think that a diversity is necessary. I would never, ever live in a community of 100% christians. Nor would I ever live in a community that is 100% atheist...there needs to be a balance. It's kinda like politics, we should never live in a society which is all conservative or all liberal. That'd be tarrible.", 
   {
    "unicode_changes_made": true
   }, 
   46867, 
   null, 
   1083610200.0
  ], 
  [
   47397, 
   null, 
   "billsco", 
   "It's kinda like politics, we should never live in a society which is all conservative or all liberal. \n\n \n I agree. Both wings should be strong and powerful in order to fly. But religion, IMO, is the weight around the neck that keeps us from soaring.", 
   {}, 
   47386, 
   null, 
   1083615900.0
  ], 
  [
   47466, 
   null, 
   "epaphras_faith", 
   "I haven't read all of the postings but I would disagree with Billsco. It is not religion that is the weight around our neck, nor is it atheism.\n \n It is religious hypocrisy.\n \n It is people who claim christianity and then subscribe to the worst the world has to offer. Perhaps a better statement is simply, human nature.\n \n People are the greatest threat. Anyone who can look at history and actually say that the basic human nature is \"Good\" is lying to themselves about history.\n \n Hitler was a particulary good student of human nature. It is why he was so successful. \n \n There are many christians who are very sincere and live life in dependence on a loving God. In this we find hope. There is no hope with atheism (by definition mind you). That does not make it the greatest threat, simply not the answer to the greatest threat.", 
   {}, 
   47397, 
   null, 
   1083625680.0
  ], 
  [
   47503, 
   null, 
   "Ghost", 
   "\n It is people who claim christianity and then subscribe to the worst the world has to offer. Perhaps a better statement is simply, human nature.\n \n People are the greatest threat. Anyone who can look at history and actually say that the basic human nature is \"Good\" is lying to themselves about history.\n\n \n emoticon_xbouncer Bingo. Humanity, IMHO, is both the source of good and the source of evil. Take a look at war, for example. It's horrible, it's evil, it brings out the worst in people. But it also brings out the best in people; self sacrifice, bravery, courage, loyalty, and on and on.", 
   {}, 
   47466, 
   null, 
   1083631740.0
  ], 
  [
   47764, 
   null, 
   "Tastyfish", 
   "There is no hope with atheism (by definition mind you)\n Depends what you are looking for, there is hope of a kind.\n \n I think when the poll was taken, 'America' had very different meanings to some people. Is Atheism the greatest threat to a religiously dominant america-definitely. Actually to america itself - no, and would probably strengthen it in many ways not nessesarily by replace religion but if agnostism and atheism were dominant as the sciences and equal rights for all are embraced more openly throughout the country.", 
   {}, 
   47466, 
   null, 
   1083729240.0
  ], 
  [
   47775, 
   null, 
   "Rogue790", 
   "As an atheist I will give religion the benefit of the doubt and so I voted neutral. I have long felt that a \"moral\" atheist is the more \"evolved\" being. Can't see how that could offend someone who believes not in evolution.\n\n \n To sinjin:\n Since you are an atheist, are you not also being religious? See, a religion is really just a set of beliefs. We must take the fact that God exists by faith, and you to must also take the fact that God doesn't exist by blind faith. That is how I see it. You also mentioned another thing about moral atheists being the more evolved things. My question is, why should rearranged molecules care for anything else, or why should they believe in the issues like justice? I personally just can't make any sense of why this would happen.", 
   {}, 
   46410, 
   null, 
   1083732180.0
  ], 
  [
   47776, 
   null, 
   "Rogue790", 
   "I agree. Both wings should be strong and powerful in order to fly. But religion, IMO, is the weight around the neck that keeps us from soaring.\n\n \n To billsco:\n Need I remind you that it was the Bible believing scientists, such as Newton for example, who really made science take off in Europe. It is not the religious who try to limit knowledge or prevent us from \"soaring\" as you state, I don't think that there is any such person who wants to prevent scientific knowledge.", 
   {}, 
   47397, 
   null, 
   1083732540.0
  ], 
  [
   47894, 
   null, 
   "billsco", 
   "\n \n It is not religion that is the weight around our neck, nor is it atheism.\n \n It is religious hypocrisy.\n \n \n\n \n Hi epaphras faith,\n \n We have the religious camp and the non-religious camp, as we can agree from your above statement. In which camp does religious hypocrisy live in?\n \n regards", 
   {}, 
   47466, 
   null, 
   1083785880.0
  ], 
  [
   47898, 
   null, 
   "Waxy", 
   "To sinjin:\n Since you are an atheist, are you not also being religious? See, a religion is really just a set of beliefs. We must take the fact that God exists by faith, and you to must also take the fact that God doesn't exist by blind faith. That is how I see it. You also mentioned another thing about moral atheists being the more evolved things. My question is, why should rearranged molecules care for anything else, or why should they believe in the issues like justice? I personally just can't make any sense of why this would happen.\n\n \n I'm going to take a stab at this one if I might. I'm sure sinjin will be along with a better response though.\n \n No, because the beliefs are not defined. A religion is a defined set of concrete beliefs and precepts. An atheist is free to modify the beliefs, or completely change them, at any time. They are based solely on the individual. I see this posted a lot, and I suppose on some level there is some truth to it, but atheism is far from being a \"religion\" IMHO.\n \n I can take the fact that God doesn't exist based on far more than blind faith. That's an incorrect statement. The simple fact that there is no physical evidence of his existance is pretty good proof that he doesn't exist. Of course I can never prove a negative, but the available evidence provides me with much more than blind faith upon which to base the decision that he doesn't exist.\n \n As for why should an atheist care, I believe that's exactly Sinjin's point. If you are an atheist, there is no end reward, ie heaven, that you are striving for, and no punishment, ie hell, to fear. Therefore, an atheist living an exemplary life is doing so stricty of his/her own choosing, not for any selfish means or out of fear of punishment. To me, that is a more noble or \"evolved\" reason for doing so.\n \n Waxy", 
   {}, 
   47775, 
   null, 
   1083786720.0
  ], 
  [
   47902, 
   null, 
   "jim's trucking", 
   " \n ...The simple fact that there is no physical evidence of his existance is pretty good proof that he doesn't exist. ...\n \n Waxy\n\n \n Logic error alert.\n \n This is common logic error number 70253AM-3xd4m, commonly made when attempting to deny the existence of the unknown.", 
   {}, 
   47898, 
   null, 
   1083787680.0
  ], 
  [
   47905, 
   null, 
   "Waxy", 
   "Logic error alert.\n \n This is common logic error number 70253AM-3xd4m, commonly made when attempting to deny the existence of the unknown.\n\n \n You're on a logic tear jim, so please, enlighten me. \n \n Keep in mind, I also posted this that you didn't quote.\n \n \nOf course I can never prove a negative, but the available evidence provides me with much more than blind faith upon which to base the decision that he doesn't exist.\n\n \n Waxy", 
   {}, 
   47902, 
   null, 
   1083788400.0
  ], 
  [
   47913, 
   null, 
   "jim's trucking", 
   "You're on a logic tear jim, so please, enlighten me. \n \n Keep in mind, I also posted this that you didn't quote.\n \n \n \n Waxy\n\n \n Lack of physical evidence of the existence of something does not prove its non-existence. All it means is that you lack physical evidence. The evidence could be just around the corner or it could be hidden under a blanket you have yet to lift out of the way.\n \n If your statement were true, it would make no sense for a detective to look for physical evidence of a murder as his current lack of possession of the evidence \"proves the murder did not happen\".\n \n Whether or not something exists does not depend on your finding the evidence of its existence.\n \n I'm not examining your posts for errors. That one just hit me in the face.\n \n What \"available evidence\" do you have that God does not exist?", 
   {}, 
   47905, 
   null, 
   1083790200.0
  ], 
  [
   47920, 
   null, 
   "Anastasia", 
   "Lack of physical evidence of the existence of something does not prove its non-existence. All it means is that you lack physical evidence. The evidence could be just around the corner or it could be hidden under a blanket you have yet to lift out of the way.\n \n If your statement were true, it would make no sense for a detective to look for physical evidence of a murder as his current lack of possession of the evidence \"proves the murder did not happen\".\n \n Whether or not something exists does not depend on your finding the evidence of its existence.\n \n I'm not examining your posts for errors. That one just hit me in the face.\n \n What \"available evidence\" do you have that God does not exist?\n\n your kidding right?\n First your analogy of the murder without evidence has confused me... wouldn't the evidence be the dead body hence murder?\n \n and as far as proving God's existence is like proving aliens exist....\n There is nothing tangible to say he does exist except for faith....and that is not solid proof....\n I could easily equate that to Jim Jones telling me God exists", 
   {}, 
   47913, 
   null, 
   1083791400.0
  ], 
  [
   47926, 
   null, 
   "Waxy", 
   "Lack of physical evidence of the existence of something does not prove its non-existence. All it means is that you lack physical evidence. The evidence could be just around the corner or it could be hidden under a blanket you have yet to lift out of the way.\n \n If your statement were true, it would make no sense for a detective to look for physical evidence of a murder as his current lack of possession of the evidence \"proves the murder did not happen\".\n \n Whether or not something exists does not depend on your finding the evidence of its existence.\n \n I'm not examining your posts for errors. That one just hit me in the face.\n \n What \"available evidence\" do you have that God does not exist?\n\n \n IMHO, we're (well you're) getting into technical semantics here, rather than dealing with reality. Ultimately of course you are correct, but what's your point? I clearly stated that I can't prove a negative.   \n \n HOWEVER, is something more or less believable with or without physical evidence? If you have searched, as mankind has for thousands of years, for any proof of physical existance and found none, that, to me, is more compelling evidence that something doesn't exist than the word of someone that says it does. Not 100% proof, but strong evidence nonetheless.\n \n As for your murder analogy, a person is dead, what other evidence of a murder do you want? It wouldn't be a murder investigation if someone wasn't dead, it would be a missing person's investigation.\n \n I feel there's plenty of evidence to refute the validity of the Bible, the only \"proof\" that God exists, we won't get into that in this thread. There always the pie in the sky who, what, where, and when stuff too.\n \n My personality dictates that I need some kind of proof or evidence before I believe in something, I'm a skeptic. I think that's inherent in most people with a scientific background. Nothing is taken to exist or be a fact until it can be physically proven in a repeatable experiment.\n \n For those that are believers, they choose to accept something until someone proves otherwise. They dont' require proof, only faith.\n \n Just two sides of the coin I guess, but to me, only one makes sense.\n \n Waxy", 
   {}, 
   47913, 
   null, 
   1083792120.0
  ], 
  [
   47928, 
   null, 
   "jim's trucking", 
   "your kidding right?\n First your analogy of the murder without evidence has confused me... wouldn't the evidence be the dead body hence murder?\n \n and as far as proving God's existence is like proving aliens exist....\n There is nothing tangible to say he does exist except for faith....and that is not solid proof....\n I could easily equate that to Jim Jones telling me God exists\n\n \n dead body=murder? Here we go again.\n \n I can't cite the case, but I know of one that proceeded without the body.", 
   {}, 
   47920, 
   null, 
   1083792420.0
  ], 
  [
   47931, 
   null, 
   "Tastyfish", 
   "But there is a definite change in the activities of an existing person. I don't know of any murder cases into the disappearance of someone who has never been seen in the first place", 
   {}, 
   47928, 
   null, 
   1083792840.0
  ], 
  [
   47934, 
   null, 
   "jim's trucking", 
   "IMHO, we're (well you're) getting into technical semantics  here, rather than dealing with reality. Ultimately of course you are correct, but what's your point? I clearly stated that I can't prove a negative.   \n \n HOWEVER, is something more or less believable with or without physical evidence? If you have searched, as mankind has for thousands of years, for any proof of physical existance and found none, that, to me, is more compelling evidence that something doesn't exist than the word of someone that says it does. Not 100% proof, but strong evidence nonetheless.\n \n As for your murder analogy, a person is dead, what other evidence of a murder do you want? It wouldn't be a murder investigation if someone wasn't dead, it would be a missing person's investigation.\n \n I feel there's plenty of evidence to refute the validity of the Bible, the only \"proof\" that God exists, we won't get into that in this thread. There always the pie in the sky who, what, where, and when stuff too.\n \n My personality dictates that I need some kind of proof or evidence before I believe in something, I'm a skeptic. I think that's inherent in most people with a scientific background. Nothing is taken to exist or be a fact until it can be physically proven in a repeatable experiment.\n \n For those that are believers, they choose to accept something until someone proves otherwise. They dont' require proof, only faith.\n \n Just two sides of the coin I guess, but to me, only one makes sense.\n \n Waxy\n\n \n Technical semantics is where it's at. You're glazing over logic with some claims that you don't substantiate.\n \n You said:\n \n \n Of course I can never prove a negative, but the available evidence provides me with much more than blind faith upon which to base the decision that he doesn't exist.  \n\n \n I asked:\n \n \n What \"available evidence\" do you have that God does not exist? \n\n \n What is your answer?\n \n \n IMHO, we're (well you're) getting into technical semantics here, rather than dealing with reality. \n\n \n So what is the reality of this situation?", 
   {}, 
   47926, 
   null, 
   1083793020.0
  ], 
  [
   47936, 
   null, 
   "Waxy", 
   "So what is the reality of this situation?\n\n \n The reality jim, is that you don't carefully read a post before you respond.\n \n You asked.\n \n \nWhat \"available evidence\" do you have that God does not exist?\n\n \n I responded.\n \n \nI feel there's plenty of evidence to refute the validity of the Bible, the only \"proof\" that God exists, we won't get into that in this thread. There always the pie in the sky who, what, where, and when stuff too.\n\n \n I also provided this explanation for my reasoning.\n \n \nHOWEVER, is something more or less believable with or without physical evidence? If you have searched, as mankind has for thousands of years, for any proof of physical existance and found none, that, to me, is more compelling evidence that something doesn't exist than the word of someone that says it does. Not 100% proof, but strong evidence nonetheless.\n\n \n So, what's your point again?\n \n Waxy", 
   {}, 
   47934, 
   null, 
   1083793320.0
  ], 
  [
   47937, 
   null, 
   "Tastyfish", 
   "The reality is that there is as much proof for God as the pink, man-eating hippo jumping on your screen as you read this. But really, lets not get side tracked here from the actual debate.\n \n Is a religous population a lot easier to manipulate do you think? Given the absolute beleif in something that has no obvious facts backing it up, can this be applied to other things more easily? Or that it is relatively easy to twist religions to cover certain topics.\n Is this even a good thing over the atheist mind set that would question everything the government is saying, or do these values not extend as far into politics?", 
   {}, 
   47934, 
   null, 
   1083793380.0
  ], 
  [
   47942, 
   null, 
   "jim's trucking", 
   " \n So, what's your point again?\n \n Waxy\n\n \n Simply to point out your error in logic and your inability to expose \"available evidence\" that God does not exist. You shot with a half-cocked gun.\n \n We have drifted away from the thread topic, the worth of Atheism. I think Atheists are amusing, therefore nice to have around.", 
   {}, 
   47936, 
   null, 
   1083795000.0
  ], 
  [
   47946, 
   null, 
   "Waxy", 
   "Simply to point out your error in logic and your inability to expose \"available evidence\" that God does not exist. You shot with a half-cocked gun.\n \n We have drifted away from the thread topic, the worth of Atheism. I think Atheists are amusing, therefore nice to have around.\n\n \n Fortunately, yours wasn't loaded either. ;) \n \n I chose not to \"expose\" any evidence in this thread. Go to one to the thousand of threads here on Biblical inconsistenties, evolution, Noah, or any one of the other arguments that are commonplace. Why rehash that stuff here? Personally, I'm sick of, I've been down the road way too many times already. \n \n Why do you think atheists are amusing? Is it smug righteuosness, or do we just tell better jokes? \n \n Waxy", 
   {}, 
   47942, 
   null, 
   1083795660.0
  ], 
  [
   47958, 
   null, 
   "jim's trucking", 
   "Fortunately, yours wasn't loaded either. ;) \n \n I chose not to \"expose\" any evidence in this thread. Go to one to the thousand of threads here on Biblical inconsistenties, evolution, Noah, or any one of the other arguments that are commonplace. Why rehash that stuff here? Personally, I'm sick of, I've been down the road way too many times already. \n \n Why do you think atheists are amusing? Is it smug righteuosness, or do we just tell better jokes? \n \n Waxy\n\n \n Disestablishment of proof that God exists is not the same as establishment of proof that God does not exist. You said you had \"available evidence\" that God does not exist. I am interested in seeing it.\n \n It is amusing that you evade the issue.", 
   {}, 
   47946, 
   null, 
   1083797880.0
  ], 
  [
   47964, 
   null, 
   "Waxy", 
   "Disestablishment of proof that God exists is not the same as establishment of proof that God does not exist. You said you had \"available evidence\" that God does not exist. I am interested in seeing it.\n \n It is amusing that you evade the issue.\n\n \n I don't know why I continue to reply to this, so I'll just give it one more.\n \n I see what you're saying jim, in fact, I think I've even agreed with the hairs your splitting regarding the logic. \n \n When dealing with an intangible item, the only available means to disprove it is to attack that which supports a belief in it, ie the Bible. If the Bible can be disproven, it may not prove God doesn't exist, but it sure eliminates any \"evidence\" that he does, or any reason for the belief that he does. \n \n Turns out it was the smug righteousness. I suspected as much, but I hoped it was my joke telling.\n \n Waxy", 
   {}, 
   47958, 
   null, 
   1083798780.0
  ], 
  [
   47967, 
   null, 
   "daewoo", 
   "I think jimstrucking is right on this one. THere is no proof that god does not exist. The evidence could be seen to point both ways, depending on how much faith you have.\n \n I voted neither/no opinion. I can see some definate downsides to a cuture heavil reliant on religion, particularly the christian religion (and yes, I am a christian). It is a great religion if you want to control people and keep the masses in poverty. It's unsefulness in this department was recognised fairly early on by the romans. IF I was the king of the world, I would DEFINATLY ant my people to be christians and to be taught things like \"give to ceasar what is ceasars\" and \"It is easier for a camel to pass through the eye of a needle than for a rich man to enter the kindom of heaven\"\n \n On the other hand, my personal experience has been that religious types are much easier to deal with, treat people more fairly and are more likely to do what is right simply for the fact that it is right. I think this comes from the teachings of most religion that god is watching, no matter how well you think you have coverd your misdeeds, and there will be an accouting. I also find that religious people have a better defined set of morals than athiests. I think this is because they have made a conscious decision to follow their god, whoever it may be, and for the most part the gods that people worship today are nice guy gods who want people to be nice to each other and honest and live a good life. It is true that people have used religion to justify a lot of evil, but lets not throw the baby out with the bath water.", 
   {}, 
   47928, 
   null, 
   1083799500.0
  ], 
  [
   47968, 
   null, 
   "jim's trucking", 
   "I don't know why I continue to reply to this, so I'll just give it one more.\n \n I see what you're saying jim, in fact, I think I've even agreed with the hairs your splitting regarding the logic. \n \n When dealing with an intangible item, the only available means to disprove it is to attack that which supports a belief in it, ie the Bible. If the Bible can be disproven, it may not prove God doesn't exist, but it sure eliminates any \"evidence\" that he does, or any reason for the belief that he does. \n \n Turns out it was the smug righteousness. I suspected as much, but I hoped it was my joke telling.\n \n Waxy\n\n \n You do have a sense of humor and I'm not being smug.\n \n When it comes to logic, you should ALWAYS split hairs.\n \n I won't attack the above quote because like you, I've had enough for one day.\n \n Just remember:\n \n Ayn Rand Says...\n \n Existence exists - and the act of grasping that statement implies two corollary axioms: that something exists which one perceives and that one exists possessing consciousness, consciousness being the faculty of perceiving that which exists.\n \n If nothing exists, there can be no consciousness: a consciousness with nothing to be conscious of is a contradiction in terms. A consciousness conscious of nothing but itself is a contradiction in terms: before it could identify itself as consciousness, it had to be conscious of something. \n \n If that which you claim to perceive does not exist, what you possess is not consciousness.\n \n -- Ayn Rand, \"Galt's Speech,\" Atlas Shrugged \n \n \n \n Do you remember what Ayn Rand said on her death bed?\n \n emoticon_xbye", 
   {}, 
   47964, 
   null, 
   1083799800.0
  ], 
  [
   47989, 
   null, 
   "Anastasia", 
   "I think jimstrucking is right on this one. THere is no proof that god does not exist. The evidence could be seen to point both ways, depending on how much faith you have.\n\n But there is no proof he does exist so your point is?\n Faith is not tangible and is subjective matter.\n \n \nOn the other hand, my personal experience has been that religious types are much easier to deal with, treat people more fairly and are more likely to do what is right simply for the fact that it is right. I think this comes from the teachings of most religion that god is watching, no matter how well you think you have coverd your misdeeds, and there will be an accouting. I also find that religious people have a better defined set of morals than athiests. I think this is because they have made a conscious decision to follow their god, whoever it may be, and for the most part the gods that people worship today are nice guy gods who want people to be nice to each other and honest and live a good life. It is true that people have used religion to justify a lot of evil, but lets not throw the baby out with the bath water.\n\n I am not sure where you are meeting these athiests to come to such a conclusion... I have meet plenty of Christians that were terrible people should I judge all Christians because of a few bad eggs? \n Waxy touched upon this earlier and when he said that a moral athiest might be a bit more sincere since there is no fear of hell.....\n hmmm all the athiests I know are great people, have families and a good set of ethics and morals\n emoticon_wow", 
   {}, 
   47967, 
   null, 
   1083802920.0
  ], 
  [
   48096, 
   null, 
   "sglaine", 
   "I think the Born again Chisitains are more of a threat than Athiest are. (IMHO)", 
   {}, 
   47989, 
   null, 
   1083870180.0
  ], 
  [
   48108, 
   null, 
   "Big Orn", 
   "I think the Born again Chisitains are more of a threat than Athiest are. (IMHO)\n\n \n Get the heck off me, sglaine! Surely, you jest?", 
   {}, 
   48096, 
   null, 
   1083873120.0
  ], 
  [
   48110, 
   null, 
   "sglaine", 
   "Get the heck off me, sglaine! Surely, you jest?\n\n Haa Haa Just kidding.", 
   {}, 
   48108, 
   null, 
   1083873420.0
  ], 
  [
   48138, 
   null, 
   "epaphras_faith", 
   "Hi epaphras faith,\n \n We have the religious camp and the non-religious camp, as we can agree from your above statement. In which camp does religious hypocrisy live in?\n \n regards\n\n \n While it may look like only the religious camp, I would say both. Even atheists engage in a kind of religious hypocrisy. The basic tenents subscribe to a philosophy of religion that leads one naturally to hypocrisy. It is impossible to say, I believe in nothing. Even that is a statement of belief. Atheism, philosophically speaking, is without logical merit. At least most religious stuff SAYS it is \"based on belief\". Atheism says it is based on NON BELIEF which is impossible. One simply must believe in some things. We are finite in our perceptions and must believe in things in order to function. It is the nature of human nature.", 
   {}, 
   47894, 
   null, 
   1083880740.0
  ], 
  [
   48140, 
   null, 
   "Tastyfish", 
   "Depends how you define it really, I would atheism is more applying the same laws to religion that you would apply to anything else with respect to whether you beleive it or not rather than disbelieving purely on faith. While beleif in some things is essential, disbeleiving in others is equally important otherwse you end up in the bizarre position of utterly beleiving in two completely contradictory things with no hope of combining the two.", 
   {}, 
   48138, 
   null, 
   1083881220.0
  ], 
  [
   48269, 
   null, 
   "billsco", 
   " It is impossible to say, I believe in nothing. Even that is a statement of belief. Atheism, philosophically speaking, is without logical merit. At least most religious stuff SAYS it is \"based on belief\". Atheism says it is based on NON BELIEF which is impossible. One simply must believe in some things. We are finite in our perceptions and must believe in things in order to function. It is the nature of human nature.\n\n \n I think you're misrepresenting atheism. It is simply the rejection of the Christian god, as understood and formulated by religious institutions through any number of creeds.\n \n I believe in a lot of things which may prove to be wrong. I believe in the goodness of humans and their ability to adapt and survive, for instance, despite the daily headlines, and in spite of the nearly universal apocalyptic bent of most Christians. \n \n To say the church's and its leader's messages are \"based on belief\" has not been my observation. I haven't heard Billy Graham deliver a sermon entitled, \"Jesus Saves, According To My Best Guess\". Nor has the infallible Pope issued any encyclical that I'm aware of where he states, \"In my humble opinion, priests should remain celibate\". They instead want their listeners to believe the message has been personally delivered by God to them, and they are reporting it verbatim, without delay, and will result in the most serious of consequences to one who rejects the pronouncement. \n \n That is what atheists don't believe in.", 
   {}, 
   48138, 
   null, 
   1083944400.0
  ], 
  [
   48270, 
   null, 
   "Phunting", 
   "I think you're misrepresenting atheism. It is simply the rejection of the Christian god, as understood and formulated by religious institutions through any number of creeds.\nIt isn't just a rejection of a christian god, but any god. Hence a-theism.\n \n Personally I believe atheism should be considered a religion, it is in the end a set of beliefs like any other.", 
   {}, 
   48269, 
   null, 
   1083944820.0
  ], 
  [
   48273, 
   null, 
   "sglaine", 
   "It isn't just a rejection of a christian god, but any god. Hence a-theism.\n \n Personally I believe atheism should be considered a religion, it is in the end a set of beliefs like any other.\n\n Atheism has no boundary's how in the heck can you call it a religion? Please explain further.", 
   {}, 
   48270, 
   null, 
   1083945480.0
  ], 
  [
   48274, 
   null, 
   "billsco", 
   "It isn't just a rejection of a christian god, but any god. Hence a-theism.\n \n \n\n \n Hi Phunting,\n \n You're correct. I was writing in the context of this thread I suppose, on American society.\n \n regards", 
   {}, 
   48270, 
   null, 
   1083945960.0
  ], 
  [
   48275, 
   null, 
   "thebootfitter", 
   "Nor has the infallible Pope issued any encyclical that I'm aware of where he states, \"In my humble opinion, priests should remain celibate\".\n\n You are misrepresenting the nature of the infallibility of the Pope here. Maximus posted a link with a good description of the nature of the infallibility of the Pope. You'll find it here, along with some discussion on the topic:\n \n http://4forums.com/political/showthread.php?p=42221#post42221", 
   {}, 
   48269, 
   null, 
   1083946020.0
  ], 
  [
   48281, 
   null, 
   "Phunting", 
   "Atheism has no boundary's how in the heck can you call it a religion? Please explain further.\nI don't quite see your point, how do you mean boundaries? What do boundaries have to do with something being a religion?\n \n I consider Atheism to be a belief as to the nature of god (specifically that his nature is as a fictitious entity). Now it is not an organised religion in this, but that does not mean that it cannot be considered one.", 
   {}, 
   48273, 
   null, 
   1083946740.0
  ], 
  [
   48282, 
   null, 
   "Phunting", 
   "Hi Phunting,\n \n You're correct. I was writing in the context of this thread I suppose, on American society.\n \n regards\nI see, \n \n Appologies if I was being pedantic then.", 
   {}, 
   48274, 
   null, 
   1083946740.0
  ], 
  [
   48309, 
   null, 
   "billsco", 
   "You are misrepresenting the nature of the infallibility of the Pope here. Maximus posted a link with a good description of the nature of the infallibility of the Pope. You'll find it here, along with some discussion on the topic:\n \n http://4forums.com/political/showthread.php?p=42221#post42221\n\n \n Hi bootfitter,\n \n Here's a quote from the Catholic Encyclopedia which Maximus included in his post on the definition of papal infallibility: \n \n \"...that infallibility means more than exemption from actual error; it means exemption from the possibility of error...\" \n \n Wow, nice job if you can get it. \"And so you peasants, in conclusion I hereby pronounce that I thought I was wrong once, but I was mistaken. But as you can see, I couldn't be mistaken either because...\"", 
   {}, 
   48275, 
   null, 
   1083955440.0
  ], 
  [
   48345, 
   null, 
   "thebootfitter", 
   "Wow, nice job if you can get it. \"And so you peasants, in conclusion I hereby pronounce that I thought I was wrong once, but I was mistaken. But as you can see, I couldn't be mistaken either because...\"\n\n Again, you are misrepresenting the concept and taking it out of context. The infallibility of the Pope is in reference to when he proclaims by a definitive act some doctrine of faith or morals. It does not mean that the Pope is free from all error, or free from the possibility of error. It means that the Pope is free from the possibility of error when proclaiming doctrine of faith or morals. \n \n There has never been an infallible proclamation that has been revoked. If there were, it would be proof that the concept of papal infallibility is in error.", 
   {}, 
   48309, 
   null, 
   1083962040.0
  ], 
  [
   48363, 
   null, 
   "billsco", 
   "\n There has never been an infallible proclamation that has been revoked. If there were, it would be proof that the concept of papal infallibility is in error.\n\n \n How could there be a revocation if it's limited to faith and morals and the sitting pope must be the one to break the news? Of course the pope in the late 19th century, when this doctrine came into being, intended infallibility to include all areas of human concern but had already been shown to be wrong in science for one. He wished to shut the mouths of kings and critics forever with one proclamation. The mistake was making it retroactive to the first pope and there are a number of bone-headed mistakes along the way I believe.", 
   {}, 
   48345, 
   null, 
   1083964380.0
  ], 
  [
   48407, 
   null, 
   "thebootfitter", 
   "How could there be a revocation if it's limited to faith and morals and the sitting pope must be the one to break the news? Of course the pope in the late 19th century, when this doctrine came into being, intended infallibility to include all areas of human concern but had already been shown to be wrong in science for one. He wished to shut the mouths of kings and critics forever with one proclamation. The mistake was making it retroactive to the first pope and there are a number of bone-headed mistakes along the way I believe.\n\n The concept of papal infallibility did not 'come into being' in the late 19th century, though that's perhaps when it was formalized.\n \n As you are discussing the topic, it is clear that you do not have an understanding of what papal infallibility means. It has nothing to do with the trial of Galileo or any of the bone-headed mistakes of individuals who served as Pope. It doesn't even have anything to do with things like the Roman Catholic Church's position regarding the gender of priests. If you have any desire to better understand that which you are arguing against, you may wish to do a bit more research.\n \n Looking at the situation from the viewpoint of a faithful member of the Roman Catholic Church, papal infallibility makes perfect sense. Assuming a God exists, and assuming that Jesus died for our sins and started a church on earth, and assuming that Jesus promised He would never allow the Church to stray (as indicated by scripture), then papal infallibility is one way Jesus keeps this promise. From a different perspective outside of the RCC, papal infallibility really has no impact on anyone, because only if you believe in the first place does papal infallibility have any impact.", 
   {}, 
   48363, 
   null, 
   1083970080.0
  ], 
  [
   48409, 
   null, 
   "Waxy", 
   "assuming that Jesus promised He would never allow the Church to stray (as indicated by scripture),\n\n \n Yikes, that's a potential can of worms.\n \n Waxy", 
   {}, 
   48407, 
   null, 
   1083970260.0
  ], 
  [
   48419, 
   null, 
   "billsco", 
   "The concept of papal infallibility did not 'come into being' in the late 19th century, though that's perhaps when it was formalized.\n \n\n \n Papal infallibility became official Catholic dogma in 1870, quite late. The idea was around previous. So? Was that period then non-papal infallibility?\n \n \n\n As you are discussing the topic, it is clear that you do not have an understanding of what papal infallibility means. It has nothing to do with the trial of Galileo or any of the bone-headed mistakes of individuals who served as Pope. It doesn't even have anything to do with things like the Roman Catholic Church's position regarding the gender of priests. If you have any desire to better understand that which you are arguing against, you may wish to do a bit more research.\n\n \n And you may wish to broaden yours if you're interested in pursuing truth wherever it leads.\n \n \n \n\n \n From a different perspective outside of the RCC, papal infallibility really has no impact on anyone, because only if you believe in the first place does papal infallibility have any impact. \n\n \n I'm sorry I don't understand where you're coming from.", 
   {}, 
   48407, 
   null, 
   1083972300.0
  ], 
  [
   48436, 
   null, 
   "sglaine", 
   "I don't quite see your point, how do you mean boundaries? What do boundaries have to do with something being a religion?\n \n I consider Atheism to be a belief as to the nature of god (specifically that his nature is as a fictitious entity). Now it is not an organised religion in this, but that does not mean that it cannot be considered one.\n\n What it means is that it has no boundary's because they do not believe in religion they don't want religion just because now some fruity yuppies decide that Atheism should be a religion I disagree with that concept.", 
   {}, 
   48281, 
   null, 
   1083976320.0
  ], 
  [
   48699, 
   null, 
   "billsco", 
   ".\n \n Is a religous population a lot easier to manipulate do you think? \n\n \n Hi Tastyfish,\n \n Well, depends on what is trying to be manipulated I would say. I think religious people have, through their belief system, an anchored, unshakeable foundation. That it is wrong is where the problem lies, IMO, and causes the rest of a society to slow its progression. Consider: when a new religion appears, its \"priests\" are the clear leaders, defining the faith, acting as messengers and mouthpieces of the new god. As the faith matures, I think the roles reverse and priests become servile to the masses. Case in point: the Rev. Jerry Falwell in regards to 9/11. His congregation of like-minded believers was clearly telling him where the fault lie in the tragedy -- gays were to blame and this was God's punishment. When he was publicly chastised he recanted, only to re-recant to his congregation. Who's leading whom here? \n \n \n.\n Given the absolute beleif in something that has no obvious facts backing it up, can this be applied to other things more easily? Or that it is relatively easy to twist religions to cover certain topics.\n\n \n Are people, outside of what they believe about religion, naturally skeptical or naturally gullible on the whole? My experience would tell me they tend toward skepticism. Religion muddies the water and tends to make otherwise healthily skeptical people irrational. \n \n regards", 
   {}, 
   47937, 
   null, 
   1084127220.0
  ], 
  [
   48780, 
   null, 
   "Phunting", 
   "What it means is that it has no boundary's because they do not believe in religion they don't want religion just because now some fruity yuppies decide that Atheism should be a religion I disagree with that concept.\nAtheism is a belief, just like any other? Just because it doesn't have scripture/a church/dogma should that somehow make an Atheists belief less valid? Should they not have equal protection under the law?\n \n I am still confused as to your exact meaning of 'boundaries'.", 
   {}, 
   48436, 
   null, 
   1084189800.0
  ], 
  [
   48789, 
   null, 
   "thebootfitter", 
   "Papal infallibility became official Catholic dogma in 1870, quite late. The idea was around previous. So? Was that period then non-papal infallibility?\n\n Papal infallibility has been around since Peter was designated as the first Pope by Jesus. It just wasn't official dogma spelled out as such until relatively recently.\n \n \nAnd you may wish to broaden yours if you're interested in pursuing truth wherever it leads.\n\n Truth is truth. Whatever is, is. Nothing your or I believe will change that. I accept whatever truth is. \n \n You may be confusing the position for which I am arguing with what I believe personally.\n \n \nI'm sorry I don't understand where you're coming from. \n\n Papal infallibility deals with moral truths as defined by the Roman Catholic Church. If a person does not even believe in the Christian God, then papal infallibility will only have an impact on them if they allow it to. What does it matter to an atheist that the Catholic Church professes that Mary was assumed into heaven, body and soul?", 
   {}, 
   48419, 
   null, 
   1084203000.0
  ], 
  [
   48793, 
   null, 
   "sglaine", 
   "Atheism is a belief, just like any other? Just because it doesn't have scripture/a church/dogma should that somehow make an Atheists belief less valid? Should they not have equal protection under the law?\n \n I am still confused as to your exact meaning of 'boundaries'.\n\n Atheism is not a belief I repete not a belief. next you will probably call a apple a peach.", 
   {}, 
   48780, 
   null, 
   1084204020.0
  ], 
  [
   48799, 
   null, 
   "Phunting", 
   "Atheism is not a belief I repete not a belief. next you will probably call a apple a peach.\nOf course atheism is a belief, who could possibly ever call it anything else? Just what on earth to you base such a daft assertation on?\n \n I was going to post the definition of 'belief', but it just seems to silly. I'm sure you and everyone else knows what 'belief' means, and yet I cannot comprehend how you could possibly count it as anything else.", 
   {}, 
   48793, 
   null, 
   1084206000.0
  ], 
  [
   48801, 
   null, 
   "sinjin", 
   "Of course atheism is a belief, who could possibly ever call it anything else? Just what on earth to you base such a daft assertation on?\n \n I was going to post the definition of 'belief', but it just seems to silly. I'm sure you and everyone else knows what 'belief' means, and yet I cannot comprehend how you could possibly count it as anything else.\n\n \n Wouldn't it technically be a \"disbelief\"? Like not a belief as \"dis\" indicates..", 
   {}, 
   48799, 
   null, 
   1084206420.0
  ], 
  [
   48805, 
   null, 
   "Phunting", 
   "Wouldn't it technically be a \"disbelief\"? Like not a belief as \"dis\" indicates..\nWell yes and no. In the end atheists believe that the world/life/everything were created by natural and/or scientific principles. That is a belief. By the same token you could claim Christianity is a 'disbelief' as they disbelieve these things are true.\n \n Disbelief is just a relative term when discussing a belief, but it does not negate the disbeliever's belief (!)", 
   {
    "unicode_changes_made": true
   }, 
   48801, 
   null, 
   1084207020.0
  ], 
  [
   48808, 
   null, 
   "billsco", 
   "\n You may be confusing the position for which I am arguing with what I believe personally.\n\n \n Too enigmatic for me to understand.\n \n \n\n \n Papal infallibility deals with moral truths as defined by the Roman Catholic Church. \n\n \n I agree.\n \n \n\n \n If a person does not even believe in the Christian God, then papal infallibility will only have an impact on them if they allow it to. \n\n \n I disagree. What the RCC does, along with every Protestant denomination, has an impact on you and me. \n \n \n\n \n What does it matter to an atheist that the Catholic Church professes that Mary was assumed into heaven, body and soul? \n\n \n I thought we were talking about infallibility. But you know, why would I want to be debating RCC esoterica? I'm really not interested in discussing the idea of papal infallibility, but if others are, they can feel free to use this thread. I'm interested in knowing what the real deal is for atheists in America.", 
   {}, 
   48789, 
   null, 
   1084207620.0
  ], 
  [
   48810, 
   null, 
   "billsco", 
   "Well yes and no. In the end atheists believe that the world/life/everything were created by natural and/or scientific principles. That is a belief. By the same token you could claim Christianity is a 'disbelief' as they disbelieve these things are true.\n \n Disbelief is just a relative term when discussing a belief, but it does not negate the disbeliever's belief (!)\n\n \n Hi sinjin,\n \n I know dis for sure, you can't argue with dat.\n \n regards", 
   {
    "unicode_changes_made": true
   }, 
   48805, 
   null, 
   1084208160.0
  ], 
  [
   48818, 
   null, 
   "sinjin", 
   "Well yes and no. In the end atheists believe that the world/life/everything were created by natural and/or scientific principles. That is a belief. By the same token you could claim Christianity is a 'disbelief' as they disbelieve these things are true.\n \n Disbelief is just a relative term when discussing a belief, but it does not negate the disbeliever's belief (!)\n\n \n The standpoint that \"everything\" is a product of a \"natural\" process is the neutral(obvious) position IMO and not a claim unless you give the \"Creation\" theory an equal chance of being true. Without being tainted, as we all are, by \"Creator\" cosmology I doubt the thought of a Being making \"everything\" would come to most of us spontaneously. It is the assertion of the existence of God that is the \"unnatural\" claim and should be considered as having the burden of proof upon it. If I said that there were seamonsters on Neptune and you couldn't prove otherwise would that make the chance of them really existing 50/50?", 
   {
    "unicode_changes_made": true
   }, 
   48805, 
   null, 
   1084210020.0
  ], 
  [
   48822, 
   null, 
   "sglaine", 
   "Of course atheism is a belief, who could possibly ever call it anything else? Just what on earth to you base such a daft assertation on?\n \n I was going to post the definition of 'belief', but it just seems to silly. I'm sure you and everyone else knows what 'belief' means, and yet I cannot comprehend how you could possibly count it as anything else.\n\n They don't believe in God so they don't believe in religion. They don't go to church they do not par take in religious things. So what I see here is if a car is red you would call it blue.", 
   {}, 
   48799, 
   null, 
   1084211040.0
  ], 
  [
   48823, 
   null, 
   "thebootfitter", 
   "Yeah... I'm not even sure how we got started down this road. I think it was some offhand comment you made about papal infallibility that I pointed out was not entirely accurate. It is a bit off topic. Agreed. Couple more comments, though.\n \n Regarding the following exchange:\n \nIf you have any desire to better understand that which you are arguing against, you may wish to do a bit more research.\n\n \nAnd you may wish to broaden yours if you're interested in pursuing truth wherever it leads.\n\n \nYou may be confusing the position for which I am arguing with what I believe personally.\n\n \nToo enigmatic for me to understand.\n\n Based on your comments regarding papal infallibility, it doesn't appear that you have a solid understanding of what 'papal infallibility' means as it is defined within the RCC. Often, arguments against something one does not understand are not reasonable arguments. (Consider creationist arguments for an example of this.) I may not have a complete understanding of papal infallibility as defined within the RCC, but I have a good enough understanding to know that your comments do not demonstrate a solid understanding of it. My own pursuit of truth has nothing to do with your understanding of papal infallibility. \n \n \nIf a person does not even believe in the Christian God, then papal infallibility will only have an impact on them if they allow it to.\n\n \nI disagree. What the RCC does, along with every Protestant denomination, has an impact on you and me?\n\n At some levels, this may be true. Though the RCC will do whatever the RCC will do. What the RCC does may have an impact on individuals outside the RCC through various channels (media, legal, political, personal contact, etc.) But the doctrine of papal infallibility has no direct impact on anyone's beliefs unless they allow it to have an impact on their beliefs.\n \n \nWhat does it matter to an atheist that the Catholic Church professes that Mary was assumed into heaven, body and soul?\n\n \nI thought we were talking about infallibility. But you know, why would I want to be debating RCC esoterica? I'm really not interested in discussing the idea of papal infallibility, but if others are, they can feel free to use this thread. I'm interested in knowing what the real deal is for atheists in America.\n\n The assumption of Mary was one of the 'infallible' proclamations by the Pope when speaking Ex Cathedra. I was pointing out that infallible proclamations by the RCC have little to do with an atheist's personal beliefs, unless that atheist takes a personal interest in these proclamations for one reason or another.", 
   {}, 
   48808, 
   null, 
   1084211340.0
  ], 
  [
   48825, 
   null, 
   "thebootfitter", 
   "Well yes and no. In the end atheists believe that the world/life/everything were created by natural and/or scientific principles. That is a belief. By the same token you could claim Christianity is a 'disbelief' as they disbelieve these things are true.\n\n This second statement is incorrect. Christians do not necessarily 'disbelieve' that the world/life/everything was created by natural principles. Some do. Some don't. \n \n Christians do believe that there is a God. Some Christians believe that everything was created by 'natural' means that can be observed, studied and known via scientific principles. Even if EVERYTHING can be explained by scientific principles, a Christian may still believe that a God exists that created everything in a naturalistic way that can be observed and known. Even if singularity (which I freely admit I do not understand) is the origin of the universe, that does not negate the possibility of an all-powerful God as described by the Christian Bible.", 
   {}, 
   48810, 
   null, 
   1084211940.0
  ], 
  [
   48890, 
   null, 
   "Tastyfish", 
   "They don't believe in God so they don't believe in religion. They don't go to church they do not par take in religious things. So what I see here is if a car is red you would call it blue.\n\n However it is clearly a religious option- more like if you were to ask 'shall we go for Thai or Indian?', 'Actually I am in the mood for Pizza' is an option that makes sense. Different from the others but still an option in that field.\n \n If Atheism was made an official religion, then what would count as priests and churchs (if anything), science teachers, or just anti-missionaries, who challenged the word of gods but nothing more? Trouble is they are a lot more effective than others though, so politically it wouldn't be very good. Could they even be allowed, are you allowed to attack and critise religions or do they have special laws protecting them?", 
   {}, 
   48822, 
   null, 
   1084223760.0
  ], 
  [
   48918, 
   null, 
   "sglaine", 
   "However it is clearly a religious option- more like if you were to ask 'shall we go for Thai or Indian?', 'Actually I am in the mood for Pizza' is an option that makes sense. Different from the others but still an option in that field.\n \n If Atheism was made an official religion, then what would count as priests and churchs (if anything), science teachers, or just anti-missionaries, who challenged the word of gods but nothing more? Trouble is they are a lot more effective than others though, so politically it wouldn't be very good. Could they even be allowed, are you allowed to attack and critise religions or do they have special laws protecting them?\n\n Tasty Fish who said I was critiseing religions I wasn't critiseing religion I was stating my interruption of it. (IMO)", 
   {}, 
   48890, 
   null, 
   1084226580.0
  ], 
  [
   48919, 
   null, 
   "Tastyfish", 
   "Tasty Fish who said I was critiseing religions I wasn't critiseing religion I was stating my interruption of it. (IMO)\n\n I didn't say you were critising religions, I was just saying that athesism can be considered a 'religious belief'. By beleiving in one religion you must by definetion in most cases disbelieve in others, atheism is just that little bit further but along the same lines, it has beleifs in common with every single other religion", 
   {}, 
   48918, 
   null, 
   1084226760.0
  ], 
  [
   48957, 
   null, 
   "sglaine", 
   "I didn't say you were critising religions, I was just saying that athesism can be considered a 'religious belief'. By beleiving in one religion you must by definetion in most cases disbelieve in others, atheism is just that little bit further but along the same lines, it has beleifs in common with every single other religion\n\n I disagree because they don't want to be associated with religion. Any more than you or I want to be in Iraq. It is like trying to put water in a pipe when there is no water.", 
   {}, 
   48919, 
   null, 
   1084234680.0
  ], 
  [
   48960, 
   null, 
   "Tastyfish", 
   "It isn't really associating them with religion, but offering Atheism as an alternative to religion- the beliefs cover the same set of things, its just in this case the things are thought not to exist. Atheism on its own is purely about gods, even more so than other religions as atheism only requires the disbeleif in them rather than setting any other rules as well. I can see why religions might not want it to be officially recognised but the association with religions I don't see (being an atheist)", 
   {}, 
   48957, 
   null, 
   1084236060.0
  ], 
  [
   48970, 
   null, 
   "sglaine", 
   "It isn't really associating them with religion, but offering Atheism as an alternative to religion- the beliefs cover the same set of things, its just in this case the things are thought not to exist. Atheism on its own is purely about gods, even more so than other religions as atheism only requires the disbeleif in them rather than setting any other rules as well. I can see why religions might not want it to be officially recognised but the association with religions I don't see (being an atheist)\n\n I would not even go there because it would not even with religions that is like having a car that never stays in time. OK let me put it another way Catholics have there ways Buddhist have there ways Muslims have there ways. What do atheist do they don't associate with any religion because they do not beleve in it. There would be to much confusion to get all of there disbeliefs in order. There are to many of them.", 
   {}, 
   48960, 
   null, 
   1084239300.0
  ], 
  [
   49034, 
   null, 
   "Phunting", 
   "This second statement is incorrect. Christians do not necessarily 'disbelieve' that the world/life/everything was created by natural principles. Some do. Some don't. \n \n Christians do believe that there is a God. Some Christians believe that everything was created by 'natural' means that can be observed, studied and known via scientific principles. Even if EVERYTHING can be explained by scientific principles, a Christian may still believe that a God exists that created everything in a naturalistic way that can be observed and known. Even if singularity (which I freely admit I do not understand) is the origin of the universe, that does not negate the possibility of an all-powerful God as described by the Christian Bible.\nPoint taken, but for the sake of argument I was generalising. By the same token some atheists believe that there is the existance of a supernatural force, be it nature, humanity or whatever, just not a 'god' as such.\n \n I was just trying to show that one mans belief is another's disbelief, I know there are always exceptions to any groups generally held 'belief'.", 
   {}, 
   48825, 
   null, 
   1084276620.0
  ], 
  [
   49035, 
   null, 
   "Phunting", 
   "If Atheism was made an official religion, then what would count as priests and churchs (if anything), science teachers, or just anti-missionaries, who challenged the word of gods but nothing more? Trouble is they are a lot more effective than others though, so politically it wouldn't be very good. Could they even be allowed, are you allowed to attack and critise religions or do they have special laws protecting them?\nI Britain anyway, atheism is counted as a religion officially, in that Atheists are protected as a religious group in the eyes of the law. It is just not an organised religion generally. However with regards to organised religious atheism, The Church of Satan is fairly close.", 
   {}, 
   48890, 
   null, 
   1084276860.0
  ], 
  [
   49036, 
   null, 
   "Phunting", 
   "They don't believe in God so they don't believe in religion. They don't go to church they do not par take in religious things. So what I see here is if a car is red you would call it blue.\nWhy do you have to do traditional Christian trappings in order to qualify for being religious?\n \n What of Bhuddists? Do you claim that is not a religion because it's followers don't necessarily do such things?", 
   {}, 
   48822, 
   null, 
   1084277100.0
  ], 
  [
   49038, 
   null, 
   "Phunting", 
   "I would not even go there because it would not even with religions that is like having a car that never stays in time. OK let me put it another way Catholics have there ways Buddhist have there ways Muslims have there ways. What do atheist do they don't associate with any religion because they do not beleve in it. There would be to much confusion to get all of there disbeliefs in order. There are to many of them.\nBut all religions have so many different opinions on almost every aspect of their faith, yet they are all linked by a general common belief. This is no different to Atheism. \n \n You mention Catholics, Catholics are one of literally thousands of Christian off-shoots. Does this mean that all of Christianity is invalid because it's members have varying beliefs? Are all the Abrahamic religions equally flawed for the same reason? Of course not.\n \n And if you feel that this is ok, because all the branches of these religions have their own set names and terms. Well firstly there is still massive division in these branches, and secondly Atheism also has it's own 'branches' for what different members of it believe, just like any other religion.", 
   {}, 
   48970, 
   null, 
   1084277580.0
  ], 
  [
   49111, 
   null, 
   "sglaine", 
   "Why do you have to do traditional Christian trappings in order to qualify for being religious?\n \n What of Bhuddists? Do you claim that is not a religion because it's followers don't necessarily do such things?\n\n It was an example thats all just as an example.", 
   {}, 
   49036, 
   null, 
   1084303200.0
  ], 
  [
   49115, 
   null, 
   "thebootfitter", 
   "You mention Catholics, Catholics are one of literally thousands of Christian off-shoots.\n\n Just a point of clarification here...\n \n The Catholic Church, per my understanding, is not an 'off-shoot' of anything. Rather, as I understand it, the early Christian Church was largely universal (of course there were exceptions). As more off-shoots became prevalent, the main body of the Christian Church distinguished itself as the Catholic Church. Certainly, this is not a complete description, as it does not distinguish between the Roman Catholic Church and the Orthodox Church. But I don't believe it is accurate to suggest that the Catholic Church is an 'off-shoot' of the early Christian Church. (C'mon, even Dan Brown knows that! ;) )", 
   {
    "post_info": {
     "post_title": "Clarification"
    }
   }, 
   49038, 
   null, 
   1084304520.0
  ], 
  [
   49128, 
   null, 
   "Ghost", 
   "I noticed something...\n \n \nIIt is like trying to put water in a pipe when there is no water.\n\n \n \nnext you will probably call a apple a peach.\n\n \n \nSo what I see here is if a car is red you would call it blue.\n\n \n You really like comparisons, don't you? :p It's irrelevant, I know, I just thought it was funny.\n \n I think that atheism is a belief, but not a religion in the sense of the word we're used to. A religion is a set of beliefs, an organized philosophy. Atheism itself is not a religion. I'm not saying that all atheists are not religious, in fact many are. Buddhism, for example, does not require a belief in God one way or the other.\n \n And a thing about the 'off-shoots' of Christianity. You'll find that most sub-sects in religions believe that they are the 'true way' and that all the others are the off-shoots. Mormons believe that they follow directly the teachings of Christ and everyone else was led astray. Catholics feel like they were the first and everyone branched off from them. The interesting thing is that Christianity as a whole is an off-shoot, of both Judaism and Paganism.", 
   {}, 
   48957, 
   null, 
   1084308180.0
  ], 
  [
   49129, 
   null, 
   "sglaine", 
   "I noticed something...\n \n \n \n \n \n \n \n You really like comparisons, don't you? :p It's irrelevant, I know, I just thought it was funny.\n \n .\n Not is not a believe they dont want to be associate with religion How can you say something that is not. That is the most ridicules thing I have ever heard. And Christianity is not what it use to be ether.What do atheists believe in? They don't believe in religion no matter how you look at you can not classify them as a religion. I found nothing funny with you dumb comment about comparisons. Sometimes you have to compare so people get the message. You knew that now didn't you.", 
   {}, 
   49128, 
   null, 
   1084308480.0
  ], 
  [
   49137, 
   null, 
   "Ghost", 
   "Not is not a believe they dont want to be associate with religion How can you say something that is not. That is the most ridicules thing I have ever heard. And Christianity is not what it use to be ether.What do atheists believe in? They don't believe in religion no matter how you look at you can not classify them as a religion.\n\n \n What are you talking about? I said that atheism is not a religion. What are you trying to argue here? I said that there are religions where a belief in God is either discouraged or found unimportant, that's all. That's a fact. Do you know anything about Buddhism?\n \n \nI found nothing funny with you dumb comment about comparisons. Sometimes you have to compare so people get the message. You knew that now didn't you.\n\n \n That'd be because you have no sense of humor :p . Relax, I was just playing around a bit, not intending to offend or attack you.", 
   {}, 
   49129, 
   null, 
   1084310700.0
  ], 
  [
   49154, 
   null, 
   "epaphras_faith", 
   "I think you're misrepresenting atheism. It is simply the rejection of the Christian god, as understood and formulated by religious institutions through any number of creeds.\n \n I believe in a lot of things which may prove to be wrong. I believe in the goodness of humans and their ability to adapt and survive, for instance, despite the daily headlines, and in spite of the nearly universal apocalyptic bent of most Christians. \n \n To say the church's and its leader's messages are \"based on belief\" has not been my observation. I haven't heard Billy Graham deliver a sermon entitled, \"Jesus Saves, According To My Best Guess\". Nor has the infallible Pope issued any encyclical that I'm aware of where he states, \"In my humble opinion, priests should remain celibate\". They instead want their listeners to believe the message has been personally delivered by God to them, and they are reporting it verbatim, without delay, and will result in the most serious of consequences to one who rejects the pronouncement. \n \n That is what atheists don't believe in.\n\n \n Old note, I know but I am only here every so often. I do not misrepresent atheism. The word itself means without anything theistic or anything of any kind having to do with any god. It is not simply the rejection of the christian god. It is a rejection of all forms of god. No matter the religion. The hardcore atheists (and they do say this) say that bellief in anything that cannot be observed is absurd. Yet you and I cannot live life without believing in things we do not observe.\n \n You mischaracterize billy graham. (I don't know about the pope). Dr. Graham has never delivered a message that says believe thusly or you go to hell. He has delivered his knowledge and understanding of the love of God. God loves. Period. That is the christian dogma. It is irrelevant what SOME have preached, as it is possible what they preach is wrong. God clearly loves. Billy graham has preached that he knows God wants individuals to choose jesus because God loves them. He has never stated the conditional fear part you speak of. Good luck finding such an item.", 
   {}, 
   48269, 
   null, 
   1084314420.0
  ], 
  [
   49164, 
   null, 
   "sglaine", 
   "Old note, I know but I am only here every so often. I do not misrepresent atheism. The word itself means without anything theistic or anything of any kind having to do with any god. It is not simply the rejection of the christian god. It is a rejection of all forms of god. No matter the religion. The hardcore atheists (and they do say this) say that bellief in anything that cannot be observed is absurd. Yet you and I cannot live life without believing in things we do not observe.\n \n You mischaracterize billy graham. (I don't know about the pope). Dr. Graham has never delivered a message that says believe thusly or you go to hell. He has delivered his knowledge and understanding of the love of God. God loves. Period. That is the christian dogma. It is irrelevant what SOME have preached, as it is possible what they preach is wrong. God clearly loves. Billy graham has preached that he knows God wants individuals to choose jesus because God loves them. He has never stated the conditional fear part you speak of. Good luck finding such an item.\n God loves billy Graham Haaa God loves Tammy Fay too Haaa. the problem with religion is the new Church's that have sprouted up have lost reality with the Bible Christan's have lost touch with the Bible and are now harping on morals. They want every body to conform to there style.", 
   {}, 
   49154, 
   null, 
   1084316760.0
  ], 
  [
   49202, 
   null, 
   "sinjin", 
   "Old note, I know but I am only here every so often. I do not misrepresent atheism. The word itself means without anything theistic or anything of any kind having to do with any god. It is not simply the rejection of the christian god. It is a rejection of all forms of god. No matter the religion. The hardcore atheists (and they do say this) say that bellief in anything that cannot be observed is absurd. Yet you and I cannot live life without believing in things we do not observe.\n \n\n \n What sort of things other than God that can't be observed would you believe in that a \"hard core\" atheist would not?", 
   {}, 
   49154, 
   null, 
   1084323360.0
  ], 
  [
   49206, 
   null, 
   "sglaine", 
   "What are you talking about? I said that atheism is not a religion. What are you trying to argue here? I said that there are religions where a belief in God is either discouraged or found unimportant, that's all. That's a fact. Do you know anything about Buddhism?\n \n \n \n That'd be because you have no sense of humor :p . Relax, I was just playing around a bit, not intending to offend or attack you.\n\n Exactly I have been say that right a long and it should not be classify as a religion. It has no meaning because some yuppie group now wants to stereo atheism into a religion. Come on its a no brainer thy do not want to be a part of religion. Oh I do have a sense of humor don't worry about that.", 
   {}, 
   49137, 
   null, 
   1084324260.0
  ], 
  [
   49333, 
   null, 
   "Phunting", 
   "Just a point of clarification here...\n \n The Catholic Church, per my understanding, is not an 'off-shoot' of anything. Rather, as I understand it, the early Christian Church was largely universal (of course there were exceptions). As more off-shoots became prevalent, the main body of the Christian Church distinguished itself as the Catholic Church. Certainly, this is not a complete description, as it does not distinguish between the Roman Catholic Church and the Orthodox Church. But I don't believe it is accurate to suggest that the Catholic Church is an 'off-shoot' of the early Christian Church. (C'mon, even Dan Brown knows that! ;) )\nAgain, I realise and appreciate that. My point was that the Christian Church has many facets to it's belief just as atheism does, and as sglaine mentioned Catholicism I used it as my example. You are right it is not a strictly accurate wording, but i felt that was a technicality irrelevant to my point.", 
   {}, 
   49115, 
   null, 
   1084361940.0
  ], 
  [
   49334, 
   null, 
   "Phunting", 
   "A few questions:\n \n You say atheism is not a belief because it is reactionary, therefore a non-belief. Hypothetically speaking, if a remote culture were to develop atheism without at any point considering a theistic system, would you still not classify it as a belief?\n \n \n \nIt was an example thats all just as an example.\nSo if that was just an example, on what grounds would you say something (belief or non) could be classified as a religion?\n \n Finally regardless of if it is spiritually (for want of a better word) a religion or not, do you believe that it should legally be regarded as a religion? In other words do you think that Atheists should be protected under religious discrimination laws and the like?", 
   {}, 
   49111, 
   null, 
   1084362300.0
  ], 
  [
   49378, 
   null, 
   "billsco", 
   ".\n \n You mischaracterize billy graham. (I don't know about the pope). Dr. Graham has never delivered a message that says believe thusly or you go to hell. He has delivered his knowledge and understanding of the love of God. \n \n\n \n Hi epaphras_faith,\n \n Billy Graham picked up the ball where Norman Vincent Peale left it after reinventing God in the mid 20th century. Peale was the one who popularized \"God is love\" and for it received ostracism from every mainline denomination in America, which was decidedly \"fire and brimstone\". When they saw the beaten path to Peale's doorstep, they belatedly began receiving divine revelations that God is, indeedy, love. \n \n \n \n.\n \n God loves. Period. That is the christian dogma. \n \n\n \n A new phenomenon, as I have endeavored to briefly show above. Many theologians still realize today that if you attempt to remove hell from the equation, you have pulled a critical pillar from the base that supports Christianity. \n \n \n.\n It is irrelevant what SOME have preached, as it is possible what they preach is wrong. \n \n\n \n I hope you're not advocating that the Reverend Billy Graham is infallible. The last time I mentioned that word I was taken to task. At the least may we agree that Dr. Graham may be as right or as wrong as some other practitioners. In the last sermon I heard him deliver he stated God is a spirit.\n That statement alone relegates God to nothingness, although I'm afraid it eluded the audience.\n \n \n.\n Billy graham has preached that he knows God wants individuals to choose jesus because God loves them. He has never stated the conditional fear part you speak of. Good luck finding such an item. \n\n \n If the words \"hell\" and \"damnation\" have never crossed his lips, and he has said many other choices besides Jesus will still ensure God's love and mercy, then I may be inclined to believe, like you, that he may be more right than others.\n \n regards", 
   {}, 
   49154, 
   null, 
   1084378080.0
  ], 
  [
   49477, 
   null, 
   "Ghost", 
   "In other words do you think that Atheists should be protected under religious discrimination laws and the like?\n\n \n I would say so, yes. The problem is that this isn't always what happens. If you live in Salt Lake City, you'd better be Mormon if you want a good job. And if you leave the church, you'll probably be fired.\n \n On another note, I'm reading a book right now by Bertrand Russell, called 'Why I Am Not A Christian.' Very good book, interesting insights. Phunting, I think you'd like it.", 
   {}, 
   49334, 
   null, 
   1084394040.0
  ], 
  [
   49797, 
   null, 
   "epaphras_faith", 
   "Hi epaphras_faith,\n \n Billy Graham picked up the ball where Norman Vincent Peale left it after reinventing God in the mid 20th century. Peale was the one who popularized \"God is love\" and for it received ostracism from every mainline denomination in America, which was decidedly \"fire and brimstone\". When they saw the beaten path to Peale's doorstep, they belatedly began receiving divine revelations that God is, indeedy, love. \n \n \n \n \n A new phenomenon, as I have endeavored to briefly show above. Many theologians still realize today that if you attempt to remove hell from the equation, you have pulled a critical pillar from the base that supports Christianity. \n \n \n \n I hope you're not advocating that the Reverend Billy Graham is infallible. The last time I mentioned that word I was taken to task. At the least may we agree that Dr. Graham may be as right or as wrong as some other practitioners. In the last sermon I heard him deliver he stated God is a spirit.\n That statement alone relegates God to nothingness, although I'm afraid it eluded the audience.\n \n \n \n If the words \"hell\" and \"damnation\" have never crossed his lips, and he has said many other choices besides Jesus will still ensure God's love and mercy, then I may be inclined to believe, like you, that he may be more right than others.\n \n regards\n\n \n Hello Bill:\n \n I othink you misunderstand my statements. I am not saying that hell is not a reality. I am not saying that Billy Graham does not believe in it. Hell is simply eternal separation from God. The bible says that the only way to God is through Jesus. That is to be sure. But, it is how this is presented by christians with which you argue. \n \n I have never preached hell and damnation. None of those have ever turned anyone toward God. God himself told the children of Israel what would happen if they turned their back on Him. It did not stop them anyway (read Jeremiah for background).\n \n It is God' love, mercy and grace that are appealing to people. God is love is not a New concept. It is well established from the very beginning. It is who God is. All he does is out of love, because it is who He is. You nor I always understand it, but we are not the ones who get to define what is and is not loving. That would be ludicrous as it would result in sheer chaos and foolish actions. That is where moral relativism comes from. \n \n If, however, love is defined then to know what it is is the highest of all callings. God defines love as Himself. Therefore, the highest of all callings is to know God. To look simply at the surface actions and not dig deeper into things leaves one with a wrong view. \n \n That is the point I was trying to make. You mischaracterize what people are doing. To say that Billy Graham is a terrible person because he tries to scare people into believing is simply wrong. NOthing BG has ever done was out of a desire to induce fear. \n \n If he believes that the highest of callings is to know God (love) and it has had a profound impact on his life (and he does and it has) then why would he NOT want others to experience such a thing. \n \n If you found the most amazing thing in the world to you and it was life transforming and the people you love did not have that, would you not want to share it with them. That is Dr. Graham's motivation. For you to beleive otherwise would necessarily be based on a lack of knowledge and therefore be somewhat prejudicial.\n \n Thanks for responding and your patience in my getting back. I am still looking for a job and do not spend anywhere near the time I used to on this board.\n \n EF.", 
   {}, 
   49378, 
   null, 
   1084490640.0
  ], 
  [
   49940, 
   null, 
   "Phunting", 
   "I would say so, yes. The problem is that this isn't always what happens. If you live in Salt Lake City, you'd better be Mormon if you want a good job. And if you leave the church, you'll probably be fired.\nHmm worrying. OK Salt Lake City drops from my list of places to move to in the States.\n \n \n \nOn another note, I'm reading a book right now by Bertrand Russell, called 'Why I Am Not A Christian.' Very good book, interesting insights. Phunting, I think you'd like it.\nThanks, I'll look into it. :)", 
   {}, 
   49477, 
   null, 
   1084536840.0
  ], 
  [
   50078, 
   null, 
   "billsco", 
   "Hello Bill:\n \n ...Hell is simply eternal separation from God. The bible says that the only way to God is through Jesus. That is to be sure. But, it is how this is presented by christians with which you argue. \n\n \n No, nothing against the messengers, I reject the message. It is about condemning most people to a separation from God, which is a nice euphemism for hell but little more.\n \n \n\n I have never preached hell and damnation. None of those have ever turned anyone toward God. God himself told the children of Israel what would happen if they turned their back on Him. It did not stop them anyway (read Jeremiah for background).\n\n \n \n If the message was good enough that God personally relayed it to the Jews, if it was that important, it ought to be good enough for his present-day followers to disseminate. Why would you want to hear a sugar-coated version of anything? Why not the whole story, full-strength? \n \n \n \n\n It is God' love, mercy and grace that are appealing to people. God is love is not a New concept. It is well established from the very beginning. It is who God is. All he does is out of love, because it is who He is. You nor I always understand it, but we are not the ones who get to define what is and is not loving. That would be ludicrous as it would result in sheer chaos and foolish actions. That is where moral relativism comes from. \n\n \n I can't agree with one sentence of the above, and my disagreements become stronger with each new sentence. The God of the O.T. is not about love. We most certainly must get to define what it is. And, most of all, the story of God has nothing to do with morality, let alone relativism. \n \n \n\n If, however, love is defined then to know what it is is the highest of all callings. God defines love as Himself. Therefore, the highest of all callings is to know God. To look simply at the surface actions and not dig deeper into things leaves one with a wrong view. \n\n \n I have dug so deep that I reached the footings and found them rotted beyond repair. Have you dug that deep?\n \n \n\n That is the point I was trying to make. You mischaracterize what people are doing. To say that Billy Graham is a terrible person because he tries to scare people into believing is simply wrong. NOthing BG has ever done was out of a desire to induce fear.\n\n \n I have nothing against Billy Graham.\n \n \n \n\n If he believes that the highest of callings is to know God (love) and it has had a profound impact on his life (and he does and it has) then why would he NOT want others to experience such a thing. \n\n \n I believe happiness lies in pursuing the truth wherever it leads. I want to share that belief, I want you to experience the exhilaration of discovering a fact, a nugget of truth and realize what freedom really feels like. I WANT to share that. \n \n \n \n\n If you found the most amazing thing in the world to you and it was life transforming and the people you love did not have that, would you not want to share it with them. That is Dr. Graham's motivation. For you to beleive otherwise would necessarily be based on a lack of knowledge and therefore be somewhat prejudicial.\n\n \n It is my motivation as well, as it is yours I assume.\n \n \n\n Thanks for responding and your patience in my getting back. I am still looking for a job and do not spend anywhere near the time I used to on this board.\n \n EF. \n\n \n A job in the ministry I assume? Well, best of luck. Hope you can find time to check in often.", 
   {}, 
   49797, 
   null, 
   1084589940.0
  ], 
  [
   50311, 
   null, 
   "epaphras_faith", 
   "No, nothing against the messengers, I reject the message. It is about condemning most people to a separation from God, which is a nice euphemism for hell but little more.\n \n \n \n \n If the message was good enough that God personally relayed it to the Jews, if it was that important, it ought to be good enough for his present-day followers to disseminate. Why would you want to hear a sugar-coated version of anything? Why not the whole story, full-strength? \n \n \n \n \n I can't agree with one sentence of the above, and my disagreements become stronger with each new sentence. The God of the O.T. is not about love. We most certainly must get to define what it is. And, most of all, the story of God has nothing to do with morality, let alone relativism. \n \n \n \n I have dug so deep that I reached the footings and found them rotted beyond repair. Have you dug that deep?\n \n \n \n I have nothing against Billy Graham.\n \n \n \n \n I believe happiness lies in pursuing the truth wherever it leads. I want to share that belief, I want you to experience the exhilaration of discovering a fact, a nugget of truth and realize what freedom really feels like. I WANT to share that. \n \n \n \n \n It is my motivation as well, as it is yours I assume.\n \n \n \n A job in the ministry I assume? Well, best of luck. Hope you can find time to check in often.\n\n \n 1st. I am not pursuing a job in ministry. Government actually. (bureaucrat). My question to you is why do you, a fallible, faulty, flawed human get to define what love ought to be or is? Are you so certain that you can see the future for each and every individual that you know what will be best for them in the future? Do you really think that you see so clearly that you even know what is best for you 20 years from now? Where were you when I was made? Where were you when Rome was built or even the matter slipped into being? Where were you when the designs for DNA were conceived? WHY oh WHY would you presume to know so much as to be able to define the concept of love?", 
   {}, 
   50078, 
   null, 
   1084781700.0
  ], 
  [
   50346, 
   null, 
   "sglaine", 
   "A few questions:\n \n You say atheism is not a belief because it is reactionary, therefore a non-belief. Hypothetically speaking, if a remote culture were to develop atheism without at any point considering a theistic system, would you still not classify it as a belief?\n \n \n So if that was just an example, on what grounds would you say something (belief or non) could be classified as a religion?\n \n Finally regardless of if it is spiritually (for want of a better word) a religion or not, do you believe that it should legally be regarded as a religion? In other words do you think that Atheists should be protected under religious discrimination laws and the like?\n Hypothetically speaking they simply want to be left out of the religion. Let ask you this Phunting would you like to be dragged down the hall way if you did not want to go. Well it is the same thing here. So Phunting do you want to classify Atheism?", 
   {}, 
   49334, 
   null, 
   1084807500.0
  ], 
  [
   50351, 
   null, 
   "thebootfitter", 
   "My question to you is why do you, a fallible, faulty, flawed human get to define what love ought to be or is? \n\n My question to YOU is this: How do YOU get off calling another human being fallible, faulty and flawed? Do you not believe that human beings were created in God's image? How can we be faulty or flawed if God created us? If God created us as God intended to create us, I would suggest that we are exactly as God intended to create us. In other words, we were created perfectly. Where is the flaw in that?", 
   {}, 
   50311, 
   null, 
   1084809240.0
  ], 
  [
   50355, 
   null, 
   "sglaine", 
   "My question to YOU is this: How do YOU get off calling another human being fallible, faulty and flawed? Do you not believe that human beings were created in God's image? How can we be faulty or flawed if God created us? If God created us as God intended to create us, I would suggest that we are exactly as God intended to create us. In other words, we were created perfectly. Where is the flaw in that?\n\n You raise a very interesting issue may that is a lie too.", 
   {}, 
   50351, 
   null, 
   1084810200.0
  ], 
  [
   50362, 
   null, 
   "billsco", 
   " My question to you is why do you, a fallible, faulty, flawed human get to define what love ought to be or is? \n\n \n I'm the captain of my ship and when I see something that looks, quacks, and walks like a duck, I am going to label it a duck. IMO, a Christian all too often imagines some unseen entity under the surface of the water is animating and manipulating the object which appears to resemble a duck, making one BELIEVE they are seeing a duck but are actually being fooled, except for, of course, the Christian, who in turn feels compelled to warn everybody about the fake duck. \n \n I am qualified to speak of love because I have received it as well as given it, and I can attest to its greatness in elevating the human spirit. Beyond that, I can't go, and may I be so bold as to say, neither can you. And even bolder yet, I don't want or desire anything beyond that. \n \n \n \n Are you so certain that you can see the future for each and every individual that you know what will be best for them in the future? \n\n \n No. I'm not sure how you assumed that. I make no claims like that.\n \n \n Do you really think that you see so clearly that you even know what is best for you 20 years from now? \n\n \n Again, no. Do you?\n \n \n \n Where were you when I was made? Where were you when Rome was built or even the matter slipped into being? Where were you when the designs for DNA were conceived? \n\n \n Shades of Job: consider Chapter 40:12 . Great literature, no? You know, I've never presumed to know the answers to the great mystery. It seems as though you do, IMO.\n \n \n \n WHY oh WHY would you presume to know so much as to be able to define the concept of love? \n\n \n Because no one else can define it for me. Those that attempt to are charlatans and quacks and have 1-900 phone numbers which one can call at 4 A.M. to be enlightened as to their definition. \n \n May I ask, what are you attempting to strive for that the very act of being a human being isn't enough? Why do you feel you need more, and at what point may we question whether greediness enters the equation?", 
   {}, 
   50311, 
   null, 
   1084811700.0
  ], 
  [
   50388, 
   null, 
   "Phunting", 
   "Hypothetically speaking they simply want to be left out of the religion. Let ask you this Phunting would you like to be dragged down the hall way if you did not want to go. Well it is the same thing here. So Phunting do you want to classify Atheism?\nSorry, I really don't understand that post! Who wants to be left out of what religion in what hypothesis? \n \n And do I wan't to classify Atheism as what? A religion? Well yes, as IMO it is. But I appreciate that it can be seen otherwise. However legally at least I feel it must be one.\n \n And you didn't really answer my questions.", 
   {}, 
   50346, 
   null, 
   1084816800.0
  ], 
  [
   50394, 
   null, 
   "sglaine", 
   "Sorry, I really don't understand that post! Who wants to be left out of what religion in what hypothesis? \n \n And do I wan't to classify Atheism as what? A religion? Well yes, as IMO it is. But I appreciate that it can be seen otherwise. However legally at least I feel it must be one.\n \n And you didn't really answer my questions.\n\n Reread the post. I was stating that Atheism should not be classified as a religion. Thats why Atheism is what it is they do not go to church they do not partake in religious things. So that for they shoud not be classified as a religion. So why try to make something that can not be done. Do you now under stand what I am getting at?", 
   {}, 
   50388, 
   null, 
   1084817940.0
  ], 
  [
   50396, 
   null, 
   "Ghost", 
   "Sorry, I really don't understand that post! Who wants to be left out of what religion in what hypothesis?\n\n \n Well, it is from sglaine... emoticon_cool \n \n \nAnd do I wan't to classify Atheism as what? A religion? Well yes, as IMO it is. But I appreciate that it can be seen otherwise. However legally at least I feel it must be one.\n\n \n Phunting, how do you see atheism a religion? I don't see it. I think that it definately needs legal status as such, but realistically, it has no organized structure, no dogma, no 'higher word,' no churches or temples, no communities, no overriding philosophy.\n \n Billsco, excellent post btw.", 
   {}, 
   50388, 
   null, 
   1084818240.0
  ], 
  [
   50399, 
   null, 
   "Phunting", 
   "Reread the post. I was stating that Atheism should not be classified as a religion. Thats why Atheism is what it is they do not go to church they do not partake in religious things. So that for they shoud not be classified as a religion. So why try to make something that can not be done. Do you now under stand what I am getting at?\nI understand what you are saying now, it wasn't clear in your previous post.\n \n I dispute that one needs to 'partake in religious things' to follow a religion. A non-practicing christian still follows a religion, even if they don't attend church and the like.\n \n And again I ask, do you feel that it should have a religious classification under the law or not?", 
   {}, 
   50394, 
   null, 
   1084818420.0
  ], 
  [
   50400, 
   null, 
   "JPSartre12", 
   "Hello,\n \n A recent survey found that 54% of Americans believe atheism presents the greatest threat to our society, even more than non-Christian religions such as Islam.\n \n \n http://www.mndaily.com/articles/2004/04/27/9453#repeat\n \n That has me wondering what our fellow forum members think about the matter. I've included a poll which I hope you'll take time to vote in, and I am looking forward to any and all comments.\n \n regards\n\n \n I heard recently that people who attend church regulary are twice as likely to vote Republican and that people who rarely or never attend church are twice as likely to vote Democratic. Therefore, I would conclude that the biggest threat to our way of life is the Democratic Party. ;)", 
   {}, 
   46395, 
   null, 
   1084818480.0
  ], 
  [
   50405, 
   null, 
   "Phunting", 
   "Phunting, how do you see atheism a religion? I don't see it. I think that it definately needs legal status as such, but realistically, it has no organized structure, no dogma, no 'higher word,' no churches or temples, no communities, no overriding philosophy.\nIn the end I see a religion as a system of belief concerning the nature of a higher power.\n \n I feel that atheism is based on belief, as agnosticism is the only real system that doesn't require a leap of faith of one sort or the other.\n \n Of course it has none of the trappings you list, but they are a part of organized religion, not religion itself. To put it another way, what of someone who passionately believes in a God of their own definition. They have no church, no dogma not even a set of clearly defined beliefs, but they believe strongly in what they believe. They are still religious, even though their religion has no real defining characteristics. \n \n Equally I see atheists as in the same position, we can passionately believe in what we believe, take it all on faith without any defined scripture or other trappings. We can use these beliefs to find our place in the universe, to explain why the world works as we see it and to base our actions according to these beliefs. As we can behave in a religious way, then surely by definition we are following a religion.\n \n In the end it is a belief about the nature of God. Why should 'religion' be confined to an affirmative belief as to his nature?", 
   {}, 
   50396, 
   null, 
   1084819260.0
  ], 
  [
   50410, 
   null, 
   "sglaine", 
   "I heard recently that people who attend church regulary are twice as likely to vote Republican and that people who rarely or never attend church are twice as likely to vote Democratic. Therefore, I would conclude that the biggest threat to our way of life is the Democratic Party. ;)\n\n Now is that supposed to be a good thing if you go to church you will vote Republican. What a crock of you know what here. That has got to be the dumbist thing I ever heard in my life. I used to go to church but now a days it has gotten phony like the Republicans.", 
   {}, 
   50400, 
   null, 
   1084819680.0
  ], 
  [
   50411, 
   null, 
   "Phunting", 
   "Now is that supposed to be a good thing if you go to church you will vote Republican. What a crock of you know what here. That has got to be the dumbist thing I ever heard in my life.\nErr he was joking! emoticon_rolleyes\n \n ... I hope!\n \n edit:\n \nI used to go to church but now a days it has gotten phony like the Republicans\nWell that proves his point doesn't it? If you can put up with the phony-ness of the church you can put up with the phony-ness of the republicans. :)\n \n edit edit: \n I am too, btw emoticon_rolleyes", 
   {}, 
   50410, 
   null, 
   1084819920.0
  ], 
  [
   50415, 
   null, 
   "sglaine", 
   "Err he was joking! emoticon_rolleyes\n \n ... I hope!\n \n edit:\n Well that proves his point doesn't it? If you can put up with the phony-ness of the church you can put up with the phony-ness of the republicans. :)\n \n edit edit: \n I am too, btw emoticon_rolleyes\n What the heck is that suppose to prove. Thats right (IMO) Republicans the majority are phonys. For your info just a many Democrat go to church as well so whats that suppose to mean too. Come on Satin get with the real world. emoticon_rolleyes", 
   {}, 
   50411, 
   null, 
   1084821420.0
  ], 
  [
   50417, 
   null, 
   "Phunting", 
   "What the heck is that suppose to prove. Thats right (IMO) Republicans the majority are phonys. For your info just a many Democrat go to church as well so whats that suppose to mean too. Come on Satin get with the real world. emoticon_rolleyes\nWhat? Huh? It wasn't supposed to prove anything. Hence the statement that I was joking. And who is Satin?\n \n Anyway lets please stop this before it gets out of hand. In future I will know not to use jokes and/or sarcasm in my posts if it really is that easily confused with whatever you thought I was saying.\n \n emoticon_rolleyes emoticon_frazzled emoticon_cry emoticon_rolleyes", 
   {}, 
   50415, 
   null, 
   1084821780.0
  ], 
  [
   50435, 
   null, 
   "JPSartre12", 
   "Waht? Huh? It wasn't supposed to prove anything. Hence the statement that I was joking. And who is Satin?\n\n \n Oh, come on. You know Satin, brother of Velvet, cousin of Velour.;)\n \n\n Anyway lets please stop this before it gets out of hand. In future I will know not to use jokes and/or sarcasm in my posts if it really is that easily confused with whatever you thought I was saying.\n \n emoticon_rolleyes emoticon_frazzled emoticon_cry emoticon_rolleyes\n\n \n Don't confuse us with the facts, please. emoticon_xdonno", 
   {}, 
   50417, 
   null, 
   1084825440.0
  ], 
  [
   50437, 
   null, 
   "JPSartre12", 
   "What the heck is that suppose to prove. Thats right (IMO) Republicans the majority are phonys. \n\n \n And you know what they say about \"opinions\". \n \n\n For your info just a many Democrat go to church as well so whats that suppose to mean too. Come on Satin get with the real world. emoticon_rolleyes\n\n \n Actually, I reported the real results of a study. Regular church attendees are twice as likely to vote Republican...etc., the conclusion was, however, meant to be a joke. Most got it, you didn't. emoticon_rolleyes", 
   {}, 
   50415, 
   null, 
   1084825680.0
  ], 
  [
   50445, 
   null, 
   "billsco", 
   "Well, I just checked the latest poll results, 26 votes, from this thread. Allow me to spin it. \n \n So far, only four people who voted feel threatened by atheism. Four people who perhaps frequent this board that are genuinely frightened by the idea of atheism. I was surprised so many voted neutrally, but for reasons once explained, I was in general agreement with them.\n \n But best of all, the happiest surprise, 15 of us gave atheism in our society a postive mark. Is it somehow a coincidence that people who are attracted to debates are so accepting of atheists?", 
   {}, 
   50435, 
   null, 
   1084826760.0
  ], 
  [
   50570, 
   null, 
   "sglaine", 
   "Oh, come on. You know Satin, brother of Velvet, cousin of Velour.;)\n \n \n Don't confuse us with the facts, please. emoticon_xdonno\n\n The Devil what do you think. I thought you were more educated than that.", 
   {}, 
   50435, 
   null, 
   1084846620.0
  ], 
  [
   50571, 
   null, 
   "sglaine", 
   "I understand what you are saying now, it wasn't clear in your previous post.\n \n I dispute that one needs to 'partake in religious things' to follow a religion. A non-practicing christian still follows a religion, even if they don't attend church and the like.\n \n And again I ask, do you feel that it should have a religious classification under the law or not?\n\n Prove that they follow a religion. Come on, On what bases do they follow?", 
   {}, 
   50399, 
   null, 
   1084846800.0
  ], 
  [
   50573, 
   null, 
   "JPSartre12", 
   "Well, I just checked the latest poll results, 26 votes, from this thread. Allow me to spin it. .........\n \n But best of all, the happiest surprise, 15 of us gave atheism in our society a postive mark. Is it somehow a coincidence that people who are attracted to debates are so accepting of atheists?\n\n \n My guess would be that people who like to debate intellectual topics tend to be more intelligent than the average guy who doesn't. As such, they are probably less afraid of \"the unknown\". Remember, it's ignorance that breeds contempt, not knowledge. \n emoticon_xgood", 
   {}, 
   50445, 
   null, 
   1084847340.0
  ], 
  [
   50610, 
   null, 
   "Phunting", 
   "Prove that they follow a religion. Come on, On what bases do they follow?\nIf you read my post 125 to Ghost, I think that spells out why I think atheism counts as a religion.", 
   {}, 
   50571, 
   null, 
   1084879560.0
  ], 
  [
   50613, 
   null, 
   "Phunting", 
   "The Devil what do you think. I thought you were more educated than that.\nAhhh Satan.\n \n Satin is a type of silk.", 
   {}, 
   50570, 
   null, 
   1084880160.0
  ], 
  [
   50714, 
   null, 
   "sglaine", 
   "In the end I see a religion as a system of belief concerning the nature of a higher power.\n \n I feel that atheism is based on belief, as agnosticism is the only real system that doesn't require a leap of faith of one sort or the other.\n \n Of course it has none of the trappings you list, but they are a part of organized religion, not religion itself. To put it another way, what of someone who passionately believes in a God of their own definition. They have no church, no dogma not even a set of clearly defined beliefs, but they believe strongly in what they believe. They are still religious, even though their religion has no real defining characteristics. \n \n Equally I see atheists as in the same position, we can passionately believe in what we believe, take it all on faith without any defined scripture or other trappings. We can use these beliefs to find our place in the universe, to explain why the world works as we see it and to base our actions according to these beliefs. As we can behave in a religious way, then surely by definition we are following a religion.\n \n In the end it is a belief about the nature of God. Why should 'religion' be confined to an affirmative belief as to his nature?\n Where did you come up with that nonsense? You still insist that it shoud be classify as a religion. You just don't get it do you. You can't call a glass of milk a mug of beer. Well that is what you are doing here.", 
   {}, 
   50405, 
   null, 
   1084905360.0
  ], 
  [
   50717, 
   null, 
   "Phunting", 
   "Where did you come up with that nonsense? You still insist that it shoud be classify as a religion. You just don't get it do you. You can't call a glass of milk a mug of beer. Well that is what you are doing here.\nI see. So in response to my points you have decided that instead of actually debating them it would be far more sensible to just call them 'nonsense' and then add an inane analogy, great.\n \n If you don't agree, why don't you actually post an argument to refute my points instead of just making sweeping statements?", 
   {}, 
   50714, 
   null, 
   1084906020.0
  ], 
  [
   50720, 
   null, 
   "Tastyfish", 
   "He is saying that Atheism and other Religions is like calling milk and a selection of beers, drinks. Atheism is as much as a religious choice as anything else, so shouldn't they receive the same protection for choosing to reject religions and mysticism. Shouldn't it also be taught in religous education classes designed to increase awareness of other people's views?", 
   {}, 
   50714, 
   null, 
   1084906200.0
  ], 
  [
   50722, 
   null, 
   "jim's trucking", 
   "\n ...\n \n If you don't agree, why don't you actually post an argument to refute my points instead of just making sweeping statements?\n\n \n You will more likely find irrefutable evidence that the earth is indeed flat.", 
   {}, 
   50717, 
   null, 
   1084906440.0
  ], 
  [
   50728, 
   null, 
   "sglaine", 
   "He is saying that Atheism and other Religions is like calling milk and a selection of beers, drinks. Atheism is as much as a religious choice as anything else, so shouldn't they receive the same protection for choosing to reject religions and mysticism. Shouldn't it also be taught in religous education classes designed to increase awareness of other people's views?\n\n Atheism is not a religion, Clear to the end cut and dry. Jeeeeesus are you that mindless yuppies that want to change the world. You can not say a square is a circle. And that is what you are trying to do here.... emoticon_xangel Yes the Born agains are trying to think again.", 
   {}, 
   50720, 
   null, 
   1084907280.0
  ], 
  [
   50730, 
   null, 
   "JPSartre12", 
   "I see. So in response to my points you have decided that instead of actually debating them it would be far more sensible to just call them 'nonsense' and then add an inane analogy, great.\n \n If you don't agree, why don't you actually post an argument to refute my points instead of just making sweeping statements?\n\n \n Let me try since some seem incapable of engaging in cogent thought. :)\n \n\n In the end I see a religion as a system of belief concerning the nature of a higher power.\n \n I feel that atheism is based on belief, as agnosticism is the only real system that doesn't require a leap of faith of one sort or the other.\n\n I disagree. Atheism is the antithesis of belief. An atheist only \"believes\" what he/she can see, touch, smell or taste. There is NO \"belief\" only proof.\n An agnostic, IMO, is an intellectually vacuous position to hold. Basically, it's \"I have no proof that God exists and I'm not willing to put in the intellectual effort to either prove or disprove his existence. I really don't care.\" \n \n\n Of course it has none of the trappings you list, but they are a part of organized religion, not religion itself. To put it another way, what of someone who passionately believes in a God of their own definition. They have no church, no dogma not even a set of clearly defined beliefs, but they believe strongly in what they believe. They are still religious, even though their religion has no real defining characteristics. \n\n If a person has a \"passionate belief in a God of their own definition\", doesn't that qualify as dogma?:)\n \n \n Equally I see atheists as in the same position, we can passionately believe in what we believe, take it all on faith without any defined scripture or other trappings. We can use these beliefs to find our place in the universe, to explain why the world works as we see it and to base our actions according to these beliefs. As we can behave in a religious way, then surely by definition we are following a religion.\n\n No argument there, except that I would argue your use of the term \"faith\".\n \n\n In the end it is a belief about the nature of God. Why should 'religion' be confined to an affirmative belief as to his nature?\n\n The antithesis of religion is also religion if it is a devoutly held position....... Interesting concept........", 
   {}, 
   50717, 
   null, 
   1084907340.0
  ], 
  [
   50731, 
   null, 
   "Phunting", 
   "You will more likely find irrefutable evidence that the earth is indeed flat.\nUnfortunatly you appear correct.\n \n \n \nAtheism is not a religion, Clear to the end cut and dry. Jeeeeesus are you that mindless yuppies that want to change the world. You can not say a square is a circle. And that is what you are trying to do here.... emoticon_xangel\nOoookay. I think that is my cue to stop debating (if you can call it that!) this with sglaine.", 
   {}, 
   50728, 
   null, 
   1084907580.0
  ], 
  [
   50733, 
   null, 
   "sglaine", 
   "Unfortunatly you appear correct.\n \n \n Ooookay. I think that is my cue to stop debating (if you can call it that!) this with sglaine.\n\n So what you are saying is you can fit a circle in a square. It is not a religiion.", 
   {}, 
   50731, 
   null, 
   1084907700.0
  ], 
  [
   50738, 
   null, 
   "Phunting", 
   "Let me try since some seem incapable of engaging in cogent thought. :)\nAppreciated. It's nice to know that there is still a few people out there capable of rational debate. emoticon_rolleyes \n \n \n \nI disagree. Atheism is the antithesis of belief. An atheist only \"believes\" what he/she can see, touch, smell or taste. There is NO \"belief\" only proof. An agnostic, IMO, is an intellectually vacuous position to hold. Basically, it's \"I have no proof that God exists and I'm not willing to put in the intellectual effort to either prove or disprove his existence. I really don't care.\" \n Admittedly in the most part, yes. However I think you do agnosticism too much discredit. That is the true system that demands proof one way or the other. Atheists believe, without proof, in the non-existence of God.\n \n \n \nIf a person has a \"passionate belief in a God of their own definition\", doesn't that qualify as dogma?:)\nDogma is really a defined set of beliefs or doctrines. What I meant be a 'belief in a God of their own definition' was a belief in a god (or gods), but not in the strict sense as laid down by Christianity/any other religion. More of a innate belief that there is a god, but never going as far to define it.\n \n \n \nNo argument there, except that I would argue your use of the term \"faith\".\nPerhaps 'without proof' instead?\n \n \n \nThe antithesis of religion is also religion if it is a devoutly held position....... Interesting concept........\nThat's what I believe, after all (inane analogy time!) a negative number is still a number.", 
   {}, 
   50730, 
   null, 
   1084908420.0
  ], 
  [
   50742, 
   null, 
   "Phunting", 
   "So what you are saying is you can fit a circle in a square. It is not a religiion.\nNo, what I'm saying is that unless you can spend five minutes and actually form an argument, refute my points or answer my questions instead of continually making unjustified statements I see no point in this 'debate' continuing with you.", 
   {}, 
   50733, 
   null, 
   1084908600.0
  ], 
  [
   50747, 
   null, 
   "sglaine", 
   "No, what I'm saying is that unless you can spend five minutes and actually form an argument, refute my points or answer my questions instead of continually making unjustified statements I see no point in this 'debate' continuing with you.\n\n No pal if it doesn't go your way you are like a little kid have a fit. I bet you are a concervative.", 
   {}, 
   50742, 
   null, 
   1084908960.0
  ], 
  [
   50758, 
   null, 
   "Phunting", 
   "No pal if it doesn't go your way you are like a little kid have a fit.\nHow can it not have gone my way? There has been no bloody argument here for it to go any way at all! All you have done is stated that you don't think it is a religion and provided no justification for your beliefs. So far the only argument I have even heard from you is atheists 'do not go to church they do not partake in religious things'. When I tried to explain that that does not necessarily stop anyone from being religious you didn't respond. I am not having a fit here, but I think I am within my rights to find your attitude exasperating.\n \n \n \nI bet you are a concervative(sic).\nWhat does that have to do with anything? Why do you feel the need to resort to continual stereotyping?", 
   {}, 
   50747, 
   null, 
   1084909500.0
  ], 
  [
   50828, 
   null, 
   "epaphras_faith", 
   "I'm the captain of my ship and when I see something that looks, quacks, and walks like a duck, I am going to label it a duck. IMO, a Christian all too often imagines some unseen entity under the surface of the water is animating and manipulating the object which appears to resemble a duck, making one BELIEVE they are seeing a duck but are actually being fooled, except for, of course, the Christian, who in turn feels compelled to warn everybody about the fake duck. \n \n I am qualified to speak of love because I have received it as well as given it, and I can attest to its greatness in elevating the human spirit. Beyond that, I can't go, and may I be so bold as to say, neither can you. And even bolder yet, I don't want or desire anything beyond that. \n \n \n \n No. I'm not sure how you assumed that. I make no claims like that.\n \n \n \n Again, no. Do you?\n \n \n \n Shades of Job: consider Chapter 40:12 . Great literature, no? You know, I've never presumed to know the answers to the great mystery. It seems as though you do, IMO.\n \n \n \n Because no one else can define it for me. Those that attempt to are charlatans and quacks and have 1-900 phone numbers which one can call at 4 A.M. to be enlightened as to their definition. \n \n May I ask, what are you attempting to strive for that the very act of being a human being isn't enough? Why do you feel you need more, and at what point may we question whether greediness enters the equation?\n\n \n Billsco:\n \n You, as anybody are certainly qualified to speak of love. I did not say you were not. I said you are not qualified to DEFINE love as you cannot see everything. To say that what God did or does is not love is a little like the pot telling the potter that he should have swirled more at the top. \n \n The next part will likely answer the bootfitters tirade as well. God did not create man perfect. In his image, yes, but images are not perfect. They are representations. One would not take a photograph and declare it to be as good as the person. If that were the case, I suspect there would be a large number of men married to Elle McPherson. God created man to be lead. God created man with a need for God. \n \n He did not give man everything he needed to see the future. Why is seeing the future so important. Because to truly love someone we must know what is REALLY for their best, not just the best in the next twenty minutes, but what will benefit them most for a lifetime. Our (humans) view is far too limited to truly discern. It is one of the reasons that dependence on God is the only real way to love. \n \n This is the point I was trying to make. You are quite right to see shades of Job in what I wrote; it is predominantly the point I was making. God can and has defined love. Love, as a concept is quite difficult to define in words (especially in the english language), however, God defined love in a word, Jesus. This is essentially the christian belief. For us to claim that the God of the old testament (which IMO they are one and the same) did not love is saying \"I get to define love and the only one who made all of creation and sees both forward and backward throughout all of time and beyond does not.\"\n \n Does that clarify my point Billsco? I would like to hear your thoughts on it. \n \n Bootfitter, if you can actually claim to be perfect, I think you need to think again. Is there anyone else in this forum that actually claims to be perfect, to never have made a mistake, hurt someone they love, been hurt, acted in anger when they should not have? Bootfitter seems to think this way. I can call someone else flawed simply because I know I am flawed and am not afraid of it. It is not a sign of weakness but a statement of the way things are.", 
   {}, 
   50362, 
   null, 
   1084921320.0
  ], 
  [
   50833, 
   null, 
   "sglaine", 
   "How can it not have gone my way? There has been no bloody argument here for it to go any way at all! All you have done is stated that you don't think it is a religion and provided no justification for your beliefs. So far the only argument I have even heard from you is atheists 'do not go to church they do not partake in religious things'. When I tried to explain that that does not necessarily stop anyone from being religious you didn't respond. I am not having a fit here, but I think I am within my rights to find your attitude exasperating.\n \n \n What does that have to do with anything? Why do you feel the need to resort to continual stereotyping?\n\n Boy you are way off note. Like always . And the reason for stereo typing is because it is a yuppie crazzeee..... Haaa Haaa All of you do it in one shape or form. So don't tell me how perfect you or any body else is because there not.Christins have a religion. Atheist don't. Catholics have a religion Atheist do not. emoticon_xangel emoticon_xangel emoticon_xangel Learn it know it use it. emoticon_xangel emoticon_xangel", 
   {}, 
   50758, 
   null, 
   1084922100.0
  ], 
  [
   50835, 
   null, 
   "epaphras_faith", 
   "Boy you are way off note. Like always . And the reason for stereo typing is because it is a yuppie crazzeee..... Haaa Haaa All of you do it in one shape or form. So don't tell me how perfect you or any body else is because there not.Christins have a religion. Atheist don't. Catholics have a religion Atheist do not. emoticon_xangel emoticon_xangel emoticon_xangel Learn it know it use it. emoticon_xangel emoticon_xangel\n\n \n I have to agree with phunting (perhaps a first). Atheists is not a lack of RELIGION it is a choice to not believe in God. They believe in some things although they will say that they believe in nothing. It is really a very illogical positon to be an atheist.", 
   {}, 
   50833, 
   null, 
   1084922400.0
  ], 
  [
   50836, 
   null, 
   "Waxy", 
   "They believe in some things although they will say that they believe in nothing. It is really a very illogical positon to be an atheist.\n\n \n That statement caught my attention.\n \n Please, expound.\n \n Waxy", 
   {}, 
   50835, 
   null, 
   1084923000.0
  ], 
  [
   50838, 
   null, 
   "sinjin", 
   "I have to agree with phunting (perhaps a first). Atheists is not a lack of RELIGION it is a choice to not believe in God. They believe in some things although they will say that they believe in nothing. It is really a very illogical positon to be an atheist.\n\n \n It's not a choice. If you don't, you don't. For an atheist it isn't like an even money proposition. I don't believe because I can't without some shred of evidence that does not require inference. Please elaborate on how illogical my position is and please do it logically without relying on faith based concepts.", 
   {}, 
   50835, 
   null, 
   1084923120.0
  ], 
  [
   50839, 
   null, 
   "thebootfitter", 
   "Bootfitter, if you can actually claim to be perfect, I think you need to think again. Is there anyone else in this forum that actually claims to be perfect, to never have made a mistake, hurt someone they love, been hurt, acted in anger when they should not have? Bootfitter seems to think this way. I can call someone else flawed simply because I know I am flawed and am not afraid of it. It is not a sign of weakness but a statement of the way things are.\n\n What does it mean to be 'perfect'?\n What does it mean to 'hurt' someone?\n What does it mean to be 'hurt'?\n \n These terms are all subjective. My point is not that I am perfect as in the sense you are thinking of perfect -- as in infallible, never having made a mistake or an error in judgement... or as in never hurting somebody else through my actions. No. My point is that every single individual thing (X) that has ever existed is perfect just as it is. Because that's how X is. It is only when you arbitrarily define X as 'imperfect' that X becomes imperfect. In reality, X has not changed one bit. X is still X. But now YOU are calling X imperfect. Why is X imperfect if God created X as X is? Who are you to judge X to be imperfect?\n \n I'm afraid that your belief that humanity is intrinsically flawed and that's \"a statement of the way things are\" is only your perception. Just as my belief that everything is perfect is just a perception. The way things are is the way things are -- separate from both of our sets of beliefs.\n \n By your logic (\"I can call someone else flawed simply because I know I am flawed and am not afraid of it.\"), could I call someone else blonde, just because I am blonde and I am not afraid of it? Just because you see yourself as flawed does not mean that everyone is flawed. This is faulty logic.", 
   {}, 
   50828, 
   null, 
   1084923180.0
  ], 
  [
   50843, 
   null, 
   "Tastyfish", 
   "All beleifs are illogical if you are getting to the atheism being illogical (disbeleiveing in something where you have no proof defintiely backing up a claim). But with the assumptions you need for everyday living (i.e assuming interactable objects are real and such like) there needs to be some proof to beleive in something. It is an illogical beleif as you are making essentially the same assumptions as a religous person, but as far as the real world goes it would seem to make more sense.", 
   {}, 
   50839, 
   null, 
   1084923780.0
  ], 
  [
   50849, 
   null, 
   "sinjin", 
   "All beleifs are illogical if you are getting to the atheism being illogical (disbeleiveing in something where you have no proof defintiely backing up a claim). But with the assumptions you need for everyday living (i.e assuming interactable objects are real and such like) there needs to be some proof to beleive in something. It is an illogical beleif as you are making essentially the same assumptions as a religous person, but as far as the real world goes it would seem to make more sense.\n\n \n Maybe I'm not getting your point but are you saying you need proof to disbelieve something? I know this has gone round but I can't see atheism as belief when by definition it is an absence of belief. What assumption is necessary to disbelieve?", 
   {}, 
   50843, 
   null, 
   1084924740.0
  ], 
  [
   50852, 
   null, 
   "Tastyfish", 
   "The illogical part is you accept somethings without proof (as ultimately prof is impossible, in the purely phillisophical way), but demand proof for others such as God. Same is really true for any beleif, its really a all beliefs are illogical, but some are more illogical than others", 
   {}, 
   50849, 
   null, 
   1084925040.0
  ], 
  [
   50857, 
   null, 
   "sinjin", 
   "The illogical part is you accept somethings without proof (as ultimately prof is impossible, in the purely phillisophical way), but demand proof for others such as God. Same is really true for any beleif, its really a all beliefs are illogical, but some are more illogical than others\n\n \n So logic demands we must drain Loch Ness or concede the possibility of a plesiosaur being there? I don't recall this sort of equation in my logic class in college. The claim of invisible beings requires those making the claim to pony up not the skeptic.", 
   {}, 
   50852, 
   null, 
   1084925820.0
  ], 
  [
   50859, 
   null, 
   "thebootfitter", 
   "I know this has gone round but I can't see atheism as belief when by definition it is an absence of belief. What assumption is necessary to disbelieve?\n\n Let's consider whether there is a distinction between these two ideas:\n 1) An absence of belief in X\n vs\n 2) A belief in the absence of X\n \n Thoughts, anyone? Is the distinction worth discussing? Ultimately, I would suggest they represent the same concept... though if someone could help me make the distinction more clear, I'm sure I could be convinced otherwise.", 
   {}, 
   50849, 
   null, 
   1084925940.0
  ], 
  [
   50862, 
   null, 
   "Tastyfish", 
   "No logic says that if you want to 'disbeleive' in God you need evidence to disprove it, or at least this is what I imagine the original poster ment by Atheism being an illogical beleif. - you demand proof for God, but not for the computer you are using to type your postings.\n However when we are dealing with realistic proof and the assumptions required for existance then Atheism makes more sense", 
   {}, 
   50857, 
   null, 
   1084926180.0
  ], 
  [
   50863, 
   null, 
   "sinjin", 
   "Let's consider whether there is a distinction between these two ideas:\n 1) An absence of belief in X\n vs\n 2) A belief in the absence of X\n \n Thoughts, anyone? Is the distinction worth discussing? Ultimately, I would suggest they represent the same concept... though if someone could help me make the distinction more clear, I'm sure I could be convinced otherwise.\n\n Very good indeed. Let me chew awhile.", 
   {}, 
   50859, 
   null, 
   1084926600.0
  ], 
  [
   50864, 
   null, 
   "Waxy", 
   "No logic says that if you want to 'disbeleive' in God you need evidence to disprove it, or at least this is what I imagine the original poster ment by Atheism being an illogical beleif. - you demand proof for God, but not for the computer you are using to type your postings.\n However when we are dealing with realistic proof and the assumptions required for existance then Atheism makes more sense\n\n \n While I understand what you're getting at and the logic you're using, I think it's tainted by your perspective, or more correctly perhaps the \"Christian\" perspective.\n \n I try to think of things in a \"ground state\", ie as they first were. In order to need proof for not believing in God, you first have to have the concept  of God.\n \n If you were talking to someone that had no concept of God, or any supernatural being, you wouldn't have to prove that he doesn't exist.\n \n This is getting back into the whole not being able to prove a negative idea. The problem is, there has to be a BELIEF in the negative before there's any reason for it to be disproven, or to express a belief otherwise.\n \n I know that's clear as mud, but hopefully my underlying point got through.\n \n At any rate, even if both are flawed when it comes to the razor edge of logic, I find it hard, no, impossible, to accept someone can feel that Christianity is more logical than atheism.\n \n Waxy\n \n P.S. To mix what is physical (computer) with that which is spritual (God), is a poor defense of belief/logic IMHO.", 
   {}, 
   50862, 
   null, 
   1084926900.0
  ], 
  [
   50868, 
   null, 
   "Tastyfish", 
   "I agree totally, diehard atheist here.\n \n However not sure on the ground state thing, if they have no concept of this it doesn't mean the thing does not exist or that they don't beleive such a thing doesn't exist - the fact a child has never heard of elephants does not stop them existing. Knowledge of the concept of a thing is needed before you can believe it is true or disbelieve it.\n \n However as Atheism is generally a disbelief in god (as if you don't understand the concept of God then you would never have heard of the concept of Atheism - neither exist to you) you are relying on absence of physical proof (you essentailly have a hearsay kind of proof as you have been told he exists) and you are choosing to beleive that this physcial evidence (or absence of it) is dominant over the hearsay evidence (a positive in this case, even if the eventual belief is negative).\n \n I dunno, I can see how Atheism can be shown to be illogical purely on semantics, but I doubt anyone can show a way for religion to be more logical way. Surely to follow the same extremes the religous person would have to beelive everything they are ever told, including when someone tells them that a previous peice of evidence is wrong. The human brain just isn't wired to believe two contradictory things at once (though it copes by ignoring one at a time) in the same way as it is wired to assume what its sense tell it is true (even when they may not be)\n \n But we are geting silly now.", 
   {}, 
   50864, 
   null, 
   1084927920.0
  ], 
  [
   50874, 
   null, 
   "sglaine", 
   "I agree totally, diehard atheist here.\n \n However not sure on the ground state thing, if they have no concept of this it doesn't mean the thing does not exist or that they don't beleive such a thing doesn't exist - the fact a child has never heard of elephants does not stop them existing. Knowledge of the concept of a thing is needed before you can believe it is true or disbelieve it.\n \n However as Atheism is generally a disbelief in god (as if you don't understand the concept of God then you would never have heard of the concept of Atheism - neither exist to you) you are relying on absence of physical proof (you essentailly have a hearsay kind of proof as you have been told he exists) and you are choosing to beleive that this physcial evidence (or absence of it) is dominant over the hearsay evidence (a positive in this case, even if the eventual belief is negative).\n \n I dunno, I can see how Atheism can be shown to be illogical purely on semantics, but I doubt anyone can show a way for religion to be more logical way. Surely to follow the same extremes the religious person would have to believe everything they are ever told, including when someone tells them that a previous peice of evidence is wrong. The human brain just isn't wired to believe two contradictory things at once (though it copes by ignoring one at a time) in the same way as it is wired to assume what its sense tell it is true (even when they may not be)\n \n But we are getting silly now.\n Oh yes Atheist do have a concept they know how foolish Christian's really are the born again types. Atheist are just as smart as you and I. So I feel that what you are saying is if you do not have a religion you don't have a brain. Why should we all be followers of the Christians be like Jimmy Swagged Tammy fay Baker and all of those phony's. And what bring my family to a Catholic service so my child can be molested. I don't think so. I think the Atheist have it together because they can smell a bad thing. I am sorry but I used to be into religion but every thing got twisted with everybody else rendition. So in closing good luck with all of your beleifs because the Atheist are going to come ahead on this one. Yeaaa. emoticon_xangel emoticon_xangel emoticon_xangel And yes I do say Chistians are more of a threat then Atheist.", 
   {}, 
   50868, 
   null, 
   1084929720.0
  ], 
  [
   50883, 
   null, 
   "JPSartre12", 
   "\n Originally Posted by JPSartre12\n ......\n Quote:\n I disagree. Atheism is the antithesis of belief. An atheist only \"believes\" what he/she can see, touch, smell or taste. There is NO \"belief\" only proof. An agnostic, IMO, is an intellectually vacuous position to hold. Basically, it's \"I have no proof that God exists and I'm not willing to put in the intellectual effort to either prove or disprove his existence. I really don't care.\"\n Phunting replied:\n Admittedly in the most part, yes. However I think you do agnosticism too much discredit. That is the true system that demands proof one way or the other. Atheists believe, without proof, in the non-existence of God.\n\n \n I don't look at it that way. It's easy to prove that something exists. It only takes one piece of evidence to prove, but to prove a negative requires one to rule out all else. For example, to prove the existence of a 4 leaf clover only requires one example to prove, but to say that there is no such thing as a 5 leaf clover requires one to examine every clover leaf to prove that the statement is true. Agnostics chose not to look exhaustively for proof or lack of proof. At least Atheists are intellectually honest enough to not hedge and say that since there is no concrete proof, there is no God.\n \n\n JPSartre12 wrote:\n If a person has a \"passionate belief in a God of their own definition\", doesn't that qualify as dogma?\n Phunting replied:\n Dogma is really a defined set of beliefs or doctrines. What I meant be a 'belief in a God of their own definition' was a belief in a god (or gods), but not in the strict sense as laid down by Christianity/any other religion. More of a innate belief that there is a god, but never going as far to define it.\n\n I was playing with the language. Dogma is a set of deeply held beliefs without proof. What you defined met the definition of dogma. :)\n \n \n\n JPSartre12 wrote:\n No argument there, except that I would argue your use of the term \"faith\".\n Phunting replied:\n Perhaps 'without proof' instead?\n\n Better. :)\n \n \n\n JPSartre12 wrote:\n The antithesis of religion is also religion if it is a devoutly held position....... Interesting concept........\n Phunting replied:\n That's what I believe, after all (inane analogy time!) a negative number is still a number.\n\n I think that's an acceptable analogy. \n \n emoticon_xgood", 
   {}, 
   50738, 
   null, 
   1084931880.0
  ], 
  [
   50884, 
   null, 
   "JPSartre12", 
   "How can it not have gone my way? There has been no bloody argument here for it to go any way at all! All you have done is stated that you don't think it is a religion and provided no justification for your beliefs. So far the only argument I have even heard from you is atheists 'do not go to church they do not partake in religious things'. When I tried to explain that that does not necessarily stop anyone from being religious you didn't respond. I am not having a fit here, but I think I am within my rights to find your attitude exasperating......\n\n \n I'm reminded of an old Monty Python skit on the Argument Clinic:\n http://www.duke.edu/~pms5/humor/argument.html\n \n \n :)", 
   {}, 
   50758, 
   null, 
   1084932060.0
  ], 
  [
   50886, 
   null, 
   "JPSartre12", 
   "I have to agree with phunting (perhaps a first). Atheists is not a lack of RELIGION it is a choice to not believe in God. They believe in some things although they will say that they believe in nothing. It is really a very illogical positon to be an atheist.\n\n \n Actually, I think Atheism is the epitomy of a purely logical thought process. We have no proof that God exists, ergo he doesn't exist. To believe in God is to believe in illogical acts :miracles, resurrection, transsubstantiation, Heaven, Hell, etc.\n Religion is one of the only areas of my life in which logic doesn't enter in. I'm a Believer. emoticon_xangel", 
   {}, 
   50835, 
   null, 
   1084932660.0
  ], 
  [
   50931, 
   null, 
   "Phunting", 
   "Sigh. Not really sure why I continue to respond to these, oh well...\n \n \n \nBoy you are way off note. Like always . And the reason for stereo typing is because it is a yuppie crazzeee..... Haaa Haaa All of you do it in one shape or form.\nIf anyone else posted this I would think they were being sarcastic. How can you seriously say that stereotyping is the fault of 'the yuppies', do you not see the contradiction in the statement?\n \n \n \nSo don't tell me how perfect you or any body else is because there not.\nWhere did this come from? I said nothing of the sort.\n \n \n \nChristins(sic) have a religion. Atheist don't. Catholics have a religion Atheist do not. emoticon_xangel emoticon_xangel emoticon_xangel Learn it know it use it. emoticon_xangel emoticon_xangel\nDo you not understand, this is not a valid argument? You just keep on stating your own opinion without anything whatsoever to back it up. You have to give reasons to why you think this way otherwise it is just meaningless.\n \n So for the last bloody time: why don't you classify atheism as a religion?", 
   {}, 
   50833, 
   null, 
   1084969320.0
  ], 
  [
   50932, 
   null, 
   "Phunting", 
   "I have to agree with phunting (perhaps a first).\n Huzzah! There's a first for everything!\n \n ... didn't last long though:\n \n \n \nAtheists is not a lack of RELIGION it is a choice to not believe in God. They believe in some things although they will say that they believe in nothing. It is really a very illogical positon to be an atheist.\nI don't think it is illogical, or at least no more so that an affirmative belief in God. Most proper atheists I think would admit that they do believe in things, it is just the christian stereotype and angry kids who claim to believe in 'nothing'.", 
   {}, 
   50835, 
   null, 
   1084970040.0
  ], 
  [
   50933, 
   null, 
   "Phunting", 
   "I don't look at it that way. It's easy to prove that something exists. It only takes one piece of evidence to prove, but to prove a negative requires one to rule out all else. For example, to prove the existence of a 4 leaf clover only requires one example to prove, but to say that there is no such thing as a 5 leaf clover requires one to examine every clover leaf to prove that the statement is true. Agnostics chose not to look exhaustively for proof or lack of proof. At least Atheists are intellectually honest enough to not hedge and say that since there is no concrete proof, there is no God.\nI totally agree, though I do still feel you are being overly hard on agnosticism. I think it is a fair enough position to say that there are some things that will, and by their very nature can, never be proven.\n \n \n \nI was playing with the language. Dogma is a set of deeply held beliefs without proof. What you defined met the definition of dogma. :)\nI see. Well we are just arguing over semantics here then :)", 
   {}, 
   50883, 
   null, 
   1084970820.0
  ], 
  [
   50934, 
   null, 
   "Phunting", 
   "I'm reminded of an old Monty Python skit on the Argument Clinic:\n http://www.duke.edu/~pms5/humor/argument.html\n \n \n :)\nIsn't it just! With special note to:\n \n Palin: \"An argument is an intellectual process. Contradiction is just the automatic gainsaying of any statement the other person says.\"\n \n Clease: \"No it isn't.\"\n \n If only we could have Flying Thompson's Gazelle of the Yard come along and arrest him!", 
   {}, 
   50884, 
   null, 
   1084971300.0
  ], 
  [
   50943, 
   null, 
   "sglaine", 
   "Sigh. Not really sure why I continue to respond to these, oh well...\n \n \n If anyone else posted this I would think they were being sarcastic. How can you seriously say that stereotyping is the fault of 'the yuppies', do you not see the contradiction in the statement?\n \n \n Where did this come from? I said nothing of the sort.\n \n \n Do you not understand, this is not a valid argument? You just keep on stating your own opinion without anything whatsoever to back it up. You have to give reasons to why you think this way otherwise it is just meaningless.\n \n So for the last bloody time: why don't you classify atheism as a religion?\nOf course it is the falt of the yupppies they think they have a concept but thay are off base. They want change the world they have messed that all up too. Are you a yuppie there pudding? I see that you are tweeked. You see you have your beleifs and I have mine what you say just dont mesh. I thing your on a fair island the way you talk. The botton line is you beleive in what want and I will beleive in what I want. I have scaped the fairy storys out of the bible and sticking how ever with the truth inside the bible. The best of both worlds. Haaaa Haaaa Haaaaa Haaaa. And for the bloodth last time I am going to yopur thick head of yours Atheism does not fall under religion nor does golf fit under as sking. Atheist do not beleive in religion and you fools can not classify some thing that is not classifyable. Understand that will you.", 
   {}, 
   50931, 
   null, 
   1084973880.0
  ], 
  [
   50951, 
   null, 
   "JPSartre12", 
   "I totally agree, though I do still feel you are being overly hard on agnosticism. I think it is a fair enough position to say that there are some things that will, and by their very nature can, never be proven.\n\n \n To me, saying that there are some things that can never be proven, and accepting that position as fact, is the intellectual equivalent of crying \"Uncle\". :)\n \n\n I see. Well we are just arguing over semantics here then :)\n\n A rose by any other name...... :)", 
   {}, 
   50933, 
   null, 
   1084975980.0
  ], 
  [
   50954, 
   null, 
   "JPSartre12", 
   "Of course it is the falt of the yupppies they think they have a concept but thay are off base. They want change the world they have messed that all up too. Are you a yuppie there pudding? I see that you are tweeked. You see you have your beleifs and I have mine what you say just dont mesh. I thing your on a fair island the way you talk. The botton line is you beleive in what want and I will beleive in what I want. I have scaped the fairy storys out of the bible and sticking how ever with the truth inside the bible. The best of both worlds. Haaaa Haaaa Haaaaa Haaaa. And for the bloodth last time I am going to yopur thick head of yours Atheism does not fall under religion nor does golf fit under as sking. Atheist do not beleive in religion and you fools can not classify some thing that is not classifyable. Understand that will you.\n\n \n I know that I'll probably regret it but.........\n First, I don't understand your fixation on the term \"Yuppy\". Do you dislike them for their intelligence, success, money or politics? 25 years ago, I was a young urban professional, but my politics were just to the right of the John Birch Society. Did that still make me a Yuppy in your eyes? emoticon_rolleyes \n Secondly, I find it interesting that you would classify ANY part of the Bible as \"fairy stories\". If you are a true Christian, then you also believe that the Bible IS the word of God. Do you think that God writes children's tales?\n Now, there are parables in the Bible that are used as tools to bring a more concrete understanding of God's more abstract concepts to the masses, many of whom were illiterate and possessed only a rudimentary knowledge of many things, but I'd hardly label these as \"fairy tales\". \n Thirdly, religion, by definition, doesn't require the achnowledgement of a supreme being. Religion has several meanings. For example: \"a cause, principle, or system of beliefs held to with ardor and faith\" as taken from Merriam Webster Online Dictionary. Surely you would concede that Atheism falls under this broader definition of religion, right?\n \n And golf may not fall under the definition of skiing, but both fall under the definition of \"sport\". emoticon_frazzled", 
   {}, 
   50943, 
   null, 
   1084977000.0
  ], 
  [
   50957, 
   null, 
   "Phunting", 
   "Of course it is the falt of the yupppies they think they have a concept but thay are off base. They want change the world they have messed that all up too.\nBut you are just making irrational stereotypes here, surely that is just as bad as when 'yuppies' do it.\n \n \n \nAre you a yuppie there pudding?\nLOL I'm almost tempted to add that to my sig! And no, I'm not a yuppie here sweetie.\n \n \n \nI see that you are tweeked. You see you have your beleifs and I have mine what you say just dont mesh.\nThis is not what annoys me. I fully accept my beliefs are different from the vast majority of people here, and it is for that very reason that I enjoy discussing them. What frustrates me is when my beliefs are just ridiculed without any valid reason, logic or proof.\n \n \n \nI thing your on a fair island the way you talk.\nI am indeed British.\n \n \n \nAnd for the bloodth last time I am going to yopur thick head of yours\nNone of that, thank you.\n \n \n \nAtheism does not fall under religion nor does golf fit under as sking. Atheist do not beleive in religion and you fools can not classify some thing that is not classifyable. Understand that will you.\nWell, no. Because you won't give any reasons for it.", 
   {}, 
   50943, 
   null, 
   1084977780.0
  ], 
  [
   50959, 
   null, 
   "Phunting", 
   "To me, saying that there are some things that can never be proven, and accepting that position as fact,\nI'm not agnostic, yet I fully accept that some things cannot be proven. It may well be possible to disprove the existence of any specific belief, but not the entire possibility of a supreme being.\n \n \n \nis the intellectual equivalent of crying \"Uncle\". :)\nSorry, I don't get the reference.\n \n \n \nA rose by any other name...... :)\nIt would indeed... unless it was called a stinkweed.", 
   {}, 
   50951, 
   null, 
   1084978020.0
  ], 
  [
   50976, 
   null, 
   "billsco", 
   "An agnostic, IMO, is an intellectually vacuous position to hold. Basically, it's \"I have no proof that God exists and I'm not willing to put in the intellectual effort to either prove or disprove his existence. I really don't care.\" \n \n \n\n \n Hi JP, \n \n I'm actually an agnostic, but for shorthand reasons I've simply gone to calling myself atheist rather than getting bogged down in the definition and not discussing the substance.\n \n IMO, agnosticism is simply the truest position a person can possess. Your five-leaf clover example will suffice. We can never be expected to examine every last clover stalk on the earth, and every other hospitable planet in the universe, before becoming five-leaf clover atheists. But one certainly can be agnostic about it after an exhaustive search reveals no such thing. It also does not preclude the fact that some odd mutation is not at this very moment, or some time in the future, producing one. For that reason, agnosticism becomes a honest conclusion. Certainly not a vacuous one, which is another reason I will sometimes define myself as an atheist. I don't want people assuming I'm riding fences and too lazy to get down.\n \n You would make a fine agnostic. I hope you continue exploring.\n \n regards", 
   {}, 
   50730, 
   null, 
   1084983060.0
  ], 
  [
   51006, 
   null, 
   "thebootfitter", 
   "IMO, agnosticism is simply the truest position a person can possess. Your five-leaf clover example will suffice. We can never be expected to examine every last clover stalk on the earth, and every other hospitable planet in the universe, before becoming five-leaf clover atheists. But one certainly can be agnostic about it after an exhaustive search reveals no such thing. It also does not preclude the fact that some odd mutation is not at this very moment, or some time in the future, producing one. For that reason, agnosticism becomes a honest conclusion. Certainly not a vacuous one, which is another reason I will sometimes define myself as an atheist. I don't want people assuming I'm riding fences and too lazy to get down.\n \n\n Very well said. There is no proof of the existence of any God or gods. Even the most faithful Christian cannot KNOW with certainty that God exists in reality, apart from the mind/spirit of the individual. The only evidence any individual can offer for the existence of a God or gods is personal experience -- which is by its very nature, subjective. The individual mind can make any experience mean just about anything. (One person's suffering could be another person's joy.)\n \n It is fine to believe in a God or gods. But belief is not knowledge. It is faith. As such, there is no proof. Once there is 'proof' (or substantial evidence in reality with no evidence to the contrary), then it no longer takes faith to believe something.\n \n I'm not certain if I would fall under the category of agnostic... I personally believe that God exists. I have had personal experiences that are enough to indicate to me that God is real (though the actual God that exists may be distinct from what I am able to comprehend this God to be). HOWEVER, I recognize that currently, we do not have any proof or even substantial evidence in reality that there is a God or gods. Perhaps we never will have this evidence in the realm that we occupy. Perhaps we will.", 
   {}, 
   50976, 
   null, 
   1084989000.0
  ], 
  [
   51011, 
   null, 
   "Waxy", 
   "I agree totally, diehard atheist here.\n \n However not sure on the ground state thing, if they have no concept of this it doesn't mean the thing does not exist or that they don't beleive such a thing doesn't exist - the fact a child has never heard of elephants does not stop them existing. Knowledge of the concept of a thing is needed before you can believe it is true or disbelieve it.\n\n \n Very true. \n \n \nHowever as Atheism is generally a disbelief in god (as if you don't understand the concept of God then you would never have heard of the concept of Atheism - neither exist to you) you are relying on absence of physical proof (you essentailly have a hearsay kind of proof as you have been told he exists) and you are choosing to beleive that this physcial evidence (or absence of it) is dominant over the hearsay evidence (a positive in this case, even if the eventual belief is negative).\n\n \n I guess that's where my \"ground state\" idea comes in. If there is no God, or there was no concept of God, then Atheism would not exist. Therefore, I view atheism as being \"first\", or the ground state.\n \n \nSurely to follow the same extremes the religous person would have to beelive everything they are ever told, including when someone tells them that a previous peice of evidence is wrong. The human brain just isn't wired to believe two contradictory things at once (though it copes by ignoring one at a time) in the same way as it is wired to assume what its sense tell it is true (even when they may not be)\n\n \n This is one of, if not THE, biggest \"problem\" I have with believers - the use of logic and reason only when it fits their agenda, and then falling back onto faith whenever the going gets tough.\n \n I actually have more respect for someone that says \"I believe in the Bible and feel no need to justify that belief in any way.\" than someone that tries to justify or support their belief in God and the Bible using science and logic.\n \n Waxy", 
   {}, 
   50868, 
   null, 
   1084989960.0
  ], 
  [
   51023, 
   null, 
   "JPSartre12", 
   "I'm not agnostic, yet I fully accept that some things cannot be proven. It may well be possible to disprove the existence of any specific belief, but not the entire possibility of a supreme being.\n\n I guess that the problem I have with Agnostics is that the ones that I've been exposed to hold that position out of apathy, not conviction, hence the quote below:\n \n\n Quote:\n is the intellectual equivalent of crying \"Uncle\". \n Phunting replied:\n Sorry, I don't get the reference.\n\n \n Crying \"Uncle\" is a uniquely American expression meaning: to give up, concede, plead for mercy, ask for quarter, etc.,\n http://www.quinion.com/words/qa/qa-say1.htm\n \n In other words, I see Agnosticism as vacuous because I don't see them trying to find an answer to the question \"Is there a God?\". Instead, I see Agnosticism as \"who cares if there is or isn't?\" Like I said, I haven't run across too many agnostics. I guess you could say that I'm surrounded by Christianity. emoticon_xangel", 
   {}, 
   50959, 
   null, 
   1084992720.0
  ], 
  [
   51026, 
   null, 
   "billsco", 
   "\n I said you are not qualified to DEFINE love as you cannot see everything. To say that what God did or does is not love is a little like the pot telling the potter that he should have swirled more at the top. \n\n \n EF,\n \n I understand what you are saying, thank you for your fuller response. Unfortunately I don't believe I can agree with you. Is it your contention we cannot define anything unless we are omniscient? Would that defense work at my murder trial if I went on a spree? Since we can't see everything, I could contend that we don't properly know the definition of murder and whether it wasn't for the best.\n \n I think I can define love, its three broad meanings: between two people, between friends and family, and with humanity and nature in general. I have numerous problems with God's actions in the O.T. and N.T. as they relate to love, and I have, in effect, put him on trial. As a prosecutor, I most definitely would be pressing the issue that not only should the pot have been more swirled at the top, but it should have been made without the holes in the bottom. You, as the defense attorney, can only respond that I have no business claiming to know what a pot should look like. \n \n \n\n \n He did not give man everything he needed to see the future. Why is seeing the future so important. Because to truly love someone we must know what is REALLY for their best, not just the best in the next twenty minutes, but what will benefit them most for a lifetime. Our (humans) view is far too limited to truly discern. It is one of the reasons that dependence on God is the only real way to love. \n\n \n I know when my wife comes home from work today, I'll happily sit with her on the porch outside listening to how her day was, and later we'll enjoy a quiet meal together and we'll probably plan our weekend. I know at every step what I've done is best for her, because I love her now. What happens in twenty years is beyond us, but if I'm gone I hope the memory of quiet spring evenings with her husband fill her with peace. \n \n To interject another entity into the equation only detracts from the attention we can give each other, IMO. And he's constantly asking for more and more of it. \n \n regards", 
   {}, 
   50828, 
   null, 
   1084993200.0
  ], 
  [
   51029, 
   null, 
   "Phunting", 
   "I guess that the problem I have with Agnostics is that the ones that I've been exposed to hold that position out of apathy, not conviction, hence the quote below:\nI see. Although in my experience it has been the other way around, that the ones who are really just apathetic call themselves atheists because they have never looked into the subject to hear or understand agnosticism. I do see your point, and there are many who do take this disinterest. However they exist in all branches of religion, and while atheism/agnosticism may be stereotyped as having more than the usual, that does not mean those who strongly and intelligently hold these beliefs are less validated.\n \n \n \nCrying \"Uncle\" is a uniquely American expression meaning: to give up, concede, plead for mercy, ask for quarter, etc.,\n http://www.quinion.com/words/qa/qa-say1.htm\nInteresting. Being a Brit I'd never heard it before. Strange that the origin is unknown, and I've had thought for the Latin theory to be true it would have shown up in English 'English' as well. We truly are 'two nations divided by a common language'.", 
   {}, 
   51023, 
   null, 
   1084993320.0
  ], 
  [
   51122, 
   null, 
   "sglaine", 
   "I know that I'll probably regret it but.........\n First, I don't understand your fixation on the term \"Yuppy\". Do you dislike them for their intelligence, success, money or politics? 25 years ago, I was a young urban professional, but my politics were just to the right of the John Birch Society. Did that still make me a Yuppy in your eyes? emoticon_rolleyes \n Secondly, I find it interesting that you would classify ANY part of the Bible as \"fairy stories\". If you are a true Christian, then you also believe that the Bible IS the word of God. Do you think that God writes children's tales?\n Now, there are parables in the Bible that are used as tools to bring a more concrete understanding of God's more abstract concepts to the masses, many of whom were illiterate and possessed only a rudimentary knowledge of many things, but I'd hardly label these as \"fairy tales\". \n Thirdly, religion, by definition, doesn't require the achnowledgement of a supreme being. Religion has several meanings. For example: \"a cause, principle, or system of beliefs held to with ardor and faith\" as taken from Merriam Webster Online Dictionary. Surely you would concede that Atheism falls under this broader definition of religion, right?\n \n And golf may not fall under the definition of skiing, but both fall under the definition of \"sport\". emoticon_frazzled\n\n I dislike yuppie for there common sense. They like have none. You see I am like an old farmer if you get what I mean. We are an old New England breed. I also think that this world is going at a too fast of paste. And theory it will distroy us. I did ask the guys that work for us about Atheism today 1/2 them agreed with you guy's and the other half said they agreed with my theory. I do like the old style church & there beliefs but they are few & far between now adays. I will tell you this if my daughter wants to go to church I let her but it is not my cup of coffee if you get my point and she does go from time to time.", 
   {}, 
   50954, 
   null, 
   1085011500.0
  ], 
  [
   51214, 
   null, 
   "JPSartre12", 
   "I dislike yuppie for there common sense. They like have none. \n\n Not ONE Yuppie has any common sense?\n \n\n You see I am like an old farmer if you get what I mean. We are an old New England breed. \n\n Ah, I see. A descendant of Salen, Mass. no doubt. :)\n \n\n I also think that this world is going at a too fast of paste. And theory it will distroy us. \n \n Only if we eat too much of it. :)\n \n\n I did ask the guys that work for us about Atheism today 1/2 them agreed with you guy's and the other half said they agreed with my theory. I do like the old style church & there beliefs but they are few & far between now adays. I will tell you this if my daughter wants to go to church I let her but it is not my cup of coffee if you get my point and she does go from time to time.\n\n So, let me get this straight. You long for simpler days and e a more Puritanical Church, but you don't want to be a member of the congregation. Does that about sum up your position?\n \n \n ;)", 
   {}, 
   51122, 
   null, 
   1085025060.0
  ], 
  [
   51288, 
   null, 
   "sglaine", 
   "emoticon_xbye [QUOTE=JPSartre12]Not ONE Yuppie has any common sense?\n Not very many do you fit?\n Ah, I see. A descendant of Salen, Mass. no doubt. :)\n Sorry but not even close pal. As far as a descentdant of Salam, Mass I thought your family is from there.So, let me get this straight. You long for simpler days and e a more Puritanical Church, but you don't want to be a member of the congregation. Does that about sum up your position?\n \n No long for lodgacal days not simpler days and lodgacal has been throwen out the window and yes I am a memember of a congregation and I do a lot for my church but I do not attend services. I[I] am not into getting up and start danceing in church. I'm sorry but I don't think God or Jesus did that.", 
   {}, 
   51214, 
   null, 
   1085064000.0
  ], 
  [
   51396, 
   null, 
   "epaphras_faith", 
   "EF,\n \n I understand what you are saying, thank you for your fuller response. Unfortunately I don't believe I can agree with you. Is it your contention we cannot define anything unless we are omniscient? Would that defense work at my murder trial if I went on a spree? Since we can't see everything, I could contend that we don't properly know the definition of murder and whether it wasn't for the best.\n \n I think I can define love, its three broad meanings: between two people, between friends and family, and with humanity and nature in general. I have numerous problems with God's actions in the O.T. and N.T. as they relate to love, and I have, in effect, put him on trial. As a prosecutor, I most definitely would be pressing the issue that not only should the pot have been more swirled at the top, but it should have been made without the holes in the bottom. You, as the defense attorney, can only respond that I have no business claiming to know what a pot should look like. \n \n \n \n I know when my wife comes home from work today, I'll happily sit with her on the porch outside listening to how her day was, and later we'll enjoy a quiet meal together and we'll probably plan our weekend. I know at every step what I've done is best for her, because I love her now. What happens in twenty years is beyond us, but if I'm gone I hope the memory of quiet spring evenings with her husband fill her with peace. \n \n To interject another entity into the equation only detracts from the attention we can give each other, IMO. And he's constantly asking for more and more of it. \n \n regards\n\n \n Billsco: Thanks for a thoughtful response. It is not my contention that we cannot define anything without being omniscient. However, where love is concerned....\n \n For example, to use the example of you with your wife. You are quite correct that you are indeed loving her by listening to her day. You cannot know what is in the future and the \"loving now\" is EXTREMELY important. However, we were discussing whether or not things that God did as stated in the old testament are love or not love. I don't see how you or I could define that. I did not bring another entity into it.\n \n Were you not the one who said you did not believe that God was a loving God, if he existed because of the things that the old testament attributes to him. If you are (and I apologize if I am wrong on this, not posting often sometimes muddies my thinking) then you are the one who brought the outside being into it. Additionally, I am not arguing for or against the existence of God merely that it is illogical, if we assume his existence, for you or I to tell God what love is.", 
   {}, 
   51026, 
   null, 
   1085095620.0
  ], 
  [
   51442, 
   null, 
   "JPSartre12", 
   "[QUOTE=sglaine]emoticon_xbye \nNot ONE Yuppie has any common sense?\n Not very many do you fit?\n Ah, I see. A descendant of Salen, Mass. no doubt. :)\n Sorry but not even close pal. As far as a descentdant of Salam, Mass I thought your family is from there.\n \n So, let me get this straight. You long for simpler days and e a more Puritanical Church, but you don't want to be a member of the congregation. Does that about sum up your position?\n \n No long for lodgacal days not simpler days and lodgacal has been throwen out the window and yes I am a memember of a congregation and I do a lot for my church but I do not attend services. I[I] am not into getting up and start danceing in church. I'm sorry but I don't think God or Jesus did that.\n\n \n At 47, I doubt that I qualify as a Yuppie. :)\n \n No, my first relative in the \"New World\" came over as an indentured servant from Scotland in the mid 1700's. \n Hum...dancing in Church......are you a Southern Baptist? We Catholics are way to formal to dance in church. Many of us can hardly stay awake. emoticon_xangel", 
   {}, 
   51288, 
   null, 
   1085100960.0
  ], 
  [
   51450, 
   null, 
   "sglaine", 
   "At 47, I doubt that I qualify as a Yuppie. :)\n \n No, my first relative in the \"New World\" came over as an indentured servant from Scotland in the mid 1700's. \n Hum...dancing in Church......are you a Southern Baptist? We Catholics are way to formal to dance in church. Many of us can hardly stay awake. emoticon_xangel\n\n I rest my case. Dancing (IMO) is not for religion. and no I am not a southern baptist. Did you forget I said I was from New England. I do not see any thing wrong with dancing at a church dance just during the service. I hate to tell you but yuppies are in different age groups these days.", 
   {}, 
   51442, 
   null, 
   1085102340.0
  ], 
  [
   51483, 
   null, 
   "JPSartre12", 
   "I rest my case. Dancing (IMO) is not for religion. and no I am not a southern baptist. Did you forget I said I was from New England. \n\n You don't have to be in the South to be a Southern Baptist.\n \n\n I do not see any thing wrong with dancing at a church dance just during the service. I hate to tell you but yuppies are in different age groups these days.\n\n \n Really? Then tell me what the Y in Yuppie stands for? \n emoticon_confused", 
   {}, 
   51450, 
   null, 
   1085112120.0
  ], 
  [
   51893, 
   null, 
   "billsco", 
   "Were you not the one who said you did not believe that God was a loving God, if he existed because of the things that the old testament attributes to him. If you are (and I apologize if I am wrong on this, not posting often sometimes muddies my thinking) then you are the one who brought the outside being into it. .\n\n \n EF,\n \n No, I don't believe it was me. I understand how you may get confused with postings -- different threads, infrequent visits and looking for a job -- but we weren't exploring that topic here.\n \n \n\n Additionally, I am not arguing for or against the existence of God merely that it is illogical, if we assume his existence, for you or I to tell God what love is.\n\n \n You're correct in your statement. It's the assumption I have trouble with.", 
   {}, 
   51396, 
   null, 
   1085317860.0
  ], 
  [
   52042, 
   null, 
   "epaphras_faith", 
   "EF,\n \n No, I don't believe it was me. I understand how you may get confused with postings -- different threads, infrequent visits and looking for a job -- but we weren't exploring that topic here.\n \n \n \n \n \n You're correct in your statement. It's the assumption I have trouble with.\n\n \n Sorry about the confusion. My bad emoticon_emb", 
   {}, 
   51893, 
   null, 
   1085436900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Atheists - America's greatest threat?", 
  "url": "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 2274, 
  "discussion_files": [
   [
    "14742.html", 
    "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat-print.html"
   ], 
   [
    "14743.html", 
    "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat-13-print.html"
   ], 
   [
    "14744.html", 
    "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat-12-print.html"
   ], 
   [
    "14745.html", 
    "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat-10-print.html"
   ], 
   [
    "14746.html", 
    "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat-8-print.html"
   ], 
   [
    "14747.html", 
    "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat-6-print.html"
   ], 
   [
    "14748.html", 
    "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat-4-print.html"
   ], 
   [
    "14749.html", 
    "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat-5-print.html"
   ], 
   [
    "14750.html", 
    "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat-7-print.html"
   ], 
   [
    "14751.html", 
    "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat-9-print.html"
   ], 
   [
    "14752.html", 
    "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat-11-print.html"
   ], 
   [
    "14753.html", 
    "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat-3-print.html"
   ], 
   [
    "14754.html", 
    "http://www.4forums.com/political/religion-debates/2274-atheists-americas-greatest-threat-2-print.html"
   ]
  ], 
  "identifier": 2274
 }
]