[
 [
  [
   2213, 
   null, 
   "gilligan8503", 
   "i am agnostic not atheist, but its close enough for close minded people to understand: \n \n bottom line is, the bible was written by MAN, not god \n \n i think the bible is a great book, its teachings are great but so are just about EVERY other religion \n \n back in the ice age, the humans of this earth had no doubt that this earth was controlled by the rain god, the sun god, the moon god, etc. \n \n back in ancient greece, we had no doubt that the gods were zeus, aphridite, ares, etc. \n \n now, we have no doubt that we are ruled by a being called \"God\". \n \n we as humans on this earth are stupid, stupid in the way that we know not of what is going on aorund us. religion was made so that we humans would not feel frightened and alone in this universe. people cannot grasp that after we die, we rot in the ground. we cannot even imagine non existence. \n \n i used to be a christian, but when i was 12, i realized i was only talking to myself and began to research. i found out many things and if you want to contine this discussion, my aim account is: gilligan8503 \n \n do not let media or anyone else tell you what to believe. QUESTION YOURSELF AND YOUR RELIGION. do not be afraid. suck it up and live your life as best you can.", 
   {
    "post_info": {
     "post_title": "from ape to adam? (my view)"
    }
   }, 
   null, 
   null, 
   1045355880.0
  ], 
  [
   2216, 
   null, 
   "sarablaze", 
   "WHOA, WELL Welcome Gilligan! lol\n I use to think that god was like a grown up's santa clause.\n If you are good and you happen to die this year you will go to heaven. That was then.\n Im a very spiritual person, and if you believe there is a god, ......this is very hard to put into words,but Ill try.\n \n I base my whole life upon the principals of god, and doing the next right thing. \n \nwe as humans on this earth are stupid, stupid in the way that we know not of what is going on aorund us. religion was made so that we humans would not feel frightened and alone in this universe. people cannot grasp that after we die, we rot in the ground. we cannot even imagine non existence.\n \n I see what you were trying to start say about confusing common sense, with a myth.\n But what a myth is to you, isn't a myth to others. Some people go on common sense, some people go with there hearts, and some people go with what they have enormous faith in. \n All of the above are not stupid! \n So dont say that they are!\n I go on common sense, but what I have faith in means to much to me to just push aside entirely.", 
   {}, 
   2213, 
   null, 
   1045357200.0
  ], 
  [
   2217, 
   null, 
   "Calligirl", 
   "gilligan:\n Are we talking about evolution here...or the existence of God? You might want to move your debate to the \"Religion\" forum. Otherwise, here are some comments on your statements:\n \n \ni am agnostic not atheist, but its close enough for close minded people to understand\n\n \n Oh, I get it. So you believe, but you don't exactly \"believe\".\n \n \nbottom line is, the bible was written by MAN, not god\n\n \n Written by man, INSPIRED by God.\n \n \ni think the bible is a great book, its teachings are great but so are just about EVERY other religion\n\n \n Oh really, so blowing yourself and a bunch of other innocent people up in the name of Allah is a \"great teaching\"?\n \n \nnow, we have no doubt that we are ruled by a being called \"God\".\n\n \n Define \"we\". I personally believe in God, but that doesn't mean everybody else does too.\n \n \nwe as humans on this earth are stupid, stupid in the way that we know not of what is going on aorund us. religion was made so that we humans would not feel frightened and alone in this universe. people cannot grasp that after we die, we rot in the ground. we cannot even imagine non existence.\n \n \n Yes, that is true. Our bodies rot in the ground but our SOULS go to either heaven or hell, take your pick.\n \n \ni used to be a christian, but when i was 12, i realized i was only talking to myself and began to research. i found out many things and if you want to contine this discussion, my aim account is: gilligan8503\n\n \n What happened?! You were sooooo close. That's sad that you thought you were only \"talking to yourself\". What did you find out? That you had no hope in life and that what you do here on earth doesn't matter 'cause you're \"just gonna rot in the grave anyhow\"? I don't have aim. Sorry.\n \n \ndo not let media or anyone else tell you what to believe. QUESTION YOURSELF AND YOUR RELIGION. do not be afraid. suck it up and live your life as best you can.\n\n \n I do question my religion (daily)! But that is why I am such a strong Christian. The media is atheist, and many of my friends are atheist. Your comment therefore says that I shouldn't let my friends tell me that there is no God. Thanx for the advice!", 
   {}, 
   2213, 
   null, 
   1045358940.0
  ], 
  [
   2333, 
   null, 
   "gilligan8503", 
   "thank you for the welcome and here is my rebutle:\n \n \nAre we talking about evolution here...or the existence of God? You might want to move your debate to the \"Religion\" forum. Otherwise, here are some comments on your statements:\n\n \n hint: the forum is CREATIONISM VS EVOLUTION, therefore, i am picking my side...you just happen to choose the other.\n \n \nOh, I get it. So you believe, but you don't exactly \"believe\".\n\n \n ah, confusion. agbostic roughly means \"not sure\". i look at the viewpoint of \"anything could be\" so there could quite possibly be a higher power. agnostics are the only ones who believe there is no proof.\n \n \nWritten by man, INSPIRED by God.\n\n \n and so it is said in the bible...try not to prove things using the bible...its very redundant.\n \n \n \nnow, we have no doubt that we are ruled by a being called \"God\".\n \n \n we are in the world, true not everyone believes in a higher power, but the majority of the world does...what is it 90% of the worlds population?\n \n \nYes, that is true. Our bodies rot in the ground but our SOULS go to either heaven or hell, take your pick.\n \n \n this is your opinion...\n \n \nWhat happened?! You were sooooo close. That's sad that you thought you were only \"talking to yourself\". What did you find out? That you had no hope in life and that what you do here on earth doesn't matter 'cause you're \"just gonna rot in the grave anyhow\"? I don't have aim. Sorry.\n \n \n what happened? i opened my eyes. and yes, i am afraid to die and i believe that you should also.\n \n \nI do question my religion (daily)! But that is why I am such a strong Christian. The media is atheist, and many of my friends are atheist. Your comment therefore says that I shouldn't let my friends tell me that there is no God. Thanx for the advice!\n \n \n you are welcome, i believe faith is a good thing for someone to have and i envy you. ignorance is bliss. but let me point something out to you; another word for faith is hope. you hope there is a god", 
   {}, 
   2213, 
   null, 
   1045435860.0
  ], 
  [
   2339, 
   null, 
   "sarablaze", 
   "I believe in theistic evolution myself.\n Well, okay........ let's say there is no god.\n I see where you are coming from.\n Science is what you believe and have faith in.\n The creature that crawled from the water, LOL.\n Who gave that being life?", 
   {}, 
   2213, 
   null, 
   1045439400.0
  ], 
  [
   2348, 
   null, 
   "gilligan8503", 
   "theistic evolutionists are the smarts from the creationist debate; you ahould not disreguard facts just because it conflicts your beliefs, accept the truth.\n \n although i hope you do not take the bible as all truth (even if you do believe in god).\n \n you do know that the bible was wrtten over many years, was gathered together, and debated over in a room full of MEN. these men then decided on what should and should not be in the bible (they also edited many MANY letters). if man is corrupt now, think of how corrupt they were then.\n \n i respect religious people, but only if they know what they are talking about (like sara).\n \n again, be open-minded on how you look at religion, dont take the bible as full proof, just believe in a higher power.", 
   {}, 
   2213, 
   null, 
   1045441500.0
  ], 
  [
   2355, 
   null, 
   "sarablaze", 
   "Im not disregaurding facts. Facts and beliefs can coexsist. The bible (to me) is a book of the principals, of God. It says in the bible, Im not sure about the exact wording, but it says something like : If you do not believe in god all the way, you dont believe in him at all. The stunads that terrorized this country took this from the bible and ran with it. They basically said \" America is too free! They should force their people toward their God like we do! If they do not accept it kill em' \"\n I don't take it literally like that, but I do hold a strong belief, that common sense, and doing the right thing, can coexsist like I said.\n Back to my question gilligan, What gave that creature life?", 
   {}, 
   2213, 
   null, 
   1045444020.0
  ], 
  [
   2390, 
   null, 
   "gilligan8503", 
   "who is to say you cant \"do the right thing\" without being religious. i am considered a nice, easy-going, optimistic person by my peers and i am not a religious person. the 10 commandments are common since, they did NOT have to be written down for people to grasp the concept of whats right and whats wrong. i mean for god's sake (no pun intended), a child can distinguish the difference between right and wrong. i am not religious and i am a good person; i know many people who have been brought up atheist and their families are most generous.\n again, i am not bashing the bible, i am merely stating that one must not live by this piece of literature to be happy. i see religion as a waste of time and money. if i were to worship at all, i would NEVER go to church (don't let me get started on churches).\n \n back to your question:\n i dont quite understand what you are asking but ill take a shot.\n who am i to know? who are you to know? who is anyone to know?\n niether you nor me nor anyone else on this planet knows for a fact where we come from. everything is theory and myth.\n we may never know i i can tell you that i my liftime we will never come close.", 
   {}, 
   2213, 
   null, 
   1045452780.0
  ], 
  [
   2408, 
   null, 
   "sarablaze", 
   "I don't considr myself a religous person at all. I am a spiritual person. I know the commandments did not need to be written down, but even with them written down, we still have people twisting them into what they want them to be, and still doind the wrong things.\n Some XXXXXX, need that to be written down. (sorry an ex-boyfriend comes to mind) LOL\n Religion isn't a waste of time, if it is what some people want to do to be happy or feel secure thats fine to me.\n I know it sounds like a fairy tale ending to you when I say this, but I believe that God gave the creature life. I know it is not common sense. \n I am a spiritual person so my views are different. See I choose to have a higher power in my life, because, knowing everyday that there is someone or something out there with more power than me, who can controls things, keeps me humble grateful and on the right track. The fact that this higher power loves me and wants to see me succeed, and leaves it all up to me, is just a plus, and a reason for me to pass on the love. I know now I sound like a religous hippie to you, lol, but that is the opposit of what I am.\n thats ok though.\n Second question, what came first the chicken or the egg?\n My answer ( The chicken, cause god cant lay eggs) lol\n god or some other powerful being, because humans did not create themselves.", 
   {}, 
   2213, 
   null, 
   1045472940.0
  ], 
  [
   2420, 
   null, 
   "gilligan8503", 
   "i hate lies. in general even, i despise it when people lie. so why lie to myself to feel better? why keep telling myself that there IS a higher power and if i do right, ill be rewarded with heaven? i would rather go through life afraid to die and know the \"truth\", rather than pray, go to church, and make myself believe there is a \"God\".\n if lying to yourself makes you feel better, go for it. i call that a compulsive liar. and on top of that, you tell yourself this lie so much, you are willing to bleive in it. that is why some people believe in a hgiher power; its because they have been told to repeatedly by their guardians.\n \n answer to question:\n why ask me this? its almost the same as the \"creature out of the water\" question. i dont know, and neither do you. but if you want my opinion, id have to say the egg.", 
   {}, 
   2213, 
   null, 
   1045508700.0
  ], 
  [
   2422, 
   null, 
   "fallingupwards", 
   "i hate lies too. but i believe that i am living a lie by not believing in God. looking around, i KNOW that a God exists. i can sense it. i am lying to myself by saying that there is no God. so it goes both ways....\n \n gilligan, it doesnt matter if you believe if the chicken or the egg came first. my question is, who created it? who created the first egg? was it merely by chance? i doubt it.", 
   {}, 
   2213, 
   null, 
   1045517640.0
  ], 
  [
   2434, 
   null, 
   "sarablaze", 
   "It was a medaphor. The chicken gave life to the egg. The egg didn't just appear as falling tried to say. I believe that if you commit suicide, you will not go to heaven (as it kind of says in the bible), because you have destroyed the greatest gift you have recieved, and taken it for granted.\n God forgives. Why do you think so many people who commited a horrible crime rehabilitate and do good. If it is a lie, then I still don't see the harm in lying to myself, to be happy. Other people can do what they want, it doesn't bother me.", 
   {}, 
   2213, 
   null, 
   1045528680.0
  ], 
  [
   2482, 
   null, 
   "gilligan8503", 
   "falling:\n you KNOW that god exists? really...what do YOU know that no one else does?\n \n why did i replay with \"egg\"? i know it just didnt appear, i was stating that the chickne started with an egg.\n look at it this way: millions of years ago there was an animal closly related to a chicken. this animal is known to have laid eggs. this creature lays a special egg that is somewhat different but somewhat the same; evolution. it doesnt happen as instant as this but i just put it in a way you would understand. the egg wasnt \"just created\" nor did it \"just appear\", but i can tell you that i strongly believe that it was not design.\n \n sara:\n i know it was a rhetorical question but i just answered it opposite of you. truthful, i dont know and neither do you and both was a 50/50 chanse; one of us is right.\n \n you believe that if you kill yourself you go straight to hell just because it says so in the bible? wow, then everyone is going to hell; it says so in the bible.\n do you lie? yes, then you are off to hell.\n are there gay christians? yes, off to hell you go.\n do you (or at least have you) masturbate(d)? yes, again, off to hell you go.\n of course, if you stop lying to yourself (as you said you have been), whats the harm? *sigh* some people do not and will not ever understand; why bother explaining, and its too hard to explain through words (and im tired, its late).\n do what you want to be happy, i just dont have to lie to myself to be happy. be happy that you are alive, live life day by day, set goals, have fun, socialize, do somethign groundbreaking, leave your mark in history, change the world, better yopurself, better others. unless, of course, youd rather look to your demise and live according to the strict rules of the bible, talk to yourself daily, donate YOUR money to the church, and read out of a book you loathe to (i know you dont enjoy it, few do). you dont have to live your life depending on god. depend on yourself and yourself alone. existentialism. please read up on that.", 
   {}, 
   2213, 
   null, 
   1045552860.0
  ], 
  [
   2483, 
   null, 
   "sarablaze", 
   "The stuff in the bible is n't rules, and I do believe the PRINCIPALS in the bible. I don't believe that suicide thing because it is in the bible. I believe it because, if there is a GOD, that was the biggest gift he has given me-<my life, and by undoing that, I think that \n would be the biggest thing to upset him.\n \n I don't believe that if you are gay you are going to hell.\n Or that if you have dirty thoughts you are going to hell.\n Or that if you do anything that isn't god like you are going to hell. \n \n I am not a religous person, and do not go to church. I am a spiritual person as I said before there's a difference!\n I just happened to read the bible, and agree with it's principals, and I have to tell ya, youre getting me steamed man!!!!\n Either you are not comprehending me or just not listening!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", 
   {}, 
   2213, 
   null, 
   1045553820.0
  ], 
  [
   2492, 
   null, 
   "gilligan8503", 
   "wow, the impact words have on a person.\n \n how do you know that your life is his most precious gift? have you thought that maybe earth is hell? or that earth could be purgatory (sp?)? or that earth is a test to get into heaven. how is life a gift when 80 years is NOTHING compaired to eternity?\n \n ok well tell me this: you read the bible and agree with its principles right? you do realize almost every religion has those same principles.\n i am not twisting your words nor am i NOT LISTENING; i am but explaining it as if i were to a child and at the same time add more information.", 
   {}, 
   2213, 
   null, 
   1045578720.0
  ], 
  [
   2493, 
   null, 
   "gilligan8503", 
   "p.s.: i dont mean to upset anyone, it just seems that way. it is very hard to express myself through random thoughts on a computer screen; it is so much easier to be face to face.", 
   {}, 
   2213, 
   null, 
   1045578900.0
  ], 
  [
   2514, 
   null, 
   "sarablaze", 
   "I agree. email me sometime and we'll chat off of here maybe you can convince me or I will....I mean I can convince you!;)", 
   {}, 
   2213, 
   null, 
   1045605900.0
  ], 
  [
   2536, 
   null, 
   "gilligan8503", 
   "well im glad you choose to listen rather than just talk. i respect that. if it seemed like i wasnt listening, i have probably heard that argument before (i get in these discussions constantly at my school). anyways, i would liek to continue this conversation but there is a catch, i dont give out my email address online...but i will give my aim name: gilligan8503\n if you dont have aim thats ok, if we are ever on at the same time i can message you through this forum.\n ill listen if you listen and im all ears.", 
   {}, 
   2213, 
   null, 
   1045623600.0
  ], 
  [
   2647, 
   null, 
   "Calligirl", 
   "why did i replay with \"egg\"? i know it just didnt appear, i was stating that the chickne started with an egg. look at it this way: millions of years ago there was an animal closly related to a chicken. this animal is known to have laid eggs. this creature lays a special egg that is somewhat different but somewhat the same; evolution. it doesnt happen as instant as this but i just put it in a way you would understand. the egg wasnt \"just created\" nor did it \"just appear\", but i can tell you that i strongly believe that it was not design.\n \n \n It is not possible for any animal to lay an egg that is \"somewhat different but somewhat the same\". DNA just doesn't work that way. If evolution is possible, then why don't we see any examples of it today? Shouldn't everything still be evolving? \n \n \nyou believe that if you kill yourself you go straight to hell just because it says so in the bible? wow, then everyone is going to hell; it says so in the bible. do you lie? yes, then you are off to hell. are there gay christians? yes, off to hell you go. do you (or at least have you) masturbate(d)? yes, again, off to hell you go.\n\n \n I believe that you will go to hell if you commit suicide. It does not say in the Bible that you will go to hell for lying. (Where is your reference?) You cannot be a Christian and be gay at the same time. That goes completely against scripture. You don't go to hell for masturbating! (Once again, reference please.)\n \n \ndo what you want to be happy, i just dont have to lie to myself to be happy. be happy that you are alive, live life day by day, set goals, have fun, socialize, do somethign groundbreaking, leave your mark in history, change the world, better yopurself, better others. unless, of course, youd rather look to your demise and live according to the strict rules of the bible, talk to yourself daily, donate YOUR money to the church, and read out of a book you loathe to (i know you dont enjoy it, few do). you dont have to live your life depending on god. depend on yourself and yourself alone. existentialism. please read up on that.\n\n \n Why would you be lying to yourself if you were a Christian? I could not be happy if I knew that when I died, all that I was going to do would be to rot in the ground. Yes, I proudly live according to the strict rules of the Bible, talk to GOD daily, donate God's money to the church (10% of my earnings belong to God anyway), and read out of a book that I absolutely love. I do depend on God, he is the one who gives me hope for the future. (Instead of a rotting casket.)", 
   {}, 
   2213, 
   null, 
   1045797960.0
  ], 
  [
   2656, 
   null, 
   "lurch", 
   "It is not possible for any animal to lay an egg that is \"somewhat different but somewhat the same\".\n\n Yes it is. Otherwise you would be exactly the same as your parents.\n \n \nDNA just doesn't work that way.\n\n \n Yes it does. It works exactly that way. Studies have shown that everyone has an average of about 100 mutations that make them \"somewhat different\" than their parents.\n \n \nIf evolution is possible, then why don't we see any examples of it today?\n\n \n We do. Why is it that you have to have a flu shot every year. In fact, in 1997 avian influenze (bird flu) jumped species in Hong Kong. Before that the human immune system quite efficiently prevented humans from catching the virus. In 1997 18 people contracted bird flu and 6 died. The reason there weren't more is because the Hong Kong government slaughtered every domestic bird on the island and thus removed the reservoir. They were unsuccessful though. There were further outbreaks in 2001 and 2002. Last month there were two confirmed cases - one died. Two others are suspected and one of those died. They were all members of the same family. So now it appears that the disease has taken another step and no longer requires a reservoir in birds. It appears that it can now be passed from human to human. That is evolution.\n \n \nShouldn't everything still be evolving?\n\n \n Everything is. You just don't have the time to watch it happen.", 
   {}, 
   2213, 
   null, 
   1045799820.0
  ], 
  [
   2659, 
   null, 
   "gilligan8503", 
   "callgirl:\n \nI believe that you will go to hell if you commit suicide. It does not say in the Bible that you will go to hell for lying. (Where is your reference?) You cannot be a Christian and be gay at the same time. That goes completely against scripture. You don't go to hell for masturbating! (Once again, reference please.)\n \n \n it states in the bible if you sin you go to hell...and everyone sins. if you dont believe this, than you cant possible believe that gays go to hell, otherwise you are contradicting yourself, like the bible.\n \n \nWhy would you be lying to yourself if you were a Christian? I could not be happy if I knew that when I died, all that I was going to do would be to rot in the ground. Yes, I proudly live according to the strict rules of the Bible, talk to GOD daily, donate God's money to the church (10% of my earnings belong to God anyway), and read out of a book that I absolutely love. I do depend on God, he is the one who gives me hope for the future. (Instead of a rotting casket.)\n \n \n can we say 'brainwash'? well, im sorry, but this is what media and society brings upon you and me and everyone. coulkd this be false hope you are feeling? i think so.\n i will restate from one of my previous posts; i do fear death; this you do have an 'advantage' over me.\n \n and again, read up on existentialism.\n \n lurch:\n very informative, you took the words out of my mouth but explained it so much betetr than i would have.", 
   {}, 
   2213, 
   null, 
   1045801740.0
  ], 
  [
   2662, 
   null, 
   "Calligirl", 
   "Yes it is. Otherwise you would be exactly the same as your parents.\n\n \n My point was that, for example, I don't have 2 extra ears on my forehead. I am still a human being.\n \n \nYes it does. It works exactly that way. Studies have shown that everyone has an average of about 100 mutations that make them \"somewhat different\" than their parents.\n\n \n Once again, just because I'm \"different\" doesn't mean that I have 2 extra ears because my parents' egg just decided to change one day. I am still a human being, not a different specie.\n \n \nWe do. Why is it that you have to have a flu shot every year. In fact, in 1997 avian influenze (bird flu) jumped species in Hong Kong. Before that the human immune system quite efficiently prevented humans from catching the virus. In 1997 18 people contracted bird flu and 6 died. The reason there weren't more is because the Hong Kong government slaughtered every domestic bird on the island and thus removed the reservoir. They were unsuccessful though. There were further outbreaks in 2001 and 2002. Last month there were two confirmed cases - one died. Two others are suspected and one of those died. They were all members of the same family. So now it appears that the disease has taken another step and no longer requires a reservoir in birds. It appears that it can now be passed from human to human. That is evolution.\n\n \n I'm not talking about evolving viruses, I'm talking about evolving SPECIES.\n \n \nEverything is. You just don't have the time to watch it happen.\n\n \n Well, evolution says that everything evolved over \"millions of years\", correct? Let's say it takes a certain species 1 million years to evolve. That means that every 100 years of its \"evolving process\" we should be able to see 1,000 mutations! In the last 100 years, what SPECIES have we seen evolve 1,000 times? (Into an entirely new species, no less.)\n \n \nit states in the bible if you sin you go to hell...and everyone sins. if you dont believe this, than you cant possible believe that gays go to hell, otherwise you are contradicting yourself, like the bible.\n\n \n Have you read my \"signature\" lately? By asking God for forgiveness of your sins, asking him to come into your heart and govern your life, and following His commandments, you don't have to go to hell. Everyone is a sinner...it's whether or not you ask God for FORGIVENESS and decide to CHANGE that gets you into heaven. Yes, gays go to hell. They sin and do not change their sinful ways or ask for forgiveness.\n \n \ncan we say 'brainwash'? well, im sorry, but this is what media and society brings upon you and me and everyone. coulkd this be false hope you are feeling? i think so. i will restate from one of my previous posts; i do fear death; this you do have an 'advantage' over me.\n\n \n The media and society is extremely atheist. This is not a false hope; if it were, I would not be a Christian. Well maybe that \"advantage\" could come to good use in one of these debates.:) You don't have to fear death, through God's grace you can accept it and go to the place that he has prepared for his believers! He loves you soooooo much! He sent His son to DIE for you on the cross. Think about that.", 
   {}, 
   2213, 
   null, 
   1045803600.0
  ], 
  [
   2664, 
   null, 
   "Calligirl", 
   "Oh yeah, as per your request that I read up on existentialism (they come up with better and better names everyday, don't they?). Sounds pretty hopeless to me. Let's see if I can summarize their beliefs:\n \n We are just going to rot when we die, period.\n Nothing in this world makes sense.\n Life is just a bunch of choices.\n \n Does that just about cover everything?", 
   {}, 
   2213, 
   null, 
   1045804380.0
  ], 
  [
   2669, 
   null, 
   "Karl", 
   "Originally posted by Calligirl \n \n Well, evolution says that everything evolved over \"millions of years\", correct?\n \n Ummmmm, no, evolution is the accumulation and selection of favorable traits. In many cases it takes millions of years, in others not. Would you liike to learn about it?\n \n Let's say it takes a certain species 1 million years to evolve. That means that every 100 years of its \"evolving process\" we should be able to see 1,000 mutations!\n \n That projects human rates on other organisms, as you can see in the database of genome size the human genome is pretty middle of the road in terms of size. Since most mutations would have no effect, so what if there are 1000? \n \n\n In the last 100 years, what SPECIES have we seen evolve 1,000 times? (Into an entirely new species, no less.)\n \n \n More than you think, obviously.\n Scruffy little weed shows Darwin was right as evolution moves on", 
   {}, 
   2213, 
   null, 
   1045811640.0
  ], 
  [
   2678, 
   null, 
   "gilligan8503", 
   "Have you read my \"signature\" lately? By asking God for forgiveness of your sins, asking him to come into your heart and govern your life, and following His commandments, you don't have to go to hell. Everyone is a sinner...it's whether or not you ask God for FORGIVENESS and decide to CHANGE that gets you into heaven. Yes, gays go to hell. They sin and do not change their sinful ways or ask for forgiveness.\n\n \n so if right now, i ask god for forgivness, someone kills me, i will go to heaven by default? makes sense to me, i mean, i dont have time to sin...\n \n \nThe media and society is extremely atheist. This is not a false hope; if it were, I would not be a Christian. Well maybe that \"advantage\" could come to good use in one of these debates. You don't have to fear death, through God's grace you can accept it and go to the place that he has prepared for his believers! He loves you soooooo much! He sent His son to DIE for you on the cross. Think about that.\n\n \n im not sure about the media and society being atheist. i know for a fact that about 97% of the world believes in a higher power; i am the minority. and about the media, at least where i am located, the media is christian (i live in tennessee, where religion is common place and churches are on every block).\n \n calligirl:\n one word\n \"idividualism\"\n YOU choose, YOU decide; not some higher power.", 
   {}, 
   2213, 
   null, 
   1045839420.0
  ], 
  [
   2696, 
   null, 
   "lurch", 
   "My point was that, for example, I don't have 2 extra ears on my forehead. I am still a human being.\n\n If that was your point then why didn't you say so? I thought you were denying that every organism was slightly different than its parents. You see, you once claimed that you had studied evolution, didn't you? Or was that someone else. You certainly don't demonstrate any knowledge of the topic.\n \n So now you are raising a straw man argument. You see, evolutionary theory denies that it is possible for anyone to be born with 2 extra ears on his forhead. You are not arguing against the theory of evolution. You are arguing against a cartoon version.\n \nOnce again, just because I'm \"different\" doesn't mean that I have 2 extra ears because my parents' egg just decided to change one day. I am still a human being, not a different specie.\n\n But evolutionary theory doesn't claim that species arise in a single generation. How does it make your point to argue against claims that evolutionary biologists don't make? In fact, is it honest to misrepresent evolutionary theory?\n \n \nI'm not talking about evolving viruses, I'm talking about evolving SPECIES.\n\n \n Well, ok. You're wrong because evolving viruses are examples of evolution, as are bacteria and the new strains that have become resistant to antibiotics. But if you want some examples I'll give three. I certainly hope that you have the courtesy to read them and actually think about them.\n \n \nWell, evolution says that everything evolved over \"millions of years\", correct?\n\n Not necessarily.\n \nLet's say it takes a certain species 1 million years to evolve. That means that every 100 years of its \"evolving process\" we should be able to see 1,000 mutations! In the last 100 years, what SPECIES have we seen evolve 1,000 times? (Into an entirely new species, no less.)\n\n Possibly its because you don't understand the mechanisms and how they work that you equate evolution with the formation of new species. Evolution has to do with populations - not necessarily species.\n \n Example 1: Apples are native to Europe and were introduced by settlers to North America. In the early 1800s, apples were introduced to Ohio, where they did quite well. However, around 1850 the Ohio apple crops began to be infested with worms - maggots actually. Investigation of the source seems to be the hawthorn maggot fly. However, the hawthorn maggot fly and the apple maggot fly have different breeding seasons that have the effect of reproductively isolating each population from the other. It is unknown (but probably possible) that they could interbreed if they became sexually mature at the same time of year, it has not been observed and they always prefer the plant on which they were born - apple or hawthorn. Since 1850 similar new populations of maggot fly have infested cherries and pears.\n \n Example 2: Brown bears have a very large range around the northern hemisphere. DNA studies have shown that they are genetically quite similar with only slight differences. However, the brown bears of the Admiralty, Baranof and Chichagof islands show significant differencts, although they are still able to interbreed with other brown bears, and in fact look like other brown bears. But genetically, the brown bears of the ABC islands are more closely similar to the polar bear than to other brown bears. In addition to the double layered white fur (actually colorless), polar bears have several characteristics of the head, teeth, ears, neck, limbs, and feet that are different from brown bears. And yet, polar bears are universally recognized as a separate species that is reproductively isolated from the brown bears. But in zoos, they will interbreed freely with any of the subspecies of brown bear and produce fertile offspring.\n \n Example 3: Herring gulls (Larus argentatus) and lesser black-backed gulls (Larus fuscus) share a common range in northern Europe and Great Britain. They are separate species and do not congregate together and rarely interbreed, even in captivity. The herring gull ranges to the west out to the islands of the North Atlantic to Iceland and southern Greenland to North America. They can be found across North America to Alaska and into Siberia. As one gets farther and farther away from Europe, the birds begin to accumulate slight differences in appearance, but the entire population is continuous and constantly interbreeding with surrounding populations. If you cross Siberia and northern Asia and arrive back in Europe, you will find that even though you followed the herring gull to the west, you would be arrive back in Europe studying the lesser black-backed gull. It seems that they are a single large population whose geographical extremes have accumulates so many slight differences that they are, for all practical purposes, a separate species.\n \n Now if you want to discuss evolution, please don't invent straw man examples of things that evolutionary biologists don't claim. To argue against real evolutionary theory is one thing. To invent a cartoon and represent it as evolutionary biology is dishonest.", 
   {}, 
   2213, 
   null, 
   1045858380.0
  ], 
  [
   3016, 
   null, 
   "Crim", 
   "It is not possible for any animal to lay an egg that is \"somewhat different but somewhat the same\". DNA just doesn't work that way. \n \n \n So you're a perfect clone of one your parents with zero copying errors? Amazing.\n \n \nI believe that you will go to hell if you commit suicide. It does not say in the Bible that you will go to hell for lying. (Where is your reference?)\n \n \n You would go to hell for having sins. Since lying is a sin, it would be a hell-worthy offense.\n \n \nYou cannot be a Christian and be gay at the same time. \n \n \n Why not?\n \n \nIf evolution is possible, then why don't we see any examples of it today? Shouldn't everything still be evolving? \n \n \n We do. I don't have any tonsils. Some people have AIDS immunity.\n \n \n \nI'm not talking about evolving viruses, I'm talking about evolving SPECIES.\n \n \n Speciation is a confirmed event. You'll have to move the goalposts again.\n \n \nYes, gays go to hell. They sin and do not change their sinful ways or ask for forgiveness.\n \n \n How do you know if homosexuals are asking for forgiveness or not? Do you know them all?", 
   {}, 
   2213, 
   null, 
   1046054460.0
  ], 
  [
   3036, 
   null, 
   "Calligirl", 
   "gilligan:\n \n \nso if right now, i ask god for forgivness, someone kills me, i will go to heaven by default? makes sense to me, i mean, i dont have time to sin...\n\n \n I don't get what you mean by \"default\"...but yes, if you ask for forgiveness right now (honestly--and God knows your heart's intentions) and someone kills you, you will go to heaven.\n \n \nim not sure about the media and society being atheist. i know for a fact that about 97% of the world believes in a higher power; i am the minority. and about the media, at least where i am located, the media is christian (i live in tennessee, where religion is common place and churches are on every block).\n\n \n The media and society are definitely atheist. How many TV shows or news shows have you seen which mention God? (Not a \"god\" but THE God.) Maybe you should try one of those churches near you. Churches are hard to find in my area.\n \n \n\n calligirl:\n one word\n \"idividualism\"\n YOU choose, YOU decide; not some higher power.\n\n \n Wait just a minute...I thought you were an \"existentialist\"?! Know you are an \"individualist\"?! This is getting confusing. :) I CHOOSE--to believe in Christ, I DECIDE--to follow His commands. I have a free will just like you. I don't HAVE TO follow him, I CHOOSE TO.\n \n Crim:\n \n \nSo you're a perfect clone of one your parents with zero copying errors? Amazing.\n\n \n Well, I haven't mutated into some other species last time I checked.\n \n \nYou would go to hell for having sins. Since lying is a sin, it would be a hell-worthy offense.\n\n \n You go to hell when you do not ask for FORGIVENESS from your sins and ask Christ to govern your life and help you to stop sinning. I am still a sinner, but I am forgiven and I ask Christ daily to help me with my fleshly desires.\n \n \nWhy not?\n\n \n Leviticus 18:22 \"Do not lie with a man as one lies with a woman; that is detestable.\"\n \n 1 Corinthians 6:9 \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders.\"\n \n \nWe do. I don't have any tonsils. Some people have AIDS immunity.\n\n \n When you give birth to a child without tonsils, let me know. When AIDs immune people give birth to children with an immunity to AIDs, let me know.\n \n \nSpeciation is a confirmed event. You'll have to move the goalposts again.\n\n \n Nope, hasn't been confirmed yet. That news article that lurch gave me was pretty pathetic. I went to the website for the organization where the guy had found the supposed \"new species\". Guess what? No listing could be found. How sad.\n \n lurch:\n \n \nSo now you are raising a straw man argument. You see, evolutionary theory denies that it is possible for anyone to be born with 2 extra ears on his forhead. You are not arguing against the theory of evolution. You are arguing against a cartoon version.\n\n \n I was simply trying to explain it in terms you could understand. Obviously that didn't work. Okay, let's say that I give birth to a child without tonsils. Does that mean that my child's children aren't going to have tonsils? No! I will repeat, DNA doesn't work that way. That is why, even if an egg is layed that is \"different\" but \"the same\", that bird (inside the egg) couldn't have offspring with every one of them possesing its different traits. Not possible.\n \n \nBut evolutionary theory doesn't claim that species arise in a single generation. How does it make your point to argue against claims that evolutionary biologists don't make? In fact, is it honest to misrepresent evolutionary theory?\n\n \n I'm not saying that species arise in a single generation. You misunderstood my point. See the statement above for the explanation.\n \n \nNot necessarily.\n\n \n Every evolutionary paper I've read says that. Do you believe differently?\n \n \nPossibly its because you don't understand the mechanisms and how they work that you equate evolution with the formation of new species. Evolution has to do with populations - not necessarily species.\n\n \n The apples are still apples. The bears are still bears. The gulls are still gulls. Evolution says that we came from monkeys. I'd say that's a bit of a species jump.\n \n Everyone:\n Could you perhaps make your statements a little bit shorter please? It's hard enough debating four people at once.", 
   {}, 
   2213, 
   null, 
   1046060760.0
  ], 
  [
   3041, 
   null, 
   "Crim", 
   "The media and society are definitely atheist. How many TV shows or news shows have you seen which mention God? (Not a \"god\" but THE God.)\n \n \n Ummm, about 100x the amount of shows which mention atheism.\n \n \nWell, I haven't mutated into some other species last time I checked.\n \n \n You said organisms weren't born that were slightly different yet the same. That was incorrect.\n \n \nLeviticus 18:22 \"Do not lie with a man as one lies with a woman; that is detestable.\"\n \n \n So? In your religion's view, everyone sins. Their sin is no greater or more unforgiveable than yours.\n \n \nWhen you give birth to a child without tonsils, let me know.\n \n \n Kinda hard, since I'm male.\n \n \nWhen AIDs immune people give birth to children with an immunity to AIDs, let me know.\n \n \n Ok, I'm letting you know.\n \n \nNope, hasn't been confirmed yet.\n \n \n http://www.talkorigins.org/faqs/faq-speciation.html \n \n \nI was simply trying to explain it in terms you could understand. Obviously that didn't work. Okay, let's say that I give birth to a child without tonsils. Does that mean that my child's children aren't going to have tonsils? No! I will repeat, DNA doesn't work that way. That is why, even if an egg is layed that is \"different\" but \"the same\", that bird (inside the egg) couldn't have offspring with every one of them possesing its different traits. Not possible.\n \n \n The 3rd gen organisms wouldn't necessarily have the new trait (it could be recessive), but the gene would propogate.", 
   {}, 
   2213, 
   null, 
   1046061600.0
  ], 
  [
   3044, 
   null, 
   "Calligirl", 
   "Ummm, about 100x the amount of shows which mention atheism.\n\n \n Name one. BTW, nobody mentions atheism...they just don't give God credit for anything.\n \n \nYou said organisms weren't born that were slightly different yet the same. That was incorrect.\n\n \n Aaaahhhhh!!!!!!! None of you seem to understand my meaning (or you don't read my posts). Let's skip this example before I go crazy.\n \n \nSo? In your religion's view, everyone sins. Their sin is no greater or more unforgiveable than yours.\n\n \n Where in my posts have I said that my sins are \"more forgivable\" then other peoples? If I don't ask for forgiveness I go to hell. If anyone else doesn't ask for forgiveness they go to hell. Comprendes?\n \n \nKinda hard, since I'm male.\n\n \n When the female you reproduce with has children without tonsils, let me know. How was I supposed to know that you were male? \"Crim\" doesn't sound like a gender specific screen name to me. Calligirl, on the other hand, is kinda obvious. \n \n \nOk, I'm letting you know.\n\n \n Source please?\n \n \nhttp://www.talkorigins.org/faqs/faq-speciation.html\n\n \n Sorry but the link won't work. (I'm not kidding, it won't work.)\n \n \nThe 3rd gen organisms wouldn't necessarily have the new trait (it could be recessive), but the gene would propogate.\n\n \n Not if it's a mutation or an acquired trait.", 
   {}, 
   2213, 
   null, 
   1046062560.0
  ], 
  [
   3047, 
   null, 
   "Crim", 
   "Name one. BTW, nobody mentions atheism...they just don't give God credit for anything.\n \n \n Any of the CBN shows like the 700 Club.\n Plenty of channels on Sunday mornings.\n \n And why should shows be giving god credit for anything? \n \n \nWhere in my posts have I said that my sins are \"more forgivable\" then other peoples? If I don't ask for forgiveness I go to hell. If anyone else doesn't ask for forgiveness they go to hell. Comprendes?\n \n \n You said all homosexuals were going to hell. Your reason was because homosexual acts were sins. I pointed out that all people sin.\n \n \n(regarding AIDS immunity) Source please?\n \n \n Do a google search on the CCR-5 gene mutation.\n \n \nSorry but the link won't work. (I'm not kidding, it won't work.)\n \n \n Try this:http://www.talkorigins.org/faqs/speciation.html \n \n \nNot if it's a mutation or an acquired trait.\n \n \n Why wouldn't it?", 
   {}, 
   2213, 
   null, 
   1046063100.0
  ], 
  [
   3054, 
   null, 
   "Calligirl", 
   "Any of the CBN shows like the 700 Club.\n Plenty of channels on Sunday mornings. And why should shows be giving god credit for anything?\n\n \n Oh yeah, like the televangelist shows. :) Come on, get real. Maybe they should give God credit for things because He is omnipotent and omnipresent. Maybe because He created us to love Him and serve Him. Maybe because He has blessed America in so many ways!\n \n \nYou said all homosexuals were going to hell. Your reason was because homosexual acts were sins. I pointed out that all people sin.\n\n \n They go to hell because they do not ask for forgiveness from their sins. Anyone who asks for forgiveness and changes will not go to hell. They do not want to change their sinful ways. (How many times to I have to repeat myself?)\n \n \nDo a google search on the CCR-5 gene mutation.\n\n \n I'm lazy and debating 3 other people. Why don't you do it for me?\n \n \nTry this:http://www.talkorigins.org/faqs/speciation.html\n\n \n I tried the link and it took me to http://www.weeeeeeee.com/ \n \n (I think my computer is having problems. :) )\n \n \nWhy wouldn't it?\n\n \n Ever heard of the \"mouse experiment\"? This freak scientist cut off the tails of mice and then bred them together. The offspring had normal size tails. He tried this millions (exagerating) of times with the same results. Acquired traits cannot be passed down from generation to generation.", 
   {}, 
   2213, 
   null, 
   1046063820.0
  ], 
  [
   3062, 
   null, 
   "Crim", 
   "Oh yeah, like the televangelist shows. Come on, get real.\n \n \n You asked for one. I supplied it. If you'd like to present an example of a show being explicitely atheist, please do so.\n \n \nMaybe they should give God credit for things because He is omnipotent and omnipresent. Maybe because He created us to love Him and serve Him. Maybe because He has blessed America in so many ways!\n \n \n I see no reason why secular shows should be required to mention your mythology.\n \n \nThey go to hell because they do not ask for forgiveness from their sins. Anyone who asks for forgiveness and changes will not go to hell. They do not want to change their sinful ways. (How many times to I have to repeat myself?)\n \n \n And HOW do you know that homosexuals don't repent?\n \n \nI'm lazy and debating 3 other people. Why don't you do it for me?\n \n \n Because I don't feel like copying and pasting articles into a forum when they can be easily accessed online. But for a quick summary: The CCR-5 gene mutation is present in about 15% of caucasians, with 1% having the homogeneous version. These 1% are completely immune. The heterogeneous people possess some immunity.\n \n \nI tried the link and it took me to \n \n \n Do a google search for 'observed speciation events'. Those links should be the first two results.\n \n \nEver heard of the \"mouse experiment\"? This freak scientist cut off the tails of mice and then bred them together. The offspring had normal size tails. He tried this millions (exagerating) of times with the same results. Acquired traits cannot be passed down from generation to generation.\n \n \n That's basically the dumbest experiment I've ever heard. Cutting off a mouse's tail wouldn't affect its DNA, so the offspring would still have tails.", 
   {}, 
   2213, 
   null, 
   1046064840.0
  ], 
  [
   3068, 
   null, 
   "Calligirl", 
   "You asked for one. I supplied it. If you'd like to present an example of a show being explicitely atheist, please do so.\n\n \n Animal Planet, Discovery Chanel, NOVA, etc.\n \n \nI see no reason why secular shows should be required to mention your mythology.\n\n \n I just gave you three.\n \n \nAnd HOW do you know that homosexuals don't repent?\n\n \n If they had repented, they wouldn't be homosexuals any longer.\n \n Crim:\n I'm going to have to reply to your other statements later. Gotta go!", 
   {}, 
   2213, 
   null, 
   1046065320.0
  ], 
  [
   3070, 
   null, 
   "Crim", 
   "Animal Planet, Discovery Chanel, NOVA, etc.\n \n \n They're explicitely atheist?\n Wow, I didn't realize those channels had a lot of shows about \"hey, there's no god\".\n \n \nI just gave you three.\n \n \n Read what I said again.\n \n \nIf they had repented, they wouldn't be homosexuals any longer.\n \n \n Why not?", 
   {}, 
   2213, 
   null, 
   1046065440.0
  ], 
  [
   3158, 
   null, 
   "Calligirl", 
   "They're explicitely atheist? Wow, I didn't realize those channels had a lot of shows about \"hey, there's no god\".\n\n \n Oops, sorry! I was thinking about it and realized that they aren't atheist, they are humanist. (Or at least they try to be.)\n \n \nRead what I said again.\n\n \n I didn't see the word \"secular\". But if they are humanist (which they try to be), shouldn't they mention every \"god\"? I never heard them mentioning God using evolution as a possibility for the existence of man.\n \n \nWhy not?\n\n \n Because they would not be performing homosexual acts any longer. \n \n homosexual:of, relating to, or characterized by a tendency to direct sexual desire toward another of the same sex\n \n God takes away wrongful desires. Therefore, someone who was previously \"homosexual\" would not be considered \"homosexual\" anymore.", 
   {}, 
   2213, 
   null, 
   1046144400.0
  ], 
  [
   3189, 
   null, 
   "thistownwilleat", 
   "God doesn't take away sinful desires. You've never had sinful desires? I know I have. People assume that when you become a Christian some manner of shield gets put up around you and shields you from \"worldly\" things. I believe that's wrong, I actually believe that life as a Christian is very hard. We often pawn it off as the end of our troubles to \"convert\" people. I don't believe it.", 
   {}, 
   2213, 
   null, 
   1046153400.0
  ], 
  [
   3201, 
   null, 
   "Crim", 
   "Oops, sorry! I was thinking about it and realized that they aren't atheist, they are humanist. (Or at least they try to be.)\n \n \n They're not humanist, they're scientific.\n \n \nBecause they would not be performing homosexual acts any longer. \n \n \n So you've never repeated a sin?", 
   {}, 
   2213, 
   null, 
   1046159160.0
  ], 
  [
   3253, 
   null, 
   "Calligirl", 
   "God doesn't take away sinful desires. You've never had sinful desires? I know I have. People assume that when you become a Christian some manner of shield gets put up around you and shields you from \"worldly\" things. I believe that's wrong, I actually believe that life as a Christian is very hard. We often pawn it off as the end of our troubles to \"convert\" people. I don't believe it.\n\n \n Yes, God does take away sinful desires. (If you ask Him.) I'm not saying that it doesn't take any work on your part, though. When you have a sinful desire, you allow a thought to become more than just a stray idea. You foster and encourage the thought and it becomes a desire. God takes away the desires, helps you deal with your \"stray thoughts\", and shows you how to keep them from becoming desires. \n \n \nThey're not humanist, they're scientific.\n\n \n That all depends on what your definition of science is. (Different debate.)\n \n \nSo you've never repeated a sin?\n\n \n Let's put it this way, if they \"repeat their sin\" but honestly ask Christ to forgive them and to help them not to repeat it, then they are not \"homosexual\". If you are constantly having sex with the same sex and then asking for forgiveness, you are not a true Christian. You are trying to tell me that the desire for the opposite sex is some kind of \"accident\". \"Well, what if they didn't mean to have sex...\" That doesn't work, you have to be truly sorry and then MAKE AN EFFORT to stop.", 
   {}, 
   2213, 
   null, 
   1046223480.0
  ], 
  [
   3255, 
   null, 
   "Crim", 
   "If you are constantly having sex with the same sex and then asking for forgiveness, you are not a true Christian. \n \n \n I disagree.\n \n Additionally, there is a difference between being homosexual and committing sodomy.", 
   {}, 
   2213, 
   null, 
   1046225340.0
  ], 
  [
   3277, 
   null, 
   "Calligirl", 
   "I disagree. Additionally, there is a difference between being homosexual and committing sodomy.\n\n \n Would you like to continue this debate in a Religion forum? (We're sorta getting off topic here. :) )", 
   {}, 
   2213, 
   null, 
   1046230680.0
  ], 
  [
   3316, 
   null, 
   "Crim", 
   "I don't particularily care.\n It's not all that interesting.", 
   {}, 
   2213, 
   null, 
   1046241300.0
  ], 
  [
   3543, 
   null, 
   "gilligan8503", 
   "im sorry, not to offend callgirl, but your understanding of forgivness is very childish. so far, you believe if you sin and then right after, you ask for forgivness, you are saved.\n \n ok, so then domer (the cereal killer) is in heaven right now; he forgived all the families he broke up through the longest confession ever written in judicial history. he even became a born-again christian. same thing with son of sam; he is a born-again christian...it seems like you can get away with murder (no pun intended) in dealing with god.", 
   {}, 
   2213, 
   null, 
   1046468820.0
  ], 
  [
   3577, 
   null, 
   "Calligirl", 
   "im sorry, not to offend callgirl, but your understanding of forgivness is very childish. so far, you believe if you sin and then right after, you ask for forgivness, you are saved.\n\n \n You're obviously either not listening to what I am saying or not wanting to understand it. Okay, I'm going to explain it one more time. Here's how it goes:\n \n 1.) Everyone's a sinner. No matter what. We all have sinful desires. Period.\n \n 2.) Christ died for us on the cross so that we wouldn't have to sacrifice animals anymore. He came as the ultimate sacrifice for our sins.\n \n 3.) If you want to be saved, all you have to do is ask Christ to come into your heart, ask Him to govern your thoughts, conscience, actions, etc., and ask Him to forgive you when you sin.\n \n 4.) Then when you sin, all you have to do is (HONESTLY) ask for forgiveness.\n \n \n \n \nok, so then domer (the cereal killer) is in heaven right now; he forgived all the families he broke up through the longest confession ever written in judicial history. he even became a born-again christian. same thing with son of sam; he is a born-again christian...it seems like you can get away with murder (no pun intended) in dealing with god.\n\n \n 5.) Yes, God can forgive murderers, rapists, thiefs, etc. That's what's so wonderful about Him. There are consequences for your actions, though. (Murder-death penalty, stealing-jail/fine, speeding-fine, etc.)\n \n 6.) If you say to yourself, \"hey, why don't I go murder and then ask God for forgiveness?\" that doesn't work. God does not forgive those who simply want a quick ticket into heaven. He forgives those who HONESTLY AND SINCERELY ask for forgiveness after they do something that they truly REGRET.\n \n 7.) How are we to know who truly deserves for forgiveness? Is that for you to judge? No, that is for God to judge. If somebody goes around doing bad things without remorse and then asking for forgiveness, he will receive the due penalty for his perversion when he meets his Maker.", 
   {}, 
   2213, 
   null, 
   1046481600.0
  ], 
  [
   122542, 
   null, 
   "Redratio1", 
   "This of course means Gandhi is doomed to everlasting damnation.\n \n The Jesus freak's name means prostitute. Nice.", 
   {}, 
   3577, 
   null, 
   1116059340.0
  ], 
  [
   122577, 
   null, 
   "Mucusaur", 
   "Necromancy is a sin Redratio", 
   {}, 
   122542, 
   null, 
   1116073980.0
  ], 
  [
   122747, 
   null, 
   "Redratio1", 
   "Necromancy is a sin Redratio\n\n \n Say what???", 
   {}, 
   122577, 
   null, 
   1116103980.0
  ], 
  [
   122769, 
   null, 
   "Jo Bennett", 
   "necromany - the act of digging up and trying to reanimate things that should be left buried. Normally bodies, in this case a thread.", 
   {}, 
   122747, 
   null, 
   1116107400.0
  ], 
  [
   122851, 
   null, 
   "Redratio1", 
   "Good, I thought Callgirl was dead or something.", 
   {}, 
   122769, 
   null, 
   1116117840.0
  ], 
  [
   123172, 
   null, 
   "trebor", 
   "I believe in theistic evolution myself.\n Well, okay........ let's say there is no god.\n I see where you are coming from.\n Science is what you believe and have faith in.\n The creature that crawled from the water, LOL.\n Who gave that being life?\n\n \n \n Actually, you don't have to have FAITH in science.\n Good science demands you test it. Repeatedly.\n \n That vast majority of religion demands you accept it\n without question.", 
   {}, 
   2339, 
   null, 
   1116187080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  from ape to adam? (my view)", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/228-ape-adam-my-view.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 228, 
  "discussion_files": [
   [
    "22139.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/228-ape-adam-my-view-print.html"
   ], 
   [
    "22140.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/228-ape-adam-my-view-4-print.html"
   ], 
   [
    "22141.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/228-ape-adam-my-view-3-print.html"
   ], 
   [
    "22142.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/228-ape-adam-my-view-2-print.html"
   ]
  ], 
  "identifier": 228
 }
]