[
 [
  [
   47311, 
   null, 
   "ober-unger", 
   "It seem to have been going along at a lively clip and suddenly it just died. Why is that? The one topic in which I have an interest and when I get here I find that all of the interesting people left, en mass.\n \n What happened?", 
   {
    "post_info": {
     "post_title": "This board seems to have died"
    }
   }, 
   null, 
   null, 
   1083573000.0
  ], 
  [
   47469, 
   null, 
   "Close_slave_can", 
   "A supporter of evolution thought it was being honest and not insulting to call creationists stupid and ignorant. He argued with the mods over this and got banned and then came along as a different poster blatantly behaved in exactly the same way and got banned. Since he was making really good posts (ignoring the insults) other people left out of sympathy. Some evoultion supporters felt within their rights to call creationists ignorant and some creationists linked evolutionists to hitler and their was a bit of nastiness. I personally would put a sticky thread up the top of the thread telling people to ignore these inevitable quips that prove nothing.", 
   {}, 
   47311, 
   null, 
   1083625920.0
  ], 
  [
   47491, 
   null, 
   "Tastyfish", 
   "Seems a little bizarre to have an entire forum dedicated to pretty much just the one topic.\n \n Which side are you two on? See if we can get it started again?", 
   {}, 
   47469, 
   null, 
   1083629700.0
  ], 
  [
   47545, 
   null, 
   "mathurin", 
   "well, the way i see it proof is pretty sketchy for either side, no missing link for the evolutionists, and the whole creationist thing is just philosophy\n \n obviously a small amount of evolution occurs, but it would take alot to convince me that everything on this world occured by a grand accident, and that we all came from inatimate matter without help\n \n though anymore the schools teach evolution like it is gosphel proven and absolute, and it isnt", 
   {}, 
   47491, 
   null, 
   1083638580.0
  ], 
  [
   47587, 
   null, 
   "Close_slave_can", 
   "I would advise anyone making broad statements about evolution because it causes many arguments. If you don't mean evolution in the biological sense as defined by darwin don't use the word evolution because thats the only meaning it has to those that study biology. \n \n As for my opinions I have 3 main opinons on the subject. \n \n 1)I am certain that \n the creationist viewpoint that the earth is at most 10,000 years old, noahs ark etc have simply not been supported by science. \n \n 2)I don't think the theory we have fish and bacteria for ancestors should be presented in such a way that you have certain evidence for every single step. You cannot evolve things in a lab so people should always point out that the bacteria to man theory as the best explanation not a certain fact. \n \n \n 3) It does not matter wether or not you teach in science class because it is an easy theory to teach yourself. I am certain that if a creationist is smart enough to handle Uni should be easily able to handle a Uni course were the lectuer expects you to treat evolution a fact and use that to make theories and conclusions. It is a fact that many scientists treat evolution as a fact and it has given Biology a framework to deal with. If someone cannot handle this I don't think they could handle science.", 
   {}, 
   47545, 
   null, 
   1083652500.0
  ], 
  [
   47628, 
   null, 
   "thebootfitter", 
   "obviously a small amount of evolution occurs, but it would take alot to convince me that everything on this world occured by a grand accident, and that we all came from inatimate matter without help\n\n What you describe really has nothing to do with the Theory of Evolution. Evolution has nothing to do with a 'grand accident' or 'coming from inanimate matter.' \n \n \nthough anymore the schools teach evolution like it is gosphel proven and absolute, and it isnt\n\n There is a comparable amount of evidence and degree of certainty for the Theory of Evolution as there is for the Theory of Gravity. We aren't 100% certain of every single aspect of either theory, but there is no known evidence that I am aware of that contradicts either one. (Unless something in quantum physics contradicts the Theory of Gravity.)", 
   {}, 
   47545, 
   null, 
   1083688920.0
  ], 
  [
   47636, 
   null, 
   "Valthonis", 
   "Creation has a ton of gaps in it. I'm not saying that a higher being didn't create everything we know today but he allowed the \"Big Bang\" happen then let the universe run it's course. \n \n Offsubject for a subject, why do so many people seem to think it is wrong to beleive in more than one god.", 
   {}, 
   47628, 
   null, 
   1083691620.0
  ], 
  [
   47645, 
   null, 
   "jim's trucking", 
   "Surely, everybody knows that God took a hank of hair and a piece of bone and made a walkin' talkin' honeycomb! He is very creative!", 
   {}, 
   47636, 
   null, 
   1083694860.0
  ], 
  [
   47671, 
   null, 
   "Tastyfish", 
   "Is there any real evidence that is contrary to what evolution predicts, not gaps in the theory where evidence is missing as that is inevitable (we haven't found anything like gravitons or proved it is a property of the fabric of spacetime)? That is how you disproove theories and it is something I have not seen presented here.", 
   {}, 
   47645, 
   null, 
   1083701160.0
  ], 
  [
   47709, 
   null, 
   "Ursus maritimus", 
   "I would like to qualify Tastyfish's statement, if I may.\n \n If the theory makes predictions that certain phenomena should be observed, and there is no reason to prevent the phenomena from being observed, and in fact we really should expect to observe the phenomena, then the absence of the phenomena would probably count as evidence against the theory.\n \n In the case of evolution, I would say that, in Darwin's time, the lack of fossil evidence, the lack of clear fossil transitional species, would not count as evidence agains the theory since it was well known then that fossilization was a rare occurrence, and there weren't many fossil species known.\n \n However, now there are tons of fossils and lots of examples of extinct species preserved as fossils. I would say that, with the wealth of fossil data available, if there were no examples of transitional species then this would be a problem for the theory of evolution. Fortunately, as anyone who knows anything about evolution realizes, is that there are plenty of examples of transitional species in plenty of lineages. While it is not surprising that any particular lineage may not be preserved in the fossil record, or that a preserved lineage may have gaps (after all, fossilization is still a rare phenomenon), I think it would be very surprising if there were no examples whatsoever of transitionals. Think of the lottery - you would be very surprised if your mother won the lottery, but it would also be surprising if no one at all won the lottery for several months in a row.", 
   {}, 
   47671, 
   null, 
   1083712200.0
  ], 
  [
   47730, 
   null, 
   "Close_slave_can", 
   "I have yet to see someone PROPERLY counter the \"information does not increase\" argument. Why don't people bother to point out that a massive sequence of minor mutations producing new genes are needed to explain some of the journey from bacteria to man, so why not give examples of how mutation has caused new genes to form and actually answer the question?", 
   {}, 
   47709, 
   null, 
   1083717000.0
  ], 
  [
   47734, 
   null, 
   "Tastyfish", 
   "New genes have never formed, old ones have been duplicated (happens a lot) and changed in function. This kind of thing can be seen simply by looking at very closely related proteins or pathways being put to very different uses. Can't give you good examples at the moment (only ones I have looked at are fairly obscure as this issue wasn't what it was about, the relationship between the human gene and bacterial gene was just mentioned) but I'm sure someone more knowledgable on the evolution/creation debate may know more easier examples. If not prepare yourself for the wonderous pleasures of cell signalling or nucleotide salvage pathways. ;)", 
   {}, 
   47730, 
   null, 
   1083717960.0
  ], 
  [
   47757, 
   null, 
   "mathurin", 
   "ok, according to what ive learned the currently accepted scientific theory is similar to this\n \n a very long time ago there was a huge star, its fused almost all its elements (enough to form uranium, takes alot of pressure) something blew up (yes i know im being very general but so have my science classes) and our universe, and solar system was formed, now earth just happened to form where it is, with the composition it does, and be the only place able to support life, so we have heat, water, and minerals, alot of inatimate objects, the claim is that somehow life appeared spontaneously, took hold, and we went from single cell forms of life, to multicelled invertabrates, to vertabrates, and somehow crawled up onto earth and started walking\n \n this is what i mean by grand accident, no one has ever proven that life can develop from inatimate objects (quite the opposite in the case of pasteur) they lead us to believe that all this happened to happen, everything came together against all odds to create this\n \n i agree that evolution is a theory, and it has evidence, but it is far from proven, creationism is different, as far as im concerned the evidence on its side is even weaker, but then who needs evidence to believe in god\n \n i have no problem with teaching the secular and most evidenced theory, as long as it is taught as a theory and at least a few of the holes are explained\n \n i am not surprised that people see it as fact, it is taught as such, mostly because teachers like to spew from a textbook and not actually teach students how to think, my own view came from a HS biology teacher that showed us a video detailing many wholes in evolution, i dont remember them all, one was an absolutly faked primitaive human, nebraska man i believe. they found a old murder victims bones and worked them over to look like an advanced ape, fame makes folks do weird things\n \n Mathurin", 
   {}, 
   47734, 
   null, 
   1083727740.0
  ], 
  [
   47758, 
   null, 
   "Tastyfish", 
   "That isn't evolution, we are dealing with Physics and Cosmology there, first left down the corridor. They shouldn't be teaching you that alongside evolution at all, it has absolutely nothing to do with it unless you are teaching evolution as a alternative belief to fundamentalist christianity. Which it is like saying cars are the cure for broken legs.", 
   {}, 
   47757, 
   null, 
   1083728040.0
  ], 
  [
   47767, 
   null, 
   "Close_slave_can", 
   "Cosmology gives evidence that the universe is old, and you need an old universe for evolution to explain the fossil record. Even thought it is wrong to directly connect the word evolution to the big bang and the first creation of life from lifeless molecules science supporters of evolution support those claims and is evolution is a part of the explanation of where humanity came from.", 
   {}, 
   47758, 
   null, 
   1083730380.0
  ], 
  [
   47769, 
   null, 
   "mathurin", 
   "That isn't evolution, we are dealing with Physics and Cosmology there, first left down the corridor. They shouldn't be teaching you that alongside evolution at all, it has absolutely nothing to do with it unless you are teaching evolution as a alternative belief to fundamentalist christianity. Which it is like saying cars are the cure for broken legs.\n\n \n \n yeah, most of the first part just sets a backdrop about the beginning of the universe, it points out a pattern of thinking, and the weakest point of evolution that ive seen is the very begining, that life came from an inatimate object, no matter what happened after that (and yes i belive there is some evolution, humans to the top cause of intelligence, bears cause they can kill most anything, a certain bird gets a leg up cause its beak is longer/can catch more insects in logs....it makes sense) however the claim that somehow rocks and water spawned life is laughable, and is only accepted in the scientific community because they have no better supported theory, somehow, someway, life was placed here, how complex it was, and where it came from is not known, but that still does not change my stance, teach kids to ask questions, dont program them with theories as fact, and no the physics wasnt taught with evolution, its just connected as the beginning of everything", 
   {}, 
   47758, 
   null, 
   1083730680.0
  ], 
  [
   47780, 
   null, 
   "ober-unger", 
   "however the claim that somehow rocks and water spawned life is laughable,\n\n That is certainly true. But only creationists make such claims. Some do so because they don't understand what they are talking about. Others, I believe say such things out of dishonesty. They wish to represent science in such a ridiculous way as to make it seem silly. The easiest way is to create a straw man - invent a story about what science claims with no basis in truth. Are you the inventor of the straw man or are you just one who has been fooled by it?\n \nand is only accepted in the scientific community because they have no better supported theory,\n\n But your above remarks aren't accepted in the scientific community. Where did you get that idea? Your claim that somehow rocks and water spawned life is not even similar to any scientific hypothesis.\n \nsomehow, someway, life was placed here,\n\n By aliens from another planet? How was it placed here?\n \nhow complex it was, and where it came from is not known,\n\n I see. So God didn't create life is what you are saying.\n \nbut that still does not change my stance,\n\n Stance? Tell me. Is you stance based on education?\n \nteach kids to ask questions,\n\n Certainly. But it seems that no matter how hard a teacher tries, some students aren't able to ask questions. They think that there is some ultimate truth and that it is the duty of the teacher to tell them what it is.\n \ndont program them with theories as fact,\n\n Only creationists make such claims. Mostly because they think that a scientific theory is some sort of wild guess. Like the theory of gravity.\n \nand no the physics wasnt taught with evolution,\n\n Then why are you conflating the two?\n \nits just connected as the beginning of everything\n\n That's great. Don't call cosmology, evolution.", 
   {}, 
   47769, 
   null, 
   1083735120.0
  ], 
  [
   47783, 
   null, 
   "Close_slave_can", 
   "Does science offer an explanation of where we came from? Could somebody give a summary? I think you find that is what people find dubious and not natural selection. I do not have a problem with people thinking that science has gaps in explaining where life the universe and everything came from but they should be more careful with the choice of words. \n \n On the other hand if you are actually polite to some creationists they will admit that no evidence given by human beings would change their beliefs. I wish they would admit this from the start.", 
   {}, 
   47780, 
   null, 
   1083737220.0
  ], 
  [
   47832, 
   null, 
   "Tastyfish", 
   "You don't need cosmology to give you an old earth, geology does that- the whole supernovae and big bangs are irrelevant as far as evolution is concerened. You don't need it for the geology either, the rate of currant physical processes does this as well. Taking these things right to the beginning is not part of the issue at all, pretty sure the genesis mentions very little of the creation of the universe (other than stars being made after earth but hey) and the creationism/evolution debate is about primarily the origin of man. Creation of the universe/creationism is a different debate, if you want ot debate this, start a new thread but don't keep clogging up this one with it. Just isn't an issue and following science's rules, if you can find a major inconsistancy between your theory and reality then the theory is incorrect. If eveolution is true then genesis has a serious flaw, there isn't even much point going onto the much harder topic to understand of the actual origins of life or the creation of the universe as these require a much deeper understanding of biochemistry, cosmology and maths (if you want to ask the same fundamental questions which give religion a problem).\n \n Where we (humans came from) is simple as far as evolution is concerned. Do you really doubt that we descended from an apelike ancestor? Otherwise in brief - Prokaryote/Archea single cell -< eukaryote/prokaryotes colony -< eukaryotes colony -< simple mutlicellular life (tube worms, jelly fish) -< more complex multicellular life (simple worms, one layer of the embryo is replicated twice giving three layers over two, this new layer forms the basis of the organs we know today) -<worms (from C. elegans type simple stuff up to things like electric eels) -< fish -< amphibians -<synapsids (the lineage that would form mammals actually arose at the same time the ones that would become dinosaurs/birds or modern reptiles did -< true placental mammals -< early primates -< apes -< homonids -< humans.\n \n Evolution is also seen in a computer programs at an excellerated rate where something that follows the same rules we do will evolve to becoem better suited at a task (some modern programs are actually written that way, popular known ones, can't remember with ones though one of the Sim Cities had a part done in this way. The other one is a word processor). It can also be tested by formulating a hypothesis following the rules and then looking at evidence in the past and seeing if it meets your expectations, this works and follows the scientific method. There is nothing special about labs that make things proovable and this kind of research is no different from any other field study other than you are looking at event that have happened. When it gets down to it anyway this is how all data is analysed. No experiments rely on you seeing what is happening at that moment in time but on analysing the data after the event. The is no difference between a minutes, a day or millions of years after the events other than the ease of actually finding your results", 
   {}, 
   47783, 
   null, 
   1083775140.0
  ], 
  [
   47983, 
   null, 
   "Close_slave_can", 
   "Taking these things right to the beginning is not part of the issue at all, pretty sure the genesis mentions very little of the creation of the universe (other than stars being made after earth but hey) and the creationism/evolution debate is about primarily the origin of man. Creation of the universe/creationism is a different debate,\n\n \n Every single creationist I know lumps evolution and the creation of the universe together. They have even have a name for the combined idea, \n I think its the \"the general theory of evolution\" so I don't see you you can say its a different debate when one side insists that it is.", 
   {}, 
   47832, 
   null, 
   1083801540.0
  ], 
  [
   47993, 
   null, 
   "Ursus maritimus", 
   "The problem is each of these is an independent science, and whatever is \"proved\" or \"disproved\" in any one field has little direct bearing on any of the others. Each of biology, geology, astronomy, cosmology, and so on is enough to demonstrate that the universe and the earth is ancient. To disprove an ancient universe, the creationists have to discredit each and every one of these sciences. Yet, for some reason, many of them think that they win if they can pick apart just one of them.", 
   {}, 
   47983, 
   null, 
   1083804300.0
  ], 
  [
   47995, 
   null, 
   "Tastyfish", 
   "Every single creationist I know lumps evolution and the creation of the universe together. They have even have a name for the combined idea, \n I think its the \"the general theory of evolution\" so I don't see you you can say its a different debate when one side insists that it is.\n\n Wheras we would call it 'science'. Evolution has very little to actually do with it then but obviously is a familiar name and sounds less ridiculous than being 'against science', despite it being the actual position.", 
   {}, 
   47983, 
   null, 
   1083805320.0
  ], 
  [
   48019, 
   null, 
   "mathurin", 
   "im tired of all this, im going to post a few sites that i found in a VERY short internet search, try 2 mins\n \n but i first want to say this one last time for those who havent been listening\n \n EVOLUTION IS A THEORY, IF IT WERE TRULY PROVEN IT WOULD BE CALLED THE LAW OF EVOLUTION, so even science hasnt made it definite yet\n \n i also want to state again that it is taught in public schools like it is proven, not a single fallacy is pointed out (and there are many) i never said it was wrong, just said we shouldnt be teaching it as law when it is theory\n \n as was stated in a book i read often \"i have reverence for the truth, but i do not know what the truth is. i suspect there are many truths, and therefore i suspect all who claim to have THE truth\" and \"my advice is to question all things. seek for answers, and when you find what seems to be an answer, question that too\"\n \n http://www.everystudent.com/wires/evolution.html\n first hit, christian site no doubt you will ignore\n http://www.darwins-theory-of-evolution.com/\n \n the main thing you should be thinking is why you feel so admantly that evolution is law, something has closed your mind to other possibilities, no matter how unlikely they may be\n \n and as to scientific theory as a wild guess, no, most arent, but many are far from right, btw, what theory of gravity are you talking about cause most gravity theories are easily tested, unless you mean that gravity affects time, the one we are trying to test now\n \n and yes it is hard to get kids to ask questions, but at least point out a few of the holes and teach it as a theory, a good theory and the most plausable explanation, but it does have holes, which have been explained by many and if you want more info just search the internet, you seem to have made up your mind that evolution is law so i wont try to convince you anymore\n \n mathurin", 
   {}, 
   47995, 
   null, 
   1083818100.0
  ], 
  [
   48023, 
   null, 
   "Close_slave_can", 
   "Mathurin\n both of those sites don't define evolution the way science defines it. If you doubt life could have formed in a primordial soup of molecules then thats what you should say. Darwin's theory says absolutely nothing about were the first organism came into existance and those sites claim it does.", 
   {}, 
   48019, 
   null, 
   1083820560.0
  ], 
  [
   48033, 
   null, 
   "mathurin", 
   "Mathurin\n both of those sites don't define evolution the way science defines it. If you doubt life could have formed in a primordial soup of molecules then thats what you should say. Darwin's theory says absolutely nothing about were the first organism came into existance and those sites claim it does.\n\n \n fine, explain to me the way science defines evolution, and regardless you still missed my point, it has holes, large ones that are never explained to kids\n \n think about the possibility, remote as it is that we find a definite proof of something other than evolution, what i dont care but for arguements sake lets say aliens transplanted all life here(absurd i know, but play along) so they come back now and show us irrefutable evidence that they did what they said they did, but only scientists can understand the evidence, we will have a huge amount of people go, but you said.....evolution is proven fact..... and many would refuse to believe the truth, my purpose is not to say evolution is incorrect, i do wish to make you realize it is not a law\n \n and the alien gag was absurd i know so dont bother telling me about it\n \n want a few holes, take 2 skeletons, 1 is a modern horse, 2 looks something similar to a horse and is old, to the evolutionist, the first came from the second. prove that the second just isnt another variety that lived right alongside the modern species of horse but was tastier to the predators and was made extinct, and you cant, its like translating a dead language, you can create a good idea, but never be truly sure that father isnt actually potato\n \n i swore up and down i wouldnt keep going, but there i went, time for bed now", 
   {}, 
   48023, 
   null, 
   1083823080.0
  ], 
  [
   48041, 
   null, 
   "ober-unger", 
   "im tired of all this, im going to post a few sites that i found in a VERY short internet search, try 2 mins\n\n On the other hand, a real understanding of science takes years. If you tell me where you earned your science degrees I'll tell you where I earned mine.\n \nbut i first want to say this one last time for those who havent been listening\n \n EVOLUTION IS A THEORY, IF IT WERE TRULY PROVEN IT WOULD BE CALLED THE LAW OF EVOLUTION, so even science hasnt made it definite yet\n\n Apparently you haven't been listening. It seems that you haven't made the effort to learn the scientific meaning of the word \"theory.\" Scientific theories do not grow up to be laws. Actually, in the context of science, laws are more simple concepts than theories. Laws are quite restricted in scope - like the laws of thermodynamics or the laws of motion. Scientific theories are many times more complex than laws of science. For some reason, creationists want to declare that scientific theories haven't been proven but the laws of science have. Not true. Modern science, and therefore the laws of science, only date back about 400-500 years. Newton's laws have been amended (by Einstein) and those amendments were amended in their turn (Bohr).\n \n By your logic, gravity hasn't beem made definite yet. Of course, we aren't sure if the earth orbits the sun, since that is only a theory. We are only guessing when we say that an infection is caused by a microrganism. These are only theories that have not grown up to be the laws that creationists demand of all knowledge.\n \ni also want to state again that it is taught in public schools like it is proven, not a single fallacy is pointed out (and there are many) i never said it was wrong, just said we shouldnt be teaching it as law when it is theory\n\n Didn't you pay attention? Or maybe you are just parroting some preacher who thinks that science is somehow anti-Christian or anti-God. As someone who has taught science, I never represented any scientific theory as law. Again, scientific laws are much more simple than scientific theories.\n \nas was stated in a book i read often \"i have reverence for the truth, but i do not know what the truth is. i suspect there are many truths, and therefore i suspect all who claim to have THE truth\" and \"my advice is to question all things. seek for answers, and when you find what seems to be an answer, question that too\"\n\n Didn't you understand what you read? The very essence of the pursuit of science is to question. On the other hand, creationism accepts dogma without question and rejects science out of hand.\n \nhttp://www.everystudent.com/wires/evolution.html\n first hit, christian site no doubt you will ignore\n http://www.darwins-theory-of-evolution.com/\n\n So you think that internet sites is where science is done? How confused you are. I can put up a page and claim that earth was populated by beings from Alpha Centari. Does that make it relevant, meaningful, or true? I didn't ignore your links. I've just seen that sort of misguided pap before. Shallow thinking and little education.\n \nthe main thing you should be thinking is why you feel so admantly that evolution is law, something has closed your mind to other possibilities, no matter how unlikely they may be\n\n Then you admit that you don't have the slightest idea of what science is or how it works. I don't claim that evolution is a law. It is a theory. In fact, evolution is a theory that is better understood than the theory of gravity. Other theories that I don't claim as law are the germ threory of disease, nuclear theory by which we operate our nuclear power plants (and make our bombs). I don't claim that it is some sort of \"law\" that the sun is the center of our solar system - it's just a theory.\n \nand as to scientific theory as a wild guess, no, most arent,\n\n Actually, none are wild guesses. If you knew the meaning of the scientific term theory, you would know that a scientific theory has been tested and found to be correct for all known cases.\n \nbut many are far from right,\n\n Many? Please cite 10 scientific theories that are \"far from right.\" I await your wisdom. Please do not run from this question. Is it that you believe that the sun is not the center of the solar system? Do you deny that bacteria can cause infection? Do you deny that viruses can cause disease? Do you think that a certain mass of U-235 will not undergo a fission reaction?\n \n Please be specific. What scientific theories are \"far from right\" and what are your qualifications to make such judgements? In other words, what science degrees from what universities have you earned?\n \nbtw, what theory of gravity are you talking about cause most gravity theories are easily tested,\n\n Really? How is that? Here's a question. I hold a ball at arms length and release it. It falls to the ground. Please explain the mechanism that causes this to happen. If most theories of gravity are easily tested, then there should be no problem in explaining the mechanism.\n \nunless you mean that gravity affects time, the one we are trying to test now\n\n Really? Please cite research papers that show that your assertion is true.\n \nand yes it is hard to get kids to ask questions, but at least point out a few of the holes and teach it as a theory,\n\n What holes are you talking about? My bet is that you don't demand that any holes in atomic theory be pointed out. Never is there a demand in any science that \"holes\" be presented in the classroom. Only in biology. And again, please make the effort to learn what the word \"theory\" means in a scientific context. To continue to imply that a scientific theory is some sort of a wild guess is dishonest. You know better.\n \na good theory and the most plausable explanation, but it does have holes,\n\n Then point out the holes. And while you are at it, point out the holes in the theory of gravity, the germ theory of disease, atomic theory, the heliocentric theory, and any other scientific theories that occur to you.\n \nwhich have been explained by many and if you want more info just search the internet,\n\n Actually, they have been claimed by many without any supporting evidence. And why do you think that something published on the internet is somehow meaningful? I can put up a page that claims that the moon is the center of the universe. Does that make it scientifically accurate?\n \n I'll ask again, what are your qualifications to judge the scientific accuracy of any internet material - what are your degrees and where did you earn them?\n \nyou seem to have made up your mind that evolution is law so i wont try to convince you anymore\n\n Nonsense. Scientific theories don't grow up to be laws. I never made any such claim. Your claim demonstrates that you don't understand science or how it works. Wouldn't it be better to educate yourself in matters that you claim to oppose. You make your religion look foolish.", 
   {}, 
   48033, 
   null, 
   1083833940.0
  ], 
  [
   48047, 
   null, 
   "Tastyfish", 
   "OK, a scientific definition of evolution from 'Henderson's dictionary of scientific terms 12th edition'\n \n \nthe development of new types of living organisms from pre-exisiting types by the accumulation of genetic differences over long periods of time\n \n and that is all, nothing to do with the origins of life at all.", 
   {}, 
   48041, 
   null, 
   1083846240.0
  ], 
  [
   48227, 
   null, 
   "mathurin", 
   "as my final post, did i ever say i was a creationist, did i ever say that evolution is incorrect, negative, but you folks seem to enjoy putting words into my mouth, i have great respect for the theory of evolution\n \n btw, to find scientific theories that are far from correct you dont have to go back too far before the first hot rodder did it it was assumed that no car could travel faster than 200 mph, something to do with the vehicle not sticking to the ground good enough to get traction, want papers, there arent any cause they all were disproved\n \n another, it was common scientific knowledge that radio waves went in straight lines and could not pass through the earth, thus it was impossible to transmit a signal from one side of the earth to the other, i believe it was marconi, want a paper, read any high school textbook\n \n for the sake of brevity i am going to stop the explanation and just give the theories\n the earth is flat\n she is sick cause a demon possessed her\n the sun revolves around the earth\n west of europe is nothing but sea monsters\n rotting meat causes maggots\n you are sick cause you have too much blood\n heat is tastless colorless but matter nonetheless (yes, this was a valid scientific observation)\n \n ok, thats only 9, but you get my point, everyone was cooked up by the brightest minds of the time and generally accepted by their people, wanna say that im wrong cause they did not have the technology we do now, ill agree while saying that in 100 years we might have even better scientific proof of something else, so go into it with an open mind\n \n hmm, explain the mechanism of gravity, chunks of mass attract eachother with a force that increases with their size, this has been proven, even quantified i.e. we know how much you would weigh on jupiter because we know its mass, we know that all items are pulled by gravity at a constant speed, and we can prove it\n \n and that gravity affects time is a untested hypothesis, i think einstein thought it up, it was all over the news a couple weeks ago that we are sending up a satelite with sensetive gyros to test it\n \n and why dont i ask that the holes in atomic theory and...... be taught, because those subjects never showed up in my high school, and they were just recently taught to me in a college course, and it was well explained that everything he taught us wasnt fact, but was as close as we could come to it at the point\n \n anyway, do remember that im not disproving evolution, i just hate spoonfeeding students what may be wrong in the future, and i have never stated i even have a religion, why do you assume i am religious just cause i think there are holes to fill in evolution, i doubt everything, im a cynic (i call it realist) and accepting anything, now stop attacking my character \n \n anyway, as it were \"im takeing my ball and going home\"", 
   {}, 
   48047, 
   null, 
   1083903420.0
  ], 
  [
   48265, 
   null, 
   "jim's trucking", 
   "...\n \n hmm, explain the mechanism of gravity, chunks of mass attract eachother with a force that increases with their size, this has been proven, even quantified i.e. we know how much you would weigh on jupiter because we know its mass, we know that all items are pulled by gravity at a constant speed, and we can prove it\n \n ...\n\n \n acceleration\n \n Other than that, you did okay.", 
   {}, 
   48227, 
   null, 
   1083942780.0
  ], 
  [
   48356, 
   null, 
   "ober-unger", 
   "why do you assume i am religious just cause i think there are holes to fill in evolution,\n \n Because you spout creationist rhetoric, you make assertions without foundation and can't support them, you fail to understand what science is and how it works.\n \n I'm surprised that you are not a creationist. You sound just like one.", 
   {}, 
   48265, 
   null, 
   1083963660.0
  ], 
  [
   48492, 
   null, 
   "ober-unger", 
   "as my final post,\n\n Great! Cut and run. I guess you know that you are in over your head.\n \ndid i ever say i was a creationist, did i ever say that evolution is incorrect, negative,\n\n The problem is, as I have said before, is that you express standard creationist arguments. You sound like a creationist.\n \nbut you folks seem to enjoy putting words into my mouth,\n\n No. We only responded to your words. I don't see anywhere that anyone misrepresented your words. You use pretty common, trite, creationist arguments. \n \ni have great respect for the theory of evolution\n\n Sadly, you don't seem to understand even the basics about it.\n \nbtw, to find scientific theories that are far from correct you dont have to go back too far before the first hot rodder did it it was assumed that no car could travel faster than 200 mph, something to do with the vehicle not sticking to the ground good enough to get traction, want papers, there arent any cause they all were disproved\n\n I think that you are kidding yourself. Here's the story, right off the top of my head. The faster a vehicle goes, the more air resistance it meets, and thus more energy is required to accelerate further. At some point it is reasonable that the air resistance might equal the friction of the tires. The theory may have been correct for the configuration of the tires and the car itself at that time. But technology and an understanding of the physics involved added several things to the equation - change the shape of the car to make it more aerodynamic, increase the amount of tire then meets the road and thus increase the friction, and finally, add a wing that presses the car down against the road and increases the friction. These things result in the transfer of more energy to the road and therefore more speed.\n \n And yes, I do want papers. Please demonstrate that what you claim was, in fact, a \"scientific\" theory rather than one of technology.\n \nanother, it was common scientific knowledge that radio waves went in straight lines and could not pass through the earth, thus it was impossible to transmit a signal from one side of the earth to the other, i believe it was marconi, want a paper, read any high school textbook\n\n High school text books don't contain scientific papers. Do you actually know how modern science works? In fact, do you know what science is? So please support your assertion that radio waves pass through the earth. I have talked to someone on a radio that I could see who was less than a mile away. He merely walked down the hill into defilade and we could no longer talk. Specifically, what kind of radio are you talking about (VLF?) and are you talking about skip?\n \nfor the sake of brevity i am going to stop the explanation and just give the theories\n\n But to this point you haven't explained anything and you haven't actually made a statement of theory. What are you talking about?\n \nthe earth is flat\n\n Never was a theory of science.\n \nshe is sick cause a demon possessed her\n\n Religious superstition - not a scientific theory.\n \nthe sun revolves around the earth\n\n Not science but rather a religious idea based on the Bible.\n \nwest of europe is nothing but sea monsters\n\n superstition.\n \nrotting meat causes maggots\n\n Never a theory of science. It was more an old \"wives tale\", somewhat like if you get cold you will catch a cold. It was science that disproved the common belief and showed the cause of the maggots.\n \nyou are sick cause you have too much blood\n\n Yet more superstition. People needed to be bled to release the bad humors. It never was science.\n \nheat is tastless colorless but matter nonetheless (yes, this was a valid scientific observation)\n\n Ridiculous. Please support the assertion.\n \n Perhaps you are unaware that modern science is only about 400 years old. Anything that you claim as a \"theory\" before that, really wasn't.\n \n And wouldn't it be nice if you actually offered some meaningful scientific theory rather than matters of technology?\n \nok, thats only 9, but you get my point,\n\n No, I don't. What is your point?\n \neveryone was cooked up by the brightest minds of the time and generally accepted by their people,\n\n Right. I'm sure that the brightest minds of the time were concerned with whether a car could go faster than 200 mph. The rest is balderdash.\n \nwanna say that im wrong cause they did not have the technology we do now,\n\n That and more. Neither was the logic understood. The scientific method didn't exist when most of your \"scientific theories\" were expressed. Esentially, they aren't theories but mere assertions. When tested by science, all failed.\n \nill agree while saying that in 100 years we might have even better scientific proof of something else, so go into it with an open mind\n\n Nonsense. You have already demonstrated that you have a closed mind. You have demonstrated that you don't know what science is or how it works. In 100 years we won't have better \"scientific proof\" because the very idea demonstrates that you have no idea of what science is.\n \nhmm, explain the mechanism of gravity,\n\n snip of babble about gravity. By the way, we can't \"prove\" that anything is pulled by gravity at a constant \"speed\". We can demonstrate the effects of gravity but very little can be proven. And while we may be able to express the effects of gravity, there is no good theory that explains it. Do you know what a scientific theory is?\n \nand that gravity affects time is a untested hypothesis,\n\n Nope. It has been tested.\n \ni think einstein thought it up,\n\n I'm sure that scientific theories are \"thought up.\" It was just some sort of a WAG (Wild A** Guess). It wasn't based on observation and testing, was it?\n \nit was all over the news a couple weeks ago that we are sending up a satelite with sensetive gyros to test it\n\n I didn't see that. Maybe it isn't all that significant since the theory has already been tested and supported several times. In fact, when I was a child. Maybe the you misunderstood. Relativity no longer needs to be tested. The theory has passed all tests. I suspect that the purpose of the satelite that you mention was not to test but to measure.\n \nand why dont i ask that the holes in atomic theory and...... be taught, because those subjects never showed up in my high school, and they were just recently taught to me in a college course, and it was well explained that everything he taught us wasnt fact, but was as close as we could come to it at the point\n\n Is that English? So it seems that you have been taught atomic theory in college and you conclude that you weren't taught fact. Again, do you know what science is? How can you pass a university course in atomic physics and not understand that the difference between scientific theory and fact. Are you sure that you aren't a creationist?\n \nanyway, do remember that im not disproving evolution,\n\n Sadly, you didn't even present a single argument against the theory of evolution.\n \ni just hate spoonfeeding students what may be wrong in the future,\n\n So you are in favor of establishing some dogma as absolute truth and ignoring any new data. That's the creationist position. Anyone with an elementry understanding of science understands that new data may alter the theory. Sadly, you and creationists would prefer to reject new data rather than alter the theory to include it. But that's the difference between creationism and science, isn't it?\n \nand i have never stated i even have a religion,\n\n Irrelevant. You walk like a creationist, and you squack like a creationist.\n \nwhy do you assume i am religious just cause i think there are holes to fill in evolution,\n\n Because you haven't been able to support that assertion. You claim that there are holes in evolution and then tell us about hot rods. Are you daft? What holes?\n \ni doubt everything, im a cynic (i call it realist) and accepting anything, now stop attacking my character\n\n To disagree with you is not to attack your character. Your posts do not reflect the attitude of either a cynic or a realist. You are a creationist and express disproven creationists ideas.\n \nanyway, as it were \"im takeing my ball and going home\"\n\n I'm sure. When you don't get to make the rules, that is the thing to do. How sad that you actually used a childish phrase of a coward/brat who can't have his way. You don't get to make the rules so you tuck your tail and run. How honorable! Gosh, I hope I grow up to be like you.", 
   {}, 
   48356, 
   null, 
   1084000200.0
  ], 
  [
   48575, 
   null, 
   "mathurin", 
   "\n So please support your assertion that radio waves pass through the earth. I have talked to someone on a radio that I could see who was less than a mile away. He merely walked down the hill into defilade and we could no longer talk. Specifically, what kind of radio are you talking about (VLF?) and are you talking about skip?\n \n\n \n i never said that radio waves could pass through the earth, which is why scientists decided it was impossible to get a radio signal to the other side of the earth, turns out that with a high power transmitter you can bounce the signal off the ionsphere, before marconi did it it was thought impossible, this dealt with generic radio waves, such things as VLF and UHF and HAM hadnt been devised yet\n \n \n\n Perhaps you are unaware that modern science is only about 400 years old. Anything that you claim as a \"theory\" before that, really wasn't.\n \n\n \n i am glad you said 400 yrs, marconi did the above in 1899\n and you responded to the theory that heat was a substance with this\n \n \n\n Ridiculous. Please support the assertion.\n \n\n \n ok, im glad i didnt sell back my textbook yet\n \n \"although it comes as little surprise to us today to learn that heat is a form of energy, in earlier scientific times this was not so clear. less than two centuries ago most scientists regarded heat as an actual substance called caloric. absorbing caloric caused an object to become warmer; the escape of caloric caused it to become cooler. because the weight of the object did not change when the object was heated of cooled, caloric was considered to be weightless. it was also supposed to be invisible, odor-less, and tastless, properties that, of course, were why it could not be observed directly\"\n page 73, the physical universe tenth edition. Konrad B. Krauskopf, professor emeritus of geochemistry, stanford university\n and Arthur Beiser\n \n barring any minor typos that is exactly what it said, proof enough\n \n \n \n\n Right. I'm sure that the brightest minds of the time were concerned with whether a car could go faster than 200 mph. The rest is balderdash.\n \n\n \n the brightest minds work for those that give them the most money to do research, like auto manufacturers, there was and still is alot of money being thrown around with raceing reasearch, and for the record aerodynamics and downforce are what overcame the 200mph limit, larger tires wouldnt cut it either\n \n \n\n Please demonstrate that what you claim was, in fact, a \"scientific\" theory rather than one of technology\n \n\n \n let me know of any technology in the past 200 yrs that wasnt a science first, tech comes from science, the scientists observe, and the engineers find a use\n \n \n \n\n snip of babble about gravity. By the way, we can't \"prove\" that anything is pulled by gravity at a constant \"speed\". We can demonstrate the effects of gravity but very little can be proven. And while we may be able to express the effects of gravity, there is no good theory that explains it. Do you know what a scientific theory is?\n \n\n we can easily prove that gravity pulls at a constant acceleration (thats for the polite heads up jim) it was actually the first or second experiment we conducted in phys sci lab this semester\n \n \n\n Relativity no longer needs to be tested. The theory has passed all tests. I suspect that the purpose of the satelite that you mention was not to test but to measure.\n \n\n quote my textbook, \"other predictions based on general relativity have also been verified, and the theory remains today without serious rival\"\n ok, maybe i was wrong, thats what i get for watching the news\n \n \n\n Is that English? So it seems that you have been taught atomic theory in college and you conclude that you weren't taught fact. Again, do you know what science is? How can you pass a university course in atomic physics and not understand that the difference between scientific theory and fact. Are you sure that you aren't a creationist?\n \n\n i was taught the basics in physical science, and the instructor said so many times it became boring \"we dont know that this is what atoms look like, but quantom mechanics gives us a good idea, an atom is about 50 times smaller than a photon of light, its like trying to find a grain of sand with a boxing glove\" and many similar statments indicating that we didnt know exactly what was going on, but that we had an excellent guess. the assumption i made is that they have proven through math what atoms look like and are made of, but almost anything can be proven with enough math, so i smile, nod and write what they say, knowing that it has little bearing on my life, so i accept it as oh, say 99% certainty\n \n \n\n To disagree with you is not to attack your character. Your posts do not reflect the attitude of either a cynic or a realist. You are a creationist and express disproven creationists ideas.\n \n\n \n ok, so you havent attacked my character ever, then whats all this, some are from previous posts as well\n \n \nGreat! Cut and run. I guess you know that you are in over your head.\n \n Because you haven't been able to support that assertion. You claim that there are holes in evolution and then tell us about hot rods. Are you daft? What holes?\n \n I'm sure. When you don't get to make the rules, that is the thing to do. How sad that you actually used a childish phrase of a coward/brat who can't have his way. You don't get to make the rules so you tuck your tail and run. How honorable! Gosh, I hope I grow up to be like you.\n\n \n \n \n\n Stance? Tell me. Is you stance based on education?\n \n On the other hand, a real understanding of science takes years. If you tell me where you earned your science degrees I'll tell you where I earned mine.\n \n\n these are only the ones that are obviously insulting, almost everything you have ever said is antagonistic, like a playground bully for lack of a better comparison\n then again i guess that you think implying im an idiot, multiple times, requiring me to show you degrees as prerequisite and calling me a child cause im tired of you defaming my character, isnt considered attacking my character. i used that particular phrase (taking my ball and going home) cause when i saw your first post i decided to do alittle debating with you, perhaps relieve you of your boredom, seeing that im the main one you are argueing with (and insulting) im going to leave so you have no one left \n \n please contiue spouting rhetoric, i honestly roll in laughter as you refuse to admit that all scientific theories have holes, and call me a creationist, an idiot, and call me closed minded when you yourself refuse to imagine anything beyond your own personal mindset, i have no idea who you are actually argueing with but do me a favor and have it out with them and leave me alone", 
   {}, 
   48492, 
   null, 
   1084057680.0
  ], 
  [
   48592, 
   null, 
   "ober-unger", 
   "So you can't tell me what makes you qualified to discuss evolutionary biology? I notice that you don't point out any \"holes\" in the theories and don'e even define what you mean by \"hole\".\n [quote=and call me a creationist,[/quote]\n Yes. I said that you use creationist arguments and I conclude that you must therefore be a creationist.\n \nan idiot,\n\n I didn't call you an idiot. Look again. Then you can apologize for your error. I hope that it wasn't intentional because that would make it a lie.\n \nand call me closed minded when you yourself refuse to imagine anything beyond your own personal mindset,\n\n I asked you to support your claims and you can't it seems. What holes are you talking about? Even if your bad theory flatulence were true, what is the point? So what if a scientific theory from hundreds of years ago was wrong?\n \n So why don't you begin with one of the \"holes\" that you think exists in evolutionary theory. Take them one at a time without doing too much of a cut and paste from some creationist page. Go ahead. You're not going to run away are you?", 
   {}, 
   48575, 
   null, 
   1084064580.0
  ], 
  [
   48596, 
   null, 
   "mathurin", 
   "hehe, i would, but every point i have brought up you dismiss as \"creationist rhetoric\" meaning any view other than your own is completly false \n then when i proved you full of hot air in at least 2 instances you laugh it off like it means nothing, just because i didnt have evidence at hand does not mean the rest of my false theories are not signifigant, just means i dont want to waste research time on someone who will ignore it\n \n no, i dont have any degrees in science, but then again if you didnt know about those instances that are taught in a general ed course for college then you cant have any either, at least not any that mean squat you can bother to list your degrees but since you seem to lack even a rudimentary scientific education (im a business major and im required to take this course) then doing so will be worthless\n \n no wonder this board seemed to have died, antagonism must be an evolutionist debate technique, no wait, i would be wrong there, nothing wrong with evolutionists themselves saying so would be like your \"creationist tripe\" argument, the problem must be just you, hopefully this will be my last post, too bad i had to stoop to your level", 
   {}, 
   48592, 
   null, 
   1084067820.0
  ], 
  [
   48667, 
   null, 
   "ober-unger", 
   "I see. So you are saying that you aren't able to actually explain the \"holes\" in the theories of evolution. Neither are you able to explain why they are holes. Of course, you can't offer any better explanation either. Why am I not surprised. It is quite typical of a creationist.\n \n By the way, I missed your apology for falsely claiming that I had called you an idiot. Should I conclude that you did so intentionally? It seems that we should place no confidence in anything that you have to say.\n \n I think that you should have payed closer attention since you don't seem to have grasped key concepts about science - for example, what it is and how it works. To illustrate your failure to learn the basics, you continue to talk about how science can prove something, a sure indication that you fail to understand the inductive nature of the scientific method.\n \n Also you might explain how your introductory book on physical science is applicable to evolutionary biology. Perhaps you didn't notice that the title of this forum is \"Creation vs Evolution.\" Since your physical science book doesn't deal with evolution, we must conclude that you are talking about creationism. That is also typical of creationists. Creationists invent straw man science to argue against and proudly claim that they have defeated evolution. And of course, the holes that you think you see aren't really there.\n \n Are they going to make you retake that physical science course?", 
   {}, 
   48596, 
   null, 
   1084115340.0
  ], 
  [
   48677, 
   null, 
   "CCR1994", 
   "It seems to me perfectly reasonable to raise objections to any theory if evidence discovered by others challenges that theory. The debate taking place here is more a contest of egos driven by a desire to win an argument rather than an oppurtunity to both inform and learn. Science is of little value if challenges to conventional wisdom cannot be raised because of the percieved threat that they pose. There is plenty of reason to question the idea of descent with modification from a common ancestor which is what Darwinian evolution has come to mean and you don't have to be a young earth creationist or a fundamentalist kook or even a religious believer of any kind to see this.", 
   {}, 
   48667, 
   null, 
   1084121160.0
  ], 
  [
   48701, 
   null, 
   "Ursus maritimus", 
   "It seems to me perfectly reasonable to raise objections to any theory if evidence discovered by others challenges that theory.\n\n This is true. This is what makes the theory of evolution such a great theory - it has withstood all the scientific challenges that researchers have thrown at it over the last century and a half. Sadly, the main challenge it faces today is political.\n \n -\n \n \n...you don't have to be a young earth creationist or a fundamentalist kook or even a religious believer of any kind to see this.\n\n No, you only have to be fooled by the lies and misrepresentations by said young earth creationists, fundamentalist kooks, and religious believers.", 
   {}, 
   48677, 
   null, 
   1084128180.0
  ], 
  [
   48727, 
   null, 
   "Close_slave_can", 
   "There is plenty of reason to question the idea of descent with modification from a common ancestor which is what Darwinian evolution has come to mean and you don't have to be a young earth creationist or a fundamentalist kook or even a religious believer of any kind to see this.\n\n \n \n what is this evidence?\n Also in ober-ungers defence I will say I really don't think his posts contain malice so I would advise people not to interept them as insults.", 
   {}, 
   48677, 
   null, 
   1084145580.0
  ], 
  [
   48763, 
   null, 
   "Maineiac", 
   "Evolution is as much a theory as the creation theory. I'v seen evidence from both theorys, and find that there is no conclusive evidence to either.", 
   {}, 
   48727, 
   null, 
   1084163040.0
  ], 
  [
   48785, 
   null, 
   "thebootfitter", 
   "Evolution is as much a theory as the creation theory. I'v seen evidence from both theorys, and find that there is no conclusive evidence to either.\n\n He, he, he...\n \n They just don't give up, do they? ;)\n \n Maineiac -- Explain the theory of evolution. Then explain the 'creation theory.' List the 'evidence' that you have seen that supports the 'creation theory.' I have seen plenty that supports the evolution, so I don't need you to list that, but I have never seen one shred of evidence that supports a literal interpretation of the Genesis account of creation. If you say you have seen some, please share it.\n \n BTW... You will not find any scientific evidence on websites like answers in genesis. You will find several straw man arguments. You will find quotations from scientists that have been taken out of context, and you will find quotations from PhD's who are making a statement regarding something that is outside their field of study. If you find any actual scientific evidence anywhere that supports a literatal interpretation of the Genesis account of creation, I encourage you to post it here. Please.", 
   {}, 
   48763, 
   null, 
   1084202340.0
  ], 
  [
   48968, 
   null, 
   "Maineiac", 
   "He, he, he...\n \n They just don't give up, do they? ;)\n \n Maineiac -- Explain the theory of evolution. Then explain the 'creation theory.' List the 'evidence' that you have seen that supports the 'creation theory.' I have seen plenty that supports the evolution, so I don't need you to list that, but I have never seen one shred of evidence that supports a literal interpretation of the Genesis account of creation. If you say you have seen some, please share it.\n \n BTW... You will not find any scientific evidence on websites like answers in genesis. You will find several straw man arguments. You will find quotations from scientists that have been taken out of context, and you will find quotations from PhD's who are making a statement regarding something that is outside their field of study. If you find any actual scientific evidence anywhere that supports a literatal interpretation of the Genesis account of creation, I encourage you to post it here. Please.\n \n \n Thanks, but no thanks. You seem total convinced on the evolution theory, and I seriously doubt I would change your mind.\n \n I get the impression you think I support the creation theory. To believe in that theory, one must be a true believer in the concept of God, and that God created man. Now if you read Genesis, you read the same thing I did,so there is no point in me explaining that to you either.\n \n To believe in the theory of evolution, on must first decide what man evolved from. Did we come from apes, sea creatures, or some sort of organism.\n \n The point I was making was that they are all theorys.\n \n Personally, I tend to go with the theory of evolution, though I'm still not sold on which particular theory I believe is best. \n \n I think we evolved from the sea. This theory makes the most sence to me as it would explain how a human life form could be self-sufficent at a very young age, without the help of a mature adult. As we evolved, we were able to spend more time out of the water ,eventually adapting to land.As we adapted to land, we eventually were able to walk upright.\n \n This is my non-scientific theory.\n \n Theorys are like opinions, everyone has one.", 
   {}, 
   48785, 
   null, 
   1084237980.0
  ], 
  [
   48969, 
   null, 
   "Tastyfish", 
   "It is absolutely definite we descended from apes, I thnk you are getting a little confused by the 'aquatic ape hypothesis' that has us from a shore line ape, its justification being a primarily swimming ape would loose a lot of its hair, have similar fat deposits as we do (though there is dubiosity aorund this one), develop a more complex breath control from needing to hold its breath voluntarily which would lend itself to the development of complex speech, have the swimming instinct we do (new borns can swim instantly, but lose it shortly afterward), not be worried by our inefficent cooling system (we lose too much water really for a desert animal) and have a higher protein diet from fish useful for developing brains. However there is a lot of problems with it which I am sure someone would point out. It was still a homonid though, not some other aquatic creature.\n Oh yeah, compared to oter creatures we are stupidly slowly developing, apes and such like can live alone much sooner, but that is to do with losing instincts and being born 'prematurely' to let us get our oversized skulls out when born.", 
   {}, 
   48968, 
   null, 
   1084238460.0
  ], 
  [
   49058, 
   null, 
   "thebootfitter", 
   "Thanks, but no thanks. You seem total convinced on the evolution theory, and I seriously doubt I would change your mind.\n\n I am not convinced of anything except that what is, is. Truth is truth... whatever that truth may be. Personally, I think it would be pretty amazing if actual scientific evidence were presented that supports a literal interpretation of Genesis. \n \n You said that you have seen evidence that supports the creation theory. I asked you to share that evidence. You didn't share it because you \"doubt [that you] would change [my] mind.\" Hmm... I am left wondering if you really have seen any actual physical evidence that supports creation? It's possible, but since I'm not aware of any in existence, and since the existence of such evidence would be pretty big news, I kind of doubt that you have seen any such thing. \n \n \n \nThe point I was making was that they are all theorys.\n ...\n Theorys are like opinions, everyone has one.\n\n Perhaps... under the everyday usage of the word 'theory.' But evolution and creation are not equal as theories... because evolution is a scientific theory and creation is not. What is a scientific theory? That's why I asked you to explain the theory of creation... so that you can try and spell it out for yourself and recognize that it is not a scientific theory.", 
   {}, 
   48968, 
   null, 
   1084289640.0
  ], 
  [
   49064, 
   null, 
   "Eddie", 
   "All theories are not just theories. Unlike many theories, the theory of evolution is a theory that has not yet been falsified. And as far as I know, there are no rivaling theory to the theory of evolution that has not been falsified...", 
   {}, 
   49058, 
   null, 
   1084291680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  This board seems to have died", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2314-board-seems-have-died.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 2314, 
  "discussion_files": [
   [
    "513.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2314-board-seems-have-died-print.html"
   ], 
   [
    "514.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2314-board-seems-have-died-3-print.html"
   ], 
   [
    "515.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2314-board-seems-have-died-2-print.html"
   ]
  ], 
  "identifier": 2314
 }
]