[
 [
  [
   47375, 
   null, 
   "Waxy", 
   "I was having lunch at PJ's with one of my favorite clients last week and the conversation turned to the Bush government's recent round of tax cuts. \"I'm opposed to those tax cuts,\" the retired college instructor declared, \"because they benefit the rich. The rich get much more money back than ordinary taxpayers like you and I and that's not fair.\"\n \n \"But the rich pay more in the first place,\" I argued, \"so it stands to\n reason that they'd get more money back.\" I could tell that my friend was unimpressed by this meager argument. Even college instructors are a prisoner of the myth that the \"rich\" somehow get a free ride in USA. Nothing could be further from the truth.\n \n Let's put tax cuts in terms everyone can understand. Suppose that everyday 10 men go to PJ's for dinner, The bill for all ten comes to $100. If it was paid the way we pay our taxes, the first four men would pay nothing; the fifth would pay $1; the sixth would pay $3; the seventh $7; the eighth $12; the ninth $18. The tenth man (the richest) would pay $59.\n \n The 10 men ate dinner in the restaurant every day and seemed quite happy with the arrangement until the owner threw them a curve. Since you are all such good customers, he said, I'm going to reduce the cost of your daily meal by $20. Now dinner for the 10 only costs $80.\n \n The first four are unaffected. They still eat for free. Can you figure out how to divvy up the $20 savings among the remaining six so that everyone gets his fair share? The men realize that $20 divided by 6 is $3.33, but if they subtract that from everybody's share, then the fifth man and the sixth man would end up being paid to eat their meal. The restaurant owner suggested that it would be fair to reduce each man's bill by roughly the same amount and he proceeded to work out the amounts each should pay.\n \n And so the fifth man paid nothing, the sixth pitched in $2, the seventh paid $5, the eighth paid $9, the ninth paid $12, leaving the tenth man with a bill of $52 instead of $59. Outside the restaurant, the men began to compare their savings.\n \n \"I only got a dollar out the $20,\" declared the sixth man pointing to the tenth, \"and he got $7!\" \"Yeah, that's right,\" exclaimed the fifth man. I only saved a dollar, too. It's unfair that he got seven times more than me! \"That's true,\" shouted the seventh man. \"Why should he get $7 back when I got only $2? The wealthy get all the breaks.\" \"Wait a minute,\" yelled the first four men in unison. \"We didn't get anything at all. The system exploits the poor.\" \n \n The nine men surrounded the tenth and beat him up. The next night he didn't show up for dinner, so the nine sat down and ate without him. But when it came time to pay the bill, they discovered something important. They were $52 short!\n \n And that, boys and girls, and college instructors, is how the US's tax system works. The people who pay the highest taxes get the most benefit from a tax reduction. Tax them too much, attack them for being wealthy, and they just may not show up at the table anymore. There are lots of good restaurants in Switzerland and the Caribbean.\n \n Waxy", 
   {
    "post_info": {
     "post_title": "Tax Cuts - A Telling Story"
    }
   }, 
   null, 
   null, 
   1083609000.0
  ], 
  [
   47381, 
   null, 
   "Big Orn", 
   "I think I'll print that and attach to the door of my office. No more whining about the tax-cuts!!! emoticon_smile \n \n Good one! emoticon_xgood", 
   {}, 
   47375, 
   null, 
   1083609480.0
  ], 
  [
   49067, 
   null, 
   "Eddie", 
   "The question is of course where the tax cut comes from... If it comes from cut backs in the public sector, it`s probably a net loss for those who don`t pay taxes at all, as well as those who pay the smaller share. If it comes from loans, you are taking it from future generations. If it comes from the military, it could be argued to be a net loss for those who pays nothing or little (as they loose \"national security\"). If its a tax cut based on increased revenues, no one is actually hurt (except in relative terms).", 
   {}, 
   47381, 
   null, 
   1084292280.0
  ], 
  [
   49146, 
   null, 
   "georged", 
   "The question is of course where the tax cut comes from... If it comes from cut backs in the public sector, it`s probably a net loss for those who don`t pay taxes at all, as well as those who pay the smaller share. If it comes from loans, you are taking it from future generations. If it comes from the military, it could be argued to be a net loss for those who pays nothing or little (as they loose \"national security\"). If its a tax cut based on increased revenues, no one is actually hurt (except in relative terms).\n\n \n That's one of the more interesting debates about current US tax cuts, as to who's actually picking up the tab. Those in favor are believers in tax cuts generating increased commercial activity, a correct assumption under past economic conditions, and those against pointing out that in the current economic environment it amounts to reduced tax revenue being subsidized by expanded debt. \n \n In an economy that's primarily driven by consumer and government spending based on debt without true economic growth, those who pay no or few taxes receive direct benefits with refunds such as last year's dependent refund, but will eventually suffer when the debt incurred from reduced revenue forces cutbacks in social services used primarily by that income group. As a double whammy, those not participating in the direct refunds, those taxpayers who shoulder the bulk of our tax burden, will service the debt incurred due to the reduced revenue, which is a basically a form of redistribution of wealth. Spending money you don't have without assured replenishment is ugly no matter where you stand. Unless, of course, you're a politician being re-elected into that life of power and seemingly unlimited benefits and perks.", 
   {
    "unicode_changes_made": true
   }, 
   49067, 
   null, 
   1084313160.0
  ], 
  [
   49563, 
   null, 
   "Maineiac", 
   "Good one Waxy That is explaining it in simple terms. \n \n I don't have a problem with the rich getting the bigger tax cut, I have a problem with the whole tax cut plan period. \n \n Everyone sees the short term gains. It's the long term affect that it will have that I'm concerned about.", 
   {
    "post_info": {
     "post_title": "Waxy"
    }
   }, 
   49146, 
   null, 
   1084413240.0
  ], 
  [
   49575, 
   null, 
   "sglaine", 
   "Yep the richer get richer. Bush knock off a 1/3 of his taxes this. Because of his generous tax break for the rich. yea somepeople got breaks but not like his.", 
   {}, 
   49563, 
   null, 
   1084415220.0
  ], 
  [
   49678, 
   null, 
   "jim's trucking", 
   "The tax cuts were for everybody.\n \n Here's a little study about how tax rates affect the economy.\n \n Kerry would ruin what we have going.\n \n \n \n http://www.ncpa.org/studies/s159/s159.html", 
   {}, 
   49575, 
   null, 
   1084475760.0
  ], 
  [
   49688, 
   null, 
   "georged", 
   "We're still talking basic finance; revenue less expenses equals a plus or minus. If a minus, it becomes national debt. If tax cuts do not generate enough additional revenue to replace the lost revenue (tax cuts), they're defined as an economic policy failure regardless of the political spin. Regan's worked because we had an industrial base that could still respond to stimulation. We're now a service level economy. Since 2000, we've actually had a decrease in personal and corporate tax revenue, the first time that has happened since the 1920s. Most economists now book the tax cuts directly as lost revenue for purposes of forecasting. Examine the composition of our budget and the loss of revenue from tax cuts stands out like a sore thumb as a contribution to the deficit.\n \n Maybe the general public believes tax cuts are stimulating our economy due to the massive media coverage afforded them as a political campaign plank, but that's just more hogwash to give them a warm fuzzy feeling before the piper eventually puts out both hands for payment.\n \n It doesn't matter who's in office, spending vast amounts of money that's just not there is irresponsible.", 
   {}, 
   49678, 
   null, 
   1084478220.0
  ], 
  [
   49692, 
   null, 
   "jim's trucking", 
   "We're still talking basic finance; revenue less expenses equals a plus or minus. If a minus, it becomes national debt. If tax cuts do not generate enough additional revenue to replace the lost revenue (tax cuts), they're defined as an economic policy failure regardless of the political spin. Regan's worked because we had an industrial base that could still respond to stimulation. We're now a service level economy. Since 2000, we've actually had a decrease in personal and corporate tax revenue, the first time that has happened since the 1920s. Most economists now book the tax cuts directly as lost revenue for purposes of forecasting. Examine the composition of our budget and the loss of revenue from tax cuts stands out like a sore thumb as a contribution to the deficit.\n \n Maybe the general public believes tax cuts are stimulating our economy due to the massive media coverage afforded them as a political campaign plank, but that's just more hogwash to give them a warm fuzzy feeling before the piper eventually puts out both hands for payment.\n \n It doesn't matter who's in office, spending vast amounts of money that's just not there is irresponsible.\n\n \n I agree with some of what you say. The government certainly needs to cut spending. A great deal of government spending could be avoided by firing about half of the government employees...we certainly don't need them.\n \n One thing we may disagree about...corporations don't pay taxes. They may appear to pay \"corporate taxes\" but these are simply passed on to the consumers.", 
   {}, 
   49688, 
   null, 
   1084479360.0
  ], 
  [
   49698, 
   null, 
   "Eddie", 
   "One thing we may disagree about...corporations don't pay taxes. They may appear to pay \"corporate taxes\" but these are simply passed on to the consumers.\n\n \n Or the workers, or the owners. I would say that it is still fruitfull to talk about corporate taxes as they are quite different from tax on consumption.", 
   {}, 
   49692, 
   null, 
   1084479780.0
  ], 
  [
   49700, 
   null, 
   "jim's trucking", 
   "Or the workers, or the owners. I would say that it is still fruitfull to talk about corporate taxes as they are quite different from tax on consumption.\n\n \n If \"corporate taxes\" are passed on to the consumers, how are they \"quite different\" from consumer taxes?", 
   {}, 
   49698, 
   null, 
   1084479900.0
  ], 
  [
   49702, 
   null, 
   "Eddie", 
   "If \"corporate taxes\" are passed on to the consumers, how are they \"quite different\" from consumer taxes?\n\n \n As they might as well be passed on to the workers or the owners as well. And quite probably a mix of all three.", 
   {}, 
   49700, 
   null, 
   1084480200.0
  ], 
  [
   49707, 
   null, 
   "jim's trucking", 
   "As they might as well be passed on to the workers or the owners as well. And quite probably a mix of all three.\n\n \n Do you mean by decreased wages? This would encourage workers to find other jobs?\n \n Do you mean by decreases in profits? This is highly unlikely as owners are in business (or buy stock in the business) for profit.\n \n \"Corporate taxes\" are generally paid by the consumer by way of pricing of the goods and services provided by the corporation.", 
   {}, 
   49702, 
   null, 
   1084480680.0
  ], 
  [
   49712, 
   null, 
   "Eddie", 
   "Do you mean by decreased wages? This would encourage workers to find other jobs?\n \n Do you mean by decreases in profits? This is highly unlikely as owners are in business (or buy stock in the business) for profit.\n \n \"Corporate taxes\" are generally paid by the consumer by way of pricing of the goods and services provided by the corporation.\n\n \n It is for the individual company to decides which allocation produces the largest surplus. Just like workers and owners shy away from increased costs, so does the consumer. If the product is too costly, the consumer goes somewhere else.", 
   {}, 
   49707, 
   null, 
   1084481940.0
  ], 
  [
   49717, 
   null, 
   "jim's trucking", 
   "It is for the individual company to decides which allocation produces the largest surplus. Just like workers and owners shy away from increased costs, so does the consumer. If the product is too costly, the consumer goes somewhere else.\n\n \n Granted...", 
   {}, 
   49712, 
   null, 
   1084482420.0
  ], 
  [
   49769, 
   null, 
   "georged", 
   "One thing we may disagree about...corporations don't pay taxes. They may appear to pay \"corporate taxes\" but these are simply passed on to the consumers.\n\n \n A provision for taxes is part of any corporate income statement. It's commonly referred to as a 'below the line' item, which is subtracted from net profit. Passing that on is just another cost of doing business and determines your profitability. That's since the beginning of organized society when farmers gave a certain amount of harvest to the king for providing the army that protected them. Like the farmer, larger corporations have to make sure they still have enough to pay stockholders, so think of it as the farmer having enough crop left to feed himself and his family after the King's share. You can complicate it a little to have a better relation to contemporary society; If the king demands too much, the farmhands demand too much and the King's tax collector insures his brother of a job by having the king implement farm safety devices his brother can inspect, there won't be enough left over for the farmer, so he gets a regular job and buys his food from King X's nation, where the farmer has lower costs and can sell part of his crops. \n \n You can easily relate that to tax cuts by being the king and letting the farmer give less crop share each year by borrowing money from the hunger god, but the farmer will still owe the crop share plus interest to the hunger god. Eventually, the farmer can't grow enough to feed more than the king and compounded interest to the hunger god, but the king will still be fat. And all of a sudden the hunger god will want all the outstanding crop debt to loan to the Chinese, who grow more profitable crops and pay higher interest.", 
   {}, 
   49692, 
   null, 
   1084487880.0
  ], 
  [
   49773, 
   null, 
   "sglaine", 
   "The tax cuts were for everybody.\n \n Here's a little study about how tax rates affect the economy.\n \n Kerry would ruin what we have going.\n \n \n \n http://www.ncpa.org/studies/s159/s159.html\n\n Yes there were tax cuts But the point you are missing is that gready BUSH worked it so that his weathy class got more of a break then the other class. There was nothing fair about his tax cuts unless you are in his class. emoticon_xangel", 
   {}, 
   49678, 
   null, 
   1084488240.0
  ], 
  [
   49786, 
   null, 
   "georged", 
   "Yes there were tax cuts But the point you are missing is that gready BUSH worked it so that his weathy class got more of a break then the other class. There was nothing fair about his tax cuts unless you are in his class. emoticon_xangel\n\n \n Just a thought; are you aware of who pays the bulk of personal income taxes? And who pays few or none? Re-read the opening post of this thread.", 
   {}, 
   49773, 
   null, 
   1084489500.0
  ], 
  [
   49836, 
   null, 
   "sglaine", 
   "Just a thought; are you aware of who pays the bulk of personal income taxes? And who pays few or none? Re-read the opening post of this thread.\n\n We do. Do you really believe that first page. Come on George I know your smarter than that. Now why should we only get for an example 5% break while Bush and all of his rich stuffy types get 20%. Do you see what I am getting at here?? emoticon_xdonno", 
   {}, 
   49786, 
   null, 
   1084497180.0
  ], 
  [
   49842, 
   null, 
   "georged", 
   "No. Those in the 5% bracket, and below, pay few taxes and use a majority of the social services provided by taxes. Those in higher brackets pay the bulk of taxes and provide the investment capital that creates jobs for the low percentage tax payers. Seems simple to me. Cranking up the amount of taxes paid by those who carry the load is like shooting the golden goose after getting an egg or two. You'd see a flight of capital from this country that would turn it into a struggling welfare state. Well, more than it is now.", 
   {}, 
   49836, 
   null, 
   1084498680.0
  ], 
  [
   50252, 
   null, 
   "Broker", 
   "The top marginal rate was only reduced a few percentage points, not 20%. :-\\\n \n Remember that the top 10% pay 67% of all the taxes. Read those numbers! The top 10% of income earners cover more than 2/3s of the tax bill. The remaining 90% of income earners cover less than 1/3.\n \n My plan to change the tax system does involve the rich paying more, the top earners paying 50% (50% period. If you owe state or local income taxes one would subtract those from the federal taxes), but it calls for the elimination of dividend and capital gains taxes, which still allows for investment.\n \n Note that the 50% rate would be for those making 2 million or more... it works out so that people who make $100,000 owe 5% or something. I posted it here before...", 
   {}, 
   49842, 
   null, 
   1084738140.0
  ], 
  [
   50290, 
   null, 
   "georged", 
   "So you're after even higher tax penalties for that percenatage of the population who makes the greatest contributions to enable redistribution of wealth to the lower classes? No wonder off-shore asset trust LLCs are growing in popularity.", 
   {}, 
   50252, 
   null, 
   1084759680.0
  ], 
  [
   51160, 
   null, 
   "drone001", 
   "\n Let's put tax cuts in terms everyone can understand. Suppose that everyday 10 men go to PJ's for dinner, The bill for all ten comes to $100. If it was paid the way we pay our taxes, the first four men would pay nothing; the fifth would pay $1; the sixth would pay $3; the seventh $7; the eighth $12; the ninth $18. The tenth man (the richest) would pay $59.\n \n\n \n You for got to mention that the richest man put his bill on his company's credit card. So, he can declare it a buisness expense and get the whole thing back from corporate tax breaks. Since he owns the company it goes back into his pocket. Which means in the long run he paid $0.", 
   {}, 
   47375, 
   null, 
   1085017080.0
  ], 
  [
   51164, 
   null, 
   "georged", 
   "You for got to mention that the richest man put his bill on his company's credit card. So, he can declare it a buisness expense and get the whole thing back from corporate tax breaks. Since he owns the company it goes back into his pocket. Which means in the long run he paid $0.\n\n \n No, he increased his company's operating expense, reducing his pre-tax net profits by the amount of the bill. That also raised his operating capital requirements by the amount of the expense, normally tied to a revolving credit line which incurrs interest expense below the line, further reducing net profit. If he paid for it out of his own pocket, in his personal tax bracket he paid even more.", 
   {}, 
   51160, 
   null, 
   1085018400.0
  ], 
  [
   51165, 
   null, 
   "drone001", 
   "Tax them too much, attack them for being wealthy, and they just may not show up at the table anymore.\n\n \n Well I say, if they don't want to pay their fair share. Good riddance. Awww, the poor little rich guy with the million dollar home, 10 cars, yacht, house in the Bahamas, ect., and you know what he wouldn't be that rich if it wasn't for the workers in his company. Living in their apartment, with children, debts and bill, that they can't pay, because the rich guy moved their jobs over seas so he can make more money.", 
   {}, 
   47375, 
   null, 
   1085018760.0
  ], 
  [
   51167, 
   null, 
   "drone001", 
   "No, he increased his company's operating expense, reducing his pre-tax net profits by the amount of the bill. That also raised his operating capital requirements by the amount of the expense, normally tied to a revolving credit line which incurrs interest expense below the line, further reducing net profit. If he paid for it out of his own pocket, in his personal tax bracket he paid even more.\n\n \n OK, whatever you say.", 
   {}, 
   51164, 
   null, 
   1085018820.0
  ], 
  [
   51171, 
   null, 
   "georged", 
   "Well I say, if they don't want to pay their fair share. Good riddance. Awww, the poor little rich guy with the million dollar home, 10 cars, yacht, house in the Bahamas, ect., and you know what he wouldn't be that rich if it wasn't for the workers in his company. Living in their apartment, with children, debts and bill, that they can't pay, because the rich guy moved their jobs over seas so he can make more money.\n\n \n That's the basis of our economic system, capitalism. Those with the gift of business ability and timing or capital to invest with those individuals amass wealth, others work for that person. To suggest he share his wealth on an equal basis would destroy any motivation to acquire wealth or take it out of the realm of organized society. If the workers raise their standard of living to a point where the rich man's products are too expensive to be sold, he seeks out lower costs to remain in business while retaining and expanding his wealth. Nobdy ever said life was supposed to be fair or easy, we just had a long run of prosperity that happens to be declining. Most people who work for a living are still maintaining the same lifestyles, no savings and enormous personal debt, disasters waiting to happen.", 
   {}, 
   51165, 
   null, 
   1085019720.0
  ], 
  [
   51172, 
   null, 
   "drone001", 
   "No, he increased his company's operating expense, reducing his pre-tax net profits by the amount of the bill. That also raised his operating capital requirements by the amount of the expense, normally tied to a revolving credit line which incurrs interest expense below the line, further reducing net profit. If he paid for it out of his own pocket, in his personal tax bracket he paid even more.\n\n \n Let me ask you a question. Do you know what a tax right off is? If you don't let me explain. After you figure out how much you need to pay in corporate taxes, the accountant takes all of the business related purchases and deduct them from the amount you need to pay in taxes. If you got a really good accountant you could get a tax return. \n \n And since the rich guy owns the company he decides what a business related purchase is. All he has to do is ask the guy next to him how the company he works for is doing, and walla, a business lunch.", 
   {}, 
   51164, 
   null, 
   1085019720.0
  ], 
  [
   51174, 
   null, 
   "drone001", 
   " To suggest he share his wealth on an equal basis would destroy any motivation to acquire wealth or take it out of the realm of organized society\n\n \n No he doesn't have to share, just pay his fair share. The more money you make, the more money you pay. Isn't that the basis of our tax system? If they don't like it they can get the heck out of America. \n \n You know it says All men are created equal. Not All men are created equally within their own tax bracket.", 
   {}, 
   51171, 
   null, 
   1085020020.0
  ], 
  [
   51184, 
   null, 
   "Broker", 
   "I intend to be one of those top bracket people, and I wouldn't mind paying a lot out if I made so much money. If I had 2 million dollars and I paid 1 million dollars to the government I'm still happy... I've got another million dollars.\n \n Most rich people make their money out of the equity markets. Those taxes would be gone completely gone, encouraging more investment and still leaving people with a lot of their money.", 
   {}, 
   51174, 
   null, 
   1085021520.0
  ], 
  [
   51302, 
   null, 
   "Waxy", 
   "Drone,\n \n What you describe is not America, it's Cuba or China. You may find you'd be a lot happier in one of those countries. They have an economic system that you seem to be really fond of - communism. \n \n The rich should pay their fair share - WHAT A CROCK. READ THE STATS! THEY PAY WAY MORE THAN THEIR FAIR SHARE. Obviously the whole point of that story was lost on you.\n \n Write offs - you clearly don't understand them, so don't attempt to lecture others about them. You have the typical attitude that \"rich people\" or \"business people\" just write off everything and never pay taxes. NOTHING COULD BE FURTHER FROM THE TRUTH. Tax write offs are largely a myth, and even when used to their maximum benefit, they still only return a portion of the dollar spent equal to that of your tax rate.\n \n When faced with the facts your response was \n \n \nOK, whatever you say.\n\n \n Way to back up your assertions with logical evidence and proof.\n \n If you say \"good riddance\" to that rich guy, he'll say good riddance to you. I know who'll suffer more for it. \n \n It's unfortunate that jealousy becomes contempt.\n \n Waxy", 
   {}, 
   51184, 
   null, 
   1085070780.0
  ], 
  [
   51324, 
   null, 
   "georged", 
   "Let me ask you a question. Do you know what a tax right off is? If you don't let me explain. After you figure out how much you need to pay in corporate taxes, the accountant takes all of the business related purchases and deduct them from the amount you need to pay in taxes. If you got a really good accountant you could get a tax return. \n \n And since the rich guy owns the company he decides what a business related purchase is. All he has to do is ask the guy next to him how the company he works for is doing, and walla, a business lunch.\n\n \n I do know what a tax write-off is and is not. I'm a graduate accountant from an accredited college and can assure you that your definition has no relation whatsoever to generally accepted accounting procedures or allowed tax filing procedures. I spent a lot of years within the corporate world on the treasury side including service as a corporate officer and suggest that you might want to consider a field other than finance or economics as a profession, unless, using your definition of accounting, jail seems appealing. I'm not flaming you, but say this out of real concern that you might apply your accounting beliefs to a valid situation.", 
   {
    "unicode_changes_made": true
   }, 
   51172, 
   null, 
   1085077800.0
  ], 
  [
   51328, 
   null, 
   "georged", 
   "And since the rich guy owns the company he decides what a business related purchase is. All he has to do is ask the guy next to him how the company he works for is doing, and walla, a business lunch.\n\n \n In the US, only the IRS determines what can be classified as a business expense. Lunches and other expenditures are reduced for tax purposes.", 
   {}, 
   51172, 
   null, 
   1085078400.0
  ], 
  [
   51331, 
   null, 
   "georged", 
   "My plan to change the tax system does involve the rich paying more, the top earners paying 50% (50% period. If you owe state or local income taxes one would subtract those from the federal taxes), but it calls for the elimination of dividend and capital gains taxes, which still allows for investment.\n\n \n Most of the truly wealthy people I know would love that, as their incomes are primarily dependent on dividends and capital gains. All that would do is put a greater load on people subject to employment-based taxes, destroy their motivation and greatly reduce the size of government. I like the idea, but who would pay for the guarded, huge walls around inner-city areas necessary to forcibly contain that mass of displaced civil service employees, perpetual grant students and former welfare recipients?", 
   {}, 
   50252, 
   null, 
   1085079300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Tax Cuts - A Telling Story", 
  "url": "http://www.4forums.com/political/tax-debates/2318-tax-cuts-telling-story.html", 
  "breadcrumbs": [
   "Tax"
  ], 
  "id_number": 2318, 
  "discussion_files": [
   [
    "10538.html", 
    "http://www.4forums.com/political/tax-debates/2318-tax-cuts-telling-story-print.html"
   ], 
   [
    "10539.html", 
    "http://www.4forums.com/political/tax-debates/2318-tax-cuts-telling-story-3-print.html"
   ], 
   [
    "10540.html", 
    "http://www.4forums.com/political/tax-debates/2318-tax-cuts-telling-story-2-print.html"
   ]
  ], 
  "identifier": 2318
 }
]