[
 [
  [
   2283, 
   null, 
   "Tim", 
   "Who is the biggest threat to world peace? In a recent survey conducted in England, 23% said it was Iraq. 27% said it was North Korea. 32% said it was the US.\n \n http://www.cnn.com/2003/WORLD/europe/02/11/british.survey/index.html", 
   {
    "post_info": {
     "post_title": "Who is the biggest threat to world peace?"
    }
   }, 
   null, 
   null, 
   1045386120.0
  ], 
  [
   2308, 
   null, 
   "Stormin Norman", 
   "XXXXXX. Perhaps they will better understand the threat when one of the bio-chemical attacks being planned for that region actually succeeds, and happens to bipass the intelligence community's defenses. Ricin conspiracies, chemical weapons suits, and chlorine gas releases in their subway system should be of more concern to them than a strong ally.\n \n I couldn't vote, because I believe the extent of this axis of evil might be more illusive than first suspected. Certain European countries are acting quite strange, and I am not sure that their reasons are as benign as the economic interests that I have sighted. I get the sense that we are walking into a trap by charging into Iraq. Of course, it is necessary for us to do so. However, I think only after we set a chain reaction of events into motion, will we know the truth about the insidious conspiracy that is once again amassing in the world. Certainly much of the events that are occurring on the world stage are part of a premeditated plot to destroy the United States. The extent of the problem remains unclear.", 
   {}, 
   2283, 
   null, 
   1045411020.0
  ], 
  [
   2555, 
   null, 
   "gilligan8503", 
   "there was a survey done by some un people...these people vistited many cities in all countries; i dont know exactly how it was done but the funny thing is that Washington D.C. was the most socialist city in the world.\n \n i didnt know we were socialist....goes to show you.", 
   {}, 
   2283, 
   null, 
   1045664340.0
  ], 
  [
   2558, 
   null, 
   "Broker", 
   "Pressure groups have a ton of people there...who do you think organizes those rallies? Communist groups are behind them.", 
   {}, 
   2283, 
   null, 
   1045665660.0
  ], 
  [
   5205, 
   null, 
   "JFriday", 
   "Perhaps if the U.S. was to stop all aid and let everyone we did not like feel the strength in our steel then perhaps we would be the biggest threat to world peace. World peace, the words of wishful thinking, there has never been, or will there ever be as long as people like Sadam remain in power or even in the world itself. We must protect ourselves from those that would do us harm, there is no comprimise on the subject.", 
   {}, 
   2283, 
   null, 
   1048180200.0
  ], 
  [
   5246, 
   null, 
   "Broker", 
   "Maybe we should threaten to stop feeding 60% of the world. Maybe we should withdraw our troops from UN peacekeeping forces. Let's get out of Germany. Let's leave South Korea and let North Korea come back in. Leave Afghanistan while it's weak and let evil take control. Maybe we should leave Iraq alone and let Saddam work on his nuke. Without our troops or threat of attack there would be no inspections.", 
   {}, 
   2283, 
   null, 
   1048204980.0
  ], 
  [
   5831, 
   null, 
   "Madison05", 
   "ok, i did the little vote thing at the top of the page, and ya know what, i agree with 32% of people. the U.S. is defenitly the biggest threat in the world. we stick our noses in other countries buissnes and when we do go to war we excpect everyone to jump up and say \"oh, praise the Lord. The Americans have come. We're going to surrender immediatly and not even fight because we don't want to lose our lives.\" hold up, reality check! some armys are totally dedicated to their leaders and would die for them. take saddam's army in baghdad, i can't remember what they're called by they're supposed to be some of the fiercest fighters ever and really cause a lot of damage to the U.S. military. and then there's the small children in iraq that are shooting at our troops. and so naturally they are shooting back and killing them. i think that America kills needlessly and with out reason. if we had just backed off from the rest of the world and allowed them to do their own thing 9/11 might not have even happend.", 
   {}, 
   2283, 
   null, 
   1048949280.0
  ], 
  [
   5836, 
   null, 
   "Broker", 
   "Considering that we cannot live without oil, that isn't true.", 
   {}, 
   2283, 
   null, 
   1048962780.0
  ], 
  [
   13732, 
   null, 
   "Chai", 
   "ok, i did the little vote thing at the top of the page, and ya know what, i agree with 32% of people. the U.S. is defenitly the biggest threat in the world. we stick our noses in other countries buissnes and when we do go to war we excpect everyone to jump up and say \"oh, praise the Lord. The Americans have come. We're going to surrender immediatly and not even fight because we don't want to lose our lives.\" hold up, reality check! some armys are totally dedicated to their leaders and would die for them. take saddam's army in baghdad, i can't remember what they're called by they're supposed to be some of the fiercest fighters ever and really cause a lot of damage to the U.S. military. and then there's the small children in iraq that are shooting at our troops. and so naturally they are shooting back and killing them. i think that America kills needlessly and with out reason. if we had just backed off from the rest of the world and allowed them to do their own thing 9/11 might not have even happend.\n\n \n \n I agree, the US will never really have a clean track record. However, thinking on your plane of thought, how is the US so horrible when countries in Africa do ethnic cleansing? We offered to take our troops out of South Korea not too long ago, and they didn't want us to. How is that making the world more warlike? On a bit of a different plane: who said anything about world peace being possible? Before you shoot me down in a rage of fire, YES! I KNOW THAT WE HAVE A LOT OF THINGS WE COULD FIX STILL THAT ISN'T IMPOSSIBLE. I'm not saying we should stop now and say \"oh well, we tried our hardest, this is as peaceful as its going to get\", I'm trying to point out that when you say \"world peace\" you imply all 90+ countries living together without any war anywhere in the world. It is not possible, unless Russeau (sp?) suddenly takes over humanity and messes with our psychological structure. I am one of those people who believes that you will never have all the countries equal to each other, and as long as one country wants what another country has, or one country doesn't like a certain group of people living within its borders, its impossible to have all of the countries be peaceful. I'd say our biggest threat to getting the world working as smoothly as possible is Iraq and Afghanistan, in that order. Get those countries up and running as fast as possible, and show that world that you CAN succesfully rebuild a country.", 
   {}, 
   5831, 
   null, 
   1062026220.0
  ], 
  [
   13897, 
   null, 
   "Morfos", 
   "XXXXXX.\n \n Ummm, the UK has a better education system than we do.", 
   {}, 
   13732, 
   null, 
   1062300660.0
  ], 
  [
   13899, 
   null, 
   "Broker", 
   "Then why is their poverty rate so much higher?", 
   {}, 
   13897, 
   null, 
   1062301140.0
  ], 
  [
   13904, 
   null, 
   "fallingupwards", 
   "Broker, its a fact. They do score higher on tests and are more intelligent. The amount of education in a country doesnt necessarily determine the poverty rate.", 
   {}, 
   13899, 
   null, 
   1062306300.0
  ], 
  [
   13905, 
   null, 
   "Broker", 
   "Show me these facts.", 
   {}, 
   13904, 
   null, 
   1062306600.0
  ], 
  [
   14082, 
   null, 
   "wjim1269", 
   "Broker, its a fact. They do score higher on tests and are more intelligent. The amount of education in a country doesnt necessarily determine the poverty rate.\n\n \n Does your facts include a test of the entire nation at a specific educational point, or just a certain percentage? Many nations only test a certain percentage of students in a specific grade, and some (like China and Japan) only allow the top 10% of students from the elementary grades to enter high school.", 
   {}, 
   13905, 
   null, 
   1062482460.0
  ], 
  [
   14092, 
   null, 
   "AMD4EVER", 
   "World peace is not possible in todays world. There is some truth to the saying that money is the root of all evil. As long as there are rich people and poor people in a world where money is power then there will be jealousy and crime on a small scale. Trying to achieve neightborhood peace is seemingly impossible to some areas of the US so how can we even think that world peace will be possible anytime soon?", 
   {}, 
   14082, 
   null, 
   1062511200.0
  ], 
  [
   16294, 
   null, 
   "theLIBERTARIAN", 
   " the U.S. is defenitly the biggest threat in the world. we stick our noses in other countries buissnes and when we do go to war we excpect everyone to jump up and say \"oh, praise the Lord \n\n \n I agree. When is the last time China sent troops into another country? Or NK? Or even Russia? It has been a long time.\n \n Maybe that is why 9-11 happened here and not Japan, or Hong Kong (\"stick our noses in other countries business\"). We have the power and we actually use it. \n \n It is all perspective, and I agree with you Madison. It is interesting that the LEAST hawkish person in the current administration is Powell.", 
   {
    "unicode_changes_made": true
   }, 
   5831, 
   null, 
   1064038320.0
  ], 
  [
   20547, 
   null, 
   "munkyman", 
   "lazy people", 
   {}, 
   14092, 
   null, 
   1067141040.0
  ], 
  [
   20567, 
   null, 
   "Parcum", 
   "It's ludicrous to believe the U.S. is the biggest threat to world peace because we \"stick our noses into everything\". The United States has an obligation to protect the world. It is our duty as the most powerful nation in the world. When we don't protect the world, we're criticized (such as what happened in Somalia in 1993, World War II, et cetera). What hypocrisy.", 
   {}, 
   20547, 
   null, 
   1067152980.0
  ], 
  [
   21035, 
   null, 
   "theLIBERTARIAN", 
   " The United States has an obligation to protect the world. It is our duty as the most powerful nation in the world. \n\n \n Our duty? You are wrong. You can make it your duty, but I don't see it in the Constitution.", 
   {}, 
   20567, 
   null, 
   1067668080.0
  ], 
  [
   21036, 
   null, 
   "AMD4EVER", 
   "Our duty? You are wrong. You can make it your duty, but I don't see it in the Constitution.\n\n \n He never said it was in our constitution. He basically stated that it would be the duty of the most powerful nation in the world to protect the rest of the world.", 
   {}, 
   21035, 
   null, 
   1067668500.0
  ], 
  [
   21048, 
   null, 
   "theLIBERTARIAN", 
   "He never said it was in our constitution. He basically stated that it would be the duty of the most powerful nation in the world to protect the rest of the world.\n\n \n I didn't say he said it was in the Constitution. I said it wasn't it the Constitution. \n \n We are constantly interfering in other countries affairs. We helped Saddam come to power and then gave him weapons to fight Iran. We installed and supported the Shah of Iran. That was very unpopular. Now we have not had relations with Iran for over two decades. We supplied the Freedom Fighters in Afghanistan against the Russians. Now, we fear the Stinger Missiles we supplied them will be modified and used against commercial jets (They may have already been used against commercial jets in Africa).\n \n We make a mess of the things by doing our \"duty\".", 
   {
    "unicode_changes_made": true
   }, 
   21036, 
   null, 
   1067677860.0
  ], 
  [
   21079, 
   null, 
   "AMD4EVER", 
   "I didn't say he said it was in the Constitution. I said it wasn't it the Constitution. \n\n \n So you brought up the constitution for no real reason then?\n \n \nWe are constantly interfering in other countries affairs. We helped Saddam come to power and then gave him weapons to fight Iran. We installed and supported the Shah of Iran. That was very unpopular. Now we have not had relations with Iran for over two decades. We supplied the Freedom Fighters in Afghanistan against the Russians. Now, we fear the Stinger Missiles we supplied them will be modified and used against commercial jets (They may have already been used against commercial jets in Africa).\n\n \n Are you suggesting this means we should stop playing the role of world police? If not, what are you suggesting here?\n \n \nWe make a mess of the things by doing our \"duty\".\n\n \n Would you agree or disagree that if we were to become isolationists that just as many if not more problems would occur than are occurring right now because of us?", 
   {
    "unicode_changes_made": true
   }, 
   21048, 
   null, 
   1067756820.0
  ], 
  [
   21088, 
   null, 
   "theLIBERTARIAN", 
   "So you brought up the constitution for no real reason then? \n\n \n Why would you say that? I think it is beyond the scope of the constitution to tinker in other countries affairs.\n \n \n Are you suggesting this means we should stop playing the role of world police? If not, what are you suggesting here? \n\n \n I am suggesting we should not be the world's police.\n \n \n Would you agree or disagree that if we were to become isolationists that just as many if not more problems would occur than are occurring right now because of us? \n\n \n I am not an isolationist because I believe in free trade. I am a non-interventionist though. I really do think we would have fewer problems if we did not meddle in other countries affairs. \n \n We helped Saddam come to power and armed him in the first place. We installed the Shah in Iran, a very unpopular move, and we have not had relations for two decades. We armed the Mujahideen in Afghanistan and now worry about Stingers used against our own commercial jets. Our interventionist policies have caused many problems. \n \n You ask some good questions and thanks for letting me clarify my position. I might add: It is more a matter of principle. I favor a very limited government.\n \n Footnote: I reluctantly supported the invasion of Afghanistan because we were attacked. But I do think if we had implemented the policies I (and other Libertarians) advocated terrorists would have been less interested in attacking us on 9-11.", 
   {
    "unicode_changes_made": true
   }, 
   21079, 
   null, 
   1067759220.0
  ], 
  [
   35496, 
   null, 
   "fracas", 
   "Broker, its a fact. They do score higher on tests and are more intelligent. The amount of education in a country doesnt necessarily determine the poverty rate.\n\n \n LOL\n so higher test score = more intelligent?\n LOL\n \n \nI agree. When is the last time China sent troops into another country? Or NK? Or even Russia? It has been a long time.\n \n Maybe that is why 9-11 happened here and not Japan, or Hong Kong (\"stick our noses in other countries business\"). We have the power and we actually use it. \n\n \n it was never really about presence of troops abroad\n it has always been about the US' cultural export first, than political ideologies.\n thus to remove the US threat would mean to return to isolationism.\n btw: the last country china invaded was Vietnam in the 80s to protect their ally Pol Pot from the Vietnamese invasion.\n \n \nlazy people\n\n \n close\n lazy, stupid, and complacent people", 
   {
    "unicode_changes_made": true
   }, 
   13904, 
   null, 
   1077418200.0
  ], 
  [
   35598, 
   null, 
   "plotter", 
   "the last country china invaded was Vietnam in the 80s to protect their ally Pol Pot from the Vietnamese invasion.\n\n Really, i didnt know that. can anybody put any light on this?\n \n LOL", 
   {}, 
   35496, 
   null, 
   1077499200.0
  ], 
  [
   35641, 
   null, 
   "WorldTraveller", 
   "XXXXXX.\n \n Ummm, the UK has a better education system than we do.\n\n \n sure they do. which is why most people in the UK agree that their education system is cr*p and needs serious revision. IIRC, they are gunning for a switch to pure baccalaureate.\n \n \nAre you suggesting this means we should stop playing the role of world police? If not, what are you suggesting here?\n\n \n You don't have the right to be the world's police.\n \n \nMaybe we should threaten to stop feeding 60% of the world. \n\n \n You don't, food production in the States is minimal compared to elsewhere.\n \n \nMaybe we should withdraw our troops from UN peacekeeping forces\n\n \n This is probably a good idea, you need people with peacekeeping experience in Iraq.\n \n \nLet's leave South Korea and let North Korea come back in\n \n \n Considering that it was mostly your fault that Korea was divided and politically polarized following WWII, its your responsibility to ensure the re-unification of the two halves.\n \n \nLeave Afghanistan while it's weak and let evil take control\n\n \n You aren't the only ones in Afghanistan, and your assumption that evil will take control is merely speculation. I am in agreement that the Taliban was a volatile regime and needed to be removed from power, but do not assume that it was only the States that participated.\n \n ***\n \n I would agree that the States is the biggest threat to world peace. Not by direct military action sanctioned by the majority of free world, but through economic imperialism and the whole 'manifest destiny, we are the world's police force' unilateral intervention XXXX. \n \n ***\n \n Oil. There is more oil in Alberta, Canada than there is in the whole of the Middle East. A little more research into extracting bitumen from the oil sands and the United States could have an exceedling large oil supply which falls under NAFTA. Of course, compared to flexing military muscle, research science seems a lot less manly emoticon_rolleyes", 
   {}, 
   35598, 
   null, 
   1077539100.0
  ], 
  [
   35806, 
   null, 
   "fracas", 
   "You don't have the right to be the world's police.\n\n \n who would grant anyone the right?\n the UN? ha!\n don't make me laugh. the UN only repesent the interests of individual member nations and not the interests of humanity or any particular people \n \n \nYou don't, food production in the States is minimal compared to elsewhere.\n\n \n it is minimal because the US economy have moved past just producing enough for its own existence. i.e. the actual % of the GDP is tiny but the absolute volume is huge. the US actually have exported grains to the Russians.\n \n \nThis is probably a good idea, you need people with peacekeeping experience in Iraq.\n\n \n yeah! lets get the UN to defend iraq like they did the muslims in sebrenica emoticon_rolleyes\n \n \nConsidering that it was mostly your fault that Korea was divided and politically polarized following WWII, its your responsibility to ensure the re-unification of the two halves.\n\n \n nope. NK at the urging of china decided to take SK and almost did. the US & UN drove them back to the chinese border when over 1 mil chinese entered the conflict.\n \n \nI would agree that the States is the biggest threat to world peace. Not by direct military action sanctioned by the majority of free world, but through economic imperialism and the whole 'manifest destiny, we are the world's police force' unilateral intervention XXXX. \n\n \n only so far as the US is everywhere\n by this alone makes it a threat to the world\n not what it does militarily or even politically\n \n and the reason unilateral action was that the UN in its divided national interest could not and would not act to enforce its own unanymously passed resolution in response to iraq (UNR#1441) and would rather allow continued violation of the 91 ceasefire. thus because the UN would not act as police that the US did\n \n \nOil. There is more oil in Alberta, Canada than there is in the whole of the Middle East. A little more research into extracting bitumen from the oil sands and the United States could have an exceedling large oil supply which falls under NAFTA. Of course, compared to flexing military muscle, research science seems a lot less manly emoticon_rolleyes\n\n \n misleading\n sure there oil but how cost effective and environmentally friendly would it be to extract the canadian oil. and to a lesser extent the alaskan oil. we all know if it was easy it would have been done already. point of fact the US is much less dependent on ME oil than either Western Europe or Japan!\n and lets not rechant the anti-war mantra that \"its about oil\" because had the US wanted ME oil it could have kept Kuwait instead of allowing it to go free. the US could also with a naval blockade of the arabian sea/gulf of Hormuz to regulate and charge a handsome fee for all oil tankers passing through.\n \n \n when you are the biggest player on the block people will always think you are a threat and there will never be satisfaction of what you do. if you do good, say billions of dollar for AIDS in africa (what does the US get out of that??? when there is still plenty of suffering at home) it isn't enough or not soon enough.\n whine whine whine", 
   {}, 
   35641, 
   null, 
   1077589440.0
  ], 
  [
   35865, 
   null, 
   "WorldTraveller", 
   "who would grant anyone the right?\n\n \n No-one can grant you that right.\n \n \nit is minimal because the US economy have moved past just producing enough for its own existence. i.e. the actual % of the GDP is tiny but the absolute volume is huge. the US actually have exported grains to the Russians.\n \n\n \n Yet their agricutural exports are equal to that of less developed countries. So the assertion that they are solely feeding the world is inaccurate. In reality, their sole comparison is minimal compared to that of other less developed countries.\n \n \nyeah! lets get the UN to defend iraq like they did the muslims in sebrenica \n\n \n why does Iraq need defending? doesn't it need infrastructure and policing until a feasible government can be established to take over those roles. arent american peacekeepers more knowledgeable in that respect based on experience than your standard GI?\n \n \nnope. NK at the urging of china decided to take SK and almost did. the US & UN drove them back to the chinese border when over 1 mil chinese entered the conflict.\n\n \n WRONG. Korea was divided following WWII as a result of American and Soviet occupation in either half. The Americans established a right-wing capitalist government and hunted communist supporters in the South. In the North, the Soviets established a left-wing communist and started hunting capitalists. Both groups polarized to either side of the parallel. This was the in part the Americans fault and has nothing to do with the Korean War.\n \n \nand the reason unilateral action was that the UN in its divided national interest could not and would not act to enforce its own unanymously passed resolution in response to iraq (UNR#1441) and would rather allow continued violation of the 91 ceasefire. thus because the UN would not act as police that the US did\n\n \n UN was never intended to act as police. There was no second Gulf War, the US was resuming hostilities after Saddam failed to abide by the Terms of Surrender. I don't consider the recent conflict in Iraq as unilateral intervention, but you have to admit that had a solid group of countries commited to Iraq as opposed to the US and their lapdog Tony Blair, there would be much less adversity following the completion of the conflict. There would be less resentment by the Europeans than is present today.\n \n Economic imperialism is exactly what it states. When American companies establish themselves in other countries and use their power to influence those nations governments, it spawns resentment. If everyone hates you, there is going to be conflict. If the US would tone it down and act as part of the team instead of always going off on its own and pursuing solely its own agenda than they would be far less of a threat to world peace.\n \n \nmisleading\n sure there oil but how cost effective and environmentally friendly would it be to extract the canadian oil. and to a lesser extent the alaskan oil. we all know if it was easy it would have been done already. point of fact the US is much less dependent on ME oil than either Western Europe or Japan!\n and lets not rechant the anti-war mantra that \"its about oil\" because had the US wanted ME oil it could have kept Kuwait instead of allowing it to go free. the US could also with a naval blockade of the arabian sea/gulf of Hormuz to regulate and charge a handsome fee for all oil tankers passing through.\n \n\n \n I don't believe the war is about oil, I was responding to other's assertions that oil is a major threat to world peace. I am suggesting that given the option though, it seems that the United States would rather show how mighty it is by conquering the Middle East to secure its oil reserves than focussing on more local sources because it makes it seem like the tough guy on the block. The funds would be better spent investigating a large source of NAFTA regulated petroleum as opposed to an overseas hostile regulated source. As to cost effective-ness and the environment. It is much more so that rampant conflict in the middle east, and little more funding towards extraction research may yet yield a viable alternative to traditional petroleum sources.", 
   {}, 
   35806, 
   null, 
   1077627840.0
  ], 
  [
   35881, 
   null, 
   "fracas", 
   "No-one can grant you that right.\n\n \n thus because noone can grant any country the right to be the world police, individual nations must thus act to safeguard their own best interests\n \n \nYet their agricutural exports are equal to that of less developed countries. So the assertion that they are solely feeding the world is inaccurate. In reality, their sole comparison is minimal compared to that of other less developed countries.\n\n \n i would never take an assertion of 60% to be same as \"solely feeding the world\"\n \n \nwhy does Iraq need defending? doesn't it need infrastructure and policing until a feasible government can be established to take over those roles. arent american peacekeepers more knowledgeable in that respect based on experience than your standard GI?\n\n \n 1. unless you have missed the past 2 weeks news, the attacks in iraq is shifting toward the iraqi security apparatus, not the US.\n 2. continued attacks whether they are directed against iraqi security or coaltion troops does not constitute a state of peace\n 3. peace keeping forces are best suited when all sides of the conflicted have agreed to a peace proposal but remain edgy/distrustful of the other to require a neutral intervening force. this is not the case with iraq currently.\n \n \nWRONG. Korea was divided following WWII as a result of American and Soviet occupation in either half. The Americans established a right-wing capitalist government and hunted communist supporters in the South. In the North, the Soviets established a left-wing communist and started hunting capitalists. Both groups polarized to either side of the parallel. This was the in part the Americans fault and has nothing to do with the Korean War.\n\n \n so if it was divided and occupied by both the soviets and the americans (from an invasion and occupation by the japanese) how is it the american's fault and not that of the japanese-allies (which includes the soviet-GB-US at the end of ww2) faults?\n \n \nUN was never intended to act as police. There was no second Gulf War, the US was resuming hostilities after Saddam failed to abide by the Terms of Surrender. I don't consider the recent conflict in Iraq as unilateral intervention, but you have to admit that had a solid group of countries commited to Iraq as opposed to the US and their lapdog Tony Blair, there would be much less adversity following the completion of the conflict. There would be less resentment by the Europeans than is present today.\n\n \n ok\n \n \nEconomic imperialism is exactly what it states. When American companies establish themselves in other countries and use their power to influence those nations governments, it spawns resentment. If everyone hates you, there is going to be conflict. If the US would tone it down and act as part of the team instead of always going off on its own and pursuing solely its own agenda than they would be far less of a threat to world peace.\n\n \n so you want the US government to regulate the behavior of US private corporations oversea, what market they can enter, and how they conduct themselves? this has already been done with business and trade laws. but there is no over all master plan by the US government to dominate the world economically.\n \n btw: the mistake in the economic imperialism is that we reapt the rewards and resources of the world and give less in return. the continued trade deficit and outsourcing of american jobs would suggest otherwise\n \n \nI don't believe the war is about oil, I was responding to other's assertions that oil is a major threat to world peace. I am suggesting that given the option though, it seems that the United States would rather show how mighty it is by conquering the Middle East to secure its oil reserves than focussing on more local sources because it makes it seem like the tough guy on the block. The funds would be better spent investigating a large source of NAFTA regulated petroleum as opposed to an overseas hostile regulated source. As to cost effective-ness and the environment. It is much more so that rampant conflict in the middle east, and little more funding towards extraction research may yet yield a viable alternative to traditional petroleum sources.\n\n \n ok", 
   {}, 
   35865, 
   null, 
   1077637080.0
  ], 
  [
   35900, 
   null, 
   "WorldTraveller", 
   "i would never take an assertion of 60% to be same as \"solely feeding the world\"\n\n \n Point taken and I withdraw the exaggeration.\n \n \n1. unless you have missed the past 2 weeks news, the attacks in iraq is shifting toward the iraqi security apparatus, not the US.\n 2. continued attacks whether they are directed against iraqi security or coaltion troops does not constitute a state of peace\n\n \n in otherwords, the war is not over? for some reason, i thought everyone had agreed that it was.\n \n \n3. peace keeping forces are best suited when all sides of the conflicted have agreed to a peace proposal but remain edgy/distrustful of the other to require a neutral intervening force. this is not the case with iraq currently.\n\n \n peace keeping forces are also suited to seperating two hostile forces with an enforced neutral zone. they are better suited to yield civilian co-operation in re-building efforts because they have experience in those areas.\n \n by committing peacekeepers to areas which are considered to be no longer under severe threat of attack, it allows more forces to be committed to suppressing the so-called \"freedom fighters\".\n \n \nso if it was divided and occupied by both the soviets and the americans (from an invasion and occupation by the japanese) how is it the american's fault and not that of the japanese-allies (which includes the soviet-GB-US at the end of ww2) faults?\n\n \n i dont follow what you are saying (i thought japan was an axis power?). I agree that some responsability (50%) must be placed on the soviets, however, they are in no state to contribute to repairing the mistake. nor do they propogate the mistake by continuing support for the regime they established. The agreement to divide korea was between the soviets and the americans, if they had both agreed to withdraw following the conflict, than there would have been no division in the first place. the fact that both sides than pursued a ruthless campaign of hunting political opponents in each of their respective spheres yielded the dynamic we have today.\n \n \nso you want the US government to regulate the behavior of US private corporations oversea, what market they can enter, and how they conduct themselves? this has already been done with business and trade laws. but there is no over all master plan by the US government to dominate the world economically.\n\n \n the question was not whether the US government presented a threat but the nation as a whole, this includes big business. It is largely a ruthless laissez faire mentality that yields economic imperialism and agreed there may be little the government can do about it.\n \n \nbtw: the mistake in the economic imperialism is that we reapt the rewards and resources of the world and give less in return. the continued trade deficit and outsourcing of american jobs would suggest otherwise\n\n \n based on the assumption that out-sourcing is hurting the american economy and that the trade deficit is not a result of misspending on the part of the government.\n \n If the US were not in the position it were in, than it would not be a threat to world peace. Any conglomeration of wealth, industry, military and political might will yield a class system of poor vs wealth, strong vs weak etc. this dichotomies are what cause conflict and the moderation of them are what lead to more stable global conditions.", 
   {}, 
   35881, 
   null, 
   1077639360.0
  ], 
  [
   35908, 
   null, 
   "Eddie", 
   "I just want to point out that the notion that the US feeds 60% of the population is ridiculous. The fact that neither China, India, Brazil or Pakistan imports any amount of food stuff of note.... Nor are the countries within EU net importers of food stuffs. While US exports may constitute a large portion of the export of food stuff it is far from the same thing as feeding 60% of the world population...", 
   {}, 
   16294, 
   null, 
   1077640920.0
  ], 
  [
   35935, 
   null, 
   "Dwight", 
   "Based on the facts about US power, energy and ressource consumption, pollution caused AND the current leadership combined with the propaganda apperatus this leadeship can control I'd say the US is - right now - the biggest thread to world peace.\n \n In the last few years the US has used unsanctioned force, declared openly to use WMDs themselves, produces and declared to use nuclear weapons (see: mini-nukes), has ignored several international treaties regarding environmental protection and has agressivly enforced it's policy of the \"new american century\" and thus destabilized the former multi-polar regime.\n \n The so called war on terror will lead us into a clash of civilization (worst case scenario) which will be a threat to the security and well-being of my own nation and region, the attempts of the current US adminstration to force down several laws into the throats of the EU and allied nations (like getting copies of flight passenger data) will be a deep cut into my very own civil rights and liberties.\n \n All those things above give me the reason to belioeve the US is a greater threat to my own security and ultimatley to word peace as well.", 
   {
    "unicode_changes_made": true
   }, 
   35908, 
   null, 
   1077647280.0
  ], 
  [
   35989, 
   null, 
   "fracas", 
   "so non-participation in international environmental treaties, not because it wants to polute, but because such treaty as Kyoto doesn't do enough to limit the polution from the most polutive sources (inefficient 3rd world manufacturing) constitute a thread\n \n \n but for clarification\n are we talking active or passive threat?", 
   {}, 
   35935, 
   null, 
   1077657420.0
  ], 
  [
   36103, 
   null, 
   "WorldTraveller", 
   "I would go with passive on this one fracas.", 
   {}, 
   35989, 
   null, 
   1077710460.0
  ], 
  [
   36470, 
   null, 
   "Nallyo", 
   "Just back on the whole Constitution thing . . .\n The reason that it is not in our Constitution to do these things is because we were a fledgling country at the time. A war would destroy us, as the War of 1812 almost did until Britain withdrew. However, in the Declaration of Independence (which I realize is not our governing document), unalienable rights and injustices are listed. I believe that if the Founding Fathers were alive today, they would approve of our actions in that we should give other peoples the same chance that we got through a miracle. I'm not sure they would approve of Vietnam (getting involved in a civil war and such) but they would most certainly approve of Iraq.", 
   {}, 
   36103, 
   null, 
   1077835320.0
  ], 
  [
   36493, 
   null, 
   "WorldTraveller", 
   "A war would destroy us, as the War of 1812 almost did until Britain withdrew\n\n \n You started the War of 1812!\n \n Even if it was in your constitution, that document has no validity outside your borders, so it wouldn't matter. That's why its not there, because there is no point.", 
   {}, 
   36470, 
   null, 
   1077840840.0
  ], 
  [
   36760, 
   null, 
   "Dwight", 
   "so non-participation in international environmental treaties, not because it wants to polute, but because such treaty as Kyoto doesn't do enough to limit the polution from the most polutive sources (inefficient 3rd world manufacturing) constitute a thread\n \n\n \n That's not a valir reason not to sign the treaty - especially if one's own pollution increases.\n \n - Dwight", 
   {
    "unicode_changes_made": true
   }, 
   35989, 
   null, 
   1077998280.0
  ], 
  [
   36769, 
   null, 
   "fracas", 
   "That's not a valir reason not to sign the treaty - especially if one's own pollution increases.\n \n - Dwight\n\n \n the objection to kyoto was that the 3rd world polluters (like china, mexico, and brazil) got a free pass while the industrialized nations with less polluting industries are limited. kyoto would not have changed a damn thing.\n (it is also an interesting argument that if you don't conform to expectation, regardless of your intent, then you are a threat!)\n \n \n regarding the US as a passive threat to world peace, i think it ludicrous. unless if by \"world peace\" you mean the status quo where millions continue to be oppressed by their authoritarian regimes, where millions women continue to experience sexism, second class status, and sold into slavery, where millions continue to die from hunger and disease.\n the world is not perfect, and can still be improved. but change requires force and might (not just military but also economic, political, diplomatic, financial, and good will) and currently the US is the force most capable of enacting changes. 28 millions afghans are better off. 25 millions iraqi are better off. all of eastern europe is better off. and the billions of dollar for aids treatment in africa will also help millions.\n thus in the ballance the question is whether the changes enacted by the US is mostly positive or not. despite all the misteps and miscue the US are responsible for, and unless your understanding of the world is based solely on what the media report (which is basically bad news make the broadcast, not good ones) then i cannot see how the US is the biggest threat to the world.", 
   {
    "unicode_changes_made": true
   }, 
   36760, 
   null, 
   1078000500.0
  ], 
  [
   37185, 
   null, 
   "Dwight", 
   "\n regarding the US as a passive threat to world peace, i think it ludicrous. unless if by \"world peace\" you mean the status quo where millions continue to be oppressed by their authoritarian regimes, where millions women continue to experience sexism, second class status, and sold into slavery, where millions continue to die from hunger and disease.\n the world is not perfect, and can still be improved. but change requires force and might (not just military but also economic, political, diplomatic, financial, and good will) and currently the US is the force most capable of enacting changes. 28 millions afghans are better off. 25 millions iraqi are better off. all of eastern europe is better off. and the billions of dollar for aids treatment in africa will also help millions.\n thus in the ballance the question is whether the changes enacted by the US is mostly positive or not. despite all the misteps and miscue the US are responsible for, and unless your understanding of the world is based solely on what the media report (which is basically bad news make the broadcast, not good ones) then i cannot see how the US is the biggest threat to the world.\n\n \n So it's ludicrous? With might comes power and with power comes responsibility. And right now the current US administration is rather abusing it's power than \"using it to encourage the higher US ideals of what life should be like\". Right now even this administration is the reason for a immense increase for hatred on the \"West\" and what \"we [pretend] to stand for\".\n \n BTW, don't you think saying \"the world is not perfect, and can still be improved. but change requires force and might (not just military but also economic, political, diplomatic, financial, and good will) and currently the US is the force most capable of enacting changes.\" is pretty self-righteous and arrogant? Who gave you the right to imply the changes encouraged are for \"the greater human good\"? You also deny the fact that several othr nations spend (in ratio) more money on foreign aid and support to the \"third world\" - they can claim to \"improve the world\" for a better as well.\n \n I stand by my point, the current administration and what they stand for remains a threat to world peace - the out-dated idea to force changes down peoples throats and claim it's for their good.\n \n If we're serious about making the world a better place, we'd better stop doing so with our self-righteous ideas of \"we are better and that's why we need to tell them what to do\" and forcing our ideas on them. We'd better stop supporting \"the enemy of my enemy is my friend\" folks, becasue histroy has proven this only causes more trouble (best example: Saddam Hussein was our friend, because he fought the evil evil Iranians. That's why we poured billions of our precious money into his treasure chest and gave him a few nasty things to play with).\n \n If we're serious, we lead by EXAMPLE and not by force.\n \n \n\"The West won the world not by the superiority of its ideas or values or religion but rather by its superiority in applying organized violence. Westerners often forget this fact, non-Westerners never do.\" - Samuel P. Huntington\n\n \n - Dwight", 
   {
    "unicode_changes_made": true
   }, 
   36769, 
   null, 
   1078170060.0
  ], 
  [
   37197, 
   null, 
   "fracas", 
   "So it's ludicrous? With might comes power and with power comes responsibility. And right now the current US administration is rather abusing it's power than \"using it to encourage the higher US ideals of what life should be like\". Right now even this administration is the reason for a immense increase for hatred on the \"West\" and what \"we [pretend] to stand for\".\n\n \n no. it is simply seen that the US has power beyond anyother and this alone constitute a threat. it hardly matters what the US does or don't do. in fact you can almost say that the US can do no right to no longer be seen as a threat.\n \n \nBTW, don't you think saying \"the world is not perfect, and can still be improved. but change requires force and might (not just military but also economic, political, diplomatic, financial, and good will) and currently the US is the force most capable of enacting changes.\" is pretty self-righteous and arrogant? Who gave you the right to imply the changes encouraged are for \"the greater human good\"? You also deny the fact that several othr nations spend (in ratio) more money on foreign aid and support to the \"third world\" - they can claim to \"improve the world\" for a better as well.\n\n \n i believe as long as the world we lives in contained those less fortunate, then it need to be changed. i am willing to use force to enact these changes. it hardly matter to me who does it and if france wants to, then i will support them. it just so happens that the US is the only one in position to do so. its a coincidental relationship, not a chauvenistic relationship.\n \n \nI stand by my point, the current administration and what they stand for remains a threat to world peace - the out-dated idea to force changes down peoples throats and claim it's for their good.\n\n \n change has not been forced down anyone's throat.\n the iraqi wanted a better life than they had under saddam. now they have the opportunity to do so.\n \n \nIf we're serious about making the world a better place, we'd better stop doing so with our self-righteous ideas of \"we are better and that's why we need to tell them what to do\" and forcing our ideas on them. We'd better stop supporting \"the enemy of my enemy is my friend\" folks, becasue histroy has proven this only causes more trouble (best example: Saddam Hussein was our friend, because he fought the evil evil Iranians. That's why we poured billions of our precious money into his treasure chest and gave him a few nasty things to play with).\n\n \n i no longer believe in cultural relativism. i believe that there are basic principles that will allow an individual and a people to thrive and grow. some cultures actively suppress this and should not be tolerated.\n Re: pre-91 Saddam, understand that the major financial support he received came from Europe, not the US. Regardless, we cannot support any regimes that are contradicting the principles we believe in. If this mean less allies and more hands-on action, then i am fine with this.\n \n \nIf we're serious, we lead by EXAMPLE and not by force.\n\n \n Yes, we must lead by example.\n But we must also be willing to use force when example is insufficient.", 
   {
    "unicode_changes_made": true
   }, 
   37185, 
   null, 
   1078172760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Who is the biggest threat to world peace?", 
  "url": "http://www.4forums.com/political/peace-middle-east/232-who-biggest-threat-world-peace.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 232, 
  "discussion_files": [
   [
    "28478.html", 
    "http://www.4forums.com/political/peace-middle-east/232-who-biggest-threat-world-peace-print.html"
   ], 
   [
    "28479.html", 
    "http://www.4forums.com/political/peace-middle-east/232-who-biggest-threat-world-peace-3-print.html"
   ], 
   [
    "28480.html", 
    "http://www.4forums.com/political/peace-middle-east/232-who-biggest-threat-world-peace-2-print.html"
   ]
  ], 
  "identifier": 232
 }
]