[
 [
  [
   47726, 
   null, 
   "galton", 
   "In class today we were discussing the conventional view of educated people that rape is motivated by a desire to control, humiliate and dominate a victim.\n I contend that the majority of these crimes are motivated by the desire to have sex with an unwilling partner and a willingness to use violence in order to get what you want.\n \n Examples of evidence for this idea:\n \n The most common scenario for sexual assault is date rape. The two are alone. He coaxes, she resists. He then pressures, she resists. He then threatens, she resists. He then uses force, and most of then time inflicts no gratuitous violence. His coercion is instrmental to get what he is after which is sex. \n \n The age range most at risk of sexual assault is late teens and early twenties, the age when women tend to be their most physically atrractive. If you are motivated to show your power and domination over a women, why pick such a vulnerable, low status victim? Why not find a wealthy matriarch? By the way, poor women suffer the highest risk of assault. Why not target powerful women if you're motivated to show your power and motivated to put an uppity women down where she belongs?\n \n Rapists are generally not specialists who commit no other crimes than rape or violence against women. They are cruel, violent, brutish men who are prone to beat up on everyone: strangers, acquaintances, coworkers, friends, family, etc, and their victims are more often men than women. Their pattern shows a pattern of using violence to get what you want, to get your way by using force. This proneness to violence is used for sex as well. \n \n You might rebut that how could anyone get turned on in a context of committing a horrible crime against an unwilling victim? Research shows that these men are aroused by expressions of distress by women. They are at times under the delusion that a resisting women is just putting on an act and really is consenting. These men are callous, unfeeling brutes. They also tend to be low status, undesirable men who have difficulty finding a stable relationship. \n \n One common setting for rape is victory over your enemy in war. You have a situation of men who may have long stretches of time without sex who are suddenly presented with a situation of vulnerable women who are seen as the lowly enemy, not worthy of humane treatment. Add to this the environment where many of the rules of proper behavior are ignored, and you have some men using violence to victimize these unprotected women. The conditions of war are conducive to bringing out the brutal side that some men possess. \n \n You might rebut that research has shown the power motivation to be valid. The research is limited, but the very few studies which show evidence for power focused on the serial rapist types who were studied as part of a incarcerated, clinical population. This population is your rare type of rapist; the most common type are the date rapists who frequently don't come to the attention of authorities. The idea of power was quickly picked up and popularized, but was based on few studies which focused on an unusual type of perpetrator. The findings I describe above are based on both survey and victim research and criminal justice data which are representative of the general population.", 
   {
    "post_info": {
     "post_title": "Rape sexually motivated?"
    }
   }, 
   null, 
   null, 
   1083716340.0
  ], 
  [
   47737, 
   null, 
   "Tastyfish", 
   "date rapre clearly is, though the form you describe is not the one I would instantly think of, date rape generally involves drugging a drink so the victim isn't really sure what they are agreeing to. Wouldn't say that the control aspect really figures into this, just the desire for sex.\n \n As for the 'why pick such a lowly victim' I would say it depends on the reason that the rapist feels threatened or abused by his victim or potential victims. If refused sexually continuously then it will be the more attractive ones that he would want to have sex he would choose to show his power over and defy what he saw as their power over him. However if the power over him was in another form, such as an excessively overbearing mother or a female boss then his choice of victim would be across a much different range. its just the former is far more common.\n I would say the rape at war is a different thing, definetly a demonstration of power over a defeated enemy rather than a real desire for sex.", 
   {}, 
   47726, 
   null, 
   1083718920.0
  ], 
  [
   47740, 
   null, 
   "galton", 
   "date rapre clearly is, though the form you describe is not the one I would instantly think of, date rape generally involves drugging a drink so the victim isn't really sure what they are agreeing to. Wouldn't say that the control aspect really figures into this, just the desire for sex.\n \n As for the 'why pick such a lowly victim' I would say it depends on the reason that the rapist feels threatened or abused by his victim or potential victims. If refused sexually continuously then it will be the more attractive ones that he would want to have sex he would choose to show his power over and defy what he saw as their power over him. However if the power over him was in another form, such as an excessively overbearing mother or a female boss then his choice of victim would be across a much different range. its just the former is far more common.\n I would say the rape at war is a different thing, definetly a demonstration of power over a defeated enemy rather than a real desire for sex.\n\n The date drug rape is an excellent point--it seems motivated to sneak sex from the victim. And I am not saying rape is never motivated by non-sexual factors. I am arguing that sexual motivation is most common (since the date rape scenario is most common). Even if it is power-motivated, it has to have enough of a turn-on aspect to it to cause an erection in the perpetrator.", 
   {}, 
   47737, 
   null, 
   1083719940.0
  ], 
  [
   47793, 
   null, 
   "Eddie", 
   "Hmmm... I think I`ll choose the middle way on this issue ;)\n \n Sexual gratification drives the rapist. Abuse, humiliation and control is what makes the rapist get sexual gratification from his act. Therefor sex, abuse, humiliation and control are inseperable. They are the means to the same end, sexual gratification.", 
   {}, 
   47740, 
   null, 
   1083750420.0
  ], 
  [
   47795, 
   null, 
   "daewoo", 
   "I think there is evidence for bothe viewpoints on this one. While logic dictates that the serial rapist is most likely in it for the power as opposed to sexual gratification (which explains rather nicely why they seem so inparticular when it comes to their choice of victim), it would seem that the non serial rapist is most likely in it for the sexual gratification.\n \n THat is not to say, however, that the whole power aspect does not enter into it when you are talking non-serial rapists. When you look at activities like date rape, as I recall (I can't remeber the exact numbers I am drawing this from) the vast majority of these crimes are commited by males between 16 and 24. Males between 16 and 24 are just learning to deal with their desire to procreate. Hormones are running wild. This would, in my mind, account for the \"desire for sex\" portion of the rape. \n \n Young men between 18 and 24 also tend to be cocky little snots who feel that they are all grown up and resent it when they are still treated like kids. I am familiar with this. I moved out of my parents house when I was 16, had a job, paid my own bills. I still remember an english teacher in high school telling me I could not go to the bathroom. I can see how the total domination of another could be desirable.\n \n I also think it depends on how you define \"rape\". In the quest to vilify rapists, inflate figures, serve social justice, or whatever they are trying to do, the definition of \"rape\" has gotten completely out of hand in some circles. When I was at K state, I took part in a study on the issue that was put on by some womens rights organisation. I was shocked to find, when all was said and done, that I had been raped several times by their definition of the term. Here are more or less the results of the study (the results of that study were compiled with the results of several others).\n \n \n1--25% of college women surveyed are victims of rape or attempted rape. \n 2--85% of rapes on campuses are acquaintance/date rapes. \n 3--73% of those forced to have sex fail to recognize their experience as rape. \n 4--90% of all campus rapes occur when alcohol has been used by either the assailant or the victim. \n 5--70% of college students admit to having engaged in sexual activity primarily as a result of being under the influence of alcohol, or to having sex they wouldn't have had if they had been sober. \n 6--84% of women assaulted knew their assailant. \n 7--75% of the assailants and 55% of the survivors had been drinking at the time of the assault. \n 8--10% of rape victims were male in 1999. \n 9--100% of gang rapes involve alcohol. \n \n \n The Aftermath: \n 10--82% of the victims said that the experience had permanently changed them. \n 11--30% or less of women assaulted by a strangers come forward. \n 12--27% identified themselves as victims. \n 13--42% of college women who are raped do not tell anyone about the assault. \n 14--5% of college women who are raped report the rape to the police. \n 15--5% report it to a rape crisis center. \n 16--1% of women assaulted will report it to the police if victimized by date/acquaintance. \n \n On the Boys' Side: \n \n 17--1% of male students who rape are prosecuted. \n 18--40% of men would rape under certain circumstances. \n 19--84% of college men who committed rape said that what they did was definitely not rape. \n 20--7% of college men reported committing a rape or attempting to commit rape the proceeding year. \n \n \n First off, lets look at #3. If you don't realise you were raped, were you really? \n \n Number 5 is what transformed me from an average joe to a rape victim. I had sex with quite a few people in college when I was drunk that I probably wouldn't have if I was sober. Apparently, this made me a member of the 10% of guys in number 9. After filling out this stupid survey, I got a call from the folks who administerded it offereing me free counseling. I was not paticularly traumatised by my \"rape\" experiences. I was kind of superficial back then, and kind of snotty about the girls I ran around with. I also had some pretty thick beer goggles. I would get drunk and my judgement would be impaired. A lot of the guys I knew in college were not at all particular. I think they could honestly say that they NEVER had sex with anybody while they were runk that they wouldn't have when they were sober, because most of them were willing to have sex with ANYBODY, drunk or sober.\n \n This is not an abnormal situation on a college campus, or even in high school. I would definatly agree that if you get somebody drunk specifically for the purpose of having sex with them, or have sex with somebody who is passed out, that would be rape. If you just get drunk and have sex with somebody you usually wouldn't, or in a situation where you usually wouldn't, that is just your own stupidity. \n \n The only negative effects of my \"rape\" (yea, right, I did something stupid, therefore I am a victim) was a case of clamydia my last year of school and a bunch of annoying calls form the folks who did the survey trying to convince me I was a victim (that was also my own stupidity. I should not have filled out the optional information with my name and phone number).\n \n I think that things like this make any meaningful study of rape statistics pretty difficult. I have seen the numbers in that rediculous study repeated in DOJ reports and in other publications. I am in no way making excuses for rapists or trying to trivialise rape as a crime. I am just saying that there needs to be some objectivity in these things and that inflating the numbers for whatever reason is counter productive.", 
   {}, 
   47793, 
   null, 
   1083756720.0
  ], 
  [
   47807, 
   null, 
   "emclean", 
   "I would have to agree with tastyfish the type of rape would lead you to the motivation.\n Date rape (IMO) would come from the desire to have sex\n Statutory rape would defiantly come from the desire to have sex\n Rape with serious violence would come form the desire for violence", 
   {}, 
   47795, 
   null, 
   1083768300.0
  ], 
  [
   47818, 
   null, 
   "Tastyfish", 
   "So 84% didn't think they were raping, and 74% didn't think they were actually being raped. Even though these will not nessarily be the same there is going to be quite a largge percentage of rapes where neither party thought they were raping or being raped- how can this count?", 
   {}, 
   47807, 
   null, 
   1083771900.0
  ], 
  [
   47874, 
   null, 
   "galton", 
   "So 84% didn't think they were raping, and 74% didn't think they were actually being raped. Even though these will not nessarily be the same there is going to be quite a largge percentage of rapes where neither party thought they were raping or being raped- how can this count?\n\n This study is typical of studies of violence against women (they study male victims here too, but they are not their main interest). What you have is feminist scholars originally not interested in crime looking for a type of behavior which really villifies men and is symbolic in a very dramatic way of the way that men supposedly subjugate women, so they have latched on to rape. They are not criminologists; their interest in this kind of crime is incidental to what they are truly interested in--women's issues. So instead of having criminologists study this kind of crime, who would develop a much more valid study design, feminist scholars design studies with unreasonable assumptions which inflate, exaggerate, and distort the reality of rape.\n \n There are textbooks and courses which focus on women as the victims of violence which mislead students into thinking women are the number one target of violence. The truth is that males face the highest risk of being victimized (most violence is male-male) and teenagers also face high risks of violence. Violence against children is also a very serious problem, so why so much focus on violence against women? The motivation is not to better understand the nature of violence, but rather is to drive home graphically the contention that women are victims of male domination in general.", 
   {}, 
   47818, 
   null, 
   1083781320.0
  ], 
  [
   47924, 
   null, 
   "daewoo", 
   "I think you have nailed this one right on te head, galton. And tastyfish, I wpend hours wondering about the same question.\n \n THe problem is that these \"studies\" by splinter group make it into official statistics (alleged statistics) and it muddies the waters quite a bit. IT is incredibly difficult, if not impossible, to figure out what is going on inside somebody elses head. This is why psychology is a \"soft science\". It i mostly speculation and theory.", 
   {}, 
   47874, 
   null, 
   1083791760.0
  ], 
  [
   49031, 
   null, 
   "mizmaxx", 
   "The problem with the \"rape for sex\" theory is that when you rape someone you don't get to have sex with them. Unless of course you define sex as penetrating an unwilling person. Raping someone is not at all the same experience as having sex with someone, therefore it can't possibly offer the same gratification. Even in cases where people have cited that rapists are aroused by female distress, this further evidences that rapists are aroused by rape- not sex. \n \n If someone simply wants to have sex with an attractive young woman, there are many available at a price affordable to many. In this case, the women specifically engage in the sex act consensually. Its also true that prostitutes get raped, which just goes to show that rapists like to rape and other men just like to have sex. I doubt it's the case that rapists simply can't afford the many available and willing partners whose vocation is having sex.", 
   {}, 
   47924, 
   null, 
   1084269240.0
  ], 
  [
   49169, 
   null, 
   "Nature's Cry", 
   "I think that if you are drunk, if you have sex willingly, it's not rape. If the person says \"No!\" but is too drunk to do anything else, it is rape. If they are too drunk to say anything at all, it is rape, but if they want to do it when it happens, it is not. After all, just because you are drunk does not mean you will have sex with a given person. When the drunk woman really doesn't want to have sex, she will not agree to it.", 
   {}, 
   49031, 
   null, 
   1084318080.0
  ], 
  [
   49515, 
   null, 
   "galton", 
   "The problem with the \"rape for sex\" theory is that when you rape someone you don't get to have sex with them. Unless of course you define sex as penetrating an unwilling person. Raping someone is not at all the same experience as having sex with someone, therefore it can't possibly offer the same gratification. Even in cases where people have cited that rapists are aroused by female distress, this further evidences that rapists are aroused by rape- not sex. \n \n\n Understanding rape as sexually motivated requires that one set aside his sexual tastes. Most of us would be revolted at forcing sex on a distressed, resisting partner, but rapists don;t give a damn about the feelings of the victim. They see something arousing, they want it even if by force by necessary, and the couldn't care less about harming the woman, and in some cases they delude themsleves into thinking the women's resistance is really her wanting it. They're such unfeeling monsters they'll sometimes say things like, \"Wasn't that good?\" afterwards.\n \n You are confusing the end with the means. Yes, some rapists are sexually aroused by a female victim in distress. This is sexual arousal of a perverse type, and the rape is in pursuit of perverse sexual gratification.\n \n \n \n If someone simply wants to have sex with an attractive young woman, there are many available at a price affordable to many. In this case, the women specifically engage in the sex act consensually. Its also true that prostitutes get raped, which just goes to show that rapists like to rape and other men just like to have sex. I doubt it's the case that rapists simply can't afford the many available and willing partners whose vocation is having sex.\n\n As posted earlier, a common scenario for sexually motivated rape is date rape. In this case, the guy is in intimate circumstances with a woman, he gets turned on, he makes an advance, she resists, he then pressures, she resists, he then threatens, she resists, he then uses force. This is a crime of circumstance, of opportunity. He is turned on to her now, and wants her now, whatver it takes. He is not thinking about how he might be able to track down a prostitute later that night instead. A man may develop a real lust for a particular woman which leads to a rape; in this case, sex with a prostitute would not satisfy his desire. \n \n Prostitution can be conducive to rape because the John thinks that, in contrast to non-paid sex, he can do what he pleases sexually to a woman, and she is supposed to jump up and down about it. He will sometimes turn to force to get the right kind of compliance from the women. It's still about sexual gratification a lot of time. That is not to say that sex is never motivated by a desire to control, punish, or humiliate--I never claimed such in this thread. And you certainly find sadist men who rape prostitutes out of hatred for them. Serial killers often rape and kill prostitutes for this reason, but they are rare criminals. A sign that the crime is not sexually motivated is if there is a lot of gratuitous as opposed to instrumental violence. \n \n A common motivation for violence in general is to use force to get what you want when other methods are not working--why should this be any different when what you want is sex, something by the way that men want terribly.", 
   {}, 
   49031, 
   null, 
   1084404240.0
  ], 
  [
   49528, 
   null, 
   "Haulingboat", 
   "Galton, You have presented a well thought out, concise, theory on the motivations behind rape. I agree. Sex plays a big part in rape. \n \n If you have the stomache for it, I recommend a book called Mind Hunter (I think). The name of the author eludes me at the moment. He was a FBI profiler. In fact he literaly wrote the book on profiling. If you are interested in the way Creeps think this read may be for you.\n \n Douglas I think was the name of the Author. I'll look tonight and get back to you.", 
   {}, 
   49515, 
   null, 
   1084407120.0
  ], 
  [
   49545, 
   null, 
   "galton", 
   "Galton, You have presented a well thought out, concise, theory on the motivations behind rape. I agree. Sex plays a big part in rape. \n \n If you have the stomache for it, I recommend a book called Mind Hunter (I think). The name of the author eludes me at the moment. He was a FBI profiler. In fact he literaly wrote the book on profiling. If you are interested in the way Creeps think this read may be for you.\n \n Douglas I think was the name of the Author. I'll look tonight and get back to you.\n\n Great, thanks! Sounds like something I'd like to read.", 
   {}, 
   49528, 
   null, 
   1084410120.0
  ], 
  [
   49610, 
   null, 
   "mizmaxx", 
   "A common motivation for violence in general is to use force to get what you want when other methods are not working--why should this be any different when what you want is sex, something by the way that men want terribly.\n\n I guess this is getting down to semantics. I agree that the perpetrator gets sexual satisfaction out of rape, but I don't think they get sex out of it. I hope that's clear. Like how a flasher might be aroused by exposing himself- he gets sexual satisfaction out of that act, but he doesn't get sex out of it.\n \n Fundamentally sex isn't rape, and rape isn't sex. You can't use force to get sex, you can only use it to get rape. So, if you find rape sexually satisfying you may use force or coercion or what-have-you to get it. It's sexual, yes, but it isn't sex.\n \n The reason I make this distinction is that - and I know this is not what you're intending to say- but when you say:\n \nwhy should this be any different when what you want is sex, something by the way that men want terribly.\n\n it sounds like you're saying that rape is some kind of \"natural\" male thing. Again, this might not be your intention, but other people have argued that using similar language.\n \n I think that it's confusing and potentially dangerous to equate a healthy sex drive with the impulse to rape.", 
   {}, 
   49545, 
   null, 
   1084430160.0
  ], 
  [
   50071, 
   null, 
   "galton", 
   "I guess this is getting down to semantics. I agree that the perpetrator gets sexual satisfaction out of rape, but I don't think they get sex out of it. I hope that's clear. Like how a flasher might be aroused by exposing himself- he gets sexual satisfaction out of that act, but he doesn't get sex out of it.\n \n Fundamentally sex isn't rape, and rape isn't sex. You can't use force to get sex, you can only use it to get rape. So, if you find rape sexually satisfying you may use force or coercion or what-have-you to get it. It's sexual, yes, but it isn't sex.\n \n The reason I make this distinction is that - and I know this is not what you're intending to say- but when you say:\n \n it sounds like you're saying that rape is some kind of \"natural\" male thing. Again, this might not be your intention, but other people have argued that using similar language.\n \n I think that it's confusing and potentially dangerous to equate a healthy sex drive with the impulse to rape.\n\n I have no problem amending my earlier claim by saying that rape is often the use of violence to get perverse sexual gratification. I mentioned serial killers before; many are \"lust killers\"--they are driven to kill in order to satisfy the sickest sort of sexual desires. I guess it's not so surprising that a twisted, perverse sexual energy is behind some serial killing. Sexual drive is a powerful motivating force, and if it develops into something sick, it has the power to compel someone to kill one victim after another. Same thing with pedophiles and why they can't be rehabilitated. How do you eliminate (a perverse) sexual drive?", 
   {}, 
   49610, 
   null, 
   1084588080.0
  ], 
  [
   50099, 
   null, 
   "mizmaxx", 
   "Sexual drive is a powerful motivating force, and if it develops into something sick, it has the power to compel someone to kill one victim after another. Same thing with pedophiles and why they can't be rehabilitated. How do you eliminate (a perverse) sexual drive?\n\n Obviously I don't know, or I would be out curing pedophiles. But I can theorize. I think that eliminating the \"sexual drive\" is not the answer. I don't believe in \"drive theory\", or psychoanalytic theories in general, but maybe you're just using that language because it's common. \n \n I believe that the urge to be sexual is a healthy urge. If that urge is modified/perverted such that someone becomes a sexual predator, it goes beyond sex urges. The need to abuse is then a psychological addiction to which the sexual aspect is secondary. That is to say, a healthy person does not become a rampaging nymphomaniac out of a need for sex the way that a rapist or pedophile absolutely needs to act out.\n \n However, I think you were trying to focus more on date-rape and if such a thing can be about \"power\" vs \"sex\". I think that in a situation like that, the perpetrator is convinced that power and sex are one and the same. Date rapists often speak of having \"seduced\" their victims, which is code for terrifying them into compliance. \n \n They believe that what they are doing is \"having sex\", whereas the other person experiences being raped. They have an idea that sex is something that can be taken from someone, that once offered it cannot be withdrawn, and that \"sex\" with women they consider desirable is their due. This sense of entitlement to other people's bodies and a complete detachment from the other person's experience is what makes them capable of rape without ever feeling culpable. In fact, they often view these experiences as pleasant exchanges on both sides.\n \n This is why I think people say that it is about power, not sex. Because you can't get sex from someone unwilling to give it. You can get sexual gratification only if you are able to completely cut yourself off from the fact that the other person is unwilling or even terrified. \n \n The same way that stalkers often feel they are in a reciprocal relationship of love, which is simply not the case. Stalkers don't stalk someone because they love them. They stalk someone because they are obsessed with them, and the entire relationship from the beginning has been about the stalker, their needs and desires. Which is not at all what love is.", 
   {}, 
   50071, 
   null, 
   1084599600.0
  ], 
  [
   50159, 
   null, 
   "galton", 
   "Obviously I don't know, or I would be out curing pedophiles. But I can theorize. I think that eliminating the \"sexual drive\" is not the answer. I don't believe in \"drive theory\", or psychoanalytic theories in general, but maybe you're just using that language because it's common. \n \n I believe that the urge to be sexual is a healthy urge. If that urge is modified/perverted such that someone becomes a sexual predator, it goes beyond sex urges. The need to abuse is then a psychological addiction to which the sexual aspect is secondary. That is to say, a healthy person does not become a rampaging nymphomaniac out of a need for sex the way that a rapist or pedophile absolutely needs to act out.\n \n However, I think you were trying to focus more on date-rape and if such a thing can be about \"power\" vs \"sex\". I think that in a situation like that, the perpetrator is convinced that power and sex are one and the same. Date rapists often speak of having \"seduced\" their victims, which is code for terrifying them into compliance. \n \n They believe that what they are doing is \"having sex\", whereas the other person experiences being raped. They have an idea that sex is something that can be taken from someone, that once offered it cannot be withdrawn, and that \"sex\" with women they consider desirable is their due. This sense of entitlement to other people's bodies and a complete detachment from the other person's experience is what makes them capable of rape without ever feeling culpable. In fact, they often view these experiences as pleasant exchanges on both sides.\n \n This is why I think people say that it is about power, not sex. Because you can't get sex from someone unwilling to give it. You can get sexual gratification only if you are able to completely cut yourself off from the fact that the other person is unwilling or even terrified. \n \n The same way that stalkers often feel they are in a reciprocal relationship of love, which is simply not the case. Stalkers don't stalk someone because they love them. They stalk someone because they are obsessed with them, and the entire relationship from the beginning has been about the stalker, their needs and desires. Which is not at all what love is.\n\n Certainly one important contributing cause to rape is that there exists among a certain percentage of men a complete lack of ability to put yourself in another person's shoes, a complete inability to read and understand other people. This tendency manifests itself more benignly in the average guy who can't read a woman's signals as well as the average women can read a guy. \n \n The reason why the focus has shifted from the sexual aspect of rape to the power aspect of rape is that this issue is used as a metaphor of male-female relations in general and is a powerful, emotional way to communicate the view that men in general subjugate women. \n \n In the old days, students of rape were trying to figure out what was happening; the research now has been hijacked by people with an agenda who are not interested so much in understanding rape as much as using the issue to indoctrinate people into the idea of female subjugation. It's been turned from research into politics. \n \n That's not to say that old school research didn't have bias, but there was a difference in motivation. The old motivation was scientific, now the motivation is politics. I am telling all you folks who study social science research; any research done in the last 50 years on race and gender is suspect; be very skeptical of any politically correct findings. These researchers are true believers and are more than happy to engage in selective data collection, burying inconvenient findings, or even fraudulent research if it helps the cause, or at least makes it easy for them publish. \n \n It is extremely difficult to publish politically incorrect findings in a discpline controlled by the Left. And it is difficult to argue against their worldview because the entire field is organized to gather the kind of data and to generate the kind of arguements to prove their side, so there is much less research that has been done that looks at the other side of an issue. This leads to one-sided indoctrination in the classroom and in the major media. So people in this forum who are skeptical of research in general should be because research which used to shoot for the ideal of objectivity has sunk further and further into a propaganda machine for the Left. If this kind of research goes against common sense or your personal experience, ignore it, and this is coming from a man who reveres science. Trust the data you have observed over the course of your life over this religion of political correctness. Out of everday experience bubbles up a certain folk wisdom and common sense--the Left calls it things like \"prejudice\" or \"sexism.\" \n \n The entire discipline of sociology for example is totally bogus. Early in its history you had leaders like Sorokin who respected biology as well as social environment, but those days didn't last long. Very soon sociology came to believe that basically all human behavior is environmental and specifically social in origin. Sociological research rarely rarely attempts to assess whether there is any biological role in behavior. It simply dismisses or vilifies such an idea, and acts like it is not a possibility. So in practically all of the thousands of studies that have been done, their models are misspecified and therefore totally bogus because they are doing nothing to rule out a biological role. \n \n This is the purest form of propaganda masquerading in the form of science. I am ashamed that I wasted so many years getting an undergraduate degree and PhD (specializing in criminology) in this discipline. It was indoctrination not education, and I am ashamed that the state wasted so much money on my miseducation.", 
   {}, 
   50099, 
   null, 
   1084664100.0
  ], 
  [
   50183, 
   null, 
   "mizmaxx", 
   "The reason why the focus has shifted from the sexual aspect of rape to the power aspect of rape is that this issue is used as a metaphor of male-female relations in general and is a powerful, emotional way to communicate the view that men in general subjugate women.\n\n You're getting sidetracked again into conspiracy theories.\n \n Do you have anything direct to say about my post, re: power and sex being viewed as one and the same? Do you believe that there is no control issue involved in rape? \n \n Also, you should keep in mind that your theory of \"femal subjugation\" as the root of the power analysis ignores the reality of male-male and female-female sexual assault.", 
   {}, 
   50159, 
   null, 
   1084679940.0
  ], 
  [
   50253, 
   null, 
   "galton", 
   "You're getting sidetracked again into conspiracy theories.\n \n Do you have anything direct to say about my post, re: power and sex being viewed as one and the same? Do you believe that there is no control issue involved in rape? \n \n Also, you should keep in mind that your theory of \"femal subjugation\" as the root of the power analysis ignores the reality of male-male and female-female sexual assault.\n\n I think the more \"abnormal\" the rape, the closer the association between sexual desire and violence. For a date rape, I think it is more a callouness making one willing to use force to get sexual gratification. \n \n It is refreshing to see someone of your persuasion presenting an argument against the feminist theory of rape. My views do not constitute a conspiracy theory. It just happens to be the case that people from the Left side of the aisle gravitate toward academia (maybe because their idealism leads them to prefer thought over action) and then they naturally do and support research that reflects their interests and agenda. You don't have a handful of Lefties in a smoke-filled room plotting the domination of research--it is a natural tendency of a bunch of people with a certain orientation. Of course there are exceptions, but the general pattern is obvious.", 
   {}, 
   50183, 
   null, 
   1084738800.0
  ], 
  [
   50598, 
   null, 
   "mizmaxx", 
   " For a date rape, I think it is more a callouness making one willing to use force to get sexual gratification. \n\n This does not explain how that person has come to view rape as sexually gratifying.\n \n \nIt is refreshing to see someone of your persuasion presenting an argument against the feminist theory of rape. \n\n I disagree with many liberal feminist theories. This is not because I am more conservative than you think, it is because I am more radical than you think. You keep confusing me with \"liberals\", which I am not.\n \n \nYou don't have a handful of Lefties in a smoke-filled room plotting the domination of research--it is a natural tendency of a bunch of people with a certain orientation.\n\n That is possible, but oversimplifying will not help your argument. There are many forms of \"Leftys\", and feminists, and unless you are sure that a person is of a particular school of thought (such as if they say \"I'm a Trotskyist\" or whatever), it might be more tactical to argue against their specific point than their person or global views.\n \n For example, you seem to use the terms \"Left\" and \"Liberal\" interchangeably. Now, a Marxist would be offended to be lumped in with a Liberal, and a Conservative is not necessarily in agreement with the Religious Right. People's politics, although we use terms like Right and Left for convenience, aren't always that simple. Personally, although most Right and Left-wingers initially take me for \"Lefty\" or \"liberal\", I identify with neither Right or Left-wing or Liberal political beliefs or categories.\n \n It's true that Liberal Arts academic spheres tend to be, well, \"liberal\". That doesn't mean that all published materials are guided by a monolithic and inflexible philosophy. There are extreme conflicts of opinion among academics. Suggesting otherwise is misleading.", 
   {}, 
   50253, 
   null, 
   1084863480.0
  ], 
  [
   51121, 
   null, 
   "Haulingboat", 
   "Great, thanks! Sounds like something I'd like to read.\n\n Mind Hunter by Douglas. He also wrote a second book that went into great detail of a rape and murder case of a beautiful young Marine. The story is tragic. The development of the FBI profiling division is very interesting.", 
   {}, 
   49545, 
   null, 
   1085011500.0
  ], 
  [
   51479, 
   null, 
   "syklopps61", 
   "Just for the heck of it, I would like to toss in a little food for thought. I agree with Galton that most rapes ARE driven by the need for sexual gratification, but would add that those who commit rapes may not be responsible for their actions. I have no studies to support this claim, but I believe that science today has gotten to be politically correct and therefore there may not BE any studies. Society and our justice system have seemed to accept the premise that some women cannot control their actions because of their hormonal imbalances (PMS). Is it possible that men who rape could also be suffering from a hormonal problem, one that makes them incapable of controlling their desires? Just a thought", 
   {}, 
   51121, 
   null, 
   1085110860.0
  ], 
  [
   51531, 
   null, 
   "Tastyfish", 
   "While it may be possible it is probably unlikely (that they could not control it, the fact that they felt urges is completely biologicial, same reason anyone else does but there are ways to get around them and release the pressure in harmless directions), though if there was it woudl be obvious and probably easily testable for.", 
   {}, 
   51479, 
   null, 
   1085151000.0
  ], 
  [
   51826, 
   null, 
   "galton", 
   "This does not explain how that person has come to view rape as sexually gratifying.\n\n A couple of facts I found relevant to this issue: \n \n An extremely small proportion of victims suffered a serious injury (too small to analyze); 42% none at all. Most women who resist successfully thwart the perpetrator, suggesting he is not particularly violent or sadistic, but is looking for a weak target. (Schlesinger, S.R. The Crime of Rape. Bureau of Justice Statistics,US Department of Justice, March 1985. Report # NCJ-96777. )\n \n Eighty-eight percent of rapists were found to use only instrumental force (Smithyman, S.D. 1978. The Undetected Rapist. PhD dissertation, U Mich.)\n \n Concerning your post, the typical rapist's response in one study, when asked how he viewed sex versus rape, said that he just wanted to get off, whether she wanted it or not. He would say that forcing it was not a turn-on; he just wanted things easy and could get them. He would threaten her, and if he had to go through a big hassle, or use violence, it was nothing to him, but he didn't like it. (Symons, D. 1979. The Evolution of Human Sexuality. New York: Oxford Press.) \n \n These kind of comments lead to think that for many of these guys, it's not that the force is needed to get or stay turned on; rather, they are able to put the girl's feelings out of their minds, and then they do what they want. Her suffering is not enough of an issue to prevent him from getting pleasure from it. This is consistent with my earlier comment about these rapists being knuckle-dragging brutes.", 
   {}, 
   50598, 
   null, 
   1085273400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Rape sexually motivated?", 
  "url": "http://www.4forums.com/political/crime-debates/2333-rape-sexually-motivated.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 2333, 
  "discussion_files": [
   [
    "11056.html", 
    "http://www.4forums.com/political/crime-debates/2333-rape-sexually-motivated-print.html"
   ], 
   [
    "11057.html", 
    "http://www.4forums.com/political/crime-debates/2333-rape-sexually-motivated-2-print.html"
   ]
  ], 
  "identifier": 2333
 }
]