[
 [
  [
   47911, 
   null, 
   "Tedster", 
   "Just curious to see what people think has been the best game to date.", 
   {
    "post_info": {
     "post_title": "Whats the best game?"
    }
   }, 
   null, 
   null, 
   1083789840.0
  ], 
  [
   47953, 
   null, 
   "AMD4EVER", 
   "Just curious to see what people think has been the best game to date.\n\n \n If I could only choose one I would have to choose Alpha Centauri. Best combination of political, nation building, technology, and war ever made.", 
   {}, 
   47911, 
   null, 
   1083796380.0
  ], 
  [
   48807, 
   null, 
   "Phunting", 
   "From the poll? I'd go with Starcraft.\n \n Ever? Probably Civilization.", 
   {}, 
   47953, 
   null, 
   1084207500.0
  ], 
  [
   49003, 
   null, 
   "Pro-Bush", 
   "It may not be the best but one of the most fun to play is Perfect Dark", 
   {}, 
   48807, 
   null, 
   1084251000.0
  ], 
  [
   170803, 
   null, 
   "Ooaman", 
   "What system are these for?\n As far as I'm concerned, the best game is Mario Kart for the Nintendo systems. But then again, I'm a Nintendo person and I have pretty much always been.", 
   {}, 
   49003, 
   null, 
   1129334280.0
  ], 
  [
   170856, 
   null, 
   "sanguinekane", 
   "Thats a pretty narrow field to choose from. In fact, comparatively, that list you put is about 1/10 of a hair's breadth. But if I had to choose from those, I'd go with Halo. \n \n But as far as ever, well then my list would be:\n Half-Life\n Homeworld\n Baldur's Gate\n Doom\n Pirates! Gold\n The whole Total War Series\n Black and White\n Diablo (1 and 2)", 
   {}, 
   170803, 
   null, 
   1129341060.0
  ], 
  [
   170866, 
   null, 
   "Phantos", 
   "I had to pick Star Craft just because it was extremely popular when it came out, and it's still extremely popular. I also like another game by Blizzard, it's not on the list, Warcraft III. I guess I just have to admit that I've always been a big fan of the real time strategy games, including the Age of Empires, and Age of Mythology games.", 
   {}, 
   170856, 
   null, 
   1129343460.0
  ], 
  [
   171180, 
   null, 
   "zachvac", 
   "Starcraft is the only game I own out of these, and it's great, but not my favorite. I have never understood the craze over Halo. I don't think it's really all that great (not saying it's bad, but not the best game ever as some claim). My favorite games are sports games. The 2 best now I'd say are MVP baseball and Madden.", 
   {}, 
   170866, 
   null, 
   1129438920.0
  ], 
  [
   171280, 
   null, 
   "OccamsRazor", 
   "Okay IMO Starcraft and Halo are both great for;\n \n Gameplay\n Storyline\n Playability\n \n Starcraft is great for;\n \n simplicity\n \n And Halo is great for;\n \n attention to detail\n \n But above both I'd put Homeworld (and Homeworld 2 with the Point Defense Systems mod), Medieval Total War, UFO: Enemy Unknown/Terror from the Deep and Combat Mission 2.\n \n But my all time favorite game is the Il-2 series of flight sims emoticon_xgood", 
   {}, 
   171180, 
   null, 
   1129478520.0
  ], 
  [
   171293, 
   null, 
   "Phantos", 
   "Starcraft is the only game I own out of these, and it's great, but not my favorite. I have never understood the craze over Halo. I don't think it's really all that great (not saying it's bad, but not the best game ever as some claim). My favorite games are sports games. The 2 best now I'd say are MVP baseball and Madden.\n\n \n I have to agree with you on that. I don't understand why Halo caught on so well. There isn't much strategy to it, you just have to learn how to shoot in the right place with the right gun. This is easily accomplished by playing the game...a lot.", 
   {}, 
   171180, 
   null, 
   1129479480.0
  ], 
  [
   172758, 
   null, 
   "Tastyfish", 
   "Starcraft - only game people have died playing because they didn't sleep, now that's hardcore.\n Far Cry and Half life 2 blow Halo out of the water, FPS doesn't work as well on consoles as it does on PCs. Its really nothing special comapred to the rest of its genre on other platforms.", 
   {}, 
   171293, 
   null, 
   1129912440.0
  ], 
  [
   172766, 
   null, 
   "Symbiote", 
   "Starcraft was excellent, probably the best RTS ever made. Others were fun but did not have the same balance of a Blizzard game.\n \n Civilisation I put many, many hours into. Alpha Centauri is superior to all of the Civ series put together.\n \n Currently playing World Of Warcraft, lot of fun.\n \n Best ever is very tough to call.", 
   {}, 
   172758, 
   null, 
   1129913400.0
  ], 
  [
   172770, 
   null, 
   "Big_Bear_Scot", 
   "I would say one of the best games ever is Elite. \n \n User centred Game Design at its best you could do what ever you wanted. You want to be a Trader then you trade goods between stations, you want to be a pirate attack ships and steal their cargo. Excellent all round in my opinion.\n \n Other games that go into my top 10 would be\n \n Tetris\n Mario\n Half Life\n Half Life 2\n Rome Total War\n System Shock 2\n Planescape Torment\n Doom 1\n Doom 2", 
   {}, 
   172766, 
   null, 
   1129915080.0
  ], 
  [
   173915, 
   null, 
   "snakespit", 
   "Everquest, without a doubt.", 
   {}, 
   172770, 
   null, 
   1130214120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Whats the best game?", 
  "url": "http://www.4forums.com/political/entertainment-debates/2338-whats-best-game.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 2338, 
  "discussion_files": [
   [
    "8667.html", 
    "http://www.4forums.com/political/entertainment-debates/2338-whats-best-game-print.html"
   ]
  ], 
  "identifier": 2338
 }
]