[
 [
  [
   48043, 
   null, 
   "daewoo", 
   "I was watching some Arab language channels today (mostly to see what the reaction was to bushs statement) and several of them were running interviews that had been done with some prominent Iraqis whoare expected to run for office in the upcoming elections. Every single one of them said that if elected, their first order of business would be to introduce and pass a measure expelling US troops from the country. In interviewing Iraqis on the steet, it appeared that this was a popular idea.\n \n America is giving no indication that they plan to leave Iraq. In fact, we are building several permanent military bases there. It appears that the US is planning on keeping tens of thousands of soldiers in Iraq for quite some time (we have signed several 25 year contracts in relation to the new bases). \n \n What do you think America will do if the first order of business of the newly elected Iraqi government, formed under our supervision and under the constitution that was drafted by our hand picked \"governing council\", is to order teh expulsion of all US troops from Iraqi soil?\n \n It seems that the original plan was for our hand picked memebrs of the governing council to be the new government of Iraq (to be elected when the time comes) much like what we did in afghanistan. Support for the governing council and its members is abysmaly low, and it doesn't look like we can actually count on ANY memebers of the governing council to be elected in an open election.\n \n What do you think will happen if this is the case? Will we pack up and go home, or will we refuse?", 
   {
    "post_info": {
     "post_title": "What will we do when...."
    }
   }, 
   null, 
   null, 
   1083836220.0
  ], 
  [
   48143, 
   null, 
   "emclean", 
   "i would hope we would request time to remove our troops, and go. if not then we will undermine the demacradic process in there country.", 
   {}, 
   48043, 
   null, 
   1083881940.0
  ], 
  [
   48157, 
   null, 
   "georged", 
   "I can't see any relation between signing 25 year contracts, Pentagon planning now in place and approved for a military force of 110,000 in Iraq through 2006, development of the world's largest US embassy in Baghdad (the current Green Zone will become US sovereign land, which also sends a message not comforting to Iraqi nationalists) and Iraqi opinions and dreams. \n \n If one looks at that planning as conceived and executed prior to the turn of events in Iraq regarding nationalism, it would, IMO, lend credence to those who feel that we never had any intent of leaving Iraq until their oil industry was under our control, regardless of the system of government that happened to be in place. That would also provide a solid bais for those who believe the original motivation was oil, with the ill-fated WMD and never-ending following rationalizations for the invasion and occupation being a series of red herrings.\n \n To answer your question, I believe we originally had no intent of leaving and had planned on our puppet government and US crafted constitution with a resulting election to embrace our security. We would, allowing that current nationalist violence is curtailed and the current US administration is still in office, not even consider leaving if a free election and request by that government to remove our troops did occur before we have their oil under our control. Our rationalizations would remain the same, security to ensure a stable government and rebuilding Iraq's infrastructure as required by an aggressor under the Geneva Convention Agreements. \n \n What would be interesting in that scenario is UN response to such a request and our denial of same within the Islamic World.", 
   {}, 
   48143, 
   null, 
   1083884880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What will we do when....", 
  "url": "http://www.4forums.com/political/peace-middle-east/2345-what-will-we-do-when.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 2345, 
  "discussion_files": [
   [
    "28336.html", 
    "http://www.4forums.com/political/peace-middle-east/2345-what-will-we-do-when-print.html"
   ]
  ], 
  "identifier": 2345
 }
]