[
 [
  [
   48109, 
   null, 
   "sglaine", 
   "Do you think Rummy handled the prison abuse case well or do you think he is covering his tracks. If you do think he is covering up this matter do you think he should resign? Do you think he was withholding information from Congress?", 
   {
    "post_info": {
     "post_title": "Rummsfeld handling abuse in Iraq!!"
    }
   }, 
   null, 
   null, 
   1083873120.0
  ], 
  [
   48180, 
   null, 
   "jskufan", 
   "Do you think Rummy handled the prison abuse case well or do you think he is covering his tracks. If you do think he is covering up this matter do you think he should resign? Do you think he was withholding information from Congress?\n\n \n My personal opinion is that everyone who had anything to do with the United States invading Iraq should resign. That withstanding, It appears that the defense dept. was aware of these prisoner abuses well before George Bush or Congress was. Therefore, I guess George has to decide if withholding important information from the Commander in Chief is grounds for punishment or not. Deception is certainly no stranger to this administration.", 
   {}, 
   48109, 
   null, 
   1083890520.0
  ], 
  [
   48181, 
   null, 
   "sglaine", 
   "My personal opinion is that everyone who had anything to do with the United States invading Iraq should resign. That withstanding, It appears that the defense dept. was aware of these prisoner abuses well before George Bush or Congress was. Therefore, I guess George has to decide if withholding important information from the Commander in Chief is grounds for punishment or not. Deception is certainly no stranger to this administration.\n\n Nice answer I feel that is on target.", 
   {}, 
   48180, 
   null, 
   1083890760.0
  ], 
  [
   48297, 
   null, 
   "Maineiac", 
   "I look for Rumsfeld to resign. The more we are being informed of the situation, the more we are aware that there was prior knowledge of abuse.\n \n I can't believe that the field commanders knew of this, yet let abuse take place. This is just what the anti-americans were looking for to denounce our occupation.\n \n Bush claims that he wont call for his resignation, but it being an election year, I don't think he will have much choice.\n \n This situation could very well place a lot of our soldiers in a hostile enviroment that was bad enough before all this took place.", 
   {}, 
   48181, 
   null, 
   1083953040.0
  ], 
  [
   48337, 
   null, 
   "jim's trucking", 
   "The allegations of abuse were made public back in January, right after they were known to the military command. Just because some liberal Senator accuses Rumsfeld of trying to hide something, doesn't mean it happened that way.\n \n Of course, liberals will believe anything that Ted (Chappaquidic) Kennedy says.\n \n Incidently, I watched him question Rumsfeld during lunch today. It looks like the excess drinking has gotten to his nose.", 
   {}, 
   48297, 
   null, 
   1083960720.0
  ], 
  [
   48349, 
   null, 
   "daewoo", 
   "The allegations of abuse were made public back in January, right after they were known to the military command. Just because some liberal Senator accuses Rumsfeld of trying to hide something, doesn't mean it happened that way.\n \n Of course, liberals will believe anything that Ted (Chappaquidic) Kennedy says.\n \n Incidently, I watched him question Rumsfeld during lunch today. It looks like the excess drinking has gotten to his nose.\n\n \n I think rumsfeld handled the situation very poorly. I do not think he should resign (at least not because of the abuse). Allegaions of abuse were made pubklin back in january, but they were toned down quite a bit. After that, the US media just quite talking about it. There have been hundreds, if not thousands of cases of abuse reported since then, and there were hundreds reported before that. \n \n I don't think Rumsfeld was really trying ot hide anything, I think he himself didn't understand exactly what was going on. Somebody is Rumsfelds position is not all knowing, and frequently can be counted on to knw less about wat is going on than the guys in the field. HE has to rely on reports from his field personel for his information. When you give a report ot your boss, do you dwell on eevry problem you have had, or do you try to make it look like you are handling things well?\n \n \n IT does look like he has been taking some comfort in the bottle, doesn't it? You would have thought they could have slapped some makeup on that.", 
   {}, 
   48337, 
   null, 
   1083962400.0
  ], 
  [
   48365, 
   null, 
   "Waxy", 
   "I CANNOT SUBSTANTIATE THIS IN ANY WAY AS I CAN NEVER TRULY KNOW THE MIND OF ANOTHER MAN, IT IS MERELY MY OPINION BASED ON MY OBSERVATIONS OF RUMSFELD.\n \n I think Rumsfeld is fine with, I don't think it bothers him one bit, in fact, I'd go as far as to say that he's all for it  if it helps the US \"win\". Any apology he offers is Acadmeny Award stuff as far as I'm concerned.\n \n I've seen the attitude on this board, so don't try and tell me that it's obsurd.\n \n Waxy", 
   {}, 
   48349, 
   null, 
   1083964680.0
  ], 
  [
   48371, 
   null, 
   "sglaine", 
   "Nothing was said about Iraqys dragging our serive men behind jeeps do you remember that one.", 
   {}, 
   48365, 
   null, 
   1083965520.0
  ], 
  [
   48377, 
   null, 
   "The_Comedian", 
   "Rumsfeld is the one in charge (Bush certainly won't resign) and therefore should be kicked out of cabinet imo. How else should he and the administration show some kind of real excuse and credibility. They always tell us that they were infailable although reality proves them wrong every day.\n And don't forget that Rumsfeld is one of the main guys behind the new concept of an army and of warfare. He supports the increase of responsibility that is handed over to the thousands of mercenaries in Iraq who do their part to fuel the hatred among the Iraqis with their rambo behaviour; he talks about a slim and specialised army but forgets about simple after-war logistics and peace-keeping; he doesn't care about international support for his army although he sends his soldiers into such a dangerous region under such circumstances. \n Hell, this guy is a shame for the US and should be the first to leave. Followed by his comrades in November.", 
   {
    "unicode_changes_made": true
   }, 
   48371, 
   null, 
   1083966420.0
  ], 
  [
   48379, 
   null, 
   "jim's trucking", 
   "...\n \n IT does look like he has been taking some comfort in the bottle, doesn't it? You would have thought they could have slapped some makeup on that.\n\n \n Maybe some spackling!", 
   {}, 
   48349, 
   null, 
   1083966600.0
  ], 
  [
   48380, 
   null, 
   "Waxy", 
   "Nothing was said about Iraqys dragging our serive men behind jeeps do you remember that one.\n\n \n You're kidding right? Nothing was said? IT WAS EVERYWHERE!\n \n Waxy", 
   {}, 
   48371, 
   null, 
   1083966720.0
  ], 
  [
   48383, 
   null, 
   "sglaine", 
   "You're kidding right? Nothing was said? IT WAS EVERYWHERE!\n \n Waxy\n\n I haven't research it yet but someone at the coffee shop was talking about it. He was all pee ed off about it. I will check on it later. Did Rummey ever say that the Geneva law would not apply in this war?", 
   {}, 
   48380, 
   null, 
   1083967260.0
  ], 
  [
   48386, 
   null, 
   "jim's trucking", 
   "...Did Rummey ever say that the Geneva law would not apply in this war?\n\n \n No. He said it doesn't apply to al Qaida.", 
   {}, 
   48383, 
   null, 
   1083967620.0
  ], 
  [
   48388, 
   null, 
   "The_Comedian", 
   "No. He said it doesn't apply to al Qaida.\n\n Does this result in an surprisingly increasing amount of al Qaida terrorists in Iraq?\n :p", 
   {}, 
   48386, 
   null, 
   1083967860.0
  ], 
  [
   48395, 
   null, 
   "sglaine", 
   "No. He said it doesn't apply to al Qaida.\n\n I think if you look into it you just might find out he has said that.", 
   {}, 
   48386, 
   null, 
   1083968520.0
  ], 
  [
   48397, 
   null, 
   "jitobear", 
   "No. He said it doesn't apply to al Qaida.\n\n \n I am pretty sure he also said it would not apply to prisoners in Iraq.", 
   {}, 
   48386, 
   null, 
   1083968940.0
  ], 
  [
   48399, 
   null, 
   "jim's trucking", 
   "I am pretty sure he also said it would not apply to prisoners in Iraq.\n\n \n You're wrong.", 
   {}, 
   48397, 
   null, 
   1083969060.0
  ], 
  [
   48423, 
   null, 
   "sglaine", 
   "You're wrong.\n\n Jim how is it wrong?", 
   {}, 
   48399, 
   null, 
   1083973140.0
  ], 
  [
   48709, 
   null, 
   "sglaine", 
   "Did any body watch CNN today this abuse scandle is just starting. More to come.", 
   {}, 
   48423, 
   null, 
   1084136940.0
  ], 
  [
   48788, 
   null, 
   "jskufan", 
   "The allegations of abuse were made public back in January, right after they were known to the military command. Just because some liberal Senator accuses Rumsfeld of trying to hide something, doesn't mean it happened that way.\n \n Of course, liberals will believe anything that Ted (Chappaquidic) Kennedy says.\n \n Incidently, I watched him question Rumsfeld during lunch today. It looks like the excess drinking has gotten to his nose.\n\n \n What was done to rectify the situation from January to May? I thought President Bush was angry with Rumsfield because the first he saw the abuse photos was on CBS \"60 Minutes\". Why are all the prison reforms just now being instigated? You're right, everything was handled just perfectly all the way down the chain of command. One thing I've noticed is that it seems to be very difficult for Republicans to admit any wrong, they're more comfortable distracting from the issue's by making fun of \"old\" Democrats.", 
   {}, 
   48337, 
   null, 
   1084202460.0
  ], 
  [
   48846, 
   null, 
   "jim's trucking", 
   "What was done to rectify the situation from January to May? I thought President Bush was angry with Rumsfield because the first he saw the abuse photos was on CBS \"60 Minutes\". Why are all the prison reforms just now being instigated? You're right, everything was handled just perfectly all the way down the chain of command. One thing I've noticed is that it seems to be very difficult for Republicans to admit any wrong, they're more comfortable distracting from the issue's by making fun of \"old\" Democrats.\n\n \n The investigations started in January.", 
   {}, 
   48788, 
   null, 
   1084215360.0
  ], 
  [
   48885, 
   null, 
   "sglaine", 
   "They might have started in Jan so it gave them time to figure out how to cover most of it up. So the bigger officials can scrworm out of a mess and keep there jobs.", 
   {}, 
   48846, 
   null, 
   1084223040.0
  ], 
  [
   48896, 
   null, 
   "jim's trucking", 
   "Kids fight on a school bus.\n \n Should the bus driver be fired?\n \n Should the Superintendent of Schools resign?\n \n Should the Governor resign?\n \n Should the President of BlueBird Bus Company resign?\n \n \n Question:\n How many ridiculous arguments can a liberal come up with?\n \n Answer:\n All of them!", 
   {}, 
   48885, 
   null, 
   1084224600.0
  ], 
  [
   48901, 
   null, 
   "sglaine", 
   "Kids fight on a school bus.\n \n Should the bus driver be fired?\n \n Should the Superintendent of Schools resign?\n \n Should the Governor resign?\n \n Should the President of BlueBird Bus Company resign?\n \n \n Question:\n How many ridiculous arguments can a liberal come up with?\n \n Answer:\n All of them!\n You are way off base because Rummy is not the bluebird on this. He should resign because he is ultimately responsible for the actions of what go's on. He gives orders for his personal to the Generals and they have to over look there personal as well. You see Jim the Kids took upon them selfs to fight on the Bus but bet your bottom dollar the driver broke it up. And in the prison scandal our arm force's should know better and use better tact in there dutys.", 
   {}, 
   48896, 
   null, 
   1084225080.0
  ], 
  [
   48902, 
   null, 
   "jim's trucking", 
   "You are way off base because Rummy is not the bluebird on this. He should resign because he is ultimately responsible for the actions of what go's on. He gives orders for his personal to the Generals and they have to over look there personal as well. You see Jim the Kids took upon them selfs to fight on the Bus but bet your bottom dollar the driver broke it up. And in the prison scandal our arm force's should know better and use better tact in there dutys.\n\n \n Do you actually think Rumsfeld gave the orders to humiliate and abuse the prisoners in the manner they were? Do you actually believe that's what happened.\n \n Any time you put guards in charge of detainees, you will find sadistic thoughts taking over.\n \n Those who gave the orders and those who followed the orders should be punished.", 
   {}, 
   48901, 
   null, 
   1084225500.0
  ], 
  [
   48911, 
   null, 
   "sglaine", 
   "Do you actually think Rumsfeld gave the orders to humiliate and abuse the prisoners in the manner they were? Do you actually believe that's what happened.\n \n Any time you put guards in charge of detainees, you will find sadistic thoughts taking over.\n \n Those who gave the orders and those who followed the orders should be punished.\n\n He is still responsible for what go's on right it his job to make sure that things are running smooth. He did not say anthing for so long to congress makes me think he was trying to cover something up. He knew about this in Jan. And it is just coming out last week. come on now read between the lines.", 
   {}, 
   48902, 
   null, 
   1084225980.0
  ], 
  [
   48926, 
   null, 
   "Waxy", 
   "Kids fight on a school bus.\n \n Should the bus driver be fired?\n \n Should the Superintendent of Schools resign?\n \n Should the Governor resign?\n \n Should the President of BlueBird Bus Company resign?\n \n \n Question:\n How many ridiculous arguments can a liberal come up with?\n \n Answer:\n All of them!\n\n \n Do I get fired if my field employees don't get things done on time and my projects end up failing?\n \n Does my VP get fired if the workers in the dept aren't getting it done?\n \n Does the CEO get fired if the company doesn't meet shareholder expectations?\n \n Do coaches/general managers get fired if their team loses?\n \n YES. OF COURSE THEY DO.\n \n If you're in charge of people, you accept responsibility for their actions, and the affect it may have on you personally. That's a fact of life. It is also freely accepted by those in managerial positions as both a con and a potential plus.\n \n Why sully your points with such ridiculous statements about liberals? Or is that another \"joke\"?\n \n Waxy", 
   {}, 
   48896, 
   null, 
   1084227900.0
  ], 
  [
   48929, 
   null, 
   "sglaine", 
   "Do I get fired if my field employees don't get things done on time and my projects end up failing?\n \n Does my VP get fired if the workers in the dept aren't getting it done?\n \n Does the CEO get fired if the company doesn't meet shareholder expectations?\n \n Do coaches/general managers get fired if their team loses?\n \n YES. OF COURSE THEY DO.\n \n If you're in charge of people, you accept responsibility for their actions, and the affect it may have on you personally. That's a fact of life. It is also freely accepted by those in managerial positions as both a con and a potential plus.\n \n Why sully your points with such ridiculous statements about liberals? Or is that another \"joke\"?\n \n Waxy\n waxy how true it is because it is the real world.", 
   {}, 
   48926, 
   null, 
   1084228140.0
  ], 
  [
   48951, 
   null, 
   "jskufan", 
   "For the life of me I just can't figure out how being against the war or objecting to one of our governments foreign policies makes a person a \"Liberal\". The terms Conservative and Liberal really pertain to the philosophy of our government running \"OUR\" country. There aren't any provisions for foreign policies that throw conservative values out the window. You modern day Republicans are enchanted with the idea of being Conservatives, you just can't elect a politician that fits the definition. Go back and re-read the definition of Conservative, see how well it applies to this administration, ( Hint: they love to spend ). Please, no distractions about Clinton or Kerry, just analyze this administration, since we're using labels.", 
   {}, 
   48929, 
   null, 
   1084233000.0
  ], 
  [
   48955, 
   null, 
   "sglaine", 
   "For the life of me I just can't figure out how being against the war or objecting to one of our governments foreign policies makes a person a \"Liberal\". The terms Conservative and Liberal really pertain to the philosophy of our government running \"OUR\" country. There aren't any provisions for foreign policies that throw conservative values out the window. You modern day Republicans are enchanted with the idea of being Conservatives, you just can't elect a politician that fits the definition. Go back and re-read the definition of Conservative, see how well it applies to this administration, ( Hint: they love to spend ). Please, no distractions about Clinton or Kerry, just analyze this administration, since we're using labels.\n\n Hey jskufan what there are doing is called stereo typing it is a yuppie way of labeling thats what the concervatives do well in.", 
   {}, 
   48951, 
   null, 
   1084233960.0
  ], 
  [
   48996, 
   null, 
   "daewoo", 
   "For the life of me I just can't figure out how being against the war or objecting to one of our governments foreign policies makes a person a \"Liberal\". The terms Conservative and Liberal really pertain to the philosophy of our government running \"OUR\" country. There aren't any provisions for foreign policies that throw conservative values out the window. You modern day Republicans are enchanted with the idea of being Conservatives, you just can't elect a politician that fits the definition. Go back and re-read the definition of Conservative, see how well it applies to this administration, ( Hint: they love to spend ). Please, no distractions about Clinton or Kerry, just analyze this administration, since we're using labels.\n\n \n YOu are right. You want a conservative, take a look at Pat Buchanan (the guy who should be president), or the Cato Institute (ok, so they are libertarians, but they are VERY conservative). I am not sure how Bush and companies policies are conservative. Spend everything you've got, then some that you don't doesn't sound real conservative to me. Invade another country at the cost of billions of dollars then try to justify it in the name of improving the quality of life for the residents, even though they have taken up arms and are killing our own soldiers. THis sounds suspiciously like a bunch of liberal cr@p to me.\n \n The liberals seem to be pretty much what they have always been, a bunch of whiney socialists who are looking for a nanny state so they can act wiithout ever having to take responsibility for their actions.\n \n Some genius is going to reply \"you really shouldn't label people blah blah blah. We lable everything. A four legged mamal with certain charachteristics is labeled a \"DOG\". All dogs may not be beagles, just like all liberals might not socialists, but a dog is a dog is a dog.", 
   {}, 
   48951, 
   null, 
   1084244340.0
  ], 
  [
   49063, 
   null, 
   "sglaine", 
   "YOu are right. You want a conservative, take a look at Pat Buchanan (the guy who should be president), or the Cato Institute (ok, so they are libertarians, but they are VERY conservative). I am not sure how Bush and companies policies are conservative. Spend everything you've got, then some that you don't doesn't sound real conservative to me. Invade another country at the cost of billions of dollars then try to justify it in the name of improving the quality of life for the residents, even though they have taken up arms and are killing our own soldiers. THis sounds suspiciously like a bunch of liberal cr@p to me.\n \n The liberals seem to be pretty much what they have always been, a bunch of whiney socialists who are looking for a nanny state so they can act wiithout ever having to take responsibility for their actions.\n \n Some genius is going to reply \"you really shouldn't label people blah blah blah. We lable everything. A four legged mamal with certain charachteristics is labeled a \"DOG\". All dogs may not be beagles, just like all liberals might not socialists, but a dog is a dog is a dog.\nMakes sense to me yes very well put you should wright a book.", 
   {}, 
   48996, 
   null, 
   1084291680.0
  ], 
  [
   49065, 
   null, 
   "Eddie", 
   "Some genius is going to reply \"you really shouldn't label people blah blah blah. We lable everything. A four legged mamal with certain charachteristics is labeled a \"DOG\". All dogs may not be beagles, just like all liberals might not socialists, but a dog is a dog is a dog.\n\n \n What kind of definitions do you use when you draw the conclusion that a liberal is a socialist? I mean, if socialist=liberal, the definitions for a socialist must be the same as a liberal, right? And if it is, why do we even bother with having two seperate labels?", 
   {}, 
   48996, 
   null, 
   1084292040.0
  ], 
  [
   49106, 
   null, 
   "daewoo", 
   "What kind of definitions do you use when you draw the conclusion that a liberal is a socialist? I mean, if socialist=liberal, the definitions for a socialist must be the same as a liberal, right? And if it is, why do we even bother with having two seperate labels?\n\n \n Sorry, going strictly by US political terms (If I remember properly you are situated on the other side of the pond?) you will never find a consevative socialist in America.", 
   {}, 
   49065, 
   null, 
   1084301880.0
  ], 
  [
   49110, 
   null, 
   "sglaine", 
   "I just thought of something if this was going on in Jan. Why did it take for the photos to get out to the public before anything is being done. i think if the abuse photos did not make it to the public I think they would still have it covered up. Makes you wonder haw many other things are covered up by this administration that we don't know about.", 
   {}, 
   49106, 
   null, 
   1084303020.0
  ], 
  [
   49122, 
   null, 
   "Eddie", 
   "Sorry, going strictly by US political terms (If I remember properly you are situated on the other side of the pond?) you will never find a consevative socialist in America.\n\n \n Ah, yes :) But still, what makes an american liberal an american socialist?", 
   {}, 
   49106, 
   null, 
   1084307040.0
  ], 
  [
   49124, 
   null, 
   "daewoo", 
   "I just thought of something if this was going on in Jan. Why did it take for the photos to get out to the public before anything is being done. i think if the abuse photos did not make it to the public I think they would still have it covered up. Makes you wonder haw many other things are covered up by this administration that we don't know about.\n\n \n It was reported in Jan that there were cases of prisoner abuse and that an investigation was begining. The photos were just leaked recently, and it appears that they were fairly recent. \n \n his is how we get information in America, we wait for somebody to to leak it to us. Our governemtn acts within a cloak of secrecy, they rule, we grovel, why should we need to know what is going on.\n \n It is a little one sided to accuse the bush administration of coverups and un-needed secrecy, Bill Clintons entertainment budget was classified. This is just hw we do things now.", 
   {}, 
   49110, 
   null, 
   1084307100.0
  ], 
  [
   49126, 
   null, 
   "daewoo", 
   "Makes sense to me yes very well put you should wright a book.\n\n \n I don't think that it would be a best seller. People want to hear \"America is the greatest country in the world\" and \"your government is democratically elected and is working for you\" and \"we have freedom in America, they don't have that other places. People want to believe their opinion means something, and that they are somehow empowered when they step into a voting booth. \n \n People do not want to hear that the system is broken and may actually be so screwed up that we may not be able to fix it before the militia wackos start killing people. They certainly don't want to hear that the wackos have some good points on some issues. People don't want to hear that there is only one political party left, the special interest whores. This is the master political party in the US, the Republicans and Democrats are both branches of this master party. They certainly do not want to hear \"America has had a good run, but seems tobe going down the toilet\".\n \n Nope, I don't think that such a book is likely to be real popular.", 
   {}, 
   49063, 
   null, 
   1084308060.0
  ], 
  [
   49127, 
   null, 
   "sglaine", 
   "It was reported in Jan that there were cases of prisoner abuse and that an investigation was begining. The photos were just leaked recently, and it appears that they were fairly recent. \n \n his is how we get information in America, we wait for somebody to to leak it to us. Our governemtn acts within a cloak of secrecy, they rule, we grovel, why should we need to know what is going on.\n \n It is a little one sided to accuse the bush administration of coverups and un-needed secrecy, Bill Clintons entertainment budget was classified. This is just hw we do things now.\n\n Come on now we are in Bush administration now not Clinton's. We need to deal with the existing problems and this administration does not want to be uncovered and trust me on this because we have not seen the tip of iceberg yet. The abuse was going on in Jan. It just got to the public now come on I smell a giant coverup. And Clinton did not have anything to do with thoughs prisoners.", 
   {}, 
   49124, 
   null, 
   1084308060.0
  ], 
  [
   49130, 
   null, 
   "daewoo", 
   "Come on now we are in Bush administration now not Clinton's. We need to deal with the existing problems and this administration does not want to be uncovered and trust me on this because we have not seen the tip of iceberg yet. The abuse was going on in Jan. It just got to the public now come on I smell a giant coverup. And Clinton did not have anything to do with thoughs prisoners.\n\n \n Of course not. My point s that there most likely are coverups going on. There were also coverups under Clinton, Bush I, Reagan, Carter, etc... WE can almost infer just from the fact that Bush is president that he is covering things up. \n \n The abuse was in the news in january, that is pretty public. The pictures just got leaked last month, but it sems that most of them were just taken last month. It is deiiferent hearing the words, as we did in january, and seeing the pictures. I would imagine we will find that it is much more widespread and likely much more sever than we have realised to date.", 
   {}, 
   49127, 
   null, 
   1084308540.0
  ], 
  [
   49176, 
   null, 
   "sglaine", 
   "Of course not. My point s that there most likely are coverups going on. There were also coverups under Clinton, Bush I, Reagan, Carter, etc... WE can almost infer just from the fact that Bush is president that he is covering things up. \n \n The abuse was in the news in january, that is pretty public. The pictures just got leaked last month, but it sems that most of them were just taken last month. It is deiiferent hearing the words, as we did in january, and seeing the pictures. I would imagine we will find that it is much more widespread and likely much more sever than we have realised to date.\n\n Yea but we need to uncover Bush because of all of his slizzy stuff he has pulled off like the war in general. we don't need to be there in the first stinking place. We did not get to much backing from the rest of world that in it self should tell some thing. I'm sorry but I think he should be impeached. there has been more significant damage then Clinton or any other president has ever done in recent history.And because of Bushs right hand man an American was killed and posted on the internet. Rummsfeld needs to resign before something else happens. They are all crooked.", 
   {}, 
   49130, 
   null, 
   1084319220.0
  ], 
  [
   49251, 
   null, 
   "Ghost", 
   "I think it's kinda interesting how you can predict exactly who will respond to this thread and what their position on the matter is. The people who are wanting Rumsfeld to resign are exactly the people I thought would, and the people defending him are exactly who I thought would.\n \n This whole situation with the Abu Ghraib prison is rather odd to me. We've got these pictures which are being released in order of ascending impact...obviously someone with an agenda. There is this huge outcry against this behavior in Congress, in these forums, and in America in general. Some idiot Senator said that Saddam's torture chambers had reopened, just under new management.\n \n Then we've got things like the beheading of the contractor today and the video footage of it, we've got the mutilation of the 4 contractors in Fallujah, we've got the filmed murder of Daniel Pearl...and I don't see much outrage here. I'm kind of wondering why that is? Maybe some of you who are so up in arms over the prison scandal could explain why that makes you angrier than these occurrences?\n \n Has anyone thought about who it is in the pictures from the prison? Or put it into context? These pictures were taken in the worst section of the prison, where they keep the most dangerous and the worst offenders. What's being done to them is humiliating and degrading, absolutely. Many of the people in those pictures, I'd be willing to bet you, had played an active hand in the killings of Americans.", 
   {}, 
   49176, 
   null, 
   1084331880.0
  ], 
  [
   49265, 
   null, 
   "jskufan", 
   "I think it's kinda interesting how you can predict exactly who will respond to this thread and what their position on the matter is. The people who are wanting Rumsfeld to resign are exactly the people I thought would, and the people defending him are exactly who I thought would.\n \n This whole situation with the Abu Ghraib prison is rather odd to me. We've got these pictures which are being released in order of ascending impact...obviously someone with an agenda. There is this huge outcry against this behavior in Congress, in these forums, and in America in general. Some idiot Senator said that Saddam's torture chambers had reopened, just under new management.\n \n Then we've got things like the beheading of the contractor today and the video footage of it, we've got the mutilation of the 4 contractors in Fallujah, we've got the filmed murder of Daniel Pearl...and I don't see much outrage here. I'm kind of wondering why that is? Maybe some of you who are so up in arms over the prison scandal could explain why that makes you angrier than these occurrences?\n \n Has anyone thought about who it is in the pictures from the prison? Or put it into context? These pictures were taken in the worst section of the prison, where they keep the most dangerous and the worst offenders. What's being done to them is humiliating and degrading, absolutely. Many of the people in those pictures, I'd be willing to bet you, had played an active hand in the killings of Americans.\n\n \n I'm not sure I understand your point. It appears you're upset because there's discontent in America over the poor treatment of Iraqi \"detainees\". Notice I used the word detainee because some of these people were arrested because we \"suspected\" them of wrong doing. Of course every American is outraged over the execution of the American soldiers and contractor. The point is, those crimes were committed by criminal thugs, maybe even terrorists. Don't you want to hold our military to a higher standard than that? The idea that our citizens monitor the behavior of our government is what makes our country different than the pre-war Iraq.", 
   {}, 
   49251, 
   null, 
   1084334340.0
  ], 
  [
   49278, 
   null, 
   "King Triton", 
   "Of course not. My point s that there most likely are coverups going on. There were also coverups under Clinton, Bush I, Reagan, Carter, etc... WE can almost infer just from the fact that Bush is president that he is covering things up. \n \n The abuse was in the news in january, that is pretty public. The pictures just got leaked last month, but it sems that most of them were just taken last month. It is deiiferent hearing the words, as we did in january, and seeing the pictures. I would imagine we will find that it is much more widespread and likely much more sever than we have realised to date.\n\n \n My only question here is,If indeed the abuse was reported in Jan and as you say it looks like most of these pictures were taken last month,doesn`t this make you want to question just what is going on?", 
   {}, 
   49130, 
   null, 
   1084337700.0
  ], 
  [
   49367, 
   null, 
   "georged", 
   "I understood that some of the original videos were taken (as dated on the exposures) as early as August 2003, when the International Red Cross began formal reports to their home office and other humanitarian organizations. Our military began their internal investigation in November 2003, and had it pretty well sealed up with sacrificial enlisted and jr officers designated for service record slaps on the hand in December, about the time photos and videos started filtering in to media sources. When 60 minutes and other media programmers approached our military for source verification, the warning bell went off and a confined general inquiry was ordered in January. The rest we know. \n \n As to the observation that while many of us condemn the actions of our military with regard to abuse and torture of Iraqis, we ignore the damage done by Iraqis to civilian contractor employees. This expedition into Iraq was originally presented to us as a patriotic pre-emptive strike to eliminate what turned out to be non-existent WMDs in an effort to protect our country from future damage by a third-tier country. The spin was then switched to liberating the Iraqi people from the tyranny of a despotic dictator. Last but not least, it was a part of the war on terrorism even though both Bush and Blair publicly denied any connection between Iraq and Bin Laden. My personal opinion of our motivation ranges between being duped and how stupid are we.\n \n I can't speak for others, but personally feel little sympathy for any contractor employee in Iraq. A neighbor's son is employed there by one of the multitude of Cheney's subs, $78,000/yr and enough bennies to make even a communist jealous for two brain cells required food preparation duties. All civilian contract employees in Iraq are put through an extensive briefing prior to going in-country with particular attention paid to the fact that they are seriously at risk in Iraq with injury and or death being a distinct possibility to remove future legal issues. To me, that makes them mercenaries in it for the money, a personal choice not deserving of sympathy other than 'that's too bad'.", 
   {
    "unicode_changes_made": true
   }, 
   49278, 
   null, 
   1084376700.0
  ], 
  [
   49467, 
   null, 
   "Ghost", 
   "\n I can&#8217;t speak for others, but personally feel little sympathy for any contractor employee in Iraq. A neighbor&#8217;s son is employed there by one of the multitude of Cheney&#8217;s subs, $78,000/yr and enough bennies to make even a communist jealous for two brain cells required food preparation duties. All civilian contract employees in Iraq are put through an extensive briefing prior to going in-country with particular attention paid to the fact that they are seriously at risk in Iraq with injury and or death being a distinct possibility to remove future legal issues. To me, that makes them mercenaries in it for the money, a personal choice not deserving of sympathy other than &#8216;that&#8217;s too bad&#8217;.\n\n \n I understand where you're coming from, but I think you'd feel differently if that was someone you loved getting beheaded in the video, or mutilated and hung from a bridge.\n \n Jskufan, my point is only that there seems to be so much outcry and anger over what happened at Abu Ghraib, but there seems to be less anger at the atrocities committed against us. It just seems to be to be part of a trend that many people have been going along with, which is that America is at fault for everything and we deserve whatever we get. That defensive anger that we had on 9/11 sems to be gone. We don't get ****** at Saddam and Osama, we get ****** off at Bush and Rumsfeld for how they handle them. There seems to be more anger directed at our own people than there is towards our enemies.\n \n I absolutely want to hold our military at a higher standard than that, and I believe we do. Try to compare the pictures you've seen at Abu Ghraib, and the videos of captive Americans being beheaded in front of a camera. We are at a higher standard than they are. Some of what happened in Abu Ghraib is sickening, specifically the (rare) torture and a portion of the pictures of abuse. But the red cross was complaining about detainees being held in dark rooms naked and alone, and denounced this as excessively cruel. These are suspected enemy combatants. If you've been out there killing and maiming people, being marched around naked and hooded means you're getting off easy.", 
   {}, 
   49367, 
   null, 
   1084393200.0
  ], 
  [
   49527, 
   null, 
   "jskufan", 
   "\n Jskufan, my point is only that there seems to be so much outcry and anger over what happened at Abu Ghraib, but there seems to be less anger at the atrocities committed against us. It just seems to be to be part of a trend that many people have been going along with, which is that America is at fault for everything and we deserve whatever we get. That defensive anger that we had on 9/11 sems to be gone. We don't get ****** at Saddam and Osama, we get ****** off at Bush and Rumsfeld for how they handle them. There seems to be more anger directed at our own people than there is towards our enemies.\n \n \n\n \n There's plenty of anger for the criminals that committed these atrocities. There's millions of dollars in bounty money for information leading to their capture. The problem is, we probably don't know specifically who they all are. It's very easy to punish those involved in the prisoner abuse, they work for us. As for people criticizing Bush and Cheney for what's going on in Iraq, remember, a large part of the American public was never, and still is not in agreement with this administration that we should even be in Iraq. Nonetheless, they're all forced to bite the bullet and go to work every day to help pay for it. If you're glad we are there, great, that's your right. Just don't expect the rest of us to choke it down every day with a smile. I keep thinking about all the ways 1 trillion dollars could benefit \"OUR\" country, then I get angry all over again. With everything we've sacrificed over the last year, do you honestly think you're safer from terrorism?", 
   {}, 
   49467, 
   null, 
   1084407000.0
  ], 
  [
   49530, 
   null, 
   "sglaine", 
   "There's plenty of anger for the criminals that committed these atrocities. There's millions of dollars in bounty money for information leading to their capture. The problem is, we probably don't know specifically who they all are. It's very easy to punish those involved in the prisoner abuse, they work for us. As for people criticizing Bush and Cheney for what's going on in Iraq, remember, a large part of the American public was never, and still is not in agreement with this administration that we should even be in Iraq. Nonetheless, they're all forced to bite the bullet and go to work every day to help pay for it. If you're glad we are there, great, that's your right. Just don't expect the rest of us to choke it down every day with a smile. I keep thinking about all the ways 1 trillion dollars could benefit \"OUR\" country, then I get angry all over again. With everything we've sacrificed over the last year, do you honestly think you're safer from terrorism?\n\n Nope I don't feel safer from terrorism because they will delope new ways to get us.", 
   {}, 
   49527, 
   null, 
   1084408080.0
  ], 
  [
   49537, 
   null, 
   "georged", 
   "I understand where you're coming from, but I think you'd feel differently if that was someone you loved getting beheaded in the video, or mutilated and hung from a bridge.\n \n It just seems to be to be part of a trend that many people have been going along with, which is that America is at fault for everything and we deserve whatever we get. There seems to be more anger directed at our own people than there is towards our enemies.\n \n I absolutely want to hold our military at a higher standard than that, and I believe we do. Try to compare the pictures you've seen at Abu Ghraib, and the videos of captive Americans being beheaded in front of a camera. We are at a higher standard than they are. Some of what happened in Abu Ghraib is sickening, specifically the (rare) torture and a portion of the pictures of abuse. But the red cross was complaining about detainees being held in dark rooms naked and alone, and denounced this as excessively cruel. These are suspected enemy combatants. If you've been out there killing and maiming people, being marched around naked and hooded means you're getting off easy.\n\n \n Emotion for a loved one is a far reach from a paid mercenary doing his/her job. \n \n IMO, and that of around half the US population, is that our aggresive foreign policies, ongoing support of Israel's real estate policies and invasion/occupation of a third tier nation like Iraq have all brought us retaliation from Islamic extremists. Who is to blame? If I had troopers occupying my city who could not even speak my language while dismissing my beliefs and cultural history, I'd probably be making bombs in my garage and reloading 22.250s to bomb and hunt with after dark. And guess who I'd be after? \n \n This administration is spending my money and killing my fellow countrymen under the guise of wearing the White Hat while supposedly liberating Iraq from a tyrannical leader. That's the excuse after WMD proved scarce. I expect them, as my representatives and military, to maintain standards equal to Caesar's wife. This abuse and torture scenario responsibility is already up to general officer rank and now Rummy is condoning their interrogation techniques, rationalizing it as necessary under the conditions of fighting a war on terror, blah, blah, blah. I feel like a chump who just believed the carny worker that said anyone could easily toss three rings onto the peg.", 
   {}, 
   49467, 
   null, 
   1084408620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Rummsfeld handling abuse in Iraq!!", 
  "url": "http://www.4forums.com/political/politics-debates/2349-rummsfeld-handling-abuse-iraq.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2349, 
  "discussion_files": [
   [
    "19418.html", 
    "http://www.4forums.com/political/politics-debates/2349-rummsfeld-handling-abuse-iraq-print.html"
   ], 
   [
    "19419.html", 
    "http://www.4forums.com/political/politics-debates/2349-rummsfeld-handling-abuse-iraq-4-print.html"
   ], 
   [
    "19420.html", 
    "http://www.4forums.com/political/politics-debates/2349-rummsfeld-handling-abuse-iraq-3-print.html"
   ], 
   [
    "19421.html", 
    "http://www.4forums.com/political/politics-debates/2349-rummsfeld-handling-abuse-iraq-2-print.html"
   ]
  ], 
  "identifier": 2349
 }
]