[
 [
  [
   48529, 
   null, 
   "Pro-Bush", 
   "Who or what do you guys think the AntiChrist is going to be?\n \n I myself believe it is gay marriage.", 
   {
    "post_info": {
     "post_title": "The Coming of the Anti-Christ"
    }
   }, 
   null, 
   null, 
   1084039560.0
  ], 
  [
   48531, 
   null, 
   "Haulingboat", 
   "Modern science", 
   {}, 
   48529, 
   null, 
   1084041120.0
  ], 
  [
   48581, 
   null, 
   "Lily", 
   "Who or what do you guys think the AntiChrist is going to be?\n \n I myself believe it is gay marriage.\n\n \n Stupidity in the form of discrimination.", 
   {}, 
   48529, 
   null, 
   1084059360.0
  ], 
  [
   48641, 
   null, 
   "sundowner", 
   "Intolerent people who hide behind a guise of religion.", 
   {}, 
   48581, 
   null, 
   1084087740.0
  ], 
  [
   48781, 
   null, 
   "Phunting", 
   "George Dubya", 
   {}, 
   48641, 
   null, 
   1084192140.0
  ], 
  [
   48804, 
   null, 
   "sinjin", 
   "Since when can the Antichrist be a what and not a who? \n I don't subscribe to the theory anyway, just another veiled threat of eternal damnation for those who would go their own way.", 
   {}, 
   48781, 
   null, 
   1084206720.0
  ], 
  [
   48815, 
   null, 
   "Valthonis", 
   "Stupidity in the form of discrimination.\n\n \n That is not discrimination. It is his belief. Are you discriminating against stupid people?", 
   {}, 
   48581, 
   null, 
   1084209720.0
  ], 
  [
   48816, 
   null, 
   "Valthonis", 
   "George Dubya\n\n \n Why is that?", 
   {}, 
   48781, 
   null, 
   1084209840.0
  ], 
  [
   48830, 
   null, 
   "Waxy", 
   "I'm going to go with ignorance arising from intolerance where only tolerance should be.\n \n Waxy", 
   {}, 
   48816, 
   null, 
   1084212660.0
  ], 
  [
   49002, 
   null, 
   "Pro-Bush", 
   "That is not discrimination. It is his belief. Are you discriminating against stupid people?\n \n \n Thanks emoticon_xhoho \n \n \n There wouldn't be any disagreements if there wasn't a little discrimination. Come on, Valthonis, if you ever said that you've never discriminated in your life, I wouldn't believe you", 
   {}, 
   48815, 
   null, 
   1084250460.0
  ], 
  [
   49010, 
   null, 
   "Relient Halo", 
   "Intolerent people who hide behind a guise of religion.\n\n \n What is the definition of tolerance, because from what you're saying, to be tolerant is to accept. Bzzzz! Sorry, wrong answer.\n \n And back to the question at hand. I don't know WHO (the anti-christ is going to be a person, last time I checked) the anti-christ is going to be, because that's the point. If we knew they were the anti-christ, then why would we follow them from the get-go?", 
   {}, 
   48641, 
   null, 
   1084257300.0
  ], 
  [
   49011, 
   null, 
   "Relient Halo", 
   "George Dubya\n\n \n I love how pure unadulterated hatred always shines through in the end.", 
   {}, 
   48781, 
   null, 
   1084257360.0
  ], 
  [
   49041, 
   null, 
   "Phunting", 
   "I love how pure unadulterated hatred always shines through in the end.\nNow now Halo, I was only joking! Perhaps I should pepper my posts with smilies in future to make these things clear. ;) :p emoticon_frazzled emoticon_rolleyes emoticon_cool \n \n Though that said, I wouldn't be overly surprised! After all the antichrist is meant to be a great world leader. And of course:\n \n George (6) Walker (6) Bush Jr (6)\n \n \n What more proof do you need?", 
   {}, 
   49011, 
   null, 
   1084279800.0
  ], 
  [
   49044, 
   null, 
   "Big Orn", 
   "If we knew they were the anti-christ, then why would we follow them from the get-go?\n\n True...But:\n This person (he or she) will be so magnificent, so good, and so great, that we will follow him to the edge of a cliff and gladly jump to be with him in Heaven (or whatever our idea of that may be). He will solve the world's problems, lower gas prices, lower taxes, eliminate government spending, create order is chaos, bring about world peace, etc. etc., so that we will be unable to resist him and his policies. We will have all that we need simply by presenting a number, symbol, or other form of I.D. Money will be virtually non-existent &#8211; unnecessary.\n He could be any person, any race, from any country, but will be immediately accepted because if his character. A time of calm will accompany him and finally we will have what we&#8217;ve all prayed, hoped, or wished for.\n We, even the &#8220;saints&#8221;, will be fooled, if only for a short while, due to the irresistible circumstances. When dreams come true, what would you be willing to trade, sell, give, in order to attain it?", 
   {}, 
   49041, 
   null, 
   1084282080.0
  ], 
  [
   49047, 
   null, 
   "Relient Halo", 
   "True...But:\n This person (he or she) will be so magnificent, so good, and so great, that we will follow him to the edge of a cliff and gladly jump to be with him in Heaven (or whatever our idea of that may be). He will solve the world's problems, lower gas prices, lower taxes, eliminate government spending, create order is chaos, bring about world peace, etc. etc., so that we will be unable to resist him and his policies. We will have all that we need simply by presenting a number, symbol, or other form of I.D. Money will be virtually non-existent - unnecessary.\n He could be any person, any race, from any country, but will be immediately accepted because if his character. A time of calm will accompany him and finally we will have what we've all prayed, hoped, or wished for.\n We, even the \"saints\", will be fooled, if only for a short while, due to the irresistible circumstances. When dreams come true, what would you be willing to trade, sell, give, in order to attain it?\n\n \n If I knew he was the anti-christ, no matter what they did, I would never follow. To do otherwise is to betray God, and I would rather die a brutal death here than to suffer the consequences of my treachery in Heaven. When dreams come true, then I'll be dreaming....", 
   {
    "unicode_changes_made": true
   }, 
   49044, 
   null, 
   1084284900.0
  ], 
  [
   49048, 
   null, 
   "Relient Halo", 
   "Now now Halo, I was only joking! Perhaps I should pepper my posts with smilies in future to make these things clear. ;) :p emoticon_frazzled emoticon_rolleyes emoticon_cool \n \n Though that said, I wouldn't be overly surprised! After all the antichrist is meant to be a great world leader. And of course:\n \n George (6) Walker (6) Bush Jr (6)\n \n \n What more proof do you need?\n\n \n There's nothing wrong with joking. And GW isn't a Jr I don't think", 
   {}, 
   49041, 
   null, 
   1084285020.0
  ], 
  [
   49059, 
   null, 
   "plotter", 
   "True...But:\n This person (he or she) will be so magnificent, so good, and so great, that we will follow him to the edge of a cliff and gladly jump to be with him in Heaven (or whatever our idea of that may be). He will solve the world's problems?\n\n Sounds like a bush supporter. From what i heard thats what they would do.", 
   {}, 
   49044, 
   null, 
   1084290060.0
  ], 
  [
   49062, 
   null, 
   "Eddie", 
   "There's nothing wrong with joking. And GW isn't a Jr I don't think\n\n \n Well, we have George Bush Sr, and we have his son George Bush Jr. Isn`t that how it works?\n \n - Eddie, whos first language is not english.", 
   {}, 
   49048, 
   null, 
   1084291560.0
  ], 
  [
   49109, 
   null, 
   "sinjin", 
   "\n George (6) Walker (6) Bush Jr (6)\n What more proof do you need?\n\n \n Ronald(6) Wilson(6) Reagan(6)\n \n But he doesn't remember he's the antichrist.", 
   {}, 
   49041, 
   null, 
   1084302540.0
  ], 
  [
   49116, 
   null, 
   "Relient Halo", 
   "Ronald(6) Wilson(6) Reagan(6)\n \n But he doesn't remember he's the antichrist.\n\n \n Ouch, that was cold. Taking a stab at a man who can't even remember to fight back, how brave.", 
   {}, 
   49109, 
   null, 
   1084305120.0
  ], 
  [
   49119, 
   null, 
   "Big Orn", 
   "Ouch, that was cold. Taking a stab at a man who can't even remember to fight back, how brave.\n\n But, I snickered.\n \n Guess I know what he meant, though.", 
   {}, 
   49116, 
   null, 
   1084305420.0
  ], 
  [
   49121, 
   null, 
   "Ghost", 
   "I myself believe it is gay marriage.\n\n \n How so?\n \n \nThis person (he or she) will be so magnificent, so good, and so great, that we will follow him to the edge of a cliff and gladly jump to be with him in Heaven (or whatever our idea of that may be). He will solve the world's problems, lower gas prices, lower taxes, eliminate government spending, create order is chaos, bring about world peace, etc. etc., so that we will be unable to resist him and his policies. We will have all that we need simply by presenting a number, symbol, or other form of I.D. Money will be virtually non-existent - unnecessary.\n He could be any person, any race, from any country, but will be immediately accepted because if his character. A time of calm will accompany him and finally we will have what we've all prayed, hoped, or wished for.\n\n \n Maybe it's just my ignorance of Christian prophecies...but how is this bad?", 
   {
    "unicode_changes_made": true
   }, 
   48529, 
   null, 
   1084306560.0
  ], 
  [
   49135, 
   null, 
   "Big Orn", 
   "Maybe it's just my ignorance of Christian prophecies...but how is this bad?\n\n In our belief the antichrist will setup the world to benefit Satan (Powers of Darkness, the devil). If he/she succeeds then those that follow him will be forced to reject the Gospel.\n \n In other words they will be fooled by the &#8220;Good Times&#8221;, staying with it until it&#8217;s too late to turn back. Then, when they see who the antichrist really is, those that rejected him will have gone to Glory (Heaven), and the Tribulation will be over. Only pain and suffering, hunger and death will remain. The world as we know it will come to an end, torn apart and destroyed. It will be nothing but a ruined planet, unfit for humankind until the Lord restores it. How long that will take &#8211; I don&#8217;t know.\n \n That is my belief and it says so in the Bible, the book of Revelations.", 
   {}, 
   49121, 
   null, 
   1084309920.0
  ], 
  [
   49308, 
   null, 
   "Relient Halo", 
   "Well, we have George Bush Sr, and we have his son George Bush Jr. Isn`t that how it works?\n \n - Eddie, whos first language is not english.\n\n \n Umm, George # 41 is George Herbert Walker Bush, while George #43 is George Walker Bush. So for little Bush to be considered a Jr, he would have to add in Herbert as a middle name. Remember, they have to line up equally for him to be considered a Jr.", 
   {}, 
   49062, 
   null, 
   1084346640.0
  ], 
  [
   49337, 
   null, 
   "Eddie", 
   "Umm, George # 41 is George Herbert Walker Bush, while George #43 is George Walker Bush. So for little Bush to be considered a Jr, he would have to add in Herbert as a middle name. Remember, they have to line up equally for him to be considered a Jr.\n\n \n Do the middle names have to match to? Wow... Isn`t it kind of pointless, and perhaps even ludicris to name your son exactly like yourself? I mean, I can understand if you want to have the same first name (and last name), but middle name?...", 
   {}, 
   49308, 
   null, 
   1084363620.0
  ], 
  [
   49422, 
   null, 
   "Relient Halo", 
   "Do the middle names have to match to? Wow... Isn`t it kind of pointless, and perhaps even ludicris to name your son exactly like yourself? I mean, I can understand if you want to have the same first name (and last name), but middle name?...\n\n \n Well, that's the rule unfortunately...", 
   {}, 
   49337, 
   null, 
   1084388580.0
  ], 
  [
   49617, 
   null, 
   "Eddie", 
   "Well, that's the rule unfortunately...\n\n \n Okey. I stand corrected.", 
   {}, 
   49422, 
   null, 
   1084445520.0
  ], 
  [
   49834, 
   null, 
   "Pro-Bush", 
   "Sounds like a bush supporter. From what i heard thats what they would do.\n\n \n What is so bad about George Walker Bush? You guys say Bush is so bad, but you never say why. Bush Bashers never seem to talk about any issues about why he is bad and why he does a horrible job as president.\n \n Are you people still mad about Gore losing in Florida? Or are you for Nader and think he has a chance in hell of winning? Do you guys think Al Quaeda would just leave us alone after 9-11? Heck, we have Saddam Hussein in custody. His regime has killed millions of people in Iraq and you guys are complainging that the United States has lost a couple hundred troops.", 
   {}, 
   49059, 
   null, 
   1084496880.0
  ], 
  [
   49847, 
   null, 
   "Nature's Cry", 
   "What is so bad about George Walker Bush? You guys say Bush is so bad, but you never say why. Bush Bashers never seem to talk about any issues about why he is bad and why he does a horrible job as president.\n \n Are you people still mad about Gore losing in Florida? Or are you for Nader and think he has a chance in hell of winning? Do you guys think Al Quaeda would just leave us alone after 9-11? Heck, we have Saddam Hussein in custody. His regime has killed millions of people in Iraq and you guys are complainging that the United States has lost a couple hundred troops.\n\n \n I don't like him because I'm against every policy he's ever made.\n \n He fought for the anti marriage amendment, why shouldn't gays be allowed to marry?\n \n We know that Iraq had nothing to do with 9-11, why did we have to attack them? Those who were at fault for 9-11 should be the only ones we go after. Let's face it, our country can't go running around playing super hero right now, we are too much in debt. We need to get our country out of debt, and if we spend money it should be on something important, like education.\n \n Also, Bush has spent large amounts of money on things like making marriage counseling more available to citizens. It should be their own problem if they didn't realize that eternal love was supposed to last so long. That money could have been spent on funding colleges, so that kids right out of high school wouldn't have to pay so much, but instead he cuts the funding to schools, raising the prices. How is a teenager supposed to pay for this?", 
   {}, 
   49834, 
   null, 
   1084499400.0
  ], 
  [
   49860, 
   null, 
   "SilentPoet", 
   "Who or what do you guys think the AntiChrist is going to be?\n\n \n Liberalism / Altruism", 
   {}, 
   49847, 
   null, 
   1084502340.0
  ], 
  [
   49915, 
   null, 
   "Relient Halo", 
   "I don't like him because I'm against every policy he's ever made.\n \n He fought for the anti marriage amendment, why shouldn't gays be allowed to marry?\n \n We know that Iraq had nothing to do with 9-11, why did we have to attack them? Those who were at fault for 9-11 should be the only ones we go after. Let's face it, our country can't go running around playing super hero right now, we are too much in debt. We need to get our country out of debt, and if we spend money it should be on something important, like education.\n \n Also, Bush has spent large amounts of money on things like making marriage counseling more available to citizens. It should be their own problem if they didn't realize that eternal love was supposed to last so long. That money could have been spent on funding colleges, so that kids right out of high school wouldn't have to pay so much, but instead he cuts the funding to schools, raising the prices. How is a teenager supposed to pay for this?\n\n \n On the college issue, many of the colleges students are trying to get into are private I believe. If you want free college, then why don't we have three year mandatory service for a college degree? That way, it teaches the youth of America maturity (which I have found so many are in need of) and it will ready them for the real world. AND, schools are bad at spending money as it is. My girlfriends school is raising tuition to cover the HUGE flat screen plasma televisions they're putting in the offices of each department head. Now tell me, why do the department heads need 54' plasma screens? And being a teenager experiencing the college life (first year down) I know that it isn't easy to handle, but I manage. I make the sacrafices necessary, I am responsible with my finances and I saved while in high school adding a little of each pay check to the college fund my parents created for me. If you can't be responsible and do what you need to do to make it through the hard times, then I'm sorry, but maybe you should reconsider either your habits or your position in life.\n \n When it comes to education and home life, I see a direct correlation. If a kid has so many problems going on at home, do you really think they care that much about school? Where does the classroom fit on the priority list when your family is falling apart. You can't make the kids learn more by throwing money at the system. I was (and still am) a good student. I love to read, have an interest in learning (not only for my future but for the simple sake of knowledge). I KNOW for a FACT that I did not learn this on my own and it was something my parents helped instill in me. Did it help that I came from a healthy home, where my parents love(d) each other? I don't know for sure, but it's worth looking into. Frankly, I support President Bush for what he is doing in this area, for America is quickly forgetting what a family should be. It is a commitment, something that takes time and shouldn't be nullified when there's trouble in the water. That is how I see it. Marriage and household health (emotionally, mentally) are just as important, if not more, in my book.\n \n True, President Bush does not support gay marriage, but so does a good chunk of the country. Do not forget about the rest of us. Though I myself cannot see any political reason to expell gays from the right of marriage, I oppose it for a different reason, a moral reason. I applaud Bush for taking a stand on this heated issue and for standing his ground amidst the shots. You have to respect him for doing what so many politicians are not willing to do, and that is to stand by what he believes, if not for the stand itself.\n \n While I have not agreed with Presidents of the past (Clinton being the only one, as I am not that old) I still held respect for his position and the office in which he held. I will not lie and say I did so after the Clinton sex scandal, but that is another talk. While I am not in any way advocating a narrow frame of mind, especially in the political aspect, I am asking for a little respect for the President of the United States. While you cannot be for his policies, do not attack the man that you do not KNOW, for that is not fair. All I am asking you for is a little respect for the position, if not the man. Thank you.", 
   {}, 
   49847, 
   null, 
   1084519200.0
  ], 
  [
   49917, 
   null, 
   "Relient Halo", 
   "And back to the subject matter of the thread, I don't worry about the anti-christ. If he's all the Bible says he is to be, then it will be difficult for many to spot him. In all actuality, I say bring it on. The sooner the better, as I see it.", 
   {}, 
   49915, 
   null, 
   1084519260.0
  ], 
  [
   49954, 
   null, 
   "billsco", 
   " In all actuality, I say bring it on. The sooner the better, as I see it.\n\n \n Yes, I can't wait!!!!! Earthquakes, famine, hail, third of the population killed, locusts, torturing people for five months straight (glory!), kill another third of the population, plagues, drought, dead bodies lying unburied in the streets, blood flowing in the streets up to a horse's reins... bring it on!!!!\n \n And people wonder why I publicly denounce Christianity.", 
   {}, 
   49917, 
   null, 
   1084548060.0
  ], 
  [
   49976, 
   null, 
   "Relient Halo", 
   "Yes, I can't wait!!!!! Earthquakes, famine, hail, third of the population killed, locusts, torturing people for five months straight (glory!), kill another third of the population, plagues, drought, dead bodies lying unburied in the streets, blood flowing in the streets up to a horse's reins... bring it on!!!!\n \n And people wonder why I publicly denounce Christianity.\n\n \n Umm, yeah... So what's the rapture?", 
   {}, 
   49954, 
   null, 
   1084556100.0
  ], 
  [
   49988, 
   null, 
   "billsco", 
   "Umm, yeah... So what's the rapture?\n\n \n \n Another flight of fancy in a world that has too much of it.", 
   {}, 
   49976, 
   null, 
   1084559520.0
  ], 
  [
   50006, 
   null, 
   "Relient Halo", 
   "Another flight of fancy in a world that has too much of it.\n\n \n ?!? Yeah, alright. With all due respect (seriously) I have to say that I would take your arguments seriously, but the way you present them is to the point of childishness. You're saying that the rapture is just a \"Christians\" way of getting out of the bad and ditching the responsibility? You need to learn a little more, and understand that whatever burned you has skewed the reality. If you publicly denounce Christianity fine, but I ask of you two simple things. One: ask yourself why your denouncment means something. If I denounce Islam or Buddhism, what leverage does that have? What is its purpose and why? Two: if you saying something is a load of ****, then please supply what you would consider a superior alternative. So you say Christianity is a load of ****, then what isn't. \n \n Now, are there a lot of bad Christians out there? Of course there are, but then again, there are a lot of good ones too. I do not judge Islam on the basis of jihadists and men who cut off the heads of the innocent while shouting \"God is great!\". Do you? I would hope not. Judge what something is by what is accurately portraying it, not by the fakers and \"Sunday mourners\" (as I call them). It is the same with all things. Are there bad cops? Yes, but there are good ones as well. It is not prudent to judge an institution (especially a religious one, whether it be Islam, Christianity, Judaism, etc) by the fallings of mortal men. How do you expect people to live to such a standard and forsake all weaknesses, when to be human is to be weak? Likewise, I do not judge all atheists through the actions of the \"God haters\" who scream that there is no God in the ears of everyone else. I respect the actual standpoint, and those that have their reasons and stick to them.", 
   {}, 
   49988, 
   null, 
   1084568400.0
  ], 
  [
   50027, 
   null, 
   "billsco", 
   "?!? Yeah, alright. With all due respect (seriously) I have to say that I would take your arguments seriously, but the way you present them is to the point of childishness.\n \n\n \n Hi Relient Halo,\n \n Please tell me why. My purpose in posting is to get stubborn, entrenched thinkers to question why they believe as they do. If I can improve my technique, please tell me how. If my message is being received as childish, then I want very much to change it so that it my intentions can be better realized.\n \n \nYou're saying that the rapture is just a \"Christians\" way of getting out of the bad and ditching the responsibility? You need to learn a little more, and understand that whatever burned you has skewed the reality. \n \n\n \n \n I was responding to your post in which you wished to \"bring on\" Armageddon and all the unspeakably vile suffering and death that attends it. That you think you'll be gleefully raptured and spared any of the pain and horror -- and call that reality-- that should be offensive to any one who has a sense of compassion, and I was attempting to remind you, with some hurried browsing through Revelations, how horrid that idea is. \n \n I have spent my entire life learning about religion. First as a born again Christian and then as an atheist. I think your statement that my reality is skewed and that I've been burned is off base and uncalled for. One of the first things I learned is that this subject matter is not about me or you, it's about ideas. \n \n \nIf you publicly denounce Christianity fine, but I ask of you two simple things. One: ask yourself why your denouncment means something. \n\n \n \n My denouncement means as much as your pronouncement means. While you pronounce, are you denying that I can denounce? I firmly believe my pronouncements have a positive outcome for people while your denouncements are doom and gloom. Of what possible value do you place in believing such a terrible outcome for humanity? Do you realize there are Texas cattlemen in Israel at this very moment trying, with cutting-edge science at their disposal, to genetically produce a red heifer, as predicted in the O.T., so that they can \"bring on\" Armageddon, because they believe as you do? That I denounce, despite you pronouncements.\n \n \nTwo: if you saying something is a load of ****, then please supply what you would consider a superior alternative. So you say Christianity is a load of ****, then what isn't.\n\n \n \n And I'm the one whose childish, right? FWIW, if I believe a set of beliefs is wrong, I feel it is my right, if not my duty, to point them out. I am under no obligation to supplant them with something else.\n \n \nIt is not prudent to judge an institution (especially a religious one, whether it be Islam, Christianity, Judaism, etc) by the fallings of mortal men. How do you expect people to live to such a standard and forsake all weaknesses, when to be human is to be weak? \n\n \n \n I judge the message, not the men. To hold a belief that this world and all its inhabitants are going to perish, in a most awful way, because they don't believe in a certain thing, is reprehensible. The message is bad, very bad, and must go. \n \n \n \nLikewise, I do not judge all atheists through the actions of the \"God haters\" who scream that there is no God in the ears of everyone else. I respect the actual standpoint, and those that have their reasons and stick to them.\n\n \n \n This I'm very happy to hear. \n \n regards", 
   {}, 
   50006, 
   null, 
   1084575000.0
  ], 
  [
   50028, 
   null, 
   "plotter", 
   "I have a problem with the antichrist, the word means opposite of christ, hence anti-christ.\n \n Now according to christian belief and the bible, christ was sent to earth by god or god disguised himself as christ (depends on which denomination you read). Either way, god was on earth one way or another. He came here to put things \"straight\" man was doing allsorts of wrong things and he came here to guide us and teach us the right way.\n \n Now the antichrist sounds like gods messenger, a bit like jesus, but the opposite. Which means god has or will send him or it. Why would god do that? He is after all the supreme being that knows everything, he controls everything, and if he loves us why should he allow or send anything that would destroy or harm us?\n \n Sounds like the devil is conspiring with god. Which begs the question, what is gods motives, what is god about?", 
   {
    "post_info": {
     "post_title": "problem"
    }
   }, 
   50027, 
   null, 
   1084575900.0
  ], 
  [
   50035, 
   null, 
   "Relient Halo", 
   "I have a problem with the antichrist, the word means opposite of christ, hence anti-christ.\n \n Now according to christian belief and the bible, christ was sent to earth by god or god disguised himself as christ (depends on which denomination you read). Either way, god was on earth one way or another. He came here to put things \"straight\" man was doing allsorts of wrong things and he came here to guide us and teach us the right way.\n \n Now the antichrist sounds like gods messenger, a bit like jesus, but the opposite. Which means god has or will send him or it. Why would god do that? He is after all the supreme being that knows everything, he controls everything, and if he loves us why should he allow or send anything that would destroy or harm us?\n \n Sounds like the devil is conspiring with god. Which begs the question, what is gods motives, what is god about?\n\n \n What...? That makes no sense. What Bible are you reading?", 
   {}, 
   50028, 
   null, 
   1084578720.0
  ], 
  [
   50045, 
   null, 
   "plotter", 
   "What...? That makes no sense. What Bible are you reading?\n\n What part makes no sense?\n \n The same bible as you i suppose. dont you agree with my post?", 
   {}, 
   50035, 
   null, 
   1084581780.0
  ], 
  [
   50077, 
   null, 
   "Darkest Shadow", 
   "Who or what do you guys think the AntiChrist is going to be?\n \n I myself believe it is gay marriage.\n\n \n \n Gay marriage? Sorry dude, but that's just stupid. The Anti-Christ is/will be a man who will set himself up as the ruler of the world, charm most of the populace, after his death/mortal wound and living he will set himself up as God, desicrate the Isreali's temple (Yet to be rebuilt) and most likely convert the world to one currency. Eventually he will make everyone take a mark, the Mark of the Beast to buy and sell, and will behead those who won't take it.\n \n \n Those are my views on what the Bible says. I think I'm pretty close.", 
   {}, 
   48529, 
   null, 
   1084589460.0
  ], 
  [
   50150, 
   null, 
   "Ghost", 
   "Gay marriage? Sorry dude, but that's just stupid.\n\n \n Agreed.\n \n \nThe Anti-Christ is/will be a man who will set himself up as the ruler of the world, charm most of the populace, after his death/mortal wound and living he will set himself up as God, desicrate the Isreali's temple (Yet to be rebuilt) and most likely convert the world to one currency. Eventually he will make everyone take a mark, the Mark of the Beast to buy and sell, and will behead those who won't take it.\n\n \n Do you guys ever worry that you might come across as ridiculous? How do you look at a child who believes that there are monsters in the closet or fairies outside their window? What you're saying sounds even more fantastical than that.\n \n This is why I look at Christianity and see it as no more valid than arcane polytheitsic religions. So Poseidon might not rule the seas and there may be no god who drags the sun into the sky with his mighty chariot every morning, but now we simply believe in a prophet (if you will) of Satan come to force everyone to take a mark and behead those who won't. We believe in angels protecting people and battling Satan's minions, but we laugh when we read Native American tales of the spirits all around them and scorn those who worship nature. It seems like Chrsitianity, and other western religions like Islam and Judaism, have created their own fantasies for the modern age.", 
   {}, 
   50077, 
   null, 
   1084659960.0
  ], 
  [
   50157, 
   null, 
   "sglaine", 
   "Agreed.\n \n \n \n Do you guys ever worry that you might come across as ridiculous? How do you look at a child who believes that there are monsters in the closet or fairies outside their window? What you're saying sounds even more fantastical than that.\n \n This is why I look at Christianity and see it as no more valid than arcane polytheitsic religions. So Poseidon might not rule the seas and there may be no god who drags the sun into the sky with his mighty chariot every morning, but now we simply believe in a prophet (if you will) of Satan come to force everyone to take a mark and behead those who won't. We believe in angels protecting people and battling Satan's minions, but we laugh when we read Native American tales of the spirits all around them and scorn those who worship nature. It seems like Chrsitianity, and other western religions like Islam and Judaism, have created their own fantasies for the modern age.\nWould you say you believe in Christ healing. Do you believe that Noah built and floated an arc with all of those animals. With out over loading the arc. I don't know but I see a lot of discrepancys in the bible. And as for Satin we don't have one Satin we have a lot of them. How ever I do believe that christ died on a cross and other things but not all of them.", 
   {}, 
   50150, 
   null, 
   1084663140.0
  ], 
  [
   50393, 
   null, 
   "Ghost", 
   "Would you say you believe in Christ healing. Do you believe that Noah built and floated an arc with all of those animals. With out over loading the arc. I don't know but I see a lot of discrepancys in the bible. And as for Satin we don't have one Satin we have a lot of them. How ever I do believe that christ died on a cross and other things but not all of them.\n\n \n No, I don't really believe in Christ healing, I believe in the psychological effect that believing he does has on people. I don't believe that there was an Ark.\n \n I believe that Christ existed. I believe he started a religious revolution, if you will. I believe he was crucified. I believe he had an enormous impact on the history of the world. I do not believe he was perfect, nor the best man in history like many people claim.", 
   {}, 
   50157, 
   null, 
   1084817760.0
  ], 
  [
   50398, 
   null, 
   "sglaine", 
   "No, I don't really believe in Christ healing, I believe in the psychological effect that believing he does has on people. I don't believe that there was an Ark.\n \n I believe that Christ existed. I believe he started a religious revolution, if you will. I believe he was crucified. I believe he had an enormous impact on the history of the world. I do not believe he was perfect, nor the best man in history like many people claim.\n\n A psychological thing sort of like the three little pigs. I agree with you sounds to me that you are thinking some what like me on this issue I also believe that Christ existed. And I also agree that he was not perfect.", 
   {}, 
   50393, 
   null, 
   1084818300.0
  ], 
  [
   51645, 
   null, 
   "Relient Halo", 
   "What part makes no sense?\n \n The same bible as you i suppose. dont you agree with my post?\n\n \n Haha... no. Unless I'm mistaken, my Bible never mentioned anything about God being in league with satan.", 
   {}, 
   50045, 
   null, 
   1085184300.0
  ], 
  [
   51664, 
   null, 
   "sglaine", 
   "I have a problem with the antichrist, the word means opposite of christ, hence anti-christ.\n \n Now according to christian belief and the bible, christ was sent to earth by god or god disguised himself as christ (depends on which denomination you read). Either way, god was on earth one way or another. He came here to put things \"straight\" man was doing allsorts of wrong things and he came here to guide us and teach us the right way.\n \n Now the antichrist sounds like gods messenger, a bit like jesus, but the opposite. Which means god has or will send him or it. Why would god do that? He is after all the supreme being that knows everything, he controls everything, and if he loves us why should he allow or send anything that would destroy or harm us?\n \n Sounds like the devil is conspiring with god. Which begs the question, what is gods motives, what is god about?\nIs that a Born again belief or what because I don't think you have a clue.", 
   {}, 
   50028, 
   null, 
   1085188620.0
  ], 
  [
   51704, 
   null, 
   "billsco", 
   "Haha... no. Unless I'm mistaken, my Bible never mentioned anything about God being in league with satan.\n\n \n The first two chapters of Job will serve the purpose. If you don't care to read them, I'll provide a synopsis.\n \n God: Satan, where ya been?\n \n Lucifer: Out and about. What's up?\n \n God: Job. Good and faithful servant.\n \n Lucifer: I can break him.\n \n God: Bet not.\n \n Lucifer: Bet I can.\n \n God: You're on. Here, I'll kill his wife and 10 kids, along with his livestock. Then I'll give him boils all over his body. Bet he don't crack.\n \n Lucifer: You're on.\n \n That sounds like God being in league with the devil to me, don't you think?", 
   {}, 
   51645, 
   null, 
   1085198340.0
  ], 
  [
   51719, 
   null, 
   "Relient Halo", 
   "The first two chapters of Job will serve the purpose. If you don't care to read them, I'll provide a synopsis.\n \n God: Satan, where ya been?\n \n Lucifer: Out and about. What's up?\n \n God: Job. Good and faithful servant.\n \n Lucifer: I can break him.\n \n God: Bet not.\n \n Lucifer: Bet I can.\n \n God: You're on. Here, I'll kill his wife and 10 kids, along with his livestock. Then I'll give him boils all over his body. Bet he don't crack.\n \n Lucifer: You're on.\n \n That sounds like God being in league with the devil to me, don't you think?\n\n \n Hahaha! My first request is that you fully understand what being in league actually means, because I'm not so sure you do. Take the time to study up on that. And please, PLEASE understand the story you're paraphrasing. That would help a great deal.\n \n Actual text from the Book of Job (NIV)\n \"One day the angels came to present themselves before the Lord, and Satan also came with them. The Lord said to Satan, 'Where have you come from?' Satan answered the Lord, 'From roaming through the earth and going back and forth in it.'\n Then the Lord said to Satan, 'Have you considered my servant Job? There is no one on earth like him; he is blameless and upright, a man who fears God and shuns evil.'\n 'Does Job fear God for nothing?' Satan replied. 'Have you not put a hedge around him and his household and everything he has? You have blessed the work of his hands, so that his flicks and herds are spread throughout the land. But stretch out your hand and strike everything he has, and he will surely curse you to your face.'\n The Lord said to Stan, 'Very well, then, everything he has is in your hands, but on the man himself do not lay a finger.'\"\n \n Long story short folks, God allows Satan to test Job to the brink in which he will turn away from God. Notice how God himself did nothing, but allowed the test to go on. Are the servants of God to go untested, to be impervious to the strains and troubles of mortal life? \n \n In all courtesy, don't go this route; you won't have a chance. If you have another way to go about it, then by all means, choose that, because trying to use the actual Bible as a source and then misquoting and misinterpreting isn't the way to go.", 
   {}, 
   51704, 
   null, 
   1085207520.0
  ], 
  [
   51724, 
   null, 
   "Relient Halo", 
   "Sorry that it's taken me so long to reply to this. Had trouble finding it after my little 4forums hiatus.\n \n \n \nHi Relient Halo,\n \n Please tell me why. My purpose in posting is to get stubborn, entrenched thinkers to question why they believe as they do. If I can improve my technique, please tell me how. If my message is being received as childish, then I want very much to change it so that it my intentions can be better realized.\n\n \n It's not so much that you have a bad style, but that the style is tainted. I have this feeling that somewhere along the line you were burned by Christianity or an off-the-mark representation. For that I am sorry (if it holds truth). But I have noticed that your style, effective as it may be, is slightly corrupted by this scar. I recognize this in your writings about Christianity and can honestly say that I have felt the same way at one point.\n \n \n \nI was responding to your post in which you wished to \"bring on\" Armageddon and all the unspeakably vile suffering and death that attends it. That you think you'll be gleefully raptured and spared any of the pain and horror -- and call that reality-- that should be offensive to any one who has a sense of compassion, and I was attempting to remind you, with some hurried browsing through Revelations, how horrid that idea is. \n\n \n Horrid? Why of course it is. I look at it this way though, I'm tired of waiting for a moment I am unsure of. Does that make sense? I hope so. Let me put it another way; if it's going to happen, then why not here and now? Why do we insist on putting off the inevitable, only to run and turn to find it still staring us in the face? I do not look forward to the tribulation for the gore and suffering, do not look at it that way.\n \n \nI have spent my entire life learning about religion. First as a born again Christian and then as an atheist. I think your statement that my reality is skewed and that I've been burned is off base and uncalled for. One of the first things I learned is that this subject matter is not about me or you, it's about ideas. \n\n \n Ah yes, but then again, it's you and me who put across the idea, and when something such as our point of view is tainted, then what? Is it not you and I who convey the ideas, making it about us and who we are in the end?\n \n \nMy denouncement means as much as your pronouncement means. While you pronounce, are you denying that I can denounce? I firmly believe my pronouncements have a positive outcome for people while your denouncements are doom and gloom. Of what possible value do you place in believing such a terrible outcome for humanity? Do you realize there are Texas cattlemen in Israel at this very moment trying, with cutting-edge science at their disposal, to genetically produce a red heifer, as predicted in the O.T., so that they can \"bring on\" Armageddon, because they believe as you do? That I denounce, despite you pronouncements.\n\n \n First of all, I'd love to read that article about the cattlemen. If you have it, please send it, I'm in need of a chuckle. Once again, you've misunderstood what I've been saying, which in hindsight, I can understand. But with that hopefully rectified, where do we go from here? My pronouncement? What pronouncement? I do not go around saying \"And people wonder why I pronounce Christianity\". I am an advocate, that is true, but to pronounce is to be give a statement, when I just leave my thoughts and ideas. There is a difference. BUT, I do not have any weight in my statements except for what the audience gives me. It is through that which we are credible.\n \n \n \nAnd I'm the one whose childish, right? FWIW, if I believe a set of beliefs is wrong, I feel it is my right, if not my duty, to point them out. I am under no obligation to supplant them with something else. \n\n \n Your method? Yes, it is in my opinion. You seem to wear this topic on your sleeve, which I would not consider to be the wisest option. So what beliefs in Christianity are wrong. I know, I know, I hate \"love one another\" and \"turn the other cheek\" as much as the next man but can I have some more examples? And please, don't point out mans faults, which are not in the Bible, specifically the N.T. Let's go by what Jesus said shall we, not some self-righteous fool who thought he was above the rest.\n \n \n \n \n \nI judge the message, not the men. To hold a belief that this world and all its inhabitants are going to perish, in a most awful way, because they don't believe in a certain thing, is reprehensible. The message is bad, very bad, and must go. \n\n \n When a teacher asks you a question on a test and you give the wrong answer, what happens? You are punished, that is the nature of things. God gives us the choice, but with the choice we know the consequences, so why are we mad for receiving what we chose? Does that make sense? Should men, of mortal blood do such a thing? No, THAT is reprehinsible my friend. But I think God has more right than man in many aspects of existence and rights. So if you think that it's a bad message, then why not denounce Judaism, Islam and all the other religions who teach that they are the right way? Because I think that's the same thing. But then again, it might just be the animosity talking.", 
   {}, 
   50027, 
   null, 
   1085209680.0
  ], 
  [
   51791, 
   null, 
   "billsco", 
   " Hahaha! My first request is that you fully understand what being in league actually means, because I'm not so sure you do. Take the time to study up on that. \n\n \n My understanding of \"being in league with\" means to conspire with, to be in cahoots with, usually with bad connotations attached. I believe the two, God and Satan, as recorded in the book of Job, are fitting of the description. Job certainly would agree had he known what we are privy to in the prologue, seeing it was his wife and kids whom they conspired together to kill for no other reason than to settle a little wager about his faith. \n \n \nAnd please, PLEASE understand the story you're paraphrasing. That would help a great deal. \n\n \n This is an ancient Mesopotamian story in all probabilities, which has suffered numerous interpolations and editing throughout its oral and written history. It is unlikely of Jewish origin, mainly because the Jews had no previous didactic literature. Its style is similar to other Mesopotamian or Egyptian works, hence the belief by many scholars as to its origins. It should relieve people to know what is recorded in the pages probably did not occur; the entire book is a work of fiction, pedagogic rather than historical.\n \n It philosophically discusses why God allows suffering in this world, with the use of friends who question Job, who throughout maintains his innocence, and culminates in God himself weighing in on the subject. God's response, to paraphrase once again is, \"Shut up you worthless worm, who are you to question me?\". It is an unsatisfactory answer to some readers, others not. I'm not sure how you infer that I don't understand the story. I don't understand it as you understand it, that much is sure.\n \n \n\n Actual text from the Book of Job (NIV)\n \"One day the angels came to present themselves before the Lord, and Satan also came with them. The Lord said to Satan, 'Where have you come from?' Satan answered the Lord, 'From roaming through the earth and going back and forth in it.'\n Then the Lord said to Satan, 'Have you considered my servant Job? There is no one on earth like him; he is blameless and upright, a man who fears God and shuns evil.'\n 'Does Job fear God for nothing?' Satan replied. 'Have you not put a hedge around him and his household and everything he has? You have blessed the work of his hands, so that his flicks and herds are spread throughout the land. But stretch out your hand and strike everything he has, and he will surely curse you to your face.'\n The Lord said to Stan, 'Very well, then, everything he has is in your hands, but on the man himself do not lay a finger.'\" \n\n \n My initial interpretation, my synopsis appears dead on. We'll argue about who actually put the hand of death on Job's wife and family. It appears from the scripture that Lucifer himself did, but ultimate responsibility points in one direction only. \n \n BTW, I thought there were no perfect humans, blameless and upright, in your Christian beliefs. We are all hideous, undeserving ingrates according to your dogma.\n \n \n \n\n Long story short folks, God allows Satan to test Job to the brink in which he will turn away from God. Notice how God himself did nothing, but allowed the test to go on. \n\n \n Your honor, I rest my case. God is guilty of conspiring and plotting the murder of eleven innocent victims, and of torturing and abusing Job, not to mention browbeating him into cowering submission, along with the destruction of private property. \n \n God didn't know the outcome? He didn't have the grace or courtesy to tell us blind, groping humans the reason for his allowing so much suffering? \n \n \n\n \n Are the servants of God to go untested, to be impervious to the strains and troubles of mortal life? \n\n \n You're beginning to sound like Job's friend Zophor, who cooly insisted Job deserved everything that happened because he was nothing but wicked trash, so undeserving, and blasphemous to boot. But hey, what are friends for.\n \n Of course, in the epilogue God makes it all better. He gives Job a new wifey. Some more crumbcrunchers too to replace the old ones, along with numerous cattle and sheep. All I can say, and I say it as loudly and firmly as I possibly can, is keep this God away from my wife and family and me. \n \n \n \n\n In all courtesy, don't go this route; you won't have a chance. If you have another way to go about it, then by all means, choose that, because trying to use the actual Bible as a source and then misquoting and misinterpreting isn't the way to go. \n\n \n Thank you for the courtesy shown. I think it rather unsettles you that I have the temerity to quote scripture in making my case. It may be because that's all any of us have when discussing these weighty issues. I think you are mistaken in how I interpret and quote it, and I hope you are not inferring that you alone are capable of the job. I'll continue to do so when necessary, thank you.", 
   {}, 
   51719, 
   null, 
   1085250660.0
  ], 
  [
   51794, 
   null, 
   "CCR1994", 
   "I don't suppose it would be of any value to suggest that this conversation never actually took place. There may be a lesson in it although it would be difficult to say what it is other than human beings are free to follow a chosen path and if the path they choose has negative consequences which were known ahead of time than the real responsibility belongs with the human being in question, not God or the Devil.", 
   {}, 
   51791, 
   null, 
   1085251920.0
  ], 
  [
   51799, 
   null, 
   "sglaine", 
   "I don't suppose it would be of any value to suggest that this conversation never actually took place. There may be a lesson in it although it would be difficult to say what it is other than human beings are free to follow a chosen path and if the path they choose has negative consequences which were known ahead of time than the real responsibility belongs with the human being in question, not God or the Devil.\n\n I like that answer!!!!!!!!!", 
   {}, 
   51794, 
   null, 
   1085254200.0
  ], 
  [
   51803, 
   null, 
   "billsco", 
   "\n \n \n It's not so much that you have a bad style, but that the style is tainted. I have this feeling that somewhere along the line you were burned by Christianity or an off-the-mark representation. For that I am sorry (if it holds truth). But I have noticed that your style, effective as it may be, is slightly corrupted by this scar. I recognize this in your writings about Christianity and can honestly say that I have felt the same way at one point.\n\n \n Tainted, as in colored? And you don't care for the color? What may I ask in all seriousness is your writing? Pure and untainted? \n \n I don't understand the purpose of this obsession with my style, other than it may be hitting a little close to home. \n \n \n \n\n \n \n Horrid? Why of course it is. I look at it this way though, I'm tired of waiting for a moment I am unsure of. Does that make sense? I hope so. Let me put it another way; if it's going to happen, then why not here and now? Why do we insist on putting off the inevitable, only to run and turn to find it still staring us in the face? I do not look forward to the tribulation for the gore and suffering, do not look at it that way.\n\n \n \n Of course you don't. That was and is my entire point in responding. And by your comments above, my point has eluded you. You simply want to float away and blissfully look down at all the death and destruction below. Bring it on, you say. \n \n This is not inevitable. It is not true. Quit wishing for one of the worst dreams a madman has ever had to come true. Get back to work. Worry about the real things in life, with both your feet on the ground.\n \n I was listening to a Christian radio program the other day that had a biblical expert on answering call-in questions from young people. One young lady called and said she was considering quitting college because, \"you know, the end times are upon us\". The self-professed expert responded with, \"Well, I think you need to really discuss this with the Lord, and let him guide you\". That was the death knell to her career. Another talent is lost. And you, \"tired of waiting for a moment I am unsure of\", you'll be a tired old man before you know it. \n \n \n \n\n \n Ah yes, but then again, it's you and me who put across the idea, and when something such as our point of view is tainted, then what? Is it not you and I who convey the ideas, making it about us and who we are in the end?\n\n \n No, this is not about you and me. We can make it so, but we'll discover no one is reading.\n \n \n\n \n \n \n First of all, I'd love to read that article about the cattlemen. If you have it, please send it, I'm in need of a chuckle.\n\n \n http://www.nationalreview.com/dreher/dreher041102.asp\n \n Believe me, it isn't funny. It scares me to no end.\n \n \n \n\n \n \n Your method? Yes, it is in my opinion. You seem to wear this topic on your sleeve, which I would not consider to be the wisest option. \n\n \n What does that phrase mean? Christianity is a passion of mine. \n \n \n\n \n So what beliefs in Christianity are wrong. I know, I know, I hate \"love one another\" and \"turn the other cheek\" as much as the next man but can I have some more examples? And please, don't point out mans faults, which are not in the Bible, specifically the N.T. Let's go by what Jesus said shall we, not some self-righteous fool who thought he was above the rest.\n\n \n \n \n Turn the other cheek is bad advice IMO. No one I know of has ever taught it to their children, let alone used it themselves, becauses it's unworkable. Self-defense is universally accepted in every society. Jesus said to let evil be, don't resist it. I say stop it where you find it, use force if necessary. He said if a man leaves his wife and family and follows him, he'll give the man a big reward. I say he's not getting in between my family, and he can keep his reward. Just a couple things I can think of right now.", 
   {}, 
   51724, 
   null, 
   1085260440.0
  ], 
  [
   51963, 
   null, 
   "emoreno2292", 
   "This is not inevitable. It is not true. Quit wishing for one of the worst dreams a madman has ever had to come true. Get back to work. Worry about the real things in life, with both your feet on the ground. \n Three cheers for Billsco!!! emoticon_xhoho \n \n \nI was listening to a Christian radio program the other day that had a biblical expert on answering call-in questions from young people. One young lady called and said she was considering quitting college because, \"you know, the end times are upon us\". The self-professed expert responded with, \"Well, I think you need to really discuss this with the Lord, and let him guide you\". That was the death knell to her career. Another talent is lost. And you, \"tired of waiting for a moment I am unsure of\", you'll be a tired old man before you know it. \n I totally agree with you. \n \n \n \nTurn the other cheek is bad advice IMO. No one I know of has ever taught it to their children, let alone used it themselves, becauses it's unworkable. Self-defense is universally accepted in every society. Jesus said to let evil be, don't resist it. I say stop it where you find it, use force if necessary. He said if a man leaves his wife and family and follows him, he'll give the man a big reward. I say he's not getting in between my family, and he can keep his reward. Just a couple things I can think of right now.\n\n Whew!! I feel like I need a smoke! emoticon_xgood", 
   {}, 
   51803, 
   null, 
   1085371380.0
  ], 
  [
   53420, 
   null, 
   "plotter", 
   "Is that a Born again belief or what because I don't think you have a clue.\n\n No i dont have a clue, and i dont think you or anybody else has either. The reason why nobody knows is because its all mumbo jumbo believed by people that have probably been brainwashed.\n \n The problem i have is that, if theres a supreme being, god, why should there be a devil or antichrist, the supreme being controls everything, right. If theres a devil, then the supreme being is not in control and not so supreme. Which means theres no supreme being, because if there was a supreme being there wouldnt be any antichrist, you see the contradiction????", 
   {}, 
   51664, 
   null, 
   1086827100.0
  ], 
  [
   54021, 
   null, 
   "terral03", 
   "Greetings to Bush and All:\n \n Bush writes << Who or what do you guys think the Anti-Christ is going to be? I myself believe it is gay marriage.\n \n Terral's reply << While Gay marriage is an abomination to God (Rom. 1:20-32), it has little to do with the antichrist. \n \n The antichrist is the second person of the unholy trinity of Satan, the beast (antichrist) and the false prophet. Note that each of these end up in the lake of fire. Rev. 19:20, 20:10. This triune relationship of 'darkness' (Gen. 1:2, Eph. 6:12) is the negative counterpart to the Father, Son and Holy Spirit (Matt. 28:19). While God is assembling the members of the body of Christ (Rom. 12:4+5, 1Cor. 12:12-14, 27, Eph. 5:30, etc.) through obedience to the gospel (1Cor. 15:1-5), Satan is busy joining together the members of the antichrist through every form of false gospel. There is a mystery of Christ described in the New Testament (Rom. 16:25, Eph. 3:4, 5:32, Col. 2:2, 4:3) and also a 'mystery of lawlessness.' Paul writes, \n \n \"For the mystery of lawlessness is already at work; only he who now restrains {will do so} until he is taken out of the way. Then that lawless one will be revealed whom the Lord will slay with the breath of His mouth and bring to an end by the appearance of His coming; {that is,} the one whose coming is in accord with the activity of Satan [building of his unholy body of members], with all power and signs and false wonders, and with all the deception of wickedness for those who perish, because they did not receive the love of the truth so as to be saved. FOR THIS REASON God sends upon them a deluding influence [Satan] so that they will believe what is false, in order that they all may be judged who did not believe the truth, but took pleasure in wickedness.\" 2Thes. 2:7-12.\n \n Remember that the road to destruction is wide, while the path to life is narrow. Matt. 7:13+14. While the faithful believers in the gospel are being fashioned together as a 'building' (1Cor. 3:9) to God, those who disbelieve are being added to the building of the antichrist. These are two directly opposing spiritual bodies that coexist in the world today. Do you ever wonder why there are over 2000 denominations of 'professing' Christians in the world? Most have defiled the simplicity of the cross with works/rituals and have believed a distorted version of our gospel. They are members of the ever growing body of the antichrist right now, and only believe themselves to be bound for the heavenly realm. Instead, they have been baptized into the mystery of lawlessness (iniquity), and bear the mark of the beast upon their foreheads. \n \n The lawless one (antichrist/beast) will be revealed as a human being at the end of the coming Kingdom Dispensation (about 1000 years from now). He will come in the likeness of Jesus Christ some 2000 years ago, except Israel will accept him as King. In the end, however, he will go into the lake of fire along with all those who bear his name. \n \n Our good news for today is that Jesus Christ (the Son of God) came to earth as a human being. He was crucified, buried in a tomb and God raised Him from the dead, and seated Him in the heavenly. See 1Cor. 15:1-5. We are saved by God's grace through faith apart from works. See Rom. 4:5, Eph. 2:8+9. When we hear (Rom. 10:17) and believe the message of truth, then we are \"sealed in Him with the Holy Spirit of promise, who is given as a pledge of our inheritance, with a view to the redemption of {God's own} possession, to the praise of His glory.\" Eph. 1:13+14. \n \n At that instant we are baptized into Christ's body (Gal. 3:27) on the cross at Calvary almost 2000 years ago. We become an active participant in His death, burial and resurrection (Rom. 6:3+4, Eph. 2:4-7 (6)). Since we are now found 'in' Christ, when God looks at us He sees His Only Begotten Son. Those who believe the truth of the gospel are members of His body even now (Rom. 12:4+5, 1Cor. 12:27, Eph. 5:30), so long as they don't try to add works to Christ's finished work on the cross.\n \n God bless,\n \n Terral", 
   {
    "post_info": {
     "post_title": "The Unholy Trinity"
    }, 
    "unicode_changes_made": true
   }, 
   48529, 
   null, 
   1087327260.0
  ], 
  [
   54025, 
   null, 
   "Waxy", 
   "Greetings to Bush and All:\n \n Bush writes << Who or what do you guys think the Anti-Christ is going to be? I myself believe it is gay marriage.\n \n Terral's reply << While Gay marriage is an abomination to God (Rom. 1:20-32), it has little to do with the antichrist. \n \n The antichrist is the second person of the unholy trinity of Satan, the beast (antichrist) and the false prophet. Note that each of these end up in the lake of fire. Rev. 19:20, 20:10. This triune relationship of 'darkness' (Gen. 1:2, Eph. 6:12) is the negative counterpart to the Father, Son and Holy Spirit (Matt. 28:19). While God is assembling the members of the body of Christ (Rom. 12:4+5, 1Cor. 12:12-14, 27, Eph. 5:30, etc.) through obedience to the gospel (1Cor. 15:1-5), Satan is busy joining together the members of the antichrist through every form of false gospel. There is a mystery of Christ described in the New Testament (Rom. 16:25, Eph. 3:4, 5:32, Col. 2:2, 4:3) and also a 'mystery of lawlessness.' Paul writes, \n \n \"For the mystery of lawlessness is already at work; only he who now restrains {will do so} until he is taken out of the way. Then that lawless one will be revealed whom the Lord will slay with the breath of His mouth and bring to an end by the appearance of His coming; {that is,} the one whose coming is in accord with the activity of Satan [building of his unholy body of members], with all power and signs and false wonders, and with all the deception of wickedness for those who perish, because they did not receive the love of the truth so as to be saved. FOR THIS REASON God sends upon them a deluding influence [Satan] so that they will believe what is false, in order that they all may be judged who did not believe the truth, but took pleasure in wickedness.\" 2Thes. 2:7-12.\n \n Remember that the road to destruction is wide, while the path to life is narrow. Matt. 7:13+14. While the faithful believers in the gospel are being fashioned together as a 'building' (1Cor. 3:9) to God, those who disbelieve are being added to the building of the antichrist. These are two directly opposing spiritual bodies that coexist in the world today. Do you ever wonder why there are over 2000 denominations of 'professing' Christians in the world? Most have defiled the simplicity of the cross with works/rituals and have believed a distorted version of our gospel. They are members of the ever growing body of the antichrist right now, and only believe themselves to be bound for the heavenly realm. Instead, they have been baptized into the mystery of lawlessness (iniquity), and bear the mark of the beast upon their foreheads. \n \n The lawless one (antichrist/beast) will be revealed as a human being at the end of the coming Kingdom Dispensation (about 1000 years from now). He will come in the likeness of Jesus Christ some 2000 years ago, except Israel will accept him as King. In the end, however, he will go into the lake of fire along with all those who bear his name. \n \n Our good news for today is that Jesus Christ (the Son of God) came to earth as a human being. He was crucified, buried in a tomb and God raised Him from the dead, and seated Him in the heavenly. See 1Cor. 15:1-5. We are saved by God's grace through faith apart from works. See Rom. 4:5, Eph. 2:8+9. When we hear (Rom. 10:17) and believe the message of truth, then we are \"sealed in Him with the Holy Spirit of promise, who is given as a pledge of our inheritance, with a view to the redemption of {God's own} possession, to the praise of His glory.\" Eph. 1:13+14. \n \n At that instant we are baptized into Christ's body (Gal. 3:27) on the cross at Calvary almost 2000 years ago. We become an active participant in His death, burial and resurrection (Rom. 6:3+4, Eph. 2:4-7 (6)). Since we are now found 'in' Christ, when God looks at us He sees His Only Begotten Son. Those who believe the truth of the gospel are members of His body even now (Rom. 12:4+5, 1Cor. 12:27, Eph. 5:30), so long as they don't try to add works to Christ's finished work on the cross.\n \n God bless,\n \n Terral\n\n \n \n This reads like a cheesy Hollywood horror movie.\n \n Just insert Vin Diesel or The Rock as some sort of \"holy man\" coming to rescue the world from the \"devil\". I like John Malkovich for the anti-christ role.\n \n Waxy", 
   {
    "unicode_changes_made": true
   }, 
   54021, 
   null, 
   1087328580.0
  ], 
  [
   54039, 
   null, 
   "Anastasia", 
   "This reads like a cheesy Hollywood horror movie.\n \n Just insert Vin Diesel or The Rock as some sort of \"holy man\" coming to rescue the world from the \"devil\". I like John Malkovich for the anti-christ role.\n \n Waxy\n\n But Vin Diesel is gay\n emoticon_xdonno", 
   {}, 
   54025, 
   null, 
   1087332480.0
  ], 
  [
   54728, 
   null, 
   "uri", 
   "2 Corinthians 11:13-15 For such men are false apostles, deceitful workmen, masquerading as apostles of Christ...for Satan himself masquerades as an angel of light. It is not surprising, then, if his servants masquerade as servants of righteousness. Their end will be what their actions deserve.\n \n whomever the \"antichrist\" will be, he will come as an \"angel of light\", someone who will come on the name of peace, who will solve many wordly problems...he will be a great liar, and will deceive most of mankind into following him. He will come in the name of \"peace\", and will probably ease many conflicts i.e. the middle east problem. But in the end, he will decieve the nations, and lead mankind into the brink of perpetual war, probably in the name of \"God\" or \"to rid the world of evil\", but in turn be against those who oppose his authority. He will be one who thinks of himself as \"Godly\" or, \"doing gods work\". Overall, i don't think anyone truly knows where, when or who the anti christ will be, or will come from...assuming it will be some kind of \"homosexual\" movement is ridiculous.", 
   {
    "post_info": {
     "post_title": "who to trust?"
    }
   }, 
   48529, 
   null, 
   1087770840.0
  ], 
  [
   54729, 
   null, 
   "uri", 
   "No i dont have a clue, and i dont think you or anybody else has either. The reason why nobody knows is because its all mumbo jumbo believed by people that have probably been brainwashed.\n \n The problem i have is that, if theres a supreme being, god, why should there be a devil or antichrist, the supreme being controls everything, right. If theres a devil, then the supreme being is not in control and not so supreme. Which means theres no supreme being, because if there was a supreme being there wouldnt be any antichrist, you see the contradiction????\n\n \n Yes, i agree, the bible DOES have many contradictions...kinda makes you think, because if you consider metaphysics, EVERYTHING is contradictory...most of everything is subjective. As for if there is a God, why would he create evil, think of it this way...\"evil\" is what MAN creates, not God...God gave man CHOICE to do, either good or evil. It's part of being human, making CHOICE, and has nothing to do with God. If there were no man, there would be no \"evil\" ;)", 
   {}, 
   53420, 
   null, 
   1087771260.0
  ], 
  [
   54730, 
   null, 
   "uri", 
   "The first two chapters of Job will serve the purpose. If you don't care to read them, I'll provide a synopsis.\n \n God: Satan, where ya been?\n \n Lucifer: Out and about. What's up?\n \n God: Job. Good and faithful servant.\n \n Lucifer: I can break him.\n \n God: Bet not.\n \n Lucifer: Bet I can.\n \n God: You're on. Here, I'll kill his wife and 10 kids, along with his livestock. Then I'll give him boils all over his body. Bet he don't crack.\n \n Lucifer: You're on.\n \n That sounds like God being in league with the devil to me, don't you think?\n\n \n HAHahhaah...i love when people take the bibles stories so serious...the story of job is nothing more then a parable, and is not to be taken literal. It's meaning could be taken as \"why do bad things always happen to good people?\".....by they way, i am NOT christain, and don't attribute myself to any religious belief", 
   {}, 
   51704, 
   null, 
   1087771560.0
  ], 
  [
   54731, 
   null, 
   "uri", 
   "Agreed.\n \n \n \n Do you guys ever worry that you might come across as ridiculous? How do you look at a child who believes that there are monsters in the closet or fairies outside their window? What you're saying sounds even more fantastical than that.\n \n This is why I look at Christianity and see it as no more valid than arcane polytheitsic religions. So Poseidon might not rule the seas and there may be no god who drags the sun into the sky with his mighty chariot every morning, but now we simply believe in a prophet (if you will) of Satan come to force everyone to take a mark and behead those who won't. We believe in angels protecting people and battling Satan's minions, but we laugh when we read Native American tales of the spirits all around them and scorn those who worship nature. It seems like Chrsitianity, and other western religions like Islam and Judaism, have created their own fantasies for the modern age.\n\n \n I totally agree, but to a certain extent...i have done my own research and reading, and have discovered that many stories in the bible, everything from the miracles jesus performed, to the rapture, are actually paganistic and have been indoctrined by corrupt religious leaders throughout the centuries, to appeal to both the pagans and christains alike. Nonetheless, i think the bible does send a good message, it teachs us about tolerence, love, and acceptence...people tend to take it the wrong way, or use it for political gain, which is truly sad", 
   {}, 
   50150, 
   null, 
   1087772220.0
  ], 
  [
   54785, 
   null, 
   "terral03", 
   "Greetings to Uri, Plotter and All:\n \n Uri wrote << Yes, i agree, the bible DOES have many contradictions...kinda makes you think, because if you consider metaphysics, EVERYTHING is contradictory...most of everything is subjective . . .\n \n Terral's reply << You guys happen to be discussing a new forum on this network. Please bring all of your 'seeming' Biblical Contradictions here and start some new threads:\n \n http://4forums.com/political/forumdisplay.php?f=38\n \n God bless,\n \n Terral", 
   {
    "post_info": {
     "post_title": "New Biblical Contradictions Forum"
    }
   }, 
   54729, 
   null, 
   1087833840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Coming of the Anti-Christ", 
  "url": "http://www.4forums.com/political/religion-debates/2363-coming-anti-christ.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 2363, 
  "discussion_files": [
   [
    "955.html", 
    "http://www.4forums.com/political/religion-debates/2363-coming-anti-christ-print.html"
   ], 
   [
    "956.html", 
    "http://www.4forums.com/political/religion-debates/2363-coming-anti-christ-5-print.html"
   ], 
   [
    "957.html", 
    "http://www.4forums.com/political/religion-debates/2363-coming-anti-christ-4-print.html"
   ], 
   [
    "958.html", 
    "http://www.4forums.com/political/religion-debates/2363-coming-anti-christ-3-print.html"
   ], 
   [
    "959.html", 
    "http://www.4forums.com/political/religion-debates/2363-coming-anti-christ-2-print.html"
   ]
  ], 
  "identifier": 2363
 }
]