[
 [
  [
   49182, 
   null, 
   "galton", 
   "I have noticed that even educated people are poorly informed about the role genes play in human behavior. In my view, most character traits you can think of (e.g., shyness, aggressiveness, homosexuality, leadership, industriousness, intelligence, altruism, criminality) have a substantial genetic component. I have also noticed that the people most skeptical about this are on opposite ends of the political spectrum: liberals and religious conservatives. In fact, hardly anyone likes this idea, but the evidence backs it up. Anyone disagree and why?", 
   {
    "post_info": {
     "post_title": "Genes influence most behavior?"
    }
   }, 
   null, 
   null, 
   1084320360.0
  ], 
  [
   49185, 
   null, 
   "AMD4EVER", 
   "I have noticed that even educated people are poorly informed about the role genes play in human behavior. In my view, most character traits you can think of (e.g., shyness, aggressiveness, homosexuality, leadership, industriousness, intelligence, altruism, criminality) have a substantial genetic component. I have also noticed that the people most skeptical about this are on opposite ends of the political spectrum: liberals and religious conservatives. In fact, hardly anyone likes this idea, but the evidence backs it up. Anyone disagree and why?\n\n \n While it is true that all these traits will have to have genetic links, they also have substancial environmental links and almost all of them can be modified chemically.\n \n So what exactly are you trying to debate here? Is it that you believe only genetics determine all these things or is it that you believe that genetics determines most of these things? Either way the environmental debate will be made in that if we are born to a society where it is impossible to get away with being a criminal then you will substancially reduce the amount of criminals. Also, if you are put in a situation where everyone looks up to you then that increases the odds of you acting like a leader. If you are in that sort of situation all the time then it will increase the likelihood of you being a leader hence the reason you have greater odds of becoming a leader if you are a first born.", 
   {}, 
   49182, 
   null, 
   1084320780.0
  ], 
  [
   49197, 
   null, 
   "galton", 
   "While it is true that all these traits will have to have genetic links, they also have substancial environmental links and almost all of them can be modified chemically.\n \n So what exactly are you trying to debate here? Is it that you believe only genetics determine all these things or is it that you believe that genetics determines most of these things? Either way the environmental debate will be made in that if we are born to a society where it is impossible to get away with being a criminal then you will substancially reduce the amount of criminals. Also, if you are put in a situation where everyone looks up to you then that increases the odds of you acting like a leader. If you are in that sort of situation all the time then it will increase the likelihood of you being a leader hence the reason you have greater odds of becoming a leader if you are a first born.\n\n I am not arguing here that the environment, or even free will, play no role. No sociobiologist in the world thinks that the environment is not important. Most social scientists (well at least sociologists) and many lay people think that genes play little or no role in almost all behavior. I consider these people to be extreme environmental determinists, and it is those people I want to debate.", 
   {}, 
   49185, 
   null, 
   1084322580.0
  ], 
  [
   49208, 
   null, 
   "sglaine", 
   "I have noticed that even educated people are poorly informed about the role genes play in human behavior. In my view, most character traits you can think of (e.g., shyness, aggressiveness, homosexuality, leadership, industriousness, intelligence, altruism, criminality) have a substantial genetic component. I have also noticed that the people most skeptical about this are on opposite ends of the political spectrum: liberals and religious conservatives. In fact, hardly anyone likes this idea, but the evidence backs it up. Anyone disagree and why?\n\n I'm no scientist but I can possably se a conection here. Very interesting point though can not wait and see how this one plays out.", 
   {}, 
   49182, 
   null, 
   1084324620.0
  ], 
  [
   49257, 
   null, 
   "AMD4EVER", 
   "I am not arguing here that the environment, or even free will, play no role. No sociobiologist in the world thinks that the environment is not important. Most social scientists (well at least sociologists) and many lay people think that genes play little or no role in almost all behavior. I consider these people to be extreme environmental determinists, and it is those people I want to debate.\n\n \n So you are waiting to debate with someone who believes that genes have no role in affecting who we are? If this is the case then I don't think you will find one here. Most people who are on this debate forum are here because they are knowledgable and are willing to learn. It would take quite an uninformed person to believe that genes don't in any way determine who we are.", 
   {}, 
   49197, 
   null, 
   1084333140.0
  ], 
  [
   49271, 
   null, 
   "galton", 
   "So you are waiting to debate with someone who believes that genes have no role in affecting who we are? If this is the case then I don't think you will find one here. Most people who are on this debate forum are here because they are knowledgable and are willing to learn. It would take quite an uninformed person to believe that genes don't in any way determine who we are.\n\n I hope you are right, and I applaud you for being well-informed. I'm sure most people think genes have a role in things like eye color or height or other benign characteristics, but I'll be very surprised if everyone on this forum agrees that intelligence or industriousness for example are to a significant degree due to genes.", 
   {}, 
   49257, 
   null, 
   1084335960.0
  ], 
  [
   49331, 
   null, 
   "Eddie", 
   "Ok, I`ll bite ;)\n \n Well, not really. I`m convinced that genes can play an important role in many aspects of our personal characteristics. But, I also believe that enviroment can play an important role in many aspect of our personal characteristics. As for those particular characteristics you mentioned I think that genes may or may not play an important role, depending how you define the words.\n \n Intelligence. The word intelligence is a common word, and is often used in very different circumstances and with very different meaning. Intelligence as cognitive ability is one thing. Intelligence as logic is another. I`m sure that depending on how you use the word inteligence, genes play everything from a very important role, to a not-really-important role at all.\n \n industriousness: With industriousness I`m assuming that you mean \"hard working\". To be honest, I doubt this is a genetical trait. I think hard work is a matter of preferences. If you value the fruits of hard work higher than others, you will be more industrious than others. If you value free time more than others and/or dislike the physical or mental strain of hard work more than others, you will be less industrious than others. And unless these preferences are caused by genes (which I doubt), industriousnes ìtself isn`t caused by genes either.\n \n Edit: I did a search on the subject sociobiology and it appears like they argue that preferences are highly caused by natural selection (examplified with sugar and how it once served an important purpose to enjoy the taste of sugar). And while I think that it seems like a plausible theory, I don`t really know how much explanatory power it has for measuring differences between individuals. Its one thing that natural selection has weeded out certain basic preferences and promoted others. Its another that it actually explains the difference between individuals.", 
   {}, 
   49271, 
   null, 
   1084360620.0
  ], 
  [
   49398, 
   null, 
   "Waxy", 
   "I'm no sociobiologist or psychologist (whewwww), but IMHO, everything we are/will become has a genetic base.\n \n IMHO, environment will serve to reinforce or adjust that base, but it will not/ can not, change it entirely.\n \n Even rather subjective traits like aggressiveness, determination, industriousness, etc... seem to me anyway, to have strong genetic components. I base this opinion solely on my experience of watching family and friends \"grow up\" and then watching their kids develop. In most cases, you can tell with in a year or two what a child's personality will be, they either are something or they aren't. Given that the environment is generally nearly identical, I'm lead to believe that much is predetermined genetically.\n \n I certainly think that the environment has an influence, occasionally a very strong one, on how the traits manifest themselves.\n \n More later if there's any interest I guess.\n \n Waxy", 
   {}, 
   49331, 
   null, 
   1084382400.0
  ], 
  [
   49401, 
   null, 
   "sinjin", 
   "Beyond physical traits I believe genetics determine potentials, propensities and very likely temperament, but then environment takes over.", 
   {}, 
   49398, 
   null, 
   1084383300.0
  ], 
  [
   49409, 
   null, 
   "Big Orn", 
   "I have watched as these discussions have progressed from one line to another and have realized that they do, eventually, wind up back at the same place: Natural predisposition. I agree with the fact that if an act is observed in the wild (or natural world) then it would be considered natural. But, to claim whether it is right or not is not up to an individual &#8211; it is up to a governing body. On the other hand, if you subscribe to a religion that denounces it, then it is your duty to claim its unrighteousness. It is not your duty to proclaim its status, based on that belief, to a free nation whose welfare and lawmaking is the responsibility of the government (people).\n And just because someone flies in the face of your belief doesn&#8217;t mean they are for or against your ideas, they are simply preserving freedoms. (If you&#8217;re a Christian you know how hard that is to swallow)\n As far as homosexuals, pedophiles, murderers, etc., being motivated by their genetic makeup &#8211; it&#8217;s a copout, IMO.\n When I was a boy some of my best friends, quite a bit older than I, taught me how to play hardball, literally, how to cut firewood, mow the yard, chew tobacco, smoke, cuss, chase girls, etc. They were Good &#8216;Ol Boys, never got into trouble. Then after graduation, one or two would go away, then another one or two to go fight a war that I had no idea was going on. A few years later, when I was old enough to drive legally, I saw one in town, sitting on a sidewalk, disheveled, dirty, and talking to himself. I could not talk to him, couldn&#8217;t reach him. He had changed completely. His change was due to circumstances &#8211; either by the war or drugs or both. My point is if his genes could not allow him to change the way he looked at life, he would have come back the same person, full of P and vinegar instead of a shell of what he once was.\n \n One, or the combination of: Ego, vanity, desire, chemicals, circumstances, situations, and quality of life determine what you want to do in life and what you are.\n \n We can&#8217;t all credit or blame something or someone for our right or wrong choices. I tell myself that I did good when no one else cares to, but by the same token I have to be man enough to tell myself I messed up.\n \n I believe direct responsibility is not taught in effect as it should be, and that irresponsible behavior is overlooked by the pacifist-based society into which we&#8217;re slowly mutating.", 
   {}, 
   49401, 
   null, 
   1084386780.0
  ], 
  [
   49526, 
   null, 
   "galton", 
   "I have watched as these discussions have progressed from one line to another and have realized that they do, eventually, wind up back at the same place: Natural predisposition. I agree with the fact that if an act is observed in the wild (or natural world) then it would be considered natural. But, to claim whether it is right or not is not up to an individual - it is up to a governing body. On the other hand, if you subscribe to a religion that denounces it, then it is your duty to claim its unrighteousness. It is not your duty to proclaim its status, based on that belief, to a free nation whose welfare and lawmaking is the responsibility of the government (people).\n And just because someone flies in the face of your belief doesn't mean they are for or against your ideas, they are simply preserving freedoms. (If you're a Christian you know how hard that is to swallow)\n As far as homosexuals, pedophiles, murderers, etc., being motivated by their genetic makeup - it's a copout, IMO.\n When I was a boy some of my best friends, quite a bit older than I, taught me how to play hardball, literally, how to cut firewood, mow the yard, chew tobacco, smoke, cuss, chase girls, etc. They were Good 'Ol Boys, never got into trouble. Then after graduation, one or two would go away, then another one or two to go fight a war that I had no idea was going on. A few years later, when I was old enough to drive legally, I saw one in town, sitting on a sidewalk, disheveled, dirty, and talking to himself. I could not talk to him, couldn't reach him. He had changed completely. His change was due to circumstances - either by the war or drugs or both. My point is if his genes could not allow him to change the way he looked at life, he would have come back the same person, full of P and vinegar instead of a shell of what he once was.\n \n One, or the combination of: Ego, vanity, desire, chemicals, circumstances, situations, and quality of life determine what you want to do in life and what you are.\n \n We can't all credit or blame something or someone for our right or wrong choices. I tell myself that I did good when no one else cares to, but by the same token I have to be man enough to tell myself I messed up.\n \n I believe direct responsibility is not taught in effect as it should be, and that irresponsible behavior is overlooked by the pacifist-based society into which we're slowly mutating.\n\n I completely agree with you that we should view people as being responsible for their actions, and there is no reason why people's behavior cannot be the product of biology, environment, AND free choice. I think all three are valid, but no perspective by itself is right. In my view, liberals tend to dismiss everything but the nurture perspective, while religious conservatives emphasize free choice more, but neither give biology its props.", 
   {
    "unicode_changes_made": true
   }, 
   49409, 
   null, 
   1084406700.0
  ], 
  [
   49578, 
   null, 
   "galton", 
   "Ok, I`ll bite ;)\n \n Well, not really. I`m convinced that genes can play an important role in many aspects of our personal characteristics. But, I also believe that enviroment can play an important role in many aspect of our personal characteristics. As for those particular characteristics you mentioned I think that genes may or may not play an important role, depending how you define the words.\n \n Intelligence. The word intelligence is a common word, and is often used in very different circumstances and with very different meaning. Intelligence as cognitive ability is one thing. Intelligence as logic is another. I`m sure that depending on how you use the word inteligence, genes play everything from a very important role, to a not-really-important role at all.\n \n industriousness: With industriousness I`m assuming that you mean \"hard working\". To be honest, I doubt this is a genetical trait. I think hard work is a matter of preferences. If you value the fruits of hard work higher than others, you will be more industrious than others. If you value free time more than others and/or dislike the physical or mental strain of hard work more than others, you will be less industrious than others. And unless these preferences are caused by genes (which I doubt), industriousnes ìtself isn`t caused by genes either.\n \n Edit: I did a search on the subject sociobiology and it appears like they argue that preferences are highly caused by natural selection (examplified with sugar and how it once served an important purpose to enjoy the taste of sugar). And while I think that it seems like a plausible theory, I don`t really know how much explanatory power it has for measuring differences between individuals. Its one thing that natural selection has weeded out certain basic preferences and promoted others. Its another that it actually explains the difference between individuals.\n\n \n Excellent point that there are two things sociobiology tries to explain: general preferences and individual differences. Keep in mind that the who purpose of having males and females and sexual as opposed to asexual reproduction was to generate genetic variation across individuals. That being the case, it would amazing if all that genetic variation failed to explain variation in behavior to any significant degree. \n \n I'm limited on time, so I haven't looked up industriousness yet, but IQ research is easy to find. I found a metanalysis of 212 twin and family IQ studies, and the authors found that IQ was somewhere between 47 and 68% genetic depending on the model. Their findings in fact were more conservative than usual because they found a stronger role for pre-natal envirnoment than other studies (by the way, all biological factors are underappreciated, not just genes). As far as I can figure, these twin studies are powerful research designs which I find very compelling. \n \n IQ tests typically measure something along the lines of abstract problem solving. The activity on this forum is the sort of thing that IQ taps. While there is some wiggle room in the meaning of intelligence, I think people usually have this abstract problem solving in mind when they say, \"That person is intelligent.\" They usually don't say that if they mean a very different kind of ability like good social skills or musical ability for example (which by the way are probably substantially genetic as well).", 
   {}, 
   49331, 
   null, 
   1084416480.0
  ], 
  [
   49606, 
   null, 
   "galton", 
   "Looking for studies on this issue, I ran across a study of 100 fraternal and identical twins in European Journal of Personality (2001) 15:355-371. They found that the following percentage of a trait explained by genes:\n Extroversion 49%\n Agreeableness 35%\n Neuroticism 26%\n Conscientiousness 34%\n Openness 44%", 
   {}, 
   49578, 
   null, 
   1084427760.0
  ], 
  [
   49609, 
   null, 
   "galton", 
   "I found a study of 998 pairs identical and fraternal twins in Journal of Personality and Social Psychology (1999). 74:1556-1565.. Their percentages explained by genes:\n \n Percentage \n anxiety 41\n hostility 37\n depression 44\n self-consciousness 46\n impulsiveness 37\n vulnerablility 40\n \n warmth 40\n gregariousness 40\n activity 38\n excitement seeking 46\n positive emotions 38\n \n openness to fantasy 40\n openness to aesthetics 46\n openness to feelings 31\n openness to actions 44\n openness to ideas 49\n \n trust 37\n straightforwardness 31\n altruism 27\n compliance 38\n modesty 23\n tendermindedness 34\n \n competence 29\n orderliness 51\n dutifulness 37\n achievement striving 46 (similar to the industriousness I wrote of)\n self-discipline 27 \n deliberation 30", 
   {}, 
   49606, 
   null, 
   1084429740.0
  ], 
  [
   49616, 
   null, 
   "Eddie", 
   "Excellent point that there are two things sociobiology tries to explain: general preferences and individual differences. Keep in mind that the who purpose of having males and females and sexual as opposed to asexual reproduction was to generate genetic variation across individuals. That being the case, it would amazing if all that genetic variation failed to explain variation in behavior to any significant degree. \n \n\n \n I guess you are right. But I would also like to point out that the genes haven`t been able to keep up with our cultural and social developments, making much behaviour a matter of \"cultural interpretation\" of some sort. While the genes may be connected to certain behaviour, it does not regulate the behaviour in its fullest as there is a gap between the actual behaviour and the gene... Or something... Did I even make any sense? ;)\n \n \n About studies on twins\n \n Wouldn`t twins share the same enviroment as well as having very similiar genes? I mean, unless they are living in seperate families, their upbringing is very similiar, no? And wouldn`t this imply that the percentages of genetic causality are tainted by enviromental factors? Or have the studies somehow seperated the enviromental factors from the genetic factors and calculated the whole thing?", 
   {}, 
   49578, 
   null, 
   1084445400.0
  ], 
  [
   50034, 
   null, 
   "galton", 
   "I guess you are right. But I would also like to point out that the genes haven`t been able to keep up with our cultural and social developments, making much behaviour a matter of \"cultural interpretation\" of some sort. While the genes may be connected to certain behaviour, it does not regulate the behaviour in its fullest as there is a gap between the actual behaviour and the gene... Or something... Did I even make any sense? ;)\n \n\n Sure you make sense. Nobody is saying culture doesn't play a role, and yes the gene-behavior connection is mediated by several steps like genes--<biochemistry and neurophysiology--<drives/emotions--<environment--<behavior.\n \n \n\n About studies on twins\n \n Wouldn`t twins share the same enviroment as well as having very similiar genes? I mean, unless they are living in seperate families, their upbringing is very similiar, no? And wouldn`t this imply that the percentages of genetic causality are tainted by enviromental factors? Or have the studies somehow seperated the enviromental factors from the genetic factors and calculated the whole thing?\n\n Excellent question. A common research design is to see if identical twins who share 100% of the same genes turn out more similar than fraternal twins who share only 50% of the same genes. To the extent that the identical twins are more similar, this is attributed to genes. Identical twins are usually much more similar. This research is the basis of the finding that homosexuality is partly inherited. \n \n Another method is to compare identical twins raised together with identical twins raised apart. The extent that the twins raised together are more similar to each other than twins raised apart, the more that is attributed to the environment. Identical twins are usually very similar, whether or not they are raised together. \n \n Yet another method is to see if adopted children turn out more like their adoptive parents or their biological parents. Frequently they turn out more like their biological parents.", 
   {}, 
   49616, 
   null, 
   1084578300.0
  ], 
  [
   50079, 
   null, 
   "Darkest Shadow", 
   "Genes do affect how you behave. However they are only part of it. There are I think 4 things that affect your health/behavior:\n \n \n 1. Genes\n 2. Personal choices\n 3. Enviroment\n 4. Personal beliefs\n \n \n And I'd throw God's will in there, but I don't want to debate that, let's go with these four. \n \n Obviously personal choices is the biggest. I mean you may have a genetic tendancy to be fat, but with diet and exercise you can be slim and muscular. But it's a personal choice to eat healthy and go to the gym. \n \n Enviroment is a relatively big one, but not nearly as big as the choices you make. Abraham Lincoln was born in a log cabin to a poor family, that enviroment led him to be a poor farmer. But he chose to rise above it and became one of our most beloved presidents.\n \n Personal beliefs. If you believe God is calling you to go to Africa to be a missionary, that's going to have a big impact on your behavior.\n \n And yes Genes to help determine your behavior, but they are not alone by far.", 
   {}, 
   49616, 
   null, 
   1084589940.0
  ], 
  [
   50177, 
   null, 
   "galton", 
   "Genes do affect how you behave. However they are only part of it. There are I think 4 things that affect your health/behavior:\n \n \n 1. Genes\n 2. Personal choices\n 3. Enviroment\n 4. Personal beliefs\n \n \n And I'd throw God's will in there, but I don't want to debate that, let's go with these four. \n \n Obviously personal choices is the biggest. I mean you may have a genetic tendancy to be fat, but with diet and exercise you can be slim and muscular. But it's a personal choice to eat healthy and go to the gym. \n \n Enviroment is a relatively big one, but not nearly as big as the choices you make. Abraham Lincoln was born in a log cabin to a poor family, that enviroment led him to be a poor farmer. But he chose to rise above it and became one of our most beloved presidents.\n \n Personal beliefs. If you believe God is calling you to go to Africa to be a missionary, that's going to have a big impact on your behavior.\n \n And yes Genes to help determine your behavior, but they are not alone by far.\n\n I pretty much agree with you except to say that genes are more important than what you imply. For example, I had friends in schools that were way better at math than I was, and I don't care if I spent the rest of my life devoted to math, I would never be as good as they are. Maybe a more obvious example might be to look at the top celebrities. No matter how hard I work at it, I can never be a Michael Jordan, I can never be a Kurt Cobain, I can never be a Jim Carrey, I can never be a Bill Gates. We all recognize that a retarded person is that way because something went wrong biologically; why can't we recognize that genius is biological too?", 
   {}, 
   50079, 
   null, 
   1084672740.0
  ], 
  [
   51685, 
   null, 
   "Darkest Shadow", 
   "Did I say it wasn't? All I'm saying is that there's more to you than your genes. If your only going to judge by genes....well then you might as well slap on a white armband and start screaming \"Heil Hitler!\"", 
   {}, 
   50177, 
   null, 
   1085192700.0
  ], 
  [
   51823, 
   null, 
   "galton", 
   "Did I say it wasn't? All I'm saying is that there's more to you than your genes. If your only going to judge by genes....well then you might as well slap on a white armband and start screaming \"Heil Hitler!\"\n\n Well let's turn the tables, and see where your logic takes us. If you only judge a person by their environment like many people do in our culture today, then you might as well grab a hammer and sickle red flag and start screaming, \"Your wish is my command, Comrade Stalin.\"\n \n And funny how your saying makes no mention of people on the right side of the political aisle. I guess it's okay if they come for them.", 
   {}, 
   51685, 
   null, 
   1085270100.0
  ], 
  [
   52021, 
   null, 
   "unkerpaulie", 
   "i think i may be the person your debate is aimed at. i am not convinced that genes has a significant role, if any, in the formation of an individual's character\n \n the identical twin study shows a weak correlation at best, barely any category showed more than 50% corelation. id like to see a similar study for close siblings, where the genetic similarity is less, and see if the results would be any different. that would surely show that the twin connectiveness is stronger.\n \n i think big orn's post points out well how immensely significant environment is in identity formation. i have never seen, nor do i think it is possible, for a gene to exist that would predispose big orn's friend to change nearly as dramatically without the influence of the environment he went through\n \n i also agree that pointing fingers at genes as the reason why people take certain actions or habits is a cop out\n \n i suspect that my motives will be an issue that galton may address, so let me get that out of the way early. i am not buying the '[insert tendency here] gene' story simply because i have looked at the articles both for and against, as well as made my personal observations of behavior and environmental influence, and i have come to that conclusion. it has nothing to do with religious or political affilliation\n \n if i see conclusive reports based on experiments and observation that links genetics to behavior, then i would be happy to look at it, but so far i cannot say that i have", 
   {}, 
   51823, 
   null, 
   1085426220.0
  ], 
  [
   52024, 
   null, 
   "Eddie", 
   " Well let's turn the tables, and see where your logic takes us. If you only judge a person by their environment like many people do in our culture today, then you might as well grab a hammer and sickle red flag and start screaming, \"Your wish is my command, Comrade Stalin.\"\n \n\n \n Not to be pedantic, but Darkest Shadow actually argued that \"free will\" was more important than genes, not enviroment... Perhaps making it a more of a \"structure-agent debate\" .\n \n \n \nAnd funny how your saying makes no mention of people on the right side of the political aisle. I guess it's okay if they come for them.\n\n \n Pastor = reverant/priest...", 
   {}, 
   51823, 
   null, 
   1085426580.0
  ], 
  [
   52035, 
   null, 
   "galton", 
   "Not to be pedantic, but Darkest Shadow actually argued that \"free will\" was more important than genes, not enviroment... Perhaps making it a more of a \"structure-agent debate\" .\n \nMy comment was not so much a rebuttal to her arguments, but rather a criticism of this typical response that has been conditioned in us to link genetic research to Nazism. No one ever links extreme environmentalist research with the horrors of the Soviets, even though they were environmental determinists. \n \n \n \n\n Pastor = reverant/priest...\n\n Is your point that since a pastor made this quote, this shows political balance? I would agree if this were a conservative minister, but he was not. Niemoller was a brave anti-Nazi German who was imprisoned during WWII. After the war, he became an ardent pacifist and was on friendly terms with the Soviets, and other communists.\n \n But anyway, I looked it up and the original quote was: \n \n \n First they came for the Communists,\n and I didn't speak up,\n because I wasn't a Communist.\n Then they came for the Jews,\n and I didn't speak up,\n because I wasn't a Jew.\n Then they came for the Catholics,\n and I didn't speak up,\n because I was a Protestant.\n Then they came for me,\n and by that time there was no one\n left to speak up for me.\n \n by Rev. Martin Niemoller, 1945\n \n So why is the bold line missing? So whoever deleted the line about the Catholics, I won't shed any tears when they come to get you.", 
   {
    "unicode_changes_made": true
   }, 
   52024, 
   null, 
   1085434620.0
  ], 
  [
   52039, 
   null, 
   "galton", 
   "i think i may be the person your debate is aimed at. i am not convinced that genes has a significant role, if any, in the formation of an individual's character\n \n the identical twin study shows a weak correlation at best, barely any category showed more than 50% corelation. id like to see a similar study for close siblings, where the genetic similarity is less, and see if the results would be any different. that would surely show that the twin connectiveness is stronger.\n \n i think big orn's post points out well how immensely significant environment is in identity formation. i have never seen, nor do i think it is possible, for a gene to exist that would predispose big orn's friend to change nearly as dramatically without the influence of the environment he went through\n \n i also agree that pointing fingers at genes as the reason why people take certain actions or habits is a cop out\n \n i suspect that my motives will be an issue that galton may address, so let me get that out of the way early. i am not buying the '[insert tendency here] gene' story simply because i have looked at the articles both for and against, as well as made my personal observations of behavior and environmental influence, and i have come to that conclusion. it has nothing to do with religious or political affilliation\n \n if i see conclusive reports based on experiments and observation that links genetics to behavior, then i would be happy to look at it, but so far i cannot say that i have\n\n Several points: Those numbers I gave in the original post are not correlations; they are the percentage of behavior that is explained by genes, calculated by comparing how much more similar identical twins (100% the same genes) were to each other than fraternal twins (only 50% the same genes) were to each other. These numbers are conservative too since I did not include the percentage of the behavior explained by the interaction of genes and environment.\n \n Second, it is an error to think that the logic of environmental influence is any different than genetic influence. Both approaches claim some X (or combination of X's) cause Y. If Y is high school dropout, for example, environmental explanations may pick poverty for the X; genetic explanations may pick academic ability. They both equally imply that some \"external\" force outside of free will causes dropout. The logic of envirnomental determinism says \"Dropout is not his fault\" to the same degree that genetic determinism does. If you don't like \"excuse\" theories, then logically you should dislike nurture as much as nature theories. (As an aside, the fact is that most nurture folks are just about 100% envirnonmental determinists. No biological person is extreme like that, dismissing any role of the environment.) \n \n Third, if a person doesn't like evolution, that is no reason not to dismiss biological explanations, because biology could influence behavior, whatever its origins. My view is that a person's behavior is the combination of genetically-influenced traits and experiences, as well as choice among a variety of alternatives. I don't deny the importance of any of the three. \n \n One example of the power of genetic explanations is that environmental approaches have a difficult time explaining why siblings often turn out very different from each other since they are all raised in a very similar environment. According to the biological approach, each child receives a unique combination of genes from their parents, making each sibling unique from each other (and from every other human being). So this theory implies that we will see diversity among siblings where environmental theory has to develop post-hoc explanations to account for this diversity.", 
   {}, 
   52021, 
   null, 
   1085436060.0
  ], 
  [
   52046, 
   null, 
   "unkerpaulie", 
   "Several points: Those numbers I gave in the original post are not correlations; they are the percentage of behavior that is explained by genes, calculated by comparing how much more similar identical twins (100% the same genes) were to each other than fraternal twins (only 50% the same genes) were to each other. These numbers are conservative too since I did not include the percentage of the behavior explained by the interaction of genes and environment.\n \n Second, it is an error to think that the logic of environmental influence is any different than genetic influence. Both approaches claim some X (or combination of X's) cause Y. If Y is high school dropout, for example, environmental explanations may pick poverty for the X; genetic explanations may pick academic ability. They both equally imply that some \"external\" force outside of free will causes dropout. The logic of envirnomental determinism says \"Dropout is not his fault\" to the same degree that genetic determinism does. If you don't like \"excuse\" theories, then logically you should dislike nurture as much as nature theories. (As an aside, the fact is that most nurture folks are just about 100% envirnonmental determinists. No biological person is extreme like that, dismissing any role of the environment.) \n\n point taken, although it can be argued that \"academic ability\" can be a product of environment and choice itself, and not necessarily genes. \n \n \nThird, if a person doesn't like evolution, that is no reason not to dismiss biological explanations, because biology could influence behavior, whatever its origins. My view is that a person's behavior is the combination of genetically-influenced traits and experiences, as well as choice among a variety of alternatives. I don't deny the importance of any of the three.\n\n like i said before, my position on this has nothing to do with accepting evolution. i dont deny that genetics play a major role in the one's physical limits, and therefore their abilities to do certain things, but behavior and abilities are separate things. and identity has more to do with self-perception than anything else.\n \n \nOne example of the power of genetic explanations is that environmental approaches have a difficult time explaining why siblings often turn out very different from each other since they are all raised in a very similar environment. According to the biological approach, each child receives a unique combination of genes from their parents, making each sibling unique from each other (and from every other human being). So this theory implies that we will see diversity among siblings where environmental theory has to develop post-hoc explanations to account for this diversity.\n\n again, even the closest siblings encounter different experiences, form different world perspectives, and develop different perceptions of themselves. i hope im not being thick-headed, but somehow the genetic explanations still always leave gaps\n \n do you have any links to studies where the behavioral similarities between twins growing up together were compared to those of siblings growing up together?", 
   {}, 
   52039, 
   null, 
   1085437680.0
  ], 
  [
   52061, 
   null, 
   "CCR1994", 
   "I may be mistaken in this assumption but it appears as though what is being posited is that our genes shape to some extent the choices we are making and that there is no real awareness of this. Of course now that I have been made aware of it, I can now question the choices I make and alter those choices. If I suspect that my genes are exerting an influence I was not previously aware of and I don't like it, I can change my mind. But presumeably some gene in my body influenced that decision too. But then I could also suspect such and once again examine and change my mind again. But then again maybe some gene influenced that decision too. You know what,.. I can't seem to stop typing... the typing gene has taken control of me... I can't stop. If I don't stop I'm going to bite my arm off... Oh for crying out loud my genes are making me want to bite my arm off??? What do I do now???? SOMEBODY HELP ME!!!!", 
   {}, 
   52046, 
   null, 
   1085453160.0
  ], 
  [
   52072, 
   null, 
   "Eddie", 
   "My comment was not so much a rebuttal to her arguments, but rather a criticism of this typical response that has been conditioned in us to link genetic research to Nazism. No one ever links extreme environmentalist research with the horrors of the Soviets, even though they were environmental determinists. \n \n\n \n I think the difference lies in the fact that alot of the attrocities commited by the Nazis derived from their ideal of racial (biological) cause for everything. Soviet attrocities where on the other hand not connected to an ideological belief that the enviroment shapes our personalities. \n \n \n\n Is your point that since a pastor made this quote, this shows political balance? I would agree if this were a conservative minister, but he was not. Niemoller was a brave anti-Nazi German who was imprisoned during WWII. After the war, he became an ardent pacifist and was on friendly terms with the Soviets, and other communists.\n \n\n \n Nah, I only wanted to point out that the last group the Nazis \"came and got\" where christian leaders. And regardless of Martin Niemoller`s personal inclination to socialism, I don`t think the quote implies that only socialists where prosecuted because of their conviction. Christian leaders where as well. \n \n \nSo why is the bold line missing? So whoever deleted the line about the Catholics, I won't shed any tears when they come to get you.\n\n \n No idea. I didn`t write it.", 
   {}, 
   52035, 
   null, 
   1085479260.0
  ], 
  [
   52073, 
   null, 
   "Eddie", 
   "My comment was not so much a rebuttal to her arguments, but rather a criticism of this typical response that has been conditioned in us to link genetic research to Nazism. No one ever links extreme environmentalist research with the horrors of the Soviets, even though they were environmental determinists. \n \n\n \n I think the difference lies in the fact that alot of the attrocities commited by the Nazis derived from their ideal of racial (biological) cause for everything. Soviet attrocities where on the other hand not connected to an ideological belief that the enviroment shapes our personalities. \n \n \n\n Is your point that since a pastor made this quote, this shows political balance? I would agree if this were a conservative minister, but he was not. Niemoller was a brave anti-Nazi German who was imprisoned during WWII. After the war, he became an ardent pacifist and was on friendly terms with the Soviets, and other communists.\n \n\n \n Nah, I only wanted to point out that the last group the Nazis \"came and got\" where christian leaders. And regardless of Martin Niemoller`s personal inclination to socialism, I don`t think the quote implies that only socialists where prosecuted because of their conviction. Christian leaders where as well. Besides... I don`t think that jews could be viewed as either left or right...\n \n \nSo why is the bold line missing? So whoever deleted the line about the Catholics, I won't shed any tears when they come to get you.\n\n \n No idea. I didn`t write it.", 
   {}, 
   52035, 
   null, 
   1085479320.0
  ], 
  [
   52123, 
   null, 
   "galton", 
   "I think the difference lies in the fact that alot of the attrocities commited by the Nazis derived from their ideal of racial (biological) cause for everything. Soviet attrocities where on the other hand not connected to an ideological belief that the enviroment shapes our personalities. \n \n\n In my view, the material point is that it is an unwarranted leap to think that genetic research implies Nazism just like it is unwarranted to think that environmental research implies Stalinism. It is not that one has some logical validity, while the other doesn't--neither way of thinking has any logical validity. \n \n \n\n Nah, I only wanted to point out that the last group the Nazis \"came and got\" where christian leaders. And regardless of Martin Niemoller`s personal inclination to socialism, I don`t think the quote implies that only socialists where prosecuted because of their conviction. Christian leaders where as well. Besides... I don`t think that jews could be viewed as either left or right...\n \n\n Well the quote we were originally discussing is a fake anyway; the original quote did talk about Christians (Catholics) being persecuted. But some lefty felt it was necessary to misrepresent Niemoller by omitting Christians. By the way, the majority of Jews fall on the left side of the political spectrum, and have been a favorite victim of the Left because Jews were the victims of the enemies of the Soviets.", 
   {}, 
   52073, 
   null, 
   1085527020.0
  ], 
  [
   52127, 
   null, 
   "galton", 
   "do you have any links to studies where the behavioral similarities between twins growing up together were compared to those of siblings growing up together?\n\n The study at the top of the thread compares identical twins raised together with siblings (fraternal twins) raised together. The thinking here is that the difference between the two groups is that the identical twins share all their genes, so to the greater extent that they are similar to each other, the greater extent of genetic influence on the behavior examined. Are you asking for other kinds of methods--say where adopted kids are investigated to see if they turn out more like their biological parents of adoptive parents? From what I have seen, they turn out more like their biological parents, but this is a generalization. For example, apparently there is zero correlation between the IQ of an adopted child and his adoptive parents.", 
   {}, 
   52046, 
   null, 
   1085528160.0
  ], 
  [
   52161, 
   null, 
   "Eddie", 
   "In my view, the material point is that it is an unwarranted leap to think that genetic research implies Nazism just like it is unwarranted to think that environmental research implies Stalinism. It is not that one has some logical validity, while the other doesn't--neither way of thinking has any logical validity. \n \n\n \n Yeah, but I was explaining why genetical research is more closely associated with the attrocities of nazism than enviromental research is associated with the attrocities under Stalin. But I agree that there is no real point in making a reference to nazism when discussing wether genes or enviroment influence behaviour. Nazism is a political ideology. Nazism would only come into play once you start discussing the political ramifications of the idea that genes control our behaviour...\n \n \nWell the quote we were originally discussing is a fake anyway; the original quote did talk about Christians (Catholics) being persecuted. But some lefty felt it was necessary to misrepresent Niemoller by omitting Christians. \n\n \n Yes, and my point was that the poster failed to omitt Christians (intentionally or unintentionally) when the poster didn`t delete the fact that Niemoller was a pastor.\n \n \nBy the way, the majority of Jews fall on the left side of the political spectrum, and have been a favorite victim of the Left because Jews were the victims of the enemies of the Soviets.\n\n \n Perhaps in the US. But the US is not the world...", 
   {}, 
   52123, 
   null, 
   1085567640.0
  ], 
  [
   52204, 
   null, 
   "galton", 
   "Perhaps in the US. But the US is not the world...\n\n It's not? ;) Actually, I would argue that Jews world-round tend to be on the left half. Many European and Russian socialist and communist leaders have been Jews (e.g. Trotsky, Goldman). Marx of course was Jewish. With some validity, Hitler saw Jews as aligned with the communists. Russian Jews (and Jews from around the world) supported the Bolsheviks as payback for the Czar's treatment of Jews. You may have Israel in mind, but their system is heavily influenced by socialism. An obvious example of this would be the kibbutzim. You may have in mind Israel's oppression of the Palestinians. Whoever said left-leaning people are always nice? ;)", 
   {}, 
   52161, 
   null, 
   1085601900.0
  ], 
  [
   52213, 
   null, 
   "Eddie", 
   "It's not? ;) Actually, I would argue that Jews world-round tend to be on the left half. \n\n \n And how is that half defined? by american, european or african standards? ;)\n \n \n \nMany European and Russian socialist and communist leaders have been Jews (e.g. Trotsky, Goldman).\n\n \n Yes, and many european capital owners and financial leaders have been jews as well.\n \n \n Marx of course was Jewish.\n\n \n Depending on how you define a jew. If jew is a \"race\", then he was of jewish \"blood\". If jew is a religous affilation, then Marx was not a jew at all. He had no belief in god. If jew refers to the membership of a certain culture, then no. Marx was raised by a father who had converted to christianity and Marx was not brought up with jewish traitions or values.\n \n \nRussian Jews (and Jews from around the world) supported the Bolsheviks as payback for the Czar's treatment of Jews. \n\n \n Yes, but this hardly tells anything about their political allignment other than that they hated the russian Czar.\n \n \nYou may have Israel in mind, but their system is heavily influenced by socialism. An obvious example of this would be the kibbutzim. \n\n \n Yeah, the zionistic movement had some socialistic influences and many members of the zionistic inteligencia where socialists. But who have the Israelis elected as their prime minister now? Israel is hardly a bastion of socialism anymore...\n \n \nYou may have in mind Israel's oppression of the Palestinians. Whoever said left-leaning people are always nice? ;)\n\n \n Nah, I was more thinking of my jewish friends who all but two are heavily right winged. Jewish tradition tends to value thiftyness education highly. This often places them quite high socio-economicly, which often results that they ofte are quite liberal or conservative. But Israel is a good example, not because of their polycies against the palestinians (which has little to do with their political alignment), but because of their current government and parliament where the largest party in Israel, the conservative likud, recieved roughly 30% of the poular vote in their elections in november 2003 (the current president Malachi is also from likud and the current prime minister, Sharon, hails from conservative likud...)", 
   {}, 
   52204, 
   null, 
   1085606520.0
  ], 
  [
   52669, 
   null, 
   "galton", 
   "I ran across this study shown that proneness to suicide is partly genetic. The paper reviews many studies using different methods but coming to the same conclusion. What researchers still have to figure out are the pathways by which genes exert an influence. \n \n Title: Genetics of Suicide: An Overview. \n Authors: Baldessarini, Ross J.1\n Hennen, John1 \n Source: Harvard Review of Psychiatry; Jan2004, Vol. 12 Issue 1, p1, 13p \n \n Abstract: Risk for suicide may have heritable contributions. Evidence supporting this hypothesis includes strong and consistent findings from more than 20 controlled family studies indicating nearly 5-fold greater relative risk of suicidal acts among relatives of index cases with suicidal behavior compared to relatives of nonsuicidal controls. Relative risk was greater for completed suicide than for attempts. \n \n Contributions of genetic instead of environmental factors are indicated by a higher average concordance for suicidal behavior among co-twins of suicidal identical twins compared to fraternal twins or to relatives of other suicidal subjects, in at least seven studies. Three studies indicate significantly greater suicidal risk, particularly for completed suicide, among biological versus adoptive relatives of suicidal or mentally ill persons adopted early in life. \n \n Molecular genetics studies have searched inconclusively for associations of suicidal behavior with genes mainly for proteins required for central serotonergic neurotransmission. Complex interactions of environmental with heritable risk and protective factors for suicide and psychiatric illnesses or vulnerability traits are suspected, but specific intervening mechanisms remain elusive. \n \n Familial or genetic risks for psychiatric factors strongly associated with suicide, such as major affective illnesses and alcohol abuse, as well as impulsive or aggressive traits, have not consistently been separated from suicidal risk itself.", 
   {}, 
   52213, 
   null, 
   1086047220.0
  ], 
  [
   52680, 
   null, 
   "Darkest Shadow", 
   "Well let's turn the tables, and see where your logic takes us. If you only judge a person by their environment like many people do in our culture today, then you might as well grab a hammer and sickle red flag and start screaming, \"Your wish is my command, Comrade Stalin.\"\n \n And funny how your saying makes no mention of people on the right side of the political aisle. I guess it's okay if they come for them.\n\n \n \n Did I happen to say that genes had no influence on who you are? No? Please read what I said earlier, there's more to you than your enviroment or genes, there's also your personal choices and beliefs.", 
   {}, 
   51823, 
   null, 
   1086053340.0
  ], 
  [
   52688, 
   null, 
   "galton", 
   "Did I happen to say that genes had no influence on who you are? No? Please read what I said earlier, there's more to you than your enviroment or genes, there's also your personal choices and beliefs.\n\n My point was not to imply that you denied any genetic role, but to use the opportunity to show that we have been trained to link genetic research with Nazism which is unfair, but we have not been trained to fear environmental determinism even though it was believed in by the Soviets. And I agree with you that free choice plays a role as well.", 
   {}, 
   52680, 
   null, 
   1086057000.0
  ], 
  [
   52751, 
   null, 
   "Darkest Shadow", 
   "I didn't link genetic research with Nazism, I linked judging people by their genes, or heritege, with Nazism.", 
   {}, 
   52688, 
   null, 
   1086136680.0
  ], 
  [
   52754, 
   null, 
   "galton", 
   "I didn't link genetic research with Nazism, I linked judging people by their genes, or heritege, with Nazism.\n\n Ok, let me be more precise. You linked judging people by their genes with Nazism. My point is that nobody makes that kind of argument against environmental determinists, a viewpoint that only judges people by their environment. The Soviets only judged people by their environment, and I took a lot of sociology classes taught by environmental determinists, and when they were saying things like that social problems are caused by poverty, I never heard anyone ever say, \"The Soviets only judged people by their environment too, so you must be a fan of Stalin.\" My point is not to challenge your view that choice is important, it is to point out the unfair attitude that people have developed toward the hypothesis of genetic influence.", 
   {}, 
   52751, 
   null, 
   1086139260.0
  ], 
  [
   61470, 
   null, 
   "Mach", 
   "I pretty much agree with you except to say that genes are more important than what you imply. For example, I had friends in schools that were way better at math than I was, and I don't care if I spent the rest of my life devoted to math, I would never be as good as they are. Maybe a more obvious example might be to look at the top celebrities. No matter how hard I work at it, I can never be a Michael Jordan, I can never be a Kurt Cobain, I can never be a Jim Carrey, I can never be a Bill Gates. We all recognize that a retarded person is that way because something went wrong biologically; why can't we recognize that genius is biological too?\n\n \n I think you overstate the impact of genes. Genes impact height and athletic ability to a great degree, so I agree with you maybe not being able to achive MJ skill at bball (probably not). However, you could surpass him in any number of other disciplines. Regarding Jim and Kurt and Bill. Come on, genetics don't determine your good fortune and ability to work hard towards a single goal. Training and fortune and time, that's what they used to achieve their goals, genes don't have a monoply on those things for the average human.\n \n -Mach", 
   {
    "post_info": {
     "post_title": "genes"
    }
   }, 
   50177, 
   null, 
   1092010140.0
  ], 
  [
   61498, 
   null, 
   "Duo_Maxwell", 
   "pretty much every trait in every organism is influenced by both. You may have the genes for 6'9\", but if you are malnurished during your growth spurts, you will not reach that height. \n \n however, aren't many canine species breed specifically for certain personality traits that come out under any circustance, aka pit bulls?", 
   {}, 
   49182, 
   null, 
   1092031020.0
  ], 
  [
   83313, 
   null, 
   "Paleo-Con", 
   "Behavioral Genetics in the Postgenomic Era ", 
   {}, 
   49616, 
   null, 
   1103381100.0
  ], 
  [
   94089, 
   null, 
   "weneedmorelove", 
   "For those of you who don't understand: Your genes affect the way you react to your environment, and thus genetics and environment are both important. Hypothetically if there were 4 people and there was an \"angry gene\" that 2 people had, and 1 person with the gene got punched in the face and one person without the gene got punched in the face, the angry person punched in the face would react violently, the two \"non angry\" people would act peacefully as would the \"angry gene\" person not punched since he didnt need to react to anything. Obviously genes aren't nearly as clear cut as this but that is a basic example. Also I think some people on this forum seem to forget that not only is there evolution of species but of individual genes, anyone ever wondered why the y gene is so much smaller than the x? The reason is that the x gene is 3 times as common and whenever the y gene mutates to something the x gene \"doesn't like\" the new gene doesnt quite work out chance of being passed on 1/3 as much.", 
   {}, 
   83313, 
   null, 
   1109584500.0
  ], 
  [
   94156, 
   null, 
   "unkerpaulie", 
   "For those of you who don't understand: Your genes affect the way you react to your environment, and thus genetics and environment are both important. Hypothetically if there were 4 people and there was an \"angry gene\" that 2 people had, and 1 person with the gene got punched in the face and one person without the gene got punched in the face, the angry person punched in the face would react violently, the two \"non angry\" people would act peacefully as would the \"angry gene\" person not punched since he didnt need to react to anything. Obviously genes aren't nearly as clear cut as this but that is a basic example. Also I think some people on this forum seem to forget that not only is there evolution of species but of individual genes, anyone ever wondered why the y gene is so much smaller than the x? The reason is that the x gene is 3 times as common and whenever the y gene mutates to something the x gene \"doesn't like\" the new gene doesnt quite work out chance of being passed on 1/3 as much.\n\n how did you come to this? temper and reactions to situations are learned, not inherited. it is not reflexive or innate for someone to react agressively or passively, but it is something that is learned. its scary what people allow themselves to think about behavior...", 
   {}, 
   94089, 
   null, 
   1109616360.0
  ], 
  [
   94714, 
   null, 
   "greg 79 f150", 
   "how did you come to this? temper and reactions to situations are learned, not inherited. it is not reflexive or innate for someone to react agressively or passively, but it is something that is learned. its scary what people allow themselves to think about behavior...\n\n \n \n \n Not totally accurate in my opinion, but true in part...", 
   {}, 
   94156, 
   null, 
   1109763300.0
  ], 
  [
   94766, 
   null, 
   "Waxy", 
   "how did you come to this? temper and reactions to situations are learned, not inherited. it is not reflexive or innate for someone to react agressively or passively, but it is something that is learned. its scary what people allow themselves to think about behavior...\n\n \n Again, I disagree with you.\n \n IMHO, the initial reaction, either passive or aggressive, is very much innate. However, the behaviour can be reinforced or curbed as a person goes through life.\n \n I think it's scary that anyone would ignore that innate component of behaviour.\n \n Waxy", 
   {}, 
   94156, 
   null, 
   1109784720.0
  ], 
  [
   95043, 
   null, 
   "greg 79 f150", 
   "I have witnessed in my family of only 50 or so people , that genetics DOES have a LOT to do with temperament and behaviors. My immediate family has nine children - 5 males , 4 females. All but one, have basically the same personalities, except the one brother . He is what the old timer people call a \"bad seed\" in the family. He is violent, quick to fight, and has had 5 wives in 14 years. All divorced him because of physical abuse. How can one child out of nine , all raised by the same parents , in the same home, be so \"different\" without genetics not playing in to it ?", 
   {}, 
   94766, 
   null, 
   1109813520.0
  ], 
  [
   95127, 
   null, 
   "unkerpaulie", 
   "I have witnessed in my family of only 50 or so people , that genetics DOES have a LOT to do with temperament and behaviors. My immediate family has nine children - 5 males , 4 females. All but one, have basically the same personalities, except the one brother . He is what the old timer people call a \"bad seed\" in the family. He is violent, quick to fight, and has had 5 wives in 14 years. All divorced him because of physical abuse. How can one child out of nine , all raised by the same parents , in the same home, be so \"different\" without genetics not playing in to it ?\n\n how could one child out of nine contract a gene that is not evident in any other member of the family? where did this gene suddenly come from?", 
   {}, 
   95043, 
   null, 
   1109867820.0
  ], 
  [
   95137, 
   null, 
   "Wraith", 
   "how could one child out of nine contract a gene that is not evident in any other member of the family? where did this gene suddenly come from?\n\n \n One in a million chance mutation? ;)", 
   {}, 
   95127, 
   null, 
   1109871240.0
  ], 
  [
   95138, 
   null, 
   "Waxy", 
   "how could one child out of nine contract a gene that is not evident in any other member of the family? where did this gene suddenly come from?\n\n \n I'm not a geneticist, but it would seem to me that this is very easily explained.\n \n I'd go so far as to say that you yourself are well aware of these genetic variabilities based on your contributions to other threads, and are simply being intentionally obstinant.\n \n Waxy", 
   {}, 
   95127, 
   null, 
   1109871660.0
  ], 
  [
   95146, 
   null, 
   "unkerpaulie", 
   "I'm not a geneticist, but it would seem to me that this is very easily explained.\n \n I'd go so far as to say that you yourself are well aware of these genetic variabilities based on your contributions to other threads, and are simply being intentionally obstinant.\n \n Waxy\n\n i'd say that associating the unusual behavior of one child out of nine to a genetic factor is a very far cry from the scientific method. it doesnt even look remotely like the way we know genetics work\n \n can we really say that this is an example of genetics influencing behavior?", 
   {}, 
   95138, 
   null, 
   1109872320.0
  ], 
  [
   95148, 
   null, 
   "fishpower", 
   "can we really say that this is an example of genetics influencing behavior?\n\n \n I'd say that the question is can genetics be ruled out here, and if so, what are we left with that accounts for the one sibling's erratic behavior? Parenting style? The other 8 turned out fine (or so we are told) so we can eliminate that. Did this child develop a drug problem that the others didn't? \n \n Genetics gives us at least one way to view the scenario: that certain recessive genes were shuffled just the right way in this person so that he was prone to more violent behavior than his brothers and sisters. \n \n I don't think there's enough evidence to say one way or the other what's really going on here, but we can't just dismiss genetics out of hand.", 
   {}, 
   95146, 
   null, 
   1109873100.0
  ], 
  [
   95168, 
   null, 
   "unkerpaulie", 
   "I'd say that the question is can genetics be ruled out here, and if so, what are we left with that accounts for the one sibling's erratic behavior? Parenting style? The other 8 turned out fine (or so we are told) so we can eliminate that. Did this child develop a drug problem that the others didn't? \n \n Genetics gives us at least one way to view the scenario: that certain recessive genes were shuffled just the right way in this person so that he was prone to more violent behavior than his brothers and sisters. \n \n I don't think there's enough evidence to say one way or the other what's really going on here, but we can't just dismiss genetics out of hand.\n\n of course the possibilty that genetics is at work here exists. i dont rule out genetics. my argument is that it is totally unscientific to just look at the scenario and make a CONCLUSIVE assertment about the role of genetics. this is what is being done. nothing conclusive about the cause of the sibling's behavior can be deducted from the mere fact that he is the only one in a family of 9 to act a certain way. to say conclusively that the cause is genetic, or environmental, or simply a matter of individual choice, is totally unfounded without doing more observation.\n \n again, no possibility is ruled out. people that assert that genetics is the cause of the behavior are the ones ruling out the other possibilities", 
   {}, 
   95148, 
   null, 
   1109877360.0
  ], 
  [
   95174, 
   null, 
   "Waxy", 
   "of course the possibilty that genetics is at work here exists. i dont rule out genetics. my argument is that it is totally unscientific to just look at the scenario and make a CONCLUSIVE assertment about the role of genetics. this is what is being done. nothing conclusive about the cause of the sibling's behavior can be deducted from the mere fact that he is the only one in a family of 9 to act a certain way. to say conclusively that the cause is genetic, or environmental, or simply a matter of individual choice, is totally unfounded without doing more observation.\n \n again, no possibility is ruled out. people that assert that genetics is the cause of the behavior are the ones ruling out the other possibilities\n\n \n Sorry unkerpaulie, but these two posts just don't jive.\n \n \nhow did you come to this? temper and reactions to situations are learned, not inherited. it is not reflexive or innate for someone to react agressively or passively, but it is something that is learned. its scary what people allow themselves to think about behavior...\n\n \n Waxy", 
   {}, 
   95168, 
   null, 
   1109877960.0
  ], 
  [
   95183, 
   null, 
   "unkerpaulie", 
   "Sorry unkerpaulie, but these two posts just don't jive.\n\n how do people come to the conclusion that behavior is genetically influenced? every \"experiment\" or \"study\" that proposes this relationship essentially does exactly what greg did. they look at a group of related people, see a similarity in behavior, and conclude that there is a genetic influence. actually, greg observed exactly the opposite, and concluded that there is a genetic influence. am i the only one seeing something very wrong with this?", 
   {}, 
   95174, 
   null, 
   1109879460.0
  ], 
  [
   95190, 
   null, 
   "Waxy", 
   "how do people come to the conclusion that behavior is genetically influenced? every \"experiment\" or \"study\" that proposes this relationship essentially does exactly what greg did. they look at a group of related people, see a similarity in behavior, and conclude that there is a genetic influence. actually, greg observed exactly the opposite, and concluded that there is a genetic influence. am i the only one seeing something very wrong with this?\n\n \n The problem I see with your posts is that you are so quick to dismiss genetics. \n \n I've said right from day one that I believe both factors have an influence, I even stated that in this thread. I base that on my own personal experience, as well as the studies that I have seen posted on this site.\n \n How would you propose that the influence of genetics on behaviour be studied? Is the influence of environment studied in a superior manner in your opinion?\n \n Look at your two posts above - how do you reconcile the two?\n \n With the exception of your post at 10:16AM, you seem to always take a hard line \"CONCLUSIVE\" nurture only position, ie your post at 9:26AM Feb. 28. IMHO, that position is completely undefendable.\n \n I've seen a lot of evidence of the influence of genetics presented to you in various threads in various forums, and as of yet, I haven't seen you soften your stance on the issue in even the slightest of ways. In fact, you seem to be more entrenched than ever.\n \n So my question is, what type of evidence would you need to see in order to acknowledge the influence of genetics? Would you ever acknowledge it?\n \n Waxy", 
   {}, 
   95183, 
   null, 
   1109881620.0
  ], 
  [
   95191, 
   null, 
   "fishpower", 
   "how do people come to the conclusion that behavior is genetically influenced? \n\n \n Your question prompted me to do a quick search. Here's a bit of what I found (from http://www.ornl.gov/sci/techresources/Human_Genome/elsi/behavior.shtml):\n \n \nWhat indications are there that behavior has a biological basis? \n [text provided by Joseph McInerney]\n \n Behavior often is species specific. A chickadee, for example, carries one sunflower seed at a time from a feeder to a nearby branch, secures the seed to the branch between its feet, pecks it open, eats the contents, and repeats the process. Finches, in contrast, stay at the feeder for long periods, opening large numbers of seeds with their thick beaks. Some mating behaviors also are species specific. Prairie chickens, native to the upper Midwest, conduct an elaborate mating ritual, a sort of line dance for birds, with spread wings and synchronized group movements. Some behaviors are so characteristic that biologists use them to help differentiate between closely related species.\n \n Behaviors often breed true. We can reproduce behaviors in successive generations of organisms. Consider the instinctive retrieval behavior of a yellow Labrador or the herding posture of a border collie.\n \n Behaviors change in response to alterations in biological structures or processes. For example, a brain injury can turn a polite, mild-mannered person into a foul-mouthed, aggressive boor, and we routinely modify the behavioral manifestations of mental illnesses with drugs that alter brain chemistry. More recently, geneticists have created or extinguished specific mouse behaviors-ranging from nurturing of pups to continuous circling in a strain called \"twirler\"- by inserting or disabling specific genes.\n \n In humans, some behaviors run in families. For example, there is a clear familial aggregation of mental illness.\n \n Behavior has an evolutionary history that persists across related species. Chimpanzees are our closest relatives, separated from us by a mere 2 percent difference in DNA sequence. We and they share behaviors that are characteristic of highly social primates, including nurturing, cooperation, altruism, and even some facial expressions. Genes are evolutionary glue, binding all of life in a single history that dates back some 3.5 billion years. Conserved behaviors are part of that history, which is written in the language of nature's universal information molecule-DNA. \n\n \n As you and I seem to agree, we don't have enough info tell for sure exactly what Greg's brother's problem truly is. But you seem to be dismissing the whole field of behavioral genetics a bit quicker than you should.", 
   {
    "unicode_changes_made": true
   }, 
   95183, 
   null, 
   1109881980.0
  ], 
  [
   95194, 
   null, 
   "unkerpaulie", 
   "fishpower, lets take a look at the article you pasted. first of all, we know for a fact that genes dictate physical features (eye color, hair type, nose shape, etc). physical features put limitations on what a particular creature can and cannot do. the physical feature of relatively large and strong claws would be associated with the behavior of living in burrows rather than in trees. the physical feature of a sharp sense of smell would be associated with the behavior of hunting from downwind. so it it the behavior itself that is dictated by the genes? or is it the physical features and the animal's adaptation to use these features as an advantage?\n \n again, we know for a fact that behaviors can be learned. with conscious effort, we can teach ourselves to be more patient (or impulsive), and we can teach a dog to use a door lever.\n \n based on what is known about genes, and about behavior, it seems quite extraordaimary to think that genes that have been extensively shown to alter physical attributes can also alter the information in someone's brain. as far as we know, genes do not put information into anybody's brain. the only way information gets into our brain is through sensory reception. behavior has been repeatedly shown to be a manifestation of what an individual has in their mind\n \n the sentence you highlighted about altering mouse behavior is very interesting. is there any further study on that with the specifics of that experiment?", 
   {}, 
   95191, 
   null, 
   1109885220.0
  ], 
  [
   95199, 
   null, 
   "unkerpaulie", 
   "So my question is, what type of evidence would you need to see in order to acknowledge the influence of genetics? Would you ever acknowledge it?\n\n to me, what would be a useful indicator that genes affect behavior is the identification of a specific gene or gene sequence, or a limited and unique pattern of genetic information, shared exclusively by individuals that exhibit a particular behavior. not only that, but there would need to be some basis to assume that such a behavior cannot be learned by anyone with the gene sequence, or unlearned by anyone with it. it would also be important to demonstrate that this behavior has been hard-wired into the individual from birth. finally, genetics should be able to correctly predict that a particular individual will manifest a particular behavior by looking at and identifying that particular genetic sequence. and such behavior should become manifest regardless of the indivdual's environment or learning aptitude\n \n why so strict? what do we know about genes as of now? lets take for instance eye color. for instance, eye color is a result of genetic inheritance. as a form of verification, the exact chromosomes and allele loci have been identified. by looking at the dna of a single cell of an individual, studying these specific chromosomes, and matching the alleles at the known loci, we can accurately determine the eye color of the individual without even seeing the person. this is the extent to which genetics dictates physical attributes, and the extent to which the relationship between genetics and physical attributes have been studied\n \n this same standard can be expected and achieved for all aspects of an individual that genes control. if general behavior is one of the aspects that genes control, then why shouldnt this standard apply?", 
   {}, 
   95190, 
   null, 
   1109886420.0
  ], 
  [
   95217, 
   null, 
   "fishpower", 
   "physical features put limitations on what a particular creature can and cannot do. the physical feature of relatively large and strong claws would be associated with the behavior of living in burrows rather than in trees. the physical feature of a sharp sense of smell would be associated with the behavior of hunting from downwind.\n\n \n There is a species of bird that as a mating ritual will make an elaborate presentation out of leaves, twigs and berries that the female has to approve of before she will consent. There are no young around, so they can't learn this behavior simply by watching. (I saw this on a nature show - I can't garauntee I'll find it if asked to provide a reference). Sea turtles are programmed upon hatching to make their way to the sea. In this case there's not even time to learn the behavior - it's just there. Where do these come from, if not genetics? \n \n \nbased on what is known about genes, and about behavior, it seems quite extraordaimary to think that genes that have been extensively shown to alter physical attributes can also alter the information in someone's brain. as far as we know, genes do not put information into anybody's brain. the only way information gets into our brain is through sensory reception. behavior has been repeatedly shown to be a manifestation of what an individual has in their mind\n\n \n Schizophrenia affects behavior in a big way, by directly affecting what an individual has in their mind, as you put it. Schizophrenia has been shown to have genetic origins, as it runs in families (I should note that no one seems to think it is caused exclusively by genetics). What other example do you need? But wait, we were talking about more general behaviors, such as temperment and disposition, not these extreme cases, you might say. Well, consider the bi-polar person. Certainly we wouldn't classify them as insane, as we might a schizophrenic, yet they experience wild fluctuations in mood, thus their outward behavior can be erratic. That can be balanced with certain drugs that affect brain chemistry. So if it follows that brain chemistry influences behaviors, and genetics dictates what a person's particular brain chemistry is made up of, then genetics has at least some say in behavior, no?\n \n \nthe sentence you highlighted about altering mouse behavior is very interesting. is there any further study on that with the specifics of that experiment?\n\n \n I have no idea. I invite you to follow the link I posted previously and see what other information there is.", 
   {}, 
   95194, 
   null, 
   1109888820.0
  ], 
  [
   95227, 
   null, 
   "fishpower", 
   "Oh yeah, there's homosexuality, too. Ask a gay person where they learned their behavior from and you'll get a sour look. Ask them what physical features they were born with that makes homosexuality a more reasonable choice for them (to use your animal shape = behavior logic) and they'll probably walk away. I think most reasonably educated people today would agree that homosexuals were born the way they are. When that happens, there's only one place we can look for a cause of behavior - the genes.\n \n No wait, I take that back - if you can demonstrate that every mother of a gay person experienced the same type of trauma or other physical circumstance that could have affected the fetus's development in the same way, then we could have another reason besides genes to look consider. I haven't heard of any such study, though.", 
   {}, 
   95217, 
   null, 
   1109890440.0
  ], 
  [
   95232, 
   null, 
   "Waxy", 
   "I'm going to leave this one in your capable hands Fishpower.\n \n It falls into my definition of insanity - doing the same thing over and over again expecting a different result.\n \n I've already been down this road with unkerpaulie one too many times. Nothing has changed.\n \n Waxy", 
   {}, 
   95227, 
   null, 
   1109890800.0
  ], 
  [
   95251, 
   null, 
   "unkerpaulie", 
   "Oh yeah, there's homosexuality, too. Ask a gay person where they learned their behavior from and you'll get a sour look. Ask them what physical features they were born with that makes homosexuality a more reasonable choice for them (to use your animal shape = behavior logic) and they'll probably walk away. I think most reasonably educated people today would agree that homosexuals were born the way they are. When that happens, there's only one place we can look for a cause of behavior - the genes.\n \n No wait, I take that back - if you can demonstrate that every mother of a gay person experienced the same type of trauma or other physical circumstance that could have affected the fetus's development in the same way, then we could have another reason besides genes to look consider. I haven't heard of any such study, though.\n\n it seems as though there is no conclusive case for homosexuality being genetically based or environmentally based. the testimony of gays that they were born that way does not make it the actuality. can you demonstrate that every gay person shares the same unique genetic coding?", 
   {}, 
   95227, 
   null, 
   1109893260.0
  ], 
  [
   95316, 
   null, 
   "greg 79 f150", 
   "how do people come to the conclusion that behavior is genetically influenced? every \"experiment\" or \"study\" that proposes this relationship essentially does exactly what greg did. they look at a group of related people, see a similarity in behavior, and conclude that there is a genetic influence. actually, greg observed exactly the opposite, and concluded that there is a genetic influence. am i the only one seeing something very wrong with this?\n\n \n Well UP, I am not a scientist by any means, but I am saying there is something in play , when one child out of nine has a totally different personality than his 8 siblings. No, this brother did no drugs or mind altering substances. This was 1960, my family lived way out in the sticks, the closest thing we had to drugs was smoking grapevines. ...\n \n This brother at the age of 8, whenever disciplined by my mother ( a fly swatter across the butt, like the rest of us got) would not jump around and whine like I would, or my other siblings would , whenever we got swatted for acting up. His face would just turn blood red, he would never utter a word, and he would just stare at my Mom, with eyes that could reach out and kill. My mother always said when she swatted him she felt like she had just swatted a hornets nest. Once when I was 9 and he was 15, I heard a ruckus in the kitchen, I rushed in and found him holding my mother up off of the floor, her back pinned to the wall, with his right hand around her neck.....\n \n \n I may have erred in saying that he is a product of a different gene, but his behavior was not \"learned\" from his siblings, that is what I am disputing. I believe that people can inherit a genetic defect, that may have been dormant, and that wild gene skipped a generation . ... \n \n \n Here is another example. My wife has two grown sons from a previous marriage. My wife's mother and father both, are the most gentle creatures one could ever meet. My wife's grand mother and grandfather were gentle people, , and sister and all her neices , nephews, all gentle , loving people. My wife's one son is like her, gentle to the point of almost being semi comatose , and loves all animals. Yet, her other son is like a tornado on uppers, bad temper, control freak, loud , highly opinionated, and will shoot a dog just because it looked at him funny ...\n \n \n My wife and I had a long talk about this son of hers, being the complete opposite in her family. After much discussion, she stopped talking, and it was like a light came on in her head. She said I think I know why he is different, so I asked her why ? She said his personality is the EXACT duplicate of his grandmother's, on his FATHERS side of the family. So to me, learned behaviors most definite play a role in ones personality makeup. But regardless of what all the Harvard professors are saying, I still say genetics can throw in a wild gene time and again :)", 
   {}, 
   95183, 
   null, 
   1109899320.0
  ], 
  [
   95324, 
   null, 
   "fishpower", 
   "Do you really need to find a single gene for homosexuality? You are looking for a smoking gun, unkerpaulie, which I simply cannot give you. No single gene thus far has been conclusively sorted out. I can cite for you a couple studies, though, one showing matching chromosomal regions in homosexual brothers (Hamer '93) and another showing at 52% concordance of homosexuality among twins (Bailey and Pillard '91), which is interesting in that almost half of the twins weren't of the same orientation, meaning that environment alone doesn't account for sexuality.\n \n But I digress. The larger issue here is genetics contributing to behavior. I've listed the bird & turtle example, which you haven't refuted or turned around. And while I haven't found out any more specifics on that mouse study, I did find another one here, linking agression with a specific gene (bringing us back to greg's brother). What more proof do you need, I ask?\n \n I think we're at a point where we have enough circumstantial evidence to know beyond a doubt that genetics have at least some role in the way we behave, and we're currently seeking out the exact mechanisms.", 
   {}, 
   95251, 
   null, 
   1109901780.0
  ], 
  [
   95388, 
   null, 
   "Alan Ryan", 
   "I think we're at a point where we have enough circumstantial evidence to know beyond a doubt that genetics have at least some role in the way we behave, and we're currently seeking out the exact mechanisms.\n\n \n In some ways it would unfortunate if a causal link between a particular gene, or sequence of genes, could be conclusively linked to a particular behaviour.\n \n For example:\n A defense of genetic predisposition in a case of criminal behaviour (assuming a proven causal link) would be impossible to demolish. \n \n If we extrapolate to many instances, we could arrive at a point where pre-emptive custody would replace due process because of the impossibility of successful prosecutions. This would hardly be an advance on our present arrangements for \"keeping the peace\" or doing justice.", 
   {}, 
   95324, 
   null, 
   1109950800.0
  ], 
  [
   95411, 
   null, 
   "unkerpaulie", 
   "greg, i understand your point. i was not rying to ridicule you for assuming that genetics was the cause of your big brother's deviance, but my point was that you cannot make any conclusive statements about the role of genes as a factor in your brother's behavior. there are quite a number of variables that influence behaviour. the internal resolution to stand up against oppression can manifest the way you described. or perhaps something your brother heard or saw caused him to lose respect for his parents. i'm not proposing that these are the actual causes, but that nothing about an aggressive and disrepectful attitude can be as yet founded in genetics, unless your brother has some sort of undetected mental defect\n \n fishpower, here's how genetics work. for everyone on the planet that has blue eyes, there is an identical and unique dna sequence on a particular locus in a particular chromosome. as long as the individual has that particular eye color, we can accurately predict exactly what we will find in that locus on that chromosome, and vice versa. this works for every physical trait and body function. genes dictate how the physical body will be, and thats how the physical body is.\n \n as we know, there is a segment of the scientific community that proposes that homosexuality is genetically based. however, not once has a comparison of genetic sequences among genes of gays been made to find a unique sequence (as has been done with eye color and other physical features that genes control). the most extensive experimentation in this regard is basically limited to the survey of family trees and looking for similarities in sexual orientation, then concluding that the family shares this gay gene. it is quite obvious that the factor environment can be a significant or even the only factor that causes gays to have gay family members, and nothing about the surveys can eliminate this factor. we end up with uncontrolled and multivariate experiments, and scientists making conclusions about one of the variables without addressing the others\n \n from what we know about genetics, the term \"genetically influenced\" is an oxymoron. genetics dictate physical attributes. there is no \"influence\" in terms of creating \"tendencies\". if you have a gene for thin lips, it is not a \"probability\" or likelihood\" that you will have thin lips, but a fact. thats the way genes operate, as far as science has shown us\n \n alan, your point echoes exactly what i have noticed about society using the \"genetically influenced behavior\" card. citing genetics as the innate cause of behaviors removes the responsibilty complete away from the person. many serial killers, thrill seekers, religious fundamentalists and business proffessionals testify that they've \"been that way all their lives\". does this give us solid grounds to conlude that these types of personality traits are also genetic? if they are, can we criticize them for acting according to their \"nature\"?", 
   {}, 
   95388, 
   null, 
   1109955240.0
  ], 
  [
   95460, 
   null, 
   "fishpower", 
   "Unkerpaulie:\n \n 1) I would appreciate not being lectured on how genetics work. I would say that both our understandings here amount to \"just enough to be dangerous.\"\n \n 2) Genes control eye color. Genes control how many fingers you have. Genes control nose shape, toe length, ear lobe size, etc., etc., and genes control how your brain is put together and the chemical environment therein (both physical aspects of the body, as you harp on so much). As I've demonstrated previously, both latter items affect mood and behavior. So the physical affects the mental and genes have a mechanism by which to influence behavior.\n \n 3) Were you not paying attention when I mentioned (and gave you a link to) the mouse study finding that a single gene was demonstrated to affect how that organism behaves? Is this not exactly the proof that you've been demanding?\n \n 4) I'm still curious as to what your take is on the mating and instinctive animal behaviors that I mentioned earlier is.\n \n 4) Just because you don't like the philosophical ramifications for responsibility and free will that these findings indicate, that doesn't negate their validity. Myself, I'm not sure how I feel about it, but that doesn't mean I'm going to pretend like this extremely interesting field of study isn't valid.\n \n Fun debate, eh?", 
   {}, 
   95411, 
   null, 
   1109962680.0
  ], 
  [
   95529, 
   null, 
   "unkerpaulie", 
   "1) I would appreciate not being lectured on how genetics work. I would say that both our understandings here amount to \"just enough to be dangerous.\"\nMy apologies. i'm glad that we at least have a common knowledge of this and can move on from there\n \n \n2) Genes control eye color. Genes control how many fingers you have. Genes control nose shape, toe length, ear lobe size, etc., etc., and genes control how your brain is put together and the chemical environment therein (both physical aspects of the body, as you harp on so much). As I've demonstrated previously, both latter items affect mood and behavior. So the physical affects the mental and genes have a mechanism by which to influence behavior.\n\n very true. genes do control chemical functions that can influence moods and behavior. in this regard i agree. we also have to remember though that how the individual responds to stimuli, be it internal or external, is entirely up to the individual, based on the knowledge that individual has about how to respond to such stimuli. hungry puppies run towards food and eat it without any apparent forethought. humans under the same circumstances can decide what action they will take. interestingly enough, we can train dogs to eat food only from a certain area, rather than from wherever food is found. how is this possible?\n \n3) Were you not paying attention when I mentioned (and gave you a link to) the mouse study finding that a single gene was demonstrated to affect how that organism behaves? Is this not exactly the proof that you've been demanding?\n\n thanks for the link and sorry for overlooking it before. that is an excellent example of a detectible and identifiable gene influencing the production of a chemical that controls the behavior of the mouse. without their instinctive inhibitions, the mice are relentless in their agression.\n \n like i said before, i dont rule out the possibility of genes playing a role in human behavior. its just that all the claims based on the observations made (by looking at behavioral quirks/similarities in related individuals) are not satisfactorily valid conclusions to me.\n \n4) I'm still curious as to what your take is on the mating and instinctive animal behaviors that I mentioned earlier is.\nok, lets take turtles. we know that if we displace eggs and allow the turtles to hatch on a beach different from where they were laid (which would be the beach on which their mother was laid), they would locate the beach they hatched from, not the beach their mother was hatched from. so we know that it isnt the information of the particular beach that is inhereted, but the ability to return to the beach on which they were hatched. obviously turtles have some unique geo-locational function that allows them to do this, and it is obviously a function they are born with. i never denied that functions and internal mechanisms weren't inherited, because they are\n \n as for the mating rituals, obviously what can be done is limited by physical ability of the creature. males going through mating rituals are essentially competing against other males of the same species. young males have to compete against older males, who started off doing the ritual as a young male competing against older males. i cannot say how the first courting ritual could have started, but its proliferation is obviously a result of perpetual competition.\n \n it would be interesting to see if animals born and bred in capitivity and with no competition would engage in these mating rituals. i'll have to look that up\n \n now bear in mind, i'm not saying that this is definitely the case. it could well be that these mating movements are purely hereditary. but my point is that simply observing this behavior and making any type of conclusion without a controlled experiment is simply not very scientific, imo\n \n4) Just because you don't like the philosophical ramifications for responsibility and free will that these findings indicate, that doesn't negate their validity. Myself, I'm not sure how I feel about it, but that doesn't mean I'm going to pretend like this extremely interesting field of study isn't valid.\n\n my motive for questioning the validity of the study is not because i have preconceived philosophical notions. but i made a point about it because very often people that willingly accept that homosexuality is hereditary very quickly dismiss the possibility that \"deviant\" or \"harmful\" characterstics can possibly be genetic as well. this is an obvious double-standard\n \nFun debate, eh?\n\n indeed ;)", 
   {}, 
   49182, 
   null, 
   1109975220.0
  ], 
  [
   95688, 
   null, 
   "fishpower", 
   "My apologies. i'm glad that we at least have a common knowledge of this and can move on from there\n\n \n No problem.\n \n \n \ngenes do control chemical functions that can influence moods and behavior. in this regard i agree. we also have to remember though that how the individual responds to stimuli, be it internal or external, is entirely up to the individual, based on the knowledge that individual has about how to respond to such stimuli. hungry puppies run towards food and eat it without any apparent forethought. humans under the same circumstances can decide what action they will take. interestingly enough, we can train dogs to eat food only from a certain area, rather than from wherever food is found. how is this possible?\n\n \n You are quite right about still having choice. Humans, despite whatever impulses we might posses, have evolved enough intelligence to rise above them should we choose to. I think the issue this leaves us with is just how much effort does it take to overcome the impulses we're predisposed to? For example, a person with a genetic tendency towards addiction can still choose not to do drugs, or gamble, or whatever the case may be, but they have to work significantly harder than you or I do to make the same choices. And of course there's classic conditioning, which your dog example brings up. We're certainly capable of modifying other species' behavior as well as our own, through positive and negative reinforcement, but what is that conditioning for, if not to eliminate a behavior that's there inately? I'm reminded of the movie A Clockwork Orange here, where the hero undergoes training to suppress his violent tendencies, but it doesn't change what he is fundamentally.\n \n \nlike i said before, i dont rule out the possibility of genes playing a role in human behavior. its just that all the claims based on the observations made (by looking at behavioral quirks/similarities in related individuals) are not satisfactorily valid conclusions to me.\n\n \n True, looking at family trees alone doesn't really give us definitive evidence for a genetic root for behavior. But given that we know that schizophrenia, depression and other lesser mental illnesses are heredetary, all with psychological and behavioral manifestations, all with identifiable genetic compenents, plus evidence from family trees, plus other inate, observable behaviors in other species, then we have enough evidence to form a theory that there is in fact much that genetics has to say on the basic behavioral patterns of organisms. \n \n \ni never denied that functions and internal mechanisms weren't inherited, because they are\n\n \n We call it instinct. A biologist might call it a genetically programmed behavioral response. Your theories on the birds & turtles are interesting. Maybe they're even correct. But weighed against what we know about how information is passed from generation to generation, plus the consistency in behavior from one member of the species to the next (if the bird \"art\" for example, was a copied behavior, we would expect it to change significantly from one generation to the next as errors and changes were made, much like a game of telephone), my money is on genetics.\n \n \nnow bear in mind, i'm not saying that this is definitely the case. it could well be that these mating movements are purely hereditary. but my point is that simply observing this behavior and making any type of conclusion without a controlled experiment is simply not very scientific, imo\n\n \n Good point. I'm backing off from my more had-nosed position here, but I'm still folding it into the theory, as it only backs up what we already know.\n \n \nmy motive for questioning the validity of the study is not because i have preconceived philosophical notions. but i made a point about it because very often people that willingly accept that homosexuality is hereditary very quickly dismiss the possibility that \"deviant\" or \"harmful\" characterstics can possibly be genetic as well. this is an obvious double-standard\n\n \n Oh, all sorts of things can be passed down through DNA, beneficially and not-so. I've never said homosexuality is a good thing - it is what it is. However, I think there are actually some theories that it serves some kind of subtle societal function, because of its omnipresence in social animal populations (homosexuality has been observed in ducks, ferrets, rabbits - you name it). Interesting stuff, but just shots in the dark right now.\n \n I dunno about you, but by this point I think I've made all the points I'm capable of making on this subject...whew!", 
   {}, 
   95529, 
   null, 
   1110064020.0
  ], 
  [
   95899, 
   null, 
   "unkerpaulie", 
   "thanks for sharing your views. we seem to have a lot of common opinions about behavior and genetics, and i agree with most of what you said\n \n about suppressing default behaviors (which is essentially what happens when we train dogs not to eat the food on the floor, but only in the bowl or whatever), there comes a stage in the training of the dog where the lesson is so strongly inpronted in its brain that reinforcement is no longer necessary and the dog automatically does whatit was trained to do. in fact, the trained action becomes the default behavior for the dog, since its decisions are more compelled by what it was trained to do than what comes \"naturally\" (eat the food wherever it is, as long as you're hungry). could it be that the \"nature\" of the dog has changed? could the mechanism that controls the dog's decisions about food be permanently changed, completely erasing what is \"innate\" and replacing it with what is \"conditioned\"? or do the innate decision paths still remain there and could resurface at some point?\n \n \nif the bird \"art\" for example, was a copied behavior, we would expect it to change significantly from one generation to the next as errors and changes were made, much like a game of telephone\n\n whats to say the bird \"art\" isnt changing (not significantly) but comparatively from the bird's point of view. after all, its about competitive advantage, and each bird will try to outdo the competing birds. i wouldnt expect to see \"significant\" changes between generations, but something more closely resembling natural progression of evolution\n \n the real litmus test of this theory would be to observe a bird born and bred in captivity either with no competition or competing with other birds born and bred in captivity. observing the bird's behavior during mating season, or what types of advances it would make towards females, and the response from the females, would be the best indicator as to whether these behaviors are as innate as we suspect", 
   {}, 
   95688, 
   null, 
   1110213000.0
  ], 
  [
   95912, 
   null, 
   "Waxy", 
   "about suppressing default behaviors (which is essentially what happens when we train dogs not to eat the food on the floor, but only in the bowl or whatever), there comes a stage in the training of the dog where the lesson is so strongly inpronted in its brain that reinforcement is no longer necessary and the dog automatically does whatit was trained to do. in fact, the trained action becomes the default behavior for the dog, since its decisions are more compelled by what it was trained to do than what comes \"naturally\" (eat the food wherever it is, as long as you're hungry). could it be that the \"nature\" of the dog has changed? could the mechanism that controls the dog's decisions about food be permanently changed, completely erasing what is \"innate\" and replacing it with what is \"conditioned\"? or do the innate decision paths still remain there and could resurface at some point?\n\n \n As a long time dog owner, I can assure you that you can never remove the default behaviour, or completely replace it with the new behaviour. \n \n The best trained dog in the world will return to all of its old tricks if the training and routine are abandoned long enough, especially if you remove the trainer from the picture.\n \n So the answer to your last question, in my experience, is that the innate is always there just under the surface, and can/will resurface.\n \n Waxy", 
   {}, 
   95899, 
   null, 
   1110216240.0
  ], 
  [
   95982, 
   null, 
   "zelma", 
   "I didn't read all 5 pages of replies, so I hope this isn't redundant. I believe genes give a person the propensity for behavior. The environment also influences behavior. For instance, I believe alcoholism is genetic.\n A person who grows up in an environment where drinking alcohol is the norm is more likely to become alcoholic, than a person (with the same gene) who grows up abstaining from alcohol. \n \n Homosexuality has never been proven to be genetic, but homosexuality has never been as public as it is now. I wonder if some studies were done, if a homosexuals ancestors might also have been gay. \n \n Anyone older in here, do you remember in elementary, the sissys--they most likely grew up to become homosexuals. At least, the ones I knew did. At a young age, some boys demonstrate effeminate behavior at an early age and I don't believe the home environment always condones and perpetuates gay behavior. \n \n \n So, I do think genes influence behavior but genes are not responsible for behavior.", 
   {}, 
   95912, 
   null, 
   1110229440.0
  ], 
  [
   95999, 
   null, 
   "unkerpaulie", 
   "Homosexuality has never been proven to be genetic, but homosexuality has never been as public as it is now. I wonder if some studies were done, if a homosexuals ancestors might also have been gay. \n \n Anyone older in here, do you remember in elementary, the sissys--they most likely grew up to become homosexuals. At least, the ones I knew did. At a young age, some boys demonstrate effeminate behavior at an early age and I don't believe the home environment always condones and perpetuates gay behavior. \n \n \n So, I do think genes influence behavior but genes are not responsible for behavior.\n\n i think there is a pressure on the scientific community to find a biological justification for homosexuality because of the pressure gays get from the religious community. if such a justification can be found, then the religious community can't be as condescending on gays as are now.", 
   {}, 
   95982, 
   null, 
   1110233880.0
  ], 
  [
   96043, 
   null, 
   "zelma", 
   "You are probably right about the pressure, but do you think it would really make a difference to the religious community?", 
   {}, 
   95999, 
   null, 
   1110248220.0
  ], 
  [
   96122, 
   null, 
   "unkerpaulie", 
   "it shouldnt make a difference to the religious community, since their standards should be based on the unchanging word of the bible, and the bible says that homosexuality is a sin whether its biological or not. however, it WOULD make a difference, since the religious community also believes that our biology is designed personally by God himself, and if homosexuality is a result of biological attributes, then thats a work of God, and you cant argue with that, now can you...\n \n it really puts the religious community in a catch 22", 
   {}, 
   96043, 
   null, 
   1110301440.0
  ], 
  [
   96252, 
   null, 
   "zelma", 
   "Yes, I suppose it would. \n I have always wondered about the estrogen balance in a person having an effect on their sexuality. Reason being, at one time, doctors gave estrogen shots to cause the period to happen, and my sister had several shots to no avail. The homosexual born, showed signs of femininity at about age 2, and grew to be full born girly gay wad. \n \n I don't know if that was a acceptable practice among doctors, so it might be hard to evaluate. And it probably isn't all inclusive anyway.", 
   {}, 
   96122, 
   null, 
   1110328860.0
  ], 
  [
   96385, 
   null, 
   "unkerpaulie", 
   "As a long time dog owner, I can assure you that you can never remove the default behaviour, or completely replace it with the new behaviour. \n \n The best trained dog in the world will return to all of its old tricks if the training and routine are abandoned long enough, especially if you remove the trainer from the picture.\n \n So the answer to your last question, in my experience, is that the innate is always there just under the surface, and can/will resurface.\n \n Waxy\n\n its interesting that one of the most pervasive behaviors in human infants is sucking. its the first and primary way they get nourishment once they are born. statistics show that about 90% of all infants suck their thumbs at some point in their lives. almost 50% of babies suck their thumbs in the womb. if ever a habit was innate, thumb sucking can definitely be considered as one.\n \n incidentally, we know that most adults (probably about 95%) find absolutely no comfort in sucking their thumbs. the thought is usually revolting. how could such an obviously instinctive behavior be completely turned off by a behavior that most of them naturally parttook of as an infant?", 
   {}, 
   95912, 
   null, 
   1110391740.0
  ], 
  [
   96395, 
   null, 
   "unkerpaulie", 
   "Yes, I suppose it would. \n I have always wondered about the estrogen balance in a person having an effect on their sexuality. Reason being, at one time, doctors gave estrogen shots to cause the period to happen, and my sister had several shots to no avail. The homosexual born, showed signs of femininity at about age 2, and grew to be full born girly gay wad. \n \n I don't know if that was a acceptable practice among doctors, so it might be hard to evaluate. And it probably isn't all inclusive anyway.\n\n there is quite a difference to how your body reacts to substances, and how an individual reacts to situations. inducing a period by injecting hormones is obviously a physical internal function. \n \n its very interesting what you say about the \"homosexual born.\" right now i am witnessing what could we be a homosexual in the making. my neighboor's son is about 18 months old. he is the son of church going parents in their late 40's, both married and loving, and in all appearances a stable and normal environment. the child has a heathly appetite and is a bit overweight, but still fairly healthy looking. the mother is very protective of him and would lift him for most of his first year. as a result he only started walking independently at about 14 months, and even then his legs developed badly (bow-legged) possibly because of his weight. he hardly leaves the house, unless for church or when my wife takes him out with my son (2 y-o) on a play date. the boy is very reserved, and would rather stay at a safe distance away from my son's wild play rather than excitedly join in, as most young boys would. he is also very introverted and shy. while my son is enthusiatic about swinging high or jumping and climbing on the jungle gym, my neighboor's son is quite terrified by any sudden action (even peek-a-boo games would sometimes have him in tears) he is easily frightened, almost a delicate disposition\n \n i personally am very active with my son, and i encourage my neighbor's son in the fun whenever he comes over (like singing loudly, dancing around, or making any type of noise or mischief - pots, bowls, drums, toys, etc). after a few minutes of being inticed, we'd find him singing and shouting and being more susceptible to excitement than normal.\n \n my wife was actually the first to point out the effect the boy's home-life was having on his development. obviously, there is no emotional trauma or unbalanced home nucleus to speak of, yet it is clear that in an environment where he lives has everything to do with his core habits and attitude. continuing the way he is going, it would not be at all surprising if he becomes more effeminate and can easily identify that thats the way he has always been.\n \n does that mean that the child was born gay? is it destined that he will be sexually attracted to guys regardless of the environment he grows up in?", 
   {}, 
   96252, 
   null, 
   1110393240.0
  ], 
  [
   96423, 
   null, 
   "Waxy", 
   "its interesting that one of the most pervasive behaviors in human infants is sucking. its the first and primary way they get nourishment once they are born. statistics show that about 90% of all infants suck their thumbs at some point in their lives. almost 50% of babies suck their thumbs in the womb. if ever a habit was innate, thumb sucking can definitely be considered as one.\n \n incidentally, we know that most adults (probably about 95%) find absolutely no comfort in sucking their thumbs. the thought is usually revolting. how could such an obviously instinctive behavior be completely turned off by a behavior that most of them naturally parttook of as an infant?\n\n \n I was actually thinking about this thread last night.\n \n In some ways, I think you just stated what I've been saying all along.\n \n Why do children quit sucking their thumbs? IMHO, there's two reasons. The first one being that as we graduate onto solid food and begin to truly understand nourishment, the biological urge to do so dissipates and is replaced by other urges. The second factor is the curbing of the behaviour by both the parents and the peer group. In effect, the biological urge is overcome to some extent due to the learning of a new behaviour. The child is taught that sucking their thumb is wrong and dirty.\n \n IMHO, the combination of both factors leads to the outcome that adults no longer suck their thumbs. \n \n As an aside - you do see adults revert to a child like state - fetal position, thumb sucking, etc... when they face an emotional breakdown due to fear, loneliness, etc... and are seeking some form of comfort.\n \n Anyhoo, what I was really thinking about was the Canada Geese I saw on my way home enjoying the first open water on the Bow River in a couple months. They mate for life. Geese that have been separated as goslings and reintroduced to a new flock exhibit the same behaviour. That's VERY difficult to explain as a learned behaviour. I can't provide a hard link to prove that, but I remember watching it on a documentary about the guy that flies back and forth with the geese on their annual migration in his ultralight plane. \n \n My next thought jump was to humans. IMHO, monogamy is not innate to humans. I think it's a largely a learned behaviour, especially marriage. That would be an example of how our ability to reason and think allows us to overcome what for me anyway, is a strong urge to procreate with just about every attractive woman I see. I'm quite certain I didn't learn that urge.\n \n Again, I know I'm simply repeating myself, but it would seem to me that the evidence for a strong biological influence/control on behaviour is very difficult to ignore, let alone refute.\n \n Waxy", 
   {}, 
   96385, 
   null, 
   1110396060.0
  ], 
  [
   96428, 
   null, 
   "unkerpaulie", 
   "My next thought jump was to humans. IMHO, monogamy is not innate to humans. I think it's a largely a learned behaviour, especially marriage. That would be an example of how our ability to reason and think allows us to overcome what for me anyway, is a strong urge to procreate with just about every attractive woman I see. I'm quite certain I didn't learn that urge.\n\n i think that at one point in history monogamy was the norm rather than the exception. but i dont think man ever lacked the urge to have sex with different partners, so in a way the tendency to be polygamist (as males, that is) was always there i guess. i am quite sure that this is because of the human urge to get pleasure, and not for procreation. but as you noted, it is quite common for men to overcome their urge to lay multiple women and stay monogamous all their lives. it may be a constant act of self-suppression, but it actually seems to be more beneficial than damaging to society as a whole (of course, benefits/detriments to society is purely subjective)\n \n i think we agree in large part that while there are behaviors that are innate, it is our conscious (or subconscious) thought process that really has the final say concerning our behavior", 
   {}, 
   96423, 
   null, 
   1110397620.0
  ], 
  [
   96452, 
   null, 
   "Waxy", 
   "i think that at one point in history monogamy was the norm rather than the exception.\n\n \n I would have to disagree with that assertion, unless you mean recent history, though I can't link to any studies as proof. I would simply point to the behaviour of other primates. IMHO, polygamy is most likely our default condition. I find it very hard to believe that \"cave men\" were monogamous.\n \n \nbut i dont think man ever lacked the urge to have sex with different partners, so in a way the tendency to be polygamist (as males, that is) was always there i guess. i am quite sure that this is because of the human urge to get pleasure, and not for procreation. but as you noted, it is quite common for men to overcome their urge to lay multiple women and stay monogamous all their lives. it may be a constant act of self-suppression, but it actually seems to be more beneficial than damaging to society as a whole (of course, benefits/detriments to society is purely subjective)\n\n \n IMHO, it goes beyond the simple aspect of pleasure. I know we've had this debate before, but IMHO, the sex act is pleasurable to re-inforce the act. The biological attraction to the opposite sex, and urge to copulate goes far beyond simple pleasure IMHO. It's simply the best way to ensure the survival of the species. The more sex is going on, the more babies there'll be - and human \"strength\" is in large part derived from numbers and community. To go out on a limb - I think the increased diversity caused by the mating of multiple partners is also beneficial to the species as a whole. In short, I tihnk you can make a pretty strong case for polygamy being beneficial to the species. That being said, I also realize that a commitment to the raising of offspring is also critical to the species survival.\n \n \ni think we agree in large part that while there are behaviors that are innate, it is our conscious (or subconscious) thought process that really has the final say concerning our behavior\n\n \n I think so. \n \n I feel that we have the power to mentally overcome our innate urges for the most part, but the urges will manifest themselves in those mental processes as well. \n \n Further to that, IMHO, we don't have the ability to erase or completely change the innate, only to modify it, or in some cases, simply curb it. \n \n The strength of the urge is also a big factor in the ability of the mind to overcome the body IMHO. Something as subjective as taste - not liking asparagus, is far easier overcome than the fear of snakes, or one's sexual orientation.\n \n Waxy", 
   {}, 
   96428, 
   null, 
   1110400080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Genes influence most behavior?", 
  "url": "http://www.4forums.com/political/science-math-debates/2380-genes-influence-most-behavior.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 2380, 
  "discussion_files": [
   [
    "11643.html", 
    "http://www.4forums.com/political/science-math-debates/2380-genes-influence-most-behavior-print.html"
   ], 
   [
    "11644.html", 
    "http://www.4forums.com/political/science-math-debates/2380-genes-influence-most-behavior-6-print.html"
   ], 
   [
    "11645.html", 
    "http://www.4forums.com/political/science-math-debates/2380-genes-influence-most-behavior-4-print.html"
   ], 
   [
    "11646.html", 
    "http://www.4forums.com/political/science-math-debates/2380-genes-influence-most-behavior-5-print.html"
   ], 
   [
    "11647.html", 
    "http://www.4forums.com/political/science-math-debates/2380-genes-influence-most-behavior-3-print.html"
   ], 
   [
    "11648.html", 
    "http://www.4forums.com/political/science-math-debates/2380-genes-influence-most-behavior-2-print.html"
   ]
  ], 
  "identifier": 2380
 }
]