[
 [
  [
   49571, 
   null, 
   "Anastasia", 
   "Throughout life we develope ideas, philosoplies and beliefs that we base our life on. We (humans) tend to want to get others to agree and validate those ideas. Why? Is it to explore our own belief structure through trial? To lead others or to belong to a group? We want to share those things so others can try them?\n Why?", 
   {
    "post_info": {
     "post_title": "Why should I care what you think?"
    }
   }, 
   null, 
   null, 
   1084414440.0
  ], 
  [
   49640, 
   null, 
   "Phunting", 
   "I think that all of those are very valid reasons. In the end I would say that with regard to belief (whatever the particulars) all we have in the end is our own faith that we are right. If we are not we are going to look pretty stupid, so naturally we want and need others to confirm that we are right about these things. 'How can x million Americans be wrong?' type mentality.", 
   {}, 
   49571, 
   null, 
   1084462800.0
  ], 
  [
   49655, 
   null, 
   "sglaine", 
   "Throughout life we develope ideas, philosoplies and beliefs that we base our life on. We (humans) tend to want to get others to agree and validate those ideas. Why? Is it to explore our own belief structure through trial? To lead others or to belong to a group? We want to share those things so others can try them?\n Why?\n\n Thats why I practice what I preach every body is different. emoticon_xagree", 
   {}, 
   49571, 
   null, 
   1084471680.0
  ], 
  [
   49719, 
   null, 
   "Big Orn", 
   "Throughout life we develope ideas, philosoplies and beliefs that we base our life on. We (humans) tend to want to get others to agree and validate those ideas. Why? Is it to explore our own belief structure through trial? To lead others or to belong to a group? We want to share those things so others can try them?\n Why?\n\n A little of them all, I&#8217;m afraid.\n To explore: I sometimes feel like something is missing in my belief (I have a 14 yr old stepson that is severely mentally ill). For years I waited for him to give me an idea of what he wanted &#8211; in general. How he felt. (His brain doesn&#8217;t register pain. A sever burn leaves him astonished more than hurt.) He has no awareness of time or space. I had to come to grips with that, personally and spiritually in order to accept him as he is. I wondered why some people are so severely damaged while others, like myself, or normal. I soon come to realize that I had to go through that wonderment in order to reach another level of my faith. I needed help more than he did, sort of.\n To lead: If a person feels strongly about his/her belief, then they tend to be more confident. That&#8217;s both good and bad. Good in that if what they believe is wholesome and of a good nature, the followers can&#8217;t err in their support. On the other hand you have a Jim Jones&#8217; doomsday cult, a.k.a. apostolic socialism, scenario.\n Of course a strong, confident leader mesmerizes his/her congregation despite the sermon in some cases.\n To belong: Some followers feel that their life is worthless without a leader of some sort. Even if they are taught that a certain religion requires no human (physical) leader, they are still drawn by one or more dominant figures. Most of these people have acquired this need during adolescence, some after a tragedy or something not considered as severe, such as divorce or separation.\n To share: When a person experiences certain incidents or spiritual relationships, they tend to want to share the experience. It is beyond the realm of normal (or what is considered normal to them), making it nothing less than supernatural or, in some instances, a miracle. During this period, and depending on the religion&#8217;s message, a basic truth has been attained that could have never been accomplished in any other way, but through a deliverer or savior. Soon the writing and teaching fall into place, completing a puzzle. If they stay focused on that faith they will soon see problems solved and mysteries revealed, even if it goes against all laws of man and nature.\n \n That is the way I see it.\n \n Hope this helps.\n \n \n BTW - I like your C.U.T, I think it's c-u-t-e. emoticon_cool ;)", 
   {}, 
   49655, 
   null, 
   1084482600.0
  ], 
  [
   49731, 
   null, 
   "Anastasia", 
   "Great post!\n Then will all that said, it is safe to say that all of that could be attained no matter what your belief system is?\n If God were your inspiration, and helped you get your inner child healed, assuming we are all damaged, which I don't think is such a stretch...\n then any religion could be valid as long as the results were the same across the board.\n I dabbled in a lot of different religions and I must admit that I still find catholic religion to be the most romantic, and paganism the same.\n I too need to follow something, and I am not sure why.\n I have struggled with this for a long time, I have a huge heart, I try to be a good person..etc etc.\n but in my process I have followed all the steps you described and still have no answer....\n One day I want proof that God exists, the next I am entranced by ritual, I want to burn my candles, light my incense and really believe that it is doing something for me spiritually...\n I really don't want to believe that it is all science but I cant make myself come to any other conclusion\n emoticon_xdonno", 
   {}, 
   49719, 
   null, 
   1084483500.0
  ], 
  [
   49747, 
   null, 
   "Big Orn", 
   "&#8230;it is safe to say that all of that could be attained no matter what your belief system is?\n\n Yes, I believe so. I don&#8217;t really want to get into that, I&#8217;ve been everywhere, man&#8230; issue, but I have been around. I have seen religions that would make The Rock chunk his stick down and run&#8230;really scary stuff. Although they were worshipping a blood-and-guts, sex-ridden mule or whatever, they looked really content, at ease. Their religion was working for them.\n Oh, and lighting candles, sitting back and putting all else out of mind for awhile really works wonders for the spirit and soul. Its saves me a lot of grief getting in contact with my Savior when life seems hopeless.", 
   {}, 
   49731, 
   null, 
   1084484580.0
  ], 
  [
   49780, 
   null, 
   "Anastasia", 
   "Oh, and lighting candles, sitting back and putting all else out of mind for awhile really works wonders for the spirit and soul. Its saves me a lot of grief getting in contact with my Savior when life seems hopeless.\n\n \n I agree with you, but sometimes when I am feeling the need to be \"spiritual\" and I light my candles, burn my incense, focus on Cerridwen or Cernunos I feel like a hooky, same goes for God or Jesus...\n my problem is I want to believe I really do..in something\n but everything leaves too many questions that will never get answered no matter how much faith I have and faith is not enough to convince me.\n I have friends that were total pagans for a long time and then converted to the catholic church and the reasoning was, they will just take what they need from it, pick and choose if you will... well I thought OK I could do that, but that is cheating...\n and then defeats the purpose. I could sway towards atheism but I really do not believe that is in my nature. I like all the gods and goddesses, ritual, imagery... I think the nuns are cool!\n I like everything that comes along with a belief system except the most important thing... to ACTUALLY believe\n Am I going to hell?", 
   {}, 
   49747, 
   null, 
   1084489140.0
  ], 
  [
   49789, 
   null, 
   "Anastasia", 
   "BTW - I like your C.U.T, I think it's c-u-t-e. emoticon_cool ;)\n\n OK you lost me.... What is a C.U.T?\n emoticon_wow", 
   {}, 
   49719, 
   null, 
   1084489680.0
  ], 
  [
   49791, 
   null, 
   "Big Orn", 
   "Am I going to hell?\n\n Ask someone else and they'll give you several answers that you are or might be.\n But, as for me, I don't have the foggiest.\n \n Even if you follow all the precepts, laws, and commandments - only YOU will know that.\n \n Of course there&#8217;s always the &#8220;there ain&#8217;t no stinking hell!&#8221; approach&#8230;", 
   {}, 
   49780, 
   null, 
   1084489920.0
  ], 
  [
   49792, 
   null, 
   "Big Orn", 
   "OK you lost me.... What is a C.U.T?\n emoticon_wow\n\n Custom User Title\n \n I just noticed it awhile ago.", 
   {}, 
   49789, 
   null, 
   1084489980.0
  ], 
  [
   49798, 
   null, 
   "Anastasia", 
   "Ask someone else and they'll give you several answers that you are or might be.\n But, as for me, I don't have the foggiest.\n \n Even if you follow all the precepts, laws, and commandments - only YOU will know that.\n \n Of course there's always the \"there ain't no stinking hell!\" approach...\n\n LOL\n well to be honest I think there will be a lot of cool people in hell, might like to chew the fat with them.....", 
   {
    "unicode_changes_made": true
   }, 
   49791, 
   null, 
   1084490820.0
  ], 
  [
   49799, 
   null, 
   "Anastasia", 
   "Custom User Title\n \n I just noticed it awhile ago.\n\n ahhh... well Thank you\n I asked one of my co-workers to describe me in 2 words and that is what he came up with :)", 
   {}, 
   49792, 
   null, 
   1084490880.0
  ], 
  [
   51858, 
   null, 
   "montalban", 
   "LOL\n well to be honest I think there will be a lot of cool people in hell, might like to chew the fat with them.....\n\n \n It's a sad, sad statement to make... that you would assign the word 'cool' to people in hell.\n \n Hell is for horrible people, not for 'cool' people... unless you think that hating God is cool.\n \n As to why should you care what other people think - why would you ask that if you don't?\n \n I belong to a Church based on traditions - that is, collective wisdom. No one is meant to pick up the Bible and just start interpreting it for themselves. We aren't checking our brains at the door, but just recognising that we, as individuals are prone to error, and that Satan and his demons are out to deceive us - like wolves they will go for the weak.", 
   {}, 
   49798, 
   null, 
   1085288400.0
  ], 
  [
   51896, 
   null, 
   "dreamweaver", 
   "Throughout life we develope ideas, philosoplies and beliefs that we base our life on. We (humans) tend to want to get others to agree and validate those ideas. Why? Is it to explore our own belief structure through trial? To lead others or to belong to a group? We want to share those things so others can try them?\n Why?\nOf course, it's down to a superfluity of various reasons; the major ones being summed up there. Those who partake on philosophy forums and the like, I have found, generally do so to have their position tested and further verified/clarified. Not only that, debate and the like is constant source of learning and a true fountain of knowledge. Sometimes it is to convince others, surely. For the religious - particularly in monotheistic religions - they feel that they have found the \"right way\" - the true source of happiness, and often, they genuinely want to share it with others. \n \n That is but one of the reasons; of course, many are not like that and we don't notice them so much because they will never be as active. Someone who doesn't attempt to convince others and further learn about their theological/philosophical stance generally wouldn't partake on a forum, I feel, so there isn't much of them around places like this. I think Poe summed up this position well when he said, \"Convinced myself, I seek not to convince.\" ~  Berenice", 
   {
    "unicode_changes_made": true
   }, 
   49571, 
   null, 
   1085323860.0
  ], 
  [
   51906, 
   null, 
   "Anastasia", 
   "It's a sad, sad statement to make... that you would assign the word 'cool' to people in hell.\n Hell is for horrible people, not for 'cool' people... unless you think that hating God is cool.\n As to why should you care what other people think - why would you ask that if you don't?\n I belong to a Church based on traditions - that is, collective wisdom. No one is meant to pick up the Bible and just start interpreting it for themselves. We aren't checking our brains at the door, but just recognising that we, as individuals are prone to error, and that Satan and his demons are out to deceive us - like wolves they will go for the weak.\n\n You came in a bit late, I was kidding with Big Orn... The point I was making was pretty clear in the opening statement I made to start the thread..\n I dont care what people think, and if you have read anything I have written on this board, I think its pretty clear..\n So anyone that does not believe in God is going to hell? \n Wait thats right by the Christian views anyone who does not believe in god is going to hell, I know a lot of good people who do not believe so that would put in them in hell, again some cool people to chew the fat with\n get my point?", 
   {}, 
   51858, 
   null, 
   1085329020.0
  ], 
  [
   51911, 
   null, 
   "sglaine", 
   "It's a sad, sad statement to make... that you would assign the word 'cool' to people in hell.\n \n Hell is for horrible people, not for 'cool' people... unless you think that hating God is cool.\n \n As to why should you care what other people think - why would you ask that if you don't?\n \n I belong to a Church based on traditions - that is, collective wisdom. No one is meant to pick up the Bible and just start interpreting it for themselves. We aren't checking our brains at the door, but just recognising that we, as individuals are prone to error, and that Satan and his demons are out to deceive us - like wolves they will go for the weak.\n\n What do you mean. You know people have there own interruptions of what they believe in. It sounds like you are doing your own interruption here. And tell you the truth Montalban  I think satan has more brains then the Christians born agains. With the war going on we are all living in hell.", 
   {}, 
   51858, 
   null, 
   1085331720.0
  ], 
  [
   51915, 
   null, 
   "CCR1994", 
   "There are two possible interpretations of this question: 1) Why should I care what you think of me? or 2) Why should I care if what you think is the same as what I think? I can safely say to the first possibility that I don't really care if somebody doesn't like me for what I think. The second possibility raises the following questions: Should we offer unsolicited opinions? Is it right to judge others as bad for holding different opinions? I wouldn't advise offering unsolicited opinions out of the blue but I wouldn't stay silent if I disagreed with a stated opinion or if I were asked what my opinion was. As for judging others based on their opinions, I think we all know the answer to that.", 
   {}, 
   51906, 
   null, 
   1085334300.0
  ], 
  [
   51973, 
   null, 
   "montalban", 
   "What do you mean. You know people have there own interruptions of what they believe in. It sounds like you are doing your own interruption here. And tell you the truth Montalban  I think satan has more brains then the Christians born agains. With the war going on we are all living in hell.\n\n \n I think that you have a point here somewhere, and it's not to tell the world that you have such a lame-brained idea about Satan.\n \n People do have interpretations. I believe that mine is correct. It is based on\n \n a) God-inspired Holy Bible\n b) God-isnpired Holy Tradition\n and\n c) (hopefully God-inspired) personal wisdom\n \n all of which are in concord.\n \n You believe simply your opinion is the ultimate and you've now decided to blurt it out. emoticon_emb", 
   {}, 
   51911, 
   null, 
   1085392560.0
  ], 
  [
   51974, 
   null, 
   "montalban", 
   "There are two possible interpretations of this question: 1) Why should I care what you think of me? or 2) Why should I care if what you think is the same as what I think? I can safely say to the first possibility that I don't really care if somebody doesn't like me for what I think. The second possibility raises the following questions: Should we offer unsolicited opinions? Is it right to judge others as bad for holding different opinions? I wouldn't advise offering unsolicited opinions out of the blue but I wouldn't stay silent if I disagreed with a stated opinion or if I were asked what my opinion was. As for judging others based on their opinions, I think we all know the answer to that.\n\n \n This then would depend if your opinion is just 'yours'.\n \n I don't believe mine is.\n \n It is based on my own limited capacities, plus the teachings of the Church and Bible... collective wisdom.\n \n Why you should care about that? Well, you don't have to, but when you consider yourself to be the ultimate authority in everything, then you're in real trouble.\n \n The first step to wisdom is realising just how little I know.", 
   {}, 
   51915, 
   null, 
   1085392680.0
  ], 
  [
   52007, 
   null, 
   "Anastasia", 
   "2) Why should I care if what you think is the same as what I think? I can safely say to the first possibility that I don't really care if somebody doesn't like me for what I think. The second possibility raises the following questions: Should we offer unsolicited opinions? Is it right to judge others as bad for holding different opinions? I wouldn't advise offering unsolicited opinions out of the blue but I wouldn't stay silent if I disagreed with a stated opinion or if I were asked what my opinion was. As for judging others based on their opinions, I think we all know the answer to that.\n\n This is what I was going for..", 
   {}, 
   51915, 
   null, 
   1085420760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why should I care what you think?", 
  "url": "http://www.4forums.com/political/religion-debates/2392-why-should-i-care-what-you-think.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 2392, 
  "discussion_files": [
   [
    "13253.html", 
    "http://www.4forums.com/political/religion-debates/2392-why-should-i-care-what-you-think-print.html"
   ], 
   [
    "13254.html", 
    "http://www.4forums.com/political/religion-debates/2392-why-should-i-care-what-you-think-2-print.html"
   ]
  ], 
  "identifier": 2392
 }
]