[
 [
  [
   26, 
   null, 
   "admin", 
   "What kind of Forfeiture law should we have ? \n \n http://www.youdebate.com/DEBATES/forfeiture_law.HTM", 
   {
    "post_info": {
     "post_title": "Forfeiture laws"
    }
   }, 
   null, 
   null, 
   1043622480.0
  ], 
  [
   204, 
   null, 
   "ghettocracka", 
   "can someone explain what a forfeiture law is", 
   {}, 
   26, 
   null, 
   1043876160.0
  ], 
  [
   295, 
   null, 
   "Broker", 
   "Why don't you read the debate page?", 
   {}, 
   26, 
   null, 
   1043938560.0
  ], 
  [
   43769, 
   null, 
   "emclean", 
   "I would love to know what the justices were smoking when they decided to allow this to go on. How dose it not violate the 4th amendment, as well as 8th?", 
   {}, 
   295, 
   null, 
   1081885980.0
  ], 
  [
   43829, 
   null, 
   "daewoo", 
   "I would love to know what the justices were smoking when they decided to allow this to go on. How dose it not violate the 4th amendment, as well as 8th?\n\n \n As I understand it, through some kind of bizarre legal manuvering, it is the property that has commited the crime. I do not pretend to understand how this workd, but it apparently does.\n \n \"The new bill is not even a step in the right direction, IMHO. The first part:\n The bill requires that if a property owner challenges a seizure, the federal government to prove by clear and convincing evidence that property is subject to forfeiture. \"\n \n Pretty much makes it worthless. The problem is that the majority of the proerty seized IS subject to forfeiture. IF you pick up a hooker in your car, your car is subect to forfeiture. IF you drive while your license is suspended, your car can be subject to forfeiture. If you deal drugs out of your house, it can be subject to forfeiture.\n \n If you pick up a hooker in your buddies car or drive with a suspended license, your friends car can be subject ot forfeiture, even if he had no idea your license was suspended or yu were planning on picking up a hooker.\n \n \n The seizure of th 72 yr old womans proerty fit well inside the boundries set by these laws. Even if it was not the property owner who commited the crime, or if they did not even know the crime wa commited, their property can still be seized.", 
   {}, 
   43769, 
   null, 
   1081914660.0
  ], 
  [
   43930, 
   null, 
   "emclean", 
   "Don&#8217;t forget, if you play your radio too loud, or if you take fireworks into Cook County.", 
   {}, 
   43829, 
   null, 
   1081976880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Forfeiture laws", 
  "url": "http://www.4forums.com/political/crime-debates/24-forfeiture-laws.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 24, 
  "discussion_files": [
   [
    "23009.html", 
    "http://www.4forums.com/political/crime-debates/24-forfeiture-laws-print.html"
   ]
  ], 
  "identifier": 24
 }
]