[
 [
  [
   49889, 
   null, 
   "ryaneverk2", 
   "I've been thinking a bit about this lately, and it seems to me that we have gone completely past what Martin Luther King, Jr., said in his famous speech, and are now so focused on skin color and \"tolerance\" that we are accentuating all our differences. Rather than judging people on the content of their character, rather than on the color of their skin, we now focus so much on people's color that we have become hyper-sensitive and completely INtolerant of any differences that make us unique.\n \n I guess what got me thinking about this was Black History Month we \"celebrated\" at our school back in February. We had an assembly where students were scolded for not standing up during the Black \"National Anthem.\" We had speeches and lectures and posters and performances and parades of African culture and clothing, all supposedly to help us to appreciate and understand black culture.\n \n To me, all Black History Month does is to make us more sensitive to our differences. Rather than ignoring color differences and treating our fellow men as Americans, we are constantly trying to categorize as African-American, black, or whatever the correct word is at the time, depending on who you ask. It seems that at our school during Black History Month, every time a black kid and a white kid interact, it's like they're walking on egg shells - one little mention of color or ANYthing that is not full of equality, blame-the-white-man, and diversity-is-beautiful gets you sent off for some diversity reeducation.\n \n Perhaps we should stop focusing so much on our color, and try to do what Martin Luther King, Jr., inspired our nation to do, and focus on character, not color.\n \n Ryan", 
   {
    "post_info": {
     "post_title": "Have blacks (and whites) abandoned Martin Luther King Jr?"
    }
   }, 
   null, 
   null, 
   1084508400.0
  ], 
  [
   49907, 
   null, 
   "mizmaxx", 
   "M.L. King was a person who inspired many people. Unfortunately, some people have misinterpreted his views based on small audio or video clips they've seen of him- in particular his \"I Have a Dream\" speech.\n \n King was a strong believer in affirmative action and other measures which did not ignore \"skin color\" but considered racism a factor in people's daily lives. He wrote in Why We Can't Wait about the reticence of some supposed white anti-racists to accept that simple \"color-blindness\" would only reinforce existing inequities. In the same pamphlet he speaks of the GI Bill, which clearly gave special consideration to veterans, and demonstrated that \"special measures for the deprived\" are not uncommon in American politics.\n \n King called for an end to poverty in general in the form of a guaranteed annual income and full employment for all. He did not see this as a contradiction to \"special measures\", but as complementary. \"A society that has done something special against the Negro for hundreds of years,\" he wrote in Where Do We Go From Here, \"must now do something special for him.\"\n \n He was not simply against the existence of racial categories. He was against racial inequality.\n \n This is also evidence that were he still alive today, or were the King of the Sixties able to comment on the present, he would still feel the same way. The goals he outlines in his writings and speeches have clearly not been acheived.\n \n Although some people like to use his words taken out of context to argue for things he did not agree with, information as to his true beliefs are widely available. This watered-down version of King is a betrayal of all he stood for.", 
   {}, 
   49889, 
   null, 
   1084517160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Have blacks (and whites) abandoned Martin Luther King Jr?", 
  "url": "http://www.4forums.com/political/civil-rights-debates/2400-have-blacks-whites-abandoned-martin-luther-king-jr.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 2400, 
  "discussion_files": [
   [
    "7091.html", 
    "http://www.4forums.com/political/civil-rights-debates/2400-have-blacks-whites-abandoned-martin-luther-king-jr-print.html"
   ]
  ], 
  "identifier": 2400
 }
]