[
 [
  [
   50036, 
   null, 
   "sglaine", 
   "I was just wondering if any of you that read the bible believe every thing that is in it?? emoticon_cool", 
   {
    "post_info": {
     "post_title": "Bible do you believe every thing you read?"
    }
   }, 
   null, 
   null, 
   1084578720.0
  ], 
  [
   50076, 
   null, 
   "Darkest Shadow", 
   "I was just wondering if any of you that read the bible believe every thing that is in it?? emoticon_cool\n\n \n I believe what the Bible says, yes I take it word-for-word literally where possible. (Many of the prophecies are hard to make out and meanings differ)\n \n \n \nWell, you could believe whats in the bible, then again you could be an idiot.\n \n \n And you could be an alien!! Let's stick to logical facts, and leave the sarcasm for another day shall we?", 
   {}, 
   50036, 
   null, 
   1084589280.0
  ], 
  [
   50090, 
   null, 
   "sglaine", 
   "Well, you could believe whats in the bible, then again you could be an idiot.\n\n I think the question was meant do believe that Jesus was able to make the blind to see again or a man that could not walk walk again. You know stuff like that. And as far as you calling me an idiot was totaly uncalled for.", 
   {}, 
   50036, 
   null, 
   1084592520.0
  ], 
  [
   50109, 
   null, 
   "Rogue790", 
   "To sglaine:\n I think the question was meant do believe that Jesus was able to make the blind to see again or a man that could not walk walk again. \n \n Yes, I do believe everything involving Jesus as being true. He was who He said He was, i.e. the Son of God, He did many miracles, but perhaps most importantly of all, He died on the cross and was raised again so that we may come to God with the debt for our sins paid and have eternal life with our Heavenly Father.", 
   {
    "post_info": {
     "post_title": "Jesus = Son of God and did miracles"
    }
   }, 
   50090, 
   null, 
   1084609380.0
  ], 
  [
   50120, 
   null, 
   "sglaine", 
   "To sglaine:\n I think the question was meant do believe that Jesus was able to make the blind to see again or a man that could not walk walk again. \n \n Yes, I do believe everything involving Jesus as being true. He was who He said He was, i.e. the Son of God, He did many miracles, but perhaps most importantly of all, He died on the cross and was raised again so that we may come to God with the debt for our sins paid and have eternal life with our Heavenly Father.\n\n So you are saying is that you believe that miracles happen. So you believe that Noah Ark was big enough for all of his critters. Don't get me wrong I do believe in some of the stuff in the Bible but not all. I believe Jesus died on a cross and realistic stuff like that but I find it hard to believe that he performed miracles. You know stuff that could never be proven.", 
   {}, 
   50109, 
   null, 
   1084635960.0
  ], 
  [
   50324, 
   null, 
   "Lady Of Bohemia", 
   "I was just wondering if any of you that read the bible believe every thing that is in it?? emoticon_cool\n\n \n Logically, I find that a difficult concept. In the bible, it states that we should forgive our enemies, and yet God cannot forgive His enemies. I would also have to take into account whether the bible is \"inspired\" of God.\n \n The bible contains many discrepancies and errors. How can I believe that God would make so many errors in his own book?\n \n Putting aside all of this, I must add that I do believe the bible was written; but I am not convinced it is an inspired work.\n \n I think perhaps I have asked more questions than answered your question.\n \n For me to believe \"everything\" in the bible, I would \"have\" to accept all the discrepancies as well.\n \n ~Anastasia", 
   {}, 
   50036, 
   null, 
   1084788540.0
  ], 
  [
   50327, 
   null, 
   "montalban", 
   "The bible contains many discrepancies and errors. How can I believe that God would make so many errors in his own book?\n\n \n Name them. It is far too easy for you to make such sweeping statements without recourse to presenting any facts. It bespeaks of a lazy argument.\n \n \nLogically, I find that a difficult concept. In the bible, it states that we should forgive our enemies, and yet God cannot forgive His enemies. I would also have to take into account whether the bible is \"inspired\" of God.\n\n \n Yes, a cursory look at the Bible is probably going to give you a distorted idea.\n \n Take for instance two examples, \n \n Pharoh, when he held the Israelites in captivity...\n \n It says that \"God hardened his heart\". It would, superficially seem unfair that God both hardens his heart - makes him recalcitrant, and at the same time, punishes him and his people.\n \n One Orthodox writer gave the ananlogy to understanding this... God's love is like the sun's warmth. The sun's warmth has different effects on different substances. To wax, it melts, but to clay, it hardens. Thus the effects aren't determined upon the sun, but on the substance that reacts to the sun. Likewise, if you are an evil person, you will react differently to God's love, then if you are a good person. The devil will be reviled by God's love, whilst a saint will be comforted.\n \n Another oft misunderstood passage is when Jesus, being crucified he cries out \"My God, my God, why have you forsaken me?\"\n \n Many believe that this is a cry of abandonment and despair, until one realises that He is in fact jogging people's minds to a prophecy, that foretold in Psalm 22. Specifically such phrases as 16 \"...they have pierced my hands and my feet.\"\n and\n 18 \"They divide my garments among them and cast lots for my clothing.\"\n \n It is thus very easy to misunderstand the Bible... especially if you just pick it up and start reading it... this is evidenced in the fact that there is great division, even amongst Christians.\n \n Specifically to God 'forgiving His enemies', you make another mistake. God so loves us that He has given us free will. We can either accept Him or reject Him. If we reject Him, He so much loves us that He will respect that wish... otherwise the gift of free will would be meaningless.\n \n So, when you or I reject God, God accepts this and allows us to move away from Him. If we at any time call upon His help, He will not turn His back on us.\n \n By the way... Psalm 22 reads in full...\n \n For the director of music. To the tune of \"The Doe of the Morning.\" A psalm of David. \n \n  1 My God, my God, why have you forsaken me? \n Why are you so far from saving me, \n so far from the words of my groaning? \n 2 O my God, I cry out by day, but you do not answer, \n by night, and am not silent. \n \n 3 Yet you are enthroned as the Holy One; \n you are the praise of Israel. [1] \n 4 In you our fathers put their trust; \n they trusted and you delivered them. \n 5 They cried to you and were saved; \n in you they trusted and were not disappointed. \n \n 6 But I am a worm and not a man, \n scorned by men and despised by the people. \n 7 All who see me mock me; \n they hurl insults, shaking their heads: \n 8 \"He trusts in the LORD ; \n let the LORD rescue him. \n Let him deliver him, \n since he delights in him.\" \n \n 9 Yet you brought me out of the womb; \n you made me trust in you \n even at my mother's breast. \n 10 From birth I was cast upon you; \n from my mother's womb you have been my God. \n 11 Do not be far from me, \n for trouble is near \n and there is no one to help. \n \n 12 Many bulls surround me; \n strong bulls of Bashan encircle me. \n 13 Roaring lions tearing their prey \n open their mouths wide against me. \n 14 I am poured out like water, \n and all my bones are out of joint. \n My heart has turned to wax; \n it has melted away within me. \n 15 My strength is dried up like a potsherd, \n and my tongue sticks to the roof of my mouth; \n you lay me [2] in the dust of death. \n 16 Dogs have surrounded me; \n a band of evil men has encircled me, \n they have pierced [3] my hands and my feet. \n 17 I can count all my bones; \n people stare and gloat over me. \n 18 They divide my garments among them \n and cast lots for my clothing. \n \n 19 But you, O LORD , be not far off; \n O my Strength, come quickly to help me. \n 20 Deliver my life from the sword, \n my precious life from the power of the dogs. \n 21 Rescue me from the mouth of the lions; \n save [4] me from the horns of the wild oxen. \n \n 22 I will declare your name to my brothers; \n in the congregation I will praise you. \n 23 You who fear the LORD , praise him! \n All you descendants of Jacob, honor him! \n Revere him, all you descendants of Israel! \n 24 For he has not despised or disdained \n the suffering of the afflicted one; \n he has not hidden his face from him \n but has listened to his cry for help. \n \n 25 From you comes the theme of my praise in the great assembly; \n before those who fear you [5] will I fulfill my vows. \n 26 The poor will eat and be satisfied; \n they who seek the LORD will praise him- \n may your hearts live forever! \n 27 All the ends of the earth \n will remember and turn to the LORD , \n and all the families of the nations \n will bow down before him, \n 28 for dominion belongs to the LORD \n and he rules over the nations. \n \n 29 All the rich of the earth will feast and worship; \n all who go down to the dust will kneel before him- \n those who cannot keep themselves alive. \n 30 Posterity will serve him; \n future generations will be told about the Lord. \n 31 They will proclaim his righteousness \n to a people yet unborn- \n for he has done it.\n http://www.biblegateway.com/cgi-bin/bible?passage=Psalm+22&NIV_version=yes&language=english&x=0&y=0", 
   {
    "post_info": {
     "post_title": "Read in it what you want and you'd be wrong"
    }
   }, 
   50324, 
   null, 
   1084793040.0
  ], 
  [
   50331, 
   null, 
   "Rogue790", 
   "To sglaine:\n So you are saying is that you believe that miracles happen. So you believe that Noah Ark was big enough for all of his critters. Don't get me wrong I do believe in some of the stuff in the Bible but not all.  \n \n Yes I believe that Jesus did the many miracles as described in the Bible, possibly more. \n \n As for Noah's Ark, that ship was not a small craft by any sense -- it was designed to stay afloat, not for speed or manovourability (damned word). It was an extremely stable ship, in fact, more stable than many modern ships. Noah's Ark was able to hold more than 520 railcars capacity, well able to hold the land animals needed -- about 16,000 land animals the average size of a sheep. These land animals included the dinosaurs (which the Bible tells us was created on Day 6 of the Creation Week along with people). Some people who have done studies on the Ark have determined that there would still be something like 5 trains of 99 cars for food, Noah's family and \"range\" for the animals, and air space. So room for the animals would be no problem!\n \n I believe Jesus died on a cross and realistic stuff like that but I find it hard to believe that he performed miracles. You know stuff that could never be proven. \n \n Are you putting a limit to or on God's powers? For an all powerful God there are no impossibilites. For an all powerful God who created the Heaven's and all that in them in six days, why do you find it so hard to believe that He can't heal a man of disease? Remember that the Son of Man (Jesus) was given God's Authority on Earth. You are correct that we cannot prove that the miracles happened then now, but we can apply some logic. Is healing a man of disease, for example, such a hard thing for an all powerful God who's power knows no limits? The answer is no.", 
   {
    "post_info": {
     "post_title": "God has no limits to His power."
    }
   }, 
   50120, 
   null, 
   1084797240.0
  ], 
  [
   50332, 
   null, 
   "montalban", 
   "A problem exists even when Christians agree to that they believe in the Bible - and that is the problem of interpretation.\n \n The issue then is not so much as whether one believes in the Bible, as what one believes that Bible is saying.\n \n Even an Orthodox Christian who 'believes' in the Bible will say that some things can't be properly understood in a literal sense. For when it says \"God spoke\" are we to think that he actually used his voice, or just thought? \n \n Western Christians spend too much time (I believe) debating over the meanigns of the words, instead of living the words. I've seen countless debates over whether the Genesis account is a literal six day event, or six thousand year event etc.\n \n \"We don't even have the words, for example, to describe \"literally\" how something can come out of nothing.\"\n Fr. Seraphim Rose \"Genesis, Creation and Early Man: The Orthodox Christian Vision\", p69.\n \n When we look at the creation account, things are created out of logical order, and therefore any attempt at a literal interpretation falls apart.\n \n What Genesis, for example means is that we are meant to understand that the creation was a miracle, and that God was active in the creation. We accept what it says, and don't need to rationalise it. Orthodox Christians accept and understand that there are some things beyond our ability to understand.", 
   {
    "post_info": {
     "post_title": "Literal Sense of the Bible"
    }
   }, 
   50331, 
   null, 
   1084798380.0
  ], 
  [
   50339, 
   null, 
   "sglaine", 
   "I believe surton stuff like Jesus died on a cross and logical things like that. But how I don't believe the BS about the Red Sea parting so the his followers could walk though. I don't believe the nonsense about Noah's Arc. I don't believe the garbage about his healing the blind & curing the cripple. Mossies never walked on water come on now get with the real world it never happen. emoticon_xangel", 
   {}, 
   50332, 
   null, 
   1084804440.0
  ], 
  [
   50347, 
   null, 
   "Big Orn", 
   "It is thus very easy to misunderstand the Bible... especially if you just pick it up and start reading it... this is evidenced in the fact that there is great division, even amongst Christians.\n\n Good point, montalban.\n Before we even pick up the Bible, it is our responsibility to ask for help from God. He will then see to it that we comprehend each and every passage of scripture. I believe that the words of the Bible are alive. We can only see that life through God&#8217;s eyes, which means we can only read the Bible with our spirits and fully understand it.\n \nMossies never walked on water come on now get with the real world it never happen. emoticon_xangel\n\n No, Moses never walked on water, but he did walk through a dry seabed. Not dry as solid ground, but not boggy as to sink up even to the ankles.\n I would not attempt to make sense of the properties of dark stars, black holes or the String theory unless I first researched the flow of words through whom they were written.\n \n Ever tried to decipher the small print spawned from the writings of a lawyer? It makes sense once you learn how to read it.", 
   {}, 
   50339, 
   null, 
   1084807620.0
  ], 
  [
   50354, 
   null, 
   "thebootfitter", 
   "What Genesis, for example means is that we are meant to understand that the creation was a miracle, and that God was active in the creation.\n\n Oohhhh! So, THIS is the proper interpretation of Genesis? Ohh! Now everything makes more sense! (Please excuse the mild sarcasm...)\n \n Seriously, though... how can you claim with certainty that this is the RIGHT way to interpret Genesis, and all the fundamental Christians who believe in a literal interpretation of Genesis are WRONG?\n \n \nWe accept what it says, and don't need to rationalise it. Orthodox Christians accept and understand that there are some things beyond our ability to understand.\n\n Consider that human beings are capable of rationilizing. We are capable of studying and observing and thinking and pondering. If you believe in God, then these are gifts that were given to us by God. Are we not supposed to use our God-given gifts?", 
   {}, 
   50332, 
   null, 
   1084810080.0
  ], 
  [
   50369, 
   null, 
   "jim's trucking", 
   "I believe surton stuff like Jesus died on a cross and logical things like that. But how I don't believe the BS about the Red Sea parting so the his followers could walk though. I don't believe the nonsense about Noah's Arc. I don't believe the garbage about his healing the blind & curing the cripple. Mossies never walked on water come on now get with the real world it never happen.  emoticon_xangel\n\n \n You're right, for once. It was Jesus who walked on water. Moses turned his staff into a snake.", 
   {}, 
   50339, 
   null, 
   1084813620.0
  ], 
  [
   50382, 
   null, 
   "sglaine", 
   "You're right, for once. It was Jesus who walked on water. Moses turned his staff into a snake.\n He never did that ether. It is fiction.", 
   {}, 
   50369, 
   null, 
   1084815420.0
  ], 
  [
   50409, 
   null, 
   "Ghost", 
   "\n As for Noah's Ark, that ship was not a small craft by any sense -- it was designed to stay afloat, not for speed or manovourability (damned word). It was an extremely stable ship, in fact, more stable than many modern ships. Noah's Ark was able to hold more than 520 railcars capacity, well able to hold the land animals needed -- about 16,000 land animals the average size of a sheep. These land animals included the dinosaurs (which the Bible tells us was created on Day 6 of the Creation Week along with people). Some people who have done studies on the Ark have determined that there would still be something like 5 trains of 99 cars for food, Noah's family and \"range\" for the animals, and air space. So room for the animals would be no problem!\n\n \n How did one man build the ark? Where did he get the materials? How long did it take him to single-handedly build the world's largest zoo? How the hell was he able to get two of every animal, when undoubtedly there were many which lived only on the other side of the world? Where did he build this ship? How did Noah manage to get a pair of tyrannosaurus rex to get onto the boat? How about bronchiasaurs? Polar bears? How did he get the world's largest and most dangerous animals to get onto a flippin boat and not kill each other or him?\n \n What happened to the dinosaurs, by the way? I'm curious, because scientists have been scratching their heads over this more years and years. Imagine their surprise when they find out that Christians knew all along!\n \n \n \nAre you putting a limit to or on God's powers? For an all powerful God there are no impossibilites. For an all powerful God who created the Heaven's and all that in them in six days, why do you find it so hard to believe that He can't heal a man of disease? Remember that the Son of Man (Jesus) was given God's Authority on Earth. You are correct that we cannot prove that the miracles happened then now, but we can apply some logic. Is healing a man of disease, for example, such a hard thing for an all powerful God who's power knows no limits? The answer is no.\n\n \n God created the heavens? Why did he do that? Why did he create everything in them? How do you know any of this? Here's a tricky question...where did God come from?\n \n Yeah, I'll put a limit on God's power, going with your reasoning. Why doesn't he simply smite the devil and save people from an eternity of torture? Why doesn't he make himself known to people by walking on Earth? Right now he relies upon flawed books written by human beings in superstitious cultures.\n \n How do you know that Christ performed miracles? There is no proof, just the word of superstitious, uneducated people two thousand years ago. Doesn't seem very reliable to me. Here's a theory, and it's just a theory, I don't really believe it, but it illustrates my point. Magic and illusion is the oldest performing art in the world, older than music, older than dance, etc etc. If someone of pretty good skill at this, like a Copperfield or Blaine lived in a culture like the ones back then, and performed tricks while preaching new religions, what effect do you think that would have?", 
   {}, 
   50382, 
   null, 
   1084819620.0
  ], 
  [
   50413, 
   null, 
   "Lady Of Bohemia", 
   "Name them. It is far too easy for you to make such sweeping statements without recourse to presenting any facts. It bespeaks of a lazy argument.\n \n \n \n Yes, a cursory look at the Bible is probably going to give you a distorted idea.\n \n Take for instance two examples, \n \n Pharoh, when he held the Israelites in captivity...\n \n It says that \"God hardened his heart\". It would, superficially seem unfair that God both hardens his heart - makes him recalcitrant, and at the same time, punishes him and his people.\n \n One Orthodox writer gave the ananlogy to understanding this... God's love is like the sun's warmth. The sun's warmth has different effects on different substances. To wax, it melts, but to clay, it hardens. Thus the effects aren't determined upon the sun, but on the substance that reacts to the sun. Likewise, if you are an evil person, you will react differently to God's love, then if you are a good person. The devil will be reviled by God's love, whilst a saint will be comforted.\n \n Another oft misunderstood passage is when Jesus, being crucified he cries out \"My God, my God, why have you forsaken me?\"\n \n Many believe that this is a cry of abandonment and despair, until one realises that He is in fact jogging people's minds to a prophecy, that foretold in Psalm 22. Specifically such phrases as 16 \"...they have pierced my hands and my feet.\"\n and\n 18 \"They divide my garments among them and cast lots for my clothing.\"\n \n It is thus very easy to misunderstand the Bible... especially if you just pick it up and start reading it... this is evidenced in the fact that there is great division, even amongst Christians.\n \n Specifically to God 'forgiving His enemies', you make another mistake. God so loves us that He has given us free will. We can either accept Him or reject Him. If we reject Him, He so much loves us that He will respect that wish... otherwise the gift of free will would be meaningless.\n \n So, when you or I reject God, God accepts this and allows us to move away from Him. If we at any time call upon His help, He will not turn His back on us.\n \n By the way... Psalm 22 reads in full...\n \n For the director of music. To the tune of \"The Doe of the Morning.\" A psalm of David. \n \n  1 My God, my God, why have you forsaken me? \n Why are you so far from saving me, \n so far from the words of my groaning? \n 2 O my God, I cry out by day, but you do not answer, \n by night, and am not silent. \n \n 3 Yet you are enthroned as the Holy One; \n you are the praise of Israel. [1] \n 4 In you our fathers put their trust; \n they trusted and you delivered them. \n 5 They cried to you and were saved; \n in you they trusted and were not disappointed. \n \n 6 But I am a worm and not a man, \n scorned by men and despised by the people. \n 7 All who see me mock me; \n they hurl insults, shaking their heads: \n 8 \"He trusts in the LORD ; \n let the LORD rescue him. \n Let him deliver him, \n since he delights in him.\" \n \n 9 Yet you brought me out of the womb; \n you made me trust in you \n even at my mother's breast. \n 10 From birth I was cast upon you; \n from my mother's womb you have been my God. \n 11 Do not be far from me, \n for trouble is near \n and there is no one to help. \n \n 12 Many bulls surround me; \n strong bulls of Bashan encircle me. \n 13 Roaring lions tearing their prey \n open their mouths wide against me. \n 14 I am poured out like water, \n and all my bones are out of joint. \n My heart has turned to wax; \n it has melted away within me. \n 15 My strength is dried up like a potsherd, \n and my tongue sticks to the roof of my mouth; \n you lay me [2] in the dust of death. \n 16 Dogs have surrounded me; \n a band of evil men has encircled me, \n they have pierced [3] my hands and my feet. \n 17 I can count all my bones; \n people stare and gloat over me. \n 18 They divide my garments among them \n and cast lots for my clothing. \n \n 19 But you, O LORD , be not far off; \n O my Strength, come quickly to help me. \n 20 Deliver my life from the sword, \n my precious life from the power of the dogs. \n 21 Rescue me from the mouth of the lions; \n save [4] me from the horns of the wild oxen. \n \n 22 I will declare your name to my brothers; \n in the congregation I will praise you. \n 23 You who fear the LORD , praise him! \n All you descendants of Jacob, honor him! \n Revere him, all you descendants of Israel! \n 24 For he has not despised or disdained \n the suffering of the afflicted one; \n he has not hidden his face from him \n but has listened to his cry for help. \n \n 25 From you comes the theme of my praise in the great assembly; \n before those who fear you [5] will I fulfill my vows. \n 26 The poor will eat and be satisfied; \n they who seek the LORD will praise him- \n may your hearts live forever! \n 27 All the ends of the earth \n will remember and turn to the LORD , \n and all the families of the nations \n will bow down before him, \n 28 for dominion belongs to the LORD \n and he rules over the nations. \n \n 29 All the rich of the earth will feast and worship; \n all who go down to the dust will kneel before him- \n those who cannot keep themselves alive. \n 30 Posterity will serve him; \n future generations will be told about the Lord. \n 31 They will proclaim his righteousness \n to a people yet unborn- \n for he has done it.\n http://www.biblegateway.com/cgi-bin/bible?passage=Psalm+22&NIV_version=yes&language=english&x=0&y=0\n\n \n I respect your answer, however, for me to give you examples will be a never ending story.\n \n As your assessment is fair, here is a link for starters...\n \n http://members.aol.com/matt103436/Contradictions.htm\n \n As for me giving the bible a cursory glance, you could not be further from the truth. I studied the bible for 17 years. \n \n One of my own personal gripes is with a subject already mentioned by other posters, the flood. Did the flood really occur on a world wide scale as we are led to believe in the bible? \n \n I do not believe this Ark Story. I am in a rush, so this is off the top of my head.....\n \n A Great Flood does create many problems and questions. Some 4.4 billion cubic kilometres of water would have to be added to the oceans for Mount Everest alone to be covered. Put aside a few minor fundamental problems such as the earth having to slow down it's rotation to total rotational decay, where did all this water come from?\n \n The Flood cannot be explained by \"Rainfall\". This would make the air 99.9% water vapor, making the atmospheric pressure 840 times greater than it is today. Any animal with lungs would have died!\n \n In argument with myself, if I try to explain this as the water having come from Tsunamis, ect, then I would have to consider that earth's crust wold have to have been a porocity of 50%, in contrast to the measured figure of 1%, and the temps of crustal rock increases with depth with water temps up to 350 degrees. If this was released in any way to form a \"Great Flood\"........ark travel just might have been a little, let's say, problematic????\n \n If I argue -:Meteor. Mmmmmmm, this is a possibility, but....it would scientifically have to have been equivalent to a 12 trillion megaton nuclear bomb, this equals no earth, which equals no earth to flood! Even if the Meteor theory were plausible, it would leave a high-pressure, oxygen-poor atmosphere of around 6800 degrees. Hardly ideal cruising conditions.\n \n That is what I call a major discrepancy, IMHO, but I am open to ideas and others thoughts.\n \n \n As for God's forgiveness, are Adam and Eve forgiven?\n \n Also-:Matthew 5: 20-22\n 20 For I say unto you, That except your righteousness shall exceed the righteousness of the scribes and Pharisees, ye shall in no case enter into the kingdom of heaven.\n 21 Ye have heard that it was said of them of old time, Thou shalt not kill; and whosoever shall kill shall be in danger of the judgment:\n 22 But I say unto you, That whosoever is angry with his brother without a cause shall be in danger of the judgment: and whosoever shall say to his brother, Raca, shall be in danger of the council: but whosoever shall say, Thou fool, shall be in danger of hell fire.\n \n My personal non belief as to the bible not being an inspired work, does not an atheist make. ;) \n \n ~Anastasia", 
   {}, 
   50327, 
   null, 
   1084820460.0
  ], 
  [
   50609, 
   null, 
   "montalban", 
   "I respect your answer, however, for me to give you examples will be a never ending story.\n \n As your assessment is fair, here is a link for starters...\n \n http://members.aol.com/matt103436/Contradictions.htm\n \n ~Anastasia\n\n \n I still think this is a lazy way of answering - just throwing in someone else's mistaken criticisms and call them as your own\n The 1st...\n Exodus 12:22 God says, \"...and none of you shall go out of the house until morning.\" VS. Exodus 12:31 Pharaoh calls for Moses and Aaron by night and tells them to get their people the hell out of Egypt, right now.\n \n If you look at the verses preceeding 12:31 you'll note that the Angel of the Lord had already struck. Moses ordering people to stay in doors, then coming out himself after the Angel of the Lord had passed-over is no contradiction.\n \n It is akin to saying Lot slept with his daughters, therefore the Bible condones incest. It doesn't it merely states (in an historic way, what happened).\n \n Likewise, as people develop their understanding of God, their understanding changes, not God.\n \n A similar charge from your site says\n Matthew 15:4 Jesus says, \"Honour thy father and mother...\" VS. Luke 14:26 Jesus says, \"If any man come to me, and hate not his father and mother...he cannot be my disciple.\"\n \n There is no problem with honouring my mother, that I will always love her, but should she turn against God, though I love her as my mother, I would hate her as a sinner - or rather I would hate the sin.\n \n Another of your site's claims...\n \n Mark 15:25 Jesus was crucified at the third hour VS. John 19:14-15 says the sixth hour.\n \n This isn't what it says at all.\n John says that 'about' the sixth hour, Pilate ordered Jesus to be condemned. Mark says that he was actually crucified on the third hour. One is talking about the event of his condemnation, the other of the actual sentence being carried out.\n \n It sort of confirms this when it states\n \n Matthew 27:46 - about the 9th hour he died.\n Mark 15:25 - 3rd hour crucified, Mark 15:34 - 9th hour died.\n Luke 23:44 - darkness from the 6th to the 9th hour, died at the 9th.\n John 19:14-15 - 6th hour crucified.\n \n That is, it confirms that three Gospels pick the ninth hour, but then repeats the same mistake regarding John.\n \n As I said, you will do what you will with what you read of the Bible, and if you approach it as you do, then you will have it say whatever you will.\n \n St. Augustine said with unacostomed humility, that when he did not understand a passage of the Bible, or it seemed to contradict, then he realised that his own frail understanding was at fault, and not the Bible.", 
   {}, 
   50413, 
   null, 
   1084875600.0
  ], 
  [
   50611, 
   null, 
   "montalban", 
   "If I can add a few more points, having just had a nice break for dinner.\n \n Claim:\n Matthew 7:21 Jesus says not everyone that calls the name of the Lord shall be saved VS. Acts 2:21 Paul says whosoever shall call on the name of the Lord shall be saved.\n \n Rebuttal:\n Acts 2:21 is not spoken by Paul, but by Peter. He is not saying what 'is', as Jesus did, but what was said people would say.\n \n Claim:\n Acts 9:7 VS. Acts 22:9 VS. Acts 26:14\n Paul of Tarsus lies each time he tells the story of meeting Jesus on the road to Damascus. Paul, a liar, wrote over half of the New Testament. The Apostles considered his preachings falsehood.\n \n Rebuttal\n What is it that is contradictory? All deal with Saul (as Paul was known) heading on the road to Damascus, meeting Jesus, and realising he should stop persecuting the Church.\n \n It is a lazy arguer who would do a web-site search of 'Bible contradictions' and just post these without any critical thinking or analysis of the evidence. It bespeaks of a mind poisoned with hate, willing to pour out derision upon Christ.\n \n Thus this mind tries to comprehend a miracle, in non-miraculous terms, by trying to explain it in the frame-work of science; tsunamis etc. You might as well try to scientifically explain the raising of the dead, or the walking on water - maybe the water iced up underneath Jesus (of course this is a nonsense, but some people try to rationalise miracles, which is a self-defeating process).", 
   {}, 
   50609, 
   null, 
   1084879800.0
  ], 
  [
   50615, 
   null, 
   "Rogue790", 
   "To Ghost:\n You bring up many of the most asked questions about the Christian religion and the Bible - questions to which I know and have the answer. I will answer every single one of your questions one at a time, so this may take some time, so out of curtsey, I would take a little streach first and a coffee or something.\n Let us begin.\n \n How did one man build the ark? Where did he get the materials? \n \n It is important to note before I start answering these questions that the Bible does not mention on how Noah and his family made the Ark (other than the design specifications). So as a result we must think for ourselves and try and interpret what may have happened. You asked how could one man build the Ark. Well, we know that Noah had three sons which would have helped (and they had wifes which also may have helped). But there is not one verse in Scripture that says that Noah couldn't nor didn't hire out workers to help him build it. Also note, Noah and his family (possibly other workers) had about 100 or so years to build the Ark [we get this by comparing the age of Noah when he had his sons - Genesis 5 - to his age when the flood hit - Genesis 7]. As for where they got the materials from? Trees. A lot of trees. We are not told how many trees there were in the environment, but I would suggest that the people would settle around a treeish spot. Also, there is nothing in Scripture that says that they didn't get trees (for wood) from a long distance away. I am not familar with how they actually made the Ark, but lack of trees most likely wouldn't be a problem. \n \n How long did it take him to single-handedly build the world's largest zoo? \n \n Once again we are not told, but we know the time frame we are dealing with. Once again, Noah could have hired out worked labour or slaves. Nothing in Scripture prevents this.\n \n How the hell was he able to get two of every animal, when undoubtedly there were many which lived only on the other side of the world? \n \n Common misconception. I would like to ask you to read Genesis 6:19-20 just to show you how wrong and flawed your question is. Had you read these verses properly, you would discover that God does not tell Noah to take two of every animal onto the Ark, He tells Noah to take a male and a female of every kind of animal and of every kind of bird, in order to keep them alive (Genesis 6:19-20). Notice the words in bold. Every kind of animal. If you go back to Genesis 1 you will find that God created in different kinds with much capacity for variation within limits. You might ask, what is a kind? The descendants of each of these different kinds, apart from humans, would today mostly be represented by a larger grouping than what is called a species. In many cases, those species descended from a particular original kind would be grouped today within what modern taxonomists call a genus. In other cases the \"kind\" may even be as high as the family. For example, dogs, wolves, coyotes, jackals and dingos are probably descended from a common canine (dog-like) kind. So calculations have shown that Noah would have only had to take on board around 16 000 animals for their anscestors to diversify into the different range of species that we see today (for example, poodles would not have been created in the original dog kind but are a mutant). Likewise, horses, zebras and donkeys are probably descended from an equine (horse-like) kind. So God did not have to save every animal or two of every animal, so if there were any animals on the other side of the world they most likely weren't saved. \n \n Where did he build this ship? \n \n Once again we are not told the small details of where it was built, nor does it matter. The main point is that God judged the world with a Global Flood that only Noah and the animals that they saved survived.\n \n  How did Noah manage to get a pair of tyrannosaurus rex to get onto the boat? How about bronchiasaurs? \n \n What you have to do again is look at the big picture and use logic. Firstly, of the 668 supposed dinosaur genera , only 106 weighed more than ten tonnes when fully grown. Secondly, the Bible does not say that the animals had to be fully-grown. The largest animals were probably represented by \"early teenage\" or even younger specimens. This is also smart, this means that these animals would be at their reproductive prime as they got off the ark. It may seem surprising, but the median size of all the animals on the Ark (including dinosaurs) would most likely have been about the size of a sheep, with 11% being bigger than a sheep. Also, the eggs of even the largest dinosaurs were no bigger than a football - so all young dinosaurs were quite small. The same goes for that bronchiasaurs (not that I have ever heard of it - if it was actually on the Ark). See, no problem?\n \n Polar bears? \n \n No problem, they wouldn't have been on Earth at the time. You have to remember that \"kind\" thing I was talking about. The following article titled Bears Across the World... should help you understand why.\n \n How did he get the world's largest and most dangerous animals to get onto a boat and not kill each other or him? \n \n For God anything is possible. Take the story of Daniel in the lion's den. The LORD protected him from the lion's so they wouldn't bite or be agressive towards Daniel. God could and most likely did try the same thing here on the Ark. It wouldn't be that hard for an all mighty and all powerful God to do.\n \n What happened to the dinosaurs, by the way? I'm curious, because scientists have been scratching their heads over this more years and years. Imagine their surprise when they find out that Christians knew all along! \n \n Yes just imagine their surprise! What happened to the dinosaurs? This is not an overly mysterous and hard question to answer from a Biblical point of view. Observations and the fact that a dinosaur like creature is described in the book of Job, in Aboriginal and Native American cave art. \n \n The basic explaination from a Biblical point of view is this: Dinosaurs first existed around 6,000 years ago. God made the dinosaurs, along with the other land animals, on Day Six of the Creation Week (Genesis 1:20-25, 31). Adam and Eve were also made on day six - so dinosaurs lived at the same time as people, not separated by eons of time. Dinosaurs could not have died out before people appeared, because dinosaurs had not previously existed and death, bloodshed, disease and suffering are a result of Adam's sin (Romans 5:12, 14 for example). \n \n Representatives of all of the kinds of air-breathing land animals, including the dinosaur kinds, went on board Noah's Ark. All those left outside the Ark died in the cataclysmic circumstances of the Flood (including many land/marine/flying dinosaurs that were not on Noah's Ark) - many of their remains became fossils. After the Flood (around 4,500 years ago), the remnant of the land animals, including dinosaurs, came off the Ark and lived in the present world, along with people. Because of sin, the judgments of the Curse and the Flood have greatly changed the Earth. Post-Flood climatic change, lack of food, disease, and man's activities caused many types of animals to become extinct. The dinosaurs, like many other creatures died out. Why the big mystery about dinosaurs?\n \n In support of this (apart from the massive amounts of dinosaur fossils) there have been many observation of dinosaur like-creatures in recent times, including one in Job. What we have to remember is that the term \"dinosaur\" was invented in 1841. So the KVJ and other Bible versions would not have the term dinosaur in it. But is there another word for \"dinosaur\"? There are dragon legends from around the world. Many \"dragon\" descriptions fit the characteristics of specific dinosaurs. Could these actually be accounts of encounters with what we now call dinosaurs? There are passages in the Bible about \"dragons\" that lived on the land: \"he [Nebuchadnezzar] has swallowed me like a dragon\" (Jer. 51:34), \"the dragons of the wilderness\" (Mal. 1:3). Many Biblical creationists believe that in many contexts these could refer to what we no call dinosaurs.\n \n There are many references to sea-dragons, such as Pslam 74:13, Genesis 1:21, Isaiah 27:1. The sea-dragons could have included dinosaur-type animals such as the Mosasaurus. Job 41 describes a great animal that lived in the sea, Leviathan, that even breathed fire. This \"dragon\" may have been something like the mighty 17-metre-long Kronosaurus, or hte 25 metre long Liopleurodon. Isiah 30:6 which says \"...firey flying serpent...\" may be a reference to one of the pterodactyls, such as the Pteranodon, Rhamphorhynchus or Ornithocheirus. Not long after the Flood, God was showing a man called Job how great He was as Creator, by reminding Job of a massive creature He had made:\n \"Behold now behemoth, which I made with you; he eats grass like an ox. See now, his strength is in his loins, and his force is in the muscles of his belly. He moves his tail like a cedar: the sinews of his thighs are knit together. His bones are like tubes of bronze; his limbs are like bars of iron. He is the chief of the ways of God: his maker brings near his sword.\" (Job 40:15-19). \n So what kind of animal was \"behemoth\"? Some people suggest that behemoth was a hippopotamus or an elephant. But we know that the elephant or a hippopotamus was not one of the biggest creatures that God made and hence did not fit the definition of behemoth. Also, this doesn't make sense, since the tail of behemoth is compared to a cedar tree. Now an elephant's tiny tail is quite unlike a cedar tree! Clearly the elephant and the hippo could not possibly be \"behemoth\". No living creature comes close to this description. However, behemoth is very like Brachiosaurus, one of the large dinosaurs.\n \n There have been many stories of people's encounter with dragons. Many displayed in one of the oldest books of British history, \"The Anglo-Saxon Chronicles\". Also, the emblem on hte flage of Wales (U.K.) is a dragon. \n * A Sumerian story dating back to 2,000 BC or more tells of a hero named Gilgamesh, who, when he went to fell cedars in a remote forest, encounted a huge vicious dragon which he slew, cutting off its head as a trophy.\n \n * When Alexander the Great and (330 BC) his soldiers marched in India, they found that the Indians worshipped huge hissing reptiles that they kept in caves.\n \n * China is renowned for its dragon stories, and dragons are prominent on Chinese pottery, embroidery and carvings.\n \n * England has its story of St George, who slew a dragon that lived in a cave.\n \n * There is the story of a 10th century Irishman who wrote of encountering what appears to have been a Stegosaurus.\n \n * In the 1500's, a European scientific book, Historia Animalium, listed several animals that we would call dinosaurs as still alive. A well known naturalist of the time, Ulysses Aldrovandus, recorded an encounter between a peasant named Baptista and a dragon whose description fits that of the small dinosaur Tanystropheus. The encounter was on May 13, 1572, near Bologna in Italy, and the peasant killed the dragon.\n \n * Petroglyphs (drawings carved on rock) of dinosaur-like creatures have also been found all around the Earth by Native peoples [see \"Messages on Stone.\" Creation 19(4):42-43]. For example, an ancient Indian rock drawing like the one of a sauropod dinosaur from White River Canyon, Utah, show that dinosaurs co-existed with man. [Most of the above information came from \"The Answers Book\".]\n \n I think that I have babbled on a little bit too much, and I am sorry for that. Let us move on.\n \n God created the heavens? Why did he do that? Why did he create everything in them? How do you know any of this? Here's a tricky question...where did God come from? \n \n I believe that God created the Heavens and all that in them as the Bible says, out of love. He made us to show and express His love. His love took physical form when He sent Jesus to die for our sins - even though we don't deserve it. In evidence of this, John 3:16 says, \"For God loved the world so much that He gave His only Son, so that everyone who believes in Him may not die but have eternal life.\" The next verse also illustrates God's reason for sending Jesus, John 3:17 sats, \"For God did not send His Son into the world to be its judge, but to be its Savior.\" There are many verses where the Bible declares God's love and His reasons for creating us, i.e. out of love. How do I know any of this? By reading the Bible. I can be very sure that the Bible is the Word of God (see the Mistrust in Religion thread in this forum for Biblical evidence for the existence of a Divine Author of the Bible, curtsey of \"The Answers Book\") through what is written in it.\n \n You tricky question of where did God come from is not all that tricky. It is a good question for genuine thinks to ask. But the Bible defines God as the uncreated (i.e. eternal) Creator of the universe, and what applies within the universe need not apply to God, so the question \"Who created God?\" becomes illogical, just like \"To whom is the bachelor married?\" I could stop here as this answers your question, but I will continue. A more sophisticated questioner might ask, \"If the universe needs a cause, then why doesn't God need a cause? And if God doesn't need a cause, why should the universe need a cause?\" The following reasoning stands up to scruitiny:\n * Everything which has a beginning has a cause.\n * The universe has a beginning.\n * Therefore the universe has a cause.\n \n This is also backed up by Causality (the cause and effect relationship). Something cannot have a cause without having a beginning, i.e. an eternal thing cannot have a cause. From the Law of Causality, the universe requires a cause because it had a beginning - which can be shown by the 1st and 2nd Law of Thermodynamics - as our reasoning above demonstrates. God, unlike the universe, had no beginning, so does not need a cause. In addition, Einstein's general relativity shows that time is linked to matter and space. So time itself would have begun along with matter and space at the beginning of the universe. Since God, by definition, is the Creator of the whole universe, He is the Creator of time. Therefore He is not limited by the time dimension He created, so He has no beginning in time. Therefore He does not have, nor need to have, a cause - which can be shown by the Law of Causality. This law states that one cause can have many effects, but no effect can be quantitatively greater or qualitatively superior to its cause. Observed effects are assumed to have causes because of this law and are not treated as purely random or chance occurrences. As stated above, an eternal being cannot have a cause, i.e. a purpose as it didn't have a start in time. This is in-line with what we observe. Everything in the universe has a cause as they have a beginning.\n \n The universe can be shown to have had a start in time and thus could not have existed forever by applying the 1st and 2nd Law of Thermodynamics. \n 1st Law states: The total amount of mass-energy in the universe is constant.\n 2nd Law states: The amount of energy in the universe available for work is running down, or entropy is increasing to a maximum. To bring entropy down to a layman's level, entropy is a measure of disorder, or of the decreease in usable energy.\n Since the total amount of mass-energy is limited, and the amount of usable energy is decreasing, then the universe cannot have existed forever, otherwise it would already have exhausted all usable energy and reached what is known as \"heat death\" where there would be no further work or processes running. So the best solution is that the universe must have been created with a lot of usable energy and is now running down.\n \n So summing up all the main points of this section:\n * The universe (including time itself) can be shown to have had a beginning.\n * It is unreasonable - by Causality - to believe something could begin to exist without a cause. \n * The universe therefore requires a cause and by the Bible has a cause.\n * God as a creator of time, is outside of tiem and therefore by Causality does not need a cause. And hence, God is eternal and does not violate Causality and was not created by anything higher up.\n \n Why doesn't he simply smite the devil and save people from an eternity of torture?\n \n He will get his share. All what I know is what is displayed in the Bible. But it is made very clear that the devil and co will be done away with in God's time (revealed in Revelation). As for the torture issue? God is a God who gives people free will. Adam in the Garden of Eden used the free will that God gave him to sin and rebell against God. As a result, he was infact saying through his actions that he wanted a life without God, and that he wanted to decide truth and so on idependently of God. When you move away from the only Giver of Life, what do you have? Obviously the opposite to life and happiness is death and suffering. This is what we see. God is letting His creation slip to give man an example of what life will be like Him. In otherwords He is giving us exactly what we asked for, i.e. a life without God. We all sin \"in Adam\" as the Bible says in various spots and as a result we all have a tendency to reject God. God does not incurr on people's free will and as a result does not make them believe in Him. So hence, those who chose not to believe in God obviously want a life without Him (as illustrated in their actions) and as a result they move away from the Life Giver and move into Hell and suffering (since our souls are immoortal) and live their immortal life away from God's presence.\n \n Also, since we are made in the Image of God (Genesis 1:26) we have immortal souls or spirits like God - and our conscious self lives on (or something like that) - and hence we then live for eternity. But the devil and co also have immortal spirits and hence cannot be destoryed (to my knowledge - assumption used) and as a result God will permentaly keep the devil and co out of His presence and put them in Hell. I am not really into this kind of stuff. I would suggest asking a theologian if there is one on here for more help on this issue.\n \n Right now he relies upon flawed books written by human beings in superstitious cultures. \n \n Not only are God's Words in the Bible, but we also see evidences of His existence in His creation through many evidences of design, such as the incrediblely complex DNA coding system - which scientists for the big part don't even understand what the DNA letters in humans mean. And for two, how were the writters of the Bible superstitious? I think you have the wrong word.\n \n How do you know that Christ performed miracles? There is no proof, just the word of superstitious, uneducated people two thousand years ago. Doesn't seem very reliable to me. \n \n How do I know? Through the Bible of course! How do you know that He didn't? You have not even the slightest shread of evidence. Not a single one. Again, the Bible can be shown in many parts to be the work of Divine Inspiration (once again, see \"Mistrust in Religion\" for some points). For two, the Apostles were not uneducated people. For example, Matthew was a tax collector, and Luke was regarded by Sir William Ramsey (highly regarded as one of the greatest archaeologists ever) when talking of the Apostle Luke said, \"Luke is a historian of the first rank ... he should be placed along with the greatest of historians.\" That doesn't sound at all uneducated to me. Once again, superstitious is the wrong word. You need to make up your own mind.\n \n Magic and illusion is the oldest performing art in the world, older than music, older than dance, etc. \n \n Not according to the Bible. In Genesis 4:21 we are told that Jubal was the ancestor of all musicians who play the harp and the flute.\n \n If someone of pretty good skill at this, like a Copperfield or Blaine lived in a culture like the ones back then, and performed tricks while preaching new religions, what effect do you think that would have? \n \n Yeah, I get your point. But it depends on what he was preaching about. Doing what Jesus did as explained through the Apostles goes far beyond magic tricks and illusions. Bringing people back from the dead, healing diseases, restoring sight, etc., is not a magic trick and illusion. Our modern day medical technology cannot even do these.\n \n As always, sorry about the length.", 
   {
    "post_info": {
     "post_title": "Re: Questions about the Bible."
    }
   }, 
   50409, 
   null, 
   1084880760.0
  ], 
  [
   50618, 
   null, 
   "montalban", 
   "We seem to have a lot of people concerned with Noah's flood... both here and on the creation vs atheism (ahem! I mean evolution) debate.\n \n I thought I'd repeat myself ...\n \n I originally posted this at post 14 of \"So, how did they get all those animals on the ark?\" on the creation v evolution threads\n \n \n There are universal elements to the story of the flood...\n \n Sumerian\n In the eleventh tablet of the Semitic Babylonian epic of Gilagamesh is a flood story that is the source for the Noah story. The Gods resolved to cleanse the earth of an overpopulated humanity, but Utnapishtim was warned by the God Ea in a dream. He and some craftsmen built a huge (seven decks encompassing one acre in area) ark. Utnapishtim then loaded it with his family, the craftsmen, and \"the seed of all living creatures.\" The waters rose up, and a storm continued for six days and six nights. The Gods repented and wept upon seeing the global destruction of living beings and stilled the flood on the seventh day. The waters covered everything but the top of the mountain Nisur, where the boat landed. A dove was loosed, but it returned, having found no place to rest. A swallow was sent, but it too returned. Seven days later, after having loosed a raven that did not return to the ark, the people began to emerge. Utnapishtim made a sacrifice to the Gods. He and his wife were given immortality and lived at the end of the earth. \n \n Babylonian\n Three times (every 1200 years), the Gods became distressed by the disturbance from human overpopulation. The Gods dealt with the problem first by plague, then by famine. Both times, the God Enki advised humans to bribe the God causing the problem. The third time, Enlil advised the Gods to destroy all humans with a flood, but Enki had Atrahasis build an ark and so escape. Also on the boat were cattle, wild animals and birds, and the family of Atrahasis. After seeing the suffering caused by the flood, the Gods regretted their action, and Enki established barren women and stillbirth to avoid the problem in the future. \n \n Hebrew\n Based on the Babylonian story with the difference that the flood was a harsh punishment for humanity's sinfulness. Noah was 600 years old when it began to rain for what ended up being 40 days and 40 nights. After the end of 150 days, the waters were abated. The ark rested in the seventh month upon the mountains of Ararat. Waters decreased until the 10th month, on the first day of the 10th month; tops of mountains were also seen. At the end of 40 days, Noah opened the windows of the ark. First, he sent a raven, which went to and fro. He then sent a dove, which returned and hadn't found land. After seven more days, another dove was loosed; it returned that evening with an olive leaf. The next week, the dove didn't return. After a year and 10 days from the start of the flood, every creature emerged from the ark. Noah sacrificed some clean animals and birds to God, and God, pleased with this, promised never again to destroy all living creatures. \n \n Australian\n During the Dreamtime flood, woramba, the Ark Gumana carrying Noah, Aborigines, and animals, drifted south and came to rest in the flood plain of Djilinbadu (about 70 km south of Noonkanbah Station, just south of the Barbwire Range and east of the Worral Range), where it can still be seen today. The white man's claim that it landed in the Middle East was a lie to keep Aborigines in subservience. \n \n Chaldean\n Xisuthrus was warned of a coming flood by the God Chronos, who ordered Xisuthrus to write a history and to build a vessel (5 stadia by 2 stadia) for his relations, friends, and two of every type of animal. After the flood began to subside, he sent out some birds, all of which returned. Upon trying again, the birds returned, their feet covered in mud. On the third trial, the birds didn't return. The people disembarked and offered sacrifices to the Gods. Xisuthrus, his wife, daughter, and the pilot of the ark were eventually transported to live with the Gods. \n \n Zoroastrian\n Ahura Mazda warned Yima that destruction in the form of floods, subsequent to the melting of the snow, was threatening the sinful world and gave him instructions for building a vara in which specimens of small and large cattle, humans, dogs, birds, fires, plants and foods were to be deposited in pairs. \n \n Hindu\n Manu, the first human, saved a small fish from the jaws of a larger fish. After hearing the smaller one beg for protection, Manu kept the fish safe, transferring it to larger and larger containers as it grew, finally returning it to the ocean. \n Because of this kindness, the fish returned to warn Manu about an imminent flood and told him to build a boat, stocking it with samples of every species. After the flood waters rose, Manu tied a rope to the fish's horn. The fish led him to a mountain and told Manu to fasten the ship's rope to a tree so that it would not drift. He stayed on the mountain (known as Manu's Descent) while the flood swept away all living creatures. Manu alone survived. \n \n \n Greco-Roman\n Zeus decided to punish humanity for its evil ways. Other Gods grieved at the destruction because there would be no beings to worship them. Zeus promised a new stock, a race of miraculous origin. He was going to use thunderbolts when he remembered one of Fate's decrees: that a time would come when sea and earth and dome of the sky would blaze up, and the massive structure of the universe would collapse in ruins. With Poseidon's help, he caused storm and earthquake to flood every part of the land except the summit of Mount Parnassus. When Zeus crushed the hanging clouds in his hand, there was a loud crash, and sheets of rain fell from heaven. The rivers began rushing to the sea. When Neptune struck the earth with his trident, the rivers raced across the plains. Sea and earth could no longer be distinguished; all was sea without any shores, covering every living being except for one fortunate couple, Deucalion and Pyrrha. Earlier, Deucalion and Pyrrha had consulted Themis at her oracular shrine. She warned of a future flood, and they prepared by acquiring a boat. In time, their boat ran aground on the summit of Mount Parnassus. (Note: This is the mountain at Delphi, \"navel of the earth\" and home of the great oracle.) \n Recognizing their piety, Zeus allowed them to live and withdrew the waters. It was then that Deucalion and Pyrrha remembered the other oracle given by Themis: to repopulate the world by throwing \"behind you the bones of your great mother.\" Pyrrha didn't want to injure her mother's ghost by disturbing her bones. Prometheus soothed her fears. \"Oracles are righteous and never advise guilty action...\" They decided that the \"bones\" were stones in the body of the earth (\"Great Mother\"). They threw the stones, which became humans; men of the stones thrown by Deucalion; women, of those cast by Pyrrha. Animals were produced by earth of its own volition. According to Plato: \"Many great deluges have taken place during the nine thousand years.\" \n \n \n Jicarilla (Apache)\n Before the Apaches emerged from the underworld, there were other people on the earth. Dios told an old man and old woman that it would rain forty days and nights. People were warned to go to the tops of four mountains (Tsisnatcin, Tsabidzilhi, Becdilhgai, and another whose identity isn't known) and not to look at the flood or sky. The people didn't believe the old couple. When the rains came, only a few people made it to the mountain tops and shut their eyes. Those who looked at the flood turned into fish or frogs; if they looked at the sky, they turned into birds. After eighty days, Dios told the 24 people remaining to open their eyes and come down. These 24 people went into mountains. Eight other people survived the flood who were able to travel by looking where they wanted to go, and they were there. These people told the Apaches about the flood before going into two mountains themselves. Around the turn of the millennium, the surface of the earth will again be destroyed, this time by fire. \n \n Mayan\n God sent the flood because the people made from wood (an early version of humans) had no souls, minds or hearts and had forgotten how they were made. They wanted to escape, but the animals that they had starved and beaten, the pots they had burnt, and the trees they'd stripped refused to help them. Only a few escaped the flood, and it is said that their descendants are monkeys. \n \n Aztec\n In the Valley of Mexico there lived a pious man named Tapi. Creator told him to build a boat to live in, to take his wife and a pair of every animal that existed. Neighbors thought he was crazy. As soon as he finished, it began to rain. The valley flooded; men and animals went to mountains, but they were submerged. The rain ended, waters receded, etc. Tapi realized that the flood waters had receded after having sent a dove that did not return. Tapi rejoiced. \n \n Squamish\n When the Squamish saw the great flood coming, they made a giant canoe and a long rope of cedar fibers with which they fastened the canoe to a giant rock. Into the canoe, they put every baby, a young man and woman to be their guardians, and food and water. The waters rose and drowned everyone else. After several days, the man saw Mount Baker in the distance. He cut the rope and paddled south to it, and made a new home there. The outline of the canoe can still be seen halfway up the slope of Mount Baker. \n \n Skagit\n The Creator made the earth and gave four names for it -- for the sun, waters, soil and forests. He said only a few people, with special preparation for the knowledge, should know all four names, or the world would change too suddenly. After a while, everyone learned the four names. When people started talking to the trees the change came in the form of a flood. When the people saw the flood coming, they made a giant canoe and filled it with five people and a male and female of all plants and animals. Water covered everything but the summit of Kobah and Takobah (Mts. Baker and Ranier). The canoe landed on the prairie. Doquebuth, the new Creator, was born of a couple from the canoe. He delayed getting his spirit powers, but finally did so after his family deserted him. At the direction of the Old Creator, he made people again from the soil and from the bones of the people who lived before the flood. \n \n Mandingo\n A charitable man gave away everything he had. The God Ouende rewarded him with riches, advised him to leave the area, and sent six months of rain to destroy his selfish neighbors. The descendants of the rich man became the present human race. \n \n \"People of Mount Jefferson\"\n Twice, a great flood came. Afraid that another might come, the people made a giant canoe from a big cedar. When they saw a third flood coming, they put the bravest young men and young women in the canoe, with plenty of food. Then the flood, bigger and deeper than the earlier ones, swallowed the land. It rained for many days and nights, but when the clouds finally parted for the third time, the people saw land (Mount Jefferson) and landed on it. When the water receded, they made their home at the base of the mountain. The canoe was turned to stone and can be seen on Mount Jefferson today. \n \n Yakima\n In early times, many people had gone to war with other tribes, but there were still some good people. One of the good men heard from the Land Above that a big water was coming. He told the other good people and decided they would make a dugout boat from the largest cedar they could find. Soon after the canoe was finished, the flood came, filling the valleys and covering the mountains. The bad people were drowned; the good people were saved in the boat. We don't know how long the flood stayed. The canoe can still be seen where it came down on Toppenish Ridge. The earth will be destroyed by another flood if people do wrong a second time. \n \n Caddo\n Four monsters grew large and powerful until they were high enough to touch the sky. One man heard a voice telling him to plant a hollow reed. He did so, and it quickly grew very big. He, his wife, and pairs of all good animals entered the reed. Waters rose to cover everything but the top of the reed and the heads of the monsters. Turtle destroyed the monsters by digging under them and uprooting them. The waters subsided, and winds dried the earth. \n \n Chippewa\n While the medicine man Wis-kay-tchach was hunting, his young wolf was killed by some water lynxes. Wis tried to kill one of the lynxes to get revenge. First, he turned himself into a stump at the edge of a lake. Frogs and snakes tried to pull the stump down, but Wis kept himself upright. The lynx, suspicions lulled, went to sleep. Wis returned to normal shape and, though warned to shoot the lynx's shadow, forgot and shot its body. He shot a second arrow at the shadow, but the lynx escaped into a river, which then overflowed and flooded the whole country. Wis escaped in a canoe. \n \n Navajo\n For their sins, the Gods expelled the Insect People from the first world by sending a wall of water from all directions. The Insect People flew up into the second world. Later, in the fourth world, descendants of these people were likewise punished. They escaped the floodwaters by climbing into a fast-growing reed. Cicada dug an entrance into the fifth world, where people live today. \n \n Hopi\n The people repeatedly became distant from Sotuknang, the creator. Twice he destroyed the world (by fire and by cold) and recreated it while the few people who still lived by the laws of creation took shelter underground with the ants. When people became corrupt and warlike a third time, Sotuknang guided them to Spider Woman, who cut down giant reeds and sheltered the people in the hollow stems. Sotuknang caused a great flood, and the people floated in their reeds for a long time. They emerged after coming to rest on a small piece of land. They still had as much food as they started with. Guided by their inner wisdom (which comes from Sotuknang through the door at the top of their head), the people traveled on, using the reeds as canoes. They went northeast, finding progressively larger islands, until they came to the Fourth World. When they reached it, they saw the islands sink into the ocean. \n http://www.dreamscape.com/morgana/titania.htm\n \n Also see a much more extensive list at \n http://www.talkorigins.org/faqs/flood-myths.html\n But be warned...\n Note that they dismiss this impressive list of the flood by saying \"In most borderline cases, I included the story here anyway. For example, one story (Hopi) tells of a flood which was avoided and never occurred.\"\n BUT in the Hopi myth given above, it says it did occur. AND in the Hopi myth given at Talkorigins it says \"Sotuknang caused a great flood with rain and waves\". So Talkorigins are dismissing these things with no reason, hoping that you'll just believe them.", 
   {
    "post_info": {
     "post_title": "More on the Flood"
    }
   }, 
   50615, 
   null, 
   1084881960.0
  ], 
  [
   50624, 
   null, 
   "sglaine", 
   "I respect your answer, however, for me to give you examples will be a never ending story.\n \n As your assessment is fair, here is a link for starters...\n \n http://members.aol.com/matt103436/Contradictions.htm\n \n As for me giving the bible a cursory glance, you could not be further from the truth. I studied the bible for 17 years. \n \n One of my own personal gripes is with a subject already mentioned by other posters, the flood. Did the flood really occur on a world wide scale as we are led to believe in the bible? \n \n I do not believe this Ark Story. I am in a rush, so this is off the top of my head.....\n \n A Great Flood does create many problems and questions. Some 4.4 billion cubic kilometres of water would have to be added to the oceans for Mount Everest alone to be covered. Put aside a few minor fundamental problems such as the earth having to slow down it's rotation to total rotational decay, where did all this water come from?\n \n The Flood cannot be explained by \"Rainfall\". This would make the air 99.9% water vapor, making the atmospheric pressure 840 times greater than it is today. Any animal with lungs would have died!\n \n In argument with myself, if I try to explain this as the water having come from Tsunamis, ect, then I would have to consider that earth's crust wold have to have been a porocity of 50%, in contrast to the measured figure of 1%, and the temps of crustal rock increases with depth with water temps up to 350 degrees. If this was released in any way to form a \"Great Flood\"........ark travel just might have been a little, let's say, problematic????\n \n If I argue -:Meteor. Mmmmmmm, this is a possibility, but....it would scientifically have to have been equivalent to a 12 trillion megaton nuclear bomb, this equals no earth, which equals no earth to flood! Even if the Meteor theory were plausible, it would leave a high-pressure, oxygen-poor atmosphere of around 6800 degrees. Hardly ideal cruising conditions.\n \n That is what I call a major discrepancy, IMHO, but I am open to ideas and others thoughts.\n \n \n As for God's forgiveness, are Adam and Eve forgiven?\n \n Also-:Matthew 5: 20-22\n 20 For I say unto you, That except your righteousness shall exceed the righteousness of the scribes and Pharisees, ye shall in no case enter into the kingdom of heaven.\n 21 Ye have heard that it was said of them of old time, Thou shalt not kill; and whosoever shall kill shall be in danger of the judgment:\n 22 But I say unto you, That whosoever is angry with his brother without a cause shall be in danger of the judgment: and whosoever shall say to his brother, Raca, shall be in danger of the council: but whosoever shall say, Thou fool, shall be in danger of hell fire.\n \n My personal non belief as to the bible not being an inspired work, does not an atheist make. ;) \n \n ~Anastasia\n Who said I did not believe not the bible? This thread has nothing to do with Atheist. Now you give me passages from the bible that has nothing to do with the ?????? So Lady what is your purpose of your of all of this stuff from the bible are you trying to convert me? So please stick with subject lady.", 
   {}, 
   50413, 
   null, 
   1084885740.0
  ], 
  [
   50630, 
   null, 
   "montalban", 
   "Who said I did not believe not the bible? This thread has nothing to do with Atheist. Now you give me passages from the bible that has nothing to do with the ?????? So Lady what is your purpose of your of all of this stuff from the bible are you trying to convert me? So please stick with subject lady.\n\n \n I would hazard to guess that the good Lady of Bohemia was actually responding to me. But let's not fight over her attentions shall we.*\n emoticon_xhoho\n \n *Call it a hunch, but I guess that when she actually extensively quoted me in her answer, that she was then answering me. emoticon_ic \n \n I also might hope that we two are not on the same side.", 
   {}, 
   50624, 
   null, 
   1084888680.0
  ], 
  [
   55912, 
   null, 
   "Blue", 
   "I don't believe everything in the bible mainly because it wasn't written by God himself. It was written by like 50 different people. How do we know that the people that was writting the bible left stuff out or added things? I do beleive in God but some of that stuff in the bible I don't believe! Blue", 
   {}, 
   50409, 
   null, 
   1088459100.0
  ], 
  [
   55977, 
   null, 
   "emoreno2292", 
   "To sglaine:\n So you are saying is that you believe that miracles happen. So you believe that Noah Ark was big enough for all of his critters. Don't get me wrong I do believe in some of the stuff in the Bible but not all.  \n \n Yes I believe that Jesus did the many miracles as described in the Bible, possibly more. \n \n As for Noah's Ark, that ship was not a small craft by any sense -- it was designed to stay afloat, not for speed or manovourability (damned word). It was an extremely stable ship, in fact, more stable than many modern ships. Noah's Ark was able to hold more than 520 railcars capacity, well able to hold the land animals needed -- about 16,000 land animals the average size of a sheep. These land animals included the dinosaurs (which the Bible tells us was created on Day 6 of the Creation Week along with people). Some people who have done studies on the Ark have determined that there would still be something like 5 trains of 99 cars for food, Noah's family and \"range\" for the animals, and air space. So room for the animals would be no problem!\n \n I believe Jesus died on a cross and realistic stuff like that but I find it hard to believe that he performed miracles. You know stuff that could never be proven. \n \n Are you putting a limit to or on God's powers? For an all powerful God there are no impossibilites. For an all powerful God who created the Heaven's and all that in them in six days, why do you find it so hard to believe that He can't heal a man of disease? Remember that the Son of Man (Jesus) was given God's Authority on Earth. You are correct that we cannot prove that the miracles happened then now, but we can apply some logic. Is healing a man of disease, for example, such a hard thing for an all powerful God who's power knows no limits? The answer is no.\n\n \n Come on now. What about the scientific evidence of the earth's age, and how old the dinosaur bones are, and how old early primate's bones are? Are you going to completely discount that? The fact that dinosaur bones have been dated as millions of years old sort of puts a twist on the ol' \"they lived with humans\" story. Also, if the ark was just that incredibly effing huge, you think we would have found some of it by now? (If someone claims to have found it, could y'all refer me to the link? Many thanks.) It also would be, well, rather tricky to manage to have all of the world's early predators. Also, did it not occur to you that several of the purported dinosaur predators on this purported ark would have been deadly enough even as young animals? (Who here forgot about the raptors of Jurassic Park?) You seem to be making wild guesses and then substituting \"It was a miracle of God\" for a real answer when you get stuck.", 
   {}, 
   50331, 
   null, 
   1088480280.0
  ], 
  [
   55978, 
   null, 
   "emoreno2292", 
   "As for Noah's Ark, that ship was not a small craft by any sense -- it was designed to stay afloat, not for speed or manovourability. \n \n Have you ever been sailing in heavy weather? Or i suppose, in Noah's case, the worst weather that one has ever seen? It would appear that you haven't. When one sails in awful weather, one NEEDS speed and maneuverability in order to avoid being hammered by huge waves and being capsized, sunk, split up, breaking apart, whatever. Just strapping huge floats to any old tub does not guarantee that it will stay afloat.\n \n \nAre you putting a limit to or on God's powers? For an all powerful God there are no impossibilites.\n\n I have asked this question before. Can god create a rock so big he can't lift it? emoticon_idea THINK!", 
   {}, 
   50331, 
   null, 
   1088480820.0
  ], 
  [
   59315, 
   null, 
   "CowboyFromHeLL", 
   "The bible is a book of untruths for the weakest mind.\n The bible is a fictional story based on a true story.", 
   {
    "post_info": {
     "post_title": "bible is fiction"
    }
   }, 
   55978, 
   null, 
   1090516620.0
  ], 
  [
   59336, 
   null, 
   "LogicalFallacy", 
   "The bible is a book of untruths for the weakest mind.\n\n Agreed! But it's also a book of absolute truth for the stronger mind. emoticon_xgood \n \nThe bible is a fictional story based on a true story.\nThe Bible is a factual account of mankinds history and future.\n \n LF,", 
   {}, 
   59315, 
   null, 
   1090527540.0
  ], 
  [
   59380, 
   null, 
   "Big Orn", 
   "Agreed! But it's also a book of absolute truth for the stronger mind. emoticon_xgood \n The Bible is a factual account of mankinds history and future.\n \n LF,\n\n Good one, LogicalFallacy emoticon_xgood \n \n How about let's kick Baptist, Methodist, Catholic, Jehovah Witness, Pentecostal, Episcopal, Lutheran, Bigfoot, Martians, etc. out the door and just say Christian?\n \n Christianity is not a religion. Sounds good to me.\n \n I get confused by all the divisions&#8230;.:)", 
   {}, 
   59336, 
   null, 
   1090541820.0
  ], 
  [
   59386, 
   null, 
   "LogicalFallacy", 
   "Good one, LogicalFallacy emoticon_xgood \n \n How about let's kick Baptist, Methodist, Catholic, Jehovah Witness, Pentecostal, Episcopal, Lutheran, Bigfoot, Martians, etc. out the door and just say Christian?\n \n Christianity is not a religion. Sounds good to me.\n \n I get confused by all the divisions....:)\n\n Your supposed to get confused by all the divisions, that's what they're designed to do, clever huh.\n \n LF,", 
   {
    "unicode_changes_made": true
   }, 
   59380, 
   null, 
   1090543740.0
  ], 
  [
   59798, 
   null, 
   "Big Orn", 
   "Your supposed to get confused by all the divisions, that's what they're designed to do, clever huh.\n \n LF,\n\n Exactly.\n \n ....so, let's do away with them and make the \"master of confusion\" bite his nails. emoticon_xgood", 
   {}, 
   59386, 
   null, 
   1090849560.0
  ], 
  [
   59805, 
   null, 
   "LogicalFallacy", 
   "Exactly.\n \n ....so, let's do away with them and make the \"master of confusion\" bite his nails. emoticon_xgood\n\n Funny you should say that-\n Revelation 17:15-18\n 15 And he says to me: \"The waters that you saw, where the harlot is sitting, mean peoples and crowds and nations and tongues. 16 And the ten horns that you saw, and the wild beast, these will hate the harlot and will make her devastated and naked, and will eat up her fleshy parts and will completely burn her with fire. 17 For God put [it] into their hearts to carry out his thought, even to carry out [their] one thought by giving their kingdom to the wild beast, until the words of God will have been accomplished. 18 And the woman whom you saw means the great city that has a kingdom over the kings of the earth.\"\n \n Harlot = False Religion\n Ten Horns = All Nations of the World\n Wild Beast = United Nations Organization\n \n Or so i've been told. emoticon_xangel \n \n LF,", 
   {
    "unicode_changes_made": true
   }, 
   59798, 
   null, 
   1090854300.0
  ], 
  [
   59920, 
   null, 
   "apathy", 
   "To Ghost:\n You bring up many of the most asked questions about the Christian religion and the Bible - questions to which I know and have the answer. I will answer every single one of your questions one at a time, so this may take some time, so out of curtsey, I would take a little streach first and a coffee or something.\n Let us begin.\n \n How did one man build the ark? Where did he get the materials? \n \n It is important to note before I start answering these questions that the Bible does not mention on how Noah and his family made the Ark (other than the design specifications). So as a result we must think for ourselves and try and interpret what may have happened. You asked how could one man build the Ark. Well, we know that Noah had three sons which would have helped (and they had wifes which also may have helped). But there is not one verse in Scripture that says that Noah couldn't nor didn't hire out workers to help him build it. Also note, Noah and his family (possibly other workers) had about 100 or so years to build the Ark [we get this by comparing the age of Noah when he had his sons - Genesis 5 - to his age when the flood hit - Genesis 7]. As for where they got the materials from? Trees. A lot of trees. We are not told how many trees there were in the environment, but I would suggest that the people would settle around a treeish spot. Also, there is nothing in Scripture that says that they didn't get trees (for wood) from a long distance away. I am not familar with how they actually made the Ark, but lack of trees most likely wouldn't be a problem. \n\n \n You would have to hire quite a workforce working over a period of many years and come up with a technology that does not exist today, which is to build an all-wooden vessel of that size. We couldn't do it today if we tried.\n \n \nHow long did it take him to single-handedly build the world's largest zoo? \n \n Once again we are not told, but we know the time frame we are dealing with. Once again, Noah could have hired out worked labour or slaves. Nothing in Scripture prevents this.\n\n \n Only time prevents this. You would have to have an immense work force working day and night for many years, if not many lifetimes.\n \n \nHow the hell was he able to get two of every animal, when undoubtedly there were many which lived only on the other side of the world? \n \n Common misconception. I would like to ask you to read Genesis 6:19-20 just to show you how wrong and flawed your question is. Had you read these verses properly, you would discover that God does not tell Noah to take two of every animal onto the Ark, He tells Noah to take a male and a female of every kind of animal and of every kind of bird, in order to keep them alive (Genesis 6:19-20). Notice the words in bold. Every kind of animal. If you go back to Genesis 1 you will find that God created in different kinds with much capacity for variation within limits. You might ask, what is a kind? The descendants of each of these different kinds, apart from humans, would today mostly be represented by a larger grouping than what is called a species. In many cases, those species descended from a particular original kind would be grouped today within what modern taxonomists call a genus. In other cases the \"kind\" may even be as high as the family. For example, dogs, wolves, coyotes, jackals and dingos are probably descended from a common canine (dog-like) kind. So calculations have shown that Noah would have only had to take on board around 16 000 animals for their anscestors to diversify into the different range of species that we see today (for example, poodles would not have been created in the original dog kind but are a mutant). Likewise, horses, zebras and donkeys are probably descended from an equine (horse-like) kind. So God did not have to save every animal or two of every animal, so if there were any animals on the other side of the world they most likely weren't saved. \n \n\n This is absurd. Where do you draw the line of \"kind\"? Do you draw the line at our human concept of a kind of animal, ie canine vs. feline, which might be the genus? How about amniote vs. marsupial? or mammal vs. bird? or vertebrate vs. invertebrate? You show me where you draw your line then I'll show you why it would still take a lifetime to fill the ark. Also, it would fill the ark many times over.\n \n \n \nWhere did he build this ship? \n \n Once again we are not told the small details of where it was built, nor does it matter. The main point is that God judged the world with a Global Flood that only Noah and the animals that they saved survived.\n\n \n Small details? It's a huge detail. He couldn't have made it on land then shoved into the water at the beach. He'd need a shipyard at the very least. Then, if the thing could hold itself together in drydock, it would crack apart the minute it tried to support itself.\n \n \n How did Noah manage to get a pair of tyrannosaurus rex to get onto the boat? How about bronchiasaurs? \n \n What you have to do again is look at the big picture and use logic. Firstly, of the 668 supposed dinosaur genera , only 106 weighed more than ten tonnes when fully grown. Secondly, the Bible does not say that the animals had to be fully-grown. The largest animals were probably represented by \"early teenage\" or even younger specimens. This is also smart, this means that these animals would be at their reproductive prime as they got off the ark. It may seem surprising, but the median size of all the animals on the Ark (including dinosaurs) would most likely have been about the size of a sheep, with 11% being bigger than a sheep. Also, the eggs of even the largest dinosaurs were no bigger than a football - so all young dinosaurs were quite small. The same goes for that bronchiasaurs (not that I have ever heard of it - if it was actually on the Ark). See, no problem?\n\n \n Supposedly the dinos weren't on the ark. Besides you are still trying to fit millions of animals (don't forget the plants and fungi) onto a boat the size of the titanic. Ain't gonna fit, no way no how.\n \n\n Polar bears? \n \n No problem, they wouldn't have been on Earth at the time. You have to remember that \"kind\" thing I was talking about. The following article titled Bears Across the World... should help you understand why.\n\n emoticon_rolleyes emoticon_rolleyes emoticon_rolleyes emoticon_rolleyes \n \n \n \nHow did he get the world's largest and most dangerous animals to get onto a boat and not kill each other or him? \n \n For God anything is possible. Take the story of Daniel in the lion's den. The LORD protected him from the lion's so they wouldn't bite or be agressive towards Daniel. God could and most likely did try the same thing here on the Ark. It wouldn't be that hard for an all mighty and all powerful God to do.\n\n \n emoticon_rolleyes Then why did he need a wooden boat?\n \n \nWhat happened to the dinosaurs, by the way? I'm curious, because scientists have been scratching their heads over this more years and years. Imagine their surprise when they find out that Christians knew all along! \n \n Yes just imagine their surprise! What happened to the dinosaurs? This is not an overly mysterous and hard question to answer from a Biblical point of view. Observations and the fact that a dinosaur like creature is described in the book of Job, in Aboriginal and Native American cave art. \n \n The basic explaination from a Biblical point of view is this: Dinosaurs first existed around 6,000 years ago. God made the dinosaurs, along with the other land animals, on Day Six of the Creation Week (Genesis 1:20-25, 31). Adam and Eve were also made on day six - so dinosaurs lived at the same time as people, not separated by eons of time. Dinosaurs could not have died out before people appeared, because dinosaurs had not previously existed and death, bloodshed, disease and suffering are a result of Adam's sin (Romans 5:12, 14 for example). \n \n Representatives of all of the kinds of air-breathing land animals, including the dinosaur kinds, went on board Noah's Ark. All those left outside the Ark died in the cataclysmic circumstances of the Flood (including many land/marine/flying dinosaurs that were not on Noah's Ark) - many of their remains became fossils. After the Flood (around 4,500 years ago), the remnant of the land animals, including dinosaurs, came off the Ark and lived in the present world, along with people. Because of sin, the judgments of the Curse and the Flood have greatly changed the Earth. Post-Flood climatic change, lack of food, disease, and man's activities caused many types of animals to become extinct. The dinosaurs, like many other creatures died out. Why the big mystery about dinosaurs?\n \n In support of this (apart from the massive amounts of dinosaur fossils) there have been many observation of dinosaur like-creatures in recent times, including one in Job. What we have to remember is that the term \"dinosaur\" was invented in 1841. So the KVJ and other Bible versions would not have the term dinosaur in it. But is there another word for \"dinosaur\"? There are dragon legends from around the world. Many \"dragon\" descriptions fit the characteristics of specific dinosaurs. Could these actually be accounts of encounters with what we now call dinosaurs? There are passages in the Bible about \"dragons\" that lived on the land: \"he [Nebuchadnezzar] has swallowed me like a dragon\" (Jer. 51:34), \"the dragons of the wilderness\" (Mal. 1:3). Many Biblical creationists believe that in many contexts these could refer to what we no call dinosaurs.\n \n There are many references to sea-dragons, such as Pslam 74:13, Genesis 1:21, Isaiah 27:1. The sea-dragons could have included dinosaur-type animals such as the Mosasaurus. Job 41 describes a great animal that lived in the sea, Leviathan, that even breathed fire. This \"dragon\" may have been something like the mighty 17-metre-long Kronosaurus, or hte 25 metre long Liopleurodon. Isiah 30:6 which says \"...firey flying serpent...\" may be a reference to one of the pterodactyls, such as the Pteranodon, Rhamphorhynchus or Ornithocheirus. Not long after the Flood, God was showing a man called Job how great He was as Creator, by reminding Job of a massive creature He had made:\n \"Behold now behemoth, which I made with you; he eats grass like an ox. See now, his strength is in his loins, and his force is in the muscles of his belly. He moves his tail like a cedar: the sinews of his thighs are knit together. His bones are like tubes of bronze; his limbs are like bars of iron. He is the chief of the ways of God: his maker brings near his sword.\" (Job 40:15-19). \n So what kind of animal was \"behemoth\"? Some people suggest that behemoth was a hippopotamus or an elephant. But we know that the elephant or a hippopotamus was not one of the biggest creatures that God made and hence did not fit the definition of behemoth. Also, this doesn't make sense, since the tail of behemoth is compared to a cedar tree. Now an elephant's tiny tail is quite unlike a cedar tree! Clearly the elephant and the hippo could not possibly be \"behemoth\". No living creature comes close to this description. However, behemoth is very like Brachiosaurus, one of the large dinosaurs.\n \n There have been many stories of people's encounter with dragons. Many displayed in one of the oldest books of British history, \"The Anglo-Saxon Chronicles\". Also, the emblem on hte flage of Wales (U.K.) is a dragon. \n * A Sumerian story dating back to 2,000 BC or more tells of a hero named Gilgamesh, who, when he went to fell cedars in a remote forest, encounted a huge vicious dragon which he slew, cutting off its head as a trophy.\n \n * When Alexander the Great and (330 BC) his soldiers marched in India, they found that the Indians worshipped huge hissing reptiles that they kept in caves.\n \n * China is renowned for its dragon stories, and dragons are prominent on Chinese pottery, embroidery and carvings.\n \n * England has its story of St George, who slew a dragon that lived in a cave.\n \n * There is the story of a 10th century Irishman who wrote of encountering what appears to have been a Stegosaurus.\n \n * In the 1500's, a European scientific book, Historia Animalium, listed several animals that we would call dinosaurs as still alive. A well known naturalist of the time, Ulysses Aldrovandus, recorded an encounter between a peasant named Baptista and a dragon whose description fits that of the small dinosaur Tanystropheus. The encounter was on May 13, 1572, near Bologna in Italy, and the peasant killed the dragon.\n \n * Petroglyphs (drawings carved on rock) of dinosaur-like creatures have also been found all around the Earth by Native peoples [see \"Messages on Stone.\" Creation 19(4):42-43]. For example, an ancient Indian rock drawing like the one of a sauropod dinosaur from White River Canyon, Utah, show that dinosaurs co-existed with man. [Most of the above information came from \"The Answers Book\".]\n \n I think that I have babbled on a little bit too much, and I am sorry for that. Let us move on.\n \n God created the heavens? Why did he do that? Why did he create everything in them? How do you know any of this? Here's a tricky question...where did God come from? \n \n I believe that God created the Heavens and all that in them as the Bible says, out of love. He made us to show and express His love. His love took physical form when He sent Jesus to die for our sins - even though we don't deserve it. In evidence of this, John 3:16 says, \"For God loved the world so much that He gave His only Son, so that everyone who believes in Him may not die but have eternal life.\" The next verse also illustrates God's reason for sending Jesus, John 3:17 sats, \"For God did not send His Son into the world to be its judge, but to be its Savior.\" There are many verses where the Bible declares God's love and His reasons for creating us, i.e. out of love. How do I know any of this? By reading the Bible. I can be very sure that the Bible is the Word of God (see the Mistrust in Religion thread in this forum for Biblical evidence for the existence of a Divine Author of the Bible, curtsey of \"The Answers Book\") through what is written in it.\n \n You tricky question of where did God come from is not all that tricky. It is a good question for genuine thinks to ask. But the Bible defines God as the uncreated (i.e. eternal) Creator of the universe, and what applies within the universe need not apply to God, so the question \"Who created God?\" becomes illogical, just like \"To whom is the bachelor married?\" I could stop here as this answers your question, but I will continue. A more sophisticated questioner might ask, \"If the universe needs a cause, then why doesn't God need a cause? And if God doesn't need a cause, why should the universe need a cause?\" The following reasoning stands up to scruitiny:\n * Everything which has a beginning has a cause.\n * The universe has a beginning.\n * Therefore the universe has a cause.\n \n This is also backed up by Causality (the cause and effect relationship). Something cannot have a cause without having a beginning, i.e. an eternal thing cannot have a cause. From the Law of Causality, the universe requires a cause because it had a beginning - which can be shown by the 1st and 2nd Law of Thermodynamics - as our reasoning above demonstrates. God, unlike the universe, had no beginning, so does not need a cause. In addition, Einstein's general relativity shows that time is linked to matter and space. So time itself would have begun along with matter and space at the beginning of the universe. Since God, by definition, is the Creator of the whole universe, He is the Creator of time. Therefore He is not limited by the time dimension He created, so He has no beginning in time. Therefore He does not have, nor need to have, a cause - which can be shown by the Law of Causality. This law states that one cause can have many effects, but no effect can be quantitatively greater or qualitatively superior to its cause. Observed effects are assumed to have causes because of this law and are not treated as purely random or chance occurrences. As stated above, an eternal being cannot have a cause, i.e. a purpose as it didn't have a start in time. This is in-line with what we observe. Everything in the universe has a cause as they have a beginning.\n \n The universe can be shown to have had a start in time and thus could not have existed forever by applying the 1st and 2nd Law of Thermodynamics. \n 1st Law states: The total amount of mass-energy in the universe is constant.\n 2nd Law states: The amount of energy in the universe available for work is running down, or entropy is increasing to a maximum. To bring entropy down to a layman's level, entropy is a measure of disorder, or of the decreease in usable energy.\n Since the total amount of mass-energy is limited, and the amount of usable energy is decreasing, then the universe cannot have existed forever, otherwise it would already have exhausted all usable energy and reached what is known as \"heat death\" where there would be no further work or processes running. So the best solution is that the universe must have been created with a lot of usable energy and is now running down.\n \n So summing up all the main points of this section:\n * The universe (including time itself) can be shown to have had a beginning.\n * It is unreasonable - by Causality - to believe something could begin to exist without a cause. \n * The universe therefore requires a cause and by the Bible has a cause.\n * God as a creator of time, is outside of tiem and therefore by Causality does not need a cause. And hence, God is eternal and does not violate Causality and was not created by anything higher up.\n \n\n This is WAY too long to refute point by point in five minutes, but let me just say that the laws of thermodynamics say nothing about the universe having a beginning or not.\n \n \n \n \nRight now he relies upon flawed books written by human beings in superstitious cultures. \n \n Not only are God's Words in the Bible, but we also see evidences of His existence in His creation through many evidences of design, such as the incrediblely complex DNA coding system - which scientists for the big part don't even understand what the DNA letters in humans mean. And for two, how were the writters of the Bible superstitious? I think you have the wrong word.\n\n \n Scientists know exactly what the DNA \"letters\" mean. Pick up any high-school biology book. \n \n They were superstitious in that they believed that if you didn't sacrifice an animal at an altar they would be smitten, or bad things would happen. Now, the superstition goes \"If you don't want to go to hell, worship Jesus\" . That is the precisely RIGHT word, superstition.\n \n \nHow do you know that Christ performed miracles? There is no proof, just the word of superstitious, uneducated people two thousand years ago. Doesn't seem very reliable to me. \n \n How do I know? Through the Bible of course! How do you know that He didn't? You have not even the slightest shread of evidence. Not a single one. Again, the Bible can be shown in many parts to be the work of Divine Inspiration (once again, see \"Mistrust in Religion\" for some points). For two, the Apostles were not uneducated people. For example, Matthew was a tax collector, and Luke was regarded by Sir William Ramsey (highly regarded as one of the greatest archaeologists ever) when talking of the Apostle Luke said, \"Luke is a historian of the first rank ... he should be placed along with the greatest of historians.\" That doesn't sound at all uneducated to me. Once again, superstitious is the wrong word. You need to make up your own mind.\n\n \n How do I know Bush isn't lying? Because Bush said he warn't.", 
   {
    "post_info": {
     "post_title": "i know this post is old but i couldn't let it lie there"
    }
   }, 
   50615, 
   null, 
   1090890360.0
  ], 
  [
   59967, 
   null, 
   "mizmaxx", 
   "It is a lazy arguer who would do a web-site search of 'Bible contradictions' and just post these without any critical thinking or analysis of the evidence. It bespeaks of a mind poisoned with hate, willing to pour out derision upon Christ.\n\n Je sens le sens du déjà-vu.....\n \n I guess anyone who questions Christianity is anti-Christian. emoticon_rolleyes \n \n \nI originally posted this at post 14 of \"So, how did they get all those animals on the ark?\" on the creation v evolution threads (...)There are universal elements to the story of the flood...\n\n I also responded on that thread that there tons of Cinderella-type stories from all over the world- does this mean that Cinderella really, truly existed, and got to marry the handsome Prince? \n \n \nAll of these are Cinderella-type stories. Does this mean that some ancient Cinderella traveled the world, reenacting her life and rescue by the prince over and over? I doubt it. More probably, this story is some sort of Jungian archetype that resonates with people in many human societies.\nSee full post here \n \n \nScientists know exactly what the DNA \"letters\" mean. Pick up any high-school biology book. \n\n Perhaps he doesn't mean the D-N-A, but the A-T-C-G. Although somebody oughta tell him that there aren't actually little tiny As and Ts and Cs and Gs inside us.... I think he's referring to the 20% of DNA that scientists don't yet understand the function of...", 
   {}, 
   59920, 
   null, 
   1090912260.0
  ], 
  [
   59998, 
   null, 
   "apathy", 
   "you mean \"Junk DNA\" ? I think it's more than 20%, more like 95%\n \n http://en.wikipedia.org/wiki/Junk_DNA\n http://www.eurekalert.org/pub_releases/2004-06/hms-jdy052804.php\n http://www.newscientist.com/news/news.jsp?id=ns99995063\n \n I don't think that's what the poster was referring to, i really think he/she was ignorant of what scientists really know.\n \n Basically, the fact that its there points me in the direction of evolution. Also the fact that there are conserved regions of DNA within codons AND exons points me toward evolution as the explanation.\n \n \n OH, now I see! Of course they know what their own acronym stands for. They also know why they named the bases A (adenine) G (guanine) T (thymine) C (cytosine) U (uracil). They named them when they were discovered. I think the poster was saying they don't know how they work, which is quite false. Of course, the mechanism of protein transcription has been known for quite some time.", 
   {}, 
   59967, 
   null, 
   1090955760.0
  ], 
  [
   60561, 
   null, 
   "mizmaxx", 
   "you mean \"Junk DNA\" ? I think it's more than 20%, more like 95%\n\n Yes, I meant the 20% has known functions, 80% \"junk\". 80-95, whatever. \n \n \nI think the poster was saying they don't know how they work, which is quite false. Of course, the mechanism of protein transcription has been known for quite some time.\n\n Frankly, I don't really think it was clear what the post was saying, it sounded like something overheard on a Creationism forum.", 
   {}, 
   59998, 
   null, 
   1091341200.0
  ], 
  [
   60572, 
   null, 
   "montalban", 
   "It is a lazy arguer who would do a web-site search of 'Bible contradictions' and just post these without any critical thinking or analysis of the evidence. It bespeaks of a mind poisoned with hate, willing to pour out derision upon Christ. \n\n \nJe sens le sens du déjà-vu.....\n\n Ni thuigim tu, a'Mhizmaxx\n \n But before we start speaking languages the other doesn't understand...\n Let's just see the full quote\n \nIf I can add a few more points, having just had a nice break for dinner.\n Claim:\n Matthew 7:21 Jesus says not everyone that calls the name of the Lord shall be saved VS. Acts 2:21 Paul says whosoever shall call on the name of the Lord shall be saved.\n Rebuttal:\n Acts 2:21 is not spoken by Paul, but by Peter. He is not saying what 'is', as Jesus did, but what was said people would say.\n Claim:\n Acts 9:7 VS. Acts 22:9 VS. Acts 26:14\n Paul of Tarsus lies each time he tells the story of meeting Jesus on the road to Damascus. Paul, a liar, wrote over half of the New Testament. The Apostles considered his preachings falsehood.\n Rebuttal\n What is it that is contradictory? All deal with Saul (as Paul was known) heading on the road to Damascus, meeting Jesus, and realising he should stop persecuting the Church.\n It is a lazy arguer who would do a web-site search of 'Bible contradictions' and just post these without any critical thinking or analysis of the evidence. It bespeaks of a mind poisoned with hate, willing to pour out derision upon Christ.\n\n Ah, Mizmaxx, nice of you to defend someone who merely did a lame search of the web, and didn't check all her own sources. Sounds a bit like you on the defence of Muhammad! :)\n \nI guess anyone who questions Christianity is anti-Christian.\n\n Even in this post you do straw-man. I think that anyone who so consistently questions Christianity, who states that they hate the single largest Christian group, then yes, I would consider you Mizmaxx, anti-Christian. Even your own Grand-mother who's Catholic get called 'brain-washed' And yet whilst you call the Pope a ****-head, you defend Muhammad sleeping with a nine year old girl. And, this very same person tells everyone else to but out of her spirituality - acting as spokesperson for it, whilst happily criticising everyone else's, well, that's just you, hey?\n I guess anyone who just re-posts anti-Christian guff without actually checking out the claims first, is also anti-Christian.\n \n\n I originally posted this at post 14 of \"So, how did they get all those animals on the ark?\" on the creation v evolution threads (...)There are universal elements to the story of the flood... \n\n \nI also responded on that thread that there tons of Cinderella-type stories from all over the world- does this mean that Cinderella really, truly existed, and got to marry the handsome Prince? \n\n \n SO are you saying that those flood stories from native American Indians are just a load of cr*p? I knew we couldn't rely on those funny red-men and their quaint myths. Isn't that odd that you'd debunk your own culture too! How sad.\n \n Are you saying that there was no grain of truth to the Cinderella-type story? How do you know that this too isn't part of 'racial memory'? I'd like to see your theory on why it's not true.\n \n Oddly enough, some people's lives are described as \"a Modern Day Cinderella Story\" so obviously they don't exist because their lives parallel a mere fable!\n \n Lastly, why are you responding to something I wrote two months ago? Are you going through all my posts to respond to them? I'm flattered :) Have I upset you or something?", 
   {}, 
   59967, 
   null, 
   1091351760.0
  ], 
  [
   60643, 
   null, 
   "mizmaxx", 
   "But before we start speaking languages the other doesn't understand...\n\n I figured you would know what déjà-vu was, but I guess not. It's the experience of seeming to have seen something before. For example, someone makes a point about anything negative about anything to do with Christianity, and instead of addressing their points, you call them \"anti-Christian\".\n \n \nSO are you saying that those flood stories from native American Indians are just a load of cr*p? I knew we couldn't rely on those funny red-men and their quaint myths. Isn't that odd that you'd debunk your own culture too! How sad.\n\n How quickly you reveal your true feelings. Just because something is a myth does not mean it is \"a load of cr*p\". \"Cinderella\" stories, as I've said before, must serve some purpose as an archetypal myth- that doesn't mean we are to take them as historical. \n \n Besides, have you considered the distinct possibility that a lot of places have been flooded quite seperately? That does not mean there was a global flood, for one thing because it is geologically a disproven thesis.\n \n \nLastly, why are you responding to something I wrote two months ago? Are you going through all my posts to respond to them?\n\n Er, no. Someone posted recently, and I read the former posts to see what they were referring to. I didn't notice until later that they were so old.", 
   {}, 
   60572, 
   null, 
   1091424960.0
  ], 
  [
   60652, 
   null, 
   "montalban", 
   "But before we start speaking languages the other doesn't understand... \n\n \nI figured you would know what déjà-vu was, but I guess not. \n\n Even here you do the old false re-construction. I know what déjà-vu means. But you said...\n \nJe sens le sens du déjà-vu\n\n Am I expected to know what the sentence means? I don't. Are you aware of the difference between a foreign phrase that's entered into English and an entire sentence in another language, albeit a sentence of six words? (show me the standard English dictionary that contains....Je sens le sens du déjà-vu) (I entered the phrase as you wrote it into the ithaki.net search engine and got zero results)\n But then I suppose you mistake affectation for argument. I don't like people who insert foreign words into English anyway, just to sound impressive. English is a perfectly adequate language that has a je nai sai quois that the other languages don't have. :)\n Do you know what this means....? (without consulting anyone else?).\n \nNi thuigim tu, a'Mhizmaxx\n\n An bhful Gaeilge agat, a'Mhizmaxx? Ta tuigim e. Ca bhfios Francach?\n \n It's the experience of seeming to have seen something before.\n\n That's deja-vu, not the whole sentence.\n \n For example, someone makes a point about anything negative about anything to do with Christianity, and instead of addressing their points, you call them \"anti-Christian\".\n\n Ah, the re-constructed argument, with just a bit of the old head in the sand too.\n See.\n \nClaim:\n Matthew 7:21 Jesus says not everyone that calls the name of the Lord shall be saved VS. Acts 2:21 Paul says whosoever shall call on the name of the Lord shall be saved.\n Rebuttal:\n Acts 2:21 is not spoken by Paul, but by Peter. He is not saying what 'is', as Jesus did, but what was said people would say.\n Claim:\n Acts 9:7 VS. Acts 22:9 VS. Acts 26:14\n Paul of Tarsus lies each time he tells the story of meeting Jesus on the road to Damascus. Paul, a liar, wrote over half of the New Testament. The Apostles considered his preachings falsehood.\n Rebuttal\n What is it that is contradictory? All deal with Saul (as Paul was known) heading on the road to Damascus, meeting Jesus, and realising he should stop persecuting the Church.\n It is a lazy arguer who would do a web-site search of 'Bible contradictions' and just post these without any critical thinking or analysis of the evidence. It bespeaks of a mind poisoned with hate, willing to pour out derision upon Christ.\n\n It does contain rebuttal - reasons why they are wrong. Obviously you just pretend it doesn't exist.\n That's the head in the sand part. Now for the false assertion... JWs such as Richard, XQuesTypos, born against such as E-faith, unclassifieds such as Jitobear, Catholics such as Maximus and Parcum, all of these, I disagree with in differencing degrees, but I don't call them anti-Christian. The person you defended, and it's laughable that you would so doggedly defend them, simply cited a site that spouts off a whole list of so-called Biblical contradictions and\n a) pretends this is a debate\n b) ignores the fatal flaws of this type of argument -namely of not researching it for themselves.\n Look at what you say...\n Catholics brain-washed your grand-ma\n The Pope's a ****-head\n Catholics teach hate\n Catholic teaching is sexist\n AND YET\n you claim you're not anti-Christian :p (how pedantic a back peddlar are you!) That's hysterical. No wonder you're so twisted!\n \nSO are you saying that those flood stories from native American Indians are just a load of cr*p? I knew we couldn't rely on those funny red-men and their quaint myths. Isn't that odd that you'd debunk your own culture too! How sad. \n\n \nHow quickly you reveal your true feelings. Just because something is a myth does not mean it is \"a load of cr*p\". \"Cinderella\" stories, as I've said before, must serve some purpose as an archetypal myth- that doesn't mean we are to take them as historical. \n\n I'm being ironical\n Secondly I believe I respect these stories more than you do.\n You are the one who is underming their value by removing from them any real truth - in this case a historical truth -to mere personal value stories... simply based on the fact that they're universal. How strange!\n (note, my username comes from myth). I have a great love of these and your argument is akin to one put forward by someone who in the thread \"So, how did they get all those animals on the ark?\" on the Evolution debate tried to debunk myths simply because the Trojan war contained 'gods' - his theory was simply because some of the myth is not possible, all of it is not possible. Yours is, because some of the myth has commonality with myths in other cultures, it is devoid of any real historical value. Non sequiter.\n For reference...\n \"So, how did they get all those animals on the ark?\" thread\n post 17\n \nIf the Trojan War really happened, then according to an extension of the \"logic\" employed by creationists, the the Greek Gods must have been real.\n\n By your extension, that the fact that cinderella type stories have emerged, no one really has ever had a cinderella-type life - even in the modern era. I have suggested that there can be modern 'cinderella-type stories' and by extension of the reality in our known environment - that is, that these type of lives happen now, they could well have happened in the past. You deny this.\n \n Besides, have you considered the distinct possibility that a lot of places have been flooded quite separately? That does not mean there was a global flood, for one thing because it is geologically a disproven thesis.\n\n You're making an assumption that the miracle of the flood is dependant on scientific evidence. I don't base my religious faith on that which is proved by science.\n \nLastly, why are you responding to something I wrote two months ago? Are you going through all my posts to respond to them? \n\n \nEr, no. Someone posted recently, and I read the former posts to see what they were referring to. I didn't notice until later that they were so old.\n\n Yeah, right!\n \n \n \n \n 'Cause I'm nice.. . I give you...\n \n An bhful Gaeilge agat, a'Mhizmaxx? Ta tuigim e. Ca bhfios Francach?\n Do you know (Irish) Gaelic, Mizmaxx? I understand it. How do you know French?", 
   {}, 
   60643, 
   null, 
   1091443800.0
  ], 
  [
   61418, 
   null, 
   "mizmaxx", 
   "Am I expected to know what the sentence means? I don't. \n\n Well, all it means is \"I feel déjà-vu\".\n \n I entered the fragment \"Je sens le sens\" to Babelfish, and it translated it \"I feel the direction\", which would have given you a basic idea, had you really wanted to know.\n \n \nEnglish is a perfectly adequate language that has a je nai sai quois that the other languages don't have. :)\n Do you know what this means....? (without consulting anyone else?).\n\n If you mean \"je ne sais quoi\", yes of course. It mean \"I don't know what\", and is usually used to descibe an unnameable element. \n \n There's nothing wrong with English per se. I just happen to have been brought up multi-lingually, like many people. I also live in a predominantly multi-lingual area. As a consequence, it isn't easy for me to stick to a single language.\n \n \nAn bhful Gaeilge agat, a'Mhizmaxx? Ta tuigim e. Ca bhfios Francach?Do you know (Irish) Gaelic, Mizmaxx? I understand it. How do you know French?\n\n Nope, not yet. I know French because part of my family are francophone, having been colonized by the French. \n \n \nThe person you defended, (...)simply cited a site that spouts off a whole list of so-called Biblical contradictions and\n a) pretends this is a debate\n b) ignores the fatal flaws of this type of argument -namely of not researching it for themselves.\n\n All they did was quote someone else. That's not \"fatally flawed\", nor is it \"not research\". It's quoting.\n \n \nAND YET\n you claim you're not anti-Christian\n\n I understand that any kind of subtlety is beyond you. However, for the rest of us, the world is not full-contrast black and white.\n \n \nI'm being ironical(sic)\n\n As I said, I found it very revealing.\n \n \nYou are the one who is underming their value by removing from them any real truth - in this case a historical truth -to mere personal value stories... simply based on the fact that they're universal.\n\n I just don't happen to equate historicity with \"truth\", the way you seem to. Besides, I was not arguing that universality made them unhistorical. I was arguing that commonality does not prove historicity.\n \n \nBy your extension, that the fact that cinderella type stories have emerged, no one really has ever had a cinderella-type life - even in the modern era.\n\n Where do you get this stuff from? \n \n \nYou're making an assumption that the miracle of the flood is dependant on scientific evidence. I don't base my religious faith on that which is proved by science.\n\n And yet you find it personally insulting (even warranting \"counter\"-attack) when people comment on the fact that your faith is not supported by science. How very inconsistant. \n \n Either you are trying to prove the historicity of something, or you aren't. If you wish to argue that the flood (or Jesus) is (are) historical, then they are subject to historical investigations. When these historical investigations uncover not only a lack of evidence for your claims, but a mountain of evidence to the contrary, you turn around and say that your faith is not dictated by petty considerations such as evidence. Which is it?", 
   {}, 
   60652, 
   null, 
   1091955360.0
  ], 
  [
   61423, 
   null, 
   "montalban", 
   "Am I expected to know what the sentence means? I don't. \n\n \nWell, all it means is \"I feel déjà-vu\".\n I entered the fragment \"Je sens le sens\" to Babelfish, and it translated it \"I feel the direction\", which would have given you a basic idea, had you really wanted to know.\n\n You mean I'm supposed to know what Bablefish is? I don't. So 'had I really wanted to know' I'd have asked you, which I did, but you just tried a cheap-shot.\n \n English is a perfectly adequate language that has a je nai sai quois that the other languages don't have. \n Do you know what this means....? (without consulting anyone else?). \n\n \nIf you mean \"je ne sais quoi\", yes of course. It mean \"I don't know what\", and is usually used to descibe an unnameable element.\n\n It was an attempt at irony which is not easy for you north Americans to understand.\n \n There's nothing wrong with English per se. I just happen to have been brought up multi-lingually, like many people. I also live in a predominantly multi-lingual area. As a consequence, it isn't easy for me to stick to a single language.\n\n Good for you.\n \nThe person you defended, (...)simply cited a site that spouts off a whole list of so-called Biblical contradictions and\n a) pretends this is a debate\n b) ignores the fatal flaws of this type of argument -namely of not researching it for themselves.\n\n \nAll they did was quote someone else. That's not \"fatally flawed\", nor is it \"not research\". It's quoting.\n\n It is fatally flawed if they rely on it. But at least you now tacitly acknowledge that I actually debated them back.\n \nAND YET\n you claim you're not anti-Christian \n\n \nI understand that any kind of subtlety is beyond you. However, for the rest of us, the world is not full-contrast black and white.\n\n Yet you don't understand irony.\n \nI'm being ironical(sic) \n\n \nAs I said, I found it very revealing.\n\n As I found your stance - where-by you so easily dismiss native myths.\n \nYou are the one who is underming their value by removing from them any real truth - in this case a historical truth -to mere personal value stories... simply based on the fact that they're universal.\n\n \nI just don't happen to equate historicity with \"truth\", the way you seem to. Besides, I was not arguing that universality made them unhistorical. I was arguing that commonality does not prove historicity.\n\n No, you suggest that the only real truth is 'subjective' that there's no objective/historical basis for the myths. You lessen the value of the myth by saying that it's only real to the people who believe.\n \n By your extension, that the fact that cinderella type stories have emerged, no one really has ever had a cinderella-type life - even in the modern era. \n\n \nWhere do you get this stuff from? \n\n From you, it's your logic. You argue that the Cinderella myth is not historically based on reality, simply because many peoples have similar myths; in an effort to debunk the Noachian flood along the same lines. I have suggested\n a) that myths are based in fact\n b) this one is because we know people live it now.\n \n You're making an assumption that the miracle of the flood is dependant on scientific evidence. I don't base my religious faith on that which is proved by science. \n\n \nAnd yet you find it personally insulting (even warranting \"counter\"-attack) when people comment on the fact that your faith is not supported by science. How very inconsistant. \n\n Do I? I find it insulting that people like you pretend to be in favour of native spirituality, then in order to attack my 'myths' attack all myths, including your own - for the Nohaican type flood is to be found in Native American mythology. Such is your hate for Christianity. I also find it pathetic that someone would simply recite a web-page of anti-Christian guff without actually testing it out... in a similar vein you quoted from Islamic sources on another post that actually support my argument - such is your eagerness to attack Christianity.\n \n Either you are trying to prove the historicity of something, or you aren't. If you wish to argue that the flood (or Jesus) is (are) historical, then they are subject to historical investigations. When these historical investigations uncover not only a lack of evidence for your claims, but a mountain of evidence to the contrary, you turn around and say that your faith is not dictated by petty considerations such as evidence. Which is it?\n\n Why must something 'historical' also be 'scientific'?", 
   {}, 
   61418, 
   null, 
   1091969340.0
  ], 
  [
   61477, 
   null, 
   "thebootfitter", 
   "Why must something 'historical' also be 'scientific'?\n\n If I may...\n Because if something actually happened in the history of this physical realm, then there is the possibility that there exists physical evidence of the event(s). If there is a lack of evidence for something for which there should be evidence, there is sufficient reason to question whether the event(s) actually occurred in the history of this physical realm. If there is, in fact, evidence that negates the possibility of the event(s), then there is 'scientific' evidence that said 'historical' event(s) did not actually occur.", 
   {}, 
   61423, 
   null, 
   1092015420.0
  ], 
  [
   61512, 
   null, 
   "montalban", 
   "If I may...\n Because if something actually happened in the history of this physical realm, then there is the possibility that there exists physical evidence of the event(s). If there is a lack of evidence for something for which there should be evidence, there is sufficient reason to question whether the event(s) actually occurred in the history of this physical realm. If there is, in fact, evidence that negates the possibility of the event(s), then there is 'scientific' evidence that said 'historical' event(s) did not actually occur.\n\n \n There is different 'evidence' for the flood - there is the memories of the peoples who experienced it, passed down to us in many different and similar cultures.\n \n Sometimes I prefer the person to the test-tube...\n \n \"When we read in Bouchet about miracles associated with the relics of Saint Hilary we can shrug it off: His right to be believed is not great enough to take away our freedom to challenge him. But to go on from there and condemn all similar accounts seems to me to be impudent in the extreme. Such a great saint as Augustine swears that he saw: a blind child restored to sight by the relics of Saint Gervaise and Saint Protasius at Milan; a woman in Carthage cured of a cancer by the sign of the cross made by a woman who had just been baptised; his close friend Hesperius driving off devils (who were infesting his house) by using a little soil taken from the sepulchre of our Lord, and that same soil, borne into the Church, suddenly curing a paralytic; a woman who, having touched the reliquary of Saint Stephen with a posy of flowers during a procession, rubbed her eyes with them afterwards and recovered her sight which she had recently lost... What are we to accuse him of - hum and the two holy bishops, Aurelius and Maximinus, whom he calls on as witnesses? Is it of ignorance, simple-mindedness, credulity, deliberate deception or imposture? .... 'Qui, ut rationem mullan afferent, ipsa auhtoritate me frangerent (Why, even if they gave no reasons, they would convince me by their very authority) \n Michel de Montaigne in \"That it is madness to judge the true and the false from our own capacities\"\n Michel de Montaigne (1993), \"The Essays: A Selection\", Penguin Classics", 
   {}, 
   61477, 
   null, 
   1092055620.0
  ], 
  [
   61531, 
   null, 
   "thebootfitter", 
   "There is different 'evidence' for the flood - there is the memories of the peoples who experienced it, passed down to us in many different and similar cultures.\n \n Sometimes I prefer the person to the test-tube...\n\n While you are welcome to do believe whatever you wish to believe, if you are genuinely interested in learning what actually happened at some point in the history of the physical universe, consider that eye-witnesses have a very poor record for relating actual events. Not only is eye-witness testimony very subjective, it is also not reliably accurate.\n \n Also consider that your statement indicates that you are being selective in the evidence that you accept and the evidence that you throw away... \"Sometimes I prefer [one type of evidence to another type of evidence].\" So... what methods do you use to know when to accept or reject specific evidence?", 
   {}, 
   61512, 
   null, 
   1092066360.0
  ], 
  [
   61614, 
   null, 
   "montalban", 
   "While you are welcome to do believe whatever you wish to believe, if you are genuinely interested in learning what actually happened at some point in the history of the physical universe, consider that eye-witnesses have a very poor record for relating actual events. Not only is eye-witness testimony very subjective, it is also not reliably accurate.\n \n Also consider that your statement indicates that you are being selective in the evidence that you accept and the evidence that you throw away... \"Sometimes I prefer [one type of evidence to another type of evidence].\" So... what methods do you use to know when to accept or reject specific evidence?\n\n \n I don't tie my religion to scientific evidence. You stated that there was evidence that the flood did not happen. This is your belief. I think if there's no evidence, then this suggests that there's no evidence. It does not prove that the thing did not happen.\n \n If you want to debate the epistemology of science, then we should transfer to the creation/evolution debate, but I've already expended a great deal of time on this.\n \n However, you assume (I believe, from the little you've stated here) in fact that there's one science, and that it's subjective.\n \n Neither is true. There's many different versions of science. Marxist, capitalist, feminist, nationalist etc. Science is not as reliable as you may think.\n \n Take abiogenesis, no evidence that it did happen, just the belief that it must have.", 
   {}, 
   61531, 
   null, 
   1092134100.0
  ], 
  [
   61702, 
   null, 
   "mizmaxx", 
   "You mean I'm supposed to know what Bablefish is? I don't.\n\n It's Alta Vista's free on-line translation service. Any other similar site would probably give similar results, but as BabelFish is the most common as far as I know....\n \n \nNo, you suggest that the only real truth is 'subjective' that there's no objective/historical basis for the myths. You lessen the value of the myth by saying that it's only real to the people who believe.\n\n I never said anything of the sort. \n \n \nYou argue that the Cinderella myth is not historically based on reality, simply because many peoples have similar myths; in an effort to debunk the Noachian flood along the same lines.\n\n Really, now, you are getting confused. You posted a list of Flood myths as support for the idea of a Global Flood. I responded with the list of Cinderella stories. You were arguing that many ppl having Flood myths was evidence of a historical Global Flood, I was showing that many myths are shared across cultures- that does not mean the events described are historical everywhere, or anywhere for that matter. \n \n You persist in mistaking \"truth\" for \"history\". I am not a relativist. I believe that certain things are historical fact. I also believe that myths are important ways of communicating truth...\n \n \nThere's many different versions of science. Marxist, capitalist, feminist, nationalist etc.\n\n OFGS. How many times do ppl have to describe what science is to you before you catch on? Your \"versions\" of science are schools of science, they are not different ways of being scientific, they are different ways of choosing what to investigate and different ways of viewing the data aquired through scientific study. emoticon_xdonno \n \n \n If there is a lack of evidence for something for which there should be evidence, there is sufficient reason to question whether the event(s) actually occurred in the history of this physical realm. If there is, in fact, evidence that negates the possibility of the event(s), then there is 'scientific' evidence that said 'historical' event(s) did not actually occur.\n\n Exactly. \n \n I should say that within a given religion it might make sense to argue for example that the \"miracles\" of the Bible are literal, or whatever. However, outside that belief system, people require evidence or reasoning in support of an argument.\n \n BTW, these are just some of the geological problems with the theory of a Global Flood-\n \n \nProducing the Geological Record\n \n Most people who believe in a global flood also believe that the flood was responsible for creating all fossil-bearing strata. (The alternative, that the strata were laid down slowly and thus represent a time sequence of several generations at least, would prove that some kind of evolutionary process occurred.) However, there is a great deal of contrary evidence.\n \n Before you argue that fossil evidence was dated and interpreted to meet evolutionary assumptions, remember that the geological column and the relative dates therein were laid out by people who believed divine creation, before Darwin even formulated his theory. (See, for example, Moore [1973], or the closing pages of Dawson [1868].)\n \n Why are geological eras consistent worldwide? How do you explain worldwide agreement between \"apparent\" geological eras and several different (independent) radiometric and nonradiometric dating methods? [e.g., Short et al, 1991]\n \n How was the fossil record sorted in an order convenient for evolution? Ecological zonation, hydrodynamic sorting, and differential escape fail to explain:\n \n * the extremely good sorting observed. Why didn't at least one dinosaur make it to the high ground with the elephants?\n * the relative positions of plants and other non-motile life. (Yun, 1989, describes beautifully preserved algae from Late Precambrian sediments. Why don't any modern-looking plants appear that low in the geological column?)\n * why some groups of organisms, such as mollusks, are found in many geologic strata.\n * why organisms (such as brachiopods) which are very similar hydrodynamically (all nearly the same size, shape, and weight) are still perfectly sorted.\n * why extinct animals which lived in the same niches as present animals didn't survive as well. Why did no pterodons make it to high ground?\n * how coral reefs hundreds of feet thick and miles long were preserved intact with other fossils below them.\n * why small organisms dominate the lower strata, whereas fluid mechanics says they would sink slower and thus end up in upper strata.\n * why artifacts such as footprints and burrows are also sorted. [Crimes & Droser, 1992]\n * why no human artifacts are found except in the very uppermost strata. If, at the time of the Flood, the earth was overpopulated by people with technology for shipbuilding, why were none of their tools or buildings mixed with trilobite or dinosaur fossils?\n * why different parts of the same organisms are sorted together. Pollen and spores are found in association with the trunks, leaves, branches, and roots produced by the same plants [Stewart, 1983].\n * why ecological information is consistent within but not between layers. Fossil pollen is one of the more important indicators of different levels of strata. Each plant has different and distinct pollen, and, by telling which plants produced the fossil pollen, it is easy to see what the climate was like in different strata. Was the pollen hydraulically sorted by the flood water so that the climatic evidence is different for each layer?\n \n How do surface features appear far from the surface? Deep in the geologic column there are formations which could have originated only on the surface, such as:\n \n * Rain drops. [Robb, 1992]\n * River channels. [Miall, 1996, especially chpt. 6]\n * Wind-blown dunes. [Kocurek & Dott, 1981; Clemmenson & Abrahamsen, 1983; Hubert & Mertz, 1984]\n * Beaches.\n * Glacial deposits. [Eyles & Miall, 1984]\n * Burrows. [Crimes & Droser, 1992; Thackray, 1994]\n * In-place trees. [Cristie & McMillan, 1991]\n * Soil. [Reinhardt & Sigleo, 1989; Wright, 1986, 1994]\n * Desiccation cracks. [Andrews, 1988; Robb, 1992]\n * Footprints. [Gore, 1993, has a photograph (p. 16-17) showing dinosaur footprints in one layer with water ripples in layers above and below it. Gilette & Lockley, 1989, have several more examples, including dinosaur footprints on top of a coal seam (p. 361-366).]\n * Meteorites and meteor craters. [Grieve, 1997; Schmitz et al, 1997]\n * Coral reefs. [Wilson, 1975]\n * Cave systems. [James & Choquette, 1988]\n \n How could these have appeared in the midst of a catastrophic flood?\n \n How does a global flood explain angular unconformities? These are where one set of layers of sediments have been extensively modified (e.g., tilted) and eroded before a second set of layers were deposited on top. They thus seem to require at least two periods of deposition (more, where there is more than one unconformity) with long periods of time in between to account for the deformation, erosion, and weathering observed.\n \n How were mountains and valleys formed? Many very tall mountains are composed of sedimentary rocks. (The summit of Everest is composed of deep-marine limestone, with fossils of ocean-bottom dwelling crinoids [Gansser, 1964].) If these were formed during the Flood, how did they reach their present height, and when were the valleys between them eroded away? Keep in mind that many valleys were clearly carved by glacial erosion, which is a slow process.\n \n When did granite batholiths form? Some of these are intruded into older sediments and have younger sediments on their eroded top surfaces. It takes a long time for magma to cool into granite, nor does granite erode very quickly. [For example, see Donohoe & Grantham, 1989, for locations of contact between the South Mountain Batholith and the Meugma Group of sediments, as well as some angular unconformities.]\n \n How can a single flood be responsible for such extensively detailed layering? One formation in New Jersey is six kilometers thick. If we grant 400 days for this to settle, and ignore possible compaction since the Flood, we still have 15 meters of sediment settling per day. And yet despite this, the chemical properties of the rock are neatly layered, with great changes (e.g.) in percent carbonate occurring within a few centimeters in the vertical direction. How does such a neat sorting process occur in the violent context of a universal flood dropping 15 meters of sediment per day? How can you explain a thin layer of high carbonate sediment being deposited over an area of ten thousand square kilometers for some thirty minutes, followed by thirty minutes of low carbonate deposition, etc.? [Zimmer, 1992]\n \n How do you explain the formation of varves? The Green River formation in Wyoming contains 20,000,000 annual layers, or varves, identical to those being laid down today in certain lakes. The sediments are so fine that each layer would have required over a month to settle.\n \n How could a flood deposit layered fossil forests? Stratigraphic sections showing a dozen or more mature forests layered atop each other--all with upright trunks, in-place roots, and well-developed soil--appear in many locations. One example, the Joggins section along the Bay of Fundy, shows a continuous section 2750 meters thick (along a 48-km sea cliff) with multiple in-place forests, some separated by hundreds of feet of strata, some even showing evidence of forest fires. [Ferguson, 1988. For other examples, see Dawson, 1868; Cristie & McMillan, 1991; Gastaldo, 1990; Yuretich, 1994.] Creationists point to logs sinking in a lake below Mt. St. Helens as an example of how a flood can deposit vertical trunks, but deposition by flood fails to explain the roots, the soil, the layering, and other features found in such places.\n \n Where did all the heat go? If the geologic record was deposited in a year, then the events it records must also have occurred within a year. Some of these events release significant amounts of heat.\n \n * Magma. The geologic record includes roughly 8 x 1024 grams of lava flows and igneous intrusions. Assuming (conservatively) a specific heat of 0.15, this magma would release 5.4 x 1027 joules while cooling 1100 degrees C. In addition, the heat of crystallization as the magma solidifies would release a great deal more heat.\n * Limestone formation. There are roughly 5 x 1023 grams of limestone in the earth's sediments [Poldervaart, 1955], and the formation of calcite releases about 11,290 joules/gram [Weast, 1974, p. D63]. If only 10% of the limestone were formed during the Flood, the 5.6 x 1026 joules of heat released would be enough to boil the flood waters.\n * Meteorite impacts. Erosion and crustal movements have erased an unknown number of impact craters on earth, but Creationists Whitcomb and DeYoung suggest that cratering to the extent seen on the Moon and Mercury occurred on earth during the year of Noah's Flood. The heat from just one of the largest lunar impacts released an estimated 3 x 1026 joules; the same sized object falling to earth would release even more energy. [Fezer, pp. 45-46]\n * Other. Other possibly significant heat sources are radioactive decay (some Creationists claim that radioactive decay rates were much higher during the Flood to account for consistently old radiometric dates); biological decay (think of the heat released in compost piles); and compression of sediments.\n \n 5.6 x 1026 joules is enough to heat the oceans to boiling. 3.7 x 1027 joules will vaporize them completely. Since steam and air have a lower heat capacity than water, the steam released will quickly raise the temperature of the atmosphere over 1000 C. At these temperatures, much of the atmosphere would boil off the Earth.\n \n Aside from losing its atmosphere, Earth can only get rid of heat by radiating it to space, and it can't radiate significantly more heat than it gets from the sun unless it is a great deal hotter than it is now. (It is very nearly at thermal equilibrium now.) If there weren't many millions of years to radiate the heat from the above processes, the earth would still be unlivably hot.\n \n As shown in section 5, all the mechanisms proposed for causing the Flood already provide more than enough energy to vaporize it as well. These additional factors only make the heat problem worse.\n \n How were limestone deposits formed? Much limestone is made of the skeletons of zillions of microscopic sea animals. Some deposits are thousands of meters thick. Were all those animals alive when the Flood started? If not, how do you explain the well-ordered sequence of fossils in the deposits? Roughly 1.5 x 1015 grams of calcium carbonate are deposited on the ocean floor each year. [Poldervaart, 1955] A deposition rate ten times as high for 5000 years before the Flood would still only account for less than 0.02% of limestone deposits.\n \n How could a flood have deposited chalk? Chalk is largely made up of the bodies of plankton 700 to 1000 angstroms in diameter [Bignot, 1985]. Objects this small settle at a rate of .0000154 mm/sec. [Twenhofel, 1961] In a year of the Flood, they could have settled about half a meter.\n \n How could the Flood deposit layers of solid salt? Such layers are sometimes meters in width, interbedded with sediments containing marine fossils. This apparently occurs when a body of salt water has its fresh-water intake cut off, and then evaporates. These layers can occur more or less at random times in the geological history, and have characteristic fossils on either side. Therefore, if the fossils were themselves laid down during a catastrophic flood, there are, it seems, only two choices:\n (1) the salt layers were themselves laid down at the same time, during the heavy rains that began the flooding, or\n (2) the salt is a later intrusion. I suspect that both will prove insuperable difficulties for a theory of flood deposition of the geologic column and its fossils. [Jackson et al, 1990]\n \n How were sedimentary deposits recrystallized and plastically deformed in the short time since the Flood? The stretched pebble conglomerate in Death Valley National Monument (Wildrose Canyon Rd., 15 mi. south of Hwy. 190), for example, contains streambed pebbles metamorphosed to quartzite and stretched to 3 or more times their original length. Plastically deformed stone is also common around salt diapirs [Jackson et al, 1990].\n \n How were hematite layers laid down? Standard theory is that they were laid down before Earth's atmosphere contained much oxygen. In an oxygen-rich regime, they would almost certainly be impossible.\n \n How do you explain fossil mineralization? Mineralization is the replacement of the original material with a different mineral.\n \n * Buried skeletal remains of modern fauna are negligibly mineralized, including some that biblical archaeology says are quite old - a substantial fraction of the age of the earth in this diluvian geology. For example, remains of Egyptian commoners buried near the time of Moses aren't extensively mineralized.\n * Buried skeletal remains of extinct mammalian fauna show quite variable mineralization.\n * Dinosaur remains are often extensively mineralized.\n * Trilobite remains are usually mineralized - and in different sites, fossils of the same species are composed of different materials.\n \n How are these observations explained by a sorted deposition of remains in a single episode of global flooding?\n \n How does a flood explain the accuracy of \"coral clocks\"? The moon is slowly sapping the earth's rotational energy. The earth should have rotated more quickly in the distant past, meaning that a day would have been less than 24 hours, and there would have been more days per year. Corals can be dated by the number of \"daily\" growth layers per \"annual\" growth layer. Devonian corals, for example, show nearly 400 days per year. There is an exceedingly strong correlation between the \"supposed age\" of a wide range of fossils (corals, stromatolites, and a few others -- collected from geologic formations throughout the column and from locations all over the world) and the number of days per year that their growth pattern shows. The agreement between these clocks, and radiometric dating, and the theory of superposition is a little hard to explain away as the result of a number of unlucky coincidences in a 300-day-long flood. [Rosenberg & Runcorn, 1975; Scrutton, 1965; Wells, 1963]\nhttp://www.talkorigins.org/faqs/faq-noahs-ark.html#georecord", 
   {}, 
   61614, 
   null, 
   1092211260.0
  ], 
  [
   61710, 
   null, 
   "montalban", 
   "\"Almost every culture on Earth includes an ancient flood story. Details vary, but the basic plot is the same: Deluge kills all but a lucky few\"\n http://www.geosoc.com/blacksea/ax/frame.html\n It links to article about the search, but you can read about it here as well:\n http://www.columbia.edu/cu/news/99/11/flood.html\n also\n \"The questions are when did it happen, and how rapidly? Until recently, scholars believed the drowning occurred about 9,000 years ago and was gradual. But marine geologists Walter Pitman and William Ryan wrote in 1997 that the flood was sudden and took place about 7,150 years ago. The scientists' conclusions reinvigorated the Noah flood debate, which the Bible chronicles as a calamitous event spanning 40 days and 40 nights. \"\n at\n http://www.cbsnews.com/stories/2003...ain564233.shtml\n \n http://www.christiananswers.net/q-eden/edn-c005.html\n \nYou mean I'm supposed to know what Bablefish is? I don't. \n\n \nIt's Alta Vista's free on-line translation service. Any other similar site would probably give similar results, but as BabelFish is the most common as far as I know....\n\n You used to use google. But, thanks for the info. But just don't expect in future for everyone to be able to understand foreign sentences. I however use www.ixquick.com and www.ithaki.net.\n \n \nNo, you suggest that the only real truth is 'subjective' that there's no objective/historical basis for the myths. You lessen the value of the myth by saying that it's only real to the people who believe.\n\n \nI never said anything of the sort.\n\n Actually you've stated that...\n Post 37\n \nHow quickly you reveal your true feelings. Just because something is a myth does not mean it is \"a load of cr*p\". \"Cinderella\" stories, as I've said before, must serve some purpose as an archetypal myth- that doesn't mean we are to take them as historical.\n\n Therefore it's purpose, whilst not necessarily historical, serves another purpose - such as, one can imagine - a morality tale. So, you've got two types of myth here, the non historical, serving some 'purpose' - a functionalist sociologist has emerged in our midst :), or ones that have some historical basis.\n \nYou argue that the Cinderella myth is not historically based on reality, simply because many peoples have similar myths; in an effort to debunk the Noachian flood along the same lines.\n\n \nReally, now, you are getting confused. You posted a list of Flood myths as support for the idea of a Global Flood. I responded with the list of Cinderella stories. You were arguing that many ppl having Flood myths was evidence of a historical Global Flood, I was showing that many myths are shared across cultures- that does not mean the events described are historical everywhere, or anywhere for that matter.\n\n No, you argued that because there are a number of Cinderella-type stories, just as there are flood stories, that I should be one to believe that Cinderella actually happened... as I do 'the flood' because it too is a 'universal' story. I showed in fact that the Cinderella-type story continues to happen. Therefore it underpins your attack on it being real, and ipso facto, by extension, the Noah flood story too. You seem to be confused.\n \nYou persist in mistaking \"truth\" for \"history\". I am not a relativist. I believe that certain things are historical fact. I also believe that myths are important ways of communicating truth...\n\n This does seem to be a denial that the myths have any historical basis. However, if you do believe they can have historical basis, then your argument against Noah's flood has failed.\n Which is it - the argument you are making?\n a) Common type stories have no basis in fact\n or\n b) They do\n \n Your call :)\n If the former, as I suggested based on your argument so far, then you really have debunked and attacked Native American stories, if not, you've wasted your attempt to debunk Noah's flood, simply because of it's common basis.\n So, how did they get all those animals on the ark? #237\n \nAfter the Cinderella story and the Noah story, who knows what other \"real\" facts we have yet to discover through assuming that myths are literal...\n\n \n I've got a question for you...\n IF there had been a global flood... what evidence would you expect to find?\n \n \n There's many different versions of science. Marxist, capitalist, feminist, nationalist etc. \n\n \n OFGS. How many times do ppl have to describe what science is to you before you catch on? Your \"versions\" of science are schools of science, they are not different ways of being scientific, they are different ways of choosing what to investigate and different ways of viewing the data acquired through scientific study.\n\n False dichotomy....a change of attitude from before...\n The many faces of science thread...\n \n Science itself is 'male-orientated'1 and culturally biased 2. It is filled with these biases, no matter how 'empirical' the evidence may seem. \n\n The many faces of science post #11\n \n I agree with you here, and in general on the subject of so-called scientific objectivity, but I think it is necessary to differentiate between science itself (which is only a method of study) and the scientific communities (which are made up of people with degrees of power, agendas, biases, etc.) If you want to argue that the scientific method itself is flawed, I think that's another subject entirely. It is clear that people using scientific methods have come up with very wrong answers many times, and others using very unscientific methods have been later proven right by the very same scientific method.\n Therefore, because people can be wrong, they can use science to be wrong. Also, because humans can only use their own senses and whatever technology we have ourselves come up with to deduce everything scientific, science is always limited by our own ability to perceive, whether on our own or with instruments.\n About the link you provide on the nature/nurture theses, the author is explicit about addressing Neo-Darwinism, such as socio-biology, which is not at all the same as evolutionary theory.\n\n What school of science did you believe back then to be male-dominated? But yes, here we agree on the following...\n Post 40 of the same thread...\n \nI do agree whole-heartedly with the thesis that any science that purports to be \"objective\" is bad science. No tool in the hands of humans is ever really \"objective\". That does not mean that science, no matter how fallible, is wrong about evolution.\n\n True, it doesn't disprove evolution, but at least we agree that science is not objective... once in human hands - which means all of it - unless we're talking about science as something that exists beyond us. And therefore you distinction between 'science' and 'schools of science' fails as science that is beyond our beings is of no point to this discussion. However, science once it is interpreted, falls under the influence of biased minds. I'd like you to tell me where science just 'exists' outside our our knowledge :)\n \n \n Reminder: I recall you never replied to my post #54 of that thread. :)\n \n But, yes Mizmaxx, a lot of people here who've not studied the socialisation of knowledge believe as you state here. Clearly facts in the Marxist view of evolution are couched with terms of collective effort, work, creativity etc.\n Again I have cited epistemological sites.\n Marxist societies believe themselves to be the most scientific. Oddly enough, Marxist materialism is most championed by evolutionary theory.\n http://www.ex.ac.uk/projects/meia/Archive/1876-Hands/\n Shows a study by Engels, that deals with how manual labour helped in the development of mankind - helping us grow a bigger brain than other apes.\n This is Marxist theory of evolution.\n \"Engels recognised that the erect posture in walking represented \"the decisive step in the transition from ape to man.\" This allowed the hand to be free and could \"attain ever greater dexterity and skill\". Thus states Engels, \"the hand is not only the organ of labour, it is also the product of labour.\" He then went on to explain that this had further revolutionary consequences. \"But the hand did not exist by itself. It was only one member of an entire, highly complex organism. And what benefited the hand, benefited also the whole body it served.\"\n http://www.marxist.com/Theory/origi...species501.html\n \n Therefore all that they consider, when dealing with science is coloured by their Marxist a priori beliefs - rejecting evidences for any individualist traits etc. Capitalist science does its own spin.\n \n PS you still didn't seem to 'get' the irony of me defending the English language - with a French phrase. It is said that irony is lost on Americans... maybe this needs to be modified to include people on both sides of the US-Canadian border.", 
   {}, 
   59805, 
   null, 
   1092230100.0
  ], 
  [
   62297, 
   null, 
   "mizmaxx", 
   "\"Almost every culture on Earth includes an ancient flood story. Details vary, but the basic plot is the same: Deluge kills all but a lucky few\"\n\n Yes. That tends to happen with floods. That still doesn't mean there was a single global flood.\n \n \nActually you've stated that...\n Post 37\n\n \n \nas I've said before, must serve some purpose as an archetypal myth- that doesn't mean we are to take them as historical.\n\n From this you say -\n \nyou suggest that the only real truth is 'subjective' that there's no objective/historical basis for the myths. You lessen the value of the myth by saying that it's only real to the people who believe.\n\n \n \nI showed in fact that the Cinderella-type story continues to happen. Therefore it underpins your attack on it being real, and ipso facto, by extension, the Noah flood story too. \n\n Not at all. Although (perhaps) Cinderella-story type things may happen, that does not make the Cinderella story historical. You are trying to argue that the presence of an archetype is proof of historicity. That doesn't wash by any definition.\n \n \nThis does seem to be a denial that the myths have any historical basis.\n\n Well, it isn't. Some myths have historical bases, others do not.\n \n \nWhich is it - the argument you are making?\n a) Common type stories have no basis in fact\n or\n b) They do\n\n Wow. This must be the tenth time I've explained this, and you still don't get it. The arguement that I'm making is that the fact that a story is common does not make it historical. No more, no less. \n \n \nI've got a question for you...\n IF there had been a global flood... what evidence would you expect to find?\n\n Read the quote from talkorigins.\n \n \nFalse dichotomy....a change of attitude from before...\n The many faces of science thread...\n\n Nope. Just you not getting the difference between schools of science and scientific methodology yet again.\n \n \nAnd therefore you distinction between 'science' and 'schools of science' fails as science that is beyond our beings is of no point to this discussion. However, science once it is interpreted, falls under the influence of biased minds. I'd like you to tell me where science just 'exists' outside our our knowledge\n\n That would be the evidence itself, montalban.\n \n \nReminder: I recall you never replied to my post #54 of that thread. :)\n\n I get quickly bored arguing with creationists. \n \n \nClearly facts in the Marxist view of evolution are couched with terms of collective effort, work, creativity etc.(...)\n Shows a study by Engels, that deals with how manual labour helped in the development of mankind - helping us grow a bigger brain than other apes.\n\n You see, where you get confused is that you dismiss the evidence itself (the change in cranial capacity) with the interpretation of that evidence.\n \n \nPS you still didn't seem to 'get' the irony of me defending the English language - with a French phrase. It is said that irony is lost on Americans... maybe this needs to be modified to include people on both sides of the US-Canadian border.\n\n I don't think you understand what the word \"irony\" means.", 
   {}, 
   61710, 
   null, 
   1092559080.0
  ], 
  [
   62305, 
   null, 
   "montalban", 
   "[quote=Montalban]\"Almost every culture on Earth includes an ancient flood story. Details vary, but the basic plot is the same: Deluge kills all but a lucky few\" \n \nYes. That tends to happen with floods. That still doesn't mean there was a single global flood.\n\n What you're saying that every time there's been a flood there's been a story about a man chosen by God and set aside in an ark/boat/canoe? See\n http://www.dreamscape.com/morgana/titania.htm\n \n\n Montalban:Actually you've stated that...\n Post 37 \n Mizmaxx:as I've said before, must serve some purpose as an archetypal myth- that doesn't mean we are to take them as historical. \n Mizmaxx: From this you say -\n Montalban: you suggest that the only real truth is 'subjective' that there's no objective/historical basis for the myths. You lessen the value of the myth by saying that it's only real to the people who believe. \n Mizmaxx: I showed in fact that the Cinderella-type story continues to happen. Therefore it underpins your attack on it being real, and ipso facto, by extension, the Noah flood story too.\n\n \nNot at all. Although (perhaps) Cinderella-story type things may happen, that does not make the Cinderella story historical. You are trying to argue that the presence of an archetype is proof of historicity. That doesn't wash by any definition.\n\n Actually you introduced the Cinderella story as a refutation BECAUSE it is common; as an attempt at ridicule based on your own notions of the Prince Charming/Magic Pumpkin-carriage etc. and just because one story has those elements means nothing.\n Sad that you'd debunk the myths of so many Native American cultures.\n Further to that, it's not a simple thing that there are numerous flood stories. They have many many things in common, including divinities, divine judgment, a person chosen to be saved etc.\n \nThis does seem to be a denial that the myths have any historical basis. \n\n \nWell, it isn't. Some myths have historical bases, others do not.\n\n Which ones are in which category; according to you?\n \nWhich is it - the argument you are making?\n a) Common type stories have no basis in fact\n or\n b) They do\n\n \nWow. This must be the tenth time I've explained this, and you still don't get it. The argument that I'm making is that the fact that a story is common does not make it historical. No more, no less. \n\n Rubbish. You asked are we to believe that there's a real Prince Charming as an attempt at ridicule.\n Post 33\n \nI also responded on that thread that there tons of Cinderella-type stories from all over the world- does this mean that Cinderella really, truly existed, and got to marry the handsome Prince?\n\n Your logic being.. no one's going to accept certain elements of the Cinderella story as being true, therefore they'll reject any historic part about it, and therefore by extension any other commonly held beliefs. The implication here is quite clear - no real Prince Charming ever existed, therefore the Cinderella story is bunk.\n [quote=Montalban] I've got a question for you...\n IF there had been a global flood... what evidence would you expect to find? [/quote\n \nRead the quote from talkorigins.\n\n Ah ye olde it's been refuted somewhere else. However I looked at the site, and they refute certain rationalist theories/models. That these might 'be' and that these can be refuted, does not mean the flood happened the way these models suggest. So, I ask you again, what type of evidences would you expect to find?\n \nFalse dichotomy....a change of attitude from before...\n The many faces of science thread... \n\n \nNope. Just you not getting the difference between schools of science and scientific methodology yet again\n\n \nAnd therefore you distinction between 'science' and 'schools of science' fails as science that is beyond our beings is of no point to this discussion. However, science once it is interpreted, falls under the influence of biased minds. I'd like you to tell me where science just 'exists' outside our own knowledge \n\n \nThat would be the evidence itself, Montalban.\n\n What has evidence of itself, that is unknown to man? That's the problem you've created. We've both agreed that man, once he starts interpreting things adds his own biases (by the way, please excuse me for saying 'man' instead of people). However, you're now trying to suggest that somewhere out there 'science' pure and true exists of itself, untouched by man's biases. Which is a nonsense. The moment man interprets it it enters into a school of science.\n \nReminder: I recall you never replied to my post #54 of that thread.\n\n \nI get quickly bored arguing with creationists.\n\n If only that were true.\n That's the typical level of 'honesty'. You claimed not to have any knowledge of particular schools of thought on evolution, then that you couldn't find them. This was to debunk the 'mutually exclusive' claims I made. Then you claimed not to have heard of something that was actually part of a post to you. Then you just vanished from that post.\n \nClearly facts in the Marxist view of evolution are couched with terms of collective effort, work, creativity etc.(...)\n\n \nShows a study by Engels, that deals with how manual labour helped in the development of mankind - helping us grow a bigger brain than other apes.\n\n Yes, it does... based on his notions that certain socialising factors helped shape the development of Man\n \nYou see, where you get confused is that you dismiss the evidence itself (the change in cranial capacity) with the interpretation of that evidence.\n\n I have no qualms or confusion with the so-called evidence changing. The question 'why'? would be equally a divisive one, depending on which 'school' you belonged to.\n \nPS you still didn't seem to 'get' the irony of me defending the English language - with a French phrase. It is said that irony is lost on Americans... maybe this needs to be modified to include people on both sides of the US-Canadian border. \n\n \nI don't think you understand what the word \"irony\" means.\n\n Yes, when I use a foreign language phrase to defend the qualities of English usage, that is being ironic, Mizmaxx. You seem to be an expert at pathos.", 
   {}, 
   62297, 
   null, 
   1092563340.0
  ], 
  [
   62376, 
   null, 
   "mizmaxx", 
   "What you're saying that every time there's been a flood there's been a story about a man chosen by God and set aside in an ark/boat/canoe? \n\n It's certainly not unusual for ppl to interpret being one of few survivors as being \"chosen by God\".\n \n \nActually you introduced the Cinderella story as a refutation BECAUSE it is common; as an attempt at ridicule based on your own notions of the Prince Charming/Magic Pumpkin-carriage etc. and just because one story has those elements means nothing.\n\n So it is possible, in your opinion, that historically speaking a global flood happened, but not the way described in the Bible? \n \n Still, the point is that commonality does not prove historicity. Which continues to be true.\n \n \nWhich ones are in which category; according to you?\n\n The ones for which there is historical evidence of.\n \n \nRubbish. You asked are we to believe that there's a real Prince Charming as an attempt at ridicule.\n\n No, it was a demonstation of the failure of your argument. \n \n \nAh ye olde it's been refuted somewhere else. However I looked at the site, and they refute certain rationalist theories/models. That these might 'be' and that these can be refuted, does not mean the flood happened the way these models suggest. So, I ask you again, what type of evidences would you expect to find?\n\n \nA global flood would have produce evidence contrary to the evidence we see.\n \n How do you explain the relative ages of mountains? For example, why weren't the Sierra Nevadas eroded as much as the Appalachians during the Flood?\n \n Why is there no evidence of a flood in ice core series? Ice cores from Greenland have been dated back more than 40,000 years by counting annual layers. [Johnsen et al, 1992,; Alley et al, 1993] A worldwide flood would be expected to leave a layer of sediments, noticeable changes in salinity and oxygen isotope ratios, fractures from buoyancy and thermal stresses, a hiatus in trapped air bubbles, and probably other evidence. Why doesn't such evidence show up?\n \n How are the polar ice caps even possible? Such a mass of water as the Flood would have provided sufficient buoyancy to float the polar caps off their beds and break them up. They wouldn't regrow quickly. In fact, the Greenland ice cap would not regrow under modern (last 10 ky) climatic conditions.\n \n Why did the Flood not leave traces on the sea floors? A year long flood should be recognizable in sea bottom cores by (1) an uncharacteristic amount of terrestrial detritus, (2) different grain size distributions in the sediment, (3) a shift in oxygen isotope ratios (rain has a different isotopic composition from seawater), (4) a massive extinction, and (n) other characters. Why do none of these show up?\n \n Why is there no evidence of a flood in tree ring dating? Tree ring records go back more than 10,000 years, with no evidence of a catastrophe during that time. [Becker & Kromer, 1993; Becker et al, 1991; Stuiver et al, 1986]\n References\n \n Alley, R. B., D. A. Meese, C. A. Shuman, A. J. Gow, K.C. Taylor, P. M. Grootes, J. W. C. White, M. Ram, E. W. Waddington, P. A. Mayewski, & G. A. Zielinski, 1993. Abrupt increase in Greenland snow accumulation at the end of the Younger Dryas event. Nature 362: 527-529.\n \n Becker, B. & Kromer, B., 1993. The continental tree-ring record - absolute chronology, C-14 calibration and climatic-change at 11 KA. Palaeogeography Palaeoclimatology Palaeoecology, 103 (1-2): 67-71.\n \n Becker, B., Kromer, B. & Trimborn, P., 1991. A stable-isotope tree-ring timescale of the late glacial Holocene boundary. Nature 353 (6345): 647-649.\n \n Johnsen, S. J., H. B. Clausen, W. Dansgaard, K. Fuhrer, N. Gundestrap, C. U. Hammer, P. Iversen, J. Jouzel, B. Stauffer, & J. P. Steffensen, 1992. Irregular glacial interstadials recorded in a new Greenland ice core. Nature 359: 311-313.\n \n Stuiver, Minze, et al, 1986. Radiocarbon age calibration back to 13,300 years BP and the 14 C age matching of the German Oak and US bristlecone pine chronologies. IN: Calibration issue / Stuiver, Minze, et al., Radiocarbon 28(2B): 969-979.\n\n from the same web page as before....\n \n \nHowever, you're now trying to suggest that somewhere out there 'science' pure and true exists of itself, untouched by man's biases. Which is a nonsense. The moment man interprets it it enters into a school of science.\n\n The evidence exists without human bias. Besides, everyone is biased, but that does not mean we are all wrong all of the time.\n \n \nIf only that were true.\n\n It is true. Lucky you! \n \n \nI have no qualms or confusion with the so-called evidence changing.\n\n This sentence makes no sense in the context of my point. The evidence didn't change, the cranial capacity did.", 
   {}, 
   62305, 
   null, 
   1092635760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bible do you believe every thing you read?", 
  "url": "http://www.4forums.com/political/religion-debates/2409-bible-do-you-believe-every-thing-you-read.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 2409, 
  "discussion_files": [
   [
    "1737.html", 
    "http://www.4forums.com/political/religion-debates/2409-bible-do-you-believe-every-thing-you-read-print.html"
   ], 
   [
    "1738.html", 
    "http://www.4forums.com/political/religion-debates/2409-bible-do-you-believe-every-thing-you-read-4-print.html"
   ], 
   [
    "1739.html", 
    "http://www.4forums.com/political/religion-debates/2409-bible-do-you-believe-every-thing-you-read-3-print.html"
   ], 
   [
    "1740.html", 
    "http://www.4forums.com/political/religion-debates/2409-bible-do-you-believe-every-thing-you-read-2-print.html"
   ]
  ], 
  "identifier": 2409
 }
]