[
 [
  [
   50292, 
   null, 
   "sglaine", 
   "I am starting to study Science VS Religin. Do you have any input for this?? Has any one seen Penn & Teller show on this subject?", 
   {
    "post_info": {
     "post_title": "Science VS Religin ??????? Is it a good thing?"
    }
   }, 
   null, 
   null, 
   1084760340.0
  ], 
  [
   50323, 
   null, 
   "montalban", 
   "In one sense, modern science was born of western Christianity.\n \n Although science pre-dates Christianity, it was the need of the rational faiths to understand the universe, so as to understand God, that bore intellectual fruit.\n \n Catholicsm, beginning with St.Augustine of Hippo, started to come to the belief in a legalistic-rationalistic knowledge of God. Protestants continued in this way.\n \n St.Anselm developed ratioarguments to prove God exists.\n \n Some westerners, such as Newton, believed that God goverened by laws that we could comprehend, through science\n \n Today, many western Christians continue to try to show God, through science - thus we have 'creation science', where-by it is believed that God's handiwork can be ascertained through rational understanding of nature.\n \n This relationship comes full circle with some scientists seeking God.\n \n This way is foreign to Orthodox Chrisitanity, which accepts God through noetic understanding. Western forms of Christianity started the path of intellectual understanding - which is self-defeating as the mind of man can never understand the unknowable God.", 
   {}, 
   50292, 
   null, 
   1084787460.0
  ], 
  [
   50338, 
   null, 
   "Rogue790", 
   "To sglaine:\n \n I am starting to study Science VS Religin. Do you have any input for this?? Has any one seen Penn & Teller show on this subject? \n \n I was unaware that science was against religion. At least, Sir Isaac Newton and countless others didn't think so either. I believe that evolution is against the Christian religion, but not science in general.", 
   {
    "post_info": {
     "post_title": "Since when has science been against religion?"
    }
   }, 
   50292, 
   null, 
   1084804260.0
  ], 
  [
   50350, 
   null, 
   "thebootfitter", 
   "I am starting to study Science VS Religin. Do you have any input for this?? Has any one seen Penn & Teller show on this subject?\n\n Check out this thread titled \"Science vs Religion?\" in the Evolution/Creation forum:\n http://4forums.com/political/showthread.php?t=1763", 
   {}, 
   50292, 
   null, 
   1084808940.0
  ], 
  [
   50352, 
   null, 
   "sglaine", 
   "To sglaine:\n \n I am starting to study Science VS Religion. Do you have any input for this?? Has any one seen Penn & Teller show on this subject? \n \n I was unaware that science was against religion. At least, Sir Isaac Newton and countless others didn't think so either. I believe that evolution is against the Christian religion, but not science in general.\n\n Who said anything about science being against religion come on now I never said any thing to that effect. I am not against religion I think the truth is stretched a little to far on some issues. Come on get real.", 
   {}, 
   50338, 
   null, 
   1084809840.0
  ], 
  [
   50361, 
   null, 
   "sglaine", 
   "Check out this thread titled \"Science vs Religion?\" in the Evolution/Creation forum:\n http://4forums.com/political/showthread.php?t=1763\n\n I know you started a similar thread back in Feb. It is old and I am trying this.", 
   {}, 
   50350, 
   null, 
   1084811160.0
  ], 
  [
   50370, 
   null, 
   "jim's trucking", 
   "You people should realize that some people don't know what versus  means.", 
   {}, 
   50361, 
   null, 
   1084814040.0
  ], 
  [
   50373, 
   null, 
   "sglaine", 
   "You people should realize that some people don't know what versus  means.\n\n I don't think you have a clue here. There are scientific theory's here that say a lot of this stuff never happen. Such as thing I posted earlier in the thread. What versus be more specific.", 
   {}, 
   50370, 
   null, 
   1084814460.0
  ], 
  [
   50377, 
   null, 
   "jim's trucking", 
   "See what I mean?", 
   {}, 
   50373, 
   null, 
   1084814700.0
  ], 
  [
   50380, 
   null, 
   "sglaine", 
   "See what I mean?\n\n Like I said be more specific. Can you do that???????????? emoticon_xclown", 
   {}, 
   50377, 
   null, 
   1084815000.0
  ], 
  [
   50422, 
   null, 
   "Phunting", 
   "The point Jim was (quite rightly) making was that to title a thread 'Science VS Religin' (Sic) you are most defiantly stating that science is against religion. \n \n And it was versus not verses in case that was the confusion!", 
   {}, 
   50380, 
   null, 
   1084822800.0
  ], 
  [
   50505, 
   null, 
   "sglaine", 
   "The point Jim was (quite rightly) making was that to title a thread 'Science VS Religion' (Sic) you are most defiantly stating that science is against religion. \n \n And it was versus not verses in case that was the confusion!\n\n I was looking for input on this subject not riff-faff gibberish your talking. I did not say that science was against religion. You said that I am looking for input that maybe science can figure out some of discrepancies in the bible. emoticon_xdonno", 
   {}, 
   50422, 
   null, 
   1084834980.0
  ], 
  [
   50510, 
   null, 
   "jim's trucking", 
   "Jesus! emoticon_xgood", 
   {}, 
   50505, 
   null, 
   1084835820.0
  ], 
  [
   50511, 
   null, 
   "sglaine", 
   "Jesus! emoticon_xgood\n\n Gee Jim I thought you worship Satin,, emoticon_xagree", 
   {}, 
   50510, 
   null, 
   1084836060.0
  ], 
  [
   50514, 
   null, 
   "jim's trucking", 
   "Gee Jim I thought you worship Satin,, emoticon_xagree\n\n \n I do like satin.....satin sheets! \n \n Satan is a fallen angel who runs Hell nowadays.", 
   {}, 
   50511, 
   null, 
   1084836180.0
  ], 
  [
   50516, 
   null, 
   "sglaine", 
   "I do like satin.....satin sheets! \n \n Satan is a fallen angel who runs Hell nowadays.\n\n What ever the one how has created hell like the ones in office right Jim.", 
   {}, 
   50514, 
   null, 
   1084836360.0
  ], 
  [
   50520, 
   null, 
   "jim's trucking", 
   "What ever the one how has created hell like the ones in office right Jim.\n\n \n Whatever you say, Sean. Just keep on nibblin' them No-Doz tablets and drinkin' AirWick! Your brain is just about gone. emoticon_xbye", 
   {}, 
   50516, 
   null, 
   1084836660.0
  ], 
  [
   50536, 
   null, 
   "sglaine", 
   "Whatever you say, Sean. Just keep on nibblin' them No-Doz tablets and drinkin' AirWick! Your brain is just about gone. emoticon_xbye\n\n Keep up with your insults and I'll call the the Authorities. You ignorants will get you no where's here pal. emoticon_xgood", 
   {}, 
   50520, 
   null, 
   1084839120.0
  ], 
  [
   50544, 
   null, 
   "sinjin", 
   "What ever the one how has created hell like the ones in office right Jim.\n\n \n I'm having trouble following your line of thinking. Could you please post in a common language, preferably English?\n \n I don't think anyone wants to ridicule you but if your posts are indecipherable you make discussion impossible.", 
   {}, 
   50516, 
   null, 
   1084841100.0
  ], 
  [
   50547, 
   null, 
   "sglaine", 
   "I'm having trouble following you line of thinking. Could you please post in a common language, preferably English?\n \n I don't think anyone wants to ridicule you but if your posts are indecipherable you make discussion impossible.\n That XXXXX does and if you track his posting history you will find out just what he is all about. Please rearead What I want to know do you think we should have science to figure out weather or not the bible is telling the truth.", 
   {}, 
   50544, 
   null, 
   1084841340.0
  ], 
  [
   50708, 
   null, 
   "Phunting", 
   "That XXXXX does and if you track his posting history you will find out just what he is all about.\nNo need for that. If he was ridiculing you it was because your post made absolutley no sense.\n \n \n \nPlease rearead What I want to know do you think we should have science to figure out weather or not the bible is telling the truth.\nScience proves what it proves and disproves what it disproves, in relation to the bible or not. Science is not a weapon that can be used to ridicule the bible, and we can't 'use' it as such.", 
   {}, 
   50547, 
   null, 
   1084904520.0
  ], 
  [
   50740, 
   null, 
   "sglaine", 
   "No need for that. If he was ridiculing you it was because your post made absolutley no sense.\n \n \n Science proves what it proves and disproves what it disproves, in relation to the bible or not. Science is not a weapon that can be used to ridicule the bible, and we can't 'use' it as such.\n\n My post made a lot of sense because you fail to see the truth and want to go with the fairy book theory. What I saw on TV proved a lot and open my eye's to this issue. Do not get me wrong there is a lot that I do believe in the bible but there is a lot of BS too. There is no way that miracles were performed. Nor was did the red sea parted in the middle so that follower could go though. Nor Did Noah's arc ever held all of what they claim. You see my friend there is reality and there is fiction in the bible do you understand what I am getting at.", 
   {}, 
   50708, 
   null, 
   1084908480.0
  ], 
  [
   50749, 
   null, 
   "Phunting", 
   "My post made a lot of sense\nThe post in question:\n \n \n \nWhat ever the one how has created hell like the ones in office right Jim.\nIf that made a lot of sense I'd hate to see what you consider nonsensical!\n \n \n \nbecause you fail to see the truth and want to go with the fairy book theory.\nAre you saying I didn't understand the post because I'm too caught up in believing in the bible! I find that too amusing for words...\n \n \n \nYou see my friend there is reality and there is fiction in the bible do you understand what I am getting at.\nOf course. But a belief in God, and therefore miracles, would mean that such fantastic happenings were plausible.", 
   {}, 
   50740, 
   null, 
   1084909080.0
  ], 
  [
   50755, 
   null, 
   "sglaine", 
   "The post in question:\n \n \n If that made a lot of sense I'd hate to see what you consider nonsensical!\n \n \n Are you saying I didn't understand the post because I'm too caught up in believing in the bible! I find that too amusing for words...\n \n \n Of course. But a belief in God, and therefore miracles, would mean that such fantastic happenings were plausible.\n\n Ok then whats the truth do you know the truth I do not think you have a clue to what the truth is. I already spelled it out for you. The problem is people are gelable to this nonsense.", 
   {}, 
   50749, 
   null, 
   1084909260.0
  ], 
  [
   50761, 
   null, 
   "Phunting", 
   "Ok then whats the truth do you know the truth I do not think you have a clue to what the truth is. I already spelled it out for you. The problem is people are gelable to this nonsense.\nWell if you spelt it out to me it was probably wrong, judging by the general level of your spelling!", 
   {}, 
   50755, 
   null, 
   1084909620.0
  ], 
  [
   50763, 
   null, 
   "Waxy", 
   "Ohhhhh man, this is too funny. :p :p:p\n \n Waxy", 
   {}, 
   50755, 
   null, 
   1084909680.0
  ], 
  [
   50768, 
   null, 
   "sglaine", 
   "Well if you spelt it out to me it was probably wrong, judging by the general level of your spelling!\n\n Yea I suppose you believe in the tooth fairy. Haaaa HAaaaaaaaa.", 
   {}, 
   50761, 
   null, 
   1084909740.0
  ], 
  [
   50769, 
   null, 
   "Big Orn", 
   "Ohhhhh man, this is too funny. :p :p:p\n \n Waxy\n\n Surreal is more like it... emoticon_ic", 
   {}, 
   50763, 
   null, 
   1084909860.0
  ], 
  [
   50774, 
   null, 
   "Waxy", 
   "Surreal is more like it... emoticon_ic\n\n \n :p\n \n Waxy", 
   {}, 
   50769, 
   null, 
   1084910100.0
  ], 
  [
   50775, 
   null, 
   "sglaine", 
   "Surreal is more like it... emoticon_ic\n\n What do you mean by that Ron what I said is what I believe in. This is a debate isn't because they fail to debate my findings witch I happen to beleive in.", 
   {}, 
   50769, 
   null, 
   1084910280.0
  ], 
  [
   50780, 
   null, 
   "sinjin", 
   "...as a brick. I'm beginning to feel a little gelable myself.", 
   {}, 
   50775, 
   null, 
   1084911180.0
  ], 
  [
   50783, 
   null, 
   "sglaine", 
   "...as a brick. I'm beginning to feel a little gelable myself.\n\n Good one Haa.", 
   {}, 
   50780, 
   null, 
   1084911540.0
  ], 
  [
   50865, 
   null, 
   "Tastyfish", 
   "The two are utterly opposed, while science may have its roots partly in western christianity (at least it was western christians doing much of what we think of as the beginnings of modern science, though this was actually based pretty much of Roman and Greek knowledge), in its modern form it is a totaly different way of thinking. One requires pure Faith backed up with no proof and the ability to beleive in the infallibility of a book that contradicts itself, while the other is based around proof and logic with methods to ensure the reliability of those proofs.\n \n Or are you after specific examples?\n \n Of topic, your posts have become increasingly hard to understand SGLaine, checking the spelling and punctuation would go a long way to help.", 
   {}, 
   50783, 
   null, 
   1084927080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Science VS Religin ??????? Is it a good thing?", 
  "url": "http://www.4forums.com/political/religion-debates/2418-science-vs-religin-good-thing.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 2418, 
  "discussion_files": [
   [
    "21074.html", 
    "http://www.4forums.com/political/religion-debates/2418-science-vs-religin-good-thing-print.html"
   ], 
   [
    "21075.html", 
    "http://www.4forums.com/political/religion-debates/2418-science-vs-religin-good-thing-3-print.html"
   ], 
   [
    "21076.html", 
    "http://www.4forums.com/political/religion-debates/2418-science-vs-religin-good-thing-2-print.html"
   ]
  ], 
  "identifier": 2418
 }
]