[
 [
  [
   2426, 
   null, 
   "Broker", 
   "Like in 1996 when France wouldn't stop testing of nuclear weapons in the Pacific, and like in 1986 when France wouldn't allow the US to use their airspace to bomb Libya, we should boycott France yet again. \n \n Stop buying French products! Choose another brand over anything French. This is our chance to hurt the French economy for all they have done and are doing for Iraq and for almost destroying NATO. \n \n Everyone makes a difference.", 
   {
    "post_info": {
     "post_title": "Boycott France!"
    }
   }, 
   null, 
   null, 
   1045519080.0
  ], 
  [
   2430, 
   null, 
   "fallingupwards", 
   "yeah sure, lets go ahead and forget all of our allies. after all, we are the only important country in the world and we dont need any allies.", 
   {}, 
   2426, 
   null, 
   1045526520.0
  ], 
  [
   2433, 
   null, 
   "Broker", 
   "France is no longer much of an ally, are they?", 
   {}, 
   2426, 
   null, 
   1045528140.0
  ], 
  [
   2441, 
   null, 
   "fallingupwards", 
   "and that is because we are acting unilaterally and we dont give a XXXX what our allies think", 
   {}, 
   2426, 
   null, 
   1045530660.0
  ], 
  [
   2447, 
   null, 
   "Broker", 
   "We have eighteen nations on our side. Stop saying we are acting unilaterally. That's an excuse they're using. \n \n I think France just wants to feel power by trying to stand up to us. They give us a hastle on everything. I like what someone said on the news...we'd say white and they'd say black, we'd say up and they'd say down.", 
   {}, 
   2426, 
   null, 
   1045533540.0
  ], 
  [
   2448, 
   null, 
   "Broker", 
   "We know what our allies think, and the majority of all of our allies support us. No one cares what Germany says because the chancellor played on anti-American feelings to get reelected. Britain's government is with us. France always does this.", 
   {}, 
   2426, 
   null, 
   1045533660.0
  ], 
  [
   2455, 
   null, 
   "Stormin Norman", 
   "yeah sure, lets go ahead and forget all of our allies\n\n \n Allies? That's a good one.\n \n \n'Let's boycott France'\n\n \n I already do. We should also include the Canadians in our boycott. I was up there last summer and the anti-Americanism was too the extreme. I felt like a traitor for giving those cannucks my money after hearing their opinions about my country. Rest assured, I won't make the mistake twice.", 
   {}, 
   2426, 
   null, 
   1045539480.0
  ], 
  [
   2459, 
   null, 
   "fallingupwards", 
   "i want a list of the 18 countries now!! all you do is say we have 18 countries on our side....well who are they????", 
   {}, 
   2426, 
   null, 
   1045541820.0
  ], 
  [
   2467, 
   null, 
   "Stormin Norman", 
   "Here is a short list. In no way is this the extent of our support or opposition. \n \n Supporters include:\n \n Italy, Spain, Australia, Britain, Israel, Japan, Kuwait, Portugal, Qatar, Romania, While Nato is more or less divided on the issue\n \n Countries that wish to try other means:\n \n Canada, Saudi Arabia, Turkey\n \n Opposition:\n \n China, Russia, Syria, France, Germany\n \n source:http://uk.news.yahoo.com/030216/80/dtcm7.html", 
   {}, 
   2426, 
   null, 
   1045544640.0
  ], 
  [
   2470, 
   null, 
   "fallingupwards", 
   "uh oh, better watch out for that powerful kuwait and qatar army!!! and who can forget portugal and romania!!!!! they have very powerful armies!!! italy and spain have not been a world power since the 15th and 16th centuries. tony blair supports us, but the people of britain do not. \n \n meanwhile, we are ignoring the worlds largest army (china) and another strong world power in russia. france and germany are important allies as well.\n \n the only influential country on that whole list of supporters is britain. and its actually more tony blair because the british do not support the united states.", 
   {}, 
   2426, 
   null, 
   1045545000.0
  ], 
  [
   2471, 
   null, 
   "Stormin Norman", 
   "Israel, Qutar, and Kuwait are all important allies in the region. Israeli forces are strong, while Kuwait and Qutar allow a great staging ground to launch an attack. The juxtaposition of these countries to Iraq are most important. I think the size of their armies is a non-issue, as our forces are fully capable and do not need the help of any other forces.\n \n You are failing to see the point. The reason we want supporters rest more or less in the diplomatic arena rather than the need for military support. Come on! As a student of history, you should have a better grasp over the geopolitical game.\n \n As far as allies go, I would much rather have the unwaivering support of small countries than big countries who are out to stab you in the back. Therefore, your claim that Germany and France are important allies is a false assertion. I challenge you to back that claim up with anything resembling a reason why we need them. France does nothing for us, and our bases in Germany could easily be moved to a country like Spain, Italy, or possibly Slovakia.\n \n China is going to do what its going to do. It would be foolish to operate out of fear of their large under-equiped army. Besides I hardly think they care to disrupt the current trade imbalance they have with the United States, right now. Our business is the only reason their communist state has not failed, like that of the Soviet Union. We are the driving force of their economy, and the reason it has been growing at a rate of roughly 10% in recent years.", 
   {}, 
   2426, 
   null, 
   1045545840.0
  ], 
  [
   2472, 
   null, 
   "sarablaze", 
   "Falling, remember, one reason China is a thret is because of their missle guidence system.\n By the way can anyone tell me who gave China the missle guidence system?", 
   {}, 
   2426, 
   null, 
   1045547160.0
  ], 
  [
   2476, 
   null, 
   "Stormin Norman", 
   "Clinton! It must have been a quid pro quo for all those Chinese campaign contributions he was accepting.", 
   {}, 
   2426, 
   null, 
   1045548480.0
  ], 
  [
   2496, 
   null, 
   "Broker", 
   "Russia a world power? Good one! How can you call an emerging economy a world power? Russia was a world power, but not now.", 
   {}, 
   2426, 
   null, 
   1045580880.0
  ], 
  [
   2529, 
   null, 
   "sarablaze", 
   "I personallt think the reason some of the countries are not with us on this is because Clinton made us look like the NSCUP!\n (Nation of Stupid Crazy Ustable People)", 
   {}, 
   2426, 
   null, 
   1045617960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Boycott France!", 
  "url": "http://www.4forums.com/political/current-events-debates/242-boycott-france.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 242, 
  "discussion_files": [
   [
    "2575.html", 
    "http://www.4forums.com/political/current-events-debates/242-boycott-france-print.html"
   ]
  ], 
  "identifier": 242
 }
]