[
 [
  [
   50345, 
   null, 
   "Rogue790", 
   "Hi everyone!\n I was challanged by Mr Jack to provide evidence for a Global Flood in the time of Noah about 4,500 years ago. Although not a scientist myself, I will display some of the evidence that I know of and will add more as new information as I gather new sources. I would also like you people to kindly add your views, either positive or negative to make this an educational and friendly thread in which to post your views.\n \n Here are only a few evidences that I know of (geology is not one of my strong suits):\n * There are many fossil beds that are found all over the world in sedimentary rock that was deposited by water so rapidly as to bury some creatures while still giving birth and eating food. \n \n * Fossil \"graveyards\" around the world, where the bones of many animals were washed together, buried and fossilized, are evidence for a watery cataclysm like the Flood. For instance, sea animals have been found burried with animals from the land. These animals don't *normally* live together, so why should they be burried together?\n \n * There is abundant evidence that many of the rock strata were laid down quickly, one after the other, without significant time breaks between them. For example, preservation of ripple marks requires rapid burial, as in the Flood (e.g. lower Triassic rock, England). Folding of sedimentary rock without cracking or heating, such as at Eastern Beach, Auckland, New Zealand, suggests the folding occurred before the sand and mud had time to turn into stone, consistent with rapid deposition during the Flood.\n \n * Polystrate fossils (ones which traverse many strata) speak of very quick deposition of the strata. \n \n * The scaracity of erosion, soil must have been deposited in quick succession. \n \n * Dykes (walls) and pipes (cylinders) of sandstone which connect with the same material many layers beneath show that the layers beneath must have been still soft, and contained much water. That the sandstone could be squeezed up through cracks above to form the \"clastic\" dykes and pipes, again shows rapid deposition of many strata.\n \n * The three sisters in Australia is evidence of a catastrophic flood (please ask me to extrapolate on this if you want to).\n \n * Uluru in the heart of the Australian Outback is another example of a catastrophic flood (once again ask me to extrapolate on this if you want to).\n \n * The same basic story of a Global Flood is found in hundreds of cultures around the world, including hte Australian Aboriginals.\n \n * Coal can form quickly when forests and marine creatures are buried rapidly. There are extensive depositives of coal throughout the whole world which indicate a Global Flood with catastrophic conditions.\n \n * See John Morris' 1994 book \"The Young Earth\" and S. Austin's 1994 \"Grand Canyon: Monument to Catastrophe\", Institute for Creation Research USA for more evidences for Noah's Flood. [Many information from above came from \"The Updated & Expanded Answers Book\".]\n \n I will add more information as I find it. Thanking you all ahead for your participation and hopefully no name calling or anything or the sort. Just focus on the evidence produced please. Have fun. emoticon_smile", 
   {
    "post_info": {
     "post_title": "Noah's Flood, fact or fiction?"
    }
   }, 
   null, 
   null, 
   1084806720.0
  ], 
  [
   50379, 
   null, 
   "Valthonis", 
   "What about the amount of water the earth holds and how much it would take to flood the earth?", 
   {}, 
   50345, 
   null, 
   1084814760.0
  ], 
  [
   50414, 
   null, 
   "sinjin", 
   "The \"Institute for Creation Research USA\" is not a reputable scientific organization. Their research's conclusions are foregone. There isn't enough water to cover the Himalayas or other large mountain ranges even with no polar ice caps.", 
   {}, 
   50379, 
   null, 
   1084821360.0
  ], 
  [
   50418, 
   null, 
   "jitobear", 
   "There is good evidence of a very large flood in the middle east, however. This would have been the whole world to the Bible writiers - and certainly those who actually knew Yaweh.", 
   {}, 
   50414, 
   null, 
   1084822080.0
  ], 
  [
   50429, 
   null, 
   "Big Orn", 
   "There is good evidence of a very large flood in the middle east, however. This would have been the whole world to the Bible writiers - and certainly those who actually knew Yaweh.\n\n Let's hear more. Remember; it is estimated that over 6 billion people were on earth at the time of the flood.\n \n Also, Genesis 1 : 6 thru 1 : 10 - Water was above and below the firmament of Heaven. What happened to the waters that were above the firmament? Was this used for the deluge that covered the earth?\n \n It had never rained before The Flood. Why, if someone made up this story, would they have said such a thing? Wouldn't it be much more believeable if they would have said, \"There had never been such a rain as this...\"?", 
   {}, 
   50418, 
   null, 
   1084824180.0
  ], 
  [
   50454, 
   null, 
   "thebootfitter", 
   "Remember; it is estimated that over 6 billion people were on earth at the time of the flood.\n\n Are you serious? Somebody actually believes the earth was populated with 6 billion people 4,500 years ago? Who makes that estimate?", 
   {}, 
   50429, 
   null, 
   1084827360.0
  ], 
  [
   50456, 
   null, 
   "Haulingboat", 
   "There is good evidence of a very large flood in the middle east, however. This would have been the whole world to the Bible writiers - and certainly those who actually knew Yaweh.\n\n I was thinking of this point also. In a time when the world was believed to be no bigger than the distant horizon a cold front and the accompaning thunderstorms like the ones that now span 1/3 of the USA would have covered what they considered the entire world.", 
   {}, 
   50418, 
   null, 
   1084827900.0
  ], 
  [
   50472, 
   null, 
   "Big Orn", 
   "Are you serious? Somebody actually believes the earth was populated with 6 billion people 4,500 years ago? Who makes that estimate?\n\n I posted this before I read your link about Quinn's theory.\n \n So, you are saying that from the time man was created to the time of Noah, there is no way 6 billion people could inhabit the earth?", 
   {}, 
   50454, 
   null, 
   1084829700.0
  ], 
  [
   50483, 
   null, 
   "thebootfitter", 
   "So, you are saying that from the time man was created to the time of Noah, there is no way 6 billion people could inhabit the earth?\n\n I'm not saying that it couldn't have happened. Theoretically, it is possible... From one couple having eight children (four male/four female), and each of their female children having eight children (again, equal gender split), and assuming an average life-expectancy of about 60 years, it would only take about 17 generations (340 years) to exceed six billion individuals.\n \n However, even 50 years ago, we didn't produce enough food on this earth to feed six billion people. Fifty years ago, we had significant machinery to assist us in food production, and we didn't produce that much food. I highly doubt there was enough food produced 4,500 years ago to feed six billion people.\n \n If you are seriously asserting that there were six billion people inhabiting the earth at that time, I have to ask for evidence that there was sufficient food for that many people.\n \n But I'm still curious... Who is making that estimate?", 
   {}, 
   50472, 
   null, 
   1084830840.0
  ], 
  [
   50488, 
   null, 
   "Big Orn", 
   "I'm not saying that it couldn't have happened. Theoretically, it is possible... From one couple having eight children (four male/four female), and each of their female children having eight children (again, equal gender split), and assuming an average life-expectancy of about 60 years, it would only take about 17 generations (340 years) to exceed six billion individuals.\n \n However, even 50 years ago, we didn't produce enough food on this earth to feed six billion people. Fifty years ago, we had significant machinery to assist us in food production, and we didn't produce that much food. I highly doubt there was enough food produced 4,500 years ago to feed six billion people.\n \n If you are seriously asserting that there were six billion people inhabiting the earth at that time, I have to ask for evidence that there was sufficient food for that many people.\n \n But I'm still curious... Who is making that estimate?\n\n I'll find the source, hopefully today sometime on the Net...maybe.\n \n But, you have to remember that before the flood the earth had no deserts, there was no mass harvest of forests; perfect natural balance. It was a time of plenty. The dinosaurs had already died out via a violent disturbance of the earth&#8217;s surface millions of years before. The earth was encapsulated by a membrane (waters above the firmament) that we can only imagine today, giving the earth a greenhouse effect; perfect growing conditions daily. There were no &#8220;bad weather&#8221; days.\n It could have sustained 6 billion people.", 
   {}, 
   50483, 
   null, 
   1084831620.0
  ], 
  [
   50491, 
   null, 
   "Haulingboat", 
   "I'll find the source, hopefully today sometime on the Net...maybe.\n \n But, you have to remember that before the flood the earth had no deserts, there was no mass harvest of forests; perfect natural balance. It was a time of plenty. The dinosaurs had already died out via a violent disturbance of the earth's surface millions of years before. The earth was encapsulated by a membrane (waters above the firmament) that we can only imagine today, giving the earth a greenhouse effect; perfect growing conditions daily. There were no \"bad weather\" days.\n It could have sustained 6 billion people.\n\n \n \n WHAT???? Where the..... \n \n What did you just say? Where did you get this nugget of info?", 
   {
    "unicode_changes_made": true
   }, 
   50488, 
   null, 
   1084831860.0
  ], 
  [
   50492, 
   null, 
   "unkerpaulie", 
   "What about the amount of water the earth holds and how much it would take to flood the earth?\n\n actually i have a fuzzy theory on how the water on the earth could actually cover land. most scientist agree that the 7 continents were at one point one single flat super-continent (gondowaland, i think). after the continent sections drifted apart, only then did the himalayas and other major mountain ranges and ocean gorges formed. so it could have been possible that all land mass could have been covered by a heavy enough global rain shower, at least until it all drained off. \n \n however, scientists argue that this supercontinent existed millions of years before noah, so yall can scrap that idea...\n \n unless the scientists were wrong and the continental split happened quickly, while the earth was under water...\n \n nevermind... like i said, a fuzzy theory", 
   {}, 
   50379, 
   null, 
   1084831920.0
  ], 
  [
   50496, 
   null, 
   "Big Orn", 
   "WHAT???? Where the..... \n \n What did you just say? Where did you get this nugget of info?\n\n Easy now, Haulingboat, I have theory, it's just a theory, no proof.\n \n Take it easy... emoticon_wow", 
   {}, 
   50491, 
   null, 
   1084832340.0
  ], 
  [
   50497, 
   null, 
   "Big Orn", 
   "http://www.freewebs.com/bibletruth/noahsflood.htm\n The above is not the one I used to get the info, but it&#8217;s close&#8230;\n \n And, no, this is not where I got most of my info for my theory...if I told ya' I'd have to kill ya'. emoticon_smile \n \n I&#8217;ll look around some more&#8230;", 
   {}, 
   50496, 
   null, 
   1084832460.0
  ], 
  [
   50509, 
   null, 
   "thebootfitter", 
   "http://www.freewebs.com/bibletruth/noahsflood.htm\n The above is not the one I used to get the info, but it's close...\n\n \n Thanks for the laugh! :-) Not that this was the only thing, but here is an excerpt from this site that illustrates the author's ignorance:\n \n \nIf this trend of a billion tons of water a year has been continuing since the Flood, an amazing sum of 5 x 10^12, or 5,000,000,000,000, or 5 TRILLION TONS of water have been absorbed in the last five thousand years. To put this into more understood terms, since a gallon of water weighs a couple, say four, pounds, in the last five thousand years, the earth has absorbed 5,000,000,000,000,000, or 5 QUADRILLION GALLONS of water! Of course the water from the Flood wouldn't be here today!\n\n First of all, pure water weighs approximately 8.34 lbs per gallon (not 2-4, as the author suggests).\n \n Second of all, even if we take their inaccurate estimate of 4 lbs per gallon, their math is off by a factor of 2. In other words, they used the very inaccurate estimate of 2 lbs per gallon of water. \n \n C'mon... if the author doesn't even know how much a gallon of water weighs, and then tries to fool you with faulty math and the ol' switcheroo (\"water weighs a couple, say four, pounds\" and then they use 2 lbs in their calculations), can you really put much faith in the rest of what they say?\n \n Or can we expect the author to create another 'theory' that suggests that water didn't weigh as much back then, because the molecules that make up water were still in their infancy and hadn't matured, so they didn't weigh as much as they do now?\n \n Additionally, I'd be willing to bet that if we looked at that article in Discovery that we would find that the author of this website took the Discovery article out of context. Even if that's not the case, the author makes the assumption that \"If this trend of a billion tons of water a year has been continuing since the Flood...\" What if that trend hasn't been continuing since the flood? What does the Discovery article suggest?\n \n And if that isn't enough... the total amount of water contained on the earth right now is 3.26 x 10^20 gallons. In other words, the amount that has been 'soaked' up at the bottom of the oceans in 5,000 years (according to the author's assumption) is approximately 0.00037% of the total amount of water on the earth. I don't think that would amount to a global flood if it were spit back up by the bottoms of the oceans.\n \n To me... this sounds like a typical creationist's ploy (either intentional or through ignorance) of taking things out of context, misrepresenting the facts, etc... This is one example. In one article. That supposedly contains 'evidence' of a global flood. Hmmm...", 
   {
    "unicode_changes_made": true
   }, 
   50497, 
   null, 
   1084835760.0
  ], 
  [
   50512, 
   null, 
   "Big Orn", 
   "Thanks for the laugh! :-) Not that this was the only thing, but here is an excerpt from this site that illustrates the author's ignorance:\n \n \n First of all, pure water weighs approximately 8.34 lbs per gallon (not 2-4, as the author suggests).\n \n Second of all, even if we take their inaccurate estimate of 4 lbs per gallon, their math is off by a factor of 2. In other words, they used the very inaccurate estimate of 2 lbs per gallon of water. \n \n C'mon... if the author doesn't even know how much a gallon of water weighs, and then tries to fool you with faulty math and the ol' switcheroo (\"water weighs a couple, say four, pounds\" and then they use 2 lbs in their calculations), can you really put much faith in the rest of what they say?\n \n Or can we expect the author to create another 'theory' that suggests that water didn't weigh as much back then, because the molecules that make up water were still in their infancy and hadn't matured, so they didn't weigh as much as they do now?\n\n I posted it for the population part...still looking for a better source...\n \n I haven't seen a good source for that info on the Net, it may not be here.", 
   {}, 
   50509, 
   null, 
   1084836060.0
  ], 
  [
   50515, 
   null, 
   "sglaine", 
   "http://www.freewebs.com/bibletruth/noahsflood.htm\n The above is not the one I used to get the info, but it's close...\n \n And, no, this is not where I got most of my info for my theory...if I told ya' I'd have to kill ya'. emoticon_smile \n \n I'll look around some more...\n\n Sorry Ron I read the web page that you posted and I don't buy it.", 
   {
    "unicode_changes_made": true
   }, 
   50497, 
   null, 
   1084836240.0
  ], 
  [
   50524, 
   null, 
   "Big Orn", 
   "Sorry Ron I read the web page that you posted and I don't buy it.\n\n Yes, Sean, I did post it, but in reference to the population of the earth only.\n \n My intentions were honest and I qualified it in doing so.\n \n Live and Learn, I guess.", 
   {}, 
   50515, 
   null, 
   1084836780.0
  ], 
  [
   50529, 
   null, 
   "thebootfitter", 
   "Yes, Sean, I did post it, but in reference to the population of the earth only. \n\n But if their 'calculations' could be so far off in reference to the amount of water on the earth, do their calculations regarding the number of people on the earth have any real credibility?\n \n P.S. Check out this link for the estimated historical population of the earth back to about 10,000 years ago that is based on scientific evidence with references to back it up:\n http://www.census.gov/ipc/www/worldhis.html", 
   {}, 
   50524, 
   null, 
   1084837440.0
  ], 
  [
   50530, 
   null, 
   "Haulingboat", 
   "Easy now, Haulingboat, I have theory, it's just a theory, no proof.\n \n Take it easy... emoticon_wow\n\n Sorry Big, I did not mean for it to read with the offence that it did. However, I do have some trouble believing that the earht was a perfect tropical utopia from tip to tip. If I understand your post correctly that is what you suggested. A planet that had no desert and was ideal for growing conditions from bow to stern. Physics dictate otherwise.", 
   {}, 
   50496, 
   null, 
   1084838040.0
  ], 
  [
   50532, 
   null, 
   "Big Orn", 
   "But if their 'calculations' could be so far off in reference to the amount of water on the earth, do their calculations regarding the number of people on the earth have any real credibility?\n\n No.\n They use the population from Adam to Noah as their basis. I can't believe in those figures, but it was in allusion to that amount I was getting at.\n \n There is no telling how many people were on earth before Adam was formed. That single figure is what has eluded me. From there basic math will help...\n \n ...if you know how to apply it. emoticon_smile", 
   {}, 
   50529, 
   null, 
   1084838220.0
  ], 
  [
   50533, 
   null, 
   "Big Orn", 
   "Sorry Big, I did not mean for it to read with the offence that it did. However, I do have some trouble believing that the earht was a perfect tropical utopia from tip to tip. If I understand your post correctly that is what you suggested. A planet that had no desert and was ideal for growing conditions from bow to stern. Physics dictate otherwise.\n\n Yea, I know. It's not only hard to believe, but very hard to prove.\n \n Getting the pieces to fall in place sometimes makes a man look the fool. ;)", 
   {}, 
   50530, 
   null, 
   1084838400.0
  ], 
  [
   50612, 
   null, 
   "Mr Jack", 
   "Hi Rogue,\n \n \n* There is abundant evidence that many of the rock strata were laid down quickly, one after the other, without significant time breaks between them. For example, preservation of ripple marks requires rapid burial, as in the Flood (e.g. lower Triassic rock, England). Folding of sedimentary rock without cracking or heating, such as at Eastern Beach, Auckland, New Zealand, suggests the folding occurred before the sand and mud had time to turn into stone, consistent with rapid deposition during the Flood.\n\n \n This is simply false. Rock can be folded under pressure. This has been proven by lab experiment. However there are many features in sedimentary rocks that cannot be formed quickly, for example, fossil trackways.\n \n \n* Polystrate fossils (ones which traverse many strata) speak of very quick deposition of the strata.\n\n \n This is false. http://www.talkorigins.org/faqs/polystrate/trees.html\n \n \n* The scaracity of erosion, soil must have been deposited in quick succession.\n\n \n I'm not sure what you're talking about here.\n \n \n* The three sisters in Australia is evidence of a catastrophic flood (please ask me to extrapolate on this if you want to).\n \n * Uluru in the heart of the Australian Outback is another example of a catastrophic flood (once again ask me to extrapolate on this if you want to).\n\n \n Go on.\n \n \n* The same basic story of a Global Flood is found in hundreds of cultures around the world, including hte Australian Aboriginals.\n\n \n There are flood stories carried by many cultures, however they don't match in the details with noah flood myth. Not one mentions noah by name.\n \n \n* Coal can form quickly when forests and marine creatures are buried rapidly. There are extensive depositives of coal throughout the whole world which indicate a Global Flood with catastrophic conditions.\n\n \n Reference please.\n \n \n* See John Morris' 1994 book \"The Young Earth\" and S. Austin's 1994 \"Grand Canyon: Monument to Catastrophe\", Institute for Creation Research USA for more evidences for Noah's Flood. [Many information from above came from \"The Updated & Expanded Answers Book\".\n\n \n The Grand canyon could not have been created by a flood event, the geology is all wrong: http://www.talkorigins.org/faqs/icr-science.html\n \n The flood explains nothing which cannot be explained by other, better-supported means and directly contradicts vast swathes of evidence:\n \n Biodivesity and the fossil record are not consistent with the flood.\n Genetic profiling is not consistent with the flood (in humans and animals)\n The Ark could not hold all animal life.\n A global mark would have left marks across the entire globe at a consistent time period; these marks are not found.", 
   {}, 
   50345, 
   null, 
   1084879980.0
  ], 
  [
   50616, 
   null, 
   "montalban", 
   "Hi Rogue,\n \n \n \n This is simply false. Rock can be folded under pressure. This has been proven by lab experiment. However there are many features in sedimentary rocks that cannot be formed quickly, for example, fossil trackways.\n \n \n \n This is false. http://www.talkorigins.org/faqs/polystrate/trees.html\n \n \n \n I'm not sure what you're talking about here.\n \n \n \n Go on.\n \n \n \n There are flood stories carried by many cultures, however they don't match in the details with noah flood myth. Not one mentions noah by name.\n \n \n \n Reference please.\n \n \n \n The Grand canyon could not have been created by a flood event, the geology is all wrong: http://www.talkorigins.org/faqs/icr-science.html\n \n The flood explains nothing which cannot be explained by other, better-supported means and directly contradicts vast swathes of evidence:\n \n Biodivesity and the fossil record are not consistent with the flood.\n Genetic profiling is not consistent with the flood (in humans and animals)\n The Ark could not hold all animal life.\n A global mark would have left marks across the entire globe at a consistent time period; these marks are not found.\n\n \n I think that what you two are doing is simply trading evidences. Saying someone is 'wrong' and directing them to a atheist web-site is not proof. You should merely be saying, 'here is an alternative argument'\n \n I say this because I can access a number of science posts that state the exact opposite of what you say, and show that they can find evidence for a flood.", 
   {}, 
   50612, 
   null, 
   1084880940.0
  ], 
  [
   50626, 
   null, 
   "Mr Jack", 
   "Reference them then.", 
   {}, 
   50616, 
   null, 
   1084885980.0
  ], 
  [
   50629, 
   null, 
   "montalban", 
   "Reference them then.\n\n \n I have extensively quoted Milton et al in the past and won't again.\n \n What you miss is the point that you and your nemesis are simply trading web-sites. Now you are asking me to do the same.\n \n What I am suggesting here is instead of arguing, that is, constructing a rational string of ideas into a stance, you are just saying\n \n \"False: see http....\"\n \n Now you invite me to do the same thing. I don't wish to, I was hoping rather to see you present a case.", 
   {}, 
   50626, 
   null, 
   1084887660.0
  ], 
  [
   50633, 
   null, 
   "Rogue790", 
   "To sinjin and to Mr Jack (for more information on some of my points that I got from several creationist resources):\n \n The \"Institute for Creation Research USA\" is not a reputable scientific organization. Their research's conclusions are foregone. There isn't enough water to cover the Himalayas or other large mountain ranges even with no polar ice caps. \n \n For one, we are not here to disucss an organisation's information in this thread - although I believe it to be quite good.\n \n In response to your last claim about there not being enough water to cover the Himalayas or other large mountain ranges, I agree with your assertion. It is correct. But you have made several fatal errors with your argument. For one, you are assuming that the pre-Flood landscape and land features are the same as the post-Flood land features (i.e. after the Flood) which is wrong. But in reality, the pre-Flood geography would have been radically different, i.e. we would have had no tall mountains (from Biblical framework).\n \n The Bible only refers to \"high hills\", and the mountains today wre formed only towards the end of, and after, the Flood by collision of the tectonic plates and the associated upthrusting. In support of this, the layers that form the uppermost parts of Mt Everest themselves of fossil-bearing, water-deposited layers. This uplift of the new continental land-masses from under the Flood waters would have meant that, as the mountains rose and the valleys sank (as Psalm 104 suggests), the waters would have rapidly drained off the newly emerging land surfaces. The collapse of natural dams holding back the floodwaters on the land would also have caused catastrophic flooding. Such rapid movement of large volumes of water would have caused extensive erosion and shaped the basic features of today's Earth surface. \n \n As a result of this extensive erosion (caused by the retreating Flood waters) it is not hard to envisage the rapid carving of the landscape features that we see on the Earth today, including places such as the Grand Canyon of the U.S.A. The present shape of Uluru, a sandstone monolith in central Australia, is the result of erosion, following the tilting and uplife, of previously horizontal beds of water-laid sand. The feldspar-rich sand that makes up Uluru must have been deposited very quickly and recently. Long-distance transport of the sand would have caused the grains to be rounded and sorted, but we don't see this at Uluru, i.e. they are jagged and unsorted. Which indicates rapid transportation (like through a cataclystic Flood). If they had sat accumulating slowly in a lake bed drying in the sun over eons of years, which is the story told in the geological display at the park centre, the feldspar would have weathered into clay. Likewise, if Uluru had sat in hte once-humid area of central Australia for millions of years, it would have weathered to clay. But besides the \"fact\" that it has reportedly been exposed to weathering for hundreds of millions of years, the feldspars are still very fresh, as though they were exposed only yesterday. \n \n Similarly, the nearby Kata Tjuta are composed of an unsorted mixture of large boulders, sand and mud, indicating that the material must have been transported and deposited very rapidly. \n Receding floodwaters eroded the land, creating river valleys. This explains why rivers are often so much smaller than the valleys they flow in today - they did not carve the valleys. The water flow that carved out the river valleys must have been far greater than the volume of water we see flowing in the rivers today. This is consistent with voluminous Flood waters draining off the emerging land surfaces at the cose of Noah's Flood, and flowing into the rapidly sinking, newly prepared, deep ocean basins. \n [Above information from the \"Updated and Expanded Answers Book\" by AiG, p. 165-166.]\n \n I believe your original question was \"Where did all the waters come from?\" There have been many different creationist responses to this. For a detailed response to this I would suggest that you look at the article Noah's Flood - Where did all the water come from? . At the moment, I am not feeling the best so I will not be summarising the main points and giving you a direct answer to your question. Sorry. It is never pleasent to feel sick.", 
   {
    "post_info": {
     "post_title": "Re: Where did all the waters come from?"
    }
   }, 
   50414, 
   null, 
   1084888920.0
  ], 
  [
   50635, 
   null, 
   "montalban", 
   "Although this will be unhelpful to most, esp. Mr Jack, I must state the Orthodox Christian perspective, afer reading Rogue's reference at\n http://www.answersingenesis.org/Home/Area/AnswersBook/flood12.asp\n \n Firstly, I agree with the Bible's account of the flood. It's in the Bible, and has been greatly commented upon by the Holy Fathers. (which interestingly, AIG also uses....\n http://www.answersingenesis.org/Home/Area/magazines/tj/docs/v16n3_mortenson.asp)\n \n BUT, as an Orthodox Christian, we accept the flood as fact without recourse to rationalising about where the waters come from etc.\n \n This is not to say that I disagree with the esence of Rogue's source, it could be perfectly true that it happened, in that way.... just that we would not present that type of argument.\n \n Our argument is, it happened.\n \n It is in the Bible, which is the inspired word of God. It is presented as an actual event - as opposed to an allegorical or metaphorical tale. Therefore it is true.", 
   {}, 
   50633, 
   null, 
   1084889880.0
  ], 
  [
   50656, 
   null, 
   "sinjin", 
   "I can't imagine how I can pursue this if I must grant the possibility that the Himalayas have been uplifted in just the last few thousand years. That is beyond my rational conception. Are not many of the fossils on the slopes of the Himalayas of creatures extinct for a very long time? But I guess if I must allow that \"a very long time\" might not exist either, well uno.", 
   {}, 
   50635, 
   null, 
   1084896300.0
  ], 
  [
   50657, 
   null, 
   "sinjin", 
   "It is in the Bible, which is the inspired word of God. It is presented as an actual event - as opposed to an allegorical or metaphorical tale. Therefore it is true.\n\n \n Can't argue with this illogic.", 
   {}, 
   50635, 
   null, 
   1084896540.0
  ], 
  [
   50676, 
   null, 
   "ungerdunn", 
   "I can't imagine how I can pursue this if I must grant the possibility that the Himalayas have been uplifted in just the last few thousand years.\n \n Exactly. It just isn't possible. In order to pretend that there is enough water on the earth to flood it, creationists just assert that there were no mountains (even though the Bible says there were) and that the mountains arose after the flood in only a few years. So creationists must once again ignore the laws of physics to make the flood possible. \"The mountains grew after the flood\" as an answer to \"where did the water go?\" creates a worse problem - where did the heat from the growing mountains go?", 
   {}, 
   50657, 
   null, 
   1084901640.0
  ], 
  [
   50685, 
   null, 
   "Ursus maritimus", 
   "The Bible only refers to \"high hills\", and the mountains today wre formed only towards the end of, and after, the Flood by collision of the tectonic plates and the associated upthrusting.\n\n Well, yes, I can assert anything is true if I am allowed to make up new science to explain it. As you may have noticed, rocks don't bend very easily - a sudden force (by \"sudden\" I even mean increasing the pressure on a rock over a time that may seem long to people) will shatter a rock. In the Himalayas, Rockies, Appalachians, we see that the strata are smoothly folded over long distances. This is only possible by applying great pressures over very long periods of time, at pretty high temperatures. A sudden collision of the continents at the end of the flood would produce very different geologic features.\n \n That is the difference between accepted geologic theories and creationist theories. Geologic theories rely on known scientific laws and principles, whereas the creationists have to either make up brand new scientific theories and principles (like the infamous changing speed of light) and/or ignore evidence that directly contradicts there hypotheses.", 
   {}, 
   50633, 
   null, 
   1084902360.0
  ], 
  [
   50702, 
   null, 
   "Waxy", 
   "\n The Bible only refers to \"high hills\", and the mountains today wre formed only towards the end of, and after, the Flood by collision of the tectonic plates and the associated upthrusting. In support of this, the layers that form the uppermost parts of Mt Everest themselves of fossil-bearing, water-deposited layers. This uplift of the new continental land-masses from under the Flood waters would have meant that, as the mountains rose and the valleys sank (as Psalm 104 suggests), the waters would have rapidly drained off the newly emerging land surfaces. The collapse of natural dams holding back the floodwaters on the land would also have caused catastrophic flooding. Such rapid movement of large volumes of water would have caused extensive erosion and shaped the basic features of today's Earth surface. \n \n As a result of this extensive erosion (caused by the retreating Flood waters) it is not hard to envisage the rapid carving of the landscape features that we see on the Earth today, including places such as the Grand Canyon of the U.S.A. The present shape of Uluru, a sandstone monolith in central Australia, is the result of erosion, following the tilting and uplife, of previously horizontal beds of water-laid sand. The feldspar-rich sand that makes up Uluru must have been deposited very quickly and recently. Long-distance transport of the sand would have caused the grains to be rounded and sorted, but we don't see this at Uluru, i.e. they are jagged and unsorted. Which indicates rapid transportation (like through a cataclystic Flood). If they had sat accumulating slowly in a lake bed drying in the sun over eons of years, which is the story told in the geological display at the park centre, the feldspar would have weathered into clay. Likewise, if Uluru had sat in hte once-humid area of central Australia for millions of years, it would have weathered to clay. But besides the \"fact\" that it has reportedly been exposed to weathering for hundreds of millions of years, the feldspars are still very fresh, as though they were exposed only yesterday. \n \n Similarly, the nearby Kata Tjuta are composed of an unsorted mixture of large boulders, sand and mud, indicating that the material must have been transported and deposited very rapidly. \n Receding floodwaters eroded the land, creating river valleys. This explains why rivers are often so much smaller than the valleys they flow in today - they did not carve the valleys. The water flow that carved out the river valleys must have been far greater than the volume of water we see flowing in the rivers today. This is consistent with voluminous Flood waters draining off the emerging land surfaces at the cose of Noah's Flood, and flowing into the rapidly sinking, newly prepared, deep ocean basins. \n [Above information from the \"Updated and Expanded Answers Book\" by AiG, p. 165-166.]\n\n \n Please. PLEASE, read an introductory Geology or Geography/Geomorphology textbook. Then we'll talk.\n \n Yikes.\n \n Waxy", 
   {}, 
   50633, 
   null, 
   1084903740.0
  ], 
  [
   50706, 
   null, 
   "Big Orn", 
   "I would like to address something here: God does not mind us delving into the past. It&#8217;s our choice and He&#8217;s not going to send hordes of angels out to prevent our research. Does it matter where we came from? I think so; it&#8217;s our nature. A teenager learns he/she is adopted, soon they wonder who their parents were and most want to find them. &#8220;Curiosity killed the cat,&#8221; is good for child-rearing and to promote the use of common sense, but doesn&#8217;t solve mysteries, discover cures for disease, nor does it facilitate the attempt for a better life.\n We know that Neanderthals existed, the remains have been found and DNA inspected. They are not the same species as the present humanoids, but close. Where did they come from? Monkeys? Absolutely not. There is no proof of that, hence the &#8220;missing link&#8221;. Did they co-exist with our ancestors? Yes. There is proof of that. Did they &#8220;get along&#8221;? Yes, there is also proof of that, albeit, still under investigation. Did they have a mind, i.e., brains that could reason like our ancestors? Sort of, but they lacked imagination, the basic requirement for improving one&#8217;s lifestyle. They knew nothing of making weapons, farming implements, etc. They did, I believe, learn some of this from us before they were all killed via the Flood.\n Since this debate began (not just this forum, but others, both on the net and in person) there have been two distinct sides. We all need to bring our thoughts, ideas, theories, to the table and expand on them as a unit or this will continue forever.\n \n Also I would like to apologize for the quick, thoughtless link I posted yesterday. That was an oversight and it really caused major problems with me and some of you. It will not happen again. Even though I stated that it was not my source of info, it invariably shed its light on me.\n \n So with that in mind, there could have been millions of humanoids on earth before Adam and Eve were formed. Our species, the humans with our DNA were created about 30 to 35 thousand years ago, then about 10 thousand years ago our direct ancestors were formed: Adam and Eve.\n \n Can we go from there and say that the whole earth was flooded in order to destroy all living things? Can we at least look at that? Maybe that the waters above the firmament opened up and poured out upon the earth while even more waters burst from the &#8220;deep&#8221;, as stated in the Bible?\n \n Or is the Flood just going to be something never discussed openly&#8230;except as a myth?", 
   {}, 
   50702, 
   null, 
   1084904220.0
  ], 
  [
   50752, 
   null, 
   "ungerdunn", 
   "The flood has been discussed openly and it is a myth, just as \"the waters above the firmament\" is a myth. There isn't enough water on the earth to flood the entire surface.", 
   {}, 
   50706, 
   null, 
   1084909200.0
  ], 
  [
   50764, 
   null, 
   "Big Orn", 
   "The flood has been discussed openly and it is a myth, just as \"the waters above the firmament\" is a myth. There isn't enough water on the earth to flood the entire surface.\n\n From what perspective? Show me where it has been discussed in that manner and I will be satisfied.\n \n And, of course, there's not enough water \"on the earth\" to flood the entire surface. That's what I'm driving at...", 
   {}, 
   50752, 
   null, 
   1084909680.0
  ], 
  [
   50844, 
   null, 
   "sglaine", 
   "The flood has been discussed openly and it is a myth, just as \"the waters above the firmament\" is a myth. There isn't enough water on the earth to flood the entire surface.\n\n Wow I heard that to just last week. Hey hey someones doing there home work. emoticon_xgood", 
   {}, 
   50752, 
   null, 
   1084924080.0
  ], 
  [
   50853, 
   null, 
   "sinjin", 
   "From what perspective? Show me where it has been discussed in that manner and I will be satisfied.\n \n And, of course, there's not enough water \"on the earth\" to flood the entire surface. That's what I'm driving at...\n\n \n I don't know the \"spigot in the sky\" one. Do tell.\n And does that imply the \"shopvac of the gods\" to take it away? emoticon_xangel", 
   {}, 
   50764, 
   null, 
   1084925100.0
  ], 
  [
   50923, 
   null, 
   "montalban", 
   "Can't argue with this illogic.\n\n \n How unkind.\n \n Yet your previous post says you can't imagine how the Himalayas could be recently formed... therefore you can express an unscientific belief in something not happening, but feel it is illogical when someone expresses a positive statement of faith.\n \n I see we have different concepts of 'logic'. Yours is, if you state it, it's logical.\n \n Bravo", 
   {}, 
   50657, 
   null, 
   1084959360.0
  ], 
  [
   50924, 
   null, 
   "montalban", 
   "Exactly. It just isn't possible. In order to pretend that there is enough water on the earth to flood it, creationists just assert that there were no mountains (even though the Bible says there were) and that the mountains arose after the flood in only a few years. So creationists must once again ignore the laws of physics to make the flood possible. \"The mountains grew after the flood\" as an answer to \"where did the water go?\" creates a worse problem - where did the heat from the growing mountains go?\n\n \n Just 'imagining' it can't happen though is not sufficient.\n \n We are dealing with a miracle, and you are tyring to judge it by your own criteria of what you think might be possible.\n \n You are applying an attempt to measure what is in essence imeasurable", 
   {}, 
   50676, 
   null, 
   1084960320.0
  ], 
  [
   50926, 
   null, 
   "montalban", 
   "I would like to address something here: God does not mind us delving into the past. It?s our choice and He?s not going to send hordes of angels out to prevent our research. Does it matter where we came from? I think so; it?s our nature. A teenager learns he/she is adopted, soon they wonder who their parents were and most want to find them. ?Curiosity killed the cat,? is good for child-rearing and to promote the use of common sense, but doesn?t solve mysteries, discover cures for disease, nor does it facilitate the attempt for a better life.\n We know that Neanderthals existed, the remains have been found and DNA inspected. They are not the same species as the present humanoids, but close. Where did they come from? Monkeys? Absolutely not. There is no proof of that, hence the ?missing link?. Did they co-exist with our ancestors? Yes. There is proof of that. Did they ?get along?? Yes, there is also proof of that, albeit, still under investigation. Did they have a mind, i.e., brains that could reason like our ancestors? Sort of, but they lacked imagination, the basic requirement for improving one?s lifestyle. They knew nothing of making weapons, farming implements, etc. They did, I believe, learn some of this from us before they were all killed via the Flood.\n Since this debate began (not just this forum, but others, both on the net and in person) there have been two distinct sides. We all need to bring our thoughts, ideas, theories, to the table and expand on them as a unit or this will continue forever.\n \n Also I would like to apologize for the quick, thoughtless link I posted yesterday. That was an oversight and it really caused major problems with me and some of you. It will not happen again. Even though I stated that it was not my source of info, it invariably shed its light on me.\n \n So with that in mind, there could have been millions of humanoids on earth before Adam and Eve were formed. Our species, the humans with our DNA were created about 30 to 35 thousand years ago, then about 10 thousand years ago our direct ancestors were formed: Adam and Eve.\n \n Can we go from there and say that the whole earth was flooded in order to destroy all living things? Can we at least look at that? Maybe that the waters above the firmament opened up and poured out upon the earth while even more waters burst from the ?deep?, as stated in the Bible?\n \n Or is the Flood just going to be something never discussed openly?except as a myth?\n\n \n \n You can use your mind to try to figure out all sorts of things, but only come up with more and more problems.\n \n This is the very problem the Israelites created.\n \n God gave them the Law, and then they'd go \"Okay, it says \"Thou shalt not kill\"... but surely God wouldn't be against self-defence.\n And, if he's in favour of self-defence, how about a pre-emptive strike.\n And if that's okay, how about if I repress my neighbours so that they won't even be in a position where I need to worry about a pre-emptive strike.\n \n And soon, after rationalising about these things you are so far removed from the original idea.\n \n On another note...\n \n Where'd did you get your ideas about Neanderthals?\n \n The idea of 'Neanderthal' has been in flux ever since they were discovered. \n \n You say Neanderthals are not the same species. Your conviction in a \n scientific fact can be supported by the evidences\n \n \n http://news.bbc.co.uk/1/hi/sci/tech/323657.stm\n states that they did\n http://www.geocities.com/acgyles/nean.html\n states that they didn't, but could well have.\n http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2003/03/10/MN40985.DTL\n is more definite that they didn't, but I've seen suggestions that a skull found in Portugal suggests it's an actual find that proves that they did.\n http://www.iowalum.com/atiowa/oct03/oct03.html\n more info at\n http://www.centredaily.com/mld/centredaily/news/6892030.htm\n \n Thus, travelling down the 'rational' path has lead to evidences providing us with answers that are mutually exclusive. Yet, you are trained to believe that science and rational thinking is superior than noetic notions.\n \n It is the product of the times to disparage religious faith.\n \n I have already felt this hate here, but a few posts ago. Someone said that my faith was illogical - yet this same writer said that he coudln't believe that the Himalayas were recently formed... thus his faith, he believes, is logical.", 
   {}, 
   50706, 
   null, 
   1084961220.0
  ], 
  [
   50937, 
   null, 
   "montalban", 
   "I wasn't not sure if this should be at the beginning of a new thread or not... but I get back to Noah's Ark somewhere along the way.\n \n There are several people who believe that man and dinosaur were contemporaries...\n http://www.apologeticspress.org/rr/rr2003/r%26r0302a.htm\n \n \"Carl Baugh, Ph.D., has excavated eleven dinosaurs (Acrocanthosaurus, Stegosaurus, Allosaurus, etc.), 475 dinosaur tracks, 86 human footprints, 7 cat prints, and other fossil remains - all in Cretaceous limestone. These excavations were professionally documented along the Paluxy River and various other international locations.\"\n http://www.creationevidence.org/general_info/gnrl_info.html\n \n I've seen someone's 'counter' aguemnt of saying that this is false, and then posting a web-site - which is located at http://www.talkorigins.org/faqs/paluxy.html*\n \n I'd like now to state that I am not presenting this as evidence for some science that I believe in.\n \n My interest lies in showing that 'science' has more than one face and is not the be-all and end-all of the path for man's understanding; I believe that knowledge of God, especially noetic understanding is far more important.\n (Often I am more interested in studies of knowledge, than the knowledge itself)\n \n One can find scientific facts that agree with what ever you want.\n \n I respect those Christians trying to persuade atheists about Biblical truth, however Biblical truth needs no scientific sanction.\n \n For instance - why should there be any 'evidence' of the great flood anyway? It was a miraculous event.\n \n *There's an interesting link from this site to one at\n http://www.talkorigins.org/faqs/paluxy/onheel.html\n \n where-by the writer gives a number of different explanations to the 'track' formations. This is an interesting article for two reasons...\n \n One, that the writer claims to have been 'open' to creationist arguments, which I find quite extraordinarily naive thing to say\n \"Although we were at the time open to creationist ideas and actually hoping to confirm the human track claims...\"\n To say that he would be open to the idea that would totally undermine Darwinian ideas of time is amazing.\n \n The person is a biologist, not a geologist, but claims to be able to ascertain how the tracks were formed. And then he goes to show that the tracks were made by a number of different processes, forgery, rain, other geographical phenomena etc (recall this fella is a biologist!). \n \"Claims of human tracks occurring alongside dinosaur tracks in Texas have not stood up to close scientific scrutiny, and in recent years have been largely abandoned even by most creationists. Although genuine dinosaur tracks are abundant in Texas, the alleged Paluxy \"man tracks\" involve a variety of misidentified phenomena\"\n \n So that what incredibly looks like a series of tracks, becomes according to him, a number of individual objects unrelated (except by proximity), each caused by totally different processes; a claim almost as hard to believe as that they were caused by an ancient man, considering too, that all the dinosaur tracks are accepted as dinosaur tracks, and not the products of the same shifting phenomenas.\n \n Funny that, two sets of prints side by side... one set are deemed genuine dinosaur tracks, the others, aren't 'tracks' in the sense that they were made by one individual, but are a series of marks caused by a shifting series of phenomena... a miracle!", 
   {
    "post_info": {
     "post_title": "Evidence That Humans And Dinosaurs Coexisted"
    }
   }, 
   50926, 
   null, 
   1084972380.0
  ], 
  [
   50948, 
   null, 
   "Big Orn", 
   "I don't know the \"spigot in the sky\" one. Do tell.\n And does that imply the \"shopvac of the gods\" to take it away? emoticon_xangel\n\n According to the Bible, which if I get away from the Bible all is lost as far as I&#8217;m concerned, the &#8220;spigot in the sky&#8221; was the &#8220;windows of Heaven&#8221;. The &#8220;shopvac of the gods&#8221; was the &#8220;great fountains of the deep&#8221; that broke up and gushed water, which, later, reopened and reclaimed the waters. As you can see, this was not a natural phenomenon.", 
   {}, 
   50853, 
   null, 
   1084974780.0
  ], 
  [
   50955, 
   null, 
   "Big Orn", 
   "You can use your mind to try to figure out all sorts of things, but only come up with more and more problems.\n\n That&#8217;s true. But I did not say that I was using my mind, but instead, the scriptures and what they have to say. Furthermore, if I cannot have a debate, in relation to the scriptures, with those who do not believe, I might as well be in another forum where only believers reside.\n \nThis is the very problem the Israelites created.\n God gave them the Law, and then they'd go \"Okay, it says \"Thou shalt not kill\"... but surely God wouldn't be against self-defence.\n And, if he's in favour of self-defence, how about a pre-emptive strike.\n And if that's okay, how about if I repress my neighbours so that they won't even be in a position where I need to worry about a pre-emptive strike.\n And soon, after rationalising about these things you are so far removed from the original idea.\n\n I had this discussion once with an old friend, who was a Jehovah&#8217;s Witness. I told him that God intends for us to defend ourselves and to defend Him and His Word. If a man enters my house, takes my family captive with intentions to harm and to kill, I will defend them until either myself or the intruder is dead. He also shook his head in disgust. \n \nOn another note...\n Where'd did you get your ideas about Neanderthals?\n The idea of 'Neanderthal' has been in flux ever since they were discovered. \n You say Neanderthals are not the same species. Your conviction in a \n scientific fact can be supported by the evidences&#8230;\n\n Those links are a good source of info. However, the name of that certain species has already been established: Neanderthals. I can only try to piece together portions of the Bible enough to convince someone to read then to believe, not to believe then read. As far as those early humanoids, I have to start and end with the Bible; that journey takes a path that winds around knowledge, wisdom and relating the scriptures. See Genesis 6 : 4, There were giants in those days; and also after that, when the sons of God came into the daughters of men, and they bare children to them, the same became mighty men which were of old, men of renown.\n \n Some of the evidence relating to a Neanderthal/Human interbreeding could simply be a mutation. To me there can only be one explanation &#8211; that being the above scripture.\n \nThus, travelling down the 'rational' path has lead to evidences providing us with answers that are mutually exclusive. Yet, you are trained to believe that science and rational thinking is superior than noetic notions.\n It is the product of the times to disparage religious faith.\n\n Honestly? I can be, and am, just as hardheaded as those that oppose me. In respect to this portion of your post, however, you have a point. But, my intentions are far from it.\n \nI have already felt this hate here, but a few posts ago. Someone said that my faith was illogical - yet this same writer said that he coudln't believe that the Himalayas were recently formed... thus his faith, he believes, is logical.\n I have also stated in other forums that there is no doubt (and it will always be so, I&#8217;m afraid) that our faith will never stand in the wisdom of men.", 
   {}, 
   50948, 
   null, 
   1084977420.0
  ], 
  [
   50972, 
   null, 
   "sinjin", 
   "I have already felt this hate here, but a few posts ago. Someone said that my faith was illogical - yet this same writer said that he coudln't believe that the Himalayas were recently formed... thus his faith, he believes, is logical.\n\n \n You confuse hate with dismay and what I found illogical was that if the Bible is presented as fact it is therefore true. It takes no \"faith\" to believe it took a great many years to form the Himilayas unless you believe acceptance of basic science to be an act of \"faith\" which I gather you do.", 
   {}, 
   50926, 
   null, 
   1084982040.0
  ], 
  [
   50974, 
   null, 
   "sinjin", 
   "One can find scientific facts that agree with what ever you want.\n \n\n \n Really? Not using the science I am familiar with.", 
   {}, 
   50937, 
   null, 
   1084982460.0
  ], 
  [
   50984, 
   null, 
   "Waxy", 
   "Just 'imagining' it can't happen though is not sufficient.\n \n We are dealing with a miracle, and you are tyring to judge it by your own criteria of what you think might be possible.\n \n You are applying an attempt to measure what is in essence imeasurable\n\n \n \nI have already felt this hate here, but a few posts ago. Someone said that my faith was illogical - yet this same writer said that he coudln't believe that the Himalayas were recently formed... thus his faith, he believes, is logical.\n\n \n First off, I can assure that there was no hate on sinjin's part, though I'm sure, like myself, he is somewhat frustrated/exasperated.\n \n We can measure the current rate at which the Himalyas are rising to within 1/10 of an inch in many places, same goes for the Rockies. We can measure the rate at which the sea floor is spreading with nearly the same degree of accuracy. We have conducted innumerable experiments on the rates and manner with which rocks deform.\n \n The processes that are and have been shaping our Earth are far from immeasurable, to suggest otherwise shows a lack of understanding of geologic principles and general earth sciences. \n \n To state that the Himalayas formed in the last 10,000 years is to abandon all objective science and data for faith in a miracle. \n \n To me, that's illogical. \n \n Waxy", 
   {}, 
   50924, 
   null, 
   1084984320.0
  ], 
  [
   50986, 
   null, 
   "Waxy", 
   "My interest lies in showing that 'science' has more than one face and is not the be-all and end-all of the path for man's understanding; I believe that knowledge of God, especially noetic understanding is far more important.\n (Often I am more interested in studies of knowledge, than the knowledge itself)\n\n \n I couldn't disagree more. Science, unfettered by agendas and beliefs, is purest form of human endeavours. It's what has gotten us where we are, and is what will enable our continued survival and understanding of our world.\n \n \nOne can find scientific facts that agree with what ever you want.\n\n \n Sinjin already addressed this, but if you'd like to find me some science that states water is spontaneously combustible, or that horses lay eggs, I'd love to read it.\n \n Waxy", 
   {}, 
   50984, 
   null, 
   1084984800.0
  ], 
  [
   50988, 
   null, 
   "Waxy", 
   "The person is a biologist, not a geologist, but claims to be able to ascertain how the tracks were formed. And then he goes to show that the tracks were made by a number of different processes, forgery, rain, other geographical phenomena etc (recall this fella is a biologist!). \n \"Claims of human tracks occurring alongside dinosaur tracks in Texas have not stood up to close scientific scrutiny, and in recent years have been largely abandoned even by most creationists. Although genuine dinosaur tracks are abundant in Texas, the alleged Paluxy \"man tracks\" involve a variety of misidentified phenomena\"\n\n \n Would not a biologist be qualifed to comment on animal tracks?\n \n Many scientists have a field of specialization, but are also very knowlegdeable in associated fields. If you're a paleontologist, you have a strong geological background, as well as extensive training in the field of biology.\n \n I've been around and around on this dinosaur/man track thing on a different site. It always seems to be the first thing presented by the creationist side. Simply stated - my position is that it is false, and has been proven to be so.\n \n Waxy", 
   {}, 
   50986, 
   null, 
   1084985640.0
  ], 
  [
   50992, 
   null, 
   "Big Orn", 
   "..to abandon all objective science and data for faith in a miracle. \n \n Waxy\n\n This is the only \"parting of ways\" that I can see between us. If faith is not the path we take, then we (Christians) are a bunch of hollow vessels.\n To eliminate factors as we go can, I hope, be evidence for the fact that miracles do occur. I am aware, though, that if someone has not experienced a miracle it would be hard to believe.\n \n Always pressing against another&#8217;s belief system for the truth, or at least, proving a point that may lead to the truth is what I would like continue.\n \n Is that such a bad thing? I don&#8217;t think so.\n \n Like you said,\n \n Science, unfettered by agendas and beliefs, is purest form of human endeavours. It's what has gotten us where we are, and is what will enable our continued survival and understanding of our world.\n\n could hold true for Christians when substituting &#8220;Science&#8221; with &#8220;Faith&#8221;.", 
   {}, 
   50988, 
   null, 
   1084986540.0
  ], 
  [
   51075, 
   null, 
   "drone001", 
   "The only problem I have with the whole flood story, is that Noah supposedly took two of each of all the land animals and stuck them on a boat. Do you realize who big that boat would have to be? It would have to be twice the size of a football field, and there's no way a boat that big was ever made in that time period. Noah would have needed a work force of thousands to be able to make that boat, and it would still take years to do. You got to cut down the trees, make the lumber, hand forge the nails or make dowels. Not to mention how did the kangaroos get back to Australia, or even how did Noah get them in the first place? It's just too fanciful for it to be true.", 
   {}, 
   50509, 
   null, 
   1085002560.0
  ], 
  [
   51254, 
   null, 
   "montalban", 
   "Really? Not using the science I am familiar with.\n\n \n That's not suprising. Most people aren't aware of the different sciences around.\n \n However, stating one's ignorance of epistemology doesn't really add to the debate... though I do admire your honesty.\n \n Are you familiar with, for instance, Marxist science? It is science as taught with a particular political bent. Although this might be obvious with it being so termed, it is just as valid as your own western capitalist science... as it follows the rules for science.", 
   {}, 
   50974, 
   null, 
   1085046300.0
  ], 
  [
   51257, 
   null, 
   "montalban", 
   "First off, I can assure that there was no hate on sinjin's part, though I'm sure, like myself, he is somewhat frustrated/exasperated.\n \n We can measure the current rate at which the Himalyas are rising to within 1/10 of an inch in many places, same goes for the Rockies. We can measure the rate at which the sea floor is spreading with nearly the same degree of accuracy. We have conducted innumerable experiments on the rates and manner with which rocks deform.\n \n The processes that are and have been shaping our Earth are far from immeasurable, to suggest otherwise shows a lack of understanding of geologic principles and general earth sciences. \n \n To state that the Himalayas formed in the last 10,000 years is to abandon all objective science and data for faith in a miracle. \n \n To me, that's illogical. \n \n Waxy\n\n \n How good of you to be able to read his mind, I suppose this was based on science too... enabling you to speak for him.\n \n No, what we had here was I stated a frank opinion of faith. He brought this into derision with a weak put-down... obviously there was no attempt to debate at all... yet this person claimed to have faith in the idea of the himalayas being old.\n \n You have stated your reasons for believing in the same thing as he... you have actually presented a ratioanle reason, he did not. I can only go by what people write, being unable to read minds as you can... therefore when I state something as a matter of faith, and so does he, yet he puts down my version without any reason, then I call that an attempt at being hateful... an irrational attempt to ridicule someone's faith.\n \n That you have stated your reasons for belief I respect, but not your self-belief in the ability to think for someone else... unless you are privy to information not apparent on this forum.\n \n As to abandoning 'reason' for faith as being illogical, that is another thing entire.\n \n Do you believe that I have 'blind' faith? Obviously you've read that into my statement - further to the ability to read minds.", 
   {}, 
   50984, 
   null, 
   1085046960.0
  ], 
  [
   51258, 
   null, 
   "montalban", 
   "Would not a biologist be qualifed to comment on animal tracks?\n\n \n I assume by your rhetorical question you don't know what type of biologist he is. I don't, perhaps I missed that in the article... if so, I'm sorry.\n \n Anyway, he comments not on the tracks as such, but the geology of them... for he's concluded that they weren't made by an animal, but by other non-biological phenomena, or by being forged/hoaxed.\n \n \nMany scientists have a field of specialization, but are also very knowlegdeable in associated fields. If you're a paleontologist, you have a strong geological background, as well as extensive training in the field of biology.\n \n I've been around and around on this dinosaur/man track thing on a different site. It always seems to be the first thing presented by the creationist side. Simply stated - my position is that it is false, and has been proven to be so.\n \n Waxy\n\n \n Cool. I thank you for your opinion. As I stated, I do not present these as proofs of creation, for I need no proof. I look at this merely as a study of knowledge, and from what I see is one man attempting to come up with an impossible explanation -that what appears as a series of tracks were formed by a number of totatlly different phenomena, where-by right next to them, another series of tracks, are produced by an animal.\n \n Further to this, the idea that he would have us believe that he went into the investigation with the belief that he'd be prepared to accept these tracks as being man-made (not in the sense of being forged), which is a nonsense.... so it seems to me.\n \n Secondly your gernalised argument about the knowledge of science is interesting. I had in the past presented 'facts' to prove creation. If I produced a study by a geologist out of his field, this was reason enough for most pro-evolutionists to dismiss it. This sort of thing doesn't seem to work both ways... which tells me more about your a priori beliefs, and the willingness to accept facts from people perhaps not best suited to present such. Likewise, I too have an a priori stance - I'm not saying I don't do the same thing - which of course seems to undermine the 'rationalist' path to knowledge)", 
   {}, 
   50988, 
   null, 
   1085047440.0
  ], 
  [
   51259, 
   null, 
   "montalban", 
   "I couldn't disagree more. Science, unfettered by agendas and beliefs, is purest form of human endeavours. It's what has gotten us where we are, and is what will enable our continued survival and understanding of our world.\n\n \n This is actually you telling me your belief system. You believe in the ideal scientist - one who is divorced from his self (which contains emotions and biases, and beliefs) Such a superman does not exist, I'm afraid.\n \n You've raised a number of men above the rest of us. Sort of a form of idolatory, and the belief that science will make things better and better... which is odd, because you don't believe that they have any values in any way.\n \n \nSinjin already addressed this, but if you'd like to find me some science that states water is spontaneously combustible, or that horses lay eggs, I'd love to read it.\n \n Waxy\n\n \n Nothing so dramatic... instead, scientists, without scientific proof, believe in aliens, and also in abiogenesis.\n \n Talkorigins says...\n \"The primary function of science is to demonstrate the existence of phenomena that cannot be observed directly.\"\n http://www.talkorigins.org/faqs/comdesc/sciproof.html\n \n Another definition might be...\n \"Science is the concerted human effort to understand, or to understand better, the history of the natural world and how the natural world works, with observable physical evidence as the basis of that understanding1. It is done through observation of natural phenomena, and/or through experimentation that tries to simulate natural processes under controlled conditions\"\n http://www.gly.uga.edu/railsback/1122science2.html\n \n Yet, scientists can be experts in the field of exobiology, that is, the biology of aliens. Further, they can harness millions of dollars tuning into the universe with the sole purpose of finding proof of these aliens.\n \n Exobilogy is a science...\n \n ..conducted research and analysis of ancient sedimentary deposits on Mars, to be used for selection of future landing sites to satisfy geological and exobiological science issues.\"\n http://quest.arc.nasa.gov/ltc/mars/...p1/ricebio.html\n \n \"Planetary protection takes also into account the protection of exobiological science\"\n http://www.astrosurf.com/planete-ma...ang/node15.html\n \n \"Space Science in the Twenty-First Century\n Imperatives for the Decades 1995 to 2015 \n Life Sciences \n 2\n Exobiology\n WHAT IS EXOBIOLOGY?\"\n http://www7.nationalacademies.org/ssb/21lsch2.html\n \n Open Directory list it like this...\n Science\n Astronomy\n Extraterrestrial Life\n \n That is, under science!\n \n AND\n it ...\n \"The goal of NASA's Exobiology program is to understand the origin, evolution, and distribution of life in the universe.\"\n http://exobiology.nasa.gov/ssx/exobiology.html\n \n There's a great link's site at http://www.galacticsurf.com/exobioGB.htm\n \n That's just two current non-science beliefs, some have gone by the wayside such as Neptunism, or the belief that Java Man was the missing link.\n \n PS\n Do you know Sinjin somewhere?", 
   {}, 
   50986, 
   null, 
   1085047800.0
  ], 
  [
   51260, 
   null, 
   "montalban", 
   "The only problem I have with the whole flood story, is that Noah supposedly took two of each of all the land animals and stuck them on a boat. Do you realize who big that boat would have to be? It would have to be twice the size of a football field, and there's no way a boat that big was ever made in that time period. Noah would have needed a work force of thousands to be able to make that boat, and it would still take years to do. You got to cut down the trees, make the lumber, hand forge the nails or make dowels. Not to mention how did the kangaroos get back to Australia, or even how did Noah get them in the first place? It's just too fanciful for it to be true.\n\n \n This might sound like circular reasoning.\n \n If you accept the 'flood' story at all, then you'd have to say it was a miraculous event - in that it was brought about by God. Why would it then need to totally conform with science - that wouldn't make it a miracle, then would it?", 
   {}, 
   51075, 
   null, 
   1085047920.0
  ], 
  [
   51270, 
   null, 
   "montalban", 
   "What evidence is there that there is life on other planets?\n \n Exobiologists can give you ideas of what that life might look like.\n \n This is the path of logic...\n \n Life exists here\n \n If it exists here, it probably exists somewhere else\n \n If it exists somewhere else, it is probably like... (speculate)\n \n Thus rationalisim can lead you to assume certain things based on no evidence.\n \n Similarly, abiogenesis has not been proven, but 'must have happened' because we are here today.", 
   {
    "post_info": {
     "post_title": "Science has faith."
    }
   }, 
   51260, 
   null, 
   1085053320.0
  ], 
  [
   51346, 
   null, 
   "Waxy", 
   "How good of you to be able to read his mind, I suppose this was based on science too... enabling you to speak for him.\n \n No, what we had here was I stated a frank opinion of faith. He brought this into derision with a weak put-down... obviously there was no attempt to debate at all... yet this person claimed to have faith in the idea of the himalayas being old.\n \n You have stated your reasons for believing in the same thing as he... you have actually presented a ratioanle reason, he did not. I can only go by what people write, being unable to read minds as you can... therefore when I state something as a matter of faith, and so does he, yet he puts down my version without any reason, then I call that an attempt at being hateful... an irrational attempt to ridicule someone's faith.\n \n That you have stated your reasons for belief I respect, but not your self-belief in the ability to think for someone else... unless you are privy to information not apparent on this forum.\n \n As to abandoning 'reason' for faith as being illogical, that is another thing entire.\n \n Do you believe that I have 'blind' faith? Obviously you've read that into my statement - further to the ability to read minds.\n\n \n Sinjin and I go back a long way, I've never known him to offer so much as a cross word at someone, let alone hate them, so I do feel qualified comment on his intentions. \n \n You can take the rest of your little rant and stuff it.\n \n Waxy", 
   {}, 
   51257, 
   null, 
   1085083320.0
  ], 
  [
   51349, 
   null, 
   "Waxy", 
   "I assume by your rhetorical question you don't know what type of biologist he is. I don't, perhaps I missed that in the article... if so, I'm sorry.\n\n \n No, I don't know what field of biology he specializes in, nor do I know his geological qualifications.\n \n \nAnyway, he comments not on the tracks as such, but the geology of them... for he's concluded that they weren't made by an animal, but by other non-biological phenomena, or by being forged/hoaxed.\n\n \n I fail to see the error or problem here? He's determined in his \"expert\" biological opinion that the tracks were not made by an animal. He then uses his knowledge of geology, of which we are uncertain, to explain how geological phenomenon could be responsible.\n \n \nCool. I thank you for your opinion. As I stated, I do not present these as proofs of creation, for I need no proof. I look at this merely as a study of knowledge, and from what I see is one man attempting to come up with an impossible explanation -that what appears as a series of tracks were formed by a number of totatlly different phenomena, where-by right next to them, another series of tracks, are produced by an animal.\n\n \n That's what you see. Can I ask, what are your qualifications that enabled you to come to that conclusion? Or do you just view man and dinosaurs co-existing as common sense?\n \n Furthermore, he is FAR from one man. I'd say he's one of millions as opposed to one of very few who actually believe they are human tracks. Even most Creationists distance themselves from this issue.\n \n \nFurther to this, the idea that he would have us believe that he went into the investigation with the belief that he'd be prepared to accept these tracks as being man-made (not in the sense of being forged), which is a nonsense.... so it seems to me.\n\n \n Who's the mind reader now?\n \n \nSecondly your gernalised argument about the knowledge of science is interesting. I had in the past presented 'facts' to prove creation. If I produced a study by a geologist out of his field, this was reason enough for most pro-evolutionists to dismiss it. This sort of thing doesn't seem to work both ways... which tells me more about your a priori beliefs, and the willingness to accept facts from people perhaps not best suited to present such. Likewise, I too have an a priori stance - I'm not saying I don't do the same thing - which of course seems to undermine the 'rationalist' path to knowledge)\n\n \n Again with the mind reading.\n \n A geologist out of his field? Interesting. I'm not aware of the fact that a geolgist can be out of his field. He may not have the experience others do in a particular aspect of geology, but that does not disqualify him. I'd be willing to have a look at your facts.\n \n Waxy", 
   {}, 
   51258, 
   null, 
   1085084040.0
  ], 
  [
   51353, 
   null, 
   "sinjin", 
   "What evidence is there that there is life on other planets?\n \n\n None so far but exobiology studys where the constituents for life, as science understand them, have come from. \n \n\n abiogenesis has not been proven, but 'must have happened' because we are here today.\n\n Seems perfectly reasonable to me and doesn't require a mythology.", 
   {}, 
   51270, 
   null, 
   1085085000.0
  ], 
  [
   51354, 
   null, 
   "Waxy", 
   "This is actually you telling me your belief system. You believe in the ideal scientist - one who is divorced from his self (which contains emotions and biases, and beliefs) Such a superman does not exist, I'm afraid.\n\n \n I agree, no man or woman is capable of such a feat, but striving to meet those standards leads to the most objective results.\n \n \nYou've raised a number of men above the rest of us. Sort of a form of idolatory, and the belief that science will make things better and better... which is odd, because you don't believe that they have any values in any way.\n\n \n Interesting. \n \n I'm not sure when I became some sort of spiritual scientist worshipping at the altar of Newton, nor am I aware of stating that scientists don't have any values.\n \n \nNothing so dramatic... instead, scientists, without scientific proof, believe in aliens, and also in abiogenesis.\n\n \n I'd say that suggesting all, most, or even a strong minority of scientists believe in aliens is the height of drama. Scientists may believe in the POSSIBILITY of aliens, but NOT ONE will tell you that they are 100% sure that aliens exist.\n \n You're twisting things to fit your argument and making false statements.\n \n \nTalkorigins says...\n \"The primary function of science is to demonstrate the existence of phenomena that cannot be observed directly.\"\n http://www.talkorigins.org/faqs/comdesc/sciproof.html\n \n Another definition might be...\n \"Science is the concerted human effort to understand, or to understand better, the history of the natural world and how the natural world works, with observable physical evidence as the basis of that understanding. It is done through observation of natural phenomena, and/or through experimentation that tries to simulate natural processes under controlled conditions\"\n http://www.gly.uga.edu/railsback/1122science2.html\n\n \n Definition #2 is far superior, definition #1 is pretty much false, but it does serve its purpose, to undermine science by presenting half truths.\n \n \nYet, scientists can be experts in the field of exobiology, that is, the biology of aliens. Further, they can harness millions of dollars tuning into the universe with the sole purpose of finding proof of these aliens.\n \n Exobilogy is a science...\n \n ..conducted research and analysis of ancient sedimentary deposits on Mars, to be used for selection of future landing sites to satisfy geological and exobiological science issues.\"\n http://quest.arc.nasa.gov/ltc/mars/...p1/ricebio.html\n \n \"Planetary protection takes also into account the protection of exobiological science\"\n http://www.astrosurf.com/planete-ma...ang/node15.html\n \n \"Space Science in the Twenty-First Century\n Imperatives for the Decades 1995 to 2015 \n Life Sciences \n 2\n Exobiology\n WHAT IS EXOBIOLOGY?\"\n http://www7.nationalacademies.org/ssb/21lsch2.html\n \n Open Directory list it like this...\n Science\n Astronomy\n Extraterrestrial Life\n \n That is, under science!\n \n AND\n it ...\n \"The goal of NASA's Exobiology program is to understand the origin, evolution, and distribution of life in the universe.\"\n http://exobiology.nasa.gov/ssx/exobiology.html\n \n There's a great link's site at http://www.galacticsurf.com/exobioGB.htm\n \n \n\n \n Again, I'm sorry, but I fail to see your point. I'm not sure whether my defintion of science is too narrow, or whether it's you that doesn't grasp what science is.\n \n The whole basis of science is to form a hypothesis and test it.\n \n You gave a link to a few things that were hypothesizes and turned out to be false, SO? What of all the things we know know or advancements in our understanding that were gained by forming and testing hypotheses? Are those all irrelevent because a couple proved incorrect?\n \n Life on Mars -\n \n Observe Mars\n Orbit Mars - see geologic formations very similiar to those on Earth\n - from hypotheses based on this similarity\n - design experiments that will enable the test if these hypotheses\n Land on Mars - perform experiments, collect data\n - analyze data and test hypothesis, refine those that work, discard those that don't\n - form additional hypotheses and experiments based on new data, start cycle again.\n \n I fail to see how this is not science?\n \n Waxy", 
   {}, 
   51259, 
   null, 
   1085085240.0
  ], 
  [
   51356, 
   null, 
   "Waxy", 
   "What evidence is there that there is life on other planets?\n \n Exobiologists can give you ideas of what that life might look like.\n \n This is the path of logic...\n \n Life exists here\n \n If it exists here, it probably exists somewhere else\n \n If it exists somewhere else, it is probably like... (speculate)\n \n Thus rationalisim can lead you to assume certain things based on no evidence.\n \n Similarly, abiogenesis has not been proven, but 'must have happened' because we are here today.\n\n \n The difference is, rather than simply accepting on faith that life exists on other planets, scientists endeavour to test the hypothesis, and will only declare they are certain of extra-terrestrial life when they can demonstrate it's existance with certainty.\n \n Waxy", 
   {}, 
   51270, 
   null, 
   1085085540.0
  ], 
  [
   51510, 
   null, 
   "montalban", 
   "The difference is, rather than simply accepting on faith that life exists on other planets, scientists endeavour to test the hypothesis, and will only declare they are certain of extra-terrestrial life when they can demonstrate it's existance with certainty.\n \n Waxy\n\n \n Scientists have faith that there are aliens... unless you believe that they have evidence.\n \n They have been testing this for decades. Do they cease testing because they haven't found any evidence? (Unless you are aware that they have evidence), but their faith continues.\n \n You can find some who will even have pictures of what these aliens might look like... even though they have no evidence of what they look like, or even that they exist.\n \n Whereas, in the 'faith-camp', people have seen Jesus, and have seen Angels. Yet are derided as being less rational than the 'logic-camp'.", 
   {}, 
   51356, 
   null, 
   1085134620.0
  ], 
  [
   51511, 
   null, 
   "montalban", 
   "Sinjin and I go back a long way, I've never known him to offer so much as a cross word at someone, let alone hate them, so I do feel qualified comment on his intentions. \n \n You can take the rest of your little rant and stuff it.\n \n Waxy\n\n \n Ouch, so much for the rational mind!", 
   {}, 
   51346, 
   null, 
   1085134680.0
  ], 
  [
   51513, 
   null, 
   "montalban", 
   "As I said, I am interested in studies of knowledge and of argument.\n \n \n I assume by your rhetorical question you don't know what type of biologist he is. I don't, perhaps I missed that in the article... if so, I'm sorry. \n\n \n \nNo, I don't know what field of biology he specializes in, nor do I know his geological qualifications.\n\n \n Then your rhetorical ploy is but to cast doubt on my questions. You are simply playing games. He states clearly he is a biologist, but just to muddy the waters, it's possible that he's also a geologist, astro-physicist, Nobel laureate, and so on. This is of course unlikely, because he's stated his field. We can only judge him by the facts he presents. You are therefore prepared to, on faith, go beyond what you know, to assume. Even though he states one thing, your mind adds to his stated abilities, because it suits the idea that he knows what he is talking about.\n \n \nAnyway, he comments not on the tracks as such, but the geology of them... for he's concluded that they weren't made by an animal, but by other non-biological phenomena, or by being forged/hoaxed. \n\n \n \nI fail to see the error or problem here? He's determined in his \"expert\" biological opinion that the tracks were not made by an animal. He then uses his knowledge of geology, of which we are uncertain, to explain how geological phenomenon could be responsible.\n\n \n Is he an expert on tracks? Again you assume too much. You have the ability to see things that aren't there. I wish I had that power. As I said, I am arguing based on the arguments AS PRESENTED, you, the rationalist, are prepared to broaden the scope wherever you feel it might add weight to his argument.\n \n \nCool. I thank you for your opinion. As I stated, I do not present these as proofs of creation, for I need no proof. I look at this merely as a study of knowledge, and from what I see is one man attempting to come up with an impossible explanation -that what appears as a series of tracks were formed by a number of totally different phenomena, where-by right next to them, another series of tracks, are produced by an animal. \n\n \n \nThat's what you see. Can I ask, what are your qualifications that enabled you to come to that conclusion? Or do you just view man and dinosaurs co-existing as common sense?\n\n \n I am, as I said, not presenting the dinosaur-man co-footprints as an argument for creation, I am looking into the merits of the argument, now the third time I've mentioned this.\n \n And so far, I judge the argument by its merits, whereas you add things to 'beef-up' the case.\n \n \nFurthermore, he is FAR from one man. I'd say he's one of millions as opposed to one of very few who actually believe they are human tracks. Even most Creationists distance themselves from this issue.\n\n \n He is one man presenting an argument. I am judging that argument. You are now saying that his argument, however good or bad it is should not be judged on its own merits, but by the fact that, in general, it agrees with a number of other arguments.\n \n As to Creationists...\n Do they? You have the stats to back that up? Was their a poll of Creationists? Or are you again just accepting a blanket statement as fact. Again you are adding to the argument without basis. Unless you are prepared to add in facts through quoted sources, otherwise you are just stating what you hope to be the case.\n \n \n Further to this, the idea that he would have us believe that he went into the investigation with the belief that he'd be prepared to accept these tracks as being man-made (not in the sense of being forged), which is a nonsense.... so it seems to me. \n\n \n \nWho's the mind reader now?\n\n \n He states this, that the tracks were caused by geological phenomena, and forgery, etc. He has stated that he accepts a whole number of different causalities, other than they are as they are claimed to be by Creationists.\n \n \nSecondly your generalised argument about the knowledge of science is interesting. I had in the past presented 'facts' to prove creation. If I produced a study by a geologist out of his field, this was reason enough for most pro-evolutionists to dismiss it. This sort of thing doesn't seem to work both ways... which tells me more about your a priori beliefs, and the willingness to accept facts from people perhaps not best suited to present such. Likewise, I too have an a priori stance - I'm not saying I don't do the same thing - which of course seems to undermine the 'rationalist' path to knowledge) \n\n \n \nAgain with the mind reading.\n\n \n Not at all. You here go in for the same pattern. You are prepared to give him a leniency unapparent in his qualifications, just assuming that if he has any science, he might have other sciences... enough to be qualified to comment (even though he should have stated these)\n \n You allow him a lee-way you would not a creationist... others have done it, they deride a creationist scientist if he strays anywhere outside his chosen field. You allow it for this fella.\n \n You don't see how much faith you are putting in him because you've devoted such faith in his ability to answer your questions - you don't question his ability, but just accept it, adding in details that simply aren't there as presented. You are a mind-reader par excellence\n \n \nA geologist out of his field? Interesting. I'm not aware of the fact that a geologist can be out of his field. He may not have the experience others do in a particular aspect of geology, but that does not disqualify him. I'd be willing to have a look at your facts.\n \n Waxy\n\n \n You aren't just willing to look at the facts, but to add to them to beef-up your case. For instance you grant to him qualifications he doesn't state. You make generalisations about creationists without presenting anything to back that up. He accepts the 'footprints' as being made by a number of causes, despite being alongside footprints which he assess are real - again the shifting mysterious series of phenomenas that were able to so cleverly lay down a corresponding series of tracks right alongside real tracks.\n \n This, as I said, bespeaks more about your own wishes than what is real.", 
   {}, 
   51349, 
   null, 
   1085136120.0
  ], 
  [
   51517, 
   null, 
   "montalban", 
   "\n \n \n \nAgain, I'm sorry, but I fail to see your point. I'm not sure whether my defintion (sic) of science is too narrow, or whether it's you that doesn't grasp what science is.\n \n The whole basis of science is to form a hypothesis and test it.\n \n Life on Mars -\n \n Observe Mars\n Orbit Mars - see geologic formations very similiar (sic) to those on Earth\n - from hypotheses based on this similarity\n - design experiments that will enable the test if these hypotheses\n Land on Mars - perform experiments, collect data\n - analyze data and test hypothesis, refine those that work, discard those that don't\n - form additional hypotheses and experiments based on new data, start cycle again.\n \n I fail to see how this is not science?\n \n Waxy\n\n \n Specifically, what similarities are you talking about? Earth (now with life) is very different physically from Mars (which has no life). What do you see are the similarities between an earth-life model and a lifeless-Mars model? When was Mars at such a stage that it supported life - in so far as there's no evidence that it ever did? \n \n Where was this observed - what data of life on Mars has been found to test? (Or, for that matter, any other planet other than earth.)\n \n Is it science to have a hypothesis, and continue to hope for half a century? When does hope cease becoming science and becomes faith, in your view?\n \n For instance, why would aliens use radio waves? SETI is looking specifically for radio waves. Why is it science to hypothesise that aliens, if they existed, would follow the same technological pathways we did? (It doesn't sound very 'alien')\n \n \n You gave a link to a few things that were hypothesizes and turned out to be false, SO? What of all the things we know know (sic) or advancements in our understanding that were gained by forming and testing hypotheses? Are those all irrelevent (sic) because a couple proved incorrect?\n\n \n I don't wish to discredit science per se, but simply put human knowledge back within the context of humanity... whereas you told earlier of some drive to get beyond the humanity\n \n Post 48\n \nScience, unfettered by agendas and beliefs, is purest form of human endeavours. It's what has gotten us where we are, and is what will enable our continued survival and understanding of our world.\n\n \n Enabled our continued survival? That's a value-laden statement if ever there was one, and typical of the pro-science debaters I've come across - that ultimate faith in man. I have mentioned that you and others put scientists on a pedestal that is just simply unworkable a belief... man without his foibles.\n \n In your defence of a biologist (regarding the 'footprints' debates), you are prepared to give him the attributes of a geologist... though there's no evidence for such. You are prepared to add to his credentials simply because it would suit you to believe it to be so. You are acting on faith... because your model of reality needs scientists to be either providers of answers or capable to provide the answers. I fail to see how this belief system is based on science, and not on wishful thinking.\n \n My idea of science, and this is based on my world-view, is that science is a noble pursuit, so long as it does not take precedence over attempting to be close to God. I don't believe this statement of faith needs to be supported by evidences, as it is a statement of faith (I'm sure sinjin will find that 'illogical' which is itself a misunderstanding of what faith is... you, Waxy however also have been expressing ideas of faith, but you think it is based on rationality)\n \n This is at the core I am interested in, studying ideas. Your ideas, you believe are rational-logical, but are largely based on faith... faith in science in general, faith in particular scientists, faith that when science acts on faith (e.g. aliens), it still is science.", 
   {}, 
   51354, 
   null, 
   1085141280.0
  ], 
  [
   51549, 
   null, 
   "Waxy", 
   "Scientists have faith that there are aliens... unless you believe that they have evidence.\n \n They have been testing this for decades. Do they cease testing because they haven't found any evidence? (Unless you are aware that they have evidence), but their faith continues.\n \n You can find some who will even have pictures of what these aliens might look like... even though they have no evidence of what they look like, or even that they exist.\n \n Whereas, in the 'faith-camp', people have seen Jesus, and have seen Angels. Yet are derided as being less rational than the 'logic-camp'.\n\n \n Your use of the word faith interests me. You definately use it in a sense that I don't, and that I don't particularly agree with.\n \n faith ( P ) Pronunciation Key (fth)\n n. \n 1.Confident belief in the truth, value, or trustworthiness of a person, idea, or thing. \n 2. Belief that does not rest on logical proof or material evidence. See Synonyms at belief. See Synonyms at trust. \n 3. Loyalty to a person or thing; allegiance: keeping faith with one's supporters. \n 4.often Faith Christianity. The theological virtue defined as secure belief in God and a trusting acceptance of God's will. \n 5.The body of dogma of a religion: the Muslim faith. \n 6.A set of principles or beliefs. \n \n I'm fond of #2, less so of #4 + 5, you obviously lean toward #1.\n \n Scientists do not have \"faith\" (in the sense of any of the definitions above, including #1) that there are aliens. They believe in the POSSIBILITY. To my mind, that's a HUGE distinction. Scientists don't think \"Aliens exist, I'm going to prove it\" they think \"Aliens MIGHT exist, if they did, how could we find evidence for it?\"\n \n Surely you can see that difference.\n \n Drawing what aliens may look like is speculation, kinda like drawing what Jesus may look like. I agree on that one, there is no difference. \n \n Even if you believe in the word of the Bible, no one alive today has SEEN Jesus or angels in a physical sense.\n \n You seem like an intellingent, logical man, I just can't understand why you are unable to see the distinctions here.\n \n Waxy", 
   {}, 
   51510, 
   null, 
   1085157840.0
  ], 
  [
   51560, 
   null, 
   "Waxy", 
   "Is he an expert on tracks? Again you assume too much. You have the ability to see things that aren't there. I wish I had that power. As I said, I am arguing based on the arguments AS PRESENTED, you, the rationalist, are prepared to broaden the scope wherever you feel it might add weight to his argument.\n\n \n What do you feel makes someone an expert on tracks? Is a degree in biology sufficient? How about a degree and visiting a track site? How about a degree, and years of one's life dedicated to researching tracks and animal locomotion? When do you become an expert? Last I checked, there was no PhD in tracks.\n \n I fail to see how I have embelished either him or his findings. He has published numerous papers in both Creationist and Evolutionist journals, and is recognized as a leading authority on the issue. Furthermore, he is not alone in his work, he has both worked with and consulted numerous other respected \"experts\" in the fields in which he is working.\n \n \nI am, as I said, not presenting the dinosaur-man co-footprints as an argument for creation, I am looking into the merits of the argument, now the third time I've mentioned this.\n \n And so far, I judge the argument by its merits, whereas you add things to 'beef-up' the case.\n\n \n I don't see this, but perhaps I'm blind to it, could you show me how I've \"beefed up the case\"?\n \n \nHe is one man presenting an argument. I am judging that argument. You are now saying that his argument, however good or bad it is should not be judged on its own merits, but by the fact that, in general, it agrees with a number of other arguments.\n\n \n When did I say that? Of course it should be judged by its own merits. I hate when people twist things to beef up their arguments, don't you? \n \n My point was that he is not alone in his work. Numerous other qualified scientists' work in numerous associated fields beyond biology and geology supports his, a million was hyerbole, my apologies. \n \n Beyond that, I fail to see how someone's argument is less valid because it draws on the conclusions of others, or agrees with them?\n \n \nAs to Creationists...\n Do they? You have the stats to back that up? Was their a poll of Creationists? Or are you again just accepting a blanket statement as fact. Again you are adding to the argument without basis. Unless you are prepared to add in facts through quoted sources, otherwise you are just stating what you hope to be the case.\n\n \n The statement about Creationists was drawn from article, that I freely admit. I've since read numerous other articles from the site, both by Creationists and Evolutionists, and I'd say the assessment is fair. It's also based on my personal experience on this board and others. \n \n This brings me to another point - when is someone's statement considered qualified? What is required for a statement to have basis? Do I actually have to poll every Creationsist in the world and publish a paper, or can I draw an inference from sources I've read and my own experiences? How quoted sources is enough? 1? 10? 100? \n \n \nHe states this, that the tracks were caused by geological phenomena, and forgery, etc. He has stated that he accepts a whole number of different causalities, other than they are as they are claimed to be by Creationists.\n\n \n He stated clearly, and I quote\n \n \"Although we were at the time open to creationist ideas and actually hoping to confirm the human track claims, we resolved to examine and record whatever we found as thoroughly and carefully as possible.\"\n \n So you read his mind and determined he was in fact on an evolutionist witch hunt right from the outset?\n \n He collected the data, did his research, and formed a conclusion.\n \n His actual conclusion was that the tracks were indeed dinosaur tracks, not some unusual geologic phenomenon. There goes your beef. He didn't dream it up, he researched it, thoroughly, and brought in experts from other fields when he was underqualified.\n \n \nNot at all. You here go in for the same pattern. You are prepared to give him a leniency unapparent in his qualifications, just assuming that if he has any science, he might have other sciences... enough to be qualified to comment (even though he should have stated these)\n \n You allow him a lee-way you would not a creationist... others have done it, they deride a creationist scientist if he strays anywhere outside his chosen field. You allow it for this fella.\n \n You don't see how much faith you are putting in him because you've devoted such faith in his ability to answer your questions - you don't question his ability, but just accept it, adding in details that simply aren't there as presented. You are a mind-reader par excellence\n\n \n I wish I was, maybe I'd be able to figure out what it is that you see when you read my words that I don't see.\n \n So because others have derided Creationists, I must be guilty of it? Interesting. Where have I not allowed a Creationist leeway? All these accusations against me about mind reading and generalizing, yet you proceed to do exactly what you seem to so despise.\n \n You fail to undertand that his research is a collaboration. He did not draw these conclusions entirely on his own. Again with faith. Do I have faith in his ability? I suppose I do, I wasn't there looking over his shoulder the entire time, so I guess it is \"faith\" to believe he followed proper scientific procedure. Of course I would question his ability, again, you're judging my actions and thoughts without basis. I read the site thoroughly and looked at his conclusions and what evidence was provided, I also saw a list of other \"qualified\" people with whom he collaborated. Add that to my knowledge of the subject, and I will put my \"faith\" in his conclusions. I only use the word faith because I haven't actually examined the data myself.\n \n Again, I'll ask you, what makes a person qualified? Is it simply a degree? Is it experience and research? What? Does having a BSc in biology and not geology preclude someone from being an \"expert\" in geology (something he does NOT claim to be FYI), despite having spent vast amounts of time both learning and researching the associated geology? Does it matter whether they're Creationist or Evolutionist in their beliefs? Am I giving everyone too much credit again?\n \n \nThis, as I said, bespeaks more about your own wishes than what is real.\n\n \n I think it speaks equally to your wishes and preconceptions, despite your claims to the contrary. \n \n Waxy", 
   {}, 
   51513, 
   null, 
   1085163000.0
  ], 
  [
   51573, 
   null, 
   "Waxy", 
   "Specifically, what similarities are you talking about? Earth (now with life) is very different physically from Mars (which has no life). What do you see are the similarities between an earth-life model and a lifeless-Mars model? When was Mars at such a stage that it supported life - in so far as there's no evidence that it ever did?\n\n \n There are numerous similarities in the geomorhology of Mars and Earth. Check it out yourself. Just do a search. February's (I believe) National Geographic also has an excellent article.\n \n \nWhere was this observed - what data of life on Mars has been found to test? (Or, for that matter, any other planet other than earth.)\n\n \n I guess we'll find out soon enough if there's any evidence of life.\n \n \nIs it science to have a hypothesis, and continue to hope for half a century? When does hope cease becoming science and becomes faith, in your view?\n\n \n Continue to hope? That's a warped view of science. Science on a deadline. Good thing not many share your perspective.\n \n Technology advances, we're capable of doing things now we couldn't have imagined half a century ago, like land a rover on another planet. Should we have given up \"hope\" 10 years ago and said to heck with it?\n \n \nFor instance, why would aliens use radio waves? SETI is looking specifically for radio waves. Why is it science to hypothesise that aliens, if they existed, would follow the same technological pathways we did? (It doesn't sound very 'alien')\n\n \n We're limited by our own understanding and technology. That should be pretty obvious to you. We can only hope to detect extra-terrestrial life it it exists and communicates within our current realm of scientific knowledge.\n If the \"aliens\" are transmitting in some form that we can't understand as yet, then I guess we're missing out.\n \n \nI don't wish to discredit science per se, but simply put human knowledge back within the context of humanity... whereas you told earlier of some drive to get beyond the humanity\n\n \n Science is a human endeavour, that's undeniable, and with that comes human error and emotion. \n \n I do feel we need to strive to eliminate human biases, whether they be racial, sexual, religious, etc... from the scientific process.\n \n \nEnabled our continued survival? That's a value-laden statement if ever there was one, and typical of the pro-science debaters I've come across - that ultimate faith in man. I have mentioned that you and others put scientists on a pedestal that is just simply unworkable a belief... man without his foibles.\n\n \n As oppossed to ulitmate faith in an invisible supernatural being? A being that works through man to ensure man's continued survival? Yep, I guess that's my value. What a shame to only be typical.\n \n Again, where have I put any scientist on a pedestal? Where have I stated that scientists are without \"foibles\". This is your perception, not mine, I would never make such a statement.\n \n \nIn your defence of a biologist (regarding the 'footprints' debates), you are prepared to give him the attributes of a geologist... though there's no evidence for such. You are prepared to add to his credentials simply because it would suit you to believe it to be so. You are acting on faith... because your model of reality needs scientists to be either providers of answers or capable to provide the answers. I fail to see how this belief system is based on science, and not on wishful thinking.\n\n \n As for his credentials and the vaildity of his conclusions, did you read the article? I did. Nuff said.\n \n I really don't get what you're trying to say here, belief in the validity of the scientific method is wishful thinking? Why?\n \n You've also made some pretty large assumptions as to my belief? I don't believe that science can, or ever will be, the answer to everything. What I believe is that science is the best method at mankind's disposal to improve our understanding of our world.\n \n \nMy idea of science, and this is based on my world-view, is that science is a noble pursuit, so long as it does not take precedence over attempting to be close to God. I don't believe this statement of faith needs to be supported by evidences, as it is a statement of faith.\n\n \n Good thing. Ain't faith great!\n \n \nThis is at the core I am interested in, studying ideas. Your ideas, you believe are rational-logical, but are largely based on faith... faith in science in general, faith in particular scientists, faith that when science acts on faith (e.g. aliens), it still is science.\n\n \n Again, while I see your point, it's \"typical of believers\" to try and point out that scientists also act on \"faith\".\n \n The only faith I see in science is faith in your fellow man to follow the rules of scientific procedure. It's impossible for me to test every hypothesis and perform every experiment myself in order to ascertain its veracity. As such, I do place faith in the fact that I haven't been deceived. I don't see it as faith in science, but rather, more of a faith in my fellow man. \n \n Science itself is based on the ability to support a claim with repeatable, physical proof. I realize this gets hazy in certain \"soft sciences\" and in the realm of nuclear physics and chemistryfor example, however, the conclusions drawn and theories presented are for the most part  based on repeatable experimentation, and in the above instances where direct observation is not possible, extrapolation and inference.\n \n Waxy", 
   {}, 
   51517, 
   null, 
   1085166300.0
  ], 
  [
   51691, 
   null, 
   "montalban", 
   "Your use of the word faith interests me. You definately use it in a sense that I don't, and that I don't particularly agree with.\n \n faith ( P ) Pronunciation Key (fth)\n n. \n 1.Confident belief in the truth, value, or trustworthiness of a person, idea, or thing. \n 2. Belief that does not rest on logical proof or material evidence. See Synonyms at belief. See Synonyms at trust. \n 3. Loyalty to a person or thing; allegiance: keeping faith with one's supporters. \n 4.often Faith Christianity. The theological virtue defined as secure belief in God and a trusting acceptance of God's will. \n 5.The body of dogma of a religion: the Muslim faith. \n 6.A set of principles or beliefs. \n \n I'm fond of #2, less so of #4 + 5, you obviously lean toward #1.\n \n Scientists do not have \"faith\" (in the sense of any of the definitions above, including #1) that there are aliens. They believe in the POSSIBILITY. To my mind, that's a HUGE distinction. Scientists don't think \"Aliens exist, I'm going to prove it\" they think \"Aliens MIGHT exist, if they did, how could we find evidence for it?\"\n \n Surely you can see that difference.\n\n \n You are confident that science will provide the answers. You have faith in tha ability of science. Science and progress, faith in man. It is part of your belief system, this faith.\n \n You've also displayed faith that when those scientists talk, they do so with authority - such as in out 'footprints' discussion, where-by, without stated evidence, you just hope that he is an expert in fields other than that which he credits himself. Your mind adds to the details given. You kind of 'fill in the holes' in the argument - based on this faith.\n \n Secondly, I think you're trying to draw a distinction between faith and belief which won't work, in this context. In the concept of aliens, scientists, as far as I'm aware, have no actual proof that aliens exist, so what other kind of belief is left?\n \n \nDrawing what aliens may look like is speculation, kinda like drawing what Jesus may look like. I agree on that one, there is no difference. \n\n \n Then you agree that scientists use faith. Thank you. Eventually I'll get you to agree that they do this all the time -as you have done with regards to our 'footprints' expert.\n \n \nEven if you believe in the word of the Bible, no one alive today has SEEN Jesus or angels in a physical sense.\n\n \n Simply not true. You just assume this to be true, because you don't believe in Jesus or angels (I am making a guess here). People have seen and spoken with angels throughout history.\n \n \nYou seem like an intellingent, logical man, I just can't understand why you are unable to see the distinctions here.\n \n Waxy\n\n \n Nice one! Aside from this reverse insult...\n \n You draw distinctions between faith and belief -when that belief is not based on fact - as in I believe the USA to exist - for even though I've not been there, I've reason to believe. What other basis for 'belief' then do scientists have?\n \n I'll tell you.\n \n Scientists believe in statistics.\n X amount of planets.\n We know one of them is inhabited.\n Therefore others might be. Here, 'might' refers to faith.\n \n So, based on that flimsy premis they then conjecture, that if we had radio, they must have had radio. So they get billions of dollars to go looking for the signs of these aliens. Then they also begin to speculate about what they might look like. We even send them an invitation to come and see us.\n \n You seem like an intelligent person (I don't know if you're a bloke or a sheila), why do you think that that sort of endeavour is worthy of 'science'?", 
   {}, 
   51549, 
   null, 
   1085194080.0
  ], 
  [
   51703, 
   null, 
   "montalban", 
   " Is he an expert on tracks? Again you assume too much. You have the ability to see things that aren't there. I wish I had that power. As I said, I am arguing based on the arguments AS PRESENTED, you, the rationalist, are prepared to broaden the scope wherever you feel it might add weight to his argument. \n\n \n \nWhat do you feel makes someone an expert on tracks? Is a degree in biology sufficient? How about a degree and visiting a track site? How about a degree, and years of one's life dedicated to researching tracks and animal locomotion? When do you become an expert? Last I checked, there was no PhD in tracks.\n\n \n Here you make an assumption again. I would credit a hunter-gatherer as an expert on tracks. No need to have a PhD. However, leaving aside your obsession with degree qualifications, a biologist might have specialised in dentition, and I would not suggest that this would qualify them to give expert comment on tracks. You simply assume that he is a biologist who\n a) studied tracks or animal locomotion (in his degree)\n and\n b) geology\n as he comments on both.\n \n If he'd grown up in the bush, with frequent recourse to hunting, I'd have accepted him as an 'expert' on tracks.\n \n I made no stated assumptions, other then I feel that if he hasn't listed his qualifications it is because he's not qualified. I agree that this is an assumption on my part, for he may well be an 'expert in tracks'. If he is, I would concede this point. But I stated from the beginning that I came to this article as it is, and on reading it, judged it as it is. If you are aware of other articles that expand on his qualifications you would have saved a lot of time by quoting them earlier... so that these articles could be presented and judged.\n \n As it stands you just make an assumption about these qualifications, and I can't, as I've not seen the evidence... Funny that you're the evolutionist basing your beliefs on faith, and I'm the creationist demanding to see the evidence.\n \n \nI fail to see how I have embelished (sic) either him or his findings. He has published numerous papers in both Creationist and Evolutionist journals, and is recognized as a leading authority on the issue. Furthermore, he is not alone in his work, he has both worked with and consulted numerous other respected \"experts\" in the fields in which he is working\n\n \n He has published numerous articles, therefore he is an expert, is the argument you make now. Let's again look to what he did when fresh out of university, he stated he was a biologist. Full stop, nothing else. He then studied the tracks, and has published on them. You raise him to 'expert', when right from the beginning he fails to live up to this.\n \n You try the 'numbers' game... a lot of people agree, therefore it's true, a lot of articles written, therefore they're true.\n \n Should you finally produce some conclusive evidence, say, his qualifications, then this matter might be resolved - excepting that you've been holding out on nothing but faith all this time.\n \n \nI am, as I said, not presenting the dinosaur-man co-footprints as an argument for creation, I am looking into the merits of the argument, now the third time I've mentioned this.\n \n And so far, I judge the argument by its merits, whereas you add things to 'beef-up' the case. \n\n \n \nI don't see this, but perhaps I'm blind to it, could you show me how I've \"beefed up the case\"?\n\n \n It is because you are giving him abilities that he has not stated. He quite simply says ... student of biology. To you that means he's qualified to give expertise not only on track formation, but geology as well. In fact, you've retrospectively given him the mantle of expert. If he's been studying tracks 50 years, or so, I won't specify a specific time, he could be said to be an expert... but fresh out of university, he made these conclusions, and he's not wavered. He was, then, an expert from day 1 (according to you).\n \n And, according to you he's able to detect human involvement - that is forgery.\n \n You base this simply on the wish that it was so.\n \n \nHe is one man presenting an argument. I am judging that argument. You are now saying that his argument, however good or bad it is should not be judged on its own merits, but by the fact that, in general, it agrees with a number of other arguments. \n \n \n \nWhen did I say that? Of course it should be judged by its own merits. I hate when people twist things to beef up their arguments, don't you? \n\n \n You said clearly...\n \n Furthermore, he is FAR from one man. I'd say he's one of millions as opposed to one of very few who actually believe they are human tracks. Even most Creationists distance themselves from this issue.\n\n \n Quite clearly you are arguing that, aside from being a lone voice on the issue, other people have come to the same conclusions, you even suggested most creationists, but fail to site any evidence to support that later claim. I am still waiting. It is all well and good of you to try to suggest something about the minds of creationists, but I'm afraid that mind-reading is not my forte.\n \n You make so many just-so statements and expect people to believe it. He has done the same, and you believe him.\n \n You are making arguments based on numbers.\n \n \nMy point was that he is not alone in his work. Numerous other qualified scientists' work in numerous associated fields beyond biology and geology supports his, a million was hyerbole (sic), my apologies. \n \n Beyond that, I fail to see how someone's argument is less valid because it draws on the conclusions of others, or agrees with them?\n\n \n Are they given to making the same just-so arguments he makes? Just because he's no expert, and writes a dozen articles, doesn't make him any more an expert. Others doing the same thing, if that is what is happening, equally adds no weight to the argument. 1 x1 x1 x1 is still one, no matter how many 1's you add to it, it just doesn't get bigger.\n \n What qualifications do they have? What writings have they presented? Are the people making the claims about man-made tracks less qualified? You seem to think so.\n \n \n As to Creationists...\n Do they? You have the stats to back that up? Was their a poll of Creationists? Or are you again just accepting a blanket statement as fact. Again you are adding to the argument without basis. Unless you are prepared to add in facts through quoted sources, otherwise you are just stating what you hope to be the case. \n\n \n \nThe statement about Creationists was drawn from (sic) article, that I freely admit. I've since read numerous other articles from the site, both by Creationists and Evolutionists, and I'd say the assessment is fair. It's also based on my personal experience on this board and others. \n\n \n Indeed, a just-so statement was made, and accepted by you unless you are prepared to show me the creationist sites you've read this on. Are they representative of all creationists? I am a creationist, I don't have a web-site... how was my opinion factored into the equation? Many of my friends equally are creationists, and none of them have web-sites either. I don't believe that they were polled. I'll go check, I don't want to make an assumption as you have. (they also haven't posted on web-site debts - so you're ability to read their minds astounds me).\n \n \nHow (many?) quoted sources is enough? 1? 10? 100? \n\n \n You tell me your criteria for surveying, and I can tell if it's enough. Otherwise it's another just-so argument that you simply take as 'fact'.\n \n \nThis brings me to another point - when is someone's statement considered qualified? What is required for a statement to have basis? Do I actually have to poll every Creationsist (sic) in the world and publish a paper, or can I draw an inference from sources I've read and my own experiences?\n\n \n Ah, now we're not talking about creationists, but creationist experts. You say that there's no qualification to being a track expert, so how are you going to figure out which creationists to ask?\n \n He generally refers not to experts, but creationists in general...\n \"By this time a growing number of creationists were becoming disenchanted with Baugh?s methods and claims...\"\n \n Which is it you are talking about?\n \n \n He states this, that the tracks were caused by geological phenomena, and forgery, etc. He has stated that he accepts a whole number of different causalities, other than they are as they are claimed to be by Creationists. \n\n \n \nHe stated clearly, and I quote\n \n \"Although we were at the time open to creationist ideas and actually hoping to confirm the human track claims, we resolved to examine and record whatever we found as thoroughly and carefully as possible.\"\n \n So you read his mind and determined he was in fact on an evolutionist witch hunt right from the outset?\n\n \n Not at all. I've already dealt with this statement of his, and found it rather naive for him to think that any right-thinking person would believe it to be so... it is the type of thing you believe - that a scientist is above personal bias.\n \n Logic says this fella is a biologist with an evolutionists bent. He claims that he was prepared to go along and make a judgement that might have undermined all notions of Darwinism (with regards time-scale) that he'd ever been taught. I am making an assumption here, but it seems so ludicrous that he would be that sort of exceptional person, especially in light of the fact that he's prepared to comment on factors he's not stated he's an expert in. It just seems too arrogant.\n \n I am assuming that he, like you makes just-so arguments to be factual. Very likely he makes assumptions based on numbers of 'experts' rather than facts... though this of course is just a guess on my part.\n \n \nHe collected the data, did his research, and formed a conclusion.\n\n \n Based on what expertise?\n \n As I said earlier, if a creationist scientist comments outside his field, he is lampooned. You see no problem with this biologist making comments on geology... even if he studied it, he wouldn't necessarily be an expert. I studied Irish, and I can't speak it. Nil thuigimm e.* You give him credit simply based on the fact that he's a scientist, and he's published a work that agree with you... so you add in details that aren't present.\n \n He may well have studied tracks all his life, I don't know. He doesn't state this, and as I said at the very beginning, I am only able to judge this work by the work itself. You have some special insight that transcends my capabilities.\n \n \nHis actual conclusion was that the tracks were indeed dinosaur tracks, not some unusual geologic phenomenon. There goes your beef. He didn't dream it up, he researched it, thoroughly, and brought in experts from other fields when he was underqualified.\n\n \n He said some of the tracks were dinosaur tracks, but also some were forged, and some were geological depressions. Even within the category of dinosaur tracks, some were straight out caused by dinosaurs tails, some by their snouts, and \"Some were mud-collapsed\" dinosaur tracks.\n \n Which is what I stated earlier, a whole range of phenomena were concerned in the creation of these 'tracks' besides the normal phenomena for the agreed dinosaur tracks. This is quite extraordinary, as well, he seems to have stumbled on a dinosaur which just happens to have a special walking gait to account for these other 'tracks'.\n \n You then argue that even if he wasn't an expert, he collaborated with a whole lot of other people, who must have been experts\n \n *I've got \"Teach Yourself Gaelic\" plus all the notes etc from university, and I'm still unable to converse", 
   {}, 
   50972, 
   null, 
   1085198220.0
  ], 
  [
   51768, 
   null, 
   "montalban", 
   "Specifically, what similarities are you talking about? Earth (now with life) is very different physically from Mars (which has no life). What do you see are the similarities between an earth-life model and a lifeless-Mars model? When was Mars at such a stage that it supported life - in so far as there's no evidence that it ever did? \n\n \n \nThere are numerous similarities in the geomorhology (sic) of Mars and Earth. Check it out yourself. Just do a search. February's (I believe) National Geographic also has an excellent article.\n\n \n The Earth and Mars are dissimilar as far as I understood; geomorphiclly speaking - as Mars is in effect 'dead' inside -whereas Earth is still nice and warm. But I'll have a look, ta.\n \n \n Where was this observed - what data of life on Mars has been found to test? (Or, for that matter, any other planet other than earth.) \n\n \n \nI guess we'll find out soon enough if there's any evidence of life.\n\n \n Sure, we can look. I have however a belief that the money would be better spent on other sciences, such as medical research. But that's just a belief that we should deal with he here and now rather than some pipe-dream of what might be.\n \n \nIs it science to have a hypothesis, and continue to hope for half a century? When does hope cease becoming science and becomes faith, in your view? \n\n \n \nContinue to hope? That's a warped view of science. Science on a deadline. Good thing not many share your perspective.\n\n \n When does science cease being science, and just wasting billions of dollars?\n \n \nTechnology advances, we're capable of doing things now we couldn't have imagined half a century ago, like land a rover on another planet. Should we have given up \"hope\" 10 years ago and said to heck with it?\n\n \n In many respects, yes. I would prefer to see people look after people, than rocks, but that's because I believe people are intrinsically worth more.\n \n \n For instance, why would aliens use radio waves? SETI is looking specifically for radio waves. Why is it science to hypothesise that aliens, if they existed, would follow the same technological pathways we did? (It doesn't sound very 'alien') \n\n \n \nWe're limited by our own understanding and technology. That should be pretty obvious to you. We can only hope to detect extra-terrestrial life it it exists and communicates within our current realm of scientific knowledge. If the \"aliens\" are transmitting in some form that we can't understand as yet, then I guess we're missing out.\n\n \n That's a lot of 'ifs'\n \n If they exist\n If they exist in an area we're searching\n If they use similar technology\n If they use similar or detectable language - who knows they could speak in 'static'.\n \n Hence I don't believe it really is science, by your definition or mine.\n \n \n I don't wish to discredit science per se, but simply put human knowledge back within the context of humanity... whereas you told earlier of some drive to get beyond the humanity \n\n \n \nScience is a human endeavour, that's undeniable, and with that comes human error and emotion. \n\n \n Indeed, that's why I don't set it up as the over-arching belief system in my life. I prefer 'perfection'\n \n \nI do feel we need to strive to eliminate human biases, whether they be racial, sexual, religious, etc... from the scientific process.\n\n \n Do they do this? I know studies of evolutionary science are quite tainted with sexism, less so now with racism, but it's still there too...\n Currently there's a book (which, admittedly I've not read)\n \"Race And Human Evolution: A Fatal Attraction \"\n \n by Milford Wolpoff, University of Michigan and Rachel Caspari, University of Michigan \"Race and Human Evolution is a far-ranging account by leading researchers in the field that describes the latest scientific evidence and the conflicting theories about human evolution.\" \n \n http://www.perseusbooksgroup.com/pe...y/0-8133-3546-9 *\n \n \n \n Enabled our continued survival? That's a value-laden statement if ever there was one, and typical of the pro-science debaters I've come across - that ultimate faith in man. I have mentioned that you and others put scientists on a pedestal that is just simply unworkable a belief... man without his foibles. \n\n \n \nAs oppossed (sic) to ulitmate faith in an invisible supernatural being? A being that works through man to ensure man's continued survival? Yep, I guess that's my value. What a shame to only be typical.\n\n \n I make no bones about having a belief system and a value system based on Christianity. I think however, as we are both in agreement about the foibles of man, then holding man up as the be-all and end-all of knowledge is rather silly. (unless you have another source for knowledge - say, aliens?)\n \n On a side issue here, too, and this is more of a personal feeling... I find it odd that they spend $$$ looking for aliens, and yet anytime that one is spotted - granted by some West Virginian coal miner, or the like, the scientists debunk this. The 'evidence' of a visitation is derrided. So, they get to continue to spend $$$ of dollars, so the experts have a job.\n \n \nAgain, where have I put any scientist on a pedestal? Where have I stated that scientists are without \"foibles\". This is your perception, not mine, I would never make such a statement.\n\n \n You have by default, as you hold up science as the potential for all of life's answers. You choose this science over God as the ultimate source.\n \n \nMy idea of science, and this is based on my world-view, is that science is a noble pursuit, so long as it does not take precedence over attempting to be close to God. I don't believe this statement of faith needs to be supported by evidences, as it is a statement of faith. \n\n \n \nGood thing. Ain't faith great!\n\n \n Why do you think faith, based on God's commandments is inferior to foible-filled science?\n \n \n This is at the core I am interested in, studying ideas. Your ideas, you believe are rational-logical, but are largely based on faith... faith in science in general, faith in particular scientists, faith that when science acts on faith (e.g. aliens), it still is science. \n\n \n \nAgain, while I see your point, it's \"typical of believers\" to try and point out that scientists also act on \"faith\".\n\n \n Why not? I've seen so many debates that derride Christians for not having any brains because they state that they have faith. I am simply putting science under the same scruitiny - of epistemology.\n \n One of the most common is the question - how can religion be true when there's so many of them...\n \n To which I retort - how can evolution be true, when there's so many of them?\n \n \nThe only faith I see in science is faith in your fellow man to follow the rules of scientific procedure. It's impossible for me to test every hypothesis and perform every experiment myself in order to ascertain its veracity. As such, I do place faith in the fact that I haven't been deceived. I don't see it as faith in science, but rather, more of a faith in my fellow man.\n\n \n Have I directed your gaze at any feminist critiques of science? I'm not sure that I have. They deal with science in a scientific manner and show huge gender bias in science. Your faith in science is not so well placed... and you are in a way, more correct than you realise when you say 'faith in my fellow man', because according to feminist research, science is dominated by males.\n \n \nScience itself is based on the ability to support a claim with repeatable, physical proof. I realize this gets hazy in certain \"soft sciences\" and in the realm of nuclear physics and chemistryfor example, however, the conclusions drawn and theories presented are for the most part based on repeatable experimentation, and in the above instances where direct observation is not possible, extrapolation and inference.\n \n Waxy\n\n \n Repeatble proofs can be wrong. I will have to paraphrase from \"Chaos\" by Gleick as I can't find my copy around, and therefore am going off memory.\n \n Suppose we have a scientist asked to describe the behaviour of a newly discovered bacteria, which for the purposes of this rant, I'll call \"Species 1138\".\n \n He ('cause it's most likely a fella), sits down with his microscope and dish and looks at the bacteria. He then might make comments about the way the bacteria 'act', with notations about lab conditions and how the bacteria were kept etc.\n \n He publishes the work.\n \n A lab in Germany, one in the UK, one in New Zelanad, and one in the USA all get a shipment of Species 1138. They each observe the behaviour under similar conditions and each note that their observations are the same as those made in Sydney.\n \n It is published by Nature \"Species 1138 is a vibrant species of Bacteria.... labs around the world confirm ...blah blah...\"\n \n The experiment was repeatable. Anyone with a batch of Species 1138 can observe it.\n \n The experiment is wrong.\n \n To observe Species 1138 each observer uses a light to illuminate the sample. Species 1138 are photo-sensitive. How they are 'normally' is different to how they are - when observed. They 'normally' aren't so vibrant.\n \n The observer has affected the observation.\n \n It's an interesting book, \"Chaos\" with some other examples of obeserver affected observations. It reminds us of the old saying \"If a tree falls in an empty forest, does it make a noise\"... and as far as Gleick is concerned, the answer is 'no'.\n \n The most basic assumptions we do everyday, unconsciously.\n \n \n * a book which deals with notions of evolution that have been influenced by ideas on race.\n Thus...\n \n \"The recent African-origin model championed by many genetic researchers relies on genetic findings that fit just as easily into a contrasting multiregional model. That is, populations of H. sapiens living in different parts of Africa, Asia, and Europe interbred enough over at least the past 1 million years to evolve collectively as a single species. The various populations around the world derived from even older ancestors of H. sapiens in this scenario.\n \n Practitioners of what has been dubbed anthropological genetics now operate with a sense of caution and a hunger for better explanations of how evolutionary forces produce genetic diversity among individuals and groups.\n \n \"A lot of us have been too eager to assume that a strict out-of-Africa model is correct because it's compatible with the genetic data, without considering that the data also fit with the multiregional theory,\" says anthropologist John H. Relethford of the State University of New York at Oneonta. \"It's time to go back to the drawing board on this issue.\"\n \n A fundamental conflict between the two current theories--each of which has several proposed variations on its theme--lies in their differing assumptions about the evolutionary significance of genetic differences among individuals and populations, Relethford asserts. DNA analyses appear unable to determine which perspective proves superior, he says.\"\n \n http://www.findarticles.com/cf_dls/...1/article.jhtml", 
   {}, 
   51703, 
   null, 
   1085241300.0
  ], 
  [
   52097, 
   null, 
   "Waxy", 
   "You are confident that science will provide the answers. You have faith in tha ability of science. Science and progress, faith in man. It is part of your belief system, this faith.\n\n \n Not true. I believe science to be the best tool at mankind's disposal. I DON'T believe that it can provide ALL the answers.\n \n \nYou've also displayed faith that when those scientists talk, they do so with authority - such as in out 'footprints' discussion, where-by, without stated evidence, you just hope that he is an expert in fields other than that which he credits himself. Your mind adds to the details given. You kind of 'fill in the holes' in the argument - based on this faith.\n \n Secondly, I think you're trying to draw a distinction between faith and belief which won't work, in this context. In the concept of aliens, scientists, as far as I'm aware, have no actual proof that aliens exist, so what other kind of belief is left?\n\n \n I don't know how else to state differences between belief/faith vs. hypothesis, so I won't continue to do so. I think I've been very clear.\n \n \nSimply not true. You just assume this to be true, because you don't believe in Jesus or angels (I am making a guess here). People have seen and spoken with angels throughout history.\n\n \n I'll leave this one. Start a different thread if you want to press it. \n \n I did speak to Elvis yesterday though, he said everything's fine, not to worry.\n \n \nYou draw distinctions between faith and belief -when that belief is not based on fact - as in I believe the USA to exist - for even though I've not been there, I've reason to believe. What other basis for 'belief' then do scientists have?\n \n I'll tell you.\n \n Scientists believe in statistics.\n X amount of planets.\n We know one of them is inhabited.\n Therefore others might be. Here, 'might' refers to faith.\n \n So, based on that flimsy premis they then conjecture, that if we had radio, they must have had radio. So they get billions of dollars to go looking for the signs of these aliens. Then they also begin to speculate about what they might look like. We even send them an invitation to come and see us.\n\n \n Might DOES NOT  equal faith. How can you not see that? \n \n No scientist says \"I have faith in the existance of aliens\", and no believer says \"God might exist\". Is that a clear enough analogy for you?\n \n Speculating on what aliens may look like isn't high on my list of \"legitimate\" science. However, use use of probabilities and statistics in not in any way unscientific, and as I've stated, we can only hope to discover evidence that is within our current realm of understanding. You put it as a simple if A is white then B must be white scenario. That's false, and misleading. Simply put, we only have A, so we use A and hope that \"they\" also have A. Pretty straight forward.\n \n \nYou seem like an intelligent person (I don't know if you're a bloke or a sheila), why do you think that that sort of endeavour is worthy of 'science'?\n\n \n Bloke. It is exploration and an attempt to understand that which we don't know. That is the heart of what science is all about. If not, I'd still be on a wind swept island off the coast of Europe, for fear that sailing out into the ocean meant falling off the Earth.\n \n Waxy", 
   {}, 
   51691, 
   null, 
   1085506380.0
  ], 
  [
   52104, 
   null, 
   "Waxy", 
   "Here you make an assumption again. I would credit a hunter-gatherer as an expert on tracks. No need to have a PhD. However, leaving aside your obsession with degree qualifications, a biologist might have specialised in dentition, and I would not suggest that this would qualify them to give expert comment on tracks. You simply assume that he is a biologist who\n a) studied tracks or animal locomotion (in his degree)\n and\n b) geology\n as he comments on both.\n \n If he'd grown up in the bush, with frequent recourse to hunting, I'd have accepted him as an 'expert' on tracks.\n\n \n If I would have stated he was bushman and was an \"expert\" on tracks, you would have dismissed him as having no formal training and not knowledgable on the subject of dinosaurs.\n \n That aside, a degree in biology does cover animal locomotion, maybe not in exhaustive detail, but I'd guessing it's pretty safe to say that someone with a degree in biology has a better understanding of locomotion than someone without. As I pointed out, he left much of the geological work to others with specific training in the field.\n \n \nAs it stands you just make an assumption about these qualifications, and I can't, as I've not seen the evidence... Funny that you're the evolutionist basing your beliefs on faith, and I'm the creationist demanding to see the evidence.\n\n \n Please tell me what type of evidence of his qualifications you would like to see. You've already stated that degrees are irrelevent to you, so just what is it you want? What would it take for you to accept his word as being correct, or at least, worthy of respect?\n \n \nHe has published numerous articles, therefore he is an expert, is the argument you make now. Let's again look to what he did when fresh out of university, he stated he was a biologist. Full stop, nothing else. He then studied the tracks, and has published on them. You raise him to 'expert', when right from the beginning he fails to live up to this.\n\n \n Publishing numerous articles represents the ongoing study of an issue and therefore an increased knowledge of it. You can't publish the same paper umpteen times, there has to be new and relevent information. He studied the tracks for years, consulted others, and after that period, his position remains the same. Therefore regardless of his \"expert\" status as a new grad, his work has stood up to the criticism and examination of other \"experts\".\n \n \nYou try the 'numbers' game... a lot of people agree, therefore it's true, a lot of articles written, therefore they're true.\n\n \n See above.\n \n \nIt is because you are giving him abilities that he has not stated. He quite simply says ... student of biology. To you that means he's qualified to give expertise not only on track formation, but geology as well. In fact, you've retrospectively given him the mantle of expert. If he's been studying tracks 50 years, or so, I won't specify a specific time, he could be said to be an expert... but fresh out of university, he made these conclusions, and he's not wavered. He was, then, an expert from day 1 (according to you).\n\n \n Again, I would ask you if you've actually read the article. \n \n No specific time to being an expert? So that rules out a new grad?\n \n I pity every new grad out there, because they are obviously fools until they are what 50? \n \n Furthermore, I never stated he was an expert from day one, YOU DID. I stated that he formed a conclusion after doing research. The results of which were affirmed by several independent workers. I'm not sure when he was granted special \"expert\" status. Why don't you tell me?\n \n \nQuite clearly you are arguing that, aside from being a lone voice on the issue, other people have come to the same conclusions, you even suggested most creationists, but fail to site any evidence to support that later claim. I am still waiting. It is all well and good of you to try to suggest something about the minds of creationists, but I'm afraid that mind-reading is not my forte.\n\n \n I'm limited as much by interest in the issue as time Montalban. I don't have time to cite and reference a million geology papers and textbooks. (As a side note, the claim is generally dismissed as ludicrous, and has received very little attention from main stream science.) Nor do I have time to cite Creationist sources. I gave you my reasons and evidence for believing the claim.\n \n \nAre they given to making the same just-so arguments he makes? Just because he's no expert, and writes a dozen articles, doesn't make him any more an expert. Others doing the same thing, if that is what is happening, equally adds no weight to the argument. 1 x1 x1 x1 is still one, no matter how many 1's you add to it, it just doesn't get bigger.\n\n \n See my above response about research and publishing. Have you ever researched or published anything?\n \n \nWhat qualifications do they have? What writings have they presented? Are the people making the claims about man-made tracks less qualified? You seem to think so.\n\n \n I think it's been proven. Again, I have read the site and many of the links, have you?\n \n \nIndeed, a just-so statement was made, and accepted by you unless you are prepared to show me the creationist sites you've read this on. Are they representative of all creationists? I am a creationist, I don't have a web-site... how was my opinion factored into the equation? Many of my friends equally are creationists, and none of them have web-sites either. I don't believe that they were polled. I'll go check, I don't want to make an assumption as you have. (they also haven't posted on web-site debts - so you're ability to read their minds astounds me).\n\n \n If you want to argue the validity of polls, start a new thread.\n \n \nAh, now we're not talking about creationists, but creationist experts. You say that there's no qualification to being a track expert, so how are you going to figure out which creationists to ask?\n\n \n I've stated several factors that lead to one being viewed as an expert, it's you that has issues with the term, not me.\n \n \nNot at all. I've already dealt with this statement of his, and found it rather naive for him to think that any right-thinking person would believe it to be so... it is the type of thing you believe - that a scientist is above personal bias.\n \n Logic says this fella is a biologist with an evolutionists bent. He claims that he was prepared to go along and make a judgement that might have undermined all notions of Darwinism (with regards time-scale) that he'd ever been taught. I am making an assumption here, but it seems so ludicrous that he would be that sort of exceptional person, especially in light of the fact that he's prepared to comment on factors he's not stated he's an expert in. It just seems too arrogant.\n\n \n Arrogance? Like refusing to believe a man's word because you know better?\n \n \nAs I said earlier, if a creationist scientist comments outside his field, he is lampooned. You see no problem with this biologist making comments on geology... even if he studied it, he wouldn't necessarily be an expert. I studied Irish, and I can't speak it. Nil thuigimm e.* You give him credit simply based on the fact that he's a scientist, and he's published a work that agree with you... so you add in details that aren't present.\n \n He may well have studied tracks all his life, I don't know. He doesn't state this, and as I said at the very beginning, I am only able to judge this work by the work itself. You have some special insight that transcends my capabilities.\n\n \n You have yet to give me any examples of Creationist scientists being lampooned for comments outside of their field, and I certainly haven't done so myself. Is that your own experience?\n \n Again, read the article, he bases the geology portion on consultation with several geologists, I'm not sure whether they're experts or not.\n \n \nHe said some of the tracks were dinosaur tracks, but also some were forged, and some were geological depressions. Even within the category of dinosaur tracks, some were straight out caused by dinosaurs tails, some by their snouts, and \"Some were mud-collapsed\" dinosaur tracks.\n \n Which is what I stated earlier, a whole range of phenomena were concerned in the creation of these 'tracks' besides the normal phenomena for the agreed dinosaur tracks. This is quite extraordinary, as well, he seems to have stumbled on a dinosaur which just happens to have a special walking gait to account for these other 'tracks'.\n\n \n Please define \"normal phenomena for dinosaur tracks\".\n \n \n*I've got \"Teach Yourself Gaelic\" plus all the notes etc from university, and I'm still unable to converse.\n\n \n That's unfortunate, I guess you wasted your money. Maybe you should have tried harder, you might be an expert by now.\n \n Waxy", 
   {}, 
   51703, 
   null, 
   1085508360.0
  ], 
  [
   52106, 
   null, 
   "Waxy", 
   " Sure, we can look. I have however a belief that the money would be better spent on other sciences, such as medical research. But that's just a belief that we should deal with he here and now rather than some pipe-dream of what might be.\n\n \n This has been debated elsewhere, start a new thread if you'd like.\n \n The benefits that mankind has received through scientific endeavours such as space exploration far outweigh the cost.\n \n \nIndeed, that's why I don't set it up as the over-arching belief system in my life. I prefer 'perfection'\n\n \n Where do you find perfection? I'd like some of that.\n \n \nDo they do this? I know studies of evolutionary science are quite tainted with sexism, less so now with racism, but it's still there too...\n Currently there's a book (which, admittedly I've not read)\n \"Race And Human Evolution: A Fatal Attraction \"\n\n \n So we're changing the subject to sexism in science? Why? I think the reason for the imbalance is pretty obvious, and much lies at the foot of the church.\n \n \nI make no bones about having a belief system and a value system based on Christianity. I think however, as we are both in agreement about the foibles of man, then holding man up as the be-all and end-all of knowledge is rather silly. (unless you have another source for knowledge - say, aliens?)\n\n \n More silly than believing in an all powerful supernatural being of which we have no evidence? I guess we'll have to agree to disagree on that one.\n \n We are what we are, mankind isn't perfect, but mankind is all we've got.\n \n \nYou have by default, as you hold up science as the potential for all of life's answers. You choose this science over God as the ultimate source.\n\n \n Yes, I believe in the physical realm, and that science is the best tool with which to understand it. As I've stated, I don't believe science is capable of providing all the answers.\n \n \nWhy do you think faith, based on God's commandments is inferior to foible-filled science?\n\n \n See above.\n \n \nOne of the most common is the question - how can religion be true when there's so many of them...\n \n To which I retort - how can evolution be true, when there's so many of them?\n\n \n No offense, but that shows a lack of understanding of the theory of evolution. Check some posts in other threads for concise answers.\n \n \nHave I directed your gaze at any feminist critiques of science? I'm not sure that I have. They deal with science in a scientific manner and show huge gender bias in science. Your faith in science is not so well placed... and you are in a way, more correct than you realise when you say 'faith in my fellow man', because according to feminist research, science is dominated by males.\n\n \n Ground breaking news. emoticon_rolleyes \n \n See my response above.\n \n \nRepeatble proofs can be wrong. I will have to paraphrase from \"Chaos\" by Gleick as I can't find my copy around, and therefore am going off memory.\n\n \n The anecdote does not prove those scientists \"wrong\" it demonstrates that the bacteria act in a consistent manner given a certain set of parameters. You're logic (Gleick's actually) is flawed on this one.\n \n I'm not in the least interested in going off on a tangent on some race/evolution thing.\n \n Waxy", 
   {}, 
   51768, 
   null, 
   1085509500.0
  ], 
  [
   52124, 
   null, 
   "Astronomer", 
   "It is interesting to see Gleick's seminal work in explaining chaotic dynamics to the general public being used in the hands of the creationist to try to show that science is uncertain.\n \n That science is uncertain is a non-sequitor. That it does not rely on the absolute faith in its abilities to divine the truth allows detractors to use its own incredulity against it. Only the detractors themselves don't want their own ideas subject to the same level of critique.\n \n Yes, scientists have faith that \"not having faith\" will produce the right answer. Yes, sometimes things can be confusing or unreproducable (as is the case in chaos dynamics). No, that does not mean that science is unable to function.\n \n In chaos theory, while individual trials may produce drastically different results, non-linear dyanamics still can be studied in a statistical sense. This is where computation power of today's computers come into play. It's why Gleick has a fractal on his cover. To say that science isn't working then is just to be ignorant of the methodology: science just isn't working in the traditional way the public thinks science *should* work. However, the same \"values\" of the scientific method are applied: and they are applied dispassionately.\n \n This can be compared to directly with someone who lets religious faith inform them about the physical world. For them, the determinism is simply a product of an Almighty Being that can reveal and cause at the Almighty Being's will. There are no tests in place to determine whether this makes any sense.\n \n If science makes any pretenses on this sort of worldview it is only with regards to the physicality of the claim: that is science is interested strictly in that which is observable. If you believe that God is observable in the scientific sense then you are going to necessarily clash with scientists who do not rely on the worldview of the above paragraph to do anything. However, there are theists who rely on observability of their religion through science to be strictly based upon belief in manifestation. That is, there are theists who accept the physical world can be a manifestation of their own faith without imposing any conditionalism upon the science that is most effective at studying it. These are the only theists with whom it is worth having any discussion because at least they accept that science can do its job. The rest of those who do not believe that science can do its job are simply not going to be convinced because they're going to get hung up on their own certainty versus science's comparative uncertainty. I'd hold it against them, but I don't think it's worth it. They simply don't have anything to add to a conversation with myself.", 
   {}, 
   52106, 
   null, 
   1085527200.0
  ], 
  [
   52435, 
   null, 
   "montalban", 
   "Sure, we can look. I have however a belief that the money would be better spent on other sciences, such as medical research. But that's just a belief that we should deal with he here and now rather than some pipe-dream of what might be. \n\n \n \n This has been debated elsewhere, start a new thread if you'd like.\n\n \n Hang on? You want me to start a new thread to discuss things that have already been discussed 'somewhere'? That's a laughable debatng style you've got there.\n \n The benefits that mankind has received through scientific endeavours such as space exploration far outweigh the cost.\n \n Really? SETI has benefited mankind? I thought that the space race was about reaching the moon before those godless commies.\n \n Do you know of any? Certainly Independence Day was an entertaining film, but do you mean in the realm of fiction?\n \n Making sweeping statements might be entertaining, but it's not really a debate.\n \n \n Indeed, that's why I don't set it up as the over-arching belief system in my life. I prefer 'perfection' \n\n \n \nWhere do you find perfection? I'd like some of that.\n\n \n Try going to Church, opening your heart to God.\n \n \nDo they do this? I know studies of evolutionary science are quite tainted with sexism, less so now with racism, but it's still there too...\n Currently there's a book (which, admittedly I've not read)\n \"Race And Human Evolution: A Fatal Attraction \" \n\n \n \n So we're changing the subject to sexism in science? Why? I think the reason for the imbalance is pretty obvious, and much lies at the foot of the church.\n\n \n What do you mean 'we've changed the subject'\n \n My subject was about the imperfections of science, including feminist critiques... obviously you don't read all of the posts. Admittedly I have made most of this narrative on another thread within the Evolution debate - good of you to remain so focussed :-)\n \n \nI make no bones about having a belief system and a value system based on Christianity. I think however, as we are both in agreement about the foibles of man, then holding man up as the be-all and end-all of knowledge is rather silly. (unless you have another source for knowledge - say, aliens?) \n \n More silly than believing in an all powerful supernatural being of which we have no evidence? I guess we'll have to agree to disagree on that one.\n\n \n \nWe are what we are, mankind isn't perfect, but mankind is all we've got.\n\n \n No, there is perfection. Jesus Christ is perfection. Go to Church, open up your heart.\n \n \n You have by default, as you hold up science as the potential for all of life's answers. You choose this science over God as the ultimate source. \n\n \n \nYes, I believe in the physical realm, and that science is the best tool with which to understand it. As I've stated, I don't believe science is capable of providing all the answers.\n\n \n Then if you want truth - turn to God. I'm talking about real truth, not something that's true today and false the next\n \n \nOne of the most common is the question - how can religion be true when there's so many of them...\n \n To which I retort - how can evolution be true, when there's so many of them? \n\n \n \nNo offence, but that shows a lack of understanding of the theory of evolution. Check some posts in other threads for concise answers.\n\n \n You mean you do read other posts in other threads? I thought you weren't aware of my general criticisms of science. What you really show is a total misunderstanding of the sciences. There is not one science, and the rest is pseudo-science.\n \n There's, for instance, Marxist science, feminist science, nationalist science, and our own, western capitalist science.\n \n \nHave I directed your gaze at any feminist critiques of science? I'm not sure that I have. They deal with science in a scientific manner and show huge gender bias in science. Your faith in science is not so well placed... and you are in a way, more correct than you realise when you say 'faith in my fellow man', because according to feminist research, science is dominated by males. \n\n \n \nGround breaking news. \n \n See my response above.\n\n \n This then is probably the laziest response I've yet read. Yes, I dip my hat to you on that, a devastating blow - I'm simply to accept that you have the answer somewhere. Sounds like you're acting the way you claim religions act.\n \n \n Repeatable proofs can be wrong. I will have to paraphrase from \"Chaos\" by Gleick as I can't find my copy around, and therefore am going off memory.\n\n \n \nThe anecdote does not prove those scientists \"wrong\" it demonstrates that the bacteria act in a consistent manner given a certain set of parameters. You're logic (Gleick's actually) is flawed on this one.\n \n I'm not in the least interested in going off on a tangent on some race/evolution thing.\n \n Waxy\n\n \n Cool. In fact you're not even wishing to present a case. Simply saying \"It's been answered somewhere by someone on another post... is the same act of faith you displayed with regards to that Biologist and the 'man-tracks'. Really, you don't want to scratch the surface very far now, do you?\n \n In summary, I see your interest in this subject is fading. Your off-handed reference to 'some answer posted somewhere else' is not convincing to anyone but yourself and other uncritical minds. Even the notion that religion is to blame for any faults in science is truly lame.\n \n Next victim...\n \n \nIt is interesting to see Gleick's seminal work in explaining chaotic dynamics to the general public being used in the hands of the creationist to try to show that science is uncertain.\n\n \n Interesting that you think Gleick to be original, Waxy thinks he's flawed. Which opinion is closer to the truth?\n \n \nThat science is uncertain is a non-sequitor.(sic)\n\n \n non se·qui·tur P Pronunciation Key (nn skw-tr, -tr)\n n. \n An inference or conclusion that does not follow from the premises or evidence.\n A statement that does not follow logically from what preceded it.\n \n Look at the Uncertainty Principe.. :-)\n \n http://www.aip.org/history/heisenberg/p08.htm\n \n But really, take note of \"Because of the scientific and philosophical implications of the seemingly harmless sounding uncertainty relations, physicists speak of an uncertainty principle,\"\n \n Note 'philosophy.'\n \n \"The Uncertainty Principle \n The position and momentum of a particle cannot be simultaneously measured with arbitrarily high precision. There is a minimum for the product of the uncertainties of these two measurements. There is likewise a minimum for the product of the uncertainties of the energy and time.\"\n \n http://hyperphysics.phy-astr.gsu.edu/hbase/uncer.html\n \n It is a science that recognises uncertainty. Is this then a branch of science that you condemn as practicing illogic assumptions (you described it as a non-sequitur). :-)\n \n \nThat it does not rely on the absolute faith in its abilities to divine the truth allows detractors to use its own incredulity against it. Only the detractors themselves don't want their own ideas subject to the same level of critique.\n\n \n Really? DO apply the same level of critique to the notion of God. Your indignation is so totally misplaced. Let science disprove/prove God. You know it can't be done, therefore your notion of 'same level of critique' is unscientific.\n \n \nYes, scientists have faith that \"not having faith\" will produce the right answer. Yes, sometimes things can be confusing or unreproducible (as is the case in chaos dynamics). No, that does not mean that science is unable to function.\n\n \n I never said science is 'unable to function'. I said science functions at a level less than absolute truth - mostly because it is a man-made system, and men are fallible.\n \n By the way, I again draw your attention to Waxy saying that Gleick is illogical in his method. You fail to see criticisms from your own side. Either you are right, or he is wrong, but either way, attack the Christian. :-)\n \n \nIn chaos theory, while individual trials may produce drastically different results, non-linear dynamics still can be studied in a statistical sense. This is where computation power of today's computers come into play. It's why Gleick has a fractal on his cover. To say that science isn't working then is just to be ignorant of the methodology: science just isn't working in the traditional way the public thinks science *should* work. However, the same \"values\" of the scientific method are applied: and they are applied dispassionately.\n\n \n Again you are putting words in my mouth with regards to science. Note I have said many times I've nothing against science per se. I just believe that you should never raise it to the level it has been - as the senior source of truth.\n \n Secondly, what statistical 'sense' can be made for the observations of bacteria that are made by scientists in the example I gave? How have they over-come their own influence to make these statistics?\n \n \nThis can be compared to directly with someone who lets religious faith inform them about the physical world. For them, the determinism is simply a product of an Almighty Being that can reveal and cause at the Almighty Being's will. There are no tests in place to determine whether this makes any sense.\n\n \n What?\n \n \nIf science makes any pretences on this sort of worldview it is only with regards to the physicality of the claim: that is science is interested strictly in that which is observable. If you believe that God is observable in the scientific sense then you are going to necessarily clash with scientists who do not rely on the worldview of the above paragraph to do anything. However, there are theists who rely on observability of their religion through science to be strictly based upon belief in manifestation. That is, there are theists who accept the physical world can be a manifestation of their own faith without imposing any conditionalism upon the science that is most effective at studying it. These are the only theists with whom it is worth having any discussion because at least they accept that science can do its job. The rest of those who do not believe that science can do its job are simply not going to be convinced because they're going to get hung up on their own certainty versus science's comparative uncertainty. I'd hold it against them, but I don't think it's worth it. They simply don't have anything to add to a conversation with myself.\n\n \n You've used a lot of words to say very little. Are you American? :-)\n \n What on earth are you talking about when referring to people who rely on a world-view to believe anything? Are you talking about those scientists influenced by the philosophy of materialism? Or of Nazi science, or Marxist science? Or Radical Lesbian Feminist Science?\n \n In the early 1970s a group of radical feminists went so far as you science to suggest that it was physically impossible for a woman to achieve sexual orgasm whilst having penetrative sex. Even if the woman experienced an orgasm, she was said to be deceiving her self.... \"That even in a woman?s sexuality, there is deceit on the part of men, and complacency on the part of some women\" in Koedt, A. \"The Myth of Vaginal Orgasm.\" in Koedt, A. & Levine, E. & Rapone, A., (eds.). (1973). \"Radical Feminism\". Quadrangle Books, New York, p204\n \n They had an agenda, and had the science to back it up. Is this the sort of thing you were accusing religion of?", 
   {}, 
   52124, 
   null, 
   1085747820.0
  ], 
  [
   52443, 
   null, 
   "thebootfitter", 
   "Question for Montalban:\n \n You speak of 'ultimate truth' and 'unchanging truth' that can be found in the authority of God through the Orthodox Church.\n \n Would you concede that these ideas are 'belief' and not 'knowledge'?", 
   {}, 
   52435, 
   null, 
   1085760780.0
  ], 
  [
   52448, 
   null, 
   "Waxy", 
   "Hang on? You want me to start a new thread to discuss things that have already been discussed 'somewhere'? That's a laughable debatng style you've got there.\n\n \n Call it what you will, but things reach a point where you must narrow the focus. This debate would become endless and rather meaningless if allowed to be sidetracked by every new item that came up, most of which have been debated in detail on this site.\n \n I think you've lost the point of debate somewhere, especially as it pertains to these boards. What we are doing here is not an academic feud, though you seem to believe it is, what with your superior intelligence and all.\n \n \nThe benefits that mankind has received through scientific endeavours such as space exploration far outweigh the cost.\n \n Really? SETI has benefited mankind? I thought that the space race was about reaching the moon before those godless commies.\n \n Do you know of any? Certainly Independence Day was an entertaining film, but do you mean in the realm of fiction?\n \n Making sweeping statements might be entertaining, but it's not really a debate.\n\n \n The advancements in technology directly attributable to the \"space race\" are almost uncountable, everything from the computer you're typing on, to breathing cleaner air. Do I really have to make a specific list of every invention that resulted from, or was influenced by, advances in technology due to space exploration for it to be a \"valid\" point? \n \n Independence Day? What? How can you not know of any? \n \n Who looks foolish on that one?\n \n \nTry going to Church, opening your heart to God.\n\n \n You're answer to everything. Open your heart to superstition and myth.\n \n \nWhat do you mean 'we've changed the subject'\n \n My subject was about the imperfections of science, including feminist critiques... obviously you don't read all of the posts. Admittedly I have made most of this narrative on another thread within the Evolution debate - good of you to remain so focussed :-)\n\n \n This is a red herring issue. I've read all your posts, and I dismissed this as a weak ploy to redirect the debate.\n \n \nNo, there is perfection. Jesus Christ is perfection. Go to Church, open up your heart.\n \n Then if you want truth - turn to God. I'm talking about real truth, not something that's true today and false the next\n \n\n \n I think we've both read enough posts on these boards and info from other sources to realize that holding up Jesus and God as perfection is questionable, and comes down to your belief, never actual knowledge.\n \n I've been to church, I was raised Catholic. I opened my eyes to fallacy that was all around me.\n \n The \"truth\" is all in the interpretation, and that, is faith in MAN.\n \n \nYou mean you do read other posts in other threads? I thought you weren't aware of my general criticisms of science. What you really show is a total misunderstanding of the sciences. There is not one science, and the rest is pseudo-science.\n \n There's, for instance, Marxist science, feminist science, nationalist science, and our own, western capitalist science.\n\n \n I misunderstand science. emoticon_confused OK.\n \n Hinduism, Buddhism, Roman Catholicism, Anglicanism, Baptist, Islam. All religions.\n \n Doesn't change the definition of religion, only the bent used when applying it.\n \n But there's just one correct religion right? The rest is pseudo-religion.\n \n \nThis then is probably the laziest response I've yet read. Yes, I dip my hat to you on that, a devastating blow - I'm simply to accept that you have the answer somewhere. Sounds like you're acting the way you claim religions act.\n\n \n Again, you claim that my choice not to respond is based in ignorance/laziness. That's your opinion and your welcome to it. \n \n Like I said, Whoopity Doo!!!!! Science is dominated by males. What's your point? It's somehow less valid due to that? I don't get it. \n \n I think we both know why science has been dominated by males as well, the source of that descrimination is religion. Another sweeping statement by that fool Waxy with no proof. Frankly, I don't think any is required if you didn't just crawl out from under a rock.\n \n \nCool. In fact you're not even wishing to present a case. Simply saying \"It's been answered somewhere by someone on another post... is the same act of faith you displayed with regards to that Biologist and the 'man-tracks'. Really, you don't want to scratch the surface very far now, do you?\n\n \n No, I don't. The last thing I want to do is, like I said, go off on some tangent about race and evolution.\n \n Pointing out to you that there are countless threads on this board alone that have dealt with this topic if you so choose to continue is not faith, its simple common sense.\n \n \nIn summary, I see your interest in this subject is fading. Your off-handed reference to 'some answer posted somewhere else' is not convincing to anyone but yourself and other uncritical minds. Even the notion that religion is to blame for any faults in science is truly lame.\n\n \n Your first correct assumption!\n \n I'm not interested in going down the same old roads again. This debate has reached those inevitable crossroads. \n \n I think it was Dan on Night Court that provided me with these words to live by \"Do you know what the definition of insanity is? Doing the same thing over and over and expecting a different result.\"\n \n That notion is yours, I've not posted anything of the sort.\n \n \nNext victim...\n\n \n How wonderfully arrogant, and yet, ohhh so true, just not in the way intended. ;) \n \n Waxy", 
   {}, 
   52435, 
   null, 
   1085763540.0
  ], 
  [
   52581, 
   null, 
   "Black Mamba", 
   "This is my first time returning to the forums since I was last here in October. And to try and bring this topic back to focus, \"Noah's Flood, fact or fiction?\" I'm going to copy and paste a quote from Lurch (his very name sends creationists running for the hills on this forum) from a topic created last year. I'm doing this because it seems that looking at previous posts for evidence is something someone isn't willing to do.\n \n \"In 1909 the schooner Wyoming was launched from the Percy & Small shipyard in Bath, Maine. She was the state-of-the art in wooden hulled shipbuilding. She was a six masted schooner and, at 329 ft., the longest ship with an all wood keel and hull ever built. She was the last of nine wooden hulled, six-masted schooners built between 1900 and 1909, and one of seven built by Percy & Small. All were 300 ft. or more in length. They were all state-of-the art.\n \n The Wyoming had 90 steel crossbraces. Even while she was yet on the drawing boards the marine engineers who designed and built her knew from experience with shorter ships that the length of the Wyoming would exceed the structural limits of wood. For this reason they attempted to defeat, or at least support, the laws of physics and the principles of marine engineering with steel. It was to no avail. Not even the steel bracing could prevent the flexing and twisting that resulted in the separation of the hull planking. The Wyoming required constant pumping, as did her sister ships. The Wyoming leaked from the day she hit the water until the day, 14 years later, when she foundered and broke up off of Monomoy Island while riding out a storm at anchor.\n \n It is said that she could be seen to snake (movement of the bow and stern from side to side in relation to the midship) and hog (movement of the bow and stern up and down in relation to the midship) while underway. The action of the waves, in even calm seas, caused the planking to be sprung beyond the capabilities of any calking that could be devised. The Wyoming and her sisters were used, for the most part, for short, close-in coastal hauls, generally in sight of land. At the first sign if inclement weather, they could run for port. The Wyoming served for several years as a coal hauler, as did several of her sisters.\n \n I have always had a great love for windjammers. I have some very expensive books that deal with the minutia of their construction and for years my hobby was to build full rigged wooden models. I spent hours climbing over the decks of the U.S.S. Constitution in Charleston Navy Yard, admiring her construction. The Wyoming must have been a beautiful vessel. But she was a beautiful anachronism. At about 300 ft. the structural capabilities of wood were exceeded beyond the abilities of engineering and design to remedy\n \n Few other ships of this size were built of wood. One exception was the four-masted medium clipper barque, Great Republic built in 1853. She is sometimes reported as the longest wooden ship ever build with a length of 334 feet, but more usually she it is claimed that she was 325 feet. The Great Republic also had 90 steel cross braces, 4 inches wide, 1 inch thick, and 36 feet long. Nevertheless, she sprung her hull in a storm off of Bermuda. She was abandoned when the water in the hold reached 15 feet.\n \n And yet, creationists want me to believe that a 450 ft. (minimum) vessel of ALL wood construction was able to withstand a storm of 40 days and then remain at sea for almost a year, manned by only eight people, without the efficient pumps of the turn of the century, calked with nothing more than \"pitch inside and out\". Not to mention the overwhelming necessity of the limited crew to feed and water thousands of animals and to muck out thousands of pens (and then carry the result of the mucking up two decks in order to throw it overboard). When was there time for pumping (24 hours a day if the above is any indication) and the constant recalking in a futile attempt to stem the flow.\n \n You may perceive this as an argument from incredulity similar to those that are so typical of creationists, but I just can't believe such a fairy tale. Experience with real wooden ships sailing in real oceans indicates that Noah's ark would not have survived many days of the 40 day storm.\n \n My opinion of Noah's ark is that that boat don't float.\"", 
   {}, 
   52448, 
   null, 
   1085899680.0
  ], 
  [
   52590, 
   null, 
   "Ursus maritimus", 
   "Black Mamba, thank you. I've been looking for that essay for a couple of months now. So this is where it was hiding!", 
   {}, 
   52581, 
   null, 
   1085938260.0
  ], 
  [
   52603, 
   null, 
   "ungerdunn", 
   "It hasn't been hiding. I'm sure if you had asked, gallo/lurch/7th_Arty/Garioch would have been happy to tell you were to find it.\n \n That Boat Don't Float", 
   {}, 
   52590, 
   null, 
   1085968260.0
  ], 
  [
   52604, 
   null, 
   "Ursus maritimus", 
   "Oh, what I meant was: I remembered this essay was written, and I wanted to find it again, but I couldn't remember who wrote it or which message board it was on.\n \n Probably means that I am a member of too many message boards. I guess I just have a soft spot in my heart for creationists, heh heh. (Also probably explains why I never get anything productive done!)\n \n Edited to add:\n Doh! And I see that it is on gallo's By Bayou University site! Well, at least it will be easy for me to find now!", 
   {}, 
   52603, 
   null, 
   1085968980.0
  ], 
  [
   52605, 
   null, 
   "billsco", 
   "\n My opinion of Noah's ark is that that boat don't float.\"\n\n \n Not to mention the captain has to be Jewish. Now, which is the greater stretch: an dimensionally-challenged boat, or a nomadic, desert-dwelling goat-herder whose idea of water was a shimmering oasis? Noah may know what a camel is, but had never heard of a keel. Can't we be honest enough to acknowledge that this story is only one of many far older? Why do Christian insist the Jewish account is the only true story? \n \n Yet, these facts mean nothing to them, and as far as miracles go, these two--the boat and the pilot--are pretty minor. If you can suspend your disbelief enough to imagine a pair of kangaroos hopping on the boardwalk it isn't hard to convince yourself that the pitch used to waterproof the boat was more than adequate. Once your mind becomes comfortable with miracles, it's no great leap to visualize two lions walking behind two lambs up the ramp and bedding down beside each other, with the lions never so much as looking twice on them as a next meal. Do we think that a person who holds those unthinking beliefs will be swayed with logic in boat engineering or in piloting skills?", 
   {}, 
   52581, 
   null, 
   1085972220.0
  ], 
  [
   52637, 
   null, 
   "Ursus maritimus", 
   "And I see that it is on gallo's By Bayou University site!\n\n Speaking of gallo's By Bayou University site, on another message board I had the opportunity to post gallo's thermodynamics test. No one should ever say that evolution violates the Second Law of Thermodynamics until they understand thermodynamics well enough to take this test.\n \n Sorry for the off-topic post. :)", 
   {}, 
   52604, 
   null, 
   1086029160.0
  ], 
  [
   52701, 
   null, 
   "ungerdunn", 
   "I agree. The test seems to me to be quite similar to a first semester test in thermodynamics. It is actually quite basic. If one cannot answer on basic questions, how can one claim to speak with authority on extensions of the concepts? If one does not understand basic thermodynamics and the property of entropy, how can one address statistical thermodynamics?\n \n Could it be that creationists merely parrot answers without understanding the question? Can't be. That would be dishonest.", 
   {}, 
   52637, 
   null, 
   1086077100.0
  ], 
  [
   52702, 
   null, 
   "ungerdunn", 
   "billsco,\n \n I don't mean to rain on your parade, but the Jewish nation founded by Abraham, who lived several generations after the flood, even according to creationist christian mythology.\n \n But that also presents a problem of how many \"clean\" animals were aboard the ark. Isn't it funny that the concept of \"clean\" didn't occur until after the exodus, and yet one of the intermixed versions of the Noah story differentiates between clean and unclean?", 
   {}, 
   52701, 
   null, 
   1086077700.0
  ], 
  [
   52711, 
   null, 
   "billsco", 
   "\n I don't mean to rain on your parade, but the Jewish nation founded by Abraham, who lived several generations after the flood, even according to creationist christian mythology.\n \n \n\n \n The names, Noah, his sons Ham and Shem, are exclusively Hebrew names. That Abraham's founding of a Jewish nation is in the distant future does not mean God wasn't at that early date working with his chosen people, the Jews. That is to be implicitly understood as a Christian, beginning with our Hebrew parents in the garden. \n \n Noah must be Jewish, IMO, or the whole salvation story is called into question again.", 
   {}, 
   52702, 
   null, 
   1086095520.0
  ], 
  [
   52870, 
   null, 
   "cushla_machree", 
   "[QUOTE=montalban]I wasn't not sure if this should be at the beginning of a new thread or not... but I get back to Noah's Ark somewhere along the way.\n \n There are several people who believe that man and dinosaur were contemporaries...\n http://www.apologeticspress.org/rr/rr2003/r%26r0302a.htm\n \n \n \n Ive read that site, and found it to be completely false. Dinosaurs walking alongside man? what a laugh! That site shows a picture of 'ancient pottery' of inca origin. Its more pottery of the locals origin used to trick people. \n \n \"Two peasants from Callango, Basilio Uchuya and his wife, Irma Gutierrez de Aparcana, have admitted to carving the stones they sold to Cabrera, basing their designs on illustrations from comic books, school books, and magazines [Polidoro 2002]. \"\n \n Creationists never quite got the hang of the scientific process. Like i am supposed to respect the credibility of anyone who delibertly uses fake pictures and presents it as 'evidence'\n \n The day i learned about dinosaurs was the day i knew, the bible, while i nice book, was just a story. A good one, nonetheless, and one to live by. But taking it literally is just silly. The bible cannot stand up to the fossil record", 
   {}, 
   50937, 
   null, 
   1086238260.0
  ], 
  [
   52874, 
   null, 
   "cushla_machree", 
   "This might sound like circular reasoning.\n \n If you accept the 'flood' story at all, then you'd have to say it was a miraculous event - in that it was brought about by God. Why would it then need to totally conform with science - that wouldn't make it a miracle, then would it?\n\n \n oh now isn't that convient? Its a 'miracle' so it doesn't have to be explained!\n CASE CLOSED.\n \n But for the rational thinkers out there...i agree with the person above...the noahs ark story is preposterous. Now noah may have been a real person, the medeterranean region may have flooded, and noah may have built an ark for his family and farm animals. And it sure does make a nice story about god's promise (personally I am not a fan of a god that would just wipe out the earth like that). But the animal life on earth is just too diverse, and bible literalist who beleive in this event are off their rockers.\n \n I should really go back in time and ask noah why he forgot to bring the wholly rhinocersous aboard as well as the saber toothed cat. I also have a bone to pick with him about the marsupials. why did he only give us the virginia oppoussum over here, and drop the rest of them off in australia? couldn't we at leaste have gotten a few kangeroos?\n \n What about andrewsarchus? did he bring that abord too? or only elephants lions and tigers two by two?\n \n and why the heck do whales have vestigial pelvis's? God idea of a silly joke?", 
   {}, 
   51260, 
   null, 
   1086240360.0
  ], 
  [
   54545, 
   null, 
   "apathy", 
   "\n But for the rational thinkers out there...i agree with the person above...the noahs ark story is preposterous. Now noah may have been a real person, the medeterranean region may have flooded, and noah may have built an ark for his family and farm animals. And it sure does make a nice story about god's promise (personally I am not a fan of a god that would just wipe out the earth like that). But the animal life on earth is just too diverse, and bible literalist who beleive in this event are off their rockers.\n \n\n \n hehe, i don't think noah was living in the mediterranean", 
   {
    "post_info": {
     "post_title": "Greek Noah!"
    }
   }, 
   52874, 
   null, 
   1087607220.0
  ], 
  [
   54622, 
   null, 
   "umustbebrnagain", 
   "The \"Institute for Creation Research USA\" is not a reputable scientific organization. Their research's conclusions are foregone. There isn't enough water to cover the Himalayas or other large mountain ranges even with no polar ice caps.\n\n \n All things are possible with God. The flood was His judgement on the earth, He created the earth, and therefore He has the power to make what ever He wants to happen happen including make water come out of \"nowhere.\" The Bible describes how water came from both above the earth and from below. My God is the God of the impossible!", 
   {
    "post_info": {
     "post_title": "My God is the God of the impossible!"
    }
   }, 
   50414, 
   null, 
   1087679820.0
  ], 
  [
   54630, 
   null, 
   "T.Q", 
   "Your god is also the god of deceit. Why else would he erase all evidence of such a flood? Why erase the bones from the animals that must have died as the emigrated from the arks resting place? Answer those two and I'll have lots more", 
   {}, 
   54622, 
   null, 
   1087683240.0
  ], 
  [
   54680, 
   null, 
   "montalban", 
   "Your god is also the god of deceit. Why else would he erase all evidence of such a flood? Why erase the bones from the animals that must have died as the emigrated from the arks resting place? Answer those two and I'll have lots more\n\n \n He didn't erase all evidence. We have the Bible account.\n \n In fact, we've got accounts from heaps of different cultures all around the world. We've got cultures from all over who have a memory of what happened, and despite this, no one believes them.", 
   {}, 
   54630, 
   null, 
   1087728660.0
  ], 
  [
   54687, 
   null, 
   "Clive14", 
   "He didn't erase all evidence. We have the Bible account.\nThe bible account of a flood is evidence for the bible account of the flood? In a way I suppose it is. It's pathetically weak evidence though as there is no other evidence to support it.\n \n \nIn fact, we've got accounts from heaps of different cultures all around the world.\nYou forgot \"contradictory\" before \"accounts\". Heaps of different cultures all around the world also have stories of giant flying, fire-breathing, lizards. You think them true too?", 
   {}, 
   54680, 
   null, 
   1087744440.0
  ], 
  [
   54701, 
   null, 
   "Adept", 
   "All things are possible with God. My God is the God of the impossible!\n\n \n So you honestly believe that with the technology available at the time, Noah constructed a monstrous synthetic habitat large enough to hold two of every creature on earth? Complete with enough aquatic capacity to hold two of every ocean creature, including whales and sharks? With enough travel speed to cover the entire globe in time to pick up two of every animal, from the burrowing frogs of the african desert to the Polar bears of Antarctica?\n \n And that this vessel was also large enough to carry a supply of food adequate for so many hundreds of millions of animals? And that the waste disposal systems were adequate to handle such a volume of waste?\n \n I'm sorry, but anyone with even a shred of credibility must take the story of Noah and his ark as nothing more than an interpretation and adaption of an ages old story. To interpret it as the literal truth is beyond belief.", 
   {}, 
   54622, 
   null, 
   1087750200.0
  ], 
  [
   54707, 
   null, 
   "apathy", 
   "no no! through the power of god, the animals all came themselves, and lined up ready for the ride, haven't you seen the movie?!?", 
   {}, 
   54701, 
   null, 
   1087751820.0
  ], 
  [
   54708, 
   null, 
   "The Barbarian", 
   "I'm always astonished that creationists try the \"lots of cultures have stories about floods\" gambit. \n \n Yes, lots of cultures have stories about many things. Either there was one great flood at one time, or there have been individual floods.\n \n Since humans tend to congregate in river valleys, I think I know why all the flood stories contradict each other...", 
   {}, 
   54707, 
   null, 
   1087753200.0
  ], 
  [
   56590, 
   null, 
   "Mike_King", 
   "\"But, you have to remember that before the flood the earth had no deserts\"\n \n Sorry I have to disagree. Here is England we have the Old red Sandstone' laid down in the triassic 225 million years ago. This was when the UK was lying roughly where the Namibian desert does today south of the equator. The rocks a red because of the iron contebt and exposure to oxygen, IE is was a sedimentary rock laid down ABOVE water. You cansee clearly fossilised dunes where the grains are laid down in sorting order per sandstorm. (largest at the bottom grading to fine at the top)\n The explanation for a world wide flood is a simple one for me being a Christian; at the end of the last ice age, people were living in low coastel plains depending on fishing and agriculture. Sea levels rose by a staggering 80 metres and would have wiped out many. Isostacy in the earths crust since the end of the last ice age has caused mountainous areas to 'bounce back' (4mm per year in Scotland). Evidence for marooned beaches, flooded river valleys and discovery of complete cities off the Indian coast line is all the evidence one needs.", 
   {}, 
   54708, 
   null, 
   1088903340.0
  ], 
  [
   57064, 
   null, 
   "umustbebrnagain", 
   "Please. PLEASE, read an introductory Geology or Geography/Geomorphology textbook. Then we'll talk.\n \n Yikes.\n \n Waxy\n\n \n \n What would be the point in doing that when they are all based on evolution. This argument wont ever end because neither creationism nor evoluionism can be proved as fact. Its always gonna just be a battle between beliefs. Telling him to read that is just you trying to convince him of ur beliefs but at the same time he's doing the same thing with u. There is no sense in suggesting such things.", 
   {
    "post_info": {
     "post_title": "why?"
    }
   }, 
   50702, 
   null, 
   1089315000.0
  ], 
  [
   57065, 
   null, 
   "umustbebrnagain", 
   "I would like to address something here: God does not mind us delving into the past. It's our choice and He's not going to send hordes of angels out to prevent our research. Does it matter where we came from? I think so; it's our nature. A teenager learns he/she is adopted, soon they wonder who their parents were and most want to find them. \"Curiosity killed the cat,\" is good for child-rearing and to promote the use of common sense, but doesn't solve mysteries, discover cures for disease, nor does it facilitate the attempt for a better life.\n We know that Neanderthals existed, the remains have been found and DNA inspected. They are not the same species as the present humanoids, but close. Where did they come from? Monkeys? Absolutely not. There is no proof of that, hence the \"missing link\". Did they co-exist with our ancestors? Yes. There is proof of that. Did they \"get along\"? Yes, there is also proof of that, albeit, still under investigation. Did they have a mind, i.e., brains that could reason like our ancestors? Sort of, but they lacked imagination, the basic requirement for improving one's lifestyle. They knew nothing of making weapons, farming implements, etc. They did, I believe, learn some of this from us before they were all killed via the Flood.\n Since this debate began (not just this forum, but others, both on the net and in person) there have been two distinct sides. We all need to bring our thoughts, ideas, theories, to the table and expand on them as a unit or this will continue forever.\n \n Also I would like to apologize for the quick, thoughtless link I posted yesterday. That was an oversight and it really caused major problems with me and some of you. It will not happen again. Even though I stated that it was not my source of info, it invariably shed its light on me.\n \n So with that in mind, there could have been millions of humanoids on earth before Adam and Eve were formed. Our species, the humans with our DNA were created about 30 to 35 thousand years ago, then about 10 thousand years ago our direct ancestors were formed: Adam and Eve.\n \n Can we go from there and say that the whole earth was flooded in order to destroy all living things? Can we at least look at that? Maybe that the waters above the firmament opened up and poured out upon the earth while even more waters burst from the \"deep\", as stated in the Bible?\n \n Or is the Flood just going to be something never discussed openly...except as a myth?\n\n \n Neanderthal man was created from a single tooth. Thats ridiculous.", 
   {
    "post_info": {
     "post_title": "Ha"
    }, 
    "unicode_changes_made": true
   }, 
   50706, 
   null, 
   1089315300.0
  ], 
  [
   57067, 
   null, 
   "Ursus maritimus", 
   "Neanderthal man was created from a single tooth. Thats ridiculous.\n\n The statement that neanderthals were created from a single tooth is, indeed, a most ridiculous statement. There are, in fact, a great many examples of Neanderthal remains that have been discovered and are studied.", 
   {}, 
   57065, 
   null, 
   1089315660.0
  ], 
  [
   57068, 
   null, 
   "umustbebrnagain", 
   "I would like to address something here: God does not mind us delving into the past. It's our choice and He's not going to send hordes of angels out to prevent our research. Does it matter where we came from? I think so; it's our nature. A teenager learns he/she is adopted, soon they wonder who their parents were and most want to find them. \"Curiosity killed the cat,\" is good for child-rearing and to promote the use of common sense, but doesn't solve mysteries, discover cures for disease, nor does it facilitate the attempt for a better life.\n We know that Neanderthals existed, the remains have been found and DNA inspected. They are not the same species as the present humanoids, but close. Where did they come from? Monkeys? Absolutely not. There is no proof of that, hence the \"missing link\". Did they co-exist with our ancestors? Yes. There is proof of that. Did they \"get along\"? Yes, there is also proof of that, albeit, still under investigation. Did they have a mind, i.e., brains that could reason like our ancestors? Sort of, but they lacked imagination, the basic requirement for improving one's lifestyle. They knew nothing of making weapons, farming implements, etc. They did, I believe, learn some of this from us before they were all killed via the Flood.\n Since this debate began (not just this forum, but others, both on the net and in person) there have been two distinct sides. We all need to bring our thoughts, ideas, theories, to the table and expand on them as a unit or this will continue forever.\n \n Also I would like to apologize for the quick, thoughtless link I posted yesterday. That was an oversight and it really caused major problems with me and some of you. It will not happen again. Even though I stated that it was not my source of info, it invariably shed its light on me.\n \n So with that in mind, there could have been millions of humanoids on earth before Adam and Eve were formed. Our species, the humans with our DNA were created about 30 to 35 thousand years ago, then about 10 thousand years ago our direct ancestors were formed: Adam and Eve.\n \n Can we go from there and say that the whole earth was flooded in order to destroy all living things? Can we at least look at that? Maybe that the waters above the firmament opened up and poured out upon the earth while even more waters burst from the \"deep\", as stated in the Bible?\n \n Or is the Flood just going to be something never discussed openly...except as a myth?\n\n \n \n If ur gonna base some of ur stuff on the Bible use only the Bible. Dont distort it to fit evolution too. The Bible says Adam and Eve were the first man and woman. They didnt come after some more primitive species like Neanderthals. The rest of the earth, like the plants, animals, seas, heavens, etc., were the only things present prior to Adam and Eve. All of those things God spoke into existence. Mankind was the only creation that God formed with his hands. Dont mix the Word of God with the lie that Satan plunked in the minds and hearts of those unwilling to accept what the Bible says.", 
   {
    "post_info": {
     "post_title": "Please??!!!!!!!!"
    }, 
    "unicode_changes_made": true
   }, 
   50706, 
   null, 
   1089316020.0
  ], 
  [
   57069, 
   null, 
   "Waxy", 
   "What would be the point in doing that when they are all based on evolution. This argument wont ever end because neither creationism nor evoluionism can be proved as fact. Its always gonna just be a battle between beliefs. Telling him to read that is just you trying to convince him of ur beliefs but at the same time he's doing the same thing with u. There is no sense in suggesting such things.\n\n \n Geology and Geomorphology have NOTHING to do with evolution.\n \n Suggesting that you read on theses topics is suggesting that you educate yourself so you can make an informed decision and speak intelligently on the subject, not an attempt to somehow brainwash you. \n \n You seem to be openly stating that your position here is simply that ignorance is bliss.\n \n Again, I'd strongly suggest a little reading.\n \n Waxy", 
   {}, 
   57064, 
   null, 
   1089316200.0
  ], 
  [
   57074, 
   null, 
   "umustbebrnagain", 
   "First off, I can assure that there was no hate on sinjin's part, though I'm sure, like myself, he is somewhat frustrated/exasperated.\n \n We can measure the current rate at which the Himalyas are rising to within 1/10 of an inch in many places, same goes for the Rockies. We can measure the rate at which the sea floor is spreading with nearly the same degree of accuracy. We have conducted innumerable experiments on the rates and manner with which rocks deform.\n \n The processes that are and have been shaping our Earth are far from immeasurable, to suggest otherwise shows a lack of understanding of geologic principles and general earth sciences. \n \n To state that the Himalayas formed in the last 10,000 years is to abandon all objective science and data for faith in a miracle. \n \n To me, that's illogical. \n \n Waxy\n\n \n \n Yes we can measure all of these things to such small measures but my question is if that is so then why cant any bit of evolution, of humans evolving into another species, be detected or measured if evolution indeed happened. It seems to me that some change should be measureable no matter how long it takes to evolve.", 
   {
    "post_info": {
     "post_title": "indeed...but"
    }
   }, 
   50984, 
   null, 
   1089317040.0
  ], 
  [
   57077, 
   null, 
   "umustbebrnagain", 
   "I couldn't disagree more. Science, unfettered by agendas and beliefs, is purest form of human endeavours. It's what has gotten us where we are, and is what will enable our continued survival and understanding of our world.\n \n \n \n Sinjin already addressed this, but if you'd like to find me some science that states water is spontaneously combustible, or that horses lay eggs, I'd love to read it.\n \n Waxy\n\n \n \n I guess that is so from an evolutionists point of view but if ur talking to creationists who believe that God has enables us to get to where we are and He who created this world is the only way we will continue to survive in it and understand it, ur efforts are futile.", 
   {
    "post_info": {
     "post_title": "is that so"
    }
   }, 
   50986, 
   null, 
   1089317220.0
  ], 
  [
   57079, 
   null, 
   "Waxy", 
   "I guess that is so from an evolutionists point of view but if ur talking to creationists who believe that God has enables us to get to where we are and He who created this world is the only way we will continue to survive in it and understand it, ur efforts are futile.\n\n \n OK then, did God work through the human endeavour of science to find vaccines and \"invent\" modern medicine?\n \n Does God therefore indirectly use science to help mankind?\n \n Did God create science so mankind understand and survive in the world?\n \n What's your take?\n \n Waxy", 
   {}, 
   57077, 
   null, 
   1089317460.0
  ], 
  [
   57081, 
   null, 
   "umustbebrnagain", 
   "The only problem I have with the whole flood story, is that Noah supposedly took two of each of all the land animals and stuck them on a boat. Do you realize who big that boat would have to be? It would have to be twice the size of a football field, and there's no way a boat that big was ever made in that time period. Noah would have needed a work force of thousands to be able to make that boat, and it would still take years to do. You got to cut down the trees, make the lumber, hand forge the nails or make dowels. Not to mention how did the kangaroos get back to Australia, or even how did Noah get them in the first place? It's just too fanciful for it to be true.\n\n \n \n If there was a single landmass at the time of the flood then it wouldnt have been a problem because God brought the animals to Noah. No one knows, no matter how much they say they do, just when Pangea broke up if there ever was such a thing as Pangea. Noah's God is my God and He is the God of the impossible. I dont expect u to understand or believe what I believe when u are so heavily steaped in evolution as u must be.", 
   {
    "post_info": {
     "post_title": "well"
    }
   }, 
   51075, 
   null, 
   1089317580.0
  ], 
  [
   57085, 
   null, 
   "whistler", 
   "I guess that is so from an evolutionists point of view but if ur talking to creationists who believe that God has enables us to get to where we are and He who created this world is the only way we will continue to survive in it and understand it, ur efforts are futile.\n\n \n Apparently God didn't enable you write clearly. \n \n \nYes we can measure all of these things to such small measures but my question is if that is so then why cant any bit of evolution, of humans evolving into another species, be detected or measured if evolution indeed happened. It seems to me that some change should be measureable no matter how long it takes to evolve.\n\n \n While your thoughts are not clear here, I interpret them to mean why can't we measure current evolutionary processes. If this is not a correct interpretation please clarify your statements. \n \n Start with this thought exercise: Using an analog watch with only a second hand I want you to measure the time it takes for light to reach your eyes after you flip the switch on the wall. Can't do it, can you? Your tools are inadequate for the task at hand. It is similar with evolutionary processes in humans--the present tools to concurrently measure such change is inadequate relative to the task at hand. With the light example you need a system designed to measure in sub-nanoseconds and with the evolution example you need a system to measure in the realm of tens of thousands of years.\n \n There is a difference between the inability to measure something and the impossibility of measuring something. Ordinary means are unable to measure both the human evolutionary process and the speed of light; on the other hand neither is impossible to measure, you just need to do it right.\n \n I hope this makes sense for you.", 
   {}, 
   57077, 
   null, 
   1089318000.0
  ], 
  [
   57086, 
   null, 
   "whistler", 
   "If there was a single landmass at the time of the flood then it wouldnt have been a problem because God brought the animals to Noah. No one knows, no matter how much they say they do, just when Pangea broke up if there ever was such a thing as Pangea. Noah's God is my God and He is the God of the impossible. I dont expect u to understand or believe what I believe when u are so heavily steaped in evolution as u must be.\n\n \n Hey, if God can do the impossible why would there be need for a single landmass? Seven continents shouldn't present an obstacle for a being so powerful.\n \n Whistler", 
   {}, 
   57081, 
   null, 
   1089318120.0
  ], 
  [
   57087, 
   null, 
   "Ursus maritimus", 
   "...Why cant any bit of evolution, of humans evolving into another species, be detected or measured....\n\n We can. Due to a change in diet, the modern human jaw is much smaller than that of our ancestors. As a result, it is too small to hold the \"normal\" component of teeth -- wisdom teeth quite often grow wrong, sometimes come in sideways, sometimes, like mine, don't even completely erupt through the gums. In my case, I had many problems with gum infections as food would get caught in the piece of gum still covering my (now gone) wisdome teeth. Wisdom teeth cause more problems for modern humans, problems that ourweigh the benefits of having them. And, sure enough, there are people who are born without wisdom teeth.\n \n The appendix is another interesting structure. It is clearly homologous to the ceacum in other primates. The ceacum helps digest a mainly leafy diet high in cellulose. However, because the human diet is more varied, there is no reason for the appendix. In fact, contrary to what AnswersInGenesis would have us believe, the human appendix serves no function that is not done by other parts of the human body. In fact, it is quite a detriment -- appendicitis used to be a common cause of death before modern medicine. Now, not only is the appendix much, much smaller than the ceacum on other primates, but many people are born without an appendix.\n \n Just a couple of examples of evolution in action. As you said, we should be able to measure small changes, and these are, indeed, small changes.", 
   {}, 
   57074, 
   null, 
   1089318780.0
  ], 
  [
   57279, 
   null, 
   "apathy", 
   "The Bible says Adam and Eve were the first man and woman. They didnt come after some more primitive species like Neanderthals. The rest of the earth, like the plants, animals, seas, heavens, etc., were the only things present prior to Adam and Eve. All of those things God spoke into existence. Mankind was the only creation that God formed with his hands. Dont mix the Word of God with the lie that Satan plunked in the minds and hearts of those unwilling to accept what the Bible says.\n\n \n Have you heard of Nachmanides (Nahmanides)? Just google it.\n You'll reject him outright because he was Jewish, but I think the Jews have a overriding claim to Genesis, since they wrote it.\n \n http://www.aish.com/societyWork/sciencenature/Did_Adam_Have_Parents$.asp\n http://www.geraldschroeder.com/age.html\n http://www.familylife.com/community/forums/ubb/cgi-bin/ultimatebb.cgi?ubb=get_topic;f=8;t=001303\n \n \n So he was looking at the real Hebrew texts where they were talking about \"God breathing life into man\". Well, it reads that he breathed \"neshama\" into man, which means \"soul\" or could be interpreted to mean \"life.\"\n \n This was interpreted to mean that before Adam and Eve, there was a distinct possibilty that pre-humans were roaming the Earth. They were soul-less and less than human, according to Nachmanides. Maybe these were the Neandertals and Cro-Magnons. \n \n All I'm saying is that there are interpretations to Gensis that do not require Adam and Eve to be the first humanoids on earth.", 
   {}, 
   57068, 
   null, 
   1089404100.0
  ], 
  [
   58684, 
   null, 
   ".Uniform.", 
   "This isn't proof or anything, but I find this interesting... before the big flood rain used to rise from the ground, and soak the bottom layers of the Earth, so floods were harder to come by. During the flood though, rain fell from the sky and rose from the ground at the same time, (there is mention of the matter of rain falling from the sky miraculously in the bible) so the flood was tremendous. After the flood however, rain from the ground ceased to exist, and from that point on rain fell from the sky. One sample of proof, that I've heard of, was that before Noah's time period fossils showed a little difference in forming than they did after his period, and my theory is the \"ground rain\" may have had something to do with it. I'm not sure, but the topic interested me...", 
   {}, 
   50509, 
   null, 
   1090176180.0
  ], 
  [
   58699, 
   null, 
   "Kronus", 
   "One sample of proof, that I've heard of, was that before Noah's time period fossils showed a little difference in forming than they did after his period, and my theory is the \"ground rain\" may have had something to do with it. I'm not sure, but the topic interested me...\n\n \n I was under the impression that the YE theory was that all fossils were formed during the flood. If some happened before, and some after, than how do you date them? How do you tell which are pre-deluvian, and which are post?", 
   {}, 
   58684, 
   null, 
   1090189140.0
  ], 
  [
   58703, 
   null, 
   ".Uniform.", 
   "I was under the impression that the YE theory was that all fossils were formed during the flood. If some happened before, and some after, than how do you date them? How do you tell which are pre-deluvian, and which are post?\n\n \n I'm saying in general... like those fossils in the flood were what 4-5k years ago... I'm talking fossils WAY before that, like completely other periods of time. I'm still somewhat sketchy on that theory, but once I understand the details I think I will probably be much more convinced of it than I already am.", 
   {}, 
   58699, 
   null, 
   1090189800.0
  ], 
  [
   58707, 
   null, 
   "Kronus", 
   "I'm saying in general... like those fossils in the flood were what 4-5k years ago... I'm talking fossils WAY before that, like completely other periods of time. I'm still somewhat sketchy on that theory, but once I understand the details I think I will probably be much more convinced of it than I already am.\n\n \n I think you'll need to spell this one out for me, in detail. The classic theory of fossils say all of them are much older than 5000 years old. And every theory I've heard that says that Noah's flood was real puts the upper age of the universe at 10,000 years. You seem to have a whole new idea. Even if you haven't worked out the details, please share it. Of course, we're likely to try to poke holes in it, but that's what a debare forum is for, right? :)", 
   {}, 
   58703, 
   null, 
   1090190760.0
  ], 
  [
   58822, 
   null, 
   "GreatMoose", 
   "I haven't read through this entire thread yet, but you might find this site interesting:\n \n Out of place artifacts and ancient tech , particularly the pages on \"The Flood.\" Very interesting site. While some of it is most definately hogwash (as the site's author mentions), a lot of it is pretty hard to argue with. One of the weirdest parts is the section on ancient nuclear reactors. As a Christian and amature Biblical scholar myself, it is highly interesting reading.\n \n EDIT-Oh yeah, there's also a FANTASTIC article by Michael Crichton about how the \"scientific community\" is rapidly becoming corrupted by \"consensus science.\"", 
   {}, 
   58707, 
   null, 
   1090261980.0
  ], 
  [
   58826, 
   null, 
   "Kronus", 
   "\n Out of place artifacts and ancient tech , particularly the pages on \"The Flood.\" Very interesting site. While some of it is most definately hogwash (as the site's author mentions), a lot of it is pretty hard to argue with. \n\n \n I found it hard to argue with, because there was nothing to argue about. No documentation, no references, just a big list of supposed anomolies. Not impressive.", 
   {}, 
   58822, 
   null, 
   1090263480.0
  ], 
  [
   58833, 
   null, 
   "apathy", 
   "That website RULES!\n \n My favorites are the pics of space ships in egyptian hyroglyphs.\n \"..On November 17, 3398 B.C., two billion people, with their astonishing technology, vanished from the face of the earth. This lost super race beat us to the moon(?), to computers, and to nuclear war. A cosmic disaster occurred which wiped out a super civilization and generated 6,000 foot tidal waves the disaster known to early civilizations worldwide as the great flood (the deluge mentioned in the book of Genesis in the Bible, for which Noah constructed the Ark to save a remnant of mankind). :\n \n ...The descendants of this super race branched out from Ararat (Armenia) to create civilizations less advanced technologically, but still with some knowledge of their original civilization. The theory of evolution, which believes in the gradual progression of man, cannot stand up to the evidence governed by the laws of thermo-dynamics. The evidence of fully developed cities and an advanced technology of a superior man, whose society deteriorated over time is irrefutable. : \n \n You just can't get better than this.", 
   {}, 
   58826, 
   null, 
   1090265160.0
  ], 
  [
   58841, 
   null, 
   "GreatMoose", 
   "Like I said, some of it's a little wierd, but some of it really is hard to discount (the monoliths come to mind.) Anyway, like the website's (not the articles') author says, it doesn't really matter if the stuff on the site is true or not. It more for intellectual workouts. His point (and I agree) is that none of the stuff mentioned on the site has to be true in order for the Bible to be believed. It's all on faith. Anyway, I just thought you guys might enjoy some of the articles on the site (whether you believe them or not, they're interesting.)", 
   {}, 
   58833, 
   null, 
   1090269720.0
  ], 
  [
   58851, 
   null, 
   "OccamsRazor", 
   "Like I said, some of it's a little wierd, but some of it really is hard to discount (the monoliths come to mind.) Anyway, like the website's (not the articles') author says, it doesn't really matter if the stuff on the site is true or not. It more for intellectual workouts. His point (and I agree) is that none of the stuff mentioned on the site has to be true in order for the Bible to be believed. It's all on faith. Anyway, I just thought you guys might enjoy some of the articles on the site (whether you believe them or not, they're interesting.)\n\n \n \n I think the phrase \"little weird\" is firmly in understatement country :p", 
   {}, 
   58841, 
   null, 
   1090272840.0
  ], 
  [
   58900, 
   null, 
   "ungerdunn", 
   "One of the weirdest parts is the section on ancient nuclear reactors.\n\n The information about Oklo shows that they have little understanding of what went on there. While it is undoubtedly true that plutonium was produced, there is none there now. I'll say that again to make sure that you understand. No plutonium was found at Oklo.\n \n The site also makes this remark:\n \nThis particular group of reactors was, incredibly moderated using --water. The first modern nuclear reactors used graphite and cadmium rods to moderate their reactions.\n\n Bizarre! Most nuclear reactors in the United States are moderated using water. In fact, only in the former communist bloc countries was graphite used as the moderator.\n \nThere are at least six zones of depleted uranium (usually means mined)with plutonium as a by product! You've got to really be trying to manufacture plutonium--its a complicated process.\n\n Nice demonstration of ignorance. \"depleted uranium\" does not mean \"mined.\" It means that it has been used for nuclear fuel and the U235 has been depleted. And while the process that produces plutonium is complicated, it isn't unusual. The process is known as a fission reaction. In any fission reaction where U238 is present (that is all of them), one of the by-products is plutonium. It can't be avoided. Breeder (fast) reactors just produce more plutonium. They also surround the core with uranium carbide that doesn't take part in the reactor but in which some U238 is converted to plutonium.", 
   {}, 
   58851, 
   null, 
   1090291800.0
  ], 
  [
   59526, 
   null, 
   "umustbebrnagain", 
   "Your god is also the god of deceit. Why else would he erase all evidence of such a flood? Why erase the bones from the animals that must have died as the emigrated from the arks resting place? Answer those two and I'll have lots more\n\n \n \n Well to answer the first question...not all evidence has been erased. In fact there is quite a bit of evidence for the flood. How do you explain remains of crabs and other sea creatures found in the same area inland as dinousaurs and other land dwelling creatures. The Grand Canyon is also evidence for the flood. A canyon of the same type was formed when Mt. St. Helens erupted when the snow and ice melted at the top and rushed down the slope. Even evolutionists have admitted that it looks just like the Grand Canyon, only on a smaller scale, and that it appears to have been created over millions of years but in fact it only took a couple of hours. For you to say that there isnt any evidence is a very ignorant thing because there is just as much evidence or more supporting the flood as there are people and things that dont support it. \n \n To answer the second question...not all bones are fossilized. Bones do decompose. Also perhaps people just havent been looking in the right places. No one knows for sure where the arks true resting place is let alone the paths the animals took going away from the ark so there is no way anyone could start looking for bones even if they did exist. It is possible that they havent been just stumbled upon if they are still around to be stumbled upon. \n \n Even if i am wrong in what i have stated in my answers there isnt anything that can back up completely what you have implied in your questions.", 
   {
    "post_info": {
     "post_title": "not so"
    }
   }, 
   54630, 
   null, 
   1090616880.0
  ], 
  [
   59528, 
   null, 
   "umustbebrnagain", 
   "So you honestly believe that with the technology available at the time, Noah constructed a monstrous synthetic habitat large enough to hold two of every creature on earth? Complete with enough aquatic capacity to hold two of every ocean creature, including whales and sharks? With enough travel speed to cover the entire globe in time to pick up two of every animal, from the burrowing frogs of the african desert to the Polar bears of Antarctica?\n \n And that this vessel was also large enough to carry a supply of food adequate for so many hundreds of millions of animals? And that the waste disposal systems were adequate to handle such a volume of waste?\n \n I'm sorry, but anyone with even a shred of credibility must take the story of Noah and his ark as nothing more than an interpretation and adaption of an ages old story. To interpret it as the literal truth is beyond belief.\n\n \n \n If you were to read Genesis 6:7 you will see that nothing is mentioned about creatures of the sea being destroyed so you quip about whales and sharks and aquatic capacity is proven wrong right there.\n \n Also Genesis 6:20 says that the animals were to come to Noah so Noah didnt have to travel the whole earth collecting animals. What you said about that doesnt even make any sense because if he had to collect all of the animals as he floated around the globe there wouldnt be any animals because they would all have drowned in the floodwaters. \n \n To those who believe it is just a story, it is because, if you have read the actual account yourselves, youre interpreting it of your own knowledge. I am filled with the Holy Spirit and the Spirit interprets the Bible for me. It is supposed to be that way because after all the Bible was inspired by the Holy Spirit.\n \n Oh by the way you are correct in saying that the Ark was large enough to hold all that the Lord required it to hold. He knew all the was needed and that is why he gave the dimensions to Noah to build the Ark rather than letting Noah make them himself. Humans dont come close when it comes to matching \"brainpower\" and wisdom with Jehovah.", 
   {
    "post_info": {
     "post_title": "Perhaps you need to read the account or maybe the whole bible."
    }
   }, 
   54701, 
   null, 
   1090618200.0
  ], 
  [
   59529, 
   null, 
   "Kronus", 
   " How do you explain remains of crabs and other sea creatures found in the same area inland as dinousaurs and other land dwelling creatures. \n\n They aren't found in the same layers. If the fossils were caused during the flood you'ld see the land and sea based creatures mixed together. You don't. You have the fossils of land based creatures, then you get sea based, indicating local flooding, then land based, then sea based again. Of course many regions don't show any sea based at all, indicating that flooding never occurred there.\n \n \n\n The Grand Canyon is also evidence for the flood. A canyon of the same type was formed when Mt. St. Helens erupted when the snow and ice melted at the top and rushed down the slope. Even evolutionists have admitted that it looks just like the Grand Canyon, only on a smaller scale, .\n\n Are you talking about the erosion through the ash, or the break in the mountain after the eruption? If the first, the grand canyon is cut through rock, not ash. If the later, there's no volcano near the grand canyon.\n \n \n\n To answer the second question...not all bones are fossilized. Bones do decompose. Also perhaps people just havent been looking in the right places. No one knows for sure where the arks true resting place is let alone the paths the animals took going away from the ark so there is no way anyone could start looking for bones even if they did exist. It is possible that they havent been just stumbled upon if they are still around to be stumbled upon. \n \n\n The Bible says the ark landed on Mt. Arafat, in Turkey. And there aren't alot of different routes the kangaroos could take to get from there to Austrailia. If there was any evidence of a kangaroo migration from Turkey to Australia we know exactly where we would need to look. And in fact, the route goes through some of the more excavated areas of the world, so we'd almost certainly have found any remains by now.", 
   {}, 
   59526, 
   null, 
   1090618320.0
  ], 
  [
   59530, 
   null, 
   "umustbebrnagain", 
   "no no! through the power of god, the animals all came themselves, and lined up ready for the ride, haven't you seen the movie?!?\n\n \n \n Sorry I havent seen the movie. But that is only because there isnt one that illustrates exactly what happened. But I do know that the first part of what you said is exactly right. The power of God caused the animals to come to Noah; Genesis 6:20.", 
   {
    "post_info": {
     "post_title": "No I havent"
    }
   }, 
   54707, 
   null, 
   1090618380.0
  ], 
  [
   59531, 
   null, 
   "umustbebrnagain", 
   "Geology and Geomorphology have NOTHING to do with evolution.\n \n Suggesting that you read on theses topics is suggesting that you educate yourself so you can make an informed decision and speak intelligently on the subject, not an attempt to somehow brainwash you. \n \n You seem to be openly stating that your position here is simply that ignorance is bliss.\n \n Again, I'd strongly suggest a little reading.\n \n Waxy\n\n \n \n Im sorry I wasnt clear on what I meant. Any such textbook is written and based on evolutionist ideas like that the earth is billions of years old etc. Education is so one-sided nowadays that for you to tell someone who doesnt even believe in what youre telling him is just going back to you trying to convince him and him trying to convince you. I admit I have suggested that people go read some accounts in the Bible but its no use if the person is totally uninterested in what the reading says. What I was saying is that it is near impossible to find a textbook that is unbiased and the large majority of science textbooks are written from and evolutionist point of view and give no credit to creationism.", 
   {}, 
   57069, 
   null, 
   1090619040.0
  ], 
  [
   59532, 
   null, 
   "Kronus", 
   "Im sorry I wasnt clear on what I meant. Any such textbook is written and based on evolutionist ideas like that the earth is billions of years old etc. Education is so one-sided nowadays that for you to tell someone who doesnt even believe in what youre telling him is just going back to you trying to convince him and him trying to convince you. I admit I have suggested that people go read some accounts in the Bible but its no use if the person is totally uninterested in what the reading says. What I was saying is that it is near impossible to find a textbook that is unbiased and the large majority of science textbooks are written from and evolutionist point of view and give no credit to creationism.\n\n \n How about this then? Read the textbooks, and then show us where the bias is. Tell us where the reasoning is wrong. Science textbooks present their reasoning, if there's a hole then you ought to be able to spot it and tell us what it is. Until you do this, however, you really have no basis for your claim of bias. Until you've actually read the book and can show someone why it's wrong, you're dismisal of it demonstrates nothing except your close-mindedness.", 
   {}, 
   59531, 
   null, 
   1090620000.0
  ], 
  [
   59542, 
   null, 
   "OccamsRazor", 
   "Im sorry I wasnt clear on what I meant. Any such textbook is written and based on evolutionist ideas like that the earth is billions of years old etc. Education is so one-sided nowadays that for you to tell someone who doesnt even believe in what youre telling him is just going back to you trying to convince him and him trying to convince you. I admit I have suggested that people go read some accounts in the Bible but its no use if the person is totally uninterested in what the reading says. What I was saying is that it is near impossible to find a textbook that is unbiased and the large majority of science textbooks are written from and evolutionist point of view and give no credit to creationism.\n\n \n Well, the concept of a billions of year old earth is not one that evolution leads us too, that being derived from the study of radiometric dating- off course, evolutionary history is then fitted within a framework of this geochronological timeframe.\n \n As to bias in textbooks, scientific journals and other related literature, I don't think you can fairly call it \"bias\". You might say the viewpoint is inherent to the subject- and plus you have to stop and think why this \"bias\" is so pervasive- the concepts of evolution and an ancient earth are generally regarded a fact.\n \n Finally, to reverse your point would you expect to find a bible without reference to God, or one that acknowledges all the other religious/faith based viewpoints on subjects the bible deals with?", 
   {}, 
   59531, 
   null, 
   1090624380.0
  ], 
  [
   59559, 
   null, 
   "apathy", 
   "Sorry I havent seen the movie. But that is only because there isnt one that illustrates exactly what happened. But I do know that the first part of what you said is exactly right. The power of God caused the animals to come to Noah; Genesis 6:20.\n\n \n sorry if this is a little old, haven't been here in a few days\n if god could do THAT, and of course god can do anything right, why did he bother with Noah at all? \n besides, even if god did bring all the countless millions of species (or kinds if you prefer)to the ark how did they all fit in a wooden boat the size of the titanic? how did that boat survive 150+ days at sea with this cargo?\n \n even if you didn't see the movie, you should be able to explain to me some details of how this came about, please explain to me exactly what happened, as you put it\n i'd like for you to do for me what most creationists demand of evolutionary theory: please give me a detailed mechanism for building a 450 foot wooden vessel, filling it in a short time with every \"kind\" of living being on the planet, and still have it intact at the end of the voyage", 
   {}, 
   59530, 
   null, 
   1090633920.0
  ], 
  [
   59825, 
   null, 
   "GreatMoose", 
   "Two points:\n \n 1) \nHumans dont come close when it comes to matching \"brainpower\" and wisdom with Jehovah.\n \n \n Best quote I've heard in a long time! emoticon_xgood \n \n 2) \nif god could do THAT, and of course god can do anything right, why did he bother with Noah at all?\n \n \n Because Noah pleaded with God to spare the world. God's intent was to destroy everything and everyone PERMANTENTLY, but He was moved by Noah's persistence and faith. God took the position of \"Alright, we'll just start over with you, Noah.\" And so it was.", 
   {}, 
   59559, 
   null, 
   1090865220.0
  ], 
  [
   59832, 
   null, 
   "apathy", 
   "well, my question was really why he bothered with the ark\n why didn't he just wipe out all life on earth and leave 2 of every kind along with Noah and family?\n why bother with the drama of the ark and the flood, etc? god likes drama i guess", 
   {}, 
   59825, 
   null, 
   1090866120.0
  ], 
  [
   60011, 
   null, 
   "umustbebrnagain", 
   "OK then, did God work through the human endeavour of science to find vaccines and \"invent\" modern medicine?\n \n Does God therefore indirectly use science to help mankind?\n \n Did God create science so mankind understand and survive in the world?\n \n What's your take?\n \n Waxy\n\n \n \n If you'll read what I said, I said it is God who enables us to get where we are today. Yes, man has done many things with science but it was God who gave man the brains to do so.", 
   {
    "post_info": {
     "post_title": "just like i said"
    }
   }, 
   57079, 
   null, 
   1090964160.0
  ], 
  [
   60012, 
   null, 
   "umustbebrnagain", 
   "Hey, if God can do the impossible why would there be need for a single landmass? Seven continents shouldn't present an obstacle for a being so powerful.\n \n Whistler\n\n \n \n That's what Im saying. No one knows whether there really was a Pangea. Yes there is strong evidence for it but whether it existed or not wouldnt matter to the Lord because anything is possible with Him.", 
   {}, 
   57086, 
   null, 
   1090964640.0
  ], 
  [
   60014, 
   null, 
   "apathy", 
   "ok, anything is possible with an all powerful being\n \n i don't think anyone is questioning the idea that anything is possible through an all-powerful being \n \n BUT, they are questioning the accuracy of a tall tale\n they are questioning the historical accuracy of a book full of tales\n they are questioning people who believe these unbelievable tales\n \n you can cop-out with \"god can do anything\" but that doesn't answer the questions \"why a wooden boat\" \"how was it possible\" \"why a global flood\" \"how was it possible\" \n \n just saying \"it was possible because god can do anything\" doesn't get anybody anywhere", 
   {}, 
   60012, 
   null, 
   1090965780.0
  ], 
  [
   60015, 
   null, 
   "joebrummer", 
   "OK then, did God work through the human endeavour of science to find vaccines and \"invent\" modern medicine?\n\n \n \n Wouldn't god being messing with \"free will\" if he worked through man to do anything? Why would he bother helping man cure a disease if he is all powerful wouldn't he just make it go away? Satan is an angel God created that fell, if he is all powerful wouldn't he just wipe him out?", 
   {}, 
   60014, 
   null, 
   1090966140.0
  ], 
  [
   60016, 
   null, 
   "umustbebrnagain", 
   "They aren't found in the same layers. If the fossils were caused during the flood you'ld see the land and sea based creatures mixed together. You don't. You have the fossils of land based creatures, then you get sea based, indicating local flooding, then land based, then sea based again. Of course many regions don't show any sea based at all, indicating that flooding never occurred there.\n \n \n Are you talking about the erosion through the ash, or the break in the mountain after the eruption? If the first, the grand canyon is cut through rock, not ash. If the later, there's no volcano near the grand canyon.\n \n \n The Bible says the ark landed on Mt. Arafat, in Turkey. And there aren't alot of different routes the kangaroos could take to get from there to Austrailia. If there was any evidence of a kangaroo migration from Turkey to Australia we know exactly where we would need to look. And in fact, the route goes through some of the more excavated areas of the world, so we'd almost certainly have found any remains by now.\n\n \n \n You're right. The fossils I'm talking about weren't found in the same layers. Rather single fossils were found in multiple layers extending across the layers. You can't tell me fossils waited around for millions of years for multiple layers to form over them without any sort of decay. Just explain this all of the different sections of this article to me: http://www.layevangelism.com/advtxbk/sections/sect-10/sec10-5.htm. Just go to that website and read and explain it all to me. The article makes itself quite clear.\n \n Also the Bible does not say the ark landed on Mt. Arafat in Turkey. It actually says that it came to rest in the mountains of Ararat. But I understand that this is just another case where you did not read to account yourself.", 
   {}, 
   59529, 
   null, 
   1090966860.0
  ], 
  [
   60021, 
   null, 
   "umustbebrnagain", 
   "How about this then? Read the textbooks, and then show us where the bias is. Tell us where the reasoning is wrong. Science textbooks present their reasoning, if there's a hole then you ought to be able to spot it and tell us what it is. Until you do this, however, you really have no basis for your claim of bias. Until you've actually read the book and can show someone why it's wrong, you're dismisal of it demonstrates nothing except your close-mindedness.\n\n \n \n I've actually read quite a few and hardly any of them give any credit to creation as a reasonable explanation. This of course means that it is not me who is close-minded but those who write the books as so. I don't disagree that evolution has a lot of evidence to back it up but creation does as well and science should be taught from both views and let the students decide for themselves which one to believe. God can't even be mentioned in public schools because consequences ensue for anyone who does mention God. Christian teachers in the public schools aren't even allowed to have a Bible on their desks without getting in trouble. I know this because the father of a friend of mine got in trouble for those very things. And you say there is no bias. Please tap into reality a bit.", 
   {}, 
   59532, 
   null, 
   1090967460.0
  ], 
  [
   60023, 
   null, 
   "umustbebrnagain", 
   "Well, the concept of a billions of year old earth is not one that evolution leads us too, that being derived from the study of radiometric dating- off course, evolutionary history is then fitted within a framework of this geochronological timeframe.\n \n As to bias in textbooks, scientific journals and other related literature, I don't think you can fairly call it \"bias\". You might say the viewpoint is inherent to the subject- and plus you have to stop and think why this \"bias\" is so pervasive- the concepts of evolution and an ancient earth are generally regarded a fact.\n \n Finally, to reverse your point would you expect to find a bible without reference to God, or one that acknowledges all the other religious/faith based viewpoints on subjects the bible deals with?\n\n \n \n You overlook the small fact that creationism has been generally viewed as a fact for much longer than evolution ever has.\n \n The original Bible translated into English in 1611 by King James gives no acknowledgement of all other religious/faith based viewpoints. Only the one which lines up with everything that the Bible says. Also there are two valid areas of science...creation and evolution. Both line up with science so both should be taught and both should be found in textbooks.", 
   {}, 
   59542, 
   null, 
   1090967820.0
  ], 
  [
   60028, 
   null, 
   "sinjin", 
   "Creation is mythology or cosmology and could be taught with related material such as the mythology of the ancient Greeks, Romans, Egyptians, etc., etc.\n To suggest that it is \"science\" cracks me up. emoticon_xbye", 
   {}, 
   60023, 
   null, 
   1090969080.0
  ], 
  [
   60030, 
   null, 
   "Kronus", 
   "You're right. The fossils I'm talking about weren't found in the same layers. Rather single fossils were found in multiple layers extending across the layers. You can't tell me fossils waited around for millions of years for multiple layers to form over them without any sort of decay. Just explain this all of the different sections of this article to me: http://www.layevangelism.com/advtxbk/sections/sect-10/sec10-5.htm. Just go to that website and read and explain it all to me. The article makes itself quite clear.\n \n\n You were not talking about single fossils through multiple layers, you were talking about a mix of marine and land fossils. If you want to bring up a new argument than just do it, don't pretend that the argument that I refuted wasn't the one you said.\n \n Having refuted your first bit of evidence, I'll now refute this one. You get a fossil extending through multiple layers when you get a plant growing on sedimentary rock. The roots dig down through the layers, then the normal fossilization process happens, giving you a fossil that cuts through layers. You'll note that you only see this with plants, you don't get animal fossils doing this, which is further evidenece that it's a result of growth through rock, rather than a flood.\n \n \n\n Also the Bible does not say the ark landed on Mt. Arafat in Turkey. It actually says that it came to rest in the mountains of Ararat. But I understand that this is just another case where you did not read to account yourself.\n\n Yes, I had a typo. Sue me. That fact still remains that Mt. Ararat is in Turkey, and so we do know where the ark landed. The rest of my argument stands.\n \n BTW, do you concede that your Grand Canyon argument has no basis? Please don't just keep throwing out new arguments without acknowledging that you're done with the old ones. In your following post you say that there's lots of evidence for creationism. I'm trying to show you here that what you call evidence is, in fact, not. If you are as open minded as you claim that please have the courtesy to acknowledge when a bit of evidence has been shown to have no basis.", 
   {}, 
   60016, 
   null, 
   1090971480.0
  ], 
  [
   60031, 
   null, 
   "Kronus", 
   "I've actually read quite a few and hardly any of them give any credit to creation as a reasonable explanation. This of course means that it is not me who is close-minded but those who write the books as so. I don't disagree that evolution has a lot of evidence to back it up but creation does as well and science should be taught from both views and let the students decide for themselves which one to believe. God can't even be mentioned in public schools because consequences ensue for anyone who does mention God. Christian teachers in the public schools aren't even allowed to have a Bible on their desks without getting in trouble. I know this because the father of a friend of mine got in trouble for those very things. And you say there is no bias. Please tap into reality a bit.\n\n \n The reason that creationism isn't mentioned in science books, aside from seperation of church and state, is that there is, in fact, no good evidence for creationism. You've brought up several points here, and they've all been shot down. Creationism is simply not a valid scientific theory. If you think I'm wrong, than prove it. Come up with some evidence. But please, as I said before, have the courtesy to acknowledge when one of your arguments has been refuted.", 
   {}, 
   60021, 
   null, 
   1090971720.0
  ], 
  [
   60309, 
   null, 
   "OccamsRazor", 
   "You overlook the small fact that creationism has been generally viewed as a fact for much longer than evolution ever has.\n\n \n Not really as I was not addressing that issue. But as you have raised it lets think about it anyway. A young earth as interpreted from Genesis was/is a belief whose factual basis is derived solely from the writings in the Bible. It would have been accepted as a given truth in the same way as the way the old testament describes people who lived for several hundreds of years. Still, there is no other evidence to support these facts, except that derived from a single source, the Bible. In this regard it is a very different \"fact\" to the fact that evolution of life occurs, which can be supported by a multitude of observations.\n \n I also think it is odd to infer that just because something has been known/believed for a long time makes it more valid than a \"younger\" point of view. Dogma can be a risky thing to rely on as an absolute.\n \n \nThe original Bible translated into English in 1611 by King James gives no acknowledgement of all other religious/faith based viewpoints. Only the one which lines up with everything that the Bible says. Also there are two valid areas of science...creation and evolution. Both line up with science so both should be taught and both should be found in textbooks.\n\n \n The KJV Bible does not acknowledge other faith viewpoints (well, it does actually- Judasim for example) and in that regard it is quite similar to all Bibles. Not surprising considering the monotheisitc nature of Christianity. So I take your answer to my question:\n \n would you expect to find a bible without reference to God, or one that acknowledges all the other religious/faith based viewpoints on subjects the bible deals with?\n \n Is no.\n \n Now finally you say 2 valid lines of science- creation and evolution. Well, I see that as one valid line of science and one valid line of religious belief. Creationism in any form is not a science, it is an aspect of Christian belief. Vice-versa, evolution is not religion. We wouldn't put a chapter on radiometric dating in a RE textbook, and likewise it is a juxtaposition to place material on Creationism in a textbook covering life sciences and evolution.", 
   {}, 
   60023, 
   null, 
   1091155740.0
  ], 
  [
   141409, 
   null, 
   "Adept", 
   "*performs thread necromancy*\n \n \nIf you were to read Genesis 6:7 you will see that nothing is mentioned about creatures of the sea being destroyed so you quip about whales and sharks and aquatic capacity is proven wrong right there.\n\n \n Not so. The salinity levels would have signicantly changed, killing both saltwater and freshwater species. They obviously have managed to survive today, and so must have been saved on the Ark, if it is to be taken as literally true.\n \n \nAlso Genesis 6:20 says that the animals were to come to Noah so Noah didnt have to travel the whole earth collecting animals.\n\n \n Right. So which community minded individual volunteered the services of his helicopters to fly all the land bound animals from other continents? How did the thousands of different species of ants get from South America to the Middle East?\n \n \nWhat you said about that doesnt even make any sense because if he had to collect all of the animals as he floated around the globe there wouldnt be any animals because they would all have drowned in the floodwaters.\n\n \n In case you hand't noticed, the entire Bible story doesn't make sense.", 
   {}, 
   59528, 
   null, 
   1119827040.0
  ], 
  [
   141422, 
   null, 
   "Mucusaur", 
   "Necromancy? Just like jesus performed on lazarus. Therefore you must be a christian, Adept and therefore beleive in creation be default, regardaless of your feelings on the topic.", 
   {}, 
   141409, 
   null, 
   1119831420.0
  ], 
  [
   145110, 
   null, 
   "trebor", 
   "If there was a global flood, why weren't the 40K year old footprints found in mexico not washed away :p \n \n http://www.newscientist.com/article.ns?id=dn7627", 
   {}, 
   141422, 
   null, 
   1120671720.0
  ], 
  [
   145169, 
   null, 
   "Beowulf Lee", 
   "There is no way to date fossils, or dating methods are wrong, or they did it wrong, or they are heretics or agents of satan. Take your pick.", 
   {}, 
   145110, 
   null, 
   1120689000.0
  ], 
  [
   145194, 
   null, 
   "trebor", 
   "There is no way to date fossils, or dating methods are wrong, or they did it wrong, or they are heretics or agents of satan. Take your pick.\n\n \n \n Agents of satan. I like that one. After all , that is what the UCC is,for accepting gay marriage.", 
   {}, 
   145169, 
   null, 
   1120693560.0
  ], 
  [
   146879, 
   null, 
   "canadianman77", 
   "There is no way to date fossils, or dating methods are wrong, or they did it wrong, or they are heretics or agents of satan. Take your pick.\n\n What he says about dating fossils is true, carbon 14 dating is allways being adjusted, and is found to be less accurate every time there is an adjustment.", 
   {}, 
   145169, 
   null, 
   1121244120.0
  ], 
  [
   146881, 
   null, 
   "canadianman77", 
   "Agents of satan. I like that one. After all , that is what the UCC is,for accepting gay marriage.\n\n I wonder if being gay is a genetic, or environmental behaviour. Some say it is genetic, but im not so sure, because if it were genetic, then it would be exceedingly rare, as children cannot come from a same sex union. So someone who was gay from birth would be less likley to mate with someone from the opposite sex, and therefore the gene would be found less and less as time went on. I think being gay is an environmental condition. I read a long time ago that in the animal kingdom, homosexuallity was found in populations where one sex outnumbered the other.", 
   {}, 
   145194, 
   null, 
   1121244780.0
  ], 
  [
   146890, 
   null, 
   "Clive14", 
   "I wonder if being gay is a genetic, or environmental behaviour. Some say it is genetic, but im not so sure, because if it were genetic, then it would be exceedingly rare, as children cannot come from a same sex union.\nThat is a very simplistic view of genetics and natural selection. If the nieces and nephews of a gay person had a slightly raised fecundity for example, then there would be positive selection pressure for such a \"gay gene\".", 
   {}, 
   146881, 
   null, 
   1121249520.0
  ], 
  [
   146904, 
   null, 
   "canadianman77", 
   "That is a very simplistic view of genetics and natural selection. If the nieces and nephews of a gay person had a slightly raised fecundity for example, then there would be positive selection pressure for such a \"gay gene\".\n\n can you dumb that up a bit for me?", 
   {}, 
   146890, 
   null, 
   1121253360.0
  ], 
  [
   146916, 
   null, 
   "Clive14", 
   "can you dumb that up a bit for me?\nPut crudely, your siblings share some of your genes and so if their kids survive and have kids of their own (this is how fecundity is measured), then some of your genes get passed on. If your assistance (as a homosexual non-reproductive person) increases the number of reproductively successful offspring your siblings produce then this offsets the fact that you haven't produced any kids yourself.\n \n It's a contraversial idea, but it isn't one that can be completely ruled out.", 
   {}, 
   146904, 
   null, 
   1121259720.0
  ], 
  [
   146937, 
   null, 
   "trebor", 
   "What he says about dating fossils is true, carbon 14 dating is allways being adjusted, and is found to be less accurate every time there is an adjustment.\n\n \n \n Of course, for the vast majority of fossils, carbon 14 is not used. That is not valid for over 40K years. You are making invalid assumptions", 
   {}, 
   146879, 
   null, 
   1121268480.0
  ], 
  [
   147041, 
   null, 
   "canadianman77", 
   "Put crudely, your siblings share some of your genes and so if their kids survive and have kids of their own (this is how fecundity is measured), then some of your genes get passed on. If your assistance (as a homosexual non-reproductive person) increases the number of reproductively successful offspring your siblings produce then this offsets the fact that you haven't produced any kids yourself.\n \n It's a contraversial idea, but it isn't one that can be completely ruled out.\nWould the gene not become less prevelant the longer it is inactive? like of a cousin of someone gay is not gay and they have kids and so on for many generations without the occurence of homosexuallity.", 
   {}, 
   146916, 
   null, 
   1121292660.0
  ], 
  [
   147042, 
   null, 
   "canadianman77", 
   "Of course, for the vast majority of fossils, carbon 14 is not used. That is not valid for over 40K years. You are making invalid assumptions\n\n I am not making assumptions, I am stating what I read, and it makes sense to me.", 
   {}, 
   146937, 
   null, 
   1121292780.0
  ], 
  [
   147047, 
   null, 
   "Clive14", 
   "I am not making assumptions, I am stating what I read, and it makes sense to me.\nYou stated very clearly \"What he says about dating fossils is true, carbon 14 dating is allways being adjusted...\" thus clearly implying that you assume carbon dating is used to date fossils. It isn't (except in rare cases where fossilization has occured in the last 40-60,000 years. Also you make a false claim: carbon dating is constantly being adjusted to make it more accurate, not less.", 
   {}, 
   147042, 
   null, 
   1121294520.0
  ], 
  [
   147050, 
   null, 
   "Clive14", 
   "Would the gene not become less prevelant the longer it is inactive? like of a cousin of someone gay is not gay and they have kids and so on for many generations without the occurence of homosexuallity.\nWe are talking a hypothetical gene here. If homosexuality has a genetic component, it will be the result of a combination of many genes. Also it is not a simple case of genes fading away becaus they are inactive: it is invariably way more complex than that. The best example I can think of is with the European crested newt. Every one of them is a heterozygous individual (can't remember for which gene(s)). They mate and half the offspring are homozygous. Both homozygous forms are fatal in early development and only the heterozygous ones become adults. A whole 50% of the eggs produced die because of a fatal gene combination that the newt cannot escape from...", 
   {}, 
   147041, 
   null, 
   1121295060.0
  ], 
  [
   147095, 
   null, 
   "trebor", 
   "I am not making assumptions, I am stating what I read, and it makes sense to me.\n\n \n \n Since carbon 14 is not used to date fossils,I think you must have misunderstood what you read, or you have a bad source.", 
   {}, 
   147042, 
   null, 
   1121306880.0
  ], 
  [
   147144, 
   null, 
   "canadianman77", 
   "Since carbon 14 is not used to date fossils,I think you must have misunderstood what you read, or you have a bad source.\n\n I stand corrected. What then is carbon 14 dating used for?", 
   {}, 
   147095, 
   null, 
   1121338860.0
  ], 
  [
   147148, 
   null, 
   "Clive14", 
   "I stand corrected. What then is carbon 14 dating used for?\nFor dating archaeological sites and the artifacts found within those sites rather than for paleontological purposes. Other dating methods (using elements with much longer half lives, eg potassium) are used to date fossils.", 
   {}, 
   147144, 
   null, 
   1121342580.0
  ], 
  [
   147158, 
   null, 
   "trebor", 
   "I stand corrected. What then is carbon 14 dating used for?\n\n \n \n Carbon 14 dating is to date organic material of more recent origin. For example, if someone found an archelogical site where there was a fire, they would be able to take the ashes to date approximately when that fire was. They would be able to take some linen, and find out when it was made. If they found some bones (not fossilized) that were less that 30K years old (The labs won't garrentee accuracy past 30K right now), they would be able to date those bones. \n \n For more information on how dating of fossils (or geological formations) are done\n can be found at http://www.talkorigins.org/faqs/dating.html", 
   {}, 
   147144, 
   null, 
   1121349780.0
  ], 
  [
   152256, 
   null, 
   "PoohBear", 
   "this should be a poll. fact or fiction?", 
   {}, 
   147158, 
   null, 
   1122962340.0
  ], 
  [
   152287, 
   null, 
   "johnhanks", 
   "this should be a poll. fact or fiction?\n\n \n Neither. It's a myth.", 
   {}, 
   152256, 
   null, 
   1122993780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Noah's Flood, fact or fiction?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2421-noahs-flood-fact-fiction.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 2421, 
  "discussion_files": [
   [
    "25135.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2421-noahs-flood-fact-fiction-print.html"
   ], 
   [
    "25136.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2421-noahs-flood-fact-fiction-11-print.html"
   ], 
   [
    "25137.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2421-noahs-flood-fact-fiction-9-print.html"
   ], 
   [
    "25138.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2421-noahs-flood-fact-fiction-7-print.html"
   ], 
   [
    "25139.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2421-noahs-flood-fact-fiction-5-print.html"
   ], 
   [
    "25140.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2421-noahs-flood-fact-fiction-4-print.html"
   ], 
   [
    "25141.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2421-noahs-flood-fact-fiction-6-print.html"
   ], 
   [
    "25142.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2421-noahs-flood-fact-fiction-8-print.html"
   ], 
   [
    "25143.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2421-noahs-flood-fact-fiction-10-print.html"
   ], 
   [
    "25144.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2421-noahs-flood-fact-fiction-3-print.html"
   ], 
   [
    "25145.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2421-noahs-flood-fact-fiction-2-print.html"
   ]
  ], 
  "identifier": 2421
 }
]