[
 [
  [
   51323, 
   null, 
   "unkerpaulie", 
   "i read an article in the ny metro today about iraqis protesting against the US for the injustice and abuse of the iraqi prisoners (im sure most of you are aware of the pictures of prisoners posing with US officers).\n \n the pictures leaked out somehow, the perpertrators are now exposed, and the whole world now knows about the scandal, including the iraqi public\n \n im not defending the prison officers involved in any way, but in my opinion i blame the media for so readily exposing the pictures so that the whole world can see how evil the soldiers are and serve to help stir up the unrest among the iraqi people. the culprits could have just as effectively been dealt with by bringing the pictures to the authorities. but no, now its obvious the iraqis will retaliate, as they already have\n \n this kind of reporting is actually escalating the hazards that our soldiers are facing, the situation is volatile enough as it is. the truth is, im sure if this happened and the public was unaware, but the offenders were dealt with effectively without making it into a global spectacle, im sure nobody would think that the media wasnt reporting fairly.\n \n is it wise for the media to report everything, even if it would potentially ruin the country in the long run? what are your thoughts on this?", 
   {
    "post_info": {
     "post_title": "is the media going too far?"
    }
   }, 
   null, 
   null, 
   1085077560.0
  ], 
  [
   51334, 
   null, 
   "sinjin", 
   "Our enemies might be misguided in our opinion but human beings they remain. I am sickened by what I've seen and I'm sure we haven't seen the worst. This is not the fault of the media. If our actions can't be scrutinized we are no better than those we aim to displace.", 
   {}, 
   51323, 
   null, 
   1085080740.0
  ], 
  [
   51336, 
   null, 
   "Big Orn", 
   "Our enemies might be misguided in our opinion but human beings they remain. I am sickened by what I've seen and I'm sure we haven't seen the worst. This is not the fault of the media. If our actions can't be scrutinized we are no better than those we aim to displace.\n\n Well said, sinjin. I agree.\n Expose the good and the bad and let war show itself.", 
   {}, 
   51334, 
   null, 
   1085081880.0
  ], 
  [
   51339, 
   null, 
   "daewoo", 
   "AS it seems these pictures were being circulated on the ground in IRaq, it is logical to assume that they would come out sometime. I think it is far better for the AMerican media to break them, with the proper sidebar stories about how outraged people are, etc... as opposed to allowing Al-Arabia to break them and giving the impression that America was trying to cover it up or that this was acceptable behavior. Once you know that htere are pictures out there, it becomes a matter of damage control. YOu can be proactive, or you can be reactive. Reactive is always better.\n \n In business, if you discover you have overbilled somebody and you ontact them immediatly, you save face and they walk away wqith more respect for you than if THEY find the mistake themselves. In once case you look fair and honest, in the other, there is always a doubt as to whether you were trying to cheat them all along. \n \n I think the biggest maistake our government is getting ready to make is to hide some of the pictures or refuse to release the (apparently for our own good). This is going to lead many Americans, and many Iraqis/foreigners to believe that the ones they held back were so horiffic that they want to hide them.", 
   {}, 
   51334, 
   null, 
   1085082120.0
  ], 
  [
   51493, 
   null, 
   "King Triton", 
   "For once,(and I cant believe I am defending the media)I dont blame the media for what has happened,or the fall out from it.I do question why cameras were even allowed in the prison in the first place,and I also question everyone who was involved.If I had been put in that situation,for one I would not have stripped anyone nor would I be a part of such stupid behavior.And I sure would not be a part of any photo session!The amazing thing about it is,just exactly what do we have a chain of command there for?I thought it was to make sure things were done properly.", 
   {}, 
   51339, 
   null, 
   1085120760.0
  ], 
  [
   51495, 
   null, 
   "daewoo", 
   "I think if they actually investigate this, as opposed to just offering the lowly enlisted guys as sacrificial lambs, that it will lead higher up the chain of comand than most want to admit. This is not the kind of thing that goes on \"under the nose\" of superior officers. When it was just a dozen, or a couple dozen pictures, maybe, but apparently there are hundreds of them, maybe thousands. \n \n I believe that a couple of the accused have already claimed they were acting on orders from military intelligence, and that the plan was to show these pictures to other Iraqis coming into the complex in order to scare them into talking. That is the kind of plan implemented by a command structure, not thought up by some grunts on the ground.", 
   {}, 
   51493, 
   null, 
   1085122620.0
  ], 
  [
   51539, 
   null, 
   "georged", 
   "Considering that the Red Cross has been filing complaints of abuse and torture since 08/03 and the actual military investigation at a local (prison) level began 11/03 and the formal military investigation was launched 12/03 and announced to the public 1/04, it looked to me like our military kept a pretty good lid on it for a long time. It's my understanding that the military in Iraq authorizes imbedded US reporters on a situational basis and has the authority (and uses it) to ban all reporters from areas deemed 'sensitive' from an intelligence viewpoint, which pretty well covers a majority of Iraq. The fact that our troops have shot, either wounding or killing, several reporters on a mistake (?) basis in combat areas would also deter reporters from investigative reporting since there's been no lack of ongoing hostilities to cover. \n \n We supposedly have a free press with a self-described mission of reporting the activities of our government and military. That press is, by self-serving federal level legislation formulated under national security rationalizations used for everything from military secrecy to legislators meeting with special interests to formulate pork bills, excluded from just about anything the government deems a publicity risk. Formal press conferences express just what the government wants the public to know. Media questions are carefully formulated and polished by the government press officer to point where rhetorical answers are the norm with no deviations allowed from the government question text. If you've ever followed a government press conference, you've heard the 'I'm sorry Mr./Ms. Blank, that subject is not on the agenda'. \n \n Overreaction? Any military organization operates on a basis of total discipline. Enlisted ranks do not set policy or make judgment calls, they follow orders, as do jr officers and all the way up the line. The military sustains the role of discipline by a structure that puts supervisory levels in place at about every five individuals. Just by the nature of those supervisory levels, CYA becomes a way of life, and CYA is accomplished by following orders. Somebody at the field officer level issued the orders to use interrogation techniques being described as abusive. That level would not have issued any orders without being so ordered by Pentagon (management) officers, who would never dream of taking a chance on destroying their careers by deviating from the standard military procedures their oaths of loyalty are tied to without direction from their civilian bosses, the department of defense. In this case, where there's smoke, there's fire. \n \n Any country with a military force knows this, and in their effort to effect damage control from the adverse press, our administration has once again managed to look like liars and fools to the rest of the world.", 
   {
    "unicode_changes_made": true
   }, 
   51495, 
   null, 
   1085152860.0
  ], 
  [
   52222, 
   null, 
   "emoreno2292", 
   "For one, I think that it is good that we see what's going on in our army, because that is what our media does; it lets us know. I do think, however that things are going a bit too far. Yes, it's humiliating, yes it's a disgrace, yes it's a large loogie spat in the face of the Iraqi public, but come on! There doesn't have to be evening specials on the prison scandal on every day of the week on every single news channel! My brother is in Baghdad right now with the military police, and what with the media blowing this up here, morale is at an all time low. Quite honestly, I want my brother to come back in one piece, not blown to bits by some raging extremist who is upset about naked iraqis caught on camera. I think that we should be hearing more about poor Nick Berg than about this prison scandal. I wonder; are they getting evening specials on the atrocity of Berg's beheading?", 
   {}, 
   51539, 
   null, 
   1085609640.0
  ], 
  [
   52229, 
   null, 
   "jim's trucking", 
   "Our newsmakers push whatever they can sell. Whatever is the most astounding, provocative, jaw-dropping thing they can dig up is what's put on the front pages day by day.\n \n The liberal press is having a field day with the prisoner \"abuse\" thing. They'll publish anything that makes BushCo look bad.", 
   {}, 
   52222, 
   null, 
   1085611500.0
  ], 
  [
   52230, 
   null, 
   "sinjin", 
   "Our newsmakers push whatever they can sell. Whatever is the most astounding, provocative, jaw-dropping thing they can dig up is what's put on the front pages day by day.\n \n The liberal press is having a field day with the prisoner \"abuse\" thing. They'll publish anything that makes BushCo look bad.\n\n \n Didn't they make Clinton look bad as well? Check who owns this \"liberal\" media.", 
   {}, 
   52229, 
   null, 
   1085611740.0
  ], 
  [
   52250, 
   null, 
   "georged", 
   "For one, I think that it is good that we see what's going on in our army, because that is what our media does; it lets us know. I do think, however that things are going a bit too far. Yes, it's humiliating, yes it's a disgrace, yes it's a large loogie spat in the face of the Iraqi public, but come on! There don't have to be evening specials on the prison scandal on every day of the week on every single news channel! My brother is in Baghdad right now with the military police, and what with the media blowing this up here, morale is at an all time low. Quite honestly, I want my brother to come back in one piece, not blown to bits by some raging extremist who is upset about naked iraqis caught on camera. I think that we should be hearing more about poor Nick Berg than about this prison scandal. I wonder; are they getting evening specials on the atrocity of Berg's beheading?\n\n \n Out of curiosity, what would make the death of a mercenary in Iraq purely for the bucks such a newsworthy event when compared to our own army, now we're hearing on orders from a general on down, abusing and torturing the very people we're 'liberating'?", 
   {}, 
   52222, 
   null, 
   1085617560.0
  ], 
  [
   52251, 
   null, 
   "georged", 
   "Didn't they make Clinton look bad as well? Check who owns this \"liberal\" media.\n\n \n For supporters of this administration, good reporting when they champion unilateral aggression or a failing economy, liberal when reporting facts that critique administration policies. Sorry, in spite of the 200 year+ traditional chain of command, no cabinet members are at fault in the abuse/torture issue. Who does the military report to in the Iraq operation?", 
   {}, 
   52230, 
   null, 
   1085618040.0
  ], 
  [
   52344, 
   null, 
   "unkerpaulie", 
   "For one, I think that it is good that we see what's going on in our army, because that is what our media does; it lets us know. I do think, however that things are going a bit too far. Yes, it's humiliating, yes it's a disgrace, yes it's a large loogie spat in the face of the Iraqi public, but come on! There don't have to be evening specials on the prison scandal on every day of the week on every single news channel! My brother is in Baghdad right now with the military police, and what with the media blowing this up here, morale is at an all time low. Quite honestly, I want my brother to come back in one piece, not blown to bits by some raging extremist who is upset about naked iraqis caught on camera. I think that we should be hearing more about poor Nick Berg than about this prison scandal. I wonder; are they getting evening specials on the atrocity of Berg's beheading?\n\n this is what im talking about. the thrill of sensationalism pervades common sense to the point that the media is being a catalyst for escalating the danger in iraq. in my opinion the whole world would have been much better off if this matter was dealt with in private. the oficers would have been punished and discharged, and the prisoners' situation would have been amended. instead, the actions of a few loonies makes the image of the entire US army look like sadistic pigs, and the iraqis are retaliating, which is understandable. i think this is a gross level of irresponsibility by the media", 
   {}, 
   52222, 
   null, 
   1085685780.0
  ], 
  [
   52354, 
   null, 
   "jim's trucking", 
   "this is what im talking about. the thrill of sensationalism pervades common sense to the point that the media is being a catalyst for escalating the danger in iraq. in my opinion the whole world would have been much better off if this matter was dealt with in private. the oficers would have been punished and discharged, and the prisoners' situation would have been amended. instead, the actions of a few loonies makes the image of the entire US army look like sadistic pigs, and the iraqis are retaliating, which is understandable. i think this is a gross level of irresponsibility by the media\n\n \n The media has long been irresponsible. I remember during the riotous years of this century when the stupid bastards showed people how to make Molotov Cocktails after a few went off in one city. The very next night, they went off in several other cities. Don't try to tell me there was no connection.", 
   {}, 
   52344, 
   null, 
   1085687400.0
  ], 
  [
   52355, 
   null, 
   "georged", 
   "this is what im talking about. the thrill of sensationalism pervades common sense to the point that the media is being a catalyst for escalating the danger in iraq. in my opinion the whole world would have been much better off if this matter was dealt with in private. the oficers would have been punished and discharged, and the prisoners' situation would have been amended. instead, the actions of a few loonies makes the image of the entire US army look like sadistic pigs, and the iraqis are retaliating, which is understandable. i think this is a gross level of irresponsibility by the media\n\n \n From what's being reported, there are a lot more than a 'few' loonies, and they do look like sadistic pigs. I don't see sensationalism in the reporting. When we've assumed the position of liberator, spreader of democracy and all that other warm, fuzzy rhetoric, we're supposedly the good guys. And our army did attempt to deal with it in a private manner, until they discovered it was far too widespread to contain and only then inititated a formal inquiry. As a democracy, we're entitled to know when something is wrong within our military services, the reason we supposedly have civilian command and oversight. Private is supposedly for dictatorships.", 
   {}, 
   52344, 
   null, 
   1085687460.0
  ], 
  [
   52356, 
   null, 
   "georged", 
   "The media has long been irresponsible. I remember during the riotous years of this century when the stupid bastards showed people how to make Molotov Cocktails after a few went off in one city. The very next night, they went off in several other cities. Don't try to tell me there was no connection.\n\n \n That sounds like blaming the media for a lack of social responsibility of the citizenry. Black the press out if they don't report 'good' news? Something about a constitional amendment.....", 
   {}, 
   52354, 
   null, 
   1085688060.0
  ], 
  [
   52358, 
   null, 
   "witzelcheck", 
   "Our newsmakers push whatever they can sell. Whatever is the most astounding, provocative, jaw-dropping thing they can dig up is what's put on the front pages day by day.\n \n The liberal press is having a field day with the prisoner \"abuse\" thing. They'll publish anything that makes BushCo look bad.\n\n \n Yeah, that's pretty much it. I don't see the media showing the good stuff that we have done. I mean really, who cares? hehe. right? The media likes attention, and nothing gets attention like something completely defying your morals and your take on the world.\n \n However, we live where the media is supposedly free, so I guess we just have to deal with it. Becuase in the US, restrictions are EVIL. I mean, c'mon. If we restricted the press people would start coming out of the woodwork spewing something about the rise of communism or some other 'evil' government.\n Sometimes the lack of common sense astounds me.\n \n Granted, this would have been better had this been delt with in some other way, say... privately? The US probably saw this coming with everything else that we see and hear about, but I did kinda put us in a pickle when The Iraqi media got a hold of it too.\n \n But yes, I think the Media should take into account the entire US's wellbeing. They live here too. I'd hate to see all of our reporters over there lynched for this because of some stupid mistake like this.", 
   {}, 
   52229, 
   null, 
   1085688480.0
  ], 
  [
   52359, 
   null, 
   "jim's trucking", 
   "That sounds like blaming the media for a lack of social responsibility of the citizenry. Black the press out if they don't report 'good' news? Something about a constitional amendment.....\n\n \n There's quite a difference between reporting that Molotov Cocktails were used and showing people how to make them.\n \n The news media should realize that the whole bell-shaped curve from deviates to saints will be exposed to their newscast...don't show anybody how to make weapons.", 
   {}, 
   52356, 
   null, 
   1085688540.0
  ], 
  [
   52363, 
   null, 
   "unkerpaulie", 
   "From what's being reported, there are a lot more than a 'few' loonies, and they do look like sadistic pigs. I don't see sensationalism in the reporting. When we've assumed the position of liberator, spreader of democracy and all that other warm, fuzzy rhetoric, we're supposedly the good guys. And our army did attempt to deal with it in a private manner, until they discovered it was far too widespread to contain and only then inititated a formal inquiry. As a democracy, we're entitled to know when something is wrong within our military services, the reason we supposedly have civilian command and oversight. Private is supposedly for dictatorships.\n\n obviouisly, georged. this is exactly what the media said, and therefore its exactly what you believe. you have just demonstrated the destructiveness of the media firsthand! the fact is that the whole army is not this way, and this is a rare and isolated incident. furthermore, the entire american population is obviously not like this. but how do you explain that back to the iraqis?\n \n georged, you know what a recipe for world chaos is? share all the world's resources equally with everybody. if you sit and think about it logically, you'll see why its not wise to make a spectacle out of everything. just as you think its wrong for your private life to be on world display, the same way the media needs to know whats wise to expose and what is not. and this not a conservatist vs liberals bash, i hate that, but there should be limits and wisdom when deciding with to parade over the media.\n \n the media can cause undue destruction by inciting panic in the population, as well as cause harm by withholding information. there must be some kind of wisdom in how and what the media portrays, thats all im saying\n \n this particular event has made the job of the american soldiers 10 times more hazardous, and it has done nothing to edify the american people. as a result, the iraqis are simply more violent, and the americans look like fools\n \n thanks media", 
   {}, 
   52355, 
   null, 
   1085689980.0
  ], 
  [
   52413, 
   null, 
   "emoreno2292", 
   "Out of curiosity, what would make the death of a mercenary in Iraq purely for the bucks such a newsworthy event when compared to our own army, now we're hearing on orders from a general on down, abusing and torturing the very people we're 'liberating'?\n\n You make Nick Berg sound like some scum bag from the slums of Philly looking to earn an extra dollar, which is exactly the opposite of what he is. To call him a mercenary is an insult to his memory. Nick was a respectable young man who was killed mercilessly by the dogs that those terrorists are. The reason that this is more important to me is because I know that that could be my brother, looking at me from that camera, and that could be my brother who they throw on the floor, and that could be my own brother whose head they saw off. I don't know if any of you have relatives serving in Iraq right now, but I worry about my brother, and I only want him to come home safe. So Georged, I take high offense at you making Nick Berg out to be just some lowlife looking for easy cash.", 
   {}, 
   52250, 
   null, 
   1085715660.0
  ], 
  [
   52414, 
   null, 
   "emoreno2292", 
   "Also, how much have we heard from the Middle East about any sort of outrage about his killing? None. I want to know; where are the clerics who are opposed to these killings, like those of the soldiers in Fallujah? Where are the Muslim leaders opposed to the terrorists? Where are the (for lack of a better word) sane leaders? Why haven't they spoken up?", 
   {}, 
   52413, 
   null, 
   1085715900.0
  ], 
  [
   52458, 
   null, 
   "georged", 
   "obviouisly, georged. this is exactly what the media said, and therefore its exactly what you believe. you have just demonstrated the destructiveness of the media firsthand! the fact is that the whole army is not this way, and this is a rare and isolated incident. furthermore, the entire american population is obviously not like this. but how do you explain that back to the iraqis?\n \n georged, you know what a recipe for world chaos is? share all the world's resources equally with everybody. if you sit and think about it logically, you'll see why its not wise to make a spectacle out of everything. just as you think its wrong for your private life to be on world display, the same way the media needs to know whats wise to expose and what is not. and this not a conservatist vs liberals bash, i hate that, but there should be limits and wisdom when deciding with to parade over the media.\n \n the media can cause undue destruction by inciting panic in the population, as well as cause harm by withholding information. there must be some kind of wisdom in how and what the media portrays, thats all im saying\n \n this particular event has made the job of the american soldiers 10 times more hazardous, and it has done nothing to edify the american people. as a result, the iraqis are simply more violent, and the americans look like fools\n \n thanks media\n\n \n No, I believe what various media reported, including International Red Cross reports, from around the world. If you believe they're in a conspiracy to discredit the US, that's called freedom of the press. Maybe it isn't indicative of our entire military, but we're in a fishbowl in Iraq, posing as liberators freeing people from a tyrannical dictator, and one would think our chain of command had a little more common sense than to take pictures of obvious deviation from military procedures. That's simply poor management in a critical situation. Our military represents us in Iraq, our elected representatives put that military there, and that's the image we present to the Iraqi people, pure and simple. \n \n Unless proven libelous in a court of law or release of military secrets that endanger our country's well being, there should never be restrictions on any form of media. If our society is incapable of self-management, let it be known so corrective measures can be taken where the problem(s) exist, don't shoot the messenger. Pushing distasteful or destructive practices under the rug solves nothing. \n \n We field a volunteer military. Their exposure to risk is a given. Should a portion of that military perform acts, illegal under military procedures, that incite wrath in the very population we're liberating, blame rests in those acts, not the reactions. As our military represents us, we do look like fools when they perform like fools. \n \n Why blame the media for performing their jobs?", 
   {
    "unicode_changes_made": true
   }, 
   52363, 
   null, 
   1085769360.0
  ], 
  [
   52468, 
   null, 
   "georged", 
   "You make Nick Berg sound like some scum bag from the slums of Philly looking to earn an extra dollar, which is exactly the opposite of what he is. To call him a mercenary is an insult to his memory. Nick was a respectable young man who was killed mercilessly by the dogs that those terrorists are. The reason that this is more important to me is because I know that that could be my brother, looking at me from that camera, and that could be my brother who they throw on the floor, and that could be my own brother whose head they saw off. I don't know if any of you have relatives serving in Iraq right now, but I worry about my brother, and I only want him to come home safe. So Georged, I take high offense at you making Nick Berg out to be just some lowlife looking for easy cash.\n\n \n Regardless of anyone's opinion of Nick Berg's character, he was an American in a war zone where the US Military is viewed as aggressors by a majority of the populace and operating under combat conditions with Iraqi Nationalists. He was aware of the dangers, had refused withdrawal, and was there purely for the purpose of earning money. He put himself at risk in one of the most dangerous areas in the world for an American for money, so I await your warm, fuzzy definition of his activity.\n \n If he had been a relative or friend, I would have felt compassion for his death. He wasn't, he knew the risks involved and felt they were worth the exposure, which makes him just another casualty of that war. Which is the way most of the world, US and others, not emotionally attached to him look at it. Some Americans were shocked at the method of his death, but few Americans bother to understand customs outside their own confined existence other than what they view on TV; where electrocutions, gas chambers, hangings and injections have been considered normal methods of execution.", 
   {}, 
   52413, 
   null, 
   1085774160.0
  ], 
  [
   52484, 
   null, 
   "syklopps61", 
   "I heard on O'Reilly's show that the New York Times has had the Abu Ghraib story on the front pages for 28 straight days (a fact, not opinion), with NO new information about the \"abuses\". This to me is proof positive that the press has a liberal agenda and will go to any lengths to see that Bush is not re-elected. I have to ask all those who hate Bush (yes, you Liberals), if you have any rational thought, any decency, how can you support or defend this kind of coverage? I mean, 28 straight days, and nothing NEW? I believe this is unprecedented in the media, not even sure Watergate got this much coverage.", 
   {}, 
   52468, 
   null, 
   1085801160.0
  ], 
  [
   52505, 
   null, 
   "faeden", 
   "In my opinion, the media knows that sensationalisim sells and that controversy is sensational. The media can attract more viewers by taking on the administration (liberal or conservative) as often as possible. Stories that complement or agree with the administration get little attention because Americans are bored with \"things are good\" or \"we agree\" stories. (Look at the economy, for example.)\n \n That being said, I also believe there is a liberal bias in many media outlets. If the major networks were truly impartial, there would be no need (or audience) for a channel like FOX News.\n \n Finally, I would like to see the media police itself better and show some restraint and common sense. There is nothing wrong with the US media being pro-US.", 
   {
    "post_info": {
     "post_title": "media motives"
    }
   }, 
   52484, 
   null, 
   1085833560.0
  ], 
  [
   52518, 
   null, 
   "georged", 
   "Does anyone who continually bashes media content understand that all media forms, print, visual, sound, are commercial entities formed to produce a return on investment? And that their revenue is derived primarily from sales of advertising? \n \n If responsible for any media company, the primary responsibility is to produce enough advertising revenue to return a profit for investors (owners). That means attracting readers, viewers or listeners. They formulate and position content designed to attract the highest numbers of readers, viewers and listeners possible because that's how advertising is priced and sold, by audience numbers and demographics relating to advertised products.\n \n To suggest media 'police itself' or desire other methods of regulating media to become politically correct to satisfy the social desires of an individual or group of people is naive and shows a lack of understanding about the commercial function of any business entity. \n \n Thanks to modern technology, audiences of all forms of media are monitored on an ongoing, daily basis. With TV, radio and internet news, a show by show, subject by subject basis. What you're reading, seeing and hearing is what the general public wants to read, see and hear. \n \n Personally, I'm sick of hearing about Princess Diana and she's been dead how many years? The Watergate quagmire and after-effects dominated the news for months. The reason the Iraqi prison situation is still the news is because we looked like fools, our administration was forced by the media into a public response and no high ranking civilian or military individual(s) has been sacrificed to grant acceptance of responsibility. Most reasonable people, including a majority of those outside the US, consider that lack of reaction blatant arrogance.", 
   {}, 
   52505, 
   null, 
   1085843820.0
  ], 
  [
   52602, 
   null, 
   "Ghost", 
   "Our enemies might be misguided in our opinion but human beings they remain. I am sickened by what I've seen and I'm sure we haven't seen the worst. This is not the fault of the media. If our actions can't be scrutinized we are no better than those we aim to displace.\n\n \n I admire you for your point of view. I have to disagree, though, in part at least. Most of the people we're fighting are misguided human beings by our standards. But there are enemies over there which are not. I heard part of the Berg tape...we're not fighting human beings. We're fighting animals. When they can behead an innocent human being with a knife and shout \"God is great,\" they're scum. They forfeit their humanity, they become a beast. They're not 'misguided' any longer. They're evil, and they need to be killed.\n \n Some of the Abu-Ghraib pictures sicken me, just a few I've seen (namely the body packed in ice with a smiling soldier near it). But some of the photos that people are screaming about aren't that bad. This is a prison, keep in mind. And the people in that prison are likely people who have tried to kill American soldiers. If you've been mutilating people and what you get in return is being chained up with panties on your head, you're getting off easy. Also keep in mind that many of these pictures were taken as a scheme to demoralize other inmates...they were staged. And we're doing most of this stuff to them to get information, not for fun, like Saddam's guys did (and like Teddy Kennedy suggested).", 
   {}, 
   51334, 
   null, 
   1085966520.0
  ], 
  [
   52616, 
   null, 
   "daewoo", 
   "I admire you for your point of view. I have to disagree, though, in part at least. Most of the people we're fighting are misguided human beings by our standards. But there are enemies over there which are not. I heard part of the Berg tape...we're not fighting human beings. We're fighting animals. When they can behead an innocent human being with a knife and shout \"God is great,\" they're scum. They forfeit their humanity, they become a beast. They're not 'misguided' any longer. They're evil, and they need to be killed.\n\n \n Are the American soldiers who shot up that wedding animals? I mean, they killed a LOT more than just a single guy. BEheading is not that bad a way to die. It is at least quick and relatively painless. Gut shot would be much worse. Cluster bomblet would be much more gruesome. How about beign hit by a missile in you home? That is pretty bad as well. What about if you are the really unlucky one int he house hit by the missile and are the only one who survives after your entire family is killed?\n \n Nick Berg was an American in a combat zone running around with a bunch of communications equipment. WE now know (or at least think) that he was just a communications contractor trying to corner what could concievably be an emerging market. THey thought he was a spy, and spies during war time get executed. \n \n This is what soldiers in combat do, they kill people. While beheading somebody is a gruesome spectacle, it is no worse than being blown apart by a mine, or taking a round to the head. Nobody needs to make excuses for these guys or justify their bahavior, what they did is no better and no worse than what the AMericans are doing there. They are fighting a war. When you fight a war, horrible, nasty, gruesome things become the norm. \n \n \nSome of the Abu-Ghraib pictures sicken me, just a few I've seen (namely the body packed in ice with a smiling soldier near it). But some of the photos that people are screaming about aren't that bad. This is a prison, keep in mind. And the people in that prison are likely people who have tried to kill American soldiers. If you've been mutilating people and what you get in return is being chained up with panties on your head, you're getting off easy. Also keep in mind that many of these pictures were taken as a scheme to demoralize other inmates...they were staged. And we're doing most of this stuff to them to get information, not for fun, like Saddam's guys did (and like Teddy Kennedy suggested).\n\n \n What makes them bad is that America is supposed to be on the side of \"right\" in Iraq. We are supposed to be the liberators, fighting on the side of god and justice and aunt marys apple pie. You can't continue to call yourselves the good guys if you are torturing people. That is just not the way it works.\n \n Most of the people being held by US troops are not accused of any crime,. They have not tried to kill American soldiers, and they have not mutilated anybody. SOP in Iraq is to round up anybody you can get your hands on following an attack. Male bystanders on the street of military age are rounded up, taken to a detention faciltiy and questioned. Some of them disapear for weeks, or even months. Speaking harshly to a member of the occupation is enough to get you tossed into a prison and held until they either have interrogated you enough that they are convinced you know nothing and are planning nothing, or until they need to room for a new person who has told a US soldier to **** off. \n \n This is a major issue with the IRaqi people who point out that even saddam didn't act this way. I realise that part of dehumanising the enemy during wartime is convincing your soldiers and the public that they are sub human. Hitler was a master at this, but the American media and the Bush administration is giving even hitler a run for his money in this area. Ghost, you are smarter than this. Don't believe everything you hear or everything the media tells you, and try to look at things objectively before forming opinions.", 
   {}, 
   52602, 
   null, 
   1085988540.0
  ], 
  [
   52622, 
   null, 
   "georged", 
   "I admire you for your point of view. I have to disagree, though, in part at least. Most of the people we're fighting are misguided human beings by our standards. But there are enemies over there which are not. I heard part of the Berg tape...we're not fighting human beings. We're fighting animals. When they can behead an innocent human being with a knife and shout \"God is great,\" they're scum. They forfeit their humanity, they become a beast. They're not 'misguided' any longer. They're evil, and they need to be killed.\n\n \n And the Christian Crusades (original) were humane? Almost 300 years of broadsword death (not much different and often far more gruesome than pure decapitation) in the name of God? Or the Dark Ages when strong belief in Christianity, and the hope that life in heaven would be better than life on earth was what sustained most Europeans after the fall of Rome? \n \n Defining 'Our standards', considering we're 5% of the world population, as the criterion of being above the level of scum, humanitarian or beast, seems a bit pompous. Especially when taking into consideration the number of civilians killed in Afghanistan and Iraq by our missiles, artillery, gunfire and other 'accidental' methodology. Somebody pushed those buttons or pulled those triggers, somebody gave the orders to do so, where would the blame for those deaths be placed? What's the difference between the original crusades and this one in terms of being the right or wrong force and how the killing is accomplished? Who's God is right? Aren't they the same God?\n \n IMO our values, or lack of same, have become very twisted when we can condemn others for killing when we're doing a disproportionate share under the guise of being 'right'. And then further the deception by blaming the media for disclosing inhumane treatment of Iraqi citizens in captivity by our military. Though considering we do have the highest per-capita number of imprisoned citizens of any developed country, maybe I shouldn't be surprised by our condemnation of others who act under their God.", 
   {}, 
   52602, 
   null, 
   1086016860.0
  ], 
  [
   52626, 
   null, 
   "daewoo", 
   "Defining 'Our standards', considering we're 5% of the world population, as the criterion of being above the level of scum, humanitarian or beast, seems a bit pompous. Especially when taking into consideration the number of civilians killed in Afghanistan and Iraq by our missiles, artillery, gunfire and other 'accidental' methodology. Somebody pushed those buttons or pulled those triggers, somebody gave the orders to do so, where would the blame for those deaths be placed? What's the difference between the original crusades and this one in terms of being the right or wrong force and how the killing is accomplished? Who's God is right? Aren't they the same God?\n \n IMO our values, or lack of same, have become very twisted when we can condemn others for killing when we're doing a disproportionate share under the guise of being 'right'. And then further the deception by blaming the media for disclosing inhumane treatment of Iraqi citizens in captivity by our military. Though considering we do have the highest per-capita number of imprisoned citizens of any developed country, maybe I shouldn't be surprised by our condemnation of others who act under their God.\n\n \n We live in strange times when the line between right and wrong is so blurred. We have killed over ten thousand Iraqi civilians in the name of \"liberating\" them. Are the dead ones dead because we gave them an extra dose of liberation? I suppose it could be argued that death is the greatest freedom of all.\n \n Looking at the number of people killed in our \"War on terror\" it quickly becomes obvious that the US has done the VAST majority of the killing. Americans are still upset about the atacks on 9/11, and willing to go to war over them. There were only 2,819 people killed in those attacks. We killed more afghani civilians than that the first week of our war there. We killed more Iraqi civilians than that the first DAY of the war there.\n \n So far, it seems that we are doing better than 7 to 1 as far as civilian deaths go. What will make Americans happy? 10 to 1? 20 to 1? 100 to 1?\n \n Accordin to http://www.newyorkmetro.com/news/articles/wtc/1year/numbers.htm , roughly 20% of Americans knew somebody killed in the attacks on 9/11. 100% of Iraqis know somebody who has been killed by the coalition. And people wonder why those folks are not bending over backwards to cooperate with the coalition. Ungrateful scum (dripping sarcasm).", 
   {}, 
   52622, 
   null, 
   1086023700.0
  ], 
  [
   52635, 
   null, 
   "georged", 
   "The topic of this thread is ironic when viewed as how effectively the US public has been refocused from the root problems, Bin Laden and our economy, by the mess in Iraq. The public is screaming about a civilian contractor being killed in Iraq and ashamedly trying to sweep military treatment of Iraq prisoners under the rug while Saudi Arabia is under siege from guess who and the price of oil continues to escalate. This should be an interesting week in crude futures. I wonder when the fact that this is not a conventional war will eventually get past the public's addictions to being right at any cost, TV escape and official press releases.", 
   {}, 
   52626, 
   null, 
   1086028560.0
  ], 
  [
   52643, 
   null, 
   "syklopps61", 
   "[QUOTE]\nWe live in strange times when the line between right and wrong is so blurred. We have killed over ten thousand Iraqi civilians in the name of \"liberating\" them. Are the dead ones dead because we gave them an extra dose of liberation? I suppose it could be argued that death is the greatest freedom of all.\n\n \n And if we had done nothing, you would be first in line complaining, so there IS nothing one can do to please you. If the Iraqi \"people\" had any guts, they would be fighting for their own freedom.\n \n \nLooking at the number of people killed in our \"War on terror\" it quickly becomes obvious that the US has done the VAST majority of the killing. Americans are still upset about the atacks on 9/11, and willing to go to war over them. There were only 2,819 people killed in those attacks. We killed more afghani civilians than that the first week of our war there. We killed more Iraqi civilians than that the first DAY of the war there.\n \n So far, it seems that we are doing better than 7 to 1 as far as civilian deaths go. What will make Americans happy? 10 to 1? 20 to 1? 100 to 1?\n\n \n Honestly, why stop there, turn the place to glass", 
   {}, 
   52626, 
   null, 
   1086034380.0
  ], 
  [
   52667, 
   null, 
   "daewoo", 
   "And if we had done nothing, you would be first in line complaining, so there IS nothing one can do to please you. If the Iraqi \"people\" had any guts, they would be fighting for their own freedom.\n\n \n Is it really that much to ask that we tailor our response to address the threat? Instead we go bouncing off the wall like a bunch of lunatics cutting a swath throught the arab world.\n \n If the US is VERY lucky, we will make it throught this in one piece. If not, we will continue spending ungodly sums of money in the name of \"Security\" until the dollar is worth less than toilet paper. If we are very unlucky, the American militants and the muslim militants will realise that they really have an awful lot in common. \n \n WE have alienated enough of the world to date that the odds of us really being able to count on any meaningful support from other countries are pretty slim. \n \n Here we sit, 2004, and Al Queda is bigger than it ever was. They have re-structured so it is almost impossible to infiltrate them and get any real intelligence. The dollar is still dismally low, Iraq is a mess, international opinion of America is as low as it has EVER been, and it doesn't appear that AMericans seem to notice or care. As long as we can buy some cheap junk at Wal Mart and then swing our SUV through the Mc Donalds parking lot on the way home, who cares???\n \n \nHonestly, why stop there, turn the place to glass\n\n \n This is likely to be real popular with the rest of the world. t is amazing to me how many Americans make stupid comments lik this then go \"Who cares what the rest of the world thinks\"? This is one area where the isolationists have got it right. If America was an isolationist country, the rest of the worlds opinion wouldn't really matter. To a country running a trade deficit the size of Americas, and as dependant for our energy needs as America is, the rest of the worlds opinion matters a LOT. Even if we don't factor in the attack support structure that alienating the rest of the world provides, it is quickly apparent that, as far as AMeirca well being is concerned, the rest of the worlds opinion of America is frankly more important than our own populations opinion is. Our population is not financing our debt.", 
   {}, 
   52643, 
   null, 
   1086046800.0
  ], 
  [
   52692, 
   null, 
   "georged", 
   "IMO most Americans, uninformed as the general populace is about actual world events other than what they're exposed to by domestic media, want to be right no matter what the cost. We're viewed by the rest of the world as being represented by our government, regardless of the stranglehold both very similar political parties have on the populace. It is our government. At this point in time we're being viewed by the rest of the world (other than those nations we've bought and paid for) as an aggressive, military action prone power, dangerous to them not only as a crusading entity but endangering the world economy with our domestic and foreign policy. \n \n We've invaded Iraq on premises of WMDs, freeing the Iraqi people, establishing a model ME democracy to those scumbags don't deserve what we're trying to do for them. We champion Israel's real estate policies and terrorism against Palestinian civilians and refuse to accept the fact that Islamic extremists attack us, Saudi Arabia, Spain, etc. because they don't want our influence or presence in the ME. Our economy is running on empty due to public and personal debt and a standard of living that denies us a competitive ability in world trade, yet most believe we're recovering and will once again be the dominant world industrial power. If one stands back and takes a look at our current situation, we resemble a pouting child in denial of breaking adult rules without fear of ounishment. To be right is everything, regardless of the emotional and financial cost.\n \n If the media has gone too far with anything, it has to be their protective position of not angering any audience to a point of fear that their advertisers have as target markets. We're well coddled and shielded from a lot of reality due to our capitalistic system, as any news media editor or politician can tell you.", 
   {
    "unicode_changes_made": true
   }, 
   52667, 
   null, 
   1086060120.0
  ], 
  [
   52732, 
   null, 
   "syklopps61", 
   "This is likely to be real popular with the rest of the world. t is amazing to me how many Americans make stupid comments lik this then go \"Who cares what the rest of the world thinks\"?\n\n \n So, I'm stupid for making a comment like turning the place to glass? Well, it will happen in the future IF we want to survive. Now, for the spineless who want to ask the world permission for everything we do, not sure what I can say. Ever see \"Red Dawn\"? You remind me of that kid who was the son of the mayor of the town, seeing that the invaders might win and positioning himself to be in their good graces. Reading your posts and apparent love of the \"great\" (oozing with sarcasm by the way) Arabic peoples of the world, you should be their right hand guy should we lose", 
   {}, 
   52667, 
   null, 
   1086126300.0
  ], 
  [
   52735, 
   null, 
   "georged", 
   "So, I'm stupid for making a comment like turning the place to glass? Well, it will happen in the future IF we want to survive. Now, for the spineless who want to ask the world permission for everything we do, not sure what I can say. Ever see \"Red Dawn\"? You remind me of that kid who was the son of the mayor of the town, seeing that the invaders might win and positioning himself to be in their good graces. Reading your posts and apparent love of the \"great\" (oozing with sarcasm by the way) Arabic peoples of the world, you should be their right hand guy should we lose\n\n \n I can't speak for the poster you're responding to, but by showing the world we're not spineless with displays of $200 billion conventional military might over third rate countries, we're destroying ourselves in more ways than one. Not to mention that we look like fools. All anybody else is doing is pushing us in the right direction for continual interference in their lives. And, as has been well proven, their pushes are nothing that can be countered with military force. We'll financially bleed ourselves out.", 
   {}, 
   52732, 
   null, 
   1086128160.0
  ], 
  [
   52748, 
   null, 
   "daewoo", 
   "So, I'm stupid for making a comment like turning the place to glass? Well, it will happen in the future IF we want to survive. Now, for the spineless who want to ask the world permission for everything we do, not sure what I can say. Ever see \"Red Dawn\"? You remind me of that kid who was the son of the mayor of the town, seeing that the invaders might win and positioning himself to be in their good graces. Reading your posts and apparent love of the \"great\" (oozing with sarcasm by the way) Arabic peoples of the world, you should be their right hand guy should we lose\n\n \n That is a stupid comment. Sorry. Next time think a little harder about the reprocussions of an act before you propose it. Looking at the likely reprocussions of that particular act, it is pretty apparent that yes, that is a stupid ides.\n \n Again, you are missig the intricasies of international relations and how they apply to the the US situation. We can get away with acting unilaterally to a point. IF we cross the line, the rest of the world is more than capable of smacking our hand. THis is a position we put ourselves in. We do not have the economic infrastructure to run rouhshod over the rest of the world. \n \n As far as respect for the arabs as a people, you are talking about folks who have managed to remain a cohesive people for over 10,000 years. They are the only people ont he planet that can make this claim. The Arabs have watched every great empire in history come and go, and still managed to maintain their culture. These are not people to be trifled with. \n \n Look at some of the values that the Arabs hold dear, such as honor, strong family ties, a sense of justice and a strong sense of social responsibility. THese are the kid of values that make for a trong, united people. Interestingly enough, these are also the kind of values that we shun in America. \n \n AMerica has been around for a couple hundred years. to the Arabs, who had publicly lighted streets over a thousand years before London was even a small village, a couple hundred years is NOTHING. America is a child throwing a temper tantrum.\n \n I think the biggest reason we are having such a problem in Iraq is that America underestimated the will of the Arab people. THere are different kinds of tough. America is tough because we have big tanks and cruise missiles and hundred of billions of dollars to throw down the crapper. The areabs are tough becase they have an individual strength of will and a unity with their brother arabs that we lack. They will take their losses form the tanks and cruise missiles and attack helicopters, bury their dead, then prepare their counter attack.\n \n If indeed this is to be a war with the Arab world, the US cannot afford to underestimate them. THey have seen empires come and go, and they have always survived. It is interesting to note that they are fighting ameirca in much the same way they fought the romans. They simply made it so expensive to continue that the Romans were stopped in their tracks. \n \n As George has pointed out, they do not need to kill more than we do, they simply have to make us spend ourselves out of existance. If you look at what we have spent on \"homeland security\", military action, etc... it is VER apparent that all they have to do is keep pulling off little attacks and dropping little hints about future attacks, and we will shortly spend ourselves right into the ground. \n \n This doesn;t even take into account the hits we have taken in international opinion in the fighting of our \"war on terror\". As I pointed out before, a nation that is working under a trade deficit the size of Americas can ill afford to damage relations with other countries. IF you factor in our national debt, which is mostly funded by foreign nations and foreign investors, and it quickly becomes apparent that keeping other nations happy is, and has been, the main business of the US.\n \n I am not particulalrly fond of the Arabs. They have differnt values than me and a culture that I find overly restrictive. I still respect them as a people. I am not particularly fond of HItler for the same reasons (no, I am not comparing hte Arabs to HItler). THe guy DID manage to take of most of Europe at one time, so I do hold a certian respect for him in some areas, just like the arabs.\n \n You seem to proscribe to some kind of flag waving, nationalistic rhetoric that I personally find unpalatable. It seems to lack any kind of connection to the realities of the world. Lacking such a connection in your rhetoric, i can see why you are having some trouble finding any reaon to respect your percieved enemy.\n \n I would suggest you do a little research into the history of the ME. It is an interesting topic. If nothing else, you seem to have selected the Arab people as a whole as your enemy, and it always pays to know your enemy.", 
   {}, 
   52732, 
   null, 
   1086135420.0
  ], 
  [
   52773, 
   null, 
   "syklopps61", 
   "[QUOTE]\nThat is a stupid comment. Sorry. Next time think a little harder about the reprocussions of an act before you propose it. Looking at the likely reprocussions of that particular act, it is pretty apparent that yes, that is a stupid ides.\n\n \n yeah, they probably said that about Hiroshima and Nagasaki too, but the world has gone on just fine\n \n \nAs far as respect for the arabs as a people, you are talking about folks who have managed to remain a cohesive people for over 10,000 years.\n \n \n And they are stuck there too I might add LOL \n \n \nThe Arabs have watched every great empire in history come and go, and still managed to maintain their culture. These are not people to be trifled with. \n \n \n Sorry, I'm in a sarcastic mood tonight, but I wonder, has anyone really wanted a sandbox to control anyway?\n \n \nLook at some of the values that the Arabs hold dear, such as honor, strong family ties, a sense of justice and a strong sense of social responsibility. \n \n \n I'm sorry, I have to strongly disagree here. HONOR? They sell out to the highest bidder. You mentioned before that you make deals on a handshake-won't work with them. A sense of justice? The only thing I will agree with them on is they don't screw around with criminals like we do here, so I WILL give them credit for that; however, they do have perceived INjustices and try to lay blame on others for their woes. Sounds frighteningly like minorities in THIS country (whole other topic I know) who take no responsibility for their OWN actions and blame it on others. So, not real sure about the responsibility part, either\n \n \n \nTHese are the kid of values that make for a trong, united people. Interestingly enough, these are also the kind of values that we shun in America. \n\n \n Thanks to Liberals, but again, a whole different thread there LOL\n \n \nAMerica has been around for a couple hundred years. to the Arabs, who had publicly lighted streets over a thousand years before London was even a small village, a couple hundred years is NOTHING. America is a child throwing a temper tantrum.\n\n \n And I think this is one of the core reasons for their jealousy, they maybe once had a thriving, flourishing culture, but our dinky little country has become the dominant power in the world in just 200 years. Maybe that says something about the respective peoples, huh? Oh wait, don't tell me, we got all this because we were just lucky, right?\n \n \nI think the biggest reason we are having such a problem in Iraq is that America underestimated the will of the Arab people. THere are different kinds of tough. America is tough because we have big tanks and cruise missiles and hundred of billions of dollars to throw down the crapper. The areabs are tough becase they have an individual strength of will and a unity with their brother arabs that we lack. They will take their losses form the tanks and cruise missiles and attack helicopters, bury their dead, then prepare their counter attack.\n\n \n You may have a point here but it's only because we have become so enlightened. You can't tell me that the Americans of yesteryear were not equally as tough in that sense. The Liberals have taken control of many core areas and have wussified the American people. They don't have politicians who have to be accountable, so this too is a reason for their so called tooughness. Plus a lack of civilized behavior. If we went \"tough\" like them, I get the feeling you might very well criticize us for being so tough. The only thing we underestimated in my opinion is that Hussein took Americans for fools and he was right. He remembers the \"gallantry\" with which his tough soldiers fought during the first gulf war, and KNEW he couldn't take us. He had his men hide in women's dresses in order to continue the fight, knowing that the good little Liberals in this country would whine about \"civilian\" deaths, and it worked beautifully. This \"will\" most likely the soldiers and not the regular civilians.\n \n \nAs George has pointed out, they do not need to kill more than we do, they simply have to make us spend ourselves out of existance. If you look at what we have spent on \"homeland security\", military action, etc... it is VER apparent that all they have to do is keep pulling off little attacks and dropping little hints about future attacks, and we will shortly spend ourselves right into the ground. \n \n \n I agree completely on this point..so for our survival, what are you willing to do? I for one am very willing to be \"tough\" like them, screw the press and public opinion, and let's go at it\n \n \nYou seem to proscribe to some kind of flag waving, nationalistic rhetoric that I personally find unpalatable.\n\n \n HMMMMMMMMMMM you don't find anything in the American people to warrant the resapect you accord the Arabs? I've seen posts from you that have appeared to me to be along the line of the \"hate America first crowd\"-if we becomoe \"tough\" like them, I have no doubt you WOULD slam the U.S. Why is that exactly?", 
   {}, 
   52748, 
   null, 
   1086147780.0
  ], 
  [
   52792, 
   null, 
   "daewoo", 
   "[QUOTE=syklopps61]\nyeah, they probably said that about Hiroshima and Nagasaki too, but the world has gone on just fine\n\n \n I seriosly doubt it. First off, both Hiroshima and Nagasaki were legitimat military targets. Both cities were stronghold of military production. OVer 80% of japans weapons were coming from those two cities. Every adult in both cities was involved in either weapons production or the support base for that industry (shopkeepers, etc...). Second of all, we were actually at war with JApan. We are not at war with any country in the ME except Iraq, and we have already declared victory there. Saudi Arabis has just had a wave of terrorist attacks specifically becasue of their \"governments\" support for the US. SHould they be nuked? An attack was just recently thwarted in JOrdan where the terrorists had enough explosives and chemicals to kill 80,000 people. This attack was planned because of Jordans support for the US. \n \n The likely reprocussions of an attack on Nagasaki and Hiroshima was an end to a war that was killing tens of thousands of people per day. This situation is not at all comparable.\n \n \nAnd they are stuck there too I might add LOL \n \n \n Stuck where? The ME? That is home to them. They are used to it. Ever been there? It is differnt, but really quite nice. Really hot at time, cold at others, and there are a surprising number of bugs.\n \n \n \nSorry, I'm in a sarcastic mood tonight, but I wonder, has anyone really wanted a sandbox to control anyway?\n\n \n A sandbox with hundreds of billions of dollars worth of oil under it. Through history there has been a lot of blood spilled over control of the middle east.\n \n \nI'm sorry, I have to strongly disagree here. HONOR? They sell out to the highest bidder. You mentioned before that you make deals on a handshake-won't work with them. A sense of justice? The only thing I will agree with them on is they don't screw around with criminals like we do here, so I WILL give them credit for that; however, they do have perceived INjustices and try to lay blame on others for their woes. Sounds frighteningly like minorities in THIS country (whole other topic I know) who take no responsibility for their OWN actions and blame it on others. So, not real sure about the responsibility part, either\n\n \n If they simply sold out to the highest bidder, they would have already sold out to the US years ago. A huge number of deals are made on handshakes in the ME. Multi billion dollar drilling contracts have been based on handshakes. Arabs have been known, even in modern times, to kill FAMILY MEMBERS over matters of honor. There was a blood fued between two differnt beduin tribes that lasted ofer 2000 years that ws a matter of honor. \n \n Saying the Arabs have no honor is like saying that the Japanese, who routinely commit ritual suicide (sometimes after murdering their whole family) when they feel they have been dishonored, have no honor.\n \n As far as the question of justice, that is a topic that is far beyond the scope of this thread, though we could start another if you wish. Tere are some pretty big cultural differences that have to be examined, as well as a differnt type of class system tan we have int he western world.\n \n \nThanks to Liberals, but again, a whole different thread there LOL\n\n \n WOW, we agree on something. \n \n \n \nAnd I think this is one of the core reasons for their jealousy, they maybe once had a thriving, flourishing culture, but our dinky little country has become the dominant power in the world in just 200 years. Maybe that says something about the respective peoples, huh? Oh wait, don't tell me, we got all this because we were just lucky, right?\n\n \n One of the reasons that our country has become a dominate power int he world is the fact that it is not \"dinky\". In order to really thrive, a country must have a natural resource base that allows growth. THis is why our forefathers pushed western expansion so hard. It was their foresight that allowed America to become the industiral giant that it once was (I say once was because our industiral sector has shrunk enormously). This is the same reason that the British Empire pushed so hard to gain control of sections of Africa. They had to spread their empire becasue England didn't have the natural resources available to supprt an industrial infrastructure.\n \n This is exactly what led to the fall of the ME as world leaders. As the population in the region grew, they didn't have the natural resources to supply materials to industry (keep in mind that at the time oilw as not a valuable commdity and the technology did not exist to drill wells). ITems like steel and lumber that are essential to industrial growth are hard to come by and expensive int he ME. During the crusades, arabs were going into battle against fully armored knights using bronze swords, because there was not enough acessible steel in the area to provide all the arabs with steel swords. \n \n I do not think that the \"jealosy\" excuse for the Arab extremists actions is realistic. Most arabs seem happy to live a traditional arab lifestyle. \n \n My first job out of college was for a company that sold prefab steel building (great big ones) in the middle east. They were manufactured in America and shipped by boat, then erected on site to house drilling equipment, pumping equipment, portions of refineries, etc.... I tagged along on several occasions to meet with a couple of different sheiks. These guys were some of the richest men in the world. Their yearly income was measured in the hundreds of billions of dollars. When we met with them, it was usually literally in tents in the desert with camels tied outside. These were guys who could buy entire states and think nothing of it if they so desired, and they were hanging out in tents. Very nice tents, but they didn't even have air conditioning. They were apparently happy with this setup.\n \n This seems to be acultural thing. HEre in America we value cell phones and cars with in dash navigation and doby surround sound. I have foudn that in many other parts of the world, they have other values.\n \n \nYou may have a point here but it's only because we have become so enlightened. You can't tell me that the Americans of yesteryear were not equally as tough in that sense. The Liberals have taken control of many core areas and have wussified the American people. They don't have politicians who have to be accountable, so this too is a reason for their so called tooughness. Plus a lack of civilized behavior. If we went \"tough\" like them, I get the feeling you might very well criticize us for being so tough. The only thing we underestimated in my opinion is that Hussein took Americans for fools and he was right. He remembers the \"gallantry\" with which his tough soldiers fought during the first gulf war, and KNEW he couldn't take us. He had his men hide in women's dresses in order to continue the fight, knowing that the good little Liberals in this country would whine about \"civilian\" deaths, and it worked beautifully. This \"will\" most likely the soldiers and not the regular civilians.\n\n \n Wow, we agree on two things. Or maybe it is still the same one, that being that liberals are corroding the social values in America. \n \n Of course Saddam knew he couldn't take us. I don't think there is any question of that. I think his plan was to hide out until the Americans invaded, searched for WMD's and came up dry, then to reappear and order the Americans out of his coutry, since he was obviosly not in violation of the UN resolutions and the invasion was illegal. I think that, had we not captured him, this may very well have worked. At this point, I seriosly doubt he could pull it off with a transitional government already in place. \n \n Civilian casualties in this war do bother me quite a bit. Ameirca claims they did everything in their power to avoid civilian casualties,yet the very first cruise missile we fired was intentionally targeted at a restraunt where they thought saddam might have been eating (the attack on the palace before that was a smart bomb). I also disagree with our use of cluster bombs in civilian areas. \n \n \n \nI agree completely on this point..so for our survival, what are you willing to do? I for one am very willing to be \"tough\" like them, screw the press and public opinion, and let's go at it\n\n \n I am willing to be even tougher than that and admit that our foreign policy sucks and change it. Didn't your dad ever teach you that it takes a big man to stand for what is right, but an even bigger man to admit when he is wrong?\n \n \nHMMMMMMMMMMM you don't find anything in the American people to warrant the resapect you accord the Arabs? I've seen posts from you that have appeared to me to be along the line of the \"hate America first crowd\"-if we becomoe \"tough\" like them, I have no doubt you WOULD slam the U.S. Why is that exactly?\n\n \n I think that the American people are great. I think that America was a great country, and can be again. The problem seems to be our politicians. I currently work in a field were I meet a lot of politicians, and I only know one that I would trust to hold my wallet or drive my car, and he is a feshman senator who has not yet been entirely corrupted by the system. He would not be where he is if his political party had not carefully vetted him to ensure that he is corruptible.\n \n America was founded on the principal that every man has rights that were endowed by his creator. EVERY MAN, not just those who reside within our borders. I find it reprehinsible that the special interest whores that we have elected into office do business with and support tyrannical governments in other nations. While it may be true that we cannot dictate other coutries domestic policies, we can absolutly choose who we do business with and who we support. \n \n America is supposed to be about liberty and justice (for all). America is not supposed to be about screwing the entire population of another country in order to secure trade benifits for our corporate interests. \n \n America is not supposed to be about forcibly imposing our culture, values and political model on third parties. \n \n America was not meant to be governed by politicians who routinely lie to the public (dishonest politicians have become a cliche) \n \n America was not meant to sustain a government that eats up over 50% of our GDP. \n \n America was not meant to degrade into a society where women are raped on the side of a busy highway in full view of passing motorists and nobody stops to help.\n \n America was not meant to turn into a place where we teach people to yell \"fire\" instead of \"help\" if they are attacked becasue nobody will respond to cries for help, but they will respond to somebody yelling \"fire\" as a matter of self interest. \n \n America was NEVER meant to be a place where american citizens could be locked up secretly and for an indefinate period of time with no access to the courts or to legal council.\n \n I would gladly die for the principals America was founded on. As America stands now, I find it disgusting and embaressing that we as Americans have allowed our country to degrade to the point that it has. IF I did not have faith in the PEOPLE of America, I would leave and spend the rest of my life working towards the destruction of America in the hopes that something truly \"American\" would grow back in its place. \n \n I firmly believe that the American people still believe in the principals that America was founded on. I also believe that the time will come when we reach a breaking point and when that point is reached, Americans will take our country back either by force of will or force of arms (to be decided later, either way would work) from the bastards who have stolen it from us. \n \n We were once a great nation, a nation governed by morals and justice. I see no reason that we can't be again.\n \n As I see it, one of the greates danger to America as a nation are those idiot \"flag wavers\" who belive that if America is doing it, then it must be right. They believe everything they are told, don't look into or think about anything for themselves, and are absolutly incapable of making moral judgements based on facts and reason. They sit around and go \"By god, george bush said it in a speach and thats good enough for me\". They are masters of \"doublethink\" (the ability to accept two completly opposing viewpoints as fact). \n \n Sorry if that got a little long. You asked, I answered.", 
   {}, 
   52773, 
   null, 
   1086177660.0
  ], 
  [
   52800, 
   null, 
   "syklopps61", 
   "Stuck where? The ME? That is home to them. They are used to it. Ever been there? It is differnt, but really quite nice. Really hot at time, cold at others, and there are a surprising number of bugs.\n \n \n Well, I was exaggerating, but meant that they were stuck in a time warp-more like 12th century than 10,000 years ago\n \n \nThe likely reprocussions of an attack on Nagasaki and Hiroshima was an end to a war that was killing tens of thousands of people per day. This situation is not at all comparable.\n \n \n And IF it got like that HERE? I think it's very comparable\n \n \nA sandbox with hundreds of billions of dollars worth of oil under it. Through history there has been a lot of blood spilled over control of the middle east.\n\n \n Cetainly throughout history it hasn't been the oil, and since I could care less about their history and culture, I'm not quite sure what anyone would've wanted there\n \n \nIf they simply sold out to the highest bidder, they would have already sold out to the US years ago. A huge number of deals are made on handshakes in the ME. Multi billion dollar drilling contracts have been based on handshakes. Arabs have been known, even in modern times, to kill FAMILY MEMBERS over matters of honor. There was a blood fued between two differnt beduin tribes that lasted ofer 2000 years that ws a matter of honor. \n \n \n Well, you may have a point on the highest bidder comment, certainly we could have bought them off if that were the ONLY motivation the Arabs had, I'll grant you that. I still have a problem though with respecting these examples of honor you give. I think by most standards of the civilized world, this is just plain whacko LOL\n \n \nWOW, we agree on something. \n \n \n You're scaring me here LOL I will take this opportunity to apologize then for saying that you MIGHT be a Liberal in my response to you in the other thread :-)\n \n \nI do not think that the \"jealosy\" excuse for the Arab extremists actions is realistic. Most arabs seem happy to live a traditional arab lifestyle. \n \n \n I only made the comment for food for thought, I'm not gonna stand by it and fight to the death over it. Since we spoke of honor, just MAYBE there is a loss of honor in having a once thriving, world power only to be reduced to basically a third world country, one that without oil, the world would pay little attention to\n \n \nWow, we agree on two things. Or maybe it is still the same one, that being that liberals are corroding the social values in America. \n \n \n Okay, now I'm REALLY scared LOL\n \n \nCivilian casualties in this war do bother me quite a bit. Ameirca claims they did everything in their power to avoid civilian casualties,yet the very first cruise missile we fired was intentionally targeted at a restraunt where they thought saddam might have been eating (the attack on the palace before that was a smart bomb). I also disagree with our use of cluster bombs in civilian areas. \n \n \n I have never claimed that we are perfect and that mistakes have never been made. But nothing is good if we just pick out the bad things-no person is good, no country, nothing. \n \n \nI am willing to be even tougher than that and admit that our foreign policy sucks and change it. Didn't your dad ever teach you that it takes a big man to stand for what is right, but an even bigger man to admit when he is wrong?\n\n \n My Dad taught me just fine, and yes, I can admit when I, or the country, is wrong. But let's face it, really, do we KNOW it's wrong (and not just because the terrorists don't like it). When all is said and done, things COULD work out in Iraq and it could be called the greatest foreign policy in history. YOU don't know and neither do I, so let's come back in 30 years and see. If I'm wrong, I'll gladly admit it. I would say though that there was a little dodge here (our exchanges in the other thread) on your part. What ARE you willing to do for our survival as a nation and the lifestyle we enjoy? Are you willing to be \"tough\" like them, make them fear us?\n \n \nI think that the American people are great. I think that America was a great country, and can be again. The problem seems to be our politicians. I currently work in a field were I meet a lot of politicians, and I only know one that I would trust to hold my wallet or drive my car, and he is a feshman senator who has not yet been entirely corrupted by the system. He would not be where he is if his political party had not carefully vetted him to ensure that he is corruptible.\n\n \n AGREED\n \n \nAmerica was founded on the principal that every man has rights that were endowed by his creator. EVERY MAN, not just those who reside within our borders. I find it reprehinsible that the special interest whores that we have elected into office do business with and support tyrannical governments in other nations. While it may be true that we cannot dictate other coutries domestic policies, we can absolutly choose who we do business with and who we support. \n \n \n AGREED; however, the same goes for the Middle East then. I WILL not accept that only Israel is a tyrranical country and that the Middle East is good and pure-no way\n \n \nAmerica is supposed to be about liberty and justice (for all). America is not supposed to be about screwing the entire population of another country in order to secure trade benifits for our corporate interests. \n \n \n AGRRED, not so sure about the screwing part. I know we are not angels and that policies are made to benefit our interests, but I don't think that we went into Iraq for the SOLE purpose of what you state.\n \n \nAmerica is not supposed to be about forcibly imposing our culture, values and political model on third parties. \n \n \n AGRRED to a point. I don't think we are being imperialistic, if so, we would have the whole world practically. These people have been given a CHANCE that they've never had before. If they blow it, then let them rot. If they have courage to carry on what we have given them, they very well might flourish\n \n \nAmerica was not meant to be governed by politicians who routinely lie to the public (dishonest politicians have become a cliche) \n \n \n I couldn't agree MORE. I will say that Bush is closer to most in the honesty department. I have hope that one day we will have a man stand up and do what's right for this country and to hell with polls and opinions and special interests. A leader will get the people to think what he thinks, and he would probably by elected for life\n \n \nAmerica was not meant to sustain a government that eats up over 50% of our GDP. \n\n \n AGREED, BIG TIME\n \n \nAmerica was not meant to degrade into a society where women are raped on the side of a busy highway in full view of passing motorists and nobody stops to help.\n\n \n AGREED\n \n \nAmerica was not meant to turn into a place where we teach people to yell \"fire\" instead of \"help\" if they are attacked becasue nobody will respond to cries for help, but they will respond to somebody yelling \"fire\" as a matter of self interest. \n \n \n AGREED\n \n \nAmerica was NEVER meant to be a place where american citizens could be locked up secretly and for an indefinate period of time with no access to the courts or to legal council.\n\n \n Not real sure what you're referencing here\n \n \nI would gladly die for the principals America was founded on. As America stands now, I find it disgusting and embaressing that we as Americans have allowed our country to degrade to the point that it has. IF I did not have faith in the PEOPLE of America, I would leave and spend the rest of my life working towards the destruction of America in the hopes that something truly \"American\" would grow back in its place. \n \n \n AGREED\n \n \nI firmly believe that the American people still believe in the principals that America was founded on. I also believe that the time will come when we reach a breaking point and when that point is reached, Americans will take our country back either by force of will or force of arms (to be decided later, either way would work) from the bastards who have stolen it from us. \n \n \n AGREED\n \n \nWe were once a great nation, a nation governed by morals and justice. I see no reason that we can't be again.\n\n \n AGREED\n \n \nAs I see it, one of the greates danger to America as a nation are those idiot \"flag wavers\" who belive that if America is doing it, then it must be right. They believe everything they are told, don't look into or think about anything for themselves, and are absolutly incapable of making moral judgements based on facts and reason. They sit around and go \"By god, george bush said it in a speach and thats good enough for me\". They are masters of \"doublethink\" (the ability to accept two completly opposing viewpoints as fact). \n \n \n I'm not sure about \"dangerous\" though. I agree with what you are saying, I don't agree with everything Bush does (if I've given that impression, I sure didn't mean to). I DON'T hink we have to go as far as the press and the Liberals that we have to immediately say that the U.S is wrong\n \n \n \nSorry if that got a little long. You asked, I answered.\n[/QUOTE]\n \n I'm glad you did, shows we have more common ground than not, and I enjoyed your post-very well said", 
   {}, 
   52792, 
   null, 
   1086191100.0
  ], 
  [
   52844, 
   null, 
   "Ghost", 
   "And the Christian Crusades (original) were humane? Almost 300 years of broadsword death (not much different and often far more gruesome than pure decapitation) in the name of God?\n\n \n No, the Crusades weren't humane. I never said it was, and I'm not defending my past...because it's not my past. I'm in no way Christian, partially because of their history in things like the Crusades and the Witch Hunts. The Crusades are the epitome of religious intolerance.\n \n \nGhost, you are smarter than this. Don't believe everything you hear or everything the media tells you, and try to look at things objectively before forming opinions.\n\n \n I don't believe everything I hear in the media, daewoo. I believe the tape I heard of his beheading, though. It was about 30 seconds long, I tore the earplugs out of my ears after about 15 seconds it was so horrific. Berg is screaming the entire time while the militants yell \"Allah Akbar\" over and over again. I said what I said because I know that I would never do that to someone. As much as I want to see Zarqawi (the man who beheaded him) dead, I wouldn't put him through an unnecessarily painful death. If you are willing to happily behead a screaming, shackled human being with a knife, you're scum. I'm not talking about everybody we're fighting in Iraq, I'm not talking about Arabs in general, I'm talking about a small group.\n \n Daewoo, I know that war is terrible. I can understand that. I know that incredibly bad stuff happens to people. I just have a huge problem with harming innocent people and a huge problem with gleefully causing pain and suffering needlessly.", 
   {}, 
   52622, 
   null, 
   1086214080.0
  ], 
  [
   52856, 
   null, 
   "daewoo", 
   "\n I don't believe everything I hear in the media, daewoo. I believe the tape I heard of his beheading, though. It was about 30 seconds long, I tore the earplugs out of my ears after about 15 seconds it was so horrific. Berg is screaming the entire time while the militants yell \"Allah Akbar\" over and over again. I said what I said because I know that I would never do that to someone. As much as I want to see Zarqawi (the man who beheaded him) dead, I wouldn't put him through an unnecessarily painful death. If you are willing to happily behead a screaming, shackled human being with a knife, you're scum. I'm not talking about everybody we're fighting in Iraq, I'm not talking about Arabs in general, I'm talking about a small group.\n\n \n First off, that wasn't Zarqawi. He didn't have a Jordanian accent. Even the CIA has admtted that was not their boogey man. That wasn't even al queda. That little misconception was based on either a mis-translation, or the American government deliberatly misleading ther people and trusting that Americans are not bright enough to be able to hear the difference between \"Al-queda\" and \"al qud\". The jury is still out on that one.\n \n As far as not being able to do it, sure you could. Everybody is capable of atrocoties, as unsettleing as that may be. History is full of seemingly normal people who turn into monsters when given the correct set of circumstances. Besides, beheading is not that bad. Sure, he was screaming and throwing a fit. People do that when you execute them. BEheading is a tradition ME form of execution. It is no better or worse than anything else. Ever see somebody electocuted? I looks a LOT more unpleasant than beheading. As far as the sense of bravado in his executioners, you will find this common in war zones. People puff up and strut around in an effort to convince themselves that they are not scared and that their actions are just. There are much worse ways to die. You can live for several days in excrutiating agony if you are disemboweled.\n \n \nDaewoo, I know that war is terrible. I can understand that. I know that incredibly bad stuff happens to people. I just have a huge problem with harming innocent people and a huge problem with gleefully causing pain and suffering needlessly.\n\n \n The only difference between humans and other animals is that humans are the only species that kills our own for pleasure. Humans as a rule thrive on power, and there is no greater power than the power to tkae anothers life. This is why guys come back from combat as fruitcakes. It is not because they had to kill people, it is because they liked it, and they have trouble reconciling this unpleasant fact with the moral values theya re supposed to hold. I think serial killers are mostly people who kill once and like it so much they cannot stop. \n \n I know this is a difficult concept for civilians to get their heads around, and even for most soldiers to understand, until they go feet dry over a combat zone. It is the ultimate game, with the ultimate prize. \n \n I once dated a girl who worked at the VA hospital in Kansas City in the psyche ward (before they shut it down and turned all those insane former special forces guys out on the street). She claimed that the biggest hurdle to these guys getting better was getting them to admit that they enjoyed it. Then you go from there. She also said that several of the people she had treated claimed that the American CIA killed dozens of soldiers who had been deep in the mountains of vietnam, because they were so broken that they didn't think they could ever be fixed, and so well trained that they didn't think they could be dealt with.\n \n These are the unpleasant realities of war. America wanted war. Here it is. Enjoy it while you can.", 
   {}, 
   52844, 
   null, 
   1086226080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  is the media going too far?", 
  "url": "http://www.4forums.com/political/peace-middle-east/2448-media-going-too-far.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 2448, 
  "discussion_files": [
   [
    "11512.html", 
    "http://www.4forums.com/political/peace-middle-east/2448-media-going-too-far-print.html"
   ], 
   [
    "11513.html", 
    "http://www.4forums.com/political/peace-middle-east/2448-media-going-too-far-3-print.html"
   ], 
   [
    "11514.html", 
    "http://www.4forums.com/political/peace-middle-east/2448-media-going-too-far-2-print.html"
   ]
  ], 
  "identifier": 2448
 }
]