[
 [
  [
   51397, 
   null, 
   "Big Orn", 
   "In your study of the scriptures, what does: From and Before &#8220;the Foundation of the World&#8221; mean to you? And how does it apply to the Lamb&#8217;s Book of Life?\n \n See: (it&#8217;s on the net if you don&#8217;t have a Bible handy)\n Mathew 13 : 35 and 25 : 34\n Luke 11 : 50\n John 17 : 24\n Ephesians 1 : 4\n Hebrews 4 : 3 and 9 : 26\n 1 Peter 1 : 20\n Revelations 13 : 8 and 17 : 8\n \n I&#8217;m out of pocket 3 days a week (Friday &#8211; Sunday) without a PC, so bear with me.", 
   {
    "post_info": {
     "post_title": "Foundation of the World"
    }
   }, 
   null, 
   null, 
   1085095740.0
  ], 
  [
   53499, 
   null, 
   "terral03", 
   "Hi Ron and All:\n \n Ron asks << In your study of the scriptures, what does: From and Before \"the Foundation of the World\" mean to you? \n \n Ron's first verses << Mathew 13:35, 25:34, Luke 11:50, John 17:24\n \n \"{This was} to fulfill what was spoken through the prophet: \"I WILL OPEN MY MOUTH IN PARABLES; I WILL UTTER THINGS HIDDEN SINCE THE FOUNDATION OF THE WORLD.\" Matt. 13:35.\n \n \"Then the King will say to those on His right, 'Come, you who are blessed of My Father, inherit the kingdom prepared for you from the foundation of the world.\" Matt. 25:34.\n \n \"So that the blood of all the prophets, shed since the foundation of the world, may be charged against this generation.\" Luke 11:50.\n \n John 17:24 \"Father, I desire that they also, whom You have given Me, be with Me where I am, so that they may see My glory which You have given Me, for You loved Me before the foundation of the world.\" John 17:24.\n \n Terral's reply << You have found evidence that there is a time that existed before the foundation of the world. Let us examine the opening of the Gospel of John:\n \n \"In the beginning was the Word, and the Word was with God, and the Word was God. He was in the beginning with God. All things came into being through Him, and apart from Him nothing came into being that has come into being.\" John 1:1-3.\n \n Since creation comes into being in John 1:3, the words of John 1:1+2 are describing a period prior to the creation of time and space of this realm. It is most important that you view time and space as a created things. The realm of the Almighty is outside the time and space of this realm, as creation itself is far too small to contain Him (1Kings 8:27, 2Chron. 2:6). Again, we read, \"In the beginning was the Word, and the Word was with God, and the word was God.\" John 1:1. Christ gives us a clue here about His relationship with the Father, saying, \"Now, Father, glorify Me together with Yourself, with the glory which I had with You before the world was.\" John 17:5. Again, this period 'before the world was' is represented by the two verses appearing before John 1:3. \n \n The Word \"was God\" in the time of John 1:1. In other words, this describes a period before God called anything into being that pertains to this creation. There is no such thing as 'the Son' in the realm of the Almighty. In the realm of the Almighty, the 'Son' as we know Him is One with God. Christ says, \"I and the Father are one.\" John 10:30. Then in the next verse, \"He was in the beginning with God.\" Vs 2. The Word of God at that moment became a vehicle of expression. Our visualization is of God with the Word at His right hand. This intercessory realm of the Son exists between this realm of creation and the infinite realm of the Almighty. Then, from that position the time, space heavens and earth of this created realm were called into being (John 1:3). \n \n Those things which have been hidden 'from the foundation of the world' are part of this created physical realm (John 1:3). Those things that have their origin 'before the foundation of the world' have membership in the infinite realm of the Almighty (John 1:1), through the intercessory realm of His Son (John 1:2). You will find that the gospel of the kingdom (Matt. 4:17 (23), 9:35, 24:14, 8:12) is part of God's program that was founded 'from the foundation of the world.' Matt. 25:34. \" . . .inherit the kingdom prepared for you from the foundation of the world.\" Satan was allowed to see all of Prophecy (from the), but not the Mystery (before the).\n \n Those who are obedient to Paul's gospel are seated in the heavenly 'in' Christ already. \"Even when we were dead in our transgressions, made us alive together with Christ (by grace you have been saved), and raised us up with Him, and seated us with Him in the heavenly {places} in Christ Jesus.\" Eph. 2:5+6. This dispensation of God's grace (Eph. 3:2) has its origin before the foundations of the world. \"just as He chose us in Him before the foundation of the world, that we would be holy and blameless before Him.\" Eph. 1:4. \n \n When Peter, John and James were baptized in water for the forgiveness of their sins (Mark 1:4) then they became members of the kingdom of God that exists within the envelope of time and space of this created realm (John 1:3). When we believe Paul's gospel and become 'sealed in Him' (Eph. 1:13), then through the power of God (Rom. 1:16) we are baptized into the body of Christ on the cross to participate in His death, burial and resurrection. That is how be came to be 'seated' in Christ (finished work). Eph. 2:4-7. But also, we became a member of the body of Christ which was chosen before the foundation of the world, in His Body at the right hand of God Almighty (John 1:2). That is the power of Paul's gospel over the gospel of the kingdom. \n \n Every member of the kingdom of God in this realm must pass through the heavenly version of the Temple (see Hebrews 8:1-7) from the outer court (water; physical realm, John 1:3), through the Holy Place (Realm of the Son; John 1:2) and into the Holy of Holies (Realm of the Almighty; John 1:1). That is why the members of the Kingdom are justified by works and not by faith alone (James 2:24). By contrast, our lives are hidden with Christ 'in' God already. Col. 3:3. Why? Because, we became members of His body the moment we believed and the Holy Spirit sealed us into His body. Eph. 1:13:14 (1Cor. 12:13). God has given us eternal life in His infinite realm as a free gift. Israel of the flesh shall have the same reward through betrothal (Hosea 2:19+20) and marriage to the Lamb (by works and not by faith alone; James 2:24). Rev. 19:5-10. \n \n Ron's second question << And how does it apply to the Lamb's Book of Life?\n \n Terral's reply << First off, Paul tells us that 'fellow workers' are added to the book of life. \"Indeed, true companion, I ask you also to help these women who have shared my struggle in {the cause of} the gospel, together with Clement also and the rest of my fellow workers, whose names are in the book of life.\" Phil. 4:3. Rather than grouping all of these souls together as having names in the book of life, my view is that Paul is speaking of only the last group, i.e., \"the rest of my fellow workers, whose names are in the book of life.\"\n \n Please pay careful attention to how Paul speaks of the two groups. \n \n \"As to all my affairs, Tychicus, {our} beloved brother and faithful servant and fellow bond-servant in the Lord, will bring you information. {For} I have sent him to you for this very purpose, that you may know about our circumstances and that he may encourage your hearts; and with him Onesimus, {our} faithful and beloved brother, who is ONE OF YOUR {number.} They will inform you about the whole situation here.\" Col. 4:7-9.\n \n Terral << Paul is saying that Onesimus is a member of the body of Christ (one of your number). That is a contrast to what comes next:\n \n Scripture << \"Aristarchus, my fellow prisoner, sends you his greetings; and {also} Barnabas's cousin Mark (about whom you received instructions; if he comes to you, welcome him); and {also} Jesus who is called Justus; these are the only FELLOW WORKERS for the KINGDOM OF GOD who are from the CIRCUMCISION, and they have proved to be an encouragement to me.\" Col. 4:10+11.\n \n Terral << These 'fellow workers' for the kingdom of God include people like Apollos. \"I planted, Apollos watered, but God was causing the growth.\" 1Cor. 3:6. \"For we are God's FELLOW WORKERS; you are God's field, God's building.\" 1Cor. 3:9. Note that Apollos was part of the Kingdom Administration. Please allow me to insert [vital points].\n \n \"Now a Jew named Apollos, an Alexandrian by birth, an eloquent man, came to Ephesus; and he was mighty in the Scriptures. This man had been instructed in the way of the Lord; and being fervent in spirit, he was speaking and teaching accurately the things concerning Jesus, being acquainted only with the baptism of John [first of three kingdom baptisms]; and he began to speak out boldly in the synagogue. But when Priscilla and Aquila heard him, they took him aside and explained to him the way of God more accurately (See Acts 19:1-6). And when he wanted to go across to Achaia, the brethren [members of the body of Christ] encouraged him and wrote to the disciples [members of the kingdom] to welcome him; and when he had arrived, he greatly helped those who had believed through grace [members of the body of Christ].\" Acts 18:24-27. This member of the Kingdom was assisting the members of the Galatian Church (Gal. 3:6-9).\n \n Paul continues in Colossians << \"Epaphras, who is ONE OF YOUR NUMBER [member of the body of Christ], a bondslave of Jesus Christ, sends you his greetings, always laboring earnestly for you in his prayers, that you may stand perfect and fully assured in all the will of God. For I testify for him that he has a deep concern for you and for those who are in Laodicea and Hierapolis. Luke [mentioned among the Gentile members of the body of Christ], the beloved physician, sends you his greetings, and {also} Demas. Col. 4:12-14.\n \n Those who have their names mentioned in the book of life are Kingdom Disciples. You and I have no reason to appear within that book. You have noticed that this is the 'Lamb's book of life.' We are already members of the Lamb Himself, being baptized into His body on the cross at Calvary. 1Cor. 12:13, Rom. 6:3+4, Gal. 3:27. Scripture records that the bride (Israel) shall become joined to Christ at the 'marriage supper of the Lamb.' Rev. 19:5-10. Why these references to the Lamb? And not simply the marriage of our Lord Jesus Christ? Our participation in that marriage supper is not as part of the bride. Those are precepts of doctrine pertaining to PROPHECY 'from the foundations of the world.' We were baptized into Christ according to Paul's gospel which is 'according to the revelation of the MYSTERY' (Rom. 16:25), the plan from 'before the foundations of the world,' and we are members of His body even now. \n \n God bless,\n \n Terral", 
   {
    "post_info": {
     "post_title": "From and Before"
    }, 
    "unicode_changes_made": true
   }, 
   51397, 
   null, 
   1086898620.0
  ], 
  [
   53511, 
   null, 
   "Big Orn", 
   "You have found evidence that there is a time that existed before the foundation of the world.\n\n Yes. And it is so hard to get anyone to talk about that first earth-age. It&#8217;s almost taboo around this part of the world.\n \n Good post and thanks for the reply.\n \n I will wait a little while longer before I post my thoughts.\n \n Next?\n \n BTW, Terral, did you get my PM?", 
   {}, 
   53499, 
   null, 
   1086909180.0
  ], 
  [
   55181, 
   null, 
   "Big Orn", 
   "Most of the time we are satisfied knowing that Genesis is the beginning of life for mankind. Most of the time we can be confident that the world as we know it is only about 10K years old. But, we are constantly finding evidence to the contrary &#8211; up to billions of years. That boggles the mind; it confuses those that are just starting to learn of God and His works. But, if we study the scriptures we find many passages that tell us about another age, another time, before time (2 Timothy 1:9 and Titus 1:2 &#8220;&#8230;before the world began&#8230; for example.\n Paul says that God promised eternal life long ages ago, which means His plan was made before the earth was formed. This doesn't mean 2,000 years ago, or even back to the beginning of man in Genesis. It is literally, \"before times eternal.\" Various Bible versions communicate:\n Different translations have their own wording, but it refers to the same thing. The NIV says \"before the beginning of time,\" the KJV and NLT say, \"before the world began.\" The ASV renders this most literally, saying, \"before times eternal.\"\n It wasn't just early in man's history that God promised eternal life. He promised it before times eternal - before the creation of man (as we know him) even happened.\n The Bible tells us that God chose us before the foundation of the world (Eph. 1:4). To Him, our salvation was a done deal before the world was even created. This is why Paul told Timothy that God...\n 2Tim. 1:9-10 ...has saved us and called us with a holy calling, not according to our works, but according to His own purpose and grace which was granted us in Christ Jesus before the world began, but now has been revealed by the appearing of our Savior Christ Jesus, who abolished death and brought life and immortality to light through the gospel. The only gospel &#8211; which in this BB you can see has different parts, but one complete message.\n Before time began, in eternity past...\n 1John 2:25 This is the promise which He Himself made to us: eternal life.\n Now, what happened to cause this promise?\n Lucifer (the devil, Angel of Darkness, etc.) was created by God to be the most perfect, most beautiful, angel of them all. In order for God to do this He had to create a being &#8220;almost&#8221; like himself.\n Ezekiel 28:12 &#8230;[Lucifer] was the seal of perfection, full of wisdom and perfect in beauty. He was in Eden, the garden of God; every precious stone was his covering&#8230;\n But Lucifer became too proud &#8211; he just knew he was &#8220;the man&#8221;. To his way of thinking, he was on the same level as God. He then began his dealings, his trafficking of himself &#8211; he began talking his game to the other angels, who then joined him &#8211; one-third (millions? Tens of millions?). God saw the profanity of his ways and cast him out of Heaven to earth (Luke 10:18 , Jesus says, &#8220;I beheld Satan as lightning fall from Heaven.&#8221;\n This made earth a pigsty, a dump, a garbage disposal: Genesis 1:2 And the earth became void and without form, and darkness (evil) was upon the face of the deep. This beautiful planet where once roamed large, graceful animals, vast forests of fruits and nuts, gigantic trees of foliage, deep, clear, blue oceans full of large fish and mammals &#8211; died. Gone were the pristine valleys through which ran pure streams and rivers into unspoiled, immaculate lakes and ponds. Lucifer turned the earth to ashes in one fell swoop.\n \n This is just a part of my understanding&#8230;more to come.", 
   {}, 
   53511, 
   null, 
   1088004840.0
  ], 
  [
   55742, 
   null, 
   "terral03", 
   "Greetings to Ron and All:\n \n Reading your post takes me back to my youth, and a time when the boundaries of my faith began to enlarge. Please allow me to add a little background content to your post.\n \n Ron << Most of the time we are satisfied knowing that Genesis is the beginning of life for mankind. Most of the time we can be confident that the world as we know it is only about 10K years old. But, we are constantly finding evidence to the contrary - up to billions of years. That boggles the mind; it confuses those that are just starting to learn of God and His works. \n \n Terral's reply << What does Scripture say? \"But do not let this one {fact} escape your notice, beloved, that with the Lord one day is like a thousand years, and a thousand years like one day.\" 2Pet. 3:8. The literal Greek in the Majority Text says, \"\"ws [as] xinia [a thousand] etn [years] kai [and] xinia [a thousand] etn [years] ws [as] nuepa [day] uia [one]. The Lockman scholars took the liberty of adding 'like' here to show what Peter is not saying. He is not saying that one day 'is' 1000 years, but that one day is 'as,' i.e., 'like' 1000 years. In other words, a day to God is as a thousand years, or even a much larger length of time. Therefore, a 'day' in Genesis 1 is one day to God, and a very long period to men. \n \n Ron << But, if we study the scriptures we find many passages that tell us about another age, another time, before time (2 Timothy 1:9 and Titus 1:2 \"...before the world began... for example.\n \n Terral's reply << If creation was called into being in John 1:3, then the two verses before that represent a time before our time. Paul says, \"He chose us in Him before the foundation of the world.\" Eph. 1:4. These verses of the Text are clues to a time before this realm was ever created. \n \n Ron << Paul says that God promised eternal life long ages ago, which means His plan was made before the earth was formed. This doesn't mean 2,000 years ago, or even back to the beginning of man in Genesis. It is literally, \"before times eternal.\" Various Bible versions communicate:\n \n Terral's reply << In situations like this, I like to consult the original manuscripts and translate directly from the Greek. Does the Textus Receptus and the Critical Text agree with the Majority Text? If so, then we continue. If not, then we must decide which of the forks in the road to take. Nelson's Greek/English Interlinear is a pretty good resource, IMHO.\n \n Ron << Different translations have their own wording, but it refers to the same thing. The NIV says \"before the beginning of time,\" the KJV and NLT say, \"before the world began.\" The ASV renders this most literally, saying, \"before times eternal.\"\n \n Terral's reply << Yes. The literal Greek from the Majority Text (i.e., the majority of the manuscripts) says in 2Tim. 1:9, \"npo [before] xpovwv [times] aiwviwv [eternal].\" \n \n Ron << It wasn't just early in man's history that God promised eternal life. He promised it before times eternal - before the creation of man (as we know him) even happened.\n \n Terral's reply << I think it important for us to realize that this time 'before times eternal' exists right now, today; as we speak. Our realm of time and space has a beginning and an end. The realm of the Almighty is beyond the boundaries of this physical universe, and He sees the beginning and end in the same instant; like a flash. Again, His realm is infinite, and this one is finite. He chose us 'in Christ' before the foundations of the world, because all of us are standing in His presence in His realm. Therefore our judgment takes only an instant in His realm, but our physical forms are contained within this finite creation for all these ages. Therefore, if any among us could actually see God's face through the veil separating these two realms [symbolized by the veil between the Holy Place and the Holy of Holies], then all we would see is His suspended stare, as if we were looking at a picture of God. \n \n Ron << The Bible tells us that God chose us before the foundation of the world (Eph. 1:4). To Him, our salvation was a done deal before the world was even created. This is why Paul told Timothy that God... 2Tim. 1:9-10 ...has saved us and called us with a holy calling, not according to our works, but according to His own purpose and grace which was granted us in Christ Jesus before the world began, but now has been revealed by the appearing of our Savior Christ Jesus, who abolished death and brought life and immortality to light through the gospel. \n \n Terral's reply << View the time of Genesis 1:1 as spanning billions of years, as Satan was a good guy for a very long time. There were no such things as angels or men during that time. Instead, our universe was filled with beings of a singular nature; a sort of man/angel imperishable hybrid [for lack of a better word] that never saw death. The beings of this realm were not created to die. But then, iniquity was found in Satan and the result of his fall is recorded in Genesis 1:2. The fall of Lucifer affected every atom of the entire created universe. \n \n The Genesis 1:1 universe had a heavens and earth that was the same thing. There was no sun and moon and planets like we have today. Everything was made out of light, and was a perfect expression of God, and that light filled the entire universe. The creation after Genesis 1:2 is a fallen creation, the reconstituted (divided dual nature, i.e., spirit/body, light/darkness, male/female, Jew/Gentile) configuration we have today. Then God had to send in the Light of Genesis 1:3 (John 1:4+5, 8+9, etc.) to bind it all together (Col 1:17 He is before all things, and in Him all things hold together.). Today, when we look into the heavens, we see small lights in a vast area of darkness. Later on, after the events of Rev. 21:1, the inhabitants of earth shall look up and see only light, like the days of Genesis 1:1. \n \n Ron << The only gospel - which in this BB you can see has different parts, but one complete message.\n \n Terral's reply << I understand that you currently hold the 'one gospel' view. Down the road you will come to realize that Christ came in water and in blood (1John 5:6). And that He came for members of His bride [John 3:29; Israel dominant through water (Mark 16:15+16, Acts 2:38); Kingdom Administration (Matt. 24:14) under Peter] and His body [Rom. 12:4+5; Gentile dominant through blood (Eph. 1:7); Grace Administration (Eph. 3:2) under Paul]. \n \n Once you realize that there are two distinct Administrations (households) being addressed by James (Kingdom Disciples under the Law; Matt. 5:17-19, James 2:10) and by Paul (Brethren under grace; Rom. 6:14), then the whole NT will make better sense. The fact that Christ sent Paul down to Jerusalem to submit the gospel he 'preached to Gentiles' (Gal. 2:2) to Peter, John and James should tell you something. After all, this happens twenty years after the crucifixion (time of Acts 15). If they were all preaching the same 'one gospel' then there would be no reason for Christ to send Paul in the first place. \n \n Ron. << Before time began, in eternity past . . . 1John 2:25 . . . (Luke 10:18 , Jesus says, \"I beheld Satan as lightning fall from Heaven.\"\n \n Terral's reply << Thank you for the very good post. The important thing to realize is that there is a 'gap' between the verses of Genesis 1:1 and 1:2. Satan was cast down during the period of that gap, and the darkness of verse 2 depicts the fallen creation. We also know that the gap exists, because of this: \"For thus says the LORD, who created the heavens (He is the God who formed the earth and made it, He established it {and} did not create it a waste place, {but} formed it to be inhabited), \"I am the LORD, and there is none else.\" Isa. 45:18. Then, each 'day' to God in Genesis 1 is one period of time to Him.\n \n God bless,\n \n Terral", 
   {
    "post_info": {
     "post_title": "Very Good"
    }, 
    "unicode_changes_made": true
   }, 
   55181, 
   null, 
   1088374200.0
  ], 
  [
   55932, 
   null, 
   "Big Orn", 
   "Thanks for your input, Terral.\n \n Now for the next installment:\n Why do we see &#8220;from&#8221; and &#8220;before&#8221; the foundation of the world spoken of in context with our salvation?\n \n Lucifer was sharp. He had all the tools needed to start his own heaven &#8211; so he thought. As I have said, however, he soon found out that he was not quite the god he thought he was. But, he was defiant. Even though the Bible does not say, I believe, through Bible study, that he whined about God&#8217;s power being so great and, during that whining process, he challenged God. He probably said, &#8220;So, one-third of the angels, You&#8217;re creation, followed me and I bet I could have gotten the rest had You not thrown me out!&#8221; To which God replied, &#8220;Then let&#8217;s see what would happen if a creation a little lower than the angels will follow you or Me? How about that?&#8221;\n The devil then jumped on it and agreed. So God reformed the earth, built it back up to its former beauty, but then created a place called Eden where He would put His new creation: MAN (Adam). This creation was not to be as the former humanoid (hominoid) that he created, but a man who He would form from the very earth itself. Since He would create this perfect Eden for mankind, then He would also allow Satan to dwell there to give them a level playing field, be on the same plane, so to speak. And He would give Adam the freedom of choice (volition), just as He gave Satan when he was created.\n \n In the center of Eden God placed a &#8220;tree&#8221;, which was a form of hierarchy, a physical conduit of the knowledge of good and evil. God commanded mankind not to reach for that status, for it would literally thrust them into death. Now the devil, being the liar that he is, told man that God was lying about the &#8220;tree&#8221; and convinced them to partake, which they did, unfortunately.\n This led to the next plan of action for God. Satan had taken away the good life from human beings, the abundant life given them by God. In order for mankind to take it back there had to be a man that was more powerful than Adam and Eve. This man had to understand the war that was raging in the spiritual world. He had to know the weaknesses of man.\n \n Enter &#8211; Jesus.\n God became flesh in order to take back that which Satan had stolen and we are still in process of doing just that. But, in doing so, we must become one with God, we must be Baptized in the Holy Spirit, crucifying the flesh daily. We must let go of the things that keep us bound to worldly things and step into the spiritual realm.----That&#8217;s getting off the subject a little, but was required to show why the statement &#8220;before the foundation of the world&#8221; is related to our salvation.\n \n How does this pertain to the Lamb&#8217;s Book of Life? Humans are born, just like any other warm-blooded creature, but has one distinct attribute of his own &#8211; the soul. The soul is not born, formed from ghostly DNA, it is sent directly from Heaven when we are conceived/formulate/derived from male/female copulation. In the Lamb&#8217;s Book of Life is written the name of all the souls sent to earth to inhabit human bodies. I know it is preached that we have to work our way into the Book, but that preaching is incorrect. We work to keep our names in that Book &#8211; that Book which was written &#8220;before the foundation of the world&#8221;.\n \n What happens to those whose names are blotted out of the Book of Life? They are thrown into the &#8220;lake of fire&#8221; or &#8220;hell&#8221; or out of the presence of God, where they die the final death and are gone.", 
   {}, 
   55742, 
   null, 
   1088464920.0
  ], 
  [
   58514, 
   null, 
   "terral03", 
   "Greetings to Ron and All:\n \n Ron asks << Why do we see \"from\" and \"before\" the foundation of the world spoken of in context with our salvation?\n \n Terral's reply << Having read your thoughts below, I believe the answer to this question is much easier than you suggest. Everything that God established 'from' the foundation of the world is part of Prophecy. Those things established 'before' the foundation of the world remained hidden, until the 'revelation of the mystery.' Rom. 16:25 (see 1Cor. 2:6-8). Your query is based upon the fact that you see only one good news message in the NT, when in actuality there are four. Only one of those gospel messages is according to the revelation of the mystery.\n \n When John the Baptist appeared to Israel at the Jordan River, he offered them the kingdom of OT Prophecy. Matt. 3:1-6. Christ came along and offered them the same thing. Matt. 4:17 (23). Then He sent the Twelve out to again offer Israel ONLY this same good news, \"The kingdom of heaven is at hand.\" Matt. 10:7. That is the gospel that was created 'from' the foundation of the world. \"Then the King will say to those on His right, 'Come, you who are blessed of My Father, inherit the kingdom prepared for you from the foundation of the world.\" Matt. 25:34.\n \n Paul's gospel ('my gospel' Rom. 2:16) is according to the 'revelation of the mystery,' \"which has been kept secret for long ages past, but now is manifested . . . \" Rom. 16:25+26. While the focus of the 'gospel of the kingdom' is the kingdom of heaven on earth, the subject of Paul's gospel is 'Christ crucified,' i.e., our redemption through His death, burial and resurrection. 1Cor. 15:1-4. It is through Paul's gospel that, \"He chose us in Him BEFORE the foundation of the world, that we would be holy and blameless before Him.\" Eph. 1:4. Do you know what that means? It means that we have been baptized into the body of Christ (Gal. 3:27) into a time that exists before time; before there was male and female, before the Satanic Rebellion, and before there was any such thing as sin. See Gal. 3:25-28. That is why there is no such thing as Gentile or Jew 'in' Christ. \n \n Ron << So God reformed the earth, built it back up to its former beauty, but then created a place called Eden where He would put His new creation: MAN (Adam). \n \n Terral's reply << We disagree here. Our current creation (Gen. 1:2 darkness; void state) exists in a broken form that is nothing like the Genesis 1:1 creation. The pre-fall creation existed without death and suffering of any kind at all. The current stars and planets were not part of that creation, as everything was made out of a kind of light that is not present in this fallen universe. The wave/particle (186,000 mps) light form we have today is a mere shadow of the light/life essence of the perfect creation of Genesis 1:1. Beings of that perfect creation could travel from one end of the universe to the other in no time at all. The limitations of this current universe are based upon its broken condition. \n \n The planets are part of this reconstituted creation that now has carbon based life forms that require oxygen/air sustainable environments. It is within this fallen creation that the Lord God created Adam and the perfect Eden, which was fashioned in the likeness of the pre-fall Gen. 1:1 perfect realm. That perfect environment joined the realms of the heavens and the earth, as the place where the two seas meet. Remember that men today are born into the image of fallen Adam, which is the image of the fallen universe itself, which was subjected to futility. As it is written, \n \n \"For the anxious longing of the creation waits eagerly for the revealing of the sons of God. For the creation was subjected to futility, not willingly, but because of Him who subjected it, in hope that the creation itself also will be set free from its slavery to corruption into the freedom of the glory of the children of God.\" Rom. 8:19-21. \n \n The new heavens and the new earth (Rev. 21:1) shall be formed in the likeness of the pre-fall Gen. 1:1 creation. And then, \"That which has been is that which will be, and that which has been done is that which will be done.\" Ecc. 1:9.\n \n Ron wrote << In the center of Eden God placed a \"tree\", which was a form of hierarchy, a physical conduit of the knowledge of good and evil. \n \n Terral's reply << Adam was to be rule over creation forever from the newly fashioned Eden environment that joined both the heavens and earth. The reconciliation process that shall be completed through Christ (Col. 1:20), was to take place through this perfect Adam. The fall of Adam left Satan as 'the prince of the power of the air.' Eph. 2:2. Remember that God sends the deluding influence (Satan) to serve His purposes. 2Thes. 2:10-12 (10). Satan is the 'anointed cherub who covers.' Eze. 28:14. In the perfect realm of Genesis 1:1, all beings were created knowing all things. Therefore, the job of these select cherubs was to cover those things which God (or Adam as ruler of this realm) wished to hide from anyone. The \"tree was good for food, and that it was a delight to the eyes, and that the tree was desirable to make {one} wise.\" Gen. 3:6. \n \n Satan was a tool to be used, but not to be taken internally. This is why God did not want Adam to taste of this fruit. Gen. 2:17. Pre-fall Adam existed in the singularity form of pre-fall Genesis 1:1, which we have little ability to comprehend today. He had no concept of good or evil. Everything simply existed. Can we imagine how a woman can be taken out of a man? No. And yet, that is what our Bible says. Anyway, the 'kingdom of heaven' could not come to this realm through Adam, as he was subjected to futility in the same way as creation. Everything that Adam could not do, the Second Adam is doing by the will of God.\n \n Ron << God commanded mankind not to reach for that status, for it would literally thrust them into death. Now the devil, being the liar that he is, told man that God was lying about the \"tree\" and convinced them to partake, which they did, unfortunately.\n \n Terral's reply << Not exactly. Paul writes, \"And {it was} not Adam {who} was deceived, but the woman being deceived, fell into transgression.\" 1Tim. 2:14.\n \n Ron << God became flesh in order to take back that which Satan had stolen and we are still in process of doing just that. \n \n Terral's reply << That which was stolen from creation is the same 'glory' of the Father that Christ shared with Him \"before the world was.\" John 17:5. That is the glory that creation seeks. Rom. 8:18-21. And thus, Christ is called the \"Lord of Glory.\" 1Cor. 2:8. There is a mystery here relating to how we should pray. Man is to pray with head uncovered, and women pray with head covered. This pertains to the glory of God, image and authority. \"For a man ought not to have his head covered, since he is the image and glory of God; but the woman is the glory of man.\" 1Cor. 11:7. The reason is that man represents the spirit part, and woman the body part. And the two are one flesh. Therefore, the man prays in the likeness of the angels (without body/unclothed). Thus it is written, \"Therefore the woman ought to have {a symbol of} authority on her head, because of the angels.\" 1Cor. 11:10.\n \n Ron << But, in doing so, we must become one with God, we must be Baptized in the Holy Spirit, crucifying the flesh daily. \n \n Terral's reply << We are not baptized 'in' the Holy Spirit like members of the Kingdom Dispensation. We are baptized 'by' the Holy Spirit 'into' the body of Christ. 1Cor. 12:13. This is how we become active participants in His death, burial and resurrection (Rom. 6:3+4) to become 'clothed with Christ.' Gal. 3:26. Denying the flesh and building up the new spirit nature within us is definitely part of the Christian life. Gal. 5:16-26. Your spirit is to become the head of the flesh in the same way that the man is head of the woman. The body is to become subject to the spirit.\n \n Ron << We must let go of the things that keep us bound to worldly things and step into the spiritual realm.----That's getting off the subject a little, but was required to show why the statement \"before the foundation of the world\" is related to our salvation.\n \n Terral's reply << Not at all. Although, as stated, the answer seems to be a bit more simple than you describe.\n \n Ron << How does this pertain to the Lamb's Book of Life? Humans are born, just like any other warm-blooded creature, but has one distinct attribute of his own - the soul. The soul is not born, formed from ghostly DNA, it is sent directly from Heaven when we are conceived/formulate/derived from male/female copulation. \n \n Terral's reply << Perhaps you are absolutely correct, but my view differs a bit. The breath of life (spirit) is that which is from God. Our physical makeup is the inherited traits from our parents (dust of the ground). Then we 'become a living soul' in the process. In other words, our soul is the place where the spirit and body overlap. And this is the seat of our consciousness. All consciousness is the result of the overlapping/joining/marriage of spirit and a physical body that the spirit utilizes as a vehicle of expression. Demonic possession is a detached spirit's attempt at becoming conscious. And whether people are believers or unbelievers, that consciousness is Christ. \n \n When we place ourselves into the position of obedience (hearing; Rom. 10:17) to the gospel (i.e., the good news pertaining to the death, burial and resurrection of Jesus Christ) then we are baptized into Christ, and into that which has been reconciled from the heavens and the earth already. In the same way that we have three parts of spirit, body and soul, creation has three parts of heavens, earth and heaven. This is in the image of the Father (spirit), Son (blood) and Holy Spirit (water/body). 1John 5:8. Being part of the Lamb's book of life is being baptized into the body of the Lamb Himself. \n \n Ron << In the Lamb's Book of Life is written the name of all the souls sent to earth to inhabit human bodies. I know it is preached that we have to work our way into the Book, but that preaching is incorrect. We work to keep our names in that Book - that Book which was written \"before the foundation of the world\".\n \n Terral's reply << No sir. We disagree. Truly, truly I have good news for you. What does Scripture say? \"Therefore if you have been raised up with Christ, keep seeking the things above, where Christ is, seated at the right hand of God. Set your mind on the things above, not on the things that are on earth. For you have died and your life is hidden with Christ in God. When Christ, who is our life, is revealed, then you also will be revealed with Him in glory.\" Col. 3:1-4.\n \n A member of the body of Christ means being saved now and forever. It is not that we reached up to grasp His hand, but He reached down to take ours. \"Who will separate us from the love of Christ? Will tribulation, or distress, or persecution, or famine, or nakedness, or peril, or sword?\" Rom. 8:35. No sir. Nothing can remove us from the glory He has given us through Christ. We have been \"sealed for the day of redemption.\" Eph. 4:30. You are confusing the gift of God through Paul's gospel with the New Covenant for the bride of Christ. They shall be joined with us 'in' Christ after the marriage supper of the Lamb. Rev. 19:5-10. We are members of His body already. 1Cor. 12:27.\n \n Ron << What happens to those whose names are blotted out of the Book of Life? They are thrown into the \"lake of fire\" or \"hell\" or out of the presence of God, where they die the final death and are gone.\n \n Terral's reply << We are to judge the world and the angels. 1Cor. 6:2+3. And we are part of the judgment process that occurs in Rev. 20:11-15. People today fail to realize just how lucky we are to have the opportunity to accept Paul's gospel. Scripture says, \"But God, being rich in mercy, because of His great love with which He loved us, even when we were dead in our transgressions, made us alive together with Christ (by grace you have been saved), and raised us up with Him, and seated us with Him in the heavenly {places} in Christ Jesus, so that in the AGES TO COME He might show the surpassing riches of His grace in kindness toward us in Christ Jesus.\" Eph. 2:4-7. God is teaching the rulers and the authorities in the heavenly the lessons about the power of His grace (Eph. 3:1-11 (10). \n \n Did you catch the key phrase there? \"seated us with Him.\" Seated is finished product. We cannot add to what God has already finished and hidden in Himself in Christ.\n \n God bless,\n \n Terral", 
   {
    "post_info": {
     "post_title": "It Is Finished"
    }, 
    "unicode_changes_made": true
   }, 
   55932, 
   null, 
   1090018440.0
  ], 
  [
   59226, 
   null, 
   "Big Orn", 
   "Ron << So God reformed the earth, built it back up to its former beauty, but then created a place called Eden where He would put His new creation: MAN (Adam). \n \n Terral&#8217;s reply << We disagree here. Our current creation (Gen. 1:2 darkness; void state) exists in a broken form that is nothing like the Genesis 1:1 creation. The pre-fall creation existed without death and suffering of any kind at all. The current stars and planets were not part of that creation, as everything was made out of a kind of light that is not present in this fallen universe. The wave/particle (186,000 mps) light form we have today is a mere shadow of the light/life essence of the perfect creation of Genesis 1:1. Beings of that perfect creation could travel from one end of the universe to the other in no time at all. The limitations of this current universe are based upon its broken condition.\n\n I realize that. I was referring to perfection as it relates to man. If we remove the physical portion, how the earth was at the time of Eden, it voids my topic&#8230;or at least takes away its full function.\n \nRon wrote << In the center of Eden God placed a &#8220;tree&#8221;, which was a form of hierarchy, a physical conduit of the knowledge of good and evil. \n \n Terral&#8217;s reply << Adam was to be rule over creation forever from the newly fashioned Eden environment that joined both the heavens and earth. The reconciliation process that shall be completed through Christ (Col. 1:20), was to take place through this perfect Adam. The fall of Adam left Satan as &#8216;the prince of the power of the air.&#8217; Eph. 2:2. Remember that God sends the deluding influence (Satan) to serve His purposes. 2Thes. 2:10-12 (10). Satan is the &#8216;anointed cherub who covers.&#8217; Eze. 28:14. In the perfect realm of Genesis 1:1, all beings were created knowing all things. Therefore, the job of these select cherubs was to cover those things which God (or Adam as ruler of this realm) wished to hide from anyone. The &#8220;tree was good for food, and that it was a delight to the eyes, and that the tree was desirable to make {one} wise.&#8221; Gen. 3:6. \n \n Satan was a tool to be used, but not to be taken internally. This is why God did not want Adam to taste of this fruit. Gen. 2:17. Pre-fall Adam existed in the singularity form of pre-fall Genesis 1:1, which we have little ability to comprehend today. He had no concept of good or evil. Everything simply existed. Can we imagine how a woman can be taken out of a man? No. And yet, that is what our Bible says. Anyway, the &#8216;kingdom of heaven&#8217; could not come to this realm through Adam, as he was subjected to futility in the same way as creation. Everything that Adam could not do, the Second Adam is doing by the will of God.\n\n Good point. Well said.\n \nRon << God commanded mankind not to reach for that status, for it would literally thrust them into death. Now the devil, being the liar that he is, told man that God was lying about the &#8220;tree&#8221; and convinced them to partake, which they did, unfortunately.\n \n Terral&#8217;s reply << Not exactly. Paul writes, &#8220;And {it was} not Adam {who} was deceived, but the woman being deceived, fell into transgression.&#8221; 1Tim. 2:14.\n\n It was mankind &#8211; both are to blame, both chose Evil over Good. If a person looks closely at that passage, Satan is one &#8220;tree&#8221; and Christ is the other. Both partook, even though Eve was the first.\n \nRon << In the Lamb&#8217;s Book of Life is written the name of all the souls sent to earth to inhabit human bodies. I know it is preached that we have to work our way into the Book, but that preaching is incorrect. We work to keep our names in that Book &#8211; that Book which was written &#8220;before the foundation of the world&#8221;.\n \n Terral&#8217;s reply << No sir. We disagree. Truly, truly I have good news for you. What does Scripture say? &#8220;Therefore if you have been raised up with Christ, keep seeking the things above, where Christ is, seated at the right hand of God. Set your mind on the things above, not on the things that are on earth. For you have died and your life is hidden with Christ in God. When Christ, who is our life, is revealed, then you also will be revealed with Him in glory.&#8221; Col. 3:1-4.\n \n A member of the body of Christ means being saved now and forever. It is not that we reached up to grasp His hand, but He reached down to take ours. &#8220;Who will separate us from the love of Christ? Will tribulation, or distress, or persecution, or famine, or nakedness, or peril, or sword?&#8221; Rom. 8:35. No sir. Nothing can remove us from the glory He has given us through Christ. We have been &#8220;sealed for the day of redemption.&#8221; Eph. 4:30. You are confusing the gift of God through Paul&#8217;s gospel with the New Covenant for the bride of Christ. They shall be joined with us &#8216;in&#8217; Christ after the marriage supper of the Lamb. Rev. 19:5-10. We are members of His body already. 1Cor. 12:27.\n\n The Book of Life contains the names of those who have a choice this time either to choose good or evil. If they choose evil, their names are blotted out. That&#8217;s what I was referring to. Other than that I agree. Once we are sealed, we are sealed. But, remember: God allows us to make that choice. (I use &#8220;us&#8221; referring to mankind in general) Before some people are born, God hates them due to them siding with Lucifer during the War. (Read Romans chapter 9)\n \nRomans chapter 9\n Verse 8 &#8211; That is, those who are the children of the flesh, these are not the children of God; but the children of the promise are counted as seed.\n Verse 11 &#8211; (for the children not yet being born, nor having done any good or evil, the purpose of God according to election might stand, not of works but of Him who calls),\n Verse 12 &#8211; it was said to her (Sarah), &#8220;The older shall serve the younger.&#8221;\n Verse 13 &#8211; As it is written, &#8220;Jacob I have loved, but Esau I have hated.&#8221; (Malachi 1: 2 and 3)\n\n \n God hates those that tried to &#8220;murder&#8221; Him in the War. To those He will show no mercy; they have already made their decision.", 
   {}, 
   58514, 
   null, 
   1090454460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Foundation of the World", 
  "url": "http://www.4forums.com/political/religion-debates/2450-foundation-world.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 2450, 
  "discussion_files": [
   [
    "22392.html", 
    "http://www.4forums.com/political/religion-debates/2450-foundation-world-print.html"
   ]
  ], 
  "identifier": 2450
 }
]