[
 [
  [
   51482, 
   null, 
   "Ender Wiggin", 
   "I have great news, it's ok to be a SF (SciFi) junkie. You can enjoy thrilling SF novels, while still being cool! Now that that's cleared up, you should read the best SF novel, no, the best novel ever Ender's Game. It was writen, by the literary genius Orson Scott Card (a god among authors). Card also wrote six other books in the same series, Speaker for the Dead, Xinocide, Children of the Mind, Ender's Shadow, Shadow of the Hegemon and , Shadow Puppets. All of them wnoderfull books, but Ender's Game is the first, and best. There must be someone here, who shares my respect for Card, and his books. Hey, if your interested, Warner Brothers is in the process of making a film, based on Ender's Game and, Ender's Shadow.", 
   {
    "post_info": {
     "post_title": "Is The Ender Saga The Best SF Series Ever?"
    }
   }, 
   null, 
   null, 
   1085112000.0
  ], 
  [
   51488, 
   null, 
   "Sigma", 
   "I have great news, it's ok to be a SF (SciFi) junkie. You can enjoy thrilling SF novels, while still being cool! Now that that's cleared up, you should read the best SF novel, no, the best novel ever Ender's Game. It was writen, by the literary genius Orson Scott Card (a god among authors). Card also wrote six other books in the same series, Speaker for the Dead, Xinocide, Children of the Mind, Ender's Shadow, Shadow of the Hegemon and , Shadow Puppets. All of them wnoderfull books, but Ender's Game is the first, and best. There must be someone here, who shares my respect for Card, and his books. Hey, if your interested, Warner Brothers is in the process of making a film, based on Ender's Game and, Ender's Shadow.\n\n \n I enjoyed Ender's Game a lot, and read most of the others. What is the movie? I would be very interested in something like that.", 
   {}, 
   51482, 
   null, 
   1085113980.0
  ], 
  [
   51491, 
   null, 
   "Ender Wiggin", 
   "Ender's Movie \n \n Go there for info' it'll be da bomb", 
   {}, 
   51488, 
   null, 
   1085118120.0
  ], 
  [
   51526, 
   null, 
   "AMD4EVER", 
   "I actually just finished reading Enders Game for the second time a few days ago. The book is good but I don't think it is the best ever even though I only have one other SF series to compare it to. The Alpha Centauri series to me was better than the Enders series although that was helped along by the fact that it was based on a game that I was also interested in. Quite a unique concept. I suppose the problem with Enders Game is that I couldn't buy into the fact that they really needed Ender in the first place.\n \n *Spoilers*\n \n OK so they know all the queens are on the homeplanet. They know they only have to get off one shot against the home planet in order to destroy it and that would end the war. Holy cow, big deal. So how is it that they didn't decide to just focus all their forces against the home planet right away when the buggers were stupid and built tight formations with their ships?", 
   {}, 
   51491, 
   null, 
   1085147820.0
  ], 
  [
   51711, 
   null, 
   "Ender Wiggin", 
   "Originally Posted by AMD4EVER\n I actually just finished reading Enders Game for the second time a few days ago.\n \n \n A wise choice it was, to read Ender's Game. But what's this I hear, about \"they didn't realy need Ender\". C'mon of ofcourse they did, he was a super genius. Have you read Ender's Shadow? If not, I would recomend it, it's kind of Bean's book.", 
   {}, 
   51526, 
   null, 
   1085202600.0
  ], 
  [
   51721, 
   null, 
   "The_talkin_Void", 
   "Wha Wha Wha? I think enderwiggin is confused by his own question. The question you have asked was about the BEST SCI-FI SERIES EVER not the newest fad in SF summer readings. You are soluting the toenail clippings of the king. Who is the king you ask? I tell you, it is THE JOURNAL OF THE WHILLS \n \n Interesting name, is it not? That's what Star Wars was originally, way-the-heck-back-before-Fox, rough-draft called.This book has the scripts for all three original trilogy movies, as well as comments from George Lucus and others about the making of the movies and the writing of the stories. There's stuff in there like the various drafts of each story (the very first story, in Journal of the Whills, was about a guy named Mace Windy. Sound fimil? Anakin was originally Annikin, Luke was 72 year-old general in it and Coruscant's original name was Hal Abaddon. \n \n The beginning of the Sci-Fi craze didn't start on \"Hal Abaddon\" though there were many other movies, books and TV shows but the REVOLUTION of Sci-Fi started with STAR WARS VI: A NEW HOPE.", 
   {}, 
   51711, 
   null, 
   1085208540.0
  ], 
  [
   51758, 
   null, 
   "AMD4EVER", 
   "[/I] \n \n A wise choice it was, to read Ender's Game. But what's this I hear, about \"they didn't realy need Ender\". C'mon of ofcourse they did, he was a super genius. Have you read Ender's Shadow? If not, I would recomend it, it's kind of Bean's book.\n\n \n No I didn't read Ender's Shadow and no I won't read it. I realize that the first book of the series is good but it still has such massive flaws in it that it would just frustrate me to read into it further. Ender was a super genius but it shouldn't take a super genius to perform the task of destroying the buggers. It was a simple task that was made difficult in order to create a story.", 
   {}, 
   51711, 
   null, 
   1085235480.0
  ], 
  [
   51781, 
   null, 
   "Ender Wiggin", 
   "Originally Posted by AMD4EVER\n No I didn't read Ender's Shadow and no I won't read it. I realize that the first book of the series is good but it still has such massive flaws in it that it would just frustrate me to read into it further. Ender was a super genius but it shouldn't take a super genius to perform the task of destroying the buggers. It was a simple task that was made difficult in order to create a story. \n\n \n Ok, asking questions like, what's the best SF series, is simply saying state your opinion. So you don't like Enders Game, that's fine, but it doesn't make the book any better, or worse. And by the way, they already had the plan to destroy the Bugers home world, before Ender was ever born. They just needed his quick thinking and supurb leadership, he didn't come up with the plan. But I'm wondering why, (if you hated the book) read it twice? \n \n \nOriginally Posted by The_talkin_Void\n Wha Wha Wha? I think enderwiggin is confused by his own question. The question you have asked was about the BEST SCI-FI SERIES EVER not the newest fad in SF summer readings. You are soluting the toenail clippings of the king. Who is the king you ask? I tell you, it is THE JOURNAL OF THE WHILLS \n \n \n Thank you for proving My point. You see The_talkin_Void, is clearly bios towards Star Wars. So what did he do? He states his opinion. I don't like SW as much as Ender's Saga, but that doesn't mean iether are any worse. It's all just a matter of opinion.", 
   {}, 
   51758, 
   null, 
   1085246340.0
  ], 
  [
   51825, 
   null, 
   "AMD4EVER", 
   "Ok, asking questions like, what's the best SF series, is simply saying state your opinion. So you don't like Enders Game, that's fine, but it doesn't make the book any better, or worse. And by the way, they already had the plan to destroy the Bugers home world, before Ender was ever born. They just needed his quick thinking and supurb leadership, he didn't come up with the plan. But I'm wondering why, (if you hated the book) read it twice?\n\n \n Where did I ever say I hated the book? It was a good book but it certainly isn't the best Sci-Fi ever. It is good in almost every aspect except for that one gaping hole in the plot. The whole thing should never have even taken place as there was no reason for a quick thinking and superb leader. An idiot could have taken command of the fleet and known to run all their fighters straight towards the only place that really mattered and just get one plane close enough to destroy the whole bugger race. The buggers were so stupid at first that they just stuck all their ships together to conveniently get destroyed all at once. Just think of how successful just one ship could be in attacking the bugger homeworld. Even more so, think of how successful it would have been to launch hundreds of missiles at high speeds, each carrying a Dr. Device at the planet and watch the futile attempts of the buggers to stop each one. You would virtually be assured that no humans would die and you wouldn't even need to plan anything out in order to succeed. Now think of also blacking out those missiles like they blacked out the planet. Launch them from Earth or space and forget about it. The fleet stays home to protect Earth from possible invasion, which strangly in the book was left completely defenseless, and the buggers have no chance of preventing their demise. Now that is the perfect plan. No loss of life, way less risk to Earth, and more cost effective. But of course had they used this tactic there would be no story.", 
   {}, 
   51781, 
   null, 
   1085272440.0
  ], 
  [
   52064, 
   null, 
   "Ender Wiggin", 
   "Originally Posted by AMD4EVER\n Where did I ever say I hated the book? It was a good book but it certainly isn't the best Sci-Fi ever. It is good in almost every aspect except for that one gaping hole in the plot. The whole thing should never have even taken place as there was no reason for a quick thinking and superb leader. An idiot could have taken command of the fleet and known to run all their fighters straight towards the only place that really mattered and just get one plane close enough to destroy the whole bugger race. The buggers were so stupid at first that they just stuck all their ships together to conveniently get destroyed all at once. Just think of how successful just one ship could be in attacking the bugger homeworld. Even more so, think of how successful it would have been to launch hundreds of missiles at high speeds, each carrying a Dr. Device at the planet and watch the futile attempts of the buggers to stop each one. You would virtually be assured that no humans would die and you wouldn't even need to plan anything out in order to succeed. Now think of also blacking out those missiles like they blacked out the planet. Launch them from Earth or space and forget about it. The fleet stays home to protect Earth from possible invasion, which strangly in the book was left completely defenseless, and the buggers have no chance of preventing their demise. Now that is the perfect plan. No loss of life, way less risk to Earth, and more cost effective. But of course had they used this tactic there would be no story.\n\n \n Whatever dude, whatever.", 
   {}, 
   51825, 
   null, 
   1085460240.0
  ], 
  [
   52065, 
   null, 
   "SilentPoet", 
   "Now that that's cleared up, you should read the best SF novel, no, the best novel ever Ender's Game. It was writen, by the literary genius Orson Scott Card (a god among authors). \n \n \n I read Enders game and I must say it was worth reading.\n But really it doesn't deserve such a title.", 
   {}, 
   52064, 
   null, 
   1085465400.0
  ], 
  [
   52477, 
   null, 
   "Ender Wiggin", 
   "Originally Posted by SilentPoet\n I read Enders game and I must say it was worth reading.\n\n \n Well, \"Always Stay Open Minded.\" emoticon_smile \n P.S. Thank you verry much, for simply speaking your opinion.", 
   {}, 
   52065, 
   null, 
   1085797860.0
  ], 
  [
   215834, 
   null, 
   "joeygray", 
   "The real plot hole in Ender's Game is: why were all the queens on the bugger home world? It says quite clearly that they sent a queen to colonize the earth, why hadn't they sent a bazillion other queens out to other worlds long since. Even if they hadn't, they sent the hive queen out in her cocoon to another world, why not a bunch of full grown ones with a zillion buggers to go with? That's the real hole and no possible explanation for it.", 
   {
    "post_info": {
     "post_title": "the real plot hole"
    }
   }, 
   52477, 
   null, 
   1149797640.0
  ], 
  [
   215883, 
   null, 
   "Inyx", 
   "I read Ender's game an d the xenocide series. They are very good sci-fi. But I read Frank Herbert's Dune series as well, and in my opinion they still hold the first place on my list.", 
   {}, 
   215834, 
   null, 
   1149807420.0
  ], 
  [
   218237, 
   null, 
   "DrNo", 
   "I read Ender's Game and I thought it was a cool book. My favorite sci-fi series is the Incarnations of Immortality by Piers Anthony. Great stories with memorable characters and really thought provoking writing. The first book in the series is titled On A Pale Horse and is about a guy who becomes Death and has to collect people's souls as they die. How could that not be cool?", 
   {}, 
   215883, 
   null, 
   1150917600.0
  ], 
  [
   218255, 
   null, 
   "nooneknows666", 
   "i dunno what this stuff is. anyone wanna fill me in?", 
   {}, 
   218237, 
   null, 
   1150922760.0
  ], 
  [
   228475, 
   null, 
   "Aivlis", 
   "Ender's game best ever SF. END OF STORY", 
   {}, 
   218255, 
   null, 
   1156285500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is The Ender Saga The Best SF Series Ever?", 
  "url": "http://www.4forums.com/political/fun-debates/2452-ender-saga-best-sf-series-ever.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 2452, 
  "discussion_files": [
   [
    "24555.html", 
    "http://www.4forums.com/political/fun-debates/2452-ender-saga-best-sf-series-ever-print.html"
   ], 
   [
    "24556.html", 
    "http://www.4forums.com/political/fun-debates/2452-ender-saga-best-sf-series-ever-2-print.html"
   ]
  ], 
  "identifier": 2452
 }
]