[
 [
  [
   52389, 
   null, 
   "jim's trucking", 
   "Nichols Is Found Guilty in Oklahoma Bombing\n By MONICA DAVEY\n \n Published: May 27, 2004\n \n http://www.nytimes.com/2004/05/27/national/27nichols.html?th\n \n \n cALESTER, Okla., May 26 - Nine years after a homemade bomb ripped through the federal building in Oklahoma City, Terry L. Nichols was convicted on Wednesday of 161 counts of first-degree murder in the blast, and a state jury has to decide whether he should be executed. \n \n Mr. Nichols, 49, was already serving a life term for federal charges of conspiracy and involuntary manslaughter in connection to the bombing. Yet his level of involvement in the explosion that killed 168 people has long been a matter of debate.\n \n At his federal trial in Denver seven years ago, the jurors rejected the most serious charges of premeditated murder against him. But the swift verdict here placed Mr. Nichols firmly at the heart of the plot, beside Timothy J. McVeigh, an old Army friend of Mr. Nichols who was executed in 2001.\n \n I think Mr. Nichols should follow in his friend's footsteps, right into the dirt nap room. ", 
   {
    "post_info": {
     "post_title": "Should he die?"
    }
   }, 
   null, 
   null, 
   1085697360.0
  ], 
  [
   52391, 
   null, 
   "Big Orn", 
   "To echo Anastasia on another post:\n \n Let him rot in jail and contemplate catching the Midnight Express.\n \n But, if he gets the VIP treatment, then all bets are off.\n \n Put him down like the sick dog he is.", 
   {}, 
   52389, 
   null, 
   1085698080.0
  ], 
  [
   52470, 
   null, 
   "billsco", 
   "Let's see, nine years ago...that would make him 40 years old. That's about the age I lost the last of my young man's idealism for good. Timothy McVeigh was younger still, I believe. These two guys never had an original thought I bet. They sat around the kitchen tables of older, \"wiser\" men and absorbed the hate-filled rhetoric they heard. They mistakenly thought they were acting in the purest morality, bravely putting to action what others only would rant about. \n \n I was in Oklahoma the day McVeigh died. The state stopped and listened to the live radio feed from Terre Haute, IN, describing in great detail his expressions and demeanor, and finally his face in death. I really don't know what most Sooners thought about it, but I wished he could have become an old man, pressing his face against the bars on a nice spring day, or watching the events of 9/11 unfold, and with each passing year reflecting on the stupidity of his youth.\n \n I wish the same for Nichols, and in his old age, he tells authorities the full story so that all the others who were involved can be brought to justice.", 
   {}, 
   52391, 
   null, 
   1085782800.0
  ], 
  [
   53075, 
   null, 
   "jim's trucking", 
   "Let's see, nine years ago...that would make him 40 years old. That's about the age I lost the last of my young man's idealism for good. Timothy McVeigh was younger still, I believe. These two guys never had an original thought I bet. They sat around the kitchen tables of older, \"wiser\" men and absorbed the hate-filled rhetoric they heard. They mistakenly thought they were acting in the purest morality, bravely putting to action what others only would rant about. \n \n I was in Oklahoma the day McVeigh died. The state stopped and listened to the live radio feed from Terre Haute, IN, describing in great detail his expressions and demeanor, and finally his face in death. I really don't know what most Sooners thought about it, but I wished he could have become an old man, pressing his face against the bars on a nice spring day, or watching the events of 9/11 unfold, and with each passing year reflecting on the stupidity of his youth.\n \n I wish the same for Nichols, and in his old age, he tells authorities the full story so that all the others who were involved can be brought to justice.\n\n \n Why should we pay 50-75 thousand a year to keep them alive? Why are we so nice to criminals? Why are we afraid to hurt someone who BLEW UP our children?\n \n Get out the axe!", 
   {}, 
   52470, 
   null, 
   1086458880.0
  ], 
  [
   53088, 
   null, 
   "georged", 
   "To me it's no different than Manson or some of the others we've refused to cull from society. I don't really care if they had a bad childhood, bad teen years, were in something over their head or just plain dumb. He intentionally took another life with no remorse, so put him down. Public executions should be reinstated as a useful deterrent. Parents used to take their children to hangings to view the alternative to becoming a useful citizen. Pay per view TV would offset a lot of our prison expenses.", 
   {}, 
   53075, 
   null, 
   1086464220.0
  ], 
  [
   53311, 
   null, 
   "jitobear", 
   "I don't care about his life. But I don't want my government to have the power of execution.", 
   {}, 
   53088, 
   null, 
   1086723780.0
  ], 
  [
   53315, 
   null, 
   "emclean", 
   "He would not be fit to return to sciocity, IMO it would be more humane to kill him.", 
   {}, 
   53311, 
   null, 
   1086724260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Should he die?", 
  "url": "http://www.4forums.com/political/news-forum/2486-should-he-die.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 2486, 
  "discussion_files": [
   [
    "17515.html", 
    "http://www.4forums.com/political/news-forum/2486-should-he-die-print.html"
   ]
  ], 
  "identifier": 2486
 }
]