[
 [
  [
   52839, 
   null, 
   "unkerpaulie", 
   "now before yall get any ideas, im not saying abortion is wrong, or murder is ok, or anything like that, but it would be interesting to hear some views on this, as long as people remain honest\n \n i think most will agree that the most popular reason women have abortion is because they simply dont want to raise the child. it may not be the most politically correct or the most ethically noble, but it certainly is by far the most common. this is also the same reason why people use contraceptives.\n \n what if you realise after the child is born that you dont want to raise the child? is it more wrong to kill the child then? some people come up with different ways of freeing themselves from parenthood after the child is born, such as abandonment and offering up for adoption. is this less or more wrong than abortion?\n \n if the main reason for not having children is because you dont want to parent them, then does the age of the child make killing it more right if the motive is the same?", 
   {
    "post_info": {
     "post_title": "is it wrong to kill your children?"
    }
   }, 
   null, 
   null, 
   1086211680.0
  ], 
  [
   52877, 
   null, 
   "Sigma", 
   "Legally, once a child is born in America, it is entitled to rights under the constitution. Therefore it is illegal to kill a child once it is born. I believe it's that same point that a child becomes a citizen.\n \n Morals differ from people to people and culture to culture, so there's not a way to say that it is uniformly \"wrong\". To a person who is considering it, it is, in some way, \"right\".", 
   {}, 
   52839, 
   null, 
   1086240900.0
  ], 
  [
   52890, 
   null, 
   "unkerpaulie", 
   "Legally, once a child is born in America, it is entitled to rights under the constitution. Therefore it is illegal to kill a child once it is born. I believe it's that same point that a child becomes a citizen.\n \n Morals differ from people to people and culture to culture, so there's not a way to say that it is uniformly \"wrong\". To a person who is considering it, it is, in some way, \"right\".\n\n good point. in fact, morals really have nothing to do with it, its more a question of whats legally permissable than whats ethically right. i agree", 
   {}, 
   52877, 
   null, 
   1086277500.0
  ], 
  [
   52892, 
   null, 
   "Big Orn", 
   "good point. in fact, morals really have nothing to do with it, its more a question of whats legally permissable than whats ethically right. i agree\n\n In the USA the propensity of things are gaining ground in favor of &#8220;Do what you feel like doing.&#8221; If there&#8217;s a law against it, and it doesn&#8217;t feel right, then it can be changed until it does. If killing a living thing that is not considered a person is okay, then soon killing junior will be up for grabs. No, not normal little junior, but retarded little junior, the one that needs constant care, can&#8217;t clean himself, nor talk or feed himself&#8230;or defend himself in a court of law.\n \n You have a good point, unkerpaulie, but I doubt that you&#8217;ll get much feedback. Really stepping back and looking at what&#8217;s wrong with society is just too danged hard to do; takes too much time, and just don&#8217;t feel right.", 
   {}, 
   52890, 
   null, 
   1086278400.0
  ], 
  [
   52915, 
   null, 
   "Sigma", 
   "In the USA the propensity of things are gaining ground in favor of \"Do what you feel like doing.\" If there's a law against it, and it doesn't feel right, then it can be changed until it does. If killing a living thing that is not considered a person is okay, then soon killing junior will be up for grabs. No, not normal little junior, but retarded little junior, the one that needs constant care, can't clean himself, nor talk or feed himself...or defend himself in a court of law.\n\n \n I'm not sure I believe that slippery slope. Certainly moral relativism (sp?) is a popular view right now, but I doubt we'll be doing away with the constitution any time soon. All the hub-bub with abortion is establishing a point at which to entitle rights, not if to give them. I believe birth is a logical place, seeing as how conception is not always known and it's hard to apply laws retroactivly, especially if the woman didn't know she was pregnant. The citizenship nightmare that will follow, since if it is entitled to constitutional protection then it must be a citizen right? What happens to the 1/3 of pregnancies that end in spontaneous abortion naturally anyway? These questions would be too hard for the law to answer to everyone's satisfaction, even disregarding the whole woman's rights issue (which most of the nation would fight tooth and nail for anyway).\n \n \n\n You have a good point, unkerpaulie, but I doubt that you'll get much feedback. Really stepping back and looking at what's wrong with society is just too danged hard to do; takes too much time, and just don't feel right.\n\n \n It's fairly easy to step back and say what's wrong. It's trying to change it that's the difficult part. Between political partisanship, special interests and the public's apathy, there's not much to convince anyone of radical change :(", 
   {
    "unicode_changes_made": true
   }, 
   52892, 
   null, 
   1086296220.0
  ], 
  [
   52923, 
   null, 
   "Big Orn", 
   "I'm not sure I believe that slippery slope. Certainly moral relativism (sp?) is a popular view right now, but I doubt we'll be doing away with the constitution any time soon. All the hub-bub with abortion is establishing a point at which to entitle rights, not if to give them. I believe birth is a logical place, seeing as how conception is not always known and it's hard to apply laws retroactivly, especially if the woman didn't know she was pregnant. The citizenship nightmare that will follow, since if it is entitled to constitutional protection then it must be a citizen right? What happens to the 1/3 of pregnancies that end in spontaneous abortion naturally anyway? These questions would be too hard for the law to answer to everyone's satisfaction, even disregarding the whole woman's rights issue (which most of the nation would fight tooth and nail for anyway).\n\n Let&#8217;s lift up the covers, then, and see just who&#8217;s under there, shall we?\n If there was no need for the birthing process, the womb, the birth canal, then we could safely say that there was no need to squabble over the child&#8217;s right to live. Right? The child would be born at conception, just kept in a canister with a feeding tube until it fully develops. It would have its own little pink or blue canister standing stately in its own little canister-holder in its own little room. But, it&#8217;s not birthed yet because it totally relies on the canister&#8217;s umbilical cord. You can see its features, watch it grimace or smile as it grows. It is a little human being.\n \n But, the fetus is hidden in the womb as it is, out of sight, out of mind&#8230;.? Let&#8217;s look at what a growing human being is instead of what its not. That&#8217;s all I&#8217;m saying. Not that far from the unwanted junior if you ask me.\n \nIt's fairly easy to step back and say what's wrong. It's trying to change it that's the difficult part. Between political partisanship, special interests and the public's apathy, there's not much to convince anyone of radical change :(\n\n Saying, yes, REALLY looking at it, no. And, yes, changing it will be the difficult part. Once something is written into law and we get our hands on it, wallow in it, love it, hate it, live it, and kill it, it&#8217;s almost impossible.", 
   {}, 
   52915, 
   null, 
   1086299520.0
  ], 
  [
   52929, 
   null, 
   "Sigma", 
   "Let's lift up the covers, then, and see just who's under there, shall we?\n If there was no need for the birthing process, the womb, the birth canal, then we could safely say that there was no need to squabble over the child's right to live. Right? The child would be born at conception, just kept in a canister with a feeding tube until it fully develops. It would have its own little pink or blue canister standing stately in its own little canister-holder in its own little room. But, it's not birthed yet because it totally relies on the canister's umbilical cord. You can see its features, watch it grimace or smile as it grows. It is a little human being.\n \n But, the fetus is hidden in the womb as it is, out of sight, out of mind....? Let's look at what a growing human being is instead of what its not. That's all I'm saying. Not that far from the unwanted junior if you ask me.\n\n \n If we all lived in \"Brave New World\" like this, then you would have a point. If the fetus is not dependant on a woman to live, then women's rights would not enter in to it at all, would it? It is not \"out of sight out of mind\", it's more to the point that the fetus' umbilical cord is attached to another living creature that may or may not want it there. And that other living creature's rights should take precedence, imo. \n \n Very far from \"unwanted junior\" as once it's born then the argument of \"my body my right\" no longer applies, and the child is constitutionally protected. From what I've seen, abortion is not about glorifying in killing like some pro-life people think, but more of not wanting to have to be pregnant. Once it is born, one can give it up for adoption. You cannot get rid of a fetus without abortion. \n \n However, this thread isn't about abortion per se. \n \n \n\n Saying, yes, REALLY looking at it, no. And, yes, changing it will be the difficult part. Once something is written into law and we get our hands on it, wallow in it, love it, hate it, live it, and kill it, it's almost impossible.\n\n \n Perhaps. I think quite a few people look at ourselves and sorrowfully see that we are headed for our own destruction. I also think that it would take so much cooperation between the gov't and people to change that we will never do it in time before time runs out. Our society is too capitalist to cooperate.", 
   {
    "unicode_changes_made": true
   }, 
   52923, 
   null, 
   1086300360.0
  ], 
  [
   52930, 
   null, 
   "unkerpaulie", 
   "I'm not sure I believe that slippery slope. Certainly moral relativism (sp?) is a popular view right now, but I doubt we'll be doing away with the constitution any time soon. All the hub-bub with abortion is establishing a point at which to entitle rights, not if to give them. I believe birth is a logical place, seeing as how conception is not always known and it's hard to apply laws retroactivly, especially if the woman didn't know she was pregnant. The citizenship nightmare that will follow, since if it is entitled to constitutional protection then it must be a citizen right? What happens to the 1/3 of pregnancies that end in spontaneous abortion naturally anyway? These questions would be too hard for the law to answer to everyone's satisfaction, even disregarding the whole woman's rights issue (which most of the nation would fight tooth and nail for anyway).\n\n and what about the infant mortalities, child deaths due to accidents, death in general. as it stands, the mother retains the right to terminate the life of her child if she decides she doesnt want to parent it. however, she has a relatively small window of time to decide, and after that she cant change her option... or can she... at some point the mother loses that right, and the child gains the right to live. however, what if the mother decides that she is not ready or equiped to be a parent (for instance, after the child is born she loses her ability to work, or the father abandons her, or some other similar situation). legally, shes unable to do anything since she lost the option to kill the child at that point. morally, the motive would have been the same as if she had decided to abort the child earlier", 
   {}, 
   52915, 
   null, 
   1086301080.0
  ], 
  [
   52935, 
   null, 
   "Big Orn", 
   "If we all lived in \"Brave New World\" like this, then you would have a point. If the fetus is not dependant on a woman to live, then women's rights would not enter in to it at all, would it? It is not \"out of sight out of mind\", it's more to the point that the fetus' umbilical cord is attached to another living creature that may or may not want it there. And that other living creature's rights should take precedence, imo. \n \n Very far from \"unwanted junior\" as once it's born then the argument of \"my body my right\" no longer applies, and the child is constitutionally protected. From what I've seen, abortion is not about glorifying in killing like some pro-life people think, but more of not wanting to have to be pregnant. Once it is born, one can give it up for adoption. You cannot get rid of a fetus without abortion.\n\n Take a look at the scenario one more time, Sigma. What&#8217;s the difference, really? Constant care would be required; your life would not be your own. That&#8217;s the choice you made when you did the deed without protection against it. Of course, we won&#8217;t mention those deadbeat men that would rather run and hide than stay and assume responsibility.\n Again, not that far from pulling the trigger on unwanted little junior.\n &#8220;Take him!, quoted from the madwoman on the movie Jeremiah Johnson when she refused to have anything to do with the boy. There was nothing more important right then, than herself.\n \nHowever, this thread isn't about abortion per se.\n\n No, it&#8217;s not. It&#8217;s about killing an individual that is legally called a human being. Trickery or just plain old look-at-it-really, unkerpaulie has opened a can of worms that could be perceived as nasty and slippery, but on the other hand could catch a basketful of unsuspecting fish. emoticon_ic \n \nPerhaps. I think quite a few people look at ourselves and sorrowfully see that we are headed for our own destruction. I also think that it would take so much cooperation between the gov't and people to change that we will never do it in time before time runs out. Our society is too capitalist to cooperate.\n\n Sadly, I agree.", 
   {}, 
   52930, 
   null, 
   1086302160.0
  ], 
  [
   52939, 
   null, 
   "Sigma", 
   "and what about the infant mortalities, child deaths due to accidents, death in general. as it stands, the mother retains the right to terminate the life of her child if she decides she doesnt want to parent it. however, she has a relatively small window of time to decide, and after that she cant change her option... or can she... at some point the mother loses that right, and the child gains the right to live. \n\n \n You do have a point with infant mortality, however I think you think it's stronger than it is. Once a child is to the point of being born, any deadly deformity or fatal crossing of genes would have killed it already. If something was going to show up that would kill it naturally, it most likely would have shown up by the time it's ready to be born. And, once it is born, medical science can do wonders for any trauma sustained in the womb :)\n \n Natural accidents are something that no law can guard against.\n \n As it stands, a mother has a right to terminate if she doesn't want to parent a child in the future (being pregnant isn't being a parent). Once the child is born it is granted certain rights, and you are right that the mother then loses the right to terminate.\n \n \n\n however, what if the mother decides that she is not ready or equiped to be a parent (for instance, after the child is born she loses her ability to work, or the father abandons her, or some other similar situation). legally, shes unable to do anything since she lost the option to kill the child at that point. morally, the motive would have been the same as if she had decided to abort the child earlier\n\n \n Heh, I like your wording \"lost the option to kill the child\". Far cry from your first post, with it's seeming neutrality.\n \n Actually, the morality would change. An example would be killing an intruder invading your home vs. killing a person on the street (do not look too much into it, it's a simple example). In one case it is murder, the other self defense and justifiable. The act is the same, killing another. The circumstances, and thus the morality, change.\n \n A woman legally has to take care of her child once it is protected under the constitution (and the law). Legality is the only touchstone, since even you two must agree that morals are not constant person to person. Since people abandon children every day, I think it's safe to say that some people's morals allow for it, even if the law does not.", 
   {}, 
   52930, 
   null, 
   1086303840.0
  ], 
  [
   52940, 
   null, 
   "Sigma", 
   "Take a look at the scenario one more time, Sigma. What's the difference, really? Constant care would be required; your life would not be your own. That's the choice you made when you did the deed without protection against it. Of course, we won't mention those deadbeat men that would rather run and hide than stay and assume responsibility.\n Again, not that far from pulling the trigger on unwanted little junior.\n \"Take him!, quoted from the madwoman on the movie Jeremiah Johnson when she refused to have anything to do with the boy. There was nothing more important right then, than herself.\n\n \n Oh, you mean that if a couple was forced to accept the test tube? Then I would agree that rights would enter into it, both the man's and the woman's. They should not be forced to become parents if they do not wish to be. I assume you're ignoring rape, incest and BC failure at this point, as well as the deadbeat dads you mention. \n \n Constant care? All the thing does is float in it's test tube :P No morning sickness, loss of wages at work, complications with pregnancy, and no birthing required :) I think significantly fewer abortions would be performed, as you could get rid of the fetus without killing it, simply giving it to someone else like adoption.\n \n If women did not have to kill a fetus to stop a pregnancy, do you truly believe they would? Killing the fetus is the only way to stop a pregnancy. If there was another, safer way, I believe women would be all over it. I see exactly what you mean (I believe).\n \n If the fetus was in a test-tube outside a woman's body so her rights never entered into it, then I would agree that killing it would not be necessary, and should be prevented. I'm not sure if it's on par with killing jimmy in the playpen, but you're entitled to your opinion. The way this is flawed is that a woman wouldn't kill the fetus in the test tube if it was outside of her body and she could give it away.\n \n \n\n No, it's not. It's about killing an individual that is legally called a human being. Trickery or just plain old look-at-it-really, unkerpaulie has opened a can of worms that could be perceived as nasty and slippery, but on the other hand could catch a basketful of unsuspecting fish. emoticon_ic \n\n \n I don't believe that this is a hard concept, or a tricky concept. Legally, a born child is protected. A fetus that is in a somewhat parasidic relationship with a woman is not; in that case, the woman who has to provide the body for that fetus is in control, rightly in my opinion.\n \n \n\n Sadly, I agree.\n\n \n Now if only we could get something other than a politician into office", 
   {
    "unicode_changes_made": true
   }, 
   52935, 
   null, 
   1086304500.0
  ], 
  [
   52942, 
   null, 
   "thebootfitter", 
   " (being pregnant isn't being a parent) \n\n Clarification: This statement is a matter of perspective.", 
   {}, 
   52939, 
   null, 
   1086304920.0
  ], 
  [
   52943, 
   null, 
   "Sigma", 
   "Clarification: This statement is a matter of perspective.\n\n \n True :) Perhaps I should have said \"Being pregnant does not mean you are a parent\". [edit]I cannot seem to get my point across with a sentence. The point being, being pregnant requires no parenting skills as having a born child does.[/edit]\n \n Then again, having children is not always the same as being a parent as well.", 
   {}, 
   52942, 
   null, 
   1086305100.0
  ], 
  [
   52944, 
   null, 
   "Big Orn", 
   "Now if only we could get something other than a politician into office\n\n Or a lawyer... :xbanghead emoticon_angry", 
   {}, 
   52940, 
   null, 
   1086305100.0
  ], 
  [
   56417, 
   null, 
   "Adept", 
   "what if you realise after the child is born that you dont want to raise the child?\n\n \n The only problem with this scenario is the motive, and how it applies to everyday life. Can you kill your child because their existance is a burden on your life? \n \n If you can do that, is it such a large step to killing a beggar for the same reasons?\n \n From there, do we move on to politicians and lawyers?\n \n What about the guy who cuts you off in traffic? \n \n What about if your children start acting up in school? Instant death?\n \n I take the stance that you can kill an unborn child because they are unborn. That doesnt make them any less important, but it does place a clear limit on your actions. Your actual motive for doing it is irrelevant. \n \n The fact is that another person cannot kill someone else using the same motive, or a variant of it, and thus begin to place all of society at risk. You can only kill an uborn child. If you begin to place mental retards, or the extremely elderly in that category, then you do begin to devalue life as whole, which devalues your life as well. You can become a retard, you will become elderly, the categories can change, and lots of people will die. This erodes society, as everyone begins to look out for number one, instead of doing their job and supporting each other.\n \n However, people cannot become unborn. And you cannot kill someone elses baby without their consent, as that again opens the door to forcing people to do what you want against their will, which will in turn result in the anarchy of option one.\n \n So let parents kill their unborn kids if they want. It doesnt affect you any more than if they slaughter their own cattle for food, so keep your nose out of it.", 
   {}, 
   52839, 
   null, 
   1088743920.0
  ], 
  [
   56807, 
   null, 
   "unkerpaulie", 
   "The only problem with this scenario is the motive, and how it applies to everyday life. Can you kill your child because their existance is a burden on your life? \n\n the truth is, this is the number 1 reason for abortion. women dont want to be bothered with motherhood, so they have abortions.\n \n \nIf you can do that, is it such a large step to killing a beggar for the same reasons?\n \n From there, do we move on to politicians and lawyers?\n \n What about the guy who cuts you off in traffic? \n \n What about if your children start acting up in school? Instant death?\n\n thats the point of the question in the first place.\n \n \nI take the stance that you can kill an unborn child because they are unborn. That doesnt make them any less important, but it does place a clear limit on your actions. Your actual motive for doing it is irrelevant. \n\n the motive is the very root of this discusion. after the child is born and the mother realises the burden of parenthood, the motive is the same, but legally the option is gone\n \n \nThe fact is that another person cannot kill someone else using the same motive, or a variant of it, and thus begin to place all of society at risk. You can only kill an uborn child. If you begin to place mental retards, or the extremely elderly in that category, then you do begin to devalue life as whole, which devalues your life as well. You can become a retard, you will become elderly, the categories can change, and lots of people will die. This erodes society, as everyone begins to look out for number one, instead of doing their job and supporting each other.\n\n what exactly makes an unborn child a less valuable life than an elderly or retarded person \n \n \nHowever, people cannot become unborn. And you cannot kill someone elses baby without their consent, as that again opens the door to forcing people to do what you want against their will, which will in turn result in the anarchy of option one.\n \n So let parents kill their unborn kids if they want. It doesnt affect you any more than if they slaughter their own cattle for food, so keep your nose out of it.\n\n hmmm... you assume that i am against abortion? is it more your business than mine? besides, killing other people's children was never part of the discussion... this was your personal rant, i got nothing against that", 
   {}, 
   56417, 
   null, 
   1089147300.0
  ], 
  [
   57164, 
   null, 
   "Adept", 
   "the motive is the very root of this discusion. after the child is born and the mother realises the burden of parenthood, the motive is the same, but legally the option is gone\n\n \n Which is a portion of my point. Once the child is born, killing it sets a precedent that puts in danger the children of parents who actually want them. Killing an unborn child does not place other children in danger, except those whose parents want to kill them before they are born.\n \n \nwhat exactly makes an unborn child a less valuable life than an elderly or retarded person\n\n \n Absolutely nothing. My point was that killing unborn children, so long as it is the willing decision of the parent/s, does not place in threat existing members of society. An unborn child is no more a valuable life than a cockroach, no less valuable than a puppy.\n \n \n \nhmmm... you assume that i am against abortion? is it more your business than mine? besides, killing other people's children was never part of the discussion... this was your personal rant, i got nothing against that\n\n \n Perhaps a language error. The last part of my post was directed at an anonymous 'you', a sort of monologue directed at the pro-life movement rather than directed at a particular person. Certainly no offense intended.", 
   {}, 
   56807, 
   null, 
   1089363960.0
  ], 
  [
   57228, 
   null, 
   "unkerpaulie", 
   "Which is a portion of my point. Once the child is born, killing it sets a precedent that puts in danger the children of parents who actually want them. Killing an unborn child does not place other children in danger, except those whose parents want to kill them before they are born.\n \n Absolutely nothing. My point was that killing unborn children, so long as it is the willing decision of the parent/s, does not place in threat existing members of society. An unborn child is no more a valuable life than a cockroach, no less valuable than a puppy.\n\n killing your child is a choice. before the child is born, that option is legally permissible. from the day the child is born, that option is illegal. you are saying that an unborn baby has no more value than a cockroach, no less value than a puppy. \n \n value is subjective, and whats valuable to you may be garbage to someone else. you cannot be the one determining how valuable the fetus is. the value of the baby is the mother's perogative. conversely, a new born baby has the right to live regardless of the mother's view of the baby's value. \n \n now if the mother doesnt regard the fetus as something of value to her, then she can kill it if she wants to. but if at the point of birth or afterward, the mother finds that her baby is of no value to her, she cannot kill it at that time. the issue of value is the same, the only difference is the legality at the time.\n \n bear in mind, again, that the foremost reason women have abortion is that they simply do not want to mother the child. if you have an abortion you can legally release yourself from that burden. if you kill the child after its born, the result is the same, but its illegal", 
   {}, 
   57164, 
   null, 
   1089390180.0
  ], 
  [
   57370, 
   null, 
   "jitobear", 
   "I have to step in say something here. It is being said that the main reason women have abortions is because they don't want to be parents and that they will be held legally responsible for the child after birth. \n \n Um, no.\n \n Nobody has to be a parent. There is adoption. In most (if not all) states a newborn can be left at any hospital, police station, fire station, etc. - no questions asked, and parents can also sign away their parental rights.\n \n Women have abortions because they don't want to be pregnant. There may be a variety of reasons for this - from the serious to the vain. Not wanting to be a parent may be true as well, but it is entirely to simplistic to think that is it.", 
   {}, 
   56417, 
   null, 
   1089447660.0
  ], 
  [
   57566, 
   null, 
   "unkerpaulie", 
   "i didnt say that not wanting to be a parent is the most important, significant or best reason for having an abortion. it is, however, the most popular. if you did a survey of women that had abortions in the last say 5 years, you'll find that more women would give that reason than any other reason. not that the other reasons arent valid. in fact, simply not wanting to be a parent is a valid reason in itself, and im not making it trivial in any way. on a whole the option for abortion is usually a very necessary one, especially in a society where unplanned pregnancies occur more frequently than ever.\n \n giving up a child for adoption after birth is much more complicated on so many levels. first of all, the mother would have to go through the entire process of pregnancy and birth. secondly, the emotional and mental baggage that comes with knowing that you are a mother, even if the child is being legally cared for by another, the fact still remains that she is a mother. also, adoption is not that easy, especially if you have the desire for your child to be cared for well. not all children are accepted, and of the children that are, only a small minority are not exploited or abused by their adopted caregivers.\n \n rather than go through all that hassle just to avoid parenting the child, abortion is the much simpler solution.", 
   {}, 
   57370, 
   null, 
   1089643620.0
  ], 
  [
   58307, 
   null, 
   "duck", 
   "What do you think killing the baby would do to the mother mentally? do you think she would be perfectly happy knowing that she killed her baby like an animal at a slaughter house? Yeah it is complicated, but that doesn't give people the right to kill their baby. My best friends birth parents thought about killing him with abortion, instead they went through with putting him up for adoption. Now hes graduating from school. And to think that he would've been killed and I would never have seen his face is devastating. But worst of all its been proven that a fetus can feel pain. do you know how they kill the baby? They chop them up, vacum out his body parts, and throw them down a disposal. How can you think thats ok. Its sick and perverted. Not to mention that abortion gives the woman a greater risk of breast cancer. And usually the mother ends up committing Suicide. One time a mother was trying to abort twins and one of them survived. About ten years later the kid that survived said the he had nightmares in wich it was pitch black and he could hear someone screaming in horrible pain night, after night,after night.", 
   {}, 
   57566, 
   null, 
   1089942000.0
  ], 
  [
   58386, 
   null, 
   "unkerpaulie", 
   "What do you think killing the baby would do to the mother mentally? do you think she would be perfectly happy knowing that she killed her baby like an animal at a slaughter house? Yeah it is complicated, but that doesn't give people the right to kill their baby. My best friends birth parents thought about killing him with abortion, instead they went through with putting him up for adoption. Now hes graduating from school. And to think that he would've been killed and I would never have seen his face is devastating. But worst of all its been proven that a fetus can feel pain. do you know how they kill the baby? They chop them up, vacum out his body parts, and throw them down a disposal. How can you think thats ok. Its sick and perverted. Not to mention that abortion gives the woman a greater risk of breast cancer. And usually the mother ends up committing Suicide. One time a mother was trying to abort twins and one of them survived. About ten years later the kid that survived said the he had nightmares in wich it was pitch black and he could hear someone screaming in horrible pain night, after night,after night.\n\n apparently, thousands of women have no negative psychological reaction to killing their children, giving them up for adoption, abandoning them, etc... then again maybe they do. the mental anguish of the individual woman has a lot to do with the woman in question.\n \n and when did i say that abortion is ok? \n \n i'm aware of the methods of abortion and fetal disposal, as well as the fact that fetus even in the 1st trimester responds to external stimuli, including touch, temperature change, sound vibration and so on. the discussion is not about whether abortion or killing in general is inhumane or painful, but if the motive is justifiable\n \n i suggest you read at least the first 10 posts in this thread to get a general idea of the perspectives brought forward", 
   {}, 
   58307, 
   null, 
   1089987960.0
  ], 
  [
   58616, 
   null, 
   "Sigma", 
   "What do you think killing the baby would do to the mother mentally? do you think she would be perfectly happy knowing that she killed her baby like an animal at a slaughter house? \n\n \n What do you think forcing a woman to gestate and birth an entity by law will do to her mentally, especially if she was unstable to begin with?\n \n \n\n Yeah it is complicated, but that doesn't give people the right to kill their baby. My best friends birth parents thought about killing him with abortion, instead they went through with putting him up for adoption. Now hes graduating from school. And to think that he would've been killed and I would never have seen his face is devastating.\n\n \n You would have never known or missed him, because he would not have been born. That's great that his parents were together and felt they could afford physically, mentally, emotionally and financially to carry a fetus to term :) Not every one is like this.\n \n \n\n But worst of all its been proven that a fetus can feel pain. do you know how they kill the baby? They chop them up, vacum out his body parts, and throw them down a disposal. How can you think thats ok. Its sick and perverted.\n\n \n Then you're ok with abortion when there is no brain? When there are no nerves? At what point is it ok?\n \n \nNot to mention that abortion gives the woman a greater risk of breast cancer. And usually the mother ends up committing Suicide. One time a mother was trying to abort twins and one of them survived. About ten years later the kid that survived said the he had nightmares in wich it was pitch black and he could hear someone screaming in horrible pain night, after night,after night.\n\n \n No, it does not give a woman greater risk of breast cancer. That is a stat that many pro-life people spread around. It is another case of statistics being twisted to suit a purpose. Carrying a pregnancy to term and breastfeeding confers a certain protection to breast cancer. Having a miscarriage or abortion does not confer that protection. \n \n It is true that those who have an abortion have a higher risk of breast cancer than those who carry their pregnancy to term, but they also have the same risk as women who do not get pregnant.\n \n Do you have a source for that little story of yours?", 
   {}, 
   58307, 
   null, 
   1090091820.0
  ], 
  [
   58673, 
   null, 
   "duck", 
   "Certainly one of the definitive studies was by H. L. Howe. Her study was done in upstate New York using official statistics from the New York State Health Department. This was an excellent study by epidemiologic standards and was not subject to any kind of recall memory bias from people asked in questionnaires. It used only hard data. She investigated all the women in this area who developed breast cancer under age 40 and checked to see whether or not they had had abortions. The conclusion was that women who had aborted their first pregnancy had a 1.7 times increased risk of breast cancer. Those who had gone on to abort their second and/or third pregnancy had a 4.0 times increased risk. Howe HL, Senie RT, Bzduch H, Herzfeld P (1989) et al., Int. J. Epidemiol. 18:3004. \n \n Another was in Washington State: Few studies on this issue receive media attention. This went worldwide and broke the defacto embargo on reporting the abortionbreast cancer link. Janet Daling did a very professional study that could not be discounted. It found:\n \n - An induced abortion raises a woman's chance of getting breast cancer before age 45 by 50%. If done before age 18, it increases 150%; if after age 30, it's up 110%.\n \n - A woman with a family member with breast cancer who had her first abortion after 30 years increased her risk 270%.\n \n - All 12 women in the study with a family history of breast cancer, who aborted before age 18 - all 12 - got breast cancer before age 45. J. Daling, Risk of Breast Cancer Among Young Women, J. Nat. Ca. Inst., Vol. 86, No. 21, 11/2/94, pg. 1584\n \n Other studies done since then include: Greece: An overall increased risk of 51% was reported in women who had abortions, compared to those who did not. It involved 850 patients in Athens. L. Lipworth, Int. J. of Cancer, April '95 U.S.A.: \n \n A statistically significant increased risk of 23% of breast cancer was shown to be attributable to induced abortion. For women over 60 years, the risk was 80%. P. Newcomb et al., Preg. Termination & Risk of Breast Cancer, JAMA 1/24/96, Vol. 275, No. 4, pg. 283\n \n For a thorough explanation of the Newcomb study above, see Natl. RTL News, 2/6/96, by J. Brind. Paris: \"Having at least two abortions if associated with an increased breast cancer risk\" of 2.1 times. N. Andrieu, Role of Genetic & Repro. Factors in Br. Ca., Genetic Spidem. 11 (3): 285, 1994\n \n There are, in addition, many competent studies done in the last 20 years which also confirm this linkage. See: Before You Choose, The Link Between Abortion & Breast Cancer; And: Legalized Abortion and the Sudden Increase of Breast Cancer, both by Scott Somerville, P.O. Box 159, Paeonian Springs, VA 22129. \n \n These are comprehensive analyses citing 74 studies.", 
   {
    "unicode_changes_made": true
   }, 
   58616, 
   null, 
   1090135740.0
  ], 
  [
   58674, 
   null, 
   "duck", 
   "apparently, thousands of women have no negative psychological reaction to killing their children, giving them up for adoption, abandoning them, etc... then again maybe they do. the mental anguish of the individual woman has a lot to do with the woman in question.\n \n and when did i say that abortion is ok? \n \n i'm aware of the methods of abortion and fetal disposal, as well as the fact that fetus even in the 1st trimester responds to external stimuli, including touch, temperature change, sound vibration and so on. the discussion is not about whether abortion or killing in general is inhumane or painful, but if the motive is justifiable\n \n \n i suggest you read at least the first 10 posts in this thread to get a general idea of the perspectives brought forward\n\n just out of curiosity, how many thousands. And there have been tens of millions of abortions just in america.\n \n You never really said specifically that abortion was ok, but you did give me the mesage that you thought it was ok with all the stuff you said debating with what i wrote.\n \n well i think if it is inhumane and painful it should not be justifiable.\n \n \n hm..., mabye your right. i did only read a few of the first posts.", 
   {}, 
   58386, 
   null, 
   1090136160.0
  ], 
  [
   58679, 
   null, 
   "Sigma", 
   "The results should make it clear that studies which are properly designed show pregnancies that end in abortion don't increase the risk of breast cancer. \n\n \n -Professor Valerie Beral, Director, Cancer Research UK Epidemiology Unit, University of Oxford \n \n \nSome previous reviews on abortion and breast cancer have reached mistaken conclusions because they mixed together data from reliable and unreliable types of study.\n\n \n -Professor Sir Richard Peto, from the Cancer Research UK Epidemiology Unit in Oxford\n \n \nProfessor Valerie Beral and colleagues found out of the 83,000 women, only 44,000 had predicated in reliable studies. \n \n They were asked before they were diagnosed with cancer to tell researchers whether or not they had an abortion or miscarriage. \n \n Results from these women showed that for those who had miscarried there was no increased risk of breast cancer compared to the general population. \n \n The risk was actually slightly lower among those who had an abortion. \n\n \n \nthe only notice from the U.S. National Cancer Institute is to question the methodology of the studies that have found links between abortion and breast cancer. Many of them rely on women self-reporting abortions, creating the possibility that those who later developed breast cancer will admit to having had an abortion and those who have not developed breast cancer will not. Others used samples too small to be considered statistically valid.\n \n \"The relationship between abortion and breast cancer has been the subject of extensive research,\" according to a fact sheet distributed by the National Cancer Institute. \"However, evidence of a direct relationship between breast cancer and either spontaneous or induced abortion is inconsistent. Some studies have indicated small elevations in risk, while others have not shown any risk associated with either induced or spontaneous abortions.\"\n\n \n As for the Daling study:\n \nDaling's study also found that teenagers under age 18 and women over age 30 who have an abortion more than double their breast cancer risk. Those with a family history of the disease increase their risk 80 percent. Daling's most dramatic finding was that teenagers with a family history of breast cancer who procure an abortion face a risk of breast cancer that is incalculably high. All 12 women in her study with this history were diagnosed with breast cancer by the age of 45.\n \n Because the study relied on self-reports of abortions and because the risk did not vary consistently with the number of abortions, the woman's age or the length of pregnancy, a commentary published in the same issue of the journal said the evidence of an abortion-breast cancer link remained \"weak and inconsistent.\"\n\n \n http://www.womensenews.org/article.cfm/dyn/aid/818/context/cover/\n \"Many researchers are troubled, however, by the trend because the weight of current scientific evidence does not seem to support a link between breast cancer and abortion\"\n \n http://www.breastcancer.org/research_abortion.html\n \"In February 2003, an expert panel at the U.S. National Cancer Institute (NCI) reviewed all available studies on links between pregnancy, abortion, and breast cancer. The experts concluded, based on the evidence from all the studies, that there is no link between natural or induced abortions and breast cancer risk\"\n \n http://www.cancer.gov/cancerinfo/wyntk/breast\n -this one has tons of information about breasts in general and breast cancer in particular. Below I've highlighted important info found under 'risks':\n \nMuch research has been done to learn whether having an abortion or a miscarriage affects a woman's chance of developing breast cancer later on. Large, well-designed studies have consistently shown no link between abortion or miscarriage and the development of breast cancer. \n\n \n http://www.reproductiverights.org/crt_cen_brstcancerqa.html\n \n http://www.flnow.org/Abortion%20myths.htm\n -I admit, these two are most likely biased, but they still have factual information.", 
   {
    "unicode_changes_made": true
   }, 
   58673, 
   null, 
   1090169640.0
  ], 
  [
   58825, 
   null, 
   "unkerpaulie", 
   "Then you're ok with abortion when there is no brain? When there are no nerves? At what point is it ok?\n\n i dont know if youre aware of this, but the brain and spinal system begins taking form in the fetus within a week of conception. organs, the bones and limbs develop later, but there is no point in the pregnacy where the fetus is without a brain or nerves (except maybe before the first week from conception, and even that is arguable)\n \n \nNo, it does not give a woman greater risk of breast cancer. That is a stat that many pro-life people spread around. It is another case of statistics being twisted to suit a purpose. Carrying a pregnancy to term and breastfeeding confers a certain protection to breast cancer. Having a miscarriage or abortion does not confer that protection. \n \n It is true that those who have an abortion have a higher risk of breast cancer than those who carry their pregnancy to term, but they also have the same risk as women who do not get pregnant.\n \n Do you have a source for that little story of yours?\n\n are you agreeing or disagreeing with duck? you admit that women that have abortions have a higher risk of breast cancer than women their full term pregnancy, which is the point that duck made in the first place\n \n to stay on track, the discussion was not intended to debate the medical and psychological risks or any other negative effect of abortion on the woman. i wanted to hear views on the motives for abortion, and of killing in general. \n \n let's look at the top 5 reasons why women have abortions (sources: 1, 2, 3)\n \n 5. rape (1%)\n 4. health problems in baby (3%)\n 3. health risk to mother (3%)\n 2. partner does not want the child (12%)\n 1. woman does not want the child (81%)\n \n (note that \"woman does not want the pregnancy\" includes the reasons such as she feels she cannot afford to raise a child, she is not mature enough, doesnt want the child to interfere with her life, etc. in short, this statistic relates to pregnancies with no foreseen complications, simply that the woman does not want to be a mother)\n \n i was hoping with this discussion thread to address the number 1 and 2 reasons for having an abortion, and whether they should be considered valid motives (i have no problem with the validity of # 3, 4 or 5, but they are in the minority anyway, according to the polls)\n \n acknowledging \"i cant be bothered with motherhood\" as a motive for abortion, why wouldnt it be a valid motive for killing a child after he or she is already born, for the same reasons?", 
   {}, 
   58616, 
   null, 
   1090263300.0
  ], 
  [
   58908, 
   null, 
   "Sigma", 
   "i dont know if youre aware of this, but the brain and spinal system begins taking form in the fetus within a week of conception. organs, the bones and limbs develop later, but there is no point in the pregnacy where the fetus is without a brain or nerves (except maybe before the first week from conception, and even that is arguable)\n\n \n I wasn't trying to make a point, merely to clarify what duck meant by what he/she said. Since duck's point was that the fetus/embryo/zygote could feel pain, abortion is bad. Since it cannot feel pain throughout the pregnancy (when it can is up for debate, but I believe all can agree there is a point that it cannot), I was curious whether it would be allowable then.\n \n You could argue about nerves up to fertilization, since the potential to grow them is always there. \n \n \n\n are you agreeing or disagreeing with duck? you admit that women that have abortions have a higher risk of breast cancer than women their full term pregnancy, which is the point that duck made in the first place\n\n \n Disagreeing :P Using that line of reasoning, a woman who never gets pregnant also has a higher risk of breast cancer. While technically true, saying that having an abortion leads you to an increased risk of breast cancer is a misleading statement. Having the abortion does not increase the risk, completing the pregnancy confers the protection. \n \n \n\n to stay on track, the discussion was not intended to debate the medical and psychological risks or any other negative effect of abortion on the woman. i wanted to hear views on the motives for abortion, and of killing in general. \n \n let's look at the top 5 reasons why women have abortions (sources: 1, 2, 3)\n \n 5. rape (1%)\n 4. health problems in baby (3%)\n 3. health risk to mother (3%)\n 2. partner does not want the child (12%)\n 1. woman does not want the child (81%)\n \n (note that \"woman does not want the pregnancy\" includes the reasons such as she feels she cannot afford to raise a child, she is not mature enough, doesnt want the child to interfere with her life, etc. in short, this statistic relates to pregnancies with no foreseen complications, simply that the woman does not want to be a mother)\n\n \n The first 2 sources do not seem to be large scale and/or objective, but the third is very interesting.\n \n \n\n i was hoping with this discussion thread to address the number 1 and 2 reasons for having an abortion, and whether they should be considered valid motives (i have no problem with the validity of # 3, 4 or 5, but they are in the minority anyway, according to the polls)\n \n acknowledging \"i cant be bothered with motherhood\" as a motive for abortion, why wouldnt it be a valid motive for killing a child after he or she is already born, for the same reasons?\n\n \n There is an important difference. If you do not feel ready to take care of a child once it is born, you have alternatives. If you do not feel ready to handle a pregnancy, you have no alternatives. In my opinion this comparison cannot be made except in the broadest of terms, and not in a moral sense.", 
   {}, 
   58825, 
   null, 
   1090293900.0
  ], 
  [
   58976, 
   null, 
   "unkerpaulie", 
   "I wasn't trying to make a point, merely to clarify what duck meant by what he/she said. Since duck's point was that the fetus/embryo/zygote could feel pain, abortion is bad. Since it cannot feel pain throughout the pregnancy (when it can is up for debate, but I believe all can agree there is a point that it cannot), I was curious whether it would be allowable then.\n \n You could argue about nerves up to fertilization, since the potential to grow them is always there. \n\n nerves execute one function: transfering information from the brain to the body and back. this is the fastest way the brain and the rest of the body communicates. pain-sensitive nerves are the most abundant type, and the mose basic. the function of pain is the most primary self-defence function. now i'm not saying that i know a 1 week old fetus can feel pain, but it is evident that at 1 week the nervous infrastructure is already there, and it is very likely that pain-sensitive nerves would be among the first to develop. it is highly likely that a 1-week-old fetus can actually feel pain.\n \n \nDisagreeing :P Using that line of reasoning, a woman who never gets pregnant also has a higher risk of breast cancer. While technically true, saying that having an abortion leads you to an increased risk of breast cancer is a misleading statement. Having the abortion does not increase the risk, completing the pregnancy confers the protection. \n\n actually, not going through the full term pregnancy, by any means, increases breast cancer risk. i admit that miscarriages are one way that a pregnacy can be interupted, but more commonly is abortion. interupted pregnancies cause the greatest risk of breast cancer. never having children puts you at a high risk, but not as high, and completing the pregnany through childbirth put you at the least risk (well, not \"you\", i mean the woman :) ). i think we can rest this, since we all more or less agree on this\n \n \nThe first 2 sources do not seem to be large scale and/or objective, but the third is very interesting.\n\n the first source is very objective, since its a free and totally anonymous online survey. but its not large scale since there were only about 25 participants. the second is a pro-life site, so they have an anti-abortion agenda, but their stats are credited to \"Aida Torres and J.D. Forrest\", some 3rd party statistic house, probably. the 3rd source is gathered from a wide range of medical databases. the interesting thing about the results of all 3 polls is that they follow the same patern in terms of reasons for abortion\n \n \nThere is an important difference. If you do not feel ready to take care of a child once it is born, you have alternatives. If you do not feel ready to handle a pregnancy, you have no alternatives. In my opinion this comparison cannot be made except in the broadest of terms, and not in a moral sense.\n\n the comparison can be made because the motive behind getting rid of the baby is the same, only the time of the action is different. \n \n let's say a pregnant woman doesnt want to be a mother, but she simply cannot afford an abortion. she goes through with the delivery but she knows that at the first chance she gets she is going to abandon the child. the day she is released from the hospital she drops her baby in a dumpster and never looks back.\n \n the result of her action frees her from the burden of motherhood and the responsibility of caring for the child, not to mention the expense. and she save $250 by bearing the baby rather than paying for the abortion procedure. the only difference is that she gets rid of her baby after it was born.\n \n is this situation worse than if she had an abortion? for a moment disregard her emotions. is she as justified as if she had an abortion? is her motive valid? its a given that if she could afford the abortion she would have undoubtedly done it, because her decision to not be a mother never changed. is she wrong?", 
   {}, 
   58908, 
   null, 
   1090336440.0
  ], 
  [
   59119, 
   null, 
   "Sigma", 
   "nerves execute one function: transfering information from the brain to the body and back. this is the fastest way the brain and the rest of the body communicates. pain-sensitive nerves are the most abundant type, and the mose basic. the function of pain is the most primary self-defence function. now i'm not saying that i know a 1 week old fetus can feel pain, but it is evident that at 1 week the nervous infrastructure is already there, and it is very likely that pain-sensitive nerves would be among the first to develop. it is highly likely that a 1-week-old fetus can actually feel pain.\n\n \n The question remains then how developed the brain is. Can the brain recieve and interpret the signals from the nerves? How developed is that area?\n \n \n\n actually, not going through the full term pregnancy, by any means, increases breast cancer risk. i admit that miscarriages are one way that a pregnacy can be interupted, but more commonly is abortion. interupted pregnancies cause the greatest risk of breast cancer. never having children puts you at a high risk, but not as high, and completing the pregnany through childbirth put you at the least risk (well, not \"you\", i mean the woman :) ). i think we can rest this, since we all more or less agree on this\n\n \n Do you have a source on this? All reputable sites and articles I've read indicate there is zero increased or inconsistant increased risk with an interrupted pregnancy, whether it be misscarriage or abortion. \n \n Also, your language is a bit confusing. Wouldn't a woman's baseline risk be when she isn't pregnant? With that as the base, factors in her life (such as environmental, lifestyle, and pregnancy) can increase and/or decrease that risk.\n \n \n\n the first source is very objective, since its a free and totally anonymous online survey. but its not large scale since there were only about 25 participants. the second is a pro-life site, so they have an anti-abortion agenda, but their stats are credited to \"Aida Torres and J.D. Forrest\", some 3rd party statistic house, probably. the 3rd source is gathered from a wide range of medical databases. the interesting thing about the results of all 3 polls is that they follow the same patern in terms of reasons for abortion\n\n \n Free and anonymous is great, but the exposure has to be at least decent to get a good cross-section of a population. With a pro-life site (and a pro-choice site) I prefer to see the data myself, since I've seen stats twisted to suit a purpose so many times.\n \n \n\n the comparison can be made because the motive behind getting rid of the baby is the same, only the time of the action is different. \n\n \n The time of action is the important consideration with abortion. The reason it is an abortion is because the time of action. To make a direct line comparison ignores the fact that an abortion is done because of the time frames involved.\n \n \n\n let's say a pregnant woman doesnt want to be a mother, but she simply cannot afford an abortion. she goes through with the delivery but she knows that at the first chance she gets she is going to abandon the child. the day she is released from the hospital she drops her baby in a dumpster and never looks back.\n \n the result of her action frees her from the burden of motherhood and the responsibility of caring for the child, not to mention the expense. and she save $250 by bearing the baby rather than paying for the abortion procedure. the only difference is that she gets rid of her baby after it was born.\n \n is this situation worse than if she had an abortion? for a moment disregard her emotions. is she as justified as if she had an abortion? is her motive valid? its a given that if she could afford the abortion she would have undoubtedly done it, because her decision to not be a mother never changed. is she wrong?\n\n \n Again, comparing abandoning a child that is born to an abortion is hugely flawed. Once a child is born, it can be separated from the mother and cared for by someone else, at no cost and in fact you can be paid for doing this. Also, there are safe-haven laws where a just-born child can be left at any hospital to be cared for. With a <12 week fetus, there is no alternative if you do not want to be pregnant. With a born child, there are many alternatives to caring for a child. \n \n Morally, I would say that the woman is not justified in abandoning her child, specifically because there are alternatives that allow the child to live while removing it from dependency on you. With an unwanted pregnancy, there are no such alternatives since you only have 2 choices, continue or abort. If a woman could remove the fetus from dependancy on her body and allow someone else to care for it, there would be no need for abortion.", 
   {}, 
   58976, 
   null, 
   1090377600.0
  ], 
  [
   59161, 
   null, 
   "unkerpaulie", 
   "The time of action is the important consideration with abortion. The reason it is an abortion is because the time of action. To make a direct line comparison ignores the fact that an abortion is done because of the time frames involved.\n\n i already acknowledged that. im talking about the motive, the justification. killing the child before of after the child's birth results in a dead child. either action also results in relieving the woman of motherhood. so it is comparable in these regards\n \n \nAgain, comparing abandoning a child that is born to an abortion is hugely flawed. Once a child is born, it can be separated from the mother and cared for by someone else, at no cost and in fact you can be paid for doing this. Also, there are safe-haven laws where a just-born child can be left at any hospital to be cared for. With a <12 week fetus, there is no alternative if you do not want to be pregnant. With a born child, there are many alternatives to caring for a child. \n \n Morally, I would say that the woman is not justified in abandoning her child, specifically because there are alternatives that allow the child to live while removing it from dependency on you. With an unwanted pregnancy, there are no such alternatives since you only have 2 choices, continue or abort. If a woman could remove the fetus from dependancy on her body and allow someone else to care for it, there would be no need for abortion.\n\n Sigma, in this case the woman wants her child dead. she doesnt care about the child being raised or adopted or if someone else cares for it. she could have gotten an abortion, except she couldnt afford to pay for it. the end is the same. the child is dead, and she doesnt have to worry about mother hood.\n \n is this worse than getting an abortion in the first place? how?", 
   {}, 
   59119, 
   null, 
   1090422840.0
  ], 
  [
   59221, 
   null, 
   "duck", 
   "Then you're ok with abortion when there is no brain? When there are no nerves? At what point is it ok?\n \n \n \n Abortion is never ok. Even if the fetus did not have a brain or any nerves, it is still never ok to kill another human. Isn't that really obvious?", 
   {}, 
   58616, 
   null, 
   1090448760.0
  ], 
  [
   59250, 
   null, 
   "Sigma", 
   "\n Sigma, in this case the woman wants her child dead. she doesnt care about the child being raised or adopted or if someone else cares for it. she could have gotten an abortion, except she couldnt afford to pay for it. the end is the same. the child is dead, and she doesnt have to worry about mother hood.\n \n is this worse than getting an abortion in the first place? how?\n\n \n So, you're talking about a hypothetical situation then, or if the mother happens to be a homicidal sadist? Not one of the woman I've listened to who have gotten an abortion (and that is a fair amount) \"wants her child dead\". You are correct about the motives, that they did not want to mother a child, but that is not the same as \"wants her child dead\". The only way that she could not have a child (baring accidents) is to kill the zygote/embryo/fetus while it is still in her body and living off of her organs. That does not mean she wanted it dead, simply that the reasons not to have it outweighed the desire to have it (and I believe I'm safe in saying that all woman would rather have let it live, if they did not have to go through the pregnancy and care for it).\n \n I sincerely believe that if there was a safe way to transfer a fetus to another, nearly everyone would take that road rather than have an abortion. That is why your two scenarios are not comparable, because the woman who gave birth has many options while a pregnant woman has only 2: to continue or to abort.\n \n As I said before, the existance of other options that allow the child to live means that killing it is not necessary. While pregnant, there are no other options, therefore it is necessary (to achieve the desired end) and justified. Killing when there other options that are easily achieved is not justified.", 
   {}, 
   59161, 
   null, 
   1090462260.0
  ], 
  [
   59251, 
   null, 
   "Sigma", 
   "Abortion is never ok. Even if the fetus did not have a brain or any nerves, it is still never ok to murder another human. Isn't that really obvious?\n\n \n Well, it's a good thing it isn't murder then, isn't it? emoticon_xbouncer", 
   {}, 
   59221, 
   null, 
   1090462320.0
  ], 
  [
   59271, 
   null, 
   "duck", 
   "Well, it's a good thing it isn't murder then, isn't it? emoticon_xbouncer\n\n That was simply a language eror. I meant kill. c'mon, isn't it a little obvious what I meant.", 
   {}, 
   59251, 
   null, 
   1090478400.0
  ], 
  [
   59272, 
   null, 
   "Sigma", 
   "That was simply a language eror. I meant kill. c'mon, isn't it a little obvious what I meant.\n\n \n heh I see you edited your post ;)\n \n So it's never justified to kill another human?", 
   {}, 
   59271, 
   null, 
   1090479300.0
  ], 
  [
   59277, 
   null, 
   "duck", 
   "[QUOTE=Sigma]heh I see you edited your post ;)\n \n So it's never justified to kill another human?[/QUOTE\n It's only justified if your defending yourselve and death is the only choice to save your own life. For example, say a women has cancer and when it would be treated it would kill the baby. Usually the mother waits until the baby is born to treat it, but by then their cancer may beyond being treated. Or someone is reaching for knife to kill you and you have a gun so you shoot him. That is justifiable. Killing it because you don't want to go through with the pregnancy is stupid. The baby is innocent, it is not threatening your life at all. Killing the baby would be evil anyway.", 
   {}, 
   59272, 
   null, 
   1090484400.0
  ], 
  [
   59303, 
   null, 
   "Sigma", 
   "\n It's only justified if your defending yourselve and death is the only choice to save your own life. For example, say a women has cancer and when it would be treated it would kill the baby. Usually the mother waits until the baby is born to treat it, but by then their cancer may beyond being treated. Or someone is reaching for knife to kill you and you have a gun so you shoot him. That is justifiable. Killing it because you don't want to go through with the pregnancy is stupid. The baby is innocent, it is not threatening your life at all. Killing the baby would be evil anyway.\n\n \n Evil even if it is to save her own life?\n \n What if she is taking medication for her severe depression (suicidal tendencies), but that medication would cause the fetus to be fatally deformed and almost guaranteed to cause a miscarriage? On one hand, is it right to legally force her to continue a pregnancy that she knows won't be complete, or force her to go off the medication that makes her able to function in life? \n \n Evil? Forcing either of these by law is evil and oppressive. Perhaps your option is to take her off the medication and lock her up until the thing you're really concerned about is born.\n \n I like how at first murder is never justified, then it's killing is never justified, now it's only some killing is justified. I happen to think an abortion is justified killing.", 
   {}, 
   59277, 
   null, 
   1090510140.0
  ], 
  [
   59720, 
   null, 
   "duck", 
   "Evil even if it is to save her own life?\n\n Didn't you read what I just said. It is not bad or evil to kill the baby if the baby is threatening your own life.", 
   {}, 
   59303, 
   null, 
   1090790700.0
  ], 
  [
   59780, 
   null, 
   "Sigma", 
   "Didn't you read what I just said. It is not bad or evil to kill the baby if the baby is threatening your own life.\n\n \n Why though? It is a human, it can think, it is not its fault that it is there! Why should we be allowed to kill an innocent human who is not at fault for this? Why should the woman be allowed to play god and kill a creature that has done her no harm? It is not its fault that the pregnancy might kill her.", 
   {}, 
   59720, 
   null, 
   1090821300.0
  ], 
  [
   59806, 
   null, 
   "unkerpaulie", 
   "So, you're talking about a hypothetical situation then, or if the mother happens to be a homicidal sadist? Not one of the woman I've listened to who have gotten an abortion (and that is a fair amount) \"wants her child dead\". You are correct about the motives, that they did not want to mother a child, but that is not the same as \"wants her child dead\". The only way that she could not have a child (baring accidents) is to kill the zygote/embryo/fetus while it is still in her body and living off of her organs. That does not mean she wanted it dead, simply that the reasons not to have it outweighed the desire to have it (and I believe I'm safe in saying that all woman would rather have let it live, if they did not have to go through the pregnancy and care for it).\n\n when a woman has an abortion its because she wants her baby dead. but we dont go around calling her a homocidal sadist. yet there are hundreds if not thousands of times more dead babies by abortion than abandoned babies. Sigma, face it, the women that have abortion decide that theyd rather kill the child than mother it. this is the reality\n \n \nI sincerely believe that if there was a safe way to transfer a fetus to another, nearly everyone would take that road rather than have an abortion. That is why your two scenarios are not comparable, because the woman who gave birth has many options while a pregnant woman has only 2: to continue or to abort.\n\n i wouldnt doubt that, but lets look at the reality. the options are kill the child and not have to be a mother, or let the child live and mother it. one way to kill the child is have an abortion. another way is to throw it in a dumpster. there are other ways as well, but lets deal with these 2 ways. the senarios are comparable because the only difference is the method of disposing of the baby. the other factors involved are all the same\n \n \nAs I said before, the existance of other options that allow the child to live means that killing it is not necessary. While pregnant, there are no other options, therefore it is necessary (to achieve the desired end) and justified. Killing when there other options that are easily achieved is not justified.\n\n but throwing the baby in the dumpster would acheive exactly the same desired end (and save you $250). \n \n yes, we can entertain the idea of other non-fatal options. but im addressing abortion for the sake not wanting to be a mother in comparison to baby disposal for exactly the same motive and reason. if abortion is justified if the result is a dead baby and no motherhood hassle, then why isnt killing the baby justified if the exact result is achieved", 
   {}, 
   59250, 
   null, 
   1090854600.0
  ], 
  [
   59816, 
   null, 
   "Sigma", 
   "when a woman has an abortion its because she wants her baby dead. but we dont go around calling her a homocidal sadist. yet there are hundreds if not thousands of times more dead babies by abortion than abandoned babies. Sigma, face it, the women that have abortion decide that theyd rather kill the child than mother it. this is the reality\n\n \n I believe I said the same thing, that she would rather kill the fetus than mother a child. However, she isn't thinking \"You know what, I want to kill something today, what can I do hmm... Oh I know! I'll kill my fetus!\". The desire is to not be pregnant, the result is the fetus' death. I agree that they would rather have an abortion than mother a child, as evidenced by the fact that abortions occur :P\n \n \n\n i wouldnt doubt that, but lets look at the reality. the options are kill the child and not have to be a mother, or let the child live and mother it. one way to kill the child is have an abortion. another way is to throw it in a dumpster. there are other ways as well, but lets deal with these 2 ways. the senarios are comparable because the only difference is the method of disposing of the baby. the other factors involved are all the same\n\n \n No, the other factors involved are not the same. There are innumeral ways to get rid of a child that involve allowing it to live. There are no ways to get rid of a fetus and allow it to live (until it is viable, but that's not an option until fairly late in the pregnancy).\n \n \n\n but throwing the baby in the dumpster would acheive exactly the same desired end (and save you $250). \n\n \n By going through an adoption, you can be paid, so you can make money, by giving it to a hospital you save 250, by giving it to a relative, by leaving it on another's doorstep, by giving the child away in any way shape or form you save the money or you make money.\n \n Even then, though, you ignore the cost of the pregnancy. Pregnancies can be expensive, sometimes very expensive. An abortion can very well be the least expensive way. Especially taking into account lost wages at work, and/or a lost job. Do not argue expense, because every woman's situation is different, and abortions can be very cheap, sometimes free.\n \n \n\n yes, we can entertain the idea of other non-fatal options. but im addressing abortion for the sake not wanting to be a mother in comparison to baby disposal for exactly the same motive and reason. if abortion is justified if the result is a dead baby and no motherhood hassle, then why isnt killing the baby justified if the exact result is achieved\n\n \n Because killing when other very viable options that achieve the same result is not justifiable. \n \n I can think of no justifiable reason to leave a just-born baby in a dumpster. An abortion can be justified because there are no other options open.", 
   {}, 
   59806, 
   null, 
   1090860600.0
  ], 
  [
   60327, 
   null, 
   "duck", 
   "Why though? It is a human, it can think, it is not its fault that it is there! Why should we be allowed to kill an innocent human who is not at fault for this? Why should the woman be allowed to play god and kill a creature that has done her no harm? It is not its fault that the pregnancy might kill her.\n\n \n What I meant was, if the mother was to go through with the pregnancy, knowing that it would kill her and the baby, then, and pretty much only then, could the mother use abortion.", 
   {}, 
   59780, 
   null, 
   1091175720.0
  ], 
  [
   60369, 
   null, 
   "Sigma", 
   "What I meant was, if the mother was to go through with the pregnancy, knowing that it would kill her and the baby, then, and pretty much only then, could the mother use abortion.\n\n \n Why should she even do it then? Why should she be allowed to kill a person that is not threatening her life on purpose? Is it its fault that the pregnancy is killing her? Shouldn't she be a good mother and sacrifice herself if it gives the fetus even a chance at life? I mean, after all, it isn't her body, so why should she be able to control what happens to the fetus like that?", 
   {}, 
   60327, 
   null, 
   1091201460.0
  ], 
  [
   60466, 
   null, 
   "duck", 
   "Why should she even do it then? Why should she be allowed to kill a person that is not threatening her life on purpose? Is it its fault that the pregnancy is killing her? Shouldn't she be a good mother and sacrifice herself if it gives the fetus even a chance at life? I mean, after all, it isn't her body, so why should she be able to control what happens to the fetus like that?\n\n \n Um...if the fetus was going to die and kill the mother if she continued the pregnancy, then both of them would die. Then you would only be able to safe the mother. If the doctors knew the fetus was going to die and bring the mother with him/her then you would safe the mother using abortion. The baby should also be druged so ti could not feel the pain. Perhaps I was not clear enough or you misread the post.", 
   {}, 
   60369, 
   null, 
   1091258520.0
  ], 
  [
   60480, 
   null, 
   "xxxivy", 
   "Nobody has to be a parent. There is adoption.\n\n \n It is ignorant and irresponsible to speak of \"adoption versus abortion\" as if the two were roughly equivalent options. They are not even comparable.\n Adoption is an alternative to parenting.\n Abortion is an alternative to pregnancy.\n \n Not only should no woman be forced to parent against her will, but neither should any woman be forced to reproduce against her will. It is MY choice whether and when I wish to bring life into this world.\n \n I am coming at this issue from the somewhat unique perspective of having relinquished my first child for adoption many years ago, and having kept and parented my second child. When I became unexpectedly pregnant a third time, I chose to terminate the pregnancy. So I have been on all sides of this equation.\n \n My abortion experience was actually a positive one. It was not traumatic at all. Rather, it was empowering. In retrospect, I feel nothing but gratitude and relief that the option was there, and that I was not forced to give birth to an unwanted child against my will. \n \n I am deeply committed to keeping the full range of reproductive options available and accessible to all women. Women are not slaves or cattle. We are human, deserving of human rights (unlike, say.. an embryo) and we will NOT be forced to breed against our will. \n \n JMO, ~ Ivy emoticon_xangel", 
   {}, 
   60466, 
   null, 
   1091272320.0
  ], 
  [
   60564, 
   null, 
   "duck", 
   "\n My abortion experience was actually a positive one. It was not traumatic at all. Rather, it was empowering. In retrospect, I feel nothing but gratitude and relief that the option was there, and that I was not forced to give birth to an unwanted child against my will. :\n\n \n I would have taken in your child, and given it a chance in life. :(", 
   {}, 
   60480, 
   null, 
   1091344500.0
  ], 
  [
   60571, 
   null, 
   "xxxivy", 
   "A chance to WHAT?\n And both of my children have homes, thank you anyway. One lives with me, and the other lives with his adoptive family. \n ~ Ivy", 
   {}, 
   60564, 
   null, 
   1091350860.0
  ], 
  [
   60757, 
   null, 
   "Sigma", 
   "Um...if the fetus was going to die and kill the mother if she continued the pregnancy, then both of them would die. Then you would only be able to safe the mother. If the doctors knew the fetus was going to die and bring the mother with him/her then you would safe the mother using abortion. The baby should also be druged so ti could not feel the pain. Perhaps I was not clear enough or you misread the post.\n\n \n So we are under no moral obligation to allow the fetus to live as long as it would naturally live?\n \n Are we under a moral obligation to allow it to live if birthing would kill the mother, but it could survive for a few days outside the womb? A few weeks? A month? At what point do we allow it to live, but kill the mother?", 
   {}, 
   60466, 
   null, 
   1091512980.0
  ], 
  [
   61691, 
   null, 
   "duck", 
   "So we are under no moral obligation to allow the fetus to live as long as it would naturally live?\n \n Are we under a moral obligation to allow it to live if birthing would kill the mother, but it could survive for a few days outside the womb? A few weeks? A month? At what point do we allow it to live, but kill the mother?\n\n If the baby was doomed to die anyway, then killing it to save the mother would be okay. But the clinic should give it plenty of pain killer. hmm...mabye they should just overdose it with painkiller.", 
   {}, 
   60757, 
   null, 
   1092202020.0
  ], 
  [
   61853, 
   null, 
   "Sigma", 
   "If the baby was doomed to die anyway, then killing it to save the mother would be okay. But the clinic should give it plenty of pain killer. hmm...mabye they should just overdose it with painkiller.\n\n \n We're all doomed to die :P The question is how long we live.\n \n How long must the baby be able to live outside the womb before we don't allow abortion (whether or not it kills the mother)? If it can only survive a day, is abortion still allowed?", 
   {}, 
   61691, 
   null, 
   1092291540.0
  ], 
  [
   61867, 
   null, 
   "unkerpaulie", 
   "i know my response is long overdue, but i feel i should bring some closure to this. im really glad sigma and everybody else participated, and one point was raised that i hadnt thought of, but that makes the topic more settled. the topic, again, was why is it ok to kill your child on the grounds that the woman simply doesnt want to be a mother. the key point raised, that is, was what sigma said about death being the only option DURING a pregnancy, whilst there are other avenues AFTER childbirth that makes death unjustifiable.\n \n i also appreciate duck's argument, but remember that the option of abortion because the pregancy/childbirth poses a health threat to the mother or baby, accounted for less than 7% of all abortions. the very vast majority of abortions do occur where the baby and mother are both healthy and no risk is involved. these abortions occur solely on the mother's decision to not face motherhood.", 
   {}, 
   61853, 
   null, 
   1092322440.0
  ], 
  [
   62146, 
   null, 
   "duck", 
   "We're all doomed to die :P The question is how long we live.\n \n How long must the baby be able to live outside the womb before we don't allow abortion (whether or not it kills the mother)? If it can only survive a day, is abortion still allowed?\n\n Let it live as long as it can. And when doctors are sure that it is going to die say in a few days or weeks, give it an overdose of painkiller.", 
   {}, 
   61853, 
   null, 
   1092452040.0
  ], 
  [
   62147, 
   null, 
   "duck", 
   "these abortions occur solely on the mother's decision to not face motherhood.\n \n That needs to be stopped.", 
   {}, 
   61867, 
   null, 
   1092452100.0
  ], 
  [
   62202, 
   null, 
   "jitobear", 
   "That needs to be stopped.\n\n \n Then we need to do a better job of equipping our women and girls.\n \n Pregnancy is HUGE. Preganancy makes you huge - ha ha (just a little joke there). The point is that pregnancy is no small matter - it is a massive undertaking. It is HUGELY impactful physically, mentally, emotionally and financially. It will change your moods, your body, and your behavior drastically. And that's just pregnancy. We won't even go into to parenting. And as it has been said before, nobody HAS to be a parent.\n \n How does somebody make a responsible choice at the correct time? Responsibility has to be learned. And to be responsible one has to be empowered. Taking away abortion and scolding women for having been such whores and using that pregnancy as their 'deserved punishment' will not help women and girls be responsible. And it doesn't address the man's role in baby making AT ALL.\n \n If we really, REALLY want to see abortion rates drop we really need to be a little more PRO-active. Banning abortion is RE-active and will result in MORE disempowered women and unwanted children, not to mention back alley butcher jobs.\n \n First of all, I am all about lots of free, cheap, easy, effective birth control (yep - even better than we have now). And education. Not just sex education. But classes that try to teach kids the realities of having kids. They have dolls now that are programmed to require certain responses from students - to try and impress on them the realities of what is invloved. W e could have single parents come talk to them about the realities of parenting, especially parents of their age. \n \n And you know what - no matter how hard we try to stress responsibility unplanned pregnancies will occur, and will occur to those who are not equipped as parents. So lets help - and do a better job than our current sad welfare programs. How can we help these people become successful parents raising sucessful kids? If we really care about kids, we don't stop at their birth. We need to quit demonizing those who need our help in this world as lazy and deserving of their situation. And once again, we will not be able to help that there will be those who abuse the system.\n \n And we need to teach our girls better. A long time ago girls were the property of their fathers until they become the property of their husbands. They were expected to be chaste until marriage, but ultimately they were not given control of their reproductive organs - at all. The only other option was becoming a nun - and women did take that route, in part, to take control of their lives and bodies.\n \n Today we no longer force women into marriage and they do have signifcantly more freedoms and rights - but there is still that underlying message that women must 'belong' to men. We say - BE RESPONSIBLE - in one hand, and give them the conflicting message that they should be in relations with a man in the other.\n \n Think about it. How many women and girls measure their joy and success by whether or not they are with a guy? How many are asked \"are you seeing someone?\" before \"how is school/work/etc.?\" How many young women hear at home and in other places pressures to get married? Women and girls hear it all the time. Women who decide not to have children, especially young women, frequently have their doctors refuse to do tubals. I have even seen pamphlets at more than one church directed at single women \"just because you are alone doesn't mean God doesn't love you...\" The responses I get because I choose to stay single and have decided not to remarry are incredible. Everyone \"is oh, don't say that, it will be OK, you will find somebody someday.\"\n \n Why in the heck do I have to find somebody? I am perfectly fine and capable and there is nothing wrong with being on my own.\n \n Nor am I trying to say relationships and/or marriage is a bad thing. If you get it in your life (and want it) that is wonderful. What I am saying is we need to stop making it THE GOAL of life - especially for girls. We need to stop making the life of a single woman shameful. If we empower girls like that - it will be a heck of a lot easier for them to be responsible at the right time, rather than thinking that saying no to sex will mean losing this person, and therefore their happiness.\n \n And at the end of the day. There will still be those who can not face a pregnancy for a miriad of reasons - health, financial, age, rape. Some pregnancies will have to be terminated. However, the best way to prevent abortion is to prevent the pregnancies. And human sexuality is far too complex for \"just say no'.", 
   {}, 
   62147, 
   null, 
   1092507180.0
  ], 
  [
   62234, 
   null, 
   "duck", 
   "How responsible do you have to be too not kill your kids!?", 
   {}, 
   62202, 
   null, 
   1092526320.0
  ], 
  [
   62269, 
   null, 
   "Sigma", 
   "How responsible do you have to be too not kill your kids!?\n\n \n Um... It depends on if you don't want to be caught I guess. If you dump the body in the ocean, you stand a better chance of getting away with it. \n \n Just don't be stupid about it and do it in their beds, then go out and buy a new mattress. Especially with a credit card. That is easily traced, always use cash. It might be responsible to keep a wad of cash handy, just for emergency killings. That way you can get away and won't be traced, at least not as easily.", 
   {}, 
   62234, 
   null, 
   1092544440.0
  ], 
  [
   62289, 
   null, 
   "duck", 
   "Um... It depends on if you don't want to be caught I guess. If you dump the body in the ocean, you stand a better chance of getting away with it. \n \n Just don't be stupid about it and do it in their beds, then go out and buy a new mattress. Especially with a credit card. That is easily traced, always use cash. It might be responsible to keep a wad of cash handy, just for emergency killings. That way you can get away and won't be traced, at least not as easily.\n\n Your really creepy. emoticon_xdonno", 
   {}, 
   62269, 
   null, 
   1092554880.0
  ], 
  [
   62301, 
   null, 
   "Sigma", 
   "Your really creepy. emoticon_xdonno\n\n \n You're the one who wanted to know how to responsibly kill your kids :P Don't know why you asked in an abortion forum, but it's been pretty slow so I thought I'd try and help", 
   {}, 
   62289, 
   null, 
   1092559260.0
  ], 
  [
   62302, 
   null, 
   "Sigma", 
   "i know my response is long overdue, but i feel i should bring some closure to this. im really glad sigma and everybody else participated, and one point was raised that i hadnt thought of, but that makes the topic more settled. the topic, again, was why is it ok to kill your child on the grounds that the woman simply doesnt want to be a mother. the key point raised, that is, was what sigma said about death being the only option DURING a pregnancy, whilst there are other avenues AFTER childbirth that makes death unjustifiable.\n \n i also appreciate duck's argument, but remember that the option of abortion because the pregancy/childbirth poses a health threat to the mother or baby, accounted for less than 7% of all abortions. the very vast majority of abortions do occur where the baby and mother are both healthy and no risk is involved. these abortions occur solely on the mother's decision to not face motherhood.\n\n \n It has been very engaging :) Thank you for your thoughts", 
   {}, 
   61867, 
   null, 
   1092559680.0
  ], 
  [
   62371, 
   null, 
   "duck", 
   "You're the one who wanted to know how to responsibly kill your kids :P Don't know why you asked in an abortion forum, but it's been pretty slow so I thought I'd try and help\n\n I said how responsible do you have to be.", 
   {}, 
   62301, 
   null, 
   1092632520.0
  ], 
  [
   62372, 
   null, 
   "Sigma", 
   "I said how responsible do you have to be.\n\n \n How responsible do you have to be to kill your kids? I dunno emoticon_frazzled \n \n That's a weird question. There isn't a good way to quantify an objective level of responsibility to do or not do a certain action.", 
   {}, 
   62371, 
   null, 
   1092632640.0
  ], 
  [
   62428, 
   null, 
   "jitobear", 
   "How responsible do you have to be too not kill your kids!?\n\n \n Why are you over-simplifying this?\n \n Do you have kids or have you ever been pregnant? The answer to both for me is yes. So let me state, being pregnant, having a baby and raising a child is no small matter. You have to be EXTREMEMLY responsible to do all three.\n \n Why do you seem to endorse nothing? Women should just be knocked up, happy about it, and have all the resources to deal with it - and all of that with no education, self-esteem, or empowerment? \n \n You might as well ask someone to bathe without water.\n \n I don't see how your response indicates that you actually care about the children that are born, and that you are more concerned with controling women.", 
   {}, 
   62234, 
   null, 
   1092678840.0
  ], 
  [
   62442, 
   null, 
   "Freedom_Fighter", 
   "Over the course of this debate many people have brought up the idea of control. A women has the right to control when she is pregnant, control over her body, etc. I agree with these ideas in principle, that is to say that a woman should have control over her life. However, I believe this control needs to start way before a woman decides that to \"control\" her life she needs to destroy the life growing inside her. Control needs to apply to things like abstinence and safe sex if you can't abstain for lack of control. When you make a decision like having sex you must realize that there could be effects that would result from this. STD's, pregnancy, and other things have a chance of resulting from sex. \n \n Fortunately for those who can't control themselves at the first level there is an escapist clause that exists. Well I'm not ready for a child, this isn't what I need right now, I don't think I can be a responsible parent...All of these things plus hundreds more that drive women into abortion clinics should be considered before conception rather than after conception. New data has shown that fetuses yawn, move around, suck their thumbs, even smile while in the womb..yet since people can't see this type of activity it is very easy to pretend it doesn't exist. When a child is killed after birth, the news and parents always display smiling or happy faces to show the horror of the tragedy. What if every woman who had an abortion was shown a picture of her infant with a smile on their face or sucking their thumb? Do you think that then people might realize that they have just extinguished a life that had a chance to be as viable or prolific as any other person alive today?\n \n Choice is granted as a means of control but the truth is that if choice had been used in the first place as control then abortion wouldn't be necessary. I choose to believe that within the human spirit there dwells a force that can make abortion unnecessary if used with due diligence and moral guidance.", 
   {}, 
   62428, 
   null, 
   1092683220.0
  ], 
  [
   62481, 
   null, 
   "unkerpaulie", 
   "Over the course of this debate many people have brought up the idea of control. A women has the right to control when she is pregnant, control over her body, etc. I agree with these ideas in principle, that is to say that a woman should have control over her life. However, I believe this control needs to start way before a woman decides that to \"control\" her life she needs to destroy the life growing inside her. Control needs to apply to things like abstinence and safe sex if you can't abstain for lack of control. When you make a decision like having sex you must realize that there could be effects that would result from this. STD's, pregnancy, and other things have a chance of resulting from sex. \n \n Fortunately for those who can't control themselves at the first level there is an escapist clause that exists. Well I'm not ready for a child, this isn't what I need right now, I don't think I can be a responsible parent...All of these things plus hundreds more that drive women into abortion clinics should be considered before conception rather than after conception. New data has shown that fetuses yawn, move around, suck their thumbs, even smile while in the womb..yet since people can't see this type of activity it is very easy to pretend it doesn't exist. When a child is killed after birth, the news and parents always display smiling or happy faces to show the horror of the tragedy. What if every woman who had an abortion was shown a picture of her infant with a smile on their face or sucking their thumb? Do you think that then people might realize that they have just extinguished a life that had a chance to be as viable or prolific as any other person alive today?\n \n Choice is granted as a means of control but the truth is that if choice had been used in the first place as control then abortion wouldn't be necessary. I choose to believe that within the human spirit there dwells a force that can make abortion unnecessary if used with due diligence and moral guidance.\n\n i think youre totally right. the thing is, humans seem to gravitate towards pleasure and self-gratification above anything else, even above self-preservation. thrill-seekers would put their life at risk for the exhilaration of freefalling from a plane, for instance. how could we possible encourage something like abstinence, chastity and waiting in a society where pleasure is constantly being marketed in the most revolutionary ways?", 
   {}, 
   62442, 
   null, 
   1092695280.0
  ], 
  [
   62505, 
   null, 
   "jitobear", 
   "Over the course of this debate many people have brought up the idea of control. A women has the right to control when she is pregnant, control over her body, etc. I agree with these ideas in principle, that is to say that a woman should have control over her life. However, I believe this control needs to start way before a woman decides that to \"control\" her life she needs to destroy the life growing inside her. Control needs to apply to things like abstinence and safe sex if you can't abstain for lack of control. When you make a decision like having sex you must realize that there could be effects that would result from this. STD's, pregnancy, and other things have a chance of resulting from sex. \n \n Fortunately for those who can't control themselves at the first level there is an escapist clause that exists. Well I'm not ready for a child, this isn't what I need right now, I don't think I can be a responsible parent...All of these things plus hundreds more that drive women into abortion clinics should be considered before conception rather than after conception. New data has shown that fetuses yawn, move around, suck their thumbs, even smile while in the womb..yet since people can't see this type of activity it is very easy to pretend it doesn't exist. When a child is killed after birth, the news and parents always display smiling or happy faces to show the horror of the tragedy. What if every woman who had an abortion was shown a picture of her infant with a smile on their face or sucking their thumb? Do you think that then people might realize that they have just extinguished a life that had a chance to be as viable or prolific as any other person alive today?\n \n Choice is granted as a means of control but the truth is that if choice had been used in the first place as control then abortion wouldn't be necessary. I choose to believe that within the human spirit there dwells a force that can make abortion unnecessary if used with due diligence and moral guidance.\n\n \n Of course the responsible decisions should happen befor one is pregnant! But they won't if we do not seriously educate and equip our girls. \n \n We don't.\n \n We teach them to make men the main focus and that will ultimately lead to sex.\n \n We also need to teach men better. The macho bravado and applause for the stud has also got to go.\n \n And if we want more people to embrace their unwanted pregnancies we need to stop treating them like punishment and reach out and help MORE (and in better ways).", 
   {}, 
   62442, 
   null, 
   1092700860.0
  ], 
  [
   62537, 
   null, 
   "Sigma", 
   "Choice is granted as a means of control but the truth is that if choice had been used in the first place as control then abortion wouldn't be necessary. I choose to believe that within the human spirit there dwells a force that can make abortion unnecessary if used with due diligence and moral guidance.\n\n \n I would be overjoyed if abortion was unnecessary. If every pregnancy was desired, and every child born was wanted, it would be unnecessary. However, to remove the choice would be the height of arrogance and amoral behavior.\n \n We need to educate women about birth control and self control. We need to educate men about birth control and self control as well. However, until both sexes exercises either or both, the choice of abortion will remain necessary.", 
   {}, 
   62442, 
   null, 
   1092712080.0
  ], 
  [
   62608, 
   null, 
   "Freedom_Fighter", 
   "I would be overjoyed if abortion was unnecessary. If every pregnancy was desired, and every child born was wanted, it would be unnecessary. However, to remove the choice would be the height of arrogance and amoral behavior.\n \n We need to educate women about birth control and self control. We need to educate men about birth control and self control as well. However, until both sexes exercises either or both, the choice of abortion will remain necessary.\n\n \n I never suggested to simply \"remove the choice,\" the demand must be removed or greatly reduced before that can happen. I am personally Pro-Life but I know that the problem with abortion in our society lies not in simple legislation but rather in a culture that demands that legislation. \n \n Yourself and jitobear are right when you say that we must educate both genders, everyone needs to understand the gravity of their actions and the consequences which can result from them. This is the first step in changing our culture one which doesn't need abortion as a choice. \n \n The answer to the abortion dilemma in our country is not to arbitrarily outlaw abortion or to allow unrestricted and unquestioned access to it. We must take this issue seriously and encourage women to research their options. Counseling, education, and proactive involvement in the family planning process must involve men and women at all levels so that everyone understands that this involves males and females and isn't just any single woman's problem.\n \n I hope that someday our society will reach a a point where abortion is a little used option that few, if any, still consider \"necessary.\" We've got a long way to go and both sides need to realize that we must make some tough decisions on the road ahead and stop thinking of the whole issue as black and white. If we work together to eliminate the demand rather than the choice itself, both sides win.", 
   {}, 
   62537, 
   null, 
   1092757800.0
  ], 
  [
   62663, 
   null, 
   "smearedblackink", 
   "What about when you are knowledgeable about types of birth control and STDS and your birth control method fails? The person knows enough and is responsible enough to educate him/herself, but the method fails. Should abortion be the next available choice?", 
   {}, 
   62608, 
   null, 
   1092764280.0
  ], 
  [
   62683, 
   null, 
   "Freedom_Fighter", 
   "What about when you are knowledgeable about types of birth control and STDS and your birth control method fails? The person knows enough and is responsible enough to educate him/herself, but the method fails. Should abortion be the next available choice?\n\n \n Those people who you define as \"knowledgeable\" should already be prepared for this possibility if they are truly worthy of that classification. If you know all there is to know about sex then you also know that the only method of birth control that is 100% effective is abstinence. With everything else responsible individuals have to consider the chance that a pregnancy might result from this. Ignorance of this possibility would not be seeking to control your future without considering abortion in the first place. So it wouldn't be a matter of \"the next available choice\" you would have to consider this in the first place.\n \n I don't think that abortion would have to be the next choice in any case though. There are other options at this level that need to be explored before one chooses abortion as a solution. Counseling, prayer, and reflection come to mind first, along with research about every option you have available. You may not be ready for a child at this moment, but could you put up with carrying a child to full term in order to give that child a fair chance in life? Could this posssibly be a blessing in disguise, if not for me then perhaps someone else? These are the kinds of questions that need to be asked and reflected upon before abortion should be looked at as \"the next available choice.\"", 
   {}, 
   62663, 
   null, 
   1092766920.0
  ], 
  [
   62845, 
   null, 
   "Sigma", 
   "\n I hope that someday our society will reach a a point where abortion is a little used option that few, if any, still consider \"necessary.\" We've got a long way to go and both sides need to realize that we must make some tough decisions on the road ahead and stop thinking of the whole issue as black and white. If we work together to eliminate the demand rather than the choice itself, both sides win.\n\n \n I agree with this. Once, and if, we as a society change to the point where sex isn't stigmatized and everyone is educated about sex and its consequences then there will be few abortions performed.", 
   {}, 
   62608, 
   null, 
   1092845580.0
  ], 
  [
   64936, 
   null, 
   "kickin50", 
   "Counseling, prayer, and reflection come to mind first, along with research about every option you have available.\n\n \n There are only 3 choices. Keep it, give it away, abort it. There just aren't any more. Research done.\n \n Counseling, prayer, and reflection....\n \n Counseling? NOT. This is a solitary decision. Counseling is an opportunity for another to \"help\" in making up your mind. What a terrible idea. The counselor doesn't have to live with the decision. Unless the \"counselor\" is offering real help, like grandma volunteering to babysit, forget it.\n \n Prayer? Hmmmmm. I don't think that He is going to speak.\n \n Reflection? Absolutely. A thoughtfully arrived at decision is a must.\n \n Would you be surprised to hear me say that, had I ever been faced with having to make this choice, the only one I could easily and quickly eliminate would be adoption. Maybe I'm just a controling personality. I could never allow another person to parent my child. I know it can work for others. Not me.", 
   {}, 
   62683, 
   null, 
   1093899840.0
  ], 
  [
   64951, 
   null, 
   "Sigma", 
   "There are only 3 choices. Keep it, give it away, abort it. There just aren't any more. Research done.\n\n \n Actually, there are only 2 choices during the pregnancy. Abort or continue. Adoption is a parenting choice, not a pregnancy one unless someone finds a way to transfer a fetus to another person.", 
   {}, 
   64936, 
   null, 
   1093903440.0
  ], 
  [
   64962, 
   null, 
   "kickin50", 
   "Actually, there are only 2 choices during the pregnancy. Abort or continue. Adoption is a parenting choice, not a pregnancy one unless someone finds a way to transfer a fetus to another person.\n\n \n Come to think of it, emoticon_xgood I guess you're right.", 
   {}, 
   64951, 
   null, 
   1093904580.0
  ], 
  [
   70737, 
   null, 
   "duck", 
   "Why are you over-simplifying this?\n \n Do you have kids or have you ever been pregnant? The answer to both for me is yes. So let me state, being pregnant, having a baby and raising a child is no small matter. You have to be EXTREMEMLY responsible to do all three.\n \n Why do you seem to endorse nothing? Women should just be knocked up, happy about it, and have all the resources to deal with it - and all of that with no education, self-esteem, or empowerment? \n \n You might as well ask someone to bathe without water.\n \n I don't see how your response indicates that you actually care about the children that are born, and that you are more concerned with controling women.\n\n Yes, I hate all women and want to control them like cattle. But how do you know that i'm not a woman.", 
   {}, 
   62428, 
   null, 
   1097299260.0
  ], 
  [
   72052, 
   null, 
   "Sigma", 
   "But how do you know that i'm not a woman.\n\n \n I think the question is: Why would we care?", 
   {}, 
   70737, 
   null, 
   1097998620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  is it wrong to kill your children?", 
  "url": "http://www.4forums.com/political/abortion-debates/2500-wrong-kill-your-children.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 2500, 
  "discussion_files": [
   [
    "22053.html", 
    "http://www.4forums.com/political/abortion-debates/2500-wrong-kill-your-children-print.html"
   ], 
   [
    "22054.html", 
    "http://www.4forums.com/political/abortion-debates/2500-wrong-kill-your-children-6-print.html"
   ], 
   [
    "22055.html", 
    "http://www.4forums.com/political/abortion-debates/2500-wrong-kill-your-children-4-print.html"
   ], 
   [
    "22056.html", 
    "http://www.4forums.com/political/abortion-debates/2500-wrong-kill-your-children-5-print.html"
   ], 
   [
    "22057.html", 
    "http://www.4forums.com/political/abortion-debates/2500-wrong-kill-your-children-3-print.html"
   ], 
   [
    "22058.html", 
    "http://www.4forums.com/political/abortion-debates/2500-wrong-kill-your-children-2-print.html"
   ]
  ], 
  "identifier": 2500
 }
]