[
 [
  [
   53099, 
   null, 
   "Traveler", 
   "Gay activists, demanding that gays be given the right to adopt and raise children, has been brought to the forefront of American politics. Society must ask itself a question, though. What effect will gays raising children have on the children themselves? The following studies below, shed light on more than one of the effects that lesbians raising children has on the children.\n \n \n 1.  Recent studies indicate that a higher proportion of children of lesbian parents are apt to engage in homosexual activity. Adolescent and young adult girls raised by lesbian mothers appear to be more sexually adventurous and less chaste.  (Judith Stacey and Timothy J, Biblarz, \"(How) Does the Sexual Orientation of Parents Matter,\" American Sociological Review 66 (2001): 174, 179)\n \n 2. Most studies on the positive aspects of homosexual parenting  \"rely on small samples of white, middle-class, previously married lesbians and their children. As a result we cannot be confident concerning the generalizability of many of their findings.\"  (David Demo and Martha Cox, 'Families with Young Children: A review of Research in the 1990's, \" Journal of marriage and the Family, 62 (2000), p.889)\n \n 3.  12% of the children of lesbians became adult lesbians themselves, a rate which is at least four times the base rate of lesbianism in the adult female population.  (Tasker and S. Golombok, \"Adults Raised as Children in Lesbian Families\" p. 213)\n \n 4.  64% of young adults raised by lesbian mothers reported considering having same-sex relationships. Only 17% of young adults in heterosexual families reported the same thing.  (Judith Stacey and Timothy Biblarz, (How does the Sexual Orientation of Parents Matter? \"American Sociological Review 66 (2001) 159-183)\n \n 5.  Golombok's and Taskers study revealed in its results a clear connection between being raised in a lesbian family and homosexuality: \"With respect to actual involvement in same-gender sexual relationships, there was a significant difference between groups...None of the children from heterosexual families had experienced a lesbian or gay relationship.\" By contrast, five(295) of the 17 daughters and one (13%) of the eight boys in homosexual families reported having at least one same-sex relationship. (Tasker and Golombok, \"Do Parents Influence the Sexual Orientation?\" p.7\n \n 6. Compared with children from traditional families, children from nontraditional families showed  more psychological problems  as rated by their  parents  (Study of 136 fifth-grade children and their parents in Vermont) (Phyllis Bronstein, JoAnn Clauson, Miriam Frankel Stoll, and Craig L. Abrams \" Parenting Behavior and Children's Social, Psychological and Academic Adjustment in Diverse Family Structure\" Family Relations Vol. 42 1993 Pages 268-276)\n \n Since homosexuals statistically make up only 1 to 3% of society (as the \"homosexuals and the 10% myth\" thread shows) it is rather disconcerting to see a higher occurence of lesbianism among adults who were raised as children by lesbian parents.", 
   {
    "post_info": {
     "post_title": "A higher proportion of children of lesbians parents engage in homosexual activity."
    }
   }, 
   null, 
   null, 
   1086472020.0
  ], 
  [
   53122, 
   null, 
   "JakeCJB", 
   "Thanks for the good news, Traveler!", 
   {}, 
   53099, 
   null, 
   1086498000.0
  ], 
  [
   53157, 
   null, 
   "Traveler", 
   "Thanks for the good news, Traveler!\n\n \n Good news? Is it good news that lesbians raising/adopting children is artificially increasing the odds that those girl children will become lesbians?\n \n And we thought that becoming gay couldn't be affected by outside forces/factors....that being gay was not a choice. If one can choose to become lesbian( as the studies show, lesbian parents raising children increases the odds that that those girls will become lesbians when adulthood is reached) then a lesbian can choose to become heterosexual... or in your world, Jake, is it a one-way street?", 
   {}, 
   53122, 
   null, 
   1086557940.0
  ], 
  [
   53164, 
   null, 
   "JakeCJB", 
   "I would have to assume there is something wrong with being gay or lesbian, or with experimenting with, or considering a gay or lesbian relationship, to see this as an issue. I don't assume this.\n \n The only study you posted worth considering, showed that children raised with homosexual parents are only more likely to consider a same-sex relationship or experiment with a same-sex relationship, but not more likely to be gay themselves, compared with children from heterosexual families...\n \n http://www.google.ca/search?q=cache:TPNpjWS0hp8J:www1.law.ucla.edu/~williamsproj/press/PerrinTechnicalReport.pdf+(Tasker+and+S.+Golombok,+%22Adults+Raised+as+Children+in+Lesbian+Families%22+p.+213)&hl=en\n \n http://www1.law.ucla.edu/~williamsproj/press/PerrinTechnicalReport.pdf.\n \n (scroll down to Page 2(Children's Gender Identity and Sexual Orientation) at the above link.\n \n Even if there were a higher rate of those who identify as gay with same-sex parents, this could simply mean that children with same-sex parents are generally more comfortable being honest with their parents about being gay, compared to children with heterosexual parents. Those heterosexual parents are more likely to be homophobic and heterosexist.", 
   {}, 
   53157, 
   null, 
   1086563400.0
  ], 
  [
   53246, 
   null, 
   "madg", 
   "Technical Report: Coparent or Second-Parent Adoption by Same-Sex Parents\n \n Abstract:\n \n A growing body of scientific literature demonstrates that children who grow up with 1 or 2 gay and/or lesbian parents fare as well in emotional, cognitive, social, and sexual functioning as do children whose parents are heterosexual. Children's optimal development seems to be influenced more by the nature of the relationships and interactions within the family unit than by the particular structural form it takes.", 
   {
    "unicode_changes_made": true
   }, 
   53164, 
   null, 
   1086643860.0
  ], 
  [
   53248, 
   null, 
   "sinjin", 
   "\n Even if there were a higher rate of those who identify as gay with same-sex parents, this could simply mean that children with same-sex parents are generally more comfortable being honest with their parents about being gay, compared to children with heterosexual parents. Those heterosexual parents are more likely to be homophobic and heterosexist.\n\n \n This is where I'd put my money.", 
   {}, 
   53164, 
   null, 
   1086644160.0
  ], 
  [
   53251, 
   null, 
   "Tastyfish", 
   "Also so what? If you don't have a problem with gay couples adopting children then what is the problem with those children being more likely to be gay as well. Only really a problem if you object to the first bit and don't think gay couples should exist anyway. If you have no problem with gay people then what is worng with gay couples making more?", 
   {}, 
   53248, 
   null, 
   1086646620.0
  ], 
  [
   53741, 
   null, 
   "weasel fierce", 
   "so gay couples contribute to reducing over population, in other words ?\n \n I dont see a big problem here.", 
   {}, 
   53251, 
   null, 
   1087151040.0
  ], 
  [
   53743, 
   null, 
   "Tastyfish", 
   "Not nessearily, these lesbian households are having children, and I would guess donor sperm would be used more than adoption.", 
   {}, 
   53741, 
   null, 
   1087151280.0
  ], 
  [
   53985, 
   null, 
   "Phunting", 
   "My only homophobic friend is so because of his overly traditional parents. Therefore I see such parents as a major source of homophobic idiocy. I assume that gay parents wouldn't push this on their kids, so any gay kids wouldn't have to repress their true feelings and could actually be open about who they are much more easily. Hence the statistical difference.", 
   {}, 
   53743, 
   null, 
   1087317900.0
  ], 
  [
   54939, 
   null, 
   "Jaaaman", 
   "so gay couples contribute to reducing over population, in other words ?\n \n I dont see a big problem here.\n\n The big problem here is marriage (that is, the one between a man and a woman) is the only type of couple capable of natural reproduction of the human race. Children need both mothers and fathers, and marriage is society's way of obtaining them.\n \n But even childless marriages are a social anchor for children, who observe adults as role models. Besides, childless couples can be \"surprised\" by an unexpected pregnancy, and they can adopt, giving a child a mother-and-father-based family. Single parents can eventually marry. And marriage is a stabilizing force for all. Even when a couple is past the age of reproduction, the marital commitment may keep an older man from fathering a child with a younger woman outside wedlock. \n \n Children learn crucial things about family life by observing our crucial relationships up close: interactions between men and women; husbands and wives, mothers and fathers, and parents to children of the same and opposite sexes.\n \n Human experience and a vast body of social science research show that married men and women, and children who live with their married mother and father, are happier, healthier, and more prosperous than people in other types of households.\n \n It is wrong to create fatherless or motherless families by design. The drive for homosexual \"marriage\" leads to destruction of the gold standard for custody and adoption. The question should be: \"What is in the best interests of the child?\" The answer is: \"Place children, whenever possible, in a married, mom-and-dad household.\" As homosexual relationships gain status, marriage loses its place as the preferential adoption family option. This effort is being driven by the desires of adults, not the needs of children.\n \n Society grants benefits to marriage because marriage has benefits for society. The benefits of marriage to adults and children flow not from government recognition alone, but from the inherent complementarity of the sexes and the power of lifelong commitment. The first of these values is rejected outright by same-sex couples, and the second is far less common among them.", 
   {}, 
   53741, 
   null, 
   1087880940.0
  ], 
  [
   54944, 
   null, 
   "Tastyfish", 
   "So in your opinion, a single parent family is better than two women who love each other?\n \n If a childless couple is still a good example then why won't the lesbian couples friends fufill this role?\n \n In fact in earlier, less socially equal times the children would have very little to do with the father who would be out hunting/fighting/earning and would be raised originally by a group of females collectively and later by a nanny or the mother o her own. Both parents being involved in childcare and upbringing of offspring is a relatively modern concept", 
   {}, 
   54939, 
   null, 
   1087881780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A higher proportion of children of lesbians parents engage in homosexual activity.", 
  "url": "http://www.4forums.com/political/gay-rights-debates/2514-higher-proportion-children-lesbians-parents-engage-homosexual-activity.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 2514, 
  "discussion_files": [
   [
    "11239.html", 
    "http://www.4forums.com/political/gay-rights-debates/2514-higher-proportion-children-lesbians-parents-engage-homosexual-activity-print.html"
   ]
  ], 
  "identifier": 2514
 }
]