[
 [
  [
   53149, 
   null, 
   "georged", 
   "IMO he's obviously the fall guy for the administration's intelligence failures regarding WMD in Iraq, but the real question is was he ever suited to run our spook agency. \n \n http://www.reuters.com/newsArticle.jhtml?type=topNews&storyID=5351638\n \n A career bureaucrat, Tenet was an acknowledged master in Washington CYA expertise, and experienced success through that traditional civil service longevity methodology of always agreeing with the boss no matter what issue was in play and never, never going outside the box. Interviews with former CIA officials who served in the CIA's predecessor and then the CIA itself state that the agency evolved into a typical federal bureaucracy with mediocre middle and line management recruitment of similar minded staff, with concentration on salary, benefits, grade advances and retirement becoming the agency's central focus (no pun intended). \n \n Former CIA heads, and those who have and do head other nations foreign intelligence operations, have been mostly men with independent means not tied to the public trough for economic requirements. They could and did think outside the box, with varying degrees of success, but never experienced a failure even close to Tenet's analysis of pre-invasion Iraq. IMO that position has become indicative of our poorly managed governments at all levels, now virtually controlled by seniority, union bargaining and lawsuits. I don't see any easy solutions, the new CIA head will be a political reward for loyalty, but would enjoy seeing an individual, not one of the faceless bureaucrats in that position. Dream on, right?", 
   {
    "post_info": {
     "post_title": "CIA's Tenet"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1086547200.0
  ], 
  [
   53159, 
   null, 
   "billsco", 
   "I agree he's the fall guy, and I see a similarity of his legacy to that of the previous director of the FBI, Louis Freeh. Freeh was well liked on Capitol Hill, cultivating friendships with senators and representatives with his famous power lunches, but it leaves an outsider like me wondering: what exactly did he do to make us safer?", 
   {}, 
   53149, 
   null, 
   1086559200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  CIA's Tenet", 
  "url": "http://www.4forums.com/political/current-events-debates/2517-cias-tenet.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 2517, 
  "discussion_files": [
   [
    "10294.html", 
    "http://www.4forums.com/political/current-events-debates/2517-cias-tenet-print.html"
   ]
  ], 
  "identifier": 2517
 }
]