[
 [
  [
   53403, 
   null, 
   "Gup20", 
   "One note I would have in the creation vs evolution debate is that Evolution is, by definition, exclusionary to non-naturalistic causes or events. This is contrasted by Creation which says that God created everything. \n \n The thing I would like to point out, however, is that Evolution and Creation do not 'prove' or 'disprove' one another. They are alternative views. There is a very clear reason for this. Evolution is exclusionary to supernatural influence. Therefore, all interpretations of evidence will follow this presupposition. Evolution is the study of the origin of life from a completely naturalistic point of view. It's causes must be naturalistic, and it's conclusions must be naturalistic. It is exclusionary to the very possibility of supernaturalistic influence. As such it cannot be used to 'prove' (or judge) between evolution and creation. It can be presented as an alternative view... and we can argue over which one should believe... however evolution does not disprove creation. In order to prove or judge between them, both sides must be taken into consideration and evolution, as a science, does not take both sides into consideration. By definition, it can only take one side into consideration. \n \n The same can be said for Creation however. The majority of creation theory is taken from the Christian Bible, and therefore it is exclusionary (in it's plainest literal interpretation) to 'millions of years' theories. Some have tried to 'fit' this in, but truely it doesn't fit. Therefore the views are mutually exclusive and cannot be used to 'prove' or 'disprove' each other. We can certainly argue about the merits of each - but when it comes right down to it, it's a matter of which origin view you CHOOSE to accept, and one cannot be used to rule out the other... they must be presented side by side as alternatives. As no person alive today was there to see what 'actually' happened, we must take the various 'experts' and make the decision for ourselves which to believe.", 
   {
    "post_info": {
     "post_title": "Evolution - Alternative, not proof"
    }
   }, 
   null, 
   null, 
   1086812760.0
  ], 
  [
   53407, 
   null, 
   "Ursus maritimus", 
   "Hello, Gup20. Welcome to 4forums. I hope you enjoy the discussions here, and I hope we can learn a lot from each other.\n \n That said, I need to correct several errors.\n \n \nEvolution is the study of the origin of life from a completely naturalistic point of view.\n\n Actually, evolution, as used by biologists, is not the study of origins of life. It is the theory that explains how new species arise, and why the present species (and past species in the fossil record) have the characteristics that they do, not only in form but also in spatial and temporal extent.\n \n \n \nWe can certainly argue about the merits of each - but when it comes right down to it, it's a matter of which origin view you CHOOSE to accept, and one cannot be used to rule out the other... they must be presented side by side as alternatives.\n\n The problem with this is that it is too simplistic. Data cannot simply be interpreted any way that you choose. For example, you can certainly believe anything you want about gravity. However, the data is quite unequivocal - if you leap off of a tall building, you are going to fall down and hit the ground hard enough to do yourself serious damage. You can do all the theorizing that you want, you can accept any theory you want, but I strongly advise you not to leap off of a tall building.\n \n In the same way, the data really is quite compelling - the earth is very, very ancient and life on earth has a long, long history. The fossil record is just one line of evidence among very many, including genetic and molecular evidence as well. It really is really a strain to try to fit the physical evidence to a \"creation model\" -- which is why I had to abandon creationism as a credible model for the history of life back when I was in high school.", 
   {}, 
   53403, 
   null, 
   1086815880.0
  ], 
  [
   53409, 
   null, 
   "The Barbarian", 
   "It should also be noted that the Bible is by no means supportive of a young Earth. In fact, most Christians accept that it is very old.", 
   {}, 
   53407, 
   null, 
   1086818520.0
  ], 
  [
   53426, 
   null, 
   "Close_slave_can", 
   "Most jews and muslims also don't think that the idea of a universe billions of years old does not contradict their version of genesis. As for no-one being there to witness what happened I would compare it to how we treat suspected murderers. Police would look at the evidence and the jury decides wether or not you go to jail. Sometimes mistakes happen and I really hate the way people indirectly imply mistakes never happen and exceptions to not exist. The legal system is not certain it is right but it acts as though it is because otherwise nothing could be done. Looking at the universe and making picking the most reasonable conclusions is a better than saying that all conclusions are equally valid because the humans that make them are flawed.", 
   {}, 
   53409, 
   null, 
   1086830460.0
  ], 
  [
   53427, 
   null, 
   "Gup20", 
   "I see that no one has responded to the primary point of the post - that being that as Evolution is a naturalistic science and is, by definition, exclusionary to the supernatural, it cannot be used to prove or disprove creation. \n \n Equally, as (young earth) creation is based on the Bible, and therefore rules out a completely naturalistic means to life as it exists today, it also cannot be used to prove or disprove evolution. \n \n The two ideas are alternatives to each other, not proofs against one another. \n \n Frequently in creation vs evolution discussions I see 'creation is wrong because x,y,z aspects of evolution disprove it'. Or, 'evolution is wrong because x.y.z aspects of creation disprove it'. This, however is fallicious. The ideas are merely alternatives. \n \n Can we agree that the merit of each theory is separate and must stand on it's own evidence irrespective of the other theory?", 
   {}, 
   53426, 
   null, 
   1086831600.0
  ], 
  [
   53429, 
   null, 
   "The Barbarian", 
   "I see that no one has responded to the primary point of the post - that being that as Evolution is a naturalistic science and is, by definition, exclusionary to the supernatural, it cannot be used to prove or disprove creation.\n\n \n Depends on what you mean by \"exclusionary to the supernatural.\" If you mean that it can't evalutate supernatural beliefs, that's right. If you mean that it rules out the supernatural, that's wrong.\n \n \nEqually, as (young earth) creation is based on the Bible,\n\n \n More precisely, YE creationism is based on the interpretation of the Bible by certain 7th Day Adventists around the turn of the century.\n \n \nand therefore rules out a completely naturalistic means to life as it exists today,\n\n \n Not if you accept Genesis. God says in Genesis that life began by natural means.\n \n \nit also cannot be used to prove or disprove evolution. \n\n \n True.\n \n \nFrequently in creation vs evolution discussions I see 'creation is wrong because x,y,z aspects of evolution disprove it'. Or, 'evolution is wrong because x.y.z aspects of creation disprove it'. This, however is fallicious. The ideas are merely alternatives.\n\n \n Science is inconsistent with creationism, but not creation.\n \n \nCan we agree that the merit of each theory is separate and must stand on it's own evidence irrespective of the other theory? \n\n \n There is a theory of evolution. Creationism, however, is a religious belief. And they occupy two different realms of thought. If that's what you mean, you are right.", 
   {}, 
   53427, 
   null, 
   1086832860.0
  ], 
  [
   53431, 
   null, 
   "Ursus maritimus", 
   "I see that no one has responded to the primary point of the post - that being that as Evolution is a naturalistic science and is, by definition, exclusionary to the supernatural, it cannot be used to prove or disprove creation.\n\n A more accurate statement is that evolution is a scientific theory, and therefore cannot prove or disprove anything.\n \n It is not the place in science to prove or disprove anything. The most that is done is that predictions are made based on the theory, and then data is collected to see if the predictions are observed. After 150 years, much data has been collected. Predictions based on evolution were either confirmed, or, in some cases, the theory was modified in small ways to take into account of the data. The result is that evolution is the most successful theory in the history of science.\n \n One example, from the thread I linked to, is the fossil record. We note that, even according to Linnaeus' classification, humans are in the same order (Primates) as apes. If Darwin's theory is true we should see we should find fossils of species that show characteristics intermediate between humans and earlier apes. Such fossils have been found, confirming the theory; look at the Lucy thread, and read ungerdunn and my comments on Australopithecus afarensis, as well as the information in the links I provided.. Incidently, Darwin noticed that the more human-like apes, chimpanzees and gorillas, live in Africa; he then hypothesized that humans evolved in Africa. He then predicted that fossil ancestors would be found in Africa. This additional hypothesis has also been confirmed since all human ancestors up until Homo erectus have been found in Africa. This does not prove evolution; despite all of the tests that evolution has passed, it is possible that there is another theory, or set of theories, that will explain the fossil record, the Linnaean classification, the genetic and molecular data, and so forth. I cannot conceive of what such a theory might be, but it is possible that such a theory exists, and when presented tests will demonstrate that it is a better theory than evolution -- the tests will consists on determining how observations will differ if each theory is accurate, and then collecting the necessary data.\n \n Creationism, on the other hand, as far as I am aware does not make any except the vaguest of predictions -- and so far as any prediction of phenomena differs from a prediction from evolution, evolution has always won.\n \n The only reason that science cannot study the supernatural is that the supernatural, at least as I understand the term, is not subject to any sort of regularity. That is, one cannot make up a supernatural hypothesis and then predict a consistent set of phenomena that one would see if the hypothesis were true. If the supernatural were subject to some sort of regularity, then we would probably just call this regularity a \"natural\" phenomenon. But I may be mistaken here -- how do you define supernatural, and how would you go about investigating the supernatural scientifically?\n \n \n \n \nCan we agree that the merit of each theory is separate and must stand on it's own evidence irrespective of the other theory?\n\n Indeed. That is how theories are evaluated. Each one is evaluated according to how well the evidence supports it; and if the data is insufficient to distinguish between two theories, then both theories are tentatively accepted as plausible.\n \n But this is not the case with evolution vis a vis creationism. Evolution has passed every test for a century and a half. Creationism, on the other hand, either makes no testable predictions, or when someone does make predictions based on creationism, the evidence then refutes it.\n \n Edited to add:\n The Barbarian replied as I was writing this. After reading his post, I should clarify that I am referring to Young Earth Creationism.", 
   {}, 
   53427, 
   null, 
   1086833640.0
  ], 
  [
   53434, 
   null, 
   "Gup20", 
   "More precisely, YE creationism is based on the interpretation of the Bible by certain 7th Day Adventists around the turn of the century.\n\n \n More precisly than that - YE creationism based on what everyone claiming to be a Jew or Christian believed up until Darwin popularized his version of ancient greek and hindu mythologies. The hindus have believed that animals turn into higher animals and eventually into men long before Darwin popularized it as a scientific theory. The ancient greeks also held beliefs of molecules to man evolution amoung their mythologies and ideas. \n \n \nNot if you accept Genesis. God says in Genesis that life began by natural means.\n\n \n In fact taking the plainest literal interpretation (read intended interpretation) of Genesis, one can only conclude that there is not room for millions of years in the earth's history. For example - in Genesis 1 the Bible talks about the days of creation. These can only possibly mean literal solar days. It says 'and the evenning and the morning was the first day'. Each day has this descriptive. The Hebrew word for Day is YOM, which can mean a literal 24 hour day... but it can also mean an age, or a period of time. Theistic evolutionists often try to fit millions of years into these days... however, hebrew grammer is quite sound in Genesis. Whenever YOM is used in conjuction with the word evening, it means a literal day... whenever YOM is used in conjunction with the word morning it means a literal day. Here, we see YOM used with both evening and morning... clearly the author intends to demonstrate this is a literal day. If we apply the same standard (a plain, literal interpretation) to the rest of Genesis 1 -11 it is quite clear that there is, in fact, no room for millions of years in the Bible. Also, it is quite clear that Geneis is written in a matter of fact historical tone. This is quite clear when reading the geneologies as it is clear the author was forming a clear history by making the geneologies so complete. For example ... it doesn't simply say Adam begat seth, who begat .... it says that Adam beget seth when he was X years old... seth begat so and so when he was Y years old... etc etc. Here we can see a clear chronological timeframe without gaps. No where to put millions of years, I am sorry to tell theistic evolutionists. \n \n \nScience is inconsistent with creationism, but not creation.\n\n \n Not really. This is a pretty common misconception, however, so don't feel bad.\n \n \nThere is a theory of evolution. Creationism, however, is a religious belief.\n\n \n Again, this is a common misconception... especially to those coming out of the public education system. There are indeed theories of creationism that are scientifically viable - although not as refined as modern evolutionary theories - they are credible and they agree with a Young Earth Creationist view. \n \n \n \n \n \nThe result is that evolution is the most successful theory in the history of science.\n\n \n I would agree that evolution has been successful. However, I think that trend is starting to change. In the last 20 years we have seen YE creationism begin to pick up steam and credibility - something it has been lacking for some time. \n \n Regarding Lucy - According to Richard Leakey, who along with Johanson is probably the best-known fossil-anthropologist in the world, Lucy's skull is so incomplete that most of it is 'imagination made of plaster of paris'. Leakey even said in 1983 that no firm conclusion could be drawn about what species Lucy belonged to. (from Lucy isnt the Missing Link )\n \n \nCreationism, on the other hand, as far as I am aware does not make any except the vaguest of predictions -- and so far as any prediction of phenomena differs from a prediction from evolution, evolution has always won.\n\n \n In fact as YEC comes along, they are starting to make more and more predictions. Perhaps I will start a thread with some.", 
   {}, 
   53431, 
   null, 
   1086837840.0
  ], 
  [
   53438, 
   null, 
   "Ursus maritimus", 
   "Hello, Gup20. I'm glad to see that you are willing to hang around and discuss these issues.\n \n \n \nMore precisly than that - YE creationism based on what everyone claiming to be a Jew or Christian believed up until Darwin popularized his version of ancient greek and hindu mythologies.\n\n This is false. Until Darwin, most Christians were Old Earth Creationists, since that was what the geologic record showed. Christian geologists were looking for signs of Noah's Flood, realized that what they were seeing was evidence of several different glaciations which need far more time than a 6000 year earth can provide. Ironically, it was Charles Darwin who started Young Earth Creationism; most Christians were content to accept the findings of geology. But some Christians were so repelled by the idea that humanity may have evolved from apes that they reacted by insisting on a literal interpretation of Genesis.\n \n \n \n \nThe hindus have believed that animals turn into higher animals and eventually into men long before Darwin popularized it as a scientific theory.\n\n Are you sure about this? I haven't heard this before. I know that some devout Hindus do not believe in evolution; they also believe that dinosaurs and humans coexisted, they just accept the fact that this occurred millions of years ago.\n \n \n \nThe ancient greeks also held beliefs of molecules to man evolution amoung their mythologies and ideas.\n\n Some philosophers hypothesized some sort of evolution. But this was never incorporated into the popular myths. \n \n \n \nThere are indeed theories of creationism that are scientifically viable - although not as refined as modern evolutionary theories - they are credible and they agree with a Young Earth Creationist view. \n\n Seeing that this is a debate board, we are all eager for you to present these credible theories. ;)\n \n \n \nRegarding Lucy - According to Richard Leakey, who along with Johanson is probably the best-known fossil-anthropologist in the world, Lucy's skull is so incomplete that most of it is 'imagination made of plaster of paris'.\n\n There are pretty complete skulls from other specimens of the same species. And we have enough bones from Lucy, and enough bones from other specimens, that we can compare the bones that are in common - Lucy is definitely Austalopithecus afarensis. In the Lucy thread I have supplied some links that describe some of the fossils that exist. By the way, 1983 is a long time ago scientifically -- a lot happens in science in 20 years. For instance:\n \nDiscovered by Bill Kimbel and Yoel Rak in 1991 at Hadar in Ethiopia (Kimbel et al. 1994).... This is a 70% complete skull of a large adult male....\n", 
   {}, 
   53434, 
   null, 
   1086839400.0
  ], 
  [
   53446, 
   null, 
   "The Barbarian", 
   "The Bear beat me to it. And he did a fine job, so I'll forgo a reply of my own.", 
   {}, 
   53438, 
   null, 
   1086842820.0
  ], 
  [
   53463, 
   null, 
   "OccamsRazor", 
   "\n Are you sure about this? I haven't heard this before. I know that some devout Hindus do not believe in evolution; they also believe that dinosaurs and humans coexisted, they just accept the fact that this occurred millions of years ago.\n \n\n \n Hello Ursus maritimus emoticon_smile\n \n This is an unusual viewpoint Gup is advocating. The following article sheds some light on the idea:\n \n \nEvolutionary naturalism: an ancient idea\n \n The theory of biological evolution is not a modern idea as is often supposed. Organic evolution was first taught by the Greeks at least as early as the 7th century BC. Greek philosophers probably borrowed and adapted their evolutionary ideas from the Hindus, who believed that souls transformed from one animal to another until they reached a perfection state called nirvana. Charles Darwin allegedly made no contributions to the development of the theory of evolution by natural selection, but simply helped to popularize it. Evolutionists today argue that evolution is a modern idea (i.e. a product of scientific research), in part as an effort to lend credibility to their worldview.\n \n Ancient theories of evolution\n It is frequently implied that the theory of biological evolution is a modern idea-a product of our advanced scientific age. Conversely, a creationist worldview is often criticized as being a product of our less informed ancestors, and that this view is now a disproven relic of the past. Where have I heard that on this forum before? -Gup\n \n The Mayan culture began about 600 BC, and its religion incorporated a 'streamlined evolution' that taught that the rain-god constructed humans by adding to (and thereby modifying) his previous creations. This rain-god first made rivers, then fish, next serpents and, last, humans. The members of a totem clan believed:\n \n 'themselves to be of one blood, descendants of a common ancestor. ... Thus, the Turtle clan of the Iroquois are descended from a fat turtle, which, burdened by the weight of its shell in walking ... gradually developed into a man. The Cray-Fish clan of the Choctaws were originally cray-fish and lived underground, coming up occasionally through the mud to the surface. Once a party of Choctaws smoked them out, and, treating them kindly ... taught them to walk on two legs, made them cut off their toe nails and pluck the hair from their bodies, after which they adopted them into the tribe. But the rest of their kindred, the cray-fish, are still living underground. The Osages are descended from a male snail and a female beaver.'1\n \n The relationship of totemism to evolution is described in more detail in the following quote:\n \n 'The luck attributed to a rabbit's foot stems from a belief rooted in ancient totemism, the claim, predating Darwinism by thousands of years, that humankind descended from animals. Differing from Darwinism, however, totemism held that every tribe of people evolved from a separate species of animal. A tribe worshiped and refrained from killing its ancestral animal and employed parts of that animal as amulets, called totems.'2\n \n One of the first evolutionary theories was proposed by Thales of Miletus (640-546 BC) in the province of Ionia on the coast near Greece. He was also evidently the first person to advance the idea that life first originated in water.3 Birdsell notes that Thales' view of biological evolution 'was not too far from modern truth'. One of Thales' students, Anaximander (611-547 BC), developed these ideas further, concluding that humans evolved from fish or fishlike forms.4 These fish-men eventually cast off their scaly skin and moved to dry land where they have been ever since.\n \n The Greek philosopher Empedocles (493-435 BC), often called the father of evolutionary naturalism, argued that chance alone 'was responsible for the entire process' of the evolution of simple matter into modern humankind.5 Empedocles concluded that spontaneous generation fully explained the origin of life, and he also taught that all living organism types gradually evolved by the process of trial-and-error recombinations of animal parts.6 He also believed that natural selection was the primary mechanism of evolution, the fittest being more likely to survive to pass their traits on to their offspring.7\n \n In short, Empedocles' pre-Darwin 'survival-of-the-fittest' theory taught that life evolved by pruning the less-fit life forms-i.e. the merciless destruction of the weaker animals and plants. Unfortunately, many early Greek manuscripts have been lost, but the texts that survive provide enough details to determine with some accuracy what the ancient Greeks believed. This evidence motivated Osborn to conclude that 'Darwin owes more even to the Greeks than we have ever recognized.'8\n \n Evidence also exists that the Greek philosophers gleaned their evolution-of-life ideas from the Hindus, who believed that souls transformed from one animal to another until they reached a level of perfection called nirvana. Both the Greeks and Hindus also could have obtained their evolution-of-life ideas from even more ancient peoples. Aristotle (384-322 BC) claimed that humans are the highest point of one long, continuous 'ascent with modification' of life.7 Modern scientific research, though, has found that that natural selection often does not eliminate weak individuals in a species. Evidence now points to the conclusion that nearly all extinctions are the result of chance and/or human mismanagement.9 Natural selection cannot create, but can only prune the less-perfect organisms, serving primarily to slow the rate of biological degeneration.10\n \n Nor is the paleontological record, as a putative evidence of evolution, a recent conclusion. The first person 'known to have explicitly recognized fossils as memorials of geological change and the succession of life' was evidently Xenophanes of Colophon.11 Some speculate that Thales and Anaximander also may have concluded that the fossil evidence supported biological and geological evolution.\n \n Modern theories of evolution: did Darwin contribute?\n Darwin was not even the first modern-day biologist to develop the idea of organic evolution. De Vries noted that\n \n 'evolution, meaning the origin of new species by variation from ancestor species, as an explanation for the state of the living world, had been proclaimed before Darwin by several biologists-thinkers, including the poet Johann Wolfgang Goethe in 1795. Jean-Baptiste de Lamarck in 1809, Darwin's grandfather, the ebullient physician-naturalist-poet-philosopher Erasmus Darwin, and in Darwin's time anonymously by Robert Chambers in 1844.'12\n \n Even Darwin's commonly alleged major contribution to evolution, natural selection, was developed earlier by others including William Charles Wells in 1813, and later Alfred Russell Wallace. Wallace sent Darwin a copy of his paper describing his independently developed theory of evolution by natural selection in 1858.13 De Vries noted that some critics have concluded that Darwin actually made no major new contributions to this theory.\n \n The modern theory of biological evolution probably was first developed by Charles De Secondat Montesquieu (1689-1755), who concluded that 'in the beginning there were very few [kinds of] species, and they have multiplied since'.14 Another important evolutionist was Benoit de Maillet (1656-1738), whose book on evolution was published in 1748. In his book, de Maillet taught that fish were the forefathers of birds, mammals and men.15 Maupertuis wrote in 1751 that new species may result from the fortuitous recombining of different parts of living beings. About this same time, Diderot the Encyclopedist taught that all animals came from one primeval animal, and that this prototype was fashioned by nature into all those types of animals alive today.16 George Louis Buffon (1707-1788) even expounded the idea that 'the ape and man had a common ancestry'. Macrone notes that while Darwin indeed gave evolution a firmer scientific basis,\n \n 'he was hardly the first to propose it. A century before Darwin the French naturalist Georges Buffon wrote extensively on the resemblance among various species of birds and quadrupeds. Noting such similarities and also the prevalence in nature of seemingly useless anatomical features (such as toes on a pig), Buffon voiced doubts that every single species had been uniquely formed by God on the fifth and sixth days of creation. Buffon suggested in guarded language at least a limited sort of evolution that would account for variances among similar species and for natural anomalies.'17\n \n One of the most important pre-Darwinists was Charles Darwins' grandfather, Erasmus Darwin (1731-1802). He expounded his ideas at length in his book Zoonomia, published in 1794. This work was no obscure volume, but sold well and even was translated into German, French and Italian. Darlington argued that Erasmus Darwin 'originated almost every important idea that has since appeared in evolutionary theory', including natural selection.18 Darwin admitted that he probably got many of the major portions of his biological evolution theory from his grandfather.\n \n It usually is asserted that Erasmus Darwin's view was less well developed than Charles Darwin's and was actually erroneous in many areas. Desmond King-Hele made an excellent case for the view that Charles Darwin's theory, even 'in its mature form in the later editions of the Origin of Species, is, in some important respects, less correct than that of Erasmus'.19 Both writers stressed that evolution occurred by the accumulation of small fortuitous changes that then were sifted by natural selection. Erasmus wrote that\n \n 'in the great length of time since the earth began to exist, perhaps millions of ages before the commencement of the history of mankind, would it be too bold to imagine, that all warm-blooded animals have arisen from one living filament, which THE GREAT FIRST CAUSE endued with animality, with the power of acquiring new parts, attended with new propensities, directed by irritations, sensations, volitions, and associations; and thus possessing the faculty of continuing to improve by its own inherent activity, and of delivering down those improvements by generation to its posterity, world without end!'20\n \n Charles Darwin even evidently accepted Lamarckian evolution to a greater extent than did Erasmus, a conclusion that proved to be a major blunder for him.21 For example, in explaining the evolution of the giraffe's long neck, Darwin accepted the validity of evolution by use and disuse although in this case he also used natural selection as the major explanation of giraffe neck evolution.22\n \n Another important pre-Darwinian book was Robert Chambers' Vestiges of the Natural History of Creation, which was published in 1844. Without this book, Darwin said he might never have written Origin of Species.23 In a summary of this work, Crookshank concluded that Chambers (1802-1871) believed that the extant varieties of humans resulted from evolutionary advances and regressions. Yet another person who came up with Darwin's main conclusions was Patrick Matthew. Matthew,\n \n 'whose priority was acknowledged later by both Charles Darwin and Edward Blyth, anticipated all Darwin's main conclusions by 28 years, yet he thought them so little important that he published them as an appendix to his book on naval timber and did not feel the need to give substance to them by continuous work. Darwin's incessant application, on the other hand, makes one think that he had found in evolution and its related concepts not merely a scientific theory about the world, but a vocation: he had discovered the theory and practice of himself.'24\n \n Not only is evolutionary naturalism an old idea, but the creation-evolution conflict is ancient as well:\n \n 'In the eighteenth-century European \"Age of Reason\", an attempt at a complete separation of faith and reason, coupled with a belief in the self-sufficiency of reason to explain all causality, precipitated what Andrew White later called the \"warfare of science with theology\". Yet, even in Aristotle's time the ideas of Democritus and the Atomists and the reflections of Empedocles on gradual adaptation and change in organisms must have stimulated conflict between religion and natural science.'25\n \n Darwin's work was only the '\"palace coup\" among the elite, the final act in a long drama, with the real fight to establish a lawful, evolutionary worldview among the \"people\" taking place a generation earlier'.26\n \n Summary\n Although Charles Darwin was highly successful in popularizing the idea of organic evolution by natural selection, he was by no means the originator of the theory as commonly supposed. Nor was Darwin the originator of even those aspects of the evolution theory for which he is most often given credit today-natural selection and sexual selection. Organic evolution is part of the past and present culture of many nations, and is not a modern (or even an exclusively scientific) idea as is often claimed. This claim often is an attempt to give the theory credibility. This fact was expressed well by one evolutionist when he wrote that the 'idea of miraculous change, which is supposed to be an exclusive prerogative of fairy-tales, is a common phenomenon of evolution ...'.27\n \n The popularity of the modern evolutionistic worldview is not, as many assume, because modern science has replaced old superstitions about origins. Evolution's acceptance has much more to do with the use of the tools of science by multi-thousands of dedicated researchers, using the billions of dollars provided by governments to build a case for an ancient theory intended to support the atheism that now dominates both science and our increasingly secular society. This fact is important because the claim that Darwinism is a modern scientific idea is used as a major argument for its validity. Sourced from AiG\n\n \n I won't comment (yet at least) as I have already done so elsewhere.", 
   {
    "unicode_changes_made": true
   }, 
   53438, 
   null, 
   1086867420.0
  ], 
  [
   53492, 
   null, 
   "Ursus maritimus", 
   "Occam! Since you single me our for a greeting, I am assuming that you already know who I am? I was very pleased to see your handle listed under the newest member thingee. You are, I am assuming, someone I \"know\" on other boards whose handles are various variations of \"Occam\". At any rate, welcome to 4forums.\n \n \nThis is an unusual viewpoint Gup is advocating.\n\n Yes, I'm not sure of the point. It seems to be an ad hominem -- trying to disparage Darwin, or at least impugn his intellectual accomplishments, in order to cast doubt on the theory of evolution, rather than deal with the theory itself.\n \n From the AiG article:\n \nThe theory of biological evolution is not a modern idea as is often supposed.\n\n No, it is not. However, science as we know it was not \"invented\" until about the time of the European Renaissance, so the earlier philosophical ideas certainly would not count as scientific. What happened in the 18th and 19th centuries was that people were putting forth scientific theories of biology and geology. Darwin's accomplishment was to put forth a theory of evolution whose causes were well understood scientific principles, and by which one can make scientific predictions of phenomena that should be observed. Darwin's was one of the first scientific theories of evolution.\n \n \n \nDarwin was not even the first modern-day biologist to develop the idea of organic evolution.\n\n Nor does anyone (at least anyone acquainted with the history of science) claim that he did. Darwin built upon the work of others -- he even explicitly acknowledges the debt he owes to others. This is the way science works in general. The TV myth that a scientists suddenly makes an earth shattering, brand new discovery is just that -- a myth. Scientists always build upon and extend the existing science. Even if you believe in Kuhn's paradigm ideas (like I do), a paradigm shift never occurs all at once - the \"revolution\" occurs over years, incrementally, starting out by extending the previous paradigm, but then workers then slowly add to the new developing paradigm, until, in the end, it is recognized that a new paradigm is in place.\n \n \n \nWallace sent Darwin a copy of his paper describing his independently developed theory of evolution by natural selection in 1858. De Vries noted that some critics have concluded that Darwin actually made no major new contributions to this theory. [Emphasis added.]\n\n But most do recognize Darwin's accomplishment. This is like saying that Newton made no major new contributions to Calculus. Of course he did -- the Fundamental Theorem being the important one. But Newton brought all of what we know as Calculus together in a unified theory, and he spent years and years applying calculus to solve hitherto unasked questions -- there are even complex calculations that a student learns in an upper level multivariable calculus course or a differential geometry course that were first worked out by Newton.\n \n Darwin was the first to unify the ideas of biological evolution with the idea of common descent, and to propose natural selection as the mechanism that accomplishes this. Before this, natural selection was seen as a conservative force that weeded out extreme variations, maintaining the species in its \"archetypical\" morphology. He also was the first to spend large amounts of time collecting data, making detailed observations himself or scouring the published reports of others, making a huge base of data to support his theory. He was also one of the first to make predictions based on his theory, and, as already stated, to collect data to see if the predictions were observed. He also came up with the idea of sexual selection as an observed application of the ideas of natural selection in an unexpected manner.\n \n As far as Wallace's contributions - it is known that Wallace independently came up with the theory of natural selection. Funny that creationists seem to think evolution was invented and promoted by atheist as a deliberate attempt to escape belief in God - but two people independently coming up with the theory would suggest that there is something...obvious about it. And Wallace, by the way, was a deeply devout Christian. He oppose Darwin's later attempts to explain the \"essential\" human characteristics of intelligence, consciousness, what we would think of as the \"soul\", as a mere development of characteristics that we see in the \"lower\" animals.\n \n \n \nCharles Darwin even evidently accepted Lamarckian evolution to a greater extent than did Erasmus, a conclusion that proved to be a major blunder for him. For example, in explaining the evolution of the giraffe's long neck, Darwin accepted the validity of evolution by use and disuse although in this case he also used natural selection as the major explanation of giraffe neck evolution.\n\n This is a great blunder. \"Lamarckian\" evolution was not simply that offspring inherit characteristics acquired by their parents. This was not the essence of Lamarck's ideas, and this is not what makes Lamarck's theories wrong.\n \n Of course, for any theory of biology, heredity must be explained. And everyone realized that new characteristics do pop up - you didn't have to be an evolutionist to realize that offspring sometimes exhibit characteristics that were never evident in any ancestor. Today, we can explain this through genetic mutations. But genetics had not yet been discovered in Darwin's day. Of course an evolutionist, like Darwin and Lamarck, needed a source of new variation -- after all, it was, and is, obvious that evolution has and does occur. Animal and plant breeders know that there must be a source of new variation. The theory of pangenesis was as good a theory as any could come up with until genetics was discovered.\n \n What makes Lamarck different from Darwin, and wrong according to current understanding, was the philosophy of Lamarckian evolution. Lamarck believed that there was progress to be seen in the evolution of each species, that within each species there was some force that drives a species to become better - to fit into it's environment better.\n \n Darwin on the other hand, did not believe in \"progress\" in evolution. He realized that the driving force was quite mundane -- the vast majority of individuals in any population of organisms will die without leaving any offspring behind. And those that survive and reproduce will be those that have physical characteristics that give them an advantage over those that don't survive. Species do not evolve to fit an environment - species involve so that individuals can compete with other members of the species (and other species that may provide competition for the same resources). Darwin provided a definite driving mechanism based on material causes, whereas Larmarck's cause was a less well-defined philosophic principle.\n \n Do you have a link to your earlier comments on this, Occam? I would be interested to see what your take on this is.", 
   {
    "unicode_changes_made": true
   }, 
   53463, 
   null, 
   1086892980.0
  ], 
  [
   53494, 
   null, 
   "Gup20", 
   "This is false. Until Darwin, most Christians were Old Earth Creationists, since that was what the geologic record showed.\n\n \n I would reject this as complete fallicy. Up until the the Bible was printed in english, most people couldn't read it for themselves. They relied on the catholic church to tell them what it said - and the catholic churches position was that God created the earth in 7 literal days. \n \n Once the Bible was printed in english, the most obvious and plain reading of the Bible was that God created the earth in 7 days - and probably all Biblical scholars agreed that this was true. It wasn't until the popularization of Darwin's book \"On the Origin of Species by Means of Natural Selection, or the Preservation of Favoured Races in the Struggle for Life\" that the ideas of evolution and millions of years took on popularity. \n \n \nIronically, it was Charles Darwin who started Young Earth Creationism; most Christians were content to accept the findings of geology. But some Christians were so repelled by the idea that humanity may have evolved from apes that they reacted by insisting on a literal interpretation of Genesis.\n\n \n This is a good example of revisionist history. There is absolutely no basis in fact for these two sentiments. Charles Darwin was a humanist, and certainly did not 'start young earth creationism'. I think most clear thinking people - creationist or evolutionist would agree with me on this. \n \n So Charles Darwin is the father of Young Earth Creation is he? Well, I really don't know if I can take anything else you say seriously after this... you clearly have issues with deception, and you have been convinced of revisionist history. \n \n \nAre you sure about this? I haven't heard this before. I know that some devout Hindus do not believe in evolution; they also believe that dinosaurs and humans coexisted, they just accept the fact that this occurred millions of years ago.\n\n \n Why would a devout hindu believe in a hybrid version of his original belief? If they are devout, wouldn't they be 'devoted' to their original belief?\n \n \nSeeing that this is a debate board, we are all eager for you to present these credible theories. \n\n \n In due time. I am trying to remain on topic, however. \n \n \nThere are pretty complete skulls from other specimens of the same species. And we have enough bones from Lucy, and enough bones from other specimens, that we can compare the bones that are in common - Lucy is definitely Austalopithecus afarensis.\n\n \n Sadly, in this regard the public are often misled by inaccurately reconstructed statues and images of Lucy displayed at museums and in textbooks, etc., as her feet (and hands, for that matter) are often portrayed as startlingly human-like (typical 'revisionist history'). Many evolutionists themselves concede such errors, acknowledging that australopithecine hands and feet were 'not at all like human hands and feet; rather, they have long curved fingers and toes' - even more so than apes today that live mostly in the trees. Also, careful study of the skeletal anatomy of australopithecine fossils indicates a stooped gait, probably similar to the 'rolling' knuckle-walk of chimps. \n \n \n My buddy OccamsRazor - good work my friend. That AiG article is sourced from here.", 
   {
    "unicode_changes_made": true
   }, 
   53463, 
   null, 
   1086893700.0
  ], 
  [
   53500, 
   null, 
   "Ursus maritimus", 
   "I would reject this as complete fallicy.\n\n You can reject it if you want. The fact is that an earth far, far more ancient than 10,000 years was already known well before Darwin. Look up Lyell and Hutton. Well before Darwin there were long disputes, sometimes acrimonious, among geologists about the processes that produced the geologic features that were observed - uniformitarianism vs. catastrophism, whether most rocks were igneous or precipated, and so forth - and all of these arguments were based on the acceptance by each side that the earth was millions of years old.\n \n I don't know what the Catholic doctrine on origins was at this time - but it is well known that the Church never accepted that the entire Bible was to be literally interpreted. Biblical criticism began, as a serious study, in the 18th century, and most of the major Protestant Churches also accepted that the Bible was not to be intepreted literally in its entirety. To say that all Christians, or even to say most Protestant Christians, were Biblical literalists is itself historical revisionism.\n \n I admit I don't know what the doctrinal stand of the major Protestant denominations was in regard to the question of origins. However, it was accepted in scientific circles that the earth was millions of years old. I assume that the majority of well-educated people were familiar with this and accepted it. Since the prominent people in society tended to be the prominent people in the established religious organizations, I assume that the major denominations either accepted or at least were not antagonistic to the idea that the Genesis account was not literal history. I could be wrong about this. It is possible that the Churches did speak against geologic science at this time and tried to promote a literal reading of Genesis. I just have no information on this.\n \n However, I am aware that there were no major debates at this time between religious leaders and prominent geologists. I am aware of no major disputes. If there was a dispute, it was mostly quiet and amicable. It is not until Darwin published The Origin of Species and people realized the implications for human origins that one first sees the hysterical reaction of Christians. And the reaction is still against human evolution - I am not aware of any major debates where Christians argue against the age of the earth until the 20th century.\n \n Perhaps there were. This is you opportunity to educate me. If you want, you can simply make unsubstantiated assertians. If you want you can simply \"refuse to take me seriously\". Or you can provide me evidence of the disputes and debates that you think existed at this time.\n \n \n \n \nIt wasn't until the popularization of Darwin's book \"On the Origin of Species by Means of Natural Selection, or the Preservation of Favoured Races in the Struggle for Life\" that the ideas of evolution and millions of years took on popularity.\n\n This is false. Lyell's book on geology was very popular well before Darwin even went on his around the world trip.\n \n \n \n \nCharles Darwin was a humanist, and certainly did not 'start young earth creationism'.\n\n I did not mean that Darwin started YEC. I meant that YEC was a reaction against Darwinist. I maintain that as an organized religious force, YEC was not a significant movement before Darwin published Origin, that most religious people, at least prominent people, accepted an ancient earth, and that YEC is a reaction against Darwin's notion that humans were not divinely created, but the product of mundane natural forces.\n \n Personally, I think my intention was clear in what I wrote, but maybe it wasn't. On the other hand...\n \nWell, I really don't know if I can take anything else you say seriously after this... you clearly have issues with deception, and you have been convinced of revisionist history.\n\n ...this makes me suspect that you had no intent of taking anything I said seriously and were looking for something by which to discredit me. If what I said was unclear, I apologize for the misunderstanding; but I do feel that I was pretty clear.\n \n \n \nWhy would a devout hindu believe in a hybrid version of his original belief? If they are devout, wouldn't they be 'devoted' to their original belief?\n\n So far you have not demonstrated that you actually know what the original belief was -- you have only asserted that you know. Do you have any access to works written by practicing Hindus? If all you are reading are fundamentalist apologetics, I will have to warn you that as a former fundamentalist Christian I have found works written by fundamentalists to not generally be accurate in describing what other people actually do believe.\n \n At any rate, you may be right: the subject of Hindu belief may not be very relevant here.\n \n \n \nSadly, in this regard the public are often misled by inaccurately reconstructed statues and images of Lucy displayed at museums and in textbooks, etc., as her feet (and hands, for that matter) are often portrayed as startlingly human-like (typical 'revisionist history').\n\n There is already a thread started on Lucy. I suggest keeping topics more or less separated -- just to avoid confusion, and to avoid repeating the same thing on multiple threads. In that thread, ungerdunn and I have already commented on the relevance of reconstructed statues and images.", 
   {}, 
   53494, 
   null, 
   1086898980.0
  ], 
  [
   53501, 
   null, 
   "unkerpaulie", 
   "I see that no one has responded to the primary point of the post - that being that as Evolution is a naturalistic science and is, by definition, exclusionary to the supernatural, it cannot be used to prove or disprove creation. \n \n Equally, as (young earth) creation is based on the Bible, and therefore rules out a completely naturalistic means to life as it exists today, it also cannot be used to prove or disprove evolution. \n \n The two ideas are alternatives to each other, not proofs against one another. \n \n Frequently in creation vs evolution discussions I see 'creation is wrong because x,y,z aspects of evolution disprove it'. Or, 'evolution is wrong because x.y.z aspects of creation disprove it'. This, however is fallicious. The ideas are merely alternatives. \n \n Can we agree that the merit of each theory is separate and must stand on it's own evidence irrespective of the other theory?\n\n I think i disagree with the majority of people that have already posted here. evolution and creationism are mutually exclusive, and the both cannot be true at the same time, since there can be only one true way that life originated (even though i know that \"evolution\" is not the correct term to describe the origin of life, and die-hard evolutionist might chew me out for using it wrongly. I prefer to use the term \"spontaneous origin\" rather than \"evolution\"). since creationism and the collection of spontaneous origin theories are mutually exclusive and cannot coexist, then upon proving either you automatically disprove the other. and if a 3rd unforseen theory is proven as the real way life originated on earth, then it would automatically disprove the both creationism and the current spontaneous origin theories\n \n the 2 concepts are pretty much diametrically opposed right now, both competing for evidence to support its case, and a strengthening of one theory automatically implies a weakening of the other\n \n \nThe hindus have believed that animals turn into higher animals and eventually into men long before Darwin popularized it as a scientific theory. \n\n \n Are you sure about this? I haven't heard this before. I know that some devout Hindus do not believe in evolution; they also believe that dinosaurs and humans coexisted, they just accept the fact that this occurred millions of years ago.\n\n hindus believe in reincarnation, and that when a person or animal dies, he is reborn as another organism. whether you progress or decline in your animal state depends on your karma and what not. in that religion a man can be reborn as a rat, or a goat can be reborn as a man, so there is not direct progression of species or anything like that, and it is certainly not a theory for the rise of entirely new species", 
   {}, 
   53427, 
   null, 
   1086899460.0
  ], 
  [
   53513, 
   null, 
   "Gup20", 
   "The fact is that an earth far, far more ancient than 10,000 years was already known well before Darwin. Look up Lyell and Hutton.\n\n \n Look up Moses... look up John. 6000 years ago there were eyewitnesses to the fact. Noah and his sons were eyewitnesses to the flood. Their direct decendent Moses wrote it down. I would say that people have been believing this for far longer than any theory of evolution. Also, if you go back and look at the MOST ancient of ancient chinese religions (some of the oldest known writings in the world) you will find that the oldest Chinese diety, ShangDi, so closely resembles the God of the Hebrews. For example -\n \n Genesis says:\n 'In the beginning God created the heaven and the earth. The earth was without form, and void; and darkness was on the face of the deep. ...\n \n And God said, \"Let the waters under the heaven be gathered together unto one place, and let the dry land appear\"; and it was so. And God called the dry land Earth, and the gathering together of the waters called He Seas. ...\n \n And God made two great lights: the greater light to rule the day, and the lesser light to rule the night: He made the stars also. ...\n \n So God created man in His own image; ...' (Genesis 1:1-2, 9-10, 16, 27-28)\n \n \n The ancient Chinese text says \n 'Of old in the beginning, there was the great chaos, without form and dark. The five elements [planets] had not begun to revolve, nor the sun and moon to shine. You, O Spiritual Sovereign, first divided the grosser parts from the purer. You made heaven. You made earth. You made man. All things with their reproducing power got their being'\n \n (you can see my source for this information)\n \n Clearly those closer to these events would have more clear, first hand knowledge. We can see many similarities between the accounts in Genesis and ancient Chinese history (for example - chinese history includes information about the a global flood). Nearly all cultures in the world have some ancient global flood mythology. Compare that with the fact that it is pretty hard to point to any area on earth where scientists don't find some reason to believe that there was a flood there at some time. Yet, oh no there couldn't have been a global flood... that would mean that all of our interpretations of geologic layers would have to be totally re-interpreted... that would mean that the Bible is accurate in it's history... no... that just can't be. emoticon_ic \n \n Never mind that all we see is 'billions of dead things burried in rock layers laid down by water all over the earth'. \n \n Polar bear, you can make up all the facts you want, but it doesn't make them true. Any person claiming Charles Darwin to be the originator of Young Earth Creationism needs a reality check. \n \n PB: uniformitarianism vs. catastrophism\n \n That's the first bit of sense you've made yet. Indeed the creation science vs evolution theory debate involves very deeply uniformitarianism vs. catastrophism. For those who are unaware - uniformitarianism is basically the concpept that everything we see today is exactly as it has always been - that through observing the way things happen now we can assume that it has always happened in this way. For example - if plate tectonics move at a rate of X... that means they have always been moving at that rate throughout history.\n \n PB: and all of these arguments were based on the acceptance by each side that the earth was millions of years old.\n \n Riiiight.... and charles darwin is the one who started Young Earth Creationism... I think we get the picture here. \n \n \nI don't know what the Catholic doctrine on origins was at this time - but it is well known that the Church never accepted that the entire Bible was to be literally interpreted.\n\n \n Quite demonstrably, you don't know what the original doctrines were. In fact 'the church' was called 'the church' long before it was called Catholic. The church was started by Jesus disciples - they all believed entirely that the scripture was true 100% (they had the old testament at that time). Jesus himself was a YEC and quoted genesis and reference the creative week as a real event. \n \n \nTo say that all Christians, or even to say most Protestant Christians, were Biblical literalists is itself historical revisionism.\n\n \n Certainly all christians today do not believe it 100%. Today, I would say that the majority of those professing to be christian believe in some form of evolution. However, the vast, vast majority of christians did believe in a literal creative week and a young earth up until the time when Darwin's work became popular. At that time, those opposing the churche's doctrine of young earth were the minority. From darwin's time until the present, that trend has been reversed. Currently, evolution is the dominant theory. However, this trend is now in the first stages of another reversal. The YEC movement around the world is gathering momentum. \n \n PB: I assume that the majority of well-educated people were familiar with this and accepted it.\n \n In that assumption, you would be incorrect. Here are a few names of people who were young earth scientists before, during, and after darwin's age:\n \n Francis Bacon (1561-1626) Scientific method \n Johann Kepler (1571-1630) Scientific astronomy\n Blaise Pascal (1623-1662) Hydrostatics; Barometer \n Robert Boyle (1627-1691) Chemistry; Gas dynamics \n Thomas Burnet (1635-1715) Geology \n Isaac Newton (1642-1727) Dynamics; Calculus; Gravitation law; Reflecting telescope; Spectrum of light (wrote more about the Bible than science, and emphatically affirmed a Creator)\n John Woodward (1665-1728) Paleontology \n William Whiston (1667-1752) Physics, Geology\n John Hutchinson (1674-1737) Paleontology\n Carolus Linneaus (1707-1778) Taxonomy; Biological classification system \n Jean Deluc (1727-1817) Geology \n John Dalton (1766-1844) Father of the Modern Atomic Theory; Chemistry\n Michael Faraday (1791-1867) Electro magnetics; Field theory, Generator \n Samuel F. B. Morse (1791-1872) Telegraph\n Joseph Henry (1797-1878) Electric motor; Galvanometer\n Henry Rogers (1808-1866) Geology\n Sir Henry Rawlinson (1810-1895) Archeologist \n James Joule (1818-1889) Thermodynamics\n Gregor Mendel (1822-1884) Genetics\n Louis Pasteur (1822-1895) Bacteriology, Biochemistry; Sterilization; Immunization \n L. Merson Davies (1890-1960) Geology; Paleontology \n Dr John Mann, Agriculturist, biological control pioneer\n \n Most of these are common names to anyone with a high school education or higher. Many of them are pioneers in their field. Clearly they believed in a young earth, and it didn't hinder them from making startling discoveries. These were well educated men who's contributions were invaluable to scientific progress. \n \n \nIf you want you can simply \"refuse to take me seriously\". Or you can provide me evidence of the disputes and debates that you think existed at this time.\n\n \n So says the person who claims Charles Darwin started Young Earth Creationism without presenting a single shred of evidence, and against all accepted norms. \n \n I would take you more seriously if you had more to back up your wild claims. As it is, you simply stated the exact opposite of what every other person I have encountered has to say, and expect the novel eccentricity of the statment to carry some sort of weight. \n \n OccamsRazor - you have always seemed like a clear thinking person - despite our disagreements. Am I remiss in scoffing at the notion that Darwin is the originator of Young Earth Creationism? Does anyone else here hold this notion to be true? I would doubt it. \n \n \nThis is false. Lyell's book on geology was very popular well before Darwin even went on his around the world trip.\n\n \n You see to be having a hard time making a distinction between popularly accepted and scientifically accepted. While the ideas of millions of years may have been gaining acceptance among the scientific community in that time... the ideas were not popularly accepted (accepted by a majority of 'the people') until Darwin published his \"origin of species / preservation of favored races\" book. This is important because it demonstrates the time of transition from plausible theory to accepted mainstream framework. \n \n \nI maintain that as an organized religious force, YEC was not a significant movement before Darwin published Origin, that most religious people, at least prominent people, accepted an ancient earth, and that YEC is a reaction against Darwin's notion that humans were not divinely created, but the product of mundane natural forces.\n\n \n While I respect the clarification on Darwin starting YEC (as opposed to YEC being a reaction to Darwin), I would still emphasize that you are emphatically incorrect. You see, one did not NEED to identify themselves as a YEC before Darwin popularized evolutionary thought. The vast majority of scientists simply held the Bible as true and there was no argument about it. Newton, for example, wrote: 'I have a fundamental belief in the Bible as the Word of God, written by men who were inspired. I study the Bible daily'. He also wrote, 'Atheism is so senseless. When I look at the solar system, I see the earth at the right distance from the sun to receive the proper amounts of heat and light. This did not happen by chance'. YEC was around and accepted as fact long before Darwin. However, after Darwin evolutionary thought gained popularity and became the new 'accepted fact'. Therefore YEC was identified as separate at that time - however as I have shown YEC by no means was 'born' or 'started' at that time. It was simply given a label once it was no longer the predomiant accepted idea. \n \n I am taken back by your revisionist history, however. Do you mind if I ask where you learned this version of history? \n \n \n...this makes me suspect that you had no intent of taking anything I said seriously and were looking for something by which to discredit me. If what I said was unclear, I apologize for the misunderstanding; but I do feel that I was pretty clear.\n\n \n Make no mistake - nothing I say will credit or discredit you. You would have done a fine job of discrediting yourself had you continued to assert that Darwin was the one who started YEC. Here is what you said: \"Ironically, it was Charles Darwin who started Young Earth Creationism;\" you continued \"some Christians were so repelled by the idea that humanity may have evolved from apes that they reacted by insisting on a literal interpretation of Genesis.\" \n \n I can see now, with your additional clarification, that you intended to convey that YEC is a reaction to Darwin's favored races book. I do find it odd, however, that you fail to see that Darwin's work was a change from the commonly accepted idea of YEC. \n \n \n fundamentalist\n \n Ah... one of my favorite titles. As I have pointed out in the past (to which OR can probably attest) fundamentalism is only bad if the thing fundamentally held to is bad. For example - if a baseball player 'really knows the fundamentals' or is 'fundamentally sound' it is generally considered a good thing. Those who engage in shoddy ad hominem try to use this word 'fundamentalist' to paint those they argue with with a negative brush. However, I would say that I am a fundamentalist, Bible believing christian as well as a YEC. Truely the message of the Bible is hope, love, and redemption. Being 'fundamentally loving' is not a negative for me. One main reason 'fundamentalism' is given such a negative connotation is because the the September 11th attack on NewYork's World Trade Center Towers. Because 'fundamentalist islamics' were touted over and over again by the news and media, this word fundamentalist has come to be associated and mean 'extremeist or terrorist'. But, as I have pointed out before, you don't see christians blowing themselves up in crowded areas - you don't see christians claiming you will go to heaven if you murder non-believers. The reason fundamentalist islamics are bad is because 'fundamentally' Islam is bad. It is a religion of murder and evil. If someone wont' convert, you are supposed to kill them. If you die while killing a Jew or a Christian, you and your family go to heaven (it's in the quran). \n \n PB: At any rate, you may be right: the subject of Hindu belief may not be very relevant here.\n \n I dont' recall stating that the subject of Hindu belief wasn't relevant. In fact, evolution is not a new or modern idea it is simply an old religion mixed with modern humanism for credibility. \n \n PB: There is already a thread started on Lucy. I suggest keeping topics more or less separated\n \n Agreed. \n \n \n...\n\n \n Wow - an actual response to the topic thread. Fabulous!\n \n I guess I really wouldn't argue to fiercely with anything you have to say. I don't agree 100% but the disagreements are minor semantics and probably not worth making a fuss over. \n \n Furthermore, you raise a most excellent issue. You said \n \n \"evolution and creationism are mutually exclusive, and the both cannot be true at the same time, since there can be only one true way that life originated\"\n \n You have come to the conclusion which one must come to when dealing with this debate - what is TRUTH. In reality, there is only one truth. Truth is finite and absolute. \n \n Which is where the Bible comes in - for those who believe in it, it is a revelation of absolute truth, from the one and only absolute God. YEC starts with Scripture as the basis and foundation of all truth. All evidence is interpreted under this framework. Evolution, however, is not based on absolute truth. It is based on the fallible theory of man. At it's essence it is based on humanism. The root of humanism is that man determines truth for himself separate from God. Therein lies the root of the creation vs evolution debate. This is one reason why the debate never ends... it's like doctors arguing over the symptoms rather than the illness itself.", 
   {
    "unicode_changes_made": true
   }, 
   53501, 
   null, 
   1086909780.0
  ], 
  [
   53518, 
   null, 
   "thebootfitter", 
   "Clearly those closer to these events would have more clear, first hand knowledge.\n\n Gup -- Consider something for a moment...\n \n If a literal interpretation of Genesis is correct, then there would have been no human being in existence to witness the creation of the universe in which we reside. No one would have been any physically closer to the events of creation than we are today. Perhaps they were closer in time, but what does time matter when one does not exist?\n \n In other words, any humans that were created after everything else was already created wouldn't have known how long everything else was in existence.\n \n \nWhich is where the Bible comes in - for those who believe in it, it is a revelation of absolute truth, from the one and only absolute God.\n \n And what about for those who do not 'believe in' the Bible the same way you believe in the Bible? Is the Bible NOT a revelation of absolute truth?\n \n The fact is... Truth is truth. And your beliefs, while they may or may not coincide with some or all aspects of that truth, have no bearing on the truth of that truth. Does this make any sense? No matter what you believe, your beliefs do not change the truth that already exists. Your beliefs are completely independent of the truth that already exists. \n \n So, you believe X. And another person believes Y. Who is right? You will never KNOW within this physical realm when X and Y deal with matters outside of this physical realm. You only have belief.\n \n The history of this earth and of life on this earth is of the physical realm. It can be studied. Evidence exists. The nature of the supernatural creation is not of the physical realm. It cannot be studied. It can only be believed.", 
   {}, 
   53513, 
   null, 
   1086911280.0
  ], 
  [
   53519, 
   null, 
   "Waxy", 
   "Gup20,\n \n I'm on pins and needles waiting for your proof that YEC is taking over from \"evolution\". (I hate using the term in that sense.)\n \n I'd be particularly interested in any geologically based info you have to support YEC. Some of your assertions have me \"chomping at the bit\" so to speak. However, PLEASE do not post the dinosaur/human tracks thing again.\n \n As for the whole Darwin dispute. I think this is more of a communication problem than anything. I don't think Ursus stated that Darwin is singlehandedly responsible for the creation of YEC thinking anymore than Gup20 stated that Darwin did not have any affect on YEC. I think you both are in the middle, and only remain apart by choice.\n \n Allow to me to clarify if you will, based on my interpretation. Ursus is stating that there was a movement, however big or small, toward acceptance of the earth being \"old\" as was evidenced from geology and chemisty. This evidence was largely accepted and \"rationalized\" by believers. However, when Darwin proposed his theory of evolution, it caused a backlash among believers that lead to an increase in hard line YEC beliefs. I have no problem with that assertion, to my mind, it makes perfect sense. I suspect that Gup20 would not be diametrically opposed to this assertion either.\n \n Forgive me if I have misrepresented either of you.\n \n BTW Gup20, I've got an MSc in geology, and I have NEVER heard of the geologists on your list. I could, however, go on at length about those who have been cited by Ursus. Educational bias? Perhaps.\n \n Waxy", 
   {}, 
   53513, 
   null, 
   1086911400.0
  ], 
  [
   53520, 
   null, 
   "Waxy", 
   "Look up Moses... look up John. 6000 years ago there were eyewitnesses to the fact. Noah and his sons were eyewitnesses to the flood.\n\n \n I guess so, if you believe John, Moses and his sons are any more real beings than Santa Claus. I think you'd have a hard time proving that. Therefore the testimony is heresay at best, irrelevent most likely.\n \n \nCompare that with the fact that it is pretty hard to point to any area on earth where scientists don't find some reason to believe that there was a flood there at some time. Yet, oh no there couldn't have been a global flood... that would mean that all of our interpretations of geologic layers would have to be totally re-interpreted... that would mean that the Bible is accurate in it's history... no... that just can't be. emoticon_ic\n \n Never mind that all we see is 'billions of dead things burried in rock layers laid down by water all over the earth'. \n \n \n Do you have any interpretations?\n \n Again, I'm dying to hear them.\n \n \nWhich is where the Bible comes in - for those who believe in it, it is a revelation of absolute truth, from the one and only absolute God. YEC starts with Scripture as the basis and foundation of all truth. All evidence is interpreted under this framework. Evolution, however, is not based on absolute truth. It is based on the fallible theory of man. At it's essence it is based on humanism. The root of humanism is that man determines truth for himself separate from God. Therein lies the root of the creation vs evolution debate. This is one reason why the debate never ends... it's like doctors arguing over the symptoms rather than the illness itself.\n\n \n I agree with you here, mostly. However, without faith, ultimately, both trains of thought are based on the fallible workings of the human mind.\n \n You state the Bible is the one supreme truth as though it is an accepted and demonstrable fact. I would argue that it is not. For those that are not believers, it is a book, written by man, no different than any other book. Creationism is based on this fallible work of man.\n \n I tended to agree with your first post. Both \"theories\" are just different interpretations, put forth by humans, based on where they feel their trust is best placed - naturalistic or supernatural. In the end, neither one more \"provable\" than the other.\n \n Waxy", 
   {}, 
   53513, 
   null, 
   1086912300.0
  ], 
  [
   53523, 
   null, 
   "T.Q", 
   "Gup, why is it that you are reposting the same tired arguments that you ran from on the other board? Reincarnation=evolution, Greek philosophers thinking animals come from slime=evolution, transitionals=distinct created kinds to fit a variety of environments (never mind the fact that you never did answer how it is that these seperate kinds are found in the fossil record in chronological order (ie most amphibious in older strata, most reptilian in younger). \n Then you trot out your list of scientists who believed in YEC. Never mind that the evolutionary theory hadn't even been though of yet when most of them were alive, and was in its infancy when most of the rest were alive and working. As I said before, according to your reasoning, automobiles can't exist because Leonardo Da Vinci didn't believe in them.", 
   {}, 
   53520, 
   null, 
   1086915960.0
  ], 
  [
   53530, 
   null, 
   "Ursus maritimus", 
   "Hello, Gup20.\n \n \nLook up Moses... John.... Noah and his sons\n\n Hmm. You seem to get side tracked easily. If I understood your point correctly (and please correct me if I misunderstood you) you claimed that YEC was the norm until Darwin published the theory of evolution. I am saying that this is incorrect -- scientists accepted that the earth is at least millions of years old before Darwin. Lyell and Hutton influenced scientific thinking well before Darwin.\n \n \n \nHowever, the vast, vast majority of christians did believe in a literal creative week and a young earth up until the time when Darwin's work became popular.\n\n This is possibly true. I would like to see some documentation before I believe it, though.\n \n \nFrancis Bacon (1561-1626) Scientific method....\n\n A list of a few names, about half of whom predated the birth of modern geological science, doesn't say a lot about what the scientific consensus was in Darwin's time. You are claiming that Darwin single handedly removed YEC as a valid scientific hypothesis. I am claiming that YEC was dismissed as a valid scientific hypothesis long before Darwin.\n \n \n \nWhile I respect the clarification on Darwin starting YEC (as opposed to YEC being a reaction to Darwin), I would still emphasize that you are emphatically incorrect.\n\n Okay, you do understand my point. Good. Perhaps I am wrong. I doubt it, but I admit the possibility.\n \n \n \nYou see, one did not NEED to identify themselves as a YEC before Darwin popularized evolutionary thought. The vast majority of scientists simply held the Bible as true and there was no argument about it.\n\n This is simply false. The majority of those studying natural history (those who studied what would today be called geology) did not believe in YEC.\n \n \n \nNewton, for example,\n\n was neither a geologist, and he lived well before the work of Lyell and Hutton and the other fathers of geology.\n \n \n \nI am taken back by your revisionist history, however. Do you mind if I ask where you learned this version of history?\n\n Actual science text books and history of science books. I suggest that a good library might be a refreshing break from AiG.\n \n \n \nHere is what you said: \"Ironically, it was Charles Darwin who started Young Earth Creationism;\" you continued \"some Christians were so repelled by the idea that humanity may have evolved from apes that they reacted by insisting on a literal interpretation of Genesis.\"\n\n I still think that my meaning was clear; but if it wasn't, I apologize.\n \n \n \nI do find it odd, however, that you fail to see that Darwin's work was a change from the commonly accepted idea of YEC.\n\n Because YEC wasn't commonly accepted among scientific circles, and it is my belief, until you show me otherwise, that it wasn't accepted among even the educated Christians at the time.\n \n \n \nI dont' recall stating that the subject of Hindu belief wasn't relevant. In fact, evolution is not a new or modern idea it is simply an old religion mixed with modern humanism for credibility.\n\n It may be old, but a scientific formulation didn't come about until the 18th century, and the modern theory did originate with Darwin. At any rate, it is irrelevant who originated the theory of evolution; its validity is to be determined by the evidence.", 
   {
    "unicode_changes_made": true
   }, 
   53513, 
   null, 
   1086922020.0
  ], 
  [
   53533, 
   null, 
   "OccamsRazor", 
   "Occam! Since you single me our for a greeting, I am assuming that you already know who I am? I was very pleased to see your handle listed under the newest member thingee. You are, I am assuming, someone I \"know\" on other boards whose handles are various variations of \"Occam\". At any rate, welcome to 4forums.\n\n \n My apologies for any confusion Ursus, I am not one of the other \"Occams\" (I wonder just how many of us there are!) you have met on other boards. Perhaps my introduction was a little over enthusiastic emoticon_xbouncer Thankyou for for the welcome all the same!\n \n \nDo you have a link to your earlier comments on this, Occam? I would be interested to see what your take on this is.\n\n \n Yes, here is a link to a discussion on the old YouDebate forums which discussed the AiG article:\n \n Thread- Evolution: an ancient religon\n \n I does get rather off topic as it progresses ;)", 
   {}, 
   53492, 
   null, 
   1086922560.0
  ], 
  [
   53562, 
   null, 
   "unkerpaulie", 
   "Wow - an actual response to the topic thread. Fabulous!\n \n I guess I really wouldn't argue to fiercely with anything you have to say. I don't agree 100% but the disagreements are minor semantics and probably not worth making a fuss over. \n \n Furthermore, you raise a most excellent issue. You said \n \n \"evolution and creationism are mutually exclusive, and the both cannot be true at the same time, since there can be only one true way that life originated\"\n \n You have come to the conclusion which one must come to when dealing with this debate - what is TRUTH. In reality, there is only one truth. Truth is finite and absolute. \n\n the response to your initial statement is not necessarily dependent on which \"theory\" is true, but rather on the effect of one being true on the other. My point is not to claim either as absolute truth, and i even suggested that both may be false. your initial point seemed to suggest that evolution and creationism dont affect each other's validity. i disagree\n \n \nWhich is where the Bible comes in - for those who believe in it, it is a revelation of absolute truth, from the one and only absolute God. YEC starts with Scripture as the basis and foundation of all truth. All evidence is interpreted under this framework. Evolution, however, is not based on absolute truth. It is based on the fallible theory of man. At it's essence it is based on humanism. The root of humanism is that man determines truth for himself separate from God. Therein lies the root of the creation vs evolution debate. This is one reason why the debate never ends... it's like doctors arguing over the symptoms rather than the illness itself.\n\n taking the Bible as absolute truth assumes that a lot of things are true contrary to physical evidence. however, the bible can only be best viewed as a witness account, and physical evidence contrary to a witness account usually overules.\n \n there is nothing that suggest the bible itself, or even God's existence, is based on anything but the fallible thoery of man. in fact, the greatest testimony to the truth of the bible is the bible itself, i.e., the bible is true because the bible says its true.\n \n from the most neutral perspective possible, we have 2 theories competing for the origin of life. one is written by men that claim to have a revelation of the truth from God. the other is written by men who claim to have a revelation of truth from nature. in both cases man is fallible. in both cases neither has been proven beyond reasonable doubt. the thing is, both theories can not be true simultaneously", 
   {}, 
   53513, 
   null, 
   1086965520.0
  ], 
  [
   53576, 
   null, 
   "The Barbarian", 
   "Keep in mind that only one particular, modern interpretation of the Bible is at odds with science.\n \n Most Christians don't see any conflict at all.", 
   {}, 
   53562, 
   null, 
   1086977820.0
  ], 
  [
   53601, 
   null, 
   "Gup20", 
   "Gup -- Consider something for a moment...\n \n If a literal interpretation of Genesis is correct, then there would have been no human being in existence to witness the creation of the universe in which we reside. No one would have been any physically closer to the events of creation than we are today. Perhaps they were closer in time, but what does time matter when one does not exist?\n\n \n Well - consider Adam. When Adam was created, he was able to witness the creation of Eve. He spoke with God face to face (until the Fall anyway). God may very well have given him a first hand account. Also, keep in mind that Adam lived to be over 900 years old. From the time of Adam to the time of the flood was about 1600 years. Adam's 6x great grandson Methusala could have litterally walked over and asked the Old Patriarch to tell him how God created the world in 7 days. Now Methusala lived for the first 50 years of the life Noah's son Shem. So it would have been possible for Shem to speak to Methusala, who spoke to Noah. In 3 persons you cover 1600 years of history, and quite quickly get back to the original account. Also, keep in mind that according to the YEC model, not only were people and animals healthier, live longer, and stronger... but people would have the maximum information content - therefore their capacity for intellect would be greater. In the YEC model, the originals (and their immediate offspring) would have the greatest information content (as Mutation had not yet had enough time to corrupt it). They probably had photographic precise memories, for example (reasonably - if we see an extraordinary ability today, and mutation cannot increase information, then that ability must have survived the process of information loss). As I said before, the building of the Ark, and engineering marvels such as the pyramids may be evidence of that higher intellect. Couple that with the possibility of increased strength and vitality - and we can now see the possibilities for such marvels such as the pyramids, Stonehenge, and Sacsahuamán and how they might be pointing to just this concept. \n \n This also is a huge blow to the uniformitarian. If, indeed, people lived up to 900 years... that would mean that the human genome has undergone considerable change since the beginning. \n \n \nAnd what about for those who do not 'believe in' the Bible the same way you believe in the Bible? Is the Bible NOT a revelation of absolute truth?\n \n The fact is... Truth is truth. And your beliefs, while they may or may not coincide with some or all aspects of that truth, have no bearing on the truth of that truth. Does this make any sense? No matter what you believe, your beliefs do not change the truth that already exists. Your beliefs are completely independent of the truth that already exists.\n\n \n I agree whole heartedly with this. This is why we must be extremely careful and exacting when interpreting the Bible. This involves much study, as well as cross referencing - and also going back to the original language and text to decifer the intended meanings. The Bible is the inspired, infallible Word of God - it is absolute truth. However, fallible men interpret it. Therefore we must be extremely cautious when we interpret it, lest we lead people astray. \n \n \nSo, you believe X. And another person believes Y. Who is right? You will never KNOW within this physical realm when X and Y deal with matters outside of this physical realm. You only have belief.\n\n \n Which is why we must rely on forces outside the 'physical realm' such as prayer. I would venture to say that those who read the Bible without prayer are far more likely to get off track. However, as a christian we can pray that God will reveal the correct meanings to us as we study - and often He does. Moreover, there are supernatural events that come along if we get too far off track to put us back on the right path. For example, we can look at the story of Paul in the Bible. He was in charge of murdering christians. Then, one day Jesus showed up in a bright light and changed his life. Paul changed from being in charge of rounding up and killing christians to being a christian himself and he actually wrote a large portion of the New Testament. \n \n \nThe history of this earth and of life on this earth is of the physical realm. It can be studied. Evidence exists. The nature of the supernatural creation is not of the physical realm. It cannot be studied. It can only be believed.\n\n \n It is precisely this humanistic/atheistic attitude that began in the scientific community that has lead to a sort of spiritual dark age beginning to happen in the USA. In any other country of the world, for example, you can go and see the supernatural on a regular basis. For example, my mother in law recently went on a Missionary Trip to Peru and Equador. With regular occurance, they would pray for people to be healed, and those people would be immediately healed. In fact - and this is 100% a true story - my mother-in-law went on this missionary trip to Peru. She has been feeling now for a few years that she is called by God to be a missionary in Equador, and since this trip to peru was passing through equador, she wanted to go. Furthermore, in praying about the trip, she felt that she was supposed to go. Also, one of the other pastors here at my church in praying about this felt that She was supposed to go, so he paid for her ticket. While she was in Peru, she was going through the shops in Iquitos, Peru and two men walked up to her. One man was a white man, and another man looked like a tribal man. The white man exclaimed \"Here she is!\". My mother in law was quite startled, because she had never met either of these people. The White man was a 'Gideon' (you know the guys that leave bibles everywhere). He told my mother in law the whole story.\n \n Three months ago, this man was praying to God to send people to his village to preach and teach the rest of his village about Jesus. The tribal man lived in the mountains of Equador. God told this man that if he would go to Iquitos, Peru he would meet the man with Bibles who would lead him to a woman who's heart was in Equador. This woman would pray for him and his village, and that would result in the people of his village having the opportunity to come to Christ. It took this man 3 months to walk from his village to Iquitos Peru. \n \n Now my mother-in-law had never seen either of these men in her life up to that moment. And she was only in the shops in Iquitos for a few hours on ONE day. \n \n It is this type of supernatural occurence that happens on a regular basis for those Christians who have a real personal relationship with God. There are two types of christians - those who see it as a religion, and those who do not. Those who see it as a religion experience a dry empty ritual. On the other hand, those who seek God, find him, and for them, christianity is life and a relationship. \n \n \nI'd be particularly interested in any geologically based info you have to support YEC. Some of your assertions have me \"chomping at the bit\" so to speak. However, PLEASE do not post the dinosaur/human tracks thing again.\n\n \n Hello Waxy. I would like to try to keep this on topic. However, I would be most happy to try to answer your questions if you start another thread and dedicate it to geology. While I am not a geology experty, there is quite of bit of YEC geology which it sounds like you are unaware of. \n \n \nI'm on pins and needles waiting for your proof that YEC is taking over from \"evolution\".\n\n \n You can relex for a while. First we must unify 'the church' and get Christians to see this first. Then our 'prayer base' (read supernatural influence) will be much larger wherewith to take on the establishment of atheism. YOu see it's all a giant YEC conspiracy. ;)\n \n Waxy: Forgive me if I have misrepresented either of you.\n \n I don't really have a problem with that - however it should still be taken into account that the majority of scientists and population held YEC as the norm. Darwin's book on favored races changed that. It 'popularized' the growing old age movement. This is important because we can see from the historical records that there was a large ammount of evidence that supported YEC (such as tree trunks found verticle through a few 'million years' of rock strata). After Darwin's ideas (and millions of years) became the excepted norm, we see this re-enforcement syndrome begin happening. Suddenly, people are interpreting evidence under a new paradigm. Because of a paradigm, people's interpretations and conclusions were starting to to exclude the possibility of a Young Earth for the first time. This is one reason why YEC geology is so slow. We have to re-investigate everything that was mis-interpreted. For example, early in the process it was common to date rock layers by the type of fossils found in them. Evolution supposed that X fossil was so many millions of years old, so those rock layers are labeled at that age. It's ironic to me, then, when so many evolutionists say \"Evolution must be right - otherwise why would we find all the animals in the order we expect and in rock layers that are the right age?\"\n \n Today we use more sophisticated radiometric dating - however - every single radiometric dating method is based on unproveable assumptions, one of which is that the earth is not 6000 years old. In fact, many radiometric dating centers advertise their services do not work on 'young rocks'. If the earth is only 6000 years old, then ALL ROCKS are young rocks.... meaning these centers are incapable of coming to a correct date on ANY rocks. In fact, every time radiometric dating has been done on rocks we KNOW the ages of, it has misseralbly failed... inflating the dates by magnatudes of hundreds of thousands to millions (for example, dating rock from Mt St Helens formed 20 years ago gives the age of 1.9million years). \n \n \nI guess so, if you believe John, Moses and his sons are any more real beings than Santa Claus. I think you'd have a hard time proving that. Therefore the testimony is heresay at best, irrelevent most likely.\n\n \n I guess trusting in Moses and John as real people is about as frivolous as trusting in Christopher Columbus, or Darwin himself. Perhaps it is just a frivolous as believing there ever was an Aristotle, Confucious, or any of the Egyptian Pharoahs. You just can't trust those damn Jews eh? :rollseyes:\n \n \n \nHmm. You seem to get side tracked easily. If I understood your point correctly (and please correct me if I misunderstood you) you claimed that YEC was the norm until Darwin published the theory of evolution. I am saying that this is incorrect -- scientists accepted that the earth is at least millions of years old before Darwin. Lyell and Hutton influenced scientific thinking well before Darwin.\n\n \n Because a niche of scientists explore a theory does not mean that theory had general recognition or acceptance. I am simply saying that Evolution was not generally popular or accepted until Darwin's book. It might have been going around in some niche or circles (indeed the vast majority of Origin of spec. is the work of people other than Darwin), but it was not popularized until Darwin. \n \n Your revisionist history basically starts and ends with Evolution practically ignoring all else. \n \n It was Karl Marx who said \"take away a people's heritage, and you can change them into anything\". This is of course the path Marx laid out to communism. However, those who wish to revise history and change the US into their vision try to use this same strategy. \n \n \nYou are claiming that Darwin single handedly removed YEC as a valid scientific hypothesis. \n\n \n Darwin never did that. He simply made an alternative view popular. \n \n \nThe majority of those studying natural history (those who studied what would today be called geology) did not believe in YEC.\n\n \n Oh I see. So geology is the only branch of science according to evolutionists? When would you say 'modern geology' began?\n \n I find this so rediculously clouded as to be absurd. You say 'The majority of those studying natural history'... . - the majority didn't believe in natural history - they believed in the Bible and a creator. There was no need to search for a 'naturalistic explaination'. That niche was started by those who didn't want to believe what the Church or the Bible told them. They were humanists who believed that if they could come up with a naturalistic sequence of events (or at least one that didn't agree with the Bible) then they could continue in their rebellion against God and against the church. This is one reason our founding fathers said that no religion should be the official 'state religion' - to avoid the abuse of political power and political corruption within the church. (which was admittedly rampant)\n \n Science was born out of a passion for the creator and studying the creation, however at a point, the creation became God rather than the creator, and in worship of this new God (nature) a creative event and process was invented that would give glory and honor to this God. \n \n So when you say 'The majority of those studying natural history' I guess I would agree - those who went looking for an alternative to the truth found just what they were looking for - an alternative to the truth. Unfortunately it doesn't absolve them of who and what they are, or their responsibility and obligation to God. \n \n [i]PB: I still think that my meaning was clear; but if it wasn't, I apologize.[/quote]\n \n No apology is necessary. Your meaning, while now clarified is much clearer than your intention. Your intention is to boulster the position of evolution (and thereby humanism) through organized and defined debate strategy. \n \n My intention is all together different. It is my desire to point you and those who read toward truth so that perhaps you are willing to open your eyes and accept the gift of salvation offered by the Creator of the universe. It is my intention to show you, using science (that which is worshiped and cherished above all else here) that this is in your best interests. \n \n \n \nBecause YEC wasn't commonly accepted among scientific circles, and it is my belief, until you show me otherwise, that it wasn't accepted among even the educated Christians at the time.\n\n \n In fact I did show you documented evidence in the form of that list of YEC scientists. I showed you direct quotes from Newton, for example. You, however, seem to refuse to accept any evidence I show. The fact that Newton wrote more about believing in Christ than he did about science didn't even give you pause? You ignored this and scoffed at Newton - 'He wasn't a geologist' (paraphrased). \n \n Hutton's a priori commitment to materialism - from AiG \n In 1785, before examining the evidence, the deist James Hutton, 'the Founder of Modern Geology', proclaimed: \n \n 'the past history of our globe must be explained by what can be seen to be happening now ... No powers are to be employed that are not natural to the globe, no action to be admitted except those of which we know the principle'\n \n This was later called uniformitarianism by Charles Lyell. This is a not a refutation of Biblical teaching of Creation and the Flood, but a dogmatic refusal to consider them as even possible explanations.\n \n History is confirming that the scriptural geologists were right. Lyell's uniformitarianism was the ruling dogma of geology for almost 150 years until the late 1970s, when 'neocatastrophism' began to emerge, and with it came reinterpretations of the geological record. Lyell's way of interpreting the rocks simply does not fit the facts, and evidence of catastrophism on a continental, even global scale is becoming increasingly obvious, even to many evolutionists.\n \n We find a similar thing happening in biology. Old-earth geology paved the way for Darwinism. On his famous voyage around the world Darwin studied the first volume of Lyell's Principles of Geology and then applied the same naturalistic assumptions to his interpretation of the biological evidence. With the apparent triumph of Darwinism, naturalism gained control of every discipline within the university, not only in the West, but also in the former communist lands and every other nation on earth. But Darwinian evolution has come under considerable fire in the past four decades, not only from people who are committed to the Bible but also from others who are agnostic regarding the existence of God. These diverse writers have argued that evolution is a 'theory in crisis' because scientific research has increasingly shown that it simply does not fit the facts of reality. \n \n \n \nyour initial point seemed to suggest that evolution and creationism dont affect each other's validity. i disagree\n\n \n Fair enough. I can capitulate that they do effect each other's validity - however I would hold firm that the details of one do not disprove the other. As they are interpreted under a completely differet set of criteria, they cannot be judged as valid by the other - one simply has to choose which is more 'believable' based on the case of each. In a sense, the individual is the judge based on the evidence of each case on it's own merit. \n \n Herein lies some dissimilarity because the evolutionary paradigm does not allow non-naturalistic evidence to be presented (for example - the Bible), whereas Creation is based primarily upon non-naturalistic evidence with natural evidence merely confirming or supportng the more important supernatural evidence. \n \n \ntaking the Bible as absolute truth assumes that a lot of things are true contrary to physical evidence.\n\n \n Indeed that is the message of atheism and humanism. However this is a misconception. It is that misconception that sites such as AiG and ICR are working to correct. It is this misconception that YEC seeks to address. \n \n \nhowever, the bible can only be best viewed as a witness account, and physical evidence contrary to a witness account usually overules.\n \n \n And what typically happens when it is discovered that the physical evidence was severely mis-interpreted? What happens when it is discovered that the persons investigating the physical evidence were biased or extenuously influenced? What happens if the investigators know one of the suspects and rule that person out entirely before the investigation begins? \n \n Essentially, isn't this what evolution does. It rules out the possiblity of the supernatural before the investigation or intperpretation of facts even begins simply because evolutionist 'KNOWs' that it's not a possible explaination.\n \n \n \nthere is nothing that suggest the bible itself, or even God's existence, is based on anything but the fallible thoery of man. in fact, the greatest testimony to the truth of the bible is the bible itself, i.e., the bible is true because the bible says its true.\n\n \n I would know quite a few people who would disagree with you. There are quite literally millions of peolpe on this planet who have personally experienced the supernatural and God. I am one of those - My mother-in-law's story is an example as well. \n \n \n \nin fact, the greatest testimony to the truth of the bible is the bible itself, i.e., the bible is true because the bible says its true.\n\n \n This is also incorrect. The fact is, that many, many people have found the Bible and it's truths to be real and effective in their own personal lives. Many people have seen such things as prayer and healing work repetitively. Perhaps it's not naturalistic, but it's evidence, none the less.", 
   {
    "unicode_changes_made": true
   }, 
   53562, 
   null, 
   1086991320.0
  ], 
  [
   53603, 
   null, 
   "thebootfitter", 
   "Well - consider Adam. When Adam was created, he was able to witness the creation of Eve. He spoke with God face to face (until the Fall anyway). God may very well have given him a first hand account.\n\n You are making an assumption here. Nowhere in scripture that I'm aware of does it say that God gave Adam a first-hand account of creation. So it appears you are placing your belief in nothing more than an assumption.\n \n \n \nThe Bible is the inspired, infallible Word of God - it is absolute truth.\n\n And this is a belief. This is not knowledge. This can be accepted only through faith. There is no evidence anywhere in existence to support this assertion, except through belief.\n \n \nHowever, fallible men interpret it. Therefore we must be extremely cautious when we interpret it, lest we lead people astray.\n ...\n Which is why we must rely on forces outside the 'physical realm' such as prayer.\n\n So, who can claim to know the correct interpretation? Perhaps you are, in fact, 'leading people astray.' How can you KNOW that you are not? Perhaps through prayer? Well, how do you explain the fact that there are other individuals that spend more time in prayer than you do, and who pray even more sincerely than you do, but still have a different interpretation of the Bible than you do?\n \n \nThe history of this earth and of life on this earth is of the physical realm. It can be studied. Evidence exists. The nature of the supernatural creation is not of the physical realm. It cannot be studied. It can only be believed.\n\n \nIt is precisely this humanistic/atheistic attitude that began in the scientific community that has lead to a sort of spiritual dark age beginning to happen in the USA.\n\n I stated six factual statements (assuming you read the statement \"It cannot be studied.\" to include the implied addition of \"...in a scientific manner based on physical evidence.\"). Facts cannot imply an attitude. Facts are facts. They are statements that can be shown to be true or false. The door is painted red. Two plus two is four. The green elephant jumped over the fence. No attitude of any sort is implied by facts.\n \n \nIn any other country of the world, for example, you can go and see the supernatural on a regular basis.\n\n Really? And not in the United States? I disagree. I suggest that the realm of the supernatural is not dependent upon time or space.\n \n \nFor example, my mother in law recently went on a Missionary Trip to Peru and Equador. With regular occurance, they would pray for people to be healed, and those people would be immediately healed. In fact - and this is 100% a true story - my mother-in-law went on this missionary trip to Peru. \n ...\n Now my mother-in-law had never seen either of these men in her life up to that moment. And she was only in the shops in Iquitos for a few hours on ONE day.\n ...\n It is this type of supernatural occurence that happens on a regular basis for those Christians who have a real personal relationship with God.\n\n I have no doubt that there are many occurrences that happen every day that are perceived by some people to be 'supernatural' in nature. However, it is also possible to believe that these exact same occurrences could happen without any 'supernatural' forces. These occurrences also happen on a regular basis for non-Christians who do not have a real personal relationship with God as Christians view God.\n \n Look at it this way... X happened. So X is a fact of reality. \n \n If there is no known evidence for the how or why X happened that exists in the physical realm, then any answers of how or why are pure speculation. Perhaps a mythical beast breathed her magic dust into the air and that caused X to happen. Perhaps an angel tapped somebody on the shoulder and whispered something into their ear and that's why X happened. Perhaps God touched an individual and caused X to happen. Perhaps some as-of-yet-undetermined and unwitnessed aspect of quantum physics caused X to happen.\n \n \n \nThere are quite literally millions of peolpe on this planet who have personally experienced the supernatural and God. I am one of those - My mother-in-law's story is an example as well.\n ...\n The fact is, that many, many people have found the Bible and it's truths to be real and effective in their own personal lives. Many people have seen such things as prayer and healing work repetitively. Perhaps it's not naturalistic, but it's evidence, none the less.\n\n I would suggest hundreds of millions or possibly even billions of people. But that's beside the point. You interpret events in your life to have supernatural meaning because of your specific belief in the nature of the supernatural realm. Personal belief does not constitue evidence in anything except that somebody holds that particular belief as true.", 
   {}, 
   53601, 
   null, 
   1086993720.0
  ], 
  [
   53606, 
   null, 
   "Ursus maritimus", 
   "My intention is all together different. It is my desire to point you and those who read toward truth so that perhaps you are willing to open your eyes and accept the gift of salvation offered by the Creator of the universe. It is my intention to show you, using science (that which is worshiped and cherished above all else here) that this is in your best interests.\n\n Ah, now I see my mistake. I thought that maybe you were interested in discussing science. Well, carry on, then.", 
   {}, 
   53601, 
   null, 
   1086997020.0
  ], 
  [
   53610, 
   null, 
   "Ursus maritimus", 
   "My apologies for any confusion Ursus, I am not one of the other \"Occams\" (I wonder just how many of us there are!)\n\n That's alright. I like all the Occam's I've seen! And welcome anyway. Thanks for the link.", 
   {}, 
   53533, 
   null, 
   1086997920.0
  ], 
  [
   53612, 
   null, 
   "Gup20", 
   "There is no evidence anywhere in existence to support this assertion, except through belief.\n\n \n Oh? I would assert that the New Testament is just that - a body of many multiple evidences demonstrating that assertion to be true. \n \n Again, because you don't accept non-naturalistic evidence doesn't mean it doesn't exist or that it is any less valid as evidence. \n \n \nPerhaps you are, in fact, 'leading people astray.' \n\n \n Perhaps. It is certainly possible. However, there is enough evidence to at the very least make my case plausible. \n \n \n \nWell, how do you explain the fact that there are other individuals that spend more time in prayer than you do, and who pray even more sincerely than you do, but still have a different interpretation of the Bible than you do?\n\n \n Well, there are somethings that God has not yet revealed and wont' until the appointed time. The Bible does have some things to say about your question, however.\n \n Jam 4:3 Ye ask, and receive not, because ye ask amiss, that ye may consume [it] upon your lusts.\n \n Rom 7:5 For when we were in the flesh, the motions of sins, which were by the law, did work in our members to bring forth fruit unto death. \n \n Mat 12:33 Either make the tree good, and his fruit good; or else make the tree corrupt, and his fruit corrupt: for the tree is known by [his] fruit.\n \n Mat 6:24 No man can serve two masters: for either he will hate the one, and love the other; or else he will hold to the one, and despise the other. Ye cannot serve God and mammon (man).\n \n Rom 8:26 Likewise the Spirit also helpeth our infirmities: for we know not what we should pray for as we ought: but the Spirit itself maketh intercession for us with groanings which cannot be uttered. \n 27 And he that searcheth the hearts knoweth what [is] the mind of the Spirit, because he maketh intercession for the saints according to [the will of] God. \n \n \n Those who call themselves Christians and are not in fellowship and relationship with God can study the scripture and never once come to a correct interpretation. Clearly from the above verses, it is possible to be in the wrong spirit when reading the Bible and miss what God is trying to say. Scripture is revealed through the holy spirit which again makes it a supernaturally influenced process - excluded by those who base their decisions solely on the natural. I know this is extremely advanced Christian theology, and many of you will not understand it. There is much that must be understood to fully get this, which I do not have time to explain, so I apologize if this is confusing. Basically, if you are not a Christian and do not have the indwelling of the holy spirit, it is possible to continually read the scriptures and it will remain a complete mystery to you. \n \n The best analogy I can give is - if you are not a black person, you will never fully understand how racism effects black people. If you have never piloted/rode in an airplane, you cannot know for certain what a 8G turn in an F16 feels like. If you have never been married (or lived with someone for a long period of time) you probably can't write a book about having a successful marriage. \n \n \n \nI stated six factual statements (assuming you read the statement \"It cannot be studied.\" to include the implied addition of \"...in a scientific manner based on physical evidence.\"). Facts cannot imply an attitude. Facts are facts. They are statements that can be shown to be true or false. The door is painted red. Two plus two is four. The green elephant jumped over the fence. No attitude of any sort is implied by facts.\n\n \n The attitude I am talking about is that the supernatural cannot be studied. In fact, the supernatural is more dynamic than the natural, however this doesn't mean it is not repeatable or testable. It means you have to account for more variables before drawing conclusions. Often the filter/standard of natural is applied to the supernatural and when they don't immediately jive with each other it is dismissed. This means you have to actually move 'outside your box' - outside the 'everything is completely naturalistic' paradigm. \n \n \n \nReally? And not in the United States? I disagree. I suggest that the realm of the supernatural is not dependent upon time or space.\n\n \n In fact, one of the main causational factors in the realm of the spirit is faith. In a country where the supply of faith runs so thin, is it not surprising, then that the occurrence of the supernatural is decreased? Indeed it is possible for the supernatural to occur anywhere at any time - after all isn't that the essence of 'supernatural'? However it's likelihood is decreased. \n \n \n \nI have no doubt that there are many occurrences that happen every day that are perceived by some people to be 'supernatural' in nature. However, it is also possible to believe that these exact same occurrences could happen without any 'supernatural' forces. These occurrences also happen on a regular basis for non-Christians who do not have a real personal relationship with God as Christians view God.\n\n \n So you are basically saying that you think that fantastic co-incidences are possible, but that supernatural occurrences are not? Again, it seems you are willing to make an a priori judgment based on the assumption that the supernatural doesn't exist. I would assert that you 'weigh' this in a dogmatic paradigm of naturalism which you seem unable or unwilling to relinquish even in an attempt to critically and honestly analyze your position. \n \n \n \nI would suggest hundreds of millions or possibly even billions of people. But that's beside the point. You interpret events in your life to have supernatural meaning because of your specific belief in the nature of the supernatural realm. Personal belief does not constitue evidence in anything except that somebody holds that particular belief as true.\n\n \n Which is why I am here recommending that everyone try out real christianity for themselves ;)", 
   {}, 
   53603, 
   null, 
   1086998700.0
  ], 
  [
   53613, 
   null, 
   "Gup20", 
   "Ah, now I see my mistake. I thought that maybe you were interested in discussing science. Well, carry on, then.\n\n \n \n Indeed, many people are unable to accept Chistianity without it being scientifically viable. I am prepared to do my best to present this side of YEC and christianity as well.", 
   {}, 
   53612, 
   null, 
   1086998880.0
  ], 
  [
   53615, 
   null, 
   "Waxy", 
   "Well - consider Adam. When Adam was created, he was able to witness the creation of Eve. He spoke with God face to face (until the Fall anyway). God may very well have given him a first hand account. Also, keep in mind that Adam lived to be over 900 years old. From the time of Adam to the time of the flood was about 1600 years. Adam's 6x great grandson Methusala could have litterally walked over and asked the Old Patriarch to tell him how God created the world in 7 days. Now Methusala lived for the first 50 years of the life Noah's son Shem. So it would have been possible for Shem to speak to Methusala, who spoke to Noah. In 3 persons you cover 1600 years of history, and quite quickly get back to the original account. Also, keep in mind that according to the YEC model, not only were people and animals healthier, live longer, and stronger... but people would have the maximum information content - therefore their capacity for intellect would be greater. In the YEC model, the originals (and their immediate offspring) would have the greatest information content (as Mutation had not yet had enough time to corrupt it). They probably had photographic precise memories, for example (reasonably - if we see an extraordinary ability today, and mutation cannot increase information, then that ability must have survived the process of information loss). As I said before, the building of the Ark, and engineering marvels such as the pyramids may be evidence of that higher intellect. Couple that with the possibility of increased strength and vitality - and we can now see the possibilities for such marvels such as the pyramids, Stonehenge, and Sacsahuamán and how they might be pointing to just this concept. \n \n This also is a huge blow to the uniformitarian. If, indeed, people lived up to 900 years... that would mean that the human genome has undergone considerable change since the beginning. \n \n I agree whole heartedly with this. This is why we must be extremely careful and exacting when interpreting the Bible. This involves much study, as well as cross referencing - and also going back to the original language and text to decifer the intended meanings. The Bible is the inspired, infallible Word of God - it is absolute truth. However, fallible men interpret it. Therefore we must be extremely cautious when we interpret it, lest we lead people astray. \n \n Which is why we must rely on forces outside the 'physical realm' such as prayer. I would venture to say that those who read the Bible without prayer are far more likely to get off track. However, as a christian we can pray that God will reveal the correct meanings to us as we study - and often He does. Moreover, there are supernatural events that come along if we get too far off track to put us back on the right path. For example, we can look at the story of Paul in the Bible. He was in charge of murdering christians. Then, one day Jesus showed up in a bright light and changed his life. Paul changed from being in charge of rounding up and killing christians to being a christian himself and he actually wrote a large portion of the New Testament. \n \n It is precisely this humanistic/atheistic attitude that began in the scientific community that has lead to a sort of spiritual dark age beginning to happen in the USA. In any other country of the world, for example, you can go and see the supernatural on a regular basis. For example, my mother in law recently went on a Missionary Trip to Peru and Equador. With regular occurance, they would pray for people to be healed, and those people would be immediately healed. In fact - and this is 100% a true story - my mother-in-law went on this missionary trip to Peru. She has been feeling now for a few years that she is called by God to be a missionary in Equador, and since this trip to peru was passing through equador, she wanted to go. Furthermore, in praying about the trip, she felt that she was supposed to go. Also, one of the other pastors here at my church in praying about this felt that She was supposed to go, so he paid for her ticket. While she was in Peru, she was going through the shops in Iquitos, Peru and two men walked up to her. One man was a white man, and another man looked like a tribal man. The white man exclaimed \"Here she is!\". My mother in law was quite startled, because she had never met either of these people. The White man was a 'Gideon' (you know the guys that leave bibles everywhere). He told my mother in law the whole story.\n \n Three months ago, this man was praying to God to send people to his village to preach and teach the rest of his village about Jesus. The tribal man lived in the mountains of Equador. God told this man that if he would go to Iquitos, Peru he would meet the man with Bibles who would lead him to a woman who's heart was in Equador. This woman would pray for him and his village, and that would result in the people of his village having the opportunity to come to Christ. It took this man 3 months to walk from his village to Iquitos Peru. \n \n Now my mother-in-law had never seen either of these men in her life up to that moment. And she was only in the shops in Iquitos for a few hours on ONE day. \n \n It is this type of supernatural occurence that happens on a regular basis for those Christians who have a real personal relationship with God. There are two types of christians - those who see it as a religion, and those who do not. Those who see it as a religion experience a dry empty ritual. On the other hand, those who seek God, find him, and for them, christianity is life and a relationship. \n\n \n No offense, but I simply dismiss all of this fairy tale, myth, and mental delusions. No more valid, or invalid, than any Roman, Viking, Aztec, or my very own stroy of creation and miracles with no physical proof. \n \n \nYou can relex for a while. First we must unify 'the church' and get Christians to see this first. Then our 'prayer base' (read supernatural influence) will be much larger wherewith to take on the establishment of atheism. YOu see it's all a giant YEC conspiracy. ;)\n\n \n You better hope that we have milliions of years of time left, because it's going to take you AT LEAST that long.\n \n \nThis is one reason why YEC geology is so slow. We have to re-investigate everything that was mis-interpreted. For example, early in the process it was common to date rock layers by the type of fossils found in them. Evolution supposed that X fossil was so many millions of years old, so those rock layers are labeled at that age. It's ironic to me, then, when so many evolutionists say \"Evolution must be right - otherwise why would we find all the animals in the order we expect and in rock layers that are the right age?\"\n\n \n Fitting all the data to a foregone conclusion is no doubt time consuming work.\n \n You don't really understand biostratigraphy, that much is clear to me, we'll deal with it in the new thread though.\n \n \nToday we use more sophisticated radiometric dating - however - every single radiometric dating method is based on unproveable assumptions, one of which is that the earth is not 6000 years old. In fact, many radiometric dating centers advertise their services do not work on 'young rocks'. If the earth is only 6000 years old, then ALL ROCKS are young rocks.... meaning these centers are incapable of coming to a correct date on ANY rocks. In fact, every time radiometric dating has been done on rocks we KNOW the ages of, it has misseralbly failed... inflating the dates by magnatudes of hundreds of thousands to millions (for example, dating rock from Mt St Helens formed 20 years ago gives the age of 1.9million years).\n \n \n See my comment on biostratigraphy and change it to radiometric dating.\n \n \nI guess trusting in Moses and John as real people is about as frivolous as trusting in Christopher Columbus, or Darwin himself. Perhaps it is just a frivolous as believing there ever was an Aristotle, Confucious, or any of the Egyptian Pharoahs. You just can't trust those damn Jews eh? :rollseyes:\n\n \n We have both physical evidence and numerous written historical records as evidence for all of the above. The only evidence of Moses and John is the Bible itself, which is equivalent to the evidence we have that Thor and Quetzecoatyl (sp?) existed, both are dismissed as myth. \n \n Nice try, but that's apples and oranges.\n \n \nMy intention is all together different. It is my desire to point you and those who read toward truth so that perhaps you are willing to open your eyes and accept the gift of salvation offered by the Creator of the universe. It is my intention to show you, using science (that which is worshiped and cherished above all else here) that this is in your best interests. \n \n \n I thought this was a debate, not a sermon to recruit new members.\n \n \nHutton's a priori commitment to materialism - from AiG \n In 1785, before examining the evidence, the deist James Hutton, 'the Founder of Modern Geology', proclaimed: \n \n 'the past history of our globe must be explained by what can be seen to be happening now ... No powers are to be employed that are not natural to the globe, no action to be admitted except those of which we know the principle'\n \n [color=sienna]This was later called uniformitarianism by Charles Lyell. This is a not a refutation of Biblical teaching of Creation and the Flood, but a dogmatic refusal to consider them as even possible explanations.\n \n History is confirming that the scriptural geologists were right. Lyell's uniformitarianism was the ruling dogma of geology for almost 150 years until the late 1970s, when 'neocatastrophism' began to emerge, and with it came reinterpretations of the geological record. Lyell's way of interpreting the rocks simply does not fit the facts, and evidence of catastrophism on a continental, even global scale is becoming increasingly obvious, even to many evolutionists.\n\n \n This is a misrepresentation of Hutton and his work. \n \n Neocatastophrism is in NO WAY at odds with Hutton's assertion. If events that are \"natural to the globe\" and that we \"know the principle of\" have caused catastrophic change, please explain to me why that violates Hutton's assertion? \n \n Beyond that, how is catastophism exclusionary of an old earth model, let alone solid proof for a young earth model?\n \n Perhaps this should be answered in the new thread.\n \n \nWe find a similar thing happening in biology. Old-earth geology paved the way for Darwinism. On his famous voyage around the world Darwin studied the first volume of Lyell's Principles of Geology and then applied the same naturalistic assumptions to his interpretation of the biological evidence. With the apparent triumph of Darwinism, naturalism gained control of every discipline within the university, not only in the West, but also in the former communist lands and every other nation on earth. But Darwinian evolution has come under considerable fire in the past four decades, not only from people who are committed to the Bible but also from others who are agnostic regarding the existence of God. These diverse writers have argued that evolution is a 'theory in crisis' because scientific research has increasingly shown that it simply does not fit the facts of reality.\n \n \n Do you have links to these writers? \n \n Do you have any proof of these assertions?\n \n You close this paragraph with an unsupported, yet boldly sweeping statement, and either I have my head in the sand, or yours is in the clouds. :) \n \n Waxy", 
   {
    "unicode_changes_made": true
   }, 
   53601, 
   null, 
   1086999960.0
  ], 
  [
   53616, 
   null, 
   "T.Q", 
   "Hey gup,\n \n When are you going to admit you're wrong? I've proven on the other board that you're out to lunch on your assertion that \"faith is slipping\" in America, and that's what to blame for all the \"decay\". America is one of the most religious nations in the world. One of the least religious (Japan) also has one of the lowest crime rates. Funny how you bailed on that one.\n \n For those who don't know, gup is merely regurgiposting the same things he did at the old boards", 
   {}, 
   53615, 
   null, 
   1087000380.0
  ], 
  [
   53618, 
   null, 
   "Waxy", 
   "Hey gup,\n \n When are you going to admit you're wrong? I've proven on the other board that you're out to lunch on your assertion that \"faith is slipping\" in America, and that's what to blame for all the \"decay\". America is one of the most religious nations in the world. One of the least religious (Japan) also has one of the lowest crime rates. Funny how you bailed on that one.\n \n For those who don't know, gup is merely regurgiposting the same things he did at the old boards\n\n \n Would you be so kind as to point me to those boards?\n \n Waxy", 
   {}, 
   53616, 
   null, 
   1087000500.0
  ], 
  [
   53619, 
   null, 
   "T.Q", 
   "Sorry Waxy, here you are\n \n you debate boards", 
   {}, 
   53618, 
   null, 
   1087000800.0
  ], 
  [
   53621, 
   null, 
   "Waxy", 
   "Sorry Waxy, here you are\n \n you debate boards\n\n \n Thanks for the link T.Q.\n \n Gup20, nevermind.\n \n Waxy", 
   {}, 
   53619, 
   null, 
   1087001460.0
  ], 
  [
   53627, 
   null, 
   "thebootfitter", 
   "Oh? I would assert that the New Testament is just that - a body of many multiple evidences demonstrating that assertion to be true.\n\n The NT is not evidence for anything except that the NT exists. It is a series of writings by humans -- whom some individuals believe were inspired by the God about which the NT is written. \n \n \nAgain, because you don't accept non-naturalistic evidence doesn't mean it doesn't exist or that it is any less valid as evidence.\n\n It's not that I don't accept non-naturalistic evidence. It's that no evidence of the supernatural realm exists in this realm, except through belief by individual minds.\n \n Give me one example of objective evidence of anything supernatural. The very nature of the supernatural is that there cannot be objective physical evidence of it. If there were objective physical evidence of something, it would cease to be considered supernatural. Does this make sense?\n \n \nBasically, if you are not a Christian and do not have the indwelling of the holy spirit, it is possible to continually read the scriptures and it will remain a complete mystery to you.\n\n This states one of my main points fairly well. Faith is completely a matter of perspective. If you believe, then that which you believe makes sense. If you do not believe, that which you do not believe does not make sense.\n \n \nThe attitude I am talking about is that the supernatural cannot be studied. In fact, the supernatural is more dynamic than the natural, however this doesn't mean it is not repeatable or testable. It means you have to account for more variables before drawing conclusions.\n\n Please offer even one aspect of the supernatural realm that can be verified through objective tests. You cannot. This is the beauty of faith. It is very personal. It is very subjective. \n \n \nIn fact, one of the main causational factors in the realm of the spirit is faith. In a country where the supply of faith runs so thin, is it not surprising, then that the occurrence of the supernatural is decreased? Indeed it is possible for the supernatural to occur anywhere at any time - after all isn't that the essence of 'supernatural'? However it's likelihood is decreased.\n\n How do you know the likelihood of the manifestation of supernatural events are a function of faith? Consider, perhaps, that accounts of supernatural events are a function of knowledge. Perhaps, individuals with greater knowledge are less likely to interpret event X as supernatural when they understand the causes of event X. Are faith and knowledge mutually exclusive? Of course not. They cannot be, since one can only have knowledge of that which is knowable. Nothing about the supernatural is knowable -- it is only believable.\n \n \nSo you are basically saying that you think that fantastic co-incidences are possible, but that supernatural occurrences are not? Again, it seems you are willing to make an a priori judgment based on the assumption that the supernatural doesn't exist. I would assert that you 'weigh' this in a dogmatic paradigm of naturalism which you seem unable or unwilling to relinquish even in an attempt to critically and honestly analyze your position.\n \n No. I am saying that events are possible. Some individuals will choose to view these events as supernatural events. Other individuals will choose to view these events as fantastic coincidences. Other individuals will view these events as events that have happened and place no significance on them. I make no judgements on whether or not anything supernatural exists. If there is -- in reality -- a supernatural realm (including a God or gods), then there is a supernatural realm. If there is not... then there is not. Some people believe that there is, while others believe that there is not. The belief of these individuals does not change the truth of whether or not a supernatural realm does, in fact, exist.\n \n My 'position' is this: Whatever is, is. \n \n \nWhich is why I am here recommending that everyone try out real christianity for themselves.\n\n Without intending to be demeaning in any way, I always find statements like this quite humorous. What is 'REAL' Christianity? Your version? The Orthodox Church claims that they are the TRUE Christian Church. The Roman Catholic Church claims that they are the TRUE Christian Church. Many individual denominations or people claim that THEY follow the TRUE Christian teachings. So... if there is a REAL Christianity, as you seem to imply... what is it? Why are you 'right' and everyone else is 'wrong' in their estimation of what true Christianity really is?\n \n No matter how you look at it, faith is a matter of perspective. Belief is not knowledge. It is not objective. By definition, it is subjective.", 
   {}, 
   53612, 
   null, 
   1087005180.0
  ], 
  [
   53639, 
   null, 
   "OccamsRazor", 
   " In the YEC model, the originals (and their immediate offspring) would have the greatest information content (as Mutation had not yet had enough time to corrupt it). They probably had photographic precise memories, for example (reasonably - if we see an extraordinary ability today, and mutation cannot increase information, then that ability must have survived the process of information loss). As I said before, the building of the Ark, and engineering marvels such as the pyramids may be evidence of that higher intellect. Couple that with the possibility of increased strength and vitality - and we can now see the possibilities for such marvels such as the pyramids, Stonehenge, and Sacsahuamán and how they might be pointing to just this concept.\n\n \n Now, you often accuse those who advocate scientific concepts as subscribing to \"unproven\" ideas based on \"false assumptions\", but the above is an impressive bit of hyperbole even by your standards.\n \n You try to justify your position by conjecture, inference and guessing. How on earth do you propose you go about testing any of that? (aside from this odd idea that ancient archiceture is some sort of wonderous, inexplicable phenomenon).\n \n Ooops, you don't need to, I forgot.\n \n \n \nThis also is a huge blow to the uniformitarian. If, indeed, people lived up to 900 years... that would mean that the human genome has undergone considerable change since the beginning.\n\n \n Possibly. Then again, there could be a less fantastical explaination related to the nature of the account itself.\n \n \nIt is precisely this humanistic/atheistic attitude that began in the scientific community that has lead to a sort of spiritual dark age beginning to happen in the USA.\n\n \n Well, its always easier when you have just one group to single out and blame, isn't it? ;)\n \n \nI don't really have a problem with that - however it should still be taken into account that the majority of scientists and population held YEC as the norm.\n\n \n Now, that might count for something if there had been an alternative view for people to subscribe to.\n \n \nDarwin's book on favored races changed that. It 'popularized' the growing old age movement. This is important because we can see from the historical records that there was a large ammount of evidence that supported YEC (such as tree trunks found verticle through a few 'million years' of rock strata). After Darwin's ideas (and millions of years) became the excepted norm, we see this re-enforcement syndrome begin happening. Suddenly, people are interpreting evidence under a new paradigm. Because of a paradigm, people's interpretations and conclusions were starting to to exclude the possibility of a Young Earth for the first time. This is one reason why YEC geology is so slow. We have to re-investigate everything that was mis-interpreted. For example, early in the process it was common to date rock layers by the type of fossils found in them. Evolution supposed that X fossil was so many millions of years old, so those rock layers are labeled at that age. It's ironic to me, then, when so many evolutionists say \"Evolution must be right - otherwise why would we find all the animals in the order we expect and in rock layers that are the right age?\"\n\n \n I guess you are unaware of the point that the majority of evidence that relates to evolution and the age of the earth has only been know of for the last ~100 years? It was only under the auspices of modern science that so much was discovered. On fossils and absolute age you misunderstand the order of development. The first datings of fossils were in a relative stratigraphic context. The absolute ages came much later with the development of radiometric dating techniques. Before then, the ages were basically speculative.\n \n As always, I would be interested to hear your explaination of how present day fossil distributions came to be.\n \n \nToday we use more sophisticated radiometric dating - however - every single radiometric dating method is based on unproveable assumptions,\n\n \n What assumptions are unproveable? Oh, and by the way, you never did get back to me with an explaination as too why you trust your smoke alarm either :) \n \n \none of which is that the earth is not 6000 years old. In fact, many radiometric dating centers advertise their services do not work on 'young rocks'. If the earth is only 6000 years old, then ALL ROCKS are young rocks.... meaning these centers are incapable of coming to a correct date on ANY rocks. In fact, every time radiometric dating has been done on rocks we KNOW the ages of, it has misseralbly failed... inflating the dates by magnatudes of hundreds of thousands to millions (for example, dating rock from Mt St Helens formed 20 years ago gives the age of 1.9million years).\n\n \n If you are refering to the dating of xenoliths in 1981 Mt. St. Helens dacites, the issue is not with the dating technique, but with Dr Steve Austin's apparent omission of observations.\n \n \nBecause a niche of scientists explore a theory does not mean that theory had general recognition or acceptance. I am simply saying that Evolution was not generally popular or accepted until Darwin's book.\n\n \n Gup, with all due respect it was virtually an unknown, so how could it have had any acceptance?\n \n \nIn fact I did show you documented evidence in the form of that list of YEC scientists. I showed you direct quotes from Newton, for example. You, however, seem to refuse to accept any evidence I show. The fact that Newton wrote more about believing in Christ than he did about science didn't even give you pause? You ignored this and scoffed at Newton - 'He wasn't a geologist' (paraphrased).\n\n \n No he wasn't, and neither did he live at a time when he could have had the opportunity to comment on evolution, radiometric dating and so forth.\n \n \nThis was later called uniformitarianism by Charles Lyell. This is a not a refutation of Biblical teaching of Creation and the Flood, but a dogmatic refusal to consider them as even possible explainations.\n\n \n What? Hutton and Lyell developed ideas based around their observations of the natural world. There was no anti-Christian conspiracy as you seem to suggest.\n \n \nHistory is confirming that the scriptural geologists were right. Lyell's uniformitarianism was the ruling dogma of geology for almost 150 years until the late 1970s, when 'neocatastrophism' began to emerge, and with it came reinterpretations of the geological record. Lyell's way of interpreting the rocks simply does not fit the facts, and evidence of catastrophism on a continental, even global scale is becoming increasingly obvious, even to many evolutionists.\n\n \n The concept of uniformitarianism still holds true today. It is now combined with a knowledge that unusual (catastrophic if you really must) events have also occured. The two are quite happily reconciled together. \n \n I also know that you realise the evidence of most \"catastrophic\" events in geological history has only come to light over the last 2-3 decades.\n \n \nWe find a similar thing happening in biology. Old-earth geology paved the way for Darwinism. On his famous voyage around the world Darwin studied the first volume of Lyell's Principles of Geology and then applied the same naturalistic assumptions to his interpretation of the biological evidence.\n\n \n No, he arrived at his conclusions later. \n \n \nWith the apparent triumph of Darwinism, naturalism gained control of every discipline within the university, not only in the West, but also in the former communist lands and every other nation on earth. But Darwinian evolution has come under considerable fire in the past four decades, not only from people who are committed to the Bible but also from others who are agnostic regarding the existence of God. These diverse writers have argued that evolution is a 'theory in crisis' because scientific research has increasingly shown that it simply does not fit the facts of reality. \n\n \n Sounds a bit vague to me.... wonder why?\n \n \nHerein lies some dissimilarity because the evolutionary paradigm does not allow non-naturalistic evidence to be presented (for example - the Bible), whereas Creation is based primarily upon non-naturalistic evidence with natural evidence merely confirming or supportng the more important supernatural evidence.\n\n \n So in other words, lets see exactly what we want to see, and forget about all those silly little details. Good idea. Its a good thing you aren't talking medicine here...............\n \n \nEssentially, isn't this what evolution does. It rules out the possiblity of the supernatural before the investigation or intperpretation of facts even begins simply because evolutionist 'KNOWs' that it's not a possible explaination.\n\n \n All areas of science take this approach. Do you suggest medical trials of new treatments need to start testing supernatural hypotheses to have validity in your eyes?\n \n \nI would know quite a few people who would disagree with you. There are quite literally millions of peolpe on this planet who have personally experienced the supernatural and God. I am one of those - My mother-in-law's story is an example as well.\n \n This is also incorrect. The fact is, that many, many people have found the Bible and it's truths to be real and effective in their own personal lives. Many people have seen such things as prayer and healing work repetitively. Perhaps it's not naturalistic, but it's evidence, none the less.\n\n \n Yes, and millions don't seem to think a poetic account of the worlds origin is a literal truth into which every piece of evidence should be put, regardless of how awkward the fit.", 
   {
    "unicode_changes_made": true
   }, 
   53601, 
   null, 
   1087015200.0
  ], 
  [
   53694, 
   null, 
   "Gup20", 
   "No offense, but I simply dismiss all of this fairy tale, myth, and mental delusions. No more valid, or invalid, than any Roman, Viking, Aztec, or my very own stroy of creation and miracles with no physical proof.\n\n \n As I do evolution - as a myth ... a fairy tale... humanistic wishful thinking. It is a way to escape responsibility and put off the inevitable. It is like brushing the dirt under the rug... you didn't clean the dirt... you simply hide it so that you don't have look at it. \n \n \nYou better hope that we have milliions of years of time left, because it's going to take you AT LEAST that long.\n\n \n Clearly you have no idea what your dealing with when I mention prayer. \n \n \nYou don't really understand biostratigraphy, that much is clear to me, we'll deal with it in the new thread though.\n\n \n I suppose that is a fair analysis. However - I am not an expert on voodoo either - do I need that to know the truth about the origins of rock and rock layers? I see you have yet to start a geography thread. I invited you to ask me questions of a geological nature in a separate thread, yet you seem afraid to do so. Perhaps you are indeed afraid of what you might learn. \n \n \nSee my comment on biostratigraphy and change it to radiometric dating.\n\n \n This is your argument? I see you are still unable or unwilling to hear any evidence before making your decision. Waxy, everything you know about geology is based on a lie. If the initial assumption is wrong, the conclusiong is also wrong. I see you were completely unable to even touch the fact that if all rocks are young rocks.. then the calculation methods are entirely inaccurate, for example. \n \n \nI thought this was a debate, not a sermon to recruit new members.\n\n \n For this to be a debate, would you have to actually argue the things I present rather than categorically dismiss them without consideration?\n \n \nThis is a misrepresentation of Hutton and his work.\n\n \n Oh? So Hutton's own words are a misrepresentation of Hutton? In fact, this is what defines hutton's work. \n \n \nNeocatastophrism is in NO WAY at odds with Hutton's assertion. If events that are \"natural to the globe\" and that we \"know the principle of\" have caused catastrophic change, please explain to me why that violates Hutton's assertion?\n\n \n Hutton claimed that it was only through a process of millions of years that these layers could be accomplished. However, even evolutionists can no longer ignore the mouting evidence that this can happen quickly and in very short periods of time, and that in more and more places on earth, this is shown to be exactly what happened. \n \n \nBeyond that, how is catastophism exclusionary of an old earth model, let alone solid proof for a young earth model?\n\n \n Evolutionists are quickly running out of process that require millions of years to support their mythological claims. As more and more progress is made, fewer and fewer things are seen to require millions of years. The very fabric of old earth age is coming unraveled peice by peice. \n \n \nDo you have links to these writers? Do you have any proof of these assertions? You close this paragraph with an unsupported, yet boldly sweeping statement, and either I have my head in the sand, or yours is in the clouds. \n\n \n See, for example, books by Michael Denton (New Zealander, Ph.D. molecular biologist, agnostic), Evolution: A Theory in Crisis, Burnet Books, London, 1985; Phillip Johnson (American, law professor, Protestant Christian), Darwin on Trial, InterVarsity Press, Downers Grove, Illinois, USA, 1991; Duane Gish (American, Ph.D. biochemist, Protestant Christian), Evolution: The Fossils Still Say No! Institute for Creation Research, El Cajon, California, 1995; Michael Behe (American, Ph.D. professor of biochemistry, Roman Catholic), Darwin's Black Box: The Biochemical Challenge to Evolution, The Free Press, New York: 1996; Lee Spetner (American, Ph.D. physicist and biophysicist, Jewish), Not by Chance: Shattering the Modern Theory of Evolution, The Judaica Press, New York: 1997; Jonathan Sarfati (New Zealander, Ph.D. physical chemist, Protestant Christian), Refuting Evolution, Answers in Genesis, Brisbane, Australia, 1999; Fr. Seraphim Rose (American, Eastern Orthodox monk), Genesis, Creation and Early Man, St Herman of Alaska Brotherhood, Platina, California, pp. 293-339, 457-474, 2000. See also a wealth of information regarding evolution, creation, the age of the earth, and the Bible at these websites: www.icr.org, www.AnswersInGenesis.org and www.discovery.org/crsc/. \n \n \nWhen are you going to admit you're wrong? I've proven on the other board that you're out to lunch on your assertion that \"faith is slipping\" in America, and that's what to blame for all the \"decay\". America is one of the most religious nations in the world. One of the least religious (Japan) also has one of the lowest crime rates. Funny how you bailed on that one.\n \n For those who don't know, gup is merely regurgiposting the same things he did at the old boards\n\n \n For those who don't know, TQ's favorite thing to do is heckle these debates. He has no relevant positions or information. He simply loves to give nonsensical arguments to anything I say. \n \n \nThe NT is not evidence for anything except that the NT exists. It is a series of writings by humans -- whom some individuals believe were inspired by the God about which the NT is written.\n\n \n So the OT and NT wasn't written by the same person? The NT wasn't even written by one person? It is a collection then of multiple people's writings? You say it a collection of a series of writings by many different people? Well there goes our theory that the Bible is a single source of evidence. \n \n \nIt's not that I don't accept non-naturalistic evidence. It's that no evidence of the supernatural realm exists in this realm, except through belief by individual minds.\n\n \n This is of course an opinion without basis in fact. There is indeed evidence in the this realm, it's just that most evolutions are actively ignoring it, or perhaps 'dismissing it as a fairy tale, myth, and mental delusion'. As 'someone' here said - there are perhaps \"billions\" of examples - billions of pieces of evidence that are getting ignored. \n \n \n \nGive me one example of objective evidence of anything supernatural. The very nature of the supernatural is that there cannot be objective physical evidence of it. If there were objective physical evidence of something, it would cease to be considered supernatural. Does this make sense?\n\n \n \n Give me one example of objective evidence of anything natural. The very nature of the natural is that there cannot be objective evidence of it. If there were objective evidence of something, it would cease to be considered natural. Does this make sense?\n \n While somewhat childish this makes my point. The very problem here is that we live in a world that is both natural and spiritual. Our own selves and beings are both natural and spiritual. Evolution is a study based exclusively and only on the natural, ignoring (and totally not objective to) the spiritual. As such, it cannot be used to objectively consider the 'whole picture'. It cannot objectively come to conclusions. Indeed science is the study of the Natural, and science was born in Genesis 1 and 2. However, without including what we know of the spiritual, any conclusions drawn from a completely natural observation will be faulty. Clearly the spiritual exists - therefore an all-naturalistic reasoning process is insufficient to arrive at 'the truth'. \n \n YEC takes a different approach. We start from a standpoint that the Bible is true. We show naturaly and spiritualy things came to be.\n \n \n \nFaith is completely a matter of perspective. If you believe, then that which you believe makes sense. If you do not believe, that which you do not believe does not make sense.\n\n \n However, you hypothesis makes one glaringly obvious mistake. It assumes the spiritual realm doesn't exist and cannot exert force on the physical realm. Whether you believe it or not, heaven and hell are very real. Your assumption fails to account for that possibility. \n \n \n \nPlease offer even one aspect of the supernatural realm that can be verified through objective tests. You cannot. This is the beauty of faith. It is very personal. It is very subjective.\n\n \n Take a look at President GW Bush's 'Faith Based initiatives'. One of the primary reasons for this is the fact that faith-based groups have a much higher success rate at treating mental health issues such as addiction. My church, for example, runs a rehab center. As a matter of fact there are several pastors at my church who were formerly addicted to drugs and alchohol who are now free of these addictions, and have been for decades. There is testimony after testamony of people who are healed of their addiction. The Federal Government in the USA even recognizes this to be true. \n \n \nHow do you know the likelihood of the manifestation of supernatural events are a function of faith?\n\n \n I have observed this to be true. Also, the Bible proclaims this to be the case. \n \n \n \nConsider, perhaps, that accounts of supernatural events are a function of knowledge. Perhaps, individuals with greater knowledge are less likely to interpret event X as supernatural when they understand the causes of event X. Are faith and knowledge mutually exclusive? Of course not. They cannot be, since one can only have knowledge of that which is knowable. Nothing about the supernatural is knowable -- it is only believable.\n\n \n Because you do not have any spiritual knowledge, does not mean there is no such thing as spiritual knowledge. \n \n \nI make no judgements on whether or not anything supernatural exists. If there is -- in reality -- a supernatural realm (including a God or gods), then there is a supernatural realm. If there is not... then there is not. Some people believe that there is, while others believe that there is not. The belief of these individuals does not change the truth of whether or not a supernatural realm does, in fact, exist.\n \n My 'position' is this: Whatever is, is. \n\n \n It would seem on the surface that you are neutral, however, we know that there is no such thing as neutrality. Neutrality indicates acceptence of the norm or current standard. The fact that you are here arguing in favor of evolution futher demonstrates your true feelings on the issue. In fact, you have already made clear that you believe 'whatever is natural, is'. I do, however, respect your statement that the spiritual is 'possible'. \n \n \n \nWithout intending to be demeaning in any way, I always find statements like this quite humorous. What is 'REAL' Christianity? Your version? The Orthodox Church claims that they are the TRUE Christian Church. The Roman Catholic Church claims that they are the TRUE Christian Church. Many individual denominations or people claim that THEY follow the TRUE Christian teachings. So... if there is a REAL Christianity, as you seem to imply... what is it? Why are you 'right' and everyone else is 'wrong' in their estimation of what true Christianity really is?\n\n \n I guess you'll just have to try it for yourself and find out. ;)\n \n \n \n but the above is an impressive bit of hyperbole even by your standards.\n\n \n No hyperbole involved. All of this is reasonable. \n \n \n \nYou try to justify your position by conjecture, inference and guessing. How on earth do you propose you go about testing any of that?\n\n \n We can see that information is not added to a nuclear DNA though mutation. We have seen through lab testing that longevity (life span) is genetic. Moreover we know through medical science that mutative genetic defects can cause early death (such as diabetes, cancers, etc). Under this framework, Is it unreasonable to follow these backwards in time and come to the same conclusions I have come to?\n \n \n \nPossibly. Then again, there could be a less fantastical explaination related to the nature of the account itself.\n\n \n I am glad to see that you think this is possible. \n \n \n \nWell, its always easier when you have just one group to single out and blame, isn't it? \n\n \n Humanistic influence for more than just 1 group. We can even see humanistic influences in the church.\n \n \n \nNow, that might count for something if there had been an alternative view for people to subscribe to.\n\n \n Yet so many people change their tune when we suggest that Evolution should be presented in the public schools with alternatives. Presenting opposing views has always promoted critical thinking... something severly lacking in our public education system today. \n \n \n \nIt was only under the auspices of modern science that so much was discovered. On fossils and absolute age you misunderstand the order of development. The first datings of fossils were in a relative stratigraphic context. The absolute ages came much later with the development of radiometric dating techniques. Before then, the ages were basically speculative.\n\n \n So basically, we are saying the same thing - that there is indeed a re-inforcement syndrome happening. You are basically saying that the modern beliefs are based on the original assumption verified by techniques which make the same assumptions (radiometric dating, for example). \n \n \n \nAs always, I would be interested to hear your explaination of how present day fossil distributions came to be.\n\n \n Two things here - first, your assumption that fossils are always found in order. This is incorrect. For example, see the article \"Fossil Pollen in Grand Canyon Overturns Plant Evolution\". Also see \"The fossil record: becoming more random all the time\" and \"How well do paleontologists know fossil distributions?\". \n Secondly, there are explainations for fossils found in specific places according to the YEC model. For example, see Assessing Creationist\n Stratigraphy with Evidence from the Gulf of Mexico and The Geologic Column: Does It Exist?.\n \n \n \nIf you are refering to the dating of xenoliths in 1981 Mt. St. Helens dacites, the issue is not with the dating technique, but with Dr Steve Austin's apparent omission of observations.\n\n \n That is merely one example. Someone else pointed out to me that the dating center Austin used advertised that they were unable and unqualified to date 'young rocks'. If YEC are right, then all rocks are young rocks (indeed we have seen that no rocks take millions of years to form) and therefore any date obtained from this dating center is categorically incorrect by many orders of magnitude.\n \n \n \nGup, with all due respect it was virtually an unknown, so how could it have had any acceptance?\n\n \n This is my very point. PB seemed to be trying to paint this revised version of history where no real science happened until natural 'evolution' was instigated. She says that YEC was a started as a reaction to evolutionary thought. In reality, YEC was the accepted theory of the day, and didn't need to be identified until it was no longer the common perception. In fact a lot of foundational science happened under YEC theology - such as Newton's work. Perhaps 'modern geology' wasn't... but modern geology while correct in data is wrong in intepretation. \n \n \nWhat? Hutton and Lyell developed ideas based around their observations of the natural world. There was no anti-Christian conspiracy as you seem to suggest.\n\n \n I am not suggesting an anti-christian conspiracy... I am suggestion these men rejected christianity and wanted to find a purely naturalistic means through which to interpret the facts they saw. This is quite clear from Hutton's own words.", 
   {
    "unicode_changes_made": true
   }, 
   53639, 
   null, 
   1087074120.0
  ], 
  [
   53704, 
   null, 
   "thebootfitter", 
   "So the OT and NT wasn't written by the same person? The NT wasn't even written by one person? It is a collection then of multiple people's writings? You say it a collection of a series of writings by many different people? Well there goes our theory that the Bible is a single source of evidence. \n\n I'm not certain I understand the point you are attempting to make. Is it that the Bible is not a single source, but rather multiple sources, so therefore it is more credible?\n \n The Bible does not constitute physical evidence, no matter the number of human authors it had. The Bible is a book. A series of writings. I could write a book or a series of writings to share with you. If I truly believed what I wrote, and there were sufficient motivation for you to believe what I wrote, you would believe that which I wrote is true.\n \n \nThis is of course an opinion without basis in fact.\n\n No. Sorry. This is fact. The nature of the supernatural is that it exists outside of the physical realm. If there is evidence for it in the physical realm, it is no longer supernatural -- BY DEFINITION.\n \n \nThere is indeed evidence in the this realm,\n\n Share with us one example.\n \n \nGive me one example of objective evidence of anything natural. The very nature of the natural is that there cannot be objective evidence of it. If there were objective evidence of something, it would cease to be considered natural. Does this make sense? \n\n No, this makes absolutely no sense at all. Place an object on a table in front of you. Now, touch that object. That object exists in the physical realm. The evidence is the object itself. You could repeat the experience over and over and over again, and the evidence itself would not change. Nor would the obvious conclusion that the object exists in the physical realm (i.e. has mass).\n \n \nHowever, without including what we know of the spiritual, any conclusions drawn from a completely natural observation will be faulty. Clearly the spiritual exists - therefore an all-naturalistic reasoning process is insufficient to arrive at 'the truth'. \n\n And just what do we KNOW of the spiritual? We can only BELIEVE the spiritual. There is no knowledge of the spiritual that can be attained in this physical realm.\n \n You say that \"clearly the spiritual exists...\" This would be an accurate statement like this: \"Clearly some individuals believe that the spiritual exists. It is possible that the spiritual exists in reality, but in a different realm of existence than our physical realm. If a spiritual realm does exist, it is even possible that the spiritual and the physical realm interact with each other on some levels, but there is no physical evidence of this interaction in the physical realm that can be verified through any objective means. As such, this interaction of realms can only be believed through faith.\"\n \n (If you haven't caught on yet, I am not really saying anything contrary to what you believe.)\n \n \nHowever, you hypothesis makes one glaringly obvious mistake. It assumes the spiritual realm doesn't exist and cannot exert force on the physical realm. Whether you believe it or not, heaven and hell are very real. Your assumption fails to account for that possibility. \n\n I make no hypothesis. I make no assumption. I state that which is. If you have faith in something supernatural, you will see through the eyes of your faith. If you do not have faith in something supernatural, you will see the world from a different perspective. \n \n Based on your statements, it appears that you believe that heaven and hell are very real. It may be that heaven and hell are very real. But just because you believe heaven and hell are very real does not mean that they are real. It is also possible that heaven and hell are concepts that were completely fabricated by humans so long ago that nobody remembers that they were made up.\n \n \n \n \n \nTake a look at President GW Bush's 'Faith Based initiatives'. One of the primary reasons for this is the fact that faith-based groups have a much higher success rate at treating mental health issues such as addiction.\n\n This may be true. Even though you haven't posted any sources to support the statement, I have no reason to disbelieve it. This doesn't constitute evidence of the supernatural. It constitutes evidence that 'faith-based groups have a much higher success rate at treating mental health issues...' It may give individuals enough reason to believe that some supernatural force is at work, especially if that's what they want to believe.\n \n \nMy church, for example, runs a rehab center. As a matter of fact there are several pastors at my church who were formerly addicted to drugs and alchohol who are now free of these addictions, and have been for decades. There is testimony after testamony of people who are healed of their addiction. The Federal Government in the USA even recognizes this to be true. \n\n One would have to be a fool to disbelieve something for which there is evidence. Your church runs a rehab center. Okay. I can accept that. It's a fact. You could take me to it if I ever came to visit. There are several individuals who have been treated successfully for addictions. Okay. I can accept that. After defining the term 'successfully,' we could determine the objective standards to judge whether or not this statement is true. I have no doubt that many, many individuals no longer are ruled by their addictions. If there is evidence for this, of course I would be a fool to disbelieve it.\n \n Are you suggesting that this is evidence of a supernatural realm? Hey... wait a second. Did you know that there are also many non-faith based addiction programs from which many, many individuals have been treated successfully?\n \n \nI have observed this to be true. Also, the Bible proclaims this to be the case. \n\n Of course. It does make sense. Where there is no faith in the supernatural, no one will perceive supernatural events to occur. \n \n \nBecause you do not have any spiritual knowledge, does not mean there is no such thing as spiritual knowledge. \n\n Right. I agree. And just because you believe that there is a spiritual realm does not mean that there is a spiritual realm.\n \n \nIt would seem on the surface that you are neutral, however, we know that there is no such thing as neutrality. Neutrality indicates acceptence of the norm or current standard. The fact that you are here arguing in favor of evolution futher demonstrates your true feelings on the issue. In fact, you have already made clear that you believe 'whatever is natural, is'. I do, however, respect your statement that the spiritual is 'possible'. \n\n I find this paragraph quite humorous. I am not arguing in favor of anything. It matters none to me what the current standard or 'norm' is. You misquote me by adding the word 'natural.' I said no such thing. I said, \"Whatever is, is.\" This includes the supernatural, if such a thing exists in reality.\n \n You wanna hear a secret? Well, it's not really a secret, since I have stated it openly on these forums many times. I, personally, do believe that a supernatural realm exists. I have had many personal experiences that I attribute to supernatural causes. I was baptized a Christian, and continue to live a Christian life. All I am saying here is that everything that I believe is believed through faith and faith alone. Without faith, my entire life experience would have been perceived very differently by me. Without faith, there is absolutely no evidence of anything supernatural. And if 'evidence' depends on the perspective, then it cannot be considered objective.\n \n My point is... if you believe in the supernatural, you do so by faith alone. And that, in my opinion, is a beautiful thing. (Though, some may disagree.)", 
   {}, 
   53694, 
   null, 
   1087089960.0
  ], 
  [
   53711, 
   null, 
   "Waxy", 
   "It is a way to escape responsibility and put off the inevitable. It is like brushing the dirt under the rug... you didn't clean the dirt... you simply hide it so that you don't have look at it. \n\n \n That is EXACTLY how I view religion, and YEC in particular. \n \n \nI suppose that is a fair analysis. However - I am not an expert on voodoo either - do I need that to know the truth about the origins of rock and rock layers? I see you have yet to start a geography thread. I invited you to ask me questions of a geological nature in a separate thread, yet you seem afraid to do so. Perhaps you are indeed afraid of what you might learn. \n \n \n LOL. I guess there's no need to understand something to dismiss it, let alone comment intelligently about it. :p \n \n I read through many of your other debates and \"evidence\" at the link provided. Based on that, I'm not real interested in discussing the issue with you. \n \n I did actually start a geology thread, I deleted it for the reason above.\n \n \nThis is your argument? I see you are still unable or unwilling to hear any evidence before making your decision. Waxy, everything you know about geology is based on a lie. If the initial assumption is wrong, the conclusiong is also wrong. I see you were completely unable to even touch the fact that if all rocks are young rocks.. then the calculation methods are entirely inaccurate, for example.\n \n \n That's one complex lie! Oh well, it makes me lots of money. :p \n \n And this from a man that admits he has a poor understanding of geology. emoticon_rolleyes \n \n Feel free to post a new thread with all of your evidence. I'll peruse it.\n \n Waxy", 
   {}, 
   53694, 
   null, 
   1087096140.0
  ], 
  [
   53725, 
   null, 
   "montalban", 
   "I'm going to have to wade in at all your guys making mistakes.. on both sides of the argument, though I'm a bit more lennient to Gup\n \n First a mistake repeated by two different posters...\n \nMore precisely, YE creationism is based on the interpretation of the Bible by certain 7th Day Adventists around the turn of the century.\n\n \n \n This is false. Until Darwin, most Christians were Old Earth Creationists, since that was what the geologic record showed. Christian geologists were looking for signs of Noah's Flood, realized that what they were seeing was evidence of several different glaciations which need far more time than a 6000 year earth can provide. Ironically, it was Charles Darwin who started Young Earth Creationism; most Christians were content to accept the findings of geology. But some Christians were so repelled by the idea that humanity may have evolved from apes that they reacted by insisting on a literal interpretation of Genesis.\n\n \n What's this 'most Christians...' idea? The Orthodox Church is the second largest Christian denomination and it does not teach an old earth. It is almost insulting that all you guys have such a narrow 'western-orientated' view of Christianity in the first place - that when you refer to Christianity in general terms you actually mean that which is western.\n \n \n Look up Lyell and Hutton. Well before Darwin there were long disputes, sometimes acrimonious, among geologists about the processes that produced the geologic features that were observed - uniformitarianism vs. catastrophism, whether most rocks were igneous or precipated, and so forth - and all of these arguments were based on the acceptance by each side that the earth was millions of years old.\n\n \n What of them? They hardly existed centuries before Darwin. Further, you'd have to show their ideas not only being disseminated right across all of Christendom, but being accepted by the large majority.\n \n \n This is false. Lyell's book on geology was very popular well before Darwin even went on his around the world trip.\n\n \n Harry Potter is popular too, I wouldn't take this to mean that most people believe in witchcraft. And your term 'well before Darwin' is highly subjective.\n \n \nI would reject this as complete fallacy. Up until the the Bible was printed in English, most people couldn't read it for themselves. They relied on the catholic church to tell them what it said - and the catholic churches position was that God created the earth in 7 literal days.\n\n \n An absolute nonsense. People were able to read the Bible in other language, Greek, Russian etc.\n \n \nClearly those closer to these events would have more clear, first hand knowledge. \n\n \n \nGup -- Consider something for a moment...\n \n If a literal interpretation of Genesis is correct, then there would have been no human being in existence to witness the creation of the universe in which we reside. No one would have been any physically closer to the events of creation than we are today. Perhaps they were closer in time, but what does time matter when one does not exist?\n\n \n What about the bits of Genesis involving people such as Adam + Eve? Even if you don't believe in Genesis, by Gup's own reasoning Adam + Eve would have a knowledge of themselves being different (probably no belly-button etc).\n \n \nAnd what about for those who do not 'believe in' the Bible the same way you believe in the Bible? Is the Bible NOT a revelation of absolute truth?\n \n The fact is... Truth is truth. And your beliefs, while they may or may not coincide with some or all aspects of that truth, have no bearing on the truth of that truth. Does this make any sense? No matter what you believe, your beliefs do not change the truth that already exists. Your beliefs are completely independent of the truth that already exists.\n\n \n Err... you sort of contradict yourself here. You just assume that the truth as understood by Gup is not 'the truth'.\n \n \n Hmm. You seem to get side tracked easily. If I understood your point correctly (and please correct me if I misunderstood you) you claimed that YEC was the norm until Darwin published the theory of evolution. I am saying that this is incorrect -- scientists accepted that the earth is at least millions of years old before Darwin. Lyell and Hutton influenced scientific thinking well before Darwin.\n\n \n No, before you claimed it was Christians who had accepted the old earth. Now it's just scientists.\n \n You stated (and I re-posted it earlier...\n \n This is false. Until Darwin, most Christians were Old Earth Creationists\n\n \n \n \nKeep in mind that only one particular, modern interpretation of the Bible is at odds with science.\n \n Most Christians don't see any conflict at all.\n\n \n Do you have the studies to prove this claim to speak for most Christians? You are trying a numbers-game to discredit Genesis. Whilst you and I might disagree on the truth of Genesis, your statements here aren't supported by facts.\n \n Do you have any recorded statements of early Christian thinkers who believed in an old earth?\n \n Here's some who didn't.\n \n \"No on should think that the Creation of Six Days is an allegory\" said St Ephraim the Syrian \n \n \n \n St. Basil the Great in his Hexatemeron (commentary on Genesis) says \"Therefore, let it be understood as it has been written.\" \n \n \n \n St.Macarius the Great of Egypt in commenting on Genesis 3:24 said \"This is a passage which many of us might have expected to have only a mystical meaning, but this great seer of Divine things assures us that is is also true \"just as it is written\" for those capable of seeing it.\" (pp85-6 Seraphim Rose \"Genesis, Creation and Early Man: The Orthodox Christian Vision) \n \n \n \n St. John Chrysotomon says \"When you hear \"God planted Paradise in Eden in the East,\" understand the word 'planted' befittingly of God: that is, that He commanded; but concerning the words that follow, believe precisely that Paradise was created and in that very place where the Scriptures has assigned it\"\n \n Ibid, p88.\n \n \n \n St John Chrysotomon, St Ephraim the Syrian, St Basil the Great, St. Ambrose of Milan, St. Gregory of Nyssa, St. Symeon the New Theologian, St. Athanasius the Great, St. Augustine of Hippo, St. Isaac the Syrian, St. Abba Dorotheus, St. Macarius the Great, St. Gregory Palamas, et al all wrote commentaries on the truth of Genesis.\n \n \n \n \nThe Bible is the inspired, infallible Word of God - it is absolute truth. \n\n \n \n \nAnd this is a belief. This is not knowledge. This can be accepted only through faith. There is no evidence anywhere in existence to support this assertion, except through belief.\n\n \n \n \n This is a value-ridden statement assuming that the only source of knowledge is that which can come from 'evidence' (and by this you most likely only mean scientific).\n \n \n \n \nWell - consider Adam. When Adam was created, he was able to witness the creation of Eve. He spoke with God face to face (until the Fall anyway). God may very well have given him a first hand account. \n\n \n \n \nYou are making an assumption here. Nowhere in scripture that I'm aware of does it say that God gave Adam a first-hand account of creation. So it appears you are placing your belief in nothing more than an assumption.\n\n \n \n \n You are making an assumption here that the Bible is the only source for knowledge of God. Leaving Adam aside, Jesus, who is God incarnate as man refers to the 'creation'. \n \n \"The fullness and perfection of God's self-revelation is found in His Son Jesus Christ, the fulfilment of the gradual and partial revelation of God in the Old Testament. Jesus is the one truly \"blessed ... who comes in the name of the Lord.\"\n \n http://www.oca.org/pages/orth_chri/orthodox-faith/doctrine/Revelation.html\n \n \n \n Further the Apostles were given the gift of the Holy Spirit.", 
   {
    "post_info": {
     "post_title": "Just a few mistakes based on assumptions"
    }
   }, 
   53613, 
   null, 
   1087127940.0
  ], 
  [
   53726, 
   null, 
   "OccamsRazor", 
   "\n No hyperbole involved. All of this is reasonable. \n \n\n \n How so? You make a series of un-testable statements to fit your ideas. If humans are on a downward hill of intellect as you assert, how do explain the development of increasingly advanced technologies over the last, for example, 100 years?\n \n \nWe can see that information is not added to a nuclear DNA though mutation. We have seen through lab testing that longevity (life span) is genetic. Moreover we know through medical science that mutative genetic defects can cause early death (such as diabetes, cancers, etc). Under this framework, Is it unreasonable to follow these backwards in time and come to the same conclusions I have come to?\n\n \n If we can get a clear and definitive answer to what this \"information\" is to which you refer, then I'll give you an answer in kind.\n \n \nI am glad to see that you think this is possible.\n \n \n If you mean that Genesis is the re-writing of Babylonian myths within a new context, yes.\n \n \nYet so many people change their tune when we suggest that Evolution should be presented in the public schools with alternatives. Presenting opposing views has always promoted critical thinking... something severly lacking in our public education system today. \n\n \n So you think that it is reasonable for evolution to be taught in religious education class? I don't. Keep the evolution in biology class and the Christianity in RE.\n \n \nSo basically, we are saying the same thing - that there is indeed a re-inforcement syndrome happening. You are basically saying that the modern beliefs are based on the original assumption verified by techniques which make the same assumptions (radiometric dating, for example).\n\n \n No I, disagree with that. Radiometric dating is a separate line of evidence that has served to validate the relative ages the stratigraphic column described. When radiometric dating was applied to the column, the absolute could have put the various periods in a different order if the positioning was wrong. But this was not what the testing showed. Radiometric dating is not a construct to \"prove\" ancient dates, but a technique that offers the opportunity to see just how old some things actually are. \n \n \nTwo things here - first, your assumption that fossils are always found in order. This is incorrect. For example, see the article \"Fossil Pollen in Grand Canyon Overturns Plant Evolution\". Also see \"The fossil record: becoming more random all the time\" and \"How well do paleontologists know fossil distributions?\". \n Secondly, there are explainations for fossils found in specific places according to the YEC model. For example, see Assessing Creationist\n Stratigraphy with Evidence from the Gulf of Mexico and The Geologic Column: Does It Exist?.\n\n \n In response to your links, in the order of which you present them:\n \n 1) Pollen in Precambrian basement rock, Grand Canyon\n \n 2) So this article basically tries to tell Christians to \"resist the temptation of buying into any sort of scheme which presumes that fossils can be used to delineate time-horizons in the earth's sedimentary rocks\" based on a few poorly made examples. Not going to be getting any jobs as stratigrapher's in the oil industry are we? By the way, I'm still waiting for you to give a response on the use of foramanifera as stratigraphic markers in oil exploration.\n \n 3) It is entirely reasonable that two (or more) workers independently discovering and naming the same fossil differently. If you broadened your reading beyond AiG and ICR on this subject, you would also understand that when such situations come to light, the fossils are re-classified under one name, if appropriate.\n \n 4) The latter part of this article briefly discusses actual biostratigraphy of the Gulf of Mexico (there is a good .pdf representation at the end), as well as an interesting view expressed in the final section entitled \"A Christian Responds\":\n Talk.origins post of the month, September 2002 \n \n 5) This article was the most disingenous of them all. In particular \"To the diluviologist this means, of course, that only the local succession has to be explained by Flood-related processes\" basically says \"lets ignore the subtlety of the evidence\".\n \n The Stratigraphic column is a model, but it is one that stands up to testing, is open to real scientific scrutiny (as all scientific models are) and is successful enough to have wide ranging economic applications in major industries.\n \n \n Edit: Another point on how YEC making predictions about fossil distribution: how come we can find fossils on top of some of the highest mountains on the planet- the limestones of the Himlayers on Mt. Everest and K2- but none on the slopes of giant volcanoes such as Mt. Kilimanjaro in Tanzania and Mt. Fuji in Japan, both with summits at lower altitudes?\n \n \nThat is merely one example. Someone else pointed out to me that the dating center Austin used advertised that they were unable and unqualified to date 'young rocks'. If YEC are right, then all rocks are young rocks (indeed we have seen that no rocks take millions of years to form) and therefore any date obtained from this dating center is categorically incorrect by many orders of magnitude.\n\n \n The testing centre was correct to openly acknowledge the limitations of their testing equipment (that it was not suitable for use on samples under 2 My old), to their credit. I wish I could be as positive about Dr. Austin's motivations in his exercize.\n \n Although it has been explained to you on several occasions, I will once again point out why potassium/argon (K-Ar) dating is unsuitable for use on \"young rocks\" in the hope you will remember this time.\n \n Once potassium-40 is fixed in a crystalline structure (for example, a recently cooled lava flow) it will take several thousands of years before sufficent radioactive decay occurs to produce detectable quantities of Argon-40. This is because the potassium has a radioactive half live of ~1,250 My. The next consideration is the accuracy of the testing equipment available. Basically, quantities of Argon remain in the less advanced apparatus, limiting the \"youth\" of the minerals that can be dated. So as we see, the K-Ar method is not suitable for use on rocks thought to originate more than a few thousand years ago on the very best testing equipment, and 2 million years on the equipment Austin used. As his rocks dated from 1986, it is expected  that the tests he used would return a wildly inaccurate age.\n \n Which goes to show how radiometric dating requires a good understanding of many ideas before you can expect to get a meaningful result.\n \n For a more in-depth analysis of Dr. Steve Austin's cleverly constructed scientific fraud, see this article:\n \n Young-Earth Creationist 'Dating' of a Mt. St. Helens Dacite: The Failure of Austin and Swenson to Recognize Obviously Ancient Minerals \n \n N.B. while we are discussing radioactive half life, have you decided if you can trust your smoke alarm yet?\n \n \nThis is my very point. PB seemed to be trying to paint this revised version of history where no real science happened until natural 'evolution' was instigated. She says that YEC was a started as a reaction to evolutionary thought. In reality, YEC was the accepted theory of the day, and didn't need to be identified until it was no longer the common perception. In fact a lot of foundational science happened under YEC theology - such as Newton's work. Perhaps 'modern geology' wasn't... but modern geology while correct in data is wrong in intepretation.\n\n \n Ursus maritimus was correct in their analysis of modern YEC. As You've said before, and to which I agreed, the present day YEC movement, particularly the scientific component, dates from the last 30 or so years. It is a reactionary force to the areas of science concerned with evolution and any aspect of dating the universe in which we live.\n \n Now, if we turn the clock back to Newton and his contemparies, no doubt many, if not all, believed in Creation and a young earth, but no one had developed a coherent explaination of natural evolution that they could have even had the possibility of subscribing too. So, when you start running Newton's colours up the YEC flagpole you are basically claiming a champion that does not belong to your cause.\n \n \nI am not suggesting an anti-christian conspiracy... I am suggestion these men rejected christianity and wanted to find a purely naturalistic means through which to interpret the facts they saw. This is quite clear from Hutton's own words.\n\n \n I do not agree that Hutton rejected Christianity. Any such notions are at odds with biographical accounts of the man. Hutton was actually a devout Christian. What he did not subscribe to was that the earth could be a mere few thousand years old.\n \n As regards Lyell, as far as I have read he did not reject Christianity, but did not accept a catastrophic creation in the period of a few thousand years.", 
   {
    "unicode_changes_made": true
   }, 
   53694, 
   null, 
   1087131720.0
  ], 
  [
   53737, 
   null, 
   "Ursus maritimus", 
   "For those who don't know, TQ's favorite thing to do is heckle these debates.\n\n And your favorite thing to do, Gup20, seems to be changing the subject or veering off-topic. I seem to recall that in another thread you were supposed to present a scientific prediction based on scientific creationism.", 
   {}, 
   53694, 
   null, 
   1087149360.0
  ], 
  [
   53738, 
   null, 
   "Ursus maritimus", 
   "What's this 'most Christians...' idea? The Orthodox Church is the second largest Christian denomination and it does not teach an old earth. It is almost insulting that all you guys have such a narrow 'western-orientated' view of Christianity in the first place - that when you refer to Christianity in general terms you actually mean that which is western.\n\n I plead guilty, Montalban. My apologies. I guess I should have specifically said \"Western Christians\". However, my guess is that Gup20 is also thinking of Western Christians - if he is typical of Protestant evangelism (and he may not be -- he can clarify if he wishes) he probably doesn't count the Eastern Orthodox as \"true Christians\". On the other hand, he did present the teaching of the Catholic Church as indicative of what \"most Christians\" believed, so maybe he does count the Orthodox.\n \n \n \nHarry Potter is popular too, I wouldn't take this to mean that most people believe in witchcraft.\n\n Harry Potter is popular fiction. That is different than saying a science book is popular.\n \n \n \nNo, before you claimed it was Christians who had accepted the old earth. Now it's just scientists.\n\n I am quite confident that most scientists of Darwin's time accepted an old earth. I am willing to bet a pizza on it. I am less confident that most educated, Western Christians of Darwin's time accepted an old earth, but I will continue to believe it until presented with evidence to the contrary. Gup20's argument is that it was Darwin who somehow made an old earth popular. I disagree with this.", 
   {}, 
   53725, 
   null, 
   1087149900.0
  ], 
  [
   53802, 
   null, 
   "montalban", 
   "I plead guilty, Montalban. My apologies. I guess I should have specifically said \"Western Christians\". However, my guess is that Gup20 is also thinking of Western Christians - if he is typical of Protestant evangelism (and he may not be -- he can clarify if he wishes) he probably doesn't count the Eastern Orthodox as \"true Christians\". On the other hand, he did present the teaching of the Catholic Church as indicative of what \"most Christians\" believed, so maybe he does count the Orthodox.\n \n\n \n You are not alone. It was only very recently that soldiers in the US Army who had an Orthodox faith, had to have \"P\" (for Protestant) on their dog-tags because they weren't Catholic.\n \n For the US Army it was an either/or scenario. If you were Christian, but not Catholic, you must ergo be Protestant.\n \n We don't have the high profile", 
   {}, 
   53738, 
   null, 
   1087186080.0
  ], 
  [
   53867, 
   null, 
   "Ursus maritimus", 
   "Well, Orthodox used to be really, really rare in the West. Not that it excuses bureaucratic apathy. I wonder how long the Muslims in the US armed forces had to wait until their religion was recognized as distinct?", 
   {}, 
   53802, 
   null, 
   1087234440.0
  ], 
  [
   53875, 
   null, 
   "The Barbarian", 
   "Barbarian observes:\n More precisely, YE creationism is based on the interpretation of the Bible by certain 7th Day Adventists around the turn of the century. \n \n Originally Posted by Ursus maritimus\n This is false. Until Darwin, most Christians were Old Earth Creationists, since that was what the geologic record showed. Christian geologists were looking for signs of Noah's Flood, realized that what they were seeing was evidence of several different glaciations which need far more time than a 6000 year earth can provide. Ironically, it was Charles Darwin who started Young Earth Creationism; most Christians were content to accept the findings of geology. But some Christians were so repelled by the idea that humanity may have evolved from apes that they reacted by insisting on a literal interpretation of Genesis.  \n \n \nWhat's this 'most Christians...' idea? \n\n \n Slightly more than half of all Christians are Roman Catholics. As you know, the Roman Catholic church teaches that there is no conflict between an old universe and God's Word. Most Christians are Roman Catholic. Since I know a fair number of Orthodox Christians who don't think the earth is young, could you show me with some evidence, which denominations within the Orthodox churches do teach that an old earth is not consistent with their faith?\n \n Quote:\n Originally Posted by Ursus maritimus\n Look up Lyell and Hutton. Well before Darwin there were long disputes, sometimes acrimonious, among geologists about the processes that produced the geologic features that were observed - uniformitarianism vs. catastrophism, whether most rocks were igneous or precipated, and so forth - and all of these arguments were based on the acceptance by each side that the earth was millions of years old. \n \n \nWhat of them? They hardly existed centuries before Darwin. Further, you'd have to show their ideas not only being disseminated right across all of Christendom, but being accepted by the large majority.\n\n \n St. Augustine repeatedly tried to reconcile a literal Genesis, and finally gave up on it. And he's a doctor of the Church, perhaps the most respected theologian.\n \n Posted by Ursus maritimus\n [b]This is false. Lyell's book on geology was very popular well before Darwin even went on his around the world trip. [/quote]\n \n \nHarry Potter is popular too, I wouldn't take this to mean that most people believe in witchcraft. And your term 'well before Darwin' is highly subjective.\n\n \n In fact, most scientists, by Darwin's time, had accepted Lyell's geology. You do understand that Lyell wrote book on geology, not fiction? \n \n Barbarian obsrves:\n Keep in mind that only one particular, modern interpretation of the Bible is at odds with science.\n \n Most Christians don't see any conflict at all. \n \n \nDo you have the studies to prove this claim to speak for most Christians? \n\n \n Yep. Most Christians are Roman Catholics, who acknowledge there is not conflict. But they are far from the only denomination. Anglicans, most Lutherans, Methododists, etc. are also in agreement with Scripture and science.\n \n \nYou are trying a numbers-game to discredit Genesis.\n\n \n No, I'm pointing out that most Christians accept this, and I'm doing it in defense of Genesis. Genesis specifically rules out YE creationism, since it denys ex nihilo creation of life, which is a fundamental part of YE creationism.\n \n \nWhilst you and I might disagree on the truth of Genesis, your statements here aren't supported by facts.\n\n \n Sure they are. If you don't believe me, go look it up. Most of us are Roman Catholics, and a lot of other denominations agree with us on this point.\n \n \nDo you have any recorded statements of early Christian thinkers who believed in an old earth?\n\n \n Augustine plainly said it was absurd to think of literal mornings and evenings, with no sun to have them. Origen asserted that the days were figurative, not literal 24-hour periods.\n \n \nSt. Basil the Great in his Hexatemeron (commentary on Genesis) says \"Therefore, let it be understood as it has been written.\"\n\n \n Both Origen and Augustine would agee with that. They would say that the YE people were not reading it as written, but instead tried to take it literally.\n \n \nSt. John Chrysotomon, St Ephraim the Syrian, St Basil the Great, St. Ambrose of Milan, St. Gregory of Nyssa, St. Symeon the New Theologian, St. Athanasius the Great, St. Augustine of Hippo, St. Isaac the Syrian, St. Abba Dorotheus, St. Macarius the Great, St. Gregory Palamas, et al all wrote commentaries on the truth of Genesis.\n\n \n Indeed. But the truth, as some have pointed out, is not necessarily what you'd like it to be.", 
   {}, 
   53802, 
   null, 
   1087237740.0
  ], 
  [
   53880, 
   null, 
   "thebootfitter", 
   " What about the bits of Genesis involving people such as Adam + Eve? Even if you don't believe in Genesis, by Gup's own reasoning Adam + Eve would have a knowledge of themselves being different (probably no belly-button etc).\n\n My point with this argument is simply that (assuming a literal interpretation) Adam was created after everything else -- with the exception of Eve. (Though, IIRC, Adam was placed in a deep sleep during the creation of Eve. Not important to my argument, really.) Therefore, he would have had no first-hand knowledge of the rest of creation. He would not have witnessed anything. And nowhere does scripture say that God told Adam explicitly how God created the earth. The differences of, and what came after Adam and Eve have no bearing on my argument.\n \n \nErr... you sort of contradict yourself here. You just assume that the truth as understood by Gup is not 'the truth'.\n\n Read that again. I make no such assumption. I freely concede that Gup's beliefs may coincide 100% with the absolute truth. But neither Gup, nor anyone else existing in the physical realm KNOWS the absolute truth. So there is no way of validating whether Gup is 'right' or whether atheists may be 'right' regarding their belief of the absolute truth.\n \n Consider that your beliefs and Gup's beliefs are likely quite distinct. My impression of your posts is that you believe your perspective to be the 'right' one, because the Orthodox Church was founded by Jesus Christ and has had no breaks with the origins of Christ's teachings. My impressions of Gup's posts is that Gup believes that Gup has the 'true' understanding of what it means to be a Christian. Within this framework, at least one of you must be 'wrong.' There is no possible way within the physical realm to determine objectively who is 'right' and who is 'wrong.' These concepts of right and wrong within this framework are matters of belief.\n \n \nThis is a value-ridden statement assuming that the only source of knowledge is that which can come from 'evidence' (and by this you most likely only mean scientific). \n\n Gup claims that \"The Bible is the inspired, infallible Word of God - it is absolute truth.\"\n \n This statement may be an accurate reflection of reality. But the only way to KNOW this is through belief. (Perhaps the term 'knowledge' isn't even precise enough to make my point, as it can imply some degree of subjectivity.) Objective knowledge can be shared with others through evidence, rather than by subjective experience.\n \n I do not believe that the only source of knowledge is that which can come from scientific evidence. However, faith (or belief) and knowledge are distinct concepts. Objective knowledge is not acheived through faith.\n \n \nYou are making an assumption here that the Bible is the only source for knowledge of God. Leaving Adam aside, Jesus, who is God incarnate as man refers to the 'creation'. \n\n Actually, I am stating that even the Bible may not a source for knowledge of God. The idea of Jesus as divine is also a matter of belief.\n \n \nFurther the Apostles were given the gift of the Holy Spirit. \n\n To accept this line of reasoning for an assurance of truth requires belief in the existence of the Holy Spirit. It is possible that the Holy Spirit does not exist in any realm -- spiritual or otherwise. You believe that the Holy Spirit does exist, which is also possible. But you do not KNOW that the third person of the trinity exists.\n \n Are you beginning to see my point yet?", 
   {}, 
   53725, 
   null, 
   1087239120.0
  ], 
  [
   53958, 
   null, 
   "montalban", 
   "Barbarian observes:\n More precisely, YE creationism is based on the interpretation of the Bible by certain 7th Day Adventists around the turn of the century. \n \n Originally Posted by Ursus maritimus\n This is false. Until Darwin, most Christians were Old Earth Creationists, since that was what the geologic record showed. Christian geologists were looking for signs of Noah's Flood, realized that what they were seeing was evidence of several different glaciations which need far more time than a 6000 year earth can provide. Ironically, it was Charles Darwin who started Young Earth Creationism; most Christians were content to accept the findings of geology. But some Christians were so repelled by the idea that humanity may have evolved from apes that they reacted by insisting on a literal interpretation of Genesis.  \n \n \n \n Slightly more than half of all Christians are Roman Catholics. As you know, the Roman Catholic church teaches that there is no conflict between an old universe and God's Word. Most Christians are Roman Catholic. Since I know a fair number of Orthodox Christians who don't think the earth is young, could you show me with some evidence, which denominations within the Orthodox churches do teach that an old earth is not consistent with their faith?\n \n Quote:\n Originally Posted by Ursus maritimus\n Look up Lyell and Hutton. Well before Darwin there were long disputes, sometimes acrimonious, among geologists about the processes that produced the geologic features that were observed - uniformitarianism vs. catastrophism, whether most rocks were igneous or precipated, and so forth - and all of these arguments were based on the acceptance by each side that the earth was millions of years old. \n \n \n \n St. Augustine repeatedly tried to reconcile a literal Genesis, and finally gave up on it. And he's a doctor of the Church, perhaps the most respected theologian.\n \n Posted by Ursus maritimus\n [b]This is false. Lyell's book on geology was very popular well before Darwin even went on his around the world trip. \n\n \n \n \n In fact, most scientists, by Darwin's time, had accepted Lyell's geology. You do understand that Lyell wrote book on geology, not fiction? \n \n Barbarian obsrves:\n Keep in mind that only one particular, modern interpretation of the Bible is at odds with science.\n \n Most Christians don't see any conflict at all. \n \n \n \n Yep. Most Christians are Roman Catholics, who acknowledge there is not conflict. But they are far from the only denomination. Anglicans, most Lutherans, Methododists, etc. are also in agreement with Scripture and science.\n \n \n \n No, I'm pointing out that most Christians accept this, and I'm doing it in defense of Genesis. Genesis specifically rules out YE creationism, since it denys ex nihilo creation of life, which is a fundamental part of YE creationism.\n \n \n \n Sure they are. If you don't believe me, go look it up. Most of us are Roman Catholics, and a lot of other denominations agree with us on this point.\n \n \n \n Augustine plainly said it was absurd to think of literal mornings and evenings, with no sun to have them. Origen asserted that the days were figurative, not literal 24-hour periods.\n \n \n \n Both Origen and Augustine would agee with that. They would say that the YE people were not reading it as written, but instead tried to take it literally.\n \n \n \n Indeed. But the truth, as some have pointed out, is not necessarily what you'd like it to be.[/QUOTE]\n \n Oddly enough you say that most Christians are Roman Catholic, and that the church teaches... blah blah... then conversely, you know a few Orthodox people and they agree with blah blah. Then, demanding that I show you the evidence to back up your claim with regards most Christians.\n \n The fact that the Roman Catholic church offers no teaching on the matter does not equate that all Roman Catholics believe in evolution. Sorry, that's just a supposition.\n \n Further, that you know a few Orthodox does not equate to all Orthodox believe in evolution. That too is supposition.\n \n You claim to speak for all Christians here and you draw inferences that aren't necessarily logical\n \n Further to that, I've already stated a number of Orthodox Holy Fathers who believe in the account of Genesis.\n \n So, as you made the claim that 'most Christians believe...' please show me the figures.", 
   {}, 
   53875, 
   null, 
   1087290960.0
  ], 
  [
   53959, 
   null, 
   "montalban", 
   "Barbarian observes:\n More precisely, YE creationism is based on the interpretation of the Bible by certain 7th Day Adventists around the turn of the century. \n \n Slightly more than half of all Christians are Roman Catholics. As you know, the Roman Catholic church teaches that there is no conflict between an old universe and God's Word. Most Christians are Roman Catholic. Since I know a fair number of Orthodox Christians who don't think the earth is young, could you show me with some evidence, which denominations within the Orthodox churches do teach that an old earth is not consistent with their faith?\n \n St. Augustine repeatedly tried to reconcile a literal Genesis, and finally gave up on it. And he's a doctor of the Church, perhaps the most respected theologian.*\n \n [b]This is false. Lyell's book on geology was very popular well before Darwin even went on his around the world trip.\n \n In fact, most scientists, by Darwin's time, had accepted Lyell's geology. You do understand that Lyell wrote book on geology, not fiction? \n \n Keep in mind that only one particular, modern interpretation of the Bible is at odds with science.\n \n Most Christians don't see any conflict at all. \n \n Yep. Most Christians are Roman Catholics, who acknowledge there is not conflict. But they are far from the only denomination. Anglicans, most Lutherans, Methododists, etc. are also in agreement with Scripture and science.\n \n No, I'm pointing out that most Christians accept this, and I'm doing it in defense of Genesis. Genesis specifically rules out YE creationism, since it denys ex nihilo creation of life, which is a fundamental part of YE creationism.\n \n Sure they are. If you don't believe me, go look it up. Most of us are Roman Catholics, and a lot of other denominations agree with us on this point.\n \n Augustine plainly said it was absurd to think of literal mornings and evenings, with no sun to have them. Origen asserted that the days were figurative, not literal 24-hour periods.\n \n Both Origen and Augustine would agee with that. They would say that the YE people were not reading it as written, but instead tried to take it literally.\n \n Indeed. But the truth, as some have pointed out, is not necessarily what you'd like it to be.\n\n \n Oddly enough you say that most Christians are Roman Catholic, and that the church teaches... blah blah... then conversely, you know a few Orthodox people and they agree with blah blah. Then, demanding that I show you the evidence to back up your claim with regards most Christians.\n \n If it's a fact that the Roman Catholic church offers no teaching on the matter does not equate that all Roman Catholics believe in evolution; then that very fact would mean that the Roman Catholic Church says this leaves a choice. You just assume all of them have jumped one way. Sorry, that's just a supposition.\n \n Further, that you know a few Orthodox does not equate to all Orthodox believe in evolution. That too is supposition.\n \n You claim to speak for all Christians here and you draw inferences that aren't necessarily logical\n \n Further to that, I've already stated a number of Orthodox Holy Fathers who believe in the account of Genesis.\n \n So, as you made the claim that 'most Christians believe...' please show me the figures.\n \n Admittedly you make a vague and un-referenced supposition about the teachings of Augustine and Origen. Do you have any quotes? Apparently sourcing material is not necessary for you. I'm not sure when he wrote what you think he wrote, but I do know that Saint Augustine, one of the biggest influences in western Christianity retracted some of his earlier works.\n \n The only thing I can find at present are these...\n Blessed Augustine writes a guide to interpreting the Bible... for instance he says \"Where, however, the ambiguity cannot be cleared up, either by the rule of faith or by the context, there is nothing to hinder us to point the sentence according to any method we choose of those that suggest themselves.\"\n http://ccat.sas.upenn.edu/jod/augustine/ddc3.html\n That is, he's defending even bits that don't make sense to him.\n \n and\n \"Though creation has been widely discussed, the length of the six days of creation, as held throughout the ages of church history, was generally agreed: they were ordinary or sidereal days. There were few exceptions to this: Clement, Origin and Augustine being the main ones. Clement and Origin, of course, followed an allegorical method of interpretation and denied the historicity of much of the Bible. Augustine's statements, on the other hand, are unclear but it seems that he believed that God actually created the world all at once (i.e., in an instant of time, the six days being repetitions of the one day of creation) but related the story of a six-day creation to us to accommodate our limited understanding. To be sure, there is much in the Bible that is difficult (if not impossible) for our finite minds to grasp, but in this case one must wonder how a six-day account would be any easier to comprehend than an instantaneous creation. In any case, the non-literal views of the days of creation were uncommon and not highly regarded\"\n http://stjohnsrcus.inetnebr.com/page23.htm\n \n Here's some other Holy Fathers...\n \n \"No on should think that the Creation of Six Days is an allegory\" said St Ephraim the Syrian \n \n St. Basil the Great in his Hexatemeron says \"Therefore, let it be understood as it has been written.\" \n both taken from Seraphim Rose's \"Genesis, Creation and Early Man: The Orthodox Christian Vision\"\n \n Irenaeus (Bishop of Lyons c.177-200) says \"...in the first Adam we offended God by not performing his command; in the second Adam we have been reconciled, becoming 'obedient unto death'.\" Adversus Haereses v.xvi.3 \n \"Fellowship with God is light and life...separation from God is death.\" Ibid v.xxvii.2 \n Right down to our own day... \n \"A knowledge of the beginning and end of all things is essential for us to understand the purpose of our existence here on this earth, and what lies beyond it\" Fr.Seraphim Rose's commentary on St. Symeon The New Theologian's \"The First-Created Man.\" \n \n They are talking about an historical person, a real Adam.\n \n \"With regard to the \"political tension\" you encounter in the writing of Father Seraphim Rose and his statements about the hierarchy of the Russian Orthodox Church Outside Russia, I am unfamiliar with the book to which you refer. However, I would find it unbelievable to imagine that the hierarchy of ROCOR would have ever issued a statement which claims that Orthodox Christianity believes in Darwinian evolution\"\n http://www.oca.org/pages/orth_chri/...-orthodoxy.html\n \n So, you can see I'm not convinced with you opinion with regard to Christian teaching on this matter.\n \n \n \n *perhaps the most respected theologian\n \n Not for Orthodox", 
   {}, 
   53875, 
   null, 
   1087291980.0
  ], 
  [
   53960, 
   null, 
   "montalban", 
   "My point with this argument is simply that (assuming a literal interpretation) Adam was created after everything else -- with the exception of Eve. (Though, IIRC, Adam was placed in a deep sleep during the creation of Eve. Not important to my argument, really.) Therefore, he would have had no first-hand knowledge of the rest of creation. He would not have witnessed anything. And nowhere does scripture say that God told Adam explicitly how God created the earth. The differences of, and what came after Adam and Eve have no bearing on my argument.\n \n \n Read that again. I make no such assumption. I freely concede that Gup's beliefs may coincide 100% with the absolute truth. But neither Gup, nor anyone else existing in the physical realm KNOWS the absolute truth. So there is no way of validating whether Gup is 'right' or whether atheists may be 'right' regarding their belief of the absolute truth.\n \n Consider that your beliefs and Gup's beliefs are likely quite distinct. My impression of your posts is that you believe your perspective to be the 'right' one, because the Orthodox Church was founded by Jesus Christ and has had no breaks with the origins of Christ's teachings. My impressions of Gup's posts is that Gup believes that Gup has the 'true' understanding of what it means to be a Christian. Within this framework, at least one of you must be 'wrong.' There is no possible way within the physical realm to determine objectively who is 'right' and who is 'wrong.' These concepts of right and wrong within this framework are matters of belief.\n \n \n Gup claims that \"The Bible is the inspired, infallible Word of God - it is absolute truth.\"\n \n This statement may be an accurate reflection of reality. But the only way to KNOW this is through belief. (Perhaps the term 'knowledge' isn't even precise enough to make my point, as it can imply some degree of subjectivity.) Objective knowledge can be shared with others through evidence, rather than by subjective experience.\n \n I do not believe that the only source of knowledge is that which can come from scientific evidence. However, faith (or belief) and knowledge are distinct concepts. Objective knowledge is not acheived through faith.\n \n \n Actually, I am stating that even the Bible may not a source for knowledge of God. The idea of Jesus as divine is also a matter of belief.\n \n \n To accept this line of reasoning for an assurance of truth requires belief in the existence of the Holy Spirit. It is possible that the Holy Spirit does not exist in any realm -- spiritual or otherwise. You believe that the Holy Spirit does exist, which is also possible. But you do not KNOW that the third person of the trinity exists.\n \n Are you beginning to see my point yet?\n\n \n Not quite, but it does seem I have misunderstood you. My apologies", 
   {}, 
   53880, 
   null, 
   1087292100.0
  ], 
  [
   53970, 
   null, 
   "montalban", 
   "The Barbarian further to what we were discussing earlier, about your claim to speak on behalf of all Christians...\n \n Check out the article:\n \"Why an Orthodox Christian cannot be an evolutionist\"\n http://www.creatio.orthodoxy.ru/sbornik/sbufeev_whynot_english.html\n \n or...the one that says...\n \"Thirdly, some of the major hypotheses of science, such as the evolution of man from the apes, are no less empirically unverifiable statements of faith than the Chrlstian dogmas--with the important difference that, unlike the Christian dogmas, they have no basis in Divine Revelation.\"\n http://www.roca.org/OA/137/137g.htm\n \n As for Catholic faith\n \"While the Church permits belief in either special creation or developmental creation on certain questions, it in no circumstances permits belief in atheistic evolution.\"\n http://www.catholic.com/library/Adam_Eve_and_Evolution.asp\n (though they allow for evolution as guided by God)\n However, more telling from the same source...\n \"It is equally impermissible to dismiss the story of Adam and Eve and the fall (Gen. 2?3) as a fiction. The human race really did descend from an original pair of two human beings (a teaching known as monogenism) rather than a pool of early human couples (a teaching known as polygenism).\"\n \n Now, I will not draw a conclusion that all Catholics believe what the Catholic Church says on this matter; same for Orthodox.\n \n However, you and others here (Ursus!) have made claims about all or most Christians. I do believe that this sort of argument is an attempt to make people more pursuaded about the truths that you hold - on the basis of 'well aren't you foolish, 9/10 people agree with me'.\n \n But I look forward to your proofs of your statement.", 
   {}, 
   53960, 
   null, 
   1087306560.0
  ], 
  [
   53975, 
   null, 
   "The Barbarian", 
   "Oddly enough you say that most Christians are Roman Catholic, and that the church teaches...\n\n \n Yes. Slightly more than half of all Christians are Roman Catholics. And the Church teaches that evolution and an old Earth are completely consistent with Christian faith.\n \n \nthen conversely, you know a few Orthodox people and they agree with blah blah. Then, demanding that I show you the evidence to back up your claim with regards most Christians.\n\n \n It's a fact. And you may check the numbers if you doubt that Roman Catholics are a majority of the world's Christians.\n \n \nIf it's a fact that the Roman Catholic church offers no teaching on the matter does not equate that all Roman Catholics believe in evolution; then that very fact would mean that the Roman Catholic Church says this leaves a choice. You just assume all of them have jumped one way. Sorry, that's just a supposition.\n\n \n No, I'm pointing out that Roman Catholics say that there's no conflict between Christianity and evolution or an old Earth. I didn't say that they all believe that evolution is so, or that they all believe that the Earth is old. It is an option, just as it is for Orthodox Christians, many of whom accept that God uses evolution and long periods of time in His creation.\n \n \nFurther, that you know a few Orthodox does not equate to all Orthodox believe in evolution. That too is supposition.\n\n \n More accurately, it's a straw man. You are misrepresenting what I said.\n \n \nYou claim to speak for all Christians here\n\n \n That also is a misrepresentation. I never made that claim.\n \n \nFurther to that, I've already stated a number of Orthodox Holy Fathers who believe in the account of Genesis.\n\n \n All Christians believe in the account of Genesis. You just aren't willing to believe it as it is.\n \n \nSo, as you made the claim that 'most Christians believe...' please show me the figures.\n\n \n \nAdmittedly you make a vague and un-referenced supposition about the teachings of Augustine and Origen. Do you have any quotes? Apparently sourcing material is not necessary for you. I'm not sure when he wrote what you think he wrote, but I do know that Saint Augustine, one of the biggest influences in western Christianity retracted some of his earlier works.\n\n \n Indeed. He actually wrote a work \"On the literal nature of Genesis\". And later, he admitted there was no logical way to have a literal interpretation of Genesis.\n \n Here's one from St. Augustine that seems appropriate:\n \n \"Usually, even a non-Christian knows something about the earth, the heavens, and the other elements of this world, about the motion and orbit of the stars and even their size and relative positions, about the predictable eclipses of the sun and moon, the cycles of the years and seasons, about the kinds of animals, shrubs, stones, and so forth, and this knowledge he holds to as being certain from reason and experience. Now, it is a disgraceful and dangerous thing for an infidel to hear a Christian, presumably giving the meaning of Holy Scripture, talking nonsense on these topics; and we should take all means to prevent such an embarrassing situation, in which people show up vast ignorance in a Christian and laugh it to scorn. The shame is not so much that an ignorant individual is derided, but that people outside the household of the faith think our sacred writers held such opinions, and, to the great loss of those for whose salvation we toil, the writers of our Scripture are criticized and rejected as unlearned men.... Reckless and incompetent expounders of Holy Scripture bring untold trouble and sorrow on their wiser brethren when they are caught in one of their mischievous false opinions and are taken to task by these who are not bound by the authority of our sacred books. For then, to defend their utterly foolish and obviously untrue statements, they will try to call upon Holy Scripture for proof and even recite from memory many passages which they think support their position, although they understand neither what they say nor the things about which they make assertion.\"\n \n http://www.asa3.org/ASA/topics/Bible-Science/PSCF3-88Young.html\n \n \n (Barbarian observes that Augustine is perhaps the most respected of theologians)\n \n \nNot for Orthodox\n\n \n Not for Orthodox maybe, but he is for orthodox.\n \n \nThe Barbarian further to what we were discussing earlier, about your claim to speak on behalf of all Christians...\n\n \n As we discussed earlier, that \"claim\" was entirely your invention.\n \n \n Check out the article:\n \"Why an Orthodox Christian cannot be an evolutionist\"\n http://www.creatio.orthodoxy.ru/sbo...ot_english.html\n \n or...the one that says...\n \"Thirdly, some of the major hypotheses of science, such as the evolution of man from the apes, are no less empirically unverifiable statements of faith than the Chrlstian dogmas--with the important difference that, unlike the Christian dogmas, they have no basis in Divine Revelation.\"\n http://www.roca.org/OA/137/137g.htm\n \n As statement that ignores the evidence isn't really going to sway anyone. Science is based on evidence, and there is abundant evidence that apes and man have a common ancestor. Would you like to review it? \n \n \nAs for Catholic faith\n \"While the Church permits belief in either special creation or developmental creation on certain questions, it in no circumstances permits belief in atheistic evolution.\"\n http://www.catholic.com/library/Ada...d_Evolution.asp\n (though they allow for evolution as guided by God)\n\n \n Christians tend to believe in God. But, as you know, the Pope has specifially stated that evolution is consistent with Christian belief.\n \n \nHowever, more telling from the same source...\n \"It is equally impermissible to dismiss the story of Adam and Eve and the fall (Gen. 2?3) as a fiction. The human race really did descend from an original pair of two human beings (a teaching known as monogenism) rather than a pool of early human couples (a teaching known as polygenism).\"\n\n \n I, for example, happen to believe that Adam and Eve were real humans. That is not inconsistent with evolution or an old Earth.\n \n \nNow, I will not draw a conclusion that all Catholics believe what the Catholic Church says on this matter; same for Orthodox.\n\n \n Some might not. I know many Southern Baptists who know evolution is a fact, in spite of the widespread assumption that Baptists are unable to accept evolution.\n \n \nHowever, you and others here (Ursus!) have made claims about all or most Christians.\n\n \n It's a fact. Catholics accept the Pope's teaching as valid. And the Pope teaches that evolution is consistent with Christian faith. And Catholics are a slight majority.\n \n \nI do believe that this sort of argument is an attempt to make people more pursuaded about the truths that you hold - on the basis of 'well aren't you foolish, 9/10 people agree with me'.\n\n \n Nope. It just puts to rest the notion that evolution or an old Earth is inconsistent with Christianity. \n \n \nBut I look forward to your proofs of your statement.\n\n \n Look here:\n http://www.geocities.com/richleebruce/churchstat.html", 
   {}, 
   53970, 
   null, 
   1087310100.0
  ], 
  [
   53977, 
   null, 
   "Close_slave_can", 
   "@montalban\n Is science worthless?", 
   {}, 
   53975, 
   null, 
   1087312620.0
  ], 
  [
   54095, 
   null, 
   "montalban", 
   "@montalban\n Is science worthless?\n\n \n As you ask me to be subjective and give an opinion, I will.\n \n Science itself is amoral.* It doesn't get one closer to God of itself, so in that sense it has no ultimate worth, however, some people can use science to benefit mankind, and that is good, but it's not an ends.\n \n And sure, I like digital watches. Does one get me to understand God better? Probably not.\n \n For me God is the ultimate reality, and hopefully, my final destination. All else is secondary.\n \n \n *However, it never 'lives' by itself, it needs to be used by man to be useful, and then it is subject to man's foibles.", 
   {}, 
   53977, 
   null, 
   1087381800.0
  ], 
  [
   54097, 
   null, 
   "montalban", 
   "You are correct on a number of points. I said you claim to speak for all Christians. I should have said \"You attempt to speak for most Christians\" I am sorry for the confusion. Further, you aren't just talking about evolution, but the age of the earth, etc, that is, all of the creation story, which is fair, because that is what Genesis deals with too. But you change emphasis half-way through your argument, a shift I wasn't quick enough to follow.\n Post 47\n \nMore precisely, YE creationism is based on the interpretation of the Bible by certain 7th Day Adventists around the turn of the century.\n\n \n Here you are implying that only a small Christian group made it up. That is the impression you give me; that it's only a recent invention (see below where you attempt to extrapolate an older heritage for the old age theory; through Blessed Augustine). I deal with this at the end.\n \n You change focus away from the age of the earth, to evolution...and this is where I made my errors...in not noticing the switch.\n Post 24\n \nKeep in mind that only one particular, modern interpretation of the Bible is at odds with science.\n Most Christians don't see any conflict at all.\n\n \n I agree that the official Catholic position is that the actual on the evolution of man is not in conflict... for the most part. I am not well versed in all the competing evolutionary theories, I concede after reading: http://www.talkorigins.org/indexcc/CA/CA114.html that one can have a view to evolution consistent with God (though this poses some difficulties; see below)\n \n \nChristians tend to believe in God. But, as you know, the Pope has specifically stated that evolution is consistent with Christian belief.\n\n \n \nIt's a fact. Catholics accept the Pope's teaching as valid. And the Pope teaches that evolution is consistent with Christian faith. And Catholics are a slight majority.\n\n \n I concede again, that you have switched your focus from a young earth, to evolution, for which I've only just caught on. However your arguments in support of a young earth are less convincing...\n \n The problem lies with the Catholic position\n \"According to the chronological reading, the six days of creation should be understood to have followed each other in strict chronological order. This view is often coupled with the claim that the six days were standard 24-hour days.\"\n http://www.catholic.com/library/Adam_Eve_and_Evolution.asp It then argues about whether they are actually 24-hour days or not. But the problem is, the order of creation... The account in Genesis, differs in sequence from that given by science. See Genesis 1:11 Then God said, \"Let the land produce vegetation: seed-bearing plants and trees on the land that bear fruit with seed in it, according to their various kinds.\" And it was so. 12 The land produced vegetation: plants bearing seed according to their kinds and trees bearing fruit with seed in it according to their kinds. And God saw that it was good. 13 And there was evening, and there was morning-the third day. 14 And God said, \"Let there be lights in the expanse of the sky to separate the day from the night, and let them serve as signs to mark seasons and days and years...\"\n \n That is, life on earth began before the stars. Science says it's the other way around, regardless of how old the earth is.\n \n I went to your post http://www.geocities.com/richleebruce/churchstat.html and typed in the word 'evolution' and then 'Darwin' and these words don't appear on that page. Tell me how it backs your claim to speak on behalf of most Christians? Am I searching under the wrong terms? Or, was this just meant to be a statistical look; to determine most Christens are Catholic ergo, most Christians don't have a problem with evolution, or a young earth?\n \n Your argument about Augustine is the most unconvincing of all. I went to http://www.asa3.org/ASA/topics/Bibl...F3-88Young.html (sorry I mention these in reverse order to which you stated them). (before exploring this, I must say firstly, your quote doesn't even mention Genesis! SO I'm at a loss as to how it supports your notion about Augustine, especially in light of the quote I mention below...)\n \n Back to your web-site. It says \"Augustine says that the six-day creation structure has nothing to do with the passage of time during creation but is a logical framework\". This is true, because Augustine believed in creation all in one moment. Which is exactly what I posted at Post 50, so I take it you don't read what I write, just skim over it.\n \n \"Though creation has been widely discussed, the length of the six days of creation, as held throughout the ages of church history, was generally agreed: they were ordinary or sidereal days. There were few exceptions to this: Clement, Origin and Augustine being the main ones. Clement and Origin, of course, followed an allegorical method of interpretation and denied the historicity of much of the Bible. Augustine's statements, on the other hand, are unclear but it seems that he believed that God actually created the world all at once (i.e., in an instant of time, the six days being repetitions of the one day of creation) but related the story of a six-day creation to us to accommodate our limited understanding. To be sure, there is much in the Bible that is difficult (if not impossible) for our finite minds to grasp, but in this case one must wonder how a six-day account would be any easier to comprehend than an instantaneous creation. In any case, the non-literal views of the days of creation were uncommon and not highly regarded\"\n http://stjohnsrcus.inetnebr.com/page23.htm \n\n So, when people say \"St. Augustine didn't believe in Genesis\" it is correct, because he went to an even more extreme view, 'creation in one instant'. That is in no way the same as saying 'St.Augustine supports evolution or a model based on Godless-actions.'\n But I must also stress St.Augustine recanted much of what he wrote earlier. I don't know what era he was commenting on Genesis, but you might want to check that out if you attempt again to show him siding with you.\n \n If I can add here a quote that debunks the notion of only 'recent' beliefs by a minority argument....\n \"A couple hundred years ago, before the theory of evolution was developed and evidence for it presented, virtually all scientists were creationists, including scientists in relevant fields such as biology and geology. Today, virtually all relevant scientists accept evolution. Such a turnabout could only be caused by overwhelming evidence. The alternative -- that almost all scientists today are thoroughly incompetent -- is preposterous.\"\n http://www.talkorigins.org/indexcc/CA/CA114.html\n \n In conclusion: I agree with the statement \"Most Christians have no problem with evolution\" providing we are conceding that we're dealing with an evolution that may not be wholly by material causes (as Dawkins believes).\n Secondly the notion of the 'young earth' being only part of a) a minority and b) only recent, is less convincingly put.\n \n Addendum: More problems...\n \n If you believe that God acted through the processes of evolution then you need account for Adam, Original Guilt (that's Original Sin to most of you).\n \n Secondly, which process of evolution did God use?\n \n For instance when I studied this subject many years ago, we were taught four competing theories of evolution; four competing, AND mutually exclusive theories; viz.\n the Unilinear School;\n \n the Polyphyletic School'\n \n the Preneanderthal School; and\n \n the Presapiens School\n \n \n \n Now I know not all of these are held in high esteem in science, now, but therein lies the problem. Even if these of themselves aren't mutually exclusive, if I was a Deistic-evolutionist back in 1986 when I studied this, and made the claim \"Science says man evolved by model as suggested by the Presapiens School of thought\", well, now that said school is defunct, I'd have to say \"My theory of integration is incorrect. Now I know God worked by the \"X\" theory, or whatever.\n \n If you are interested in reading about current mutually exclusive theories try:\n \n \"Race And Human Evolution: A Fatal Attraction \" by Milford Wolpoff, University of Michigan and Rachel Caspari, University of Michigan \"Race and Human Evolution is a far-ranging account by leading researchers in the field that describes the latest scientific evidence and the conflicting theories about human evolution.\" \n \n http://www.perseusbooksgroup.com/pe...y/0-8133-3546-9\n \n \n \n \n \n \"Long ago (in the 4th century!) one of the Church's teachers Vasilius the Great wrote about this. He advised the Orthodox Christians neither to rely upon the scientific data in order to provide foundation for their faith in Christ, nor to try to disprove them, because \"the scientists permanently disprove themselves.\"\n \n http://www.pravoslavie.ru/english/age-of-earth.htm", 
   {}, 
   53975, 
   null, 
   1087384380.0
  ], 
  [
   54138, 
   null, 
   "The Barbarian", 
   "You are correct on a number of points. I said you claim to speak for all Christians. I should have said \"You attempt to speak for most Christians\"\n\n \n That is a misrepresentation also. I merely noted the positions of various Christian denominations.\n \n \nFurther, you aren't just talking about evolution, but the age of the earth, etc, that is, all of the creation story, which is fair, because that is what Genesis deals with too. But you change emphasis half-way through your argument, a shift I wasn't quick enough to follow.\n\n \n Evolution requires an ancient Earth. Hence, acceptance of evolutionary theory requires an acknowledgement of the age of the Earth.\n \n Barbarian observes:\n More precisely, YE creationism is based on the interpretation of the Bible by certain 7th Day Adventists around the turn of the century. \n \n \nHere you are implying that only a small Christian group made it up. That is the impression you give me; that it's only a recent invention (see below where you attempt to extrapolate an older heritage for the old age theory; through Blessed Augustine). I deal with this at the end.\n\n \n Yes. The vast majority of creationists were OE creationists, prior to the acceptance of Seventh-Day Adventist doctrine by some other Christians.\n \n Barbarian observes:\n Keep in mind that only one particular, modern interpretation of the Bible is at odds with science.\n \n Most Christians don't see any conflict at all. \n \n \nI agree that the official Catholic position is that the actual on the evolution of man is not in conflict... for the most part. I am not well versed in all the competing evolutionary theories, I concede after reading: http://www.talkorigins.org/indexcc/CA/CA114.html that one can have a view to evolution consistent with God (though this poses some difficulties; see below)\n\n \n Do you suppose the Pope didn't think it out very well?\n \n Barbarian observes:\n Christians tend to believe in God. But, as you know, the Pope has specifically stated that evolution is consistent with Christian belief. \n \n and...\n It's a fact. Catholics accept the Pope's teaching as valid. And the Pope teaches that evolution is consistent with Christian faith. And Catholics are a slight majority. \n \n \nI concede again, that you have switched your focus from a young earth, to evolution, for which I've only just caught on. However your arguments in support of a young earth are less convincing...\n\n \n I'm merely pointing out that evolution requires an ancient Earth, and that the Pope has said that it is consistent with Christian belief.\n \n \nThe problem lies with the Catholic position\n \"According to the chronological reading, the six days of creation should be understood to have followed each other in strict chronological order. This view is often coupled with the claim that the six days were standard 24-hour days.\"\n http://www.catholic.com/library/Ada...d_Evolution.asp\n\n \n Yes. the chronological reading is not Catholic doctrine, for the reasons you mention below. Such an interpretation is not consistent with evidence.\n \n \nIt then argues about whether they are actually 24-hour days or not. But the problem is, the order of creation... The account in Genesis, differs in sequence from that given by science. \n\n \n Yep. When reality and Scripture seem to conflict, it is because we have misunderstood one or the other. In this case, it's clear that the chronological interpretation is unsupportable.\n \n \nI went to your post http://www.geocities.com/richleebruce/churchstat.html and typed in the word 'evolution' and then 'Darwin' and these words don't appear on that page. Tell me how it backs your claim to speak on behalf of most Christians?\n\n \n See above. I merely observed that Roman Catholics comprise the majority of the Christian faith, and that they accept that an old Earth is consistent with Christian belief.\n \n \nBack to your web-site. It says \"Augustine says that the six-day creation structure has nothing to do with the passage of time during creation but is a logical framework\". This is true, because Augustine believed in creation all in one moment. Which is exactly what I posted at Post 50, so I take it you don't read what I write, just skim over it.\n\n \n You're unfamiliar with Augustine, perhaps. He thought that creation occurred in one moment, but that the universe developed from it. Hence, the days of creation were symbolic, representing different aspects of God's creation. It does not mean that the trees appeared at the same time as hydrogen.\n \n Augustine even concludes that \"beasts\" must have not been created de novo, but developed from simpler things.\n \n \nAlthough creation has been widely discussed, the length of the six days of creation, as held throughout the ages of church history, was generally agreed: they were ordinary or sidereal days. There were few exceptions to this: Clement, Origin and Augustine being the main ones. \n\n \n These are among the most influential and important doctors of the Church. Is there anyone of equal influence with Augustine who disagrees?\n \n \nSo, when people say \"St. Augustine didn't believe in Genesis\"\n\n \n I don't know anyone who thinks St. Augustine didn't believe in Genesis. He just didn't happen to support your idea of it.\n \n \nit is correct, because he went to an even more extreme view, 'creation in one instant'. That is in no way the same as saying 'St.Augustine supports evolution or a model based on Godless-actions.'\n\n \n Certainly, Augustine attributed the development of beasts from simpler things as God's creation. He just didn't think it was a unique action. It followed from God's initial creation of all things. Somewhere Augustine observes that it is remarkable that we think an exceptional miracle is so amazing, when the miracle of natural things is even more so.\n \n \nBut I must also stress St.Augustine recanted much of what he wrote earlier.\n\n \n Indeed. He attempted to make a literal Genesis work, and eventually concluded it could not be.\n \n \nI don't know what era he was commenting on Genesis, but you might want to check that out if you attempt again to show him siding with you.\n\n \n I have checked. He \"sides\" with no modern person, but he does acknowledge a creation consistent with reality.\n \n \n\"A couple hundred years ago, before the theory of evolution was developed and evidence for it presented, virtually all scientists were creationists, including scientists in relevant fields such as biology and geology. Today, virtually all relevant scientists accept evolution. Such a turnabout could only be caused by overwhelming evidence. The alternative -- that almost all scientists today are thoroughly incompetent -- is preposterous.\"\n http://www.talkorigins.org/indexcc/CA/CA114.html\n\n \n They were, almost to a man old Earth creationists. The evidence from geology had led them to conclude a young Earth was not possible.\n \n \nIn conclusion: I agree with the statement \"Most Christians have no problem with evolution\" providing we are conceding that we're dealing with an evolution that may not be wholly by material causes (as Dawkins believes).\n Secondly the notion of the 'young earth' being only part of a) a minority and b) only recent, is less convincingly put.\n\n \n As you learned, over half of all Christians accept that an old earth is consistent with our faith. \n \n \nIf you believe that God acted through the processes of evolution then you need account for Adam, Original Guilt (that's Original Sin to most of you).\n\n \n How do you see that as inconsistent? In fact, the acquisition of the knowledge of good and evil is surely a very good place to mark the evolution of humans with souls. The allegory of Genesis does not exclude Adam as a real person, nor does it exclude the idea of God giving Adam an immortal soul.\n \n \nSecondly, which process of evolution did God use?\n\n \n As far as I can see, He uses all of them.\n \n \nFor instance when I studied this subject many years ago, we were taught four competing theories of evolution; four competing, AND mutually exclusive theories; viz.\n the Unilinear School;\n \n the Polyphyletic School'\n \n the Preneanderthal School; and\n \n the Presapiens School\n\n \n I don't know when God chose to give humans an immortal soul. It's not a question that science can answer. It doesn't matter. If it had been Homo erectus, would He love us less for being less intelligent, and then love us more as we became more capable? I don't think so. If we had never evolved beyond H. erectus, He would have loved us no less. This is a humbling thought, but one that should always be kept in mind; we do not approach God in any capability, and although the knowledge of good and evil made us like Him, we are in his image only as a poor copy.\n \n \n Now I know not all of these are held in high esteem in science, now, but therein lies the problem. Even if these of themselves aren't mutually exclusive, if I was a Deistic-evolutionist back in 1986 when I studied this, and made the claim \"Science says man evolved by model as suggested by the Presapiens School of thought\", well, now that said school is defunct, I'd have to say \"My theory of integration is incorrect. Now I know God worked by the \"X\" theory, or whatever.\n \n If you are interested in reading about current mutually exclusive theories try:\n \n \"Race And Human Evolution: A Fatal Attraction \" by Milford Wolpoff, University of Michigan and Rachel Caspari, University of Michigan \"Race and Human Evolution is a far-ranging account by leading researchers in the field that describes the latest scientific evidence and the conflicting theories about human evolution.\" \n \n http://www.perseusbooksgroup.com/pe...y/0-8133-3546-9\n \n \n \n \n \n \"Long ago (in the 4th century!) one of the Church's teachers Vasilius the Great wrote about this. He advised the Orthodox Christians neither to rely upon the scientific data in order to provide foundation for their faith in Christ, nor to try to disprove them, because \"the scientists permanently disprove themselves.\"", 
   {}, 
   54097, 
   null, 
   1087411980.0
  ], 
  [
   54153, 
   null, 
   "unkerpaulie", 
   "Evolution requires an ancient Earth. Hence, acceptance of evolutionary theory requires an acknowledgement of the age of the Earth.\n\n im not trying to nit-pick, but you probably mean the theory of evolution. this is exactly why we need everybody to have access to definitions and distinctions of these terms. evolution (genetic variation among generations) would be valid whether the earth was 6000 years or 600,000,000 years old. \n \n \nBarbarian observes:\n More precisely, YE creationism is based on the interpretation of the Bible by certain 7th Day Adventists around the turn of the century. \n \n Yes. The vast majority of creationists were OE creationists, prior to the acceptance of Seventh-Day Adventist doctrine by some other Christians.\n \n\n i cant verify or argue. i have read genesis and my first interpretation from simply reading what it says is that God created all life-forms on earth in 6 24-hour earth days, and rested on the 7th. it does say that \"in the beginning God created the heaven and the earth, and the earth was null and void...\" which means that even if the planet existed since \"the beginning\" life didnt appear on the planet till God made it on the 3rd day (plant life). i think if a child read Gen 1 they would most likely come to the same conclusion. but anyway, thats how i see it (i dont know what that has to do with anything)\n \n \nBarbarian observes:\n Keep in mind that only one particular, modern interpretation of the Bible is at odds with science.\n \n Most Christians don't see any conflict at all. \n\n perhaps most christians dont look into the specific theories of science as it applies to doctrine as closely as others do. or, more likely, maybe most christians dont have a deep knowledge of science and are not aware of what they say they are agreeing with.\n \n \nYep. When reality and Scripture seem to conflict, it is because we have misunderstood one or the other. In this case, it's clear that the chronological interpretation is unsupportable.\n\n is it the interpretation of the message or the message itself? if a report conflicts with reality, it is usually because the report is untrue. sometimes it may be that the viewer has a wrong perspective of reality. but reality itself overrules any given report that conflicts with it, regardless of the source of the report\n \n \nYou're unfamiliar with Augustine, perhaps. He thought that creation occurred in one moment, but that the universe developed from it. Hence, the days of creation were symbolic, representing different aspects of God's creation. It does not mean that the trees appeared at the same time as hydrogen.\n \n Augustine even concludes that \"beasts\" must have not been created de novo, but developed from simpler things.\n \n These are among the most influential and important doctors of the Church. Is there anyone of equal influence with Augustine who disagrees?\n \n I don't know anyone who thinks St. Augustine didn't believe in Genesis. He just didn't happen to support your idea of it.\n \n Certainly, Augustine attributed the development of beasts from simpler things as God's creation. He just didn't think it was a unique action. It followed from God's initial creation of all things. Somewhere Augustine observes that it is remarkable that we think an exceptional miracle is so amazing, when the miracle of natural things is even more so.\n \n Indeed. He attempted to make a literal Genesis work, and eventually concluded it could not be.\n\n if this was Augustine's conclusion, then it is clearly unbiblical. \n \n \nHow do you see that as inconsistent? In fact, the acquisition of the knowledge of good and evil is surely a very good place to mark the evolution of humans with souls. The allegory of Genesis does not exclude Adam as a real person, nor does it exclude the idea of God giving Adam an immortal soul.\n \n I don't know when God chose to give humans an immortal soul. It's not a question that science can answer. It doesn't matter. If it had been Homo erectus, would He love us less for being less intelligent, and then love us more as we became more capable? I don't think so. If we had never evolved beyond H. erectus, He would have loved us no less. This is a humbling thought, but one that should always be kept in mind; we do not approach God in any capability, and although the knowledge of good and evil made us like Him, we are in his image only as a poor copy.\n\n i see this as a \"hybrid\" belief system that attempts to merge biblical doctrine with scientific theories.\n \n my position is that the \"biblical theory\" of the origin of life on earth and the \"scientific theory\" of the origin of life on earth are mutually exclusive, i.e., they cannot both be correct. if you believe one \"theory\" you automatically discredit the other. there can only be one true theory of the origin of life on earth", 
   {}, 
   54138, 
   null, 
   1087417440.0
  ], 
  [
   54159, 
   null, 
   "apathy", 
   "It's amazing that the creationists are still arguing after reading the quote from Augustine.\n \n Here is a theologian, probably the most highly regarded theologian ever, saying exactly what needs to be said in this whole debate.\n \n The fact that the creationists want to argue about whether he took it back or not is funny. emoticon_smile \n \n Why are creationists so intent on convincing others (fellow christians alike) that the theory of evolution can't be right? Must they be convinced? I don't think there are many people that agree with ToE that go around actively trying to convince the \"unbeliever.\" \n \n I think someone above said that science was IMMORAL?\n Please, I'd like to hear more about why it is immoral.\n (Working on sunday, now THAT'S immoral!!) emoticon_xchicken \n (this board has nice icons) emoticon_smile", 
   {
    "post_info": {
     "post_title": "Augustine"
    }
   }, 
   54138, 
   null, 
   1087418040.0
  ], 
  [
   54165, 
   null, 
   "Waxy", 
   "\n I think someone above said that science was IMMORAL?\n Please, I'd like to hear more about why it is immoral.\n (Working on sunday, now THAT'S immoral!!) emoticon_xchicken \n (this board has nice icons) emoticon_smile\n\n \n He referred to it as Amoral. Big difference.\n \n Waxy", 
   {}, 
   54159, 
   null, 
   1087419360.0
  ], 
  [
   54171, 
   null, 
   "unkerpaulie", 
   "It's amazing that the creationists are still arguing after reading the quote from Augustine.\n \n Here is a theologian, probably the most highly regarded theologian ever, saying exactly what needs to be said in this whole debate.\n \n The fact that the creationists want to argue about whether he took it back or not is funny. emoticon_smile \n\n it is neither here nor there whether he took it back. augustine may have been an authoratative religious figure to some. but to some people he was just a guy with an opinion and made statements that didnt not coincide with the bible\n \n \nWhy are creationists so intent on convincing others (fellow christians alike) that the theory of evolution can't be right? Must they be convinced? I don't think there are many people that agree with ToE that go around actively trying to convince the \"unbeliever.\" \n\n im not saying that the theory of evolution cant be right, or that creation cant be wrong. i see no grounds to accept either. however, its just as annoying when evolutionist continue to attempt to convince others that evolution cant be wrong. many evolutionists ive encountered are very dogmatic about their position to the point of insulting others for not agreeing with their views", 
   {}, 
   54159, 
   null, 
   1087420680.0
  ], 
  [
   54180, 
   null, 
   "thebootfitter", 
   "...however, its just as annoying when evolutionist continue to attempt to convince others that evolution cant be wrong. many evolutionists ive encountered are very dogmatic about their position to the point of insulting others for not agreeing with their views\n\n I find your experience with 'evolutionists' to be interesting. There is a very small possibility that there is a better explanation to how life came to be how it is today than the explanation provided by the theory of evolution. Anyone who truly understands what the theory of evolution is recognizes this. That is the nature of science.\n \n I suspect that what you perceive as an \"evolutionist continu[ing] to attempt to convince others that evolution cant [sic] be wrong\" is merely somebody pointing out that there is much objective evidence that coincides with the theory of evolution and no known objective evidence that contradicts the theory of evolution. This is fact. This fact may not be accepted by an individual (due to ignorance or a set of beliefs or any other reason), but it doesn't change the fact.\n \n In other words, in order to reject the theory of evolution, one must have evidence that contradicts the theory (which no one does), or ignore the objective evidence (which is distinct from the interpretations of that evidence). Ignoring something does not make it disappear.", 
   {}, 
   54171, 
   null, 
   1087422420.0
  ], 
  [
   54204, 
   null, 
   "The Barbarian", 
   "Barbarian observes:\n Evolution requires an ancient Earth. Hence, acceptance of evolutionary theory requires an acknowledgement of the age of the Earth. \n \n \nim not trying to nit-pick, but you probably mean the theory of evolution.\n\n \n Scientists refer to it as evolutionary theory. \n \n \nEvolution (genetic variation among generations) would be valid whether the earth was 6000 years or 600,000,000 years old. \n\n \n But common descent, which is also part of evolutionary theory, could not be true in such a case. So you cannot consistently accept evolutionary theory, and opt for a youhg Earth. They are contradictory.\n \n Barbarian observes:\n More precisely, YE creationism is based on the interpretation of the Bible by certain 7th Day Adventists around the turn of the century. \n \n Yes. The vast majority of creationists were OE creationists, prior to the acceptance of Seventh-Day Adventist doctrine by some other Christians.\n \n \ni cant verify or argue.\n\n \n Then let's talk about it when you have more information.\n \n Barbarian observes:\n Keep in mind that only one particular, modern interpretation of the Bible is at odds with science.\n \n Most Christians don't see any conflict at all. \n \n \nperhaps most christians dont look into the specific theories of science as it applies to doctrine as closely as others do. \n\n \n Many have. The Pope, for example, enlisted the aid of many scientists to understand. His conclusion, like that of most other Christians, is that it is not inconsistent with science.\n \n \nOr, more likely, maybe most christians dont have a deep knowledge of science and are not aware of what they say they are agreeing with.\n\n \n We sometimes call them \"creationists.\" :) \n \n Barbarian observes:\n Yep. When reality and Scripture seem to conflict, it is because we have misunderstood one or the other. In this case, it's clear that the chronological interpretation is unsupportable. \n \n \nis it the interpretation of the message or the message itself?\n\n \n It's the interpretation. The chronological interpretation is not generally accepted by Christians.\n \n \nif a report conflicts with reality, it is usually because the report is untrue.\n\n \n Or possibly, because we simply don't understand what it says.\n \n Barbarian suggests:\n You're unfamiliar with Augustine, perhaps. He thought that creation occurred in one moment, but that the universe developed from it. Hence, the days of creation were symbolic, representing different aspects of God's creation. It does not mean that the trees appeared at the same time as hydrogen.\n \n Augustine even concludes that \"beasts\" must have not been created de novo, but developed from simpler things.\n \n These are among the most influential and important doctors of the Church. Is there anyone of equal influence with Augustine who disagrees?\n \n I don't know anyone who thinks St. Augustine didn't believe in Genesis. He just didn't happen to support your idea of it.\n \n \nCertainly, Augustine attributed the development of beasts from simpler things as God's creation. He just didn't think it was a unique action. It followed from God's initial creation of all things.\n\n \n Nature is the way God does most everything in this world. Of course it follow's God's will. He made nature, after all. \n \n Barbarian obsreves:\n Somewhere Augustine observes that it is remarkable that we think an exceptional miracle is so amazing, when the miracle of natural things is even more so.\n \n Indeed. He attempted to make a literal Genesis work, and eventually concluded it could not be. \n \n \nif this was Augustine's conclusion, then it is clearly unbiblical.\n\n \n Most Christians would disagree with you, but it's not a salvation issue, so it isn't of any consequence to where you spend eternity.\n \n Barbarian asks:\n How do you see that as inconsistent? In fact, the acquisition of the knowledge of good and evil is surely a very good place to mark the evolution of humans with souls. The allegory of Genesis does not exclude Adam as a real person, nor does it exclude the idea of God giving Adam an immortal soul.\n \n I don't know when God chose to give humans an immortal soul. It's not a question that science can answer. It doesn't matter. If it had been Homo erectus, would He love us less for being less intelligent, and then love us more as we became more capable? I don't think so. If we had never evolved beyond H. erectus, He would have loved us no less. This is a humbling thought, but one that should always be kept in mind; we do not approach God in any capability, and although the knowledge of good and evil made us like Him, we are in his image only as a poor copy. \n \n \ni see this as a \"hybrid\" belief system that attempts to merge biblical doctrine with scientific theories.\n\n \n In the same sense that \"God created the Earth as a sphere\" might be called a \"hybrid\" belief system. It merely recognizes that God made things as they are.\n \n \nmy position is that the \"biblical theory\" of the origin of life on earth and the \"scientific theory\" of the origin of life on earth are mutually exclusive, i.e., they cannot both be correct.\n\n \n Most of us think otherwise, but you do no damage to your soul by believing it that way.", 
   {}, 
   54165, 
   null, 
   1087428120.0
  ], 
  [
   54242, 
   null, 
   "montalban", 
   "It's amazing that the creationists are still arguing after reading the quote from Augustine.\n \n Here is a theologian, probably the most highly regarded theologian ever, saying exactly what needs to be said in this whole debate.\n \n The fact that the creationists want to argue about whether he took it back or not is funny.\n\n \n The quote from Augustine given me was not about creation. When someone says \"Saint Augustine says ...\" and they show him saying nothing of the sort, then it's open to objection.\n \n You must operate under a different mode of argument to what I'm used to.\n \n Evolutionist says 'x'; no proof needed. No contest will be entered into.\n \n \nWhy are creationists so intent on convincing others (fellow christians alike) that the theory of evolution can't be right? Must they be convinced? I don't think there are many people that agree with ToE that go around actively trying to convince the \"unbeliever.\" \n \n\n \n Why are evolutionists so intent of convincing Christians that there's nothing wrong with evolution.\n \n Lack of insight from apathy.", 
   {}, 
   54159, 
   null, 
   1087468020.0
  ], 
  [
   54243, 
   null, 
   "montalban", 
   "\"Long ago (in the 4th century!) one of the Church's teachers Vasilius the Great wrote about this. He advised the Orthodox Christians neither to rely upon the scientific data in order to provide foundation for their faith in Christ, nor to try to disprove them, because \"the scientists permanently disprove themselves.\"\n http://www.pravoslavie.ru/english/age-of-earth.htm\n \n \nI find your experience with 'evolutionists' to be interesting. There is a very small possibility that there is a better explanation to how life came to be how it is today than the explanation provided by the theory of evolution. Anyone who truly understands what the theory of evolution is recognizes this. That is the nature of science.\n \n I suspect that what you perceive as an \"evolutionist continu[ing] to attempt to convince others that evolution cant [sic] be wrong\" is merely somebody pointing out that there is much objective evidence that coincides with the theory of evolution and no known objective evidence that contradicts the theory of evolution. This is fact. This fact may not be accepted by an individual (due to ignorance or a set of beliefs or any other reason), but it doesn't change the fact.\n \n In other words, in order to reject the theory of evolution, one must have evidence that contradicts the theory (which no one does), or ignore the objective evidence (which is distinct from the interpretations of that evidence). Ignoring something does not make it disappear.\n\n \n I have similar experiences with dealing with evolutionists. I note the lack of evidence they use to support claims.\n \n I note that rather then debate the text they will ask 'have I read the whole text', or if it's from a creationist, they will debate the merits of the creationist - that is, in both cases they attack the man, not the statement.\n \n As to 'objective evidence' to evoultion, which evolutionary theory are you referring to?\n \n What 'objective' evidence are you referring to (as opposed to evidence that is studied, and hence made subjective).\n \n When this 'objective evidence' points to two or more entirely different conclusions, why should people still just 'accept it' because it's all good if it points to evolution (as you know it)?\n \n When one party presents a truth; that God 'is'. That God 'is' creator of all, \n and the other side says 'no, we have evidences (although ultimately science can't prove anything - excpet paradoxes such as Godel's Theorem)*, but whatever we hold to be true at the moment is more 'true' than your never-changing truth, then this does seem odd to me\n And the other side says 'at best can't you agree that God worked through evolution'; but which evolutionary path? It seems silly to say \"God worked through \"x\" and then 10 yrs later say, \"No! God worked through \"y\". You are in fact trying to limit God's miracle to known constraints.\n \n \"We (Orthodox) believe that the created world itself is a 'mystery' originating in the sovereign will of God accomplished by the action (energia) of the Holy Trinity. We confess in the Nicene-Constantinopolitan creed (325/381) that the Father is the \"Creator of heaven and earth and of all things visible and invisible\", the Son \"He through whom all things were made\", and the Holy Spirit, the \"Creator of life\" (zoopion).\" http://www.goarch.org/en/ourfaith/a...article8050.asp\n \n *Which proves nothing can be certain in maths.", 
   {}, 
   54180, 
   null, 
   1087468620.0
  ], 
  [
   54267, 
   null, 
   "unkerpaulie", 
   "barabarian, there are 2 proposed explanations for the origin of life on earth. one is the creation theory, the other is the evolutionary theory. however, there is only one way that life originated on the earth. therefore there is no way that these 2 explanations can be simultaneously true. furthermore, if one explanation is proven to be true then it immediately and automatically nullifies the other. thats what mutually exclusive means\n \n \nAugustine even concludes that \"beasts\" must have not been created de novo, but developed from simpler things.\n\n \n24 And God said, Let the earth bring forth the living creature after his kind, cattle, and creeping thing, and beast of the earth after his kind: and it was so. 25 And God made the beast of the earth after his kind, and cattle after their kind, and every thing that creepeth upon the earth after his kind: and God saw that it was good. .......... 31 And God saw every thing that he had made, and, behold, it was very good. And the evening and the morning were the sixth day.\n\n \n observe the difference between what Augustine says about the creation of beasts and what the bible says about the creation of beasts. isnt it blatantly obvious that they are in no way saying the same thing? in particular, the bible says \"and beast of the earth after his kind\". Augustine concludes that the beasts developed from simpler things. there is a very clear distinction here\n \n im not saying that either augustine or the bible is right or wrong, but i sustain that augustine's conclusion is very inbiblical.\n \n \nBarbarian asks:\n How do you see that as inconsistent? In fact, the acquisition of the knowledge of good and evil is surely a very good place to mark the evolution of humans with souls. The allegory of Genesis does not exclude Adam as a real person, nor does it exclude the idea of God giving Adam an immortal soul.\n \n I don't know when God chose to give humans an immortal soul. It's not a question that science can answer. It doesn't matter. If it had been Homo erectus, would He love us less for being less intelligent, and then love us more as we became more capable? I don't think so. If we had never evolved beyond H. erectus, He would have loved us no less. This is a humbling thought, but one that should always be kept in mind; we do not approach God in any capability, and although the knowledge of good and evil made us like Him, we are in his image only as a poor copy. \n\n here is another questionable aspect of the hybrid belief system. how do we determine that a soul exists at all? and how do we deternime that other animals and life forms dont possess a soul?", 
   {}, 
   54243, 
   null, 
   1087491600.0
  ], 
  [
   54299, 
   null, 
   "The Barbarian", 
   "barabarian, there are 2 proposed explanations for the origin of life on earth.\n\n \n Actually, there are many, many creation myths, and several scientific theories on it.\n \n \none is the creation theory,\n\n \n Creation is a religious doctrine, not a theory. Not that it's wrong to be a religious doctrine, but we need to keep the differences in mind.\n \n \nthe other is the evolutionary theory.\n\n \n No, that's wrong, too. Evolutionary theory makes no attempt to explain the origin of life, and it makes no claims about it. It assumes life exists, and describes how it changes. One scientific theory on the origin of life is abiogenesis, but there are others.\n \n \nhowever, there is only one way that life originated on the earth. therefore there is no way that these 2 explanations can be simultaneously true.\n\n \n Since God tells us that He created living things by natural means, it does tend to favor abiogenesis, at least for Christians.\n \n \nfurthermore, if one explanation is proven to be true then it immediately and automatically nullifies the other. thats what mutually exclusive means\n\n \n As noted in Genesis, abiogenesis and creation are two words for the same thing.\n \n Barbarian observes:\n Augustine even concludes that \"beasts\" must have not been created de novo, but developed from simpler things. \n \n 24 And God said, Let the earth bring forth the living creature after his kind, cattle, and creeping thing, and beast of the earth after his kind: and it was so.\n \n \nobserve the difference between what Augustine says about the creation of beasts and what the bible says about the creation of beasts.\n\n \n Yes, He says that they were created by natural means from the Earth. He doesn't go into detail about the process, but Augustine's understanding is consistent with His word.\n \n \nisnt it blatantly obvious that they are in no way saying the same thing?\n\n \n Not from a Christian perspective.\n \n \nin particular, the bible says \"and beast of the earth after his kind\". Augustine concludes that the beasts developed from simpler things. there is a very clear distinction here\n\n \n Note that God refers \"kind\" not \"kinds.\" All living things are of one \"kind.\" We have more in common with a bacterium than things by which we differ.\n \n \nim not saying that either augustine or the bible is right or wrong, but i sustain that augustine's conclusion is very inbiblical.\n\n \n Not from a Christian perspective. It fits the Genesis account rather well.\n \n Barbarian asks:\n How do you see that as inconsistent? In fact, the acquisition of the knowledge of good and evil is surely a very good place to mark the evolution of humans with souls. The allegory of Genesis does not exclude Adam as a real person, nor does it exclude the idea of God giving Adam an immortal soul.\n \n I don't know when God chose to give humans an immortal soul. It's not a question that science can answer. It doesn't matter. If it had been Homo erectus, would He love us less for being less intelligent, and then love us more as we became more capable? I don't think so. If we had never evolved beyond H. erectus, He would have loved us no less. This is a humbling thought, but one that should always be kept in mind; we do not approach God in any capability, and although the knowledge of good and evil made us like Him, we are in his image only as a poor copy. \n \n \nhere is another questionable aspect of the hybrid belief system.\n\n \n We aren't talking about a \"hybrid belief system.\" How do we know a soul exists? God tells us. Science can't help with it. Do animals have souls? Not immortal souls, anyway.", 
   {}, 
   54267, 
   null, 
   1087501920.0
  ], 
  [
   54303, 
   null, 
   "apathy", 
   "He referred to it as Amoral. Big difference.\n \n Waxy\n\n \n Aha! Read it wrong.\n My mistake.", 
   {}, 
   54165, 
   null, 
   1087502640.0
  ], 
  [
   54315, 
   null, 
   "apathy", 
   "The quote from Augustine given me was not about creation. When someone says \"Saint Augustine says ...\" and they show him saying nothing of the sort, then it's open to objection.\n\n \n What Augustine said, in a nutshell is \"Hey christians, it wouldn't be too wise to take the Bible as it is literally. In fact, it is logically impossible to do so.\" \n He never used the word \"creation\" in his statement, but the statement certainly applies to the literal reading of Genesis, which is what YE creationists do. Why would they not want to heed the advice of one of their own?\n \n \n \n \nYou must operate under a different mode of argument to what I'm used to.\n \n Evolutionist says 'x'; no proof needed. No contest will be entered into.\n\n \n I don't know what you mean by no contest will be entered.\n \n But ToE, being a scientific theory and all, doesn't require \"proof\". There is no such thing anyway (except maybe in math). What it does require is support from authentic evidence and observation, and it should to be able to predict the outcome of experiments to be considered a good theory. (Like say, based on the theory of evolution, if I dig this deep, I should fossils of find these types of flora and fauna, and this happens all the time.)\n \n On this board, based on the short time I have browsed about on it, when an \"evolutionist\" says 'x', i usually see that followed by some sort of evidence (even if it is on a webpage, what do you want on the internet?)\n \n Usually I see \"creationists\" trying to make appeals to authority, or totally getting some scientific principle wrong to support their case. \n \n \n \n \nWhy are evolutionists so intent of convincing Christians that there's nothing wrong with evolution.\n \n Lack of insight from apathy.\n\n \n \n At least on from what I've seen on this board, a \"creationist\" will START a thread with a specific CHALLENGE to ToE. This is followed up by \"evolutionists\" having to explain why the challenge has no grounds, then do this with some sort of evidence, or at least some knowledge on the subject.\n \n I have yet to see a thread started by an \"evolutionist\" that challenges YE creationism.\n \n :)", 
   {}, 
   54242, 
   null, 
   1087504980.0
  ], 
  [
   54320, 
   null, 
   "apathy", 
   "o wait!\n \n sorry, sorry, sorry\n \n when i responded to ricardo montalban i was thinking of another Augustine quote, not the one posted earlier on this thread.\n \n based on THAT quote, again I have to ask, why you would not head the advice of augustine? \n \n He's telling you to stop embarrassing other christians by arguing with people on subject that you know jack squat about.\n \n Don't you want to stop embarrassing your fellow christians? You don't want everyone to think that ALL christians believe the way you do, do you?\n They might be a little chagrined.\n emoticon_xangel", 
   {}, 
   54315, 
   null, 
   1087505640.0
  ], 
  [
   54321, 
   null, 
   "OccamsRazor", 
   "\n I have yet to see a thread started by an \"evolutionist\" that challenges YE creationism.\n \n :)\n\n \n Whoops! I guess I slipped up! :p \n \n Egocentricity and Creationism", 
   {}, 
   54315, 
   null, 
   1087505640.0
  ], 
  [
   54328, 
   null, 
   "apathy", 
   "I think this was from Gup20:\n With the apparent triumph of Darwinism, naturalism gained control of every discipline within the university, not only in the West, but also in the former communist lands and every other nation on earth.\n \n Naturalism started, in the west at least, during the Renaissance, when scholars started digging up Greek and Roman writers (their works, not their remains). Darwin came along hundreds of years later, in the middle, so to speak, of the history of naturalist philosophy. \n \n Now, right after the Renaissance is when naturalism was seen as being opposed to The Church (since back then, to be Christian meant you were Catholic), the proprietors of said Church had no problems with toturing and murdering folks that wanted to investigate their world naturalistically. I think they loved them as they would love themselves, though.\n \n edit:\n They were tortured, not tutored! emoticon_xagree", 
   {}, 
   53802, 
   null, 
   1087507560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evolution - Alternative, not proof", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2531-evolution-alternative-not-proof.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 2531, 
  "discussion_files": [
   [
    "13199.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2531-evolution-alternative-not-proof-print.html"
   ], 
   [
    "13200.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2531-evolution-alternative-not-proof-5-print.html"
   ], 
   [
    "13201.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2531-evolution-alternative-not-proof-4-print.html"
   ], 
   [
    "13202.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2531-evolution-alternative-not-proof-3-print.html"
   ], 
   [
    "13203.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2531-evolution-alternative-not-proof-2-print.html"
   ]
  ], 
  "identifier": 2531
 }
]