[
 [
  [
   2644, 
   null, 
   "American", 
   "Is faith the basis of both creation and evolution or is there solid, unrefutable evidence for either?", 
   {
    "post_info": {
     "post_title": "Creation, Evolution, and Religion"
    }
   }, 
   null, 
   null, 
   1045796040.0
  ], 
  [
   2660, 
   null, 
   "gilligan8503", 
   "faith means hope and therefore no one 'hopes' for evolution. religious people hope because they truly want it to be fact. evolution is a theory and is excepted as an essential. its like \"the world is round\" discovery; it is only in its infancy.", 
   {}, 
   2644, 
   null, 
   1045802160.0
  ], 
  [
   2670, 
   null, 
   "Karl", 
   "from Webster's Main Entry: faith\n Pronunciation: 'fAth\n Function: noun\n Inflected Form(s): plural faiths /'fAths, sometimes 'fA[th]z/\n Etymology: Middle English feith, from Old French feid, foi, from Latin fides; akin to Latin fidere to trust -- more at BIDE\n Date: 13th century\n 1 a : allegiance to duty or a person : LOYALTY b (1) : fidelity to one's promises (2) : sincerity of intentions\n 2 a (1) : belief and trust in and loyalty to God (2) : belief in the traditional doctrines of a religion b (1) : firm belief in something for which there is no proof (2) : complete trust\n 3 : something that is believed especially with strong conviction; especially : a system of religious beliefs\n synonym see BELIEF\n \n Would your definition of faith to be?:\n \n b (1) : firm belief in something for which there is no proof\n \n If so, then neither can have a strict mathematical \"proof\".\n \n However, I have confidence that scientific methods lead me closer to the way that the universe works, and that God reveals himself in the majesty of creation. Much more confidence than blindly following those who bear false witness.", 
   {}, 
   2644, 
   null, 
   1045819800.0
  ], 
  [
   2676, 
   null, 
   "gilligan8503", 
   "i would liek to add, the reason i am agnostic is because of \"matter cannot be created or destroyed\". could this law be false? on the planet earth it is false. could it be true somehere in the universe?", 
   {}, 
   2644, 
   null, 
   1045838280.0
  ], 
  [
   2680, 
   null, 
   "Karl", 
   "Originally posted by gilligan8503 \n i would liek to add, the reason i am agnostic is because of \"matter cannot be created or destroyed\". could this law be false? on the planet earth it is false. could it be true somehere in the universe? \n \n \n I'm a bit confused by that statement, that \"law\" has been obsolete since Einstein came out with Relativity.", 
   {}, 
   2644, 
   null, 
   1045839780.0
  ], 
  [
   2702, 
   null, 
   "gilligan8503", 
   "theory of relativity", 
   {}, 
   2644, 
   null, 
   1045870560.0
  ], 
  [
   2704, 
   null, 
   "Karl", 
   "Originally posted by gilligan8503 \n theory of relativity \n \n \n Yes indeed, one of the most fully verified theories we have. . .", 
   {}, 
   2644, 
   null, 
   1045872720.0
  ], 
  [
   2715, 
   null, 
   "American", 
   "In responce to one of gilligan's posts I started this thread:\n \n http://www.youdebate.com/vBulletin/showthread.php?s=&threadid=260\n \n Karl~\n \n I could go with 2 b (1), (2), or the first part of 3 for the definition I would apply to this question.\n \n And applying any, as you have noted, shows that BOTH creation and evolution are religions. Would this be an accurate statement?", 
   {}, 
   2644, 
   null, 
   1045880400.0
  ], 
  [
   2719, 
   null, 
   "lurch", 
   "2 a (1) : belief and trust in and loyalty to God\n \n Since science doesn't have gods, this doesn't fit. So science isn't religion.\n \n (2) : belief in the traditional doctrines of a religion\n \n Science doesn't have doctrines. Science is a tool to learn about the world around us. Science progresses by challenging and questioning.\n \n b (1) : firm belief in something for which there is no proof\n \n Nope. One doesn't believe in science. One recognized and accepts the most parsimoneous explanation for the observed facts available.\n \n (2) : complete trust\n \n Certainly not. Darwin questioned the leading scientists of his day. Today, the process of peer review means that no one is trusted. That is why in publishing new science, the data and methods are explained in detail. That is why work is frequently repeated by other scientists. Science is always checked again.", 
   {}, 
   2644, 
   null, 
   1045882500.0
  ], 
  [
   2726, 
   null, 
   "American", 
   "Lurch~\n \n In order to apply your responces to the definitions, you would have to prove that evolution (the process by which all things existing were created) is scientific. The point of this thread is to show that both creation and evolution have to be accepted by faith, and thus both are religions.", 
   {}, 
   2644, 
   null, 
   1045885260.0
  ], 
  [
   2732, 
   null, 
   "lurch", 
   "In order to apply your responces to the definitions, you would have to prove that evolution (the process by which all things existing were created) is scientific.\n\n No, sweetie. Evolutionary theory is the unifying concept of the biological sciences. It has been science for well over 200 years. It has been found to be science by U.S. District Courts, U.S. Circuit Courts of Appeals, and by the Supreme Court of the United States in every decision that considered it for the last 40 years or more. Only scientific illiterates believe that somehow evolutionary theory is not scientific, not because they have a rational basis for denying that fact, but because they have a problem reconciling their religion, based on ancient mythology, with observations of reality.\n \n And I'll tell you one more time, sweetie. Evolution is not the process by which all things existing were created. Evolution is a biological science and applies only to living things. If you are going to discuss this stuff, then you need to at least have the integrity to invest enough effort to understand the terms. Creation is not evolution. Outside of biology the word means change and nothing more.\n \nThe point of this thread is to show that both creation and evolution have to be accepted by faith, and thus both are religions.\n\n I am aware of that. But you are wrong. I will assume it is because of your ignorance and not dishonesty. Nothing in science is accepted on faith. Your continued insistance that it is so only underlines your ignorance of the matter. You are an example of why our high school graduates rank 40th out of 42 nations in their knowledge of science and math (we did better than Somolia and Croatia as I recall)\n \n My responses didn't fit the definitions because the definitions were of religion and I was talking about science. Of course they didn't fit. Perhaps if you follow with your finger as you read.", 
   {}, 
   2644, 
   null, 
   1045893180.0
  ], 
  [
   2948, 
   null, 
   "Crim", 
   "Matter could be 'created' when particles and antiparticles pop into existance on the edge of a black hole so that one of them is sucked into the singularity but the other is not. Then they have no chance to annihilate.", 
   {}, 
   2644, 
   null, 
   1045993860.0
  ], 
  [
   3002, 
   null, 
   "Calligirl", 
   "Let's just say for arguement's sake that these definitions are true:\n \n faith: firm belief in something for which there is no proof\n \n proof: something that induces certainty or establishes validity\n \n If there is no complete proof for evolution, wouldn't scientists be taking a step of faith in believing that it is true before it is completely proven? \n \n The definition of believe...\n \n believe:to accept as true, genuine, or real.\n \n sounds very much like the definition of acccept...\n \n accept:to recognize as true\n \n so I would say that evolutionists to \"believe\" in an idea for which there is no complete \"proof\" and therefore must have \"faith\" in a scientific sort of \"religion\".", 
   {}, 
   2644, 
   null, 
   1046051100.0
  ], 
  [
   3013, 
   null, 
   "Crim", 
   "It's called reasonable doubt, Calli.\n You don't need a video of a person committing murder to convict them.\n \n Secondly, science works on theories and models. \n No one has been able to provide a suitable alternative theory to evolution. So obviously, scientists are going to accept the best model available.", 
   {}, 
   2644, 
   null, 
   1046054040.0
  ], 
  [
   3025, 
   null, 
   "Calligirl", 
   "It's called reasonable doubt, Calli. You don't need a video of a person committing murder to convict them.\n\n \n Aaahhh, yes...but you do need IRREFUTIBLE evidence, don't you?\n \n \nSecondly, science works on theories and models. No one has been able to provide a suitable alternative theory to evolution. So obviously, scientists are going to accept the best model available.\n\n \n Wouldn't you call creationism an \"alternative theory\"?", 
   {}, 
   2644, 
   null, 
   1046057580.0
  ], 
  [
   3028, 
   null, 
   "Crim", 
   "Aaahhh, yes...but you do need IRREFUTIBLE evidence, don't you?\n \n \n Evidence = genetic relatedness of organisms, fossils, observed examples of change.\n \n \nWouldn't you call creationism an \"alternative theory\"?\n \n \n It was a couple of hundred years ago until it was completely destroyed.", 
   {}, 
   2644, 
   null, 
   1046057760.0
  ], 
  [
   3040, 
   null, 
   "Calligirl", 
   "Evidence = genetic relatedness of organisms, fossils, observed examples of change.\n\n \n That's a nice definition, but is the evidence IRREFUTIBLE? I don't think so.\n \n \nIt was a couple of hundred years ago until it was completely destroyed.\n\n \n Or evolution blindly accepted because no one wants to admit that there is a God... (Consequences are such scary things.)", 
   {}, 
   2644, 
   null, 
   1046061240.0
  ], 
  [
   3042, 
   null, 
   "Crim", 
   "That's a nice definition, but is the evidence IRREFUTIBLE? I don't think so.\n \n \n It's not a definition. It was examples of evidence which support the model.\n \n \nOr evolution blindly accepted because no one wants to admit that there is a God... (Consequences are such scary things.)\n \n \n Are you completely unable to defend the scraps of Creationism?\n \n Evolution does not even deny the possibilities of god.\n \n And why create fairy tale consequences when they don't exist?", 
   {}, 
   2644, 
   null, 
   1046061720.0
  ], 
  [
   3046, 
   null, 
   "Calligirl", 
   "It's not a definition. It was examples of evidence which support the model.\n\n \n IRREFUTIBLE EVIDENCE? \n \n \nAre you completely unable to defend the scraps of Creationism? Evolution does not even deny the possibilities of god. And why create fairy tale consequences when they don't exist?\n\n \n How am I not defending the \"scraps of Creationism\"? I have only heard of a few instances where Christians believed in God using evolution. It contradicts the Bible, so that doesn't work. Where are you going when you die? Are you just going to rot in the grave like your buddy gilligan? Or are you going to hell? How do you know for sure where you're going? The Bible tells us where we (believers) are going.", 
   {}, 
   2644, 
   null, 
   1046063040.0
  ], 
  [
   3052, 
   null, 
   "Crim", 
   "IRREFUTIBLE EVIDENCE? \n \n \n Have you refuted the evidence presented?\n \n \nHow am I not defending the \"scraps of Creationism\"? \n \n \n You offer no positive evidence towards Creationism nor did you deny that the idea of Creationism as scientific was destroyed long ago.\n \n \nI have only heard of a few instances where Christians believed in God using evolution. \n \n \n That's odd, since most churches, including the largest one (Catholicism) allow their followers to accept evolution.\n \n \nIt contradicts the Bible, so that doesn't work.\n \n \n Reality contradicts the Bible.\n As does the Bible. \n \n \nAre you just going to rot in the grave like your buddy gilligan? \n \n \n No, I plan on being cremated.\n \n \nOr are you going to hell?\n \n \n Nope.", 
   {}, 
   2644, 
   null, 
   1046063340.0
  ], 
  [
   3057, 
   null, 
   "Tim", 
   "Creationism is religion. Evolution is science. Maybe God has guided and directed evolution. Darwin thought that evolution did not contradict creationism. He thought that God could have created a few original animals and those animals could have evolved into other animals.", 
   {}, 
   2644, 
   null, 
   1046064060.0
  ], 
  [
   3059, 
   null, 
   "Calligirl", 
   "Have you refuted the evidence presented?\n\n \n What evidence?\n \n \nYou offer no positive evidence towards Creationism nor did you deny that the idea of Creationism as scientific was destroyed long ago.\n\n \n How about the flood? It was not \"destroyed long ago\". People simply have begun to believe in evolution because they either: 1.) Don't want to believe that the entire Bible is true. 2.) They don't want to believe the Bible at all.\n \n \nThat's odd, since most churches, including the largest one (Catholicism) allow their followers to accept evolution.\n\n \n Catholics are not Christian. They are Catholic.\n \n \nReality contradicts the Bible. As does the Bible.\n\n \n Maybe you should read some of the old posts between \"Sarah\" and I. We've already covered this topic. (Several times.)\n \n \nNo, I plan on being cremated.\n\n \n Same thing. You'll decompose either way.\n \n \nNope.\n\n \n How do you know that?", 
   {}, 
   2644, 
   null, 
   1046064360.0
  ], 
  [
   3065, 
   null, 
   "Crim", 
   "What evidence?\n \n \n The fossil, genetic, and observed evidences that scientists base the theory of evolution on.\n \n \nHow about the flood? It was not \"destroyed long ago\". \n \n \n Yes it was. The Noachian flood did not occur. Ignoring the obvious impossibilities of the ship/animals/etc, we see that the results a global flood would have caused do not exist.\n \n \nPeople simply have begun to believe in evolution because they either: 1.) Don't want to believe that the entire Bible is true. 2.) They don't want to believe the Bible at all.\n \n \n People have been indifferent toward the Bible long before evolution was discovered. Biology wasn't made to try to refute Biblical claims.\n \n \nHow do you know that?\n \n \n Hell is a mythical location.", 
   {}, 
   2644, 
   null, 
   1046065080.0
  ], 
  [
   3161, 
   null, 
   "Calligirl", 
   "The fossil, genetic, and observed evidences that scientists base the theory of evolution on.\n\n \n Oh, so you're telling me that all of that \"evidence\" is 100% true and beyond a reason of a doubt?\n \n \nYes it was. The Noachian flood did not occur. Ignoring the obvious impossibilities of the ship/animals/etc, we see that the results a global flood would have caused do not exist.\n\n \n I see results. I see lakes in the middle of continents with no rivers leading to them. How did they get there? \n \n \nBiology wasn't made to try to refute Biblical claims.\n\n \n BIOLOGY wasn't made to try to refute Biblical claims, evolution was.\n \n \nHell is a mythical location.\n\n \n How do YOU know that? Can you PROVE it?", 
   {}, 
   2644, 
   null, 
   1046147220.0
  ], 
  [
   3173, 
   null, 
   "Broker", 
   "Some sort of global flood did occur, didn't it? I seem to recall the Discovery Channel presenting lots of evidence that it did.", 
   {}, 
   2644, 
   null, 
   1046148600.0
  ], 
  [
   3188, 
   null, 
   "thistownwilleat", 
   "The evidence they found was not global. They found evidence of cities beneath the Black Sea. The documentary said that the Black Sea was originally about half its size, swelled in a massive flood, and then shrunk to the size it is today. There has never been any historicl evidence of a global flood.", 
   {}, 
   2644, 
   null, 
   1046153160.0
  ], 
  [
   3202, 
   null, 
   "Crim", 
   "Oh, so you're telling me that all of that \"evidence\" is 100% true and beyond a reason of a doubt?\n\n \n Huh?\n Yes, evidence is 100% evidence.\n \n \n \nI see results. I see lakes in the middle of continents with no rivers leading to them. How did they get there? \n \n \n That is not a prediction made by the global flood hypothesis. It can also be explained by climate changes. Rivers dry up.\n \n \nBIOLOGY wasn't made to try to refute Biblical claims, evolution was.\n \n \n Biology IS evolution.\n \n \nHow do YOU know that? Can you PROVE it?\n \n \n Sure. Myth: An unproven or unverifiable person/place/thing which is believed to be true.", 
   {}, 
   2644, 
   null, 
   1046159520.0
  ], 
  [
   3226, 
   null, 
   "Crim", 
   "Catholics are not Christian. They are Catholic.\n \n \n Catholicism is a denomination within Christianity.", 
   {}, 
   2644, 
   null, 
   1046206440.0
  ], 
  [
   3236, 
   null, 
   "thistownwilleat", 
   "Who said that? That's ludicrous.", 
   {}, 
   2644, 
   null, 
   1046209740.0
  ], 
  [
   3237, 
   null, 
   "Crim", 
   "The Catholic thing? \n Calligirl about 5 posts up.", 
   {}, 
   2644, 
   null, 
   1046210040.0
  ], 
  [
   3256, 
   null, 
   "Truth Seeker", 
   "\"Nothing in science is accepted on faith.\" ---Lurch\n \n How do evolutionists say the world began?", 
   {}, 
   2644, 
   null, 
   1046225460.0
  ], 
  [
   3258, 
   null, 
   "thistownwilleat", 
   "Calligirl...Catholics are most defintely Christian.", 
   {}, 
   2644, 
   null, 
   1046225700.0
  ], 
  [
   3263, 
   null, 
   "Crim", 
   "How do evolutionists say the world began?\n \n \n Depends on who it is.", 
   {}, 
   2644, 
   null, 
   1046226960.0
  ], 
  [
   3271, 
   null, 
   "Calligirl", 
   "Crim:\n \n \nHuh? Yes, evidence is 100% evidence.\n\n \n Let me refrase myself. Do you have complete and error free evidence that evolution took place? (Links between apes and man are obviously missing.)\n \n \nThat is not a prediction made by the global flood hypothesis. It can also be explained by climate changes. Rivers dry up.\n\n \n I don't see any large lakes being formed today. (Without the help of rivers, streams, etc.)\n \n \nBiology IS evolution.\n\n \n Oh really...\n \n biology: a branch of knowledge that deals with living organisms and vital processes\n \n I don't see the synonym \"evolution\" anywhere in that definition. Some biologists may study evolution, but biology is NOT evolution.\n \n \nCatholicism is a denomination within Christianity.\n\n \n Okay, what I meant to say is that you can't use the Catholic church as an example showing that the majority of Christians believe in evolution. ('Cause the Catholics don't believe a lot of things in the Bible.) \n \n \nSure. Myth: An unproven or unverifiable person/place/thing which is believed to be true.\n\n \n There is a hell. I just hope that you don't have to find out the hard way. \n \n Thistown:\n \n \nWho said that? That's ludicrous.\n\n \n Sorry 'bout that. I was really tired and not thinking strait...see my post to Crim.\n \n \nCalligirl...Catholics are most defintely Christian.\n\n \n See above...", 
   {}, 
   2644, 
   null, 
   1046228400.0
  ], 
  [
   3275, 
   null, 
   "Crim", 
   "Let me refrase myself. Do you have complete and error free evidence that evolution took place?\n \n \n We know for certain that organisms change over time. No serious scientist ignores the fact of evolution.\n \n \nOh really...\n \n \n Biology is centered around the theory of evolution. Without it, biology is hardly biology.\n \n \nOkay, what I meant to say is that you can't use the Catholic church as an example showing that the majority of Christians believe in evolution. ('Cause the Catholics don't believe a lot of things in the Bible.) \n \n \n Of course I can. Catholics are the largest group of Christians and they are allowed to accept evolution. Here are some other denominations which have supported evolution in past court cases: United Methodist, Episcopal, Presby, and Southern Baptist. Also, most Jewish groups.\n \n \nThere is a hell. I just hope that you don't have to find out the hard way. \n \n \n Evidence please.", 
   {}, 
   2644, 
   null, 
   1046229360.0
  ], 
  [
   3279, 
   null, 
   "thistownwilleat", 
   "\"I just hope that you don't have to find out the hard way.\"\n \n Don't say stupid stuff like that please.", 
   {}, 
   2644, 
   null, 
   1046231160.0
  ], 
  [
   3285, 
   null, 
   "Calligirl", 
   "We know for certain that organisms change over time. No serious scientist ignores the fact of evolution.\n\n \n Let's make this more simple for you. Show me one verifiable link between ape and man.\n \n \nBiology is centered around the theory of evolution. Without it, biology is hardly biology.\n\n \n So biology didn't exist before the theory of evolution was formulated?\n \n \nOf course I can. Catholics are the largest group of Christians and they are allowed to accept evolution. Here are some other denominations which have supported evolution in past court cases: United Methodist, Episcopal, Presby, and Southern Baptist. Also, most Jewish groups.\n\n \n Fallacy of division. (Look it up.)\n \n \nEvidence please.\n\n \n The Bible.\n \n Thistown:\n \n \nDon't say stupid stuff like that please.\n\n \n The truth hurts.", 
   {}, 
   2644, 
   null, 
   1046232180.0
  ], 
  [
   3300, 
   null, 
   "thistownwilleat", 
   "I challenge you to show me one solitary place in the Bible where Jesus threatens someone with hell. Use your head, all it does is alienate people. \"Scaring\" people into believing in God is wrong.", 
   {}, 
   2644, 
   null, 
   1046239080.0
  ], 
  [
   3306, 
   null, 
   "Calligirl", 
   "I challenge you to show me one solitary place in the Bible where Jesus threatens someone with hell. Use your head, all it does is alienate people. \"Scaring\" people into believing in God is wrong.\n\n \n Matthew 5:29-30 \"If your right eye causes you to sin, gouge it out and throw it away. It is better for you to lose one part of your body than for your whole body to be thrown into hell. And if your right hand causes you to sin, cut it off and throw it away. It is better for you to lose one part of your body than for your whole body to go into hell.\"\n \n Luke 12:4-6 \"\"I tell you, my friends, do not be afraid of those who kill the body and after that can do no more. But I will show you whom you should fear: Fear him who, after the killing of the body, has power to throw you into hell. Yes, I tell you, fear him.\"\n \n From the mouth of Christ himself. Amazing.", 
   {}, 
   2644, 
   null, 
   1046239860.0
  ], 
  [
   3313, 
   null, 
   "Crim", 
   "Let's make this more simple for you. Show me one verifiable link between ape and man.\n \n \n Since humans are classified as great apes already, can you specify what you mean by ape?\n \n \nSo biology didn't exist before the theory of evolution was formulated?\n \n \n Not as we know it now.\n \n \nFallacy of division. (Look it up.)\n \n \n lol, my comments weren't even close to the fallacy of division\n You quiestioned evolution being compatible with Christianity. I showed that most Christian denominations do not dismiss it. It was a completely valid point.\n \n \nThe Bible.\n \n \n The Bible is not evidence.", 
   {}, 
   2644, 
   null, 
   1046240880.0
  ], 
  [
   3353, 
   null, 
   "Taiyles", 
   "How do evolutionists say the world began? \n \n \n They dont. Evolution is not, as creationism claims to be, the \"Grand Theory of Life,the Universe, and Everything\" (we all know the answer to that is 42!). Evolution is a biological theory, and deals with biological processes. Namely, the change in allele frequency over time. \n \n If you are interested in the beginings of the earth, speak to a geologist. If you're interested in the beginings of the universe, seek out a physisist, a cosmologist or an astronomer. These fields overlap, but each has its own particular sphere of expertise. Evolutionary biologists have as good an understanding of these concepts as is required for their work, but these are not, by any means, their primary fields of study.", 
   {}, 
   2644, 
   null, 
   1046285700.0
  ], 
  [
   3378, 
   null, 
   "Truth Seeker", 
   "Aren't there cosmologists and astronomers and geologists who are evolutionists?", 
   {}, 
   2644, 
   null, 
   1046312760.0
  ], 
  [
   3379, 
   null, 
   "lurch", 
   "quote:\n --------------------------------------------------------------------------------\n How do evolutionists say the world began? \n --------------------------------------------------------------------------------\n \n They dont. Evolution is not, as creationism claims to be, the \"Grand Theory of Life,the Universe, and Everything\" (we all know the answer to that is 42!). Evolution is a biological theory, and deals with biological processes. Namely, the change in allele frequency over time.\n\n \n Nice try, Taiyles. But if you believe that you will make progress in convincing a creationist that he doesn't have the right to define the words that biologists use, they you are a dreamer. There are several threads here in which I have been trying to explain what science is and how it works. Still they object to evolution because it is only a theory.\n \n Just as gravity is a theory of physics, evolution is a theory of biology. We agree on the definition. I learned it many years ago on the first day of my class in evolutionary biology. By that time I understood the meanings of the specialized words. Sometimes I think that part of the problem is that creationists don't understand what the words mean - just as they miss the meaning of the word theory when used in science. I learned it like this back when Kennedy was President:\n \n Evolution is a change in the frequency of alleles in a population over time.\n \n If that is not what one means by evolution, then there needs to be a modifying word or the context must clearly indicate otherwise.\n \n For those who don't understand the words, I'll define them.\n \n frequency means ratio. allele means one of two or more variants of a gene. population means a group of interbreeding organisms. over time means from generation to generation.", 
   {}, 
   2644, 
   null, 
   1046312940.0
  ], 
  [
   3382, 
   null, 
   "Crim", 
   "Aren't there cosmologists and astronomers and geologists who are evolutionists?\n \n \n What the hell is an evolutionist anyhow?", 
   {}, 
   2644, 
   null, 
   1046314260.0
  ], 
  [
   3413, 
   null, 
   "Taiyles", 
   "I agree with Lurch, Seeker. The term \"evolutionist\" must first be defined, as the answer to your question depends very much on that. Now, if by evolutionist you mean:\n \n (a) Theory of Evolution- it doesnt say anything about the begining of the world. It only talks about the change in frequency of alleles over time.\n \n (b) Evolutionary Biologists- That depends on the biologists and on how familiar they are with the scientific literature on the subject. That in turn would probably depend on how much they need this knowledge for their line of research.\n \n (d) Anyone who \"believes\"* in evolution- In this category I am including scientists, non-scientists who have studied evolution, examinded the evidence and have a pretty good grasp of its concepts, and people who just \"believe\" because that's what they were taught. Since this group includes everyone from scientists to my 4 year old nephew who loves dinosaurs, it's impossible to make generalizations about their opinions. There are probably as many points of view as there are people. My niece, for example, belives that she is dreaming the world, and when she wakes up, she will be born (that girl has some straaange ideas! We think she'll grow out of it... maybe) \n \n \n * Just a note: I've always thought that \"believing\" in evolution was a lot like \"believing\" in tables. If you prefer to take the tables existance on faith, rather that checking the data that verifies it, you may as well eat off of your metaphorical knees. And if you've already done your research and scoured the literature, well, you know the table's there and you can use it to do things with. But you don't feel the need to go around \"beleiving\" in it, saying things like \"Oh Great Table, without which we are nought\".", 
   {}, 
   2644, 
   null, 
   1046368140.0
  ], 
  [
   3470, 
   null, 
   "Truth Seeker", 
   "I basically want to know how those of you who don't believe in Creationism, explain how the earth got here?", 
   {}, 
   2644, 
   null, 
   1046399280.0
  ], 
  [
   3495, 
   null, 
   "lurch", 
   "Do a web search on nebular hypothesis.\n \n The Origin of the Solar System \n \n The Solar Nebular Hypothesis \n \n The following is a Power Point presentation from a course (ast201) at the University of Regina (Canada). After it loads, use page down or left click to go to the next slide.\n \n Forming the Planets", 
   {}, 
   2644, 
   null, 
   1046410080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Creation, Evolution, and Religion", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/255-creation-evolution-religion.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 255, 
  "discussion_files": [
   [
    "15760.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/255-creation-evolution-religion-print.html"
   ], 
   [
    "15761.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/255-creation-evolution-religion-4-print.html"
   ], 
   [
    "15762.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/255-creation-evolution-religion-3-print.html"
   ], 
   [
    "15763.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/255-creation-evolution-religion-2-print.html"
   ]
  ], 
  "identifier": 255
 }
]