[
 [
  [
   53914, 
   null, 
   "Siegfriedson", 
   "Ten years after Apartheid (1994-2004): The Raw Facts\n \n \n Here are the things you will never see in the major news media regarding post-apartheid South Africa:\n \n \n # In 10 years 1+ million South Africans, mostly blacks, lost their jobs due to the ANC's creeping socialism.\n \n # Unemployment is at a staggering 45%+ - much worse than under white rule & worse than the 30% unemployment in the USA during the Great Depression.\n \n # 1 million whites stand to lose their jobs in the coming years to Affirmative Action programs.\n \n # 1,450+ White commercial farmers have been murdered by black thugs and our food production is being threatened by \"Land Reform\".\n \n # They say that by 2014, 30% of commercial farmland now owned by Whites will be owned by Blacks (though I think it will happen much sooner & on a much bigger scale).\n \n # 115,000 land claims by Blacks have been processed so far - and millions of hectares of land have been handed over to them.\n \n # There are farms in South Africa, which were prosperous when run by Whites, that were handed over to Blacks. These farms then collapsed after 2 years of black management and are now derelict.\n \n # South Africa is the rape capital of the world... it is conservatively estimated that we have 50,000 rapes per year.\n \n # 21,500 children were raped in 2000.\n \n # 40% of rape survivors are under 18.\n \n # 1,231 children under 5 were raped in 13 months by blacks believing in AIDS myths. Many babies who are raped die.\n \n # South Africa is now an international drug-smuggling route, comparable to Colombia.\n \n # We export cannabis grown overwhelmingly by Blacks.\n \n # 150-200 policemen are shot dead annually by violent criminals.\n \n # Our police have the highest suicide rate in the world.\n \n # Our society is 7 times more violent (per capita) than the USA\n \n # Crime is so high the government put a moratorium on the release of crime statistics for a year and fudged them ever since.\n \n # The Democratic Alliance (conservatively) estimates there are 300,000 robberies per year\n \n # South African prisons are often filled to capacity (170,000+) and then thousands are let go, sometimes without being charged.\n \n # In January 2004, it was reported that some of the prisons are 300% over capacity.\n \n # In March 2004, it was reported that the prison population was 180,000.\n \n # Mandela's \"Birthday Present\" to the country (yes they used those words), was to release 9,000 criminals.\n \n # Murderers have been \"forgiven\" by our Presidents, only to murder again.\n \n # On 3rd March 2004, on SABC TV3 News it was announced that to \"Celebrate Ten Years of Democracy\" they might let thousands of prisoners go free.\n \n # More prisons have been built after apartheid but even that is not enough to cope with the crime wave.\n \n # More blacks are in our prisons after apartheid than before. (They no longer fear the Police).\n \n # The ANC LOVES criminals. They gave them the vote! It was announced that over 100,000 prisoners would be registered & allowed to vote\n \n # We had 10 years of peace, with no international sanctions and yet, the much-awaited boom never came along.\n \n # Our socialist economy dribbles along. GDP growth is estimated at 1.3% per annum which compares weakly with (sometimes) double digit growth rates under white rule.\n \n # In the Johannesburg (Gauteng) area, 80% of self-help schemes for Blacks have failed since 1994.\n \n # Let there be no illusions where the ANC wants to take us. They support & give money to: Zimbabwe, Haiti & DRC (Zaire) who are ruled by socialist dictators who suppress even the Blacks!\n \n # In the April 2004 election the ANC finally attained its goal of getting 66% vote. This means they can change the constitution at will and no other political party can stop them.\n \n # This is what Robert Mugabe of Zimbabwe was able to do before he took 95% of the land from 4,500 white farmers.\n \n # Now that we are officially, and legally the latest One Party State in Africa, we will walk the path of others like Zimbabwe where eventually nobody, not even the Blacks, have any freedom any more...\n \n # South Africa's economy, employment & crime rates were better when the world hated us.\n \n Source:\n \n http://www.africancrisis.org/Ph_TenYears.asp", 
   {
    "post_info": {
     "post_title": "10 Years After Aparteid, South Africa in a Crisis"
    }
   }, 
   null, 
   null, 
   1087254420.0
  ], 
  [
   53916, 
   null, 
   "Siegfriedson", 
   "[Crime is absolutely out of control in South Africa and even worse than has been reported. The statistics are mind-boggling. The South African murder rate is ten times that of the US. And what's worse, not only do most crimes go unreported, but most of what does get reported is never solved.]\n \n South Africa's Murder Rate Far Worse than Reported\n \n \"Victims' surveys have consistently uncovered between 60% and \n 70% more crime than reported by official sources. Upwards of \n 50% of crime in many serious categories goes unreported.\" \n \n http://www.rense.com/general39/reose.htm\n \n \n [White separatist community experiences rapid growth as Blacks continue their destruction of South Africa.]\n \n White separatism on the rise in South Africa\n \n \"An Afrikaner enclave on the edge of a desert is being flooded \n with applications from whites disillusioned with South Africa's \n black government. Now, due to fear that South Africa will follow \n Zimbabwe into political and racial turmoil, Orania is beginning \n to fill up.\"\n \n http://www.suntimes.co.za/2002/12/01/insight/in20.asp\n \n \n [Ah, \"racial diversity\"...ain't it great???\n \n 2001: The USA had 16,110 murders - South Africa had 21,108\n \n 2001: Population of USA: 282 million - South Africa: only 44 million]\n \n SA twice as deadly as the US\n \n Cape Town - Government's claim that South Africa was not a crime capital and compared favourably with the rest of the world is refuted by US crime figures, says official opposition chief whip Douglas Gibson.\n \n In a statement on Monday, Gibson said in 2002 it was reported by The Economist that the US had 16,110 murders but in South Africa in 2001 - the most recent available figures - there were 21,108 murders.\n \n With figures released as a result of DA action taken in terms of access to information legislation, it was found in 2000 that the previous year there had been 21,995 reported cases of murder, of which 10,696 had been referred to court. A total of 4,007 convictions were reported in that year.\n \n Gibson noted that the US population was more than six times that of South Africa.\n \n http://www.news24.com/News24/0,,2_1410111,00.html", 
   {}, 
   53914, 
   null, 
   1087254900.0
  ], 
  [
   53917, 
   null, 
   "Siegfriedson", 
   "An Apology to Blacks from a white South African\n \n We apologize for giving you doctors and free medical care, as a result of which you have been able to survive plagues and catastrophes and grow in numbers;\n \n We apologize for teaching you to read and write, and for building you thousands of schools which we have repaired after you vandalized them and burned them down, After all, if you could not read how could you have learned the words of Karl Marx, Mao Tse-tung, and others who taught you how evil we are and how oppressed you are?\n \n We apologize for building factories and highways and buildings that gave you employment;\n \n We apologize for developing farms that to this day feed the bulk of Africa;\n \n We apologize for providing you with warm clothing made of fabric instead of leaving you wearing the animal skins that you wore before our arrival;\n \n We apologize for taking minerals from the earth, which you neither used, nor wanted, nor even knew were there;\n \n We apologize for those among us who have established welfare organizations and have devoted their entire life towards making life richer and better for your people;\n \n We apologize that we have built roads and railroad tracks between towns and cities which you now use every day without thinking;\n \n We apologize for paying the lion's share of taxation while spending less on ourselves than on you;\n \n We apologize for giving you law and order and a strong central government that prevented your own warrior nations like the Zulu and the Matabele from slaughtering black people by the hundreds of thousands as they did year in and year out before we came;\n \n We apologize for teaching you the English language which has opened to you the entire world of European thought, culture, and commerce;\n \n For all these sins we humbly beg forgiveness, and if you will only accept our apology we will be happy to take back all of the above evil and horrible things we have done to you and return to our European homeland.\n \n \n A Warning for Americans: A Message from a South African\n \n People used to say that South Africa was 20 years behind the rest of the Western world. Television, for example, came late to South Africa (but so did pornography and the gay rights movement).\n \n Today, however, South Africa may be the grim model of the future Western world, for events in America reveals trends chillingly similar to those that destroyed our country.\n \n America's structures are of \"Western Culture\". Your Congress, your lobbying groups, your free speech, and the way ordinary Americans either get involved or ignore politics are peculiarly your \"Western Culture\", not the way most of the world operates. But the fact that only about a third of Americans deem it important to vote is horrifying in light of how close you are to losing your Western character.\n \n Writing letters to the press, manning stands at county fairs, hosting fund-raising dinners, attending rallies, setting up conferences, writing your Congressman -- that is what you know, and what you are comfortable with. Those are the political methods you've created for yourselves to keep your country on track and to ensure political accountability,with freedom and justice for all.\n \n But woe to you if -- or more likely, when -- the rules change. Americans may soon find themselves unable or unwilling to stand up to challenge the new political methods that will be the inevitable result of the ethnic metamorphosis now taking place in America. Unable to cope with the new rules of the game -- violence, mob riots, intimidation through accusations of racism, demands for proportionality based on racial numbers, and all the other social and political weapons used by the have-nots to bludgeon treasure and power from the haves -- Americans, like others before them, will no doubt cave in. They will compromise away their independence and ultimately their way of life.\n \n That is exactly what happened in South Africa. I know, because I was there and I saw it happen.\n \n Continued:\n \n http://www.eaglesup.com/warning.html", 
   {}, 
   53916, 
   null, 
   1087255200.0
  ], 
  [
   54584, 
   null, 
   "Tastyfish", 
   "So what exactly do you think should be done if you had your way? Return to apartheid?\n You seem to be forgetting that tolerance of others and striving for eqaulity are two of the central tenents to western culture. The articels you quote seem to imply that the only way to preserve 'western culture' is sacrificing those two. So by western culture you really mean white supremecy?", 
   {}, 
   53917, 
   null, 
   1087655760.0
  ], 
  [
   54858, 
   null, 
   "jerichoholic104", 
   "But I hear that racial oppression of the majority by the minority is down.\n \n \n The system changed, how can you expect it to be stable for a long time?", 
   {}, 
   54584, 
   null, 
   1087852320.0
  ], 
  [
   54865, 
   null, 
   "unkerpaulie", 
   "weigh the freedom from racial oppression against grossly inflated crime and a drastic drop in national productivity. the only thing that can be done is hope that mandella and his cadre seize the controls and lead the country properly, but thats hard to do with a population that doesnt appreciate a system of civilization\n \n south africa is like a case of cultural displacement, in a way similar to africans being migrated into an american/european system. in this case the system was brought into south africa, but the effect is the same more or less.\n \n yet in certain other 3rd world countries, particularly in the caribbean, the effects of displacement is a lot less severe, and the countries tend to do rather well. haiti, however, is an exception, where there is very little american culture and yet they have been in years of industrial and political turmoil. yet, its very likely that haiti can greatly improve if its leadership is reformed, because haitians are generally hard-workers, although they would rather scam their way into a profit\n \n the only thing i can think of to help the situation in south africa is look at other examples in history where countries that went through a similar conflict came through and worked out their politics and culture... i love this subject and i'll definitely look it up", 
   {}, 
   54858, 
   null, 
   1087855140.0
  ], 
  [
   55333, 
   null, 
   "JPSartre12", 
   "But I hear that racial oppression of the majority by the minority is down.\n The system changed, how can you expect it to be stable for a long time?\n\n \n South Africa is a perfect example of what happens when International Liberals ban together to push their idea of social justice. You wind up with chaos \"run\" by a bunch of thugs. A perfect example of cutting one's nose off to spite one's face. I wonder how smug those Liberals are now, knowing what they've succeeded in accomplishing.\n emoticon_rolleyes", 
   {}, 
   54858, 
   null, 
   1088047080.0
  ], 
  [
   55402, 
   null, 
   "Waxy", 
   "South Africa is a perfect example of what happens when International Liberals ban together to push their idea of social justice. You wind up with chaos \"run\" by a bunch of thugs. A perfect example of cutting one's nose off to spite one's face. I wonder how smug those Liberals are now, knowing what they've succeeded in accomplishing.\n emoticon_rolleyes\n\n \n I don't want to get into a whole XXXXXXX match here JP, but it seems to me like that's a pretty simplistic and slanted view of the situation in South Africa.\n \n I don't see many \"liberals\" waving banners supporting the chaos that has ensued. The simple fact is, the situation got out of control and got violent, it wasn't anyone's desire to see that happen, nor was it necessarily an inevitable but overlooked outcome. The thugs have been allowed to operate above the law, that isn't supported by lib or con.\n \n Waxy", 
   {}, 
   55333, 
   null, 
   1088099820.0
  ], 
  [
   55404, 
   null, 
   "JPSartre12", 
   "I don't want to get into a whole XXXXXXX match here JP, but it seems to me like that's a pretty simplistic and slanted view of the situation in South Africa.\n \n I don't see many \"liberals\" waving banners supporting the chaos that has ensued. The simple fact is, the situation got out of control and got violent, it wasn't anyone's desire to see that happen, nor was it necessarily an inevitable but overlooked outcome. The thugs have been allowed to operate above the law, that isn't supported by lib or con.\n \n Waxy\n\n \n I agree that they aren't waving the Liberal Banner NOW. They created the chaos then walked away from it. If you had been in the US during Apartheid, you'd have seen the Liberals railing continuously about the need for American companies to divest in SA. When companies felt the liberal wrath to their corporate bottom lines (through boycotts of SA-made products, for example), they divested and left the country in shambles. Is that a surprising result to Liberals? It was exactly what they wanted, but now they turn a deaf ear to SA. Liberals are the biggest hypocrites in the world. They railed against a white-ruled, civil SA but stand mute to a corrupt-run bankrupt, crime-ridden black ruled SA. I say: \"be careful what you wish for; you just might get it.\"", 
   {}, 
   55402, 
   null, 
   1088102760.0
  ], 
  [
   55414, 
   null, 
   "Waxy", 
   "I agree that they aren't waving the Liberal Banner NOW. They created the chaos then walked away from it. If you had been in the US during Apartheid, you'd have seen the Liberals railing continuously about the need for American companies to divest in SA. When companies felt the liberal wrath to their corporate bottom lines (through boycotts of SA-made products, for example), they divested and left the country in shambles. Is that a surprising result to Liberals? It was exactly what they wanted, but now they turn a deaf ear to SA. Liberals are the biggest hypocrites in the world. They railed against a white-ruled, civil SA but stand mute to a corrupt-run bankrupt, crime-ridden black ruled SA. I say: \"be careful what you wish for; you just might get it.\"\n\n \n I guess I have a different level of exposure.\n \n There have been plenty of stories in the news and in print (even National Geographic, a very \"liberal\" publication) about the situation in SA. No one is denying that the situation got out of control due to violent black uprising. That wasn't the preferred or predicted outcome on anyone's part, but it is now the reality. The amount of civil and human rights violations occuring there is staggering. \n \n There are people dealing with this and attempting to produce positive change, and more than likely you'd refer to them as \"liberals\". Unfortunately, the conventional, peaceful means that were so effective previously are useless given the current situation. \n \n Not to mention the fact that it's pretty hard to get the world to focus on the plight of SA when we're at war in Iraq and terror.\n \n I'm currently trying to find a job for a friend of a family friend who's son is trying to emigrate to Canada from SA for obvious reasons. He's a mechanical engineer, but in order to be accepted, he needs proof of immediate employment.\n \n I also have a cousin in law that emigrated from SA about 10 years ago. His parents still live in SA. They are all coming to spend a week with us at the end of July, I can't wait to get a better handle on the situation with some first hand experience. \n \n I'll look forward to revisiting this conversation then.\n \n Waxy", 
   {}, 
   55404, 
   null, 
   1088104740.0
  ], 
  [
   55470, 
   null, 
   "JPSartre12", 
   "I guess I have a different level of exposure.\n \n There have been plenty of stories in the news and in print (even National Geographic, a very \"liberal\" publication) about the situation in SA. No one is denying that the situation got out of control due to violent black uprising. That wasn't the preferred or predicted outcome on anyone's part, but it is now the reality. The amount of civil and human rights violations occuring there is staggering. \n \n There are people dealing with this and attempting to produce positive change, and more than likely you'd refer to them as \"liberals\". Unfortunately, the conventional, peaceful means that were so effective previously are useless given the current situation. \n \n Not to mention the fact that it's pretty hard to get the world to focus on the plight of SA when we're at war in Iraq and terror.\n \n I'm currently trying to find a job for a friend of a family friend who's son is trying to emigrate to Canada from SA for obvious reasons. He's a mechanical engineer, but in order to be accepted, he needs proof of immediate employment.\n \n I also have a cousin in law that emigrated from SA about 10 years ago. His parents still live in SA. They are all coming to spend a week with us at the end of July, I can't wait to get a better handle on the situation with some first hand experience. \n \n I'll look forward to revisiting this conversation then.\n \n Waxy\n\n \n I hope that you will share their thoughts with us. I have had only limited contact with an Afrikaner associate that I trained some years back. His stories were \"interesting\" to say the least.", 
   {}, 
   55414, 
   null, 
   1088122380.0
  ], 
  [
   55716, 
   null, 
   "Eddie", 
   "weigh the freedom from racial oppression against grossly inflated crime and a drastic drop in national productivity. \n\n \n \n I am quite certain that the south arfican economic growth has been better since the apartheid system was abolished...", 
   {}, 
   54865, 
   null, 
   1088338680.0
  ], 
  [
   55734, 
   null, 
   "JPSartre12", 
   "I am quite certain that the south arfican economic growth has been better since the apartheid system was abolished...\n\n \n 23% Unemployment isn't anything to crow about. If it wasn't for gold and precious stones, the country would be in even worse shape. Add to that a murder rate that is 9-10X higher than the US's and you have a recipe for disaster.", 
   {}, 
   55716, 
   null, 
   1088365860.0
  ], 
  [
   55735, 
   null, 
   "Tastyfish", 
   "Indeed, but his point was that in the past decade things have been better than now despite aparteid being abolished. Blaming all the problems on 'dumb black liberals' is oversimplifing drastically.", 
   {}, 
   55734, 
   null, 
   1088366220.0
  ], 
  [
   55739, 
   null, 
   "lord tammerlain", 
   "When you take a group of people with no experience running anything more then a small village. Then have that group run an entire country problems are going to arise. The overall effects are not much different then the democratization of Russia and the fall of communism. Russia went through huge problems. With the fact that the people who ran Russia before was still their to help in the transformation and Russia still had the problems they did should show that when an inexperienced group take over the problems are going to be even worse.\n \n A Chinese system of transformation would have been preferable for stablity in South Africa. A slow but steady transformation that would have kept all government institutions in place as apartied was dismantled would have allowed for the blacks to gain experience in positions of power.", 
   {}, 
   55735, 
   null, 
   1088367780.0
  ], 
  [
   55744, 
   null, 
   "Eddie", 
   "23% Unemployment isn't anything to crow about. If it wasn't for gold and precious stones, the country would be in even worse shape. Add to that a murder rate that is 9-10X higher than the US's and you have a recipe for disaster.\n\n \n And still the economic growth has been higher since apartheid was abolished. I`m not saying everything has been peachy in South Africa since the fall of apartheid, but claiming that the economy has plummeted when it hasn`t is wrong. \n \n It is also interesting to note that the South African democratic system is quite different from the one in the US. In South Africa, the oppositional parties have much more power than in the US so responsibility do not squarly lie on ANC, but all political parties in South African (yes, that includes the \"white-power\" party as well...)", 
   {}, 
   55734, 
   null, 
   1088374740.0
  ], 
  [
   55747, 
   null, 
   "JPSartre12", 
   "And still the economic growth has been higher since apartheid was abolished. I`m not saying everything has been peachy in South Africa since the fall of apartheid, but claiming that the economy has plummeted when it hasn`t is wrong. \n \n It is also interesting to note that the South African democratic system is quite different from the one in the US. In South Africa, the oppositional parties have much more power than in the US so responsibility do not squarly lie on ANC, but all political parties in South African (yes, that includes the \"white-power\" party as well...)\n\n \n The GNP is increasing at a rate of 1.9%, that's 147th out of 214. AIDS/HIV is 20.1% amongst adults...and I was off on the unemployment rate, it's 37%.\n It can hardly be considered \"peachy\".\n http://www.cia.gov/cia/publications/factbook/geos/sf.html", 
   {}, 
   55744, 
   null, 
   1088375640.0
  ], 
  [
   55751, 
   null, 
   "Tastyfish", 
   "There is absolutely no way the HIV/AIDS rates would be better under aparteid, the vast majority of cases would have been ignored and left untreated. He also said it wasn't 'peachy' but that it wasn't what Seigfriedson was saying either.", 
   {}, 
   55747, 
   null, 
   1088376360.0
  ], 
  [
   55753, 
   null, 
   "JPSartre12", 
   "Indeed, but his point was that in the past decade things have been better than now despite aparteid being abolished. Blaming all the problems on 'dumb black liberals' is oversimplifing drastically.\n\n I wasn't blaming SA's problems on \"dumb black liberals\", I was blaming it on dumb WHITE Liberals from the US and Europe who thought that divesting in SA was somehow going to help blacks.", 
   {}, 
   55735, 
   null, 
   1088376900.0
  ], 
  [
   55809, 
   null, 
   "Eddie", 
   "The GNP is increasing at a rate of 1.9%, that's 147th out of 214. \n\n \n But still higher than the economic growth (or rather decline) experienced 1980-1990 (under apartheid) which was an appaling growth of - 16% in total... You can`t escape the fact that economic growth in South Africa has been quite good, and far better than during the late apartheid years...\n \n \n AIDS/HIV is 20.1% amongst adults...and I was off on the unemployment rate, it's 37%.\n \n\n \n AIDS and unemployment are currently the two largest problems that SA is facing at the moment. What was your point?\n \n \n \nIt can hardly be considered \"peachy\".\n \n\n \n Who said it was \"peachy\"?\n \n \n\n http://www.cia.gov/cia/publications/factbook/geos/sf.html\n\n \n Funny you mentioned it. \n \n CIA economic overview:\n \n \"South Africa is a middle-income, emerging market with an abundant supply of natural resources; well-developed financial, legal, communications, energy, and transport sectors; a stock exchange that ranks among the 10 largest in the world; and a modern infrastructure supporting an efficient distribution of goods to major urban centers throughout the region. However, growth has not been strong enough to lower South Africa's high unemployment rate; and daunting economic problems remain from the apartheid era, especially poverty and lack of economic empowerment among the disadvantaged groups. High crime and HIV/AIDS infection rates also deter investment. South African economic policy is fiscally conservative, but pragmatic, focusing on targeting inflation and liberalizing trade as means to increase job growth and household income.\" \n \n Which kind of proves my point quite nicely...", 
   {}, 
   55747, 
   null, 
   1088429340.0
  ], 
  [
   55851, 
   null, 
   "JPSartre12", 
   "But still higher than the economic growth (or rather decline) experienced 1980-1990 (under apartheid) which was an appaling growth of - 16% in total... You can`t escape the fact that economic growth in South Africa has been quite good, and far better than during the late apartheid years...\n\n \n You picked a time period during world-wide divestiture, which proves my point. Divesture had a serious NEGATIVE impact on SA's economy. emoticon_xgood \n \n\n AIDS and unemployment are currently the two largest problems that SA is facing at the moment. What was your point?\n\n My point was that SA's situation wasn't \"peachy\".\n \n\n Who said it was \"peachy\"?\n\n Eddie wrote:\n \"And still the economic growth has been higher since apartheid was abolished. I`m not saying everything has been peachy in South Africa since the fall of apartheid, but claiming that the economy has plummeted when it hasn`t is wrong. \"\n \n I was only using your terminology to agree that it WASN'T \"peachy\".\n \n\n Funny you mentioned it. \n \n CIA economic overview:\n \n \"South Africa is a middle-income, emerging market with an abundant supply of natural resources; well-developed financial, legal, communications, energy, and transport sectors; a stock exchange that ranks among the 10 largest in the world; and a modern infrastructure supporting an efficient distribution of goods to major urban centers throughout the region. However, growth has not been strong enough to lower South Africa's high unemployment rate; and daunting economic problems remain from the apartheid era, especially poverty and lack of economic empowerment among the disadvantaged groups. High crime and HIV/AIDS infection rates also deter investment. South African economic policy is fiscally conservative, but pragmatic, focusing on targeting inflation and liberalizing trade as means to increase job growth and household income.\" \n \n Which kind of proves my point quite nicely...\n\n That's one point of view, here's another:\n \"At the present day, an estimated 42% or 8-million employable non-white South Africans are unemployed. The unemployment among this segment of the population is higher today than at any time during the apartheid era. During the mid-1970's, the United Nations revealed that despite apartheid and despite South Africa's disparity in wage rates, black people in South Africa earned a higher per capita annual income than black people living elsewhere in sub-Sahara Africa. During the 1980's and early 1990's, the anti-apartheid movement promoted the concept of \"revolution before education,\" encouraging thousands of non-white students to abandon their formal schooling. \"\n \n http://www.mises.org/fullstory.asp?control=1501", 
   {}, 
   55809, 
   null, 
   1088444340.0
  ], 
  [
   55867, 
   null, 
   "Eddie", 
   "You picked a time period during world-wide divestiture, which proves my point. Divesture had a serious NEGATIVE impact on SA's economy. emoticon_xgood \n \n\n \n In what way did that prove your point? And the economic decline of the SA economy was far greater than the world average the world average appears to have been a positive economic growth, rather than the economic decline experienced by the SA. The SA economic decline was even far greater than the African average which appears to have been slightly negative, but nowhere near the - 16% experienced in SA. You cannot escape the fact that the SA economy during the late years of apartheid was a complete and utter failiure. To argue that the post-apartheid regime have been worse is plian and simply wrong. To claim that the post-apartheid regime in South Africa has caused a slump in national productivity is unfounded and disaproven by economic statisitics. I don`t understand why you try to defend it... emoticon_confused\n \n \nMy point was that SA's situation wasn't \"peachy\".\n \n Eddie wrote:\n \"And still the economic growth has been higher since apartheid was abolished. I`m not saying everything has been peachy in South Africa since the fall of apartheid, but claiming that the economy has plummeted when it hasn`t is wrong. \"\n \n I was only using your terminology to agree that it WASN'T \"peachy\".\n \n\n \n Ok\n \n \n\n That's one point of view, here's another:\n \"At the present day, an estimated 42% or 8-million employable non-white South Africans are unemployed. The unemployment among this segment of the population is higher today than at any time during the apartheid era. During the mid-1970's, the United Nations revealed that despite apartheid and despite South Africa's disparity in wage rates, black people in South Africa earned a higher per capita annual income than black people living elsewhere in sub-Sahara Africa. During the 1980's and early 1990's, the anti-apartheid movement promoted the concept of \"revolution before education,\" encouraging thousands of non-white students to abandon their formal schooling. \"\n \n http://www.mises.org/fullstory.asp?control=1501\n\n \n First off, I don`t think anyone has questioned that the SA african unemployment is a large problem for the South African economy.\n \n Secondly, even with sky-rocketing unemployment, South Africa has still been able to achieve economic growth that is on par with a large part of the industialised world. To me, it sounds like an achievement, ecp. compared to the distrous economic failiures of the apartheid government during the eightiees.\n \n Thirdly, while it is true that South Africa enjoyed the highest black wages in the sub-saharan region in the seventies, they are still enjoying the highest wages in the sub-saharan region. I don`t really see the significance of the statement...\n \n Fourthly, the problems with education did not start during the eightiees. It started when education (along with everything else) was segregated and gave rise to a dual economy.\n \n Fifthly, while this segment seemed quite level headed, Mises institution is hardly the bastion of un-biased knowledge. It is pre-dominatly a think tank for austrian economics and neo-liberal politics. I`m sure I could find some nice anarcho-syndicalist web page that gives a completly different view on the South African situation... At least the CIA reports tries to be un-political (allthough I`not so sure that it suceeds).\n \n And sixthly, that part didn`t say anything about the relative succes or failiure regarding South African post-apartheid regime (apart from the unsurprising and hardly informative jabs at socialism, strong labour unions and keynsian economics). In fact, it clearly put massive blaim on the apartheid system itself and all the economic problems it caused. To be honest, I don`t even understand why you brought it up... emoticon_confused", 
   {}, 
   55851, 
   null, 
   1088449380.0
  ], 
  [
   55895, 
   null, 
   "Tastyfish", 
   "In what way did that prove your point? And the economic decline of the SA economy was far greater than the world average the world average appears to have been a positive economic growth, rather than the economic decline experienced by the SA. The SA economic decline was even far greater than the African average which appears to have been slightly negative, but nowhere near the - 16% experienced in SA. You cannot escape the fact that the SA economy during the late years of apartheid was a complete and utter failiure. To argue that the post-apartheid regime have been worse is plian and simply wrong. To claim that the post-apartheid regime in South Africa has caused a slump in national productivity is unfounded and disaproven by economic statisitics. I don`t understand why you try to defend it... emoticon_confused\n\n He means that the slump here in growth is more to do with the refusal to trade with SA during the later stanges of apartied. The point he is trying to make is that if it weren't for this then the economy would be in a better state. However, whether aparteid would have ended is a different matter.", 
   {}, 
   55867, 
   null, 
   1088455500.0
  ], 
  [
   55905, 
   null, 
   "Eddie", 
   "Ah, then I see. But why would the economic costs of the international reaction to inhuman and attrocious domestic politics be taken out of the equation? Its like saying that Soviet planned economy would have been succesful, had it not been for the fact that the rest of the world refused to role over and die.", 
   {}, 
   55895, 
   null, 
   1088457840.0
  ], 
  [
   55909, 
   null, 
   "Tastyfish", 
   "Possibily just out of curiosity, still seems valid to include them to me, but just to see if Seigfreidson has any leg to stand on you could see if Aparteid was economically a benefit (as slavery is) despite not being humane. So even if you hold the beleif that aparteid isn't all that bad from a human perspective would returning to aparteid actually be a good idea. From the current stats including the international communities response it isn't. But if as he would like to see it the entire world behaved in such a way would it be of any benefit?", 
   {}, 
   55905, 
   null, 
   1088458320.0
  ], 
  [
   55916, 
   null, 
   "Eddie", 
   "I can`t see any possible economic advantage of having an apartheid system. It only creates an economic system based on race rather than merit. Without any hint of meritocracy the economic system fails to facilitate the dynamic advantages of a market economy stemming from competition. An apartheid system merely creates an artificial and natural dual economy that furthers skewer competion on the labour market and between firms. Furthermore an apartheid system creates negative international image (which had economic implications for South Africa) and it creates social tension and poverty. Many of the economic problems SA is facing at the moment derives from the fact that its going from a highly dual economy, with one or a few highly productive sectors and a large subsistance sector, into a modern economy of western standards. Unemployment is hardly surprising in this transitory state as wages are driven up in the sectors with low productivity, shedding the most un-productive bussineses and driving up competition between firms. When wages rise and bad bussinesses falls apart, unemployment is naturally created, even skyrocketing. The same effects can be wittnessed in large parts of eastern europe and Russia. The difference is perhaps that eastern europe and Russia don`t suffer from the same unequal productivity in terms of capital infusion into labour (education)\n \n So in essance, the issue is not wether apartheid produced economic failiures and led to an eventual economic disaster. That is more or less a fact. The question is wether ANC and the economic polycies practiced in SA since the fall of the apartheid era has been succesful. I would say that the short term costs of trying to transform the country from a dual economy into a modern economy are huge, but it is necessary and unavoidable if South Africa ever hopes to be a modern and prosperous nation. Granted, there are some things that probably should have been differently, but hindsight is always 20/20. The failiure to crack down on the AIDS epidemic and stem the crime rate is probably the msot serious. Unemployment is, as I said above, an unavaoidable consequence of modernising the South African economy.", 
   {}, 
   55909, 
   null, 
   1088460360.0
  ], 
  [
   55955, 
   null, 
   "JPSartre12", 
   "In what way did that prove your point? And the economic decline of the SA economy was far greater than the world average the world average appears to have been a positive economic growth, rather than the economic decline experienced by the SA. The SA economic decline was even far greater than the African average which appears to have been slightly negative, but nowhere near the - 16% experienced in SA. You cannot escape the fact that the SA economy during the late years of apartheid was a complete and utter failiure. To argue that the post-apartheid regime have been worse is plian and simply wrong. To claim that the post-apartheid regime in South Africa has caused a slump in national productivity is unfounded and disaproven by economic statisitics. I don`t understand why you try to defend it... emoticon_confused\n\n \n You're problem is that you're confusing the egg with the chicken. SA's economic decline towards the end of apartheid was PRECIPITATED by anti-apartheid divestitures. Did you think that pulling $Billion of Western monies out of SA by do-gooding Liberals wasn't going to hurt its economy?\n \n\n First off, I don`t think anyone has questioned that the SA african unemployment is a large problem for the South African economy.\n \n Secondly, even with sky-rocketing unemployment, South Africa has still been able to achieve economic growth that is on par with a large part of the industialised world. To me, it sounds like an achievement, ecp. compared to the distrous economic failiures of the apartheid government during the eightiees.\n\n You keep comparing present-day SA to the declining years of apartheid. Don't you get it? Anti-apartheid divestiture caused the decline of the 70's-80's.\n \n\n Thirdly, while it is true that South Africa enjoyed the highest black wages in the sub-saharan region in the seventies, they are still enjoying the highest wages in the sub-saharan region. I don`t really see the significance of the statement...\n\n \n And the highest crime rate, etc., etc.,\n \n\n Fourthly, the problems with education did not start during the eightiees. It started when education (along with everything else) was segregated and gave rise to a dual economy.\n\n Agreed.\n \n\n Fifthly, while this segment seemed quite level headed, Mises institution is hardly the bastion of un-biased knowledge. It is pre-dominatly a think tank for austrian economics and neo-liberal politics. I`m sure I could find some nice anarcho-syndicalist web page that gives a completly different view on the South African situation... At least the CIA reports tries to be un-political (allthough I`not so sure that it suceeds).\n\n I chose it not for its spin, but for its accuracy of facts. The fact is that divestiture in SA caused an almost complete collapse in SA's economy and its society is in chaos, politically and socially.\n \n\n And sixthly, that part didn`t say anything about the relative succes or failiure regarding South African post-apartheid regime (apart from the unsurprising and hardly informative jabs at socialism, strong labour unions and keynsian economics). In fact, it clearly put massive blaim on the apartheid system itself and all the economic problems it caused. To be honest, I don`t even understand why you brought it up... emoticon_confused\n\n \n I don't know how long it would have taken SA to move from apartheid to a free society. My point was that white Liberals in their zest to oust white-rule from SA created a worse condition as a result. Contrast that with the inactions of those same white Liberals towards brutal dictatorships ALSO in Africa and their dichotomous behavior looks suspicious at best. \n I read once that apartheid was responsible for the deaths of 8,000 blacks in its entire existence in SA. Contrast that to Rwanda, whose brutal black rule caused over 50,000 deaths in one bloody day alone with no notice by those same outraged white US and European Liberals.\n I wasn't arguing FOR apartheid, I was arguing AGAINST white US and European Liberals' motives, actions and/or inactions.", 
   {}, 
   55867, 
   null, 
   1088470500.0
  ], 
  [
   55956, 
   null, 
   "JPSartre12", 
   "He means that the slump here in growth is more to do with the refusal to trade with SA during the later stanges of apartied. The point he is trying to make is that if it weren't for this then the economy would be in a better state. However, whether aparteid would have ended is a different matter.\n\n \n Agreed. Thanks for the help. emoticon_xgood", 
   {}, 
   55895, 
   null, 
   1088470560.0
  ], 
  [
   55959, 
   null, 
   "JPSartre12", 
   "......\n So in essance, the issue is not wether apartheid produced economic failiures and led to an eventual economic disaster. That is more or less a fact. \n\n \n No, it's not a FACT. The anti-apartheid movement led to SA's economic disaster.\n \n\n The question is wether ANC and the economic polycies practiced in SA since the fall of the apartheid era has been succesful. I would say that the short term costs of trying to transform the country from a dual economy into a modern economy are huge, but it is necessary and unavoidable if South Africa ever hopes to be a modern and prosperous nation. Granted, there are some things that probably should have been differently, but hindsight is always 20/20. The failiure to crack down on the AIDS epidemic and stem the crime rate is probably the msot serious. Unemployment is, as I said above, an unavaoidable consequence of modernising the South African economy.\n\n \n Their embrace of Socialism will continue to hamper their growth, IMO, but only time will tell.", 
   {}, 
   55916, 
   null, 
   1088471460.0
  ], 
  [
   56942, 
   null, 
   "apathy", 
   "This is an interesting discussion and I hope I don't look foolish just jumping in here like this.\n \n Was I to understand from the original post that the reason for the situation being bad in South Africa was because those in power now are black, and that the situation was better before because those in power then were white?\n \n Was the argument that only whites know how to run a country because they are white and blacks can't do it because they are black?\n \n I do think that was the original point.\n \n Hey, I don't know the full story on South Africa so I won't post any opinions on specific matters. I just wanted to say that rapid regime change and indeed rapid change in styles of government would cause a country to destabilize.\n \n As for the crime rates: How could any government that does not condone crimes like murder and rape be held responsible for the actions of the individuals that commit the crimes? \n \n Anyway, it sounds like a huge mess that resulted from too quick of a regime change (like the Russia example, and then we'll see the Iraq example within the next year or so).", 
   {}, 
   55959, 
   null, 
   1089238200.0
  ], 
  [
   56981, 
   null, 
   "JPSartre12", 
   "This is an interesting discussion and I hope I don't look foolish just jumping in here like this.\n \n Was I to understand from the original post that the reason for the situation being bad in South Africa was because those in power now are black, and that the situation was better before because those in power then were white?\n \n Was the argument that only whites know how to run a country because they are white and blacks can't do it because they are black?\n \n I do think that was the original point.\n \n Hey, I don't know the full story on South Africa so I won't post any opinions on specific matters. I just wanted to say that rapid regime change and indeed rapid change in styles of government would cause a country to destabilize.\n \n As for the crime rates: How could any government that does not condone crimes like murder and rape be held responsible for the actions of the individuals that commit the crimes? \n \n Anyway, it sounds like a huge mess that resulted from too quick of a regime change (like the Russia example, and then we'll see the Iraq example within the next year or so).\n\n \n \n I believe that the original point of the post was to demonstrate that Affirmative Action isn't always Affirmative. There are problems that occur when only color is used as a basis for societal policy. SA is a prime example of the inmates running the assylum, IMO.", 
   {}, 
   56942, 
   null, 
   1089246780.0
  ], 
  [
   58854, 
   null, 
   "Eddie", 
   "Hehe... I seemed to have forgotten this. Well, lets see if we can make some sense of all of this.\n \n \nYou're problem is that you're confusing the egg with the chicken. SA's economic decline towards the end of apartheid was PRECIPITATED by anti-apartheid divestitures. Did you think that pulling $Billion of Western monies out of SA by do-gooding Liberals wasn't going to hurt its economy?\n\n \n Well, not really. The economic effects of the so called \"boycotts\" where marginal at the end of the seventies. What broke the SA economy was a huge debt deriving from sharply increasing governmental expenditures and problems to modernise their economy because of the system of apartheid.\n \n \nYou keep comparing present-day SA to the declining years of apartheid. Don't you get it? Anti-apartheid divestiture caused the decline of the 70's-80's.\n \n\n \n Well, I have yet to see any proof or even figures supporting that statement. The SA economy did not need any divestiture to collapse, it would have done so by itself because of its inherrant flaws (just like the Soviet economy eventually would have collapsed regardless of american arms race).\n \n \n \nI chose it not for its spin, but for its accuracy of facts. The fact is that divestiture in SA caused an almost complete collapse in SA's economy and its society is in chaos, politically and socially.\n \n\n \n Lol... it didn`t say that!... In fact:\n \n \"South African government spending to defend apartheid during the 1980's perhaps inflicted more damage on South Africa's economy than the economic sanctions imposed on South Africa could ever have achieved. Excess state spending during apartheid's last years incurred a massive deficit that now impedes economic growth in the post-apartheid South Africa.\"\n \n And that is the only reference to the sanctions in the text... emoticon_wow \n \n Just a friendly advice, read the text before supplying it as support of your position ;)\n \n \n \n \n\n I don't know how long it would have taken SA to move from apartheid to a free society. My point was that white Liberals in their zest to oust white-rule from SA created a worse condition as a result.\n\n \n Just like \"we\" created a worse condition for the Russians by leaning on the Soviet economy? \n \n \nContrast that with the inactions of those same white Liberals towards brutal dictatorships ALSO in Africa and their dichotomous behavior looks suspicious at best. \n\n \n That is a completly other issue, not in any way connected to the economic implications of SA...\n \n \n\n I wasn't arguing FOR apartheid, I was arguing AGAINST white US and European Liberals' motives, actions and/or inactions.\n\n \n For doing what? Chosing to purchase their goods from a country that wasn`t based on an apartheid system? Chosing to invest their money in a country that didn`t decline economicly? What are these motives, actions and/or inactions that you are talking about? Surely, you don`t want to curtail the consumers right to collectivly or individually choose where to buy his/her own goods? And I hope you don`t advocate force-investments in countries that are litterally going down the drain....\n \n \nNo, it's not a FACT. The anti-apartheid movement led to SA's economic disaster.\n \n \n Please provide some other support for this than the austrian think-tank that argued contrary to your position...\n \n \nTheir embrace of Socialism will continue to hamper their growth, IMO, but only time will tell.\n \n \n Funnily enough, their economic growth is quite adequate. Even though their socialistic and keynsian economics...", 
   {}, 
   55955, 
   null, 
   1090274040.0
  ], 
  [
   58856, 
   null, 
   "Eddie", 
   "I believe that the original point of the post was to demonstrate that Affirmative Action isn't always Affirmative. There are problems that occur when only color is used as a basis for societal policy. SA is a prime example of the inmates running the assylum, IMO.\n\n \n Check out Siegfiredssons link in his sig. It ought to give you some incling of his point with this thread... White supremacist all the way emoticon_rolleyes", 
   {}, 
   56981, 
   null, 
   1090274220.0
  ], 
  [
   60168, 
   null, 
   "syklopps61", 
   "I don't see many \"liberals\" waving banners supporting the chaos that has ensued. The simple fact is, the situation got out of control and got violent, it wasn't anyone's desire to see that happen, nor was it necessarily an inevitable but overlooked outcome. The thugs have been allowed to operate above the law, that isn't supported by lib or con.\n\n \n Waxy, my aren't we forgiving LOL Let me ask you (and I can' WAIT to see the spin here), if we substitute \"South Africa\" with \"Iraq\", would you still be saying the same thing?", 
   {}, 
   55402, 
   null, 
   1091071020.0
  ], 
  [
   60889, 
   null, 
   "Waxy", 
   "Waxy, my aren't we forgiving LOL Let me ask you (and I can' WAIT to see the spin here), if we substitute \"South Africa\" with \"Iraq\", would you still be saying the same thing?\n\n \n LOL. Do you see ghosts in the night too? :p \n \n How are these two situation comparable in the least? I mean really, HOW?\n \n If you can elaborate on that point AT ALL, I'l be glad to offer up some \"spin\". emoticon_rolleyes \n \n Waxy", 
   {}, 
   60168, 
   null, 
   1091649060.0
  ], 
  [
   60893, 
   null, 
   "Waxy", 
   "Anyhoo. emoticon_rolleyes \n \n I had a great time with my South African guests. Wonderful people.\n \n They're Boers, or Africaneers (sp?), of German descent, they been in SA for I believe 7 or 8 generations.\n \n They have done very well for themselves in the construction and mining industry.\n \n They currently live on about a 2000 acre farm in the Upper Transval (sp?) right next door to the largest national park in SA, the name of which escapes me right now. At any rate, he's a regular Crocodile Hunter type. He lives daily with the big 5, hunts Kudu, Springbok, etc... as his only source of meat, and in general, he lives in a National Geographic special.\n \n In terms of political termoil, he did say that there is MAJOR trouble brewing in many parts of SA, especially around Johannesburg, and that the SA economy is breaking down. However, I guess in the northern part of SA where he lives, it's pretty much business as usual. The political termoil was a minor issue to him, and he much preferred to speak about the beauty of SA, it's wildlife, it's culture, and it's advancement during his lifetime.\n \n He speaks about the majority of \"blacks\", for lack of better term, with great respect and admiration. Very hard working, amazing knowledge of the land, and very warm and inviting people. However, apparently, when they're bad, they are REALLY bad.\n \n Well, it's lunch time. More later.\n \n Waxy", 
   {}, 
   60889, 
   null, 
   1091649660.0
  ], 
  [
   60922, 
   null, 
   "daewoo", 
   "The problem in south Africa is that a large number of people running things thre have no qualifications to do so. They lost their government over its racist policies (which I agree were wrong) and put a bunch of theives and cut throats in charge. From a relaistic standpoint, until they get some competent people in office, there is little hope for south africa.", 
   {}, 
   60893, 
   null, 
   1091655300.0
  ], 
  [
   61018, 
   null, 
   "syklopps61", 
   "LOL. Do you see ghosts in the night too? :p \n \n How are these two situation comparable in the least? I mean really, HOW?\n \n If you can elaborate on that point AT ALL, I'l be glad to offer up some \"spin\". emoticon_rolleyes \n \n Waxy\n\n\n \n \nI don't see many \"liberals\" waving banners supporting the chaos that has ensued. The simple fact is, the situation got out of control and got violent, it wasn't anyone's desire to see that happen, nor was it necessarily an inevitable but overlooked outcome. The thugs have been allowed to operate above the law, that isn't supported by lib or con. \n \n \n If I used this exact wording in defense of Bush going into Iraq, you would laugh no doubt, adding that he SHOULD have known. Those on the LEFT often say how Iraq is out of control, right? got violent? no one WANTED to see that happen (naturally referring to the aftermath), right? It wasn't an inevitable outcome, I'm sure they thought there might be some problems but hoped there wouldn't be. There are thugs in Iraq operating above and outside of the law. So, I'm just wondering why you would defend/dismiss the results in South Africa with the aforementioned statement, but yet wouldn't say the same for Bush. And PLEASE, I already know that South Africa is different from Iraq, I'm referring to this statement you made and only that.", 
   {}, 
   60889, 
   null, 
   1091675160.0
  ], 
  [
   61059, 
   null, 
   "Waxy", 
   "If I used this exact wording in defense of Bush going into Iraq, you would laugh no doubt, adding that he SHOULD have known. Those on the LEFT often say how Iraq is out of control, right? got violent? no one WANTED to see that happen (naturally referring to the aftermath), right? It wasn't an inevitable outcome, I'm sure they thought there might be some problems but hoped there wouldn't be. There are thugs in Iraq operating above and outside of the law. So, I'm just wondering why you would defend/dismiss the results in South Africa with the aforementioned statement, but yet wouldn't say the same for Bush. And PLEASE, I already know that South Africa is different from Iraq, I'm referring to this statement you made and only that.\n\n \n I know you think you have a real strong point here, I'm just not sure about what? emoticon_confused \n \n I thought you were trying to compare SA and Iraq, but now you say you aren't doing that. Good thing.\n \n So, if I've got it right, you want me to play along with your purely hypothetical analogy that takes a statement I made and completely changes it's context. What a fiendish trap. :p \n \n Simple reason - unilateral armed military invasion (APPLE = IRAQ) vs. UN sanctioned, nearly globally supported, political pressure and rebellion from within, both peaceful and, unfortunately, violent (ORANGE = SA) are two VERY different scenarios.\n \n Resistance to an armed invasion is INEVITABLE, to \"hope there wouldn't be problems\" is just absurd.\n \n Unless you want to wade into this in great detail, I think I've done all the \"spinning\" I'm willing to do.\n \n Waxy", 
   {}, 
   61018, 
   null, 
   1091723160.0
  ], 
  [
   61099, 
   null, 
   "JPSartre12", 
   ".....\n \n Simple reason - unilateral armed military invasion (APPLE = IRAQ) vs. UN sanctioned, nearly globally supported, political pressure and rebellion from within, both peaceful and, unfortunately, violent (ORANGE = SA) are two VERY different scenarios.\n \n Resistance to an armed invasion is INEVITABLE, to \"hope there wouldn't be problems\" is just absurd.....\n\n \n So, you characterize the liberation of Iraq as an armed invasion? Why then were the troops cheered as they were in WWII when we \"invaded\" Paris?\n The majority of Iraqis saw us as liberators, not invaders, just as the majority of \"French\" (note that I didn't call them frogs this time) saw us as liberators in WWII.", 
   {}, 
   61059, 
   null, 
   1091730120.0
  ], 
  [
   61102, 
   null, 
   "Waxy", 
   "So, you characterize the liberation of Iraq as an armed invasion? Why then were the troops cheered as they were in WWII when we \"invaded\" Paris?\n\n \n Take the rose colored glasses off JP. :p\n \n Waxy", 
   {}, 
   61099, 
   null, 
   1091731860.0
  ], 
  [
   61107, 
   null, 
   "JPSartre12", 
   "Take the rose colored glasses off JP. :p\n \n Waxy\n\n \n And stop watching CNN (communist news network) where everything is slanted. :p \n Want some pictures of grateful Iraqi citizens taken by US soldiers in Iraq? emoticon_xgood", 
   {}, 
   61102, 
   null, 
   1091732520.0
  ], 
  [
   61120, 
   null, 
   "syklopps61", 
   "I know you think you have a real strong point here, I'm just not sure about what? emoticon_confused \n \n I thought you were trying to compare SA and Iraq, but now you say you aren't doing that. Good thing.\n \n So, if I've got it right, you want me to play along with your purely hypothetical analogy that takes a statement I made and completely changes it's context. What a fiendish trap. :p \n \n Simple reason - unilateral armed military invasion (APPLE = IRAQ) vs. UN sanctioned, nearly globally supported, political pressure and rebellion from within, both peaceful and, unfortunately, violent (ORANGE = SA) are two VERY different scenarios.\n \n Resistance to an armed invasion is INEVITABLE, to \"hope there wouldn't be problems\" is just absurd.\n \n Unless you want to wade into this in great detail, I think I've done all the \"spinning\" I'm willing to do.\n \n Waxy\n\n\n \n Yeah, not answering the point, that's kinda what I expected. I specifically said that I wasn't comparing Iraq and Souoth Africa, but real nice try. That comment you made can be used to defend Bush and you know it, but it would make you gag to admit it. So, I don't need to sday another word, you made my point!", 
   {}, 
   61059, 
   null, 
   1091737140.0
  ], 
  [
   61121, 
   null, 
   "syklopps61", 
   "Take the rose colored glasses off JP. :p\n \n Waxy\n\n\n \n And this was a brilliant rebuttal? LMAO", 
   {}, 
   61102, 
   null, 
   1091737200.0
  ], 
  [
   61132, 
   null, 
   "Waxy", 
   "Yeah, not answering the point, that's kinda what I expected. I specifically said that I wasn't comparing Iraq and Souoth Africa, but real nice try. That comment you made can be used to defend Bush and you know it, but it would make you gag to admit it. So, I don't need to sday another word, you made my point!\n\n \n YOU DON'T HAVE A POINT.\n \n How can I answer it?\n \n I made a statement about SA, you want to substitue Iraq into that statement, BUT, you don't want to compare the situations in Iraq and SA. How does that work?\n \n I made a clear and simple to understand (or so I thought emoticon_rolleyes ) statement regarding the application of the statement to Bush. Apparently you missed that \"point\".\n \n You're taking a statement completely out of context and applying it to suit your whims.\n \n How \"liberal\" of you. :p\n \n Waxy", 
   {}, 
   61120, 
   null, 
   1091741760.0
  ], 
  [
   61137, 
   null, 
   "Waxy", 
   "And this was a brilliant rebuttal? LMAO\n\n \n It wasn't meant for you was it? emoticon_rolleyes \n \n Go find some other \"points\" to make.\n \n Waxy", 
   {}, 
   61121, 
   null, 
   1091742840.0
  ], 
  [
   61179, 
   null, 
   "syklopps61", 
   "It wasn't meant for you was it? emoticon_rolleyes \n \n Go find some other \"points\" to make.\n \n Waxy\n\n\n \n I guess good thing it wasn't or I may have been sliced by your keen analytical insight. It was obvious to those who can read that when JP made a point, all you came back with was \n \n \nTake the rose colored glasses off JP. \n \n \n which indicates to me to be reluctance to concede a point.", 
   {}, 
   61137, 
   null, 
   1091763720.0
  ], 
  [
   61182, 
   null, 
   "syklopps61", 
   "I made a statement about SA, you want to substitue Iraq into that statement, BUT, you don't want to compare the situations in Iraq and SA. How does that work?\n\n \n Okay, might be a fine line for you, but I'll repeat that my original comment regarding your statement was made out of frustration because those on the LEFT seem to find quick and easy excuses as a way to defend their good intentions, yet when Bush's actions have a few bumps in the road, suddenly those excuses go out the door and he should be crucified. Simple, using the words you used and leaving out the comparisons you keep wanting me to make (which I believe I already stated that the two situations aren't similar), I believe you could use those exact same words to give Bush a break.", 
   {}, 
   61132, 
   null, 
   1091764260.0
  ], 
  [
   61209, 
   null, 
   "JPSartre12", 
   "Okay, might be a fine line for you, but I'll repeat that my original comment regarding your statement was made out of frustration because those on the LEFT seem to find quick and easy excuses as a way to defend their good intentions, yet when Bush's actions have a few bumps in the road, suddenly those excuses go out the door and he should be crucified. Simple, using the words you used and leaving out the comparisons you keep wanting me to make (which I believe I already stated that the two situations aren't similar), I believe you could use those exact same words to give Bush a break.\n\n \n I got your point and I agree. To refresh Waxy' memory:\n \nI don't see many \"liberals\" waving banners supporting the chaos that has ensued. The simple fact is, the situation got out of control and got violent, it wasn't anyone's desire to see that happen, nor was it necessarily an inevitable but overlooked outcome. The thugs have been allowed to operate above the law, that isn't supported by lib or con.\n Waxy\n\n \n syklopps61's point was that while \"the Left\" is willing to cut SA a lot of slack foir the resultant turmoil in that country post-oppression, \"the Left\" is unwilling to cut GW2 any slack for the resultant turmoil in Iraq-post oppression.\n If you recall, when the Allies ended hostilities after Gulf 1, the intel said that Saddam's people would overthrow him so there was no need for us to do it.\n They underestimated the hold that he had on his people and the anticipated civil war never materialized. Now, the majority of Iraq is glad to see Saddam go, but there are a few pockets of resistance that just won't let go.\n The Liberal Establishment would have one believe that this small minority represents ALL of Iraq. They couldn't be farther from the truth, but they continue to batter GW2 for not anticipating the minimal resistance that is still being felt. Contrast that to SA and it becomes apparent that the new SA isn't looked on as critically as Iraq. Where growing pains are allowed by the liberal media with respect to SA, they aren't allowed in Iraq. It's very apparent.\n \n Does that about sum up the situation, syklopps61?", 
   {}, 
   61182, 
   null, 
   1091802480.0
  ], 
  [
   61217, 
   null, 
   "syklopps61", 
   "Does that about sum up the situation, syklopps61? \n \n \n JP, you ARE da man! I really couldn't have said it better", 
   {}, 
   61209, 
   null, 
   1091806860.0
  ], 
  [
   61227, 
   null, 
   "Waxy", 
   "I guess good thing it wasn't or I may have been sliced by your keen analytical insight. It was obvious to those who can read that when JP made a point, all you came back with was \n \n which indicates to me to be reluctance to concede a point.\n\n \n LOL. You are quick as a whip. :p\n \n JP and I have been around and around on this point a hundred times, we both know where the other stands (and the truth is somewhere in the middle :p ). It was an attempt at humour between the two of us rather than diving back into the same old argument that is completely off topic to the thread.\n \n If you bothered to look at JP's response, you would have noticed that he responded in kind.\n \n Naturally though, you interpreted it as \"liberal\" dodging. emoticon_rolleyes \n \n Waxy", 
   {}, 
   61179, 
   null, 
   1091811240.0
  ], 
  [
   61229, 
   null, 
   "syklopps61", 
   "Naturally though, you interpreted it as \"liberal\" dodging. emoticon_rolleyes \n \n \n Naturally LOL It IS what they do best :-D", 
   {}, 
   61227, 
   null, 
   1091812080.0
  ], 
  [
   61230, 
   null, 
   "syklopps61", 
   "JP and I have been around and around on this point a hundred times, we both know where the other stands (and the truth is somewhere in the middle :p ). It was an attempt at humour between the two of us rather than diving back into the same old argument that is completely off topic to the thread.\n\n \n Fair enough, I will admit to not having read your entire banter with JP, and IF that was the case, I will admit to jumping the gun...just a bit LOL Seriously, when you danced around the POINT I was making and then I read your comment to JP, I NATURALLY came to the conclusion that you had feet like Gregory Hines LMAO", 
   {}, 
   61227, 
   null, 
   1091812260.0
  ], 
  [
   61234, 
   null, 
   "Waxy", 
   "syklopps61's point was that while \"the Left\" is willing to cut SA a lot of slack foir the resultant turmoil in that country post-oppression, \"the Left\" is unwilling to cut GW2 any slack for the resultant turmoil in Iraq-post oppression.\n \n If you recall, when the Allies ended hostilities after Gulf 1, the intel said that Saddam's people would overthrow him so there was no need for us to do it.\n They underestimated the hold that he had on his people and the anticipated civil war never materialized. Now, the majority of Iraq is glad to see Saddam go, but there are a few pockets of resistance that just won't let go.\n The Liberal Establishment would have one believe that this small minority represents ALL of Iraq. They couldn't be farther from the truth, but they continue to batter GW2 for not anticipating the minimal resistance that is still being felt. Contrast that to SA and it becomes apparent that the new SA isn't looked on as critically as Iraq. Where growing pains are allowed by the liberal media with respect to SA, they aren't allowed in Iraq. It's very apparent.\n \n Does that about sum up the situation, syklopps61?\n\n \n I'm fully aware of the point syklopps61 was trying to make, I have been since he set his dastardly trap in his first post. :p\n \n My point is, he doesn't really have a point. It's apples and oranges.\n \n While it's real convenient to take my statement, apply it to everyone from the \"liberal left\", and twist it to a COMPLETELY DIFFERENT situation, it's neither fair, nor realistic.\n \n To refresh both of your memories, I posted this -\n \n \nSimple reason - unilateral armed military invasion (APPLE = IRAQ) vs. UN sanctioned, nearly globally supported, political pressure and rebellion from within, both peaceful and, unfortunately, violent (ORANGE = SA) are two VERY different scenarios\n.\n \n That's the heart of the matter. Plain and simple. If GWB used diplomacy, economic pressure and united international effort, (please don't babble on about paper tiger UN sanctions being ignored, had GWB put together a true coalition of nations the likes of which brought down apartheid, Saddam could have been removed from within, maybe not peacefully, but given foreign assistance, the Iraqis, if willing, were plenty capable. At the VERY least, it would have handicapped Saddam to the point of being effectively powerless) and the people themselves had risen up, LIKE IN SA, the situation would be completely different. I'd be VERY willing to apply the same statement to GWB in that case, and I would expect their to be growing pains. HOWEVER, that simply isn't the case.\n \n You're both crying foul - \"Ohhhh, poor persecuted GWB, no one will cut him any slack. The \"liberal left\" is bunch of hypocrits.\" Sorry boys, but that's what happens when you decide to go it alone, guns blazing, and things don't go your way. Especially when you dupe the public by telling them that Saddam was an immediate threat to their safety and that all Iraqis would swarm the US with love when they arrived as liberators a la WWII France. That's the ultimate in rose colored glasses. \n \n Before you go labelling me again emoticon_rolleyes , I'm fully aware that a large part of the Iraqi population was glad to be rid of Saddam, and did welcome the American invasion, but those same people want the US to get the heck outta dodge nonetheless. They aren't going to welcome a continued American presence with open arms, that's a pipe dream.\n \n There will be growing pains after (IF) the power is ACTUALLY turned over. Those I have no problem with, nor would I blame GWB for them, as long as he keeps his nose out of it. (Which he won't, the US has too much invested in Iraq to actually relinquish control.)\n \n Waxy", 
   {}, 
   61209, 
   null, 
   1091812920.0
  ], 
  [
   61246, 
   null, 
   "syklopps61", 
   "[QUOTE]\nI'm fully aware of the point syklopps61 was trying to make, I have been since he set his dastardly trap in his first post. :p\n\n \n Waxy, you're just too clever for me, I'll have to keep trying then, won't I? LMAO\n \n \nWhile it's real convenient to take my statement, apply it to everyone from the \"liberal left\", and twist it to a COMPLETELY DIFFERENT situation, it's neither fair, nor realistic.\n\n \n What's even more convenient is the way you hide behind the differences between the two examples. I'll keep it in mind, I might have to use the same tactic one day LOL\n \n \nThat's the heart of the matter. Plain and simple. If GWB used diplomacy, economic pressure and united international effort, (please don't babble on about paper tiger UN sanctions being ignored,\n \n \n ROTFLMAO you're killing me. You sound like a child that continuously says \"yeah, but.....\" The fact of the matter is that no matter WHAT Bush did, it wouldn't have been good enough. \n \n \nYou're both crying foul - \"Ohhhh, poor persecuted GWB, no one will cut him any slack. The \"liberal left\" is bunch of hypocrits.\" Sorry boys, but that's what happens when you decide to go it alone, guns blazing, and things don't go your way. Especially when you dupe the public by telling them that Saddam was an immediate threat to their safety and that all Iraqis would swarm the US with love when they arrived as liberators a la WWII France. That's the ultimate in rose colored glasses. \n\n \n If you'd like to have people stop labeling you-just a suggestion? Don't say the things that put you in the category you are being labeled under. I know your DNC fax says to keep saying it until people believe it, but Bush never said \"immediate\". Also, I'm shocked by your arrogance that the Iraqi people are some how lesser people than the French-I mean, I would think it is a normal human reaction that when one is liberated they SHOULD react with joy and gratitude-I think that was a logical assumption to make on Bush's part. And in fact, as JP has said, MOST Iraqi's ARE grateful, it's just folks like you who want to perpetuate the myth that this \"uprising\" is somehow widespread and involves ALL Iraqi's. Another thing, why do you have such a fear of doing things alone anyway? Don't you have the strength of mind to stand up for what's right, even when others aren't? \n \n \nbut those same people want the US to get the heck outta dodge nonetheless. They aren't going to welcome a continued American presence with open arms, that's a pipe dream.\n\n \n As do I, I think we have given them a chance, and if the Iraqi's are worth ANYTHING, they will take this chance and run with it. If not, let them rot. I would say however, that you and I know that if Bush pulled out now and things didn't go well (as if things would EVER go well enough for you), you people would be all over him like white on rice, so really, he has no real choice, does he?\n \n \n(Which he won't, the US has too much invested in Iraq to actually relinquish control.)\n\n \n Interesting, WE have too much invested in Iraq, but yet the U.N., in receiving all the kickbacks with the \"oil for food\" program, DIDN'T have just as much invested to keep us the hell out of there? You seemk to think our so called allies who ran from their responsibilities were so righteous by not getting involved and yet disregard the scandal and bribery with which they were involved as hogwash (do I need to mention Haliburton? LOL)", 
   {}, 
   61234, 
   null, 
   1091816040.0
  ], 
  [
   61256, 
   null, 
   "Waxy", 
   "[QUOTE=syklopps61]\nWaxy, you're just too clever for me, I'll have to keep trying then, won't I? LMAO\n\n \n I'm not sure how to take you syklopps61. Apparently you have a real personal agenda here. I'm not sure why, but you seem pretty desperate to \"score some points\".\n \n Anyhoo, I hope you chalked up a few for yourself. ROTFLMAO!!!!!!!!\n \n \nWhat's even more convenient is the way you hide behind the differences between the two examples. I'll keep it in mind, I might have to use the same tactic one day LOL\n\n \n What's even more incredulous is your continued effort to push an analogy that doesn't work, despite the explanation. On top of that, when the flaw of the analogy is pointed out, which leaves you with no real poin, you ignore it, and accuse me of hiding because I won't agree with you.\n \n \nROTFLMAO you're killing me. You sound like a child that continuously says \"yeah, but.....\" The fact of the matter is that no matter WHAT Bush did, it wouldn't have been good enough. \n \n \n Who's the one acting childishly?\n \n Again, I outlined, quite clearly, my reasons for my statement. If they didn't happen to jive with your little plan, there's not much I can do about it.\n \n Please refrain from speaking on my behalf, I don't presume to speak on yours.\n \n \nIf you'd like to have people stop labeling you-just a suggestion? Don't say the things that put you in the category you are being labeled under. I know your DNC fax says to keep saying it until people believe it, but Bush never said \"immediate\". Also, I'm shocked by your arrogance that the Iraqi people are some how lesser people than the French-I mean, I would think it is a normal human reaction that when one is liberated they SHOULD react with joy and gratitude-I think that was a logical assumption to make on Bush's part. And in fact, as JP has said, MOST Iraqi's ARE grateful, it's just folks like you who want to perpetuate the myth that this \"uprising\" is somehow widespread and involves ALL Iraqi's. Another thing, why do you have such a fear of doing things alone anyway? Don't you have the strength of mind to stand up for what's right, even when others aren't? \n \n \n Labels and generalities are for those with small minds incapable of critical thought, or just too lazy to deal with things on an individual, by issue, basis. I try to avoid them at all cost. You'd have a very hard time finding a post where I labelled you, or anyone here, in any broad general terms. They're useless.\n \n Do you know my stance on most political/economic issues? Are you aware of my overall stance on Iraq? Are you aware that I'm Canadian?\n \n Of course not, you simply lump me in as a \"liberal lefty\", complete with clever little remarks about DNC faxes. emoticon_rolleyes \n \n I have no idea where you got the part about the French and the Iraqis from. Shocked by my arrogance? How? When did I even infer was better/inferior to the other. \n \n I \n\"want to perpetuate the myth that this \"uprising\" is somehow widespread and involves ALL Iraqi's\n\" Huh??? Did you read my post at all?\n \n You need to read things carefully, and with an eye to what is actually there, rather than what you think SHOULD be their given the attached label. In other words, respond to my posts, not the straw man \"liberal lefty\".\n \n Now you move on to questioning my character and integrity, and suggest I act out of fear. Interesting, although rather dubious.\n \n I believe in diplomacy. I believe in democracy. Both require the will of the many, both shun the individual vigilante. There are proper means and channels by which to go about things. I believe in those means and channels. If I didn't, I'd just go out and kill everyone that I suspected might be a rapist or a child molester. That would be OK by you I assume, since I'd be standing up for what's right. \n \n \nAs do I, I think we have given them a chance, and if the Iraqi's are worth ANYTHING, they will take this chance and run with it. If not, let them rot. I would say however, that you and I know that if Bush pulled out now and things didn't go well (as if things would EVER go well enough for you), you people would be all over him like white on rice, so really, he has no real choice, does he?\n\n \n Again, you choose to speak on my behalf. Apparently you know me better than I know myself. Have we met? Of course, I am just another \"liberal lefty\", and you know how they operate. emoticon_rolleyes \n \n I'm all for a pull out, sooner than later. Let the Iraqis work it out. Why would I blame GWB if the Sunnis decide to massacre the Baaths? How would that be his fault? I'm fully prepared to see Iraq slide back into being another militarily controlled, basically dictatorial regime, as long as the Iraqis are. I sure as heck won't try to force democracy on them.\n \n \nInteresting, WE have too much invested in Iraq, but yet the U.N., in receiving all the kickbacks with the \"oil for food\" program, DIDN'T have just as much invested to keep us the hell out of there? You seemk to think our so called allies who ran from their responsibilities were so righteous by not getting involved and yet disregard the scandal and bribery with which they were involved as hogwash (do I need to mention Haliburton? LOL)\n\n \n Again, where is this tangent coming from? Who are you responding to here? I'm starting to think you're debating with yourself. Where did I say this? Rather than address the post, simply spout off unrelated rhetoric.\n \n Ohhhhh, that's right, I forgot, the whole \"liberal lefty\" thing. :xbanghead \n \n Waxy", 
   {}, 
   61246, 
   null, 
   1091819340.0
  ], 
  [
   61258, 
   null, 
   "JPSartre12", 
   "I'm fully aware of the point syklopps61 was trying to make, I have been since he set his dastardly trap in his first post. :p\n \n My point is, he doesn't really have a point. It's apples and oranges.\n \n While it's real convenient to take my statement, apply it to everyone from the \"liberal left\", and twist it to a COMPLETELY DIFFERENT situation, it's neither fair, nor realistic.\n \n To refresh both of your memories, I posted this -\n \n .\n \n That's the heart of the matter. Plain and simple. If GWB used diplomacy, economic pressure and united international effort, (please don't babble on about paper tiger UN sanctions being ignored, had GWB put together a true coalition of nations the likes of which brought down apartheid, Saddam could have been removed from within, maybe not peacefully, but given foreign assistance, the Iraqis, if willing, were plenty capable. At the VERY least, it would have handicapped Saddam to the point of being effectively powerless) and the people themselves had risen up, LIKE IN SA, the situation would be completely different. I'd be VERY willing to apply the same statement to GWB in that case, and I would expect their to be growing pains. HOWEVER, that simply isn't the case.\n\n \n GW2 was unable to get the UN behind action against Saddam because the other powerful members were too busy lining their pockets from illegal deals with Saddam and had a vested interest in the status quo. France, Germany and Russia can hardly be praised for \"taking the high road\" when they were responsible for keeping Saddam in power. Had they not traded with him illegally, who knows what might have happened. Maybe Saddam wouldn't have had enough money to pay his Republican Army for their loyalty and the people would have had a chance to overthrow Saddam. But they didn't have that opportunity because of the likes of France, Germany and Russia who continued to pump funds directly into Saddam's pockets. The US, UK, Poland, Italy, etc., did the right thing in removing a brutal dictator who was in the process of committing genocide on his own people and terrorizing the rest. Regardless of the timing, it was the moral thing to do. But we can't expect a country that lets its elderly die from the heat while they enjoy a month at the beach to act morally now, can we? \n \n\n You're both crying foul - \"Ohhhh, poor persecuted GWB, no one will cut him any slack. The \"liberal left\" is bunch of hypocrits.\" Sorry boys, but that's what happens when you decide to go it alone, guns blazing, and things don't go your way. Especially when you dupe the public by telling them that Saddam was an immediate threat to their safety and that all Iraqis would swarm the US with love when they arrived as liberators a la WWII France. That's the ultimate in rose colored glasses. \n\n \n The troops were greeted as liberators by the majority of Iraqis. \n \n\n Before you go labelling me again emoticon_rolleyes , I'm fully aware that a large part of the Iraqi population was glad to be rid of Saddam, and did welcome the American invasion, but those same people want the US to get the heck outta dodge nonetheless. They aren't going to welcome a continued American presence with open arms, that's a pipe dream.\n\n \n I don't believe that I've ever labeled you a liberal. I believe that I called you a Socialist. :)\n Are you surprised that they want us out now? I'm not, I see that as a healthy sign that they want self-determination and independence just like a teenagers rebelling against their parents.\n \n\n There will be growing pains after (IF) the power is ACTUALLY turned over. Those I have no problem with, nor would I blame GWB for them, as long as he keeps his nose out of it. (Which he won't, the US has too much invested in Iraq to actually relinquish control.)\n \n Waxy\n\n \n We will see...and when the time comes, how do you like your crow? :)", 
   {}, 
   61234, 
   null, 
   1091819700.0
  ], 
  [
   61260, 
   null, 
   "Waxy", 
   "GW2 was unable to get the UN behind action against Saddam because the other powerful members were too busy lining their pockets from illegal deals with Saddam and had a vested interest in the status quo. France, Germany and Russia can hardly be praised for \"taking the high road\" when they were responsible for keeping Saddam in power. Had they not traded with him illegally, who knows what might have happened. Maybe Saddam wouldn't have had enough money to pay his Republican Army for their loyalty and the people would have had a chance to overthrow Saddam. But they didn't have that opportunity because of the likes of France, Germany and Russia who continued to pump funds directly into Saddam's pockets. The US, UK, Poland, Italy, etc., did the right thing in removing a brutal dictator who was in the process of committing genocide on his own people and terrorizing the rest. Regardless of the timing, it was the moral thing to do. But we can't expect a country that lets its elderly die from the heat while they enjoy a month at the beach to act morally now, can we?\n\n \n There's more than one way to skin a mule, AND, you catch more flies with honey than vinegar.\n \n Are you suggesting that the US was completely unaware of the actions of France, Russia, etc... prior to the invasion? \n \n How do you think news of that cooperation hitting international news sources would have played out in those countries, let alone the court of world opinion? \n \n Would that have created in impetus to do something about it? \n \n Besides, that, do you not believe that united world pressure and opinion, like that which broke Apartheid and supported Gulf I, would have been preferable and more effective than unilateral action?\n \n Don't say it couldn't have been done, because it could have, it was just a matter of having the will to do it.\n \n \nThe troops were greeted as liberators by the majority of Iraqis. \n \n \n I don't deny this, never have. However, they did meet significant resistance, I also think that is undeniable.\n \n \nI don't believe that I've ever labeled you a liberal. I believe that I called you a Socialist. :) Are you surprised that they want us out now? I'm not, I see that as a healthy sign that they want self-determination and independence just like a teenagers rebelling against their parents.\n\n \n I have some admitted socialist leanings, generally along the lines of social security and benefits, that I certainly won't apologize for, but I definately don't consider myself socialist. In fact, I rather revile the majority of socialist ideals, and I rally against them as strongly as I can in my own political system.\n \n I also think it's a good sign, and I think we should be good parents and start giving them the responsibility they want. You gotta get your hands dirty and learn from experience, and it won't always be pretty. I say give them the ball and see what they can do.\n \n \nWe will see...and when the time comes, how do you like your crow? :)\n\n \n I don't know, I've never tried it, but I assume you have some favourite recipes. :p emoticon_xhoho \n \n Waxy", 
   {}, 
   61258, 
   null, 
   1091820420.0
  ], 
  [
   61267, 
   null, 
   "syklopps61", 
   "[QUOTE=Waxy]\nI'm not sure how to take you syklopps61\n. \n \n Keeps ya on your toes, huh? LOL\n \n \n Apparently you have a real personal agenda here. I'm not sure why, but you seem pretty desperate to \"score some points\".\n\n \n I'm not desperate to score anything actually. I'm voicing my opinion, whether or not you like it or think it's wrong. I merely am pointing out what I saw as an inconsistency in your application of blame being piled on Bush. Seems to me if you were consistent, you would be criticizing all the leaders that had anything to do with the pressures placed on South Africa that has resulted in its current demise, but no, they had good intentions (and Bush of course didn't)\n \n \nAnyhoo, I hope you chalked up a few for yourself. ROTFLMAO!!!!!!!!\n\n \n LMAO, I don't have enough room on my computer for all the notches\n \n \nWhat's even more incredulous is your continued effort to push an analogy that doesn't work, despite the explanation. On top of that, when the flaw of the analogy is pointed out, which leaves you with no real poin, you ignore it, and accuse me of hiding because I won't agree with you.\n\n \n LMAO reminds me of an anorexic, looking in the mirror and seeing someone fat. You really can't see what you said can apply to Bush and you continue to spout this comparison with Iraq and South Africa that I have continuously said there aren't any. Can you at least admit that?\n \n \n \nWho's the one acting childishly?\n\n \n Well, when you keep trying to make it sound like Bush DIDN'T attempt diplomacy (what WAS he doing for those 14 months then? LOL amazing), when you say\n \nThat's the heart of the matter. Plain and simple. If GWB used diplomacy, economic pressure and united international effort, (please don't babble on about paper tiger UN sanctions being ignored, \n \n \n when it's a fact that Bush DID all those things, just not on the level that YOU would have liked to see, yes I would have to say that reminds me of a child who can never be satisfied\n \n \nLabels and generalities are for those with small minds incapable of critical thought, or just too lazy to deal with things on an individual, by issue, basis. I try to avoid them at all cost. \n \n \n and just how DO you know how small my mind is? LMAO Sounds to me like you might be generalizing and labeling\n \n \nDo you know my stance on most political/economic issues? Are you aware of my overall stance on Iraq? Are you aware that I'm Canadian?\n\n \n No, I don't, but I think it's safe to say based on what we have been talking about, you wouldn't be caught dead in a Republican rally. And at the risk of starting an international incident, I'll stop there LMAO\n \n \nOf course not, you simply lump me in as a \"liberal lefty\", complete with clever little remarks about DNC faxes. emoticon_rolleyes \n \n \n Well, don't Socialist leanings kinda fall on the Liberal/Lefty spectrum?\n \n \nI have no idea where you got the part about the French and the Iraqis from. Shocked by my arrogance? How? When did I even infer was better/inferior to the other. \n \n \n Okay, maybe that didn't come out like I intended (see how easy it is to admit that one isn't perfect? it didn't hurt a bit! LOL) I left something out and can't remember what it was. LMAO, I've now left myself open to your attack!!\n \n \nI \" Huh??? Did you read my post at all?\n\n \n Actually, yes, I saw that after I sent my post, my apologies\n \n \nI believe in diplomacy. I believe in democracy. \n \n \n Ditto, but diplomacy failed. Do you really suggest that diplomacy has no time limit, that diplomatic efforts should go on until the end of time if need be? I think anyone without an agenda and irrational hatred of Bush would have to agree that 14 months of begging and pleading was plenty of time, ESPECIALLY when U.N. resolutions (I would think comparable to the ten commandments for those on the LEFT) were spit on by Hussein. THAT alone should have had you all up in arms, but the fear of fighting for what's right consumed you all.\n \n \nI'd just go out and kill everyone that I suspected might be a rapist or a child molester. That would be OK by you I assume, since I'd be standing up for what's right. \n \n \n WAIT! DId you just speak for me? LOL\n \n \nI'm all for a pull out, sooner than later. Let the Iraqis work it out. Why would I blame GWB if the Sunnis decide to massacre the Baaths? How would that be his fault?\n \n \n C'mon now, you know that people that think like you (is that better?) would say that because Bush removed Hussein who had so much control, albeit by ruthless means, that the blood of all those Baaths would be on his hands\n \n \n \n \n \n \n \nWho are you responding to here? \n \n \n Well, you made a comment about the U.S. having too much invested in Iraq and NATURALLY the Left refers the whole war for oil BS (yawn), and I was commenting that if money were the issue, the U.N. certainly had much more of an interest to keep us OUT of Iraq so they could continue to get their kickbacks. I just said Haliburton because I thought as clever as you were you would know that I was talking about this non-existent claim (as in NO PROOF) that we are there to line the pockets of Cheney and his buddies. The LEFTIES are so quick to believe something that is totally fabricated, yet there is proof that the kickbacks were occurring and they whistle past the graveyard\n \n \nOhhhhh, that's right, I forgot, the whole \"liberal lefty\" thing. :xbanghead \n \n \n You're catching on LOL", 
   {}, 
   61256, 
   null, 
   1091823000.0
  ], 
  [
   61280, 
   null, 
   "Waxy", 
   ". \n I'm not desperate to score anything actually. I'm voicing my opinion, whether or not you like it or think it's wrong. I merely am pointing out what I saw as an inconsistency in your application of blame being piled on Bush. Seems to me if you were consistent, you would be criticizing all the leaders that had anything to do with the pressures placed on South Africa that has resulted in its current demise, but no, they had good intentions (and Bush of course didn't)\n\n \n This is getting ridiculous.\n \n You don't seem to be able to grasp the concept that the manner in which one goes about doing something greatly affects how the outcome of the action is perceived.\n \n You want to me to apologize for an assertion I never made, but rather one that you imagined. I never stated that the growing pains in Iraq were 100% GWB's fault, that's your straw man. I've stated that the pains were 100% forseeable and that there were better alternatives to military invasion, for his refusal to admit that these problems were forseeable, and his failure IMHO to fully pursue the options available, I hold him responsible for the resulting outcome. \n \n GWB isn't getting much slack, and nor should he. That was a choice he made when he chose to go it alone. No one in their right mind would believe that a military invasion of a sovereign nation, regardless of whether or not the \"intentions were good\" would not lead to some pretty drastic hiccups.\n \n I will admit this - with the situation in Iraq, like that like SA, there's really no way of knowing what the outcome would have been had diplomacy and internal rebellion ousted Saddam rather than US military might.\n \n \nLMAO reminds me of an anorexic, looking in the mirror and seeing someone fat. You really can't see what you said can apply to Bush and you continue to spout this comparison with Iraq and South Africa that I have continuously said there aren't any. Can you at least admit that?\n \n \n Colorful.\n \n You have no point without making the comparison, it is FUNDAMENTAL to your point. Just saying you don't want to make the comparison is irrelevent. Furthermore, I didn't start the comparison, YOU did. \n \n You want me to agree with the statement that chickens are just like pigs and should be treated equally, but at the same time, you don't want to examine how chickens and pigs might differ that would make treating them equally not feasible. \n \n How does that make sense?\n \n \nWell, when you keep trying to make it sound like Bush DIDN'T attempt diplomacy (what WAS he doing for those 14 months then? LOL amazing), when you say\n\n \n Attempting to build a coalition of willing nations for an armed invasion.\n \n \nand just how DO you know how small my mind is? LMAO Sounds to me like you might be generalizing and labeling\n\n \n Touche.\n \n Though you can't have it both ways, either I was speaking directly to you or I was generalizing. I'll let you have your pick. :p\n \n \nNo, I don't, but I think it's safe to say based on what we have been talking about, you wouldn't be caught dead in a Republican rally. And at the risk of starting an international incident, I'll stop there LMAO\n\n \n I hope your A is firmly attached.\n \n You're batting about .0001 on your assumptions, but pushing a solid 9 outta 10 on the smugness meter.\n \n I'm anti - Bush, but very Republican in my political and economic beliefs (I think, it's hard to tell these days). Ditch Bush and his cronies for someone half axed intelligent, and you'd see me front and center at the Republican rally. \n \n Of course these days, I'm hard pressed to tell the diference between your two parties.\n \n \nWell, don't Socialist leanings kinda fall on the Liberal/Lefty spectrum?\n\n \n Sure do, but a man is the some of all of his parts, that's what you seem to have trouble with.\n \n \nDitto, but diplomacy failed. Do you really suggest that diplomacy has no time limit, that diplomatic efforts should go on until the end of time if need be? I think anyone without an agenda and irrational hatred of Bush would have to agree that 14 months of begging and pleading was plenty of time, ESPECIALLY when U.N. resolutions (I would think comparable to the ten commandments for those on the LEFT) were spit on by Hussein. THAT alone should have had you all up in arms, but the fear of fighting for what's right consumed you all.\n\n \n How did it fail? Really, other than deposing Saddam (which was ultimately good) how did diplomacy fail in terms of US interests?\n \n There were no WMDs, and what was there was carefully monitered. \n \n Iraq posed no threat to the US.\n \n Saddam was being weakened, if not for illegal actions by France, Russia, etc..., he would have collapsed. Why didn't we go after the French and the Russians?\n \n If anyone claims we went in for strictly humanitarian reasons, I'll point you in the direction of GWB's pre-invasion speaches and loudly yell BS.\n \n Likewise, sighting UN resolutions as justification is laughable given the complete lack of attention paid to similar UN resolutions and regulations by the US. \n \n \nWAIT! DId you just speak for me? LOL\n\n \n No, I didn't. At least I didn't mean to, I meant it as a question.\n \n \nC'mon now, you know that people that think like you (is that better?) would say that because Bush removed Hussein who had so much control, albeit by ruthless means, that the blood of all those Baaths would be on his hands\n\n \n Well obviously, if they thought like me, they'd have no problem with it. ;)\n \n I can't say what others that don't think like me might have to say.\n \n \nWell, you made a comment about the U.S. having too much invested in Iraq and NATURALLY the Left refers the whole war for oil BS (yawn), and I was commenting that if money were the issue, the U.N. certainly had much more of an interest to keep us OUT of Iraq so they could continue to get their kickbacks. I just said Haliburton because I thought as clever as you were you would know that I was talking about this non-existent claim (as in NO PROOF) that we are there to line the pockets of Cheney and his buddies. The LEFTIES are so quick to believe something that is totally fabricated, yet there is proof that the kickbacks were occurring and they whistle past the graveyard.\n\n \n What was the reason for going to war in your opinion syklopps61?\n \n I'll track down georged's post on the Haliburton-Iraq connection, or better yet, perhaps direct him here to state it for himself. There's plenty of proof, and an undeniable exclusive contract. That said, other than it being very shady IMHO, I don't believe it was the reason to go to war.\n \n Waxy", 
   {}, 
   61267, 
   null, 
   1091826000.0
  ], 
  [
   61319, 
   null, 
   "JPSartre12", 
   "...\n Are you suggesting that the US was completely unaware of the actions of France, Russia, etc... prior to the invasion? \n\n \n Good question. I was unaware, but who am I? \n \n\n How do you think news of that cooperation hitting international news sources would have played out in those countries, let alone the court of world opinion? \n \n Would that have created in impetus to do something about it? \n\n \n I doubt it. The frogs don't care what people think about them anyway. ;)\n \n\n Besides, that, do you not believe that united world pressure and opinion, like that which broke Apartheid and supported Gulf I, would have been preferable and more effective than unilateral action?\n\n Possibly, but I think that the three Saddam Amigos undermined any possible world support.\n \n\n I don't deny this, never have. However, they did meet significant resistance, I also think that is undeniable.\n\n I guess it depends on your definition of significant resistance. The second war was over almost before it even started.\n \n\n I have some admitted socialist leanings, generally along the lines of social security and benefits, that I certainly won't apologize for, but I definately don't consider myself socialist. In fact, I rather revile the majority of socialist ideals, and I rally against them as strongly as I can in my own political system.\n\n \n I knew that from our prior FTE discussions. I know that you're not a rubber-stamping Socialist. ;) \n \n\n I also think it's a good sign, and I think we should be good parents and start giving them the responsibility they want. You gotta get your hands dirty and learn from experience, and it won't always be pretty. I say give them the ball and see what they can do.\n\n \n To carry the analogy further, a good parent gives his child as much responsibility as he can handle and no more than that. :p \n \n\n I don't know, I've never tried it, but I assume you have some favourite recipes. :p emoticon_xhoho \n \n Waxy\n\n \n I have a few recipies that I keep around for those who question my wisdom and accuracy. I'd be happy to send them to you; I've had no need of them personally. ;)", 
   {}, 
   61260, 
   null, 
   1091836140.0
  ], 
  [
   61322, 
   null, 
   "JPSartre12", 
   "LOL. You are quick as a whip. :p\n \n JP and I have been around and around on this point a hundred times, we both know where the other stands (and the truth is somewhere in the middle :p ). It was an attempt at humour between the two of us rather than diving back into the same old argument that is completely off topic to the thread.\n\n \n Somewhere in the middle? I always though it was solidly to the Right. :p \n \n\n If you bothered to look at JP's response, you would have noticed that he responded in kind.\n \n Naturally though, you interpreted it as \"liberal\" dodging. emoticon_rolleyes \n \n Waxy\n\n \n Now, now Waxy. Don't get your dander up. This isn't a hotly contested Ford Vs Chevy debate. :)", 
   {}, 
   61227, 
   null, 
   1091837760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  10 Years After Aparteid, South Africa in a Crisis", 
  "url": "http://www.4forums.com/political/crime-debates/2559-10-years-after-aparteid-south-africa-crisis.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 2559, 
  "discussion_files": [
   [
    "26962.html", 
    "http://www.4forums.com/political/crime-debates/2559-10-years-after-aparteid-south-africa-crisis-print.html"
   ], 
   [
    "26963.html", 
    "http://www.4forums.com/political/crime-debates/2559-10-years-after-aparteid-south-africa-crisis-5-print.html"
   ], 
   [
    "26964.html", 
    "http://www.4forums.com/political/crime-debates/2559-10-years-after-aparteid-south-africa-crisis-4-print.html"
   ], 
   [
    "26965.html", 
    "http://www.4forums.com/political/crime-debates/2559-10-years-after-aparteid-south-africa-crisis-3-print.html"
   ], 
   [
    "26966.html", 
    "http://www.4forums.com/political/crime-debates/2559-10-years-after-aparteid-south-africa-crisis-2-print.html"
   ]
  ], 
  "identifier": 2559
 }
]