[
 [
  [
   2686, 
   null, 
   "Faze", 
   "Freedom? Peace? - Or the exact opposite?", 
   {
    "post_info": {
     "post_title": "What is Bush really fighting for?"
    }
   }, 
   null, 
   null, 
   1045851780.0
  ], 
  [
   2687, 
   null, 
   "Faze", 
   "I think: Bush is really fighting for something - he's not just sure what it is. In the first place, he's initiating a war against Iraq which ruins the essence of Peace. If ever he's fighting for Freedom, what freedom is that? From the threats of Saddam's power to diminish mankind?", 
   {}, 
   2686, 
   null, 
   1045852200.0
  ], 
  [
   2707, 
   null, 
   "Broker", 
   "Peace? What peace?", 
   {}, 
   2686, 
   null, 
   1045877160.0
  ], 
  [
   2765, 
   null, 
   "Faze", 
   "uhuh... \n I cannot exactly answer that, i cannot specifically tell if there is even a bit of peace lurking around. but if there is - where is it anyway?", 
   {}, 
   2686, 
   null, 
   1045903140.0
  ], 
  [
   2783, 
   null, 
   "stinger", 
   "We've been told we're gong to war to eliminate weapons of mass destruction we haven't located yet; to retaliate for links to al Qaeda that are historically tenuous at best; to eliminate a man for actions he might take some day; to liberate an oppressed people we didn't care about before 9-11. Which is it? It doesn't really matter to Bush as long as you accept any of the above.\n \n It is this absence of a clear rationale for war that inspired millions of demonstrators around the world to voice their opposition. It should be noted that nothing like this happened prior to the Gulf War, because the reasons for war were evident to all then, and because the world acted in concert to reverse Iraqi aggression.\n \n It is absolutely true that the Iraqis would be better off without Saddam in power. But it isn't up to the U.S. to decide when people should be freed. People's liberation, especially from an oppressor from within, isn't something for outsiders to choose or to impose their will on other countries. The call for liberation must come from the oppressed people themselves.\n \n Before Bush, America placed its faith in peacefully exporting the ideals of democracy, liberty and self determination. These concepts inspired lovers of freedom all over the world to accept the risks of challenging oppressors. Now, no matter what reasons we give, the U.S. will be an invading army determined on reshaping a foreign country to suit our own purposes.\n \n Haven't we abandoned American ideals the moment we attempt to impose them by force?", 
   {}, 
   2686, 
   null, 
   1045916040.0
  ], 
  [
   2835, 
   null, 
   "Broker", 
   "They have risen up three times. Last time Saddam wiped out 20% of the population. \n \n Why do you think they need that military? The regime would be toppled without it. Last time the people rose up they took 81% of the country, but the military took it back.", 
   {}, 
   2686, 
   null, 
   1045954560.0
  ], 
  [
   2864, 
   null, 
   "Debater", 
   "stinger this is nothing new.\n \n In the early 1800's we attacked several terrorist supporting countries.\n \n Throughout our history we have waged war on terrorism and oppressive governments. \n \n Recently, the elder Bush attacked Iraq and al Qaeda.\n \n Clinton sent cruise missiles at Iraq and destroyed a several Middle Eastern terrorist cells.\n \n Now Bush is doing it.\n \n What's new about that?", 
   {}, 
   2686, 
   null, 
   1045974780.0
  ], 
  [
   2865, 
   null, 
   "Debater", 
   "The United States is perfectly ok in removing Saddam.\n \n If it wasn't for the French the U.S. would have lost the Revolutionary War.", 
   {}, 
   2686, 
   null, 
   1045974840.0
  ], 
  [
   2867, 
   null, 
   "Broker", 
   "Very true. We battered those countries attacking American shipping until they agreed to stop...and then we destroyed the infrastruture so they couldn't do it anyway. Saddam is attacking our planes almost every day. That alone makes me want to take action.", 
   {}, 
   2686, 
   null, 
   1045976160.0
  ], 
  [
   2951, 
   null, 
   "XYOU", 
   "Bush is fighting for establishing a new and total leadership in Middle East (<--this is just a reference I got now maybe useful to prove what I say but not so good anyway)with this \"non-righteous war\" ( non-righteous war- I suppose you American will not say like that in your side but is in my side and so many place in the world as I know ) ! \n \n You Amerian may not agree and unhappy to what I say (to me, I am not USA or Iraq, I am neutral, but to you American, I suppose you won't be as neutral as me to think in this points of view ), USA is really a robber this time and Bush is really a criminal cos Bush really has no reasons to war. (sure, at last, you USA must be legal to war with your lots of \"reasons\" cos USA is rich and strong- the richest and the strongest in almost everything of the world now )\n \n Everybody knows UN is sucks and almost useless, and in today's world , USA is the greatest and can be done anything with all of your USA's money and military power as you USA like, what can I say !\n \n \n No oil, no USA ! That's why Bush hungry for this war , USA may need this war ( you think I don't know this fact--< Bush works for USA only :D ) !! \n \n Broker really knows USA still have many oils in your mainland, I wonder ?\n As I know (sorry can't show you evidence yet meanwhile) USA's oil has already used up within the last 200 hundreds years !", 
   {}, 
   2686, 
   null, 
   1045997220.0
  ], 
  [
   2956, 
   null, 
   "Broker", 
   "No, we have oil off of California, in the Gulf of Mexico, in Alaska, and various other places. \n \n Who is really fighting for oil? France, China, and Russia all have big oil contracts with Iraq...and billions more in trade. \n \n We already have enough oil around the world to buy. This is not about oil for the US, it is for France, Russia, and China.", 
   {}, 
   2686, 
   null, 
   1046014500.0
  ], 
  [
   2957, 
   null, 
   "Broker", 
   "Saddam is letting terrorists into his country. I don't want them to get any weapons from him to hurt anyone... \n \n The US could never hold the middle east...there's not much more than sand out there anyway. Suicide bombings, random gun attacks...it would be insane and the American people wouldn't want it.", 
   {}, 
   2686, 
   null, 
   1046014980.0
  ], 
  [
   2982, 
   null, 
   "sarablaze", 
   "I have to say that Bush is fighting so we do not have to be afraid anymore. I was talking to my mother, and she brought up a good point. Read (if you can find it) \"The Rape of Kuwait\" I t is a book about what Saddam did to Kuwait. If he does attack us, we go to war, and he wins, he will take us over, and we will be like his country is today! (no freedom) I doubt he will win. But if he does any harm to us at all it will not be good. Why take the chance of letting any harm come to us? Why should we live in fear? emoticon_confused", 
   {}, 
   2686, 
   null, 
   1046043360.0
  ], 
  [
   3241, 
   null, 
   "Debater", 
   "Bush isn't fighting for oil Xyou, the US currently trades oil with Iraq. If we're already getting it, why fight for it?", 
   {}, 
   2686, 
   null, 
   1046212920.0
  ], 
  [
   3244, 
   null, 
   "Broker", 
   "Yeah... we got the restrictions on his oil selling imposed. IK would rather buy oil from Russia.", 
   {}, 
   2686, 
   null, 
   1046216340.0
  ], 
  [
   3245, 
   null, 
   "thistownwilleat", 
   "\"Bush isn't fighting for oil Xyou, the US currently trades oil with Iraq. If we're already getting it, why fight for it?\"\n \n Seems obvious to me. So we don't have to pay for it.", 
   {}, 
   2686, 
   null, 
   1046217540.0
  ], 
  [
   3248, 
   null, 
   "wjim1269", 
   "We're fighting because Bush feels that Saddam Hussein has or is trying to get weapons of mass destruction, and we know that if he gets them, he will use them. Just ask the Kurds who were gassed before the Gulf War.", 
   {}, 
   2686, 
   null, 
   1046219820.0
  ], 
  [
   3249, 
   null, 
   "Broker", 
   "Yep...he'd like to test it on them again.\n \n Thistown, do you think we'd take that oil? It's political suicide...", 
   {}, 
   2686, 
   null, 
   1046220540.0
  ], 
  [
   3251, 
   null, 
   "thistownwilleat", 
   "Yes we are going to take that oil. And political suicide sounds funny coming from you, you who doesn't care what Europe or anyone else thinks of us. You've expressed your opinion numerous times that you don't care what the rest of the world thinks, so exactly how is this suicide. In my opinion, we're close to political suicide on the national scale without taking the oil.\n \n Do you know what Turkey wants from us in return to their cooperation, the northern oilfields of Iraq...they assume they will be ours to give, and they are right. The only reason that many countries have \"sided\" with us is so they can get in on the oil contracts. We will take the oil, and yes it is a major incentive for Bush. You've pulled the wool over your own eyes if you cant see that.", 
   {}, 
   2686, 
   null, 
   1046222640.0
  ], 
  [
   3276, 
   null, 
   "Broker", 
   "And those against us are against us because of their oil deals.", 
   {}, 
   2686, 
   null, 
   1046230020.0
  ], 
  [
   3281, 
   null, 
   "thistownwilleat", 
   "We all agree that if we invaded Iraq we would \"win\" (whatever that means). Why would these countries be worrying about their war deals with Iraq when WE will be controlling the oil after a sucessful invasion. It's obvious that there are other reason that the majority of the world opposes us. You know that.", 
   {}, 
   2686, 
   null, 
   1046231400.0
  ], 
  [
   3345, 
   null, 
   "Broker", 
   "They have deals with the regime...those deals might not be valid when the regime is toppled.", 
   {}, 
   2686, 
   null, 
   1046270220.0
  ], 
  [
   3360, 
   null, 
   "AlexTheGreat", 
   "falling...\n \n don't you think you are being unfair when you recognize that both sides in the debate have oil interests, but then add that those anti-war states have other reasons to oppose war, without acknowledging that the United states also has other reasons to support the war?", 
   {}, 
   2686, 
   null, 
   1046293440.0
  ], 
  [
   3749, 
   null, 
   "Middle", 
   "Bush may be supporting the war for personal reasons as well. could it be that because Bush's father didn't defeat Sadam that Bush feels it is something he needs to do? Oil is definitely one of the main reasons for the US going to war. However, the main thing we use it for is car fuel. When Bush recently gave that 1.3(I'm not sure if that's the correct amount) billion dollars for research on alternate fuel sources for cars he should've given a lot more. We, America, depend so much on our cars and fuel sources that essentially we are depending on Iraq for part of that.", 
   {}, 
   2686, 
   null, 
   1046653020.0
  ], 
  [
   3751, 
   null, 
   "thistownwilleat", 
   "Bush jsut did that to pay lip service to the environmentalists who (rightly I might add) accuse him of caring nothing for the environment. Diversionary tactic.", 
   {}, 
   2686, 
   null, 
   1046654640.0
  ], 
  [
   3753, 
   null, 
   "Broker", 
   "That plays into it, but I don't think it's the main reason. I think Bush wants the best for our country. Now you can come and oil this, oil that, but I think he usually is trying to do the right thing. The only president that didn't play to his interests would probably have been Carter.", 
   {}, 
   2686, 
   null, 
   1046657340.0
  ], 
  [
   3796, 
   null, 
   "debategirl88", 
   "I am sick and tired of people saying the reason Bush wants to go to war is because of the oil. Just because there's oil there doesnt mean thats the reason we are going over there.", 
   {}, 
   2686, 
   null, 
   1046755920.0
  ], 
  [
   3808, 
   null, 
   "sarablaze", 
   "We are not taking the oil, thistown. When it comes to our defense, this isn't an international popularity contest. BUT, when it comes to taking the oil, it is. We will go down as the country who fought to protect themselves, then turned around and took their resource of income. Bush is a good guy. He will knock em' down for our protection, than build em' back up, by shelling out our dollars to repair the damage.emoticon_xbouncer", 
   {}, 
   2686, 
   null, 
   1046768220.0
  ], 
  [
   3812, 
   null, 
   "Broker", 
   "Russia and France currently get around 23% of all Iraqi oil each. France recently sold 30 billion dollars worth of Mirage fighter planes. I think we know who is in this for oil and business.", 
   {}, 
   2686, 
   null, 
   1046790180.0
  ], 
  [
   3813, 
   null, 
   "Broker", 
   "Oh, did everyone see that picture of Saddam and Chirac together? I saw it reported that Chirac has that picture hung in his office.", 
   {}, 
   2686, 
   null, 
   1046790240.0
  ], 
  [
   3948, 
   null, 
   "kelvin90701", 
   "I keeping hearing every where not just here about \"no blood for oil\", yadda yadda. When we do invade Iraq, if we do anything remotely resembling consficating Iraqi oil, every Muslim nation will have the evidence to point: there the Americans are killing us for imperialist reasons. The next day even the friendly Muslim nations will stop selling us oil.\n \n The fact is we do not need Iraqi oil. We need Saudi oil. We need Q8i oil. Do you really believe that Saddam does not threaten our supply of Saudi and Q8i oil? Do you really believe that Saddam does not envy Saudi and Q8i oil fields? If Saddam does controls all those oil fields, would we want to bargin with him?\n \n No blood for oil? Come on? It really is about the oil. But it is not about Iraqi oil. It is about keeping the current supply of oil open. Don't let the hippie peacniks fool you with slogans. When we start to shed blood, it is for keeping Saudi and Q8i oil flowing. It is not about going into Iraq and just taking it.", 
   {}, 
   2686, 
   null, 
   1046932680.0
  ], 
  [
   3957, 
   null, 
   "wjim1269", 
   "The war is not about oil. If we were to attack Iraq and take control of its oil reserves, the influx of Iraqi oil on the market would only drive the price of oil down. Do you really think Bush (an oil man) would want to do this.", 
   {}, 
   2686, 
   null, 
   1046937240.0
  ], 
  [
   3960, 
   null, 
   "JFriday", 
   "Good point.", 
   {}, 
   2686, 
   null, 
   1046940420.0
  ], 
  [
   3973, 
   null, 
   "Broker", 
   "If they stop selling us oil there will be no one else to buy it...", 
   {}, 
   2686, 
   null, 
   1046960580.0
  ], 
  [
   4057, 
   null, 
   "kelvin90701", 
   "Originally posted by wjim1269 \n The war is not about oil. If we were to attack Iraq and take control of its oil reserves, the influx of Iraqi oil on the market would only drive the price of oil down. Do you really think Bush (an oil man) would want to do this. \n \n \n Sorry I beg differ. It is all about oil. The danger lies in when the Muslims have evidence that it was all about invading Iraq and plundering the country, we will have even moderate Muslims becomming sucide bombers.\n \n The oil Bush is trying to keep open is Saudi and Q8i. Saddam already invaded Q8i once.", 
   {}, 
   2686, 
   null, 
   1047008340.0
  ], 
  [
   4065, 
   null, 
   "ghettocracka", 
   "someone tell me what good does it do for mr. bush if he has more oil to buy\n \n its not like the country is in a shortage or he gets the money for the oil sold\n \n someone plz expain that to me", 
   {}, 
   2686, 
   null, 
   1047009480.0
  ], 
  [
   4121, 
   null, 
   "AlexTheGreat", 
   "if you can explain to me how even though the war is going to cost almost $100 billion and the occupation a lot more, you still think he is doing this for profit, show me how much oil he would have to blatantly plunder to come out on top. the oil angle is overplayed by people who know nothing about the economics of war or oil.", 
   {}, 
   2686, 
   null, 
   1047053880.0
  ], 
  [
   4197, 
   null, 
   "kelvin90701", 
   "Originally posted by AlexTheGreat \n if you can explain to me how even though the war is going to cost almost $100 billion and the occupation a lot more, you still think he is doing this for profit, show me how much oil he would have to blatantly plunder to come out on top. the oil angle is overplayed by people who know nothing about the economics of war or oil. \n \n \n Ok. I agree. Your right. After reading my post it does sound like blanter.\n \n To my own defense against the anti-war slogans, it is not about us going into Iraq to just take it.", 
   {}, 
   2686, 
   null, 
   1047094920.0
  ], 
  [
   4199, 
   null, 
   "Broker", 
   "What us 90701? A zip code or number with meaning or just something random? \n \n Being curious, lol.", 
   {}, 
   2686, 
   null, 
   1047095220.0
  ], 
  [
   4327, 
   null, 
   "Peach47", 
   "I believe President Bush is taking us to a necessary war in order to protect us. This is a man who is decent and about as honest as you will discover any politician to ever be. \n There are not any hidden agendas here. This is not about money or oil.\n This is about protecting Americans and our way of life, period!\n Anyone who thinks differently does not have the facts. \n Their views border on treason.\n When we go to war, not if but when, those who still oppose our Commander in Chief should be tried for treason. \n When will this country learn to stand united!!\n \n Lest we forget 9/11?", 
   {}, 
   2686, 
   null, 
   1047228780.0
  ], 
  [
   4331, 
   null, 
   "kelvin90701", 
   "Peach:\n \n You make to point of hidden agendas. To break it down to it's most simple component, it is about oil. So much of our way of live, our country's success, or countries way of life are all intwined by oil. Cheap gas? Well we get our vegtables and food delivered by truck, our water and sewage is powered by fossil fuel, or concept of freedom of movement, our concept of neighborhood or cities are influenced by fossil fuels. So in a sense GW is trying to protect our way of life. Broken down to it's most simple reason, it is about oil. Again it is not about Iraqi oil. It is about our access to Egyptian, Q8i, and Saudi oil.\n \n Saddam see's himself as a historical figure and his grand destiny is to unite all Muslim nations under one rule, namely his. We can do two things, let Saddam meet his destiny or stop him. Saddam knows the greatest obstacle to his destiny the USA. He needs WMD to be able to bargin and threaten the USA as an equal. He knows that the USA does not want him to have the oil fields of Q8 and Saudi Arabia. This confortation will never stop until he is dead.", 
   {}, 
   2686, 
   null, 
   1047254820.0
  ], 
  [
   4332, 
   null, 
   "Broker", 
   "Yeah, he'll get a nuke, invade everyone around him, and hold the international community hostage with it.", 
   {}, 
   2686, 
   null, 
   1047255420.0
  ], 
  [
   4470, 
   null, 
   "kelvin90701", 
   "Originally posted by Peach47 \n \n When we go to war, not if but when, those who still oppose our Commander in Chief should be tried for treason. \n When will this country learn to stand united!!\n \n Lest we forget 9/11? \n \n \n I agree with you. We should put our faith in our leadership for the moment, but watch them very carefully. That is the price of freedom, eternal vigilance at all levels. If we do find out this is an unjust war, then we should hunt down our leadership for crimes against humanity. If this is a just war, then who is the schmuck? Get the peacenic who visited Saddam as human shields and Sean Penn for treason.", 
   {}, 
   2686, 
   null, 
   1047481680.0
  ], 
  [
   4471, 
   null, 
   "kelvin90701", 
   "Originally posted by ghettocracka \n someone tell me what good does it do for mr. bush if he has more oil to buy\n \n its not like the country is in a shortage or he gets the money for the oil sold\n \n someone plz expain that to me \n\n \n If you look at the geography of Iraq, it borders almost every country or comes very close to every country that produces oil. It is very well known that Saddam sees himself as a hisotrical person who is going to unite all the Muslim countries under one rule. If Saddam was content with just staying within his borders that would be fine, but the man intends to unite all the oil producing countries under one government, namely his. Do you think it is a good idea that he should be allowed to do this?", 
   {}, 
   2686, 
   null, 
   1047482040.0
  ], 
  [
   4474, 
   null, 
   "Stormin Norman", 
   "I heard that Kuwait was going to cut their production by 1/3. In my view, they are all inthis together, and that explains why we are being met by such opposition. Therefore, we should role over these countries one by one. After all, that's the only way we are going to get inside these countries and destroy the Al Qaeda threat.", 
   {}, 
   2686, 
   null, 
   1047485160.0
  ], 
  [
   4501, 
   null, 
   "AlexTheGreat", 
   "The idea that people who oppose the war should be tried for treason is absolutely stupid and flies in the face of the ideals of democracy. It is not your duty as an American to support your President's foreign policy.", 
   {}, 
   2686, 
   null, 
   1047497400.0
  ], 
  [
   4515, 
   null, 
   "JFriday", 
   "I personally will not mourn for any human shields lost in the war. It is stupid of them to go there in the first place. I am sure Sadam is most pleased with his \"useful XXXXXX\" as I would be if I were in his shoes. Personally I would not hesitate to fire on a stategic target that contains them. Ofcourse Alex already knows this ;) hahahaha. \n \n But no, if someone voices an opinion against the war it is not treason. If they work against the war effort though it is.", 
   {}, 
   2686, 
   null, 
   1047510060.0
  ], 
  [
   4519, 
   null, 
   "Debater", 
   "The def of Treason is supporting an American enemy.\n \n This does not mean speech. An Example of Treason would be if someone donates money to Saddam.", 
   {}, 
   2686, 
   null, 
   1047511680.0
  ], 
  [
   4521, 
   null, 
   "AlexTheGreat", 
   "JFriday,\n \n I agree you should not hesitate to hit a strategic target that has a volunteer human shield next to it. I never disagreed with that.", 
   {}, 
   2686, 
   null, 
   1047512520.0
  ], 
  [
   4527, 
   null, 
   "Debater", 
   "Did you hear that some US people went to Iraq to act as human shields?", 
   {}, 
   2686, 
   null, 
   1047513660.0
  ], 
  [
   4551, 
   null, 
   "JFriday", 
   "If people support our enemies then they are guilty of treason, if they speak out against a war they are excersising their first amd. rights. There is a big difference, I think that most people uderstand this. Spying, espionage, terrorist activities, ect. are trecherous, but not speaking out against the war. If they speak in support of Sadam, they are simply misguided, stupid ect. but they are still not commiting treason, just making themselves look bad.", 
   {}, 
   2686, 
   null, 
   1047519480.0
  ], 
  [
   4626, 
   null, 
   "Debater", 
   "really bad!", 
   {}, 
   2686, 
   null, 
   1047602220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is Bush really fighting for?", 
  "url": "http://www.4forums.com/political/current-events-debates/257-what-bush-really-fighting.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 257, 
  "discussion_files": [
   [
    "30050.html", 
    "http://www.4forums.com/political/current-events-debates/257-what-bush-really-fighting-print.html"
   ], 
   [
    "30051.html", 
    "http://www.4forums.com/political/current-events-debates/257-what-bush-really-fighting-4-print.html"
   ], 
   [
    "30052.html", 
    "http://www.4forums.com/political/current-events-debates/257-what-bush-really-fighting-3-print.html"
   ], 
   [
    "30053.html", 
    "http://www.4forums.com/political/current-events-debates/257-what-bush-really-fighting-2-print.html"
   ]
  ], 
  "identifier": 257
 }
]