[
 [
  [
   54509, 
   null, 
   "sglaine", 
   "Does any one here think Bush will do any thing for the environment ever?", 
   {
    "post_info": {
     "post_title": "Will Bush do anything to help the environment?"
    }
   }, 
   null, 
   null, 
   1087586760.0
  ], 
  [
   54603, 
   null, 
   "georged", 
   "No....................", 
   {}, 
   54509, 
   null, 
   1087670400.0
  ], 
  [
   54629, 
   null, 
   "weasel fierce", 
   "there's no terrorists in the environment is there ;)\n \n Seriously though, I dont think the administration particularly cares.", 
   {}, 
   54603, 
   null, 
   1087682280.0
  ], 
  [
   54650, 
   null, 
   "sglaine", 
   "there's no terrorists in the environment is there ;)\n \n Seriously though, I dont think the administration particularly cares.\n\n I agree they don't care. All they care about is making a profit off the war.", 
   {}, 
   54629, 
   null, 
   1087703580.0
  ], 
  [
   59916, 
   null, 
   "marc9000", 
   "What, specifically, would you like to see Bush do for the environment? emoticon_confused", 
   {}, 
   54509, 
   null, 
   1090888620.0
  ], 
  [
   59929, 
   null, 
   "JPSartre12", 
   "Does any one here think Bush will do any thing for the environment ever?\n\n \n\n --Proposing $46.9 billion for high-priority environment and natural resource programs, the highest level ever requested by a President. This funding level is $1.4 billion, or roughly 3 percent, higher than the President's 2004 budget.\n \n --Funding for his Clear Skies Initiative to cut power plant pollution by 70 percent, when implemented, the Interstate Air Quality rule, and the Administration's new regulations on diesel engines and fuel.\n \n --An increase in funding, from $5 million to $65 million, for the Clean School Bus USA program, which supports projects that reduce diesel emissions from school buses through bus retrofit or replacement activities. By expanding this program, additional resources are available to communities for local initiatives that address an issue important to children and parents across the nation.\n \n --To restore our forests and grasslands to more natural, healthy conditions, and to reduce the threat of catastrophic wildfires, the President's budget provides:\n \n --A $58 million, or 14 percent, increase for Department of the Interior and Department of Agriculture fuels reduction (thinning of dense brush and undergrowth) program. The total program funding of $476 million is now four times the amount provided in fiscal year 2000. The two Departments propose a total of $760 million for fuels reduction and other activities that advance the Healthy Forest Restoration Act signed on Dec. 3, 2003 by the President.\n \n --To continue developing clean, domestic energy options that will reduce our dependence on foreign oil, and cut air and pollution greenhouse gas emissions, the President's budget provides:\n \n --Continuing support for his 5-year, $1.2 billion initiative to research and develop hydrogen production, storage, and infrastructure technologies to accelerate the introduction of commercially viable hydrogen-powered fuel cells for cars, trucks, homes, and businesses, while producing virtually no pollution or greenhouse gases.\n \n http://usinfo.state.gov/gi/Archive/2004/Feb/04-761809.html\n\n \n These are just a few. Read the link for others.", 
   {}, 
   54509, 
   null, 
   1090893300.0
  ], 
  [
   59932, 
   null, 
   "apathy", 
   "Funny that's almost word for word what's on Bush's campiagn site:\n http://www.georgewbush.com/Environment/\n \n Go to this page and find the link labeled \"Report\" and download the PDF.\n http://www.ucsusa.org/global_environment/rsi/page.cfm?pageID=1449\n The panel that compiled the report is bipartisan and consists of \"62 preeminent scientists including Nobel laureates, National Medal of Science recipients, former senior advisers to administrations of both parties, numerous members of the National Academy of Sciences, and other well-known researchers...\"\n \n Remember Jane Goodall? Not too cool with Bush adm. policies.\n http://www.sfgate.com/cgi-bin/article.cgi?f=/news/archive/2003/10/12/state1705EDT0044.DTL\n \n Those darn commie environmentalists at http://www.nrdc.org/\n don't like him either : http://www.nrdc.org/bushrecord/\n \n All the above post from Jean Paul says is what's in a budget. Just because something is in a budget doesn't mean it'll be fully funded. Also, all Bush sites like http://www.whitehouse.gov/infocus/environment/ talk about is what legislation got passed. It doesn't say anything about the details of the legislation, the very details that actual scientists and environmentalists are saying are hurting specific environments. \n \n I'm not saying that there hasn't been some legislation that's good.\n All the clean coal burning stuff is great, but it would be happening despite who is in office. That sort of thing has been in the works (scientifically) for quite a while.", 
   {}, 
   59929, 
   null, 
   1090895400.0
  ], 
  [
   60000, 
   null, 
   "sinjin", 
   "http://www.ourforests.org/risk/\n \n just a tidbit of rebuttal to all the good policy the Bush admin. is making.", 
   {}, 
   59932, 
   null, 
   1090956540.0
  ], 
  [
   60035, 
   null, 
   "Kronus", 
   "--Proposing $46.9 billion for high-priority environment and natural resource programs, the highest level ever requested by a President. This funding level is $1.4 billion, or roughly 3 percent, higher than the President's 2004 budget.\n\n Did the funding go through? No. When the president and the majority of congress are in the same party, it's easy for the president to propose programs, knowing that congress will quietly bury the proposal, and make sure it never gets acted on.\n \n \n\n --To restore our forests and grasslands to more natural, healthy conditions, and to reduce the threat of catastrophic wildfires, the President's budget provides:\n \n --A $58 million, or 14 percent, increase for Department of the Interior and Department of Agriculture fuels reduction (thinning of dense brush and undergrowth) program. The total program funding of $476 million is now four times the amount provided in fiscal year 2000. The two Departments propose a total of $760 million for fuels reduction and other activities that advance the Healthy Forest Restoration Act signed on Dec. 3, 2003 by the President.\n \n --To continue developing clean, domestic energy options that will reduce our dependence on foreign oil, and cut air and pollution greenhouse gas emissions, the President's budget provides:\n \n --Continuing support for his 5-year, $1.2 billion initiative to research and develop hydrogen production, storage, and infrastructure technologies to accelerate the introduction of commercially viable hydrogen-powered fuel cells for cars, trucks, homes, and businesses, while producing virtually no pollution or greenhouse gases.\n \n\n Where it says \"fuel reduction\" read \"increased logging\". The money goes towards building roads so the logging interests can get to the trees easier. This isn't being done near homes, or other areas where forest fires pose dangers. This is being done where the lumber companies can make the most money.\n \n As for the hydorgen fuel system, after proposing it and getting his sound bite, it died. He delibrately proposed an expensive, not yet tested, technology so that he can claim to care about the environment without having to actually do anything about it.", 
   {}, 
   60000, 
   null, 
   1090977300.0
  ], 
  [
   60037, 
   null, 
   "marc9000", 
   "[QUOTE]\n Where it says \"fuel reduction\" read \"increased logging\". The money goes towards building roads so the logging interests can get to the trees easier. This isn't being done near homes, or other areas where forest fires pose dangers. This is being done where the lumber companies can make the most money. [QUOTE]\n \n I would think a forest fire poses a danger no matter where it's at - especially to environmentalists. Is preventing profits for logging interests more important to environmentalists than allowing logging roads/fire access roads to be built? \n \n So much environmentalism is thinly disguised anti-capitalism.", 
   {}, 
   60035, 
   null, 
   1090979040.0
  ], 
  [
   60045, 
   null, 
   "Kronus", 
   "\n I would think a forest fire poses a danger no matter where it's at - especially to environmentalists. Is preventing profits for logging interests more important to environmentalists than allowing logging roads/fire access roads to be built? \n \n\n \n You would be wrong. In the natural course of things, forest catch fire on occasion. This clears out old dead trees and thins the undergrowth, resulting in a healthier forest. Years of excessive fire suppresion have left us with forests full of undergrowth and deadwood, which results in forest fires much stronger than one would naturally see. Clearing this our near homes makes sense, since if a fire started there, there would be no way to contain it. If safety is the concern, than that would be the priority. Instead, Bush's policies are allowing logging companies to cut trees far from any homes, where there is no threat to people. Trees in the wilderness are good business for the logging companies, once the governement (that is, you) pay to have the roads built. Trees near homes tend to be second growth, and not worth logging companies time, and so they aren't being cleared, even though they pose the greatest threat.", 
   {}, 
   60037, 
   null, 
   1090984440.0
  ], 
  [
   60054, 
   null, 
   "marc9000", 
   "So we have \"good\" forest fires, and \"bad\" forest fires? I'm not being sarcastic - are there times when fires in isolated areas are allowed to burn? Who makes these decisions, and who foots the bill if they turn out to be a bad decision? \"Excessive fire supression\" - sounds complex. Fires make smoke, is the EPA involved? I trust presidents (even Democrats :p ) more than apointed-for-life EPA tyrants.\n \n Environmentalists always seem to be against road construction on public lands. They seem to think that public land is their private property - that logging, ATV riding, or countless other things not necessarily done by purist environmentalists should be kept out. \n \n Environmentalism is about 10% cleanliness, and 90% Politics and corruption.", 
   {}, 
   54509, 
   null, 
   1090990020.0
  ], 
  [
   60057, 
   null, 
   "Kronus", 
   "So we have \"good\" forest fires, and \"bad\" forest fires? I'm not being sarcastic - are there times when fires in isolated areas are allowed to burn? \n\n \n Before the Smokey the Bear era, forest would burn every few years. This would clean up the dead wood that had accumulated over those years. There wouldn't be that much, so the fire would be relatively weak, and generally you'ld find that healthy trees wouldn't be affected at all. Those are \"good\" forest fires.\n \n Excessive fire suppresion has left many forests with so much deadwood and underbrush that when a fire starts, it burns incredibly hot and fast, destroying even healthy trees. That's a \"bad\" fire. \n \n Unfortunatly, so much forest is now prone to \"bad\" fires that there's no way to clear them out through manual means, even if you threw a ton of money at the problem. All we can do at this point is figure out if homes or people are at risk, and if they aren't let the forest burn. I assume the local fire chiefs make that call, but I'm not sure. If you're really curious google for it a bit, I'm sure the info is out there.", 
   {}, 
   60054, 
   null, 
   1090991340.0
  ], 
  [
   60067, 
   null, 
   "Duo_Maxwell", 
   "Adding to Kronus's little ecology lesson: \n \n Fire is a natural cycle of the forest. Fire eliminates weaker organisms, while removing underbrush (dead branches, leaves, twigs, lots of dead organic manner from vegetation), and creating fertilizer for the remaing organisms. Also, many plant seeds are designed to germinate after a prolonged exposure to a natural fires, not fires that burn at abnormally and unnatural heats. By removing fire we remove propagation of species. The public is so used to always open parks that it demands constant fire suppression, creating unnatural conditions that are asking for disaster. Lack of education is screwing everyone, but that is not a new concept either. \n \n The only way to change this is to radically change the public's perception of the forests and increase education.", 
   {}, 
   60057, 
   null, 
   1090993740.0
  ], 
  [
   60090, 
   null, 
   "sinjin", 
   "For years our fire suppression policies were in place to protect the interests of logging companies not the public or environment. Logging roads contribute to stream degradation and the resulting loss of fish and species dependent on those fish. Nothing Kronus has stated is in error.", 
   {}, 
   60067, 
   null, 
   1091032080.0
  ], 
  [
   60114, 
   null, 
   "georged", 
   "Adding to Kronus's little ecology lesson: \n \n Fire is a natural cycle of the forest. Fire eliminates weaker organisms, while removing underbrush (dead branches, leaves, twigs, lots of dead organic manner from vegetation), and creating fertilizer for the remaing organisms. Also, many plant seeds are designed to germinate after a prolonged exposure to a natural fires, not fires that burn at abnormally and unnatural heats. By removing fire we remove propagation of species. The public is so used to always open parks that it demands constant fire suppression, creating unnatural conditions that are asking for disaster. Lack of education is screwing everyone, but that is not a new concept either. \n \n The only way to change this is to radically change the publics perception of the forests and increase education.\n\n \n IMO special interests (money) will always overcome most objections from our primarily apathetic and sadly undereducated public. What conservation efforts we do see are normally the result of lawsuits by special interest conservation groups. A majority of our politicians run on money and power with the interests of their constituents running dead last. Until the system changes, with voters taking an interest in who they elect without being force-fed heavy money machine candidates, I don't see any change in our policies of catering to those who like easy access to the picnic tables, sanitary facilities, cleared areas to ensure reception of 'the big game' and fire road access (PC for logging roads) for their destructive toys while enjoying the 'solitude' of the great outdoors. The last time I drove through a state park it looked like a used RV/camper lot with a noise level from TV/music that defied conversation. I would see attempts at conservation education at that level as fruitless.", 
   {}, 
   60067, 
   null, 
   1091047800.0
  ], 
  [
   60141, 
   null, 
   "jerichoholic104", 
   "50 changes to environmental policy \n \n * Dramatically stepping up drilling for oil and natural gas on public\n land.\n \n * Loosening environmental restrictions on logging and mining on\n federal property.\n \n * Easing rules that require environmental impact assessments before\n thinning national forests, starting certain military activities such\n as bombing practice and building major transportation projects such\n as airports or highways.\n \n * The Bush administration is cleaning up 31 percent fewer Superfund\n sites per month than the Clinton administration did, and polluters\n are paying 64 percent less in fines per month than they did during\n the late 1990s, according to a Knight Ridder analysis of settlements\n published in the Federal Register.\n \n * Rejecting a worldwide treaty to curb global warming and pushing a\n comprehensive energy plan that stresses reliance on fossil fuels,\n which cause global warming and air pollution.\n \n * Proposing to weaken the cornerstone air and water pollution laws\n enacted in the late 1960s and early 1970s.\n \n Go toBush Greenwatch for more on the environmental misdeeds of the President.", 
   {}, 
   60114, 
   null, 
   1091057940.0
  ], 
  [
   60167, 
   null, 
   "Duo_Maxwell", 
   "Georged:\n \n \nIMO special interests (money) will always overcome most objections from our primarily apathetic and sadly undereducated public.\n\n \n Welcome to the world of Capitalism. :xbanghead \n \n \nWhat conservation efforts we do see are normally the result of lawsuits by special interest conservation groups. A majority of our politicians run on money and power with the interests of their constituents running dead last.\n\n \n Which is a primary reason this country has so many problems. Democracy shemocracy! Percisely why money must be removed from politics as well as lobbyists from corporations. \n \n \n\n Until the system ... the great outdoors.\n \n \n No argument there. \n \n sinjin: Not so entirely sure about that. Haven't many forests that had logging banned still had major fire suppression acts for many years, and likewise many went up in unnaturally large infernos? I never said anything he said was wrong.", 
   {}, 
   60141, 
   null, 
   1091070060.0
  ], 
  [
   60199, 
   null, 
   "georged", 
   "\n Which is a primary reason this country has so many problems. Democracy shemocracy! Percisely why money must be removed from politics as well as lobbyists from corporations. \n \n\n \n Under our system, that's not going to happen. When you unravel the history of residential development, readily available surface water was the commanding factor for initial settlement in most locales. Technical advancements then allowed drilled water wells to be common enough that surface water fed by underground water tables or snow runoff (most wetland areas) became more of an annoyance than an asset. Filling them in, the Everglades are probably the most graphic example, and damming surface flow rivers became the name of the game. What made that development feasible was federal infrastructure planning in the form of dams, highways, utilities and communications. Once the federal government had used public money to design infrastructure requirements, it was a simple matter for private industry to lobby state governments for road construction and even cheaper to buy county officials for the purpose of rezoning targeted developments with mixed-use or pure residential zoning, where taxation levels would force farming or ranching operations into a sell position.\n \n Since WW11, the game has became much more sophisticated. The current trend is for developers to secure wetland areas and 'trade' them to the federal government for vast acreage adjacent to the wetlands. Forests? For decades interested parties have used Smokey The Bear to log just about anywhere they want without spending one cent for property purchases. That's a simple matter of having an in-your-pocket politician nudge the proper bureaucrats into declaring an area of timber the market is crying for to be declared a fire hazard, potential bark beetle infestation or endangering residences because people were stupid enough to build on a flood plain in the first place. So much for Steelhead and Salmon runs, spring runoff, fires that rejuvenate forests and all the other normal conditions that renew those resources. \n \n Face it; the general population and special interests want to use natural resources for their own purposes, and that doesn't include retaining them in a natural state.", 
   {}, 
   60167, 
   null, 
   1091114700.0
  ], 
  [
   60212, 
   null, 
   "sinjin", 
   "sinjin: Not so entirely sure about that. Haven't many forests that had logging banned still had major fire suppression acts for many years, and likewise many went up in unnaturally large infernos? I never said anything he said was wrong.\n\n \n I didn't mean to suggest you were at odds with Kronus. As far as fires in areas with logging bans I don't know. It is conceivable that the fire suppression strategies were identical but for other reasons like park status or ?. I know the fires last year in Big Bear, CA were made worse by the tremendous amount of fuel in the understory but an additional contributing factor was the fact that those mountains had been previously logged and the second/third growth was much denser than the original virgin forest. No longer a commercial forest, the residents were against thinning the trees for years.", 
   {}, 
   60167, 
   null, 
   1091120220.0
  ], 
  [
   60237, 
   null, 
   "georged", 
   "I know the fires last year in Big Bear, CA were made worse by the tremendous amount of fuel in the understory but an additional contributing factor was the fact that those mountains had been previously logged and the second/third growth was much denser than the original virgin forest. No longer a commercial forest, the residents were against thinning the trees for years.\n\n \n Mother Nature occasionally reminds us of the fact that we aren't totally in charge.", 
   {}, 
   60212, 
   null, 
   1091128380.0
  ], 
  [
   60306, 
   null, 
   "marc9000", 
   "50 changes to environmental policy \n \n * Dramatically stepping up drilling for oil and natural gas on public\n land.\n \n * Loosening environmental restrictions on logging and mining on\n federal property.\n \n * Easing rules that require environmental impact assessments before\n thinning national forests, starting certain military activities such\n as bombing practice and building major transportation projects such\n as airports or highways.\n \n * The Bush administration is cleaning up 31 percent fewer Superfund\n sites per month than the Clinton administration did, and polluters\n are paying 64 percent less in fines per month than they did during\n the late 1990s, according to a Knight Ridder analysis of settlements\n published in the Federal Register.\n \n * Rejecting a worldwide treaty to curb global warming and pushing a\n comprehensive energy plan that stresses reliance on fossil fuels,\n which cause global warming and air pollution.\n \n * Proposing to weaken the cornerstone air and water pollution laws\n enacted in the late 1960s and early 1970s.\n \n Go toBush Greenwatch for more on the environmental misdeeds of the President.\n\n \n Lists such as these always seem to read like a vendetta against individuals or groups, rather than constructive, positive things one could expect from someone claiming to represent warm, heartfelt feelings about cleanliness. Why does discussion about cleanliness seem so rude and cold? I think it's because these websites are quick to point to rules and regulations, as long as they themselves don't have to shoulder any of the costs associated with them, be it a dollar cost or liberty cost. Back in the 90's, environmentalists worked hard to keep new power plants from being built in California. While they were probably willing to spend a little more for their electric bills, the construction they helped thwart negatively affected others lives in a big way, leading to a superfiscial environmental victory for them, and a boost for their ego. Then, only a few years later when California had it's power outages, even those environmentalists, and those who supported them, had lights that didn't work, food spoiled it THEIR refrigerators, THEY had accidents in intersections with dead traffic lights. They would never admit that they made mistakes, but Ahhnold won for a reason. Nothing's been in the news lately about California's power problems, I suspect they're getting the voids filled from adjoining states. I wonder how long that band-aid will last.\n \n Often, benefits of a government regulation are immediately visible, while the costs and victims are invisible, at least for the present.\n \n Environmentalism is fine for those who want it. It would be nice to see something positive from them. Not \"look at what we accomplished with all this tax money, on someone else's private property\". How about \"look at what we accomplished on our OWN property, with our OWN money. Different people have different definitions of \"cleanliness\".", 
   {}, 
   60141, 
   null, 
   1091155020.0
  ], 
  [
   60310, 
   null, 
   "georged", 
   " Nothing's been in the news lately about California's power problems, I suspect they're getting the voids filled from adjoining states. I wonder how long that band-aid will last.\n\n \n No thread hijack, but CA just incurred $15-billion in 'general revenue' bond debt to make ends meet. State taxation debt-per capita has skyrocketed in many states as the feds require more and more precious cash flow to maintain their agendas and reduce revenue sharing. The states have also learned taxpayers are truly naive.", 
   {}, 
   60306, 
   null, 
   1091156820.0
  ], 
  [
   60316, 
   null, 
   "Duo_Maxwell", 
   "I didn't mean to suggest you were at odds with Kronus. As far as fires in areas with logging bans I don't know. It is conceivable that the fire suppression strategies were identical but for other reasons like park status or ?\n\n \n Or public demand for such areas, of course, this will be the minority of forests. However, we cannot completely discount the public's affect on policy. After all, it was the public who gave the support to stop early ANWR drillings.\n \n \nThen, only a few years later when California had it's power outages, \n\n \n Do you know who Ken Lay and Enron are?", 
   {}, 
   60212, 
   null, 
   1091161620.0
  ], 
  [
   60418, 
   null, 
   "marc9000", 
   "Ken Lay & Enron were treated with different standards than Carol Browner (Carol Brownout :p ) & the EPA, not only by the authorities, but by the news media.", 
   {}, 
   60114, 
   null, 
   1091224740.0
  ], 
  [
   60474, 
   null, 
   "Duo_Maxwell", 
   "if you could be so kind, could you explain the difference as well as the current case aganist Enron.", 
   {}, 
   60418, 
   null, 
   1091268840.0
  ], 
  [
   60494, 
   null, 
   "marc9000", 
   "You could probably educate me on the finer details of the Enron bankruptcy. I don't take that much interest in it because I didn't do business with that private company. Since our government is so involved with private business, it only make sense that a major business failure has political ties. It will get plenty of scrutiny, and justice will be done with the exception of a few rich guys walking. It's nothing new.\n \n As far as the difference goes, I have much more than one paragraph of information about Carol Browner and the 1990's EPA. Just keep your eye on the environmental forum, we have nothing but time, it needs to go with the flow of what everyone wants to see here. You'll soon have more information to more clearly see the differences between private business and govenment bureaucracies. ;)", 
   {}, 
   60114, 
   null, 
   1091291520.0
  ], 
  [
   60552, 
   null, 
   "Duo_Maxwell", 
   "so no, really you can't explain it.", 
   {}, 
   60494, 
   null, 
   1091336400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Will Bush do anything to help the environment?", 
  "url": "http://www.4forums.com/political/environmental-debates/2583-will-bush-do-anything-help-environment.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 2583, 
  "discussion_files": [
   [
    "24118.html", 
    "http://www.4forums.com/political/environmental-debates/2583-will-bush-do-anything-help-environment-print.html"
   ], 
   [
    "24119.html", 
    "http://www.4forums.com/political/environmental-debates/2583-will-bush-do-anything-help-environment-2-print.html"
   ]
  ], 
  "identifier": 2583
 }
]