[
 [
  [
   54526, 
   null, 
   "Ukrainian", 
   "Hey. I am not a gay, and I believe that homosexuality is morally and socially wrong. I have some reasons. I know there were posts in this subtopic with people giving reasons against being homosexual. I need something like that, but I can't find it. I need it in order to translate and post on a russian site. Sorry, maybe I wasn't looking in the right places, but if you can help me, then please, I'd appreciate it.", 
   {
    "post_info": {
     "post_title": "Help me with some reasons against homosexuality"
    }
   }, 
   null, 
   null, 
   1087594800.0
  ], 
  [
   54598, 
   null, 
   "Tastyfish", 
   "Well, good to see the 'I'm not gay' bit before stating that you beleive it is morally and socially wrong, because, with that bit there you almost fooled me there emoticon_rolleyes \n \n Anyway, main justifiable reasons...\n \n The bible says it is wrong - pretty much in the clear here, some debate whether all the bits people quote as refering purely to homosexuality (unlikely, fair bit is mistrasnlation and associatations with other things but then again, some is probably definitely homophobic). Again, you can argue how relevant it really is today anyway and there is also a lot of other crazy laws in there. But the Bible is generally quite clear on the matter that it is a Bad Thing at least somewhere in there (both old and new testaments if it matters to you).\n \n That is really about it properly, the rest is a bit more debatable and is full of squewed stats and opinions from both sides half the time, but it generally boils down to:\n \n Increased chance of disease - (at least in male/male relationships, female/female is probably lower), various reasons from the fact that AIDS entered the homosexual popualtion first and was ignored while it spread and so affected a large number of a small minority, spread a little through the straight population but not as fast (as condoms would have been used more and fewer people have it). Also some issues assocaited with anal sex in general, though these are reasons not exclusive to gays by any means.\n \n Increased violence in gay couples - again debatable, partly because the realtionships can be between two men where you would expect a slightly higher rate of violence and also because other (unrelated studies) show that a massive amount of male/female domestic violence goes unreported or is misinterpretted. However you have to look at the stats and say that this is still a very small minority of people out of a majority, is it really an issue worth legislating over - being gay doesn't make you violent, prison stats would reflect this. \n \n Decreased life expectancy - not really sure whether I count this one, but have put it in for good measure. Is debatable as the studies posted here are horribly flawed (one has actually nothing to do with it almost) and involve bad data gathering (like just using obituaries from the back of some gay magazines). Not sure what it is like adjusted for the prevelance of AIDS either amoung the population. However it seems mental problems are slightly more common like depression, again though this leads to some odd conclusions - either it is not actually the being gay that is causing this but instead the lack of acceptance, etc or it is actually being gay that makes you susepatable to depression and imbalance but that would mean it is a neurological condition and then naturally occuring. No proof for either of these really I've seen.\n \n Relationships don't last as long - again another maybe, due to bad sampling of behalf of the study that came up with the conclusion. However I could see the general lack of children and/or marriage as contributing to this. So while true can not really be used as a reason against gay adoption/IVF or marriage in my opinion at the moment until a decent study is done.\n \n Things that aren't issues but still get brought up, don't use these.\n \n Its a disorder therefore bad - it has to be bad to be a disorder, circular argument based around two different defintions of disorder (i.e uncommon and the real clinical one)\n \n Gays are more likley to use drugs - statiscally yes, but irrelevant, being gay doesn't make you use drugs or really even predispose you to being effected by them. Could be due to a wide range of data collecting errors (i.e using 'gay clubs and bars as a population sample' and the age of finding people).\n \n Ick, its nasty - Seems to be one of the more common basis of some beleifs as well combine with religion. Well, so says you anyway, I would hazard a guess that bisexuals and homosexuals do not agree with you here. I don't like anal sex and think its a bit gross, but I hardly think it is a reason to legislate against it.\n \n It not natural - well, it seems it is. Lots of reports, thousands of hours of video footage and a gay gene in Drospholia , homosexuality does occur naturally. In humans again its still not known, seems there is no gay gene, but that doesn't make it genetic as there are very few genes for something specific, most stuff is based off a large number all interacting to various amounts. There is also ways that homosexuality can be made evolutionarily favourable (Basically it has another effect in one of the sexs that makes up for the other not reproducing. Male homosexuality woud make sense in a primate hareem system where few of the males mate anyway but all the females do, an advatage to females would be of more benefit that males.)\n \n If everyone were gay, the human race would die out - well, duh. If everyone was a women we would still die out. \n \n Sodomy is as addictive as heroin - getting silly now. Just no. Seen it brought up here before though, so included it for some light relief.", 
   {}, 
   54526, 
   null, 
   1087666080.0
  ], 
  [
   54723, 
   null, 
   "Ukrainian", 
   "Well, good to see the 'I'm not gay' bit before stating that you beleive it is morally and socially wrong, because, with that bit there you almost fooled me there emoticon_rolleyes \n\n \n Hi. It's funny. I don't understand how I fooled you?? :)\n \n \nSodomy is as addictive as heroin - getting silly now. Just no. Seen it brought up here before though, so included it for some light relief.\n\n \n Ahh... so what does this mean?\n \n By the way, thanks for reasons. I read them. It seems, that there are not strong enough reasons besides the Bible... and for non-believers it is not a reason. So for them, it's simply ok?", 
   {}, 
   54598, 
   null, 
   1087762380.0
  ], 
  [
   54725, 
   null, 
   "Tastyfish", 
   "You're right, there isn't realy any strong non religious reasons against, that's why there is so much debate. Add in the fact that a lot of the 'anti' research is carried out by religious organisations or by people with strong religious links and it gets even harder to come to a real debate (as fixing stats, making stuff up and misinterpretting data just weakens an argument).\n \n As for the wierd addiction thing enjoy, don't post anything there though as bringing back really old threads is frowned upon. Is just the weirdest thing related to it I have seen here or anywhere else.", 
   {}, 
   54723, 
   null, 
   1087763340.0
  ], 
  [
   54832, 
   null, 
   "mana'ia", 
   "Ukrainian\n \n Don't believe Tastyfish. They just dismiss everything that they can't refute or try to throw in religion when they see that they are not capable of refuting.\n There are plenty of reason why homosexuality is not socially accceptable.\n \n One it distorts family values\n \n It changes definitions of marriage\n \n It will open floodgates for other behavior\n \n it is not genetic. They only speculate that.\n \n It is an unhealthy sexual activity esecially for men.\n \n People can change\n \n It promotes other bad behavior and makes terms such as deceny, obscene, and profane void if we are forced to accept it.\n \n \n Morally depends on your morality. I can't tell you why it's morally unacceptable because that is based upon morals.\n \n \n Also read the other threads about this. They have arguments on both sides.", 
   {}, 
   54526, 
   null, 
   1087847640.0
  ], 
  [
   54880, 
   null, 
   "jitobear", 
   "Ukrainian\n \n Don't believe Tastyfish. They just dismiss everything that they can't refute or try to throw in religion when they see that they are not capable of refuting.\n There are plenty of reason why homosexuality is not socially accceptable.\n \n One it distorts family values\n \n It changes definitions of marriage\n \n It will open floodgates for other behavior\n \n it is not genetic. They only speculate that.\n \n It is an unhealthy sexual activity esecially for men.\n \n People can change\n \n It promotes other bad behavior and makes terms such as deceny, obscene, and profane void if we are forced to accept it.\n \n \n Morally depends on your morality. I can't tell you why it's morally unacceptable because that is based upon morals.\n \n \n Also read the other threads about this. They have arguments on both sides.\n\n \n M kid's has a mentor. He is gay. He is also\n \n Exceedingly generous\n \n The model of patience\n \n An avid volunteer\n \n Big fan of kids\n \n One of the best friends I have ever had \n (helped me by fixing my car and lending me one of his while he did, helped me get a second job, works on projects around my house and yard)\n \n Strict with my son in that he will not tolerate him misbehaving or talking ugly\n \n Committed to his partner (same person for 15 years)\n \n Honest\n \n Kind\n \n Loving\n \n Supportive\n \n hmmmm\n \n I think those are morals that I can live with - much more so than those who spew hate rheteric around on chat boards....", 
   {}, 
   54832, 
   null, 
   1087860540.0
  ], 
  [
   54937, 
   null, 
   "Kronus", 
   "Alright, Mana'ia, let's take a look at these reasons of yours.\n \n \n It is not genetic. They only speculate that.\n People can change\n These don't mean something's bad. They have no bearing on morality at all.\n \n It changes definitions of marriage\n No. Legislaters change the definition of civil marriage, if they see fit, and religious leaders change the defintion of religious marriage, if they see fit.\n \n It is an unhealthy sexual activity esecially for men.\n No. I'm not even sure where you're going with this. Anal sex is safe if you use plenty of lube and are careful, and of course hets have anal sex too. As for aids, it's not being gay that gives it to you, it's unsafe sex, and that applies to gays and hets.\n \n It will open floodgates for other behavior\n People have been gay as long as there have been people. If the floodgates were going to open, they would have by now.\n \n One it distorts family values\n My family values are love, honesty, and respect. I shudder to think what your values are if someone else being gay can distort them.\n \n It promotes other bad behavior and makes terms such as deceny, obscene, and profane void if we are forced to accept it.\n What can I say but, deal. As we mature as a society we slowly learn that groups that used to scare us with their differences are really all that different after all. People used to think it was proper for blacks to be slaves. People used to think women were too stupid to vote. Some people think that homosexulality will lead to moral collapse. Fortunately, those people are beconing scarcer.", 
   {}, 
   54880, 
   null, 
   1087880160.0
  ], 
  [
   54942, 
   null, 
   "Tastyfish", 
   "Ukrainian\n Don't believe Tastyfish. They just dismiss everything that they can't refute or try to throw in religion when they see that they are not capable of refuting.\n There are plenty of reason why homosexuality is not socially accceptable.\n \n Indeed don't beleive me at all, I am a sneaky guy who seeks nothing less than the destruction of Americas way of life at the hands of facts and reliable information. Being the devil I am I also don't believe hiding religoius opinions behind dodgy research and blatant lies by unbiased people. \n \n \n\n One it distorts family values\n \n I.e by preaching that homosexuality is an acceptable practice and teaching people that there is nothing really wrong with having two parent of the same sex and that it is wrong to discriminate against the child for this reason. But so what if you actually don't see a problem with homosexuals i the first place, just circular reasoning - 'gays are bad, and encouraging this behaviour makes people think it is accpetable, but it is bad, so this is bad'. When is bullying ever acceptable?\n \n \n\n It changes definitions of marriage\n \n Again, so what, the defintion of marriage is now two people who love each other declaring their intention to live with each other permantantely. Unless you are against hmosexuality in general there is no problem with this.\n \n \nIt will open floodgates for other behavior\n All things have top be considered by a case by case study, if something doesn't cause harm to the public in general then it isn't going to open the floodgates for behaviour that will. Despite what mana'ia would have you believe, there is no way homosexuality will lead to legalised peadophilia. At least no more than being able to sell beef in a market will lead to the legalisation of selling human flesh to the public for the purposes of consumption.\n \n \n\n it is not genetic. They only speculate that.\n So what? Everything good has to be genetic, I do Molecular Genetics and Biotech and I know this to be false. Anyway, it is speculated to be genetic for good reason. It is not a concious choice as has been observed in a massive amount of natural observations of animals\n \n \n\n It is an unhealthy sexual activity esecially for men.\n So you admit that lesbianism is perfectly OK? If it doesn't impact on anyone else how is this a problem? Is also no different from anal sex in heterosexual couples, should this be banned too?\n \n \n\n People can change\n If conned into beliving they have to, what is the point in making people go through a lot of psychological trauma if you could just accept them as they were in the first place? Should Goths and Punks also be forced into programs that will make the same as the mainsteam population?\n \n \n\n It promotes other bad behavior and makes terms such as deceny, obscene, and profane void if we are forced to accept it.\n Completely personal opinion, I find your views far more against comon decency than homosexual behaviour, but am I forcing you to become gay? No one is advocating being able to have any kind of sex in public, it is all between consenting adults in the privacy of their own home. Legalising gay marriage/accepting homosevuality will not mean everyone can just **** in the street or have sex in a strangers house, this is just blatant idiocy.\n \n \n\n Morally depends on your morality. I can't tell you why it's morally unacceptable because that is based upon morals.\n Morals are based off social behaviour, if something doesn't benefit the society in general (like intolerance, not just benefit but more doesn't harm society) then there is really no problem using the general system we use today. Bring religion inot it and it is a whole different matter, but then we don't apply one religion to everyone. Morals change, people opposed interacial marriages on the grounds of morality, and slavery and genocide was accepted in some socities- should we be bound to follow old moralities for all time?\n \n \n\n Also read the other threads about this. They have arguments on both sides.\n But they generally go like this sadly, there is really little reason other than the old cultural reasons and religions to oppose it. One possible reason that I did miss off before is that it may lead to a view that all old values are wrong and outdated. But again I would counter this by saying that these kind of viewpoints have to be considered in a case by case method. At some points it may have been beneificial to opose homosexuality (in helping keep other memes functioning, memes that possesed this trait could overrule other memes that allowed it) but then there is a lot of things that were once acceptable that are now not, being a slave to old reasoning leads to cultural stagnation and a more conflict as a beneficial new idea is violently oppsed to an outdated old one. If the old idea is better then the new idea wil not be accepted.\n \n I challenge you Mana'ia to provide a counter argument to all my points that doesn't rely on the view that homosexuality is bad in the first place. No bible quotes, circular reasoning or links to poorly conducted studies (we will look at the methods used laterafter you ahve posted them, but look at them yourself critically rather than posting wihtout trying to find as many possible holes yourself and admitting them, lets do this properly and scientifically)", 
   {}, 
   54832, 
   null, 
   1087881480.0
  ], 
  [
   54988, 
   null, 
   "Phunting", 
   "And to add, everyones favourite reason to restrict homosexual marriage:\n \n 'Homosexuals have the same rights as me. I can marry someone of the opposite sex, but not someone of the same sex. Same rights'\n \n Yes I know this is a mind numbing logical fallicy, and yet enough people seem to espouse it. Of course in essence it is saying 'everyone has the right to behave exactly as I do, but it should be illegal if anyone ever does things that are different to me. But we still would have the same rights.'", 
   {}, 
   54942, 
   null, 
   1087920180.0
  ], 
  [
   54994, 
   null, 
   "unkerpaulie", 
   "And to add, everyones favourite reason to restrict homosexual marriage:\n \n 'Homosexuals have the same rights as me. I can marry someone of the opposite sex, but not someone of the same sex. Same rights'\n \n Yes I know this is a mind numbing logical fallicy, and yet enough people seem to espouse it. Of course in essence it is saying 'everyone has the right to behave exactly as I do, but it should be illegal if anyone ever does things that are different to me. But we still would have the same rights.'\n\n if a hetero man can marry a woman, and a homo man can marry a woman, then technically they have the same rights! :p", 
   {}, 
   54988, 
   null, 
   1087921740.0
  ], 
  [
   55015, 
   null, 
   "jitobear", 
   "if a hetero man can marry a woman, and a homo man can marry a woman, then technically they have the same rights! :p\n\n \n No. A hetero man can marry somebody he loves and is sexually attracted to. Or maybe you don't think love and sex are needed for a healthy marriage?", 
   {}, 
   54994, 
   null, 
   1087933140.0
  ], 
  [
   55020, 
   null, 
   "unkerpaulie", 
   "No. A hetero man can marry somebody he loves and is sexually attracted to. Or maybe you don't think love and sex are needed for a healthy marriage?\n\n the question was that of rights. the law doesnt measure love and emotions, just actions. you musta missed the smiley with the tongue stickin out", 
   {}, 
   55015, 
   null, 
   1087934280.0
  ], 
  [
   55027, 
   null, 
   "Jaaaman", 
   "Homosexual acts are intrinsically disordered and therefore wrong. Such acts like mutual masturbation, and anal / oral sex (these are actually variations of mutual masturbation) are abusive and utilitarian as each of the participant's conscious desiring self is merely using / instrumentalizing his and his partner's body to achieve a certain emotional & psychological experience (an orgasm). The partners mutually use (abuse) each other. The fact that it is consensual is irrelevent. \n While sexual intercourse is for married spouses to give themselves to each other in conjugal love which is both procreative and unitive, homosexual sex on the contrary merely simulate intercourse as they lack the sexual complementarity and is completely closed to the procreative & unitive significance of the sex act. Thus homosexual acts are not loving acts but utilitarian and hedonistic (pleasure seeking). These acts are thus degrading to the dignity of human persons, who are to be loved and not used and are therefore morally wrong.", 
   {}, 
   55020, 
   null, 
   1087935780.0
  ], 
  [
   55034, 
   null, 
   "Waxy", 
   "Homosexual acts are intrinsically disordered and therefore wrong. Such acts like mutual masturbation, and anal / oral sex (these are actually variations of mutual masturbation) are abusive and utilitarian as each of the participant's conscious desiring self is merely using / instrumentalizing his and his partner's body to achieve a certain emotional & psychological experience (an orgasm). The partners mutually use (abuse) each other. The fact that it is consensual is irrelevent. \n While sexual intercourse is for married spouses to give themselves to each other in conjugal love which is both procreative and unitive, homosexual sex on the contrary merely simulate intercourse as they lack the sexual complementarity and is completely closed to the procreative & unitive significance of the sex act. Thus homosexual acts are not loving acts but utilitarian and hedonistic (pleasure seeking). These acts are thus degrading to the dignity of human persons, who are to be loved and not used and are therefore morally wrong.\n\n \n Do you have kids Jaaaman?\n \n If not, I assume you're a virgin, as having intercourse with your wife for any purpose other than procreation would be degrading to you both, utilitarian, and hedonistic, not to mention just plain icky.\n \n If you're married, I feel very sorry for your wife (and you actually).\n \n I sometimes can't believe what I read on this site. If nothing else, it's an eye opener.\n \n Waxy", 
   {}, 
   55027, 
   null, 
   1087937280.0
  ], 
  [
   55049, 
   null, 
   "Tastyfish", 
   "Homosexual acts are intrinsically disordered and therefore wrong.\n\n All disorder is bad, like heating food? What the hell is disordered about homosexual acts, what do you even mean by disordered?\n \n \n\n Such acts like mutual masturbation, and anal / oral sex (these are actually variations of mutual masturbation) are abusive and utilitarian as each of the participant's conscious desiring self is merely using / instrumentalizing his and his partner's body to achieve a certain emotional & psychological experience (an orgasm).\n Umm, you haven't actually ever done this have you - the person carrying out the act is not the one that benefits the most. How can it be 'abusive and utilitarian' if it is both consensual, desired and done as an act of love. \n \n \n\n The partners mutually use (abuse) each other. The fact that it is consensual is irrelevent. \n Shouldn't the point its consensual mean that the fact it is 'abusive' (in what way, can't see any harm being caused, which would be the conventional defintion of abuse).\n \n \n\n While sexual intercourse is for married spouses to give themselves to each other in conjugal love which is both procreative and unitive, homosexual sex on the contrary merely simulate intercourse as they lack the sexual complementarity and is completely closed to the procreative & unitive significance of the sex act. Thus homosexual acts are not loving acts but utilitarian and hedonistic (pleasure seeking). These acts are thus degrading to the dignity of human persons, who are to be loved and not used and are therefore morally wrong.\n Why is it not unitive, it is fully exactly the same function of cementing a relationship. The fact it does not result in children is completly irrelevant. \n \n All this is clearly just opinion, fair enough I can respect you not having sex except in the circumstances you mention. But why should you pure opinion be enforced upon people who do not hold it, you are not affected by their actions.\n \n So from this we can add another against reason - only sex that results in children is acceptable. But don't think I really need to argue agenst this.", 
   {}, 
   55027, 
   null, 
   1087939860.0
  ], 
  [
   55081, 
   null, 
   "mana'ia", 
   "M kid's has a mentor. He is gay. He is also\n \n Exceedingly generous\n \n The model of patience\n \n An avid volunteer\n \n Big fan of kids\n \n One of the best friends I have ever had \n (helped me by fixing my car and lending me one of his while he did, helped me get a second job, works on projects around my house and yard)\n \n Strict with my son in that he will not tolerate him misbehaving or talking ugly\n \n Committed to his partner (same person for 15 years)\n \n Honest\n \n Kind\n \n Loving\n \n Supportive\n \n hmmmm\n \n I think those are morals that I can live with - much more so than those who spew hate rheteric around on chat boards....\n\n \n So all gay people are like that? He's like that because he's gay? There are criminals in prison that were perfect except for one moment in time they snapped did something wrong and then went on a good life like that.\n \n The problem wiht your logic is that if someone is gay then they're good because homosexuality made them good.\n \n I have an alcoholic uncle that is everything that you describe your gay mentor. He's good despite the alcoholism. I love my alcoholic uncle but hate the alcoholism.", 
   {}, 
   54880, 
   null, 
   1087954620.0
  ], 
  [
   55086, 
   null, 
   "mana'ia", 
   "Alright, Mana'ia, let's take a look at these reasons of yours.\n\n \n \n\n It is not genetic. They only speculate that.\n People can change\n These don't mean something's bad. They have no bearing on morality at all.\n\n GAys claim all the time they didn't choose to be taht way. Well if it isn't genetic then how did it happen? Probably socialize or just a predisposition. Either way there gentics have not confined them to homosexuality. ALso morals are subjective standard. What is moral here is not moral in JOrdan, Nigeria, China, etc.\n \n \n \n\n It changes definitions of marriage\n No. Legislaters change the definition of civil marriage, if they see fit, and religious leaders change the defintion of religious marriage, if they see fit.\n\n Yes they can change the definition. WE don't wnat them to and that is the point. It will chagne the institution that is the foundation of society. \n \n \n \n\n It is an unhealthy sexual activity esecially for men.\n No. I'm not even sure where you're going with this. Anal sex is safe if you use plenty of lube and are careful, and of course hets have anal sex too. As for aids, it's not being gay that gives it to you, it's unsafe sex, and that applies to gays and hets.\n\n It can be safe but it is high risk even among heterosexuals. There is a high transmission of STDs as well. TAHt is why they won't allow men invovled in homosexuality to donate blood for 5 yrs after their last activity.\n \n \n \n\n It will open floodgates for other behavior\n People have been gay as long as there have been people. If the floodgates were going to open, they would have by now.\n\n The behavior wasn't legally recognized. Never in the history of civilization has homosexuality been cosnidered equal to heterosexuality. Never has it received government recognition. Why is homosexuality different than any other disorder or behavior? Why do homosexuals have privledges that nudists, polygamists, cannibals, and others do not?\n \n \n\n One it distorts family values\n My family values are love, honesty, and respect. I shudder to think what your values are if someone else being gay can distort them.\n\n My family values includes that also it includes a family is mother/father and husband wife. That is my family values what is yours? Husband/husband? Why not husband/husband/wife? Or Husband/husband/boyfriend? Mother/mother/lover?\n \n \n\n It promotes other bad behavior and makes terms such as deceny, obscene, and profane void if we are forced to accept it.\n What can I say but, deal. As we mature as a society we slowly learn that groups that used to scare us with their differences are really all that different after all. People used to think it was proper for blacks to be slaves. People used to think women were too stupid to vote. Some people think that homosexulality will lead to moral collapse. Fortunately, those people are beconing scarcer. \n\n Also Rome practiced homosexuality and every other society that has ever practiced it has fallen.\n \n People use to think smoking was fine as well. Some people think smoking weed is not bad or immoral. Does taht make them right becaue others were wrong?\n \n We have come to understrand all people are equal. However we have not embraced all behavior.\n \n We embrace all middle eastern people but not their polygamy. We embrace all vietnamese but not their sex with minors. Why? We have differentialted between them and their culture or behavior.", 
   {}, 
   54937, 
   null, 
   1087955400.0
  ], 
  [
   55088, 
   null, 
   "mana'ia", 
   "\n I challenge you Mana'ia to provide a counter argument to all my points that doesn't rely on the view that homosexuality is bad in the first place. No bible quotes, circular reasoning or links to poorly conducted studies (we will look at the methods used laterafter you ahve posted them, but look at them yourself critically rather than posting wihtout trying to find as many possible holes yourself and admitting them, lets do this properly and scientifically)\n\n Let's do. Tasty like I sadi you jsut dismiss all my posts insted of refuting them. I will refute your arguments when I ahve more time. Just read every signle post I have ever made and none of them use anything else but logic and science. I ahve never used relgion or scriptures to support my arguments. Show me one where I have used that and I will quit this forum.\n \n I have only challenged people's understanding of the scriptures never used them to support my arguments against a secular argument.", 
   {}, 
   54942, 
   null, 
   1087955700.0
  ], 
  [
   55098, 
   null, 
   "Tastyfish", 
   "And you have just dismissed mine, but I gave reasons. You have just ignored all my arguments against you points and focus on one topic that that isn;t really relevant. Ok, you don't use bible quotes I will concede this but others argueing against do and your objection to it is strongly based on your religion. Science and logic have very little to do with most of your posts, as I showed when arguing my points above, you are using circular reasoning (above in this thread) and poorly executed studies (in others).\n \n As for your arguements against Kronus' posts\n - Defintion of marriage: Doesn't change the existing definition of marriage in any meaningful way, heterosexual marriages are completely unaffected. Nor is marriage the foundation of our society, at the basis of it is self interest within a group, then the idea of trade and currancy. Marriage has very little to do with society as it is hardly as much an integral part as these and other things.\n \n - Risk is preventable, but fewer gay couples will take as much precautions as straight couples due to less chance of preganancy. It is no more unsafe than hetero anal sex, just less common.\n \n - Ancient Greece considered homosexual realtionships to be equal (and in some cases superior, due to their low opinion of women. Amoung warriors it was encouraged in some city states, as you found fight hardest with your lover at your side)\n \n - Homosexuallity is not harmful to others, unlike cannibalism or incest. Nudists can get married and can get married nude if they wish. Polygamy is an odd one that fundamentally has no real problems with it if it is truly consensual. \n \n - family values, I think you are confusing with the dictionary defintion of a family. So it is better in your opinion to have a hateful and abusive family rather than a single parent or a gay couple who love each other? Isn't this mentality far more erosive of family values?\n \n - Smoking is not illegal except in places where it can harm others passively, people have changed in the other way too, things that were considered a very bad thing are now tolerated and even encouraged to a degree (sex before marriage, inter racial marriages, women being as mentally capable as men). What is to day that homosexual realtion is not one of these things rather than the other?\n \n - Rome falling in anyway due to homosexuality shows complete ignorance, Rome fell to infighting within and aggressors from outside. Many cultures that oppose homosexuality are in decline or have disappeared, their attitudes towards this tpic have nothing to do with their rise or fall.\n \n - We don't embrace people's behaviour because it is harmful to others or oppresive, you can not class peadophilia and homosexuality as the same thing. There is nothing magic about behaviour that makes it intrinsically good oor bad, its that behaviours effect on others that counts.", 
   {}, 
   55088, 
   null, 
   1087959060.0
  ], 
  [
   55170, 
   null, 
   "Ukrainian", 
   "Homosexual acts are intrinsically disordered and therefore wrong. Such acts like mutual masturbation, and anal / oral sex (these are actually variations of mutual masturbation) are abusive and utilitarian as each of the participant's conscious desiring self is merely using / instrumentalizing his and his partner's body to achieve a certain emotional & psychological experience (an orgasm). The partners mutually use (abuse) each other. The fact that it is consensual is irrelevent. \n While sexual intercourse is for married spouses to give themselves to each other in conjugal love which is both procreative and unitive, homosexual sex on the contrary merely simulate intercourse as they lack the sexual complementarity and is completely closed to the procreative & unitive significance of the sex act. Thus homosexual acts are not loving acts but utilitarian and hedonistic (pleasure seeking). These acts are thus degrading to the dignity of human persons, who are to be loved and not used and are therefore morally wrong.\n\n Very good point.", 
   {}, 
   55027, 
   null, 
   1088003820.0
  ], 
  [
   55175, 
   null, 
   "Tastyfish", 
   "No it isn't, he is just using big words without paying any attention to their actual meaning, the whole thing is just saying \"I beleive gay sex is bad\" using more words badly.", 
   {}, 
   55170, 
   null, 
   1088004300.0
  ], 
  [
   55177, 
   null, 
   "Ukrainian", 
   "Do you have kids Jaaaman?\n \n If not, I assume you're a virgin, as having intercourse with your wife for any purpose other than procreation would be degrading to you both, utilitarian, and hedonistic, not to mention just plain icky.\n \n If you're married, I feel very sorry for your wife (and you actually).\n\n I don't understand what's your point. If he says that man and woman in marriage when having sex want and can please each other, because of how their bodies are made, then what's your problem with that, and what's that pity? Okay, I have a wife and we have sex. You feel sorry for me too? No, I don't have sex only to reproduce, sorry. It's a way to have pleasure and please your partner. Unlike in sex between same sex people. Yeah, someone mentioned, unless you use lost of lube, you can't make it (talking about anal sex), and right, one of them may have orgasm, but the other one will only be used, utilitized.", 
   {}, 
   55034, 
   null, 
   1088004420.0
  ], 
  [
   55182, 
   null, 
   "Ukrainian", 
   "No it isn't, he is just using big words without paying any attention to their actual meaning, the whole thing is just saying \"I beleive gay sex is bad\" using more words badly.\n\n Well, I think he is actually right, because there is no satisfaction in anal sex for man (being the passive partner). Without additional vaginal stimulation even a woman won't have orgasm from anal sex, moreover a man will not.", 
   {}, 
   55175, 
   null, 
   1088004900.0
  ], 
  [
   55186, 
   null, 
   "Tastyfish", 
   "But with your bias you are missing the point, surely if you lve someone you do things to make them happy, and Jaaaman refers to all mutual masterbation, not just anal sex. Surely there is more love in sacrificing some of your own pleasure to please the one you love - how is this abuse?.\n He also says that sex between a married couple is both procreative and unitive, wheras homoesexual sex is not, (being purely unitive) surely if it is purely recreational sex between a married couple and birth control is used then it is no longer procreative and just 'abuse' again.", 
   {}, 
   55177, 
   null, 
   1088005020.0
  ], 
  [
   55189, 
   null, 
   "Tastyfish", 
   "Well, I think he is actually right, because there is no satisfaction in anal sex for man (being the passive partner). Without additional vaginal stimulation even a woman won't have orgasm from anal sex, moreover a man will not.\n\n But is point is far vaguer than that, if this is the only problem then surely it is fine if they take turns? Why is achieving orgasm a few minutes alter than your partner 'abuse' rather than sex? It seems your point here against gay sex is that they don't enjoy it, which I really think is not the case.", 
   {}, 
   55182, 
   null, 
   1088005200.0
  ], 
  [
   55192, 
   null, 
   "Phunting", 
   "Well, I think he is actually right, because there is no satisfaction in anal sex for man (being the passive partner). Without additional vaginal stimulation even a woman won't have orgasm from anal sex, moreover a man will not.\nSo the lack of orgasmic satisfaction would appear to imply that the act is being carried out by the 'passive' participant more as an act of love and emotional attachment than any sexual gratification? Contrary to your points that homosexual sex is solely for sexual gratification and contains no positive and loving elements.\n \n edit: And I do disagree with the statement anyway. Sexual gratification is very much present for both participents, but I wanted to point out that even with your misinformation your arguement is still contradictory.", 
   {}, 
   55182, 
   null, 
   1088005980.0
  ], 
  [
   55193, 
   null, 
   "Phunting", 
   "No it isn't, he is just using big words without paying any attention to their actual meaning, the whole thing is just saying \"I beleive gay sex is bad\" using more words badly.\nWhilst I agree with your summation, and don't really want to defend the original post in any way, I don't think that you can fault him on his language, the post appeared quite accurate to me.", 
   {}, 
   55175, 
   null, 
   1088006460.0
  ], 
  [
   55201, 
   null, 
   "Kronus", 
   "Without additional vaginal stimulation even a woman won't have orgasm from anal sex, moreover a man will not.\n\n \n Wrong and wrong. Not to put too blunt a point on it, .... women had orgasms from anal sex, with no other stimulation. And from what I've been told by gay friends, the pressure put on the prostate gland can easily make men on the receiving end of anal sex come.", 
   {}, 
   55193, 
   null, 
   1088007720.0
  ], 
  [
   55202, 
   null, 
   "Ukrainian", 
   "But with your bias you are missing the point, surely if you lve someone you do things to make them happy, and Jaaaman refers to all mutual masterbation, not just anal sex. Surely there is more love in sacrificing some of your own pleasure to please the one you love - how is this abuse?.\n\n In Russian language we have an idiom that sounds like \"fit to, or adjust to a given answer\". It's used when you know the answer for a problem, so you try to fit your arguments so it looks like they really lead to this answer.\n \n The problem is -- there is no mutual satisfaction.\n The correct trace of thought is -- I agree, there is not, so it's use and abuse.\n Fitting for the answer is -- it is sacrificing. Yeah, right, we can call all type of abuse. Like a rape, for example. \"I was raped. That was an abuse but I had to go through it so someone else wouldn't\". So argument like \"sacrifice\" is so flexible, you can abuse it too.", 
   {}, 
   55186, 
   null, 
   1088007840.0
  ], 
  [
   55205, 
   null, 
   "Ukrainian", 
   "But is point is far vaguer than that, if this is the only problem then surely it is fine if they take turns? Why is achieving orgasm a few minutes alter than your partner 'abuse' rather than sex? It seems your point here against gay sex is that they don't enjoy it, which I really think is not the case.\n\n These tricks with switching and taking shifts are only tricks, sir. And it simply proves how unnatural it is.", 
   {}, 
   55189, 
   null, 
   1088007960.0
  ], 
  [
   55217, 
   null, 
   "Kronus", 
   "Impressed!!! emoticon_xgood emoticon_xhoho\n\n \n Thanks. Now if you want to impress me you can admit that all your arguments based on the premis that gay sex is not mutually satisfactory, and therefore abusive, are wrong.", 
   {}, 
   55201, 
   null, 
   1088010180.0
  ], 
  [
   55220, 
   null, 
   "Tastyfish", 
   "In Russian language we have an idiom that sounds like \"fit to, or adjust to a given answer\". It's used when you know the answer for a problem, so you try to fit your arguments so it looks like they really lead to this answer.\n \n The problem is -- there is no mutual satisfaction.\n The correct trace of thought is -- I agree, there is not, so it's use and abuse.\n Fitting for the answer is -- it is sacrificing. Yeah, right, we can call all type of abuse. Like a rape, for example. \"I was raped. That was an abuse but I had to go through it so someone else wouldn't\". So argument like \"sacrifice\" is so flexible, you can abuse it too.\n\n \n Missing the point, abuse doesn't fit as it is consual and desired, the rape example does not fit. He is making up a bizarre defition of abuse if it includes the kind of thing he says it does (plenty of mutual masterbation is infact mutual so both partners will orgasm, why is the use of some organs over others really an issue).", 
   {}, 
   55202, 
   null, 
   1088010780.0
  ], 
  [
   55227, 
   null, 
   "Waxy", 
   "This thread is absurd, it really is.\n \n We have a person stating that consentual gay sex is abusive to one of the partners and that it can't be enjoyed by both partners simultaneously. This same person is COMPLETELY IGNORANT of gay sex, (and maybe sex in general) to the point that the mere thought of it apparently sickens him. And yet, this person claims to be speaking from a base of knowledge and authority. emoticon_rolleyes\n \n We have people claiming that the only purpose of sex is personal gratification, and that if a particular act does not provide direct physical orgasm, it is hedonistic and abusive.\n \n From there, we jumped to rape!\n \n I can hardly believe what I'm reading here, and quite frankly, I don't even know how to respond to this kind of thing. I'm just sitting here shaking my head.\n \n Waxy", 
   {}, 
   55220, 
   null, 
   1088013000.0
  ], 
  [
   55248, 
   null, 
   "jitobear", 
   "So all gay people are like that? He's like that because he's gay? There are criminals in prison that were perfect except for one moment in time they snapped did something wrong and then went on a good life like that.\n \n The problem wiht your logic is that if someone is gay then they're good because homosexuality made them good.\n \n I have an alcoholic uncle that is everything that you describe your gay mentor. He's good despite the alcoholism. I love my alcoholic uncle but hate the alcoholism.\n\n \n No all gay people aren't like anything anymore than all straight people. YOU were the one who was either stating plainly or implying that gays are bad and lacking in morals. I am telling you that you are wrong.\n \n Some gays are everything wonderful I listed above. Some are irresponsible, abusive, mean, liars - \n \n - just like straight people.\n \n One's sexuality does not completely define one's character nor does it say whether one has good values or not.", 
   {}, 
   55081, 
   null, 
   1088018760.0
  ], 
  [
   55251, 
   null, 
   "sinjin", 
   "Gay people do not define themselves by their sexuality, straight people do that for them.", 
   {}, 
   55248, 
   null, 
   1088019360.0
  ], 
  [
   55266, 
   null, 
   "mana'ia", 
   "[QUOTE=Tastyfish] Indeed don't beleive me at all, I am a sneaky guy who seeks nothing less than the destruction of Americas way of life at the hands of facts and reliable information. Being the devil I am I also don't believe hiding religoius opinions behind dodgy research and blatant lies by unbiased people. \n \n [QUOTE=Tastyfish]\n I.e by preaching that homosexuality is an acceptable practice and teaching people that there is nothing really wrong with having two parent of the same sex and that it is wrong to discriminate against the child for this reason. But so what if you actually don't see a problem with homosexuals i the first place, just circular reasoning - 'gays are bad, and encouraging this behaviour makes people think it is accpetable, but it is bad, so this is bad'. When is bullying ever acceptable?\n \n [QUOTE=Tastyfish]\n Again, so what, the defintion of marriage is now two people who love each other declaring their intention to live with each other permantantely. Unless you are against hmosexuality in general there is no problem with this.\n \n [QUOTE=Tastyfish]\n All things have top be considered by a case by case study, if something doesn't cause harm to the public in general then it isn't going to open the floodgates for behaviour that will. Despite what mana'ia would have you believe, there is no way homosexuality will lead to legalised peadophilia. At least no more than being able to sell beef in a market will lead to the legalisation of selling human flesh to the public for the purposes of consumption.\n \n \n\n So what? Everything good has to be genetic, I do Molecular Genetics and Biotech and I know this to be false. Anyway, it is speculated to be genetic for good reason. It is not a concious choice as has been observed in a massive amount of natural observations of animals\n\n No I dont' beleive it. If it not genetic then it's behavior and they are not confined by genetics to be gay.\n \n \n \n\n So you admit that lesbianism is perfectly OK? If it doesn't impact on anyone else how is this a problem? Is also no different from anal sex in heterosexual couples, should this be banned too?\nNo lesbuians have many problems due to their behavior as lesbians. Anal sex is very risky and has problems. Sodomy is illegal unless it's consensual. Id o believe anal sex should be illegal because of the risks.\n \n \n \n\n If conned into beliving they have to, what is the point in making people go through a lot of psychological trauma if you could just accept them as they were in the first place? Should Goths and Punks also be forced into programs that will make the same as the mainsteam population?\n\n No t5hey shouldn't be forced but they shouldn't ask us to change to accommodate their problems. Should we all change to accommodate other disorders such as voyerism?\n \n \n\n Completely personal opinion, I find your views far more against comon decency than homosexual behaviour, but am I forcing you to become gay? No one is advocating being able to have any kind of sex in public, it is all between consenting adults in the privacy of their own home. Legalising gay marriage/accepting homosevuality will not mean everyone can just **** in the street or have sex in a strangers house, this is just blatant idiocy.\n\n Should we legalize priostituion in private homes? Nobody would be forced into to it.\n \n How about drug use in private homes? Should that be legal if it reamins in theri home? \n \n We decide what is right for society including our private homes. Just becasue it remains private doesn't men it's right ro has no affect on society.\n \n \n\n Morals are based off social behaviour, if something doesn't benefit the society in general (like intolerance, not just benefit but more doesn't harm society) then there is really no problem using the general system we use today. Bring religion inot it and it is a whole different matter, but then we don't apply one religion to everyone. Morals change, people opposed interacial marriages on the grounds of morality, and slavery and genocide was accepted in some socities- should we be bound to follow old moralities for all time?\n\n Morals are based off many things. your morals are based off your religous views or lack of relgiious views.\n \n Morals do change for some. For some they do not. The Democratic party at one time supported slavery, Jim crow laws, racial internments, etc.\n The GOP opposed slavery and all those other things. Does that make the GOP wrong becaue the Democrats were wrong all along?\n \n GOP had good values for most of the time. And becaue others were wrong does not make this morality issue wrong now.\n \n \n \n \n\n But they generally go like this sadly, there is really little reason other than the old cultural reasons and religions to oppose it. One possible reason that I did miss off before is that it may lead to a view that all old values are wrong and outdated. But again I would counter this by saying that these kind of viewpoints have to be considered in a case by case method. At some points it may have been beneificial to opose homosexuality (in helping keep other memes functioning, memes that possesed this trait could overrule other memes that allowed it) but then there is a lot of things that were once acceptable that are now not, being a slave to old reasoning leads to cultural stagnation and a more conflict as a beneficial new idea is violently oppsed to an outdated old one. If the old idea is better then the new idea wil not be accepted.\n\n There is a saying, \" A ship without an anchor is at the mercy of the waves.\" We need as a soceity to decide where we draw the line. We don't want to recognize homosexuality because it will erase teh line and where will we draw it again? Polygamy? Prostituition? Nudist?\n \n \n \n\n I challenge you Mana'ia to provide a counter argument to all my points that doesn't rely on the view that homosexuality is bad in the first place. No bible quotes, circular reasoning or links to poorly conducted studies (we will look at the methods used laterafter you ahve posted them, but look at them yourself critically rather than posting wihtout trying to find as many possible holes yourself and admitting them, lets do this properly and scientifically) \n\n \n I never dismissed your posts however these are the same arguments everyoen else ahs made. Nothing new and nothing definitve. When you disgree with logic you call it circular without explaining why or how it is circular.", 
   {}, 
   54942, 
   null, 
   1088021880.0
  ], 
  [
   55275, 
   null, 
   "Ukrainian", 
   "Thanks. Now if you want to impress me you can admit that all your arguments based on the premis that gay sex is not mutually satisfactory, and therefore abusive, are wrong.\n\n No, I don't. Just that one fact that your partner had orgasm from anal sex doesn't prove anything. It's only a separate case, not a rule.", 
   {}, 
   55217, 
   null, 
   1088025720.0
  ], 
  [
   55277, 
   null, 
   "Ukrainian", 
   "This thread is absurd, it really is.\n \n We have a person stating that consentual gay sex is abusive to one of the partners and that it can't be enjoyed by both partners simultaneously. This same person is COMPLETELY IGNORANT of gay sex, (and maybe sex in general) to the point that the mere thought of it apparently sickens him. And yet, this person claims to be speaking from a base of knowledge and authority. emoticon_rolleyes\n \n We have people claiming that the only purpose of sex is personal gratification, and that if a particular act does not provide direct physical orgasm, it is hedonistic and abusive.\n \n From there, we jumped to rape!\n \n I can hardly believe what I'm reading here, and quite frankly, I don't even know how to respond to this kind of thing. I'm just sitting here shaking my head.\n \n Waxy\n\n Man, your honesty is respectable. And it made me laugh. In a good way. I'm shaking my head with you.", 
   {}, 
   55227, 
   null, 
   1088025900.0
  ], 
  [
   55281, 
   null, 
   "Tastyfish", 
   "No I dont' beleive it. If it not genetic then it's behavior and they are not confined by genetics to be gay.\n\n A lot of behaviour is genetic, as all behaviour is the result of chemcial reactions within the brain. Whether genes has any influence over it all has no bearing on whether the eventual behaviour should be accepted or not. Do you beleive that it is a choice though or an inevitable result of childhood/teenage experiences then? \n \n \nNo lesbuians have many problems due to their behavior as lesbians. Anal sex is very risky and has problems. Sodomy is illegal unless it's consensual. Id o believe anal sex should be illegal because of the risks.\n Fair enough with the beleif that all anal sex should be treated the same (can't really see any specific problems between lesbians though as this would be far more close to conventional sex or masterbation), however if that action leads only to potential harm to the actual people involved then I don't see a need to ban this. Most banned behaviours are generally done so because they lead to other behaviour to others (drug use leading to and addiction that when combined with the reesultant unemployment leads to theft and crime) or are harmful to other directly (speeding). Admittedly some laws do fit this type (seat belt laws) but these are more the exception from the rule I think.\n \n \n\n No t5hey shouldn't be forced but they shouldn't ask us to change to accommodate their problems. Should we all change to accommodate other disorders such as voyerism?\n People can be voyeurs if the voyeured person doesn't object (there is a lot of stuff like this on the internet as far as porn goes), but voyeurism strictly involves a party who doesn't want to be part (even if they don't know). Asking for gay relationships to be recognised is very different from this it is not requiring an unwilling part to be involved. Should we change to accomodate the physically disabled - alarms on crossings, lifts in offices and ramps in schools etc? \n \n \n\n Should we legalize priostituion in private homes? Nobody would be forced into to it.\n In some areas it is (Holland and some states I know). The problems with prostitution are the associated kind (being linked with crime and/or exploitation of women.) If open and regulated it would be not as bad and more acceptable\n \n \n\n How about drug use in private homes? Should that be legal if it reamins in theri home? \n Leads to crime against other people, can't see how this applies to homosexual sex\n \n \n\n We decide what is right for society including our private homes. Just becasue it remains private doesn't men it's right ro has no affect on society.\n But how will acceptance and recognition of homosexuality lead to harmful effect on other people.\n \n \n\n Morals do change for some. For some they do not. The Democratic party at one time supported slavery, Jim crow laws, racial internments, etc.\n The GOP opposed slavery and all those other things. Does that make the GOP wrong becaue the Democrats were wrong all along?\n \n GOP had good values for most of the time. And becaue others were wrong does not make this morality issue wrong now.\n Works both ways, holdingh a moral view point exclusively because it has been held before without considering whether or not it is still relavant is not a good position.\n \n \n\n There is a saying, \" A ship without an anchor is at the mercy of the waves.\" We need as a soceity to decide where we draw the line. We don't want to recognize homosexuality because it will erase teh line and where will we draw it again? Polygamy? Prostituition? Nudist?\n \n So we are saying no to something that is fine because if we accpeted it we would have to say yes to something that is bad? All this stuff has to be considered on a case by case basis, you can't just make one opinion once and then apply that to every descion that you make later on a wide variety of topics. If that ship never lifts its anchor, its not going to go anyway is it? Then it would be pretty useless as a ship.", 
   {}, 
   55266, 
   null, 
   1088026740.0
  ], 
  [
   57185, 
   null, 
   "mana'ia", 
   "A lot of behaviour is genetic, as all behaviour is the result of chemcial reactions within the brain. Whether genes has any influence over it all has no bearing on whether the eventual behaviour should be accepted or not. Do you beleive that it is a choice though or an inevitable result of childhood/teenage experiences then?\n\n Yes I believe it's a disorder that is either socialized like attachment disorder, seperation disorder, or post traumatic stress. I also believe that there may be an genetic predisposition like alcoholism. I don't believe it's genetically dtermined.\n \n \n\n Fair enough with the beleif that all anal sex should be treated the same (can't really see any specific problems between lesbians though as this would be far more close to conventional sex or masterbation), however if that action leads only to potential harm to the actual people involved then I don't see a need to ban this. Most banned behaviours are generally done so because they lead to other behaviour to others (drug use leading to and addiction that when combined with the reesultant unemployment leads to theft and crime) or are harmful to other directly (speeding). Admittedly some laws do fit this type (seat belt laws) but these are more the exception from the rule I think.\n\n Drugs are harmful to the public health. That is why its banned. Homosexuality falls under the same and that is why it doesn't merit any special treatment that attachment or any other disorder.\n \n \n\n People can be voyeurs if the voyeured person doesn't object (there is a lot of stuff like this on the internet as far as porn goes), but voyeurism strictly involves a party who doesn't want to be part (even if they don't know). Asking for gay relationships to be recognised is very different from this it is not requiring an unwilling part to be involved. Should we change to accomodate the physically disabled - alarms on crossings, lifts in offices and ramps in schools etc? \n\n The example of the physically disabled is for them to be assisted in performing functions that they are disadvantaged compared to non-disabled people. They are performing the same function everyone else is doing.\n \n Gay marriage is like saying we just don't want to go into that school that everyone else can enter because we don't feel comfortable in it and we disagree with the curriculum so build us our own school. You're not asking for help in learning the curriculum, they have a different one that is the reason for the separate school. \n \n\n In some areas it is (Holland and some states I know). The problems with prostitution are the associated kind (being linked with crime and/or exploitation of women.) If open and regulated it would be not as bad and more acceptable\n\n Do You really believe that? Look at Nevada.\n \n \n\n Leads to crime against other people, can't see how this applies to homosexual sex\n\n \n \n \n\n But how will acceptance and recognition of homosexuality lead to harmful effect on other people.\n \n No it hurts the public health as does homosexuality.\n \n \n\n Works both ways, holdingh a moral view point exclusively because it has been held before without considering whether or not it is still relavant is not a good position.\n good thing it's still relevant.\n \n \n \n\n So we are saying no to something that is fine because if we accpeted it we would have to say yes to something that is bad? All this stuff has to be considered on a case by case basis, you can't just make one opinion once and then apply that to every descion that you make later on a wide variety of topics. If that ship never lifts its anchor, its not going to go anyway is it? Then it would be pretty useless as a ship. \nHowever if the ship has arrived it doesn't need to move, unless it has a reason to move and then it must move everytime that reson arises.", 
   {}, 
   55281, 
   null, 
   1089375540.0
  ], 
  [
   57237, 
   null, 
   "Tastyfish", 
   "Yes I believe it's a disorder that is either socialized like attachment disorder, seperation disorder, or post traumatic stress. I also believe that there may be an genetic predisposition like alcoholism. I don't believe it's genetically dtermined.\n But you have been shot down everytime when you bring up the detrimental to public health thing, if its purely a behaviour it is more like liking the colour yellow more than red than alcoholism. You keep comparing it to addictions, a gay person isn't going to mug someone to get money to feed their addiction for male prostitutes, nor does being gay make you irresponisble and likely to cause harm to others like when driving. It doesn't make you paranoid and think people are out to get you unless you act premepitvely. It is nothing like the things you compare it to.\n \n \n\n Drugs are harmful to the public health. That is why its banned. Homosexuality falls under the same and that is why it doesn't merit any special treatment that attachment or any other disorder.\n Sweets and chocolate are bad for the public health, alcohol is bad for the public health, smoking is bad for the public health. Drugs are harmful to people who do not take them due to the addictive qualities. They are not banned because they are bad for you, they are banned as they are bad for you and other people.\n \n \n\n Gay marriage is like saying we just don't want to go into that school that everyone else can enter because we don't feel comfortable in it and we disagree with the curriculum so build us our own school. You're not asking for help in learning the curriculum, they have a different one that is the reason for the separate school.\n However this school has the requirement that all pupils must be white. Isn't reasonable that other races either get their own school or the original one must be made to be more accepting ?\n \n \n Look at Holland. Very low crime and a nice place to live.\n \n \n\n No it hurts the public health as does homosexuality.\n\n How? You keep bringing this up, how will homosexaulity hurt you? And remember we are dealing with consquences of homosexuality, not things just correlated with it.\n \n \n\n good thing it's still relevant.\n No it isn't, you are just trying to support an old view. I have yet to see anywhere on this forum some evidence that people will be harmed by gay marriage. \n \n \n\n However if the ship has arrived it doesn't need to move, unless it has a reason to move and then it must move everytime that reson arises.\n We aren't there, we are miles away from a perfect society.", 
   {}, 
   57185, 
   null, 
   1089390960.0
  ], 
  [
   58097, 
   null, 
   "mana'ia", 
   " But you have been shot down everytime when you bring up the detrimental to public health thing, if its purely a behaviour it is more like liking the colour yellow more than red than alcoholism. You keep comparing it to addictions, a gay person isn't going to mug someone to get money to feed their addiction for male prostitutes, nor does being gay make you irresponisble and likely to cause harm to others like when driving. It doesn't make you paranoid and think people are out to get you unless you act premepitvely. It is nothing like the things you compare it to.\n\n No I havent been shot down once yet. \n \n \n \n The Relationship between Suicide Risk and Sexual Orientation: Results of a Population-Based Study \n \n Gary Remafedi, MD, MPH, Simone French, PhD, Mary Story, PhD, Michael D. Resnick, PhD, and Robert Blum, MD, PhD \n \n Objectives. This study examined the relationship between sexual orientation and suicide risk in a population-based sample of adolescents. \n \n Methods. Participants were selected from a cross-sectional, statewide survey of junior and senior public high school students. All males (n = 212) and females (n = 182) who described themselves as bisexual/homosexual were compared with 336 gender-matched heterosexual respondents on three outcome measures: suicidal ideation, intent, and self-reported attempts. Logistic regression analyses were used to examine the association between sexual orientation and outcome measures with adjustment for demographic characteristics. \n \n Results. Suicide attempts were reported by 28.1% of bisexual/homosexual males, 20.5% of bisexual/homosexual females, 14.5% of heterosexual females, and 4.2% of heterosexual males. For males, but not females, bisexual/homosexual orientation was associated with suicidal intent (odds ratio [OR] = 3.61; 95% confidence interval [CI] = 1.40, 9.36) and attempts (OR = 7.10; 95% CI = 3.05, 16.53). \n \n Conclusions. There is evidence of a strong association between suicide risk and bisexuality or homosexuality in males. (Am J Public Health. 1998;88:57*60) \n \n http://www.apha.org/journal/abstracts/remaf.htm\n \n Men who have sex with men may identify themselves as homosexual, bisexual, or even heterosexual. No matter what label is used, the fact is that these men are at increased risk for sexually transmitted diseases (STDs) such as human immunodeficiency virus (HIV) infection, anal cancer, and psychologic and behavioral disorders.1\n \n The rate of men who had sex with men in the previous year was thought to be 1.7 to 2 percent. However, surveys from 1996 to 2000 indicate that the rate is at least 3.1 to 3.7 percent.2 This discrepancy indicates that male-male sexual behavior often is underreported, and that previous estimates of the number of men who have sex with men may be too low. Therefore, a typical family physician can expect 3 percent or more of his or her male patients to be men who have had sex with men in the previous year.\n \n Recent trends indicate a resurgence in risky behaviors that expose men who have sex with men to HIV infection and other STDs. The reported prevalence of men engaging in un-protected anal intercourse increased from 37 percent in 1993-1994 to 50 percent in 1996-1997.3 Disease risk frequently is not assessed, especially in younger men, in part because of numerous impediments to adequate care under the current health care system.4\n \n http://www.aafp.org/afp/20040501/2149.html\n \n \n 4.3.1 Recent studies have reported Bisexual people to have worse mental health than their homosexual or heterosexual counterparts due to more adverse life events and less positive support from family and friends15. Bisexual people may also be at greater risk of STIs due to a lack of targeted health promotion activities.16\n \n http://www.ama.com.au/web.nsf/doc/WEEN-5GA2YX\n \n \n \n\n Sweets and chocolate are bad for the public health, alcohol is bad for the public health, smoking is bad for the public health. Drugs are harmful to people who do not take them due to the addictive qualities. They are not banned because they are bad for you, they are banned as they are bad for you and other people.\n\n \n Sweetes have a benefit. The harm is minimal especially compared to the benefit. they are banned because they are bad for you. Why is FDA approval needed? Why are steroids banned?\n \n \n\n However this school has the requirement that all pupils must be white. Isn't reasonable that other races either get their own school or the original one must be made to be more accepting ?\n\n The original must be more accepting but their is no change of curriculum.\n \n \n\n Look at Holland. Very low crime and a nice place to live.\n\n Japan is even better.\n \n \n\n How? You keep bringing this up, how will homosexaulity hurt you? And remember we are dealing with consquences of homosexuality, not things just correlated with it.\n\n Anal sex is detrimental. Many of the things lesbians do can damage the genitals. Sex for most people don't constantly invovle those types of sex like gays.\n \n \n\n No it isn't, you are just trying to support an old view. I have yet to see anywhere on this forum some evidence that people will be harmed by gay marriage. \n\n There is as much harm to me by gay marriage as there is by prostitution, stock manipulation, cannabilism, child abuse, public nudity, and polygamy. It hurts society in terms of morality.\n \n \n\n We aren't there, we are miles away from a perfect society. \n\n \n In terms of marriage we have arrived.There just should be stricter standards on who gets off the boat.", 
   {}, 
   57237, 
   null, 
   1089887460.0
  ], 
  [
   58723, 
   null, 
   "Tastyfish", 
   "No I havent been shot down once yet. \n We shall see...\n \n \n \n\n The Relationship between Suicide Risk and Sexual Orientation: Results of a Population-Based Study\n \n Gary Remafedi, MD, MPH, Simone French, PhD, Mary Story, PhD, Michael D. Resnick, PhD, and Robert Blum, MD, PhD \n \n Objectives. This study examined the relationship between sexual orientation and suicide risk in a population-based sample of adolescents. \n \n Methods. Participants were selected from a cross-sectional, statewide survey of junior and senior public high school students. All males (n = 212) and females (n = 182) who described themselves as bisexual/homosexual were compared with 336 gender-matched heterosexual respondents on three outcome measures: suicidal ideation, intent, and self-reported attempts. Logistic regression analyses were used to examine the association between sexual orientation and outcome measures with adjustment for demographic characteristics. \n \n Results. Suicide attempts were reported by 28.1% of bisexual/homosexual males, 20.5% of bisexual/homosexual females, 14.5% of heterosexual females, and 4.2% of heterosexual males. For males, but not females, bisexual/homosexual orientation was associated with suicidal intent (odds ratio [OR] = 3.61; 95% confidence interval [CI] = 1.40, 9.36) and attempts (OR = 7.10; 95% CI = 3.05, 16.53). \n \n Conclusions. There is evidence of a strong association between suicide risk and bisexuality or homosexuality in males. (Am J Public Health. 1998;88:57*60) \n \n http://www.apha.org/journal/abstracts/remaf.htm\n \n No attempt to look at reasons why, seeing as we are dealing with high school then being treated poorly due to their homosexuality is probably going to be an issue, as is acceptance from family as there isn't really the possibility of ignorig them that you kind of get as you get older. Its ice creams and drowning. Is there any breakdown of the stats that show what the given reasons where, as we are going to have to take the problems of finding a girlfriend/boyfriend and homophobia from peers and family into account. \n To make this link you have to show the neural chemical nature of homosexuality and show how it causes depression and suicide. \n \n \n\n Men who have sex with men may identify themselves as homosexual, bisexual, or even heterosexual. No matter what label is used, the fact is that these men are at increased risk for sexually transmitted diseases (STDs) such as human immunodeficiency virus (HIV) infection, anal cancer, and psychologic and behavioral disorders.1\n \n The rate of men who had sex with men in the previous year was thought to be 1.7 to 2 percent. However, surveys from 1996 to 2000 indicate that the rate is at least 3.1 to 3.7 percent.2 This discrepancy indicates that male-male sexual behavior often is underreported, and that previous estimates of the number of men who have sex with men may be too low. Therefore, a typical family physician can expect 3 percent or more of his or her male patients to be men who have had sex with men in the previous year.\n \n Recent trends indicate a resurgence in risky behaviors that expose men who have sex with men to HIV infection and other STDs. The reported prevalence of men engaging in un-protected anal intercourse increased from 37 percent in 1993-1994 to 50 percent in 1996-1997.3 Disease risk frequently is not assessed, especially in younger men, in part because of numerous impediments to adequate care under the current health care system.4\n \n http://www.aafp.org/afp/20040501/2149.html\n \n So people within a population with a higher concentration of infected people are more likely to get a disease! Also how much more likely are two disease free homosexuals to get a disease than two heterosexual ones. There is also more cause for safer sex methods within heterosexual couples.\n \n \n\n 4.3.1 Recent studies have reported Bisexual people to have worse mental health than their homosexual or heterosexual counterparts due to more adverse life events and less positive support from family and friends15. Bisexual people may also be at greater risk of STIs due to a lack of targeted health promotion activities.16\n \n http://www.ama.com.au/web.nsf/doc/WEEN-5GA2YX\n \n More adverse life events and less positive support from family? How is this a problem to do with bisexuality rather than the acceptance of it?\n \n \n \n\n Sweetes have a benefit. The harm is minimal especially compared to the benefit. they are banned because they are bad for you. Why is FDA approval needed? Why are steroids banned?\n \n Benefit from sweets? Hardly a nutritional one. Though quite where the government is supposed to draw the line is debatable, alchohol and ciggarettes probably cause more deaths than gay sex. \n \n \n\n The original must be more accepting but their is no change of curriculum.\n \n Depends what the curriculm is, if it is still 'whites are better' its still wrong. The important part of this curriculm should be based on loving partners rather than ensuring that they are different sexs.\n \n \n\n Japan is even better.\n \n Didn't think so when I lived there. Food's awful, its overcrowded with a really low speed limit. Not as keen on the music either. However the general ethic is much more different in Japan from the US than Holland is.\n \n \n\n There is as much harm to me by gay marriage as there is by prostitution, stock manipulation, cannabilism, child abuse, public nudity, and polygamy. It hurts society in terms of morality.\n We've been over this, the examples you use are not relevant on the whole as there is no injured third party in homosexual marriage. Morality without a decent reason behind it is just predjudice, nothing hurts soceity in terms of morality.\n \n \n\n In terms of marriage we have arrived.There just should be stricter standards on who gets off the boat.\n There is one ship, not an entire fleet for each issue all tethered to the one anchor. Perhpas we should leave this analogy now...", 
   {}, 
   58097, 
   null, 
   1090197120.0
  ], 
  [
   59110, 
   null, 
   "mana'ia", 
   "We shall see...\n\n Stay tuned because it won't happen\n \n \n \n\n No attempt to look at reasons why, seeing as we are dealing with high school then being treated poorly due to their homosexuality is probably going to be an issue, as is acceptance from family as there isn't really the possibility of ignorig them that you kind of get as you get older. Its ice creams and drowning. Is there any breakdown of the stats that show what the given reasons where, as we are going to have to take the problems of finding a girlfriend/boyfriend and homophobia from peers and family into account. \n To make this link you have to show the neural chemical nature of homosexuality and show how it causes depression and suicide. \n\n The fact is that you only recite speculative reasons. Gays everwhere including the Netherlans that is mroe accepting have health problems associated with their behavior.\n \n The netehrlands is more accepting and gays still have problems that are consistent with the behavior world wide. The fact is taht we shouldn;t cater to this behavior anymroe than we should cater to attachment disorder, seperation anxiety, paranoia, etc. Why does homosexuality merit special treatment and other behaviors do not?\n \n \n \n \n\n So people within a population with a higher concentration of infected people are more likely to get a disease! Also how much more likely are two disease free homosexuals to get a disease than two heterosexual ones. There is also more cause for safer sex methods within heterosexual couples.\n\n Poeple that behave in an unsafe manner infect at higher rates and casue a larger infection rate.\n \n The two homsexuals are still likely to casue injury to each other than a heterosexual couple. I agree there are reasons for safer sex in heterosexual couples.\n \n \n\n More adverse life events and less positive support from family? How is this a problem to do with bisexuality rather than the acceptance of it?\n\n Those are factors not the CAUSE.\n \n \n\n Benefit from sweets? Hardly a nutritional one. Though quite where the government is supposed to draw the line is debatable, alchohol and ciggarettes probably cause more deaths than gay sex. \n\n We need certain sugars in are systems to remain healthy as demonstrated by diabetes. I agree we should ban alcohol and cigarettes. Alcohol and cigarettes are used more than homosexuality is practiced. Just because one bad vice is allowed doesn;t justiy allowing others.\n \n \n \n\n Depends what the curriculm is, if it is still 'whites are better' its still wrong. The important part of this curriculm should be based on loving partners rather than ensuring that they are different sexs.\n\n That isn't the case here though. you agree wiht teh marriage concept.\n \n \n \n\n Didn't think so when I lived there. Food's awful, its overcrowded with a really low speed limit. Not as keen on the music either. However the general ethic is much more different in Japan from the US than Holland is.\n\n I loved the food. It was only crowded ijn the major cities. It has a better crime rate and teh people are much more ethical and moral than Holland.\n \n \n \n\n We've been over this, the examples you use are not relevant on the whole as there is no injured third party in homosexual marriage. Morality without a decent reason behind it is just predjudice, nothing hurts soceity in terms of morality.\n\n Where is teh third party injured in prostitution, polygamy, stock manipulation, cannibalism, etc?\n \n \n \n \n\n There is one ship, not an entire fleet for each issue all tethered to the one anchor. Perhpas we should leave this analogy now... \n\n My point is we need to draw a line. If we allow homkmsexuality recognition why not allow attachment disorder or cannibalism recognition?", 
   {}, 
   58723, 
   null, 
   1090374060.0
  ], 
  [
   59129, 
   null, 
   "JakeCJB", 
   "mana'ia, you always forget to mention, if we accept gays and lesbian people, why not accept barbequing babies?\n \n African Americans, as a group, are at increased risk for HIV/AIDS(this article also states there is a direct link to poverty, so I guess poor people should not be accepted either)....\n \n http://www.cdc.gov/hiv/pubs/Facts/afam.htm\n \n The HIV/AIDS epidemic is a major health crisis among African Americans, affecting men and women of every age and sexual orientation.\n \n The Cumulative Effect of HIV/AIDS: \n \n According to the 2000 Census, African Americans make up 12.3% of the population of the United States. However, they have accounted for 39% - more than 347,000 - of the more than 886,000 estimated AIDS cases diagnosed since the beginning of the epidemic.1 By the end of December 2002, more than 185,000 African Americans had died with AIDS.1 \n \n For people diagnosed with AIDS since 1994, African Americans had the poorest survival rates of all racial and ethnic groups, with 55% surviving after 9 years compared to 61% of Hispanics, 64% of whites, and 69% of Asian/ Pacific Islanders.1 \n \n In 2000, HIV/AIDS was among the top three causes of death for African-American men ages 25-54 and African-American women ages 35-44.2\n \n AIDS in 2002:\n \n African Americans accounted for about 21,000, or 50 percent, of the more than 42,000 estimated AIDS cases diagnosed among adults in the United States.1 \n \n The AIDS diagnosis rate among African Americans was almost 11 times the rate among whites. African-American women had a 23 times greater diagnoses rate than white women. African- American men had almost a 9 times greater rate of AIDS diagnosis than white men.1 \n \n Over 162,000 African Americans were living with AIDS in the United States. They accounted for 42% of all people in the United States living with AIDS.1 \n \n * Based on 30 areas with confidential name-based HIV surveillance\n \n HIV in 2002:\n \n African Americans accounted for over half of the new HIV diagnoses reported in the United States.1 \n \n A study of people diagnosed with HIV found that 56% of \"late testers,\" i.e., those that were diagnosed with AIDS within one year of their HIV diagnosis, were African American.3 Late testing represents missed opportunities in prevention and treatment of HIV. \n \n The leading cause of HIV infection among African-American men is sexual contact with other men, followed by injection drug use and heterosexual contact.1 \n \n The leading cause of HIV infection among African-American women is heterosexual contact, followed by injection drug use.1 \n \n Sixty-two percent of children born to HIV-infected mothers were African American.1", 
   {
    "unicode_changes_made": true
   }, 
   59110, 
   null, 
   1090380060.0
  ], 
  [
   59130, 
   null, 
   "JakeCJB", 
   "These posts were posted by myself on another thread, but also address the issues on this thread...\n \n http://4forums.com/political/showpost.php?p=59080&postcount=594\n \n http://4forums.com/political/showpost.php?p=59127&postcount=605", 
   {}, 
   59129, 
   null, 
   1090380540.0
  ], 
  [
   59131, 
   null, 
   "Duo_Maxwell", 
   "DIEASES IS IRREVELANT TO MARRIAGE!!!\n \n mana'ia: Most of your arguments are fallacies. Primarily this one: \n \n Slippery Slope Fallacy (Camel's Nose) \n there is an old saying about how if you allow a camel to poke his nose into the tent, soon the whole camel will follow. \n \n The fallacy here is the assumption that something is wrong because it is right next to something that is wrong. Or, it is wrong because it could slide towards something that is wrong. \n \n For example, \"Allowing abortion in the first week of pregnancy would lead to allowing it in the ninth month.\" Or, \"If we legalize marijuana, then more people will try heroin.\" Or, \"If I make an exception for you then I'll have to make an exception for everyone.\"", 
   {}, 
   59130, 
   null, 
   1090380720.0
  ], 
  [
   59134, 
   null, 
   "joebrummer", 
   "Being very new to this board I have spent some time reading different threads and the arguments agaist homosexuality. Mana'ia and others seem to have this dooms day view of homosexuality. It is unhealthy and kills people...blah..blah ..blah. Then we hear how gay marriage will destroy the institution of marriage......blah..blah.\n \n Funny how a group of people who seemingly make up such a small percentage of the population have so much power over the course of the world.", 
   {
    "post_info": {
     "post_title": "New guys opinion"
    }
   }, 
   59131, 
   null, 
   1090381380.0
  ], 
  [
   59136, 
   null, 
   "Duo_Maxwell", 
   "ya know joebrummer, you got a point. \n \n What interests me is that many (if not all but one) of their points apply to straights yet they aren't including straights in their quest to deny marriage.", 
   {}, 
   59134, 
   null, 
   1090381680.0
  ], 
  [
   59255, 
   null, 
   "joebrummer", 
   "I watched the Senate hearings on TV and was amazed at Hilary Clinton asking why amedments were not passed years ago when the divorce rate reached 50%? I say we ban divorce. Let have an amedment to ban divorce. If marriage is the staple of this society and has such sanc-taa-tee then lets make sure we really protect it...ban divorce. If Britney want to go marry someone on the spur of the moment by an Elvis look alike then letter sleep in the bed she made. \n \n \n I also saw Rick Santorum speak about how married people live longer, take fewer risks, suffer less depression. All the wonderful benefits of marriage....then explain why we should deny that happiness to a whole segment of the population.\n \n \n Straight people crack me up!", 
   {}, 
   59136, 
   null, 
   1090468260.0
  ], 
  [
   60345, 
   null, 
   "mana'ia", 
   "mana'ia, you always forget to mention, if we accept gays and lesbian people, why not accept barbequing babies?\n\n That doesn't fit under the same standard you're asking for homosexuality.\n \n \n \nAfrican Americans, as a group, are at increased risk for HIV/AIDS(this article also states there is a direct link to poverty, so I guess poor people should not be accepted either)....\n \n http://www.cdc.gov/hiv/pubs/Facts/afam.htmthe HIV/AIDS epidemic is a major health crisis among African Americans, affecting men and women of every age and sexual orientation.\n \n The Cumulative Effect of HIV/AIDS: \n \n According to the 2000 Census, African Americans make up 12.3% of the population of the United States. However, they have accounted for 39% &#8212; more than 347,000 &#8212; of the more than 886,000 estimated AIDS cases diagnosed since the beginning of the epidemic.1 By the end of December 2002, more than 185,000 African Americans had died with AIDS.1 \n \n For people diagnosed with AIDS since 1994, African Americans had the poorest survival rates of all racial and ethnic groups, with 55% surviving after 9 years compared to 61% of Hispanics, 64% of whites, and 69% of Asian/ Pacific Islanders.1 \n \n In 2000, HIV/AIDS was among the top three causes of death for African-American men ages 25-54 and African-American women ages 35-44.2\n \n AIDS in 2002:\n \n African Americans accounted for about 21,000, or 50 percent, of the more than 42,000 estimated AIDS cases diagnosed among adults in the United States.1 \n \n The AIDS diagnosis rate among African Americans was almost 11 times the rate among whites. African-American women had a 23 times greater diagnoses rate than white women. African- American men had almost a 9 times greater rate of AIDS diagnosis than white men.1 \n \n Over 162,000 African Americans were living with AIDS in the United States. They accounted for 42% of all people in the United States living with AIDS.1 \n \n * Based on 30 areas with confidential name-based HIV surveillance\n \n HIV in 2002:\n \n African Americans accounted for over half of the new HIV diagnoses reported in the United States.1 \n \n A study of people diagnosed with HIV found that 56% of &#8220;late testers,&#8221; i.e., those that were diagnosed with AIDS within one year of their HIV diagnosis, were African American.3 Late testing represents missed opportunities in prevention and treatment of HIV. \n \n The leading cause of HIV infection among African-American men is sexual contact with other men, followed by injection drug use and heterosexual contact.1 \n \n The leading cause of HIV infection among African-American women is heterosexual contact, followed by injection drug use.1 \n \n Sixty-two percent of children born to HIV-infected mothers were African American.1\n\n \n \n Funny how you manipulated. You keep making arguments of genetics but you present evidence of behavior. They contract aids due to behavior from infidelity and fornication which I would support banning.", 
   {}, 
   59129, 
   null, 
   1091191440.0
  ], 
  [
   60348, 
   null, 
   "mana'ia", 
   "Quote:\n Originally Posted by JakeCJB\n mana'ia, the studies you've posted don't take into account the many which show that the rejection and the lack of support they receive is a factor in suicide among gay and lesbian people...\n \n Of the 10 studies, 6 explored risks for suicide by comparing attemptors and nonattemptors. They found that suicide attempts were neither universal nor attributable to homosexuality per se, but they were significantly associated with gender nonconformity,3 early awareness of homosexuality,3, 8, 11, 14 stress,12 violence,14 lack of support,8, 11, 14 school drop-out,12 family problems,8 acquaintances' suicide attempts,12 homelessness,12 and substance abuse3 or other psychiatric symptoms.6, 11, 14 \n \n Surveys large enough to examine sex differences among Minnesota15 and Massachusetts students19 found a significant association between homosexuality and suicidality in males only. Suicide risk factors such as gender nonconformity may be particularly detrimental to boys.15, 19 \n \n http://jama.ama-assn.org/cgi/content/full/282/13/\n1291 \n \n Remeber these are only factors. Even in the netherlands they still have higher rates even if they are more accepted.\n \n \n \n \n \nQuote:\n Results. Homosexual and bisexual individuals more frequently than heterosexual persons reported both lifetime and day-to-day experiences with discrimination. Approximately 42% attributed this to their sexual orientation, in whole or part. Perceived discrimination was positively associated with both harmful effects on quality of life and indicators of psychiatric morbidity in the total sample. Controlling for differences in discrimination experiences attenuated observed associations between psychiatric morbidity and sexual orientation. \n \n Conclusions. Higher levels of discrimination may underlie recent observations of greater psychiatric morbidity risk among lesbian, gay, and bisexual individuals.\n \n http://www.ajph.org/cgi/content/abstract/91/11/1869\n \n The studies showing more prevelence for mental health issues among some gays and lebians are nowhere near levels of pathology which would indicate that homosexuality itself is inherently pathological. \n \n Suicide down, acceptance of gays and lesbians may be a factor...\n \n http://www.advocate.com/new_news.as.../12/04-06/14/04 \n \n \n Considering you and others see non-acceptance of lifestyle as discrimination it wold make me feel paranoid too. Other disorders such as ADHD, dyslexia, and pyromania face discrimination as well. They don't ask us to make laws to enable their disorder. \n \n Also this paranoia of homophobia cold be a considerable factor", 
   {}, 
   59129, 
   null, 
   1091192280.0
  ], 
  [
   60350, 
   null, 
   "mana'ia", 
   "These posts were posted by myself on another thread, but also address the issues on this thread...\n \n http://4forums.com/political/showpost.php?p=59080&postcount=594\n \n http://4forums.com/political/showpost.php?p=59127&postcount=605\n\n It only refvers to factors but it still doesn't show taht even if those faactors were eliminated that there would still not exist the probelm. It actually shows that there still exists but not at the same levels.", 
   {}, 
   59130, 
   null, 
   1091192400.0
  ], 
  [
   60351, 
   null, 
   "mana'ia", 
   "DIEASES IS IRREVELANT TO MARRIAGE!!!\n \n mana'ia: Most of your arguments are fallacies. Primarily this one: \n \n Slippery Slope Fallacy (Camel's Nose) \n there is an old saying about how if you allow a camel to poke his nose into the tent, soon the whole camel will follow. \n \n The fallacy here is the assumption that something is wrong because it is right next to something that is wrong. Or, it is wrong because it could slide towards something that is wrong. \n \n For example, \"Allowing abortion in the first week of pregnancy would lead to allowing it in the ninth month.\" Or, \"If we legalize marijuana, then more people will try heroin.\" Or, \"If I make an exception for you then I'll have to make an exception for everyone.\"\n\n \n First off before you can call it a fallacy you should prove it's a fallacy.\n \n You heard that argument or analogy on TV. It's not very accurate. If it is then you are agreeing that the camel's nose (homosexuality) is connected to the body(other deviant behaviors).\n \n In America if we set out a criteria to allow something or accept, or qualify something then we must also allow anything else that meets or qualifies under that criteria.\n \n If we setout a criteria to allow homosexuality then any behavior that fits that same criteria must also be allowed or it's unconsitutional for all behaviors in taht category.", 
   {}, 
   59131, 
   null, 
   1091192640.0
  ], 
  [
   60352, 
   null, 
   "mana'ia", 
   "Being very new to this board I have spent some time reading different threads and the arguments agaist homosexuality. Mana'ia and others seem to have this dooms day view of homosexuality. It is unhealthy and kills people...blah..blah ..blah. Then we hear how gay marriage will destroy the institution of marriage......blah..blah.\n \n Funny how a group of people who seemingly make up such a small percentage of the population have so much power over the course of the world.\n\n \n \n No we don't ahve this dooms' day approach. We ahve this commonsense approach.\n \n You don't have control over us. Only in less than 10% of the countries worldwide do gays have the right to marry.", 
   {}, 
   59134, 
   null, 
   1091192760.0
  ], 
  [
   60353, 
   null, 
   "mana'ia", 
   "ya know joebrummer, you got a point. \n \n What interests me is that many (if not all but one) of their points apply to straights yet they aren't including straights in their quest to deny marriage.\n\n For example?\n Also the benefits of heterosexuality outweigh the risk and teh risk isn't as high.", 
   {}, 
   59136, 
   null, 
   1091192820.0
  ], 
  [
   60354, 
   null, 
   "Tastyfish", 
   "But you are defining wierd things along the same guidelines or using such broad defintions of the type of thing homsexuality fits that the argument just becomes nonsense.\n Its the same as saying \"people who go to church are taught to follow God's rules, therefore they will do whatever anyone tells them as these will also be rules\".", 
   {}, 
   60351, 
   null, 
   1091192820.0
  ], 
  [
   60355, 
   null, 
   "mana'ia", 
   "I watched the Senate hearings on TV and was amazed at Hilary Clinton asking why amedments were not passed years ago when the divorce rate reached 50%? I say we ban divorce. Let have an amedment to ban divorce. If marriage is the staple of this society and has such sanc-taa-tee then lets make sure we really protect it...ban divorce. If Britney want to go marry someone on the spur of the moment by an Elvis look alike then letter sleep in the bed she made. \n \n What would be a practical solution to preventing the NEED for divorce?\n \n Divorce is important when the members are no longer functioning as they had promised to do. If don't want to fulfill their obligations then forcing them to stay married won't do that. Better a hppy divorce than a bad marriage. \n \n Also her rhetoric about case law is so funny. Anyone that believes case law will do anyting to the supreme court is very uninformed.\n \n \nI also saw Rick Santorum speak about how married people live longer, take fewer risks, suffer less depression. All the wonderful benefits of marriage....then explain why we should deny that happiness to a whole segment of the population.\n\n Homosexuality wouldn't be changed by marraige. They still face the same problems. Comparing non-married heterosexuals to married heterosexuals is different than comparing married homosexuals to single heterosexuals.\n \n \nStraight people crack me up!\n\n \n Just trying to make you smile", 
   {}, 
   59255, 
   null, 
   1091193120.0
  ], 
  [
   60356, 
   null, 
   "Tastyfish", 
   "Homosexuality wouldn't be changed by marraige. They still face the same problems. Comparing non-married heterosexuals to married heterosexuals is different than comparing married homosexuals to single heterosexuals.\n\n Any reason why?", 
   {}, 
   60355, 
   null, 
   1091193240.0
  ], 
  [
   60419, 
   null, 
   "JakeCJB", 
   "That doesn't fit under the same standard you're asking for homosexuality.\n\n \n Funny, you're the one who keeps bringing up cannibalism.\n \n \nFunny how you manipulated. You keep making arguments of genetics but you present evidence of behavior. They contract aids due to behavior from infidelity and fornication which I would support banning.\n\n \n Everyone contracts HIV from unsafe sex practices, not from being African American, or white not from being gay or straight.", 
   {}, 
   60345, 
   null, 
   1091225640.0
  ], 
  [
   60421, 
   null, 
   "JakeCJB", 
   "1291 \n \n Remeber these are only factors. Even in the netherlands they still have higher rates even if they are more accepted.\n\n \n Check out the bottom links at this link...\n \n http://4forums.com/political/showpost.php?p=59127&postcount=605\n \n Netherlands has its problems.\n \n \nAlso this paranoia of homophobia cold be a considerable factor\n\n \n If that's true, it wouldn't be homosexuality itself that's the problem.", 
   {}, 
   60348, 
   null, 
   1091226120.0
  ], 
  [
   60423, 
   null, 
   "JakeCJB", 
   "In America if we set out a criteria to allow something or accept, or qualify something then we must also allow anything else that meets or qualifies under that criteria.\n \n If we setout a criteria to allow homosexuality then any behavior that fits that same criteria must also be allowed or it's unconsitutional for all behaviors in taht category.\n\n \n That's why we allow homosexuality and heterosexuality, because both involve the criteria of men and women being in love with their man or woman partner.", 
   {}, 
   60351, 
   null, 
   1091226900.0
  ], 
  [
   60430, 
   null, 
   "Bush Is The Man", 
   "Funny, you're the one who keeps bringing up cannibalism.\n Everyone contracts HIV from unsafe sex practices, not from being African American, or white not from being gay or straight.\n\n \n \n Or from needles, coming into contact with infected blood, etc. Not just sex. However, the rise in percentage of AIDs diagnoses in gays is 17 times worse than in heterosexuals.", 
   {}, 
   60419, 
   null, 
   1091228940.0
  ], 
  [
   60447, 
   null, 
   "joebrummer", 
   "Or from needles, coming into contact with infected blood, etc. Not just sex. However, the rise in percentage of AIDs diagnoses in gays is 17 times worse than in heterosexuals.\n\n \n \n 17 times worse? Source? Where are the numbers bot. Can't quotes statistics without a source!!!!!", 
   {}, 
   60430, 
   null, 
   1091240880.0
  ], 
  [
   60479, 
   null, 
   "Tastyfish", 
   "That will be a population thing due to the fact in started in the gay community and reached higher levels there before any real action was taken. Its just due to the fact that there is a greater precentage of gay men with HIV than heterosexual ones, it isn't really much to do with the practices at all if done safely.", 
   {}, 
   60447, 
   null, 
   1091272260.0
  ], 
  [
   60553, 
   null, 
   "Duo_Maxwell", 
   "Or from needles, coming into contact with infected blood, etc. Not just sex. However, the rise in percentage of AIDs diagnoses in gays is 17 times worse than in heterosexuals.\n\n \n Irrelevant to marriage. Diease is not a viable ground for denying marriage to anyone. If we used that logic, that if someone has a high probability of contracting a dieases, millions of straight Americans would be denied marriage, and many more would have their marriages nullified, not to mention that all needle users would be denied, as well as hospital staff and people with heretidtary dieases. Notice how the antis ignore that to suit their arguments. \n \n Diease has no bearing to marriage until the same standard applies to all. \n \n Remember, every anti- argument boils down to lies, fallacies and majority oppression.", 
   {}, 
   60430, 
   null, 
   1091336700.0
  ], 
  [
   60573, 
   null, 
   "mana'ia", 
   "Any reason why?\n\n IT is the behavior of homosexuality that is cause of the problems. For everyone else it is the stability, quality of life, and family life that improves of their already well adjeusted life that improves their quality of life.", 
   {}, 
   60356, 
   null, 
   1091356320.0
  ], 
  [
   60574, 
   null, 
   "mana'ia", 
   "Funny, you're the one who keeps bringing up cannibalism.\n\n I only it up to point out behavior the is for self gratification that doesn't hurt anyone directly 9assuming the person is dead and consented before death)\n \n \n\n Everyone contracts HIV from unsafe sex practices, not from being African American, or white not from being gay or straight.\n\n Gay sex for males is the most unhealthy becasue of the damage done to the tissues and organs.", 
   {}, 
   60419, 
   null, 
   1091356560.0
  ], 
  [
   60575, 
   null, 
   "mana'ia", 
   "Check out the bottom links at this link...\n \n http://4forums.com/political/showpost.php?p=59127&postcount=605\n \n Netherlands has its problems.\n\n \n The link shows that even in the netherlands where it is generally accepted there is stil discrimination of gays. Nothing about homophobia. Also minorities are generally accepted in teh US and we aren't accepted either.\n \n \n \nIf that's true, it wouldn't be homosexuality itself that's the problem.\n\n If homosexuality is causing paranoia then yes it is homosexuality.", 
   {}, 
   60421, 
   null, 
   1091356680.0
  ], 
  [
   60576, 
   null, 
   "mana'ia", 
   "That's why we allow homosexuality and heterosexuality, because both involve the criteria of men and women being in love with their man or woman partner.\n\n Teh government only allows certain practices of heterosexual activiity. None of the criterias involve the term of love being a criteria. If a prostitute loves her customer they still can't have sex doe monwy.", 
   {}, 
   60423, 
   null, 
   1091357100.0
  ], 
  [
   60598, 
   null, 
   "JakeCJB", 
   "IT is the behavior of homosexuality that is cause of the problems. For everyone else it is the stability, quality of life, and family life that improves of their already well adjeusted life that improves their quality of life.\n\n \n Homosexuality involves many behaviours, including behaviours of stability, quality of life and family life.", 
   {}, 
   60573, 
   null, 
   1091372520.0
  ], 
  [
   60601, 
   null, 
   "JakeCJB", 
   "I only it up to point out behavior the is for self gratification that doesn't hurt anyone directly 9assuming the person is dead and consented before death)\n\n \n Many behaviours could fall into that category, including one's that don't hurt anyone, period. You're just being too broad, as I believe Tastyfish indicated.\n \n \nGay sex for males is the most unhealthy becasue of the damage done to the tissues and organs.\n\n \n I practice \"gay male sex\", a broad category, all the time, and I've never had any damage to my tissues or organs. What I do or don't do is my business. There are many heterosexuals who do the same types of activities. No one is discriminating against them.", 
   {}, 
   60574, 
   null, 
   1091372880.0
  ], 
  [
   60602, 
   null, 
   "JakeCJB", 
   "Teh government only allows certain practices of heterosexual activiity.\n\n \n And only certain practices of homosexual activity.\n \n \nNone of the criterias involve the term of love being a criteria.\n\n \n Certainly, taking responsibility for one man or one woman is a criteria.\n \n \nIf a prostitute loves her customer they still can't have sex doe monwy.\n\n \n No, but she could marry that person. Although, I can't see a lot of prostitutes wanting to marry their customers, as they may have to do it for free. So what do prostitutes have to do with anything?", 
   {}, 
   60576, 
   null, 
   1091373180.0
  ], 
  [
   60603, 
   null, 
   "JakeCJB", 
   "The link shows that even in the netherlands where it is generally accepted there is stil discrimination of gays. Nothing about homophobia.\n\n \n Bigotry than, or whatever you want to call it.\n \n \nAlso minorities are generally accepted in teh US and we aren't accepted either.\n\n \n What?\n \n \nIf homosexuality is causing paranoia then yes it is homosexuality.\n\n \n The studies didn't show that. All one has to do is look at some of the hate in this forum to see that it maybe isn't so paranoid.", 
   {}, 
   60575, 
   null, 
   1091373720.0
  ], 
  [
   60622, 
   null, 
   "Duo_Maxwell", 
   "mana'ia: I CHALLENGE you to prove why gays should be denied marriage on the grounds of diease but straights shouldn't. \n \n Seeing how you have avoided EVERY post detailing the compelete lack of logic behid the disease argument, you'll ignoring this one too.", 
   {}, 
   60603, 
   null, 
   1091410680.0
  ], 
  [
   60998, 
   null, 
   "mana'ia", 
   "mana'ia: I CHALLENGE you to prove why gays should be denied marriage on the grounds of diease but straights shouldn't. \n \n Seeing how you have avoided EVERY post detailing the compelete lack of logic behid the disease argument, you'll ignoring this one too.\n\n The act of homosexuality (which is the behavior that defines a homosexual) is very risky causing gential, anal, and organ damage. Ot give them the recognition would mean other less harmful behavior hsould be granted as well.", 
   {}, 
   60622, 
   null, 
   1091666220.0
  ], 
  [
   60999, 
   null, 
   "mana'ia", 
   "Irrelevant to marriage. Diease is not a viable ground for denying marriage to anyone. If we used that logic, that if someone has a high probability of contracting a dieases, millions of straight Americans would be denied marriage, and many more would have their marriages nullified, not to mention that all needle users would be denied, as well as hospital staff and people with heretidtary dieases. Notice how the antis ignore that to suit their arguments. \n \n Diease has no bearing to marriage until the same standard applies to all. \n \n Remember, every anti- argument boils down to lies, fallacies and majority oppression.\n\n It is if the behavior in and of itself is risky and the risks outweight the benefits. Promiscuity causes rates in straight to rise. Marriage counters that. The act itself is not risky. We look at the risk and the benefits. The risks for one behaior is substantially hgiher than the risk of another behavior.", 
   {}, 
   60553, 
   null, 
   1091666460.0
  ], 
  [
   61004, 
   null, 
   "JakeCJB", 
   "The act of homosexuality (which is the behavior that defines a homosexual) is very risky causing gential, anal, and organ damage.\n\n \n Any form of sex can be risky. Gay people in general, are not damaged by the wide range of sexual activities they engage in.\n \n \nOt give them the recognition would mean other less harmful behavior hsould be granted as well.\n\n \n I don't understand what you mean.", 
   {}, 
   60998, 
   null, 
   1091668020.0
  ], 
  [
   61006, 
   null, 
   "JakeCJB", 
   "It is if the behavior in and of itself is risky and the risks outweight the benefits. Promiscuity causes rates in straight to rise. Marriage counters that. The act itself is not risky. We look at the risk and the benefits. The risks for one behaior is substantially hgiher than the risk of another behavior.\n\n \n Right, the act itself doesn't cause it. Only heterosexual marriage counters the act that doesn't cause it, through some mythical process.", 
   {}, 
   60999, 
   null, 
   1091668200.0
  ], 
  [
   61154, 
   null, 
   "Duo_Maxwell", 
   "The act of homosexuality (which is the behavior that defines a homosexual) is very risky causing gential, anal, and organ damage. Ot give them the recognition would mean other less harmful behavior hsould be granted as well.\n\n \n The act of heterosexuality (which is the behavior that defines a heterosexual)is very risky causing gential, anal, and organ damage. Ot give them the recognition would mean other less harmful behavior hsould be granted as well.\n \n That proves nothing. If there is a risk we should now ban straight marriages. People with hereditary dieases, with a FULL 100% chance of getting them, the ULTIMATE risk, are allowed to marry. Why can't someone with a less propbability marry? You have failed. Miserably. Dieases is not a issue, nor should it be until it applies to straights. \n \n \nIt is if the behavior in and of itself is risky and the risks outweight the benefits.\n\n \n Same can be easily said for straights. \n \n \nPromiscuity causes rates in straight to rise. Marriage counters that. The act itself is not risky. We look at the risk and the benefits. The risks for one behaior is substantially hgiher than the risk of another behavior.\n\n \n And the risk for letting straights with hereditary dieasese to propagate is substantially higher then the risk of any other behavior. Yet you don't say anything about that. You have proven nothing. \n \n I ask again, and I know you will FAIL MISERABLY AND HORRIBLY LIKE ALL YOUR GAY ARGUMENTS, why should we ban gays marriage on the grounds of diease and not straights?", 
   {}, 
   61006, 
   null, 
   1091749680.0
  ], 
  [
   61295, 
   null, 
   "mana'ia", 
   "Any form of sex can be risky. Gay people in general, are not damaged by the wide range of sexual activities they engage in.\n\n In general according to statistics, yes they are.\n \n Most STIs can be transmitted by anal or rectal contact. Anal sex is especially risky for transmission of STIs such as HIV because inserting and thrusting the penis or other objects in the anus can cause tears and bleeding in the rectum, facilitating transfer of blood-borne germs. Intestinal infections and diarrheal diseases can also be transmitted by anal and rectal contact. \n \n \n http://www.engenderhealth.org/res/onc/sexuality/response/pg7.html\n \n \nI don't understand what you mean.\nIF risky behavior is admitted what would prevent other less risky behavior from being recognized as well?", 
   {}, 
   61004, 
   null, 
   1091829900.0
  ], 
  [
   61298, 
   null, 
   "mana'ia", 
   "Right, the act itself doesn't cause it. Only heterosexual marriage counters the act that doesn't cause it, through some mythical process.\n\n I should have stated that since most people that our promiscuous don't marry or have no plans to marry they are hurting themselves. However homosexuality in and of itself does generally cause harm thourgh tearing of tissues and damage to organs.", 
   {}, 
   61006, 
   null, 
   1091830020.0
  ], 
  [
   61300, 
   null, 
   "mana'ia", 
   "That proves nothing. If there is a risk we should now ban straight marriages. People with hereditary dieases, with a FULL 100% chance of getting them, the ULTIMATE risk, are allowed to marry. Why can't someone with a less propbability marry? You have failed. Miserably. Dieases is not a issue, nor should it be until it applies to straights. \n \n This wasn't about disease. It was about damage to tissues and organs.\n \n \n \nSame can be easily said for straights. \n \n BUt it wouldn't be true and has no basis. Heterosexual sex is less risky and ther is always the benefit of children that it creates.\n \n \n \nAnd the risk for letting straights with hereditary dieasese to propagate is substantially higher then the risk of any other behavior. Yet you don't say anything about that. You have proven nothing. \n \n I ask again, and I know you will FAIL MISERABLY AND HORRIBLY LIKE ALL YOUR GAY ARGUMENTS, why should we ban gays marriage on the grounds of diease and not straights?\n\n First off it wasn't about disease it was about tissue and organ damage. However since youbrought it up. Giving birth and passing diseases thourgh risky behavior are two different things. A child that has a hereditary disesase may encounter lesser quality of life however he can only spread it thourgh procreation. As someone infected can spread it multiple times a day. Also it is harder to get pregnant than pass a disease. Furthermore contraceptives have a 98%-100% effictiveness. There is exist no contraceptive that can make it that high in prevention. You can plan families but you cna't plan infection while engaging in anal and other forms of gay sex.", 
   {}, 
   61154, 
   null, 
   1091830440.0
  ], 
  [
   61314, 
   null, 
   "JakeCJB", 
   "In general according to statistics, yes they are.\n \n Most STIs can be transmitted by anal or rectal contact. Anal sex is especially risky for transmission of STIs such as HIV because inserting and thrusting the penis or other objects in the anus can cause tears and bleeding in the rectum, facilitating transfer of blood-borne germs. Intestinal infections and diarrheal diseases can also be transmitted by anal and rectal contact. \n \n \n http://www.engenderhealth.org/res/onc/sexuality/response/pg7.html\n \n IF risky behavior is admitted what would prevent other less risky behavior from being recognized as well?\n\n \n Your link did not show that gay men are damaged in general, by sexual activity. It showed many forms of sex that have risk, and discussed ways to reduce the risk, such as using condoms. The only activity without any risk was masturbation. So risky behaviour is already accepted, since we accept more than masturbation.", 
   {}, 
   61295, 
   null, 
   1091833380.0
  ], 
  [
   61316, 
   null, 
   "JakeCJB", 
   "I should have stated that since most people that our promiscuous don't marry or have no plans to marry they are hurting themselves.\n\n \n That's really just a statement of your own personal morality. \n \n \nHowever homosexuality in and of itself does generally cause harm thourgh tearing of tissues and damage to organs.\n\n \n And vagina intercourse is more risky, especially for the woman, than masturbation. There are ways to reduce the risk in cases of vaginal or anal, like using condoms.\n \n We don't base rights based on your measures, which come from your own personal anti-gay bias, that only apply to gay people, but do not apply to straight people when they do something risky.", 
   {}, 
   61298, 
   null, 
   1091834400.0
  ], 
  [
   61320, 
   null, 
   "JakeCJB", 
   "This wasn't about disease. It was about damage to tissues and organs.\n\n \n You have a very strange interest.\n \n \nBUt it wouldn't be true and has no basis. Heterosexual sex is less risky and ther is always the benefit of children that it creates.\n\n \n There you go again. Of course, heterosexual sex is risky. In fact, the more I read this post, and other posts, it seems like you have a need to convince yourself with these types of arguments. Why do you care about these things so much? How would it affect the life of a heterosexual? If heterosexuals are so pure and don't catch colds, never damaged a tissue, why do you care so much about these things involving a gay person's life? \n \n Children are not a benefit. Raising good, healthy, happy children who feel they are loved and accepted, whether they are gay or straight is a benefit.\n \n \nFirst off it wasn't about disease it was about tissue and organ damage.\n\n \n But what do you care?\n \n \nHowever since youbrought it up. Giving birth and passing diseases thourgh risky behavior are two different things. A child that has a hereditary disesase may encounter lesser quality of life however he can only spread it thourgh procreation. As someone infected can spread it multiple times a day.\n\n \n Yes, those people who spread colds and viruses are much more evil.\n \n \nAlso it is harder to get pregnant than pass a disease.\n\n \n Which is why nature meant for us to be more diseased than pregnant.\n \n \nFurthermore contraceptives have a 98%-100% effictiveness. There is exist no contraceptive that can make it that high in prevention. You can plan families but you cna't plan infection while engaging in anal and other forms of gay sex.\n\n \n You can plan infection by lowering your risk as a gay person, many different ways, while still having gay sex.", 
   {}, 
   61300, 
   null, 
   1091836320.0
  ], 
  [
   61352, 
   null, 
   "Duo_Maxwell", 
   "mana'ia: You'd think you'd have a decent argument after all this time....but sadly you don't. \n \n \nThis wasn't about disease. It was about damage to tissues and organs.\n\n \n When did risk = automatic damage? Besides, straights are just as easily damaged as gays through diease. The point is moot. \n \n \nBUt it wouldn't be true and has no basis. Heterosexual sex is less risky and ther is always the benefit of children that it creates.\n\n \n Prove it. If you can. Remember, most, if not all of your stastistcs, like the rest of your arguments have been blown out of the water or shown to be lies. Besides, you were talking about risk, now about damage, what is it going to be flip flopping mana'ia? As for the benefit of children, how does increasing more mouths in a world of vastly decreasing resources as well as in a world where 40,000 children die a day beneficial? \n \n \nFirst off it wasn't about disease it was about tissue and organ damage. However since youbrought it up. Giving birth and passing diseases thourgh risky behavior are two different things.\n\n \n You still haven't said why disease is a valid reason to denying anything. \n \n \nA child that has a hereditary disesase may encounter lesser quality of life however he can only spread it thourgh procreation.\n\n \n Not if he doesn't live past 10. Many hereditary dieases kill their carriers before puberty, many render their hosts incapable of doing anything. What kind of sick person wants a child to live with a life threatening hereditary diease? emoticon_wow \n \n \nAs someone infected can spread it multiple times a day. Also it is harder to get pregnant than pass a disease.\n\n \n That's questionable, and you know it. You can get pregnant on a single act. You can also get a disease on a single act. \n \n [quopte]Furthermore contraceptives have a 98%-100% effictiveness. There is exist no contraceptive that can make it that high in prevention. You can plan families but you cna't plan infection while engaging in anal and other forms of gay sex.[/quote]\n \n Condoms have a rate of 97%+ of stopping STDs and pregnancy. Oh wait, you're wrong, that's becomming quite apparent to me in many threads. You assume all gay sex passes disease. You assume all straight does not pass diease. You assume all straights use condoms and contraceptives, yet gays don't use condoms. Is that not true? That is naive as well as ignorant.", 
   {}, 
   61320, 
   null, 
   1091873940.0
  ], 
  [
   61824, 
   null, 
   "opinionated", 
   "hey\n i am a 15 year old girl and i am not gay or less. i dont really know where you were going with the statments that u made. i couldnt tell weather you were for or aginst gays or if you were just stating not so factual facts. you seemed to be leaning a little bit more twords being aginst it tho from what i could tell and i would just like to respond to some of your comments. first tho, i would just like to point out that in a lot of your statments you sayed things like pretty much, debatable, and not really sure bout this one. i am greatfull to see that you said that it was debatale tho. but to debate what you seemed to think was not debatalble id like to say that i dont know were in the bible it says \"you cant be gay, its not right and its agints my better judgment.\" i am a christian and i go to church every sunday but i still belive that its ok for gays to begay and stuff. it does not say ne were that they cant be!\n \n \nWell, good to see the 'I'm not gay' bit before stating that you beleive it is morally and socially wrong, because, with that bit there you almost fooled me there emoticon_rolleyes \n \n Anyway, main justifiable reasons...\n \n The bible says it is wrong - pretty much in the clear here, some debate whether all the bits people quote as refering purely to homosexuality (unlikely, fair bit is mistrasnlation and associatations with other things but then again, some is probably definitely homophobic). Again, you can argue how relevant it really is today anyway and there is also a lot of other crazy laws in there. But the Bible is generally quite clear on the matter that it is a Bad Thing at least somewhere in there (both old and new testaments if it matters to you).\n \n That is really about it properly, the rest is a bit more debatable and is full of squewed stats and opinions from both sides half the time, but it generally boils down to:\n \n Increased chance of disease - (at least in male/male relationships, female/female is probably lower), various reasons from the fact that AIDS entered the homosexual popualtion first and was ignored while it spread and so affected a large number of a small minority, spread a little through the straight population but not as fast (as condoms would have been used more and fewer people have it). Also some issues assocaited with anal sex in general, though these are reasons not exclusive to gays by any means.\n \n Increased violence in gay couples - again debatable, partly because the realtionships can be between two men where you would expect a slightly higher rate of violence and also because other (unrelated studies) show that a massive amount of male/female domestic violence goes unreported or is misinterpretted. However you have to look at the stats and say that this is still a very small minority of people out of a majority, is it really an issue worth legislating over - being gay doesn't make you violent, prison stats would reflect this. \n \n Decreased life expectancy - not really sure whether I count this one, but have put it in for good measure. Is debatable as the studies posted here are horribly flawed (one has actually nothing to do with it almost) and involve bad data gathering (like just using obituaries from the back of some gay magazines). Not sure what it is like adjusted for the prevelance of AIDS either amoung the population. However it seems mental problems are slightly more common like depression, again though this leads to some odd conclusions - either it is not actually the being gay that is causing this but instead the lack of acceptance, etc or it is actually being gay that makes you susepatable to depression and imbalance but that would mean it is a neurological condition and then naturally occuring. No proof for either of these really I've seen.\n \n Relationships don't last as long - again another maybe, due to bad sampling of behalf of the study that came up with the conclusion. However I could see the general lack of children and/or marriage as contributing to this. So while true can not really be used as a reason against gay adoption/IVF or marriage in my opinion at the moment until a decent study is done.\n \n Things that aren't issues but still get brought up, don't use these.\n \n Its a disorder therefore bad - it has to be bad to be a disorder, circular argument based around two different defintions of disorder (i.e uncommon and the real clinical one)\n \n Gays are more likley to use drugs - statiscally yes, but irrelevant, being gay doesn't make you use drugs or really even predispose you to being effected by them. Could be due to a wide range of data collecting errors (i.e using 'gay clubs and bars as a population sample' and the age of finding people).\n \n Ick, its nasty - Seems to be one of the more common basis of some beleifs as well combine with religion. Well, so says you anyway, I would hazard a guess that bisexuals and homosexuals do not agree with you here. I don't like anal sex and think its a bit gross, but I hardly think it is a reason to legislate against it.\n \n It not natural - well, it seems it is. Lots of reports, thousands of hours of video footage and a gay gene in Drospholia , homosexuality does occur naturally. In humans again its still not known, seems there is no gay gene, but that doesn't make it genetic as there are very few genes for something specific, most stuff is based off a large number all interacting to various amounts. There is also ways that homosexuality can be made evolutionarily favourable (Basically it has another effect in one of the sexs that makes up for the other not reproducing. Male homosexuality woud make sense in a primate hareem system where few of the males mate anyway but all the females do, an advatage to females would be of more benefit that males.)\n \n If everyone were gay, the human race would die out - well, duh. If everyone was a women we would still die out. \n \n Sodomy is as addictive as heroin - getting silly now. Just no. Seen it brought up here before though, so included it for some light relief.\n", 
   {
    "post_info": {
     "post_title": "compleetly diffrent opinion"
    }
   }, 
   54598, 
   null, 
   1092278340.0
  ], 
  [
   61862, 
   null, 
   "Jaaaman", 
   "Acceptance of gay marriage will strengthen the notion that marriage is primarily about adult yearnings for intimacy and is not essentially connected to raising children. Children will be hurt by those who will too easily bail out of a marriage because it is not \"fulfilling\" to them.", 
   {}, 
   61824, 
   null, 
   1092318240.0
  ], 
  [
   61907, 
   null, 
   "joebrummer", 
   "Acceptance of gay marriage will strengthen the notion that marriage is primarily about adult yearnings for intimacy and is not essentially connected to raising children. Children will be hurt by those who will too easily bail out of a marriage because it is not \"fulfilling\" to them.\n\n \n \n \n \n What about all the children being raised by gay and lesbian parents. NOT allowing gay marriage hurts them. Why is it you fail to acknowledge that. Those kids deserve protection under the law. So do their families. Currently they do not have protections afforded to straight couples. \n \n Marriage is a civil contract binding to adults including some to old to have children. So yes, it is about intimacy and EQUAL PROTECTION UNDER THE LAW.", 
   {}, 
   61862, 
   null, 
   1092339240.0
  ], 
  [
   61943, 
   null, 
   "Duo_Maxwell", 
   "Marriage was never about raising children. The original creators of marriage, Pagans, had little intention of using marriage to raise children. The Christian church, who performed gay marriages, obviously must have no thought that marriage had to do with raising children, and you, nor your partner in crime, have been able to refute that marriage isn't for raising children. So your point is moot, like usual.", 
   {}, 
   61907, 
   null, 
   1092353160.0
  ], 
  [
   62292, 
   null, 
   "mizmaxx", 
   "Marriage was never about raising children. The original creators of marriage, Pagans, had little intention of using marriage to raise children.\n\n As I said (I think in another thread), it's telling that the Catholic Church actually had no interest in marriage or marriage rites (originally hand-fasting or a similar ceremony) until well into the 16th century. \n \n As you say, marriage in ancient and medieval Europe was a pagan thing, like how harvest festivals were pagan things. The Church in it's attempt to control all aspects of peasant life devised quasi-Christian rituals later (blessing the crops, wedding ceremonies, etc), because it couldn't get rid of these practices entirely, but these were pagan in origin.\n \n \nPromiscuity causes rates in straight to rise. Marriage counters that. \n\n Yikes... Er, have you heard what adultery rates are these days? Marriage doesn't \"counter\" anything. If ppl choose to be monogamous (or not) they will be, with or without a wedding.", 
   {}, 
   61943, 
   null, 
   1092555660.0
  ], 
  [
   62331, 
   null, 
   "CCR1994", 
   "What about all the children being raised by gay and lesbian parents. NOT allowing gay marriage hurts them. Why is it you fail to acknowledge that. Those kids deserve protection under the law. So do their families. Currently they do not have protections afforded to straight couples. \n\n \n Points well taken but now here's a problem. Not allowing gays to marry would deny their children certain legal protections and benefits but is it not also true that straight couples who CHOOSE not to marry would deny their children the same? If protecting children is important, then why not simply stipulate that any adult or couple that have children should get the same benefits and protections regardless of marital status?", 
   {}, 
   61907, 
   null, 
   1092596760.0
  ], 
  [
   62344, 
   null, 
   "joebrummer", 
   "Points well taken but now here's a problem. Not allowing gays to marry would deny their children certain legal protections and benefits but is it not also true that straight couples who CHOOSE not to marry would deny their children the same? If protecting children is important, then why not simply stipulate that any adult or couple that have children should get the same benefits and protections regardless of marital status?\n\n \n \n Doesn't work that way. Gay parents don't have the ability to adopy each others kids in many states. Straight unmarried couples have that choice. Straight unmarried couples also have marriage as a choice, gays do not.\n \n In many cases of gay parents the law doesn't recognize one of the parents because they don't recognize the relationship in any legal way.", 
   {}, 
   62331, 
   null, 
   1092608880.0
  ], 
  [
   63506, 
   null, 
   "mana'ia", 
   "Your link did not show that gay men are damaged in general, by sexual activity. It showed many forms of sex that have risk, and discussed ways to reduce the risk, such as using condoms. The only activity without any risk was masturbation. So risky behaviour is already accepted, since we accept more than masturbation.\n\n They showed forms of sex yes. These are the forms most practiced by homosexuals. Masterbation is asexual.", 
   {}, 
   61314, 
   null, 
   1093159980.0
  ], 
  [
   63507, 
   null, 
   "mana'ia", 
   "[QUOTE]\nThat's really just a statement of your own personal morality. \n \n No it's based on reality.\n \n \nAnd vagina intercourse is more risky, especially for the woman, than masturbation. There are ways to reduce the risk in cases of vaginal or anal, like using condoms.\n\n Msterbation is asexual. However Lesbian sex utilizing many forms of vagina sex is rsiky and no condom is made for hands. Gloves could reduce the damage but it is the shape and size of the hand itself tht does the damage. Anal sex riisks can be reduced but not prevented.\n \n \n \n \nWe don't base rights based on your measures, which come from your own personal anti-gay bias, that only apply to gay people, but do not apply to straight people when they do something risky.\n\n No we base rights on an objective criteria. Our critereia applies to gays like it applies to prostitution and polygamy.", 
   {}, 
   61316, 
   null, 
   1093160220.0
  ], 
  [
   63508, 
   null, 
   "mana'ia", 
   "You have a very strange interest.\n\n Maybe but I'm interested in spociety. Why do I care about prostitution or consensual cannibalism?\n \n \n \n \nThere you go again. Of course, heterosexual sex is risky. In fact, the more I read this post, and other posts, it seems like you have a need to convince yourself with these types of arguments. Why do you care about these things so much? How would it affect the life of a heterosexual? If heterosexuals are so pure and don't catch colds, never damaged a tissue, why do you care so much about these things involving a gay person's life? \n \n Children are not a benefit. Raising good, healthy, happy children who feel they are loved and accepted, whether they are gay or straight is a benefit.\n\n Heterosexual sex isn't nealry as risky as homosexual sex. Perpetuating our species is a benefit. You can't raise healthy children unless you create them. Also heterosexual homes are generally shown to be better than any other family. \n \n Gay sex in general is by nature of the activity going to cause problems. \n \n \n \n \nBut what do you care?\n\n REAd above\n \n \nYes, those people who spread colds and viruses are much more evil.\n Yes that is why we quaratine people, palnts, and animals and don't allow for people to doante tainted blood.\n \n \n \n \nWhich is why nature meant for us to be more diseased than pregnant.\n Waht are you insisnuating?\n \n \n \n \nYou can plan infection by lowering your risk as a gay person, many different ways, while still having gay sex.\n\n yes you can if you're monogamous. However the lifestyle of gays generally leads them to not be.", 
   {}, 
   61320, 
   null, 
   1093160760.0
  ], 
  [
   63509, 
   null, 
   "mana'ia", 
   "mana'ia: You'd think you'd have a decent argument after all this time....but sadly you don't. \n \n It only seems that way because you still don't comprehend the argument.\n \n \n \n\n When did risk = automatic damage? Besides, straights are just as easily damaged as gays through diease. The point is moot. \n \n Then we should just let everyone speed on the freeway at 100mph or let people go boating as fast as they cna and as close as they can to anyoen they want. Also we shouldn't worry about checking blood to see if it is tainted and remove safety caps becasue the risk does nto mean automatic damage and the point is moot right.\n \n \n \nProve it. If you can. Remember, most, if not all of your stastistcs, like the rest of your arguments have been blown out of the water or shown to be lies. Besides, you were talking about risk, now about damage, what is it going to be flip flopping mana'ia? As for the benefit of children, how does increasing more mouths in a world of vastly decreasing resources as well as in a world where 40,000 children die a day beneficial? \n \n \n You keep making these statements as if they're factual and never back them up.\n \n Perpetuating our species will prevent mankind from disappering is a beneficail thing especially wiht 40,000 dying a day we need to keep producing.\n How does civilization survive without future generations?\n \n \n \nYou still haven't said why disease is a valid reason to denying anything. \n \n Disease is a danger to the public so that is why we quaratine and prevent practices such as reusing needles to prevent disease. The public interest is always first concern. \n \n \n \nNot if he doesn't live past 10. Many hereditary dieases kill their carriers before puberty, many render their hosts incapable of doing anything. What kind of sick person wants a child to live with a life threatening hereditary diease? \n \n No one can know how a child will live. I bet the child is gald that they are alive. They might not like the situation or their health condition but I bet overall children and their families are glad they are together. Many diseases in the past were terminal but now we have technology to allow most of them to live long lives and good lives. So it isn't sick to think that a child might be born sick, it's optimistic to think that they might not and that science will provide a way.\n \n \n \nThat's questionable, and you know it. You can get pregnant on a single act. You can also get a disease on a single act. \n \n \n \n [quopte]Furthermore contraceptives have a 98%-100% effictiveness. There is exist no contraceptive that can make it that high in prevention. You can plan families but you cna't plan infection while engaging in anal and other forms of gay sex.[/quote]\n \n \nCondoms have a rate of 97%+ of stopping STDs and pregnancy. Oh wait, you're wrong, that's becomming quite apparent to me in many threads. You assume all gay sex passes disease. You assume all straight does not pass diease. You assume all straights use condoms and contraceptives, yet gays don't use condoms. Is that not true? That is naive as well as ignorant.\n\n \n My point is that gay sex is by nature riskier and more damaging than traditional sex. Also that gay sex because of the nature of the sex has a higher transmission rate than traditional rate. Also there is no benefit except personal gratification.\n \n \n You also need to take the whole process slowly, as it is generally more difficult to insert the penis into the anus than into the vagina. Damage can be done to the anus unless care is taken. For this reason, it is more likely that bleeding will occur during anal intercourse than vaginal intercourse. \n \n http://www.betterhealth.vic.gov.au/bhcv2/bhcarticles.nsf/pages/Anal_sex_Q&A?open\n \n \n It is also crucial to be safe in anal play activities. The anus is a tight muscle that tears easily during any penetration, making the transmission of STDs easier. Latex barriers like male or female condoms, dental dams and gloves should always be used. Plus, this will help prevent any bacterial infections or other sanitary issues. \n http://www.dailycal.org/article.php?id=4715\n \n Latex condoms protect against only certain types of STDs. STDs can be spread by sexual activity in a few different ways. They are effective against STDs that travel in bodily fluids (blood or semen), such as the HIV/AIDS virus, hepatitis, chlamydia, and gonorrhea. Condoms are much less effective against STDs that are caused by organisms that live in sores on the genitals, such as syphilis. STDs like herpes and the Human Papilloma Virus (also known as genital warts) that occur on the genital skin can get passed from one partner to another even if a condom is used. \n \n Most importantly, the effectiveness of a condom against STDs depends on whether the condom is stored correctly, and is used correctly and all of the time! \n \n Latex and polyurethane condoms are not 100% effective in preventing STDs, but they are your best protection. If you choose to have sex, the only really safe way to not get an STD is to have sex with only one person who does not have an STD and who is not having sex with anyone else\n \n http://www.teenhealthfx.com/answers/Sexuality/2043.html", 
   {}, 
   61352, 
   null, 
   1093162680.0
  ], 
  [
   63591, 
   null, 
   "Duo_Maxwell", 
   "It only seems that way because you still don't comprehend the argument.\n\n \n It only seems that way because you still don't comprehend that you are using fallacies, lies, majority oppressions, and raging double standards. \n \n \nThen we should just let everyone speed on the freeway at 100mph or let people go boating as fast as they cna and as close as they can to anyoen they want. \n\n \n There is a reason I said the point is moot. \n \n \nAlso we shouldn't worry about checking blood to see if it is tainted and remove safety caps becasue the risk does nto mean automatic damage and the point is moot right.\n\n \n Your raging doublestanrdards won't be easy to snake out of. It it applies to gays, it can easily apply to straights, something you don't want to talka bout because it shows your inability to apply your argumnets to a group you support. \n \n \nYou keep making these statements as if they're factual and never back them up.\n\n \n What statements? It is YOU who is doing that. besides, I have credible sources that aren't known to be lies to back my claims up. \n \n www.inhisarms.org/main/World_facts.htm\n library.thinkquest.org/11353/children.htm \n www.orst.edu/Dept/entomology/burgett/X0022_ENT30025.txt.html \n www.whybiotech.com/html/con1306.html\n www.farahpahlavi.org/essen-sep4-02.html \n www.ericsonhome.net/loyd/miscstufs/talkmar21st.htm - 14k \n www.ippnw.org/IPPNWMedStudents.html \n www.sitewave.net/cdp/V09_02.htm \n www.worldsocialism.org/SPGB/mar00 \n www.novakbirch.com/cbi/update05-09-02/infocus_redirect.htm?SEQ=1009.0\n www.pregnantpause.org/overpop/food.htm\n www.newint.org/issue194/facts.htm \n www.pro-truth.net/72-creating-christian-america.htm\n www.fbfinternational.org/cancer.htm \n \n Do you know what time it is? It's time for you to shut up.\n \n \nPerpetuating our species will prevent mankind from disappering is a beneficail thing especially wiht 40,000 dying a day we need to keep producing.\n \n\n \n Except that these children are dying from easily prevetable causes, such as malnutrition. It makes little sense to condemn them to horrible deaths when all it takes to save them is $5 a month. It is not like these children are dying from a incurable disease. Your argument is because they are dying (let's ignore the reason) we should replace them. You make no offers or ask why they are dying and how to prevent them. Cold, heartless and cruel, all define you. \n \n \nDisease is a danger to the public so that is why we quaratine and prevent practices such as reusing needles to prevent disease. The public interest is always first concern. \n\n \n Then you should apply the same argument of disease aganist straights, after all, much of the transfer rates now are between straights, at least in Africa. Increasing transfer increase mutation. Allowing marriage would lower partners, and transfer probability, and therefore would help the public aganist disease. Yet you are aganist that. You offer nothing in terms of how we should lower disease and you are AGANIST a known partner reducer. Hypocritical? Obviously. \n \n \nNo one can know how a child will live.\n\n \n We can give a good and accurate guess. A number of hereditary diseases kill their hosts on a set time table. Systeic phybrosis usually kills it's hosts by age 20 or earlier, most don't live that long. \n \n \nI bet the child is gald that they are alive.\n\n \n I bet they aren't. A cocktail of drugs, beatings to remove the flem, horrible physical conditions, surgeries, bed ridden, major lack of sleep, IVes, would you like straight that for 20 years without a single day of reprieve? Your lack of knowledge is appalling. \n \n \nThey might not like the situation or their health condition but I bet overall children and their families are glad they are together.\n\n \n Would you be happy to know your child will life the life I just descirbed and die a horrible death at age 20 or younger, all knowing it willl bankrupt you and cause serious health concerns of your own, all knowing as well that they will never have a physically happy day or mentally happy day in their lives? Depressing isn't it? \n \n \nMany diseases in the past were terminal but now we have technology to allow most of them to live long lives and good lives.\n\n \n So therefore you have no argument aganist gays dealing with disease. If we have the technology and the means to produce new technology to solve these diseases, along with a track record of doing so, then the disease argument is now moot.\n \n \nbut you cna't plan infection while engaging in anal and other forms of gay sex.\n\n \n nor can you plan infection while engaging in oral, vaginaal or other forms of straight sex. You have the inability to see that your arguments apply to the straight as well as the gays. \n \n \nMy point is that gay sex is by nature riskier and more damaging than traditional sex.\n\n \n But according to your logic, a track record of curing and technology allows us to cure any disease, and therefore it doesn't matter the risk. \n \n \nAlso there is no benefit except personal gratification.\n\n \n Do you even know what sex is? \n \n The last part of your argument applies 100% to straights as well as Gays.", 
   {}, 
   63509, 
   null, 
   1093229040.0
  ], 
  [
   63664, 
   null, 
   "JakeCJB", 
   "Maybe but I'm interested in spociety.\n\n \n These are very personal matters you were discussing, not society matters.\n \n \nHeterosexual sex isn't nealry as risky as homosexual sex.\n\n \n Unprotected sex, is risky, gay or straight.\n \n \nPerpetuating our species is a benefit.\n\n \n No, it isn't, if we can't look after the ones we have.\n \n \nYou can't raise healthy children unless you create them.\n\n \n Yes you can. Are you going to tell me adopted and step children don't make for a real family?\n \n \nAlso heterosexual homes are generally shown to be better than any other family.\n\n \n That's been proven to be a lie, when you and other bigots have presented it in this forum. \n \n \nGay sex in general is by nature of the activity going to cause problems.\n\n \n Any sexual activity can cause many problems. Other than, masturbation of course. \n \n \nYes that is why we quaratine people, palnts, and animals and don't allow for people to doante tainted blood.\n\n \n We don't quarantine people who have sexual diseases, whether they are gay or straight.\n \n \nWaht are you insisnuating?\n\n \n Diseases are natural.\n \n \nyes you can if you're monogamous.\n\n \n Or have protected sex.\n \n \nHowever the lifestyle of gays generally leads them to not be.\n\n \n Ah, I see, now you are going by the fallacy of hasty generalized assumptions.", 
   {}, 
   63508, 
   null, 
   1093285620.0
  ], 
  [
   63665, 
   null, 
   "JakeCJB", 
   "No it's based on reality.\n\n \n When jackasses fly it's based on reality.\n \n \nMsterbation is asexual.\n\n \n It's a form of sex.\n \n \nHowever Lesbian sex utilizing many forms of vagina sex is rsiky and no condom is made for hands. Gloves could reduce the damage but it is the shape and size of the hand itself tht does the damage.\n\n \n Mutual masterbation is considered safe. Other things involving hands can be safe if the hand is intact. Gloves would reduce risk for those other things. Oral sex can involve a protecting barrier for lesbians. \n \n \nAnal sex riisks can be reduced but not prevented.\n\n \n Penis and vaginal sex risks cannot be prevented, only reduced too.\n \n \nNo we base rights on an objective criteria. Our critereia applies to gays like it applies to prostitution and polygamy.\n\n \n What criteriea are you referring to that you claim is objective?", 
   {}, 
   63507, 
   null, 
   1093286220.0
  ], 
  [
   63717, 
   null, 
   "joebrummer", 
   "My point is that gay sex is by nature riskier and more damaging than traditional sex. \n\n \n \n What an illogial statement. There isn't too much gays do in bed that straight don't do, including anal sex. So how would gay sex be risker? The act of sex for gays and straights is not risky at all, there is no physically harm done to any part of the body. \n \n The only risk is behavioral. If you are out having unprotected sex, that is a behavior usually linked to low self esteem.", 
   {}, 
   63665, 
   null, 
   1093300680.0
  ], 
  [
   63755, 
   null, 
   "Duo_Maxwell", 
   "My point is that fast food is by nature riskier and more damaging than traditional eating habits. \n \n Therfore, we should ban fast food. \n \n On the same note, driving is more riskier due to bone decay then walking, so we should ban cars. \n \n due to Mi'ani's logic, we should ban everything remotely harmful", 
   {}, 
   63717, 
   null, 
   1093312260.0
  ], 
  [
   63760, 
   null, 
   "joebrummer", 
   "My point is that fast food is by nature riskier and more damaging than traditional eating habits. \n \n Therfore, we should ban fast food. \n \n On the same note, driving is more riskier due to bone decay then walking, so we should ban cars. \n \n due to Mi'ani's logic, we should ban everything remotely harmful\n\n \n \n It's the word \"traditional\" that is starting to make me laugh. It is always used against gays and lesbians. We have streched the word from traditional marriage to traditional sex. I didn't realize sex could be traditional. Would that be like missionalry with a hole cut in a sheet? Just so far fetched, it is stupid.\n \n Heterosexuals engage in some very risky behavior. Right in the town I live there is a sex club for heterosexuals. They advertise in the gay papers, but it is a sex club for straights. Do you think they are having traditional sex there? I doubt it. Do you think it is safe sex...maybe, maybe not. I think we should ban heterosexuals from having sex unless it is for procreational purposes. In fact ban that to and we will use alternative methods. Lots of test tube babies. Straights are far too careless in their sexual practices and think they are untouchable, because all the diseases go to gays. BAN them!\n \n ***Joe turns his sacastic thoughts off***", 
   {}, 
   63755, 
   null, 
   1093313460.0
  ], 
  [
   63764, 
   null, 
   "Duo_Maxwell", 
   "mana'ia's argments are 95% usable aganist straights yet he doesn't understand the arguments when they are used aganist him, and then has the gall to say that we don't understand the arguments. \n \n Why is it that hormonely raging double standards are now the new fad for republicans?", 
   {}, 
   63760, 
   null, 
   1093313880.0
  ], 
  [
   63766, 
   null, 
   "joebrummer", 
   "mana'ia's argments are 95% usable aganist straights yet he doesn't understand the arguments when they are used aganist him, and then has the gall to say that we don't understand the arguments. \n \n Why is it that hormonely raging double standards are now the new fad for republicans?\n\n \n \n \n His arguments are old. Heard it all before and he thinks he is coming up with something so new, when really he read it on some focus on family website. If you have ever read the heterosexual personals, you could see that straights are into some really wierd stuff the majority of gays would puke at", 
   {}, 
   63764, 
   null, 
   1093314240.0
  ], 
  [
   63776, 
   null, 
   "Duo_Maxwell", 
   "Like slave and master? \n \n Holy ****, that's disturbing. \n \n Bondage? \n \n Holy ****, that's disturbing.\n \n And that's just the mild stuff, I'm not even going to think about what else is out there. \n \n Sicko heteros.", 
   {}, 
   63766, 
   null, 
   1093322340.0
  ], 
  [
   63796, 
   null, 
   "JustineCredible", 
   "The act of homosexuality (which is the behavior that defines a homosexual) is very risky causing gential, anal, and organ damage. Ot give them the recognition would mean other less harmful behavior hsould be granted as well.\n\n \n Whoa there Nelly. \n Just because someone has a homosexual encounter than makes them gay? \n Or are you saying that only after having had a homosexual contact can homosexuals actaully be called homosexual? \n \n Please. \n \n That's like saying that heterosexuals who are virgins aren't really heterosexuals until after they have had a heterosexual sexual encounter. \n BUNK...as usual.", 
   {}, 
   60998, 
   null, 
   1093330980.0
  ], 
  [
   63817, 
   null, 
   "joebrummer", 
   "Whoa there Nelly. \n Just because someone has a homosexual encounter than makes them gay? \n Or are you saying that only after having had a homosexual contact can homosexuals actaully be called homosexual? \n \n Please. \n \n That's like saying that heterosexuals who are virgins aren't really heterosexuals until after they have had a heterosexual sexual encounter. \n BUNK...as usual.\n\n \n According to his logic, no one is gay. They are just behaving gay. Sorta like being drunk I think. So you can say on a Friday night: \"hey you wanna go behave gay tonight?\" Silly ain't it?", 
   {}, 
   63796, 
   null, 
   1093358940.0
  ], 
  [
   63826, 
   null, 
   "JustineCredible", 
   "According to his logic, no one is gay. They are just behaving gay. Sorta like being drunk I think. So you can say on a Friday night: \"hey you wanna go behave gay tonight?\" Silly ain't it?\n\n \n Yes, that's silly. Silly and bloody stupid. It's as if to say a person who is left handed isn't left handed if they are forced to write with their right hand. Or that someone's eye color is different because they are wearing colored contact lenses.", 
   {}, 
   63817, 
   null, 
   1093364400.0
  ], 
  [
   63844, 
   null, 
   "Ladywolf", 
   "People are pretty open minded overall when it comes to differences in people. I think a few heterosexuals are really focused on the gay issue because they fear it, they don't understand it, they don't want to understand it, and they just want it to go away.\n \n It's not going away and it will probably take a while for people overall to become more comfortable with it. It's just sad when the government buys into it.\n \n I wrote a letter to my senator to who cosponsored the FMA and the letter I got back was a template letter that just stated mumbo jumbo about \"Traditional Marriaage\" and sanctity and all that. Well, things are changing all over and some day, most gay couples will be able to legally marry. I just can't believe in this day and age, people can embrace such a notion that gays will harm the institution of marriage. It's divorce that harms it.\n \n As far as it being imoral or wrong, I've actually started to think that the bible or the people that interpret it are really twisting things up big time. I don't think it's \"wrong\" or \"immoral\" any more than a regular heterosexual couple, it's just not as common.", 
   {
    "post_info": {
     "post_title": "Help me with some reasons against homosexuality"
    }
   }, 
   63826, 
   null, 
   1093369500.0
  ], 
  [
   63860, 
   null, 
   "JustineCredible", 
   "People are pretty open minded overall when it comes to differences in people. I think a few heterosexuals are really focused on the gay issue because they fear it, they don't understand it, they don't want to understand it, and they just want it to go away.\n \n It's not going away and it will probably take a while for people overall to become more comfortable with it. It's just sad when the government buys into it.\n \n I wrote a letter to my senator to who cosponsored the FMA and the letter I got back was a template letter that just stated mumbo jumbo about \"Traditional Marriaage\" and sanctity and all that. Well, things are changing all over and some day, most gay couples will be able to legally marry. I just can't believe in this day and age, people can embrace such a notion that gays will harm the institution of marriage. It's divorce that harms it.\n \n As far as it being imoral or wrong, I've actually started to think that the bible or the people that interpret it are really twisting things up big time. I don't think it's \"wrong\" or \"immoral\" any more than a regular heterosexual couple, it's just not as common.\n\n \n \n Yeah, what is up with the \"Protection of marriage act?\" anyway. I mean, what are they protecting it from? MORE MARRIAGES? \n WOW is that just plain silly or what? \n Abuse of power? \n Misconceptions which actually lead to laws. Damn and I thought we had evolved from the dark ages. \n Are we next going to outlaw the number Thirteen? Or how about Black Cats?\n Hmmm...maybe we should outlaw walking under ladders, or opening umbrellas indoors? Whistling backstage?\n Saying the name of that \"Damned Scottish Play?\"\n \n Come on, haven't we learned by now that superstitions are simply bunk? Haven't we as a people grown up any at all? \n \n Since when do we allow hersey in courts? \n Since when do we allow for a Classist society in this country?\n Since when do we guaruntee rights, liberties and protections for only those we understand but deny them to those we fear? \n Oh, right! I almost forgot, this is America after all....we already and have always done those things. It's TRADITIONAL!", 
   {}, 
   63844, 
   null, 
   1093381080.0
  ], 
  [
   63870, 
   null, 
   "Ladywolf", 
   "Yeah, what is up with the \"Protection of marriage act?\" anyway. I mean, what are they protecting it from? MORE MARRIAGES? \n WOW is that just plain silly or what? Abuse of power?\n \n Yeah, protect marriage by keeping people from being able to get married. I think it's along the lines of going to war to promote peace or killing terrorists because they cause terror, then capturing some and terrorising them in their own prison.\n \n Misconceptions which actually lead to laws. Damn and I thought we had evolved from the dark ages. \n \n Not while Bush is in the WH.\n \n Are we next going to outlaw the number Thirteen? Or how about Black Cats?\n Hmmm...maybe we should outlaw walking under ladders, or opening umbrellas indoors? Whistling backstage? Saying the name of that \"Damned Scottish Play?\"\n \n No, but if you send money to Jerry Falwell, he'll buy his next airplaine with your money and perhaps even pray for ya. Can you say \"halaluya, I'm healed\"?\n \n Come on, haven't we learned by now that superstitions are simply bunk? Haven't we as a people grown up any at all? \n \n We've been back sliding big time. We don't even have conciousness raising groups anymore. No, people haven't grown up, they've just gotten scared and when they are scared, they fall in line like a blind pack of rats waiting for someone who has an overbearing presence to lead the way...hmmm, who could that be?\n \n Since when do we allow hersey in courts? \n Since when do we allow for a Classist society in this country?\n Since when do we guaruntee rights, liberties and protections for only those we understand but deny them to those we fear? \n Oh, right! I almost forgot, this is America after all....we already and have always done those things. It's TRADITIONAL!\n\n \n Since Bush, Bush, Bush", 
   {}, 
   63860, 
   null, 
   1093388100.0
  ], 
  [
   63896, 
   null, 
   "JustineCredible", 
   "[COLOR=DarkRed]No, but if you send money to Jerry Falwell, he'll buy his next airplaine with your money and perhaps even pray for ya. Can you say \"halaluya, I'm healed\"?\n\n \n \n No, but I can say \"Ja Hea Su ss Ah Car Iist \" in seven sylables!!! Does that count? Got that right out of the \"How to become a TV Evangelist in one simple step\" handbook...", 
   {}, 
   63870, 
   null, 
   1093394280.0
  ], 
  [
   63907, 
   null, 
   "joebrummer", 
   "No, but I can say \"Ja Hea Su ss Ah Car Iist \" in seven sylables!!! Does that count? Got that right out of the \"How to become a TV Evangelist in one simple step\" handbook...\n\n \n \n These threads seem to be just us homo's, what happen to the homophobes? did they come out of the closet?", 
   {}, 
   63896, 
   null, 
   1093402620.0
  ], 
  [
   63917, 
   null, 
   "Duo_Maxwell", 
   "joebrummer: I'll tell you the truth, I am a straight male. Seeing two guys kiss is something I'm NEVER going to get use to, anything in the bed room I don't even want to think about. However, that is entirely emotiona, and emotions lead to rash decisions. Logically and secularly, the anti- side is downright dumb.", 
   {}, 
   63907, 
   null, 
   1093407120.0
  ], 
  [
   63922, 
   null, 
   "joebrummer", 
   "joebrummer: I'll tell you the truth, I am a straight male. Seeing two guys kiss is something I'm NEVER going to get use to, anything in the bed room I don't even want to think about. However, that is entirely emotiona, and emotions lead to rash decisions. Logically and secularly, the anti- side is downright dumb.\n\n \n \n There are lots of things people say they will never get use to, but they do.. Someday, You might see two guys kiss and just say...Oh, don't they make a nice couple. As everyone's mother would say...You just never know!\n \n But thank you for being supportive!", 
   {}, 
   63917, 
   null, 
   1093407840.0
  ], 
  [
   63926, 
   null, 
   "JustineCredible", 
   "joebrummer: I'll tell you the truth, I am a straight male. Seeing two guys kiss is something I'm NEVER going to get use to, anything in the bed room I don't even want to think about. However, that is entirely emotiona, and emotions lead to rash decisions. Logically and secularly, the anti- side is downright dumb.\n\n \n Max: Its perfectly ok if you never get used to seeing it really. All your support has always been and remains to be appreciated and we are grateful. \n I don't think I will ever get used to seeing anytype of public displays of affection, gay or straight. I personally feel there are limits to what should be concidered as decent, no matter who is involved. But that's just my opinion. I certainly am not about to start an entire movement to ban it. \n That's the beauty of being in charge of my own person. I can turn away if I don't want to see something on the street, I can change the channel if I don't like what I see on television, I am not forced to view movies that have content of which I may be offended. \n That's what I just don't understand about the \"anti\" side. They have the exact same power over their own actions as I do. They can choose not to watch, not to view, not too witness...but I have to wonder about those who seem to be captivated by things which they claim to not like. \n But then I'm not one to oggle over a crash scene either.", 
   {}, 
   63917, 
   null, 
   1093416420.0
  ], 
  [
   63950, 
   null, 
   "Jaaaman", 
   "Max: Its perfectly ok if you never get used to seeing it really. All your support has always been and remains to be appreciated and we are grateful. \n I don't think I will ever get used to seeing anytype of public displays of affection, gay or straight. I personally feel there are limits to what should be concidered as decent, no matter who is involved. But that's just my opinion. I certainly am not about to start an entire movement to ban it. \n That's the beauty of being in charge of my own person. I can turn away if I don't want to see something on the street, I can change the channel if I don't like what I see on television, I am not forced to view movies that have content of which I may be offended. \n That's what I just don't understand about the \"anti\" side. They have the exact same power over their own actions as I do. They can choose not to watch, not to view, not too witness...but I have to wonder about those who seem to be captivated by things which they claim to not like. \n But then I'm not one to oggle over a crash scene either.\n\n Homosexuals regularly engage in parades and demonstrations. Routinely these parades include public nudity, sex acts committed in public, and the promotion of abusive sexual behaviors and sexual abuse of children. The participants are not just promoting a \"different sexual orientation\" or crusading for their civil rights; they are seeking approval of their acts and even encouraging expanded participation, demanding, in fact, an \"anything-goes\" society.\n While homosexual leaders want to convince the general public that they are as normal as this myth would suggest, their methods communicate the opposite. emoticon_ic", 
   {}, 
   63926, 
   null, 
   1093447200.0
  ], 
  [
   63964, 
   null, 
   "Ladywolf", 
   "No, but I can say \"Ja Hea Su ss Ah Car Iist \" in seven sylables!!! Does that count? Got that right out of the \"How to become a TV Evangelist in one simple step\" handbook...\n\n \n Well, you'd need the greezy hair cream, the big jewelry, etc...\n \n Hey, that's not a bad idea! Since cable is coming up with a gay network, perhaps we could come up with a \"gay friendly\" televangelical church. We could use the money for good works for a while, then use it to persude the government (state and federal) to approve same sex marriages!\n \n Then, when that's done, we can exploit the living daylights out of others to make ourselves rich...er, wait, no, nevermind...just because I'm gay doesn't mean I don't have morals (do you hear that Jaaaman)?", 
   {}, 
   63896, 
   null, 
   1093452780.0
  ], 
  [
   63965, 
   null, 
   "Ladywolf", 
   "Homosexuals regularly engage in parades and demonstrations. Routinely these parades include public nudity, sex acts committed in public, and the promotion of abusive sexual behaviors and sexual abuse of children. The participants are not just promoting a \"different sexual orientation\" or crusading for their civil rights; they are seeking approval of their acts and even encouraging expanded participation, demanding, in fact, an \"anything-goes\" society.\n While homosexual leaders want to convince the general public that they are as normal as this myth would suggest, their methods communicate the opposite. emoticon_ic\n\n \n Wow! I've never seen these kinds of parades. I've only been to gay pride parades where they had church groups marching, a veterans organizations marching. Where can I see such a parade Jaaaman?", 
   {}, 
   63950, 
   null, 
   1093452960.0
  ], 
  [
   63966, 
   null, 
   "joebrummer", 
   "Homosexuals regularly engage in parades and demonstrations. Routinely these parades include public nudity, sex acts committed in public, and the promotion of abusive sexual behaviors and sexual abuse of children. The participants are not just promoting a \"different sexual orientation\" or crusading for their civil rights; they are seeking approval of their acts and even encouraging expanded participation, demanding, in fact, an \"anything-goes\" society.\n While homosexual leaders want to convince the general public that they are as normal as this myth would suggest, their methods communicate the opposite. emoticon_ic\n\n \n More lies.\n \n I don't really participate in the community, but I do go to Pride every year. I have never seen any of the stuff you are talking about. Mostly I see a bunch of businesses trying to get my money.", 
   {}, 
   63950, 
   null, 
   1093453020.0
  ], 
  [
   63972, 
   null, 
   "Anastasia", 
   "He must be talking about Folsum Street parade... and of course that is representative of all gay parades.. cmon you guys sheesh...\n So heterosexuals at Mardi Gras must be exempt for their behavior simply because they are not gay and therefore it must be OK...\n I guess my point is that sure you could find that type of activity if you looked for it, but it is by no means a \"gay\" activity..\n I have been to Pride in West Hollywood and didn't see anything like he described.", 
   {}, 
   63966, 
   null, 
   1093454340.0
  ], 
  [
   63976, 
   null, 
   "Ladywolf", 
   "He must be talking about Folsum Street parade... and of course that is representative of all gay parades.. cmon you guys sheesh...\n So heterosexuals at Mardi Gras must be exempt for their behavior simply because they are not gay and therefore it must be OK...\n I guess my point is that sure you could find that type of activity if you looked for it, but it is by no means a \"gay\" activity..\n I have been to Pride in West Hollywood and didn't see anything like he described.\n\n \n You have to live in Jaaaman's world to be able to see it, fortunately, I don't live there, I live in the real world.", 
   {}, 
   63972, 
   null, 
   1093455120.0
  ], 
  [
   63982, 
   null, 
   "sinjin", 
   "Homosexuals regularly engage in parades and demonstrations. Routinely these parades include public nudity, sex acts committed in public, and the promotion of abusive sexual behaviors and sexual abuse of children. The participants are not just promoting a \"different sexual orientation\" or crusading for their civil rights; they are seeking approval of their acts and even encouraging expanded participation, demanding, in fact, an \"anything-goes\" society.\n While homosexual leaders want to convince the general public that they are as normal as this myth would suggest, their methods communicate the opposite. emoticon_ic\n\n \n I think your description of gay parades is a bit colorful but let's allow that there are indeed members of the \"gay community\" that are \"in your face\" types. I assume your are generally referring to gay men. I believe this is more attributable to their \"maleness\" than their \"gayness\". Let's face it, men are often dogs and/or pigs and gay men are hardly immune. If some gay men have been exceedingly promiscous, it's because they're guys and can be with other like-minded men. If some gay men are offensive and/or ill-mannered in public it's because they are aggressive, another predominantly male trait.", 
   {}, 
   63950, 
   null, 
   1093457160.0
  ], 
  [
   64036, 
   null, 
   "Duo_Maxwell", 
   "Homosexuals regularly engage in parades and demonstrations.\n\n \n As do heterosexuals.\n \n \nRoutinely these parades include public nudity, sex acts committed in public, and the promotion of abusive sexual behaviors and sexual abuse of children.\n\n \n Can you, oh nevermind, you can never prove your insane claims.", 
   {}, 
   63950, 
   null, 
   1093469820.0
  ], 
  [
   64077, 
   null, 
   "marc9000", 
   "Can you, oh nevermind, you can never prove your insane claims.\n\n \n Ever watch television? ;) E, entertainment channel, the show \"Wild On\"?", 
   {}, 
   64036, 
   null, 
   1093475760.0
  ], 
  [
   64080, 
   null, 
   "sinjin", 
   "Ever watch television? ;) E, entertainment channel, the show \"Wild On\"?\n\n \n Ever seen \"Girls Gone Wild\". Would that sum up women as a group?", 
   {}, 
   64077, 
   null, 
   1093476000.0
  ], 
  [
   64146, 
   null, 
   "marc9000", 
   "Ever seen \"Girls Gone Wild\". Would that sum up women as a group?\n\n \n I believe that \"Girls Gone Wild\" is not approved of by most women.\n \n I believe that the gay parades on \"Wild on\", ARE approved of by most homosexuals.\n \n (I may be a little in the past, it's been a several years since I've seen a Wild On - it may be discontinued.)", 
   {}, 
   64080, 
   null, 
   1093482780.0
  ], 
  [
   64149, 
   null, 
   "JustineCredible", 
   "I believe that \"Girls Gone Wild\" is not approved of by most women.\n \n I believe that the gay parades on \"Wild on\", ARE approved of by most homosexuals.\n \n (I may be a little in the past, it's been a several years since I've seen a Wild On - it may be discontinued.)\n\n \n \n Well hate to correct you, but nope, they are not \"approved of\" by most homosexuals.\n At least not the ones which were being used as the example.\n \n Mardi Gras would be lumped into that same catagory as being \"approved of\" by many \"Christians\" as it supposedly is a celabration of a \"Chrsitian\" holy day. Yet there numerous examples of overt sexuality being put on public display there as well.", 
   {}, 
   64146, 
   null, 
   1093483260.0
  ], 
  [
   64154, 
   null, 
   "marc9000", 
   "Well hate to correct you, but nope, they are not \"approved of\" by most homosexuals. \n\n \n If you say so, but the way today's gay population is coming out of the closet, it looks to me like they just love any public display of it. If today's homosexuals don't like the Wild On type displays of it, then they wouldn't be pushing for homosexual marriage, the ultimate public display.", 
   {}, 
   64149, 
   null, 
   1093484100.0
  ], 
  [
   64157, 
   null, 
   "Anastasia", 
   "If you say so, but the way today's gay population is coming out of the closet, it looks to me like they just love any public display of it. If today's homosexuals don't like the Wild On type displays of it, then they wouldn't be pushing for homosexual marriage, the ultimate public display.\n\n Oh cmon now that is not fair... one has hardly anything to do with the other...\n How many married straight people do you see \"wild on the streets\" Do they represent all straight married people?\n \n The media and what we watch on Jerry Springer are not a fair analogy.\n It could be a meme...See philosophy thread...", 
   {}, 
   64154, 
   null, 
   1093484400.0
  ], 
  [
   64158, 
   null, 
   "joebrummer", 
   "If you say so, but the way today's gay population is coming out of the closet, it looks to me like they just love any public display of it. If today's homosexuals don't like the Wild On type displays of it, then they wouldn't be pushing for homosexual marriage, the ultimate public display.\n\n \n \n I think there is a big difference in the public display of love (marriage) and the public display of sexual acts. AND no todays gay's do not approve of that. I think you are making a big stretch with this statement, marc!", 
   {}, 
   64154, 
   null, 
   1093484460.0
  ], 
  [
   64178, 
   null, 
   "Jaaaman", 
   "His arguments are old. Heard it all before and he thinks he is coming up with something so new, when really he read it on some focus on family website. If you have ever read the heterosexual personals, you could see that straights are into some really wierd stuff the majority of gays would puke at\nReasons against homosexuality?\n Well, here is another old hackneyed argument for you: Government should be in the business of curbing and punishing all acts of depravity, not legitimizing and protecting them. Homosexuality has no true right of existence, and it is the God-given responsibility of corporeal governments to do the proper things to remove it from society.", 
   {}, 
   63766, 
   null, 
   1093491840.0
  ], 
  [
   64184, 
   null, 
   "joebrummer", 
   "Reasons against homosexuality?\n Well, here is another old hackneyed argument for you: Government should be in the business of curbing and punishing all acts of depravity, not legitimizing and protecting them. Homosexuality has no true right of existence, and it is the God-given responsibility of corporeal governments to do the proper things to remove it from society.\n\n \n Governments have no god given anything. The are not bound by religion unless their is a Federal religion and there isn't, so what is your point dude!\n \n The government has an obligation to protect the rights of [bold]ALL it's citizens[/bold]. Not just some, not the majority, all of them hence the statement \"WE THE PEOPLE\" not some of the people not \"WE THE CHRISTIANS\". As I have said to you countless times before, get a grip!\n \n The arguments you propose against homosexuals aren't even good arguments. The non-christians come up with better legal reason why gays should not marry or have rights than you..most of your stuff is the \"Hot\" wrath of god. which would work if there were an all xtain society, but it is not. We have many other beliefs here, and the presents of no beliefs. God is not going to stop gay marriage ....FREE WILL. You say he gave it to us and gays will prevail like those before us who were oppressed. In another 50 years you will be the minority, and tryust me the gays will not help your cause when it happens. looks at the history of Christians and christian prosecution. When it happens again..you haven't made that many friends.", 
   {}, 
   64178, 
   null, 
   1093494060.0
  ], 
  [
   64206, 
   null, 
   "Duo_Maxwell", 
   "Reasons against homosexuality?\n Well, here is another old hackneyed argument for you: Government should be in the business of curbing and punishing all acts of depravity, not legitimizing and protecting them. Homosexuality has no true right of existence, and it is the God-given responsibility of corporeal governments to do the proper things to remove it from society.\n\n \n And who gets to decide what is depravity? \n \n Homosexuality was present and embraced in the birth place and rebirth place of Western Society. The Church held gay marriages until the 13th cenutry, something you have constantly avoided every time it is brought to light. \n \n Governemnt has no god given responsiblity to do anything of the things you describe.\n \n YOU ARE ALL TALK AND NO SUBSTANCE", 
   {}, 
   64178, 
   null, 
   1093504320.0
  ], 
  [
   64208, 
   null, 
   "JustineCredible", 
   "If you say so, but the way today's gay population is coming out of the closet, it looks to me like they just love any public display of it. If today's homosexuals don't like the Wild On type displays of it, then they wouldn't be pushing for homosexual marriage, the ultimate public display.\n\n \n \n Nice try, avoiding my example of Mardi Gras as a \"Christian\" Holy Day. \n Are you avoiding it because you know I'm right?\n \n Hey I could give you some more examples of overt sexual, and obscene behavior surrounding \"Christian\" Holy Days.\n St. Patrick's Day...a lame excuse to get as drunk as possible and behave like imbusiles.{Not to meantion that there were no actual snakes to be driven from Ireland as there are/were no indiginous species of snakes on the island. The \"snakes\" that are spoken of are/were the Pagans, which St. Patrick is credited for converting}\n \n St. Joeseph's Day...an excuse to eat like gluttons, as well as Mardi Gras. \n *Hey, isn't Glutony one of the Seven Deadly sins?*\n \n Christmas: An advertisers Dream come true! Commercialized to the fullest extent that any HOLY DAY could be. Consumerism gone absolutely MAD! \n {not to meantion the fact that the real date of Jesus' birth is closer to what is now Easter, that Christmas, and that the REAL winter Solstice celabrations were STOLLEN from Pagan Traditions}\n \n Easter: Kids think it's all about chocolate bunnies and colorful eggs. Yet again, it's another example of Christians blantently STEALING a Holy Day from the Pagans.\n \n Shall I go into \"traditions?\" Hmmm...\n \n (Since marriage is supposedly \"Traditionally\" between a man and a woman.}\n \n Ok, I think I shall.\n \n The Tradition of the Christmas Tree;\n Stolen from the Pagans, it was the symbol of everlasting hope for a new year. As Evergreens never turn color.\n \n Eggs at Easter: another Pagan tradition, meant to be the symbol of renewed life in spring.\n \n Halloween: The actually symbolism of the Pagan \"Sam Hain\" {Pronounced Sowaine} is nearly all but lost today. As it was a celebration of the harvest and the blessings from the Earth Mother. \n Sam Hain, which is gaelic for \"End of Summer\", not what some \"Christians\" will have you to believe as \"Satan.\"\n The Celts only had Two Seasons, winter and summer.", 
   {}, 
   64154, 
   null, 
   1093505220.0
  ], 
  [
   64220, 
   null, 
   "Jaaaman", 
   "More lies.\n \n I don't really participate in the community, but I do go to Pride every year. I have never seen any of the stuff you are talking about. Mostly I see a bunch of businesses trying to get my money.\n\n Thats interesting. Why do they have NAMBLA (North American Man-Boy Love Association) representatives marching in every Gay Pride parade? Gays know that the only way that they can create more gays is to seduce or rape children.", 
   {}, 
   63966, 
   null, 
   1093522980.0
  ], 
  [
   64226, 
   null, 
   "joebrummer", 
   "Thats interesting. Why do they have NAMBLA (North American Man-Boy Love Association) representatives marching in every Gay Pride parade? Gays know that the only way that they can create more gays is to seduce or rape children.\n\n \n \n \n NAMBLA has never been welcomed by the gay community!", 
   {}, 
   64220, 
   null, 
   1093530960.0
  ], 
  [
   64243, 
   null, 
   "sinjin", 
   "Thats interesting. Why do they have NAMBLA (North American Man-Boy Love Association) representatives marching in every Gay Pride parade? Gays know that the only way that they can create more gays is to seduce or rape children.\n\n \n I'd like a link to some proof of this claim.", 
   {}, 
   64220, 
   null, 
   1093537920.0
  ], 
  [
   64244, 
   null, 
   "joebrummer", 
   "I'd like a link to some proof of this claim.\n\n Don't hold your breath!", 
   {}, 
   64243, 
   null, 
   1093538220.0
  ], 
  [
   64268, 
   null, 
   "JustineCredible", 
   "Thats interesting. Why do they have NAMBLA (North American Man-Boy Love Association) representatives marching in every Gay Pride parade? Gays know that the only way that they can create more gays is to seduce or rape children.\n\n \n WOW what planet are you on? \n Oh never mind, I already know...PLANET JAAAMAN\n \n NAMBLA most certainly does NOT have representatives in gay pride parades. Maybe in yours, but not mine, and not the majority of Pride events Nationally.\n NAMBLA is also rejected by nearly every national/regional gay rights group. \n \n Whats funny here is that the ONLY time I ever see the NAMBLA name come up is in debates with prudes who know they are loosing! \n It's used as a last ditch effort, a really poor one too. \n \n JAAAMAN: You are morally corrupt. You are grasping at straws just trying desperately to cling to a corrupt religion you know is wrong, let alone hypocritical and contradictory. You have thrown out arguments based in lies and hersey with absolutely no foundation in reality let alone any sourses of reference. \n \n You're a nasty little man, who enjoys thinking nasty little thoughts about nasty doings of people you know nothing about, let alone are you willing to find out. \n Amazingly you have been the one to point the nasty finger at every turn. You have been the one to resort to devienct behavior everytime you know you are loosing.\n Anytime anyone ever asks you for proof, you change the subject or disappear for a week.\n Anytime someone disproves your nasty hersey, you attack with something more off the wall. \n You are about as credible as a dungheap!", 
   {}, 
   64220, 
   null, 
   1093542660.0
  ], 
  [
   64296, 
   null, 
   "Jaaaman", 
   "In 1992, during his first run for mayor, Giuliani took part in a homosexual \"pride\" parade that included a contingent of pedophile activists marching behind a banner for NAMBLA (North American Man/Boy Love Association).\n Source :The London Times \n \n I thought I would add this in too. This guy is a real piece of work emoticon_ic \n \n Michael Swift: \"Gay Revolutionary\" \n from Gay Community News, Feb. 15-21, 1987  \n \n (This essay is an outrage, madness, a tragic, cruel fantasy, an eruption of inner rage, on how the oppressed desperately dream of being the oppressor). \n \n We shall sodomize your sons, emblems of your feeble masculinity, of your shallow dreams and vulgar lies. We shall seduce them in your schools, in your dormitories, in your gymnasiums, in your locker rooms, in your sports arenas, in your seminaries, in your youth groups, in your movie theater bathrooms, in your army bunkhouses, in your truck stops, in your all male clubs, in your houses of Congress, wherever men are with men together. Your sons shall become our minions and do our bidding. They will be recast in our image. They will come to crave and adore us. \n \n Women, you cry for freedom. You say you are no longer satisfied with men; they make you unhappy. We, connoisseurs of the masculine face, the masculine physique, shall take your men from you then. We will amuse them; we will instruct them; we will embrace them when they weep. Women, you say you wish to live with each other instead of with men. Then go and be with each other. We shall give your men pleasures they have never known because we are foremost men too, and only one man knows how to truly please another man; only one man can understand the depth and feeling, the mind and body of another man. \n \n All laws banning homosexual activity will be revoked. Instead, legislation shall be passed which engenders love between men. \n \n All homosexuals must stand together as brothers; we must be united artistically, philosophically, socially, politically and financially. We will triumph only when we present a common face to the vicious heterosexual enemy. \n \n If you dare to cry XXXXXX, fairy, *****, at us, we will stab you in your cowardly hearts and defile your dead, puny bodies. \n \n We shall write poems of the love between men; we shall stage plays in which man openly caresses man; we shall make films about the love between heroic men which will replace the cheap, superficial, sentimental, insipid, juvenile, heterosexual infatuations presently dominating your cinema screens. We shall sculpt statues of beautiful young men, of bold athletes which will be placed in your parks, your squares, your plazas. The museums of the world will be filled only with paintings of graceful, naked lads. \n \n Our writers and artists will make love between men fashionable and de rigueur, and we will succeed because we are adept at setting styles. We will eliminate heterosexual liaisons through usage of the devices of wit and ridicule, devices which we are skilled in employing. \n \n We will unmask the powerful homosexuals who masquerade as heterosexuals. You will be shocked and frightened when you find that your presidents and their sons, your industrialists, your senators,your mayors, your generals, your athletes, your film stars, your television personalities, your civic leaders, your priests are not the safe, familiar, bourgeois, heterosexual figures you assumed them to be. We are everywhere; we have infiltrated your ranks. Be careful when you speak of homosexuals because we are always among you; we may be sitting across the desk from you; we may be sleeping in the same bed with you. \n \n There will be no compromises. We are not middle-class weaklings. Highly intelligent, we are the natural aristocrats of the human race, and steely-minded aristocrats never settle for less. Those who oppose us will be exiled. \n \n We shall raise vast private armies, as Mishima did, to defeat you. We shall conquer the world because warriors inspired by and banded together by homosexual love and honor are invincible as were the ancient Greek soldiers. \n \n The family unit-spawning ground of lies, betrayals, mediocrity, hypocrisy and violence--will be abolished. The family unit, which only dampens imagination and curbs free will, must be eliminated. Perfect boys will be conceived and grown in the genetic laboratory. They will be bonded together in communal setting, under the control and instruction of homosexual savants. \n \n All churches who condemn us will be closed. Our only gods are handsome young men. We adhere to a cult of beauty, moral and esthetic. All that is ugly and vulgar and banal will be annihilated. Since we are alienated from middle-class heterosexual conventions, we are free to live our lives according to the dictates of the pure imagination. For us too much is not enough. \n \n The exquisite society to emerge will be governed by an elite comprised of gay poets. One of the major requirements for a position of power in the new society of homoeroticism will be indulgence in the Greek passion. Any man contaminated with heterosexual lust will be automatically barred from a position of influence. All males who insist on remaining stupidly heterosexual will be tried in homosexual courts of justice and will become invisible men. \n \n \"We shall rewrite history, history filled and debased with your heterosexual lies and distortions. We shall portray the homosexuality of the great leaders and thinkers who have shaped the world. We will demonstrate that homosexuality and intelligence and imagination are inextricably linked, and that homosexuality is a requirement for true nobility, true beauty in a man. \n \n \"We shall be victorious because we are fueled with the ferocious bitterness of the oppressed who have been forced to play seemingly bit parts in your dumb, heterosexual shows throughout the ages. We too are capable of firing guns and manning the barricades of the ultimate revolution. \n \n Tremble, hetero swine, when we appear before you without our masks.\n \n I hope this fine fellow is not one of your \"beloved\" gay spokespersons. emoticon_ic", 
   {
    "unicode_changes_made": true
   }, 
   64268, 
   null, 
   1093552620.0
  ], 
  [
   64298, 
   null, 
   "joebrummer", 
   "Interesting how when you search this article on google, it ony shows up on anti-gay sites. No pro-gays printed it!\n \n Maybe because they don't agree with it", 
   {}, 
   64296, 
   null, 
   1093552980.0
  ], 
  [
   64300, 
   null, 
   "Jaaaman", 
   "Interesting how when you search this article on google, it ony shows up on anti-gay sites. No pro-gays printed it!\n \n Maybe because they don't agree with it\n\n Or maybe they do? Could this sick, perverted individual be the spokesperson for the so called \"gay movement\"?", 
   {}, 
   64298, 
   null, 
   1093553280.0
  ], 
  [
   64303, 
   null, 
   "joebrummer", 
   "Or maybe they do? Could this sick, perverted individual be the spokesperson for the so called \"gay movement\"?\n\n \n \n Well it was written with a psydo, so it could be a xtian psoing as a gay activist. It says some things no gays I know would say! It's rubbish. Is this the best you could come up with? You need to come up with a source for the NAMBLA thing. Find me a pride parade they were welcome in, really just one resource that says gays support this organization.", 
   {}, 
   64300, 
   null, 
   1093553880.0
  ], 
  [
   64305, 
   null, 
   "Jaaaman", 
   "Well it was written with a psydo, so it could be a xtian psoing as a gay activist. It says some things no gays I know would say! It's rubbish. Is this the best you could come up with? You need to come up with a source for the NAMBLA thing. Find me a pride parade they were welcome in, really just one resource that says gays support this organization.\n\n I did. \n \n In 1992, during his first run for mayor, Giuliani took part in a homosexual \"pride\" parade that included a contingent of pedophile activists marching behind a banner for NAMBLA (North American Man/Boy Love Association).\n Source :The London Times", 
   {
    "unicode_changes_made": true
   }, 
   64303, 
   null, 
   1093554120.0
  ], 
  [
   64309, 
   null, 
   "joebrummer", 
   "PFLAG opposes the inclusion of NAMBLA in any umbrella organization, coalition, event, or activity that is associated with the gay, lesbian, bisexual communities or their families and friends. \n \n www.pflag.org/about/exploit.html\n \n \n \n GLAAD Position Statement Regarding NAMBLA\n media center < media releases < archive < 1994 < GLAAD Position Statement Regarding NAMBLA \n \n January 16, 1994\n \n \n SAN DIEGO, CA -- January 16, 1994 --\n The Gay and Lesbian Alliance Against Defamation deplores North American Man Boy Love Association's (NAMBLA) goals, which include advocacy for sex between adult men and boys and the removal of legal protections for children. These goals constitute a form of child abuse and are repugnant to GLAAD. \n \n GLAAD also supports the statements issued by other gay and lesbian organizations supporting the International Lesbian and Gay Association's (ILGA) call for NAMBLA's immediate removal from the international association. \n \n GLAAD concurs with the 1990 ILGA resolution based on the UN Convention on the Rights of the Child, which states, \"Major power imbalances create the potential for child abuse. ILGA condemns the exploitive use of power differences to coerce others into sexual relationships. All children have the right to protection from sexual exploitation and abuse.\" \n \n Although statistics indicate that the vast majority of sexual abuse against children is perpetrated by heterosexual men, it is imperative that child abuse, in all forms, be condemned by gay men and lesbians. \n \n As a group of people who historically have not had legal rights and protections, gay men and lesbians have always work with, and built coalitions with, others whose rights are at risk. The true gay and lesbian agenda is ultimately about free human rights for all people. \n \n \n \n \n GLAAD calls for the removal of NAMBLA\n \n www.glaad.org/media/archive_detail.php?id=278", 
   {}, 
   64305, 
   null, 
   1093554840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Help me with some reasons against homosexuality", 
  "url": "http://www.4forums.com/political/gay-rights-debates/2584-help-me-some-reasons-against-homosexuality.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 2584, 
  "discussion_files": [
   [
    "26974.html", 
    "http://www.4forums.com/political/gay-rights-debates/2584-help-me-some-reasons-against-homosexuality-print.html"
   ], 
   [
    "26975.html", 
    "http://www.4forums.com/political/gay-rights-debates/2584-help-me-some-reasons-against-homosexuality-10-print.html"
   ], 
   [
    "26976.html", 
    "http://www.4forums.com/political/gay-rights-debates/2584-help-me-some-reasons-against-homosexuality-8-print.html"
   ], 
   [
    "26977.html", 
    "http://www.4forums.com/political/gay-rights-debates/2584-help-me-some-reasons-against-homosexuality-6-print.html"
   ], 
   [
    "26978.html", 
    "http://www.4forums.com/political/gay-rights-debates/2584-help-me-some-reasons-against-homosexuality-4-print.html"
   ], 
   [
    "26979.html", 
    "http://www.4forums.com/political/gay-rights-debates/2584-help-me-some-reasons-against-homosexuality-5-print.html"
   ], 
   [
    "26980.html", 
    "http://www.4forums.com/political/gay-rights-debates/2584-help-me-some-reasons-against-homosexuality-7-print.html"
   ], 
   [
    "26981.html", 
    "http://www.4forums.com/political/gay-rights-debates/2584-help-me-some-reasons-against-homosexuality-9-print.html"
   ], 
   [
    "26982.html", 
    "http://www.4forums.com/political/gay-rights-debates/2584-help-me-some-reasons-against-homosexuality-3-print.html"
   ], 
   [
    "26983.html", 
    "http://www.4forums.com/political/gay-rights-debates/2584-help-me-some-reasons-against-homosexuality-2-print.html"
   ]
  ], 
  "identifier": 2584
 }
]