[
 [
  [
   54811, 
   null, 
   "Rev. HellH0und", 
   "moveamericaforward.blogspot.com/2004/06/standing-up-to-michael-moore.html\n \n Standing Up to Michael Moore\n \n It's been impossible to miss the media's obsession with Michael Moore and his new film, \"Fahrenheit 9/11\" which attacks our troops, the war on terrorism and President Bush.\n \n \n Moore has recently insulted the airplane passengers of 9/11 (\"The kind of people who fly in airplanes want someone else to clean up their mess; that's why they let hijackers take the plane. The passengers on September 11 were scaredy-cats, because they were mostly white.\") and our troops (\"Half the movie is about Iraq - we were able to get film crews embedded with American troops without them knowing it was Michael Moore. They are totally f***ed.\")\n \n \n \n \n \n Why does the media love this guy so much? And I wonder what HE would have done had he been on one of the planes!", 
   {
    "post_info": {
     "post_title": "Standing Up to Michael Moore"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1087843380.0
  ], 
  [
   54816, 
   null, 
   "Waxy", 
   "Perhaps a better question would be asking why some people seem to hate him so much?\n \n Waxy", 
   {}, 
   54811, 
   null, 
   1087844100.0
  ], 
  [
   54823, 
   null, 
   "Rev. HellH0und", 
   "His lies, his media darling status, my post above answers your question for you.", 
   {}, 
   54816, 
   null, 
   1087846320.0
  ], 
  [
   54828, 
   null, 
   "Waxy", 
   "His lies, his media darling status, my post above answers your question for you.\n\n \n Maybe. Maybe not.\n \n Waxy", 
   {}, 
   54823, 
   null, 
   1087847220.0
  ], 
  [
   54829, 
   null, 
   "Rev. HellH0und", 
   "Maybe. Maybe not.\n \n Waxy\n\n \n \n \n Well if you have nothing to say my friend.......", 
   {}, 
   54828, 
   null, 
   1087847400.0
  ], 
  [
   54844, 
   null, 
   "jerichoholic104", 
   "Hmm... I heard that the film is DEFENDING our troops.", 
   {}, 
   54829, 
   null, 
   1087850520.0
  ], 
  [
   54850, 
   null, 
   "Rev. HellH0und", 
   "Hmm... I heard that the film is DEFENDING our troops.\n\n \n \n How? Quote? link?", 
   {}, 
   54844, 
   null, 
   1087851360.0
  ], 
  [
   54854, 
   null, 
   "CCR1994", 
   "moveamericaforward.blogspot.com/2004/06/standing-up-to-michael-moore.html\n \n Standing Up to Michael Moore\n \n It's been impossible to miss the media's obsession with Michael Moore and his new film, \"Fahrenheit 9/11\" which attacks our troops, the war on terrorism and President Bush.\n \n \n Moore has recently insulted the airplane passengers of 9/11 (\"The kind of people who fly in airplanes want someone else to clean up their mess; that's why they let hijackers take the plane. The passengers on September 11 were scaredy-cats, because they were mostly white.\") and our troops (\"Half the movie is about Iraq - we were able to get film crews embedded with American troops without them knowing it was Michael Moore. They are totally f***ed.\")\n \n \n \n \n \n Why does the media love this guy so much? And I wonder what HE would have done had he been on one of the planes!\n\n \n I have not seen the film but I did read the comments about the airline passengers before and they are extremely condescending and racist. Based on those comments as well as some others I am inclined not to respect Mr. Moore. I think it is important to stress that while many people may object to the films content, it would be foolish and stupid to try and prevent it from being seen. If anything, people should be encouraged to see it and form their own judgement.", 
   {
    "unicode_changes_made": true
   }, 
   54811, 
   null, 
   1087851840.0
  ], 
  [
   54856, 
   null, 
   "jerichoholic104", 
   "Fahrenheit 9/11 takes us inside that war to tell the stories we haven't heard, illustrating the awful human cost to U.S. soldiers and their families\n \n \n I heard them talking about it on the radio, but also this excerpt from the description on www.fahrenheit911.com seems like the film is defending the soldiers who are in Iraq by the outrage shown that they are giving their lives for an unjust war. \n \n Why don't you just watch the film and decide for yourself what it is doing? It hasn't even been released yet for god's sake and it's already being attacked? Why not decide for yourself the reasons that you hate it? You should at least be open minded enough to KNOW why you despise something.", 
   {}, 
   54850, 
   null, 
   1087851960.0
  ], 
  [
   54866, 
   null, 
   "Rev. HellH0und", 
   "Uh I was not talking about his movie I was talking about him. And I wont see any of his movies unless they are free.....\n \n \n \n His bowling for lies movie was the only piece of garbage I saw of his... Never again...", 
   {}, 
   54856, 
   null, 
   1087855380.0
  ], 
  [
   54902, 
   null, 
   "jerichoholic104", 
   "Ah, you're probably one of those people who think the \"presidency of lies\" is a good thing.", 
   {}, 
   54866, 
   null, 
   1087865580.0
  ], 
  [
   54923, 
   null, 
   "AMD4EVER", 
   "Uh I was not talking about his movie I was talking about him. And I wont see any of his movies unless they are free.....\n \n \n \n His bowling for lies movie was the only piece of garbage I saw of his... Never again...\n\n \n Amazing, you and I are on the same side of two debates going on at once. Never thought I would see the day.\n \n I have yet to even see Bowling for Columbine. I already know what Moore is about and what his movies are about. Why would I want to clutter my mind with such useless propoganda? I'm waiting for the day that Moore and Bill O'Reilly go at it live on the radio if Moore ever accepts his invitation. It should be an interesting show.", 
   {}, 
   54866, 
   null, 
   1087874220.0
  ], 
  [
   54967, 
   null, 
   "Phunting", 
   "Bowling for Columbine was an interesting and thought provoking film. \n \n I don't agree with the message, I don't agree with the way he sometimes twists the truth. But equally I don't agree with the hysteria and hatred that is whipped up about him.\n \n I will watch his new film, again no doubt I will disagree with the message once more, as I am in support of the war. But that does not mean that I feel the need to close my mind to anyone's viewpoint which is not my own, which is what the vast majority of his detractor's seem to be doing.", 
   {}, 
   54923, 
   null, 
   1087904520.0
  ], 
  [
   54983, 
   null, 
   "Rev. HellH0und", 
   "Ah, you're probably one of those people who think the \"presidency of lies\" is a good thing.\n\n \n \n \n No I don't think Clinton was a good president....", 
   {}, 
   54902, 
   null, 
   1087919220.0
  ], 
  [
   54993, 
   null, 
   "GreatMoose", 
   "An interesting (if long) read.\n \n http://slate.msn.com/id/2102723\n \n My favorite quote:\n \n \nTo describe this film as dishonest and demagogic would almost be to promote those terms to the level of respectability. To describe this film as a piece of **** would be to run the risk of a discourse that would never again rise above the excremental. To describe it as an exercise in facile crowd-pleasing would be too obvious. Fahrenheit 9/11 is a sinister exercise in moral frivolity, crudely disguised as an exercise in seriousness. It is also a spectacle of abject political cowardice masking itself as a demonstration of \"dissenting\" bravery.\n \n \n NOTE: You really need to read the whole thing. The author points out the lies told in the film, and for once, backs it up with the countervening evidence. A very good read.", 
   {}, 
   54983, 
   null, 
   1087921440.0
  ], 
  [
   55047, 
   null, 
   "jerichoholic104", 
   "\"One of the many problems with the American left\"\n \n That's as far as I needed to go. Like I said, decide for yourself. \n \n @Rev\n \n Is this the second grade? I was under the impression that you were much older than that.", 
   {}, 
   54993, 
   null, 
   1087939260.0
  ], 
  [
   55060, 
   null, 
   "CCR1994", 
   "\"One of the many problems with the American left\"\n \n That's as far as I needed to go. Like I said, decide for yourself. \n \n @Rev\n \n Is this the second grade? I was under the impression that you were much older than that.\n\n \n If you intend to go no further then you are missing everything that would be discussed about the article. Can you expect to make critical judgements of a 6 page article if you only read part of the first sentence?", 
   {}, 
   55047, 
   null, 
   1087946220.0
  ], 
  [
   55062, 
   null, 
   "CCR1994", 
   "I heard them talking about it on the radio, but also this excerpt from the description on www.fahrenheit911.com seems like the film is defending the soldiers who are in Iraq by the outrage shown that they are giving their lives for an unjust war. \n \n Why don't you just watch the film and decide for yourself what it is doing? It hasn't even been released yet for god's sake and it's already being attacked? Why not decide for yourself the reasons that you hate it? You should at least be open minded enough to KNOW why you despise something.\n\n \n Take your own advice and read the entire Hitchens article.", 
   {}, 
   54856, 
   null, 
   1087946460.0
  ], 
  [
   55102, 
   null, 
   "Rev. HellH0und", 
   "\"One of the many problems with the American left\"\n \n That's as far as I needed to go. Like I said, decide for yourself. \n \n\n \n \n Well how many times do I have to subject myself to a liar and a propagandist before I dismiss him as a worthless source of information?\n \n \n \n \n \n\n @Rev\n \n Is this the second grade? I was under the impression that you were much older than that.\n\n \n \n \n Hmm a personal attack..... Well I will answer you. I am older than that (Although I would be in good shape if this were how I conducted myself in the second grade) and I do not find it \"childish\" to call out a liar as a liar (moore) and nor do I find it childish do debate topics on a \"discussion\" forum. Perhaps if you posted something of substance on this topic we could intelligently debate it and not have to resort to personal attacks that do not seem to convey a complete critisizm of any of my past posts, as you did not identify the source of my \"second grade\" type behavior and simply started with \"@rev\".\n \n \n Don't mind me its just an observation....", 
   {}, 
   55047, 
   null, 
   1087962660.0
  ], 
  [
   55103, 
   null, 
   "Rev. HellH0und", 
   "Bowling for Columbine was an interesting and thought provoking film. \n \n I don't agree with the message, I don't agree with the way he sometimes twists the truth. But equally I don't agree with the hysteria and hatred that is whipped up about him.\n \n I will watch his new film, again no doubt I will disagree with the message once more, as I am in support of the war. But that does not mean that I feel the need to close my mind to anyone's viewpoint which is not my own, which is what the vast majority of his detractor's seem to be doing.\n\n \n \n \n You see my problem is his \"twisting of the truth\" as you say. In Bowling for Lies he edited speeches to change the very meaning:\n \n \"Fact: Heston's \"cold dead hands\" speech, which leads off Moore's depiction of the Denver meeting, was not given at Denver after Columbine. It was given a year later in Charlotte, North Carolina, and was his gesture of gratitude upon his being given a handmade musket, at that annual meeting.\n \n Fact: When Bowling continues on to the speech which Heston did give in Denver, it carefully edits it to change its theme. \n \n \"Moore has actually taken audio of seven sentences, from five different parts of the speech, and a section given in a different speech entirely, and spliced them together. Each edit is cleverly covered by inserting a still or video footage for a few seconds.\"\n \n \n See Link for specifics.\n \n \n \n Once you impeach your credibility your done in my book... how would you be able to believe anything this guy says?\n \n \n His media darling status is the ONLY reason he is still news and his fairytail is even talked about.", 
   {}, 
   54967, 
   null, 
   1087963080.0
  ], 
  [
   55238, 
   null, 
   "Phunting", 
   "I am well aware of how it was edited. Whist I agree it was done in such away to make Heston's speech appear more inflammatory, the theme was not changed. Heston did use the speech to attack Denver's mayor for asking him to show a little more sensitivity over the tragedy. No I don't agree with how Moore makes the point, and in the end think it only works against him. But that doesn't mean that there wasn't a valid point to be made. \n \n \n \nOnce you impeach your credibility your done in my book... how would you be able to believe anything this guy says?\nI don't. Just like I don't believe anything anyone says without looking into the matter myself. I don't approve of his methods, I've made that abundantly clear. I don't agree with his stance on many, many matters either. However that does not mean that he is not making valid and important points, I worry about his methods mostly because it gives people an excuse to never pay any attention to what he is saying because of how he says it.", 
   {}, 
   55103, 
   null, 
   1088016600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Standing Up to Michael Moore", 
  "url": "http://www.4forums.com/political/current-events-debates/2596-standing-up-michael-moore.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 2596, 
  "discussion_files": [
   [
    "6912.html", 
    "http://www.4forums.com/political/current-events-debates/2596-standing-up-michael-moore-print.html"
   ], 
   [
    "6913.html", 
    "http://www.4forums.com/political/current-events-debates/2596-standing-up-michael-moore-2-print.html"
   ]
  ], 
  "identifier": 2596
 }
]