[
 [
  [
   54818, 
   null, 
   "jim's trucking", 
   "The Suadis did not waste any time. They killed four of the terrorist bastards responsible for the most recent beheading of an innocent American worker.\n \n Hooray for that!", 
   {
    "post_info": {
     "post_title": "Saudi Justice!"
    }
   }, 
   null, 
   null, 
   1087844460.0
  ], 
  [
   54835, 
   null, 
   "lord tammerlain", 
   "I wouldnt go so far to call him an innocent worker. He was working on Apache Helicopters, not baby food. Apache helicopters are military, and generally considered a legitamate target. If people making bombs are legitamate targets in a war then so are the people who maintain other military items", 
   {}, 
   54818, 
   null, 
   1087848840.0
  ], 
  [
   54836, 
   null, 
   "daewoo", 
   "Be careful whem acceptinmg news coming from the house of saud. Just as likely they pulled 4 random guys off the street and executed them, then claimed they were terorists, just to show the rest of the world they were combatting terrorism. \n \n The thing to rememebr is that Saudi is such a totalitarin country that the terrorists could not be operating there to the scale they have wihtout support of certain elements within the government. What is going in in saudi Arabia is more along the lines of infighting thean terrorism. 0 0", 
   {}, 
   54818, 
   null, 
   1087849320.0
  ], 
  [
   54840, 
   null, 
   "jim's trucking", 
   "I wouldnt go so far to call him an innocent worker. He was working on Apache Helicopters, not baby food. Apache helicopters are military, and generally considered a legitamate target. If people making bombs are legitamate targets in a war then so are the people who maintain other military items\n\n \n To capture, display on video and behead a prisoner is not within the bounds of legitimate warfare. Daniel Pearl and Nick Berg were also murdered  by their captors.\n \n The man did not die in combat. They did not bomb his helicopter repair shop. They abducted him, videotaped him, attempted to ransom him and then murdered him. He should have been treated as a POW...but then, when you're dealing with dogs, you shouldn't expect decency. Likewise, the terrorists should have no reason to expect kindness in return.\n \n I fear they will soon do the same to the South Korean.\n \n emoticon_xkill all    terrorists", 
   {}, 
   54835, 
   null, 
   1087849860.0
  ], 
  [
   54842, 
   null, 
   "jim's trucking", 
   "Be careful whem acceptinmg news coming from the house of saud. Just as likely they pulled 4 random guys off the street and executed them, then claimed they were terorists, just to show the rest of the world they were combatting terrorism. \n \n The thing to rememebr is that Saudi is such a totalitarin country that the terrorists could not be operating there to the scale they have wihtout support of certain elements within the government. What is going in in saudi Arabia is more along the lines of infighting thean terrorism. 0 0\n\n \n You are about the most skeptical person I have ever encountered.\n \n Have you ever been to Saudi Arabia?", 
   {}, 
   54836, 
   null, 
   1087850040.0
  ], 
  [
   54871, 
   null, 
   "lord tammerlain", 
   "To capture, display on video and behead a prisoner is not within the bounds of legitimate warfare. Daniel Pearl and Nick Berg were also murdered  by their captors.\n \n The man did not die in combat. They did not bomb his helicopter repair shop. They abducted him, videotaped him, attempted to ransom him and then murdered him. He should have been treated as a POW...but then, when you're dealing with dogs, you shouldn't expect decency. Likewise, the terrorists should have no reason to expect kindness in return.\n \n I fear they will soon do the same to the South Korean.\n \n emoticon_xkill all    terrorists\n\n \n The people killed in the attempt on al Zarqwi(sp) in Iraq did not die in combat. The had no chance to fight back or defend themselves, they had no chance to explain if they were innocent. Should the terrorists just have killed Johnson by shooting him instead of kidnapping him. He was working for the military, his actions helped kill muslims, and kept the Saudi royal family in power, in war he was a legitamate target.", 
   {}, 
   54840, 
   null, 
   1087856820.0
  ], 
  [
   54873, 
   null, 
   "jim's trucking", 
   "The people killed in the attempt on al Zarqwi(sp) in Iraq did not die in combat. The had no chance to fight back or defend themselves, they had no chance to explain if they were innocent. Should the terrorists just have killed Johnson by shooting him instead of kidnapping him. He was working for the military, his actions helped kill muslims, and kept the Saudi royal family in power, in war he was a legitamate  target.\n\n \n legitimate\n \n He was a legitimate (to them) target before his capture. Killing him while in captivity was wrong...but, like I said before, when dealing with dogs, you should expect animal behavior.", 
   {}, 
   54871, 
   null, 
   1087858320.0
  ], 
  [
   54899, 
   null, 
   "daewoo", 
   "You are about the most skeptical person I have ever encountered.\n \n Have you ever been to Saudi Arabia?\n\n \n Yes, several times. All their media outlets are govertnment controlled, it is nothing to spend the rest of your life in a prison wihtout any type of trial, and people generally warn you ahead of time about going out of your way not to insult or anger anybody of stsus, as there is a fair to decent chance they will simply make you disapaer from the face of the earth, either by throwing you in above mentioned prison for the rest of your life, or killing you and leaving you int he desert for the animals to eat.\n \n If we wanted to take down the most brutal regime in the ME, we needed to take down Saudi Arabia. Those guys make saddam look good. But we have already cut our deals with that particualr devil, so they stay in power and the US ensures that they cannot be removed.\n \n The current problem in Saudi Arabia is that better than half of those running things are in full support of the terrorists. This keeps them in business (not only by giving them safe haven, but they also fund them to the tune of hundreds of millions per year). \n \n This is one reason I tend to support the terrorists. I have been to Saudi, and I definatly feel that the US should be out of saido arabia, so the people can drag those bastards out in the street and shoot them. Per SOP, we instead will support the tyrants at the expense of the people, because the tyrants are easy to deal with. They only care about themselves, not their people.", 
   {}, 
   54842, 
   null, 
   1087865220.0
  ], 
  [
   54978, 
   null, 
   "jim's trucking", 
   "Yes, several times. All their media outlets are govertnment controlled, it is nothing to spend the rest of your life in a prison wihtout any type of trial, and people generally warn you ahead of time about going out of your way not to insult or anger anybody of stsus, as there is a fair to decent chance they will simply make you disapaer from the face of the earth, either by throwing you in above mentioned prison for the rest of your life, or killing you and leaving you int he desert for the animals to eat.\n \n If we wanted to take down the most brutal regime in the ME, we needed to take down Saudi Arabia. Those guys make saddam look good. But we have already cut our deals with that particualr devil, so they stay in power and the US ensures that they cannot be removed.\n \n The current problem in Saudi Arabia is that better than half of those running things are in full support of the terrorists.  This keeps them in business (not only by giving them safe haven, but they also fund them to the tune of hundreds of millions per year). \n \n This is one reason I tend to support the terrorists.   I have been to Saudi, and I definatly feel that the US should be out of saido arabia, so the people can drag those bastards out in the street and shoot them. Per SOP, we instead will support the tyrants at the expense of the people, because the tyrants are easy to deal with. They only care about themselves, not their people.\n\n \n Can you support these figures with proof or is this just another made-up argument?\n \n If you tend to support the terrorists, you are despicable. By \"those bastards\", I assume you mean the Saudi government. Is that correct?\n \n When were you there (dates) and what were you doing?\n \n (Maybe you can tell that I am doubting your word.)\n \n \n emoticon_xkill all terrorists and those who support them!", 
   {}, 
   54899, 
   null, 
   1087915620.0
  ], 
  [
   55021, 
   null, 
   "Siegfriedson", 
   "It is kind of curious how the Saudi police just \"happened\" to catch the murderers just as they were trying to dispose of the body of Paul Johnson.\n \n The killers could have been anywhere in Saudi Arabia, yet according to the story on the news, the Saudi authorities ambushed the \"al-Qaeda terrorists\" shortly after they ditched the body.\n \n Huh?", 
   {}, 
   54978, 
   null, 
   1087934460.0
  ], 
  [
   55032, 
   null, 
   "daewoo", 
   "Can you support these figures with proof or is this just another made-up argument?\n\n \n Go to www.google.com and do a serach for radical islam saudi arabia. I don;t make up arguments.\n \n \nIf you tend to support the terrorists, you are despicable. By \"those bastards\", I assume you mean the Saudi government. Is that correct?\n\n \n That is exactly who I am talking about. What America has done in the Middle East is WRONG. Now, we are having to answer for it. Unfortunatly, it is going to be business as usual for the special interest whores who run this country unless they are forced to stop. The really sad part is that a lot of Americans, who have effectively been reduced to cannon fodder in this \"war on terror\", are not bright enough to see what is going on. They actually believe rediculous statements from our #1 special interest whore when he gets up and says idiotic things like \"Theya re not attacking us because they hate our policies, they are attacking us becaue they hate our existance\".\n \n Americans prefer their news and information to come in 20 second sound bytes. \n \n \n When were you there (dates) and what were you doing?\n \n It has been about 9 years since I was last in Saudi. My first job out of college was with a company that manufatured and installed prefab steel buildings. Most of theri business came from the ME. I was an assitant project supervisor (construction manager). I did stop briefly in Saudi 2 years ago on my way back from egypt, but that was only overnight to visit a friend there.\n \n Next time I visit the ME, I will probably either go to Syria or Lebanon. While they are not real fond of Americans in either place, they are better than Saudi Arabia (safer). \n \n \n(Maybe you can tell that I am doubting your word.)\n\n \n Do you routinely lie without reason to perfect strangers? I have lied to my wife (\"I just didn't have time to get the lawn mowed\"), I have lied to business associates (\"That is our bottom dollar, we really can't go any lower than that\"), but I can't recall ever lying to a stranger. Don't really see the point to that.", 
   {}, 
   54978, 
   null, 
   1087937100.0
  ], 
  [
   55052, 
   null, 
   "georged", 
   "legitimate\n \n He was a legitimate (to them) target before his capture. Killing him while in captivity was wrong...but, like I said before, when dealing with dogs, you should expect animal behavior.\n\n \n I find that type of thinking typical of our arrogance, the very arrogance that has resulted in our ME problems. We position ourselves in the ME to protect our private oil interests, using the threat of the world's most powerful military to ensure compliance by all parties, we support Israels's expansionist policies (also driven in great part by private industry), we invade and occupy a sovereign ME nation by inciting the US public with a series of lies and then decide we'll determine the rules of engagement for those who live in the ME and disagree with us.\n \n Gee, they won't stand in front of our machine guns, armor or rockets and fight like men? We're the crusading Christians and they won't play by our rules? Well, since they're not stupid and becoming very successful in their resistance, let's call them poor sports. Yes, that's the key, we'll spin their methods as unfair! We'll call them dogs, ragheads, non-human and all those other Christian nicknames we use, kill civilians with impersonal high technology rewarded with low casualties for us when not getting our way, which is the only right way.", 
   {}, 
   54873, 
   null, 
   1087942140.0
  ], 
  [
   55054, 
   null, 
   "Waxy", 
   "\n \n legitimate\n \n He was a legitimate (to them) target before his capture. Killing him while in captivity was wrong...but, like I said before, when dealing with dogs, you should expect animal behavior.\n\n \n Said the terrorist as he lopped off the poor fellow's head and double checked the spelling in his press release.\n \n Waxy", 
   {}, 
   54873, 
   null, 
   1087943400.0
  ], 
  [
   55055, 
   null, 
   "georged", 
   "Do you routinely lie without reason to perfect strangers? I have lied to my wife (\"I just didn't have time to get the lawn mowed\")\n\n \n There's a solution for that here in the West. Thanks to the influx of southern neighbors despised by Americans who won't do the work for less than $15/hr, medical benefits, workman's comp, personal days off, sick days, vacation and retirement, my wife can bug our very punctual and efficient gardener. The unemployed 'true' Christian Americans are all busy collecting government checks while yelling to each other 'we should bomb those ungrateful ***** off the map for beheading an American working on attack helos in Saudi Arabia.", 
   {}, 
   55032, 
   null, 
   1087944360.0
  ], 
  [
   55134, 
   null, 
   "daewoo", 
   "There's a solution for that here in the West. Thanks to the influx of southern neighbors despised by Americans who won't do the work for less than $15/hr, medical benefits, workman's comp, personal days off, sick days, vacation and retirement, my wife can bug our very punctual and efficient gardener. The unemployed 'true' Christian Americans are all busy collecting government checks while yelling to each other 'we should bomb those ungrateful ***** off the map for beheading an American working on attack helos in Saudi Arabia.\n\n \n Unfortunatly, in my town we have a large meat packing plant that employs all the illegals. IT makes it mroe difficult to find a good gardner who is willing to work for a decent wage. Also, my current \"yard\" is not really big enough to justify a full time gardner.\n \n This fall I am adding a 2 acre garden (old english style) as an anniversary gift to my wife. Then, I can justify a full time gardner. I have my eye on a nice korean man who currently works for a guy that is going to be moving soon. \n \n Personally, I am not a big fan of hiring illegals. Looking at the markup on consumer goods by American companies (400% or better in many cases), I have trouble reconciling this with \"greedy workers\". If you are going to mark your products up that much, I want to see the money going back into the economy in the form of wages. If you want to pay your people squat, I think you should be selling your merchandise cheaply.\n \n Also, I don't care who you are or where you are from, if you are not going to pay taxes like the rest of us, you can just get the hell out of the country.", 
   {}, 
   55055, 
   null, 
   1087974180.0
  ], 
  [
   55159, 
   null, 
   "jim's trucking", 
   "I find that type of thinking typical of our arrogance, the very arrogance that has resulted in our ME problems. We position ourselves in the ME to protect our private oil interests, using the threat of the world's most powerful military to ensure compliance by all parties, we support Israels's expansionist policies (also driven in great part by private industry), we invade and occupy a sovereign ME nation by inciting the US public with a series of lies and then decide we'll determine the rules of engagement for those who live in the ME and disagree with us.\n \n Gee, they won't stand in front of our machine guns, armor or rockets and fight like men? We're the crusading Christians and they won't play by our rules? Well, since they're not stupid and becoming very successful in their resistance, let's call them poor sports. Yes, that's the key, we'll spin their methods as unfair! We'll call them dogs, ragheads, non-human and all those other Christian nicknames we use, kill civilians with impersonal high technology rewarded with low casualties for us when not getting our way, which is the only right way.\n\n \n My characterization as \"dogs\" applies to terrorists, not all ME peoples. I have several acquaintances in the RSAF and they are quite civilized. They abhor terrorism just as I do. I do not use the term \"ragheads\"...I do not care what you wear in the way of clothing. Unlike some believe, clothes do NOT make the man...it's how you treat the world that counts.\n \n I realize that anti-Bushites will forever claim that he lied us into a war...despite the FACT that the previous administration and a lot of the liberal left believed the same things that GWB claimed...that is, until he actually did something about it. What a bunch of pansies!", 
   {}, 
   55052, 
   null, 
   1087998900.0
  ], 
  [
   55160, 
   null, 
   "jim's trucking", 
   "Go to www.google.com and do a serach for radical islam saudi arabia. I don;t make up arguments.\n\n \n I'll not search for your proof. You should provide a link to the site that states your claims.\n \n \n \n\n It has been about 9 years since I was last in Saudi. My first job out of college was with a company that manufatured and installed prefab steel buildings. Most of theri business came from the ME. I was an assitant project supervisor (construction manager). I did stop briefly in Saudi 2 years ago on my way back from egypt, but that was only overnight to visit a friend there.\n\n \n I guess that pretty much qualifies you to comment on current events and practices in Saudi Arabia. LOL\n \n \n \n\n Do you routinely lie without reason to perfect strangers? \n\n \n Come now, daewoo. Surely, you don't believe that people in general are honest just because they don't personally know who they are talking to. Democrats lie to the general public all the time!\n \n emoticon_xkill all terrorists and those who support them", 
   {}, 
   55032, 
   null, 
   1087999560.0
  ], 
  [
   55161, 
   null, 
   "jim's trucking", 
   "Here's hoping the killers of the South Korean civilian are quickly slaughtered! emoticon_xhoho\n \n emoticon_xkill all terrorists and those who support them", 
   {}, 
   55159, 
   null, 
   1088000040.0
  ], 
  [
   55162, 
   null, 
   "georged", 
   " Personally, I am not a big fan of hiring illegals. Looking at the markup on consumer goods by American companies (400% or better in many cases), I have trouble reconciling this with \"greedy workers\". If you are going to mark your products up that much, I want to see the money going back into the economy in the form of wages. If you want to pay your people squat, I think you should be selling your merchandise cheaply.\n \n Also, I don't care who you are or where you are from, if you are not going to pay taxes like the rest of us, you can just get the hell out of the country.\n\n \n I would never knowingly hire an illegal just because of the workman's comp exposure (no coverage). My brother has a small manufacturing plant, components made in China (he ended component manufacturing here in 1993, when Taiwan was still a major facade for Chinese goods), packaged for distribution here, and they require the usual documents for hiring purposes, 100% Hispanic work force with an average hourly rate of about $7/hr. When La Migra makes their quarterly appearance, all the workers go over the wall. Reason? Immigration 'detains' anyone with a green card, often for weeks at a time. There are so many perfectly forged green cards, SS cards and driver licenses they do group roundups to keep the numbers up bureaucrats live for and sort everyone out in detention.", 
   {}, 
   55134, 
   null, 
   1088000700.0
  ], 
  [
   55241, 
   null, 
   "daewoo", 
   "I would never knowingly hire an illegal just because of the workman's comp exposure (no coverage). My brother has a small manufacturing plant, components made in China (he ended component manufacturing here in 1993, when Taiwan was still a major facade for Chinese goods), packaged for distribution here, and they require the usual documents for hiring purposes, 100% Hispanic work force with an average hourly rate of about $7/hr. When La Migra makes their quarterly appearance, all the workers go over the wall. Reason? Immigration 'detains' anyone with a green card, often for weeks at a time. There are so many perfectly forged green cards, SS cards and driver licenses they do group roundups to keep the numbers up bureaucrats live for and sort everyone out in detention.\n\n \n I have actually wondered how people who routinely hire illegals manage the workmans comp end of things. The biggest employer around here (Iowa Beef) is self insured, so it is not an problem for them. I can just imagine calling up my workmans comp agent and saying \"I want to add 20 illegals to my coverage). I can;t even imagine what the reply would be, though it would probably not be pretty.\n \n Around here, our cheap imported labor is not that cheap. Luckily, we have college kids who are cheap, and they make pretty good nannys and housekeepers. The only downside is that the nanny has to have 2 mornings a week off (to go to class). There are worse things, I suppose.", 
   {}, 
   55162, 
   null, 
   1088017200.0
  ], 
  [
   55244, 
   null, 
   "georged", 
   "I've been watching immigrants I'm familiar with from service duties fit into our system. The Gardener and his wife, who cleans houses, just bought their second home, 50% trade and cash down. Their workweek is six days, usually 10-12 hours a day. They've sponsored I have no idea of how many family members for work permits and green cards, all legal. I watch and listen to them and, as a third generation American, it reminds me very much of my maternal and paternal grandparents, greenhorns as they were called in their era. None will discuss politics, saying it's completely out of their hands and why worry about it. Common sense is rare in this day and age when the US public becomes outraged that American mercenaries there for the money are beheaded in Iraq and Saudi Arabia.", 
   {}, 
   55241, 
   null, 
   1088018160.0
  ], 
  [
   55765, 
   null, 
   "Ghost", 
   "The reason why I so despise these terrorists is not because they fight the US. It's not because they kill their enemy. The reason why I despise them is that they have no sense of honor, no decency. There is no humanity to them. These people are not 'freedom fighters,' or warriors of any kind. They're murderers, thugs, scum. Let me explain.\n \n Warriors kill their enemy. They kill combatants, they might kill people involved in manufacturing or supporting in some way their enemy. That I can understand. When we bombed Zarqawi's safehouses in the past few days, that's what we were doing. We're killing our enemy.\n \n They do not capture someone, hold them for ransom, then film themselves cutting off the person's head. It is not their killing of the person necessarily which makes them so terrible, it's the manner in which they do it. In Afghanistan, Taliban fighters ambushed a bus carrying elderly women and children on their way to help organize elections in that country. The fighters knew who was on the bus, and yet they still ambushed it, killing several people.\n \n Daewoo, I'm sure you're going to argue me on this. I don't really care, that's your opinion. My personal opinion is that holding down a screaming human being and beheading them with a knife is wrong. If anyone wants to debate me on that, bring it on.", 
   {}, 
   55244, 
   null, 
   1088383560.0
  ], 
  [
   55783, 
   null, 
   "georged", 
   "The reason why I so despise these terrorists is not because they fight the US. It's not because they kill their enemy. The reason why I despise them is that they have no sense of honor, no decency. There is no humanity to them. These people are not 'freedom fighters,' or warriors of any kind. They're murderers, thugs, scum. Let me explain.\n \n Warriors kill their enemy. They kill combatants, they might kill people involved in manufacturing or supporting in some way their enemy. That I can understand. When we bombed Zarqawi's safehouses in the past few days, that's what we were doing. We're killing our enemy.\n \n They do not capture someone, hold them for ransom, then film themselves cutting off the person's head. It is not their killing of the person necessarily which makes them so terrible, it's the manner in which they do it. In Afghanistan, Taliban fighters ambushed a bus carrying elderly women and children on their way to help organize elections in that country. The fighters knew who was on the bus, and yet they still ambushed it, killing several people.\n \n Daewoo, I'm sure you're going to argue me on this. I don't really care, that's your opinion. My personal opinion is that holding down a screaming human being and beheading them with a knife is wrong. If anyone wants to debate me on that, bring it on.\n\n \n I repeat myself, but the US has yet to have its back to the wall against a vastly superior force. We don't know what Americans are capable of doing under those circumstances. To talk warrior stuff is fine when you're holding all the cards. Maybe we'd just tie prisoners to a pickup and drive at 50MPH for say 30-minutes. We do have hands-on experience at that.", 
   {}, 
   55765, 
   null, 
   1088391300.0
  ], 
  [
   55787, 
   null, 
   "daewoo", 
   "Warriors kill their enemy. They kill combatants, they might kill people involved in manufacturing or supporting in some way their enemy. That I can understand. When we bombed Zarqawi's safehouses in the past few days, that's what we were doing. We're killing our enemy.\n\n \n It is the \"supporting in some way thir enemy\" in this I would like to address. I beleive that the civilian population of democratic nations are a legitimate target. I don't thinkthat if they elect one guys who does something off the wall they bear responsibilty for that, but when their nation is continually involved on shady dealings and the comission of various nasty acts, I think the voting population bears responsibility for that, thus they are legitimate targets.\n \n \nThey do not capture someone, hold them for ransom, then film themselves cutting off the person's head. It is not their killing of the person necessarily which makes them so terrible, it's the manner in which they do it. In Afghanistan, Taliban fighters ambushed a bus carrying elderly women and children on their way to help organize elections in that country. The fighters knew who was on the bus, and yet they still ambushed it, killing several people.\n\n \n No, we do not do this. When we kill prisoners, we do not film it, we cover it up. When we bomb busloads of civilians, or civilian businesses, we do it from a fighter plane at 40,000 ft, and there are no survivors. \n \n \nDaewoo, I'm sure you're going to argue me on this. I don't really care, that's your opinion. My personal opinion is that holding down a screaming human being and beheading them with a knife is wrong. If anyone wants to debate me on that, bring it on.\n\n \n I think we have been around this block before. if it is OK with you, I would prefer to just agree to disagree.\n \n P.S....nice to see you back.", 
   {}, 
   55765, 
   null, 
   1088399280.0
  ], 
  [
   55821, 
   null, 
   "jim's trucking", 
   "It is the \"supporting in some way thir enemy\" in this I would like to address. I beleive that the civilian population of democratic nations are a legitimate target. I don't thinkthat if they elect one guys who does something off the wall they bear responsibilty for that, but when their nation is continually involved on shady dealings and the comission of various nasty acts, I think the voting population bears responsibility for that, thus they are legitimate targets.\n \n \n \n No, we do not do this. When we kill prisoners, we do not film it, we cover it up. When we bomb busloads of civilians, or civilian businesses, we do it from a fighter plane at 40,000 ft, and there are no survivors. \n \n \n \n I think we have been around this block before. if it is OK with you, I would prefer to just agree to disagree.\n \n P.S....nice to see you back.\n\n \n Again, your argument is faulty. We do not intentionally blow up buses full of civilians. We do not intentionally bomb civilian businesses. That is the work ethic of terrorists.", 
   {}, 
   55787, 
   null, 
   1088436960.0
  ], 
  [
   55885, 
   null, 
   "daewoo", 
   "Again, your argument is faulty. We do not intentionally blow up buses full of civilians. We do not intentionally bomb civilian businesses. That is the work ethic of terrorists.\n\n \n The very first cruise missile we launched in this current war with Iraq was targeted at a Baghdad restraunt where we believed Saddm Hussein may have been eating. He, of course, was not, there, but we managed to kill everybody in the establishment. \n \n America is DEFINATLY not against bombing purely civilian targets if it suits our goals.", 
   {}, 
   55821, 
   null, 
   1088453100.0
  ], 
  [
   60630, 
   null, 
   "jim's trucking", 
   "The very first cruise missile we launched in this current war with Iraq was targeted at a Baghdad restraunt where we believed Saddm Hussein may have been eating. He, of course, was not, there, but we managed to kill everybody in the establishment. \n \n America is DEFINATLY not against bombing purely civilian targets if it suits our goals. \n\n \n \n As was proved with Nagasaki and Hiroshima. \n \n On edit: These were actually military targets with a lot of civilian collateral damage. The one big bomb could not distinguish between the two areas. Now we have smart bombs that can take out one restuarant instead of city blocks, thereby minimizing collateral damage.", 
   {}, 
   55885, 
   null, 
   1091415420.0
  ], 
  [
   60702, 
   null, 
   "apathy", 
   "It is kind of curious how the Saudi police just \"happened\" to catch the murderers just as they were trying to dispose of the body of Paul Johnson.\n \n The killers could have been anywhere in Saudi Arabia, yet according to the story on the news, the Saudi authorities ambushed the \"al-Qaeda terrorists\" shortly after they ditched the body.\n \n Huh?\n\n \n Yes and how did Fox News have its camera square on the explosion at the Christian church in Baghdad? I mean it was right where it was supposed to be, no wide shot closing in on a tight one. It was dead on to get the shot of the explosion.\n \n ps- the saudis are our enemy", 
   {}, 
   55021, 
   null, 
   1091482200.0
  ], 
  [
   60754, 
   null, 
   "Duo_Maxwell", 
   "Is \"due process of law\" important?\n Is a trial by your peers important?\n Is representation by a competent lawyer important?\n Are appeals important?\n \n To those who support the Saudi \"justice,\" none of those mean anything to them.", 
   {}, 
   60702, 
   null, 
   1091511120.0
  ], 
  [
   61125, 
   null, 
   "jim's trucking", 
   "Yes and how did Fox News have its camera square on the explosion at the Christian church in Baghdad? I mean it was right where it was supposed to be, no wide shot closing in on a tight one. It was dead on to get the shot of the explosion.\n \n ps- the saudis are our enemy\nI don't know the timing of the bombing shown \"dead on\", but it could be that Fox heard of other Christian Church bombings and pointed their camera toward that one in hopes of catching a shot of flying body parts. News hounds love to show the blood and guts...increases their ratings. emoticon_rolleyes \n \n Do not characterize all Saudis as our enemies.", 
   {}, 
   60702, 
   null, 
   1091739780.0
  ], 
  [
   61128, 
   null, 
   "unkerpaulie", 
   "Is \"due process of law\" important?\n Is a trial by your peers important?\n Is representation by a competent lawyer important?\n Are appeals important?\n \n To those who support the Saudi \"justice,\" none of those mean anything to them.\n\n even though we embrace these ideals in our democracy, im actually glad that the saudi justice system is the way it is in this particular instance. i dont think people that sever other people's head deserve the privellege of due process. besides, this is a war, you dont find out if your enemies are guilty before you shoot, now do you?\n \n while the liberal ideals sound good on paper, in the real world things sometimes just dont work that way...", 
   {}, 
   60754, 
   null, 
   1091740320.0
  ], 
  [
   61131, 
   null, 
   "georged", 
   "\n Do not characterize all Saudis as our enemies.\n\n \n Isn't that a little like stating some hookers have good hearts? The House of Saud removed our troops from their country, allows no intelligence gathering within their country, lives under Islamic Law, supplies under-the-table support for many Islamic Extremist organizations including shielding their financial activites, are spared by Islamic Extremists operating within Saudi Arabia for the purpose of killing Zionist Infidels and feeds our addiction to oil (including the consideration of accepting Euros for payment from other countries as the dollar dies a slow death). I see it purely as a supplier/customer relationship dominated by our need for oil and our military might. I'm trying to get a handle on where a basis for friendship might be identified.", 
   {}, 
   61125, 
   null, 
   1091741220.0
  ], 
  [
   61134, 
   null, 
   "jim's trucking", 
   "Isn't that a little like stating some hookers have good hearts?  The House of Saud removed our troops from their country, allows no intelligence gathering within their country, lives under Islamic Law, supplies under-the-table support for many Islamic Extremist organizations including shielding their financial activites, are spared by Islamic Extremists operating within Saudi Arabia for the purpose of killing Zionist Infidels and feeds our addiction to oil (including the consideration of accepting Euros for payment from other countries as the dollar dies a slow death). I see it purely as a supplier/customer relationship dominated by our need for oil and our military might. I'm trying to get a handle on where a basis for friendship might be identified.\nSomewhat, and it is true. Even if the entire House of Saud (the Royal family) hates the USA, that does not mean that all Saudis are our enemy. I know one personally that sides with the USA and democracy. He just can't afford to say so publicly. There are likely many more who do the same.", 
   {}, 
   61131, 
   null, 
   1091742180.0
  ], 
  [
   61138, 
   null, 
   "georged", 
   "Somewhat, and it is true. Even if the entire House of Saud (the Royal family) hates the USA, that does not mean that all Saudis are our enemy. I know one personally that sides with the USA and democracy. He just can't afford to say so publicly. There are likely many more who do the same.\n\n \n I can't argue with that. I've met all types of people of most nationalities who live in the US and love it, but adamantly disagree with various facets of our system of government.", 
   {}, 
   61134, 
   null, 
   1091743020.0
  ], 
  [
   61140, 
   null, 
   "jim's trucking", 
   "I can't argue with that. I've met all types of people of most nationalities who live in the US and love it, but adamantly disagree with various facets of our system of government.\nThe only difference is that here they are free to speak their mind.", 
   {}, 
   61138, 
   null, 
   1091743260.0
  ], 
  [
   61156, 
   null, 
   "Duo_Maxwell", 
   "even though we embrace these ideals in our democracy, im actually glad that the saudi justice system is the way it is in this particular instance. i dont think people that sever other people's head deserve the privellege of due process. besides, this is a war, you dont find out if your enemies are guilty before you shoot, now do you?\n\n \n But you assume that the Saudi even have the correct guy. Saudi justice is nortoriously questionable in how it gets its suspects as well as proving their criminal behavior. The ideals of democractic justice is meant to prove one's innocencts or lack of before punishment. The Saudi usually skip this and simply punish someone to appease the masses. You don't kill or chop off innocent people's hands in war. \n \n \n\n while the liberal ideals sound good on paper, in the real world things sometimes just dont work that way...\n\n \n Perhaps, but we strive to punish the correct person, not simply grab a guy of the street, beat him to give a false confession and then kill him to appease the masses.", 
   {}, 
   61140, 
   null, 
   1091750220.0
  ], 
  [
   61174, 
   null, 
   "daewoo", 
   "But you assume that the Saudi even have the correct guy. Saudi justice is nortoriously questionable in how it gets its suspects as well as proving their criminal behavior. The ideals of democractic justice is meant to prove one's innocencts or lack of before punishment. The Saudi usually skip this and simply punish someone to appease the masses. You don't kill or chop off innocent people's hands in war. \n\n \n I don't think saudi justice is questionable at all. There is no question that they routinely grab \"suspects\" off the street in order to appear that they are doing something. Innocent, guilty, who cares? why would it matter when you ar just going to end up executing the guy anyway (or have him killed in prison)? If you torture somebody long enough, they will admit \"their\" crimes just to get you to stop. It is amazing how many of the \"criminals\" who are captured and disapear in saudi (and saudi makes Iraq under saddam look friendly) are, coincidentally, political enemies of the house of Saud. Just this year a prominent journalist was arrested and ended up being killed in prison. his \"crime\"? He allegedly stole a trinket from a vendor. No vendor ever came forward and admitted to filing a complaint.\n \n Take a look at some of the human rights reports on saudi arabia. \n \n \n \n \nPerhaps, but we strive to punish the correct person, not simply grab a guy of the street, beat him to give a false confession and then kill him to appease the masses.\n\n \n Our way may seem fairer, but their way is certainly more efficient. Their way doesn't make any less sense than the folks here in the US who want to be \"hard on crime\" by locking people up for extraordinary periods of time for relatively benign offenses then ruin the rest of their lives over small infractions. \n \n the Sauds have figured it out. The public wants revenge, and it really doesn't matter if you have the right guy or not, as long as they get to actually see the blood.", 
   {}, 
   61156, 
   null, 
   1091761860.0
  ], 
  [
   61196, 
   null, 
   "Duo_Maxwell", 
   "daewoo: I hope you're being sarcastic.", 
   {}, 
   61174, 
   null, 
   1091768160.0
  ], 
  [
   61245, 
   null, 
   "jim's trucking", 
   "I haven't finished reading all of the comments below this article, but here a recent report from Saudi Arabia.\n \n http://www.aljazeera.com/cgi-bin/news_service/middle_east_full_story.asp?service_id=2984\n \n Does this sound like they picked a random target?", 
   {
    "post_info": {
     "post_title": "Who says they don't care?"
    }
   }, 
   61196, 
   null, 
   1091815200.0
  ], 
  [
   61341, 
   null, 
   "daewoo", 
   "daewoo: I hope you're being sarcastic.\n\n \n Of course I am being sarcastic.\n \n \n \nI haven't finished reading all of the comments below this article, but here a recent report from Saudi Arabia.\n \n http://www.aljazeera.com/cgi-bin/ne...service_id=2984\n \n Does this sound like they picked a random target?\n\n \n No, this was not a random target. It is a good thing that they caught this guy, too. This is the same fellow who for years has been orchastrating protests and pro-democratic rallies. He was considered a pretty serious threat to the monarcy. We certainly don't want people running around in Saudi Arabia who advocate things like elections.\n \n In general I support the anti-american terrorists in Sadi Arabia 110%. Most of them have been branded enemies of the Sadui government for years, largely because they wish to see an overthrow of the monarcy and some form of democracy installed. It is only through American support that the tyrants who rule Saudi arabia have managed to hold power for so long. Saudi arabia is the most totalitarin nation int he world BAR NONE. They make N Korea look like a free state, and America has supported them 100% in this.", 
   {}, 
   61196, 
   null, 
   1091853360.0
  ], 
  [
   61353, 
   null, 
   "Duo_Maxwell", 
   "Wait, wait, wait, how can a Bush supporter actually cite aljazeera as a source? \n \n Bush supporter hypocracy knows no bounds. \n \n jim's trucking, you just got slapped by daewoo. \n \n \nOf course I am being sarcastic.\n\n \n Just making sure.", 
   {}, 
   61341, 
   null, 
   1091874240.0
  ], 
  [
   61365, 
   null, 
   "georged", 
   "Wait, wait, wait, how can a Bush supporter actually cite aljazeera as a source? \n \n Bush supporter hypocracy knows no bounds. \n \n jim's trucking, you just got slapped by daewoo. \n \n \n \n Just making sure.\n\n \n Not to worry, Al Jazeera's Iraq TV station has just been shut down for one month. Too inflammatory was the reason given, not enough support for our Gestapo occupation the reality. I seem to remember our shutting down of al-sadr's newspaper really soothed the populace.", 
   {}, 
   61353, 
   null, 
   1091898540.0
  ], 
  [
   61378, 
   null, 
   "jim's trucking", 
   "Wait, wait, wait, how can a Bush supporter actually cite aljazeera as a source?  \n \n Bush supporter hypocracy knows no bounds. \n \n jim's trucking, you just got slapped by daewoo.   \n \n \n Just making sure.\n\n \n I cited it as a source of news from the horse's mouth. Sometimes I cite the democratic national confusion sites just to show how twisted they can be.\n \n Worse things have happened.Being slapped by a supporter of terrorists is pleasing to me.\n \n emoticon_xkill all terrorists and those who support them!  \n \n \n emoticon_xhoho", 
   {}, 
   61353, 
   null, 
   1091912100.0
  ], 
  [
   61379, 
   null, 
   "jim's trucking", 
   "...\n \n In general I support the anti-american terrorists in Sadi Arabia 110%.  Most of them have been branded enemies of the Sadui government for years, largely because they wish to see an overthrow of the monarcy and some form of democracy installed. It is only through American support that the tyrants who rule Saudi arabia have managed to hold power for so long. Saudi arabia is the most totalitarin nation int he world BAR NONE. They make N Korea look like a free state, and America has supported them 100% in this.\nYou would!", 
   {}, 
   61341, 
   null, 
   1091912220.0
  ], 
  [
   61393, 
   null, 
   "Duo_Maxwell", 
   "I cited it as a source of news from the horse's mouth. Sometimes I cite the democratic national confusion sites just to show how twisted they can be.\n\n \n Explain to me how you can be a bush supporter, a regiment that calls upon sources like aljazeera as false and terror supports, and turn around and use it as viable and credible proof? \n \n Once again, Bush supporter hypocracy knows no bounds. \n \n I don't think you understood what I said though. \n \n \n all terrorists and those who support them! \n\n \n Do you support Reagan?", 
   {}, 
   61379, 
   null, 
   1091925960.0
  ], 
  [
   61404, 
   null, 
   "georged", 
   "[B]Worse things have happened.Being slapped by a supporter of terrorists is pleasing to me.\n \n\n \n Builds additional, unmasked hatred? I'm curious as to what it takes to build hatred, an emotion I consider extreme, against Islamic Extremists who are protesting our oppressive foreign policy in the only manner they can beat our military superiority. I understand that your unquestionable support of the House of Saud is involved in that hatred because they are considered a US ally, but what's the reasoning behind it? The Sauds are as dictatorial as Saddam in their governing methodology.", 
   {}, 
   61378, 
   null, 
   1091936220.0
  ], 
  [
   61434, 
   null, 
   "jim's trucking", 
   "Explain to me how you can be a bush supporter, a regiment that calls upon sources like aljazeera as false and terror supports, and turn around and use it as viable and credible proof? \n \n Once again, Bush supporter hypocracy knows no bounds. \n \n I don't think you understood what I said though. \n \n \n \n Do you support Reagan?\nI used that particular article to support my claim that at least one Al Qaeda operative has been caught in Iraq. I fail to see how Ajazeera would lie about this item. I do not believe that any political slant can be put on the fact of the man's arrest.\n \n What you label hypocracy is up to you.\n \n Reagan is dead. I suported many of his ideals. However, I can't think of a single person or group whose ideals ever got complete sheepish support from me. There's something bad about everybody. I don't completely and blindly support Bush.\n \n The Reagan policies caved in the Soviet Union. The Bush policies have bettered the economy. IMO, the Kerry policies would weaken our nation and lead toward financial ruin.", 
   {}, 
   61393, 
   null, 
   1091986140.0
  ], 
  [
   61441, 
   null, 
   "georged", 
   " The Bush policies have bettered the economy.\n\n \n I won't hijack the thread, but suggest you look at the dollar, trade deficit and debt before believing that propaganda. Unless. of course, you're a believer in highly polished government numbers. In that case, I'm wasting bandwidth.", 
   {}, 
   61434, 
   null, 
   1091991420.0
  ], 
  [
   61447, 
   null, 
   "daewoo", 
   "You would!\n\n \n \n Of course I would. I am not some fascist XXXXX whose idea of right and wrong shifts daily based on short term foreign policy decisions. I support people right of self rule. I support democracy and freedom and those who are willing to fight for it. The fact that America has found it useful to keep a tyrannical government in power in Saudi Arabia does not make it right, and I will always support those \"terrorists\" who attack that tyrannical government in the name of self rule and democracy.\n \n \nThe Reagan policies caved in the Soviet Union. \n \n \n From a realistic standpoint, the Soviet union self destructed due to their massive security expendetures. too bad we didn't manage to learn anything from that.\n \n \nThe Bush policies have bettered the economy. IMO, the Kerry policies would weaken our nation and lead toward financial ruin.\n\n \n Do you smoke crack daily, or is it just a weekend thing? the dollar is a joke, our deficit is climbing with no end in sight, the long term picture for the stock market is REALLY ugly, the baby boomers are starting to retire (wihtout enough money left in the entire country to meet the social security obligation to them) and we are loosing a trillion dollars a year due to our trade deficit. I don't expect Kerry would be able to do anything to fix this mess, but bush hasn't done anything to fix it either, so lets not try to make the man into the savior of our economy. We are still seeing a job deficit, and the jobs that ARE being created pay 40% less than those that have been lost (manufacturing jobs mostly).", 
   {}, 
   61379, 
   null, 
   1092002520.0
  ], 
  [
   61452, 
   null, 
   "CCR1994", 
   "Of course I would. I am not some fascist XXXXX whose idea of right and wrong shifts daily based on short term foreign policy decisions. I support people right of self rule. I support democracy and freedom and those who are willing to fight for it. The fact that America has found it useful to keep a tyrannical government in power in Saudi Arabia does not make it right, and I will always support those \"terrorists\" who attack that tyrannical government in the name of self rule and democracy.\n\n \n It occurs to me that this may be ironic. Apparently democracy can be achieved through terror threats against the Saudi royals but not precision bombing by America's military against Saddam's army. In any case, I'm skeptical of terrorists who claim support for democracy.", 
   {}, 
   61447, 
   null, 
   1092004500.0
  ], 
  [
   61459, 
   null, 
   "Duo_Maxwell", 
   "I used that particular article to support my claim that at least one Al Qaeda operative has been caught in Iraq. I fail to see how Ajazeera would lie about this item. I do not believe that any political slant can be put on the fact of the man's arrest.\n\n \n You obviously missed the point. Bush supporters have typically a inherent hate for Ajazeera, and typically call it false, liars, anti-american, so on and so forth. They call it part of the liberal media and it cannot be trusted. For you, a Bush supporter, if I am correct, to use Ajazeera as a legitmate source is pure hypocracy. To say that it is false, then use it as true is hypocracy no matter how you cut it. Its essentially a leftists calling Drudge false then turning around and using drudge as proof he is correct. That is what you have done. \n \n \n\n What you label hypocracy is up to you.\n\n \n No, I just gave what your action is hypocratic. \n \n \n\n Reagan is dead. I suported many of his ideals. However, I can't think of a single person or group whose ideals ever got complete sheepish support from me. There's something bad about everybody. I don't completely and blindly support Bush.\n\n \n Dancing around the question I see. Do you support Reagan, and can I shoot you like your signature says? \n \n \n\n The Reagan policies caved in the Soviet Union. The Bush policies have bettered the economy. IMO, the Kerry policies would weaken our nation and lead toward financial ruin.\n\n \n That's questionable. Gorbechev pretty much killed the Soviet Union. Do you known what Glanost and Peristroka are? Reagan weakned it do the point, but Gorbecheve set of major radical liberal changes to a Tolitarian regime, that's putting a math to the roman candle. Bush policies.....I'll let Daewoo smack you down as he so finely does time after time.", 
   {}, 
   61434, 
   null, 
   1092006480.0
  ], 
  [
   61462, 
   null, 
   "CCR1994", 
   "You obviously missed the point. Bush supporters have typically a inherent hate for Ajazeera, and typically call it false, liars, anti-american, so on and so forth. They call it part of the liberal media and it cannot be trusted. For you, a Bush supporter, if I am correct, to use Ajazeera as a legitmate source is pure hypocracy. To say that it is false, then use it as true is hypocracy no matter how you cut it. Its essentially a leftists calling Drudge false then turning around and using drudge as proof he is correct. That is what you have done. \n\n \n Ok. You win. Aljazeera cannot be trusted to report the truth. Saudi Arabia did not arrest an Al-queda operative after all. Is that better?", 
   {}, 
   61459, 
   null, 
   1092007380.0
  ], 
  [
   61463, 
   null, 
   "daewoo", 
   "It occurs to me that this may be ironic. Apparently democracy can be achieved through terror threats against the Saudi royals but not precision bombing by America's military against Saddam's army. In any case, I'm skeptical of terrorists who claim support for democracy.\n\n \n \n No, democracy almost alwys has to be insituted from within ot work. Bombing Iraq, then appointing an interm government (and, oddly enough, a baathist as the prime minister) the having our handpicked guys write up a constitution is not going to work because there will alwys be questions about the legitimacy of the government and there will be people who will exploit that for years to come. \n \n Most of the Saudi \"terrorists\" are working for the downfall of the tyranical rulers who are running the place. They are revolutionaries. It is only recently that we started labeleing them as terrorists, because we need Saudi as an ally right now.", 
   {}, 
   61452, 
   null, 
   1092007500.0
  ], 
  [
   61464, 
   null, 
   "CCR1994", 
   "Most of the Saudi \"terrorists\" are working for the downfall of the tyranical rulers who are running the place. They are revolutionaries. It is only recently that we started labeleing them as terrorists, because we need Saudi as an ally right now.\n\n \n Surprising as this may be, I actually do support the downfall of the Saudi regime. And for the sake of full disclosure, I actually read the Aljazeera article on the capture of this terrorist after my most recent post. He was not identified as a member of Al-queda in the article so I am curious how Jim's Trucking actually knows this.", 
   {}, 
   61463, 
   null, 
   1092008040.0
  ], 
  [
   61515, 
   null, 
   "jim's trucking", 
   "Of course I would. I am not some fascist XXXXX whose idea of right and wrong shifts daily based on short term foreign policy decisions.  I support people right of self rule. I support democracy and freedom and those who are willing to fight for it. The fact that America has found it useful to keep a tyrannical government in power in Saudi Arabia does not make it right, and I will always support those \"terrorists\" who attack that tyrannical government in the name of self rule and democracy.\n \n \n \n From a realistic standpoint, the Soviet union self destructed due to their massive security expendetures. too bad we didn't manage to learn anything from that.\n \n \n \n Do you smoke crack daily, or is it just a weekend thing?  the dollar is a joke, our deficit is climbing with no end in sight, the long term picture for the stock market is REALLY ugly, the baby boomers are starting to retire (wihtout enough money left in the entire country to meet the social security obligation to them) and we are loosing a trillion dollars a year due to our trade deficit. I don't expect Kerry would be able to do anything to fix this mess, but bush hasn't done anything to fix it either, so lets not try to make the man into the savior of our economy. We are still seeing a job deficit, and the jobs that ARE being created pay 40% less than those that have been lost (manufacturing jobs mostly).\n\n \n Neither am I.\n \n I don't smoke crack at all.\n \n You can blame a lot of our economic woes on terrorism, such as you support. I shudder to think what the economy would look like under liberal Democratic leadership. If Kerry wins, we'll find out.", 
   {}, 
   61447, 
   null, 
   1092059160.0
  ], 
  [
   61516, 
   null, 
   "jim's trucking", 
   "Surprising as this may be, I actually do support the downfall of the Saudi regime. And for the sake of full disclosure, I actually read the Aljazeera article on the capture of this terrorist after my most recent post. He was not identified as a member of Al-queda in the article so I am curious how Jim's Trucking actually knows this.  \n\n \n http://www.telegraph.co.uk/news/main.jhtml?xml=/news/2004/08/07/walq07.xml&sSheet=/news/2004/08/07/ixworld.html\n \n Saudi Arabia's most vociferous al-Qa'eda militant was arrested with a colleague in a café yesterday.\n \n \n \n Faris Ahmed Jamaan al-Showeel al-Zahrani was al-Qa'eda's foremost Saudi ideologue, publishing messages on the internet inciting supporters to violence.\n \n (similar to that which daewoo supports)", 
   {}, 
   61464, 
   null, 
   1092059760.0
  ], 
  [
   61525, 
   null, 
   "georged", 
   "Jim, your statements are becoming more and more confusing. You continually side with the administration in condemning Al Jazeera for biased reporting and then use it as a source point. Your support of the Sauds as an ally and curse on nationalists attempting to overthrow their dictatorship with Internet posts inciting rebellion follows continual posts on all subjects professing condemnation of anyone supporting Saddam's dictatorship. In one post you praise Bush for bettering our economy, followed by another post blaming our economic woes on terrorists. ????", 
   {}, 
   61516, 
   null, 
   1092064140.0
  ], 
  [
   61529, 
   null, 
   "jim's trucking", 
   "Jim, your statements are becoming more and more confusing. You continually side with the administration in condemning Al Jazeera for biased reporting and then use it as a source point. Your support of the Sauds as an ally and curse on nationalists attempting to overthrow their dictatorship with Internet posts inciting rebellion follows continual posts on all subjects professing condemnation of anyone supporting Saddam's dictatorship. In one post you praise Bush for bettering our economy, followed by another post blaming our economic woes on terrorists. ????\nSee if you can grasp this. I used Aljazeera as a source of a story indicating the capture of a terrorist, an actual happening. That does not mean that I trust every story from that source. I sometimes quote liberal biased sources (when they report facts), but that also does not mean I trust them on every point. I doubt I would ever quote Aljazeera on an opinion article. Your argument is weak on this issue.\n \n I did not claim to support the House of Saud. I disagreed with the argument that all Saudis are against us.\n \n I did not blame the entire woes of the economy on terrorism. I said, \"You can blame a lot of  our economic woes on terrorism, such as you (daewoo) support\".", 
   {}, 
   61525, 
   null, 
   1092065400.0
  ], 
  [
   61535, 
   null, 
   "jim's trucking", 
   "...\n Dancing around the question I see. Do you support Reagan, and can I shoot you like your signature says? \n \n ...\n I didn't dance around your question...and the shooter is not in my signature. As a matter of fact, I don't have a signature on this forum...yet.\n \n You asked a simple question: Do you support Reagan?\n \n I gave a simple answer: Reagan is dead.\n \n I then explained that I agreed with a lot of his policies.\n \n Now you ask again: Do you support Reagan?\n \n Apparently, you cannot comprehend this simple fact: Reagan is dead and can no longer be supported. Had you asked \"Did you support Reagan?\", I'd have answered, \"Yes, I did.\"\n \n You need to learn how to be exact, instead of cloudy. Oh, I forgot! That doesn't work with liberal logic.", 
   {}, 
   61459, 
   null, 
   1092072240.0
  ], 
  [
   61539, 
   null, 
   "Waxy", 
   "I didn't dance around your question...and the shooter is not in my signature. As a matter of fact, I don't have a signature on this forum...yet.\n \n You asked a simple question: Do you support Reagan?\n \n I gave a simple answer: Reagan is dead.\n \n I then explained that I agreed with a lot of his policies.\n \n Now you ask again: Do you support Reagan?\n \n Apparently, you cannot comprehend this simple fact: Reagan is dead and can no longer be supported. Had you asked \"Did you support Reagan?\", I'd have answered, \"Yes, I did.\"\n \n You need to learn how to be exact, instead of cloudy. Oh, I forgot! That doesn't work with liberal logic.\n\n \n LOL. :p\n \n Jim's Trucking ladies and gentlemen- The Gregory HINES of 4Forums!\n \n He'll be here all week!\n \n Don't forget to tip your waitress.\n \n Waxy\n \n On edit: Oops, wrong Gregory. emoticon_frazzled", 
   {}, 
   61535, 
   null, 
   1092073740.0
  ], 
  [
   61543, 
   null, 
   "jim's trucking", 
   "LOL. :p\n \n Jim's Trucking ladies and gentlemen- The Gregory Peck of 4Forums!\n \n He'll be here all week!\n \n Don't forget to tip your waitress.\n \n Waxy\n\n \n That's a compliment. Thanks.\n \n I'll be here as long as possible. (Why did you change it from \"One night only!\"?\n \n Do tip your waitresses...well!", 
   {}, 
   61539, 
   null, 
   1092076980.0
  ], 
  [
   61544, 
   null, 
   "Waxy", 
   "That's a compliment. Thanks.\n \n I'll be here as long as possible. (Why did you change it from \"One night only!\"?\n \n Do tip your waitresses...well!\n\n \n Whooops. \n \n It's fixed now. :p\n \n Waxy", 
   {}, 
   61543, 
   null, 
   1092077280.0
  ], 
  [
   61570, 
   null, 
   "Duo_Maxwell", 
   "But you did post this: \n \n \nemoticon_xkill all terrorists and those who support them!\n\n \n \nYou asked a simple question: Do you support Reagan?\n \n I gave a simple answer: Reagan is dead.\n \n I then explained that I agreed with a lot of his policies.\n\n \n So you do support Reagan via his policies? \n \n \n Had you asked \"Did you support Reagan?\", I'd have answered, \"Yes, I did.\"\n\n \n Then I can shoot you too according to what you posted earlier.\n \n We can emoticon_xkill Jim's trucking because he supported terrorists.", 
   {}, 
   61544, 
   null, 
   1092095940.0
  ], 
  [
   61596, 
   null, 
   "daewoo", 
   "You can blame a lot of our economic woes on terrorism, such as you support. I shudder to think what the economy would look like under liberal Democratic leadership. If Kerry wins, we'll find out.\n\n \n Those numbers don't include ANY terrorism spending. they are such a spending spree that nobody has any real idea about how much has gone down the toilet. The best numbers we have seen so far are from the Bush whitehouse and they say \"at least 100 billion per year\".\n \n Blame them all you want on terrorism. even completely disregarding terrorism (which I do when studying the numbers since there is no real good guess yet), we are in deep trouble,.", 
   {}, 
   61515, 
   null, 
   1092112200.0
  ], 
  [
   61626, 
   null, 
   "jim's trucking", 
   "Those numbers don't include ANY terrorism spending. they are such a spending spree that nobody has any real idea about how much has gone down the toilet. The best numbers we have seen so far are from the Bush whitehouse and they say \"at least 100 billion per year\".\n \n Blame them all you want on terrorism. even completely disregarding terrorism (which I do when studying the numbers since there is no real good guess yet), we are in deep trouble,.\nTerrorism spending does not have to be included in governement reports for terrorism to have some effect on the economy. Just ask the airline and tourism industry how much their business fell off after 9-11.\n \n Just calculate how much money has been spent on added security and added cost of rescheduling, inspecting and rerouting shipping.\n \n Calculate how much investment capital was upheld. Companies deciding not to expand hurt the architects, engineers and construction companies.", 
   {}, 
   61596, 
   null, 
   1092152700.0
  ], 
  [
   61628, 
   null, 
   "jim's trucking", 
   "But you did post this: \nSo?\n \n \n \n \n \n\n So you do support Reagan via his policies?\nJust how obtuse are you? Reagan is dead and can no longer be supported. \n \n \n \n\n Then I can shoot you too according to what you posted earlier.\nYou are free to do as you please. Just don't get caught.\n \n \n\n We can emoticon_xkill Jim's trucking because he supported terrorists.\nYour opinion is non-factual.", 
   {}, 
   61570, 
   null, 
   1092152940.0
  ], 
  [
   61639, 
   null, 
   "daewoo", 
   "Terrorism spending does not have to be included in governement reports for terrorism to have some effect on the economy. Just ask the airline and tourism industry how much their business fell off after 9-11.\n\n \n Yes, fortunatly these have nothing to do with our deficit or our trade imbalance.\n \n \nJust calculate how much money has been spent on added security and added cost of rescheduling, inspecting and rerouting shipping.\n\n \n Again, has nothing to do with trade eficit or governmental deficit spending. From a realistic standpoint, this got money moving, which theoretically should stimulate the economy, which it did. We are seeing it right now, these extra expeditures are what is allowing our politicians to polish our GDP numbers.\n \n \nCalculate how much investment capital was upheld. Companies deciding not to expand hurt the architects, engineers and construction companies.\n\n \n None. this has contined alond the same path predicted far before 9/11 or the war on terror.\n \n The only money that really matters in the war on terror as far as the big picture is concerned, is money being shipped out of the country, never to return. while the war has been incredibly expensive, it has also driven a wartime economy, which has helped polish GDP numbers. It has encouraged money shuffling.\n \n You are still looking at a defict of several hundred billion dollars (which would still exist without the \"war on terror\") and a MASSIVE trade imbalance which has nothing at ALL to to with the terrorism issue.", 
   {}, 
   61626, 
   null, 
   1092159960.0
  ], 
  [
   61660, 
   null, 
   "Duo_Maxwell", 
   "Reagan is dead and can no longer be supported.\n\n \n But he did support terrorism, and you supported Reagan, so therefore under your very own logic, we can shoot you. \n \n \nYour opinion is non-factual.\n\n \n So you're saying that Reagan DIDN'T support terrorism at all? :p \n \n You said shoot all terrorists and those who support them. You supported Reagan, and Reagan supported terrorists, therefore we can shoot you with your permission. \n \n I've noticed alot of people here don't like their logic used aganist them.", 
   {}, 
   61639, 
   null, 
   1092180720.0
  ], 
  [
   61671, 
   null, 
   "CCR1994", 
   "http://www.telegraph.co.uk/news/main.jhtml?xml=/news/2004/08/07/walq07.xml&sSheet=/news/2004/08/07/ixworld.html\n \n Saudi Arabia's most vociferous al-Qa'eda militant was arrested with a colleague in a café yesterday.\n \n \n \n Faris Ahmed Jamaan al-Showeel al-Zahrani was al-Qa'eda's foremost Saudi ideologue, publishing messages on the internet inciting supporters to violence.\n \n (similar to that which daewoo supports)\n\n \n Thank you. That is what I was looking for.\n \n \nOf course I would. I am not some fascist XXXXX whose idea of right and wrong shifts daily based on short term foreign policy decisions. I support people right of self rule. I support democracy and freedom and those who are willing to fight for it. The fact that America has found it useful to keep a tyrannical government in power in Saudi Arabia does not make it right, and I will always support those \"terrorists\" who attack that tyrannical government in the name of self rule and democracy.\n \n\n \n Do you own a dictionary from the twilight zone? Explain to me how an organiztion dedicated to theocratic fascism intends to establish a liberal democratic secular government with free speech and religious liberties.", 
   {}, 
   61516, 
   null, 
   1092192360.0
  ], 
  [
   61714, 
   null, 
   "jim's trucking", 
   "Yes, fortunatly these have nothing to do with our deficit or our trade imbalance.\n \n \n \n Again, has nothing to do with trade eficit or governmental deficit spending. From a realistic standpoint, this got money moving, which theoretically should stimulate the economy, which it did. We are seeing it right now, these extra expeditures are what is allowing our politicians to polish our GDP numbers.\n \n \n \n None. this has contined alond the same path predicted far before 9/11 or the war on terror.\n \n The only money that really matters in the war on terror as far as the big picture is concerned, is money being shipped out of the country, never to return. while the war has been incredibly expensive, it has also driven a wartime economy, which has helped polish GDP numbers. It has encouraged money shuffling.\n \n You are still looking at a defict of several hundred billion dollars (which would still exist without the \"war on terror\") and a MASSIVE trade imbalance which has nothing at ALL to to with the terrorism issue.\n\n \n You speak as if the trade deficit is the measuring stick of the entire economy. Consumer cash flow counts. A lot of cash stopped flowing as a result of 9-11.", 
   {}, 
   61639, 
   null, 
   1092231660.0
  ], 
  [
   61728, 
   null, 
   "jim's trucking", 
   "But he did support terrorism, and you supported Reagan, so therefore under your very own logic, we can shoot you. \n \n \n \n So you're saying that Reagan DIDN'T support terrorism at all? :p \n \n You said shoot all terrorists and those who support them. You supported Reagan, and Reagan supported terrorists, therefore we can shoot you with your permission. \n \n I've noticed alot of people here don't like their logic used aganist them.\nYou characterize all fighters as terrorists. Someone who uses similar tactics to attack a military objective is not the same as someone who blows up crowded public buses to scare people.\n \n Free speech is not to be regulated like diseased cattle and impure butter. The audience that hissed yesterday may applaud today, even for the same performance.-William O. Douglas...your hero.", 
   {}, 
   61660, 
   null, 
   1092238080.0
  ], 
  [
   61735, 
   null, 
   "daewoo", 
   "You speak as if the trade deficit is the measuring stick of the entire economy. Consumer cash flow counts. A lot of cash stopped flowing as a result of 9-11.\n\n \n \n The easiestr way to look at it is that America is a big company. either we are making money (bringing new money into the country) or loosing money (more going out than coming in). This is what the trade deficit shows us. A LOT more money is going out than coming in. Our budgetary deficit is akin to a company borrowing money to make payroll (which is generally considered one of the worst ideas in business).\n \n Consumer spending does make a big difference, but it is not alwyas positive. When you are running a positive trade balance, consumer spending generally helps the economy because it helps American businesses grow. When you are running a trade deficit (especially one as large as ours), more consumer spending simply sends more money out of the country faster. This is not really a good thing.\n \n If we could track consumer spending on American made goods, we could get a much better indicator of economic stimulus. Unfortunatly, we quit counting our beans like that a long time ago. It was simply too depressing.", 
   {}, 
   61714, 
   null, 
   1092241680.0
  ], 
  [
   61736, 
   null, 
   "jim's trucking", 
   "The easiestr way to look at it is that America is a big company. either we are making money (bringing new money into the country) or loosing money (more going out than coming in). This is what the trade deficit shows us. A LOT more money is going out than coming in. Our budgetary deficit is akin to a company borrowing money to make payroll (which is generally considered one of the worst ideas in business).\n \n Consumer spending does make a big difference, but it is not alwyas positive. When you are running a positive trade balance, consumer spending generally helps the economy because it helps American businesses grow. When you are running a trade deficit (especially one as large as ours), more consumer spending simply sends more money out of the country faster. This is not really a good thing.\n \n If we could track consumer spending on American made goods, we could get a much better indicator of economic stimulus. Unfortunatly, we quit counting our beans like that a long time ago. It was simply too depressing.\nMy point is that several companies, after 9-11-01, elected not to go ahead with planned expansions, keeping their money from the architects, engineers and contractors who would have profited from this \"internal\" spending...it has little to do with foreign trade.", 
   {}, 
   61735, 
   null, 
   1092242400.0
  ], 
  [
   61951, 
   null, 
   "Duo_Maxwell", 
   "You characterize all fighters as terrorists. Someone who uses similar tactics to attack a military objective is not the same as someone who blows up crowded public buses to scare people.\n\n \n You characterize them by who they are fighting for. Double standard. Is someone who kidnaps, murders and shoots innocent people to scare the populace away from supporting a governement a terrorist? \n \n \n\n Free speech is not to be regulated like diseased cattle and impure butter. The audience that hissed yesterday may applaud today, even for the same performance.-William O. Douglas...your hero.\n\n \n Your double standards must make life somewhat contrictiory to everyone around you mustn't it? \n \n Under your very own post, we can now shoot you for supporting terrorism.", 
   {}, 
   61728, 
   null, 
   1092353820.0
  ], 
  [
   61976, 
   null, 
   "jim's trucking", 
   "You characterize them by who they are fighting for.Double standard. \nNo. I characterize them by who they try to kill.\n \n \nIs someone who kidnaps, murders and shoots innocent people to scare the populace away from supporting a government a terrorist? \nYes.", 
   {}, 
   61951, 
   null, 
   1092357840.0
  ], 
  [
   61978, 
   null, 
   "Duo_Maxwell", 
   "Yes\n\n \n Therefore you support terrorism. The contras that Reagan had trained, funded and sent down to topple the democratically elected governments in Latin America murdered, raped, shot and terrorized thousands of innocent people throughout Latin America. \n \n You supported terrorism", 
   {}, 
   61976, 
   null, 
   1092358140.0
  ], 
  [
   61981, 
   null, 
   "jim's trucking", 
   "Therefore you support terrorism. The contras that Reagan had trained, funded and sent down to topple the democratically elected governments in Latin America murdered, raped, shot and terrorized thousands of innocent people throughout Latin America. \n \n You supported terrorism\nYour logic is flawed. In case you haven't read my posts, I stated earlier that I can't think of any person that I've agreed with totally...ever. I supported much of Reagan's policies, but not every action taken as a result of his policies. Besides, Reagan likely did not give the orders for the atrocities, just as Bush did not give the orders for the mistreatment of prisoners.\n \n I support our troops in Iraq, but disapprove of their mistreatment of the Abu Ghraib prisoners.\n \n Can you imagine that? (Never mind the answer. I know it doesn't support your weak argument, so I know you can't imagine it.)\n \n You have a childish approach to this thing called argument...and I doubt seriously that you've read my recent posts. Try re-reading Post #47.", 
   {}, 
   61978, 
   null, 
   1092358560.0
  ], 
  [
   61982, 
   null, 
   "Duo_Maxwell", 
   "actually, you are resorting to cherry picking what you want whenever you want to get out of arguments you know you can't win, such as now. That is a weak style of debating, running away from topics you don't like even when what you said goes directly aganist you. \n \n Can you imagine that? (Never mind the answer. I know it doesn't support your weak argument, so I know you can't imagine it.)\n \n You have a childish approach to this thing called argument...and I know that you haven't read my recent posts. \n \n I don't even have to type much, I just copy what you type and use it against you.", 
   {}, 
   61981, 
   null, 
   1092359880.0
  ], 
  [
   61983, 
   null, 
   "jim's trucking", 
   "actually, you are resorting to cherry picking what you want whenever you want to get out of arguments you know you can't win, such as now. That is a weak style of debating, running away from topics you don't like even when what you said goes directly aganist you. \n \n Can you imagine that? (Never mind the answer. I know it doesn't support your weak argument, so I know you can't imagine it.)\n \n You have a childish approach to this thing called argument...and I know that you haven't read my recent posts. \n \n I don't even have to type much, I just copy what you type and use it against you.\n...proving my point.", 
   {}, 
   61982, 
   null, 
   1092359940.0
  ], 
  [
   61987, 
   null, 
   "Duo_Maxwell", 
   "You said this:\n \n \nHad you asked \"Did you support Reagan?\", I'd have answered, \"Yes, I did.\"\n\n \n And you also said this: \n \n \nemoticon_xkill all terrorists and those who support them!\n\n \n Reagan pushed the terrorists in Latin America. He therefore supported terrorism, and you supported Reagan, therefore you supported terrorism, and under your logic we can now shoot you. \n \n Now you're saying\n \n \nI stated earlier that I can't think of any person that I've agreed with totally...ever. I supported much of Reagan's policies, but not every action taken as a result of his policies.\n\n \n So which is it? You change your story every post to suit your arguments ignoring the fact that it becomes contricidtory as well as inconistant.", 
   {}, 
   61983, 
   null, 
   1092360240.0
  ], 
  [
   61989, 
   null, 
   "jim's trucking", 
   "You said this:\n \n \n \n And you also said this: \n \n \n \n Reagan pushed the terrorists in Latin America. He therefore supported terrorism, and you supported Reagan, therefore you supported terrorism, and under your logic we can now shoot you. \n \n Now you're saying\n \n \n \n So which is it? You change your story every post to suit your arguments ignoring the fact that it becomes contricidtory as well as inconistant.\nYou just don't get the picture, do you? Again, I refer you to Post #47. Read it this time! Try to comprehend what it means.", 
   {}, 
   61987, 
   null, 
   1092360420.0
  ], 
  [
   62004, 
   null, 
   "Duo_Maxwell", 
   "why is it that you can't understand that you are interepeting what you said to what it to say every other post? \n \n A = B\n B = C\n C does not equal to A with you. \n Then B does not equal to A after that,\n then A = B. \n \n You keep changing around what you say to what you want it to say while ignoring what doesn't fit into your argument regardless that you said it. \n \n Jim's trucking is a flip flopper!", 
   {}, 
   61989, 
   null, 
   1092365880.0
  ], 
  [
   62045, 
   null, 
   "jim's trucking", 
   "why is it that you can't understand that you are interepeting what you said to what it to say every other post? \n \n A = B\n B = C\n C does not equal to A with you. \n Then B does not equal to A after that,\n then A = B. \n \n You keep changing around what you say to what you want it to say while ignoring what doesn't fit into your argument regardless that you said it. \n \n Jim's trucking is a flip flopper!\nApparently, you are unable to understand English. I haven't changed anything I said. You misinterpret my support of Reagan's policies by extending it to all happenings under his watch.\n \n Your opinion doesn't mean anything to me.\n \n Go pound sand.", 
   {}, 
   62004, 
   null, 
   1092408720.0
  ], 
  [
   62382, 
   null, 
   "Duo_Maxwell", 
   "jim's trucking, how can you deride kerry for flip flopping when you do it yourself?", 
   {}, 
   62045, 
   null, 
   1092647880.0
  ], 
  [
   62535, 
   null, 
   "Master_Shake", 
   "Don't you understand jim's trucking? The Saudi's ARE terrorists, they aren't doing anything to combat terrorism, they are funding it. The majority of the hijackers on 9/11 were Saudi's. And yet somehow they are still our \"allies.\" Gee, I wonder why that is.\n :xcensored", 
   {
    "post_info": {
     "post_title": "Saudi's are terrorists!"
    }
   }, 
   62382, 
   null, 
   1092710700.0
  ], 
  [
   62576, 
   null, 
   "Duo_Maxwell", 
   "Master_Shake, many of our allies in the war for terrorism are terror havens, supporters and funders themselves, or outright backstabbers like Israel.", 
   {}, 
   62535, 
   null, 
   1092723900.0
  ], 
  [
   62591, 
   null, 
   "jim's trucking", 
   "Don't you understand jim's trucking? The Saudi's ARE terrorists, they aren't doing anything to combat terrorism, they are funding it.  The majority of the hijackers on 9/11 were Saudi's. And yet somehow they are still our \"allies.\" Gee, I wonder why that is.\n :xcensored\nIn each of these links, you will find disagreement with your claim.\n \n http://www.foxnews.com/story/0,2933,102720,00.html\n \n http://www.saudi-us-relations.org/newsletter/saudi-relations-supplement-5-10.html\n \n http://www.saudi-us-relations.org/newsletter/saudi-relations-37.html\n \n http://www.foxnews.com/story/0,2933,86790,00.html\n \n http://www.topix.net/world/saudi-arabia?full=2675209\n \n http://www.truthout.com/docs_03/073003D.shtml\n \n http://www.arabialink.com/Archive/GWDigests/GWD2003/GWD_2003_12_15.htm#NS6\n \n I realize you can find evidence that some Saudis have financed and participated in terrorism, the prime example being Bin Laden. You can find evidence that some Americans have done the same. There's likely evidence somewhere that a person from any given country has done so. That doesn't mean that the country backs them or does nothing to stop them.\n \n You need to stop drinking the partyline Kool-Aid and listen to both sides.", 
   {}, 
   62535, 
   null, 
   1092753060.0
  ], 
  [
   62986, 
   null, 
   "Master_Shake", 
   "I realize you can find evidence that some Saudis have financed and participated in terrorism, the prime example being Bin Laden. You can find evidence that some Americans have done the same. There's likely evidence somewhere that a person from any given country has done so. That doesn't mean that the country backs them or does nothing to stop them.\n \n You need to stop drinking the partyline Kool-Aid and listen to both sides.\n\n \n emoticon_wow \"Partyline Kool-Aid\"??? I'll have you know I'm an independent first of all. Secondly, this has nothing to do with any particular party, everybody on both sides of the aisle with half a brain knows this stuff about Saudi Arabia. The only reason I can imagine you are saying this stuff is because Bush says they are our allies, and you can't help but not question anything that comes out of his mouth despite his obvious motives for saying the Saudis are our \"allies.\" If this isn't the case please explain why you are supportive of the Saudis, because, even if they didn't support terrorism, they have a bad enough record of human rights violations for them to be despised anyway.\n \n And so what that there is probably \"someone\" in most countries that supports terrorism in some fashion, this isn't the case with the Saudis. This ins't a case of a few nutballs in the country making the whole country look bad. This is a case of the government, officially or unofficiallly, supporting terrorism. And thanks for your Fox News links, they were very \"fair and balanced.\" :xcensored", 
   {}, 
   62591, 
   null, 
   1092877140.0
  ], 
  [
   63063, 
   null, 
   "jim's trucking", 
   "emoticon_wow \"Partyline Kool-Aid\"??? I'll have you know I'm an independent first of all. Secondly, this has nothing to do with any particular party, everybody on both sides of the aisle with half a brain knows this stuff about Saudi Arabia. The only reason I can imagine you are saying this stuff is because Bush says they are our allies, and you can't help but not question anything that comes out of his mouth despite his obvious motives for saying the Saudis are our \"allies.\" If this isn't the case please explain why you are supportive of the Saudis, because, even if they didn't support terrorism, they have a bad enough record of human rights violations for them to be despised anyway.\n \n And so what that there is probably \"someone\" in most countries that supports terrorism in some fashion, this isn't the case with the Saudis. This ins't a case of a few nutballs in the country making the whole country look bad. This is a case of the government, officially or unofficiallly, supporting terrorism. And thanks for your Fox News links, they were very \"fair and balanced.\" :xcensored\n\n \n Did you not find evidence of the Saudis fighting terrorism in those links I posted? I refuted your claim that they are doing nothing in that regard.", 
   {}, 
   62986, 
   null, 
   1092931080.0
  ], 
  [
   63064, 
   null, 
   "jim's trucking", 
   "jim's trucking, how can you deride kerry for flip flopping when you do it yourself?\nAgain I say, you can't understand English. \n \n For the last time, I urge you to read Post #47 of this thread. If you can't understand it, get some help from a grown person.", 
   {}, 
   62382, 
   null, 
   1092931200.0
  ], 
  [
   63078, 
   null, 
   "Gator", 
   "I realize you can find evidence that some Saudis have financed and participated in terrorism, the prime example being Bin Laden. You can find evidence that some Americans have done the same.\nFirst I want to mention briefly that bin Laden is not a Saudi citizen. The kingdom stripped him of his citizenship more than 10 years ago and declared him persona non grata after he tried to overthrow the ruling regime.\n \n As for the parallel you've drawn between American terrorists and Saudi terrorists, it doesn't stand up to scrutiny. No doubt we have terrorists within our borders, but our government brooks no nonsense from home-grown American terrorists, whereas the Saudi royal house has powerful factions that finance and protect terrorist groups.\n \n Surely there are Saudis favorably disposed to the West and who might fairly be considered American allies, but the prevailing view of most Saudis is anti-American, as confirmed in their media and in their schools and mosques. When we ask if the Saudis are friend or foe, our focus should be on the House of Saud, since most Saudis on the street are already antagonistic to the U.S.\n \n Despite rough patches in U.S.-Saudi relations since 9/11, it's no surprise that some in Washington continue to characterize the Saudis as our friends. We have no practical alternative. If the monarchy falls, its replacement is certain to be more hostile to U.S. interests, so we're nearly compelled to remain in bed with a brutal totalitarian regime and hope that the rivalries and intrigues gripping the royal house eventually pan out in our favor. None of this would even matter if the kingdom were not sitting on an ocean of oil, but that's reason enough for the U.S. to want to maintain our long-standing bilateral friendly relations.\n \n Still, there are of major concerns one can point to that underscore the dangers that Saudi policy poses to U.S. security. The most significant perhaps is Saudi Arabia's state religious doctrine, the Wahhabite version of Islamic law. It's the same ideology that drives the fundamentalist militancy of al Qaeda. Indeed, militant Islam thrives in Saudi Arabia, and despite proclamations by the Saudis of being U.S. allies in the war on terror, the country remains a principal supporter of al Qaeda as well as Palestinian terror groups.\n \n Furthermore, the Saudi princes use petro dollars as a way to control religious leaders and keep them at bay, by redirecting their anger outward, against the West. Wahhabism calls for the destruction of the U.S. and rejection of Western values, replacing them with totalitarian Islamist regimes like the one they created in Afghanistan under the Taliban. The Saudis continue to actively support literally thousands of mosques and madrassas around the world, from Pakistan and Indonesia to Western Europe and the U.S.\n \n Now some of the terrorism the Saudis sowed abroad is coming home to roost. The attacks this year within the kingdom are likely related to the raging struggle within the royal house for succession to the throne. The king's illness has left him incapacitated for nearly a decade, leaving the kingdom without the solid authority of a reigning monarch. As a result, the de facto ruler, Crown Prince Abdullah, is unable to innovate reforms or effectively fight terror.\n \n Abdullah's opposition includes defense minister Sultan, interior minister Nayef, and Riyadh governor Salman, among others. Abdullah's declared war on al Qaeda is genuine, but Nayef, as interior minister, is the one responsible for conducting the anti-terror campaign. However, Nayef is still playing a double game, as evidenced by the collusion between the terrorists and Saudi security forces in the attack on the Khobar Petroleum Complex. The attack was designed to scare foreign workers out of the country and sabotage the U.S.-Saudi oil deal to increase production and curb rocketing prices. Al Qaeda's ability to penetrate the well-fortified complex was faciliated by Nayef's ambivalence in confronting the religious extremists.\n \n One can argue the Saudis are our friends, but it's easier to argue just the opposite. The recent half-hearted, self-serving Saudi attempts to cooperate with the U.S. may be too little too late. The longer the royal feuds continue, the less chance there is of stamping out Saudi terror. It's even possible that Abdullah and Nayef will never reach an accommodation, in which case the fall of the House of Saud may come sooner instead of later.", 
   {}, 
   62591, 
   null, 
   1092936600.0
  ], 
  [
   63298, 
   null, 
   "georged", 
   "Again Gator, another excellent post. IMO few Americans are aware of or even interested in Saudi Arabia's ideological composition due to the fact that our dependency on oil has necessitated a blanket statement by our government of 'Ally'. Those who question that country's loyalty to the US are thrown in the unpatriotic pile. It discomforts me to understand that so many of those citizens who support our Iraq Policy, from WMDs to Constitutional protection to deposing Saddam to implementing democracy to whatever the current rationalization happens to be blindly support a US government definition of the Sauds as wearing a big white hat with John Wayne type US loyalty, but that's the easily manipulated public. And then there's Pakistani Justice....", 
   {}, 
   63078, 
   null, 
   1093025520.0
  ], 
  [
   63524, 
   null, 
   "montalban", 
   " I realize you can find evidence that some Saudis have financed and participated in terrorism, the prime example being Bin Laden. You can find evidence that some Americans have done the same. \n First I want to mention briefly that bin Laden is not a Saudi citizen. The kingdom stripped him of his citizenship more than 10 years ago and declared him persona non grata after he tried to overthrow the ruling regime.\n\n \nAs for the parallel you've drawn between American terrorists and Saudi terrorists, it doesn't stand up to scrutiny. No doubt we have terrorists within our borders, but our government brooks no nonsense from home-grown American terrorists, whereas the Saudi royal house has powerful factions that finance and protect terrorist groups.\n\n Are the groups that were/are involved in the attempt to over-throw Castro not counted as US based terrorists? I suppose you could class them as 'freedom-fighters' Heh!\n \nSurely there are Saudis favorably disposed to the West and who might fairly be considered American allies, but the prevailing view of most Saudis is anti-American, as confirmed in their media and in their schools and mosques. When we ask if the Saudis are friend or foe, our focus should be on the House of Saud, since most Saudis on the street are already antagonistic to the U.S.\n\n The Saudis aren't anti-American, they're pro-money. When the US and Saudis are pro-money, they're allies.\n \nDespite rough patches in U.S.-Saudi relations since 9/11, it's no surprise that some in Washington continue to characterize the Saudis as our friends. We have no practical alternative. If the monarchy falls, its replacement is certain to be more hostile to U.S. interests, so we're nearly compelled to remain in bed with a brutal totalitarian regime and hope that the rivalries and intrigues gripping the royal house eventually pan out in our favor. None of this would even matter if the kingdom were not sitting on an ocean of oil, but that's reason enough for the U.S. to want to maintain our long-standing bilateral friendly relations.\n\n Oil is the key factor to money. Now that the US has invaded Iraq, and oil prices have gone up, the Saudis are much friendlier, because they're making more money.\n \nStill, there are of major concerns one can point to that underscore the dangers that Saudi policy poses to U.S. security. The most significant perhaps is Saudi Arabia's state religious doctrine, the Wahhabite version of Islamic law. It's the same ideology that drives the fundamentalist militancy of al Qaeda. Indeed, militant Islam thrives in Saudi Arabia, and despite proclamations by the Saudis of being U.S. allies in the war on terror, the country remains a principal supporter of al Qaeda as well as Palestinian terror groups.\n\n Again, Saudi policy is to be pro-money. Whilst the US doesn't interfere in their ability to make money, or visa versa, you're allies.\n \nFurthermore, the Saudi princes use petro dollars as a way to control religious leaders and keep them at bay, by redirecting their anger outward, against the West. Wahhabism calls for the destruction of the U.S. and rejection of Western values, replacing them with totalitarian Islamist regimes like the one they created in Afghanistan under the Taliban. The Saudis continue to actively support literally thousands of mosques and madrassas around the world, from Pakistan and Indonesia to Western Europe and the U.S.\n\n I guess this is true, some Saudis aren't concerned with earthly wealth and want to see the world Islamic. And there's some idealogues in the US government too.\n \nNow some of the terrorism the Saudis sowed abroad is coming home to roost. The attacks this year within the kingdom are likely related to the raging struggle within the royal house for succession to the throne. The king's illness has left him incapacitated for nearly a decade, leaving the kingdom without the solid authority of a reigning monarch. As a result, the de facto ruler, Crown Prince Abdullah, is unable to innovate reforms or effectively fight terror.\n Abdullah's opposition includes defense minister Sultan, interior minister Nayef, and Riyadh governor Salman, among others. Abdullah's declared war on al Qaeda is genuine, but Nayef, as interior minister, is the one responsible for conducting the anti-terror campaign. However, Nayef is still playing a double game, as evidenced by the collusion between the terrorists and Saudi security forces in the attack on the Khobar Petroleum Complex. The attack was designed to scare foreign workers out of the country and sabotage the U.S.-Saudi oil deal to increase production and curb rocketing prices. Al Qaeda's ability to penetrate the well-fortified complex was faciliated by Nayef's ambivalence in confronting the religious extremists.\n One can argue the Saudis are our friends, but it's easier to argue just the opposite. The recent half-hearted, self-serving Saudi attempts to cooperate with the U.S. may be too little too late. The longer the royal feuds continue, the less chance there is of stamping out Saudi terror. It's even possible that Abdullah and Nayef will never reach an accommodation, in which case the fall of the House of Saud may come sooner instead of later.\n\n There's no problem when idealogues are at logger-heads, money can still be made. Look at how the US sold weapons to both Iran and Iraq - but played up that they were two predominately different Islamic groups.\n \n The Ferengi Rules of Acquisition\n Rule 34 War is good for business. \n Rule 35 Peace is good for business.", 
   {
    "post_info": {
     "post_title": "The Ferengi Rules of Acquisition"
    }
   }, 
   63078, 
   null, 
   1093177620.0
  ], 
  [
   64911, 
   null, 
   "jim's trucking", 
   "Are the groups that were/are involved in the attempt to over-throw Castro not counted as US based terrorists? I suppose you could class them as 'freedom-fighters' Heh!\n \n The Saudis aren't anti-American, they're pro-money. When the US and Saudis are pro-money, they're allies.\n \n Oil is the key factor to money. Now that the US has invaded Iraq, and oil prices have gone up, the Saudis are much friendlier, because they're making more money.\n \n Again, Saudi policy is to be pro-money. Whilst the US doesn't interfere in their ability to make money, or visa versa, you're allies.\n \n I guess this is true, some Saudis aren't concerned with earthly wealth and want to see the world Islamic. And there's some idealogues in the US government too.\n \n There's no problem when idealogues are at logger-heads, money can still be made. Look at how the US sold weapons to both Iran and Iraq - but played up that they were two predominately different Islamic groups.\n \n The Ferengi Rules of Acquisition\n Rule 34 War is good for business. \n Rule 35 Peace is good for business.\nYou're screwing up the quote commands. You had:\n \n \n\n I realize you can find evidence that some Saudis have financed and participated in terrorism, the prime example being Bin Laden. You can find evidence that some Americans have done the same. \n First I want to mention briefly that bin Laden is not a Saudi citizen. The kingdom stripped him of his citizenship more than 10 years ago and declared him persona non grata after he tried to overthrow the ruling regime. \n \n \n Actually that's a quote of me and Gator.", 
   {}, 
   63524, 
   null, 
   1093888020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Saudi Justice!", 
  "url": "http://www.4forums.com/political/peace-middle-east/2598-saudi-justice.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 2598, 
  "discussion_files": [
   [
    "6698.html", 
    "http://www.4forums.com/political/peace-middle-east/2598-saudi-justice-print.html"
   ], 
   [
    "6699.html", 
    "http://www.4forums.com/political/peace-middle-east/2598-saudi-justice-7-print.html"
   ], 
   [
    "6700.html", 
    "http://www.4forums.com/political/peace-middle-east/2598-saudi-justice-5-print.html"
   ], 
   [
    "6701.html", 
    "http://www.4forums.com/political/peace-middle-east/2598-saudi-justice-4-print.html"
   ], 
   [
    "6702.html", 
    "http://www.4forums.com/political/peace-middle-east/2598-saudi-justice-6-print.html"
   ], 
   [
    "6703.html", 
    "http://www.4forums.com/political/peace-middle-east/2598-saudi-justice-3-print.html"
   ], 
   [
    "6704.html", 
    "http://www.4forums.com/political/peace-middle-east/2598-saudi-justice-2-print.html"
   ]
  ], 
  "identifier": 2598
 }
]