[
 [
  [
   54849, 
   null, 
   "apathy", 
   "I was flipping channels the today and caught a bit of the 700 Club. I watched a few minutes out of curiosity and I was dumbfounded. I could not believe the hypocrisy on this show. \n \n Pat Robertson, the host, was saying that the people who murdered Paul Johnson in Saudi Arabia, and others who were likely to murder the South Korean man, should be \"hunted like animals and eliminated\" (Pat's words). \n \n This does not sound very Christian to me. What happened to \"love thine enemy\"? What happened to the Prince of Peace? When do we get to hunt down sinners like animals and eliminate them? True the \"sins\" of these people are great, but no greater than any murderer's. According to Pat's logic, we should \"eliminate\" every murderer as if they were a rabid animal. Again, this does not sound very Christian to me.\n \n Also, on the same show, there was a story about how faith in Jesus led a family to financial prosperity! What happened to \"if you want to be perfect, give away all your possessions and follow me?\"\n \n Is the 700 Club really Christian?\n Is it a religious organization or a political one?", 
   {
    "post_info": {
     "post_title": "700 Club!"
    }
   }, 
   null, 
   null, 
   1087851120.0
  ], 
  [
   54859, 
   null, 
   "billsco", 
   "Hi apathy, \n \n Pat Robertson appeals to the lowest rung of ideas, and that place is occupied by religion, IMO. Politics is the next step above it, but it is a much-improved step up nonetheless.\n \n \n regards", 
   {}, 
   54849, 
   null, 
   1087852800.0
  ], 
  [
   54878, 
   null, 
   "jim's trucking", 
   "I'm not a fan of the 700 Club or of Pat Robertson. I am a Christian.\n \n However, I believe strongly that the death penalty is justified in cases of:\n \n Murder\n Rape (death or total castration)\n Child molestation (especially when the child is very young)\n Terrorism (acts that kill innocent people)\n \n ...Kill 'em all!", 
   {}, 
   54859, 
   null, 
   1087860240.0
  ], 
  [
   54909, 
   null, 
   "apathy", 
   "I don't understand.\n I thought the \"eye-for-an-eye\" stuff in the Old Testament was overruled by the \"repentence and forgiveness\" stuff of the New Testament. Isn't that why Jesus went to the cross? Or, if that's not the reason he gave his life, it's what he taught during it.\n emoticon_confused", 
   {}, 
   54878, 
   null, 
   1087871880.0
  ], 
  [
   55089, 
   null, 
   "Ladywolf", 
   "I was flipping channels the today and caught a bit of the 700 Club. I watched a few minutes out of curiosity and I was dumbfounded. I could not believe the hypocrisy on this show. \n \n I found this program the same way you did. I couldn't stop laughing...I thought I was watching Commedy Central at first.\n \n Pat Robertson, the host, was saying that the people who murdered Paul Johnson in Saudi Arabia, and others who were likely to murder the South Korean man, should be \"hunted like animals and eliminated\" (Pat's words). \n \n Actually, this is what Dick Cheney, GW, and Powell have all said, not just Pat.\n \n This does not sound very Christian to me. What happened to \"love thine enemy\"? What happened to the Prince of Peace? When do we get to hunt down sinners like animals and eliminate them? True the \"sins\" of these people are great, but no greater than any murderer's. According to Pat's logic, we should \"eliminate\" every murderer as if they were a rabid animal. Again, this does not sound very Christian to me.\n \n It doesn't sound Christian to me either, but then again, I'm not a Christian so I wouldn't know, but if I was one, and they were so hateful, I doubt I'd want to be one anyway.\n \n Also, on the same show, there was a story about how faith in Jesus led a family to financial prosperity! What happened to \"if you want to be perfect, give away all your possessions and follow me?\"\n \n Because \"if you want to be perfect, give away all your possessions and follow me\" isn't a very lucrative way of living and the 700 club must promote things that gain a larger audience.\n \n Is the 700 Club really Christian?\n Is it a religious organization or a political one?\n\n \n Actually, it's both. There has been some legislation that gives most of the non-profit money donated to non-profits to Christian organizations. There are also some political offiliations as well...this makes for a great financial base for Pat and his Christian friends. It also provides a rather large religious voting base for Bush and his republican cronies. ", 
   {}, 
   54849, 
   null, 
   1087955700.0
  ], 
  [
   55577, 
   null, 
   "terral03", 
   "Greetings to Apathy, Jim's Trucking and All:\n \n Mr. Apathy has decided to bring debating skills, or lack thereof, over to the Biblical Contradictions section in order to harass Christians. I am here to return the favor. \n \n Apathy on 700 Club hypocrisy << Pat Robertson, the host, was saying that the people who murdered Paul Johnson in Saudi Arabia, and others who were likely to murder the South Korean man, should be \"hunted like animals and eliminated\" (Pat's words). This does not sound very Christian to me. What happened to \"love thine enemy\"? \n \n Terral's reply << Have you any idea what you are quoting from Scripture and the context? I think not. Christ is addressing the children of Israel according to Kingdom Doctrine on being perfect as their Father in heaven is perfect (Matt. 5:48). There is nothing about dealing with murders under Mosaic Law in the passage (Matthew 5:43-48). In the same way, 'turn the other cheek' is a Kingdom teaching between two children of Israel. It was unlawful for a Jew to even associate with a Gentile (Acts 10:28). Christ is teaching 'principles' of the kingdom of heaven to the members of that kingdom. That being said, He still taught complete obedience to the Law in the same chapter. Matt. 5:17-19. \n \n Christ's point is that there is a next level to the Law; a higher discipline; that Mosaic Law foreshadows something greater. Paul teaches the same thing to members of the body of Christ, saying, \"Therefore no one is to act as your judge in regard to food or drink or in respect to a festival or a new moon or a Sabbath day -- things which are a {mere} shadow of what is to come; but the substance belongs to Christ.\" Col. 2:16+17. Most importantly, the offering of the kingdom of heaven was not accepted by Israel of the flesh. That is how John the Baptist, Christ and the Disciples came to be beaten, exiled, crucified, mutilated and dead. And you will not find Paul telling anyone to turn the other cheek. \n \n Apathy << What happened to the Prince of Peace? \n \n Terral's reply << You are quoting from Isaiah 9:6. That is what Christ shall be called in the future. Why? Because His enemies shall be consumed by His appearance, and by the breath of His mouth. \"Then that lawless one will be revealed whom the Lord will slay with the breath of His mouth and bring to an end by the appearance of His coming.\" 2Thes. 2:8. \"And then the sign of the Son of Man will appear in the sky, and then all the tribes of the earth will mourn, and they will see the SON OF MAN COMING ON THE CLOUDS OF THE SKY with power and great glory.\" Matt. 24:30. When all His enemies fall like ash before Him, there can be nothing left except peace. \n \n Apathy << When do we get to hunt down sinners like animals and eliminate them? \n \n Terral's reply << You believe yourself to be counted among the faithful? You wish to mock Christ, then do His bidding? Mr. Atheist? Mr. Argue with Christians just for fun? The secrets of men shall be judged according to Paul's gospel. Rom. 2:16. And since unbelievers share the same fate as murders (Rev. 21:8), then perhaps it would be wise for you to worry about your own skin. \n \n Apathy << True the \"sins\" of these people are great, but no greater than any murderer's. According to Pat's logic, we should \"eliminate\" every murderer as if they were a rabid animal. Again, this does not sound very Christian to me.\n \n Terral's reply << What does an atheist like yourself know about spiritually regenerated Christians? Scripture says, \"But a natural man does not accept the things of the Spirit of God, for they are foolishness to him; and he cannot understand them, because they are spiritually appraised. But he who is spiritual appraises all things, yet he himself is appraised by no one.\" 1Cor. 2:14+15. Therefore, the true Christian understands why 'your' Bible contains a myriad of seeming contradictions. \n \n Apathy << Also, on the same show, there was a story about how faith in Jesus led a family to financial prosperity! What happened to \"if you want to be perfect, give away all your possessions and follow me?\"\n \n Terral's reply << Once again, Christ is teaching Kingdom doctrine to members of that kingdom of heaven on earth which was never accepted. \"Looking at him, Jesus felt a love for him and said to him, \"One thing you lack: go and sell all you possess and give to the poor, and you will have treasure in heaven; and come, follow Me.\" Mark 10:21. Who has need of money in heaven? And who would like treasure stored for them in heaven? Again, Christ is teaching precepts of doctrine to the children of Israel, about what they can expect during that period. Note that only Israel was given this offering at this time with Gentiles and half-Jews being excluded. Matt. 10:5-7. \n \n We cannot take specific teachings concerning Kingdom doctrine and apply them to anyone we wish, and remain accurate along the way. Christ and James teach total obedience to Mosaic Law. Matt. 5:17-19, James 2:10. Again, Paul teaches us (Gentiles) that these things are a mere shadow of things that belong to Christ. Col. 2:16+17. We are not under Law (Rom. 2:14), but under grace (Rom. 6:14).\n \n Jim's trucking answers Apathy << I'm not a fan of the 700 Club or of Pat Robertson. I am a Christian. However, I believe strongly that the death penalty is justified in cases of: Murder, Rape (death or total castration), Child molestation (especially when the child is very young), Terrorism (acts that kill innocent people) ...Kill 'em all!\n \n Apathy then responds to Jim << I don't understand. \n \n Terral's reply << Now there is an honest answer. Pat Robertson and Jim appear to be in agreement that allowing these things to continue unchecked will be a serious mistake. Americans are already fleeing the area in fear of their lives. Doing nothing means more innocent people will certainly die. Our President faced the same dilemma after 9/11. Do we sit on our hands? Do something about it? I am with Jim 100 percent on this one. \n \n Apathy's ignorance on display << I thought the \"eye-for-an-eye\" stuff in the Old Testament was overruled by the \"repentence and forgiveness\" stuff of the New Testament. \n \n Terral's reply << You keep trying to quote from Matthew Chapter 5. What did Christ say? \"Do not think that I came to abolish the Law or the Prophets; I did not come to abolish but to fulfill. For truly I say to you, until heaven and earth pass away, not the smallest letter or stroke shall pass from the Law until all is accomplished. Whoever then annuls one of the least of these commandments, and teaches others {to do} the same, shall be called least in the kingdom of heaven; but whoever keeps and teaches {them,} he shall be called great in the kingdom of heaven.\" Matt. 5:17-19. Are we seeing a pattern here? These are precepts of doctrine pertaining to the KINGDOM OF HEAVEN.\n \n Apathy << Isn't that why Jesus went to the cross? Or, if that's not the reason he gave his life, it's what he taught during it.\n \n Terral's reply << Christ the Messiah/HighPriest/King went to the cross, because Israel of the flesh rejected His offering of the Kingdom of heaven, and Himself as King. The story goes like this: \"But the chief priests and the elders persuaded the crowds to ask for Barabbas and to put Jesus to death. But the governor said to them, \"Which of the two do you want me to release for you?\" And they said, \"Barabbas.\" Pilate *said to them, \"Then what shall I do with Jesus who is called Christ?\" They all *said, \"Crucify Him!\" And he said, \"Why, what evil has He done?\" But they kept shouting all the more, saying, \"Crucify Him!\" Matt. 27:20-23. And then, \"And all the people said, \"His blood shall be on us and on our children!\" Matt. 27:25.\n \n That fact that our forgiveness is through His blood (Eph. 1:7, Col. 1:20) was not understood by Peter and the other disciples. That is why Peter continued to preach repentance and water baptism (like John the Baptist; Mark 1:4) for the forgiveness of sins (Acts 2:38), after the crucifixion. Only after the conversion of Paul (Acts 9) and the revelation of the mystery (Rom. 16:25) pertaining to our gospel (Gal. 1:11+12) did we come to understand the significance of what He did for us on the cross. \n \n Apathy << Confused:\n \n Terral's reply << And destined to remain that way. But, what should you expect? After all, you are here only to harass Christians. \n \n In Christ,\n \n Terral", 
   {
    "post_info": {
     "post_title": "A Confused Kind of Apathy"
    }, 
    "unicode_changes_made": true
   }, 
   54909, 
   null, 
   1088189580.0
  ], 
  [
   55925, 
   null, 
   "Tastyfish", 
   "Do you hold all the old testment laws to be valid Terral, have just had a debate with another person who would be classified as christian who argued totally the opposite point as you. Why should we punish terrorists when you advocate doing exactly the same (if we are to beleive the quotes you posted, it is the fate of unbeleivers to suffer the same fate as murderers). If the old alws are not to overwritten how come there is a difference between Judaism and Christianity, shouldn't the latter be following exactly the same rules as the former but with a slightly larger book?", 
   {}, 
   55577, 
   null, 
   1088462640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  700 Club!", 
  "url": "http://www.4forums.com/political/religion-debates/2599-700-club.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 2599, 
  "discussion_files": [
   [
    "29581.html", 
    "http://www.4forums.com/political/religion-debates/2599-700-club-print.html"
   ]
  ], 
  "identifier": 2599
 }
]