[
 [
  [
   2713, 
   null, 
   "American", 
   "A question for the atheists and agnostics out there:\n \n Atheist: Have you been everywhere at once?\n Obviously not, so how can you say there is \"no god?\"\n \n Agnostic: If there is a god COULD he reveal himself?", 
   {
    "post_info": {
     "post_title": "God doesn't believe in atheists!"
    }
   }, 
   null, 
   null, 
   1045880100.0
  ], 
  [
   2754, 
   null, 
   "thistownwilleat", 
   "I guess there is a relevant point in there somewhere....well....maybe not.", 
   {}, 
   2713, 
   null, 
   1045899420.0
  ], 
  [
   2780, 
   null, 
   "XYOU", 
   "If there is a god COULD he reveal himself?\n \n \n \n YES, that is the answer to \"if God really exist NOW\" !\n But the whole world people won't believe to that so simple and TRUE answer !!\n \n \n Jesus was such a Great liar of the world !\n Up to now, still billions of people in the world believe in his lies !!", 
   {}, 
   2713, 
   null, 
   1045912680.0
  ], 
  [
   2782, 
   null, 
   "sarablaze", 
   "There is proof of god. Because people can't see him, they believe there is no god. Miracles happen everyday. I myself was an atheist. I figured that there was no proof. After I saw a few amazing things happen, everyday things that a lot of people tend to take for granted, I then started to believe.", 
   {}, 
   2713, 
   null, 
   1045915440.0
  ], 
  [
   2795, 
   null, 
   "XYOU", 
   "sarablaze, there's billion of people like you, don't know why but just \"follow the follower\" !\n \n Here on earth having billions of christian, catholic, muslim, buddhist are following their friends, their parents, their country's people to believe in God since born or during growth but don't know what God is or dare to ask if there's really GOD in the universe !", 
   {}, 
   2713, 
   null, 
   1045922220.0
  ], 
  [
   2796, 
   null, 
   "XYOU", 
   "God is so good to use to deceive people for anything cos God is forever an unknown ! People could never get any real evidence to prove the exist of God.\n \n As I know in history, nearly all countries when the time going to war must pray their God to bless them, bless them to kill another country's people. Its one of the usage of GOD ! And that's why most country leaders support religion.\n \n Because you can say whatever you like in the name of \"your God\" to do anything and your God won't argue or disagree with you.", 
   {}, 
   2713, 
   null, 
   1045922880.0
  ], 
  [
   2975, 
   null, 
   "Crim", 
   "One does not have to know everything to reject theism.\n Do you believe in purple unicorns on uranus?\n Have you -or anyone- been to uranus to check?\n No?\n Ok, I assume you believe in them then.", 
   {}, 
   2713, 
   null, 
   1046035860.0
  ], 
  [
   2984, 
   null, 
   "sarablaze", 
   "XYOU,\n I don't believe in organized religion. Have you ever seen a baby being born, or a person who use to be an X con, change their life?\n Have you ever seen the sun rise or set? Little things happen all the time every day, and they are all proof of god.", 
   {}, 
   2713, 
   null, 
   1046044440.0
  ], 
  [
   3017, 
   null, 
   "Crim", 
   "Sarah, none of those things prove the existance of deities. They're not even evidence.", 
   {}, 
   2713, 
   null, 
   1046055240.0
  ], 
  [
   3037, 
   null, 
   "XYOU", 
   "crim, sara means those unbelievable beautiful incredible natural phenomenon that we could experience must not all in coincident just exist by themselves and without \"God\"'s design and created them !\n \n I do believe the same as sara !\n I do believe the whole world's things are designed and created by \"God\" !!\n \n Simply, even as simple things as a cup, a TV set, a pc,.....it won't exist by itself if no one design it first and make them.", 
   {}, 
   2713, 
   null, 
   1046060940.0
  ], 
  [
   3038, 
   null, 
   "XYOU", 
   "Crim, God is the one who created us, I do believe in God but not that God tells in bible.", 
   {}, 
   2713, 
   null, 
   1046061180.0
  ], 
  [
   3039, 
   null, 
   "XYOU", 
   "crism, I am theism !\n \n But all of us on earth don't know who God is, may be God doesn't exist now after created us. \n \n I think I am only an anti-religious( <--don't know if it is the right word or not, sorry) .", 
   {}, 
   2713, 
   null, 
   1046061240.0
  ], 
  [
   3043, 
   null, 
   "Crim", 
   "Fortunately, your beliefs are not facts.", 
   {}, 
   2713, 
   null, 
   1046061960.0
  ], 
  [
   3055, 
   null, 
   "thistownwilleat", 
   "I know what you're saying to a certain extent XYOU, I have a lot of problems with organized religion today. But you say you believe in a god. Do you believe you know this god, who he is and what he's about, or do you just believe that there is a god, and that you don't know who he is? If you are the first, you are the beginnings of a cult. If you are the second you belong to a large group of people who are so disgusted with the practitioners and followers of a religion that you transfer it to who they follow. Which are you?", 
   {}, 
   2713, 
   null, 
   1046064000.0
  ], 
  [
   3058, 
   null, 
   "thistownwilleat", 
   "Let me rephrase, what in the life of Jesus do you have a problem with? Not a problem in the practices of the church or the people, but in the being that we believe in. Which part do you have a problem with, or do you simply have a problem with the fact that is a \"religion\".", 
   {}, 
   2713, 
   null, 
   1046064120.0
  ], 
  [
   3104, 
   null, 
   "XYOU", 
   "thistown, cos I found there's so many arguing point in bible from the beginning of Genesis in old testament to the end of new testament such as :-\n \n Genesis Chapter 1 :-\n \n \n3 And God said, Let there be light: and there was light. \n \n 4 And God saw the light, that it was good: and God divided the light from the darkness. \n \n 5 And God called the light Day, and the darkness he called Night. And the evening and the morning were the first day.\n\n \n \n After God had \"created\" the lights, that means when the lights can't pass through an non-transparet object , there's a shadow and gone \"darKness\" , but the \"one\" who wrote the bible should be God but seemed didn't know this phenomenon , that \"writer\" said : God had to \"divide\" the light from darkness. \n \n emoticon_confused emoticon_confused emoticon_confused \n \n That prove:- the writer was just someone who didn't have that scientific knowledge in the old days. \n \n Do you agree ???", 
   {}, 
   2713, 
   null, 
   1046079960.0
  ], 
  [
   3155, 
   null, 
   "thistownwilleat", 
   "Yes I agree. I have no problem with agreeing that the Bible was written by people. I have no problem saying that certain portions of the Bible have been mistranslated. I have no problem with saying that some of the writers of the Bible intertwined their own biases and the prejudices of their society into the text. What I don't see is how this automatically negates the existance of God. It is in getting so entangled in the tiny insignificant details that people lose the purpose of why it was written. Yes I believe that the Genesis that you quote is a metaphor, passed down orally for hundreds of years, changed and tweaked, and then written down by humans. What's the problem?\n \n I challenge you to locate the source of your hesitancy and even dare I say hatred of Jesus. Find fault in him, or his teachings...or is it that you have a problem with the transfer of light in the Old Testament and therefore assume that it's all XXXX.", 
   {}, 
   2713, 
   null, 
   1046134440.0
  ], 
  [
   6085, 
   null, 
   "WinAce", 
   "Everyone who isn't a strong atheist towards Thor or Zeus, raise your hand.\n \n ... no one?\n \n Have you ever been everywhere at once to see there's no Zeus? No? Yet you expect atheists to somehow give your deity the benefit of the doubt not afforded other gods why, exactly? \n \n Even if there were exactly no atheological arguments (like the argument from evil, nonbelief or mind-brain dependence) we would still be perfectly justified in dismissing any unevidenced claim of disembodied minds with magical superpowers who have nothing better to do than expect human worship. ;)", 
   {}, 
   2713, 
   null, 
   1049403720.0
  ], 
  [
   6123, 
   null, 
   "Tim", 
   "Very good point. There is a great diversity of beliefs in the world. Raelians, for example, believe that humans were genetically engineered by aliens. From an objective point of view, that belief system is no less credible than Christianity.", 
   {}, 
   2713, 
   null, 
   1049448300.0
  ], 
  [
   6360, 
   null, 
   "Habbit", 
   "XYOU-\n \n \nYES, that is the answer to \"if God really exist NOW\" !\n\n \n I have a question for all you atheists. If God revealed himself to you right now, would you HONESTLY believe it was him? I mean, really, be completely honest and serious. \n \n \nJesus was such a Great liar of the world !\n\n \n Are you like a Chinese government official or something? Oh wait. I forgot, the Chinese government controls what you say anyway, so I guess it matters not.\n \n \nUp to now, still billions of people in the world believe in his lies !!\n\n \n 1.3 billion people believe the lies of the Chinese government. \n \n \nsarablaze, there's billion of people like you, don't know why but just \"follow the follower\" !\n\n \n Oh, so is your God the Chinese government? Honestly, most atheists will say people believe in God because they can't think for themselves and must rely on something in order to exist. Where's the difference? The Chinese follow the Chinese government like puppy dogs because they can't think for themselves, and they rely on the government in order to survive. \n \n \nHere on earth having billions of christian, catholic, muslim, buddhist are following their friends, their parents, their country's people to believe in God since born or during growth but don't know what God is or dare to ask if there's really GOD in the universe !\n\n \n I'll respond when I can figure out what you're trying to say.\n \n \nI do believe the whole world's things are designed and created by \"God\" !!\n\n \n That 'god' being the Chinese government? \n \n Crim-\n \n \nOne does not have to know everything to reject theism.\n\n \n You have to know everything in order to say, boldly, \"There is NO God! Religious people are fools who believe in fairy tales.\" \n \n \nDo you believe in purple unicorns on uranus?\n Have you -or anyone- been to uranus to check?\n No?\n Ok, I assume you believe in them then.\n\n \n Uranus. Is. A. Ball. Of. Gas. Genius. \n \n \nFortunately, your beliefs are not facts.\n\n \n Neither are yours. *GEE* *gasp* *amazement* *realization* \n \n thistownwilleat-\n \n \nLet me rephrase, what in the life of Jesus do you have a problem with? Not a problem in the practices of the church or the people, but in the being that we believe in. Which part do you have a problem with, or do you simply have a problem with the fact that is a \"religion\".\n\n \n This is a very simple, easily answerable question. Most people, especially in America, have problems with people telling them what to do. Teenagers hate being under the authority of adults. Adults hate being under the authority of the government and enforcers of the law. Everyone in the world is under worldly authority, but to actually have a God who created you, which gives him the right to make commandments stating what is good for you and what is not, that makes most people really XXXXXX off. \n \n \nHave you ever been everywhere at once to see there's no Zeus?\n\n \n First, take a visit to Mount Olympus. Secondly, Greek myths were written for entertainment. Lastly, if Zeus or any other mythological gods existed, why wouldn't they/it preserve their worshippers? When a human (actually, in the case of the Jews, humanS) make efforts to completely eliminate a race or religious group of people and there Book (the Bible) for over thousands upon thousands of years, and the people and Book are still preserved, that is evidence of a God, in my opinion.", 
   {}, 
   2713, 
   null, 
   1049931420.0
  ], 
  [
   6361, 
   null, 
   "Crim", 
   "You have to know everything in order to say, boldly, \"There is NO God! Religious people are fools who believe in fairy tales.\" \n \n \n Mmmmm, not necessarily. Many of the arguments of against gods (those with specific properties, not just a general diety) deal with incompatible traits, like a square circle has. One does not have to search the universe to know square circles do not exist.\n People state simple negatives all the time. The lack of evidence for the positive makes them reasonable.\n \n \nUranus. Is. A. Ball. Of. Gas. Genius. \n \n \n What's your point? Unicorns breathe toxic gas and have low density, so they can get around all they want.", 
   {}, 
   2713, 
   null, 
   1049932260.0
  ], 
  [
   6364, 
   null, 
   "Habbit", 
   "Crim-\n \n \nMmmmm, not necessarily. Many of the arguments of against gods (those with specific properties, not just a general diety) deal with incompatible traits, like a square circle has. One does not have to search the universe to know square circles do not exist.\n\n \n How do you know square circles do not exist? Modern man could've named a square circle something different than it is. Ancient man could've called an object a square circle. For a question like that, you would have to search the universe to be 100% sure square circles do not exist. \n \n \nWhat's your point? Unicorns breathe toxic gas and have low density, so they can get around all they want.\n\n \n And God lives in Heaven, with Jesus sitting on the right side of Him.", 
   {}, 
   2713, 
   null, 
   1049936820.0
  ], 
  [
   6393, 
   null, 
   "gilligan8503", 
   " How do you know square circles do not exist? Modern man could've named a square circle something different than it is. Ancient man could've called an object a square circle. For a question like that, you would have to search the universe to be 100% sure square circles do not exist.\n\n \n think about what you just typed, that doesn't make any sense.\n \n \nAnd God lives in Heaven, with Jesus sitting on the right side of Him.\n\n \n you must be agnostic now. you see his point-of-view. you now doubt god, according to your answer.", 
   {}, 
   2713, 
   null, 
   1049948340.0
  ], 
  [
   6415, 
   null, 
   "Crim", 
   "How do you know square circles do not exist? \n \n \n Because their properties are contradictory.", 
   {}, 
   2713, 
   null, 
   1050000120.0
  ], 
  [
   6418, 
   null, 
   "Habbit", 
   "Based on man's opinion. But, of course, since you're an atheist, you probably believe everything man says anything anyway. Unless, of course, it counters your fallible views.", 
   {}, 
   2713, 
   null, 
   1050002820.0
  ], 
  [
   6420, 
   null, 
   "Crim", 
   "Based on man's opinion. \n \n \n Based on their definitions. It has nothing to do with opinion. A circle cannot be a square.", 
   {}, 
   2713, 
   null, 
   1050003000.0
  ], 
  [
   6422, 
   null, 
   "Habbit", 
   "gilligan-\n \n \nthink about what you just typed, that doesn't make any sense.\n\n \n There are a lot of these people don't understand or don't make sense to them. I guess the things that don't are just stupid and made-up, huh?\n \n \nyou must be agnostic now. you see his point-of-view. you now doubt god, according to your answer.\n\n \n Here's some advice, if you're going to try and crack on me, make your 'jokes' (I'll be nice and call them that) less passive and more active, grammar-wise. \n \n Crim- \n \n A definition is the meaning of word that someone created using their own opinions. Is there a difference? \n \n And, a circle could be called a circle in the English language, but I could make up a new language in which a circle would be called a square and a square a circle.", 
   {}, 
   2713, 
   null, 
   1050003720.0
  ], 
  [
   6423, 
   null, 
   "Crim", 
   "Crim- \n \n \n The argument had NOTHING to do with semantics, so stop twisting it.", 
   {}, 
   2713, 
   null, 
   1050004500.0
  ], 
  [
   6464, 
   null, 
   "Habbit", 
   "It has everything to do with semantics, because your poor arguement leaves room for many holes.", 
   {}, 
   2713, 
   null, 
   1050021540.0
  ], 
  [
   6469, 
   null, 
   "Crim", 
   "Please.\n You completely ignored the idea and went straight for the words, as if changing the word 'circle' to 'squilox' would made what it represents any less contradictory with what the word 'square' represents.", 
   {}, 
   2713, 
   null, 
   1050024120.0
  ], 
  [
   6481, 
   null, 
   "gilligan8503", 
   "god ( P ) Pronunciation Key (gd)\n n.\n \n 1. God\n 1. A being conceived as the perfect, omnipotent, omniscient originator and ruler of the universe, the principal object of faith and worship in monotheistic religions.\n 2. The force, effect, or a manifestation or aspect of this being.\n 2. A being of supernatural powers or attributes, believed in and worshiped by a people, especially a male deity thought to control some part of nature or reality.\n 3. An image of a supernatural being; an idol.\n 4. One that is worshiped, idealized, or followed: Money was their god.\n 5. A very handsome man.\n 6. A powerful ruler or despot.\n \n this is man's definition... what if we misinterprited the definition of god, or the bible for that matter. it is man's definition. what if we don't understand the 'truth', because, according to you, we don't have the mentality to define words... they are OPINIONS. right? isn't that what you said? or is god the only exception?", 
   {}, 
   2713, 
   null, 
   1050033420.0
  ], 
  [
   6505, 
   null, 
   "Habbit", 
   "Crim-\n \n I already told you, fill the holes in your arguement and maybe you wouldn't complain so much.\n \n gilligan-\n \n That's funny. However, unfortunately for you, we know who God is because of the Bible and because he speaks to us. Also, I love the first definition: \n \n \ngod ( P ) Pronunciation Key (gd)\n n.\n \n 1. God\n\n \n Kinda ironic, don't you think?", 
   {}, 
   2713, 
   null, 
   1050072060.0
  ], 
  [
   6506, 
   null, 
   "Crim", 
   "I already told you, fill the holes in your arguement and maybe you wouldn't complain so much.\n \n \n Could you be so kind as to point out the holes, please? Or are you going to dance around some more?", 
   {}, 
   2713, 
   null, 
   1050072360.0
  ], 
  [
   6525, 
   null, 
   "Habbit", 
   "Crim-\n \n \"Could you be so kind as to point out the holes, please?\"\n \n I already have. Learn to read. \n \n \"Or are you going to dance around some more?\"\n \n I don't know, do you want me to?", 
   {}, 
   2713, 
   null, 
   1050096120.0
  ], 
  [
   6526, 
   null, 
   "Crim", 
   "I already have. Learn to read. \n \n \n I can read.\n You provided no holes.", 
   {}, 
   2713, 
   null, 
   1050096540.0
  ], 
  [
   6557, 
   null, 
   "gilligan8503", 
   "habbit isn't a debater, he's a b*tcher.\n \n btw, the reason the definition of \"God\" is \"God\" is because that is how the public percieves it... 90% of the world believes in \"God\".", 
   {}, 
   2713, 
   null, 
   1050130680.0
  ], 
  [
   6612, 
   null, 
   "lurch", 
   "A definition is the meaning of word that someone created using their own opinions.\n\n How strange. It seems that Habbit's definition of the word definition is meaningless. Physicists and chemists can define what they mean by the word \"carbon,\" but according to Habbit that is just their opinion. According to Habbit, carbon can be a chocolate candy meant to be eaten in a car. That may be his opinion and he considers it as valid as specific definitions assigned to words used by experts in any given field.\n \nAnd, a circle could be called a circle in the English language, but I could make up a new language in which a circle would be called a square and a square a circle.\n\n But your new language would be meaningless. The definition of a circle or a square does not vary from language to language. Mathematical definitions are not matters of opinion but quite precise descriptions so that all mathematicians will understand what is meant when the term is used. The words may change but the meaning doesn't. Math is not opinion. It is not my opinion that a triangle has three angles. That is a matter of definition.\n \n Apparently Habbit doesn't understand that substituting the words of another language does not change the concept. That sort of argument is basically ignorant XXXX.", 
   {}, 
   2713, 
   null, 
   1050289860.0
  ], 
  [
   6623, 
   null, 
   "gilligan8503", 
   "merci... wait, i mean: thank-you.", 
   {}, 
   2713, 
   null, 
   1050293460.0
  ], 
  [
   6630, 
   null, 
   "lurch", 
   "No hay de que. Wait. I mean, de nada. Wait again. Those express the same thing in the same language with different words. I guess it must be a matter of opinion.", 
   {}, 
   2713, 
   null, 
   1050299820.0
  ], 
  [
   6631, 
   null, 
   "Crim", 
   "did you know that \"one plus one equals two\" is a false statement because it's possible that in another language -which doesn't actually exist- that the word 'plus' means 'to subtract'?", 
   {}, 
   2713, 
   null, 
   1050300060.0
  ], 
  [
   6655, 
   null, 
   "Habbit", 
   "gilligan-\n \n \nhabbit isn't a debater, he's a b*tcher.\n\n \n Is the little baby upset? Too bad. \n \n \nbtw, the reason the definition of \"God\" is \"God\" is because that is how the public percieves it... 90% of the world believes in \"God\".\n\n \n 90% of the people in the world are Christians? \n \n idiot-\n \n \nHow strange. It seems that Habbit's definition of the word definition is meaningless. [cutting the useless part, don't want to waste server space]\n\n \n Great way of twisting what I said. Would you like a Snickers bar?\n \n \nBut your new language would be meaningless. [cut more XXXX]\n\n \n Some mathematical definitions can be precise, but then others can be unprecise, because of one little thing a person like you would never be able to understand, and that is, humans are not perfect. \n \n \nApparently Habbit doesn't understand that substituting the words of another language does not change the concept. That sort of argument is basically ignorant XXXX.\n\n \n Another twist? I bet you want two Snickers bars now, huh? \n \n \nNo hay de que. Wait. I mean, de nada. Wait again. Those express the same thing in the same language with different words. I guess it must be a matter of opinion.\n\n \n No, uu dada idot. By the way, I must commend your's and Crim's execellent way to change the whole topic. I don't think anyone could've done it as flawlessly or subtly as you two. \n \n By the way, in my language, the word idiot translates into the English word 'lurch'.", 
   {}, 
   2713, 
   null, 
   1050352560.0
  ], 
  [
   6657, 
   null, 
   "gilligan8503", 
   "90% of the people in the world are Christians?\n\n \n putting words in my mouth again? i did not say christian, i said \"God\". Christian, Jewish, and Muslim all believe in the same \"God\".\n \n - idiot.\n \n i'll let Crim and Lurch respond to the others; lets not let me have all the fun.", 
   {}, 
   2713, 
   null, 
   1050360180.0
  ], 
  [
   6659, 
   null, 
   "lurch", 
   "Habbit has been reduced to meaningless insults. He made a fool of himself by demonstrating his ignorance of language and now has nothing worthwhile to say.", 
   {}, 
   2713, 
   null, 
   1050360540.0
  ], 
  [
   6663, 
   null, 
   "thistownwilleat", 
   "Shut up habit. You really and truly have absolutely nothing to say. As my mother used to tell me when I was 5, you're talking privelages have been revoked.", 
   {}, 
   2713, 
   null, 
   1050361620.0
  ], 
  [
   6771, 
   null, 
   "Habbit", 
   "gilligan-\n \n \ni did not say christian, i said \"God\". Christian, Jewish, and Muslim all believe in the same \"God\".\n\n \n I know you said \"God\" however, you are wrong (not unusual) when you say Muslims believe in the same God as the Jews and Christians. More examples of your ignorance. \n \n By the way, everyone in the world believes in a God. For some people, it's the 'Great Spirit', others 'Allah', then the true God, the one of the Bible, and lastly, some people don't believe in a superior being, but they believe themselves to be god. \n \n idiot-\n \n \nHabbit has been reduced to meaningless insults. He made a fool of himself by demonstrating his ignorance of language and now has nothing worthwhile to say.\n\n \n Don't like it when the person you're arguing against can be as sarcastic as you are, huh? I understand, I get these types of whines all the time. \n \n thistownwilleat-\n \n \nShut up habit. You really and truly have absolutely nothing to say. As my mother used to tell me when I was 5, you're talking privelages have been revoked.\n\n \n 1) It's Habbit. You could at least take 5 seconds to get my name right.\n 2) Considering you and your friends are the ones complaining, not debating? \n 3) Actually, none of my posting privileges have my revoked. Try again.", 
   {}, 
   2713, 
   null, 
   1050592980.0
  ], 
  [
   6772, 
   null, 
   "thistownwilleat", 
   "Habbit, I would be more than happy to debate you, unfortunately you don't quite yet have a grasp on the meaning of the word.\n \n \"Is the little baby upset? Too bad.\"\n \n \"Great way of twisting what I said. Would you like a Snickers bar?\"\n \n \"By the way, in my language, the word idiot translates into the English word 'lurch'.\"\n \n \"No, uu dada idot.\"\n \n We're all quite impressed with your knowledge of third grade insults, unfortunately, this is not debate. \n \n I guess it is at around this point I should add some nonsense about a Snickers bar, sit back and chuckle at my own humor. Fortunately though, I have an IQ above 60.", 
   {}, 
   2713, 
   null, 
   1050594180.0
  ], 
  [
   6774, 
   null, 
   "Crim", 
   "By the way, everyone in the world believes in a God.\n \n \n Nonsense. Almost a billion people are nonreligious.", 
   {}, 
   2713, 
   null, 
   1050598440.0
  ], 
  [
   6784, 
   null, 
   "Habbit", 
   "thistownwilleat-\n \n \nHabbit, I would be more than happy to debate you, unfortunately you don't quite yet have a grasp on the meaning of the word.\n\n \n k, but what does my name have the current discussion? \n \n \nWe're all quite impressed with your knowledge of third grade insults, unfortunately, this is not debate.\n\n \n Thank You. You know how much I love to impress people.\n \n \nI guess it is at around this point I should add some nonsense about a Snickers bar, sit back and chuckle at my own humor. Fortunately though, I have an IQ above 60.\n\n \n I especially love responding to third grade insults, but unfortunately, as you said, this is not debate. (Or did you mean 'the' debate?' Will we ever know?!) \n \n And before I forget, it is good you didn't talk about Snickers bars and that your IQ is above 60, because then you'd be stealing my third grade insults.\n \n Crim-\n \n \nNonsense. Almost a billion people are nonreligious.\n\n \n First, I didn't say everyone in the world was religious, I said everyone in the world believed in A god. Second, the majority of the world believes there is a god, and the others don't want to believe (hope there isn't) a god and/or they believe they themselves are the only god of their body.", 
   {}, 
   2713, 
   null, 
   1050601260.0
  ], 
  [
   6792, 
   null, 
   "thistownwilleat", 
   "Your stupidity in debate is only matched by your stupidity in grammar. Debate is both a verb and a noun. Now debate something for God's sake.", 
   {}, 
   2713, 
   null, 
   1050601920.0
  ], 
  [
   6793, 
   null, 
   "Habbit", 
   "thistownwilleat-\n \n \nYour stupidity in debate is only matched by your stupidity in grammar. Debate is both a verb and a noun. \n\n \n joke ( P ) Pronunciation Key (jk)\n n. \n Something said or done to evoke laughter or amusement, especially an amusing story with a punch line. \n A mischievous trick; a prank. \n An amusing or ludicrous incident or situation. \n Informal. \n Something not to be taken seriously; a triviality: The accident was no joke. \n An object of amusement or laughter; a laughingstock: His loud tie was the joke of the office. \n \n Calm down, kid.\n \n \nNow debate something for God's sake.\n\n \n I would love to debate the topic, but you have effectively ruined it.", 
   {}, 
   2713, 
   null, 
   1050602340.0
  ], 
  [
   6794, 
   null, 
   "Crim", 
   "Second, the majority of the world believes there is a god, and the others don't want to believe (hope there isn't) a god \n \n \n How do you know if they WANT to believe in a deity? They simply don't.\n \n \nthey believe they themselves are the only god of their body.\n \n \n please.\n god of their body? that's hardly equal to a supernatural deity.", 
   {}, 
   2713, 
   null, 
   1050602400.0
  ], 
  [
   6796, 
   null, 
   "lurch", 
   "Don't like it when the person you're arguing against can be as sarcastic as you are, huh? I understand, I get these types of whines all the time. \n \n Not at all. Your answers were without content or meaning. There was no sarcasm. You snipped most of my remarks because you were unable to address them. You have no answers and have been reduced to insult. That means that you have lost the discussion and you know you have lost. Otherwise you would attempt meaningful answers. You have made yourself a fool with nothing but names and insults.", 
   {}, 
   2713, 
   null, 
   1050611580.0
  ], 
  [
   6804, 
   null, 
   "Habbit", 
   "Crim-\n \n \nHow do you know if they WANT to believe in a deity? They simply don't.\n\n \n and the others don't want to believe (hope there isn't) a god \n \n \nplease.\n god of their body? that's hardly equal to a supernatural deity.\n\n \n I meant that those types of people don't want a God who gives commandments.\n \n lurch-\n \n \nYour answers were without content or meaning. There was no sarcasm.\n\n \n k\n \n \nYou snipped most of my remarks because you were unable to address them. You have no answers and have been reduced to insult. That means that you have lost the discussion and you know you have lost. Otherwise you would attempt meaningful answers.\n\n \n Actually, I snipped your remarks because 1) you twisted what I said and 2) I'm already spending too much time arguing with random complainers and I was in a hurry to do something more important at the time. \n \n \nYou have made yourself a fool with nothing but names and insults.\n\n \n Let me make your accusations correct.\n \n *******************************************************************\n \n Now, after that, for once you're telling the truth.", 
   {}, 
   2713, 
   null, 
   1050616500.0
  ], 
  [
   6805, 
   null, 
   "Crim", 
   "and the others don't want to believe (hope there isn't) a god \n \n \n You have it completely backwards.\n There are those who don't believe and there are those who WANT to believe and hope their beliefs are true.", 
   {}, 
   2713, 
   null, 
   1050616860.0
  ], 
  [
   6808, 
   null, 
   "lurch", 
   "OK. I've got it now. I said:\n \nYou have made yourself a fool with nothing but names and insults.\n\n but I would have been more correct to say:\n \nShut up you retarded moronic idiot. You little whining baby, stop wasting my time you dumb fool. \n \n At least you are aware of your own mental deficiencies.", 
   {}, 
   2713, 
   null, 
   1050619620.0
  ], 
  [
   6887, 
   null, 
   "gilligan8503", 
   "i leave for a couple of days and look at all of this senseless blabber from habbit's fingertips.\n \n i won't reply (take too long) but they are right... if you look at your answers, i see no credible evidence or facts of any kind...", 
   {}, 
   2713, 
   null, 
   1050870960.0
  ], 
  [
   6918, 
   null, 
   "Habbit", 
   "idiot- \n \n \nAt least you are aware of your own mental deficiencies.\n\n \n Ok. By the way, you're always whining about how I'm calling you names, but then you do it back? I just love it how you atheists think you can be sarcastic insulting bastards but when someone meets your sarcasm with more sarcasm you cry and moan. \n \n gilligan-\n \n At least you don't have to respond to paragraphs of stupidity, like those that Cuchulainn posts.", 
   {}, 
   2713, 
   null, 
   1050890100.0
  ], 
  [
   7587, 
   null, 
   "Pikeman85", 
   "ROFL. They all believe in a god but hope there isn't?\n \n LAUGH. I spent month, after month, struggling while being a Christian, and going back and forth, because I wanted so BADLY for there to be a God.\n \n At times I sincerely wish there were one. I found out my grandfather had cancer today. That didn't make me happy. You think I didn't hope there was a god in case he died, and sugar candy mountain for him to go to, so we could be reunited if he does die? You bet your XXX that'd make me happy.\n \n Of course, due to extensive research, questioning, thinking, etc, I am certain beyond virtually a shadow of a doubt the Christian god does not exist. I am fairly certain no \"afterlife\" exists. I cannot prove the latter, though with the former, I can demonstrate some parts of the Bible which are inaccurate, and just plain wrong. I am an agnostic, simply because I cannot prove nor disprove a god.\n \n And if I /worship/ anything, it'd be reason and thought.\n \n And yes, I dislike Christianity, as my sig says. I find it makes a great deal of ignorant, unhappy wretches. Thats simply my opinion of it.\n \n Oh well, you'll most likely insult me. I've not insulted you at all, so maybe you will not. Maybe I will be free from any and all insults.\n \n Good luck and free thought to all", 
   {}, 
   2713, 
   null, 
   1051956360.0
  ], 
  [
   7949, 
   null, 
   "Habbit", 
   "Pikeman-\n \n \nROFL. They all believe in a god but hope there isn't?\n\n \n ...? Either you've misread what I said, twisted what I said, or you're just stupid.\n \n \nYou bet your XXX that'd make me happy.\n\n \n Well, first, I probably wouldn't bet my XXX, but whatever you say... Secondly, I wish Heaven were a candy mountain too (with Snikers, Milky Way, FUN DIP, Twisters, Skittles, M&Ms, and super blow-pops) but it's not. \n \n \nI am fairly certain no \"afterlife\" exists.\n\n \n Been there, done that, right? I wish I could die and come back to life like that.\n \n \nI cannot prove the latter, though with the former, I can demonstrate some parts of the Bible which are inaccurate, and just plain wrong.\n\n \n Based on who's opinions? Atheist.com and christianssuck.com?\n \n \nAnd if I /worship/ anything, it'd be reason and thought.\n\n \n Ahh. Now I see why you turned into an agnostic, if you even believed Christianity in the first place.\n \n \nAnd yes, I dislike Christianity, as my sig says. I find it makes a great deal of ignorant, unhappy wretches. Thats simply my opinion of it.\n\n \n I dislike atheistism. I find it makes a great deal of ignorant, unhappy, sarcastic, moronic, pompous, etc. etc. fools who, as I've already said, sit in forums like this waiting to pounce upon the first person who says \"I believe in God.\"\n \n \nOh well, you'll most likely insult me.\n\n \n Screw you. \n \n Done. :D", 
   {}, 
   2713, 
   null, 
   1052626320.0
  ], 
  [
   8133, 
   null, 
   "Pikeman85", 
   "I'm not an Athiest (well according to that one definition thing I am a \"weak Athiest\") but an Agnostic. Huge difference in my opinion, but I digress.\n \n Second, a believe in a God and Heaven is FAR easier, by FAR than any sort of skeptical thought in the matter.\n \n And don't even go around claiming I was not what I once was. I assure you, and if you really wanted to, I can get the confirmation records, etc.\n \n As for the afterlife, you are correct, I do not know. I assumed something. I have to quit doing that. I concede that point in your favor.", 
   {}, 
   2713, 
   null, 
   1053128220.0
  ], 
  [
   8173, 
   null, 
   "Habbit", 
   "Pikeman-\n \n \nAnd don't even go around claiming I was not what I once was. I assure you, and if you really wanted to, I can get the confirmation records, etc.\n\n \n Confirmation records that you were a Christian? Excuse me while I fall out of my chair in uncontrollable fits of laughter. Did your pastor make you sign a paper that said \"I, _________, have proudly become a Christian on ________ __, _____\"? Or did they take pictures of you talking to Jesus in the youth room? \n \n Seriously though... no, wait, nevermind. *snicker* \n \n \nSecond, a believe in a God and Heaven is FAR easier, by FAR than any sort of skeptical thought in the matter.\n\n \n Which was this a response to?", 
   {}, 
   2713, 
   null, 
   1053287700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  God doesn't believe in atheists!", 
  "url": "http://www.4forums.com/political/religion-debates/260-god-doesnt-believe-atheists.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 260, 
  "discussion_files": [
   [
    "20248.html", 
    "http://www.4forums.com/political/religion-debates/260-god-doesnt-believe-atheists-print.html"
   ], 
   [
    "20249.html", 
    "http://www.4forums.com/political/religion-debates/260-god-doesnt-believe-atheists-5-print.html"
   ], 
   [
    "20250.html", 
    "http://www.4forums.com/political/religion-debates/260-god-doesnt-believe-atheists-4-print.html"
   ], 
   [
    "20251.html", 
    "http://www.4forums.com/political/religion-debates/260-god-doesnt-believe-atheists-3-print.html"
   ], 
   [
    "20252.html", 
    "http://www.4forums.com/political/religion-debates/260-god-doesnt-believe-atheists-2-print.html"
   ]
  ], 
  "identifier": 260
 }
]