[
 [
  [
   54907, 
   null, 
   "Close_slave_can", 
   "I am a giant sleeping alien that is having strange dream. Earth does not exist at all, its all in my mind. You only think it is silly because I imagine that you do. \n \n \n You cannot prove this is not true, there are many other statements nobody will seriously believe that cannot be proven false. I think it is good to acknowledge that humanity has its limits and nobody can know the absolute truth about everything but I am trying to show you can take the idea to far.\n As far as I can see every creation supporter here makes this mistake and I invite you to make counter arguments to show that you are not merely offering truisms that could not convince anyone that does not share your belief and opinions already.", 
   {
    "post_info": {
     "post_title": "Prove you are not all figments of my imagination."
    }
   }, 
   null, 
   null, 
   1087871640.0
  ], 
  [
   54908, 
   null, 
   "SilentPoet", 
   "I am a giant sleeping alien that is having strange dream. Earth does not exist at all, its all in my mind. You only think it is silly because I imagine that you do. \n \n \n IT ALL MAKES SENSE NOW emoticon_idea \n WHY DIDNT I UNDERSTAND EARLIER? :xbanghead \n \n \n Editing done due to my own mistake after re-reading your post", 
   {}, 
   54907, 
   null, 
   1087871820.0
  ], 
  [
   54910, 
   null, 
   "ungerdunn", 
   "Right.\n \n And the craters on the moon were caused by the battle between St. Michael and Satan when Satan was cast out of heaven. You can't prove I'm wrong (or that Henry Morris of ICR is wrong) but that still doesn't make the idea any less silly.\n \n The thing is, there is no evidence to support either idea. Since you and I are making the assertions, it is up to us to offer the evidence in support of our particular foolishness.\n \n And that is what creationism fails to do.", 
   {}, 
   54907, 
   null, 
   1087872060.0
  ], 
  [
   54912, 
   null, 
   "Ursus maritimus", 
   "I refute it thus.", 
   {}, 
   54910, 
   null, 
   1087872420.0
  ], 
  [
   54913, 
   null, 
   "CCR1994", 
   "The one thing that nobody can question is that I am God and if you all don't start behaving I'm going to have to send you to your room without dessert.", 
   {}, 
   54912, 
   null, 
   1087872660.0
  ], 
  [
   54915, 
   null, 
   "CrazyHarborc", 
   "emoticon_xbouncer I am therefore I think. I think therefore I am. Either way I am, so there. Now, IF I wasn't, I wouldn't be able to think I am. Since I think and I am, it must be you who are not. emoticon_smile", 
   {}, 
   54912, 
   null, 
   1087872780.0
  ], 
  [
   54916, 
   null, 
   "CCR1994", 
   "I'm actually Hugh Hefner.. .. . no really I am...", 
   {}, 
   54915, 
   null, 
   1087872900.0
  ], 
  [
   54919, 
   null, 
   "AMD4EVER", 
   "You cannot prove this is not true, there are many other statements nobody will seriously believe that cannot be proven false. I think it is good to acknowledge that humanity has its limits and nobody can know the absolute truth about everything but I am trying to show you can take the idea to far.\n\n \n This goes back to childhood type arguments. Think of a number between 1 and 10. 5. Nope 3. I knew it was 3 but I just didn't want to win. Good luck trying to prove that the person didn't know it was 3 all along even though all logic would dictate that he didn't know it was 3.\n \n However the thing about your logic can go to show that even if God exists someone can just debate that even he is part of this aliens dream meaning we could not even prove that God knows everything. I would be an endless circle of second guessing everything we think we know. What is the point of that kind of madness?", 
   {}, 
   54907, 
   null, 
   1087873380.0
  ], 
  [
   54924, 
   null, 
   "Close_slave_can", 
   " even if God exists someone can just debate that even he is part of this aliens dream meaning we could not even prove that God knows everything. \n\n \n What can I say, I am a very clever and creative alien even while I sleep. I think I hear my space alarm clock going off and I really should get ready for my space meeting. Unfortunately this will mean all of you (including god) will all disappear for 16 astrohours, I will talk to you then.", 
   {}, 
   54919, 
   null, 
   1087874220.0
  ], 
  [
   54938, 
   null, 
   "ungerdunn", 
   "You guys are being scary. You are acting like another poster on this board. You post some assertion based on no learning, no research, and no thought. Nothing but an empty assertion based on misunderstanding and wishful thinking. Then when informed of the facts, suddenly those facts were known all along.\n \n \"The ultimate meaning of Clemson's words was this.\"\n \n \"Clemson didn't say that. Wilson did. It was incorrectly applied to Clemson's thoughts.\"\n \n \"Well Clemson wanted to say that.\"\n \n \"No. It was Preston who convinced him that using Wilson's term would avoid confusion. Have you read what Clemason said?\"\n \n \"I don't have to read it. I know what he meant without reading what he said. And I knew all along that it was Wilson who said it. Even though Clemson didn't say it, he wished he had.\"\n \n \"No. I have read Clemson and my quotes shows that Clemson preferred his own term and only used Wilson's to avoid confusion.\"\n \n \"I win. I posted a single paragraph from the 25th edition of the book that shows that you are wrong. What Clemson said in the first 24 editions is irrelevant. What matters is what I know to be true from my non-reading of the primary sources.\"\n \n Isn't that particular mindset pathetic. Why don't we all send PMs and declare our victory over such ignorant childishness.", 
   {}, 
   54924, 
   null, 
   1087880580.0
  ], 
  [
   54980, 
   null, 
   "unkerpaulie", 
   "I am a giant sleeping alien that is having strange dream. Earth does not exist at all, its all in my mind. You only think it is silly because I imagine that you do. \n\n but you too are a figment of my imagination, and you only think you are a giant alien dreaming about this world because i imagined you as such. you cannot disprove this either.\n \n \nYou cannot prove this is not true, there are many other statements nobody will seriously believe that cannot be proven false. I think it is good to acknowledge that humanity has its limits and nobody can know the absolute truth about everything but I am trying to show you can take the idea to far.\n As far as I can see every creation supporter here makes this mistake and I invite you to make counter arguments to show that you are not merely offering truisms that could not convince anyone that does not share your belief and opinions already.\n\n from a creationist standpoint, not only is the claim unprovable, it makes predictions that are contrary to reality. but, like you said, our perception of reality may just be a collective illusion. using this logic, there is no logic, because what's logical to me may simply be logical in my mind but not in reality. at this point reality itself becomes subjective rather than absolute. we fall into a spiralling wormhole forever", 
   {}, 
   54907, 
   null, 
   1087918980.0
  ], 
  [
   54986, 
   null, 
   "The Barbarian", 
   "Yep. Once you reject evidence as a way of understanding, then nothing can be known.\n \n This is one of the creationist dilemmas.", 
   {}, 
   54980, 
   null, 
   1087919760.0
  ], 
  [
   55344, 
   null, 
   "Duo_Maxwell", 
   "We believe much, but know nothing. \n \n I can't prove anything. You can simply question it until the source, question the source, question the logic, question the words, question the meaning, question how these meanings came about, question where language came from, question everything until nothing is left to question. Being a true skeptic is to deny the very existance of truth. No one can prove anything to a true skeptic. \n \n unkerpaulie beat me to the punch. How do you know that you aren't figment of our collective unconscienous?", 
   {}, 
   54986, 
   null, 
   1088054040.0
  ], 
  [
   55458, 
   null, 
   "weasel fierce", 
   "I have pie, thus I am.", 
   {}, 
   55344, 
   null, 
   1088120460.0
  ], 
  [
   55462, 
   null, 
   "Lainse", 
   "Prove to ME your not a figment of MY imagination first! :P\n And there is a spoon.", 
   {}, 
   54907, 
   null, 
   1088120760.0
  ], 
  [
   55473, 
   null, 
   "Kronus", 
   "Silly Weasel. It's not pie you are, it's pi are squared.", 
   {}, 
   55462, 
   null, 
   1088123220.0
  ], 
  [
   55479, 
   null, 
   "T.Q", 
   "and cake are round!", 
   {}, 
   55473, 
   null, 
   1088126040.0
  ], 
  [
   55480, 
   null, 
   "OccamsRazor", 
   "Do you think two pie are more filling than pie are squared?", 
   {}, 
   55479, 
   null, 
   1088126400.0
  ], 
  [
   55493, 
   null, 
   "CrazyHarborc", 
   "So is Clemson related to Clem Kadiddlehopper or somebody else? emoticon_emb I am afraid I have never heard of the man before.\n \n On MY planet, it's not I who must prove existence. All the \"others\" must prove it.\n \n I don't care if the pi/pie is square or the usual shape, round, a circle. As long as it's strawberry/rhubarb, served hot with ONE scoop of REAL vanilla ice cream........With a glass of COLD milk. emoticon_xgood", 
   {}, 
   55462, 
   null, 
   1088134440.0
  ], 
  [
   55804, 
   null, 
   "Mr Jack", 
   "If the world was a figment of your imagination it would be a lot more pornographic.", 
   {}, 
   55493, 
   null, 
   1088425200.0
  ], 
  [
   55806, 
   null, 
   "OccamsRazor", 
   "If the world was a figment of your imagination it would be a lot more pornographic.\n\n \n In my case, I doubt it emoticon_xangel", 
   {}, 
   55804, 
   null, 
   1088426820.0
  ], 
  [
   56102, 
   null, 
   "umustbebrnagain", 
   "What can I say, I am a very clever and creative alien even while I sleep. I think I hear my space alarm clock going off and I really should get ready for my space meeting. Unfortunately this will mean all of you (including god) will all disappear for 16 astrohours, I will talk to you then.\n\n \n \n \"Be not deceived, God is not mocked. For whatsoever a man soes that will he also reap.\" -- Galatians", 
   {}, 
   54924, 
   null, 
   1088557500.0
  ], 
  [
   56104, 
   null, 
   "Ursus maritimus", 
   "Galatians chapter 6, to be exact. One of my favorite verses - one of the few that I still have memorized.\n \n If you look at the verse in context, it has nothing to do with making jokes. The chapter is concerned with showing good works - in context it means that god will not be fooled, or that he will not forget to reward the just. Make sure that your works are good, or else god will ensure that you will recieve your just desserts. But there is no hint in the chapter concerning jokes per se.", 
   {}, 
   56102, 
   null, 
   1088559660.0
  ], 
  [
   56110, 
   null, 
   "Close_slave_can", 
   "\"Be not deceived, God is not mocked. For whatsoever a man soes that will he also reap.\" -- Galatians\n\n \n If you think I am actually mocking god you are missing the point. If you state a position based on faith there is no point offering justifications or rationalisations since they are just as empty as the \"I am the sleeping alien dreaming everthing\" argument. Either god will allow us to see you position based on faith is true or it won't.", 
   {}, 
   56102, 
   null, 
   1088562420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Prove you are not all figments of my imagination.", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2601-prove-you-not-all-figments-my-imagination.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 2601, 
  "discussion_files": [
   [
    "15110.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2601-prove-you-not-all-figments-my-imagination-print.html"
   ], 
   [
    "15111.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2601-prove-you-not-all-figments-my-imagination-2-print.html"
   ]
  ], 
  "identifier": 2601
 }
]