[
 [
  [
   55025, 
   null, 
   "Siegfriedson", 
   "1. The white race laid the foundations of America.\n \n 2. In the eyes of America's founders, only Whites could be \"Americans\". Therefore, American heritage is White heritage.\n \n 3. American law, religion, art, music, and culture in general is based upon concepts from White European thought.\n \n 4. The American all-white neighborhoods of the past were demonstrably cleaner, safer, and freer of crime than the trendy \"integrated\" neighborhoods of today.\n \n 5. The American all-white public schools of the past were clearly superior to any trendy \"integrated\" school of today.\n \n 6. All great societies of the past, which were white as they rose to power, allowed their original ethnic make-up to be altered, and they fell permanently into decay (for example, Egypt).\n \n 7. Racial integration of our neighborhoods and our schools has forced them into decay. It is clear beyond any debate that modifying the racial composition of America away from a dominantly white society towards a mixed, \"racially-diverse\" society will be catastrophic. It will plunge the great American nation of Washington and Jefferson into the same depths that the other formerly great white nations of the past have fallen into.\n \n 8. Based upon the extensive history of the black race it is clear that it is not capable of creating or maintaining an advanced society. It has never created one advanced society in Africa (ancient Egypt was not created by blacks). In every case (such as Haiti) where they have been given a thriving society, blacks have killed it, driving it into the same primitive state that their people have always lived in (in their native Africa). For any who is foolish enough to doubt history, we have the sad spectacle of South Africa playing out before us, which should erase all doubts.\n \n 9. History and present events have shown us that the black race cannot create or maintain an advanced society on its own (look at black neighborhoods and cities). Its members, therefore, cannot fit well into an advanced society, living and working beside those who not only are capable of building one advanced society, but have built numerous such societies in all climates and in all types of land.\n \n 10. History has shown us that the mestizo Hispanic peoples, being of mixed (mostly) Indian, Negro, and a little Spaniard blood, are also deficient in creating advanced societies like the white race has repeatedly created. While they have shown ability that is superior to the black race, they have not been able to utilize the superior natural resources of Central America and the South American continent.\n \n 11. Spain and Portugal sent soldiers to the lands south of the Rio Grande to conquer and take the wealth of the land. Instead of sending families to colonize, the Spanish men took native wives. The racial makeup of the lands south of the Rio Grande is composed of American Indian, black, mixed-race and a small percentage of Whites thrown in. Their lands have never thrived like the nations to the north where Whites colonized and kept their race in tact, seldom mixing their race with Indians and blacks.\n \n 12. By \"celebrating diversity\", brainwashed whites are bringing the Hispanic and Asian peoples into a once White America, and we will cause the North American continent to become like the South American continent. The great wealth and stable society of white America will be traded for the poverty and instability of the revolution-torn countries south of our border.\n \n 13. Even if all races were exactly the same, if there were no differences whatsoever, the fact that whites created the nation of America means that we are completely within our honorable rights to restrict entrance into our country. We may ethically allow only white immigrants, or no immigrants at all.\n \n 14. The number of whites, as a percentage of world population, is now down into the single digits and falling fast.\n \n 15. Nearly all of the white nations on earth are now accepting large numbers of non-white immigrants. The only one of the three major races of earth that is in real danger of falling into a minority status in its own racial home is the white race. This could easily lead to extermination of the white race. Will you just stand idly by?\n \n 16. Those who support American \"diversity\", non-white immigration, miscegenation, integration, and/or affirmative action, are either: 1) ignorant of the above critical facts; or 2) blatant haters of the white race and its civilization, and would not be troubled if Whites ceased to exist on planet Earth.", 
   {
    "post_info": {
     "post_title": "16 Facts that White Kids Won't Learn in School"
    }
   }, 
   null, 
   null, 
   1087935540.0
  ], 
  [
   55127, 
   null, 
   "Leviathan", 
   "While I do not agree with siegfriedson's post, I do wish to propose an interesting demograph: \n \n Is it wrong to be proud to be white? Obviously, blacks are proud to be black, and they are also proud of their culture and heritage. Am I racist for being proud to be white? Sounds pretty upsetting, doesn't it?\n \n I would be labeled, slandered, and laughed at if I proposed a national 'White History Month\". I would be called racist, prejiduce, and hateful for speaking out on behalf of 'white culture'. Is it a minority thing or are we really this brainwashed?\n \n I do not feel that I am racist, hateful, or a prejiduce person, and to be quite honest, I am both understanding and also angry at the position that all of our cultures are in. At some point, these types of issues have to be addressed realistically and, hopefully, we will one day live in a culture where 'real' equal opportunity can allow such freedom without aggression, but, unfortunately, for the time being, we all have to deal with culpable ignorance.", 
   {}, 
   55025, 
   null, 
   1087972140.0
  ], 
  [
   55204, 
   null, 
   "sinjin", 
   "While I do not agree with siegfriedson's post, I do wish to propose an interesting demograph: \n \n Is it wrong to be proud to be white? Obviously, blacks are proud to be black, and they are also proud of their culture and heritage. Am I racist for being proud to be white? Sounds pretty upsetting, doesn't it?\n \n I would be labeled, slandered, and laughed at if I proposed a national 'White History Month\". I would be called racist, prejiduce, and hateful for speaking out on behalf of 'white culture'. Is it a minority thing or are we really this brainwashed?\n \n I do not feel that I am racist, hateful, or a prejiduce person, and to be quite honest, I am both understanding and also angry at the position that all of our cultures are in. At some point, these types of issues have to be addressed realistically and, hopefully, we will one day live in a culture where 'real' equal opportunity can allow such freedom without aggression, but, unfortunately, for the time being, we all have to deal with culpable ignorance.\n\n \n Yes, in fact it is wrong to be proud of being white. Your race is not an accomplishment but an accident of birth. Now to be proud of your culture, its history and its traditions is another matter. This is the central point that the \"master race\" types don't get. You have no claim on the accomplishments of others simply because you share some physical trait. Furthermore, the perceived shortcomings of your culture are not transmitted genetically to succeeding generations. \n \n This delusion is not the exclusive property of any one race. People from all races and cultures are capable of embracing bigotry and do.", 
   {}, 
   55127, 
   null, 
   1088007900.0
  ], 
  [
   55216, 
   null, 
   "unkerpaulie", 
   "leviathan has identified reverse racism. there is really no reason why white people should not celebrate the accomplishments of their race, as black people do. and there is no reason why white people shouldnt showaces their culture, artforms and traditions that they are proud of. if being proud to be associated with your race makes you racist, then we are all racist. \n \n siegfried does have some issues of racial grudge though, and playing by his rules, id reply that white people brought this predicament upon themselves. white people took africans into america to do manual labor, and made them resident in the country. now that blacks, being resident, are a permanent fixture in the country to the point where the entire generation is influenced by black culture now more than ever, people with ideals like siegfriedson have something against it? id say its your fault. if you wanted to maintain a racially pure country, you should have thought about that before you displaced africans and other races from their native countries. \n \n and thanks to you white entrepreneurs exploiting black artform of hiphop, now all the white suburban kids are listening to rap music and absorbing the black culture even more. you shoulda thought about that in the first place. now you got little white kids speaking in ebonics and emulating the culture of the \"hood\".\n \n tough luck, but black culture is now a large part of the upcoming generation. youll just have to deal with it\n \n by the way, im black", 
   {}, 
   55204, 
   null, 
   1088010060.0
  ], 
  [
   55222, 
   null, 
   "sinjin", 
   "leviathan has identified reverse racism. there is really no reason why white people should not celebrate the accomplishments of their race, as black people do. and there is no reason why white people shouldnt showaces their culture, artforms and traditions that they are proud of. if being proud to be associated with your race makes you racist, then we are all racist. \n \n siegfried does have some issues of racial grudge though, and playing by his rules, id reply that white people brought this predicament upon themselves. white people took africans into america to do manual labor, and made them resident in the country. now that blacks, being resident, are a permanent fixture in the country to the point where the entire generation is influenced by black culture now more than ever, people with ideals like siegfriedson have something against it? id say its your fault. if you wanted to maintain a racially pure country, you should have thought about that before you displaced africans and other races from their native countries. \n \n and thanks to you white entrepreneurs exploiting black artform of hiphop, now all the white suburban kids are listening to rap music and absorbing the black culture even more. you shoulda thought about that in the first place. now you got little white kids speaking in ebonics and emulating the culture of the \"hood\".\n \n tough luck, but black culture is now a large part of the upcoming generation. youll just have to deal with it\n \n by the way, im black\n\n \n The culture of black Americans is not \"black culture\". There is no such thing. Nigerians and Haitians have cultures and they're not the same even though they are \"black\" as well.\n \n The culture of white Americans is not \"white culture\". There is no such thing. Irish and Armenians have cultures and they're not the same even though they are \"white\" as well.", 
   {}, 
   55216, 
   null, 
   1088011620.0
  ], 
  [
   55279, 
   null, 
   "Siegfriedson", 
   "Imagine if you could channel all your misplaced hate and rage into something productive. You peckerwoods are pathetic.\n\n \n Ah, there's that old, time-tested buzzword again - \"hate\". I'm surprised you didn't follow it up with other \"oldies but goodies\" such as \"bigot\", \"hatemonger\", and \"prejudiced\".\n \n You accuse me of \"hate\", yet you call me a \"peckerwood\", which is the equivalent of calling a black a \"nigger\".", 
   {}, 
   55025, 
   null, 
   1088026380.0
  ], 
  [
   55280, 
   null, 
   "Siegfriedson", 
   "Yes, in fact it is wrong to be proud of being white. Your race is not an accomplishment but an accident of birth. Now to be proud of your culture, its history and its traditions is another matter.\n\n \n When I and other white racialists say we are \"proud to be White\", it means we feel a healthy appreciation and respect for the accomplishments of our ancestors, and it also means that we feel exremely privileged to be their progeny. It is a different type of pride from the kind that one feels when one passes an exam or completes some venerable deed. So, to use your wording, racial pride is the same thing as being \"proud of your culture, its history and its traditions\".", 
   {}, 
   55204, 
   null, 
   1088026560.0
  ], 
  [
   55298, 
   null, 
   "sinjin", 
   "When I and other white racialists say we are \"proud to be White\", it means we feel a healthy appreciation and respect for the accomplishments of our ancestors, and it also means that we feel exremely privileged to be their progeny. It is a different type of pride from the kind that one feels when one passes an exam or completes some venerable deed. So, to use your wording, racial pride is the same thing as being \"proud of your culture, its history and its traditions\".\n\n \n The accomplishments of your ancestors had nothing to do with their \"whiteness\" and everything to do with their strength of character. Strength of character is not limited to fair skinned people.", 
   {}, 
   55280, 
   null, 
   1088032980.0
  ], 
  [
   55359, 
   null, 
   "Alucard", 
   "How does one judge whiteness or blackness or _____ness of a person. If it's based on physical characteristics, I know plenty of dark skinned \"white\" people and plenty of lighter skinned \"black\" people. If it's based on genetic makeup and ancestry, there have been several studies that conclude that races have no genetic meaning as all of the human population are extremely genetically identical. \n Also, I think it's moot to say that America was built by whites, because a variety of immigrating cultures made America. And who are whites anyway? I know that Irish, English, German, Dutch, and other European immigrants were some of the first to start the US, but I bet anything that their cultural differences were large enough for them to settle in different places. Why stop our tradition of allowing immigrants to mold our country into what it is. I don't think genetically anyone is less or more \"white\" than you, and according to your argument, most Hispanics are white because of their mixed Spanish blood.\n \n Being proud of being white is as inane as being proud of having brown eyes or freckles, it has no bearing on your culture or beliefs.", 
   {}, 
   55298, 
   null, 
   1088070180.0
  ], 
  [
   55386, 
   null, 
   "sinjin", 
   "\n Being proud of being white is as inane as being proud of having brown eyes or freckles, it has no bearing on your culture or beliefs.\n\n \n emoticon_xhoho \n \n Precisely.", 
   {}, 
   55359, 
   null, 
   1088094600.0
  ], 
  [
   55939, 
   null, 
   "Tastyfish", 
   "I can see people being proud of european culture, and this isn't sterotyped as being racist in the education establishment or the media (Frasier is pretty much about this kid of guy, but he is never protrayed as racist) despite what some 'white pride' people seem to be assuming.\n \n I do like the idea that these things are things taught exclusively not to white students, as if black ones are taught these 'facts'", 
   {}, 
   55386, 
   null, 
   1088467080.0
  ], 
  [
   55975, 
   null, 
   "dsadevil", 
   "Let's take this point by point shall we?\n \n 1. The white race laid the foundations of America. \n\n Depends how you mean. They had a large part of it, to be sure. However, to claim they were the sole influences is patently false (to name one major example of an important non-white influence, the Iriquois Federation, and later of course Mixed raced latinos would be a huge influence in the Southwest).\n \n \n2. In the eyes of America's founders, only Whites could be \"Americans\". Therefore, American heritage is White heritage. \n\n That's wonderful for them. Just b/c a group of venerable old people make a claim doesn't make it true. We've since evolved from that standpoint, as we've evolved away from slavery, religious persecution, and all sorts of other barbaric practices that used to be the white norm.\n \n \n3. American law, religion, art, music, and culture in general is based upon concepts from White European thought. \n\n False. American law is based first on English common law (White), prior to that Roman law (white/mixed), prior to THAT the bible and Hammarabi's code (Semetic). Religion (by which I assume you mean christianity, though technically of course there is no \"american\" religion as we haven't created any new ones and are legally barred from establishing one) also has Semetic roots. Barely any modern american music comes from white sources anymore, with the possible exception of techno. Both Jazz and Rock and Roll (and their derivitives) are black in origin. Culture being an aggregate of the above, this claim is simply untrue.\n \n \n4. The American all-white neighborhoods of the past were demonstrably cleaner, safer, and freer of crime than the trendy \"integrated\" neighborhoods of today. \n\n I'm not sure what you mean by \"integrated\" neighborhood. I live in a mostly white neighborhood, though its certainly open to anyone of any race (and we do have several diplomat families from Africa residing on my block). Am I integrated or not? This strikes me as a statement for which its easy to manipulate the statistics in favor of, especially if one mistakens corralation for causation.\n \n \n5. The American all-white public schools of the past were clearly superior to any trendy \"integrated\" school of today. \n\n Again, I'll use my own experience as a refutation, as I attended one of the top public schools in the nation, and its not racially exclusive.\n \n \n6. All great societies of the past, which were white as they rose to power, allowed their original ethnic make-up to be altered, and they fell permanently into decay (for example, Egypt). \n\n Counter-examples abound. For example Ancient Rome reached its peak with a large infusion of North African elites. China maintained its regional dominance even with the mixing of Mongols and ethnic Hans (the era of Kublai Khan, you can read about it by looking up Marco Polo). And of course, the US is in a demonstratably far superior geopolitical situation in its post civil rights era as opposed to, say, its pre-civil war era.\n \n \n7. Racial integration of our neighborhoods and our schools has forced them into decay. It is clear beyond any debate that modifying the racial composition of America away from a dominantly white society towards a mixed, \"racially-diverse\" society will be catastrophic. It will plunge the great American nation of Washington and Jefferson into the same depths that the other formerly great white nations of the past have fallen into. \n\n Keeping the above into account, I don't see how its clear beyond any debate. Indeed, look at me, I'm debating it! :)\n \n \n 8. Based upon the extensive history of the black race it is clear that it is not capable of creating or maintaining an advanced society. It has never created one advanced society in Africa (ancient Egypt was not created by blacks). In every case (such as Haiti) where they have been given a thriving society, blacks have killed it, driving it into the same primitive state that their people have always lived in (in their native Africa). For any who is foolish enough to doubt history, we have the sad spectacle of South Africa playing out before us, which should erase all doubts. \n\n Again, patently false. The Zulus, Ghanans, Songhai, and Bantu's all created \"black empires.\" For the record, Jared Diamond's spectacular book \"Guns Germs and Steel\" refutes this point brilliantly, attributing (and proving) that the reason that Eurasians surged past Africa in terms of societal complexity is due to geographic, rather than genetic attributes (specifically the animals that reside in each continent and the axis orientation, north-south for Africa, east-west for Eurasia, of the continents). Finally, no such situation where blacks were \"given a thriving society\" exists. Haiti was not \"thriving\" by any stretch of the imagination, instead a few wealthy oppressors managed to get rich while the vast majority of the population was in desperate poverty.\n \n \n9. History and present events have shown us that the black race cannot create or maintain an advanced society on its own (look at black neighborhoods and cities). Its members, therefore, cannot fit well into an advanced society, living and working beside those who not only are capable of building one advanced society, but have built numerous such societies in all climates and in all types of land. \n\n Again, false. Ghana for example is a perfectly functional majority black country. Most cases where blacks are doing worse than whites can be easily attributed to the fact that they underwent significant amounts of oppresion that has been a serious handicap in reintegrating in society (slavery/Jim Crow in America, imperialism in Africa).\n \n \n10. History has shown us that the mestizo Hispanic peoples, being of mixed (mostly) Indian, Negro, and a little Spaniard blood, are also deficient in creating advanced societies like the white race has repeatedly created. While they have shown ability that is superior to the black race, they have not been able to utilize the superior natural resources of Central America and the South American continent. \n\n Warrant? Latino peoples had no less than three major empires in latin america prior to Columbus (Aztec, Inca, Mayan). Keeping in mind the above notes re: oppression as a handicap, and the geographical advantages Eurasia had over the New World, the latino peoples have done pretty well for themselves and have strong societies in Chile, Argentina, Brazil, Cuba, and Costa Rica, to name a few.\n \n \n 11. Spain and Portugal sent soldiers to the lands south of the Rio Grande to conquer and take the wealth of the land. Instead of sending families to colonize, the Spanish men took native wives. The racial makeup of the lands south of the Rio Grande is composed of American Indian, black, mixed-race and a small percentage of Whites thrown in. Their lands have never thrived like the nations to the north where Whites colonized and kept their race in tact, seldom mixing their race with Indians and blacks. \n\n This is false on two levels. First of all, at the very least Argentina and Cuba (pre-Castro) had per capita income levels similar to the US at various points in the past three centuries. Second, racial mixing in the US wasn't all that uncommon (Jefferson anyone?), especially on the frontiers.\n \n \n12. By \"celebrating diversity\", brainwashed whites are bringing the Hispanic and Asian peoples into a once White America, and we will cause the North American continent to become like the South American continent. The great wealth and stable society of white America will be traded for the poverty and instability of the revolution-torn countries south of our border. \n\n Now it gets interesting, as you throw in Asians where you have neglected to mention them previously. The reason for this is apparent, as Asians in the US have higher per capita income levels, test higher, get into better colleges, and otherwise outperform white people. In other words, they present a direct refutation to most of what you say above. Even in Asia, for most of history China was more advanced than Europe, and Asians have shown a remarkable ability to overcome white perpetuated oppression (Japan's incredible leap in technology during the Meiji restoration, Vietnam handing the US its only loss in war, to name a few). Second, if you want to redraw the racial boundary lines in america to where they once were prior to racial mixing, you'd have to get rid of Texas, California, and all of the American southwest. Notably, these areas are doing fine even with a starting population of non-whites.\n \n13. Even if all races were exactly the same, if there were no differences whatsoever, the fact that whites created the nation of America means that we are completely within our honorable rights to restrict entrance into our country. We may ethically allow only white immigrants, or no immigrants at all. \n\n Actually, I'm a cosmopolitan so I don't think we have the right to restrict immigration period, from a moral standpoint. From a legal standpoint, such an action is precluded by our own 14th amendment.\n \n14. The number of whites, as a percentage of world population, is now down into the single digits and falling fast. \n\n So? For the most part the growth is in Asia, who as I noted earlier are outperforming whites. So they have, under your logic, \"every right\" to replace \"inferior\" white people.\n \n15. Nearly all of the white nations on earth are now accepting large numbers of non-white immigrants. The only one of the three major races of earth that is in real danger of falling into a minority status in its own racial home is the white race. This could easily lead to extermination of the white race. Will you just stand idly by? \n\n For the record, the white homeland is Europe not America. But in any event, in light of above arguments I'm not worried about any catastrophe.\n \n16. Those who support American \"diversity\", non-white immigration, miscegenation, integration, and/or affirmative action, are either: 1) ignorant of the above critical facts; or 2) blatant haters of the white race and its civilization, and would not be troubled if Whites ceased to exist on planet Earth.\n \n\n Or perhaps 3) we know the flaws in your analysis which cause it to fall.\n \n A few notes of my own. I think that race in of itself is a fictive construct. Race obviously isn't just the color of my skin (I'm white-skinned, but my ethnicity would remain the same if I painted myself brown). If anything, what we refer to as \"white\" can really be said to refer to the Indo-European ethnic grouping, which includes most of Europe (Finland and the Basques are prominent exceptions). In that respect, I'm NOT \"white\" as I'm Jewish and therefore Semetic (a distinct ethnic group wholly unrelated to Indo-Europeans, however the root of their own religion). On the flip side, I wonder if Siegfriedson would classify Uighers as \"white.\" They have pale skin, and tend towards blue eyes. Oh, and the live in Western China (near Tibet), are predominantly Muslim, and are more closely related to Mongols then Europeans (with the exception of the Finns, who are part of the same ethnic group). \"Race\" itself seems to be a story that we tell ourselves to create an \"other\" that we can oppress without guilt. Sometimes the Other is someone of another religion, or skin color, or sometimes a nationality. Always it is used to seperate the \"ins\" from the \"outs\" with the purpose, explicit or implicit, to facilitate the domination of the latter by the former. Race is actually one of the clearest examples of the fallacy in this logic, some who look \"white\" (really: Indo-European) aren't, such as Jews or Finns, others who don't look \"white\" actually are Indo-European (Indians, to take the obvious example). Yet I bet we'll never hear Siegfried talk about the innate inferiority of the Finns (how could he? they have one of the highest standards of living in the modern world) or proclaim Indians to be part of his racial brethren.", 
   {}, 
   55939, 
   null, 
   1088479860.0
  ], 
  [
   56020, 
   null, 
   "sinjin", 
   "dsadevil,\n \n nice read.", 
   {}, 
   55975, 
   null, 
   1088529120.0
  ], 
  [
   56720, 
   null, 
   "Siegfriedson", 
   "1. The white race laid the foundations of America.\n \n\n Depends how you mean. They had a large part of it, to be sure. However, to claim they were the sole influences is patently false (to name one major example of an important non-white influence, the Iriquois Federation, and later of course Mixed raced latinos would be a huge influence in the Southwest).\n\n\n \n The ancestors of white Americans were settlers and pioneers. When they arrived here during the 16th-19th centuries, America was a practically empty land that Whites settled and built up. They erected cities, paved streets and highways, laid down railroad tracks, constructed bridges, farmed the land, and built factories and industry. Whites brought European culture to a wilderness devoid of civilization.\n \n In any case, immigrants originally settled every nation in the world - why is America any different? Furthermore, America is no longer an empty continent. We are a crowded country of 290 million people that must deal with problems like sprawl, pollution, and disappearing forests and open space. Worst of all, the percentage of Whites in this country has been plummeting and shows no signs of reversal.\n \n \n \n2. In the eyes of America's founders, only Whites could be \"Americans\". Therefore, American heritage is White heritage.\n \n\n That's wonderful for them. Just b/c a group of venerable old people make a claim doesn't make it true. We've since evolved from that standpoint, as we've evolved away from slavery, religious persecution, and all sorts of other barbaric practices that used to be the white norm.\n\n\n \n Your condescending toward the Founding Fathers, some of the finest men that Western Civilization ever produced, is disturbing. \"Venerable old people\"? In order for America to remain America, we must constantly strive to adhere to the standards set by the Founding Fathers in America's earliest decades. They should not simply be dismissed with a wave of the hand under the false belief that we have \"evolved\", as you say.\n \n \n \n3. American law, religion, art, music, and culture in general is based upon concepts from White European thought.\n \n\n False. American law is based first on English common law (White), prior to that Roman law (white/mixed), prior to THAT the bible and Hammarabi's code (Semetic). Religion (by which I assume you mean christianity, though technically of course there is no \"american\" religion as we haven't created any new ones and are legally barred from establishing one) also has Semetic roots. Barely any modern american music comes from white sources anymore, with the possible exception of techno. Both Jazz and Rock and Roll (and their derivitives) are black in origin. Culture being an aggregate of the above, this claim is simply untrue.\n\n\n \n The White race \"Westernized\" Christianity and made it the White man's religion. As for your claim that rock n' roll and jazz are black in origin, have a look:\n \n The Blacks who wrote gospel and jazz music took their influence from the Scottish:\n \n http://www.rense.com/general41/dehb.htm\n \n The Blacks who developed \"rock n roll\" were influenced by Irish/Scottish folk music:\n \n http://www.underbridge.com/scathan/archive/1998/04_april/04.1998.celticmusic.html\n \n \n \n4. The American all-white neighborhoods of the past were demonstrably cleaner, safer, and freer of crime than the trendy \"integrated\" neighborhoods of today.\n \n\n I'm not sure what you mean by \"integrated\" neighborhood. I live in a mostly white neighborhood, though its certainly open to anyone of any race (and we do have several diplomat families from Africa residing on my block). Am I integrated or not? This strikes me as a statement for which its easy to manipulate the statistics in favor of, especially if one mistakens corralation for causation.\n\n\n \n Integrated neighborhoods are ones where multiple races live in close proximity to each other. As a whole, white people (wisely) refuse to live in areas where they are the racial minorities. When that point is reached, they move to whiter areas. This is a sociological phenomenon known as \"white flight\".\n \n \n 5. The American all-white public schools of the past were clearly superior to any trendy \"integrated\" school of today.\n \n\n Again, I'll use my own experience as a refutation, as I attended one of the top public schools in the nation, and its not racially exclusive.\n\n\n \n America's public schools have been in decline for a while now and the schools that have majority non-white student bodies are in utter shambles. Despite receiving a disproportionate amount of funding, their scores are regularly far below those of White students.\n \n Besides, your personal experience should not be grounds for you to make sweeping judgements about the national public school system.\n \n \n6. All great societies of the past, which were white as they rose to power, allowed their original ethnic make-up to be altered, and they fell permanently into decay (for example, Egypt).\n \n\n Counter-examples abound. For example Ancient Rome reached its peak with a large infusion of North African elites. China maintained its regional dominance even with the mixing of Mongols and ethnic Hans (the era of Kublai Khan, you can read about it by looking up Marco Polo). And of course, the US is in a demonstratably far superior geopolitical situation in its post civil rights era as opposed to, say, its pre-civil war era.\n\n\n \n I specified \"all great white societies\", not \"all great societies\", so your example of China is not valid. I would argue that ancient Rome was at its peak before expansion into Asia and Northern Africa and the extenstion of Roman citizenship to non-Romans. As for the USA being in a \"far superior geopolitical situation\" today, I disagree on many levels. Your example of America in its pre-Civil War days is actually a contradiction to your argument. Back in those days, Americans built all their own goods, and the government more closely followed the Constitution. America had nowhere to go but up - then the Civil War occurred. Today, America is in a lose-lose situation on many fronts.\n \n \n \n8. Based upon the extensive history of the black race it is clear that it is not capable of creating or maintaining an advanced society. It has never created one advanced society in Africa (ancient Egypt was not created by blacks). In every case (such as Haiti) where they have been given a thriving society, blacks have killed it, driving it into the same primitive state that their people have always lived in (in their native Africa). For any who is foolish enough to doubt history, we have the sad spectacle of South Africa playing out before us, which should erase all doubts.\n \n\n Again, patently false. The Zulus, Ghanans, Songhai, and Bantu's all created \"black empires.\" For the record, Jared Diamond's spectacular book \"Guns Germs and Steel\" refutes this point brilliantly, attributing (and proving) that the reason that Eurasians surged past Africa in terms of societal complexity is due to geographic, rather than genetic attributes (specifically the animals that reside in each continent and the axis orientation, north-south for Africa, east-west for Eurasia, of the continents). Finally, no such situation where blacks were \"given a thriving society\" exists. Haiti was not \"thriving\" by any stretch of the imagination, instead a few wealthy oppressors managed to get rich while the vast majority of the population was in desperate poverty.\n\n\n \n Throughout 6,000 years of recorded history, the Black African Negro has invented nothing. Not a written language, weaved cloth, a calendar, a plow, a road, a bridge, a railway, a ship, a system of measurement, or even the wheel. (Note: This is in reference to the pure-blooded Negro.) He is not known to have ever cultivated a single crop or domesticated a single animal for his own use (although many powerful and docile beasts abounded around him.) His only known means of transporting goods was on the top of his hard burry head. For shelter he never progressed beyond the common mud hut, the construction of which a beaver or muskrat is capable.\n \n \n \n9. History and present events have shown us that the black race cannot create or maintain an advanced society on its own (look at black neighborhoods and cities). Its members, therefore, cannot fit well into an advanced society, living and working beside those who not only are capable of building one advanced society, but have built numerous such societies in all climates and in all types of land.\n \n\n Again, false. Ghana for example is a perfectly functional majority black country. Most cases where blacks are doing worse than whites can be easily attributed to the fact that they underwent significant amounts of oppresion that has been a serious handicap in reintegrating in society (slavery/Jim Crow in America, imperialism in Africa).\n\n\n \n \n Fact #1: The Third World was infinitely better off (at least in a material sense and political sense) under white colonial rule.\n \n Fact #2: Thomas Sowell in his book Race and Culture gives many examples of ethnic minorities that have undergone persecution yet who have overcome it and have improved their living conditions and standards. The Jews are an example. Blacks in America, however, still lag behind whites in terms of health and they committ a highly disproportionate amount of crime.\n \n \n \n10. History has shown us that the mestizo Hispanic peoples, being of mixed (mostly) Indian, Negro, and a little Spaniard blood, are also deficient in creating advanced societies like the white race has repeatedly created. While they have shown ability that is superior to the black race, they have not been able to utilize the superior natural resources of Central America and the South American continent.\n \n\n Warrant? Latino peoples had no less than three major empires in latin america prior to Columbus (Aztec, Inca, Mayan). Keeping in mind the above notes re: oppression as a handicap, and the geographical advantages Eurasia had over the New World, the latino peoples have done pretty well for themselves and have strong societies in Chile, Argentina, Brazil, Cuba, and Costa Rica, to name a few.\n\n\n \n Fact #1: Though the empires of the Aztecs, Incas, and Mayans were relatively impressive, they were still primitive compared to European civilization when they were discovered (and easily conquered) by the Spanish.\n \n Fact #2: The Latin American countries with the highest living standards and that are strongest economically (Brasil, Chile, Argentina) have a white ruling class that is derived from Spaniard and German blood. \n \n \n \n11. Spain and Portugal sent soldiers to the lands south of the Rio Grande to conquer and take the wealth of the land. Instead of sending families to colonize, the Spanish men took native wives. The racial makeup of the lands south of the Rio Grande is composed of American Indian, black, mixed-race and a small percentage of Whites thrown in. Their lands have never thrived like the nations to the north where Whites colonized and kept their race in tact, seldom mixing their race with Indians and blacks.\n \n\n This is false on two levels. First of all, at the very least Argentina and Cuba (pre-Castro) had per capita income levels similar to the US at various points in the past three centuries. Second, racial mixing in the US wasn't all that uncommon (Jefferson anyone?), especially on the frontiers.\n\n\n \n Interracial marriage and procreation (let's call it race-mixing) was extremely rare in America until recent times. Although it did happen, it was a taboo that was frowned upon. In fact, until recent decades, most states had laws prohibiting race-mixing. Indeed, although race-mixing has increased in America, most Whites still view it unfavorably (although they will not publicly say so for fear of being called \"racist\").\n \n The myth about Thomas Jefferson sleeping with one of his slaves has been debunked:\n \n http://www.vdare.com/francis/jefferson.htm\n \n http://www.amren.com/0106issue/0106issue.htm#article1\n \n Thomas Jefferson thought it had been a terrible mistake to bring blacks to America, and wrote that they should be freed from slavery and then \"removed from beyond the reach of mixture.\" He looked forward to the day when whites would populate not just North but South America, adding \"nor can we contemplate with satisfaction either blot or mixture on that surface.\"\n \n \"Nothing is more certainly written in the book of fate than that these people [the Negroes] are to be free. Nor is it less certain that the two races, equally free, cannot live in the same government. Nature, habit, opinion has drawn indelible lines of distinction between them.\" -- Thomas Jefferson in Notes on Virginia\n \n \n12. By \"celebrating diversity\", brainwashed whites are bringing the Hispanic and Asian peoples into a once White America, and we will cause the North American continent to become like the South American continent. The great wealth and stable society of white America will be traded for the poverty and instability of the revolution-torn countries south of our border.\n \n\n Now it gets interesting, as you throw in Asians where you have neglected to mention them previously. The reason for this is apparent, as Asians in the US have higher per capita income levels, test higher, get into better colleges, and otherwise outperform white people. In other words, they present a direct refutation to most of what you say above.\n\n\n \n You are wrong on two counts - one, most of the Asians that move to America are the \"cream of the crop\" who come to America for two reasons: to get a solid education and make money.\n \n Which raises the question: Why can't they make money and get solid educations in their own countries? Because their countries are ravaged by poverty and are places that are far less desirable to live in than Europe or North America.\n \n \nEven in Asia, for most of history China was more advanced than Europe, and Asians have shown a remarkable ability to overcome white perpetuated oppression (Japan's incredible leap in technology during the Meiji restoration, Vietnam handing the US its only loss in war, to name a few).\n\n \n The Japanese have proven themselves to be very adept at mimicking technology that was invented by Whites.\n \n Vietnam in no way \"defeated\" America - did the Americans surrender and sign a treaty with the Vietnamese? Did the Vietnamese overwhelm the American forces? Of course not. The America military realized that Vietnam was not worth the mounting casualities, so they just left. I would be willing to wager that as many as four times the quanitity of Vietnames soldiers died compared to the American casualties.\n \n \nSecond, if you want to redraw the racial boundary lines in america to where they once were prior to racial mixing, you'd have to get rid of Texas, California, and all of the American southwest. Notably, these areas are doing fine even with a starting population of non-whites.\n\n \n California is in a state of economic crisis and the whites have been leaving in droves. The people in the states that you mention are being hit hard by the costs associated with mass immigration. Not to mention that the Hispanics have created urban slums in cities like Houston, San Antonio, Los Angeles, etc.\n \n \n13. Even if all races were exactly the same, if there were no differences whatsoever, the fact that whites created the nation of America means that we are completely within our honorable rights to restrict entrance into our country. We may ethically allow only white immigrants, or no immigrants at all.\n \n\n Actually, I'm a cosmopolitan so I don't think we have the right to restrict immigration period, from a moral standpoint. From a legal standpoint, such an action is precluded by our own 14th amendment.\n\n\n \n Well, I am a nationalist and I feel that each nation has the moral obligation to secure its borders and to allow entry only to those people deemed fit by the government.\n \n If there were no borders, the Third Worlders would sweep into the West and the White Race would go the way of the dinosaurs.\n \n \n \n 14. The number of whites, as a percentage of world population, is now down into the single digits and falling fast.\n \n\n So? For the most part the growth is in Asia, who as I noted earlier are outperforming whites. So they have, under your logic, \"every right\" to replace \"inferior\" white people.\n\n\n \n You may not care about the existence of white people as a race, and you may be white yourself, but I am a white man and I will do everything in my power to prevent the West from becoming a part of the Third World.\n \n \n \n15. Nearly all of the white nations on earth are now accepting large numbers of non-white immigrants. The only one of the three major races of earth that is in real danger of falling into a minority status in its own racial home is the white race. This could easily lead to extermination of the white race. Will you just stand idly by?\n \n\n For the record, the white homeland is Europe not America. But in any event, in light of above arguments I'm not worried about any catastrophe.\n\n\n \n White European pioneers settled America and we won ownership of this land by right of conquest. The Indians were soundly defeated on the battlefields. This is our land now and we will do everything we can to preserve its White character. We will struggle like the Indians before us, and God willing, we will win.\n \n \n16. Those who support American \"diversity\", non-white immigration, miscegenation, integration, and/or affirmative action, are either: 1) ignorant of the above critical facts; or 2) blatant haters of the white race and its civilization, and would not be troubled if Whites ceased to exist on planet Earth.\n \n\n Or perhaps 3) we know the flaws in your analysis which cause it to fall.\n\n\n \n I think I have shown that there are few, if any, flaws in my post. Not a single one of my 16 points have been rebutted.\n \n \nA few notes of my own. I think that race in of itself is a fictive construct. Race obviously isn't just the color of my skin (I'm white-skinned, but my ethnicity would remain the same if I painted myself brown). If anything, what we refer to as \"white\" can really be said to refer to the Indo-European ethnic grouping, which includes most of Europe (Finland and the Basques are prominent exceptions). In that respect, I'm NOT \"white\" as I'm Jewish and therefore Semetic (a distinct ethnic group wholly unrelated to Indo-Europeans, however the root of their own religion). On the flip side, I wonder if Siegfriedson would classify Uighers as \"white.\" They have pale skin, and tend towards blue eyes. Oh, and the live in Western China (near Tibet), are predominantly Muslim, and are more closely related to Mongols then Europeans (with the exception of the Finns, who are part of the same ethnic group). \"Race\" itself seems to be a story that we tell ourselves to create an \"other\" that we can oppress without guilt. Sometimes the Other is someone of another religion, or skin color, or sometimes a nationality. Always it is used to seperate the \"ins\" from the \"outs\" with the purpose, explicit or implicit, to facilitate the domination of the latter by the former. Race is actually one of the clearest examples of the fallacy in this logic, some who look \"white\" (really: Indo-European) aren't, such as Jews or Finns, others who don't look \"white\" actually are Indo-European (Indians, to take the obvious example). Yet I bet we'll never hear Siegfried talk about the innate inferiority of the Finns (how could he? they have one of the highest standards of living in the modern world) or proclaim Indians to be part of his racial brethren.\n\n \n Response to this paragraph in my next post (below)", 
   {}, 
   56020, 
   null, 
   1089076980.0
  ], 
  [
   56724, 
   null, 
   "Siegfriedson", 
   "http://4forums.com/political/showthread.php?t=2688", 
   {}, 
   56720, 
   null, 
   1089077520.0
  ], 
  [
   56731, 
   null, 
   "dsadevil", 
   "The ancestors of white Americans were settlers and pioneers. When they arrived here during the 16th-19th centuries, America was a practically empty land that Whites settled and built up. They erected cities, paved streets and highways, laid down railroad tracks, constructed bridges, farmed the land, and built factories and industry. Whites brought European culture to a wilderness devoid of civilization.\n \n In any case, immigrants originally settled every nation in the world - why is America any different? Furthermore, America is no longer an empty continent. We are a crowded country of 290 million people that must deal with problems like sprawl, pollution, and disappearing forests and open space. Worst of all, the percentage of Whites in this country has been plummeting and shows no signs of reversal. \n\n Practically empty? Kind of an arbitrary assessment, but I think the population number is higher than you probably have been taught (most textbooks claim the native american population was 1 million, but most historians now believe the number is closer to 20 million). There was a \"civilization\" (again, the Iriquois Federation, the Mississippi Valley Empire which succumbed to European diseases prior to being discovered by whites (this is the origin of the mysterious mounds one finds in the midwest), and of course the Aztecs, Mayans, and Incas), just not European civilization.\n \n \nYour condescending toward the Founding Fathers, some of the finest men that Western Civilization ever produced, is disturbing. \"Venerable old people\"? In order for America to remain America, we must constantly strive to adhere to the standards set by the Founding Fathers in America's earliest decades. They should not simply be dismissed with a wave of the hand under the false belief that we have \"evolved\", as you say.\n \n You call this a response? People aren't right, IDEAS are right. Where the founding father's had the right idea, I'd agree with them, where they didn't I don't. While I like some part of the founders vision for America, I don't like others (the slavery kick many of them had, Jefferson's vision of a nation of small farmers, etc). Simply saying \"well, the founding father's said so\" isn't an argument, its an assertion.\n \n To the music args: When your sources conflict with each other, what am I supposed to believe? The ONLY pertinent passage I found in the second article was this beauty:\n \"Keane defined the uniqueness of the Celtic sound as having a strong rhythmic, tonal center. Its foundations he attributes to the ancient Moorish people, the North African empire. Along that line, Keane noted a connection between the Irish sound and linked it to a Spanish influence.\"\n Celtic music influences by arabs? Uh-oh, we're in trouble...\n \n \nIntegrated neighborhoods are ones where multiple races live in close proximity to each other. As a whole, white people (wisely) refuse to live in areas where they are the racial minorities. When that point is reached, they move to whiter areas. This is a sociological phenomenon known as \"white flight\".\n \n \n OK, cool. Then my perfectly integrated neighboorhood is doing perfectly fine. That probably can be attributed to the fact that I live in a wealthy neighboorhood. Many minorities live in poorer neighborhoods, which leads to the higher prevelance of crime. In areas such as mine, where both whites and non-whites live in relatively equal amounts of material wealth we have (wait for it) peace. Harmony. Huzzah.\n \n I could say the same thing about the school system. Income is by far a greater correlation to educational success than race is.\n \n \nI specified \"all great white societies\", not \"all great societies\", so your example of China is not valid. I would argue that ancient Rome was at its peak before expansion into Asia and Northern Africa and the extenstion of Roman citizenship to non-Romans. As for the USA being in a \"far superior geopolitical situation\" today, I disagree on many levels. Your example of America in its pre-Civil War days is actually a contradiction to your argument. Back in those days, Americans built all their own goods, and the government more closely followed the Constitution. America had nowhere to go but up - then the Civil War occurred. Today, America is in a lose-lose situation on many fronts.\n \n Actually, you didn't specify \"white\" at all. What said is (and I quote) \n \"All great societies of the past, which were white as they rose to power...\" \n All great societies includes China, so all that means is the second clause to your sentence is false, and China is a \"great society\" that disproves. As for the relative power of the US then vs now, your making false claims. First of all \"King Cotton\" in the south exported goods so we could import European manufactured goods, so we weren't self-sufficient yet. Second, if anything the courts were worse at following the constitution in that era (Barron v. Baltimore and Dred Scott rank pretty high on the bonehead list). Regardless of issues of equality or inequality, there was NOTHING in the constitution to suggest that free blacks couldn't be citizens. The decision in Dred Scott was blatant judicial activism. And of course, whereas today the US is the world superpower and most powerful nation on earth, in 1850 we were still well behind Europe and nothing all that special.\n \n \nThroughout 6,000 years of recorded history, the Black African Negro has invented nothing. Not a written language, weaved cloth, a calendar, a plow, a road, a bridge, a railway, a ship, a system of measurement, or even the wheel. (Note: This is in reference to the pure-blooded Negro.) He is not known to have ever cultivated a single crop or domesticated a single animal for his own use (although many powerful and docile beasts abounded around him.) His only known means of transporting goods was on the top of his hard burry head. For shelter he never progressed beyond the common mud hut, the construction of which a beaver or muskrat is capable.\n \n I could just quote Jared Diamond's \"Guns, Germs, and Steel\" about 15 times in response to this, or I could just recommend you read the book. Since I actually do recommend the book highly and would hope you'd read it, I'm just going to copy a few blurbs.\n Diamond's self-selected one sentence summary of his book is thus \"History followed different courses for different peoples because of differences among peoples' environments, not because of biological differences among peoples themselves.\" He then proves why it was geographical fluke as opposed to genetic predestination that whites overcame the other races. Take your own example of animal domestication. You claim that it is a demonstration of black inferiority b.c there are loads of docile beasts they could have domesticated. But if that's the case, why don't whites have Gazelle farms, exploiting their \"superior\" domestication skills to succeed where the blacks have failed? The answer is simple, no one, not white or black has ever managed to figure out how to herd an animal which runs over 40 miles per hour, can leap 20 feet high, and is easily startled. Similar problems abound for all other candidates for domestication in Africa, such as Zebras and Hippos. That's why even in Africa the only domesticated animals are european imports, like Cows and Horses. Ok, so now you ask why didn't blacks import these animals themselves? And again, Diamond provides the answer, pointing out that the geographical nature of Africa makes biological diffusion quite difficult. Its on a north-south axis for one, which means that the intercontinental climate varies much more than it does in Europe. It has at least two natural barriers to north-south diffusion, the Sahara Desert and the Tse-tse fly belt in middle africa. Both of these conditions halted the diffusion of Eurasian animals through Africa, retarding their political development. Again, read the book. It won the Pulitizer, and I highly recommend it. He also deals with all the issues you bring up and more (crop domestication, invention, diseases, language, etc).\n \n Fact #1: The Third World was infinitely better off (at least in a material sense and political sense) under white colonial rule.\n \n Fact #2: Thomas Sowell in his book Race and Culture gives many examples of ethnic minorities that have undergone persecution yet who have overcome it and have improved their living conditions and standards. The Jews are an example. Blacks in America, however, still lag behind whites in terms of health and they committ a highly disproportionate amount of crime.\n \n\n Your fact 1 is laughable. I don't believe the material part (who exactly controlled the new found wealth?), and I know the political part is untrue (unless you think that natives LIKE being oppressed?).\n Fact #2 is closer to the mark, but still off. Read some Critical Race Theorists to hear why. Of course, Jews are a Semetic people not a white people (and your...opinions?...of them are well known). And since in America we've constructed our hierarchies based on race (as opposed to religion or nationality), its been far easier for Jews and the Irish to rise up than blacks. This is b/c while Jews and the Irish have been admitted into the \"white\" catagory, blacks haven't. And yes, both Jews and the Irish were considered non-white for significant portions of our nation's history. More on that in Noel Ignitiev's book \"How the Irish Became White\"\n \n \n Fact #1: Though the empires of the Aztecs, Incas, and Mayans were relatively impressive, they were still primitive compared to European civilization when they were discovered (and easily conquered) by the Spanish.\n \n Fact #2: The Latin American countries with the highest living standards and that are strongest economically (Brasil, Chile, Argentina) have a white ruling class that is derived from Spaniard and German blood. \n\n I've already dealt with both of these. For the record, while white \"presence\" may be stronger in the country's I cite, they are no where close to \"pure,\" even in the \"ruling class.\"\n \n \nInterracial marriage and procreation (let's call it race-mixing) was extremely rare in America until recent times. Although it did happen, it was a taboo that was frowned upon. In fact, until recent decades, most states had laws prohibiting race-mixing. Indeed, although race-mixing has increased in America, most Whites still view it unfavorably (although they will not publicly say so for fear of being called \"racist\").\n \n Gregory Jay, Prof. of English at U. Wisonsin-Milwaukee: \"Scientists today agree that there is no such thing as \"race,\" at least when analyzed in terms of genetics or behavioral variation. Every human population is a mongrel population, full of people descended from various places and with widely differing physical qualities. Racial purity is the most absurd delusion, since intermarriage and miscegenation have been far more the norm than the exception throughout human ethnic history.  \"Race,\" then, is what academics like to call a \"socially constructed\" reality. Race is a reality in the sense that people experience it as real and base much of their behavior on it. Race, however, is only real because certain social institutions and practices make it real.\" \n \nYou are wrong on two counts - one, most of the Asians that move to America are the \"cream of the crop\" who come to America for two reasons: to get a solid education and make money.\n \n Which raises the question: Why can't they make money and get solid educations in their own countries? Because their countries are ravaged by poverty and are places that are far less desirable to live in than Europe or North America. \n\n I'd like some support as to the \"cream of the crop\" argument, and as to the second part, well, current events aren't being kind to your argument. Japan has managed to be an equal to the US for some times now, and many scholars believe that China is ascending as the next global superpower as it continues to develop.\n \n \n The Japanese have proven themselves to be very adept at mimicking technology that was invented by Whites.\n \n Vietnam in no way \"defeated\" America - did the Americans surrender and sign a treaty with the Vietnamese? Did the Vietnamese overwhelm the American forces? Of course not. The America military realized that Vietnam was not worth the mounting casualities, so they just left. I would be willing to wager that as many as four times the quanitity of Vietnames soldiers died compared to the American casualties. \n\n And they've surpassed us too, in many respects (esp. in info tech).\n As to the Vietnam War, victory isn't defined by a body count. Our objective was to stop Vietnam from becoming communist. Their objective was to make it communist. So in any real sense, they \"won\" because they met their objective and we didn't meet ours.\n \n \n Well, I am a nationalist and I feel that each nation has the moral obligation to secure its borders and to allow entry only to those people deemed fit by the government.\n \n If there were no borders, the Third Worlders would sweep into the West and the White Race would go the way of the dinosaurs. \n\n Considering that evolution occurs when a more fit species displaces a less fit species, your essentially saying whites are INFERIOR here. And nationalism is an illiberal tradition that flies in the face of most contemporary philosophy (esp. of the west, cite JS Mill, John Rawles, Martha Nussbaum, Robert Nozick, et al).\n \n \nCalifornia is in a state of economic crisis and the whites have been leaving in droves. The people in the states that you mention are being hit hard by the costs associated with mass immigration. Not to mention that the Hispanics have created urban slums in cities like Houston, San Antonio, Los Angeles, etc. \n\n And yet California remains the 5th largest economy in the world, so it must be doing SOMETHING right...\n \n \nYou may not care about the existence of white people as a race, and you may be white yourself, but I am a white man and I will do everything in my power to prevent the West from becoming a part of the Third World.\n \n I'm white, I'm semetic, I'm male, I'm western, I'm a marylander, I'm an American, I'm a Russian, I'm a Pole, I'm a German, I'm an Austrian, I'm Jewish, I'm a democrat, I'm an independent and above all...I'm human. How bout them apples?\n \nWhite European pioneers settled America and we won ownership of this land by right of conquest. The Indians were soundly defeated on the battlefields. This is our land now and we will do everything we can to preserve its White character. We will struggle like the Indians before us, and God willing, we will win.\n \n Right of Conquest? I'm checking my constitution...but I don't see that one! Of course, you seem much less willing to defend \"right of conquest\" when the Israeli's \"conquered\" the Palestineans...but that's ok, that wasn't really a conquest anyway! Oh, and the next time I'm in town, I'll bust down your door with a M-16 and \"conquer\" your living room. I wonder how the courts will take that defense...right of conquest, honestly!\n \n As to the race as construct arguments, well, the science is in and again, differences according to race are actually smaller than those within racial catagories. Plus the fact that \"who is of what race\" is an arbitrary distinction, read the Jay analysis above. Nothing of my \"race as construct arg\" has been refuted here, there, or anywhere.\n \n Cheers,\n DSA", 
   {}, 
   56724, 
   null, 
   1089082020.0
  ], 
  [
   56755, 
   null, 
   "apathy", 
   "1. The white race laid the foundations of America.\n \n 2. In the eyes of America's founders, only Whites could be \"Americans\". Therefore, American heritage is White heritage.\n\n \n That was the opinion of SOME of the whites in power, SOME of the founding fathers.\n \n \n3. American law, religion, art, music, and culture in general is based upon concepts from White European thought.\n\n \n Maybe the art and culture YOU have seen. This means you haven't gotten out much.\n \n \n4. The American all-white neighborhoods of the past were demonstrably cleaner, safer, and freer of crime than the trendy \"integrated\" neighborhoods of today.\n\n \n 5-points, bronx, AL Capone's chicago?\n \n \n5. The American all-white public schools of the past were clearly superior to any trendy \"integrated\" school of today.\n\n \n The crappiness of our public school system has little to do with the fact that it has been integrated. It has MUCH to do with poor management and NO MONEY! We can't pay decent teachers and we can't build decent schools anymore. Maybe it's because the white politicians in power are too corrupt to allocate enough money to schools because they are busy greasing palms.\n \n \n6. All great societies of the past, which were white as they rose to power, allowed their original ethnic make-up to be altered, and they fell permanently into decay (for example, Egypt).\n\n \n You didn't learn about Nubia? A Rival civilization to Egypt? They had monuments and just a rich a culture as egypt and were black. Also, they conquered Egypt a few times and the king was Nubian (black).\n \n edit: Wait, I just noticed that you said the Egyptians were white! That is pretty funny.\n \n \n \n7. Racial integration of our neighborhoods and our schools has forced them into decay. It is clear beyond any debate that modifying the racial composition of America away from a dominantly white society towards a mixed, \"racially-diverse\" society will be catastrophic. It will plunge the great American nation of Washington and Jefferson into the same depths that the other formerly great white nations of the past have fallen into.\n\n \n This is an opinion and is far from fact. If you do see any \"decay\" it's usually because of gangs. Gangs come in all colors.\n \n \n8. Based upon the extensive history of the black race it is clear that it is not capable of creating or maintaining an advanced society. It has never created one advanced society in Africa (ancient Egypt was not created by blacks). In every case (such as Haiti) where they have been given a thriving society, blacks have killed it, driving it into the same primitive state that their people have always lived in (in their native Africa). For any who is foolish enough to doubt history, we have the sad spectacle of South Africa playing out before us, which should erase all doubts.\n\n \n So the white race did very well in Russia, Yugoslavia, (the rest of the baltics for that matter)?\n \n \n9. History and present events have shown us that the black race cannot create or maintain an advanced society on its own (look at black neighborhoods and cities). Its members, therefore, cannot fit well into an advanced society, living and working beside those who not only are capable of building one advanced society, but have built numerous such societies in all climates and in all types of land.\n\n \n Now I know that you do not get out much (or live in Idaho).\n \n \n10. History has shown us that the mestizo Hispanic peoples, being of mixed (mostly) Indian, Negro, and a little Spaniard blood, are also deficient in creating advanced societies like the white race has repeatedly created. While they have shown ability that is superior to the black race, they have not been able to utilize the superior natural resources of Central America and the South American continent.\n\n \n This has sh*t to do with \"race\" and everything to do with culture, climate, trade, history, wars, etc. Just because they didn't plunder the land and kill off all the natives (only most) and dig up beautiful countryside so they could put in a superhighway doesn't mean they haven't created a modern society.\n \n \n \n11. Spain and Portugal sent soldiers to the lands south of the Rio Grande to conquer and take the wealth of the land. Instead of sending families to colonize, the Spanish men took native wives. The racial makeup of the lands south of the Rio Grande is composed of American Indian, black, mixed-race and a small percentage of Whites thrown in. Their lands have never thrived like the nations to the north where Whites colonized and kept their race in tact, seldom mixing their race with Indians and blacks.\n\n \n You are making connections that do not exist. The fact that countries never became military and economic superpowers has nothing to do with \"race.\"\n \n \n \n12. By \"celebrating diversity\", brainwashed whites are bringing the Hispanic and Asian peoples into a once White America, and we will cause the North American continent to become like the South American continent. The great wealth and stable society of white America will be traded for the poverty and instability of the revolution-torn countries south of our border.\n\n \n All the asians I see (and i see A LOT) work their tails off and are highly productive. All the latinos I see (and I see A LOT) are all busting their humps to get by, just like the rest of us. The reasons why OUR country is prosperous today is because it was stable enough (after the civil war) and open enough for large corporations to take hold and build wealth from the wide-open land in a major way. All the immigrants that came right after that formed the near slave-labor work force living in slums and dying young, so that you and I can live in the suburbs today. The immigrants were mostly white and lived in ghettos and slums. Do these resemble the modern-day deteriorating neighborhoods you were referring to?\n \n \n13. Even if all races were exactly the same, if there were no differences whatsoever, the fact that whites created the nation of America means that we are completely within our honorable rights to restrict entrance into our country. We may ethically allow only white immigrants, or no immigrants at all.\n\n \n The people that were considered \"founding fathers\" were white. They were in charge. That doesn't mean that they \"created the nation.\" It just means they formed the basis for the government (during and after the genocide of the native americans, pretty civilized).\n \n \n14. The number of whites, as a percentage of world population, is now down into the single digits and falling fast.\n\n \n Well, we'd better get to screwing. And making families of 12 kids so we can be on welfare and live in the trailer park with the rest of the white trash. Then we'll win.\n \n \n15. Nearly all of the white nations on earth are now accepting large numbers of non-white immigrants. The only one of the three major races of earth that is in real danger of falling into a minority status in its own racial home is the white race. This could easily lead to extermination of the white race. Will you just stand idly by?\n\n \n What the hell is a \"race.\" When you can define what a race is, then we can start talking about whether a race is going to die out or not. If all the colors blended together then there would only be one \"race\" for you to complain about, you're own.\n \n \n16. Those who support American \"diversity\", non-white immigration, miscegenation, integration, and/or affirmative action, are either: 1) ignorant of the above critical facts; or 2) blatant haters of the white race and its civilization, and would not be troubled if Whites ceased to exist on planet Earth.\n\n \n You ARE from Idaho! :)", 
   {}, 
   55025, 
   null, 
   1089127200.0
  ], 
  [
   56756, 
   null, 
   "apathy", 
   "Yes, in fact it is wrong to be proud of being white. Your race is not an accomplishment but an accident of birth. Now to be proud of your culture, its history and its traditions is another matter. This is the central point that the \"master race\" types don't get. You have no claim on the accomplishments of others simply because you share some physical trait. Furthermore, the perceived shortcomings of your culture are not transmitted genetically to succeeding generations. \n \n This delusion is not the exclusive property of any one race. People from all races and cultures are capable of embracing bigotry and do.\n\n \n You can be proud to be whatever. Whether you had control over the thing you are proud of has no bearing on whether you can be proud of it or not. \n \n It can merely be a matter of self-respect.", 
   {}, 
   55204, 
   null, 
   1089127440.0
  ], 
  [
   56757, 
   null, 
   "apathy", 
   "When I and other white racialists ....\n\n \n I think the term is \"racist.\"", 
   {}, 
   55280, 
   null, 
   1089127620.0
  ], 
  [
   56758, 
   null, 
   "apathy", 
   "Warrant? Latino peoples had no less than three major empires in latin america prior to Columbus (Aztec, Inca, Mayan). Keeping in mind the above notes re: oppression as a handicap, and the geographical advantages Eurasia had over the New World, the latino peoples have done pretty well for themselves and have strong societies in Chile, Argentina, Brazil, Cuba, and Costa Rica, to name a few.\n\n \n hehe, the native peoples of central and south america were NOT LATINO :)\n latino, of course, coming from latin, coming from the romantic language speaking countries of Spain and Portugal.", 
   {}, 
   55975, 
   null, 
   1089127980.0
  ], 
  [
   56759, 
   null, 
   "apathy", 
   "\n Well, I am a nationalist and I feel that each nation has the moral obligation to secure its borders and to allow entry only to those people deemed fit by the government.\n\n \n Hitler was a great nationalist. He agreed with you completely.", 
   {}, 
   56758, 
   null, 
   1089128640.0
  ], 
  [
   56764, 
   null, 
   "bmans301bIMBACK", 
   "Yes, in fact it is wrong to be proud of being white. Your race is not an accomplishment but an accident of birth. Now to be proud of your culture, its history and its traditions is another matter. This is the central point that the \"master race\" types don't get. You have no claim on the accomplishments of others simply because you share some physical trait. Furthermore, the perceived shortcomings of your culture are not transmitted genetically to succeeding generations. \n \n This delusion is not the exclusive property of any one race. People from all races and cultures are capable of embracing bigotry and do.\n\n \n \n Are you kidding me? Since when is it \"wrong\" to be proud that you are white? It is not an accident of birth. Obviously you didn't choose to be white or black (your parents decided that). However, if you are happy that you are white or black, you have the right to be proud of it. It is not racist to be proud that you are white. Now on the other hand saying only white people are good and they are the \"best\" race is different. Your statement that it is wrong is completely idiotic and I hope I never hear someone say that again. Please, enlighten me...you're not white are you? If you are, are you racist towards other whites?", 
   {}, 
   55204, 
   null, 
   1089131280.0
  ], 
  [
   56765, 
   null, 
   "Waxy", 
   "Are you kidding me? Since when is it \"wrong\" to be proud that you are white? It is not an accident of birth. Obviously you didn't choose to be white or black (your parents decided that). However, if you are happy that you are white or black, you have the right to be proud of it. It is not racist to be proud that you are white. Now on the other hand saying only white people are good and they are the \"best\" race is different. Your statement that it is wrong is completely idiotic and I hope I never hear someone say that again. Please, enlighten me...you're not white are you? If you are, are you racist towards other whites?\n\n \n With insightful lucid thinking like this, I'd say you're a shoe-in for the Reps in 2020. :p\n \n Waxy", 
   {}, 
   56764, 
   null, 
   1089131460.0
  ], 
  [
   56766, 
   null, 
   "bmans301bIMBACK", 
   "With insightful lucid thinking like this, I'd say you're a shoe-in for the Reps in 2020. :p\n \n Waxy\n\n \n \n Yes, I know that. I'm already working on my platform and getting the campaign funds.", 
   {}, 
   56765, 
   null, 
   1089131820.0
  ], 
  [
   56768, 
   null, 
   "Waxy", 
   "Yes, I know that. I'm already working on my platform and getting the campaign funds.\n\n \n Excellent. The Reps need some youth with new ideas and drive. \n \n Let me know when you get set up, I'll send you a donation.\n \n Waxy", 
   {}, 
   56766, 
   null, 
   1089132240.0
  ], 
  [
   56772, 
   null, 
   "bmans301bIMBACK", 
   "Excellent. The Reps need some youth with new ideas and drive. \n \n Let me know when you get set up, I'll send you a donation.\n \n Waxy\n\n \n \n I'll get the job done. No doubt about that. Maybe you can head my Campaign Finance Committee?", 
   {}, 
   56768, 
   null, 
   1089133260.0
  ], 
  [
   56775, 
   null, 
   "Phunting", 
   "Obviously you didn't choose to be white or black (your parents decided that). \nThey did. Cool I didn't know we got a choice. I'm white and so is my girlfriend but I think we'll choose to have a black kid actually.\n \n \n \nHowever, if you are happy that you are white or black, you have the right to be proud of it. It is not racist to be proud that you are white. Now on the other hand saying only white people are good and they are the \"best\" race is different. \nBut the colour of your skin is meaningless. It is one thing to be proud to be British (or a Yank if you lean that way) but to be proud of being 'white' means nothing. It's like being proud of having brown hair.\n \n \n \nYour statement that it is wrong is completely idiotic and I hope I never hear someone say that again. Please, enlighten me...you're not white are you? If you are, are you racist towards other whites?\nWhile I wouldn't agree that it is racist to be proud to be white, I can understand the point. And don't think it is idiotic at all.", 
   {}, 
   56764, 
   null, 
   1089136260.0
  ], 
  [
   56776, 
   null, 
   "sinjin", 
   "Are you kidding me? Since when is it \"wrong\" to be proud that you are white? It is not an accident of birth. Obviously you didn't choose to be white or black (your parents decided that). However, if you are happy that you are white or black, you have the right to be proud of it. It is not racist to be proud that you are white. Now on the other hand saying only white people are good and they are the \"best\" race is different. Your statement that it is wrong is completely idiotic and I hope I never hear someone say that again. Please, enlighten me...you're not white are you? If you are, are you racist towards other whites?\n\n \n What's idiotic is thinking your parents chose to be white any more than you did. It would be fair to feel fortunate to be born white given history and present circumstances as well.\n \n To be racist you must consider a race superior, usually your own. Once again, I'm nearly all white. BTW, you'll have to wait sixteen years for your presidential bid genius, not fifteen.", 
   {}, 
   56764, 
   null, 
   1089136680.0
  ], 
  [
   56778, 
   null, 
   "bmans301bIMBACK", 
   "They did. Cool I didn't know we got a choice. I'm white and so is my girlfriend but I think we'll choose to have a black kid actually.\n \n \n But the colour of your skin is meaningless. It is one thing to be proud to be British (or a Yank if you lean that way) but to be proud of being 'white' means nothing. It's like being proud of having brown hair.\n \n \n While I wouldn't agree that it is racist to be proud to be white, I can understand the point. And don't think it is idiotic at all.\n\n \n There are really only 2 things that upset me in this world. One is ingorant people. The other is dumb people. I think you fall into both categories. \n \n I didn't say parents choose the color of the kid (if you read, you will find that out). I said they decide that, meaning their color determines the color of the child. By the way, it is spelled C-O-L-O-R. There is no \"U\" in the word. The color of your skin is not meaningless. \n \n \" It's like being proud of having brown hair.\"\n That comment made you look like a complete XXXXX. If you think it's wrong or immoral to be proud of being white, then you must also think it's the same if you say you're proud you have brown hair? Read what you're typing before you submit it; it will save you a lot of humiliation. Hey I have brown hair and I'm proud of it!!! I am now wrong for thinking that, at least according to you. Is it ok for blacks to be proud they're black? According to you it should be wrong. If they want to be proud they're black, then so be it. I have no problem with that. I am very happy and proud that I am white. Sorry to offend you with that comment :)\n \n How does being proud to be white mean nothing? I want to hear your interpretation of that.", 
   {}, 
   56775, 
   null, 
   1089137640.0
  ], 
  [
   56780, 
   null, 
   "bmans301bIMBACK", 
   "What's idiotic is thinking your parents chose to be white any more than you did. It would be fair to feel fortunate to be born white given history and present circumstances as well.\n \n To be racist you must consider a race superior, usually your own. Once again, I'm nearly all white. BTW, you'll have to wait sixteen years for your presidential bid genius, not fifteen.\n\n \n \n Sorry to tell you this, but you also fit the description of the 2 things I despise: ignorance and stupidity. Do you actually think that someone in this world believes that you choose the color of your children? \"No Barbara, I don't like the green one. I'll take the brown one.\" Look closer at my post and you will read that the parents decide, meaning they determine (not by personal choice) by the color of their skin what the child will look like. Common sense (or lack thereof...hint hint), I'm not sure what to call it in your case (probably ignorance and/or stupidity), would obviously point out that one doesn't necessarily pick out what color their kid will be. Put 2 and 2 together and you will realize that 2 whites will probably have a white kid, 2 blacks a blacks kid, and 1 white and 1 black a mixed kid. It's not too hard.\n \n I suggest that you go back and retake a reading course (I think you just read things you want to see and put your own info in there and pretend that the other person said it). Once again (the stupidity issue), I quote myself \"I just have one quick comment/concern before I expose my plan on a new tax system which will one day make me President (I'll have to wait 15 years until I am eligible to run).\" Key word being ELIGIBLE. In 15 years I will be 35, making me \"eligible\" to run. Nowhere in there did I say I am running for election in 15 years. You would have been right if I said the election was in 15 years, which I didn't. So I suggest if you want to say that I was wrong, actually find something I really said to prove your point. And at that, they will be few and far between. Sorry to ruin your day :(", 
   {}, 
   56776, 
   null, 
   1089138900.0
  ], 
  [
   56781, 
   null, 
   "Waxy", 
   "There are really only 2 things that upset me in this world. One is ingorant people. The other is dump people. I think you fall into both categories. \n \n I didn't say parents choose the color of the kid (if you read, you will find that out). I said they decide that, meaning their color determines the color of the child. By the way, it is spelled C-O-L-O-R. There is no \"U\" in the word. The color of your skin is not meaningless. \n \n \" It's like being proud of having brown hair.\"\n That comment made you look like a complete XXXXX. If you think it's wrong or immoral to be proud of being white, then you must also think it's the same if you say you're proud you have brown hair? Read what you're typing before you submit it; it will save you a lot of humiliation. Hey I have brown hair and I'm proud of it!!! I am now wrong for thinking that, at least according to you. Is it ok for blacks to be proud they're black? According to you it should be wrong. If they want to be proud they're black, then so be it. I have no problem with that. I am very happy and proud that I am white. Sorry to offend you with that comment :)\n \n How does being proud to be white mean nothing? I want to hear your interpretation of that.\n\n \n YEAH!\n \n Let 'em have it. Fools.\n \n When are you going to run for mayor? \n \n Here's an idea for your campaign slogan I've been working on, I think it's a winner. \n \n Vote Brian Mansfield for mayor. He's white, and proud of it!\n \n Waxy", 
   {}, 
   56778, 
   null, 
   1089138960.0
  ], 
  [
   56782, 
   null, 
   "bmans301bIMBACK", 
   "YEAH!\n \n Let 'em have it. Fools.\n \n When are you going to run for mayor? \n \n Here's an idea for your campaign slogan I've been working on, I think it's a winner. \n \n Vote Brian Mansfield for mayor. He's white, and proud of it!\n \n Waxy\n\n \n \n That's interesting that the only thing you could come back with was an insult. Nothing to back it up. I guess you concede. I am assuming that you agree with me then, since you can find no fault in my argument? I know it may be hard to admit it, but it's ok that a 20 year old is smarter than you. Not everyone can say that they have an IQ of 165, but that's what separates the weak from the strong. So instead of typing sarcastic nonsense with no factual foundations, I suggest you respond with some comments so I can in turn respond to them. I have nothing to say to your snide remarks, except that the last sentence is true. I am white, and proud of it!!!! HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", 
   {}, 
   56781, 
   null, 
   1089139920.0
  ], 
  [
   56786, 
   null, 
   "sinjin", 
   " By the way, it is spelled C-O-L-O-R. There is no \"U\" in the word. \n \n\n \n A wordly guy with such a high IQ should know of spelling variations among English speaking peoples.\n \n And why such hostility towards anyone who disagrees with you? You won't make your way in politics calling your adversaries XXXXXX and XXXXXX.", 
   {}, 
   56778, 
   null, 
   1089141720.0
  ], 
  [
   56787, 
   null, 
   "Waxy", 
   "That's interesting that the only thing you could come back with was an insult. Nothing to back it up. I guess you concede. I am assuming that you agree with me then, since you can find no fault in my argument? I know it may be hard to admit it, but it's ok that a 20 year old is smarter than you. Not everyone can say that they have an IQ of 165, but that's what separates the weak from the strong. So instead of typing sarcastic nonsense with no factual foundations, I suggest you respond with some comments so I can in turn respond to them. I have nothing to say to your snide remarks, except that the last sentence is true. I am white, and proud of it!!!! HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n \n An insult? WHAT?\n \n I'm on board here. You're talking the truth.\n \n I'm no genius, I certainly don't have a 165 IQ. That's why we need people like yourself to stand up for what they believe in.\n \n I take it you don't think that slogan is a winner? Why not?\n \n Waxy", 
   {}, 
   56782, 
   null, 
   1089142380.0
  ], 
  [
   56792, 
   null, 
   "bmans301bIMBACK", 
   "It will be a winner. If you are too ignorant to understand that it's ok to be happy and cherish the fact you are a certain race, you shouldn't be allowed to vote. I am happy that blacks cherish their race and are happy to be black. The same is true for me...I am happy the way I am. The reason why I disagree with everyone and point out all their flaws is because I am a perfectionist (sometimes to the point of obsessive compulsive). If I see something wrong, I can't stand to look at it. That is what has got me through all of my schooling with As and is also what will make me a good politician. \n \n \n In America (the English language), we spell it color. Maybe if you're British, it is colour. But not here, not in the modern English language.", 
   {}, 
   56787, 
   null, 
   1089144360.0
  ], 
  [
   56809, 
   null, 
   "whistler", 
   "It will be a winner. If you are too ignorant to understand that it's ok to be happy and cherish the fact you are a certain race, you shouldn't be allowed to vote. I am happy that blacks cherish their race and are happy to be black. The same is true for me...I am happy the way I am. The reason why I disagree with everyone and point out all their flaws is because I am a perfectionist (sometimes to the point of obsessive compulsive). If I see something wrong, I can't stand to look at it. That is what has got me through all of my schooling with As and is also what will make me a good politician. \n \n \n In America (the English language), we spell it color. Maybe if you're British, it is colour. But not here, not in the modern English language.\n\n \n You might want to ask for your money back--I think your IQ test was flawed.\n \n Whistler", 
   {}, 
   56792, 
   null, 
   1089148440.0
  ], 
  [
   56813, 
   null, 
   "bmans301bIMBACK", 
   "You might want to ask for your money back--I think your IQ test was flawed.\n \n Whistler\n\n \n \n Really? I think I should call the SAT and ACT boards up too, their test results were probably wrong too, 1520 and 34 respectively. So I am pretty sure it's right. I didn't happen to have a 4.75 in high school and a 4.0 in college by chance. I have actually taken some IQ tests on the Internet just for fun, and got as high as 185, so sorry to tell you, but you're wrong. Good bye! emoticon_xgood \n \n \n P.S. Take one and let me know the score so I can make another mockey of you", 
   {}, 
   56809, 
   null, 
   1089149220.0
  ], 
  [
   56819, 
   null, 
   "whistler", 
   "Really? I think I should call the SAT and ACT boards up too, their test results were probably wrong too, 1520 and 34 respectively. So I am pretty sure it's right. I didn't happen to have a 4.75 in high school and a 4.0 in college by chance. I have actually taken some IQ tests on the Internet just for fun, and got as high as 185, so sorry to tell you, but you're wrong. Good bye! emoticon_xgood \n \n \n P.S. Take one and let me know the score so I can make another mockey of you\n\n If I told you, you wouldn't believe me.\n \n Whistler", 
   {}, 
   56813, 
   null, 
   1089149700.0
  ], 
  [
   56822, 
   null, 
   "bmans301bIMBACK", 
   "If I told you, you wouldn't believe me.\n \n Whistler\n\n \n \n Please, enlighten me", 
   {}, 
   56819, 
   null, 
   1089150300.0
  ], 
  [
   56831, 
   null, 
   "sinjin", 
   "Intelligence, knowledge and wisdom are three different things.", 
   {}, 
   56822, 
   null, 
   1089153060.0
  ], 
  [
   56835, 
   null, 
   "bmans301bIMBACK", 
   "Intelligence, knowledge and wisdom are three different things.\n\n \n \n So are grapes, pizza, and nuts. emoticon_xbouncer", 
   {}, 
   56831, 
   null, 
   1089155160.0
  ], 
  [
   56836, 
   null, 
   "SuperDutyHaulin", 
   "If were not supposed to associate pride with the color of skin, then why is ok for a mexican to have \"brown pride\" tattoed on his body?? I think that a white man with \"white pride\" would get some major grief for this, dont you?\n \n I understand that there really is no white, black, brown race. They are made up of many differnt cultures each and to their own. It would be more correct to say they have pride in their individual culture or upbringing. \n \n As far as I'm concerned, I have Irish pride, got it tattoed on my chest with the fighting Irishman, and a four leaf clover, and I'll step on any punk who makes a comment about it, dosn't matter what the race.", 
   {}, 
   56835, 
   null, 
   1089155940.0
  ], 
  [
   56839, 
   null, 
   "bmans301bIMBACK", 
   "If were not supposed to associate pride with the color of skin, then why is ok for a mexican to have \"brown pride\" tattoed on his body?? I think that a white man with \"white pride\" would get some major grief for this, dont you?\n \n I understand that there really is no white, black, brown race. They are made up of many differnt cultures each and to their own. It would be more correct to say they have pride in their individual culture or upbringing. \n \n As far as I'm concerned, I have Irish pride, got it tattoed on my chest with the fighting Irishman, and a four leaf clover, and I'll step on any punk who makes a comment about it, dosn't matter what the race.\n\n \n I totally agree. As long as you aren't claiming that your race is superior or another race is inferior, there should be no problem. If you are glad you are white, black, green, Asian, Irish or whatever else you may be, you should be able to have pride in that. Who decides that it is wrong to? I think it is up to the individual person, not someone else who decided that it's wrong.", 
   {}, 
   56836, 
   null, 
   1089156420.0
  ], 
  [
   56893, 
   null, 
   "Tastyfish", 
   "Think you'll find that despite your vast IQ you have still got it wrong...you parents may have determined your skin colour but they decide nothing when it comes down to genetics. Hence don't be suprised when people interpret your post in the way it was actually written.\n \n Thing is, the difference wiht white pride is that you are not going to get the grief from the statement itself (though I see it as still a fairly strange idea, especially a I am assuming that Haulin isn't actually Irish but American) but because of the actions of past white pride groups and of groups white pride groups have assocaited with (KKK, Nazis, biggoted thugs). It is just the same as the Irish pride or any other nationalism, you are saying I am part of a group and the same as them (the bit I disagree with). The white pride tatoo doesn't just say 'I am proud of being part of the white group' but also is a 'white pride pirde' tatoo that says 'I am proud of being part of the white pride group'.\n \n Other pride groups without the dark (or as dark) pasts get less hassle, but this isn't due to any kind of racism but based more off past behaviour.", 
   {}, 
   56839, 
   null, 
   1089197700.0
  ], 
  [
   56894, 
   null, 
   "Phunting", 
   "There are really only 2 things that upset me in this world. One is ingorant people. The other is dumb people. I think you fall into both categories.\nWhy thank you, at least I can see that your 'intelligence' hasn't impacted upon your manners. And your superiority is certainly confirmed by your misspelling of 'ignorant'\n \n \n \nI didn't say parents choose the color of the kid (if you read, you will find that out). I said they decide that, meaning their color determines the color of the child.\n Yes we all guessed what you meant, however your post did imply that they choose themselves, so I and a few others light-heartedly pointed this out. It's called humour (oh no, there I go again with my 'u's), glad you can take a joke.\n \n \n \nBy the way, it is spelled C-O-L-O-R. There is no \"U\" in the word. The color of your skin is not meaningless.\n Actually, no it isn't. I'm English, therefore I speak (and type) in English, not some bastardized Yankee version of the language.\n \n \n \n \n\" It's like being proud of having brown hair.\"\n That comment made you look like a complete XXXXX. If you think it's wrong or immoral to be proud of being white, then you must also think it's the same if you say you're proud you have brown hair? Read what you're typing before you submit it; it will save you a lot of humiliation.\nI will. Only if you agree to do the same. I never stated it was 'wrong or immoral', just meaningless. To be proud of your country I understand, because you can be proud of the culture and society in which you were brought up and in which you actually can work to support and improve. To be proud of something as arbitrary as your skin colour is daft.\n \n \n \nHey I have brown hair and I'm proud of it!!!\nActually, it wouldn't surprise me if you were.\n \n In the rest of your post you go on to repeatedly make the point that I'm wrong by being offended by proud whites, which is something I never said I was so I won't bother responding. In future, perhaps you could actually read and understand a post before posting insults, maybe it would stop you being banned quite so often...", 
   {
    "unicode_changes_made": true
   }, 
   56778, 
   null, 
   1089200880.0
  ], 
  [
   56895, 
   null, 
   "Phunting", 
   "In America (the English language), \n Yeah, silly me for thinking that the English language came from England. Gosh that's obviously because I didn't get all those 'A's at school.\n \n \nMaybe if you're British, it is colour.\nI am, it is.\n \n \n \nBut not here, not in the modern English language.\nWhere is 'here'? We are online, there is no 'here'. And the 'modern English language'? I speak the modern English language, you speak the US version of the modern English language.\n \n Personally I feel that the sign of true high IQ is using your supposed score to boast about it on internet forums and ask for other peoples scores to 'make another mockey (sic) of' them.", 
   {}, 
   56792, 
   null, 
   1089201240.0
  ], 
  [
   56906, 
   null, 
   "sinjin", 
   "Phunting,\n \n Thanks for the chuckle so early in the day. emoticon_xgood \n \n fondly,\n a Yankee bastard\n emoticon_xhoho", 
   {}, 
   56895, 
   null, 
   1089218880.0
  ], 
  [
   56922, 
   null, 
   "SuperDutyHaulin", 
   "\n \n Thing is, the difference wiht white pride is that you are not going to get the grief from the statement itself (though I see it as still a fairly strange idea, especially a I am assuming that Haulin isn't actually Irish but American) but because of the actions of past white pride groups and of groups white pride groups have assocaited with (KKK, Nazis, biggoted thugs). It is just the same as the Irish pride or any other nationalism, you are saying I am part of a group and the same as them (the bit I disagree with). The white pride tatoo doesn't just say 'I am proud of being part of the white group' but also is a 'white pride pirde' tatoo that says 'I am proud of being part of the white pride group.\n\n \n Yeah, I'm American, and from Irish desendants. I'm proud to be American to, but it does not mean I have to forget when my lineage came from. And what is this \"actions of past white groups\" What about Black and Brown groups the \"Gangs\" the crips the bloods, the mexican mafia(biggoted thugs as well!!)", 
   {}, 
   56893, 
   null, 
   1089228660.0
  ], 
  [
   56923, 
   null, 
   "bmans301bIMBACK", 
   "Yeah, I'm American, and from Irish desendants. I'm proud to be American to, but it does not mean I have to forget when my lineage came from. And what is this \"actions of past white groups\" What about Black and Brown groups the \"Gangs\" the crips the bloods, the mexican mafia(biggoted thugs as well!!)\n\n \n \n Once again I agree with you (you are one of the few that I agree with). As soon as something is done by a white person (although all other races do it or say it), we are racist. For example, blacks say nigger and its cool; whites say nigger and they're racist and they get shot. Blacks call whites crackers and it's \"cool\". A black guy gets beat by a white cop and it's racism. A white guy gets beat by a black cop and it's justified. \n \n Key word to everyone is \"PAST\" white groups. Obviously the KKK was around and white people were members. Many white people, such as myself, aren't proud to say that the members were white, however they were and people need to get over it. Almost all groups today are separated by color or race...ie NAACP, United Negro College Fund, \"Mexican Mafia\", BET, etc. Is it racist or discriminatory for blacks to have a channel dedicated to their own race and proud to have it because they're black? If whites had a channel called WET, you best believe that blacks all around the world would be furious. I don't see why they have to try to bring down everything good that white people do or have. If they can't have it, nobody can. And if they have it, nobody else can have it. I'm sorry to admit it, but that's how it often is.", 
   {}, 
   56922, 
   null, 
   1089230340.0
  ], 
  [
   57116, 
   null, 
   "4got2p", 
   "Yes, in fact it is wrong to be proud of being white. Your race is not an accomplishment but an accident of birth. Now to be proud of your culture, its history and its traditions is another matter. This is the central point that the \"master race\" types don't get. You have no claim on the accomplishments of others simply because you share some physical trait. Furthermore, the perceived shortcomings of your culture are not transmitted genetically to succeeding generations. \n \n This delusion is not the exclusive property of any one race. People from all races and cultures are capable of embracing bigotry and do.\n\n \n Climate is often the key to the type of success that a race enjoys. It is obvious that nations near the equator are of a more harsh climate. The wildlife and diseases that are common in the hotter climates are also far more deadly than in moderate climates. It is no wonder that technology and certain cultures seem to be the almost exclusive property of cooler climates. Races well adapted for the hot areas on our planet surely needed different survival skills than people living in places like Scotland. It isn't so much a race thing as it is a climate issue.", 
   {}, 
   55204, 
   null, 
   1089331260.0
  ], 
  [
   57123, 
   null, 
   "sinjin", 
   "Climate is often the key to the type of success that a race enjoys. It is obvious that nations near the equator are of a more harsh climate. The wildlife and diseases that are common in the hotter climates are also far more deadly than in moderate climates. It is no wonder that technology and certain cultures seem to be the almost exclusive property of cooler climates. Races well adapted for the hot areas on our planet surely needed different survival skills than people living in places like Scotland. It isn't so much a race thing as it is a climate issue.\n\n \n I believe there is merit to this idea although I would say that the \"harsher\" climate is in the cooler regions and that could have been the impetus for technology to make oneself more comfortable. Does that mean we agree or disagree?", 
   {}, 
   57116, 
   null, 
   1089333000.0
  ], 
  [
   57253, 
   null, 
   "Tastyfish", 
   "Yeah, I'm American, and from Irish desendants. I'm proud to be American to, but it does not mean I have to forget when my lineage came from. And what is this \"actions of past white groups\" What about Black and Brown groups the \"Gangs\" the crips the bloods, the mexican mafia(biggoted thugs as well!!)\n\n \n As I said, I think all racially based groups are a bit bizzare, so I include the gangs, mexican mafia as well as all the others. Its just that the white groups were part of a majority and were a lot more publisised. The question was 'why would a white pride tattoo get you major grief' and the answer is the actions of past white pride groups rather than purely the philosophy itself. In reality judging the modern white pride groups purely on the behaviour of past ones is just as bad as assuming that all whites are out to oppress everyone. However, as Seigfriedson is always so helpful to show us (especially if you check out the stormfront site as well) there is plenty of current actions we can judge them for as well.\n \n I strongly disagree with the idea of the black scholarships and am glad that they seem to be pretty much nonexistant here in the UK. Fair enough try to tackle the problem directly and have scholarships to those in poor urban areas so the result may almost be the same, but not purely on the basis of skin colour.", 
   {}, 
   56922, 
   null, 
   1089393420.0
  ], 
  [
   57312, 
   null, 
   "Rage", 
   "leviathan has identified reverse racism. there is really no reason why white people should not celebrate the accomplishments of their race, as black people do. and there is no reason why white people shouldnt showaces their culture, artforms and traditions that they are proud of. if being proud to be associated with your race makes you racist, then we are all racist. \n \n siegfried does have some issues of racial grudge though, and playing by his rules, id reply that white people brought this predicament upon themselves. white people took africans into america to do manual labor, and made them resident in the country. now that blacks, being resident, are a permanent fixture in the country to the point where the entire generation is influenced by black culture now more than ever, people with ideals like siegfriedson have something against it? id say its your fault. if you wanted to maintain a racially pure country, you should have thought about that before you displaced africans and other races from their native countries. \n \n and thanks to you white entrepreneurs exploiting black artform of hiphop, now all the white suburban kids are listening to rap music and absorbing the black culture even more. you shoulda thought about that in the first place. now you got little white kids speaking in ebonics and emulating the culture of the \"hood\".\n \n tough luck, but black culture is now a large part of the upcoming generation. youll just have to deal with it\n \n by the way, im black\n\n \n \n In respose to the middle of the post, you have to remember that the people alive today did not take blacks and enslave them. NOR were any of the blacks born in this country today enslaved (well, at least in this country.. it's always possible it occured elsewhere) All those people are long since dead, and to use that argument is to look a fool.\n \n and also, I might add, there are many reasons people could not be proud to be white. Think about it historically as well as present tense, and think about the role whites play. It paints an ugly picture. There are too many things to list, but one of the biggest things that could make me embarrassed to be associated with my race is that they have single-handedly destroyed more cultures than any other group. When I think of the founding of america, I get especially saddened. Think about what they did to the native americans. \n \n But, as always, I believe in judging each person by his or herself, so I suppose some of this isn't something I'd typically say. I feel people should be proud of who they are, not of history that might be associated with them. That's like taking credit due to someone else.\n \n I think more people would make themselves better people if they didn't just be proud to be american, or black, or white, or whatever, and made their own things to be proud of. I think it's lame.", 
   {}, 
   55216, 
   null, 
   1089411600.0
  ], 
  [
   57315, 
   null, 
   "SuperDutyHaulin", 
   "In respose to the middle of the post, you have to remember that the people alive today did not take blacks and enslave them. NOR were any of the blacks born in this country today enslaved (well, at least in this country.. it's always possible it occured elsewhere) All those people are long since dead, and to use that argument is to look a fool.\n \n and also, I might add, there are many reasons people could not be proud to be white. Think about it historically as well as present tense, and think about the role whites play. It paints an ugly picture. There are too many things to list, but one of the biggest things that could make me embarrassed to be associated with my race is that they have single-handedly destroyed more cultures than any other group. When I think of the founding of america, I get especially saddened. Think about what they did to the native americans. \n \n But, as always, I believe in judging each person by his or herself, so I suppose some of this isn't something I'd typically say. I feel people should be proud of who they are, not of history that might be associated with them. That's like taking credit due to someone else.\n \n I think more people would make themselves better people if they didn't just be proud to be american, or black, or white, or whatever, and made their own things to be proud of. I think it's lame.\n\n \n \n Sorry your ashamed to be white. However, humans are mamals, which in turn are animals...correct. I believe the animal world is set up so that the strong survive, that's basic animal instinct. Sorry, but thats how it is.", 
   {}, 
   57312, 
   null, 
   1089412140.0
  ], 
  [
   57317, 
   null, 
   "whistler", 
   "Sorry your ashamed to be white. However, humans are mamals, which in turn are animals...correct. I believe the animal world is set up so that the strong survive, that's basic animal instinct. Sorry, but thats how it is.\n\n No, that's not quite how it is. In nature the winners are those who reproduce and send their genes out at a prodigious rate.\n \n Whistler", 
   {}, 
   57315, 
   null, 
   1089412260.0
  ], 
  [
   57328, 
   null, 
   "manuel", 
   "siegfried does have some issues of racial grudge though, and playing by his rules, id reply that white people brought this predicament upon themselves. white people took africans into america to do manual labor, and made them resident in the country. now that blacks, being resident, are a permanent fixture in the country to the point where the entire generation is influenced by black culture now more than ever, people with ideals like siegfriedson have something against it? id say its your fault. if you wanted to maintain a racially pure country, you should have thought about that before you displaced africans and other races from their native countries.Whistler\n\n \n \n White people brought it upon themselves? Slavery ended a long, long time ago. Nobody around today had any direct ties to slavery or even experienced it, unless they're like 130 years old. Maybe siegfried does have some issues of racial grudge, maybe not. But if he does, he has the right to do so. He can think and feel however he wants about anyone. Who said he wanted to maintain a racially pure country? And it's his fault that blacks were enslaved? Maybe his great-great grandfather's, but not his. I think you just may hate white people. By the way, I am in the process of starting a WET (White Entertainment Channel) channel, similar to BET. I'm also working on the NAAWP.", 
   {}, 
   57317, 
   null, 
   1089414060.0
  ], 
  [
   57330, 
   null, 
   "Rage", 
   "Sorry your ashamed to be white. However, humans are mamals, which in turn are animals...correct. I believe the animal world is set up so that the strong survive, that's basic animal instinct. Sorry, but thats how it is.\n\n \n \n I have no idea why you write that in response to my particular post, but oh well.. and anyways, you're not seeing things right. Since when does \"civilized\" culture live in accordance to natures laws of survival? And also, the strong survive, yes, but one thing you'll NEVER see in nature is the systematic elimination of one species by another. Except, of course, man, because somewhere down the line we got the screwy idea that we were above such laws.\n \n (I realize of course that we're part of nature, but we in civilized culture aren't very natural anymore per se)\n \n Ya gotta love it.. we don't try and argue that we're not subject to the laws of gravity, but we think we're exempt from the natural laws of competition. \n \n As quoted from Ishmael... \"..any species that exempts itself from the rules of competition ends up destroying the community in order to support its own expansion.\" aka, the old give and take. if we take, then the rest of the natural world has to give. then we destroy things by taking too much.\n \n but I think I went too far on this one. I should just create a different thread ^^;; sorry.", 
   {}, 
   57315, 
   null, 
   1089414120.0
  ], 
  [
   57530, 
   null, 
   "Siegfriedson", 
   "The ancestors of white Americans were settlers and pioneers. When they arrived here during the 16th-19th centuries, America was a practically empty land that Whites settled and built up. They erected cities, paved streets and highways, laid down railroad tracks, constructed bridges, farmed the land, and built factories and industry. Whites brought European culture to a wilderness devoid of civilization.\n \n In any case, immigrants originally settled every nation in the world - why is America any different? Furthermore, America is no longer an empty continent. We are a crowded country of 290 million people that must deal with problems like sprawl, pollution, and disappearing forests and open space. Worst of all, the percentage of Whites in this country has been plummeting and shows no signs of reversal.\n \nPractically empty? Kind of an arbitrary assessment, but I think the population number is higher than you probably have been taught (most textbooks claim the native american population was 1 million, but most historians now believe the number is closer to 20 million). There was a \"civilization\" (again, the Iriquois Federation, the Mississippi Valley Empire which succumbed to European diseases prior to being discovered by whites (this is the origin of the mysterious mounds one finds in the midwest), and of course the Aztecs, Mayans, and Incas), just not European civilization.\n\n\n \n Assuming that there were 20 million Indians in America before the colonization period, that means that in the huge expanse that is North America, there was a total number of people that is equal to the population of the state of New York. In that case, yes, North America was \"practically empty\" when the Europeans began to arrive in sizable numbers.\n \n Whether the total number of Indians in pre-European America was 1 million or 20 million, it doesn't change the fact that Europeans won the ownership of this land the evolutionary way - by right of conquest. You think that just because the Indians were here first that they somehow have some uncontestable right to country? Study history, my friend, study history. Land only belongs to those strong enough to hold on to it. It may be an unpleasant reality, but a truthful one, nonetheless.\n \n In any case, more and more evidence is coming to light that white people started to arrive in North America around the time that the Indians were crossing the Bering Strait.\n \n Reference:\n \n http://www.white-history.com/hwr6b.htm\n \n http://www.friendsofpast.org/\n \n \nYour condescending toward the Founding Fathers, some of the finest men that Western Civilization ever produced, is disturbing. \"Venerable old people\"? In order for America to remain America, we must constantly strive to adhere to the standards set by the Founding Fathers in America's earliest decades. They should not simply be dismissed with a wave of the hand under the false belief that we have \"evolved\", as you say.\n \n \nYou call this a response? People aren't right, IDEAS are right. Where the founding father's had the right idea, I'd agree with them, where they didn't I don't. While I like some part of the founders vision for America, I don't like others (the slavery kick many of them had, Jefferson's vision of a nation of small farmers, etc). Simply saying \"well, the founding father's said so\" isn't an argument, its an assertion.\n\n\n \n What I simply wrote was, \"In order for America to remain America, we must constantly strive to adhere to the standards set by the Founding Fathers in America's earliest decades. They should not simply be dismissed with a wave of the hand under the false belief that we have \"evolved\", as you say.\"\n \n Claiming that I stated that \"\"well, the founding father's said so\" is a dishonest summary of the point I made.", 
   {}, 
   56731, 
   null, 
   1089605580.0
  ], 
  [
   57533, 
   null, 
   "Siegfriedson", 
   "To the music args: When your sources conflict with each other, what am I supposed to believe? The ONLY pertinent passage I found in the second article was this beauty:\n \"Keane defined the uniqueness of the Celtic sound as having a strong rhythmic, tonal center. Its foundations he attributes to the ancient Moorish people, the North African empire. Along that line, Keane noted a connection between the Irish sound and linked it to a Spanish influence.\" Celtic music influences by arabs? Uh-oh, we're in trouble...\n\n \n You stated, \"Both Jazz and Rock and Roll (and their derivitives) are black in origin\". I produced links to two articles that challenge that claim.\n \n \"A study into the roots of gospel music by an American professor has lead the accomplished musician, who has played with Duke Ellington and Dizzy Gillespie, to conclude that the \"good news\" music sung in black American churches originated from Scotland, not Africa.\n \n Professor Willie Ruff, of Yale University, said the roots of the music derived from evangelical spirituals and blues and jazz, had more to do with the crofters of the Outer Hebrides than slaves on US plantations.\"\n \n http://www.rense.com/general41/dehb.htm\n \n \"In an interview with this reporter, record producer and composer Brian Keane said, \"The Celtic influence is nothing new.\" Keane's most recent production was the sound track for Disney's \"Irish in America\" project and the \"Long Journey Home\" sound track. \"The most obvious Celtic influence,\" said Keane, \"was on America's Appalachian music. It evolved into bluegrass, country music, then certain types of rock and roll and folk sounds. The Scottish and Irish immigrants who settled those southern regions brought their music with them.\"\n \n http://www.underbridge.com/scathan/archive/1998/04_april/04.1998.celticmusic.html\n \n \nIntegrated neighborhoods are ones where multiple races live in close proximity to each other. As a whole, white people (wisely) refuse to live in areas where they are the racial minorities. When that point is reached, they move to whiter areas. This is a sociological phenomenon known as \"white flight\".\n \nOK, cool. Then my perfectly integrated neighboorhood is doing perfectly fine. That probably can be attributed to the fact that I live in a wealthy neighboorhood. Many minorities live in poorer neighborhoods, which leads to the higher prevelance of crime. In areas such as mine, where both whites and non-whites live in relatively equal amounts of material wealth we have (wait for it) peace. Harmony. Huzzah.\n\n\n \n The different races in America may very well \"tolerate\" each other, but they are certainly far from \"accepting\" one another as kinsmen or compatriots. America in no way is a \"melting pot\"; rather, it is more like a tossed salad in that it has been \"Balkanized\" thanks to forced racial integration. When left on their own, th races naturally self-segregate. One of the rules of nature is birds of a feather flock together, and human society is no exception. The best way to increase racial tension and conflict is to force the different races to live together.\n \n By the way, the example of \"your neighborhood\" is inadmissible as evidence in a debate because it is a hasty generalization. If you use your neighborhood as a justification for racial integration, I could very well say that in my neighborhood, the races act rudely and often violently towards one another, therefore racial integration is a bad idea.", 
   {}, 
   56724, 
   null, 
   1089608100.0
  ], 
  [
   57536, 
   null, 
   "Siegfriedson", 
   "I specified \"all great white societies\", not \"all great societies\", so your example of China is not valid. I would argue that ancient Rome was at its peak before expansion into Asia and Northern Africa and the extenstion of Roman citizenship to non-Romans. As for the USA being in a \"far superior geopolitical situation\" today, I disagree on many levels. Your example of America in its pre-Civil War days is actually a contradiction to your argument. Back in those days, Americans built all their own goods, and the government more closely followed the Constitution. America had nowhere to go but up - then the Civil War occurred. Today, America is in a lose-lose situation on many fronts.\n \nActually, you didn't specify \"white\" at all. What said is (and I quote) \"All great societies of the past, which were white as they rose to power...\" All great societies includes China, so all that means is the second clause to your sentence is false, and China is a \"great society\" that disproves. ...Regardless of issues of equality or inequality, there was NOTHING in the constitution to suggest that free blacks couldn't be citizens. The decision in Dred Scott was blatant judicial activism. And of course, whereas today the US is the world superpower and most powerful nation on earth, in 1850 we were still well behind Europe and nothing all that special.\n\n\n \n We're arguing over semantics here, but what I wrote was, \"All great societies of the past, which were white as they rose to power, allowed their original ethnic make-up to be altered, and they fell permanently into decay\" Therefore, I was not referring to China because obviously China was never predominatly White. I was referring to nations such as ancient Egypt, ancient India, Greece, Rome, etc.\n \n Regarding your commeny about blacks and the Constitution, the white, European character of the United States was actually enshrined in law. The first naturalization bill, passed in 1790, made citizenship available only to \"free white persons.\" The Supreme Court ruled in 1857 that no black, slave or free, could be a citizen of the United States. Blacks did gain U.S. citizenship under the post-Civil War amendments, but other races did not. State and federal laws excluded Asians, and in 1914 the Supreme Court upheld the principle that citizenship could be denied to foreign-born Asians.\n \n The ban on immigration and naturalization of Chinese, established in 1882, continued until 1943. It was only when the United States found itself allied with China in the Second World War that Congress repealed the Chinese exclusion laws - but not by much. It set an annual quota of 105 Chinese. Needless to say, it permitted no immigration from Japan. Until 1965, the United States had a \"national origins\" immigration policy designed explicitly to keep the country white.\n \n The writings and actions of America's founders reveal that they did not consider Blacks, Indians, or other non-Whites to be \"Americans\".\n \n \nThroughout 6,000 years of recorded history, the Black African Negro has invented nothing. Not a written language, weaved cloth, a calendar, a plow, a road, a bridge, a railway, a ship, a system of measurement, or even the wheel. (Note: This is in reference to the pure-blooded Negro.) He is not known to have ever cultivated a single crop or domesticated a single animal for his own use (although many powerful and docile beasts abounded around him.) His only known means of transporting goods was on the top of his hard burry head. For shelter he never progressed beyond the common mud hut, the construction of which a beaver or muskrat is capable.\n \nI could just quote Jared Diamond's \"Guns, Germs, and Steel\" about 15 times in response to this, or I could just recommend you read the book. Since I actually do recommend the book highly and would hope you'd read it, I'm just going to copy a few blurbs.\n Diamond's self-selected one sentence summary of his book is thus \"History followed different courses for different peoples because of differences among peoples' environments, not because of biological differences among peoples themselves.\" He then proves why it was geographical fluke as opposed to genetic predestination that whites overcame the other races. Take your own example of animal domestication. You claim that it is a demonstration of black inferiority b.c there are loads of docile beasts they could have domesticated. But if that's the case, why don't whites have Gazelle farms, exploiting their \"superior\" domestication skills to succeed where the blacks have failed? The answer is simple, no one, not white or black has ever managed to figure out how to herd an animal which runs over 40 miles per hour, can leap 20 feet high, and is easily startled. Similar problems abound for all other candidates for domestication in Africa, such as Zebras and Hippos. That's why even in Africa the only domesticated animals are european imports, like Cows and Horses. Ok, so now you ask why didn't blacks import these animals themselves? And again, Diamond provides the answer, pointing out that the geographical nature of Africa makes biological diffusion quite difficult. Its on a north-south axis for one, which means that the intercontinental climate varies much more than it does in Europe. It has at least two natural barriers to north-south diffusion, the Sahara Desert and the Tse-tse fly belt in middle africa. Both of these conditions halted the diffusion of Eurasian animals through Africa, retarding their political development.\n\n\n \n Before the arrival of Europeans, blacks had no written language and had not invented the wheel. While they lived in huts, Europeans lived in edifices that were far more advanced. Compare a castle or a cathedral to an African hut.\n \n Let me make a recommendation for you - The Origin of Races, by Professor Carleton Coon (1904-1981), President of the American Association of Physical Anthropologists and the premier geneticist of the world during his time, assembled massive evidence from geography, anatomy, genetics, physiology, comparative dentition, linguistics, archeology, and fossil records from 300 bone-bearing sites in Africa. According to Dr. Coon, while the Caucasoid subspecies (the White race) was evolving in Europe, the Negro race was standing still on the evolutionary plane and is today no less than 200,000 years behind the European in skull and brain development.\n \n Georg Wilhelm Friedrich Hegel wrote in his Philosophy of History:\n \n \nThe peculiarly African character is difficult to comprehend, for the very reason that in reference to it we must quite give up the principle which accompanies all our ideas - the category of Universality...Another characteristic fact in reference to the Negro is slavery...Bad as this may be, their lot in their own land is even worse, since a slavery there quite as absolute exists; for it is the essential principle of slavery, that man has not yet attained to a consciousness of his own freedom, and consequently sinks down to a mere Thing - an object of no value. Among the Negro the moral sentiments are quite weak, or more strictly speaking, non-existant. Parents sell their children and conversely children their parents, as either has the opportunity...the polygamy of the Negroes has frequently for its object the having of many children, to be sold, every one of them, into slavery...From these various triats it is manifest that want of self-control distinguishes the character of the Negroes. This condition is capable of no development or culture, and as we see them at this day, such have they always been...At this point we leave Africa, not to mention it again. For it is no historical part of the world, it has not movment or development to exhibit.\n", 
   {}, 
   57533, 
   null, 
   1089610860.0
  ], 
  [
   57554, 
   null, 
   "Tastyfish", 
   "Let me make a recommendation for you - The Origin of Races, by Professor Carleton Coon (1904-1981), President of the American Association of Physical Anthropologists and the premier geneticist of the world during his time, assembled massive evidence from geography, anatomy, genetics, physiology, comparative dentition, linguistics, archeology, and fossil records from 300 bone-bearing sites in Africa. According to Dr. Coon, while the Caucasoid subspecies (the White race) was evolving in Europe, the Negro race was standing still on the evolutionary plane and is today no less than 200,000 years behind the European in skull and brain development.\n\n OK lets make another recommendation, to pretty much ignore this guy, he was nowhere near the premier geneticist of his time for the simple reason that if he was he would know that there is practically no genetic difference between races and that saying skull devolpment is 'behind' is complete nonsense as far as evolution is concerned.\n \n As for Birds of a Feather flock together being a natural law, clearly no. Most large communites of organisms are made up of several species. Things staying on their own is not all that common and hardly an expected behaviour.\n \n Your science is hopelessly out of date.\n \n As for right of conquest, if you beleive this then why do you see a problem. if whites are being replaced then thats the way it goes or is a battlefield a special place? No idea how your logic is working on this front. \n \n What actually are you classing as white anyway?", 
   {}, 
   57536, 
   null, 
   1089633960.0
  ], 
  [
   57664, 
   null, 
   "apathy", 
   "Let me make a recommendation for you - The Origin of Races, by Professor Carleton Coon (1904-1981), President of the American Association of Physical Anthropologists and the premier geneticist of the world during his time, assembled massive evidence from geography, anatomy, genetics, physiology, comparative dentition, linguistics, archeology, and fossil records from 300 bone-bearing sites in Africa. According to Dr. Coon, while the Caucasoid subspecies (the White race) was evolving in Europe, the Negro race was standing still on the evolutionary plane and is today no less than 200,000 years behind the European in skull and brain development.\n\n \n Let me get this straight. The guy's name was Dr. Coon? emoticon_smile", 
   {}, 
   57554, 
   null, 
   1089677040.0
  ], 
  [
   57671, 
   null, 
   "apathy", 
   "siegfried does have some issues of racial grudge though, and playing by his rules, id reply that white people brought this predicament upon themselves. white people took africans into america to do manual labor, and made them resident in the country. now that blacks, being resident, are a permanent fixture in the country to the point where the entire generation is influenced by black culture now more than ever, people with ideals like siegfriedson have something against it? id say its your fault. if you wanted to maintain a racially pure country, you should have thought about that before you displaced africans and other races from their native countries.\n\n \n \nIn respose to the middle of the post, you have to remember that the people alive today did not take blacks and enslave them. NOR were any of the blacks born in this country today enslaved (well, at least in this country.. it's always possible it occured elsewhere) All those people are long since dead, and to use that argument is to look a fool.\n\n \n You have to remember that about 30 years ago, most of the U.S. was trying to struggle out of the last of the civil rights movement. Oppression of black people in this country did not end in 1865. It didn't even end in 1965. I think it's safe to say that in 2004, there is no more institutionalized discrimination (I hope), but that doesn't mean that a black person or his/her parents alive today didn't ever feel the weight of being second class citizens.", 
   {}, 
   57312, 
   null, 
   1089678840.0
  ], 
  [
   57701, 
   null, 
   "dsadevil", 
   "1) Mr. Ruff, though admittedly on staff at Yale, is not an academic, he's a musician. He may well be right on the origins of Jazz. To be honest, I don't care and to be honest I doubt he does either, as if you read up on his bio you'll find that he is enamored of such black musicians like Duke Ellington. Even if the original roots are scottish, I'd be careful about the implication of your own argument. If orginality is all that matters and development is considered meaningless (and SURELY you'll agree that modern jazz has been predominately co-opted by african americans), then Whites can't claim any credit for:\n Gunpowder (Chinese) and thus not guns, fireworks, cannons\n Writing (Sumerian) and thus Literature in general\n Our Mathematical System (Indian) and thus all sorts of stuff.\n The inconsistency in your argument is palpable. If I claim that it wasn't whites who invented something (say, writing), you'll come back and say that the greatest works of literature are white, even if l'orginal wasn't. On the flip side, if I say \"ok, jazz was invented by scots, but the greatest works were black,\" you'll say they are just good mimes.\n 2) Since the crux of your advocacy has been \"all good things are white,\" I assumed that the addition of \"which were white as they came to power\" was descriptive of great empires rather than a qualifier. If it WASN'T a qualifier, then I'm not quite sure what you're arguing, b/c China is a perfect example of a great non-white empire. So obviously it can happen. I should question whether or not you consider Indians to be \"White\" as they are \"Indo-European\" but obviously not white in skincolor. If they are white, that's cool, but then you should adopt a term that is actually descriptive of the whole catagory (say, \"Indo-European\"?) rather than one that only describes part.\n 3) I say: Nothing in Constitution justified Dred Scott. You respond with...1790 Naturalization Law. I'll give the audience 5 seconds to try and guess the problem here.\n Got it yet? THE 1790 NATURALIZATION LAW ISN'T IN THE CONSTITUTION! Its statutory law which means that it does not take precedence over the constitution. While statutory references are often used for interpreting the legislative history of a particular amendment, its never done for laws passed AFTER the amendment was ratified :). It certainly shouldn't have any bearing on case that asserted that blacks were CONSTITUTIONALLY barred from being considered citizens. All your constitutional analysis is essentially judicial activism, judges substituting their views (and vague notions about \"writers intent\") for the plain wording of what's in the text of the constitution.\n 4) What you don't point out about Prof. Coon is that he was forced to resign his position after his own body at the Academy decided to censure the views he held. Oops. In any event, he's outdated. Between a discredited dead guy and a pulitizer prize winning live guy, I'm not having too much difficulty. I find it compelling that you have yet to counter any of the specific quotes I have given by Professor Diamond. And as much as I respect the work of Mr. Hegel (especially his thesis/antithesis/synthesis formulation), racial studies are really out of his area of expertise. Interestingly enough the crystallization of racial catagorizations into their current formulation is a relatively new occurance. 16th century colonists didn't distinguish heavily between poor whites and blacks, the development of race codes was to come later. And to the extent that Europeans did think about Africa prior to the colonization stage, it was generally in positive terms (witness Timbuktu as a \"golden city\").\n 5) The use of \"my neighborhood\" is merely to prove the point that it is indeed possible for whites and blacks to live together happily. At the point where you make essentialized claims that X \"CAN'T\" happen and Y \"WILL\" result in bad things, all I need to do is point out counter examples where X happened and Y is going on fine. Dealing with the reality that whites and blacks CAN live together, and dealing with another reality that says they often don't, what needs to happen is an examinaton of what allows this mutual agreeabilty and what distinguishes the norm from the exception. Also, considering your dodgy use of statistics to try and prove black inferiority (which screams Causation/Correlation fallacy all over it), I'd be a bit more careful in calling out logical fallacies, neh?\n 6) The earliest documented Native-American presence in America (near Clovis NM) is dated 12,000 BCE. I'd be impressed if whites had shown up in America by then. Of course, if they had, you'd expect there descendants would have been met by European invaders, and since you hold that the environmental factors have NOTHING to do with cultural development, they'd have been met with white people holding guns and having a lively literary discussion. So why weren't they? Either a) they weren't there or b) they were there and were exterminated by the native americans, which, under your tortured logic, makes the native americans superior.\n 7) I swear, I keep looking through my con. law books and I can't find this \"right of conquest\" thing anywhere? That might be my fault, I could be just missing it. On the other hand, it might have something to do with the fact that a so-called \"right of conquest\" is absurd and undermines the idea of what a right is. The bare basics of rights were outlined by John Stuart Mill, and foremost amongst them was the right not to be aggressed against. Quite a jump there. Again, I'd love to see how a \"right of conquest\" defense plays out in court the next time you get robbed. Btw, who's superior, the Vandals or the Romans?", 
   {}, 
   57671, 
   null, 
   1089700140.0
  ], 
  [
   57978, 
   null, 
   "Siegfriedson", 
   "Interracial marriage and procreation (let's call it race-mixing) was extremely rare in America until recent times. Although it did happen, it was a taboo that was frowned upon. In fact, until recent decades, most states had laws prohibiting race-mixing. Indeed, although race-mixing has increased in America, most Whites still view it unfavorably (although they will not publicly say so for fear of being called \"racist\").\n \nGregory Jay, Prof. of English at U. Wisonsin-Milwaukee: \"Scientists today agree that there is no such thing as \"race,\" at least when analyzed in terms of genetics or behavioral variation. Every human population is a mongrel population, full of people descended from various places and with widely differing physical qualities. Racial purity is the most absurd delusion, since intermarriage and miscegenation have been far more the norm than the exception throughout human ethnic history. \"Race,\" then, is what academics like to call a \"socially constructed\" reality. Race is a reality in the sense that people experience it as real and base much of their behavior on it. Race, however, is only real because certain social institutions and practices make it real.\"\n\n\n \n Regarding the first point you made that I highlighted in bold, scientists such as Prof. Jay are being extremely dishonest when they claim that \"there is no such thing as race\". I have started a thread elsewhere dealing with this subject and I would welcome your comments:\n \n http://4forums.com/political/showthread.php?t=2688\n \n Regarding your second point, I think that any survey of human history will show that for the vast majority of human kind's existence on this planet, the various races have been remarkably isolated from one another. Race-mixing never took place on a large scale. Even today race-mixing is the extreme exception and not the norm.\n \n Of course I'm not saying that every White individual is 100% racially pure - of course there is a small minority of Whites who, although they seem white, actually possess 1/16, 1/32, 1/64 non-white blood. When the level of mixture is so small, it is not really even worth mentioning.\n \n A more relevant example is the black race in America - I have seen estimates that the average Black has 10-15% White blood. Malcolm X, for example, was 1/4 White.\n \n \nYou are wrong on two counts - one, most of the Asians that move to America are the \"cream of the crop\" who come to America for two reasons: to get a solid education and make money.\n Which raises the question: Why can't they make money and get solid educations in their own countries? Because their countries are ravaged by poverty and are places that are far less desirable to live in than Europe or North America.\n \n\n I'd like some support as to the \"cream of the crop\" argument, and as to the second part, well, current events aren't being kind to your argument. Japan has managed to be an equal to the US for some times now, and many scholars believe that China is ascending as the next global superpower as it continues to develop.\n\n\n \n My proof for the \"cream of the crop\" Asian immigration phenomenon is the fact that it takes a lot of money for Asian families to move to America and to send their kids to school here. Therefore, only the richest families can afford to better themselves using Western economies and institutions. When they do immigrate to America, the Asians (Indians, Orientals) usually outperform the native students in school and acquire high-paying jobs. Contrast this pattern with the fact that Asia is nearly as poor as Africa - countries like India, China, Vietnam, Pakistan, etc are horribly impoverished. If their entire populations were as intelligent and skilled as the workers they export here, then clearly these countries would not be wallowing in poverty.\n \n Additionally, for many years now traitorous American and European corporations have been offshoring hundreds of thousands of jobs to Third World Asia, yet despite this assistance, Asia still remains a poor land with living standards far below those of the West.\n \n Regarding your observation about China and Japan, I will just say that the Orientals have proven beyond a doubt that they are first-class copiers of white technology. When they actually invent a radical new technology that changes mankind in a remarkable way, I will then be impressed with them as innovators and not mere copy-cats.", 
   {}, 
   57701, 
   null, 
   1089831060.0
  ], 
  [
   57980, 
   null, 
   "Siegfriedson", 
   "White European pioneers settled America and we won ownership of this land by right of conquest. The Indians were soundly defeated on the battlefields. This is our land now and we will do everything we can to preserve its White character. We will struggle like the Indians before us, and God willing, we will win.\n \n \nRight of Conquest? I'm checking my constitution...but I don't see that one! Of course, you seem much less willing to defend \"right of conquest\" when the Israeli's \"conquered\" the Palestineans...but that's ok, that wasn't really a conquest anyway! Oh, and the next time I'm in town, I'll bust down your door with a M-16 and \"conquer\" your living room. I wonder how the courts will take that defense...right of conquest, honestly!\n\n\n \n It's just irrelevant whether there is a reference to the right of conquest in the Constitution or not. The Constitution was meant to spell out how the newly-formed nation of America was to govern itself; it was not intended to provide a justification as to why Whites were in the New World. Whites turned to the concept of \"Manifest Destiny\" to explain that.\n \n Actually, I do believe that the Jews deserve the land of Palestine that they call Israel. They fought multiple wars and defeated their enemies in combat, therefore the Jews earned the title to that land. However, this fact does not change two things:\n \n 1) The Palestinians have the right to try to take it back\n 2) If the Jews want an ethnocentric Zionist state in the Middle East, that is their perogative, but they should not be utilizing billions of Gentile dollars to accomplish this task. See my post:\n \n Israel Hits US Taxpayers in the Wallet", 
   {}, 
   57978, 
   null, 
   1089831720.0
  ], 
  [
   57982, 
   null, 
   "Phunting", 
   "Very quickly as I have to leave work soon...\n \n \nEven today race-mixing is the extreme exception and not the norm.\nIn that case why the previous scare mongering, 'the white race is on the decline...will become extinct...etc'?\n \n \n \nRegarding your observation about China and Japan, I will just say that the Orientals have proven beyond a doubt that they are first-class copiers of white technology. When they actually invent a radical new technology that changes mankind in a remarkable way, I will then be impressed with them as innovators and not mere copy-cats.\nAs dsadevil astutley puts it:\n \n \n \nThe inconsistency in your argument is palpable. If I claim that it wasn't whites who invented something (say, writing), you'll come back and say that the greatest works of literature are white, even if l'orginal wasn't. On the flip side, if I say \"ok, jazz was invented by scots, but the greatest works were black,\" you'll say they are just good mimes.\n", 
   {
    "unicode_changes_made": true
   }, 
   57978, 
   null, 
   1089831780.0
  ], 
  [
   57986, 
   null, 
   "Siegfriedson", 
   "1) If orginality is all that matters and development is considered meaningless (and SURELY you'll agree that modern jazz has been predominately co-opted by african americans), then Whites can't claim any credit for:\n Gunpowder (Chinese) and thus not guns, fireworks, cannons\n Writing (Sumerian) and thus Literature in general\n Our Mathematical System (Indian) and thus all sorts of stuff.\n The inconsistency in your argument is palpable. If I claim that it wasn't whites who invented something (say, writing), you'll come back and say that the greatest works of literature are white, even if l'orginal wasn't. On the flip side, if I say \"ok, jazz was invented by scots, but the greatest works were black,\" you'll say they are just good mimes.\n\n \n The English monk Roger Bacon wrote about gunpowder, as well as exactly how to make it, in the 13th century. There's no evidence that he got his information from the Chinese or anyone else. The only things you need for gunpowder is charcoal, sulfur and salt peter (potassium nitrate).\n \n The Sumerians were a white people: http://www.white-history.com/hwr7.htm\n \n Our \"mathematical system\" has its roots in ancient Greece, not India:\n \n http://www.perseus.tufts.edu/GreekScience/Students/Tim/Contents.html\n \n http://www.ibiblio.org/expo/vatican.exhibit/exhibit/d-mathematics/Greek_math.html\n \n You show a lack of understanding of my racial argument. It is simply that the White race has contributed an overly disproporationate amount to our civilization today, and as such it and its unique culture is worth preserving for all time.\n \n I do not feel that the white race is at all \"superior\", meaning that a) Whites are more worthy of life than other races or b) that Whites should have dominion of other races.\n \n The White race today is the only race that needs to be convinced to ensure its existence on planet Earth; how could any such race be \"superior\"?", 
   {}, 
   57701, 
   null, 
   1089833820.0
  ], 
  [
   57990, 
   null, 
   "Siegfriedson", 
   "2) Since the crux of your advocacy has been \"all good things are white\n\n \n That is clearly not the crux of my arguments; that is simply your personal interpretation of the information I provide in my posts because that is all you will allow yourself to hear.\n \n \n3) I say: Nothing in Constitution justified Dred Scott. You respond with...1790 Naturalization Law. I'll give the audience 5 seconds to try and guess the problem here. Got it yet? THE 1790 NATURALIZATION LAW ISN'T IN THE CONSTITUTION!\n\n \n I do indeed wish that the Founding Fathers of America had specified \"white\" more often in their writings. The problem is that back then, it was taken for granted that \"American\" meant \"a white citizen in America\" so unfortunately for us American nationalists it's not as easy to argue for America being a \"white\" nation as it should be.\n \n Here's something that is definitely from the Constitution:\n \n \nWe the people of the United States, in order to form a more perfect union, establish justice, insure domestic tranquility, provide for the common defense, promote the general welfare, and secure the blessings of liberty to ourselves and our posterity, do ordain and establish this Constitution for the United States of America.\n\n \n Ourselves = White people\n \n All the signers and authors of the Constitution were white, and the people meant to be governed by the Constitution were the White people who were populating America at the time.\n \n Posterity: 1 : The race that proceeds from a progenitor;the offspring of one progenitor to the furthest generation\n 2 : All of a person's descendants\n \n Therefore, the authors and signers of the Constitution were referring to their own race; i.e. white people.", 
   {}, 
   57986, 
   null, 
   1089834540.0
  ], 
  [
   58014, 
   null, 
   "apathy", 
   "\n Posterity: 1 : The race that proceeds from a progenitor;the offspring of one progenitor to the furthest generation\n 2 : All of a person's descendants\n \n Therefore, the authors and signers of the Constitution were referring to their own race; i.e. white people.\n\n \n What if one's posterity is mixed, as in some blacks claim to be descendent of Jefferson?", 
   {}, 
   57990, 
   null, 
   1089842460.0
  ], 
  [
   58021, 
   null, 
   "Tastyfish", 
   "Ourselves = white people isn't the obvious interpretation, it just says people of the United States and if they have referred to them selves as that I would say it is a good bet that this is the bit they were refering to.\n On the otherhand if we are going by the strict defintion of 'we, the people' that the founding fathers did you are excluding women too.", 
   {}, 
   58014, 
   null, 
   1089844200.0
  ], 
  [
   58025, 
   null, 
   "sinjin", 
   "If even one of the people in \"We the people\" was non-white your argument is kaput. And they were.", 
   {}, 
   58021, 
   null, 
   1089845280.0
  ], 
  [
   58081, 
   null, 
   "dsadevil", 
   "1)Ok starting from your attack of Prof. Jay and \"race is fictive args\" in general. You refer me to some of your pro-white sites (which do appear to have an agenda, no matter). Look to the analysis of your own site:\n \" Like families, members of an ethny have more distinctive genes in common with each other than they do with other populations; the same can be said of members of the same race. Although the genetic kinship of ethny members is more diluted than that of family members, ethnies are large reservoirs of genetic interests for their members. Therefore, just as a person has a great genetic interest in the well-being of his family, so does a German have for Germans, an Italian for Italians, etc. In this sense, it can be as adaptive to support one's ethno-racial group as to support one's family.\"\n The bolded area is the problem: genetic studies of seperate races show (and I've posted this before) that the average genetic varience between different races is SMALLER than the average variance within the race itself. Race therefore misses the criteria set out by your own sources for determining what should determine ethnicity. Although one can certainly find certain genetic sequences that suggest (or are even determinative) of a persons race (which is all the article you post in full in the other thread proves), that's no different from any genetic trait, period. Thus, in terms of determining what makes us different, we can take either two routes:\n a) we're all entirely different b/c we're all genetically unique or\n b) what catagories we can group ourselves in should be based off a general showing of common difference between the groups that is larger than the average variance within the groups themselves. (which is essentially the criteria ure site uses). Personally, I prefer option 1, but its a moot arg since either one renders race a non-factor. This of course has its own implications as to the \"race mixing\" argument, but I think that's probably false as well. While perhaps ethnic scandanavians were pretty isolated from other \"racial\" groups (though perhaps not, recall the case of the Finns who are more closely related to Koreans than they are to Swedes), in other areas mixture was probably far more common. Examples of such areas would be border regions between racial homelands (India/SE Asia), areas where one race conquered another (the current inhabitants of Europe aren't the originals, the only major \"original\" european ethnic group is the Basques), or places of cultural exchange (such as Athens or Rome, which imported vast quantities of foreign slaves).\n 2) Asians and \"creams of the crop.\" You just replaced ure original assertion with a new one, this time that \"it takes alot of money to come to America.\" That's almost definitely false. Perhaps the most persistent narrative that has been given to immigrants to America is \"a penniless man who arrives on Ellis Island with nothing but a bag of clothes and faith in the American dream.\" With the exception of the fact that Asians tended to land on Angel Island in California, I see no reason why the narrative should shift. Indeed, immigration patterns tend to follow \"push/pull\" patterns, either people are \"pushed\" out of their home by oppressive living conditions, or they are pulled to their new home by certain positive qualities (or of course a mix of both). You ascribe Asian immigration to \"pull\" sources, so lets examine how that would play out. The most important thing to note is whether or not the situation in say China or Japan is worse for ELITES compared to how it is here. Recalling for the moment that Asians (as most people, including whites) have some degree of pride and attachment to their homeland, there would have to be significant appeal to America beyond simply a marginal gain. The expoential growth of China's luxury market (Armani is planning to open over 30 stores in Shanghai alone) and capitalist class all point to the fact that there is simply no reason for the elites to leave (all of this of course is even more true of Japan and Korea). By contrast, in such places as China or Vietnam, the \"push\" factors for the poor are tremendous. Lack of political power, increasing rich/poor gap, zero oppurtunity for advancement, constant fear of repression, famine or death all give huge incentives for them to leave (indeed, these are very much the same reasons that prompted penniless Europeans to leave in the 19th century from Eastern Europe, and penniless Chinese workers to arrive in California to help build the transcontinental railroad). Even assuming that the Chinesse elites are leaving in droves (which uve far from proven), that doesnt NEGATE the push factors that would drive out the poor and thus would neutralize and reverse the advantage gained by the rich immigration.\n 3) At best, the Europeans placed distant second to the Chinese in said invention (same with the printing press). It strikes me at least as likely that there were intercultural contacts that tipped people off. But at least with regards to Mathamatics, the Indians roots of the current system is very clear. While the Greeks made many important contributions to the field of mathamatics (for which they should be lauded), the SYSTEM we use today is primarily Indian in root (with the Greek ideas incorporated so they work into the system). This, for example, is why I count 1,2,3 instead of I,II,III. Its also why I have the number 0, which was unknown to both Greek and Roman mathamaticeans but extremely important to higher level mathamatical formulations. Indeed, our current system is named \"the arabic system\" which is b/c we got the system from the arabics who got it from the Indians. All of which proves the intercultural exchange hypothesis I advocated above.\n 4) Ok, now lets get into some Rights Talk. A right is something that an individual is due simply by virtue of the fact that they exist. Rights can be positive (\"I have the right to do X\") or negative (\"You can't take X away from me.\"). Most western philosophers believe the only natural rights are negative rights, but regarldess, a right is immutable, it exists regardless of time, place, or stature. John Locke, for example, said the negative rights all men were due were \"life, liberty, and property\" which was modified and then inserted into our dec of independence. I have a right to life b/c no one can (justly) take my life away from me (unless in enforcement of another 'natural right', I can kill someone in self-defence b/c they are trying to take away MY right). In that context, a \"right to conquest\" is absurd and paradoxical. In addition to violating all the other natural rights possessed by man (Life, Liberty AND property), its in constant conflict with itself: if I exercise my right of conquest I violate your right of conquest. Furthermore, since rights are immutable, the \"right to conquest,\" if it existed, would have to exist perpetually, you couldn't just \"turn it off\" within the context of an established state. The same justification that allows me to conquer the land of the Native American over the next river allows me to conquer the farm of the homesteader through the next woods. Most philosophers describe the natural (lawless) world in rhetoric such as \"right of conquest\" (in the words of Thomas Hobbes, \"nasty, brutish, and short\"). Since there are no laws or governments, anyone can take anything from anyone with no one to stop them. However, the reason we form governments is to END said situation, not to perpetuate it more effectively. A \"right of conquest\" is a paradox and a contradiction in terms. Oh, and not to get into an I/P debate here, but Israeli's are a mix of \"white\" (indo-european) and semetic, while palestineans are all semetic. This means Israelis have at least as close a relationship to whites as sumerians do if not closer (and u claim sumerians are white).", 
   {
    "unicode_changes_made": true
   }, 
   58025, 
   null, 
   1089881340.0
  ], 
  [
   58270, 
   null, 
   "jitobear", 
   "Oh Siegfriedson Siegfriedson Siegfriedson.... tsk tsk tsk\n \n \n I really have no idea why so many give you so much effort on this board. You can talk as pretty as you like and pull out all kinds biased data, but it's just the same old bigotry in a brand new suit. It's not new, it's not original, and it's never been right.\n \n All your posts have proven to me beyond any shadow of a doubt is that my little Mexican son kicks *** over you. Only nine and he already knows to judge people based on their individual merits. Try it some time.", 
   {}, 
   58081, 
   null, 
   1089934920.0
  ], 
  [
   58427, 
   null, 
   "bmans301bIMBACK", 
   "Oh Siegfriedson Siegfriedson Siegfriedson.... tsk tsk tsk\n \n \n I really have no idea why so many give you so much effort on this board. You can talk as pretty as you like and pull out all kinds biased data, but it's just the same old bigotry in a brand new suit. It's not new, it's not original, and it's never been right.\n \n All your posts have proven to me beyond any shadow of a doubt is that my little Mexican son kicks *** over you. Only nine and he already knows to judge people based on their individual merits. Try it some time.\n\n \n \n Data is data. How is it biased? If it is true, use it to your advantage to prove a point. You're just mad because his point was backed up by a true fact, and you can't handle that.", 
   {}, 
   58270, 
   null, 
   1089999480.0
  ], 
  [
   58464, 
   null, 
   "jitobear", 
   "Data is data. How is it biased? If it is true, use it to your advantage to prove a point. You're just mad because his point was backed up by a true fact, and you can't handle that.\n\n \n There is nothing to handle. It's pure smoke screen. \n \n The main point in his argument that white society has contributed more to this world than any other is not fact. Period.\n \n Nor am I mad - maybe a little sad.", 
   {}, 
   58427, 
   null, 
   1090007280.0
  ], 
  [
   58471, 
   null, 
   "bmans301bIMBACK", 
   "There is nothing to handle. It's pure smoke screen. \n \n The main point in his argument that white society has contributed more to this world than any other is not fact. Period.\n \n Nor am I mad - maybe a little sad.\n\n \n \n Maybe white society has contributed more. That doesn't mean whites are better or worse than anyone else.", 
   {}, 
   58464, 
   null, 
   1090009440.0
  ], 
  [
   58520, 
   null, 
   "jitobear", 
   "Maybe white society has contributed more. That doesn't mean whites are better or worse than anyone else.\n\n \n They haven't - and he was given many examples - all of which he twisted to refute. He was given examples in science, music, art, and governments - and he simply dismissed them all. He uses white western civilation as the thing to be measured against, and his definition of accomplishment and success is by the standards of that world, too. If a culture failed to look like his - then they have accomplished nothing in his eyes. I could put a Black Harverd professor and an Asian Nobel Prize winner in front of him and he would still refute it. He doesn't even see people. He doesn't measure individuals at all. He can't get past \"jazz was influenced by the Scots\" to see that BB King is a great guitar player. And he seems to think he gets to share in the brilliance of Thomas Jefferson just because he is of the same race. It's all a fallacy. Races did nothing to build this world - it was people, got it? people. The fact that he is blind to that alone makes him wrong.\n \n And he is saying white people are better. He is use pretty language and data - but it is what he is saying. It's white supremacy garbage no matter how official he sounds. It's the same **** Hitler believed. It was is and always will be a comforting lie who are very cowardly - and nothing more.\n \n It does not upset me because \"I can't handle it.\" It upsets me because he and his stupid ilk create barriers and do harm to my son, and believe it or not - all of us.", 
   {}, 
   58471, 
   null, 
   1090019880.0
  ], 
  [
   58533, 
   null, 
   "bmans301bIMBACK", 
   "They haven't - and he was given many examples - all of which he twisted to refute. He was given examples in science, music, art, and governments - and he simply dismissed them all. He uses white western civilation as the thing to be measured against, and his definition of accomplishment and success is by the standards of that world, too. If a culture failed to look like his - then they have accomplished nothing in his eyes. I could put a Black Harverd professor and an Asian Nobel Prize winner in front of him and he would still refute it. He doesn't even see people. He doesn't measure individuals at all. He can't get past \"jazz was influenced by the Scots\" to see that BB King is a great guitar player. And he seems to think he gets to share in the brilliance of Thomas Jefferson just because he is of the same race. It's all a fallacy. Races did nothing to build this world - it was people, got it? people. The fact that he is blind to that alone makes him wrong.\n \n And he is saying white people are better. He is use pretty language and data - but it is what he is saying. It's white supremacy garbage no matter how official he sounds. It's the same **** Hitler believed. It was is and always will be a comforting lie who are very cowardly - and nothing more.\n \n It does not upset me because \"I can't handle it.\" It upsets me because he and his stupid ilk create barriers and do harm to my son, and believe it or not - all of us.\n\n \n \n \n I do agree that black and asians have done a lot for this country. But to date, I would argue to say that whites have done more. It will probably equal out over time, but right now, whites probably have. It is dumb to even argue over something like this.", 
   {}, 
   58520, 
   null, 
   1090025580.0
  ], 
  [
   59213, 
   null, 
   "apathy", 
   "honkey please\n \n ok, THIS country (US) has a large majority of 'white' people and it's been that way pretty much the whole time\n \n also, the society was set up so that white individuals always were in positions of power\n \n so basically what you are saying is that because the large majority of individuals in the US are/were white and that other races ,until recently, were institutionally marginalized (to put it nicely), whites have done more for/in the US than the other races\n \n and chinese have done more for china, and indians have done more for india (oops until whitey took over), and persians have done more for iran, ..........", 
   {}, 
   58533, 
   null, 
   1090444560.0
  ], 
  [
   59214, 
   null, 
   "apathy", 
   "Is the thread starter around? \n \n Siegfriedson? Are Jewish (semetic) people white? If so or not, why?\n \n Are mediterranean people white? If so or not, why?\n \n Were the ancient egyptians white? If so or not, why?\n \n Were ancient Babylonians white? If so or not, why?\n \n Were ancient Greeks white? If so or not, why?\n \n Are Japanese people white? If so or not, why?\n \n Are eskimos white? If so or not, why?", 
   {}, 
   59213, 
   null, 
   1090444800.0
  ], 
  [
   65325, 
   null, 
   "Mach", 
   "Siegfriedson.\n \n Most people aren't racists because they think it's moronic, not because it's unpopular.\n \n 1. We're all related to a common ancestor pool, so ancestry is a useless deliniation.\n \n 2. Color of skin is some snippets of DNA that control melanin in the skin. What the heck does that have to do with anything? In the not too distant future, we'll be picking our kid's skin color from a color photo-book. It's pointless.\n \n 3. America was founded to get the heck away from hereditary nobility..why would you claim America was founded ON hereditary nobility?\n \n 4. The sooner you realize that the white majority WANTS minority races that are socially disadvantaged for cheap labor, the better. They'd rather die than give that up...get with the program. Why do you think we don't deport everyone, why do you think so many Mexicans are allowed to work illegally, even at the OK from the Presedent (a white boy if I ever saw one)? \n \n 5. You're in AMERICA. You can make a ton of money, and live ANYWHERE YOU WANT. Live in a 100% white community, it's legal, and you'd be more happy there. We can create most any environment we want in America..you just have to work for it.\n \n -Mach", 
   {
    "post_info": {
     "post_title": "-"
    }
   }, 
   59214, 
   null, 
   1094095140.0
  ], 
  [
   71689, 
   null, 
   "BradleyHarris", 
   "I love when racists trot this gem out, as Sigfried's Spawn does...\n \n \"6. All great societies of the past, which were white as they rose to power, allowed their original ethnic make-up to be altered, and they fell permanently into decay (for example, Egypt).\"\n \n Exercise...Think about the cultures (among numerous other examples one could offer) that were or that built...\n \n ...the Mongol empire\n ...Great Zimbabwe\n ...Macchu Picchu\n ...Teotihuacan\n ...the Six Nations\n ...the Pueblos of the southwest\n ...the Mound Builders of the mid-continent\n ...Angkor Wat\n ...the Songhai\n \n Will Sieg assert for each in turn that (a) it was not \"a great society\"? or (b) that these folks were originally actually \"white\"? My suspicion is that he will in general opt for (a), which is the easier route for him--he can accomplish it stipulatively. Let's see, friends, what he does, and whether he does.\n \n (Me--I'm not \"white\"--I'm more of an off-white, vaguely salmon-y colour. Don't tan well. Pressed, I may self-identify as Caucasian, just as a lot of brownish folk can. Bit of an unscientific concept, \"race,\" so I don't use it. And rarely do I talk about being Caucasian. I'm neither proud nor ashamed of it--it's an accident of birth. So I'd rather judge a man by his worth. Or, as here, by the calibre of his rhetoric.)", 
   {
    "post_info": {
     "post_title": "&quot;All Great Societies...were White...&quot;?    Amazing..."
    }
   }, 
   55025, 
   null, 
   1097803140.0
  ], 
  [
   80902, 
   null, 
   "MIDNITEANGEL", 
   "1. The white race laid the foundations of America.\n \n 2. In the eyes of America's founders, only Whites could be \"Americans\". Therefore, American heritage is White heritage.\n \n 3. American law, religion, art, music, and culture in general is based upon concepts from White European thought.\n \n 4. The American all-white neighborhoods of the past were demonstrably cleaner, safer, and freer of crime than the trendy \"integrated\" neighborhoods of today.\n \n 5. The American all-white public schools of the past were clearly superior to any trendy \"integrated\" school of today.\n \n 6. All great societies of the past, which were white as they rose to power, allowed their original ethnic make-up to be altered, and they fell permanently into decay (for example, Egypt).\n \n 7. Racial integration of our neighborhoods and our schools has forced them into decay. It is clear beyond any debate that modifying the racial composition of America away from a dominantly white society towards a mixed, \"racially-diverse\" society will be catastrophic. It will plunge the great American nation of Washington and Jefferson into the same depths that the other formerly great white nations of the past have fallen into.\n \n 8. Based upon the extensive history of the black race it is clear that it is not capable of creating or maintaining an advanced society. It has never created one advanced society in Africa (ancient Egypt was not created by blacks). In every case (such as Haiti) where they have been given a thriving society, blacks have killed it, driving it into the same primitive state that their people have always lived in (in their native Africa). For any who is foolish enough to doubt history, we have the sad spectacle of South Africa playing out before us, which should erase all doubts.\n \n 9. History and present events have shown us that the black race cannot create or maintain an advanced society on its own (look at black neighborhoods and cities). Its members, therefore, cannot fit well into an advanced society, living and working beside those who not only are capable of building one advanced society, but have built numerous such societies in all climates and in all types of land.\n \n 10. History has shown us that the mestizo Hispanic peoples, being of mixed (mostly) Indian, Negro, and a little Spaniard blood, are also deficient in creating advanced societies like the white race has repeatedly created. While they have shown ability that is superior to the black race, they have not been able to utilize the superior natural resources of Central America and the South American continent.\n \n 11. Spain and Portugal sent soldiers to the lands south of the Rio Grande to conquer and take the wealth of the land. Instead of sending families to colonize, the Spanish men took native wives. The racial makeup of the lands south of the Rio Grande is composed of American Indian, black, mixed-race and a small percentage of Whites thrown in. Their lands have never thrived like the nations to the north where Whites colonized and kept their race in tact, seldom mixing their race with Indians and blacks.\n \n 12. By \"celebrating diversity\", brainwashed whites are bringing the Hispanic and Asian peoples into a once White America, and we will cause the North American continent to become like the South American continent. The great wealth and stable society of white America will be traded for the poverty and instability of the revolution-torn countries south of our border.\n \n 13. Even if all races were exactly the same, if there were no differences whatsoever, the fact that whites created the nation of America means that we are completely within our honorable rights to restrict entrance into our country. We may ethically allow only white immigrants, or no immigrants at all.\n \n 14. The number of whites, as a percentage of world population, is now down into the single digits and falling fast.\n \n 15. Nearly all of the white nations on earth are now accepting large numbers of non-white immigrants. The only one of the three major races of earth that is in real danger of falling into a minority status in its own racial home is the white race. This could easily lead to extermination of the white race. Will you just stand idly by?\n \n 16. Those who support American \"diversity\", non-white immigration, miscegenation, integration, and/or affirmative action, are either: 1) ignorant of the above critical facts; or 2) blatant haters of the white race and its civilization, and would not be troubled if Whites ceased to exist on planet Earth.\n\n Are you forgetting that the Indian was here before whites? emoticon_confused", 
   {
    "post_info": {
     "post_title": "Indians"
    }
   }, 
   55025, 
   null, 
   1102276620.0
  ], 
  [
   80905, 
   null, 
   "MIDNITEANGEL", 
   "I love when racists trot this gem out, as Sigfried's Spawn does...\n \n \"6. All great societies of the past, which were white as they rose to power, allowed their original ethnic make-up to be altered, and they fell permanently into decay (for example, Egypt).\"\n \n Exercise...Think about the cultures (among numerous other examples one could offer) that were or that built...\n \n ...the Mongol empire\n ...Great Zimbabwe\n ...Macchu Picchu\n ...Teotihuacan\n ...the Six Nations\n ...the Pueblos of the southwest\n ...the Mound Builders of the mid-continent\n ...Angkor Wat\n ...the Songhai\n \n Will Sieg assert for each in turn that (a) it was not \"a great society\"? or (b) that these folks were originally actually \"white\"? My suspicion is that he will in general opt for (a), which is the easier route for him--he can accomplish it stipulatively. Let's see, friends, what he does, and whether he does.\n \n (Me--I'm not \"white\"--I'm more of an off-white, vaguely salmon-y colour. Don't tan well. Pressed, I may self-identify as Caucasian, just as a lot of brownish folk can. Bit of an unscientific concept, \"race,\" so I don't use it. And rarely do I talk about being Caucasian. I'm neither proud nor ashamed of it--it's an accident of birth. So I'd rather judge a man by his worth. Or, as here, by the calibre of his rhetoric.)\n\n Listen, just because you lay claim to nothing, leave some of us to be PROUD and shout it out loud...that was quite a lame list....who the hell even has heard of them?", 
   {
    "post_info": {
     "post_title": "Not Proud?"
    }
   }, 
   71689, 
   null, 
   1102277820.0
  ], 
  [
   80906, 
   null, 
   "MIDNITEANGEL", 
   "Siegfriedson.\n \n Most people aren't racists because they think it's moronic, not because it's unpopular.\n \n 1. We're all related to a common ancestor pool, so ancestry is a useless deliniation.\n \n 2. Color of skin is some snippets of DNA that control melanin in the skin. What the heck does that have to do with anything? In the not too distant future, we'll be picking our kid's skin color from a color photo-book. It's pointless.\n \n 3. America was founded to get the heck away from hereditary nobility..why would you claim America was founded ON hereditary nobility?\n \n 4. The sooner you realize that the white majority WANTS minority races that are socially disadvantaged for cheap labor, the better. They'd rather die than give that up...get with the program. Why do you think we don't deport everyone, why do you think so many Mexicans are allowed to work illegally, even at the OK from the Presedent (a white boy if I ever saw one)? \n \n 5. You're in AMERICA. You can make a ton of money, and live ANYWHERE YOU WANT. Live in a 100% white community, it's legal, and you'd be more happy there. We can create most any environment we want in America..you just have to work for it.\n \n -Mach\n\n Are you for real? Dna most certainly shows a persons racial idenity unless they are multiracial...then it gets difficult....we most certainly NOT NOT NOT all from one gene pool...are you for real? Opressed bible bangers came here to AMERICA to escape RELIGIOUS control....so they controlled AMERICA...LOL...even worse then they were controlled....then they tried to genicide the Indians.......your 4 and 5 are contridictory to each other....if you can make a ton of money then the mexicans wouldn't be making $3.00 an hour...and i don't consider the min wage as making tons of money.... emoticon_frazzled", 
   {
    "post_info": {
     "post_title": "Hellllllllllo?"
    }
   }, 
   65325, 
   null, 
   1102278360.0
  ], 
  [
   80920, 
   null, 
   "Siegfriedson", 
   "Are you forgetting that the Indian was here before whites? emoticon_confused\n\n \n \"Who was here first\" has nothing to do with claiming ownership to a piece of territory. Land only belongs to those who are strong enough to retain possession of it.\n \n In any case, there is mounting evidence that Europeans reached North America before the Asiatic Indians did:\n \n http://www.stormfront.org/whitehistory/hwr6b.htm\n \n http://www.telegraph.co.uk/htmlContent.jhtml?html=/archive/2000/02/19/wus19.html\n \n http://www.nationalreview.com/weekend/anthropology/anthropology-miller060901.shtml\n \n http://dsc.discovery.com/news/briefs/20040906/firstamerican.html\n \n http://www.cnn.com/2004/TECH/science/11/17/carolina.dig/index.html\n \n http://www.bbc.co.uk/science/horizon/2002/columbus.shtml\n \n \n \n .", 
   {}, 
   80902, 
   null, 
   1102287300.0
  ], 
  [
   81037, 
   null, 
   "MIDNITEANGEL", 
   "While I do not agree with siegfriedson's post, I do wish to propose an interesting demograph: \n \n Is it wrong to be proud to be white? Obviously, blacks are proud to be black, and they are also proud of their culture and heritage. Am I racist for being proud to be white? Sounds pretty upsetting, doesn't it?\n \n I would be labeled, slandered, and laughed at if I proposed a national 'White History Month\". I would be called racist, prejiduce, and hateful for speaking out on behalf of 'white culture'. Is it a minority thing or are we really this brainwashed?\n \n I do not feel that I am racist, hateful, or a prejiduce person, and to be quite honest, I am both understanding and also angry at the position that all of our cultures are in. At some point, these types of issues have to be addressed realistically and, hopefully, we will one day live in a culture where 'real' equal opportunity can allow such freedom without aggression, but, unfortunately, for the time being, we all have to deal with culpable ignorance.\n\n I have been to many chats or message boards where there always one person that will call me names for speaking out on white pride...makes no sense...I do not think that anyone should be harmed or harrassed, i just do not agree with blood mixing and for that i get called an array of insults....and that's what i call ignorance! emoticon_mad", 
   {
    "post_info": {
     "post_title": "I agree"
    }
   }, 
   55127, 
   null, 
   1102359420.0
  ], 
  [
   81039, 
   null, 
   "MIDNITEANGEL", 
   "\"Who was here first\" has nothing to do with claiming ownership to a piece of territory. Land only belongs to those who are strong enough to retain possession of it.\n \n In any case, there is mounting evidence that Europeans reached North America before the Asiatic Indians did:\n \n http://www.stormfront.org/whitehistory/hwr6b.htm\n \n http://www.telegraph.co.uk/htmlContent.jhtml?html=/archive/2000/02/19/wus19.html\n \n http://www.nationalreview.com/weekend/anthropology/anthropology-miller060901.shtml\n \n http://dsc.discovery.com/news/briefs/20040906/firstamerican.html\n \n http://www.cnn.com/2004/TECH/science/11/17/carolina.dig/index.html\n \n http://www.bbc.co.uk/science/horizon/2002/columbus.shtml\n \n \n \n .\n\n I truely believe that the 4 races were separated and the red race was here in America...that makes them the original owners....America was a huge place and there was no justification for running them off \"thier\" land.", 
   {
    "post_info": {
     "post_title": "Land Owning"
    }
   }, 
   80920, 
   null, 
   1102359780.0
  ], 
  [
   81077, 
   null, 
   "Tastyfish", 
   "The '4 races' were never seperated, the idea that they would have been in one place to start with is ridculous.\n \n However, I can't beleive you haven't heard of at least some of those cultures, I would hope the barest minimum you would recognise would be a least three (BH also forgot Sudan and Imperial China). DNA depends how far you want to go back, we did arise out of africa and/or asia but even after that there has been a lot of mixing before we get to the ancient cultures we know today. As for the spread of 'whites' (not sure if they are all the same but hey...) into america. Seeing as how far north the land bridge is between Asia and America it hardly seem suprising that a cold adapted version of modern man crossed first. However the fact that he was then wiped out by later crossings of other peoples surely reflects the fact that culture is more important than race?\n Seeing as culture is more strongly affected by environment than skin colour, yet skin colour is going to be strongly effected on environment - really how much is to do with race, and how much to do with culture that just happens to include more of a particular race rather than something speicifically genetic?", 
   {}, 
   81039, 
   null, 
   1102368360.0
  ], 
  [
   81304, 
   null, 
   "MIDNITEANGEL", 
   "How does one judge whiteness or blackness or _____ness of a person. If it's based on physical characteristics, I know plenty of dark skinned \"white\" people and plenty of lighter skinned \"black\" people. If it's based on genetic makeup and ancestry, there have been several studies that conclude that races have no genetic meaning as all of the human population are extremely genetically identical. \n Also, I think it's moot to say that America was built by whites, because a variety of immigrating cultures made America. And who are whites anyway? I know that Irish, English, German, Dutch, and other European immigrants were some of the first to start the US, but I bet anything that their cultural differences were large enough for them to settle in different places. Why stop our tradition of allowing immigrants to mold our country into what it is. I don't think genetically anyone is less or more \"white\" than you, and according to your argument, most Hispanics are white because of their mixed Spanish blood.\n \n Being proud of being white is as inane as being proud of having brown eyes or freckles, it has no bearing on your culture or beliefs.\n\n No such thing as white? What do you think the word Arian means? emoticon_wow", 
   {
    "post_info": {
     "post_title": "Arian"
    }
   }, 
   55359, 
   null, 
   1102448400.0
  ], 
  [
   81314, 
   null, 
   "jitobear", 
   "I have been to many chats or message boards where there always one person that will call me names for speaking out on white pride...makes no sense...I do not think that anyone should be harmed or harrassed, i just do not agree with blood mixing and for that i get called an array of insults....and that's what i call ignorance! emoticon_mad\n\n \n You post insults and misinformation about those who aren't white or are mixed and think that your lilly white hide should be exempt????\n \n Maybe in your world where everybody looks like whoever you see in the mirror - but out here you ain't exempt - certainly not from ME.\n \n You insulted MY SON. You have locked horns. Bow out of you can't take the heat.", 
   {}, 
   81037, 
   null, 
   1102451280.0
  ], 
  [
   81327, 
   null, 
   "sinjin", 
   "No such thing as white? What do you think the word Arian means? emoticon_wow\n\n \n Well for one thing it means you can't spell. I'd expect more from a member of the \"master\" race.\n \n from Dictionary.com\n \n Ary·an adj. \n \n Word History: \n \n \"It is one of the ironies of history that Aryan, a word nowadays referring to the blond-haired, blue-eyed physical ideal of Nazi Germany, originally referred to a people who looked vastly different. Its history starts with the ancient Indo-Iranians, Indo-European peoples who inhabited parts of what are now Iran, Afghanistan, and India. Their tribal self-designation was a word reconstructed as *arya- or *rya-. The first of these is the form found in Iranian, as ultimately in the name of Iran itself (from Middle Persian rn (ahr), \"(Land) of the Iranians,\" from the genitive plural of r, \"Iranian\"). The variant *rya- is found unchanged in Sanskrit, where it referred to the upper crust of ancient Indian society. These words became known to European scholars in the 18th century. The shifting of meaning that eventually led to the present-day sense started in the 1830s, when Friedrich Schlegel, a German scholar who was an important early Indo-Europeanist, came up with a theory that linked the Indo-Iranian words with the German word Ehre, \"honor,\" and older Germanic names containing the element ario-, such as the Swiss warrior Ariovistus who was written about by Julius Caesar. Schlegel theorized that far from being just a designation of the Indo-Iranians, the word *arya- had in fact been what the Indo-Europeans called themselves, meaning something like \"the honorable people.\" (This theory has since been called into question.) Thus \"Aryan\" came to be synonymous with \"Indo-European,\" and in this sense entered the general scholarly consciousness of the day. Not much later, it was proposed that the original homeland of the Indo-Europeans had been in northern Europe. From this theory, it was but a small leap to think of the Aryans as having had a northern European physiotype. While these theories were playing themselves out, certain anti-Semitic scholars in Germany took to viewing the Jews in Germany as the main non-Aryan people because of their Semitic roots; a distinction thus arose in their minds between Jews and the \"true Aryan\" Germans, a distinction that later furnished unfortunate fodder for the racial theories of the Nazis.\"\n \n Were you ready to have the Persians in your club?", 
   {
    "unicode_changes_made": true
   }, 
   81304, 
   null, 
   1102453560.0
  ], 
  [
   81332, 
   null, 
   "sinjin", 
   "I have been to many chats or message boards where there always one person that will call me names for speaking out on white pride...makes no sense...\n\n \n I have to agree, \"white pride\" makes no sense.", 
   {}, 
   81037, 
   null, 
   1102454460.0
  ], 
  [
   81337, 
   null, 
   "Big Orn", 
   "You insulted MY SON. You have locked horns. Bow out of you can't take the heat.\n\n Ut-Oh.\n Somebody done stepped on the cat's tail! :xcensored \n \n Red and yellow, black [brown] and white [peach]..... emoticon_cool", 
   {}, 
   81314, 
   null, 
   1102455660.0
  ], 
  [
   81576, 
   null, 
   "MIDNITEANGEL", 
   "You post insults and misinformation about those who aren't white or are mixed and think that your lilly white hide should be exempt????\n \n Maybe in your world where everybody looks like whoever you see in the mirror - but out here you ain't exempt - certainly not from ME.\n \n You insulted MY SON. You have locked horns. Bow out of you can't take the heat.\n\n I have not even a clue what you are talking about but that is common amongst ppl that are sleeping and ignore the truths...... emoticon_rolleyes", 
   {
    "post_info": {
     "post_title": "Huh?"
    }
   }, 
   81314, 
   null, 
   1102533120.0
  ], 
  [
   81580, 
   null, 
   "MIDNITEANGEL", 
   "Well for one thing it means you can't spell. I'd expect more from a member of the \"master\" race.\n \n from Dictionary.com\n \n Ary·an adj. \n \n Word History: \n \n \"It is one of the ironies of history that Aryan, a word nowadays referring to the blond-haired, blue-eyed physical ideal of Nazi Germany, originally referred to a people who looked vastly different. Its history starts with the ancient Indo-Iranians, Indo-European peoples who inhabited parts of what are now Iran, Afghanistan, and India. Their tribal self-designation was a word reconstructed as *arya- or *rya-. The first of these is the form found in Iranian, as ultimately in the name of Iran itself (from Middle Persian rn (ahr), \"(Land) of the Iranians,\" from the genitive plural of r, \"Iranian\"). The variant *rya- is found unchanged in Sanskrit, where it referred to the upper crust of ancient Indian society. These words became known to European scholars in the 18th century. The shifting of meaning that eventually led to the present-day sense started in the 1830s, when Friedrich Schlegel, a German scholar who was an important early Indo-Europeanist, came up with a theory that linked the Indo-Iranian words with the German word Ehre, \"honor,\" and older Germanic names containing the element ario-, such as the Swiss warrior Ariovistus who was written about by Julius Caesar. Schlegel theorized that far from being just a designation of the Indo-Iranians, the word *arya- had in fact been what the Indo-Europeans called themselves, meaning something like \"the honorable people.\" (This theory has since been called into question.) Thus \"Aryan\" came to be synonymous with \"Indo-European,\" and in this sense entered the general scholarly consciousness of the day. Not much later, it was proposed that the original homeland of the Indo-Europeans had been in northern Europe. From this theory, it was but a small leap to think of the Aryans as having had a northern European physiotype. While these theories were playing themselves out, certain anti-Semitic scholars in Germany took to viewing the Jews in Germany as the main non-Aryan people because of their Semitic roots; a distinction thus arose in their minds between Jews and the \"true Aryan\" Germans, a distinction that later furnished unfortunate fodder for the racial theories of the Nazis.\"\n \n Were you ready to have the Persians in your club?\n\n Thank you soooooooooo much for checking my spelling...and can you point out where i said i am a master race? but i will say, almost everything that was worthy, such as art, medicine and all other inventions were discovered by \"whites\"....keep up the good work in spelling checking..... emoticon_xangel", 
   {
    "post_info": {
     "post_title": "Thank You"
    }, 
    "unicode_changes_made": true
   }, 
   81327, 
   null, 
   1102533360.0
  ], 
  [
   81602, 
   null, 
   "Valthonis", 
   "You post insults and misinformation about those who aren't white or are mixed and think that your lilly white hide should be exempt????\n \n Maybe in your world where everybody looks like whoever you see in the mirror - but out here you ain't exempt - certainly not from ME.\n \n You insulted MY SON. You have locked horns. Bow out of you can't take the heat.\n\n \n This is so retarded ( excuse my political incorrectness... hey, sinjin, could you tell me if this is wrong :) ?) So there is allowed to be somoan (sinjin???... is that spelled right also?) pride and all these others but no caucasian pride??? What is this world coming to. That is what is destroying america. Hyphenated americans. All of us are related 99.9% genetically. Yes, I am white, and I could be more related to a hispanic than another hispanic. Anyways... calm down. Food always helps. Do some yoga. Listen to some soothing music. Think happy thoughts...", 
   {}, 
   81314, 
   null, 
   1102536600.0
  ], 
  [
   81613, 
   null, 
   "sinjin", 
   "This is so retarded ( excuse my political incorrectness... hey, sinjin, could you tell me if this is wrong :) ?) So there is allowed to be somoan (sinjin???... is that spelled right also?) pride and all these others but no caucasian pride??? What is this world coming to. That is what is destroying america. Hyphenated americans. All of us are related 99.9% genetically. Yes, I am white, and I could be more related to a hispanic than another hispanic. Anyways... calm down. Food always helps. Do some yoga. Listen to some soothing music. Think happy thoughts...\n\n \n I assume you mean \"incorrectness\". Cumbersome but a real word.\n \n It's Samoan and they are a Polynesian people with a distinct culture. There's no \"caucasian\" culture. \n \n I'll tell you what the world is coming to. Less influence and control by white people. That scares some \"white\" people. \n \n You may not think it important that someone who considers themself superior should know how to spell the group to which they so proudly belong. I think it shows the depth of intellect required to subscribe to a concept like \"white pride\".", 
   {}, 
   81602, 
   null, 
   1102539360.0
  ], 
  [
   81615, 
   null, 
   "sinjin", 
   "Thank you soooooooooo much for checking my spelling...and can you point out where i said i am a master race? but i will say, almost everything that was worthy, such as art, medicine and all other inventions were discovered by \"whites\"....keep up the good work in spelling checking..... emoticon_xangel\n\n \n Art, medicine and inventions aren't \"discovered\", they're made. In any case you're wrong.\n \n Sorry about the \"master race\" thing. I was probably jumping the gun. Keep talking. I'm sure you'll get around to making that claim or something similar soon enough. Oh wait, too late.\n \n I should warn you, you're up against a \"white\" man, well mostly.\n \n http://www.dcbmbaa.org/forums/perspectives/worldwous.htm", 
   {}, 
   81580, 
   null, 
   1102539600.0
  ], 
  [
   81638, 
   null, 
   "Anastasia", 
   "Yet more Black inventions emoticon_wow\n Chinese", 
   {}, 
   81615, 
   null, 
   1102544820.0
  ], 
  [
   81682, 
   null, 
   "jitobear", 
   "I have not even a clue what you are talking about but that is common amongst ppl that are sleeping and ignore the truths...... emoticon_rolleyes\n\n \n My son is mixed, you pig. I have read quite clearly what you have posted about people of color and mixed heritage.\n \n In case you are waiting for me to get civil. Don't.\n \n Your arguments don't deserve respectable debate. I don't care how polite you come accross - your way of thinking breeds the world's greatest atrocities. You believe you are better, the next thing you believe you are justified - in holocausts, taking slaves, lynchings, flying planes into buildings filled with infidels. Name any man-made tragedy - hate like your's caused it. \n \n You are a monster to me.", 
   {}, 
   81576, 
   null, 
   1102554180.0
  ], 
  [
   88835, 
   null, 
   "Siegfriedson", 
   "Yet more Black inventions emoticon_wow\n\n \n Yet more MYTHS about Black inventions:\n \n http://www33.brinkster.com/iiiii/inventions/\n \n \n \n .", 
   {}, 
   81638, 
   null, 
   1107113100.0
  ], 
  [
   88849, 
   null, 
   "Tigerlilly", 
   "Is this idiot bothering all you nice people? He goes on many servers and spouts the same ****. This ain't just the only one he frequents.", 
   {}, 
   88835, 
   null, 
   1107119340.0
  ], 
  [
   88851, 
   null, 
   "Tigerlilly", 
   "As for his black MYTHS, a lot of them are innovations on already existing products for which Blacks Got patents. YOu can see this in detail when you visit the US patent office online.\n \n NOt all are true inventions, but innovations and Unique pattents are also ridiculously important. Innovations make the world go round.\n \n And there is no such thing as a master race, because in the Species Homo Sapien Sapien, there are no racial subdivisions, because races are classified as sub-species, and Humans have none. There is only one species of Human currently living, and most, if not all the differences among human varients are cosmetic, and don't count toward \"new species.\"\n \n In fact, according to every major, mainstream Anthropological agency across teh world, and the majority of scientists, the genetic differences among within a population is greater than those between populations.\n \n THe genetic makeup of all humans is nearly identical, with a small percentage different. All humans are fully capable of mating and there are zero afflictions which can only afflict one group. Everyone, short of having defects or diseases (which anyone can get) is biolgoical equal.", 
   {}, 
   88849, 
   null, 
   1107119460.0
  ], 
  [
   89042, 
   null, 
   "georged", 
   "Is this idiot bothering all you nice people? He goes on many servers and spouts the same ****. This ain't just the only one he frequents.\n\n \n There are several regular and one-shot trolls who land here. Internet forums are street corners for lazy prophets who have broadband access.", 
   {}, 
   88849, 
   null, 
   1107226320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  16 Facts that White Kids Won't Learn in School", 
  "url": "http://www.4forums.com/political/society-debates/2604-16-facts-white-kids-wont-learn-school.html", 
  "breadcrumbs": [
   "Society"
  ], 
  "id_number": 2604, 
  "discussion_files": [
   [
    "31655.html", 
    "http://www.4forums.com/political/society-debates/2604-16-facts-white-kids-wont-learn-school-print.html"
   ], 
   [
    "31656.html", 
    "http://www.4forums.com/political/society-debates/2604-16-facts-white-kids-wont-learn-school-8-print.html"
   ], 
   [
    "31657.html", 
    "http://www.4forums.com/political/society-debates/2604-16-facts-white-kids-wont-learn-school-6-print.html"
   ], 
   [
    "31658.html", 
    "http://www.4forums.com/political/society-debates/2604-16-facts-white-kids-wont-learn-school-4-print.html"
   ], 
   [
    "31659.html", 
    "http://www.4forums.com/political/society-debates/2604-16-facts-white-kids-wont-learn-school-5-print.html"
   ], 
   [
    "31660.html", 
    "http://www.4forums.com/political/society-debates/2604-16-facts-white-kids-wont-learn-school-7-print.html"
   ], 
   [
    "31661.html", 
    "http://www.4forums.com/political/society-debates/2604-16-facts-white-kids-wont-learn-school-3-print.html"
   ], 
   [
    "31662.html", 
    "http://www.4forums.com/political/society-debates/2604-16-facts-white-kids-wont-learn-school-2-print.html"
   ]
  ], 
  "identifier": 2604
 }
]