[
 [
  [
   55604, 
   null, 
   "TheoMorphic", 
   "I have a question about polygamy. I'm under the impression that it is \"illegal\", but based on my (limited) understanding of the law and the constitution is it really illegal? \n \n I'm pretty sure a marriage contract can only be taken out by 2 individuals (ignoring the same-sex issue right now), and then those 2 individuals can not enter into a marriage contract with any other individual(s). \n \n But what if a person decided to \"marry\" several people with in their own religion? Now this marriage isn't sanctioned by the government, as in no marriage licenses are sought out, but this individual still has multiple wives (or husbands, depending on your flavor). \n \n Given the above situation, there is nothing illegal about this... correct? the government can't touch this person... provided they don't try to get multiple marriage licenses from the state. \n \n Do i have any misconceptions about law or the government's attitude towards religious practices?\n \n If the above is true, then the argument that same-sex marriages will lead to (among other things) polygamy is a non-sequitur. Any supports of polygamy would ONLY be concerned with the legal implications, since really polygamy is allowed (just no federal benefits are associated with it). Changing the legal implications of a marriage from man and woman to two individuals has really no impact on the execution of the law (since no benefits apply to just one of the genders in a opposite-sex marriage). But going from two individuals to several people would require major re-evaluation of the law. \n \n (sorry this doesn't quite have anything to do with gay rights. It's relevant because it takes away one of the few reasons as to why the federal marriage amendment should be passed)", 
   {
    "post_info": {
     "post_title": "Polygamy"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1088205480.0
  ], 
  [
   55608, 
   null, 
   "Kronus", 
   "IANAL\n \n However, I believe your evaluation to be correct. Basically, clergy are granted the right to perform civil marriages, so when a priest says \"husband and wife\" , or \"partner and partner\" or whatever, you are married both in the civil and religious sense. However, the civil aspect of that only applies if you conform to the law. Various denominations, Unitarian and Episcopal for example, have been \"marrying\" gays for years, and it didn't have any legal weight at all. If some church wanted to \"marry\" 5 people to each other then government wouldn't recognize it, but neither would they stop it, any more than they would stop those 5 people from just moving in together and having alot of sex.", 
   {}, 
   55604, 
   null, 
   1088208300.0
  ], 
  [
   55618, 
   null, 
   "Sigma", 
   " Changing the legal implications of a marriage from man and woman to two individuals has really no impact on the execution of the law (since no benefits apply to just one of the genders in a opposite-sex marriage). But going from two individuals to several people would require major re-evaluation of the law. \n \n\n \n I believe you are correct that merely changing marriage to be \"partner and partner\" would not impact the execution of the law, but the debate over gay marriage was never over whether the execution would change (I believe), but over the philosophical,theological and moral implications. In that way, the implications of gay marriage and polygamy are similar. Polygamists are denied civil benefits that straight (and possibly gay) couples are given. Under what moral authority are you going to deny these people rights? They love each other, whether or not they get married will not affect you so why should you be able to say no?", 
   {}, 
   55604, 
   null, 
   1088215980.0
  ], 
  [
   55651, 
   null, 
   "Kronus", 
   "I'm going to go out on a limb here. Please read the whole post before jumping to conclusions.\n \n Sigma's argument at the end is correct. The moral arguments that apply to why gays should be allow to wed do apply to why polygamists should as well. Therefore, strictly according to moral arguments, polygamists should be allowed to wed. \n \n However. There's also the matter of what people are capable of excepting. Morality has always been easy: Helping people is good, hurting people is bad. It's the application of morality that's always been hard. We're much more likely to use morality correctly when it involves a family member, rather than a stranger. The more different someone is from us, the less likely we are to exhibt correct moral behavior. \n \n The only reason we're debating gay marriage now is that generations of gays have worked to break down the image that they're so different. It's gotten to the point where enough people no longer put gays in a different moral category than themselves, and so except that they are due the same rights as they are. \n \n Polygamists have not been working at showing that they're \"just like us\". I'm not even aware of a polygamists rights movement. Figuring out correct moral behavior is only about 1 part in 10 of morality. The rest is applying it correctly. Even if polygamists should, in theory, be allowed to marry, we're about 200 years of concerted social effort away from any monogamist saying \"yeah, that actually makes sense.\" In other words, the floodgates won't open. At best, a tiny, tiny drip will form, and if this drop does in fact demonstrate that polygamy is bad, we can always patch it later.", 
   {}, 
   55618, 
   null, 
   1088264460.0
  ], 
  [
   55657, 
   null, 
   "georged", 
   "Polygamists have not been working at showing that they're \"just like us\". I'm not even aware of a polygamists rights movement. Figuring out correct moral behavior is only about 1 part in 10 of morality. The rest is applying it correctly. Even if polygamists should, in theory, be allowed to marry, we're about 200 years of concerted social effort away from any monogamist saying \"yeah, that actually makes sense.\" In other words, the floodgates won't open. At best, a tiny, tiny drip will form, and if this drop does in fact demonstrate that polygamy is bad, we can always patch it later.\n\n \n The federal government, using anti-polygamy legislation, broke the back of polygamy in the US in the late 1940s and early 1950s. It was practiced by the Mormon Church (Later day Saints) since the beginning of their sect and while publicly disavowed by the Church in the early 1900s, is still widely practiced by fundamentalist Mormons who split (were excommunicated) from the formal Mormon headquarters in Salt Lake City, Utah. There are still predominately polygamous cities in Arizona, Colorado, Idaho and British Columbia. With US federal aid to dependent children available at the drop of a baby, financially raising 30-40 children isn't all that difficult with a man having one (legal) wife and another half-dozen 'church' wifes. \n \n http://deseretnews.com/dn/view/0,1249,415014419,00.html", 
   {}, 
   55651, 
   null, 
   1088270700.0
  ], 
  [
   55664, 
   null, 
   "Kronus", 
   "As long as polygamy is tied to a religion, the debate is only going to get uglier. It is an interesting twist, however, to have a religion saying \"we have the right to live our lives like we want to\", rather than, \"you don't have the right to live your life like you want to.\"", 
   {}, 
   55657, 
   null, 
   1088273880.0
  ], 
  [
   55666, 
   null, 
   "georged", 
   "As long as polygamy is tied to a religion, the debate is only going to get uglier. It is an interesting twist, however, to have a religion saying \"we have the right to live our lives like we want to\", rather than, \"you don't have the right to live your life like you want to.\"\n\n \n Especially since the Book of Mormon specifically stated polygamy as being an important component of that belief system, then discarded by the official Mormon Church after extreme federal pressure on Utah as a state. Not unlike the kinder, gentler present day Catholics versus the Crusade era or Spain's Dark Ages. I would view the fundamentalists who continue the practice, as an impartial observation on my part, being victims of moral oppression in our land of the free. This country was, in great part, settled by Europeans seeking to escape Church of England doctrine.", 
   {}, 
   55664, 
   null, 
   1088276400.0
  ], 
  [
   55670, 
   null, 
   "Sigma", 
   "The more different someone is from us, the less likely we are to exhibt correct moral behavior.\n\n \n Correct moral behavior is a matter of perspective.\n \n \n\n The only reason we're debating gay marriage now is that generations of gays have worked to break down the image that they're so different. It's gotten to the point where enough people no longer put gays in a different moral category than themselves, and so except that they are due the same rights as they are. \n\n \n I do not believe we should only do the moral thing if we are forced to. Should we not look at the world around us and say \"Yeah, that is unequal\" and try and correct that unequal behavior? In practice, it is difficult to do, but can you not see that the same arguments for equality that gay-rights activists use are the same you use for polygamists? Why does it matter how many there are, when it is a civil rights issue? They should not have to campaign to have equal rights, they should simply get equal rights.\n \n \n\n Even if polygamists should, in theory, be allowed to marry, we're about 200 years of concerted social effort away from any monogamist saying \"yeah, that actually makes sense.\" In other words, the floodgates won't open. At best, a tiny, tiny drip will form, and if this drop does in fact demonstrate that polygamy is bad, we can always patch it later.\n\n \n I do not understand. Can we not look at it now and decide that, yes, they deserve equal rights for the same reasons that gay people deserve equal rights?", 
   {}, 
   55651, 
   null, 
   1088279040.0
  ], 
  [
   55672, 
   null, 
   "Kronus", 
   "Sigma,\n \n You're correct. They deserve equal rights for the same reasons that gay people deserve equal rights. My point is that, to the public perception, their beliefs are too different to qualify for equal rights. This is an injustice. You are correct that people should be able to get equal rights without fighting for them. However, that's not how things work. The world isn't perfect, people have flaws and prejudices. Civil rights fights are all about overcoming those prejudices. It shouldn't be so, but it is, and I don't see this changing any time soon. I wish it weren't so, but that's how I see it.", 
   {}, 
   55670, 
   null, 
   1088279520.0
  ], 
  [
   55676, 
   null, 
   "Sigma", 
   "Sigma,\n \n You're correct. They deserve equal rights for the same reasons that gay people deserve equal rights. My point is that, to the public perception, their beliefs are too different to qualify for equal rights. This is an injustice. You are correct that people should be able to get equal rights without fighting for them. However, that's not how things work. The world isn't perfect, people have flaws and prejudices. Civil rights fights are all about overcoming those prejudices. It shouldn't be so, but it is, and I don't see this changing any time soon. I wish it weren't so, but that's how I see it.\n\n \n I agree :-\\ To my eyes, it is nonsensical to allow one with an argument but not allow another that uses the same argument, but the world does not see it that way.", 
   {}, 
   55672, 
   null, 
   1088280300.0
  ], 
  [
   55687, 
   null, 
   "TheoMorphic", 
   "Wait.... i'm a little confused. Kronus, do you think that polygamists do not have access to the same civil rights as monogamists?", 
   {}, 
   55670, 
   null, 
   1088302620.0
  ], 
  [
   55688, 
   null, 
   "Kronus", 
   "Well, civil rights hasn't really been defined for the purposes of this debate. And frankly, if we're going to get into that discussion it would probably be best to do it in another thread, and under the guise of whether gay marriage is a civil right, since this is a gay rights forum.\n \n My point here, or rather Sigma's point, which I agreed with, is that the arguments used in favor of gay marriage can also apply to polygamists. The \"right\" being denied them is the right to marry who they wish, who in this case being plural. As I said, if you wish to discuss whether that's a civil right, another thread might be the best venue.", 
   {}, 
   55687, 
   null, 
   1088303880.0
  ], 
  [
   55719, 
   null, 
   "Jaaaman", 
   "I have a question about polygamy. I'm under the impression that it is \"illegal\", but based on my (limited) understanding of the law and the constitution is it really illegal? \n \n I'm pretty sure a marriage contract can only be taken out by 2 individuals (ignoring the same-sex issue right now), and then those 2 individuals can not enter into a marriage contract with any other individual(s). \n \n But what if a person decided to \"marry\" several people with in their own religion? Now this marriage isn't sanctioned by the government, as in no marriage licenses are sought out, but this individual still has multiple wives (or husbands, depending on your flavor). \n \n Given the above situation, there is nothing illegal about this... correct? the government can't touch this person... provided they don't try to get multiple marriage licenses from the state. \n \n Do i have any misconceptions about law or the government's attitude towards religious practices?\n \n If the above is true, then the argument that same-sex marriages will lead to (among other things) polygamy is a non-sequitur. Any supports of polygamy would ONLY be concerned with the legal implications, since really polygamy is allowed (just no federal benefits are associated with it). Changing the legal implications of a marriage from man and woman to two individuals has really no impact on the execution of the law (since no benefits apply to just one of the genders in a opposite-sex marriage). But going from two individuals to several people would require major re-evaluation of the law. \n \n (sorry this doesn't quite have anything to do with gay rights. It's relevant because it takes away one of the few reasons as to why the federal marriage amendment should be passed)\nWell, why not polygomy? I mean heck, if were going to allow same-sex marriage in this country..... \n Because if same-sex marriage doesn't threaten real marriage, why should polygamy? There's not a dime's worth of difference between the two institutions when you study them. \n \n This comparison is not intended to be degrading or insulting; it's not likening same-sex marriage to bestiality or incest or any other perversions that harm children and animals. Both same-sex marriage and polygamy are voluntary arrangements by consenting adults; why should we care what people do behind closed doors? \n \n And if marriage need not be limited to one man and one woman - as many of you are saying - why need it be limited to couples only? What's so sacred about the number 2? \n \n It seems a bit arbitrary to allow one man to marry another man, but not to marry two women. Why should the government restrict his choice, provided his partners are willing? Would you all concede that letting groups of three, four or more marry would water down the meaning of marriage, which elevates and sanctifies the precise biological recipe for creating children? \n \n Many homosexuals don't take the polygamy analogy seriously, or they become easily offended when the comparison is made. But there are many sound reasons to consider legalizing polygamy, advocates of same-sex marriage must admit. \n \n Just like people feel that they are born homosexual, which justifies their right to marry same-sex lovers, people also are born with the proclivity to have multiple sex partners. For many people, monogamy does not feel like their natural, biological state. \n \n Animals, for the most part, are not monogamous. So should people who are born with a strong urge to mate with more than one woman be denied their constitutional right to follow their urge? Why should a man be thwarted by the government if he can find two (or more) women to go along with him? \n \n Proponents of same-sex marriage claim it will have a stabilizing effect on homosexual relationships. Don't we want to encourage marriage and lifelong commitment, they ask? \n \n Similarly, marrying more than one woman might be a stabilizing, civilizing influence on natural-born philanderers. They may be less inclined to pursue mistresses and patronize prostitutes if they have legally sanctioned variety at home. They may become less inclined to take advantage of no-fault divorce laws to abandon their wives for other women (opting instead to bring them into the household). \n \n And perhaps polygamy will even cut down on pornography, once threesomes are no longer relegated to the world of naughty fantasy, but are a staple of routine married life. \n \n Polygamy, like homosexuality, has long and storied roots in antiquity. In the Bible, Abraham kept the concubine Hagar alongside his wife Sarah, and had sons with both. Hagar's descendants are modern day Muslims, who are permitted by the Koran to have up to four wives, provided they are all treated equally. \n \n Why are Muslims denied this Allah-given right by state laws? Why were the Mormons slaughtered and persecuted for practicing the ancient institution of polygamy? Mormon men took multiple wives to protect them spiritually; but even modern-day economics shows that married women fare better than unmarried women. Why not allow men to \"look out\" for more than one woman at a time? \n \n Considering same-sex marriage is like trying to walk on top of a chain-link fence: you'll fall off within minutes, and your only decision is which side of the fence to fall on: The side that favors keeping marriage between one man and one woman, the formula for baby-making and dual-gender parenting, or the side that favors letting any combination of men and women call themselves a marriage? \n \n But one can't walk along the top of the fence indefinitely. There's a 50 percent chance of falling onto the side that favors any collection of people as a marriage, and that's why this argument is wrong. In opposing gay marriage, we are defending marriage from something that does indeed threaten it.Edited to add: I realize I got off topic here, but same-sex marriage and polygomy threaten society, and that is why I place the two in the same ridiculous category.", 
   {
    "unicode_changes_made": true
   }, 
   55604, 
   null, 
   1088349960.0
  ], 
  [
   55729, 
   null, 
   "TheoMorphic", 
   "Please try to understand the point being made, and the subtle differences in my standing before making a knee jerk response. \n \n \nWell, why not polygomy? I mean heck, if were going to allow same-sex marriage in this country..... \n Because if same-sex marriage doesn't threaten real marriage, why should polygamy? There's not a dime's worth of difference between the two institutions when you study them. \n\n \n It's not a matter of allowing same-sex marriages (or polygamy). They are already allowed. The question is whether we want the law to view couples (or groups) differently from unmarried couples (or groups). My position is that there will be virtually no impact on the execution of the law if marriage (in the government's eyes) were considered to be between a man and a woman, and if it were considered to be between two individuals. \n \n Polygamy, on the other hand, would require a major re-evaluation of the law, and so any arguments that same-sex marriage and polygamy similar (again narrowing my scope to the execution of the law) is invalid.\n \n [/quote=jaaaman]Both same-sex marriage and polygamy are voluntary arrangements by consenting adults; why should we care what people do behind closed doors? [/quote]\n \n the government DOESN'T care what happens behind closed doors, unless the removal of someone's rights is taking place. This is why people can be \"married\" by their religion, with out having to check with the government first. This marriage would include polygamy, same-sex marriage, opposite sex marriage, and potentially even marriage to animals and children (so long as no laws are being broken, the government can not touch them). The marriage I am talking about is very different from the marriage contracts that the government honors. \n \n \nAnd if marriage need not be limited to one man and one woman - as many of you are saying - why need it be limited to couples only? What's so sacred about the number 2? \n\n \n \n Because changing the number from 2 to greater than 2 will require some major chances in how the law is applied. \n \n \nIt seems a bit arbitrary to allow one man to marry another man, but not to marry two women. Why should the government restrict his choice, provided his partners are willing? Would you all concede that letting groups of three, four or more marry would water down the meaning of marriage, which elevates and sanctifies the precise biological recipe for creating children? \n\n \n as I just explained, it's not arbitrary because raising the number to greater than 2 will require a major revamp of the laws... essentially it wouldn't be providing equal rights to all, but rather providing a new set of rights to people who happen to marry more than one person. \n \n \nMany homosexuals don't take the polygamy analogy seriously, or they become easily offended when the comparison is made. But there are many sound reasons to consider legalizing polygamy, advocates of same-sex marriage must admit.\n\n \n I have yet to hear any sound reasons as to why same-sex marriages, and polygamy is equivalent when considering how the government will view the two institutions. \n \n \nJust like people feel that they are born homosexual, which justifies their right to marry same-sex lovers, people also are born with the proclivity to have multiple sex partners. For many people, monogamy does not feel like their natural, biological state.\n\n \n and those people have the right to marry whatever sex they want, and to marry how ever many people the want. The question I'm focusing on is how the government would treat the groups differently. \n \n \nProponents of same-sex marriage claim it will have a stabilizing effect on homosexual ...\n \n Polygamy, like homosexuality, has long and storied roots in antiquity...\n \n Why are Muslims denied this Allah-given right by state laws? Why were the Mormons slaughtered and persecuted for practicing the ancient institution of polygamy?...\n \n\n \n you seem to be making things up now. No one in this thread is trying to make the arguments you are reciting now. This thread was very specifically focused on the actual legality of polygamy RIGHT NOW, and the reasons why polygamy shouldn't be recognized by the law.\n \n \n \nConsidering same-sex marriage is like trying to walk on top of a chain-link fence: you'll fall off within minutes, and your only decision is which side of the fence to fall on: The side that favors keeping marriage between one man and one woman, the formula for baby-making and dual-gender parenting, or the side that favors letting any combination of men and women call themselves a marriage?\n\n \n and I have just shown when viewed from the government's perspective, there isn't a chain link fence at all. There is opposite-sex marriage and same-sex marriage on one side, and polygamy on the other. \n \n \nIn opposing gay marriage, we are defending marriage from something that does indeed threaten it.\n\n \n you haven't shown how polygamy threatens anything, and even if you did you would have to show that same-sex marriages and polygamy are so interconnected that you couldn't possibly have one with out the other. Only the opponents of same-sex marriages seem to draw such a strong connection. \n \n \nEdited to add: I realize I got off topic here, but same-sex marriage and polygomy threaten society, and that is why I place the two in the same ridiculous category.\n\n \n Please make sure you understand the subtle point of my OP. there is a difference between marriage in the eyes of the state, and marriage in the eyes of a particular religion. ANY practice by ANY religion is legal, provided it doesn't infringe on the rights of any given individual. Marriage by the state is a clearly defined thing that has very particular benefits. To allow those benefits to one group, and not to another when the actual execution of the benefits will not significantly change is discrimination. Any arguments from morality, or connections to other acts are irrelevant since the practices are already allowed. The only thing that will change is how the law is executed.", 
   {
    "unicode_changes_made": true
   }, 
   55719, 
   null, 
   1088362560.0
  ], 
  [
   55730, 
   null, 
   "Sigma", 
   "\n I have yet to hear any sound reasons as to why same-sex marriages, and polygamy is equivalent when considering how the government will view the two institutions. \n \n\n \n I believe I understand your point, in that the gov't will not have to make major changes to the law in order to allow same-sex marriage, while having to make larger changes (I don't know about major changes, as you assert) to allow polygamy.\n \n What you don't seem to realize is that they are exactly the same in terms of civil rights. The exact same arguments that are used for gay marriage can be used for polygamy. How easy or hard it is for the gov't to provide those equal rights is immaterial. All groups should be allowed equal rights.\n \n Using your argument, it is easy to turn around. Gay marriage is already allowed, it simply has no gov't sanctions. There is no need for the gov't to allow gay marriage, because they can still be married. They simply will not get any gov't benefits. Those that hoot and holler about the philosophical component that because a gay couple love each other same as a heterosexual couple, and what does gay marriage affect them for anyway, well how does polygamy affect you? Do they love each other any less because there are more? Will the children be any less loved?\n \n Kronus has a point that despite the fact that every group deserves equal rights, the world will not accept polygamy simply because it is different and religious groups will scream about non-traditional marriage (sound familiar?). It'll take many people pressuring the gov't before it will bestow equal rights.", 
   {}, 
   55729, 
   null, 
   1088363400.0
  ], 
  [
   55740, 
   null, 
   "TheoMorphic", 
   "What you don't seem to realize is that they are exactly the same in terms of civil rights. The exact same arguments that are used for gay marriage can be used for polygamy. How easy or hard it is for the gov't to provide those equal rights is immaterial. All groups should be allowed equal rights.\n\n \n My argument is that the difference between how the government views a married couple, and how a government would view a married group would be so different, that they could not be seen as equivalent, and so a demand for equal rights could not be invoked.\n \n \nThere is no need for the gov't to allow gay marriage, because they can still be married. They simply will not get any gov't benefits. Those that hoot and holler about the philosophical component that because a gay couple love each other same as a heterosexual couple, and what does gay marriage affect them for anyway, well how does polygamy affect you? Do they love each other any less because there are more? Will the children be any less loved?\n\n \n I'll ignore this part since you seem to be responding to a philosophical argument (one that i haven't made, and for reasons specifically stated in the OP shouldn't apply to this thread).\n \n \n It'll take many people pressuring the gov't before it will bestow equal rights.\n\n \n again, i'm not touching the traditional definition of marriage, or what people are comfortable with. my only concern is if the government is treating one group of people differently from another group of people for a very trivial reason. \n \n The way the government views a 2 person marriages and a multiple person marriages would be so different as to not be able to call the two views equal. \n \n on the other hand, the way the government views a man/woman couple, and a woman/woman couple would be essentially equal, and the call for equality would apply.", 
   {
    "unicode_changes_made": true
   }, 
   55730, 
   null, 
   1088371380.0
  ], 
  [
   55743, 
   null, 
   "Sigma", 
   "My argument is that the difference between how the government views a married couple, and how a government would view a married group would be so different, that they could not be seen as equivalent, and so a demand for equal rights could not be invoked.\n \n on the other hand, the way the government views a man/woman couple, and a woman/woman couple would be essentially equal, and the call for equality would apply.\n\n \n The gov't would only view the group and the couple differently if society viewed them differently. The gov't views straight and gay couples differently because society does as well. The equivalence is there as it is between gay and straight couples. I have shown the arguments for gay marriage can and do apply to polygamist marriage.\n \n If you are not talking about the philosophical aspect, then I'll lay off of that (I apologize, I did miss that).\n \n I believe that the gov't viewing gay couples as different is exactly as valid as viewing a polygamist marriage as different. The fact that a gay couple has only two members is irrelevent to me. If you are simply discussing cost of changing forms to apply to polygamist marriage, then you do have a point. A polygamist marriage would require more forms to completely fill out dependents and wives and the like, but I do not view that as an undue burden. Couples with many children would require the same. With as complicated as marriage is (with multiple divorce, multiple children, adoption, dependence delared by multiple parties, etc.) I do not believe polygamy would make it much more so. Even if it does so, I do not believe that they should be denied rights upon those grounds.", 
   {}, 
   55740, 
   null, 
   1088374740.0
  ], 
  [
   55768, 
   null, 
   "JakeCJB", 
   "Polygamy is different, I believe for at least two reasons:\n \n 1. There is no limit to the number of people who can enter the polygamous marriage contract. This would make it much different from same-sex couples, different-sex couples, inter-religious couples, or inter-racial couples.\n \n 2. If one polygamous partner becomes dependent, it is not clear whose responsibility it is to look after that partner, unlike with a couple. With polygamy, it is not clear whose responsibility it is to look after any dependent children if one partner cannot, unlike with a couple.", 
   {}, 
   55743, 
   null, 
   1088385600.0
  ], 
  [
   55771, 
   null, 
   "Sigma", 
   "Polygamy is different, I believe for at least two reasons:\n \n 1. There is no limit to the number of people who can enter the polygamous marriage contract. This would make it much different from same-sex couples, different-sex couples, inter-religious couples, or inter-racial couples.\n\n \n Why is this significant? If they all love each other? They of course have to eat, so in the end there will be a practical limit.\n \n \n\n 2. If one polygamous partner becomes dependent, it is not clear whose responsibility it is to look after that partner, unlike with a couple. With polygamy, it is not clear whose responsibility it is to look after any dependent children if one partner cannot, unlike with a couple.\n\n \n I am not certain what you mean by \"becomes dependent\". Do you mean if they have an accident and the bills must be paid? If it is one of the women, the husband, if the husband then the first or most senior wife. It can be this, or it can be something else, as long as it is workable. I do not believe there would be a huge problem with children. There is a birth mother, the father, and the rest are aunts of a sort and help take care of the child.\n \n The fact that you bring up technical points such as this shows me that you have no real recource to legalizing it, but are merely trying to get into the practicality of it. We can make it work.\n \n This is akin to asking \"what will the children say when they are asked who their mommy is and they have no mommy?\". It does have to be dealt with but has no bearing on whether to legalize it or not.", 
   {}, 
   55768, 
   null, 
   1088386920.0
  ], 
  [
   55782, 
   null, 
   "JakeCJB", 
   "Sigma: I was merely pointing out that polygamy presents different issues, I was not saying whether or not those different issues can or should be worked out legally. Please read \"becomes\" or \"is\" in my point #2.\n \n At any rate, I don't see the connection to gay rights, and how what happens with gay rights affects those involved with polygamy in any way. If gay marriage is not legalized, how will it affect those involved in polygamy? If it is legalized, how does this affect those who are involved in polygamy?", 
   {}, 
   55771, 
   null, 
   1088391000.0
  ], 
  [
   55784, 
   null, 
   "georged", 
   "Sigma: I was merely pointing out that polygamy presents different issues, I was not saying whether or not those different issues can or should be worked out legally. Please read \"becomes\" or \"is\" in my point #2.\n \n At any rate, I don't see the connection to gay rights, and how what happens with gay rights affects those involved with polygamy in any way. If gay marriage is not legalized, how will it affect those involved in polygamy? If it is legalized, how does this affect those who are involved in polygamy?\n\n \n One issue to consider is that polygamy is normally practiced among heterosexuals for the purpose of reproduction. That's how the feds stamp them out using puritan era bigamy laws. The major problem that produced was the fundamentalists still take ten or whatever wifes and proceed to reproduce on a grand scale. All but the legal wife raise their children courtesy of the taxpayers. I don't see that problem being created within the Gay community.", 
   {}, 
   55782, 
   null, 
   1088391780.0
  ], 
  [
   55793, 
   null, 
   "Sigma", 
   "Sigma: I was merely pointing out that polygamy presents different issues, I was not saying whether or not those different issues can or should be worked out legally. Please read \"becomes\" or \"is\" in my point #2.\n \n At any rate, I don't see the connection to gay rights, and how what happens with gay rights affects those involved with polygamy in any way. If gay marriage is not legalized, how will it affect those involved in polygamy? If it is legalized, how does this affect those who are involved in polygamy?\n\n \n Polygamy does indeed present issues. I believe homosexual marriage produces issues as well. I am not saying that those issues invalidate gay marriage, but you must agree it does raise issues (why else is it such a controversial subject :P )\n \n The connection is that gay marriage opens up society to the option of the non-traditional marriage. Whether this is good or bad is up for debate. The same arguments that favor gay marriage also favor other non-traditional marriage.", 
   {}, 
   55782, 
   null, 
   1088405520.0
  ], 
  [
   55799, 
   null, 
   "TheoMorphic", 
   "Polygamy does indeed present issues. I believe homosexual marriage produces issues as well. I am not saying that those issues invalidate gay marriage, but you must agree it does raise issues (why else is it such a controversial subject :P )\n\n \n it's a controversial issue because the religious right believes the government's idea of marriage should be the same as the christian church's idea of marriage (regardless of the present obvious differences). \n \n \nThe connection is that gay marriage opens up society to the option of the non-traditional marriage. Whether this is good or bad is up for debate. The same arguments that favor gay marriage also favor other non-traditional marriage.\n\n \n The specific argument in this thread shows that the arguments in favor of gay marriages do not favor polygamy. Hypothetical situations such as \"what happens to the kids if this happens\", and \"are all the wives considered family for visitation purposes in a hospital\" and \"if one should suddenly die who does the inheritance go to\" are all valid questions because they have to be considered and dealt with. Similar questions regarding gay marriages have already been answered by opposite sex marriages. \n \n Regardless of how quickly you can come up with answers on the spot, they are situations that have not been dealt with by the judicial system. However easy the solution comes, they are new solutions that are not similar to the solutions for same-sex marriages. This makes the fight for polygamy a fight for a new set of rights, and not the same rights of opposite-sex marriages, and same-sex marriages.", 
   {
    "unicode_changes_made": true
   }, 
   55793, 
   null, 
   1088413440.0
  ], 
  [
   55800, 
   null, 
   "Sigma", 
   "it's a controversial issue because the religious right believes the government's idea of marriage should be the same as the christian church's idea of marriage (regardless of the present obvious differences). \n\n \n Exactly. Issues.\n \n \n\n The specific argument in this thread shows that the arguments in favor of gay marriages do not favor polygamy. Hypothetical situations such as \"what happens to the kids if this happens\", and \"are all the wives considered family for visitation purposes in a hospital\" and \"if one should suddenly die who does the inheritance go to\" are all valid questions because they have to be considered and dealt with. Similar questions regarding gay marriages have already been answered by opposite sex marriages. \n\n \n Valid questions only if it is accepted that it is a valid relationship. Otherwise those questions have no meaning. The difficulty in the details does not negate the validity of the relationship. It does not negate that this non-traditional marriage should be validated as a loving relationship.\n \n \n\n Regardless of how quickly you can come up with answers on the spot, they are situations that have not been dealt with by the judicial system. However easy the solution comes, they are new solutions that are not similar to the solutions for same-sex marriages. This makes the fight for polygamy a fight for a new set of rights, and not the same rights of opposite-sex marriages, and same-sex marriages.\n\n \n How I answer has no meaning. The technicalities of the law is irrelevant unless you accept that the relationship should be covered under the law. How easy or hard it would be to implement does not negate that the core argument of gay marriage (that of equal civil rights) can be used in an uncorrupted form to support polygamy. I'm afraid I missed where it was shown that they don't.\n \n Neg, not new rights but existing rights applied to a new situation. Same as gay marriage. I am not sure what you mean by saying that similar questions have been answered by opposite sex relationships. How is the difficulty of asking a childs mother to sign something when that child has no mother already answered by heterosexual relationships?", 
   {
    "unicode_changes_made": true
   }, 
   55799, 
   null, 
   1088417700.0
  ], 
  [
   55876, 
   null, 
   "TheoMorphic", 
   "The difficulty in the details does not negate the validity of the relationship. It does not negate that this non-traditional marriage should be validated as a loving relationship.\n\n \n This thread is not about the argument that same-sex marriages or polygamists can form loving relationships. Marriage by the state does not require a loving relationship.\n \n \nHow easy or hard it would be to implement does not negate that the core argument of gay marriage (that of equal civil rights) can be used in an uncorrupted form \n to support polygamy. I'm afraid I missed where it was shown that they don't.\n\n \n I did not say that just because it would be difficult to implement, polygamy shouldn't be honored. I'm saying that in changing the rules of implementing polygamy, the rules would be so different from 2 person marriages that the polygamists are no longer calling for equal rights, but instead calling for compensation. \n \n Maybe that is a valid position (that polygamists should have a different set of rights and benefits to make up for the 2 person marriage contract that they probably won't take advantage of), but that position is outside the scope of this thread. \n \n \nHow is the difficulty of asking a childs mother to sign something when that child has no mother already answered by heterosexual relationships?\n\n \n because those forms usually don't say \"have your mother sign\" but rather \"have your parent or legal guardian sign\". \n \n \n If you have any actual examples of the law requiring a woman and/or a man for a situation to work then please list it. Otherwise my position holds.", 
   {
    "unicode_changes_made": true
   }, 
   55800, 
   null, 
   1088450040.0
  ], 
  [
   56059, 
   null, 
   "Sigma", 
   "This thread is not about the argument that same-sex marriages or polygamists can form loving relationships. Marriage by the state does not require a loving relationship.\n\n \n Certainly it does not. It doesn't require children, love, commitment or anything else for that matter. Only a desire to be married. Heck, hardly even that, merely a willingness to go through the process.\n \n \n\n I did not say that just because it would be difficult to implement, polygamy shouldn't be honored. I'm saying that in changing the rules of implementing polygamy, the rules would be so different from 2 person marriages that the polygamists are no longer calling for equal rights, but instead calling for compensation. \n\n \n I don't believe it would require all that much change. Change, certainly, because it is different, but certainly not enough to make it prohibitive. Homosexual marriage requires change as well, simply not enough to make it prohibitive. Homosexual marriage certainly requires a significant change in how we view marriage.\n \n I still insist that polygamy is asking for equal rights, not extra rights. Asking that the definition of a relationship include more people is not asking for more rights for that relationship.\n \n \n\n Maybe that is a valid position (that polygamists should have a different set of rights and benefits to make up for the 2 person marriage contract that they probably won't take advantage of), but that position is outside the scope of this thread. \n\n \n I do not wish polygamist to have a different set of rights anymore than I ask that homosexuals be given a different set of rights. I do not believe polygamists need more rights to make up for 2 person marriage contract parts they do not take advantage of. That I do not take advantage of certain parts of the law does not mean I need extra rights to make up for it.\n \n \n\n because those forms usually don't say \"have your mother sign\" but rather \"have your parent or legal guardian sign\". \n\n \n I could swear they had things like that in elementary school, but my memory isn't very reliable. Regardless, there are situations, particularly social, that having an extra one or the other sex as a parent would make it awkward.\n \n \n\n If you have any actual examples of the law requiring a woman and/or a man for a situation to work then please list it. Otherwise my position holds.\n\n \n Oh, no, I do not believe a section of the law requires one or the other sex, or at least it should not in regards to parenting. Either sex can do at least a decent job of parenting (I usually believe having both is ideal as each sex can give the child a different experience growing up).", 
   {
    "unicode_changes_made": true
   }, 
   55876, 
   null, 
   1088543700.0
  ], 
  [
   56069, 
   null, 
   "TheoMorphic", 
   "I don't believe it would require all that much change. Change, certainly, because it is different, but certainly not enough to make it prohibitive. Homosexual marriage requires change as well, simply not enough to make it prohibitive.\n\n \n I personally can't think of any instance where a man/woman marriage is required, and apparently you can't either (as said in the bottom of your last post). As opposed to polygamy, where a few situations come readily to mind: Can an individual marry someone with out the consent of other people they are married to? Do gift taxes apply to everyone in the group, or only pairs in the group? What happens if one of the members of the marriages dies unexpectedly. Who gets the inheritance? \n \n \nHomosexual marriage certainly requires a significant change in how we view marriage.\n\n \n no change is required at the state or federal government level, and that is the only change that matters for this discussion.\n \n \nI still insist that polygamy is asking for equal rights, not extra rights. Asking that the definition of a relationship include more people is not asking for more rights for that relationship.\n\n \n how have the above examples already been dealt with in 2 person marriages?\n \n \nRegardless, there are situations, particularly social, that having an extra one or the other sex as a parent would make it awkward.\n\n \n is it acceptable to deny equal rights based on awkward situations?\n \n \n(I usually believe having both is ideal as each sex can give the child a different experience growing up).\n\n \n but since the government generally has a hands off policy on telling how parents should raise their kids, what does your belief about this matter at all? Similarly it's an ideal situation to not have parents that divorce or smoke, but this is not justification to ban smoking or divorces.", 
   {
    "unicode_changes_made": true
   }, 
   56059, 
   null, 
   1088546940.0
  ], 
  [
   56073, 
   null, 
   "Sigma", 
   "I personally can't think of any instance where a man/woman marriage is required, and apparently you can't either (as said in the bottom of your last post). As opposed to polygamy, where a few situations come readily to mind: Can an individual marry someone with out the consent of other people they are married to? Do gift taxes apply to everyone in the group, or only pairs in the group? What happens if one of the members of the marriages dies unexpectedly. Who gets the inheritance? \n\n \n Where is a couple required by law in something? Certainly, laws mention couples, but laws also mention husbands and wives.\n \n It is easy enough to apply these to polygamy. If a member dies, every person that person is married to gets a portion, similar to if a partner dies the survivor gets the whole, or if a mother dies each child gets a portion of the estate (if she is the sole survivor of the relationship). I believe any situation that involves a couple is easy to apply to a polygamous relationship.\n \n As to consent, why would they need the consent of current relationship? If you have 2 girlfriends, does one need the consent of the other? Either one may decide not to have a relationship with you anymore if they did not want to do this, or if you two had not decided ahead of time it was an \"open\" relationship, but this should be left up to the people within the relationship.\n \n I'm not terribly familiar with gift taxes. Personally, I do not believe there should be these huge benefits for being married, but that does not apply to the current discussion ;)\n \n \n \n\n no change is required at the state or federal government level, and that is the only change that matters for this discussion.\n\n \n Societal views do affect the state and federal gov't level. As you can see with the current administration.\n \n \n\n is it acceptable to deny equal rights based on awkward situations?\n\n \n No, I never believe this. You cannot deny they exist however.\n \n Is it acceptable to deny equal rights based on how difficult it would be to implement?\n \n \n\n but since the government generally has a hands off policy on telling how parents should raise their kids, what does your belief about this matter at all? Similarly it's an ideal situation to not have parents that divorce or smoke, but this is not justification to ban smoking or divorces.\n\n \n In general yes. However, especially with the new smoking laws the gov't is putting it's sticky little hands into it. It is ironic to me that it is generally a liberal view to put these restrictions in place, while your view is generally liberal as well. My belief doesn't matter directly, no, but I cannot resist putting my personal beliefs into my arguments :P\n \n I do not believe the gov't should restrict who marries or the size of the marriage.", 
   {
    "unicode_changes_made": true
   }, 
   56069, 
   null, 
   1088549400.0
  ], 
  [
   56077, 
   null, 
   "TheoMorphic", 
   "If a member dies, every person that person is married to gets a portion, similar to if a partner dies the survivor gets the whole, or if a mother dies each child gets a portion of the estate (if she is the sole survivor of the relationship). I believe any situation that involves a couple is easy to apply to a polygamous relationship.\n \n As to consent, why would they need the consent of current relationship? If you have 2 girlfriends, does one need the consent of the other? Either one may decide not to have a relationship with you anymore if they did not want to do this, or if you two had not decided ahead of time it was an \"open\" relationship, but this should be left up to the people within the relationship.\n\n \n Taking these two points together, if person A marries person C with our person's B's consent, and person C dies, does person B have any claim to person C's fortune? I'm sure there is a fair way to implement this, however for the simple reason that this situation has never been addressed before in a court is evidence that polygamists aren't trying to gain access to a institution that is already available to other people. Granted there are similarities, but new considerations will have to be taken into account. \n \n \nI'm not terribly familiar with gift taxes.\n \n \n generally a married couple can transfer money to and from each other with out paying the taxes usually associated with the giving of money. Would this be the same case for a married group? or just the consenting pairs? And again these are rhetorical questions. Just because I have to ask them means polygamists aren't trying to gain access to situations that another group already has access to. \n \n \nSocietal views do affect the state and federal gov't level. As you can see with the current administration.\n\n \n but when discrimination is taking place, societal views generally doesn't matter. \n \n \nNo, I never believe this. You cannot deny they exist however.\n\n \n alright... I don't deny it. Care to mention anything else irrelevant to the discussion that can not be denied?\n \n \nIs it acceptable to deny equal rights based on how difficult it would be to implement?\n\n \n no... fortunately I've never tried to make a case against polygamy because it would be difficult to implement. \n \n \n It is ironic to me that it is generally a liberal view to put these restrictions in place, while your view is generally liberal as well. \n\n \n take a look at what I'm arguing, and not what the stereotypical me is arguing. \n \n \nI do not believe the gov't should restrict who marries or the size of the marriage.\n\n \n how a marriage is treated in the eyes of the law does not depend on the gender of the people involved in the marriage. How a marriage is treated in the eyes of the law does depend on how many people are involved.", 
   {
    "unicode_changes_made": true
   }, 
   56073, 
   null, 
   1088551080.0
  ], 
  [
   56096, 
   null, 
   "Kronus", 
   "It sounds like you two aren't really disagreeing, per se. Sigma is saying that in a perfect world, gay marriage and group marriage would be legal. Theo is saying that there are more legal and social issues with group marriage. These two statements don't contradict each other. What, exactly, are you arguing about?", 
   {}, 
   56077, 
   null, 
   1088555700.0
  ], 
  [
   56098, 
   null, 
   "Sigma", 
   "Taking these two points together, if person A marries person C with our person's B's consent, and person C dies, does person B have any claim to person C's fortune? I'm sure there is a fair way to implement this, however for the simple reason that this situation has never been addressed before in a court is evidence that polygamists aren't trying to gain access to a institution that is already available to other people. Granted there are similarities, but new considerations will have to be taken into account. \n\n \n I do agree.\n \n \n \n\n generally a married couple can transfer money to and from each other with out paying the taxes usually associated with the giving of money. Would this be the same case for a married group? or just the consenting pairs? And again these are rhetorical questions. Just because I have to ask them means polygamists aren't trying to gain access to situations that another group already has access to. \n\n \n Specific situations, no. General situation, marriage, yes.\n \n \n \n\n but when discrimination is taking place, societal views generally doesn't matter. \n\n \n I'm not sure I know what you mean... societal views are what create the discrimination, and what needs to be overcome to gain equal rights.\n \n \n\n alright... I don't deny it. Care to mention anything else irrelevant to the discussion that can not be denied?\n\n \n Not irrelevant. You said there are problems with polygamy, there are problems with homosexual marriage. Not necessaraly comparable problems, but problems nontheless.\n \n \n\n no... fortunately I've never tried to make a case against polygamy because it would be difficult to implement. \n\n \n Neither have I ever tried to make a case against gay marriage, period.\n \n \n\n take a look at what I'm arguing, and not what the stereotypical me is arguing.\n\n \n I apologize. I was speaking about the general position, not you in particular.\n \n \n \n\n how a marriage is treated in the eyes of the law does not depend on the gender of the people involved in the marriage. How a marriage is treated in the eyes of the law does depend on how many people are involved.\n\n \n Marriage, currently, is only between a man and a woman (legally, despite the recent happenings. The recent gay marriages may be overturned.). How the law treats marriage is subject to change according to the will of the people.", 
   {
    "unicode_changes_made": true
   }, 
   56077, 
   null, 
   1088556240.0
  ], 
  [
   56246, 
   null, 
   "TheoMorphic", 
   " Theo is saying that there are more legal and social issues with group marriage. These two statements don't contradict each other. What, exactly, are you arguing about?\n\n \n Perhaps Sigma thinks that in a perfect world group marriage would be legal (sanctioned by the government with benefits), but my argument is that that position cannot be argued by demanding \"equal\" rights for polygamists. It seems to me that Sigma's position is that the way the law would treat polygamists would be identical to how the law now treats opposite-sex marriages (and consequently how the law would treat same-sex marriages).\n \n I don't believe this is the case.", 
   {}, 
   56096, 
   null, 
   1088635440.0
  ], 
  [
   56256, 
   null, 
   "TheoMorphic", 
   " Specific situations, no. General situation, marriage, yes.\n\n \n What specific situation in a homosexual marriage can not be answered by examining a heterosexual marriage? \n \n \nI'm not sure I know what you mean... societal views are what create the discrimination, and what needs to be overcome to gain equal rights.\n\n \n Regardless of how many people oppose something, if a violation of the constitution is taking place the situation must be adjusted so that violation no longer is happening. I'm not talking about combating the prejudices the general population has against polygamists. I'm talking about what the US government has to do REGARDLESS of what the majority thinks (unless of course the constitution was amended to allow discrimination, which would be a very sad day).\n \n Homosexuals are being discriminated against because they do not have access to an institution. Polygamists are not being discriminated against because they have access to the institution (they are just unlikely to take advantage of it). If society eventually wants to decide that polygamy is a viable way of life, and if society wants to reward people for entering into a group marriage, then legislation will be passed that will enable it, and give them benefits comparable to heterosexual marriages. \n \n But I am not debating you on weather society's view should change to allow polygamy, or if legislation should be passed to benefit polygamy. I am saying that polygamy can not be argued from a \"demand for equal rights\" perspective. \n \n \nNot necessaraly comparable problems, but problems nontheless.\n\n \n Back in post 24 you said that a child not being able to get their mother to sign a release form was a situations in gay marriages that has not been answered by heterosexual marriages. I said that those documents don't ask for a \"mother\" but a \"parent or legal guardian\". \n \n We're talking about problems and new situations in the eyes of the law... awkward situations don't count.\n \n \nHow the law treats marriage is subject to change according to the will of the people.\n\n \n Unless the will of the majority violates the constitutional rights of any individuals. In that case the rights of the individuals must be preserved.", 
   {
    "unicode_changes_made": true
   }, 
   56098, 
   null, 
   1088637240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Polygamy", 
  "url": "http://www.4forums.com/political/gay-rights-debates/2626-polygamy.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 2626, 
  "discussion_files": [
   [
    "13503.html", 
    "http://www.4forums.com/political/gay-rights-debates/2626-polygamy-print.html"
   ], 
   [
    "13504.html", 
    "http://www.4forums.com/political/gay-rights-debates/2626-polygamy-3-print.html"
   ], 
   [
    "13505.html", 
    "http://www.4forums.com/political/gay-rights-debates/2626-polygamy-2-print.html"
   ]
  ], 
  "identifier": 2626
 }
]