[
 [
  [
   2739, 
   null, 
   "hetero-male", 
   "what do you people think about college? it is popular to force kids into college and fearmongering them about flipping burgers if they don't went to college plus they are like big businesses. they only teach you to drink, party and do drugs, doing assignments and tests", 
   {
    "post_info": {
     "post_title": "does anybody think college is over-rated and a waste of time?"
    }
   }, 
   null, 
   null, 
   1045896360.0
  ], 
  [
   2919, 
   null, 
   "hetero-male", 
   "it seems like everybody is dodging this topic", 
   {}, 
   2739, 
   null, 
   1045981200.0
  ], 
  [
   2921, 
   null, 
   "Broker", 
   "And you get your masters in business and bring home a 64 million dollar bonus. Why did I waste my time?", 
   {}, 
   2739, 
   null, 
   1045981440.0
  ], 
  [
   2950, 
   null, 
   "thistownwilleat", 
   "Is that all you think about....getting a high paying job and becoming rich? That's not why I came to college. It was to get a job I loved, not one that paid a lot.", 
   {}, 
   2739, 
   null, 
   1045996440.0
  ], 
  [
   2952, 
   null, 
   "sarablaze", 
   "High school drop out here! I only wish I would have listened!\n I hate my job. Not only does the pay suck, (I can barely afford to pay rent let alone enjoy a movie or a nice dinner out)I can't stand waking up and knowing that I have to do something I don't like and may have to do it forever, or until I GO BACK TO SCHOOL!\n I could have been in college for two and a half years now. I only wish I would have listened.emoticon_angry", 
   {}, 
   2739, 
   null, 
   1046006220.0
  ], 
  [
   2958, 
   null, 
   "Broker", 
   "Thistown, high salary is a nice indicator. Leadership of any sort is my passion...that's why I plan to go into business and then later politics.", 
   {}, 
   2739, 
   null, 
   1046015100.0
  ], 
  [
   2971, 
   null, 
   "thistownwilleat", 
   "Indicator of what?", 
   {}, 
   2739, 
   null, 
   1046030100.0
  ], 
  [
   2978, 
   null, 
   "Broker", 
   "If you wasted your time", 
   {}, 
   2739, 
   null, 
   1046036040.0
  ], 
  [
   2988, 
   null, 
   "ghettocracka", 
   "broker, if you think that getting a business masters will get you to be a millionaire, youve got a nice surprise comming to you\n \n that only happens to the few that start kick XXX businesses, the others make average college graduating salaries\n \n \n so what opportunities do the people who do not graduate from college have?, lets see, ummmm... flipping burgers, fun fun im sure you can think of others\n \n and just because smoking pot and drinking is popular in college does not mean it is a waste of time, youll find out when you get there, college is worthwile", 
   {}, 
   2739, 
   null, 
   1046045760.0
  ], 
  [
   2995, 
   null, 
   "Broker", 
   "The average salary for an executive in this area is 350,000. Lowest is around 200,000, highest 600,000. The only thing people want is a masters in business administration and a good working attitude...about twenty businesses looking to fill executive positions. I think I'd do quite well.", 
   {}, 
   2739, 
   null, 
   1046049780.0
  ], 
  [
   3009, 
   null, 
   "Stormin Norman", 
   "what do you people think about college? it is popular to force kids into college and fearmongering them about flipping burgers if they don't went to college plus they are like big businesses. they only teach you to drink, party and do drugs, doing assignments and tests\n\n \n This has got to be one of the dumbest questions that I have ever been asked. Most educated people understand that knowledge is power. One can look at the fact that the college graduate's income is, on average, greater than those who never attended college. If that does not convince you, look at the job opportunities for both segments of the population. Without having a college education your choices are most definetely local. Where as, the person with a degree may have global opportunities. If the job market goes south, businesses start rounds of lay-offs. The first jobs to get cut are those people who are less efficient, and who have less skills. In short, the college graduate has more value to the job market, as their skills are more specialized. The fact that they were able to remain committed to education and finish a four year program in their discipline also speaks to the character of that person. It shows that the college graduate can make a goal and stick to it.\n \n The claim that colleges only teach how to drink, party and do drugs is a ridiculous charge. I attend college, and the value of the education that I a receiving is great, not only because of the sharp increase in income, but because of the method and mode of thinking that I cultivated during my time learning. Even while attending college, I have been able to land a position where most of my co-workers have their degrees. My income even while attending college has increased drastically. My mind is sharper. Finally, my sense of self-worth has become enormous.", 
   {}, 
   2739, 
   null, 
   1046053320.0
  ], 
  [
   3010, 
   null, 
   "ghettocracka", 
   "where you go to skool stormin??", 
   {}, 
   2739, 
   null, 
   1046053500.0
  ], 
  [
   3011, 
   null, 
   "ghettocracka", 
   "so broker do you think that everyone that gets a masters in business administration will recieve those 6 figures you talk about???\n \n yes companies do hire people to run businesses, but i can tell you that not many make 6 figures starting out\n \n sounds like your only doing it because you think your gonna earn mad cash, do something that you enjoy", 
   {}, 
   2739, 
   null, 
   1046053680.0
  ], 
  [
   3015, 
   null, 
   "Broker", 
   "Business and leadership are my passions, and it is what I have wanted to do. And yes, those are starting salaries...", 
   {}, 
   2739, 
   null, 
   1046054340.0
  ], 
  [
   3048, 
   null, 
   "thistownwilleat", 
   "Guess what the number one major chosen by college students is? You guessed it...business, I assure you that the hundreds of thousands of people graduating with a business degree are not making 6 figures. Here the average starting salary for a business major is 34,000, I checked a few other schools and they seem to be about the same. Not a bad salary, but it won't have people grovelling at your feet in the way that you hope it would. Why, might I ask, are you so obsessed with such a tiny part of life?", 
   {}, 
   2739, 
   null, 
   1046063100.0
  ], 
  [
   3056, 
   null, 
   "sarablaze", 
   "Hetero,\n I don't have statistics, but here is a list of jobs, you can get, at a young age, with no experience, and no education.\n fast food, gas station, telemarketing, cashier, bag people's groceries, babysitting, janitor(depending on where).\n 9 times out of 10, you won't make more than 8 dollars an hour, and you will be working hard enough to deserve 15 an hour, but will make no such thing.", 
   {}, 
   2739, 
   null, 
   1046064060.0
  ], 
  [
   3066, 
   null, 
   "ghettocracka", 
   "very true\n \n actually i know a guy who works in a cubicle and punches numbers into a computer all day, he makes about 15 an hour\n \n but an extremely boring job", 
   {}, 
   2739, 
   null, 
   1046065080.0
  ], 
  [
   3086, 
   null, 
   "Stormin Norman", 
   "where you go to skool stormin??\n\n \n There is a reputable clown college that exists locally. Fortunately, their science and engineering programs are excellent. Even though I chose basketweaving as my major, they require you to get a good cross-over education in philosophy, history, science, and engineering. I can only hope that these other areas of education will help me in my skills as a basket crafter.", 
   {}, 
   2739, 
   null, 
   1046069520.0
  ], 
  [
   3151, 
   null, 
   "ghettocracka", 
   "and the name of that school is?", 
   {}, 
   2739, 
   null, 
   1046131620.0
  ], 
  [
   3168, 
   null, 
   "Broker", 
   "I found an entry level job that requires a masters and pays 75,000 starting. There's your six years experience. :P", 
   {}, 
   2739, 
   null, 
   1046148000.0
  ], 
  [
   3190, 
   null, 
   "thistownwilleat", 
   "Okaay, that would be five figures, and anyway guess how many openings there are for that job...now guess how many thousands of people you are going to be competing with. A lot of business majors are only business majors because they don't know what they want to do, and a lot of the rest are deluded like yourself that to get a business major is like winning the lottery. The result is there not enough jobs.", 
   {}, 
   2739, 
   null, 
   1046153640.0
  ], 
  [
   3219, 
   null, 
   "Broker", 
   "Ha! Welcome to Florida! Executive jobs open left and right if you can search them in the right place on one of the job sites.", 
   {}, 
   2739, 
   null, 
   1046182320.0
  ], 
  [
   3220, 
   null, 
   "ghettocracka", 
   "there are executive jobs everywhere, as far as i know, flordia is no different\n \n and what makes you think your going to get one of those few exec jobs that thousands of people are looking for and competing over?", 
   {}, 
   2739, 
   null, 
   1046204040.0
  ], 
  [
   3242, 
   null, 
   "mazet", 
   "College has many purposes.\n \n First, after graduating college, one is more likely to be hired for a higher paying job.\n \n Also, one would have more jobs open to them, and therefore more fun/interesting jobs.\n \n Furthermore, anyone who goes to colelge has more respec then if they didn't.\n \n The major exception that I can think of at the moment is when someone happens to be offered a really good job offer becuase of some high (usually self-taught) skill before they have the chance to go to college, and the chance will be gone if they wait.", 
   {}, 
   2739, 
   null, 
   1046213100.0
  ], 
  [
   3262, 
   null, 
   "hetero-male", 
   "Originally posted by sarablaze \n Hetero,\n I don't have statistics, but here is a list of jobs, you can get, at a young age, with no experience, and no education.\n fast food, gas station, telemarketing, cashier, bag people's groceries, babysitting, janitor(depending on where).\n 9 times out of 10, you won't make more than 8 dollars an hour, and you will be working hard enough to deserve 15 an hour, but will make no such thing. \n \n \n Sara I was forced to go to college because my mom watch too much tv and talentless teenage movies(mainly the college types)\n and she use fearmongering tactics like what you are doing. and always saying \"college is fun\" like everybody else. I did not get the time to think about the subject areas that college offers and i don' really know what I am good at. classes are from 8am until 4-6pm and they want people to do 6-7 subjects per-semester with tons of assignments and part-time jobs are hard to find in my college. this is my second year in college and i quit my previous part-time job because of poor working conditions. all of this bookwork won't give you job skills magically. what happened to apprenticeships and learning on the job?", 
   {}, 
   2739, 
   null, 
   1046226840.0
  ], 
  [
   3282, 
   null, 
   "thistownwilleat", 
   "I understand that people can learn just as much on the job as they do in college, but here's the bottom line, an employer will hire a person with a college degree over a person without one without even looking at credentials. The vast majority of \"good\" jobs require a degree. There are hoops that have to be jumped through. College is not even in the same ballpark as school for me. It is a place to pursue my interests.\n \n Where do you go to school? It sounds horrible.", 
   {}, 
   2739, 
   null, 
   1046231640.0
  ], 
  [
   3298, 
   null, 
   "hetero-male", 
   "I am in college in the greator toronto area, ontario canada in a small city near toronto", 
   {}, 
   2739, 
   null, 
   1046238900.0
  ], 
  [
   3346, 
   null, 
   "ghettocracka", 
   "you need to transfer to somewhere across the border", 
   {}, 
   2739, 
   null, 
   1046273280.0
  ], 
  [
   3356, 
   null, 
   "hetero-male", 
   "i am not going to the US to go to college I will take a break from school and work and decide what i want to do and decide if i want to go to college or not", 
   {}, 
   2739, 
   null, 
   1046291280.0
  ], 
  [
   3398, 
   null, 
   "sarablaze", 
   "Stop complaining!!!! I would gladly trade places with you.\n \nan employer will hire a person with a college degree over a person without one without even looking at credentials. The vast majority of \"good\" jobs require a degree.\n \n Thank you for saying that Thistown.\n I have jumped through hoops too, but couldn't handle it after a while. You can only b.s. your way through so much.\n They are not scare tactics, they are the truth. I'm living proof!!!", 
   {}, 
   2739, 
   null, 
   1046335920.0
  ], 
  [
   3493, 
   null, 
   "hetero-male", 
   "sara they are scare tactics used to push and force people to go to college. 3-4 years of putting your head in books won't help you get job skills. plus I don't know what I am good at", 
   {}, 
   2739, 
   null, 
   1046409000.0
  ], 
  [
   3508, 
   null, 
   "sarablaze", 
   "It may not help you get job skills, if it isn't something that you want to do, I agree, but, it isn't a waste of time. I don't like sharing what I do for a living. It is one of the things I mentioned to you earlier, and I would kill for a student loan, so I could at least get a into a trade. It is easier to get a GOOD job with a certificate then it is with job skills, most of the time.", 
   {}, 
   2739, 
   null, 
   1046421060.0
  ], 
  [
   3513, 
   null, 
   "thistownwilleat", 
   "Sadly enough nobody cares about job skills anymore, they care about a piece of paper.", 
   {}, 
   2739, 
   null, 
   1046423580.0
  ], 
  [
   3517, 
   null, 
   "sarablaze", 
   "GEEZ, do you have to make me sound like an a$$? I was simply saying that college is not a waste of time. I would much rather be in school for something I want to get a career in and something I enjoy. But! Any college is a plus. Money isn't everything to me, but financial security is a must! By financial security, I mean not having to ask people to lend you money to pay for hygiene products, food or toilet paper, because the little bit of money you busted your a$$ for in the last month went for rent, and barely paid your utilities! It is a pain in the XXX to find decent work with no collge education.emoticon_frazzled", 
   {}, 
   2739, 
   null, 
   1046425740.0
  ], 
  [
   3525, 
   null, 
   "thistownwilleat", 
   "Whoa, whoa there. i was agreeing with you, the piece of paper I'm talking about is a degree.", 
   {}, 
   2739, 
   null, 
   1046451840.0
  ], 
  [
   3541, 
   null, 
   "hetero-male", 
   "colleges only teaches you to endless tests and assignments plus partying, drinking non stop and do drugs plus they are filled with drones that don't know nothing about the real world and love to use the flipping burger scare tactic when you say college does not help you find a job. a piece of paper from 3-4 years of famine and hell in college won't make a employer automatically interested in you", 
   {}, 
   2739, 
   null, 
   1046466600.0
  ], 
  [
   3545, 
   null, 
   "Crim", 
   "It will if it's a from a reputable college.\n Hi, I have a masters in Law from Harvard.\n Hi, I have a ba in pre-law from Joe Smoe Community College.", 
   {}, 
   2739, 
   null, 
   1046469840.0
  ], 
  [
   3549, 
   null, 
   "thistownwilleat", 
   "Yes it will make an employer automatically interested in you. It's not right but it will. Face the facts, the majority of jobs REQUIRE a degree...they won't even meet with you to see these job skills that you are so proud of. And yes, college does exponentially improve your job skills.", 
   {}, 
   2739, 
   null, 
   1046472360.0
  ], 
  [
   3559, 
   null, 
   "sarablaze", 
   "Sorry thistown, I thought you meant money! \n \nFace the facts, the majority of jobs REQUIRE a degree...they won't even meet with you to see these job skills that you are so proud of. And yes, college does exponentially improve your job skills.\n \n Hey, Hetero! Go to the science forum and look at E=mc2^, and tell me, would you hire Normin or me? That should show you how having some schooling under your belt helps with job skills.\n I have jumped through hoops, and have been over qualified for certain jobs when it came to job skills, but they wouldn't hire me because I needed some type of degree.", 
   {}, 
   2739, 
   null, 
   1046474940.0
  ], 
  [
   11297, 
   null, 
   "Pikeman85", 
   "Why can't you get a student loan, Sara? You should try at every college you can to get one, if necessary, so you can pay for it.\n \n Going to college, period, is better, imo, though it is not for everyone.\n \n \n Of course, seeing as I want to get into biotechnically and human augmentation, especially neuroaugmentation, college is pretty much a sure bet, and a good idea for me. There aren't many biotech jobs you can get with only a diploma ;)", 
   {}, 
   3559, 
   null, 
   1056965220.0
  ], 
  [
   11316, 
   null, 
   "Morfos", 
   "College is underrated. I recomend going to college.", 
   {}, 
   3048, 
   null, 
   1057013460.0
  ], 
  [
   11376, 
   null, 
   "grayhawk", 
   "College allows you to choose your future. It's desire over necessity. I am schooled in the topic of my choice, I will find employment in that topic vs. I am not schooled, and must provide for myself in any way I can. College allows you to choose the employment line you will spend your life in and gives you an idea if that is in fact something you find interesting enough to do it 40+ hours a week. It is worth it. Regrdless of what job you seek to fill, knowledge is power, and that knowledge can assist you in all aspects of your life. There is no such thing as too much knowledge, and the irony is the more you learn, the more you realize you don't know. \n My old history professor had 8 degrees, his famous line was, \"My first degree made me feel like a genius, my second made me feel smart, my third made me realize I didn't know that much, by the time I got the 8th I realized I was an idiot, but at least I know I'm an idiot, and I have the paper to prove it.\" He was still going to college last I knew, he had retired and was in his 70's. He said before he died he wanted to be at least knowledgeable. I asked how many more degrees it would take he said he only hoped he lived that long. \n I plan on going back, but I'm not sure what for yet. Not for professional reasons, but for knowledge. It'll be worth it.", 
   {}, 
   11316, 
   null, 
   1057223460.0
  ], 
  [
   17186, 
   null, 
   "wjim1269", 
   "I agree that college is somewhat overrated. However, it is almost necessary for a good job in today's society.\n \n Employers like people who go above the \"norm.\" In previous generations, an eighth grade education was the norm. None of my father's aunts or uncles went beyond that, yet they all found fine jobs. Today, high school is the norm. You can drop out, but you still usually have to go to at least some high school. Thus, if the employers want to find someone who has gone above the norm in education, they have to find someone who has a college degree.", 
   {}, 
   11376, 
   null, 
   1064461020.0
  ], 
  [
   17330, 
   null, 
   "epaphras_faith", 
   "colleges only teaches you to endless tests and assignments plus partying, drinking non stop and do drugs plus they are filled with drones that don't know nothing about the real world and love to use the flipping burger scare tactic when you say college does not help you find a job. a piece of paper from 3-4 years of famine and hell in college won't make a employer automatically interested in you\n\n \n Your logic astounds me. Tests and assignments assist a person in developing their independent thinking capacity. The other things are only taught to you if you choose them. No one forces drugs or drinking on you. If you really believe you will do so much better in the world without an education then go for it. But it is a foolish move the unemployment rate what it is world wide. \n \n I have a degree and am finding I need much more education to make more than 40K a year. I live fine, but I am not doing what I want. For that I need an education. If you prefer to try to move into other areas without an education, then I will pray for your success, because short of God's direct intervention you will be lost.", 
   {}, 
   3541, 
   null, 
   1064536320.0
  ], 
  [
   18081, 
   null, 
   "sundowner", 
   "colleges only teaches you to endless tests and assignments plus partying, drinking non stop and do drugs plus they are filled with drones that don't know nothing about the real world and love to use the flipping burger scare tactic when you say college does not help you find a job. a piece of paper from 3-4 years of famine and hell in college won't make a employer automatically interested in you\n\n \n You go to learn...at least I did.\n You don't have to drink, party or do drugs...I did, in moderation.\n College does and will help you find a job.\n College teaches people a broad base of education.\n College is important for learning how to interact with people, live in a community, and contribute to society. But you have to be there for these reasons, if you just want to party and drink, and do drugs, then don't waste your time.", 
   {}, 
   3541, 
   null, 
   1065217320.0
  ], 
  [
   24218, 
   null, 
   "witzelcheck", 
   "The only reason college is necessary, is because we're failing to do the job in high school, where it used to be done. We're extending a potential 12 year education period into a 16+ year one. All for the money. College is businees too. Someone's getting paid. \n \n I'll say that even more schooling is going to be required in the future, due to the crumbling education system. \n I've mentioned before in other debates that our grandparents were more prepared for the real world (after highschool) than we are today (after college.) Why, though?\n \n First of all, we are not being taught to think for ourselves until it's too late. We get out of high school believe what everyone told us: that we can do anything if we set our mind to it. That's not entirely true. It's now taking more time to realize, because in college they start taking off your 'blinders'. Something they should have done in high school.\n \n So is college necessary? yes\n Should it be? no", 
   {}, 
   3048, 
   null, 
   1069916400.0
  ], 
  [
   24603, 
   null, 
   "sundowner", 
   "The only reason college is necessary, is because we're failing to do the job in high school, where it used to be done. We're extending a potential 12 year education period into a 16+ year one. All for the money. College is businees too. Someone's getting paid. \n \n I'll say that even more schooling is going to be required in the future, due to the crumbling education system. \n I've mentioned before in other debates that our grandparents were more prepared for the real world (after highschool) than we are today (after college.) Why, though?\n \n First of all, we are not being taught to think for ourselves until it's too late. We get out of high school believe what everyone told us: that we can do anything if we set our mind to it. That's not entirely true. It's now taking more time to realize, because in college they start taking off your 'blinders'. Something they should have done in high school.\n \n So is college necessary? yes\n Should it be? no\n\n \n That is one of the dumbest things I ever heard. Let me see if I have your main points correct.\n \n 1. You think that college should not be necessary because we could recieve all the education in high school.\n \n 2. College is necesarry because high school keeps us in the dark and does not teach us to think for ourselves.\n \n 3. Our educational system is becoming weak, and due to this, we will have to extend our educations for a few more years to make up for this weakening. \n \n 4. The reason our grandparents only had to go to high school and we must go to college is that high school prepared them for the real world back then, but today it does not. \n \n You know, I was going to address these all seperately, but I kept finding myself coming back to the same point for all of them. Technology. In this age of technology, it is impossible for high school to teach us all of the new technology and still get the basics in. Our schools cannot afford to teach advanced computer languages to students if they have to leave out 2+2=4. If everyone grew up to be the same thing, perhaps we could just teach the necessary subjects in high school. But today more than ever, children are leaving high school and entering a wide variety of different fields, many of which did not exist 100 years ago. It would not be possible for high school to teach all the basics and still include the career specific education required by many of todays jobs. I am a pilot, I had to attend school after high school. (strangely, they did not offer flying lessons at high school) My wife is a nurse. (they did not offer nursing classes at high school) Back in the day when nurses simply took temperatures and gave sponge baths, perhaps there was no more education needed than high school and some basic OTJ training. Today, nurses are highly skilled professionals which act much more independently and provide much more advanced care than 100 years ago. This is all due to technology. 100 years ago, computers did not exist. Cars were new. The first powered aircraft was flown 100 years ago. Electricity was rather new, many did not have it yet. Medicine was much the same as it had been since the early 1700's. The point is, that the last 100 years have seen extraordinary change in our society, and it has become necessary for much more education in order to keep up with the advances. College is a necessary part of life today, and will continue to be so in the future, not because high schools are failing, but because technology has advanced. Learn to look at the big picture.", 
   {}, 
   24218, 
   null, 
   1070147100.0
  ], 
  [
   25572, 
   null, 
   "witzelcheck", 
   "Ok, maybe I approached that a litte to brashly.\n I did consider technoloy when I made those points. The thing is though, schools (more specifically public schools) are not accomplishing near what they could. Because of technology, a little more schooling is required in the SPECIFIC field, but all of this 'required high school' class stuff is rediculous. \n The part about schools keeping is in the dark? That, I think is true. A lot of students get around this by learning things from other sources, like parents, older friends, and other social relations. But there are a LOT of people that I went to school with that are going to have so many problems when they get out, because they were not taught how to deal with reality.\n And yes, I think our education system is becoming weak, but I don't think we can fix that by extending learning periods. We have tried that, and it's never shown improvement. Yet people still want to try it. We just don't utilize our time.\n Quite frankly I think most classroom studies (both highschool and college) ARE a waste of time. People learn best from experience. When I look back on most of my highschool classes, I think I actually learned something for 1 hour out of an 8 our day. (my sister tallied 30 min, but I'm going to be generous)\n I'm a highschool student and I'm taking colleges classes with ease, because I attended a private school and had enough of a boost to get me this far. (when I transferred into a public school, I didn't have to think for an entire year. I had permission from the guidance office to read in my 'boring' classes.) The point is, I don't think public schools are using their classroom time wisely. We could, in all actuality, accomplish a lot of what we learn in college, in highschool. Now, people are trying to cram 'general' and 'required' classes into our heads. Granted, some are useful, but MANY are not. \n \n You mentioned that your wife is a nurse. I know that field does require more schooling. Ask her how many classes that she had to take that are of no or little use to her. \n \"back in the day\" they did have schooling, but it was in the form of apprenticeships. Yes, there are some fields that do require extensive studying. But today, for some reason, practically EVERY field does. That's what bothers me.", 
   {}, 
   24603, 
   null, 
   1070601540.0
  ], 
  [
   28054, 
   null, 
   "AndyBessette", 
   "The average salary for an executive in this area is 350,000. Lowest is around 200,000, highest 600,000. The only thing people want is a masters in business administration and a good working attitude...about twenty businesses looking to fill executive positions. I think I'd do quite well.\n\n \n My roommate is Business Admin. Major and I'd really like to know where you got those figures, because NO ONE makes that kind of money straight out of college unless mommy and daddy own a friggin state. You'll be gettin 350,000 when you 55 or 60 not 22 or 23. And those twenty businesses that your talking about are looking for people that graduate with doctrine from Bently, harvard, yale or any other grand business school...and you gotta remember its not what you know...its who you know.", 
   {}, 
   2995, 
   null, 
   1071701640.0
  ], 
  [
   28055, 
   null, 
   "AndyBessette", 
   "I found an entry level job that requires a masters and pays 75,000 starting. There's your six years experience. :P\n\n \n Broker that six years of experience....it's professional experience, not school experience you idiot.", 
   {}, 
   3168, 
   null, 
   1071701820.0
  ], 
  [
   28059, 
   null, 
   "AndyBessette", 
   "colleges only teaches you to endless tests and assignments plus partying, drinking non stop and do drugs plus they are filled with drones that don't know nothing about the real world and love to use the flipping burger scare tactic when you say college does not help you find a job. a piece of paper from 3-4 years of famine and hell in college won't make a employer automatically interested in you\n\n \n What you really need to do is get out of your 6 X 9 dorm room of a cell or apartment or home with mommy and get out and meet some one. You go to college NOT just to spend your time with your head in a book and then take a test about it. College is the best four years of your life. You learn a ton of information about not only your career but about yourself and life. You are there to branch out and be free. You learn more than what your studying. You learn how to be a people person, how to create contacts, how to think for yourself instead of having someone tell you how to lead your live. Yes grabbin a beer at the bar with your friends after finals is a phenomenal thing, but college is definitely not a flipping burger scare. if thats why your in college for you went for the wrong reasons pal. You really need to sit down think about how your spending either your money or your parents money and really decide what you want to do. And with that piece of paper that makes an employer instantly interested in you. If you were to go apply for a job with a degree versus no college degree, guanranteed the employer will spend more time with you in an interview than with someone who does not.", 
   {}, 
   3541, 
   null, 
   1071702600.0
  ], 
  [
   28078, 
   null, 
   "epaphras_faith", 
   "Broker that six years of experience....it's professional experience, not school experience you idiot.\n\n \n \n Hi Andy: Welcome to the board. Might I suggest you refrain from name calling. Especially using phrases like idiot to point to others. You call broker an idiot and yet you post a response to him and he hasn't posted in this thread since February 2003. I doubt he is continuing to watch.\n \n I would suggest you begin by treating people with respect. The people on the board are of all ages, religions, localities, and desires. You may be a college student, and your points do seem to be valid, but please watch the dates on the posts, read large sections before you post in old threads, and ................play nice.", 
   {}, 
   28055, 
   null, 
   1071708840.0
  ], 
  [
   28145, 
   null, 
   "AndyBessette", 
   "Hi Andy: Welcome to the board. Might I suggest you refrain from name calling. Especially using phrases like idiot to point to others. You call broker an idiot and yet you post a response to him and he hasn't posted in this thread since February 2003. I doubt he is continuing to watch.\n \n I would suggest you begin by treating people with respect. The people on the board are of all ages, religions, localities, and desires. You may be a college student, and your points do seem to be valid, but please watch the dates on the posts, read large sections before you post in old threads, and ................play nice.\n\n \n I apologize, I really do. however I don't believe this is the topic at hand.", 
   {}, 
   28078, 
   null, 
   1071728340.0
  ], 
  [
   28223, 
   null, 
   "epaphras_faith", 
   "I apologize, I really do. however I don't believe this is the topic at hand.\n\n \n Correct, not the topic at hand, however, I did not want you as a new person here to continue without noting certain items. I made the same mistake when I first started posting. I caught myself after the fact. I was only trying to help. (not necessarily in the nicest way possible, but truly trying to be helpful).\n \n I have very little to offer. My views and their reasons are already posted. College is absolutely necessary for the world of work if you want to make more than 24K per year. There are a few occupations where this is not true and more so in union states.\n \n I live in a non union state. Competition for work here is fierce. I have a bachelors and find myself at the glass cieling. Without a masters I likely will not go much further. I am only 36 and have more ambition than where I am.", 
   {}, 
   28145, 
   null, 
   1071767280.0
  ], 
  [
   28404, 
   null, 
   "sundowner", 
   "I did consider technoloy when I made those points. The thing is though, schools (more specifically public schools) are not accomplishing near what they could. Because of technology, a little more schooling is required in the SPECIFIC field, but all of this 'required high school' class stuff is rediculous. \n \n \n I will agree on the fact that public education falls a little short of the mark on efficiency, however this was really not your original contention. Could you site specific examples of which classes you feel are not needed? \n \n \nThat, I think is true. A lot of students get around this by learning things from other sources, like parents, older friends, and other social relations. But there are a LOT of people that I went to school with that are going to have so many problems when they get out, because they were not taught how to deal with reality.\n \n \n If they want to go into medicine, law, journalism, technology, engineering etc..., yes, they will have serious problems (unless they go to college and properly prepare for these fields). However, if they desire to pump gas or bag groceries, they will probably not have a difficult time adjusting. You cannot really be taught how to deal with reality, that is something you must learn for yourself.\n \n \nAnd yes, I think our education system is becoming weak, but I don't think we can fix that by extending learning periods. We have tried that, and it's never shown improvement. Yet people still want to try it. We just don't utilize our time.\n \n \n I will agree that time is deffinately wasted each day in most public schools, but to some extent this is unavoidable. Have you ever heard the statement \"the mind can only absorb what the butt can endure\"? Confining a child to a classroom for 4 hours at a time without breaks if counterproductive. I believe I remember hearing somewhere that the average person learns well for about 50 minutes, then requires a break. We can make school more efficient, however, we still need to provide for some small mental rest periods per day.\n \n \nQuite frankly I think most classroom studies (both highschool and college) ARE a waste of time. People learn best from experience. When I look back on most of my highschool classes, I think I actually learned something for 1 hour out of an 8 our day. (my sister tallied 30 min, but I'm going to be generous)\n \n \n Such as? Have you been to college by the way? I am not trying to be ignorant, I am just curious if you have gone to college, knowing this will provide for a little more perspective. Yes, experience is a great teacher, however, how do we learn physics, calc, trig, bio, history, lit, etc... only through experience? I have experienced some components of these things in real life, but I would not have even realized it had I not learned the theory behind it first in school. And if you only learned about 1 hour worth of material out of 8 hours in one day, perhaps you should ask yourself if it was that you were only taught one hour, or were you just only 1/8 as motivated as you should have been?\n \n \nThe point is, I don't think public schools are using their classroom time wisely. We could, in all actuality, accomplish a lot of what we learn in college, in highschool. Now, people are trying to cram 'general' and 'required' classes into our heads. Granted, some are useful, but MANY are not.\n \n \n Again, which classes are you reffering to? What could we accomplish is high school that we now do in college? Keep in mind that many subjects presented in college take into acount that you already have a base knowledge of subjects, and not having a base knowledge will leave you behind. Many college profs will ignore you if you continuously slow the class to ask questions about things you should already know. For example, in my first college chem class, the prof gave us a 3 page list of concepts, term, and procedures that we should already know, and took the time to state that he would not answer questions on them, and failure to know this basic knowledge would result in the students being left behind in the class. I admit, I had to go home that night and open my chem book and learn a few things, but without this fundamental knowledge, I would never have passed the course. \n \n \nYou mentioned that your wife is a nurse. I know that field does require more schooling. Ask her how many classes that she had to take that are of no or little use to her. \n \n \n Very few, other than a few general education requirements like english (after all, why would a nurse need to communicate effectively with others?), statistics (has never been useful to her other than allowing her to interpret data and understand research, and the research papers that she has been involved in writing.) and physical education (who need to be healthy?) *sarcasm added for effect*\n \n \n\"back in the day\" they did have schooling, but it was in the form of apprenticeships. Yes, there are some fields that do require extensive studying. But today, for some reason, practically EVERY field does. That's what bothers me.\n \n \n Unfortunately, we are not back in the day. Most professional fields today require extensive studying...it is a fact of life. We have touched on the reason for this previously, TECHNOLOGY! It may bother you, but it is a fact you must warm up to if you wish to endeavor in a professional career.", 
   {}, 
   28223, 
   null, 
   1071815820.0
  ], 
  [
   28450, 
   null, 
   "epaphras_faith", 
   "Sundowner:\n \n How many people do you know that really WANT a job pumping gas or bagging groceries as a career?", 
   {}, 
   28404, 
   null, 
   1071856380.0
  ], 
  [
   28521, 
   null, 
   "witzelcheck", 
   "To start off, it may also just be my highschool. I do know there are some good public schools out there. Obviously mine isn't one of them.\n You asked me to name some classes I didn't need. \n I'm going to have to reformulate that thought. I don't know how though. I'll just do my best to explain.\n For me, Economics was required. Yes, you do have to know how the economic system works in order to survive. I guess my main arguement is with the way it was taught. It was all memorizing terms. The concepts were completely glossed over. They gave definitions and facts. They say \"Low Supply + High Demand = High Prices\". Really. Some people actually had problems filling in some of those terms. That's all they gave you. They NEVER ask \"If you had very little of a product, and everyone wanted it, what would you do to the price to make the most money?\"\n OK. In my case VERY easy question. Yet MANY people have problems with simple concepts like that. \n American Literature. Yes, Reading is VERY important. It's one of the two effective ways of broadening your mind (other being actual experience). Yet in that class, in 11th grade, we read one book, and that was Tom Saywer. I thought it was supposed to be a literature class, not a class to make posters, watch movies in, and go in the computer lab and just simply fool around. These classes could be worth it if they were actually used to teach something in. Like I said, maybe it's just my school. \n I do think that should be required because it is actaully benificial. Though I swear there were still some people in that class that couldn't read. However, if they are going to require it for graduation and teach nothing, then it should not be required.\n In my phyed class, we never really did anything. We played games, but follwed very few rules because too many people complained that the rules were unfair. C'mon. Unfortunately some people actually need Physical Education to stay fit (though just a phyed class cannot keep anyone fit... you have to eat right and do more than 45 min of basically putzing around to do that). And somehow I need this class to graduate. I consider myself a healthy person, I eat right, and exercise regularly. Why did I need this class again?\n There are vital classes like basic math (and advanced math for most people), english (like you said, people need to communicate, but if everyone is deathly afraid the teacher like it was in my case, not a whole lot of communication is learned), Social Studies (though several people disagree on that one), and sciences, and today computer classes. Heh, not that my school requires anything other than keyboarding (which I somehow tested out of, even though I don't know the first thing about anything that was taught in that class.)\n \n And yes, I have been to college.... Kind of. I'm actually a senior in highschool, but I have taken many classes at my nearby college. Don't think that counts though. I was limited to 12 credits per semester because they said more would swamp me... and still am sitting at a 4.0 GPA. Not that it means anything, I haven't taken any heavy classes. I'm not allowed to. So maybe it does get better. I certainly hope so. \n Another thing, some Majors have different requirements. Though I concede who am I to say, I haven't gone to school for nursing so I guess your wife did need all of her classes. \n \n By reading some other posts too, I'm beginning to think that maybe it's just my highschool...... I honestly had no room to actually take any classes that I wanted to because I was trying to fulfill graduation requirements. I was heavy in the Math department, and at my school, it conflicted with music.\n \n You do have good points, but there's always an exception. My school seems to be it. So yes, for me, so far both my highschool and colleges classes have been mostly a waste of my time (though there were a few good ones, but they were scarce). And then again, it's different for every person.", 
   {}, 
   28450, 
   null, 
   1071885780.0
  ], 
  [
   28527, 
   null, 
   "airhead", 
   "Sundowner:\n \n How many people do you know that really WANT a job pumping gas or bagging groceries as a career?\n\n \n I do! Pumping gas is not as bad as people say it is. \n \n Okay, I didn't read the whole long thread, so I really don't know what I am saying, but obviously \n \n college doesn't imply that you will get a good job\n no college, likewise, doesn't imply that you will not get a good job\n \n by whatever sense of the word \"good\".\n \n statistically, though, i think it's probably true (you can look up the numbers to be sure) that college graduates get higher salary, but, again, that doesn't mean that you will get higher salary after going to college.\n who says salary is important...\n blah blah blah..... on and on and on and on....", 
   {}, 
   28450, 
   null, 
   1071888960.0
  ], 
  [
   28552, 
   null, 
   "witzelcheck", 
   "I do! Pumping gas is not as bad as people say it is. \n \n Okay, I didn't read the whole long thread, so I really don't know what I am saying, but obviously \n \n college doesn't imply that you will get a good job\n no college, likewise, doesn't imply that you will not get a good job\n \n by whatever sense of the word \"good\".\n \n statistically, though, i think it's probably true (you can look up the numbers to be sure) that college graduates get higher salary, but, again, that doesn't mean that you will get higher salary after going to college.\n who says salary is important...\n blah blah blah..... on and on and on and on....\n\n \n Yeah, I was going to say something along those lines too.\n Some of the most successful people are highschool dropouts, and some of the least successful people have several years of college behind them.\n They cram it into our heads in school 'looser for now, looser forever'... you HAVE to get high grades to be something... (those of you who've seen bowling for columbine  know what I'm saying)\n It also depends on how you define successful.\n Society tells us what jobs are preferable. They tell us that things like being a plumber is nothing to be proud of. Aren't we supposed to be proud of helping others....\n \n Now that I've completely strayed from the thread topic.....", 
   {}, 
   28527, 
   null, 
   1071897240.0
  ], 
  [
   29620, 
   null, 
   "Broker", 
   "I wasn't saying anything about the job needing experience, I said it was an entry level job... thus the :p after that remark. O_o", 
   {}, 
   28552, 
   null, 
   1072856400.0
  ], 
  [
   29650, 
   null, 
   "epaphras_faith", 
   "Yeah, I was going to say something along those lines too.\n Some of the most successful people are highschool dropouts, and some of the least successful people have several years of college behind them.\n They cram it into our heads in school 'looser for now, looser forever'... you HAVE to get high grades to be something... (those of you who've seen bowling for columbine  know what I'm saying)\n It also depends on how you define successful.\n Society tells us what jobs are preferable. They tell us that things like being a plumber is nothing to be proud of. Aren't we supposed to be proud of helping others....\n \n Now that I've completely strayed from the thread topic.....\n\n \n Wit and Air:\n \n First off, a plumber makes a hell of a lot of money. At least they cost a ton of it.\n \n Secondly, if you want to pump gas for a career, go ahead. Work at the neighborhood circle k if you like. No skin off my nose. I am not saying more money is better. That isn't the point. You seem to have missed it entirely by blaming it on \"society.\" The point is that college graduates have more options and more choices. That cannot be denied. Some High school dropouts have done quite well for themselves. MOST have not. \n \n Of course there is no guarantee that one WILL get a good job with a college degree, part of it is up to you, your personality, willingness etc. However, degrees open up the possibilities. If you wanted to design aircraft engines for instance, not a snowball's chance in hell without an engineering degree. Want to counsel people, not going to happen without a license or being clergy (and trained). States have requirements. \n \n It only makes sense to open up your options. Training is always good and most companies offer paid training. It is usually cursory and will get you almost nothing on a resume. A degree and years of experience will make for a powerful resume and people will find you and OFFER you a job. \n \n Maybe not your cup of tea, but seems to be a better position.", 
   {}, 
   28552, 
   null, 
   1072887240.0
  ], 
  [
   31011, 
   null, 
   "sarablaze", 
   "Ok. Very sad news people and it has a lot to do with this thread. I live alone and I am a 21 yr old waitress. I've lived alone since I was 19 and I've been on this site pretty much since I've moved in and I have busted my butt working as hard as I can to survive... I HAVE NO TIME TO GO BACK TO SCHOOL!!!! Even if I wanted to..(which I do) My Mother is hesitant about letting me move in with her.. I am an adult so I cannot question it. \n \n I have literally had to go into resturants to use the facilities and take toilet paper so I had something to use. I have lived off of rice and noodles for 2 weeks straight. I have washed all of my clothes in the tub and hang dried them in my tiny one bedroom apartment in the winter once. Well not once.. 3 times.. I am very sad to say that that I have worked a 10 hour shift, and brought home $25 in tips more then one time... LIFE SUCKS!!! \n \n If you're in school and you get a degree there is almost a 100% garantee that you will not do any of what I did... unless you're a cheap skate haha! :p Seriously though.... I am moving out soon to go live with a roommate in Indiana.\n \n I will have to pay much less but it is harder to find a job out there... I am scared and I don't know what is going to happen with the rest of my life... but I do know this... when I get the opportunity to get into school IM TAKING IT... I don't care if I am going to school to become a proctologist(a$$ doctor) I'M TAKING IT!!!!!! If you think school is a waste of time THINK AGAIN!!! Unless you have somebody to take care of you. I am young and there will be an opening for me out there someday soon... \n \n I am just so tired of comming home after 8-11 hours of work everyday and giving all of my money to a guy who won't fix my stove so I can boil the water to make my rice... lmao no joke.... GO TO SCHOOL!!!!!!!!!!!! WOW... I'm starting to sound a lot like my mother.... HA! I don't care... GO TO SCHOOL! LOL :xbanghead", 
   {}, 
   29650, 
   null, 
   1073987640.0
  ], 
  [
   31038, 
   null, 
   "epaphras_faith", 
   "Sara:\n \n I want to wish you well on getting back into school. If you are anywhere near your highschool contact their school counselor. They can give you a financial aid form to fill out to send into the government. It gives you an idea of what your \"financial need\" is for school. You may have to take out a loan but will likely qualify for grants and so on. The form lets you pick colleges to send the info to. It will also result in a lot of mailings from colleges. There is a significant amount of grant money and scholarship money for women and for people going to college who did not right out of high school. The Sallie Mae website will let you sign up for free scholarship and grant search. You can even have them email updates to you. \n \n You may already know all of this but I firmly believe in education. I support myself and a wife. It scares me that I only have a bachelors degree. I am pretty much at the salary cieling for my education. I have just paid off my student loans (after about 6 years of paying). There are colleges that are not nearly as expensive as some of the more popular ones. Good luck emoticon_xhoho emoticon_xhoho", 
   {}, 
   31011, 
   null, 
   1074013200.0
  ], 
  [
   31042, 
   null, 
   "sarablaze", 
   "God Bless ya man, and I am planning on doing that as soon as things calm down. I posted that last night to let people know where you will be if you do as I did. It is seriously not a joke, as I tried to tell people before. Still isn't :p", 
   {}, 
   31038, 
   null, 
   1074014580.0
  ], 
  [
   31044, 
   null, 
   "epaphras_faith", 
   "God Bless ya man, and I am planning on doing that as soon as things calm down. I posted that last night to let people know where you will be if you do as I did. It is seriously not a joke, as I tried to tell people before. Still isn't :p\n\n \n \\Very cool. One lat piece of advice (unsolicited as it is), don't wait for \"things to cool down\" do it now. If you wait for things to cool down you will find that life continues to happen and never cools down. That is the nature of life. Make the time. Go and do it this week. Give them the address of where you are going or leave a parents address. Get started because you can do it and it will make a difference. If you have a child to care for it will be a bit more difficult but don't let it stop you. It will be the best for both.\n \n God's speed to you.", 
   {}, 
   31042, 
   null, 
   1074014880.0
  ], 
  [
   31118, 
   null, 
   "Toxey", 
   "Although college is very beneficial ,it is not nessasary to make a decent living.\n My wife went to college and has only been working 2 years less than me.I make 15k a year more than her and I never went to college.\n She will have her masters in 6 months and I will still make 10k more than her.\n I have a old high school friend who went to college right after high school,while I went to work.He is a Marine Biologist and I am a lineman for a utility company(non union),he still makes less than me,after being out of high school for over 20 years.\n I really take offense to people saying that if you dont get a college education,all you will be doing the rest of your life is flipping burgers or some other meaningless job.\n Althought I will never make what a hot shot Exec. makes.I am not exactly starving to death either.\n In the next 3 years ,between me and my wife,we will be earning 100k a year or better.And thats with the high school grad bringing home the bigger piece of the pie.\n Thx", 
   {}, 
   31044, 
   null, 
   1074049020.0
  ], 
  [
   31169, 
   null, 
   "mamboni", 
   "College, in most instances, is a prerequisite for a life of affluence and success. It is, usually, essential to those seeking high-paying jobs and when you attend and complete college your choices and paths become a lot less linear. With copious amounts of jobs open to you because of your diploma and knowledge.\n Although college is vital, I also believe the fundamentals are beneficial - things taught from K-12. It's imperative to have a good understanding of the basics before entering college, so i believe that the role of high-school is similar, as you have to build up a reputation academically to receive a scholarship or offers from esteemed institutions.\n Although college is the final step on the stairs of school, I still find pre-college learning to be imperative, too. As it will help sculpt us into well-rounded and astute individuals. \n All education, in my opinion, should be regarded as the most important facet of life.", 
   {}, 
   31118, 
   null, 
   1074087540.0
  ], 
  [
   31187, 
   null, 
   "epaphras_faith", 
   "Although college is very beneficial ,it is not nessasary to make a decent living.\n My wife went to college and has only been working 2 years less than me.I make 15k a year more than her and I never went to college.\n She will have her masters in 6 months and I will still make 10k more than her.\n I have a old high school friend who went to college right after high school,while I went to work.He is a Marine Biologist and I am a lineman for a utility company(non union),he still makes less than me,after being out of high school for over 20 years.\n I really take offense to people saying that if you dont get a college education,all you will be doing the rest of your life is flipping burgers or some other meaningless job.\n Althought I will never make what a hot shot Exec. makes.I am not exactly starving to death either.\n In the next 3 years ,between me and my wife,we will be earning 100k a year or better.And thats with the high school grad bringing home the bigger piece of the pie.\n Thx\n\n \n Congratulations. I don't think anyone is saying it is absolutely necessary. It is generally speaking important. You are doing well as a high school grad. You make a good salary and work in a very high risk job. I have a close friend who is an executive of a company that employs linemen. He recently went to the funeral of one. Not to scare you or even imply that you have a problem. Simply stating that one of the reasons your salary is high is because you have traded the comfort of the office for risk. I am actually very happy that you and your wife are doing well. \n \n The issue at hand is not if one MUST go to college. The topic is \"IS college a waste of time?\" The answers seem to be a resounding NO except for the occasional mal content who wants to sit a do pot all their life. You are very different. You work and work hard in a risky job. You are compensated well. I think that you would agree that college is not a waste of time. At least it wasn't for your wife.", 
   {}, 
   31118, 
   null, 
   1074097860.0
  ], 
  [
   31219, 
   null, 
   "sarablaze", 
   "\\Very cool. One lat piece of advice (unsolicited as it is), don't wait for \"things to cool down\" do it now. If you wait for things to cool down you will find that life continues to happen and never cools down. That is the nature of life. Make the time. Go and do it this week. Give them the address of where you are going or leave a parents address. Get started because you can do it and it will make a difference. If you have a child to care for it will be a bit more difficult but don't let it stop you. It will be the best for both.\n \n God's speed to you.\n\n no kids but i am working to pay rent, and now i'm working to save money to move.. the only time i have is to sleep and eat and i eat while im on the computer lol hours are crazy, but after i move i'll be doing better and i will be able to jump right in, at by the end of this month after i'm moved im speaking to the counselour, and btw i have allready filled out the paper work for a grant... takes 3-6 weeks to get back to me.\n ty though emoticon_xgood", 
   {}, 
   31044, 
   null, 
   1074114240.0
  ], 
  [
   31225, 
   null, 
   "epaphras_faith", 
   "no kids but i am working to pay rent, and now i'm working to save money to move.. the only time i have is to sleep and eat and i eat while im on the computer lol hours are crazy, but after i move i'll be doing better and i will be able to jump right in, at by the end of this month after i'm moved im speaking to the counselour, and btw i have allready filled out the paper work for a grant... takes 3-6 weeks to get back to me.\n ty though emoticon_xgood\n\n \n You are welcome and good luck. Any major decided as of yet?", 
   {}, 
   31219, 
   null, 
   1074118620.0
  ], 
  [
   31262, 
   null, 
   "Toxey", 
   "Congratulations. I don't think anyone is saying it is absolutely necessary. It is generally speaking important. You are doing well as a high school grad. You make a good salary and work in a very high risk job. I have a close friend who is an executive of a company that employs linemen. He recently went to the funeral of one. Not to scare you or even imply that you have a problem. Simply stating that one of the reasons your salary is high is because you have traded the comfort of the office for risk. I am actually very happy that you and your wife are doing well. \n \n The issue at hand is not if one MUST go to college. The topic is \"IS college a waste of time?\" The answers seem to be a resounding NO except for the occasional mal content who wants to sit a do pot all their life. You are very different. You work and work hard in a risky job. You are compensated well. I think that you would agree that college is not a waste of time. At least it wasn't for your wife.\n\n \n As I stated at the start of my post that college is very beneficial.And I agree with you that it is not a waste of time.\n But after reading thru these posts,the attitude I recieved from some posts,is that if you dont go to college you will never amount to anything but a burger flipper.\n No,you did not scare me about the fellow lineman getting killed,I am fully aware of the dangers of my job.\n But you must admit,after 9/11 the comfort of the office is not as comfortable as it use to be.Not to mention the disgruntalled employee coming in blasting away at everyone because he got fired.Risk is everywhere", 
   {}, 
   31187, 
   null, 
   1074130380.0
  ], 
  [
   31365, 
   null, 
   "epaphras_faith", 
   "As I stated at the start of my post that college is very beneficial.And I agree with you that it is not a waste of time.\n But after reading thru these posts,the attitude I recieved from some posts,is that if you dont go to college you will never amount to anything but a burger flipper.\n No,you did not scare me about the fellow lineman getting killed,I am fully aware of the dangers of my job.\n But you must admit,after 9/11 the comfort of the office is not as comfortable as it use to be.Not to mention the disgruntalled employee coming in blasting away at everyone because he got fired.Risk is everywhere\n\n \n I'm glad I didn't scare you. I certainly was not trying to do that (it would be poor debate technique). I hear what you say about the attitude you get from the posts. However, the risk that is everywhere is a different story. Yes, risk is everywhere, but to differing degrees. The office is still much safer than what you do. My friend tells me that line jobs are notoriously dangerous and companies shell out amazing amounts of money for liability policies. The reason Insurance exists is because risk is everywhere. The premiums are actually a fairly good measure for how much risk.", 
   {}, 
   31262, 
   null, 
   1074186180.0
  ], 
  [
   31436, 
   null, 
   "Toxey", 
   "I'm glad I didn't scare you. I certainly was not trying to do that (it would be poor debate technique). I hear what you say about the attitude you get from the posts. However, the risk that is everywhere is a different story. Yes, risk is everywhere, but to differing degrees. The office is still much safer than what you do. My friend tells me that line jobs are notoriously dangerous and companies shell out amazing amounts of money for liability policies. The reason Insurance exists is because risk is everywhere. The premiums are actually a fairly good measure for how much risk.\n\n \n \n Although line work is dangerous,I must say that \"notoriously dangerous\" is a bit extreme.The amount of safety put into the lineman industry is quite impressive.The amount of money shelled out by utility companies for protective and insulating equipment is staggering.Not to mention safety meetings and testing equipment.\n Although one might think that a lineman is trading his body for his brain,the amount of training one must go thru to be a lineman proves otherwise.\n It takes years of training for a new lineworker to master his or her trade.I have seen many fail to make it because their physical or mental abilities were not up to par.Vasts amounts of knowledge in several aspects must be obtained to be able to be a lineman.\n So dont let anyone fool you .A lineman is not burger flipper ,and no epaphras,I dont think you were trying to convince us of that.\n But I must concede to you that you are right,college is not a waste of time,,,,at all.\n I work many hours in the middle of the night under terrible weather conditions with high voltage,to make a living.College is by far a better alternative.\n But its what I have chose to do.", 
   {}, 
   31365, 
   null, 
   1074229140.0
  ], 
  [
   31437, 
   null, 
   "SilentPoet", 
   "I think its fair to say that on average, those who complete college earn a significant more amount of money than those who only have a HSD.\n \n As far as a career choice: The most important part of choosing my future career depends on the salary.\n \n As of now I am considering several careers including a:\n Lawyer (Undetermined type)\n Bilingual Consultant", 
   {}, 
   3398, 
   null, 
   1074229500.0
  ], 
  [
   31476, 
   null, 
   "epaphras_faith", 
   "Although line work is dangerous,I must say that \"notoriously dangerous\" is a bit extreme.The amount of safety put into the lineman industry is quite impressive.The amount of money shelled out by utility companies for protective and insulating equipment is staggering.Not to mention safety meetings and testing equipment.\n Although one might think that a lineman is trading his body for his brain,the amount of training one must go thru to be a lineman proves otherwise.\n It takes years of training for a new lineworker to master his or her trade.I have seen many fail to make it because their physical or mental abilities were not up to par.Vasts amounts of knowledge in several aspects must be obtained to be able to be a lineman.\n So dont let anyone fool you .A lineman is not burger flipper ,and no epaphras,I dont think you were trying to convince us of that.\n But I must concede to you that you are right,college is not a waste of time,,,,at all.\n I work many hours in the middle of the night under terrible weather conditions with high voltage,to make a living.College is by far a better alternative.\n But its what I have chose to do.\n\n \n Rightly so. I certainly believe lineman have a brain. No one without a brain would live long in a risky business. I congratulate you on simply caring for your wife so that she can go to school. I say that because many these days have given up that idea as a sign of independence. I started another thread a while back on the necessity of interdependence. I think it is in the philosophy thread. If not try religion. I would like to hear your ideas.", 
   {}, 
   31436, 
   null, 
   1074273780.0
  ], 
  [
   33265, 
   null, 
   "DrD", 
   "It will if it's a from a reputable college.\n Hi, I have a masters in Law from Harvard.\n Hi, I have a ba in pre-law from Joe Smoe Community College.\n\n Interesting. Didn't know one could obtain a BA at a community college.", 
   {}, 
   3545, 
   null, 
   1075580520.0
  ], 
  [
   33958, 
   null, 
   "witzelcheck", 
   "I'll correct myself. Finally.\n \n The idea of learning is good. College offers it to us. Unfortunately it limits us as well. Most of the stuff isn't \"hands on\", which is vital. Also, a lot of majors are confining. They focus on a good education, but that doesn't necessarily mean \"well rounded education\". What happened to \"learning for the sake of learning\"? Engineers aren't going to take psychology, in some cases biology, or astronomy, which are fascinating in themselvs. They're not required, but at the same time they are told they're not important. They are. All of the knowledge you can obtain is important.\n \n They try to force the \"well rounded\" thing on us in highschool, but because it's forced, no one is interested. By the time we get to college, our habits are set. Take what you need for your career, not what's interesting to you, and not what you feel you can get the most out of.\n \n The problem is, many colleges seem to forget that. So in cases I've seen, it is a waste of time. If their \"major\" fails to become their job, then they have nothing to fall back on. THAT'S the problem. College could be much more useful, if we'd learn how to use it.", 
   {}, 
   33265, 
   null, 
   1076014920.0
  ], 
  [
   35747, 
   null, 
   "jitobear", 
   "colleges only teaches you to endless tests and assignments plus partying, drinking non stop and do drugs plus they are filled with drones that don't know nothing about the real world and love to use the flipping burger scare tactic when you say college does not help you find a job. a piece of paper from 3-4 years of famine and hell in college won't make a employer automatically interested in you\n \n \n Well, if that's all you got out of it......it simply says more about you than school. School, education, knowledge is extremely powerful and valuable. And not just because it gives you job skills and fancy degree - but because the more you know, the stronger you are. The better you are at learning the next thing, doing the next thing - the harder you are to knock down. However, it requires effort and an open mind.\n \n By the way - my degree got me out of waitressing and into an entry level position at one the largest companies in the world. I only started at 25k a year (with nice bennies) - but have doubled that income within five years - and I am still a peaon. emoticon_smile", 
   {}, 
   33958, 
   null, 
   1077575400.0
  ], 
  [
   35753, 
   null, 
   "epaphras_faith", 
   "colleges only teaches you to endless tests and assignments plus partying, drinking non stop and do drugs plus they are filled with drones that don't know nothing about the real world and love to use the flipping burger scare tactic when you say college does not help you find a job. a piece of paper from 3-4 years of famine and hell in college won't make a employer automatically interested in you\n \n \n Well, if that's all you got out of it......it simply says more about you than school. School, education, knowledge is extremely powerful and valuable. And not just because it gives you job skills and fancy degree - but because the more you know, the stronger you are. The better you are at learning the next thing, doing the next thing - the harder you are to knock down. However, it requires effort and an open mind.\n \n By the way - my degree got me out of waitressing and into an entry level position at one the largest companies in the world. I only started at 25k a year (with nice bennies) - but have doubled that income within five years - and I am still a peaon. emoticon_smile\n\n \n Old thread you are replying to but your comments are more than appreciated. Welcome to the site. I hope you are finding a great deal of education in your discussions.", 
   {}, 
   35747, 
   null, 
   1077576120.0
  ], 
  [
   35985, 
   null, 
   "jitobear", 
   "Thank you.", 
   {}, 
   35753, 
   null, 
   1077657240.0
  ], 
  [
   44111, 
   null, 
   "Haulingboat", 
   "Here's the bottom line. You can have all the education in the world. Without ambition, you will get no where. \n \n The overwhelming attitude here displayed by most of you is that college or education will get you a job. Remember this, no one gets truly rich working for someone else. Be an employer. Create jobs. Rely upon yourself to create income. You'll be happier and wealthier by doing so.\n \n Stop relying on someone else to give you a good paying job and go create one for yourself.", 
   {}, 
   33265, 
   null, 
   1082076420.0
  ], 
  [
   44113, 
   null, 
   "Waxy", 
   "No.\n \n All the ambition in the world won't get you to the top if you don't have the education that enables you to put that ambition to work for you.\n \n Educating yourself is NEVER a waste of time.\n \n Waxy", 
   {}, 
   44111, 
   null, 
   1082076840.0
  ], 
  [
   44114, 
   null, 
   "Haulingboat", 
   "No.\n \n All the ambition in the world won't get you to the top if you don't have the education that enables you to put that ambition to work for you.\n \n Educating yourself is NEVER a waste of time.\n \n Waxy\n\n I did not suggest that education was not a good idea or a waste of time. My point was simply that education is not a requirement for success.", 
   {}, 
   44113, 
   null, 
   1082077020.0
  ], 
  [
   44123, 
   null, 
   "JPSartre12", 
   "I did not suggest that education was not a good idea or a waste of time. My point was simply that education is not a requirement for success.\n\n \n It depends on your definition of \"education\". Education doesn't have to take place in school, but it DOES have to take place for you to become successful, IMO.", 
   {}, 
   44114, 
   null, 
   1082080080.0
  ], 
  [
   44194, 
   null, 
   "Haulingboat", 
   "It depends on your definition of \"education\". Education doesn't have to take place in school, but it DOES have to take place for you to become successful, IMO.\n\n \n \n Look at Allen Iverson. The man can not make it through an interview with a single complete sentence. However he has made hords of money and risen to the top of the NBA.", 
   {}, 
   44123, 
   null, 
   1082127720.0
  ], 
  [
   44211, 
   null, 
   "Waxy", 
   "Unless you have scouts recruiting you when you're 12 years old, you might as well forget the Allen Iverson route. He should thank his lucky stars he can jump, or he'd probably be in jail somewhere or living on welfare.\n \n That's a red herring, and no offense, but pretty irrelevent to this discussion. What percentage of the population is employed as a professional athlete? 0.0000001? \n \n It's not necessarily a requirement, depending on one's chosen field and definition of success. However, if you choose a career path as a professional, education is essential. It's the key to every door. Again, all the ambition in the world is meaningless if you don't have the qualifications to advance to the top. \n \n If you're self employed, you'll be paying people to do things you could otherwise do yourself, or at the least, struggling with them when some advanced education would have greatly simplified them for you.\n \n Like JP said though, education can't be limited to the classroom and books, it must be combined with continued, life long, hands on learning and experience in the real world. That's the 2nd part of the equation and every bit as vital. \n \n You just need the foundation that education supplies.\n \n Waxy", 
   {}, 
   44194, 
   null, 
   1082136360.0
  ], 
  [
   44216, 
   null, 
   "Haulingboat", 
   "Unless you have scouts recruiting you when you're 12 years old, you might as well forget the Allen Iverson route. He should thank his lucky stars he can jump, or he'd probably be in jail somewhere or living on welfare.\n \n That's a red herring, and no offense, but pretty irrelevent to this discussion. What percentage of the population is employed as a professional athlete? 0.0000001? \n \n It's not necessarily a requirement, depending on one's chosen field and definition of success. However, if you choose a career path as a professional, education is essential. It's the key to every door. Again, all the ambition in the world is meaningless if you don't have the qualifications to advance to the top. \n \n If you're self employed, you'll be paying people to do things you could otherwise do yourself, or at the least, struggling with them when some advanced education would have greatly simplified them for you.\n \n Like JP said though, education can't be limited to the classroom and books, it must be combined with continued, life long, hands on learning and experience in the real world. That's the 2nd part of the equation and every bit as vital. \n \n You just need the foundation that education supplies.\n \n Waxy\n\n We are now arguing the same point. Allen Iverson was one example. Purhaps you have read Rich Dad Poor Dad. If so, you have another example. If not I'll be glad to fill you in.", 
   {}, 
   44211, 
   null, 
   1082137920.0
  ], 
  [
   44246, 
   null, 
   "whistler", 
   "It depends on your definition of \"education\". Education doesn't have to take place in school, but it DOES have to take place for you to become successful, IMO.\n\n \n I agree wholeheartedly. \n \n This is a pretty old thread, until haulingboat it hasn't had a response in over 6 weeks. However, if any of the younger discussents are still around I would like to point out that a typical 4 year bachelor's degree program is not the only education around.\n \n Take up a trade. HVAC is pretty big. Construction is about the only thing booming right now. Either way, programs like these are going to entail more classroom work beyond high school. But at least they lead to a more challenging and better paying career than not taking any additional classes after high school.\n \n However they are oriented towards vocational education. You might not have to take english 101 or math 102, but then don't to be able to write an effective advertisement for your business. Similarly you might have to hire an accountant to manage your money. \n \n Whistler", 
   {}, 
   44123, 
   null, 
   1082150340.0
  ], 
  [
   44281, 
   null, 
   "faeden", 
   "Mark Twain said: \"I never let my schooling interfear with my education.\" \n \n Learning is a byproduct of experience. (sp?) Therefore, every experience has value. Some experiences' value is dependant upon the amount of effort and commitment applied to it. I learned more by being a teacher than by being a student. Getting an education is a life process that has proven to have greater results based on greater imput into the process.\n \n Food for thought: \"Winners are losers who didn't quit.\" (unknown)", 
   {
    "post_info": {
     "post_title": "waste?"
    }
   }, 
   44246, 
   null, 
   1082167800.0
  ], 
  [
   44287, 
   null, 
   "mathurin", 
   "ok, everybody seems to be overlooking this fact, in a country (america) where the kids keep getting lazier and lazier a degree is a sign of work ethic, also, almost anybody can be trained to do whats needed, i know a man with a marketing degree that manages a fast food store\n \n i am personally enjoying college, these arent my words but they fit so well\n \"i dont believe i really knew how to think before college\" \n \n i agree that the public school system is dumbed down alot, i spent the last 2 yrs doing nothing but reading through my classes, and then doing the tests and passing the class with a B or C, but the reason our schools are bad is cause the kids dont want to be there, no amount of money is gonna fix that\n \n if i ever have kids i want to homeschool them, i knew a girl who was homeschooled, she was 16, a college freshman and better read than i am at 20 (thats hard around here, im one of the best read folks in bourbon county, which is similar to being the very best opera singer in arkansas) and as for introversion she was very well adjusted, her parents made sure she got plenty of social contact\n \n as for me i am a first generation college student, my first choice was business classes, masters at first, might settle for a BA, thats very common so im thinking about a masters in computer science along with it, im living at home so i have all the time in the world to finish\n \n well, i typed way more than i thought i would have, suffice to say that college is a mind broadening experience if you let it be, i used to be a narrow minded hick, im still a hick\n Mathurin\n \n PS i forgot, im a junior and i have yet to do a single illegal drug, and ive only drank a few times, no parties either, but im thinking of going to a battle of bands next week", 
   {}, 
   44281, 
   null, 
   1082169840.0
  ], 
  [
   44291, 
   null, 
   "faeden", 
   "mathurin, (Hi AK from CT!)\n \n Good for you! Drugs and other distractions are just that. IMO, the goal of an education is that the student should develop a love of learning. The height of ignorance is to believe one knows everything about anything.\n \n P.S. Ask lots of questions. I wish I had asked more in college!\n \n Pete", 
   {
    "post_info": {
     "post_title": "priorities"
    }
   }, 
   44287, 
   null, 
   1082170800.0
  ], 
  [
   45512, 
   null, 
   "witzelcheck", 
   "mathurin, (Hi AK from CT!)\n IMO, the goal of an education is that the student should develop a love of learning. The height of ignorance is to believe one knows everything about anything.\n Pete\n\n \n As for the love of learning thing... public schools are doing a really good job of killing that from the start. After all, their goal is a work force, and that's it. \n I'm not dissing all public schools, just the ones I've experienced.", 
   {}, 
   44291, 
   null, 
   1082752200.0
  ], 
  [
   47191, 
   null, 
   "sglaine", 
   "Well I thinks its over rated in the sense that they shorten the school year and they get more money. I also think that a lot of college student pay for there degree instead of earning the degree. To biggest thing I find is common sense that has been trow-en out the window because that is better than a college degree.", 
   {}, 
   45512, 
   null, 
   1083516360.0
  ], 
  [
   47510, 
   null, 
   "pyromattiac", 
   "As for the love of learning thing... public schools are doing a really good job of killing that from the start. After all, their goal is a work force, and that's it. \n I'm not dissing all public schools, just the ones I've experienced.\n\n \n I'm with you there. I try to teach myself as much as possible, but the school work takes up so much time I never have a chance to do anything worthwhile. *enthusiam for learning fading... fading... RISING... fading... gone", 
   {}, 
   45512, 
   null, 
   1083633120.0
  ], 
  [
   47584, 
   null, 
   "galton", 
   "I have been teaching at the college level since 1996, and in my opinion if you study anything other than math or science, you tend to graduate with less common sense than when you entered because any class that deals with people issues nowadays is likely to be a subtle or not so subtle indoctrination in leftist ideology. \n \n Most classes do not teach really teach critical skills and then require you to consider all sides of an issue up against the facts; rather, they teach you \"this is how it is\" and \"this is how it should be\" and you are expected to regurgitate it and then move on to the next course of indoctrination. \n \n I imagine a college education at say Cambridge 100 years ago actually made people smarter, but my undergradute education consisted in large part \"learning\" how irredeemably evil white heterosexual men are and always have been. I was getting this kind of politics even in unrelated classes. All professors are trying to jump on this bandwagon to the point where now we even have science courses where you don't learn science; it's considered more important to learn the Holy Trinity--race, class, and gender--as it applies to the study of science. This is indoctrination and catechism pure and simple, masquerading as serious scholarship.", 
   {}, 
   47510, 
   null, 
   1083651300.0
  ], 
  [
   47588, 
   null, 
   "galton", 
   "Another thought is that college is boring to a lot of people because the majority of the population is not naturally interested in large, abstract ideas, and they never will be. Some people are like this because they are not very smart, and some smart people are too action-oriented to be bothered with a lot of impractical stuff that academics love. It is a mistake to expect everyone in the U.S. to get a four-year degree. We are having to dumb down the traditional curriculum so people can pass (another reason why some people think class is boring). College as originally developed was not intended for everyone--it was intended for future leaders.", 
   {}, 
   47584, 
   null, 
   1083652740.0
  ], 
  [
   47876, 
   null, 
   "witzelcheck", 
   "Another thought is that college is boring to a lot of people because the majority of the population is not naturally interested in large, abstract ideas, and they never will be. Some people are like this because they are not very smart, and some smart people are too action-oriented to be bothered with a lot of impractical stuff that academics love. It is a mistake to expect everyone in the U.S. to get a four-year degree. We are having to dumb down the traditional curriculum so people can pass (another reason why some people think class is boring). College as originally developed was not intended for everyone--it was intended for future leaders.\n\n \n Yeah... sounds a lot like my highschool too.....", 
   {}, 
   47588, 
   null, 
   1083781860.0
  ], 
  [
   48995, 
   null, 
   "Nature's Cry", 
   "I think they should make the curriculum harder country wide, so that getting a diploma will actually mean something. I know that I will have a hard time paying for college, and when I'm done what I have done wont mean much. However, high school's so easy now that even if you do well in it, without a college diploma you will be unable to find a good job. I think that now an education says more about your money than your intelligence, because anyone with half a brain can pass.", 
   {}, 
   47876, 
   null, 
   1084243980.0
  ], 
  [
   49006, 
   null, 
   "galton", 
   "I think they should make the curriculum harder country wide, so that getting a diploma will actually mean something. I know that I will have a hard time paying for college, and when I'm done what I have done wont mean much. However, high school's so easy now that even if you do well in it, without a college diploma you will be unable to find a good job. I think that now an education says more about your money than your intelligence, because anyone with half a brain can pass.\n\n Right, a diploma shows you were able to secure the funds to attend college and that you had the stamina to stick it out 4 or more years, but it does not prove that you are intelligent. The exception to this is attending an elite university, but in any other average people can get a degree. Employers know this, and they can look at GPAs to get a better idea of how good the student is. Graduate schools can also look at standardized tests.", 
   {}, 
   48995, 
   null, 
   1084252680.0
  ], 
  [
   49040, 
   null, 
   "Eddie", 
   "I think its important that you ask yourself why you are attending to collage. Most people I know attend because they hope it will give them perks later on in life. And since they don`t really know what kind of perks they are hoping for they are studying subjects that they find easy or enjoyable. While there is nothing wrong with doing this, it is often economicly wasteful. Education is expensive, even in countries where there is no tution fee. The oppurtunity cost and student loans are quite substantial for a collage student. \n \n Even though I have chosen an education that will give me a certain proffesion, the opportunity costs are almost as high as the eventual pay off. If I had taken loans as well, I would even make a net-loss on my education (I would have to work past my pension age to earn as much during my lifetime as if I had gone directly from High School). \n \n Disclaimer: This is from a swedish perspective, and our pay offs for education is much lower than in the US as our wages are less diverging (word?). But as collage/university education is for free in Sweden, the costs for education are also lower...", 
   {}, 
   49006, 
   null, 
   1084279380.0
  ], 
  [
   49200, 
   null, 
   "galton", 
   "I think its important that you ask yourself why you are attending to collage. Most people I know attend because they hope it will give them perks later on in life. And since they don`t really know what kind of perks they are hoping for they are studying subjects that they find easy or enjoyable. While there is nothing wrong with doing this, it is often economicly wasteful. Education is expensive, even in countries where there is no tution fee. The oppurtunity cost and student loans are quite substantial for a collage student. \n \n Even though I have chosen an education that will give me a certain proffesion, the opportunity costs are almost as high as the eventual pay off. If I had taken loans as well, I would even make a net-loss on my education (I would have to work past my pension age to earn as much during my lifetime as if I had gone directly from High School). \n \n Disclaimer: This is from a swedish perspective, and our pay offs for education is much lower than in the US as our wages are less diverging (word?). But as collage/university education is for free in Sweden, the costs for education are also lower...\n\n Eddie, excellent post. A college education is very expensive, and I see a lot of money wasted on people who little real benefit from it, economic or otherwise. There are worse things to waste a great deal of money on, but in no way do people need to go to college to learn about the world. You can do that in much cheaper ways. You could take a world tour for what it costs for one quarter at my university. \n \n It makes sense to go to college if: you love to learn book-style and will benefit from doing so in a structured environment, or you have a plan for how it will profit you in the end.", 
   {}, 
   49040, 
   null, 
   1084323060.0
  ], 
  [
   49204, 
   null, 
   "sglaine", 
   "Another thought is that college is boring to a lot of people because the majority of the population is not naturally interested in large, abstract ideas, and they never will be. Some people are like this because they are not very smart, and some smart people are too action-oriented to be bothered with a lot of impractical stuff that academics love. It is a mistake to expect everyone in the U.S. to get a four-year degree. We are having to dumb down the traditional curriculum so people can pass (another reason why some people think class is boring). College as originally developed was not intended for everyone--it was intended for future leaders.\n\n That is why Alcoholisim is on the rise.", 
   {}, 
   47588, 
   null, 
   1084323660.0
  ], 
  [
   51494, 
   null, 
   "witzelcheck", 
   "That is why Alcoholisim is on the rise.\n\n \n ....uh...... right.\n anyways...\n \n \n Like it was stated before, there is a lot of money being wasted in the curriculum. Sometimes I wonder if that means only economically though. Some students take random classes just to keep the GPA up and to say they had an education. Others, however, take random, unrelated classes because, believe it or not, some of us in America still like to learn for curiosity's sake.\n For determining the rest of your life (like all the teachers tell us - we will fail in life without a degree <haha<) college is beginning to uh... come up a little short. An A or C can depend on the professor alone. Most fields lack hands on experience (at least at introductory levels, where it is still important). \n the way all of this is going is starting to remindly me - creepily (if that's a word) of Asimov's foudation series... it's the depressing take, but I think the system is going to crash unless something is changed....", 
   {}, 
   49204, 
   null, 
   1085121240.0
  ], 
  [
   51546, 
   null, 
   "DrD", 
   "I have been teaching at the college level since 1996, and in my opinion if you study anything other than math or science, you tend to graduate with less common sense than when you entered because any class that deals with people issues nowadays is likely to be a subtle or not so subtle indoctrination in leftist ideology. \n \n Most classes do not teach really teach critical skills and then require you to consider all sides of an issue up against the facts; rather, they teach you \"this is how it is\" and \"this is how it should be\" and you are expected to regurgitate it and then move on to the next course of indoctrination. \n \n I imagine a college education at say Cambridge 100 years ago actually made people smarter, but my undergradute education consisted in large part \"learning\" how irredeemably evil white heterosexual men are and always have been. I was getting this kind of politics even in unrelated classes. All professors are trying to jump on this bandwagon to the point where now we even have science courses where you don't learn science; it's considered more important to learn the Holy Trinity--race, class, and gender--as it applies to the study of science. This is indoctrination and catechism pure and simple, masquerading as serious scholarship.\nI'm not sure whether indoctrination is the proper term to use when referring to \"leftist ideology\". Perhaps introduction is a more appropriate term.\n \n I'm unsure where you teach but you should find another institution. I've been teaching at the university level (in humanities) and have not encountered irredeemably evil white heterosexual men are and always have been. You give the impression by mixing examples that liberal (leftist) learning is an irredeemably inherently evil position AND that it prohibits learning at a fundamental level. Of course this is not true nor has it ever been true. This is a preconceived notion based on another \"agenda\". Except, as you indicate, math and science, there will always be an inclination toward one position or the other. However, as you intimate, it is not the purpose of education nor does it destroy the process of learning. Political positions have relatively no impact on genuine education. Quite the contrary. Opposing positions should stimulate the thinking process, hence the meaning of high education. Well-rounded education should present all sides of an issue whether political, social, religious, etc. Not to do so is prohibiting the student from understanding other points of view. There are hundreds of colleges and universities who teach a one-sided view. Bob Jones University to name one. I believe this kind of education to be a very narrow approach to education. State and other private institutions have a responsibility to share all the knowledge currently available whether we agree with it or not.", 
   {}, 
   47584, 
   null, 
   1085156640.0
  ], 
  [
   51647, 
   null, 
   "Haulingboat", 
   "Sending everyone to college has in a sense shot us in the foot. We have created a rapid decline in the trades. Plumbers, pipefitters, welders, construction apprentises (sp?), finish carpenters,mechanics, ect.... have become few and far between, leaving ample work for the taking. We are breading titty babies that wish not to get their hands dirty, instead to soak up air conditioning and bark orders at the grunts. Then we sit around and say the immigrants are taking the jobs we don't want.", 
   {}, 
   51546, 
   null, 
   1085185920.0
  ], 
  [
   51657, 
   null, 
   "Eddie", 
   "Perhaps some proper labour unions could set america back on track? ;)", 
   {}, 
   51647, 
   null, 
   1085187360.0
  ], 
  [
   51684, 
   null, 
   "DrD", 
   "Sending everyone to college has in a sense shot us in the foot. We have created a rapid decline in the trades. Plumbers, pipefitters, welders, construction apprentises (sp?), finish carpenters,mechanics, ect.... have become few and far between, leaving ample work for the taking. We are breading titty babies that wish not to get their hands dirty, instead to soak up air conditioning and bark orders at the grunts. Then we sit around and say the immigrants are taking the jobs we don't want.\nTo add to your point, getting into college has become a joke in many, many schools. Staying there is an even bigger joke. The course of the day is how much one can consume in alcohol or how much sex one can participate in. \n \n I'm a critic, Okay?", 
   {}, 
   51647, 
   null, 
   1085192340.0
  ], 
  [
   51766, 
   null, 
   "sglaine", 
   "....uh...... right.\n anyways...\n \n \n Like it was stated before, there is a lot of money being wasted in the curriculum. Sometimes I wonder if that means only economically though. Some students take random classes just to keep the GPA up and to say they had an education. Others, however, take random, unrelated classes because, believe it or not, some of us in America still like to learn for curiosity's sake.\n For determining the rest of your life (like all the teachers tell us - we will fail in life without a degree <haha<) college is beginning to uh... come up a little short. An A or C can depend on the professor alone. Most fields lack hands on experience (at least at introductory levels, where it is still important). \n the way all of this is going is starting to remindly me - creepily (if that's a word) of Asimov's foudation series... it's the depressing take, but I think the system is going to crash unless something is changed....\n Yes you need a curriculum to have any kind of standard in a class room. The problem lies that they are giving way too many credits for junk class that have little or no meaning. And I do agree that the system is going to crash. Because society gone to pampering there students instead of real down to earth education. There is too much garbage with statics.", 
   {}, 
   51494, 
   null, 
   1085239620.0
  ], 
  [
   51795, 
   null, 
   "CCR1994", 
   "There is a point I'd like to make. There is a reason college graduates do better than people who don't attend college and it has to do with ambition. People are generally told that making it big requires further education and ambitous people take that seriously. People who have no ambition don't bother.", 
   {}, 
   51766, 
   null, 
   1085252340.0
  ], 
  [
   51797, 
   null, 
   "georged", 
   "I have been teaching at the college level since 1996, and in my opinion if you study anything other than math or science, you tend to graduate with less common sense than when you entered because any class that deals with people issues nowadays is likely to be a subtle or not so subtle indoctrination in leftist ideology. \n \n Most classes do not teach really teach critical skills and then require you to consider all sides of an issue up against the facts; rather, they teach you \"this is how it is\" and \"this is how it should be\" and you are expected to regurgitate it and then move on to the next course of indoctrination. \n \n I imagine a college education at say Cambridge 100 years ago actually made people smarter, but my undergradute education consisted in large part \"learning\" how irredeemably evil white heterosexual men are and always have been. I was getting this kind of politics even in unrelated classes. All professors are trying to jump on this bandwagon to the point where now we even have science courses where you don't learn science; it's considered more important to learn the Holy Trinity--race, class, and gender--as it applies to the study of science. This is indoctrination and catechism pure and simple, masquerading as serious scholarship.\n\n \n I agree with your assessment on common sense often being overridden by a distinct layer of social responsibility, but feel a majority of that is defined by professors eagerly sucking on the public tit. I won't get into the hours now spent actually performing at classroom instruction by tenured professors at publicly funded colleges, but will say that on the sciences side it makes little sense to me. \n \n My professional experience has always been within the business community on the treasury side of finance and I remember when interns filled virtually all of our normal expansion positions, usually in their last year of undergrad school with the direction and intent of completing grad school funded by the company. It took about five minutes into the technical interview to determine whether the individual was attending a public or privately funded college just based on the age old questions of 5 and 10-year personal goals. Even then (20-years ago) publicly funded schools were beginning to stress the social responsibilities of commerce with a strong outlook on personal quality of life, while we were looking for individuals who were seeking careers and understood the compromises of balancing career and personal responsibility, meaning don't expect to have a lot of free time for anything other than your future family.\n \n Now I see few internships being offered and a virtual glut of publicly funded MBAs on the street. Many schools now specialize in offering profitable to the school accredited MBA programs, very expensive and complete with government loans, when their primary curriculum is liberal arts oriented. I've talked with many of those 'displaced' people and walk away with the feeling that they were still under the impression that the credential would provide them with far above average earnings while also allowing them to primarily pursue personal and, in my opinion, very idealistic lifestyles. \n \n The undergrad fallout of no market with virtually anyone who desires it having a degree is almost overwhelming. Our service-oriented economy is now demanding undergrad degrees to flip burgers and getting them. To me, that raises the question of how closely is our trend of educating everyone we can with non-applicable educations related to our high standard of living problems creating crippling losses in our inability to compete in world markets. Big fall ahead or total socialization as long as we can afford it seems to be the issue. Should those students/grads who have no desire or ability to master a profession offering future potential be placed in the work force without college at lower paying jobs to alleviate our high standard of living dilemma or will we eventually be forced by economic circumstances to make that happen?", 
   {
    "unicode_changes_made": true
   }, 
   47584, 
   null, 
   1085253420.0
  ], 
  [
   52265, 
   null, 
   "JPSartre12", 
   "To add to your point, getting into college has become a joke in many, many schools. Staying there is an even bigger joke. The course of the day is how much one can consume in alcohol or how much sex one can participate in. \n \n I'm a critic, Okay?\n\n \n IMO, if you go to college to get an easy Liberal Arts degree, then college is a joke. But if you're there to learn science and how to apply it, it's very worthwhile. I get tired of hearing people whine about how useless college is. When you graduate with an engineering degree from a good school and are offered $50k before you finish your senior year during winter college recruitment, THEN you know the value of college. \n emoticon_xgood", 
   {}, 
   51684, 
   null, 
   1085630940.0
  ], 
  [
   52412, 
   null, 
   "jskufan", 
   "I think 10 or 20 years ago a college education was an indicator to an employer that you were \"trainable\". Since you were disciplined enough to endure 4 more years beyond the mandated 12 provided by the system, you passed the corporate litmus test. Aside from skill specific degrees, like accounting, engineering, law, medicine, teaching, etc. it seems like most graduates interview for sales or very low level management trainee positions. Since the economy is shifting away from manufacturing, at least away from \"heavy\" manufacturing, it seems like there is a shrinking supply of \"management\" positions available and a multitude of graduates chasing what sales jobs are available. If the service economy pans out, I see giant corporations declining in number and smaller to mid-size companies sprouting up in \"niche\" fields that aren't as likely to be exported to overseas workforces. Therefore, I would think if someone wanted to make the most of their upper education in our future society, I would be emphasizing the traditional heavyweights like law and medicine as well as the technical fields that teach skills our society will always be reliant on. We can export the manufacturing of any product, but we'll always need electricians, plumbers, masons, engineers, chemists, etc. I think in today's very competitive job market, it's especially important to pick a \"marketable\" degree: much more so than it was 10 or 20 years ago.", 
   {}, 
   52265, 
   null, 
   1085714040.0
  ], 
  [
   52523, 
   null, 
   "Haulingboat", 
   "There is a point I'd like to make. There is a reason college graduates do better than people who don't attend college and it has to do with ambition. People are generally told that making it big requires further education and ambitous people take that seriously. People who have no ambition don't bother.\n\n That is quit a broad, sweeping statement. College does indeed require some ambition or dedication in order to graduate, but a lack of college education does not equate a lack of ambition.", 
   {}, 
   51795, 
   null, 
   1085847540.0
  ], 
  [
   52526, 
   null, 
   "georged", 
   "That is quit a broad, sweeping statement. College does indeed require some ambition or dedication in order to graduate, but a lack of college education does not equate a lack of ambition.\n\n \n Maybe not a lack of ambition, but a definate indicator of an inability to marshall all the possible advantages to facilitate ambition.", 
   {}, 
   52523, 
   null, 
   1085848920.0
  ], 
  [
   52533, 
   null, 
   "CCR1994", 
   "That is quit a broad, sweeping statement. College does indeed require some ambition or dedication in order to graduate, but a lack of college education does not equate a lack of ambition.\n\n \n Actually, my point is that ambitious people are more likely to go to college because they believe a college degree is required for success. There are ambitious people who don't go to college and do become successful because they are ambitious. I probably didn't make that as clear as I should have.", 
   {}, 
   52523, 
   null, 
   1085875860.0
  ], 
  [
   52534, 
   null, 
   "JPSartre12", 
   "......... If the service economy pans out, I see giant corporations declining in number and smaller to mid-size companies sprouting up in \"niche\" fields that aren't as likely to be exported to overseas workforces. Therefore, I would think if someone wanted to make the most of their upper education in our future society, I would be emphasizing the traditional heavyweights like law and medicine as well as the technical fields that teach skills our society will always be reliant on. We can export the manufacturing of any product, but we'll always need electricians, plumbers, masons, engineers, chemists, etc. I think in today's very competitive job market, it's especially important to pick a \"marketable\" degree: much more so than it was 10 or 20 years ago.\n\n \n Even chemists aren't THAT safe anymore. US Chemical companies are being inticed by cheap chemists in Kiev to have them do some basic research for them. They can get 10 PhD Chemists to work for the same as one in the US.\n emoticon_angry :xcensored :xbanghead", 
   {}, 
   52412, 
   null, 
   1085876700.0
  ], 
  [
   52596, 
   null, 
   "JPSartre12", 
   "Actually, my point is that ambitious people are more likely to go to college because they believe a college degree is required for success. There are ambitious people who don't go to college and do become successful because they are ambitious. I probably didn't make that as clear as I should have.\n\n \n I believe that most of the richest men in America AREN'T college grads. Now, go down a tier of two and the story changes. If you think that you'll be one of the Fortune 100 richest men in America, then I'd say don't bother with college. But if you aren't certain that you can make the Top 100 on merit, then I'd say #'s 101-1,000,000 probably went to college and so should you. :)", 
   {}, 
   52533, 
   null, 
   1085940000.0
  ], 
  [
   52624, 
   null, 
   "georged", 
   "Even chemists aren't THAT safe anymore. US Chemical companies are being inticed by cheap chemists in Kiev to have them do some basic research for them. They can get 10 PhD Chemists to work for the same as one in the US.\n emoticon_angry :xcensored :xbanghead\n\n \n That's how the exodus of engineering and computer science jobs started. India, Ireland, Russia and other countries with high numbers of graduates and post grads in the sciences have standards of living that are pennies when compared to ours. \n \n I've been watching companies move their batch accounting to India and Mexico for the very same reason. I find it interesting to hear the government brag about the 'increased efficiency and worker productivity' of US firms, complete with happy numbers, knowing full well that reducing fixed overheads from slashing labor costs makes any CEO happy. Overnight couriers pick up the mail at the US PO Box address and it can be anywhere in the world the next day or vice-versa. Computers don't know or care who inputs the stuff.", 
   {}, 
   52534, 
   null, 
   1086020220.0
  ], 
  [
   52663, 
   null, 
   "JPSartre12", 
   "That's how the exodus of engineering and computer science jobs started. India, Ireland, Russia and other countries with high numbers of graduates and post grads in the sciences have standards of living that are pennies when compared to ours. \n \n I've been watching companies move their batch accounting to India and Mexico for the very same reason. I find it interesting to hear the government brag about the 'increased efficiency and worker productivity' of US firms, complete with happy numbers, knowing full well that reducing fixed overheads from slashing labor costs makes any CEO happy. Overnight couriers pick up the mail at the US PO Box address and it can be anywhere in the world the next day or vice-versa. Computers don't know or care who inputs the stuff.\n\n \n I think that farming out confidential accounting work overseas is going to come back and bite one of these companies soon. Now that the practice has gained some press, I wonder how many big companies will allow it to occur. What do a bunch of low wage Indians care about an American company's internal/external security? My guess...not much.", 
   {}, 
   52624, 
   null, 
   1086045720.0
  ], 
  [
   52693, 
   null, 
   "georged", 
   "I think that farming out confidential accounting work overseas is going to come back and bite one of these companies soon. Now that the practice has gained some press, I wonder how many big companies will allow it to occur. What do a bunch of low wage Indians care about an American company's internal/external security? My guess...not much.\n\n \n No security is involved. We're talking batch A/R and some A/P, no general ledger, and the labor intensive part of accounting", 
   {}, 
   52663, 
   null, 
   1086061740.0
  ], 
  [
   53125, 
   null, 
   "witzelcheck", 
   "Actually, my point is that ambitious people are more likely to go to college because they believe a college degree is required for success. There are ambitious people who don't go to college and do become successful because they are ambitious. I probably didn't make that as clear as I should have.\n\n \n I'm ambitious. I'm not going to college. This year I learned more from self teaching and experience than I did in the college classroom (all PSEO 2 years). If there's another way to start a career..... I'm doing military, getting schooling there, hands on schooling, at that. In my opinion, most of the classes they offer at some of these colleges aren't worth the $$, especially when you don't have it.\n College either measures ambition, or the mindless willingness to give in to an instution that's there more for government purposes than it is ours. Or both. hehe", 
   {}, 
   52533, 
   null, 
   1086502140.0
  ], 
  [
   53133, 
   null, 
   "JPSartre12", 
   "I'm ambitious. I'm not going to college. This year I learned more from self teaching and experience than I did in the college classroom (all PSEO 2 years). If there's another way to start a career..... I'm doing military, getting schooling there, hands on schooling, at that. In my opinion, most of the classes they offer at some of these colleges aren't worth the $$, especially when you don't have it.\n\n There's nothing wrong with getting training in the military and then going to college on Uncle Sam. That way, you have the best of both worlds. As an employer, if I had to chose between two candidates with equal educational background, but one also had military service, it's no contest. I'd pick the ex-military candidate hands down. The military provides not only good training but discipline, honor and loyalty. These are also important qualities when considering employing a person for the long haul.\n \n\n College either measures ambition, or the mindless willingness to give in to an instution that's there more for government purposes than it is ours. Or both. hehe\n\n I don't think it's quite as evident now, but when I went to college in the 70's we were anything BUT governmental puppets. \n ;)", 
   {}, 
   53125, 
   null, 
   1086533700.0
  ], 
  [
   53136, 
   null, 
   "georged", 
   "I'm ambitious. I'm not going to college. This year I learned more from self teaching and experience than I did in the college classroom (all PSEO 2 years). If there's another way to start a career..... I'm doing military, getting schooling there, hands on schooling, at that. In my opinion, most of the classes they offer at some of these colleges aren't worth the $$, especially when you don't have it.\n College either measures ambition, or the mindless willingness to give in to an instution that's there more for government purposes than it is ours. Or both. hehe\n\n \n For the sciences, completion of college is considered a mandatory credential to ensure that one has been successfully grounded in established fundamentals of a chosen field. It can be viewed as an entry ticket for employment consideration. The same holds true in other fields, to a lesser extent, as a screening guide to reassure prospective employers that an individual has the ability to complete long-term goals and objectives. \n \n With regard to military training and hands-on experience in lieu of a college education, there are some highly sought after technical skills but somewhat limited in application in civilian counterpart industries to a technical level without the formal degree due to the entry age after completion of service. Get the degree on the government so you're on the same level as your competition.\n \n My college years were long before social engineering in the form of government grants and demographic profiling for entry purposes and we actually had to have passing grades, the dreaded curve (now deemed politically incorrect), from committee reviewed and tenured professors in order to graduate. The professors actually taught and graded their own classes, using grad students only as observers and paper collectors. I have no experience with the institutional mentality you're referring to, but would think it a normal process with the response the general public has displayed in accepting ever-increasing federal control in their lives.", 
   {}, 
   53125, 
   null, 
   1086536400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  does anybody think college is over-rated and a waste of time?", 
  "url": "http://www.4forums.com/political/education-debates/264-does-anybody-think-college-over-rated-waste-time.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 264, 
  "discussion_files": [
   [
    "28944.html", 
    "http://www.4forums.com/political/education-debates/264-does-anybody-think-college-over-rated-waste-time-print.html"
   ], 
   [
    "28945.html", 
    "http://www.4forums.com/political/education-debates/264-does-anybody-think-college-over-rated-waste-time-9-print.html"
   ], 
   [
    "28946.html", 
    "http://www.4forums.com/political/education-debates/264-does-anybody-think-college-over-rated-waste-time-7-print.html"
   ], 
   [
    "28947.html", 
    "http://www.4forums.com/political/education-debates/264-does-anybody-think-college-over-rated-waste-time-5-print.html"
   ], 
   [
    "28948.html", 
    "http://www.4forums.com/political/education-debates/264-does-anybody-think-college-over-rated-waste-time-4-print.html"
   ], 
   [
    "28949.html", 
    "http://www.4forums.com/political/education-debates/264-does-anybody-think-college-over-rated-waste-time-6-print.html"
   ], 
   [
    "28950.html", 
    "http://www.4forums.com/political/education-debates/264-does-anybody-think-college-over-rated-waste-time-8-print.html"
   ], 
   [
    "28951.html", 
    "http://www.4forums.com/political/education-debates/264-does-anybody-think-college-over-rated-waste-time-3-print.html"
   ], 
   [
    "28952.html", 
    "http://www.4forums.com/political/education-debates/264-does-anybody-think-college-over-rated-waste-time-2-print.html"
   ]
  ], 
  "identifier": 264
 }
]