[
 [
  [
   55951, 
   null, 
   "Ursus maritimus", 
   "All of this talk about ages of fossils and sorting of or by or something Noah's ark brings up another question.\n \n Why do we not ever, ever find a fossil of a dinosaur dated, via radiometric means, as less than 63 million years old, or older than 230 million years ago? Actually, dinosaur is a rather broad term: why is it that we never find the fossil remains of Triceratops horridus that are younger than 65 million years old, or older than 72 million years old?\n \n Why do the trilobytes never occur in any stratum that is radiometrically dated to be older than 540 million years ago or younger than 250 million years ago?\n \n Why are there no modern human skeletons found in strata that are dated to be older than 1 million years old?\n \n Why is there such a great correlation between fossils and radiometric age?", 
   {
    "post_info": {
     "post_title": "Ages of Fossils"
    }
   }, 
   null, 
   null, 
   1088469180.0
  ], 
  [
   55988, 
   null, 
   "Kronus", 
   "If you don't mind, I'd like to address this from a debating strategy perspective.\n \n Obviously we both know the \"real\" answer to your last question is because the science works well. You, I assume, are hoping a creationist will pick up on this and go off on how inaccurate, unreliable, etc, radiometric dating is. Links to creationist papers will be provided, the validity of science in general will be questioned, and there's a good chance that a pro-darwin conspiracy will be alluded to. And in the end, no one will convince anyone of anything.\n \n The problem, as I see it, is that you're starting with too broad a subject. By just sort of saying \"Radiometric dating. Go!\" you're opening the door to a dozen different lines of debate, most of which will probably be used at the same time. Any time one line seems troublesome it will be dropped in favor of another. I've found that only by severely limiting the scope of a topic is there any real chance of getting anyone to present a cogent argument about it.\n \n There's my 2 cents. If you were hoping this topic would in fact bounce around, just to see where it would go, then, well, sorry. emoticon_emb", 
   {}, 
   55951, 
   null, 
   1088487840.0
  ], 
  [
   55989, 
   null, 
   "apathy", 
   "yeah, i actually never realized it, but there are creationist \"answers\" for everything!\n \n I never heard of \"Catastrophic Plate Techtonics\" but now that I have, I'm dying with laughter. \n http://www.icr.org/research/as/platetectonics.html\n http://www.creationinthecrossfire.com/documents/CatastrophicPlates1/CatastrophicPlates1.htm\n http://www.christiananswers.net/q-aig/aig-c001.html\n \n (you're right, they are evolving into evolutionists)\n \n Geological Timescales are imaginary!\n http://www.answersingenesis.org/creation/v25/i1/grandcanyon.asp\n \n I cannot find any reference to \"radiohalos\" other than creationist websites:\n http://www.answersingenesis.org/creation/v23/i4/geologictime.asp\n http://www.halos.com/book/ctm-rc.htm\n http://www.yourencyclopedia.net/Radiohalo\n Did they make this one up?\n \n wait, no: http://www.csun.edu/~vcgeo005/mark.htm\n http://www.csun.edu/~vcgeo005/wood.html\n \n \n i like this one:\n http://www.answersingenesis.org/home/area/magazines/docs/v22n4_niagara.asp\n \n notice how they dismiss \"uniformitarianism\" in the beginning\n then USE it to support their claims (in that they were somehow able to calculate that Niagra Falls is less than 3500 years old)\n \n well, sorry I didn't really stay on topic :(", 
   {}, 
   55951, 
   null, 
   1088489460.0
  ], 
  [
   55994, 
   null, 
   "ungerdunn", 
   "Actually, Niagra falls are about 12,500 years old. They have been studied extensively, even to the extent that there are TV programs about it.", 
   {}, 
   55989, 
   null, 
   1088495580.0
  ], 
  [
   56007, 
   null, 
   "OccamsRazor", 
   "The thing is though, Ursus maritimus does make a pertinent point. We could distill it down to its simplest form- radiometric dating works- what does a person who believes the world is ~6000 years old say in response to this?\n \n We could look at specific examples, but there are very few attempts by the YE creationists to address the subject of radiometric dating directly. There is no shortage of statements like \"radioactive decay rates have changed with time\" and \"no one has ever measured radioactive decay in the Silurian so we cannot rely on dates from those rocks\".\n \n These are just conjecture, and a dodge to a very difficult question for the YE school of thought to counter (although they try, I'll credit them that!).\n \n When specific challenges have arisen, such as Dr. Steve Austin's experiement dating lava from the last Mt. St. Helens eruption which produced what appears to be a widely inaccurate answer (then used to say- look this is example is wrong, every example must be!), there is precise and focused examination of such claims. In Dr. Austins case this showed either a serious misunderstanding of the techniques involved or a deliberate attempt to produce a bogus result.", 
   {}, 
   55951, 
   null, 
   1088521380.0
  ], 
  [
   56021, 
   null, 
   "Ursus maritimus", 
   "Actually, my question is this:\n \n Creationists, at least many of them, assume the entire geologic column was laid down by the flood, and that the ordering of the fossils reflect some sort of \"hydrostatic sorting\" and/or \"ecological zonation\". My question is, what is it about the flood that sorted isotopes of each and every element (at least the ones relevant to radiometric dating) in such a consistent way that lower strata are dated as older than higher ones, and so that the fossils of every known species has a consisten, narrow range of ages?", 
   {}, 
   56007, 
   null, 
   1088529360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Ages of Fossils", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2646-ages-fossils.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 2646, 
  "discussion_files": [
   [
    "3123.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2646-ages-fossils-print.html"
   ]
  ], 
  "identifier": 2646
 }
]