[
 [
  [
   56721, 
   null, 
   "Siegfriedson", 
   "[Another neo-Marxist lie bites the dust. Racial differences are more than skin deep. The enforced extinction of the European genotype by the government's multiracial immigration policies is genocide in its truest sense.]\n \n \n Q: Is there a biological basis for race and racial differences?\n \n A: Yes, differences between the races are shown to be real by growing scientific evidence.\n \n By J. Philippe Rushton\n \n For the last 20 years my research has focused on differences between the three major races, commonly termed Orientals (East Asians/Mongoloids), whites (Europeans/Caucasoids) and blacks (Africans/Negroids). Roughly speaking, Orientals are those who have most of their ancestors from East Asia. Whites have most of their ancestors from Europe. And blacks have most of their ancestors from sub-Saharan Africa. In the main, I have not addressed the many other groups and subgroups.\n \n What I've found is that in brain size, intelligence, temperament, sexual behavior, fertility, growth rate, life span, crime and family stability, Orientals fall at one end of the spectrum, blacks fall at the other end and whites fall in between. On average, Orientals are slower to mature, less fertile and less sexually active, and have larger brains and higher IQ scores. Blacks are at the opposite end in each of these areas. Whites fall in the middle, often close to Orientals.\n \n Of course, these three-way racial differences are averages. Individuals are individuals. However, I've found that this three-way pattern is true over time and across nations. That the same three-way racial pattern occurs repeatedly on some 60 different biological and behavioral variables is profoundly interesting and shows that race is more than \"just skin deep.\" The international data come from the World Health Organization, the United Nations and Interpol. Recently, I even traveled to South Africa to collect new IQ data.\n \n Full article:\n \n http://www.amren.com/rushton.htm\n \n http://www.insightmag.com/main.cfm?include=detail&storyid=210980", 
   {
    "post_info": {
     "post_title": "Face It: Race Exists"
    }
   }, 
   null, 
   null, 
   1089077340.0
  ], 
  [
   56723, 
   null, 
   "Siegfriedson", 
   "Ethnic Genetic interests: The scientific basis for racial activism:\n \n http://www.amren.com/0302issue/0302issue.html\n \n \n Race is a Myth?:\n \n http://www.amren.com/0012issue/0012issue.html#cover\n \n \n Biological Reality of Race:\n \n http://www.commonsenseclub.com/pages/9910issue/9910issue.html\n \n \n Racial Library:\n \n http://www.davidduke.com/library/index.html\n \n \n Routing the Race Deniers:\n \n http://www.vdare.com/sailer/sarich_miele.htm\n \n Answering Cavalli-Sforza on Race:\n \n http://www.vdare.com/sailer/may_24.htm\n \n http://www.vdare.com/sailer/cavalli-sforza_ii.htm\n \n \n Race: The Power of a Lie?\n \n http://www.vdare.com/francis/pbs.htm\n \n \n It's Official: Races Differ Genetically\n \n by Prof. Glayde Whitney\n \n \"Ethnicity can be inferred from the frequencies of alternative forms, or alleles, of genes; allele patterns differ by racial origin.\" Thus spake Science magazine, the official organ of the American Association for the Advancement of Science (11 Aug. 2000, p. 851).\n \n We do indeed live in strange times. As science increasingly proves the fallacy of the egalitarian myth, politicians and politically correct scientists who want to avoid getting blackballed feed the public absurd (and wrong) banalities. For example, when it was recently announced that the human genome had been sequenced (almost), everyone including President Clinton and Prime Minister Blair got into the media spotlight.\n \n There were many statements, by such as Craig Venter {head of Celera}, that the project \"proved\" that races do not exist, that we are all the same under the skin. The absurdity of such egalitarian proclamations is emphasized by the realization that detailed genetic sequencing of persons from different \"ethnic groups\" is only now beginning.\n \n But already, in just the last few years, it has become possible to easily categorize individuals as to race of origin by looking at their genes. This is because it turns out that there are many DNA sequences [such as STRs = Short Tandem Repeats, and SNPs = Single Nucleotide Polymorphisms] that differ absolutely between the races. Many SNPs that are common in various African tribes simply have not been found among Caucasians or East Asians, and vice-versa, Asian-specific (and Caucasian-specific) markers exist which have not been found among sub-Saharan Africans. In addition, there are markers that are found across the various races but at very different frequencies (some very common among Africans are present but very rare among Caucasians). By combining the results of a few such markers it quickly becomes probabilistically \"almost\" certain (one out of many millions) which race an individual is from.\n \n On the cutting edge of genetic identification of individuals and groups is forensic genetics, DNA profiling, which will probably soon replace fingerprinting as a means of foolproof identification. In the U.S. it was only in October 1998 that the FBI started CODIS [Combined DNA Index System] in order to consolidate DNA identifications from the various State systems.\n \n At the present time CODIS looks at only 13 STR chromosome markers, but that is enough to ensure individual identification: \"The chance of two [unrelated] individuals on average having the same DNA profile is about one in a million billion.\"\n \n Soon to be added will be markers on the Y-chromosome. Y-markers are interesting because the Y-chromosome is transmitted only in the male line of descent, from father to son. Already there are a number of markers on the Y that are known to be race-specific. In forensic applications Y-markers will be particularly useful because many violent crimes are male-on-female, and the resulting \"bodily fluids\" often consist of a messy mix of DNA from both the male perpetrator and the female victim. Analysis of Y-markers will automatically concentrate on the male DNA uncontaminated by that of the female.\n \n Another source of DNA that is just entering forensic identification is mitochrondial DNA, called mtDNA. This stuff is interesting because it exists outside the nucleus of the cell and is passed in the egg, from mother-to-offspring. Thus all the individuals in a female line of descent will have the same mtDNA. But different families often differ, and remember, races may be thought of as extended families - sets of persons related by common descent.\n \n MtDNA is useful because there is a lot of it: \"there's probably 10,000 times as much mtDNA as there is nuclear DNA. In a sample that's aged or degraded, it's quite common that the nuclear DNA has been degraded beyond the point of recovery, and yet there is mtDNA that can be recovered.\"\n \n This is why mtDNA is extracted from ancient remains, such as 100,000 year-old Neanderthals. It was mtDNA that linked the 9,000 year-old Cheddar Man to a \"relative living today just down the road in Cheddar,\n England.\" It is the mtDNA that is being analyzed in an attempt to specify the racial ties of Kennewick Man.\n \n And literally, the best is yet to come. Research at places such as the Galton Laboratory (University College London) is working on actual physical identification from DNA. \"Geneticists can assess the likelihood\n that a person is a redhead simply by testing for mutations in the gene for the receptor for a hormone that spurs production of the pigment melanin. . All facial characteristics are on the agenda . A noble Romanesque profile or deeply cleft chin could be a villain's downfall...within 10 years we might be looking at genetic tests for the basis of the main facial characteristics like, for example, nose, chin, and forehead shape.\" [Watson, A., \"A new breed of high-tech detectives\", Science, Vol. 289, 11 Aug. 2000, Pp. 850-854].", 
   {}, 
   56721, 
   null, 
   1089077460.0
  ], 
  [
   58024, 
   null, 
   "Tastyfish", 
   "OK, just looking at that last stuff.\n \n Y markers being useful in rape? No, not at all and the reason giving doesn't make sense. You aren't going to have a mix of DNA unless the women has had sex with more than one man. Useful for tracing family traits and discovering ancestors but not the kind of thing you are suggesting.\n \n Mitochondrial DNA is more common than nuclear but there is a lot less of it, and PCR now means that the quantity of DNA is pretty irrelvant. \n \n You are also misinterpretting the data, there is differences in the DNA between races, but all that stuff in the tandom repeats, microsatelites etc is non-coding DNA. It mutates faster than those in the coding regions do (or at least mutations are more likely to be passed on there). In the actual coding regions, there is no real differences between races which is what Venter is saying.\n \n DNA testing is actually less accurate than fingerprints, its good but there is about 1/1000 chance that you will share the commonly tested markers with someone else. The million billion figure is for two completly unrelated statically generated genomes, in actual fact pretty much everyone is related to each other and that number comes down fast. \n \n There is also another factor you have ignored, that the various differences between races are not linked to each other, a set population may have a predominace of one allele but it is not certain at all in individuals to even tend to have the same ones. Infact a lot of the african races are as close to white europeans as they are to each other, sometimes even more so.", 
   {}, 
   56723, 
   null, 
   1089845220.0
  ], 
  [
   58031, 
   null, 
   "apathy", 
   "All DNA results will tell you is what population you were born in. This can mean regional, but nowadays with so much available transportation, the regional lines are fuzzier.\n \n Siegfriedson, what race is Tiger Woods?\n \n -------------------------------------------------------\n http://www.stormfront.org/1097/sports.htm\n \n WOW! I'm really glad we picked the thief! (I am from Louisiana, where this \"person\" ran for governor. The choice was an ex-KKK leader or Edwin Edwards who repeatedly stole from the Treasury.)", 
   {}, 
   58024, 
   null, 
   1089846360.0
  ], 
  [
   58049, 
   null, 
   "apathy", 
   "Couldn't resist coming back to this.\n \n If David Duke were so proud of who he is and his genetic makeup, then why did he have plastic surgery to narrow his nose?", 
   {}, 
   58031, 
   null, 
   1089852960.0
  ], 
  [
   58055, 
   null, 
   "Jaaaman", 
   "Couldn't resist coming back to this.\n \n If David Duke were so proud of who he is and his genetic makeup, then why did he have plastic surgery to narrow his nose?\n\n LOL! emoticon_xagree", 
   {}, 
   58049, 
   null, 
   1089863340.0
  ], 
  [
   58100, 
   null, 
   "montalban", 
   "Couldn't resist coming back to this.\n \n If David Duke were so proud of who he is and his genetic makeup, then why did he have plastic surgery to narrow his nose?\n\n \n Who is David Duke?", 
   {}, 
   58049, 
   null, 
   1089891540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Face It: Race Exists", 
  "url": "http://www.4forums.com/political/current-events-debates/2688-face-race-exists.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 2688, 
  "discussion_files": [
   [
    "7999.html", 
    "http://www.4forums.com/political/current-events-debates/2688-face-race-exists-print.html"
   ]
  ], 
  "identifier": 2688
 }
]