[
 [
  [
   57469, 
   null, 
   "ilovetrials", 
   "In regards to the current Scott Peterson double-murder trial, I wanted to ask everyone about what I see as the bizarre dismissal of Juror #5. What happened here? And do you think their dismissal will be cause for a mistrial?\n \n I've been trying to follow this case for a while now, but I never understood this ruling by the judge. I also read that this juror will be doing a live interview (is this allowed?!) with Court TV. The date I'm not sure of because they are interviewing a series of people related to the case from July 12-15, so in case I miss it I wanted to ask what info anyone might have. The Court TV interviews are on at 11pm.", 
   {
    "post_info": {
     "post_title": "Why was Juror #5 dismisssed??"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1089570600.0
  ], 
  [
   57476, 
   null, 
   "jim's trucking", 
   "In regards to the current Scott Peterson double-murder trial, I wanted to ask everyone about what I see as the bizarre dismissal of Juror #5. What happened here? And do you think their dismissal will be cause for a mistrial?\n \n I&#8217;ve been trying to follow this case for a while now, but I never understood this ruling by the judge. I also read that this juror will be doing a live interview (is this allowed?!) with Court TV. The date I&#8217;m not sure of because they are interviewing a series of people related to the case from July 12-15, so in case I miss it I wanted to ask what info anyone might have. The Court TV interviews are on at 11pm.\n\n \n I believe the juror expressed a preconceived verdict of not guilty, prior to having participated in the whole trial. This is grounds for dismissal.\n \n I don't think it will cause a mistrial because they still have a jury, composed of the other original eleven and an alternate. Alternate jurors sit in on the whole trial so as not to miss anything. They just don't vote unless called to sit in the place of a dismissed juror.\n \n Once dismissed from the jury, one is no longer subject to the court's gag order.\n \n (I think!) emoticon_xhoho", 
   {}, 
   57469, 
   null, 
   1089573240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why was Juror #5 dismisssed??", 
  "url": "http://www.4forums.com/political/news-forum/2717-why-juror-5-dismisssed.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 2717, 
  "discussion_files": [
   [
    "4491.html", 
    "http://www.4forums.com/political/news-forum/2717-why-juror-5-dismisssed-print.html"
   ]
  ], 
  "identifier": 2717
 }
]