[
 [
  [
   57729, 
   null, 
   "Traveler", 
   "Thank God that President Bush had the strength of character to send troops into Iraq to topple Saddam. One look at those pictures and you can see that it was time for Saddam to go, albeit no thanks to France, Germany and Russia who wanted continued support for the Oil-for-palaces program/eternal weapons inspections and who stood to benefit quite nicely economically from the multi-billion dollar deals that they had with Saddam.\n \n Hopefully, Saddam didn't put those chemical weapons into the hands of terrorists, but if he didn't manage to before Bush sent troops into Iraq to topple him, he wont be able to now.\n \n The pictures are quite graphic.\n \n You have been warned.\n \n http://members.cox.net/free_iraq/Free_Iraq.htm", 
   {
    "post_info": {
     "post_title": "Saddam's brutal treatment of his own citizens. Pictures."
    }
   }, 
   null, 
   null, 
   1089732600.0
  ], 
  [
   57731, 
   null, 
   "Traveler", 
   "Thank God that President Bush had the strength of character to send troops into Iraq to topple Saddam. One look at those pictures and you can see that it was time for Saddam to go, albeit no thanks to France, Germany and Russia who wanted continued support for the Oil-for-palaces program/eternal weapons inspections and who stood to benefit quite nicely economically from the multi-billion dollar deals that they had with Saddam.\n \n Hopefully, Saddam didn't put those chemical weapons into the hands of terrorists, but if he didn't manage to before Bush sent troops into Iraq to topple him, he wont be able to now.\n \n The pictures are quite graphic.\n \n You have been warned.\n \n http://members.cox.net/free_iraq/Free_Iraq.htm\n\n \n Time to re-elect President Bush.", 
   {}, 
   57729, 
   null, 
   1089733080.0
  ], 
  [
   57749, 
   null, 
   "Kronus", 
   "Of course, if we really didn't want Saddam to have chemical weapons, we shouldn't have sold them to him in the first place. That probably would have been alot more effective.\n \n And if you think Bush invaded Iraq to help the Iraqi people, could you explain why, upon taking Baghdad, the first thing the US troops secured wasn't the hospitals, museums, or munition dumps, but the Ministry of Oil?", 
   {}, 
   57731, 
   null, 
   1089737460.0
  ], 
  [
   57788, 
   null, 
   "Traveler", 
   "Of course, if we really didn't want Saddam to have chemical weapons, we shouldn't have sold them to him in the first place. That probably would have been alot more effective.\n \n\n \n I doubt that we sold him chemical weapons, that would violate the global chemical weapons ban that we and many nations signed. But believe what you will.\n \n \n\n And if you think Bush invaded Iraq to help the Iraqi people, could you explain why, upon taking Baghdad, the first thing the US troops secured wasn't the hospitals, museums, or munition dumps, but the Ministry of Oil?\n\n \n Actually the overwhelming majority of Iraqi oil wells are found within southern Iraq, and those were secured as we advanced northward on the way to Baghdad. But to answer you concerning Baghdad, we and anyone else knows that the oil that Iraq possesses is their means of getting back on their feet economically. That's why we secured them first in Baghdad, to help them out that way in the long run. But you can believe the \" we are their to steal their oil \" theories/militant muslim propaganda if you want to.", 
   {}, 
   57749, 
   null, 
   1089742320.0
  ], 
  [
   57803, 
   null, 
   "Kronus", 
   "I doubt that we sold him chemical weapons, that would violate the global chemical weapons ban that we and many nations signed. But believe what you will.\n \n\n It's very well documented. Google a bit and you'll find lots of references. Here's just one to get you started.\n http://www.commondreams.org/headlines02/0908-08.htm\n \n \n\n Actually the overwhelming majority of Iraqi oil wells are found within southern Iraq, and those were secured as we advanced northward on the way to Baghdad. But to answer you concerning Baghdad, we and anyone else knows that the oil that Iraq possesses is their means of getting back on their feet economically. That's why we secured them first in Baghdad, to help them out that way in the long run. But you can believe the \" we are their to steal their oil \" theories/militant muslim propaganda if you want to.\n\n \n The Ministry of Oil is a building, not a well. And sure, oil will help them in the long run. But while the US troops were busy securing a building full of paper, hospitals were being looted, kids were being raped in orphanages, and rioting was occurring in the streets. So if you want to believe the neo-con propoganda that we went there to help the people, then you feel free.", 
   {}, 
   57788, 
   null, 
   1089744840.0
  ], 
  [
   57810, 
   null, 
   "apathy", 
   "Thank god we went in there 15 years later!\n We sure cleaned up that place.\n \n http://www.iraqbodycount.net/\n \n http://www.robert-fisk.com/iraqwarvictims_mar2003.htm\n \n http://civilians.info/iraq/", 
   {}, 
   57803, 
   null, 
   1089749040.0
  ], 
  [
   57812, 
   null, 
   "Traveler", 
   "It's very well documented. Google a bit and you'll find lots of references. Here's just one to get you started.\n http://www.commondreams.org/headlines02/0908-08.htm\n \n \n \n The Ministry of Oil is a building, not a well. And sure, oil will help them in the long run. But while the US troops were busy securing a building full of paper, hospitals were being looted, kids were being raped in orphanages, and rioting was occurring in the streets. So if you want to believe the neo-con propoganda that we went there to help the people, then you feel free.\n \n\n \n Far more people were being raped, violated, etc under Saddams regime ...and only when these things happen in the streets of Baghdad, when we invade Iraq, when we secure the Oil Ministry building, do the liberals somehow notice atrocities being committed.\n \n Puhleeze...Liberals made a stink about the stuff that you brought up just so they could have dirt to throw at Bush. They don't care about the Iraqi's. Leftist and liberals marched big-time when we invaded Iraq, but hardly made a peep when Clinton invaded Kosovo. Puhleeze...people can see right through the liberals and their hypocrisy. When Clinton took us to war, the liberals/democrats say next to nothing, but when a Republican sends us to war against Iraq, he's called a misleader a liar, and everything else in between. Democrats/liberals are hypocrites, and they know it.\n \n Well, it appears that you will believe the neo-lib/militant muslim propaganda about us wanting to steal their oil.\n \n Actually, we went in there because Saddam violated the UN resolution that stated that if he kept violating the UN resolutions that force could/would be used against him. Well, Saddam finally violated one too many and we enforced the UN resolution which allowed use of force against Saddam. \n \n Weak-kneed and wimpy liberals would have us keep writing up resolutions, and enforcing none...while the Saddams of the world laugh at us.\n \n The UN did nothing about Kosovo, They did nothing about Uganda, they did nothing about the Khmer-Rouge...and millions were slaughtered....but they did write up resolutions, though.", 
   {}, 
   57803, 
   null, 
   1089750060.0
  ], 
  [
   57813, 
   null, 
   "Traveler", 
   "Thank god we went in there 15 years later!\n We sure cleaned up that place.\n \n http://www.iraqbodycount.net/\n \n http://www.robert-fisk.com/iraqwarvictims_mar2003.htm\n \n http://civilians.info/iraq/\n\n \n ....Despite objections by the Democrats who could care less about the 250,000+ Iraqi's being killed by Saddam, but make a stink about the Iraqi prison scandal, and the few-in-comparison Iraqi civilians who were killed when we invaded Iraq.\n \n The Democrats care only about damaging Bush. They're hypocrites.", 
   {}, 
   57810, 
   null, 
   1089750240.0
  ], 
  [
   57814, 
   null, 
   "Kronus", 
   "You're really all over the place there, aren't you? You're original premise was the Bush was a great guy for helping the Iraqi people and going after those chemical weapons. Bush clearly doesn't care about the Iraqi people, or he wouldn't have killed almost 10,000 in just over a year. That beats Saddam's average, by the way. And you have nothing to say about the fact that we sold him the chemical weapons in the first place?\n \n The fact that you don't address any of this, but instead go off on a rant about the UN, Clinton, and Kosovo, just shows that you really don't have much to back up your original statements.", 
   {}, 
   57812, 
   null, 
   1089750660.0
  ], 
  [
   57833, 
   null, 
   "apathy", 
   "we also have no idea what iraq will be like 10 years from now (unless it will continue to be a US colony) \n \n we don't know if THAT regime will oppress/kill its people", 
   {}, 
   57814, 
   null, 
   1089757020.0
  ], 
  [
   57836, 
   null, 
   "apathy", 
   "....Despite objections by the Democrats who could care less about the 250,000+ Iraqi's being killed by Saddam, but make a stink about the Iraqi prison scandal, and the few-in-comparison Iraqi civilians who were killed when we invaded Iraq.\n \n The Democrats care only about damaging Bush. They're hypocrites.\n\n \n Where did you get 250,000+ ??\n Please cite your source for that number.", 
   {}, 
   57813, 
   null, 
   1089757320.0
  ], 
  [
   57840, 
   null, 
   "Traveler", 
   "You're really all over the place there, aren't you? You're original premise was the Bush was a great guy for helping the Iraqi people and going after those chemical weapons. Bush clearly doesn't care about the Iraqi people, or he wouldn't have killed almost 10,000 in just over a year. That beats Saddam's average, by the way. And you have nothing to say about the fact that we sold him the chemical weapons in the first place?\n \n The fact that you don't address any of this, but instead go off on a rant about the UN, Clinton, and Kosovo, just shows that you really don't have much to back up your original statements.\n\n \n Nowhere in my original premise did I say that Bush was a great guy for helping the Iraqi people, Liar.\n \n Bush went after the chemical weapons,(that Clinton, Kofi Annan, and John Kerry thought were there also) and to topple Saddam because he violated one too many UN resolutions.\n \n 10,000 innocent Iraqi's killed, yet that wont have to happen year after yaer like it would under Saddam...Evidently you would still prefer Saddam to be in power, or are just looking for someting to bash Bush over.\n \n If you say that you don't want Saddam to still be in power, yet you don't support Bush's invasion of Iraq to topple him, per the UN resolution that allowed that, then you are just like the person who walks by as a woman is being raped, you say that you don't like her being raped, yet you won't do anything about it, and bash someone who does stop it.\n \n Did Bush sell Saddam chemical weapons?NO, he didn't. Yes, it was a mistake for the US to sell Saddam chemical weapons, if indeeed we did sell them to him, but what matters is now. Why did Clinton enable Missile technology to get into the hands of the Chinese?\n \n No, there was no rant, only the addressing of liberal hypocrisy.\n \n Liberals/leftists march in the streets when Republicans send the US into war, and say next to nothing when one of their own, a Democrat, send us into war, like Clinton did with Kososvo.\n \n That is why liberals are worthless losers.", 
   {}, 
   57814, 
   null, 
   1089758280.0
  ], 
  [
   57843, 
   null, 
   "jim's trucking", 
   "Where did you get 250,000+ ??\n Please cite your source for that number.\n\n \n I've also seen estimates of 300,000 and 400,000. I don't recall the sources. I'll keep a look out for them.", 
   {}, 
   57836, 
   null, 
   1089759540.0
  ], 
  [
   57846, 
   null, 
   "jim's trucking", 
   "Here are a few I found. There are others. How many do you need?\n \n http://209.157.64.200/focus/f-news/1017569/posts\n \n http://www.usaid.gov/iraq/pdf/iraq_mass_graves.pdf\n \n http://www.iraqwar.info/modules.php?op=modload&name=News&file=article&sid=725\n \n http://www.alertnet.org/thenews/newsdesk/HAM841581.htm", 
   {}, 
   57843, 
   null, 
   1089760200.0
  ], 
  [
   57847, 
   null, 
   "Waxy", 
   "Nowhere in my original premise did I say that Bush was a great guy for helping the Iraqi people, Liar.\n\n \n What impression is one supposed to get from your opening sentence? \n \n \nThank God that President Bush had the strength of character to send troops into Iraq to topple Saddam.\n\n \n Then you follow with this - \n \n \nBush went after the chemical weapons,(that Clinton, Kofi Annan, and John Kerry thought were there also) and to topple Saddam because he violated one too many UN resolutions.\n \n 10,000 innocent Iraqi's killed, yet that wont have to happen year after yaer like it would under Saddam...Evidently you would still prefer Saddam to be in power, or are just looking for someting to bash Bush over.\n \n If you say that you don't want Saddam to still be in power, yet you don't support Bush's invasion of Iraq to topple him, per the UN resolution that allowed that, then you are just like the person who walks by as a woman is being raped, you say that you don't like her being raped, yet you won't do anything about it, and bash someone who does stop it.\n \n Did Bush sell Saddam chemical weapons?NO, he didn't. Yes, it was a mistake for the US to sell Saddam chemical weapons, if indeeed we did sell them to him, but what matters is now. Why did Clinton enable Missile technology to get into the hands of the Chinese?\n \n No, there was no rant, only the addressing of liberal hypocrisy.\n \n Liberals/leftists march in the streets when Republicans send the US into war, and say next to nothing when one of their own, a Democrat, send us into war, like Clinton did with Kososvo.\n \n That is why liberals are worthless losers.\n\n \n I was actually going to respond to this post point by point, but changed my mind. \n \n When it comes right down to it, I have no problem with those that believe in what the US is doing in Iraq, I don't believe in it, or more exactly, in the manner the Bush administration went about it, but there are valid reasons for believing that good will come of it.\n \n What I really can't stand is posts like this that rely solely on falsehoods and personal attacks (\"liberals are worthless losers\" as a point? What are you, 2 years old?) of those with differing views to bolster their position.\n \n I'll wait and see whether any serious debate arises out of this one before I wade in any furhter.\n \n Waxy", 
   {}, 
   57840, 
   null, 
   1089760260.0
  ], 
  [
   57850, 
   null, 
   "SuperDutyHaulin", 
   "You guys just can't get over what a peice of **** Saddam was, but you will villify Bush, every chance you get. The Iraqi people are far better off today than they were with Saddam in power. Do you even know how Saddam came into power?", 
   {}, 
   57846, 
   null, 
   1089760500.0
  ], 
  [
   57851, 
   null, 
   "jim's trucking", 
   "You're really all over the place there, aren't you? You're original premise was the Bush was a great guy for helping the Iraqi people and going after those chemical weapons. Bush clearly doesn't care about the Iraqi people, or he wouldn't have killed almost 10,000 in just over a year. That beats Saddam's average, by the way.  And you have nothing to say about the fact that we sold him the chemical weapons in the first place?\n \n The fact that you don't address any of this, but instead go off on a rant about the UN, Clinton, and Kosovo, just shows that you really don't have much to back up your original statements.\n\n \n Averages mean nothing. I believe that in 1988 Saddam killed 182,000 or so. The estimates of total Iraqi deaths at the hands of Saddam and Sons  are approaching 400,000+.\n \n You don't know that the 10,000 civilians reported killed during the major war effort were killed by American firepower. I'll admit that some definitely were, but not all...even in the GB41 war, some Iraqis were killed by their own munitions, after their being fired straight up!\n \n The Iraqi terrorists are still killing Iraqi civilians and policemen with car bombs and such.\n \n Why do you not see this as a problem?", 
   {}, 
   57814, 
   null, 
   1089760680.0
  ], 
  [
   57852, 
   null, 
   "jim's trucking", 
   "...and lest we forget, there were many good Americans and British people who thought Adolph Hitler was a nice guy until he turned to :xcensored !", 
   {}, 
   57851, 
   null, 
   1089760860.0
  ], 
  [
   57858, 
   null, 
   "SuperDutyHaulin", 
   "...and lest we forget, there were many good Americans and British people who thought Adolph Hitler was a nice guy until he turned to :xcensored !\n\n \n \n Jim, I am glad there is at least one other person here that has some common sense. Heres to you emoticon_xhoho", 
   {}, 
   57852, 
   null, 
   1089762300.0
  ], 
  [
   57860, 
   null, 
   "jim's trucking", 
   "emoticon_xhoho emoticon_xhoho\n fax me a beer!", 
   {}, 
   57858, 
   null, 
   1089763020.0
  ], 
  [
   57861, 
   null, 
   "jskufan", 
   "The reason these threads just keep going round and round is plain and simple: the premise we used to \"rush\" into war was unsubstantiated. When you stand up and tell your people we need to hurry up and invade a country because they have WMD's and represent a serious threat, you better be right. Everything that has come out of this administration afterwords comes under the category of \"justifying our actions\" because our original premise didn't pan out. The fact is, the atrocities against humanity that keep getting brought up occurred before and right after the original Gulf War, and that was 1991. That was over thirteen years ago, here is a quote from Jim's Trucking's link:\n \n \"Investigators have identified six major crime periods: 1983 attacks on Kurds, a 1988 campaign against Kurds, chemical weapons attacks on Kurds 1986-88, the 1991 crushing of a southern Shi'ite revolt, 1991 crushing of Kurdish insurrection, and crimes against all sectors of the population during the entire period of Baath rule. \" \n \n I guarantee the majority of Republicans and Neo-Cons never would have signed off on this war as a \"humanitarian\" effort if it had been pitched that way to begin with. That's what makes all these posts so ludicrous. If we cared so much about the Kurds, why did we abandon them under Bush Sr. and sit back while they were slaughtered after the Gulf War in 1991? I must be the only one that sees the transparency of the modern day Republican, they deplore social programs that dole out tax monies to American recipients, yet they overwhelmingly support rebuilding a foreign country and trying to make life better for the Iraqi's.", 
   {}, 
   57852, 
   null, 
   1089763320.0
  ], 
  [
   57862, 
   null, 
   "apathy", 
   "Here are a few I found. There are others. How many do you need?\n \n http://209.157.64.200/focus/f-news/1017569/posts\n \n http://www.usaid.gov/iraq/pdf/iraq_mass_graves.pdf\n \n http://www.iraqwar.info/modules.php?op=modload&name=News&file=article&sid=725\n \n http://www.alertnet.org/thenews/newsdesk/HAM841581.htm\n\n \n Here is all they say:\n \n \"We have reports of 260 mass graves and we have confirmed approximately 40 of them,\" said Sandra Hodgkinson, director of the Coalition Provisional Authority's (CPA) `mass grave action plan'.\n \n \"We believe, based on what Iraqis have reported to us, that there are 300,000 dead and that's the lower end of the estimates.\"\n \n We have reports...\n We believe...\n \n All I see here are \"estimates\" of 300,000+ all quoting the same people, all quoting each other.\n \n -----------------------------------------------------------\n \n Look, I'm not ever going to say Saddam Hussein was a good guy. He was bad. That's NOT the reason we went to war, as you said, it was because of violating UN resolutions (that were pretty much impossible to not violate). \n \n The concept of toppling Saddam was a good idea to most everybody at the time. THEN the war actually happened. The average american then starts learning that every bomb we drop isn't smart. Actually, only a small fraction are. The rest blow up lots of stuff and we dropped plenty and blew up lots of stuff, including lots of people. We were told, if you remember, that \"collateral damage\" would be minimal, that the war would be over in a month (which it looked like at the time), and then we'd be outie. This is what we were being told 18 months ago. The complete opposite is what is happening. That's why a lot of people are steaming P*ssed. \n \n No real american likes Saddam Hussein. An Iraq without him is a better Iraq (???) Was killing 10,000+ MORE Iraqis worth it? Apparently some here are saying YES.\n \n {btw- if you call me a democrat or a liberal i will know that you are full of it since i am neither}", 
   {}, 
   57846, 
   null, 
   1089763740.0
  ], 
  [
   57863, 
   null, 
   "sinjin", 
   "If Saddam had never invaded Kuwait and went about his genocide and torture minding his own business he'd still be doing it today. The U.S. as liberator of the oppressed is laughable. When will we be going to Nigeria?\n Why weren't we in Chile or Indonesia? How about Cambodia during Pol Pot or Burma now? The U.S. doesn't mind a tyrant unless he's bad for business. Same old story.", 
   {}, 
   57860, 
   null, 
   1089763740.0
  ], 
  [
   57864, 
   null, 
   "jim's trucking", 
   "The reason these threads just keep going round and round is plain and simple: the premise we used to \"rush\" into war was unsubstantiated. When you stand up and tell your people we need to hurry up and invade a country because they have WMD's and represent a serious threat, you better be right. Everything that has come out of this administration afterwords comes under the category of \"justifying our actions\" because our original premise didn't pan out. The fact is, the atrocities against humanity that keep getting brought up occurred before and right after the original Gulf War, and that was 1991. That was over thirteen years ago, here is a quote from Jim's Trucking's link:\n \n \"Investigators have identified six major crime periods: 1983 attacks on Kurds, a 1988 campaign against Kurds, chemical weapons attacks on Kurds 1986-88, the 1991 crushing of a southern Shi'ite revolt, 1991 crushing of Kurdish insurrection, and crimes against all sectors of the population during the entire period of Baath rule. \" \n \n I guarantee the majority of Republicans and Neo-Cons never would have signed off on this war as a \"humanitarian\" effort if it had been pitched that way to begin with. That's what makes all these posts so ludicrous. If we cared so much about the Kurds, why did we abandon them under Bush Sr. and sit back while they were slaughtered after the Gulf War in 1991? I must be the only one that sees the transparency of the modern day Republican, they deplore social programs that dole out tax monies to American recipients, yet they overwhelmingly support rebuilding a foreign country and trying to make life better for the Iraqi's.\n\n \n Actually, the reason they keep going round and round is that the liberals can't understand or won't accept the truth.\n \n You don't know that WMDs were not there. Even though we haven't found many, you don't know that some are still not there. You don't know where they went. Surely, you agree that they were there at one time because Slick Willy and the gang said they were. He's even the first of the two to say that there was a link between Saddam and Al Quaeda. He and Kerry (and Edwards) all said Saddam should be deposed. Clinton signed a bill saying that our goal was to depose Saddam Hussein.\n \n Just because we haven't found great quantities of WMDs you now say that the premise was wrong and we shouldn't have gone in.\n \n The facts remain that the mass killings have stopped, the rape and torture has stopped, the Iraqi people are free and will soon elect their own leaders, etc. etc. The Iraqi people do not agree with you.\n \n The libs keep trying to degrade Bush's accomplishments by saying the WMDs weren't there. They are full of :xcensored !\n \n If you'd listen to someone besides the liberal talking heads and the liberal press, you'd learn the truth and shut up.", 
   {}, 
   57861, 
   null, 
   1089763860.0
  ], 
  [
   57865, 
   null, 
   "apathy", 
   "since we're talking atrocities:\n \n http://www.deoxy.org/wc/warcrime.htm\n \n http://www.thewinds.org/1997/02/war_crimes.html\n \n http://www.whatreallyhappened.com/oil.html (look for highlighted text)\n (we could start a thread about the reasons behind the 9/11 attacks, were they motivated by rumors of US invading Afghanistan?)\n http://www.whatreallyhappened.com/preplanned.html\n \n I don't know who robert fisk is, but he sure has a huge website:\n http://www.robert-fisk.com/the_evidence.htm", 
   {}, 
   57862, 
   null, 
   1089764400.0
  ], 
  [
   57866, 
   null, 
   "jim's trucking", 
   "Here is all they say:\n \n \"We have reports of 260 mass graves and we have confirmed approximately 40 of them,\" said Sandra Hodgkinson, director of the Coalition Provisional Authority's (CPA) `mass grave action plan'.\n \n \"We believe, based on what Iraqis have reported to us, that there are 300,000 dead and that's the lower end of the estimates.\"\n \n We have reports...\n We believe...\n \n All I see here are \"estimates\" of 300,000+ all quoting the same people, all quoting each other.\n \n -----------------------------------------------------------\n \n Look, I'm not ever going to say Saddam Hussein was a good guy. He was bad. That's NOT the reason we went to war, as you said, it was because of violating UN resolutions (that were pretty much impossible to not violate). \n \n The concept of toppling Saddam was a good idea to most everybody at the time. THEN the war actually happened. The average american then starts learning that every bomb we drop isn't smart. Actually, only a small fraction are. The rest blow up lots of stuff and we dropped plenty and blew up lots of stuff, including lots of people. We were told, if you remember, that \"collateral damage\" would be minimal, that the war would be over in a month (which it looked like at the time), and then we'd be outie. This is what we were being told 18 months ago. The complete opposite is what is happening. That's why a lot of people are steaming P*ssed. \n \n No real american likes Saddam Hussein. An Iraq without him is a better Iraq (???) Was killing 10,000+ MORE Iraqis worth it? Apparently some here are saying YES.\n \n {btw- if you call me a democrat or a liberal i will know that you are full of it since i am neither}\n\n \n Evidently, you'd have to go count the bodies yourself to believe the quantity.", 
   {}, 
   57862, 
   null, 
   1089764520.0
  ], 
  [
   57867, 
   null, 
   "jim's trucking", 
   "since we're talking atrocities:\n \n http://www.deoxy.org/wc/warcrime.htm\n \n http://www.thewinds.org/1997/02/war_crimes.html\n \n http://www.whatreallyhappened.com/oil.html (look for highlighted text)\n (we could start a thread about the reasons behind the 9/11 attacks, were they motivated by rumors of US invading Afghanistan?)\n http://www.whatreallyhappened.com/preplanned.html\n \n I don't know who robert fisk is, but he sure has a huge website:\n http://www.robert-fisk.com/the_evidence.htm\n\n \n Surely, you don't expect me to believe any of these \"reports\"! ;)", 
   {}, 
   57865, 
   null, 
   1089764700.0
  ], 
  [
   57870, 
   null, 
   "Waxy", 
   "Actually, the reason they keep going round and round is that the liberals can't understand or won't accept the truth.\n \n You don't know that WMDs were not there. Even though we haven't found many, you don't know that some are still not there. You don't know where they went. Surely, you agree that they were there at one time because Slick Willy and the gang said they were. He's even the first of the two to say that there was a link between Saddam and Al Quaeda. He and Kerry (and Edwards) all said Saddam should be deposed. Clinton signed a bill saying that our goal was to depose Saddam Hussein.\n \n Just because we haven't found great quantities of WMDs you now say that the premise was wrong and we shouldn't have gone in.\n \n The facts remain that the mass killings have stopped, the rape and torture has stopped, the Iraqi people are free and will soon elect their own leaders, etc. etc. The Iraqi people do not agree with you.\n \n The libs keep trying to degrade Bush's accomplishments by saying the WMDs weren't there. They are full of :xcensored !\n \n If you'd listen to someone besides the liberal talking heads and the liberal press, you'd learn the truth and shut up.\n\n \n And you don't know that the WMDs were there. You can speculate, but you can't prove it any more than I can prove they weren't. So where does that leave us? It leaves us with a search for proof of their existence, so far, none, or very little, has turned up.\n \n What is some? A couple of reports of very minor finds of possible weapons? Is \"some\" the amount that was claimed posed a threat to American freedom?\n \n How should people respond? How should the average Joe Sixpack respond when he's told his very safety is at risk due to Iraq's WMDs, then after we go in, the greatest military power with the greatest technology in the world, and are unable to provide any real concrete evidence of WMD's or an immediate threat. Should he feel deceived? Should he question the original assertion that there were WMDs?\n \n Or should he simply believe that because he was told they were there and that Iraq did have them at one time, that they are there, we just can't find them despite all our efforts and technology? \n \n I'm a born skeptic. I won't take it on faith that the WMDs were there. I don't believe that some Iraqis in the desert can dismantle and hide every last WMD, enough to puportedly pose a serious threat to the safety of every American citizen, right under the noses of the most powerful and technologically advanced nation in the world. It's completely implausible IMHO.\n \n So what are Joe Sixpack's options? Well, he either raises a stink and wonders why he's potentially been lied to, REGARDLESS OF JOE'S POLITICAL AFFILIATION, or he does as Jim would rather him do, and shuts up and accepts the word of those that told him the WMDs were there.\n \n Is shutting up and accepting the \"truth\" the American way? \"Well, the president and the next presidential candidate said they're there, they can't provide any evidence, but by golly, if they said they're there, they must be there. My gov't wouldn't lie to me, my gov't couldn't be wrong.\" When does blind faith take over from critical thought? \n \n When will partisan finger pointing end - Bush this, Clinton that, and someone actually take charge? I find that INCREDIBLY frustrating as an observer of American politics.\n \n Liberating the Iraqis is great, it'll be even better if it actually works, but the current claims that it's the reason for going to Iraq or that it justifies the deception surrounding the WMDs is simply absurd. America as the liberator is laughable, that's been pointed out over and over again.\n \n Waxy", 
   {}, 
   57864, 
   null, 
   1089766320.0
  ], 
  [
   57871, 
   null, 
   "apathy", 
   "You expect me to believe yours.\n \n -------------------------------------------------------------\n This link: http://www.whatreallyhappened.com/oil.html\n has minutes from the senate, that show our interest in Afghanistan and the need for a stable government (read \"our gov\") that would let UNOCAL build its pipeline\n \n This link: http://www.indiareacts.com/archivefeatures/nat2.asp?recno=10&mp;ctg=policy\n is from June 2001 and discusses the US and Russia's plan to invade Afghanistan\n -------------------------------------------------------------\n \n This is the garbage that got us all into this in the first place. \n \n I don't mean to insult anyone here but I must ask \"truckin\" and \"haulin\" if they are rich. Something tells me they are not, could be the screen names.\n If you are not rich, then you are the type of person that keeps certain VERY rich people VERY rich. \n \n They need people like you.", 
   {}, 
   57867, 
   null, 
   1089766380.0
  ], 
  [
   57872, 
   null, 
   "jskufan", 
   "Jim, the only thing that gets tiring is your misuse of the term Liberal. It's hard to take anyone serious that doesn't understand the terms they use. Opposing the war has nothing to do with being a Liberal. Look up the term if you don't believe me. Lots of people think our foreign policy is off base, even some Conservatives I'd bet. Someone who thinks we were/are wrong for taking this nation to war is simply someone that interprets the data differently than you. We all know the WMD technology was there at some time. If I'm not mistaken, we helped them develop it to aid them in the Iran/Iraq war. Everything after that is someones speculation on when, how much, where, etc., etc. By the way, The bi-partisan Senate Intelligence Committee said the premise was wrong. Senator Pat Roberts, a Republican, heads that committee. You justify it any way you like, the only person you have to convince is you, good luck!", 
   {}, 
   57867, 
   null, 
   1089767160.0
  ], 
  [
   57874, 
   null, 
   "lord tammerlain", 
   "The fact that Saddam was welcomed to the US as a friend of the US government one year after the gassing of the Kurds, indicates how much the US government cares about human rights.", 
   {}, 
   57872, 
   null, 
   1089768420.0
  ], 
  [
   57910, 
   null, 
   "daewoo", 
   "Jim, the only thing that gets tiring is your misuse of the term Liberal. It's hard to take anyone serious that doesn't understand the terms they use. Opposing the war has nothing to do with being a Liberal. Look up the term if you don't believe me. Lots of people think our foreign policy is off base, even some Conservatives I'd bet. Someone who thinks we were/are wrong for taking this nation to war is simply someone that interprets the data differently than you. We all know the WMD technology was there at some time. If I'm not mistaken, we helped them develop it to aid them in the Iran/Iraq war. Everything after that is someones speculation on when, how much, where, etc., etc. By the way, The bi-partisan Senate Intelligence Committee said the premise was wrong. Senator Pat Roberts, a Republican, heads that committee. You justify it any way you like, the only person you have to convince is you, good luck!\n\n \n I think that Jim is far from alone in this. these are the guys that the respective parties class as \"unconditional supporters\". They are the votes that their party feels they don;t need to work for, they will simply follow the directions given by their party representatives. Either party could ruyn adolf hitler for president, and they could count on their \"unconditional supporters\" to vote for him.\n \n I am very conservative, and I think our foreign policy is INCREDIBLY off base. I also think our deomestic spending habits are so far off that it is rediculous. I am not an unconditional supprter of the republican party, but I will most likely NEVER vote democrat, as they seem to be even worse.\n \n I think that republicans need to WAKE UP and realise that their party has completly abandoned their core values. Bush has, in the course of his presidency and with the full support of his party, passed the biggest social program EVER, shot our deficit through the roof and drastically increased the size of the government (this from the party that is supposed to be the small government and fiscal responsibility crowd) and thrown us int a very expensive war based either on WMD's, Humanitarian purposes (which is not something republicans traditionally go to war over) or terrorism. Since the WMD's have been disproven, as have the reasons relating to terrorism, that leaves us with a hundred billion dollar humanitarian war. This from the fiscal conservatives?\n \n I think that all theose out there who are unconditional supporters of the republican party need to take a HARD look around at the policies of their party, and take a REALLY hard look at themselves, before they start labeling others as \"liberals\". I think Bush is possibly the most liberal president we have had in the white house in the last 30 years.", 
   {}, 
   57872, 
   null, 
   1089791880.0
  ], 
  [
   57932, 
   null, 
   "JPSartre12", 
   "You're really all over the place there, aren't you? You're original premise was the Bush was a great guy for helping the Iraqi people and going after those chemical weapons. Bush clearly doesn't care about the Iraqi people, or he wouldn't have killed almost 10,000 in just over a year. That beats Saddam's average, by the way. And you have nothing to say about the fact that we sold him the chemical weapons in the first place?\n \n\n Ah yes, fresh meat..... emoticon_rolleyes \n Did you ever consider that they secured the Ministry of Oil because it was crucial to Iraq's rebuilding and that it was only ONE building as opposed to hundreds of hospitals, etc., ? I love it when Bush bashers point out the few weeds in a field of daisies. You folks are just so cheerful I could puke. emoticon_rolleyes \n And the 10,000 Iraqis that \"Bush\" killed. How many of them were aiming guns at US soldiers at the time of their demise? Maybe we should have sent John Kerry in to bore them to death instead? Or maybe John Edwards to sue them?\n And as for the chemical weapons, when did Bush sell them to Iraq? If we sold them to Iraq at all it would have been under Carter or possibly Reagan, but GW2 had nothing to do with them. If you want to blame someone for their sale, look to past administrations, not the current one.\n Thanks to GW2, there are 35 Million FREE Iraqis. That fact is indisputable.", 
   {}, 
   57814, 
   null, 
   1089816600.0
  ], 
  [
   57941, 
   null, 
   "jim's trucking", 
   "And you don't know that the WMDs were there. You can speculate, but you can't prove it any more than I can prove they weren't. So where does that leave us? It leaves us with a search for proof of their existence, so far, none, or very little, has turned up.\n \n What is some? A couple of reports of very minor finds of possible weapons? Is \"some\" the amount that was claimed posed a threat to American freedom?\n \n How should people respond? How should the average Joe Sixpack respond when he's told his very safety is at risk due to Iraq's WMDs, then after we go in, the greatest military power with the greatest technology in the world, and are unable to provide any real concrete evidence of WMD's or an immediate threat. Should he feel deceived? Should he question the original assertion that there were WMDs?\n \n Or should he simply believe that because he was told they were there and that Iraq did have them at one time, that they are there, we just can't find them despite all our efforts and technology? \n \n I'm a born skeptic. I won't take it on faith that the WMDs were there. I don't believe that some Iraqis in the desert can dismantle and hide every last WMD, enough to puportedly pose a serious threat to the safety of every American citizen, right under the noses of the most powerful and technologically advanced nation in the world. It's completely implausible IMHO.\n \n So what are Joe Sixpack's options? Well, he either raises a stink and wonders why he's potentially been lied to, REGARDLESS OF JOE'S POLITICAL AFFILIATION, or he does as Jim would rather him do, and shuts up and accepts the word of those that told him the WMDs were there.\n \n Is shutting up and accepting the \"truth\" the American way? \"Well, the president and the next presidential candidate said they're there, they can't provide any evidence, but by golly, if they said they're there, they must be there. My gov't wouldn't lie to me, my gov't couldn't be wrong.\" When does blind faith take over from critical thought? \n \n When will partisan finger pointing end - Bush this, Clinton that, and someone actually take charge? I find that INCREDIBLY frustrating as an observer of American politics.\n \n Liberating the Iraqis is great, it'll be even better if it actually works, but the current claims that it's the reason for going to Iraq or that it justifies the deception surrounding the WMDs is simply absurd. America as the liberator is laughable, that's been pointed out over and over again.\n \n Waxy\n\n \n Skeptical is not the word. In denial  is more fitting. Many of out leaders, the UN and other nations know beyond any doubt that the weapons were there. What we don't know is what happened to them. They have either been destroyed or relocated. There is no proof of their destruction, therefore they were likely relocated. Where are they now?\n \n By shut up, I meant get off of the argument that there were no weapons. The truth is that there were plenty of them.\n \n You don't give the Iraqis enough credit in the sly department. Hiding something under someone's nose is not a difficult task. We have satellite cameras that can read a car tag from orbit, but they can't see what's in the trunk. How many vehicles do you think are in Iraq?\n \n A small amout of chemical agent can kill thousands of people. I'll agree that we haven't found the quantities of weapons reported to have been there, but I will not agree that they weren't there when we started or that they haven't been secreted to another location under the control of our enemies.", 
   {}, 
   57870, 
   null, 
   1089821940.0
  ], 
  [
   57945, 
   null, 
   "jim's trucking", 
   "You expect me to believe yours.\n \n -------------------------------------------------------------\n This link: http://www.whatreallyhappened.com/oil.html\n has minutes from the senate, that show our interest in Afghanistan and the need for a stable government (read \"our gov\") that would let UNOCAL build its pipeline\n \n This link: http://www.indiareacts.com/archivefeatures/nat2.asp?recno=10&mp;ctg=policy\n is from June 2001 and discusses the US and Russia's plan to invade Afghanistan\n -------------------------------------------------------------\n \n This is the garbage that got us all into this in the first place. \n \n I don't mean to insult anyone here but I must ask \"truckin\" and \"haulin\" if they are rich. Something tells me they are not, could be the screen names.\n If you are not rich, then you are the type of person that keeps certain VERY rich people VERY rich. \n \n They need people like you.\n\n \n I don't expect you to believe anything.\n \n I am rich in more ways than one, but I don't have a lot of money.\n \n Do you think personal riches should be taken and redistributed equally to all people?", 
   {}, 
   57871, 
   null, 
   1089822540.0
  ], 
  [
   57950, 
   null, 
   "jim's trucking", 
   "Jim, the only thing that gets tiring is your misuse of the term Liberal.  It's hard to take anyone serious that doesn't understand the terms they use. Opposing the war has nothing to do with being a Liberal. Look up the term if you don't believe me. Lots of people think our foreign policy is off base, even some Conservatives I'd bet. Someone who thinks we were/are wrong for taking this nation to war is simply someone that interprets the data differently than you. We all know the WMD technology was there at some time. If I'm not mistaken, we helped them develop it to aid them in the Iran/Iraq war. Everything after that is someones speculation on when, how much, where, etc., etc. By the way, The bi-partisan Senate Intelligence Committee said the premise was wrong. Senator Pat Roberts, a Republican, heads that committee. You justify it any way you like, the only person you have to convince is you, good luck!\n\n \n Perhaps you are right on that point. I mistakenly refer to Bushwhackers as liberal when they may not all be so. I'll work on that.\n \n I've not agreed with everything any President has done or wants to do. I'm not an unconditional supporter of Bush as claimed by another mistaken poster. Had Leiberman won the Democratic nomination, I might have voted for him.", 
   {}, 
   57872, 
   null, 
   1089823260.0
  ], 
  [
   57963, 
   null, 
   "Waxy", 
   "Skeptical is not the word. In denial  is more fitting. Many of out leaders, the UN and other nations know beyond any doubt that the weapons were there. What we don't know is what happened to them. They have either been destroyed or relocated. There is no proof of their destruction, therefore they were likely relocated. Where are they now?\n \n By shut up, I meant get off of the argument that there were no weapons. The truth is that there were plenty of them.\n\n \n I could accuse you of being equally in denial Jim. \n \n The UN, the Bush Administration, the CIA, practically everyone has admitted to flawed intelliegence regarding the presence of WMD's in Iraq post GW1. We know that the USA sold Saddam some chemical weapons in the 80's. That's it. None of our leaders \"know beyond any doubt that the weapons were there\", especially during or immediately prior to the invasion. That's a statement of your opinion that is unsupportable, much like me stating that there were no weapons there.\n \n \nYou don't give the Iraqis enough credit in the sly department. Hiding something under someone's nose is not a difficult task. We have satellite cameras that can read a car tag from orbit, but they can't see what's in the trunk. How many vehicles do you think are in Iraq?\n\n \n Who cares how many vehicles there are?\n \n How can we have knowledge \"beyond any doubt\" that these weapons are there, and then just lose them? We blink of a second and a few Iraqis threw them in their trunks and drove away, and the US is totally stumped? What? \n \n Maybe I don't underestimate the Iraqis, maybe I overestimate the intelligence and ability of the US.\n \n \nA small amout of chemical agent can kill thousands of people. I'll agree that we haven't found the quantities of weapons reported to have been there, but I will not agree that they weren't there when we started or that they haven't been secreted to another location under the control of our enemies.\n\n \n Well, the phrase in denial comes to mind.\n \n Waxy", 
   {}, 
   57941, 
   null, 
   1089827220.0
  ], 
  [
   57983, 
   null, 
   "jim's trucking", 
   "I could accuse you of being equally in denial Jim.\n \n ...\n...but you would be wrong. I am claiming that there is a strong possibility that they are still in Iraq. You are denying that they ever were there. Had they not been there, there wouldn't have been so many people claiming that they were there. \n \n \n\n Who cares how many vehicles there are?\n\n There could be something hidden in any one or all of them.\n \n \n\n How can we have knowledge \"beyond any doubt\" that these weapons are there, and then just lose them? We blink of a second and a few Iraqis threw them in their trunks and drove away, and the US is totally stumped? What?\n\n The possiblility exists. \n \n \n\n Maybe I don't underestimate the Iraqis, maybe I overestimate the intelligence and ability of the US.\n...or both.\n \n \n \n\n Well, the phrase in denial comes to mind.\n \n Waxy\nStatement of a possibility does not constitute denial.", 
   {}, 
   57963, 
   null, 
   1089833040.0
  ], 
  [
   58016, 
   null, 
   "apathy", 
   "I don't expect you to believe anything.\n \n I am rich in more ways than one, but I don't have a lot of money.\n \n Do you think personal riches should be taken and redistributed equally to all people?\n\n \n It does take a lot to get me to believe something.\n \n Yup, same here.\n \n Nope, that has nothing to do with what I said. These certain VERY rich folks need non-rich folks to vote for their candidate, so that they can make their international deals and stay VERY rich. One's vote will determine which rich people will get richer (among other more minor things, like policy). \n \n btw- that was a perfect opportunity for someone to say that the terrorists need people like me, but some take the high road i guess", 
   {}, 
   57945, 
   null, 
   1089842760.0
  ], 
  [
   58035, 
   null, 
   "apathy", 
   "I think Bush is possibly the most liberal president we have had in the white house in the last 30 years.\n\n \n Really, I don't know how liberal he is. He wants to fund churches (sorry, faith-based organizations). He wants to ban gay marriage and has banned stem cell research. While these aren't conservative things to do they aren't liberal either. They are, however, very narrow minded, which is Bush all over.", 
   {}, 
   57910, 
   null, 
   1089848100.0
  ], 
  [
   58040, 
   null, 
   "Waxy", 
   "...but you would be wrong. I am claiming that there is a strong possibility that they are still in Iraq. You are denying that they ever were there.\n\n \n You are mis-stating my position Jim.\n \n At no time did I \"deny that they ever were there\", I even stated in my last post that we know the US sold WMDs to Saddam in the '80s. That is you twisting my posts to fit an extremist position. (Likely so that it's easily dismissable as uninformed, wussie, liberal Bushwakking.)\n \n My position is simply this - I do not believe, and no body has been able to prove, (in fact, the more information comes to light, the weaker the case is) that post Gulf War 1 Iraq had a sufficient number of WMDs, or even the capability of producing a sufficient number of WMDs, to pose a serious enough threat to the US to warrant the invasion of a sovereign nation. \n \n That's it, that's all, there ain't no more.\n \n Waxy\n \n P.S. Considering your fondness for pointing out flaws in people's logic, I'm surprised you'd post this statement in defense of your position.\n \n \nHad they not been there, there wouldn't have been so many people claiming that they were there.\n", 
   {}, 
   57983, 
   null, 
   1089849960.0
  ], 
  [
   58047, 
   null, 
   "JPSartre12", 
   "Really, I don't know how liberal he is. He wants to fund churches (sorry, faith-based organizations). He wants to ban gay marriage and has banned stem cell research. While these aren't conservative things to do they aren't liberal either. They are, however, very narrow minded, which is Bush all over.\n\n \n Bush signed NCLB into law = liberal bill\n Bush increased funding to NEA = liberal spending\n Bush signed Prescription plan worth $1Trillion in new Federal spending = big-time liberal move\n Bush is against gay marriage = Conservative stance\n Bush believes in less taxes = Conservative view\n Bush believes in Tort Reform = Definitely NOT a liberal stance, trial lawyers own liberals\n Bush sent troops to fight in a foreign war = usually a Democrat gets us into war, but not always. Generally, we win the ones that Republicans start.\n Bush is tough on terrorists = definitely not a liberal view, liberals believe in sending police after terrorists, not troops\n Bush supports school vouchers = definitely not a liberal stance with the NEA spending 95+% of all of their PAC money on Democrats\n Bush is against abortion= Not a position taken by a Democrat (with the exception of Kerry who straddles the fence on this one depending on the audience)\n \n Overall, I'm not sure what I'd call GW2 other than an enigma. \n \n \n \n emoticon_confused", 
   {}, 
   58035, 
   null, 
   1089851700.0
  ], 
  [
   58050, 
   null, 
   "apathy", 
   "Well, he comes from the heart. And it's the heart of a west texas evangelical christian. Enigma?", 
   {}, 
   58047, 
   null, 
   1089853140.0
  ], 
  [
   58063, 
   null, 
   "SuperDutyHaulin", 
   "You are mis-stating my position Jim.\n \n At no time did I \"deny that they ever were there\", I even stated in my last post that we know the US sold WMDs to Saddam in the '80s. That is you twisting my posts to fit an extremist position. (Likely so that it's easily dismissable as uninformed, wussie, liberal Bushwakking.)\n \n My position is simply this - I do not believe, and no body has been able to prove, (in fact, the more information comes to light, the weaker the case is) that post Gulf War 1 Iraq had a sufficient number of WMDs, or even the capability of producing a sufficient number of WMDs, to pose a serious enough threat to the US to warrant the invasion of a sovereign nation. \n \n That's it, that's all, there ain't no more.\n \n Waxy\n \n \n P.S. Considering your fondness for pointing out flaws in people's logic, I'm surprised you'd post this statement in defense of your position.\n\n \n \n There were weapons of mass destructions. Isrial had their citizens walking around with gas masks one, they have one of the best intellegence agencys in the world, I would even say better than ours. You dont think they would walk around with gass masks all day if they did not truly know there were WMD's. BTW, I am talking about the first gulf war.", 
   {}, 
   58040, 
   null, 
   1089869280.0
  ], 
  [
   58064, 
   null, 
   "SuperDutyHaulin", 
   "Well, he comes from the heart. And it's the heart of a west texas evangelical christian. Enigma?\n\n \n \n I dont nessassaraly like everything Bush does, but I sure as hell do not want that idiot Kerry in the oval office. At least Bush has a heart, his own opinion, and is not a frickin wussy.\n \n Kerry is a flip flopin, supports all veiws (depending on who hes talking to or what day it is), and will get us all killed being the :xcensored he is.\n \n BTW- Kerry, also stated that Saddam had nuclear weapon capability, and was producing WMD, so why the flip flop now???", 
   {}, 
   58050, 
   null, 
   1089869520.0
  ], 
  [
   58067, 
   null, 
   "daewoo", 
   "There were weapons of mass destructions. Isrial had their citizens walking around with gas masks one, they have one of the best intellegence agencys in the world, I would even say better than ours. You dont think they would walk around with gass masks all day if they did not truly know there were WMD's. BTW, I am talking about the first gulf war.\n\n \n I don't think there is any question that he had a limited number of WMDs during the first gulf war. \n \n It is gulf II that bothers me. It is pretty obvious now (as it weas before to anybody who bothered looking at the issue) that he didn't have any leading up tot eh wat. YES, people thought they did. Unfortunatly, the majority of tis seems to beased on the fact that US intelligence kept telling everybody who would listen that they had credible information that he did have such weapons.\n \n Unfortunatly, it seems that this \"credible information\" came from Iraqi exiles and enemies of Saddam Hussein, many of whom had not actully been in Iraq for a decade or more, and who had quite a bit to gain by making fabricated accusations. \n \n The only question left is \"how do we deal with it from here?\" Americans need to quite making excuses and coming up with rediculous scenarios (I men, come on, hundreds of tons of WMD's spirited away a few pounds at a time in the trunks of cars? Gimme a break) and deal with the realities of the situation.\n \n There are no WMD's. How we deal with things from this point on will pretty much decide how america is percieved, and how our people are treated by the rest of the world (and quite possibly our survival as a nation). I know it is easier to believe a beautiful falsehood than to be confronted with an ugly truth, but it hardly seems like this is a practical time for Americans to refuse to accept the evidence that has been clearly laid before them.", 
   {}, 
   58064, 
   null, 
   1089872520.0
  ], 
  [
   58070, 
   null, 
   "SuperDutyHaulin", 
   "I don't think there is any question that he had a limited number of WMDs during the first gulf war. \n \n It is gulf II that bothers me. It is pretty obvious now (as it weas before to anybody who bothered looking at the issue) that he didn't have any leading up tot eh wat. YES, people thought they did. Unfortunatly, the majority of tis seems to beased on the fact that US intelligence kept telling everybody who would listen that they had credible information that he did have such weapons.\n \n Unfortunatly, it seems that this \"credible information\" came from Iraqi exiles and enemies of Saddam Hussein, many of whom had not actully been in Iraq for a decade or more, and who had quite a bit to gain by making fabricated accusations. \n \n The only question left is \"how do we deal with it from here?\" Americans need to quite making excuses and coming up with rediculous scenarios (I men, come on, hundreds of tons of WMD's spirited away a few pounds at a time in the trunks of cars? Gimme a break) and deal with the realities of the situation.\n \n There are no WMD's. How we deal with things from this point on will pretty much decide how america is percieved, and how our people are treated by the rest of the world (and quite possibly our survival as a nation). I know it is easier to believe a beautiful falsehood than to be confronted with an ugly truth, but it hardly seems like this is a practical time for Americans to refuse to accept the evidence that has been clearly laid before them.\n\n \n \n The weapons could still be there, Iraq is a mighty big place................", 
   {}, 
   58067, 
   null, 
   1089872940.0
  ], 
  [
   58078, 
   null, 
   "daewoo", 
   "The weapons could still be there, Iraq is a mighty big place................\n\n \n Uh, Iraq is smaller than the state of Califonia, and the majority of it is completely empty desert. We have something like 160,000 troops there, supported by high resolution satellites, thermal imaging equipment (land based, air based, and orbital), seismic assesment equipment (capable of finding large buried objects, underground buildings, etc...), and the majority of Iraqs former scientists (who were researching WMDS) in custody. You really believe that there are hundreds of tons of chemical and biological weapons there that we just haven't found yet? We are not even LOOKING any more. The team that was assigned to hunt down the weapons has been disbanded, becuse there ARE NONE. They looked everywhere, and there simply were no WMD's.\n \n \n There is no easter bunny, there is no santa clause, and there are no WMDs.", 
   {}, 
   58070, 
   null, 
   1089879420.0
  ], 
  [
   58115, 
   null, 
   "JPSartre12", 
   "......The U.S. doesn't mind a tyrant unless he's bad for business. Same old story.\n\n \n Close. The US reacts when US interests are involved. That has always been our policy. The problem is that it hasn't always been followed. Some presidents got us sucked into UN actions that didn't involve US interests, like Bosnia and Somalia, while others tried unilateral actions that were only tangentially important to the US, like Nicaragua.\n While we shouldn't support tyrants, sometimes that's all you have to work with. We can chose to either deal with them or walk away. In the case of China, we have taken the position that we will convert them from a communist country to a capitalist one from within. Good thing, too. There's over a billion Chinese people and I have no desire to see us fight them all. emoticon_xchicken", 
   {}, 
   57863, 
   null, 
   1089902640.0
  ], 
  [
   58127, 
   null, 
   "Waxy", 
   "There were weapons of mass destructions. Isrial had their citizens walking around with gas masks one, they have one of the best intellegence agencys in the world, I would even say better than ours. You dont think they would walk around with gass masks all day if they did not truly know there were WMD's. BTW, I am talking about the first gulf war.\n\n \n Did you actually read my post?\n \n Waxy\n \n On edit: Why didn't Saddam use any of this huge purported stash of WMDs? He was fighting for his life, or at least I'm sure he thought that at the time before the coalition went soft, what did he have to lose?", 
   {}, 
   58063, 
   null, 
   1089905580.0
  ], 
  [
   58129, 
   null, 
   "Waxy", 
   "Close. The US reacts when US interests are involved. That has always been our policy. The problem is that it hasn't always been followed. Some presidents got us sucked into UN actions that didn't involve US interests, like Bosnia and Somalia, while others tried unilateral actions that were only tangentially important to the US, like Nicaragua.\n While we shouldn't support tyrants, sometimes that's all you have to work with. We can chose to either deal with them or walk away. In the case of China, we have taken the position that we will convert them from a communist country to a capitalist one from within. Good thing, too. There's over a billion Chinese people and I have no desire to see us fight them all. emoticon_xchicken\n\n \n Wasn't that Sinjin's point JP?\n \n To pass Iraq 2 off as a \"humanitarian effort\" is a joke. \n \n US interests don't equal humanitarian effort. That's plain for all to see. \n \n Waxy", 
   {}, 
   58115, 
   null, 
   1089906000.0
  ], 
  [
   58287, 
   null, 
   "JPSartre12", 
   "Did you actually read my post?\n \n Waxy\n \n On edit: Why didn't Saddam use any of this huge purported stash of WMDs? He was fighting for his life, or at least I'm sure he thought that at the time before the coalition went soft, what did he have to lose?\n\n \n In Gulf War I, US troops never got near Baghdad, so Saddam wasn't in imminent danger. For him to use his WMDs then would certainly have given Carte Blanc to the Allies to march into Baghdad and get him. There was no sense of urgency or desperation with the troops hundreds of miles away and the TV full of UN negotiators pleading for an end to hostilities.\n We should have bagged him then instead of listening to the UN. Junior didn't make Daddy's mistake. He kept the troops moving until Saddam was history. \n emoticon_xgood", 
   {}, 
   58127, 
   null, 
   1089937080.0
  ], 
  [
   58288, 
   null, 
   "JPSartre12", 
   "Wasn't that Sinjin's point JP?\n \n To pass Iraq 2 off as a \"humanitarian effort\" is a joke. \n \n US interests don't equal humanitarian effort. That's plain for all to see. \n \n Waxy\n\n \n If it were only that black and white. Therre are many instances in which the two goals coincide. Kuwait is a good example of that. We liberated Kuwait and its oil. And now the thankless :xcensored treat us as if we're red-headed step-children.", 
   {}, 
   58129, 
   null, 
   1089937320.0
  ], 
  [
   58361, 
   null, 
   "daewoo", 
   "In Gulf War I, US troops never got near Baghdad, so Saddam wasn't in imminent danger. For him to use his WMDs then would certainly have given Carte Blanc to the Allies to march into Baghdad and get him. There was no sense of urgency or desperation with the troops hundreds of miles away and the TV full of UN negotiators pleading for an end to hostilities.\n We should have bagged him then instead of listening to the UN. Junior didn't make Daddy's mistake. He kept the troops moving until Saddam was history. \n emoticon_xgood\n\n \n \n In gulf I, Bush Sr was MUCH smarter than baby bush. He knew thatw e did not have the manpower or resources to actually take Iraq, occupy it, and build order there, adn that was when we had an actual coalition behind us. Now, we have tried the trick acting unilaterally, and it has given us a good chance to sit back and appreciate the intelligence and restraint that Bush Sr showed in backing off. \n \n \nIf it were only that black and white. Therre are many instances in which the two goals coincide. Kuwait is a good example of that. We liberated Kuwait and its oil. And now the thankless treat us as if we're red-headed step-children.\n\n \n This is becasue they know, as should any thinking person, that our liberation there had nothing to do with humanitarian reasoning, we were simply trying to protect our own interests in the gulf. What soured realtions with the governemtn if Kuwait was that we immeditly started trying to push American corporate dominance and secure sweetheart trade deals in exchange for the liberation.", 
   {}, 
   58287, 
   null, 
   1089962580.0
  ], 
  [
   58466, 
   null, 
   "sinjin", 
   "\n While we shouldn't support tyrants, sometimes that's all you have to work with. We can chose to either deal with them or walk away. \n\n \n You neglected to include the option we've exercised in Iraq.\n \"we shouldn't support tyrants\" has obviously never been our policy.\n I agree that we must sometimes work with undesirable leaders rather than have no relations but not support them. If we mean to have \"humanitarian\" objectives and are willing to use military force to further them, then what we have to gain economically should not be a factor in our decisions to topple governments.", 
   {}, 
   58115, 
   null, 
   1090007520.0
  ], 
  [
   58473, 
   null, 
   "jim's trucking", 
   "In Gulf War I, US troops never got near Baghdad, so Saddam wasn't in imminent danger. For him to use his WMDs then would certainly have given Carte Blanc to the Allies to march into Baghdad and get him. There was no sense of urgency or desperation with the troops hundreds of miles away and the TV full of UN negotiators pleading for an end to hostilities.\n We should have bagged him then instead of listening to the UN. Junior didn't make Daddy's mistake.  He kept the troops moving until Saddam was history. \n emoticon_xgood\n\n \n While I agree we should have finished the job, Bush 41 was tasked with liberating Kuwait, not deposing Saddam.\n \n Deposing Saddam became our policy after Bill Clinton signed a bill saying so.", 
   {}, 
   58287, 
   null, 
   1090009920.0
  ], 
  [
   58530, 
   null, 
   "jskufan", 
   "While I agree we should have finished the job, Bush 41 was tasked with liberating Kuwait, not deposing Saddam.\n \n Deposing Saddam became our policy after Bill Clinton signed a bill saying so.\n\n \n Explain what you mean by \"Bush 41 was tasked\". Who tasked him in 1991? Who tied his hands and kept him from finishing his job? I hope your not going to hide behind the same UN that we discarded in 2003 when we decided their opinion was meaningless, or the world opinion we sluffed off to basically \"go it alone\" in Gulf War II. Saddam and all his atrocities were already documented (with the exception of slaughtering the Kurds in 1991 after we abandoned them) before Gulf War I, why the 13 year delay? I don't know how you can blame Clinton with a straight face and not address Bush I for not doing then what is so right now.", 
   {}, 
   58473, 
   null, 
   1090025460.0
  ], 
  [
   58548, 
   null, 
   "JPSartre12", 
   "In gulf I, Bush Sr was MUCH smarter than baby bush. He knew thatw e did not have the manpower or resources to actually take Iraq, occupy it, and build order there, adn that was when we had an actual coalition behind us. Now, we have tried the trick acting unilaterally, and it has given us a good chance to sit back and appreciate the intelligence and restraint that Bush Sr showed in backing off. \n\n \n You're kidding right? We didn't have the manpower to take Iraq in Gulf 1?! Now, there's a revisionist statement if ever heard one. emoticon_rolleyes", 
   {}, 
   58361, 
   null, 
   1090029240.0
  ], 
  [
   58553, 
   null, 
   "jskufan", 
   "You're kidding right? We didn't have the manpower to take Iraq in Gulf 1?! Now, there's a revisionist statement if ever heard one. emoticon_rolleyes\n\n \n We not only had the manpower (and then some), we had a true coalition. Everyone had already invested the billions and billions of dollars in both military hardware and personel, we were already basically in the same position as we were after the \"shock and awe\" campaign in 2003. I think Bush 1 underestimated Saddam's ability to pick up his boot straps and return to power so quickly after we threw him out of Kuwait. It was a mistake that probably cost him his second term and will probably cost Bush Jr. his as well. Either way, the history books won't be very kind to either of them. Like it or not, both candidates made Iraq their \"centerpiece\" effort and it doesn't appear most Americans agree with their results.", 
   {}, 
   58548, 
   null, 
   1090031400.0
  ], 
  [
   58557, 
   null, 
   "JPSartre12", 
   "We not only had the manpower (and then some), we had a true coalition. Everyone had already invested the billions and billions of dollars in both military hardware and personel, we were already basically in the same position as we were after the \"shock and awe\" campaign in 2003. I think Bush 1 underestimated Saddam's ability to pick up his boot straps and return to power so quickly after we threw him out of Kuwait. It was a mistake that probably cost him his second term and will probably cost Bush Jr. his as well. Either way, the history books won't be very kind to either of them. Like it or not, both candidates made Iraq their \"centerpiece\" effort and it doesn't appear most Americans agree with their results.\n\n \n I don't agree with your assessment. GW1 lost re-election for on reason. He went back on his \"Read my lips; No new taxes\". Placating Democrats has been the downfall of many a Republican President.\n As for GW2, we'll win re-election. John Kerry is perceived as being soft on terrorism and heavy on taxation, a bad combination in America at the present time.", 
   {}, 
   58553, 
   null, 
   1090038960.0
  ], 
  [
   58558, 
   null, 
   "jskufan", 
   "I don't agree with your assessment. GW1 lost re-election for on reason. He went back on his \"Read my lips; No new taxes\". Placating Democrats has been the downfall of many a Republican President. \n\n \n Fair enough, but you can't deny the continued negative press emanating from Iraq didn't have some effect on public opinion. It's like a sore that wouldn't heal.\n \n \nAs for GW2, we'll win re-election. John Kerry is perceived as being soft on terrorism and heavy on taxation, a bad combination in America at the present time.\n\n \n JP, you may very well win the election. Be careful what you wish for. A definition of \"win\" might be in order. No matter what happens, they'll be no consensus of public opinion, half of America will still be unhappy, and our Middle East policies will still take center stage in all the media. If I was a devote Republican, I wouldn't let a single day pass that I didn't thank the Lord for the electoral college! emoticon_xgood", 
   {}, 
   58557, 
   null, 
   1090040580.0
  ], 
  [
   58618, 
   null, 
   "jim's trucking", 
   "Explain what you mean by \"Bush 41 was tasked\". Who tasked him in 1991? Who tied his hands and kept him from finishing his job? I hope your not going to hide behind the same UN that we discarded in 2003 when we decided their opinion was meaningless, or the world opinion we sluffed off to basically \"go it alone\" in Gulf War II. Saddam and all his atrocities were already documented (with the exception of slaughtering the Kurds in 1991 after we abandoned them) before Gulf War I, why the 13 year delay? I don't know how you can blame Clinton with a straight face and not address Bush I for not doing then what is so right now.\n\n \n I thought the UN was consulted and approved of the US liberation of Kuwait. I'm not hiding behind the UN or agreeing that the early end was the right thing to do. I was rather disappointed when we stopped short of Baghdad. I think Bush 41 backed down for fear of worldwide criticism.\n \n I'm not blaming Clinton in this case. I just stated that it wasn't US policy to depose Saddam until he made it so.", 
   {}, 
   58530, 
   null, 
   1090093080.0
  ], 
  [
   58626, 
   null, 
   "SuperDutyHaulin", 
   "Fair enough, but you can't deny the continued negative press emanating from Iraq didn't have some effect on public opinion. It's like a sore that wouldn't heal.\n \n \n \n JP, you may very well win the election. Be careful what you wish for. A definition of \"win\" might be in order. No matter what happens, they'll be no consensus of public opinion, half of America will still be unhappy, and our Middle East policies will still take center stage in all the media. If I was a devote Republican, I wouldn't let a single day pass that I didn't thank the Lord for the electoral college! emoticon_xgood\n\n \n Are you kidding me??? If Kerry \"wins\" were all in deep \n :xcensored . This man is a wussy. If we are attacked again, I can see Kerry now......(in his drull voice)\"Uhhhh.....we will uhhh...speak with France.....uhh make sure they like us....uhhh....\" Seriously, I am repulican, I dont really like Bush, but I sure as hell do not want Kerry as a president.\n \n Think about this....if Usama Bin Ladan was to vote who do you think he and his lackys would vote for??? Kerry! Because they could have their way with him. :xbanghead", 
   {}, 
   58558, 
   null, 
   1090095960.0
  ], 
  [
   58633, 
   null, 
   "daewoo", 
   "You're kidding right? We didn't have the manpower to take Iraq in Gulf 1?! Now, there's a revisionist statement if ever heard one. emoticon_rolleyes\n\n \n Not at all. We had the manpower to roll in there and destroy their military, but not nearly enought to deal witht he internal situation after we did so. Backing off of Baghdad and leaving saddam in control was a decision made by Bush Sr because he hadn't deluded himself (as the current administration did ) into thinking that we would be met with flowers and the civilian population would line up to lick our soldiers boots clean. He didn't want to end up in a situation where our troops would be bogged down for years to come in an unwinnable war against a poorly defined enemy.\n \n Unfortunatly, baby Bush didn't have the same reservations. He and his staff managed to convince themselves that we could roll in there, crush the military, capture saddam, appoint our own government, and the iraqi people would be fine with this. They failed miserably in estimating civilian opposition. Bush Sr did not.", 
   {}, 
   58548, 
   null, 
   1090100820.0
  ], 
  [
   58648, 
   null, 
   "JPSartre12", 
   "Explain what you mean by \"Bush 41 was tasked\". Who tasked him in 1991? Who tied his hands and kept him from finishing his job? I hope your not going to hide behind the same UN that we discarded in 2003 when we decided their opinion was meaningless, or the world opinion we sluffed off to basically \"go it alone\" in Gulf War II. Saddam and all his atrocities were already documented (with the exception of slaughtering the Kurds in 1991 after we abandoned them) before Gulf War I, why the 13 year delay? I don't know how you can blame Clinton with a straight face and not address Bush I for not doing then what is so right now.\n\n \n Your argument makes no sense. You can't take conditions that existed in two different decades, separated by lots of world events, and try to draw a straight line through our performance in both. In 1991, the UN was in favor of liberating Kuwait and the US, having the deepest pockets and most guns in the UN, carries the bulk of the war effort.\n Then, the UN convinced GW1 that is wasn't in the ME's best interest to leave a vacuum in Iraq, so GW1 ended the war prematurely. Fast forward to 2003 .... NOW the US, having been burned by the UN several times since 1991 (Clinton fiascos like putting US troops under UN control in Somalia) , we no longer gave a rat's rectum what the UN thought and took actions that we felt were necessary to stop terrorism. Two different actions taken by two different Presidents separated by 12 years.", 
   {}, 
   58530, 
   null, 
   1090113660.0
  ], 
  [
   58655, 
   null, 
   "JPSartre12", 
   "Not at all. We had the manpower to roll in there and destroy their military, but not nearly enought to deal witht he internal situation after we did so. Backing off of Baghdad and leaving saddam in control was a decision made by Bush Sr because he hadn't deluded himself (as the current administration did ) into thinking that we would be met with flowers and the civilian population would line up to lick our soldiers boots clean. He didn't want to end up in a situation where our troops would be bogged down for years to come in an unwinnable war against a poorly defined enemy.\n \n Unfortunatly, baby Bush didn't have the same reservations. He and his staff managed to convince themselves that we could roll in there, crush the military, capture saddam, appoint our own government, and the iraqi people would be fine with this. They failed miserably in estimating civilian opposition. Bush Sr did not.\n\n \n Well, let's see. We did just roll in there, crush the military, capture Saddam and appoint our own government. AND Allied soldiers were met by Iraqis carrying flowers. I'll show you some photos sometime.\n I suggest that you talk to soldiers who have returned home from Iraq instead of watching too much ABC, CBS and NBC Nightly News shows. \n The majority of Iraqis are grateful that the US liberated them and are looking forward to life after Saddam.\n If you consider that a miserable failure, consider how long we were in Germany and Japan after we beat both of those countries in WWII. All things considered, I'd say that we're way ahead of the timeline by comparison.\n \n emoticon_xgood", 
   {}, 
   58633, 
   null, 
   1090118460.0
  ], 
  [
   58659, 
   null, 
   "daewoo", 
   "Well, let's see. We did just roll in there, crush the military, capture Saddam and appoint our own government. AND Allied soldiers were met by Iraqis carrying flowers. I'll show you some photos sometime.\n\n \n I have a really neat vidoe of a bunch of Iraqis standing along the sides of the road cheering as a US convoy rolls in. Halfway down the road, those same cheering folks tunr around, grab RPG's and kalishnikovs, and open fire. \n \n \n \nI suggest that you talk to soldiers who have returned home from Iraq instead of watching too much ABC, CBS and NBC Nightly News shows. \n The majority of Iraqis are grateful that the US liberated them and are looking forward to life after Saddam.\n\n \n I have talked to MANY soldiers who have come home. Thee seems to be a couple of differnt divides there, young kids who believe what their chain of command tells them, and older guys who have been around the block a few times and form their own opinion. I also know 4 guys whe went over as \"private contractors\" to act as translators and to help \"organise nontraditional counterinsurgeny efforts\".\n \n Yes, they run out with flowers and cheers, then go home and polish their rifles and attach deflective plates to their RPGs (makes them more effective against reactive armour) this is the way of the Arabs. Smile at you, then shoot you the second you turn around. This is the smart way to kill your enemy. When the enemy quites believeing your smiles and gifts (or gets translators who realise that those folkw ho are cheering as you go by are yelling \"kill all Americans\", which your 18 yr old soldiers grin at like XXXXXX), you end up with a situation like fallujah. We didn;t do real well in Fallujah, we basicaaly withdrew like whipped dogs and handed the city over to a guy who was a former baath party member who immediatly brought all the insurgents into his organisation and still has collected any heavy weapons from them (though it appears that they are re-arming from shipments that have been seized headed fro the city).\n \n There are two things to remember when attempting to divine public sentiment in an occupied country. Teh first is that the occupying troops are generally a pretty poor source. Not only do they generally not speak the language, they start out biases by their own cause. combat soldiers all over the world lie to themselves well when it comes to such things. This is a well documented emotional survival response. If you cannot convince yourself that you are fighting on the side of right, then you are just a murderer, and nobody want to deal with that. The other thing to rememebr is that the indigenous population will lie to your guys regarding public sentiment. This is a survuval mechanism for them, they don't want to be hauled off to abu ghraib to be \"interrogated\" for weeks.\n \n The last public poll by Bremer (before they decided they needed to classify them) showed 80% of Iraqis wanted us gone. I know a few iraqis that I have kept in contact with, and for the most part, it seems that most Iraqis want us gone. There is no possible way that the insurgents could be pulling off attacks like they have, and at the scale they have, and with the frequency that they have, without widespread support from their population. It is just not possible that they could conceal themselves in the general population, or keep themselves supplied, wihtout that support. \n \n \n [/quote]If you consider that a miserable failure, consider how long we were in Germany and Japan after we beat both of those countries in WWII. All things considered, I'd say that we're way ahead of the timeline by comparison.[/QUOTE]\n \n There is absolutly no comparison between this situation and the one in Germany or Japan following WWII. For one thing, we flooded both those countries with troops. Allied troops made up at least 25% of the population of every major city in either place. Their population of miltary aged men had been largely killed off, and both countries industrial infrastructers had been completely destroyed. Neither one of those nations ever really fielded any type of civilian resistance to speak of. \n \n Fast forward to today, in Iraq, and there are still plenty of young to middle aged men running around, the countries economic infrastructure has neot been completely destroyed, we have less than 200,000 troops in the entire nations and less than 2% of the Iraqis actually accept our appointed government as legitimate (reuters/BBC). Factor in that the Iraqi civilians are apparently willing and capable of putting together an effective civilian resistance, and anybody who is not completely blind should be able to see the differences here.", 
   {}, 
   58655, 
   null, 
   1090120860.0
  ], 
  [
   58681, 
   null, 
   "georged", 
   "Your argument makes no sense. You can't take conditions that existed in two different decades, separated by lots of world events, and try to draw a straight line through our performance in both. In 1991, the UN was in favor of liberating Kuwait and the US, having the deepest pockets and most guns in the UN, carries the bulk of the war effort.\n Then, the UN convinced GW1 that is wasn't in the ME's best interest to leave a vacuum in Iraq, so GW1 ended the war prematurely. Fast forward to 2003 .... NOW the US, having been burned by the UN several times since 1991 (Clinton fiascos like putting US troops under UN control in Somalia) , we no longer gave a rat's rectum what the UN thought and took actions that we felt were necessary to stop terrorism. Two different actions taken by two different Presidents separated by 12 years.\n\n \n Deep US Pockets? The 1991 Gulf War Cost $61 billion. Of that total, Kuwait, Japan and Saudi Arabia paid $50 billion. When oil went from $15 to $42/barrel in 1991, US multinational oil firms experienced a onetime profit of $30 billion, of which $20 billion was subject to $10 billion in US corporate taxes. That war cost the US $1 billion while the US consumer again swallowed the salami with higher fuel prices.\n \n Daddy Bush's book defined his reasons for not overthrowing Saddam and occupying Iraq, and they had nothing to do with UN influence. He reasoned it would result in the US having to 'rule' Iraq in a bottomless sinkhole of civil strife with little or no support from other UN members and no feasible exit strategy. Children often neglect the wisdom of parents, and ex-alcoholic born again Christians heed only voices in their heads based on mythology. And VPs urging them to be crusaders defending democracy to protect special interests.", 
   {}, 
   58648, 
   null, 
   1090173240.0
  ], 
  [
   58779, 
   null, 
   "JPSartre12", 
   "Deep US Pockets? The 1991 Gulf War Cost $61 billion. Of that total, Kuwait, Japan and Saudi Arabia paid $50 billion. When oil went from $15 to $42/barrel in 1991, US multinational oil firms experienced a onetime profit of $30 billion, of which $20 billion was subject to $10 billion in US corporate taxes. That war cost the US $1 billion while the US consumer again swallowed the salami with higher fuel prices.\n\n \n I'm confused. Doesn't the US also include US consumers? emoticon_confused \n \n\n Daddy Bush's book defined his reasons for not overthrowing Saddam and occupying Iraq, and they had nothing to do with UN influence. He reasoned it would result in the US having to 'rule' Iraq in a bottomless sinkhole of civil strife with little or no support from other UN members and no feasible exit strategy. \n\n \n \n I just bought the book, but haven't read it.\n \n\n Children often neglect the wisdom of parents, and ex-alcoholic born again Christians heed only voices in their heads based on mythology. And VPs urging them to be crusaders defending democracy to protect special interests.\n\n \n That last part sounds more like LBJ than GW2. emoticon_xkill", 
   {}, 
   58681, 
   null, 
   1090246680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Saddam's brutal treatment of his own citizens. Pictures.", 
  "url": "http://www.4forums.com/political/politics-debates/2732-saddams-brutal-treatment-his-own-citizens-pictures.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2732, 
  "discussion_files": [
   [
    "9312.html", 
    "http://www.4forums.com/political/politics-debates/2732-saddams-brutal-treatment-his-own-citizens-pictures-print.html"
   ], 
   [
    "9313.html", 
    "http://www.4forums.com/political/politics-debates/2732-saddams-brutal-treatment-his-own-citizens-pictures-5-print.html"
   ], 
   [
    "9314.html", 
    "http://www.4forums.com/political/politics-debates/2732-saddams-brutal-treatment-his-own-citizens-pictures-4-print.html"
   ], 
   [
    "9315.html", 
    "http://www.4forums.com/political/politics-debates/2732-saddams-brutal-treatment-his-own-citizens-pictures-3-print.html"
   ], 
   [
    "9316.html", 
    "http://www.4forums.com/political/politics-debates/2732-saddams-brutal-treatment-his-own-citizens-pictures-2-print.html"
   ]
  ], 
  "identifier": 2732
 }
]