[
 [
  [
   58074, 
   null, 
   "Duo_Maxwell", 
   "Has anyone seen anyone lately use the \"moon dust\" theory to support the young earth claim, and subsequentially creationism?", 
   {
    "post_info": {
     "post_title": "The Moon Dust Theory"
    }
   }, 
   null, 
   null, 
   1089873420.0
  ], 
  [
   58076, 
   null, 
   "T.Q", 
   "Saw someone use it last week on the Talk.origins newsgroup. Still not sure if they were just a troll or not though...", 
   {}, 
   58074, 
   null, 
   1089877140.0
  ], 
  [
   58083, 
   null, 
   "ungerdunn", 
   "It pops up from time to time. Mostly it seems to be from YECs who think that Mr. Kent Hovind is a great scientist.", 
   {}, 
   58076, 
   null, 
   1089881520.0
  ], 
  [
   58088, 
   null, 
   "Duo_Maxwell", 
   "I'm suprised that the argument even exists in today's world, considering that one can easily just google it and find out that the entire argument is based upon a sham that requires the debaters to ignore all post 1960s scientific information. \n \n But then again.....", 
   {}, 
   58083, 
   null, 
   1089882000.0
  ], 
  [
   58089, 
   null, 
   "ungerdunn", 
   "But then again, creationism requires a denial of all arguments post 1600 scientific information.", 
   {}, 
   58088, 
   null, 
   1089882420.0
  ], 
  [
   58091, 
   null, 
   "Duo_Maxwell", 
   "no argument there. \n \n Is there any modern scientific information that supports creationism?", 
   {}, 
   58089, 
   null, 
   1089884640.0
  ], 
  [
   58163, 
   null, 
   "Ursus maritimus", 
   "But then again, creationism requires a denial of all arguments post 1600 scientific information.\n\n Hee hee hee hee.\n \n But seriously, has anyone noticed a tapering off of the \"no new information\" arguement? It is still used, but it doesn't seem as much as a few months ago. Do creationist arguements run in fads?", 
   {}, 
   58089, 
   null, 
   1089912600.0
  ], 
  [
   58239, 
   null, 
   "T.Q", 
   "Ah, you missed gup's big drum thumping of this topic on the old boards. He was a big advocate of the \"no new information\" argument, and no matter how many times it was refuted, he just kept bringing it up in new threads", 
   {}, 
   58163, 
   null, 
   1089930480.0
  ], 
  [
   58245, 
   null, 
   "The Barbarian", 
   "Yes, it's true, there are \"talking points\" that become fads for creationists pretty regularly. I've been around long enough to see some of it cycling back again.", 
   {}, 
   58239, 
   null, 
   1089931260.0
  ], 
  [
   58263, 
   null, 
   "Kronus", 
   "Hee hee hee hee.\n \n But seriously, has anyone noticed a tapering off of the \"no new information\" arguement? It is still used, but it doesn't seem as much as a few months ago. Do creationist arguements run in fads?\n\n \n I haven't seen this one. What's \"no new information\"?", 
   {}, 
   58163, 
   null, 
   1089934020.0
  ], 
  [
   58269, 
   null, 
   "Ursus maritimus", 
   "Hello, Kronus.\n \n Sorry. I was referring to the argument \"mutations cannot increase the information of the genome.\" It purports to use some kind of \"information theory\" to prove that \"information cannot increase\". Since the evolution of a human starting with a one-celled organism is \"obviously an increase in information\" evolution must be false.\n \n The usual refutation is to show that the person advocating it does not understand what information theory is.\n \n I often point out that, at best, information theory is a mathematical model of some process, and that mathematical models cannot trump actual evidence. If the model shows that evolution cannot happen but the evidence unequivocally demonstrates that it does happen, then there is a problem with the model.", 
   {}, 
   58263, 
   null, 
   1089934860.0
  ], 
  [
   58277, 
   null, 
   "Kronus", 
   "Hello, Kronus.\n \n Sorry. I was referring to the argument \"mutations cannot increase the information of the genome.\" It purports to use some kind of \"information theory\" to prove that \"information cannot increase\". Since the evolution of a human starting with a one-celled organism is \"obviously an increase in information\" evolution must be false.\n \n\n \n Oh, that one. Yeah, I've seen that before. The whole idea is so stupid I had no idea it had been dignified with a label.", 
   {}, 
   58269, 
   null, 
   1089935820.0
  ], 
  [
   58494, 
   null, 
   "Ursus maritimus", 
   "I knew that you had to know the argument, Kronus. Sorry that I wasn't clear. I don't know whether it has a name either -- hence the vagueness of my description.", 
   {}, 
   58277, 
   null, 
   1090013700.0
  ], 
  [
   58609, 
   null, 
   "The Barbarian", 
   "One of the more effective ways to deal with it is:\n \n \"As youi probably know, information theory describes information mathematically. Show me your numbers.\"\n \n Most creationists aren't very up on math, and the results can be amusing.", 
   {}, 
   58494, 
   null, 
   1090078800.0
  ], 
  [
   58680, 
   null, 
   "Ursus maritimus", 
   "Another good response, Barbarian. I try that one, too, when someone else hasn't already beat me to it.", 
   {}, 
   58609, 
   null, 
   1090172460.0
  ], 
  [
   66631, 
   null, 
   "Nu Leader", 
   "To Du_Maxwell:\n I'm suprised that the argument even exists in today's world, considering that one can easily just google it and find out that the entire argument is based upon a sham that requires the debaters to ignore all post 1960s scientific information. \n \n Thus you illustrate your lack of knowledge of the topic at hand. Check out the article called Moon-dust argument no longer useful by Answers in Genesis. It is a perfectly healthy part of science and was based on the evidence of the day. As new evidence came along that no longer supported the theory, it was dropped - totally in line with the essense of scientific procedure. It appears that you are trying to discredit the creationists and are using a straw man attack in order to do it. If you would look around a bit harder than google search into the creation ministries such as AiG, you would find out that your arument is false. No informed person uses this argument as it is no longer useful.\n \n Also, most NASA scientists, in fact, were convinced before the Apollo landings that there was not much dust likely to be found there - many of those were evolutionary scientists!", 
   {
    "post_info": {
     "post_title": "Moon Dust Theory is no longer in use..."
    }
   }, 
   58088, 
   null, 
   1094957700.0
  ], 
  [
   66649, 
   null, 
   "Duo_Maxwell", 
   "As new evidence came along that no longer supported the theory,\n\n \n Evidence and creationists are deathly allergic to each other. People still use the moon dust theory in arguments for a young earth argument. The idea is still in use, regardless of your site's stance aganist it. \n \n \nNo informed person uses this argument as it is no longer useful.\n\n \n Therefore it makes perfect sense as why creationists still use the argument. \n \n Dr. Hovind, a creationist other creationists mention, specifically for his attacks on evolution, uses the moon dust theory. \n \n Here are list of modern day arguments that use the moon dust theory.\n \n \nThis was formerly a widely-used young-Earth claim, but it has now been discredited. Nonetheless, it is still sometimes repeated in young-Earth circles. \n\n http://www.godandscience.org/youngearth/yeclaims.html#moondust\n \n \nThe Moon has a small dust layer of 3/4 in on its surface. Astronauts in their first visit to the moon were concerned with this, as they thought they might sink into deep dust. There is no water, no atmosphere, no rain in the Moon, so the dust it accumulates stays on the surface, unlike the dust on the Earth which is incorporated into the soil. This proves the Moon is less than 10,000 years old. \n\n http://www.gospeljohn.com/youngearth.htm\n \n \nNASA expected 54 feet of dust on the Moon, assuming a 5-billion-year age. Oops! They found only 13 feet at the Apollo 11 landing site, 2 to 3 feet at Luna 16, and 11.5 feet at Apollo 12.\n \n http://www.creationtheory.org/YoungEarth/index.php?page=index", 
   {
    "unicode_changes_made": true
   }, 
   66631, 
   null, 
   1094970900.0
  ], 
  [
   66652, 
   null, 
   "Nu Leader", 
   "To Duo_Maxwell:\n Evidence and creationists are deathly allergic to each other....Therefore it makes perfect sense as why creationists still use the argument. \n \n Have you actually studied the creationist's material (such as Answers in Genesis, or are you just repeating the rhetoric theat you have heard from others? I have not read all about evolution, but I have read enough to know what it is about and where in parts it is wrong. I do not go around calling them liars and so forth unless I can provide some evidence for my arguments.\n \n Evolutionists, of all people, should be the last to accuse creationists of lying and being ignorant! Half the so-called ape men are intentional frauds that are dedicated to get people to believe in evolution. \n \n Another prime example of where evolutionists have intentionally lied and concealed the truth is displayed on an internet site where the author accuses AiG's Dr Sarfati of intentionally lying about the fact that there are no 3rd stage SNRs in our universe. The author states the following:\n So Clark and Caswell really said the mystery is solved and many years latter the creationists quote them to say there is a mystery. How shameless can one get? That the astronomers don't think there is a mystery should tip-off readers that the claims that Sarfati made are complete bunk...The creationists made dubious assumptions, confused concepts, used outdated figures, quoted out-of-context, had false facts, etc. \n \n What this fellow fails to tell you is the rest of that quote:\n \"It appears with teh above explanation there is no need to postulate values of Eo/n differing greatly from those in the galaxy, and the mystery of the missing remnants is also solved.\" \n Well, the logical question is what explanation that they are referring to? The explanation is that IF:\n 1. There was an incorrect estimate so anomalies should be included.\n 2. Assume the detection limit is expanded by a factor of 3.\n 3. Claims that there was an erroneous number detected by a factor of two.\n \n So bascially Clark and Caswell made up assumptions to try to fit the evolutionary model. Basically they said that sine the data didn't match evolutionary premises, they would assume that it was an incorrect estimate, the detectino rate is wrong and anomalies should be included, then they conclude that this fits with evolution. This doesn't solve the problem (and is an embarrassing interpretation) but shows their allegiance to evolution over the observed facts, which was what Dr Sarfati commented on.\n \n Dr Starfati was telling the truth and the author of that article was the one concealing the truth. Talk Origins is known for doing this sort of thing and they sound convincing until you read the details and discover that they are concealing the truth and lying. Sadly, many have fallen into their lies.\n \n See, what you have to remember is the big picture. As Christians, they are bound by God's Word which says not to lie. As atheists, however, lying and telling the truth are neither \"right\" nor \"wrong\". This is evident throughout history. Typically, many evolutionists are not afraid to lie to make themselves appear better.\n \n Your argument about creationists being lying, ignorant and so on, is much like the pot calling the kettle black! I think you have gotten this around the wrong way. The evolutionists are the people who have a reputation for lying and so forth. I have given you a few examples of where evolutionists have purposely lied and concealed the truth, can you please give me some?\n \n \n People still use the moon dust theory in arguments for a young earth argument. The idea is still in use, regardless of your site's stance aganist it. \n The first thing you need to know, however, is that Answers in Genesis is a real creation science ministry. They have real scientists who believe in the validity of the Bible and, like the greatest scientist ever, Newton, believe that the Bible and science go hand in hand. \n \n The first link you provided said that it has been discredited. Many of these creationists to whom you are referring to, are not real creationists (i.e. a creation scientist) they are just ordinary people who may have not been informed of the error. Joshua's long day being found is another example of this, no creationist would ever use this in an argument as it has been discredited. No informed person would use this as it would be impossible to know the exact positions of the planets and stars at that instant in time and thus calculate the missing day. Creationists do not tell lies, they have exposed many evolutionary ones, such as those listed, but they also say that theories like the Moon Dust one have been discredited and thus, do not use it in an argument.\n \n The second link I found the point that you are referring to. Perhaps the article has not yet been updated and was written long before this new evidence against it was known. The rest of the information, however, is correct, is it not?\n \n The third link has evidence that was based on the day. It has not been updated.\n \n Dr. Hovind, a creationist other creationists mention, specifically for his attacks on evolution, uses the moon dust theory. \n \n Well, then, assuming that you are telling the truth, the Dr must not be too hard to refute. The major creation science ministries all do not use this argument.\n \n The Moon Theory, in summary, was an attempt by falliable man to try and explain the evidence of the day. The evidence changed, the theory was dropped --------- which is inline with correct scientific procedure.\n \n Perhaps I suggest that you have a quick look at what the main creation science ministries are saying before you continue with these straw man attacks. I can guarantee you that I could still find sites that talk about frauds like embryonic recapitulation, the so-called evidence for evolution at the Scopes trial as still being proof for evolution. Your argument lacks \"teeth\" so to speak. \n \n Unsupported assertions and person opinions as well as straw man attacks make up the bulk of your argument.", 
   {
    "post_info": {
     "post_title": "Are you just repeating the rhetoric you have heard?"
    }, 
    "unicode_changes_made": true
   }, 
   66649, 
   null, 
   1094973480.0
  ], 
  [
   66653, 
   null, 
   "Nu Leader", 
   "To The Barbarian:\n One of the more effective ways to deal with it is:\n \"As youi probably know, information theory describes information mathematically. Show me your numbers.\"\n Most creationists aren't very up on math, and the results can be amusing.\n \n I just hope that we are better than your spelling, \"youi\" [ed: making a joke out of your joke]. \n \n In all seriousness, creationists are not dumb. I am just finishing school this year, and am currently doing mathematics extension 1, physics, chemistry and legal studies. Your last line is an unsupported assertion.\n \n For example, try telling that to Sir Isaac Newton! He made up half the mathematics we are studying right now -- including Calculus! James Clerk Maxwell, Wernher von Braun, Charles Babbage and Michael Faraday, just to name a few are mathematical and scientific geniuses [if there is such a word]. A few more modern ones include Dr Russell Humphreys and Dr Werner Gitt.", 
   {
    "post_info": {
     "post_title": "Many creationists are experts at mathematics..."
    }
   }, 
   58609, 
   null, 
   1094974020.0
  ], 
  [
   66664, 
   null, 
   "montalban", 
   "You certainly are a busy lad, Nu Leader.", 
   {}, 
   66653, 
   null, 
   1094996700.0
  ], 
  [
   66670, 
   null, 
   "pnac=ww3", 
   "\n Have you actually studied the creationist's material (such as Answers in Genesis, or are you just repeating the rhetoric theat you have heard from others? I have not read all about evolution, but I have read enough to know what it is about and where in parts it is wrong. I do not go around calling them liars and so forth unless I can provide some evidence for my arguments.\n\n So this is the site that you claim has the real deal about creation \"science\"?\n http://www.answersingenesis.org/docs2004/0911balkans.asp\n \n\n If anyone doubts there is an international plot to assassinate creation, just take a look at recent events in the 'powder keg of Europe': Serbia.\n ...\n Clearly a battle has been joined, and the pro-evolution side is deeply committed. But what should Christians do?\n \n It appears that Serbia's education minister misjudged the level of intensive international scheming to undermine any effort to allow students to hear alternative views on origins. \n\n \n Yes, it is all a big conspiracy.\n \n http://www.answersingenesis.org/creation/v17/i4/bones.asp\n Speaking of making BAD arguments.\n Read through this and tell me what the actual argument is.\n Besides a bunch of misdirection and misinfromation, I can't find an actual point being made on this page.\n \n http://www.answersingenesis.org/creation/v18/i4/neanderthal.asp\n Yet more misinformation. Neandertals are not thought to be a \"bridge between apes and humans\" but a type of human, a side branch. It hasn't been decided whether there is some neadertal in all of us or some of us or none of us. There just isn't enough information yet to draw that conclusion.\n \n http://www.answersingenesis.org/docs2003/1003neandertal.asp\n It's funny how they say that Neandertals were just humans. No one doubts that. To say they were \"modern\" is not accurate, but it depends on how broad your definition of modern is. Then they just say (with nothing to back it up) that Neandertals were descended from Adam and Noah. Poof, just that easy.\n \n Look, if you're going to talk about creation science, site something that actually describes creation science through methodology, experiments, and results. All ANY creation science does is try to make evolution look bad through smoke and mirrors, hand waving, and misdirection.", 
   {
    "unicode_changes_made": true
   }, 
   66652, 
   null, 
   1095000780.0
  ], 
  [
   66723, 
   null, 
   "Duo_Maxwell", 
   "Have you actually studied the creationist's material (such as Answers in Genesis, or are you just repeating the rhetoric theat you have heard from others? \n\n \n Dude, I have seen far too mean creationist lies in the past. From the dino-man prints, to many of the false young earth arguments. I suppose this rhetoric is from others, but they are creationists, not scientists. \n \n \nEvolutionists, of all people, should be the last to accuse creationists of lying and being ignorant!\n\n \n Have you heard of a webiste called talkorigin.org? They highlight numerous creation lies. They litterally pages, and pages, and pages of the stuff. Creationists have STATED there is NO evidence for a old earth. Liars? No doubt about it. \n \n \nHalf the so-called ape men are intentional frauds that are dedicated to get people to believe in evolution. \n\n \n That is nothing in comparsion to the numerous hoaxes of creation. The dinosaur carcass they said was proof was in reality a dead whale. The prints of dino and man resemble litterlly abstract art, (not to mention 12 foot man). \n \n You do realize that the vast majority of stars do not go supernova, so the expected remnants of supernovas should be far less then what most creationists expect? A star must be astronomically large to go supernova, our star, which is considered a medium sized star, has no chance of naturally going supernova. Many people think that all stars eventually go supernova, highlighting their own sheer ignorance. \n \n \nThe evolutionists are the people who have a reputation for lying and so forth.\n\n \n Do you want me to give you a list of proven creationist lies? I don't think the server has enough space for those. \n \n \nreal creation science ministry\n\n \n That is a oxymoron. Creation deals with the supernatural. Science deals with the natural. You can't HAVE a organization that uses science to study creation. That's IMPOSSIBLE. Christian science has always been a contridiction. \n \n You're missing the point: People who believe in creation STILL use the moon dust argument \n \n http://www.talkorigins.org/faqs/gish-exposed.html\n http://www.talkorigins.org/faqs/ark-hoax.html\n http://www.talkorigins.org/faqs/quotes/mine/project.html\n http://www.talkorigins.org/faqs/hovind.html\n http://creationcrap.batcave.net/50%20lies.html\n http://www.intelligentdesign.net/primer.htm\n http://www.icrcult.org/hs/icr7cult.htm\n http://www.sciam.com/article.cfm?articleID=000D4FEC-7D5B-1D07-8E49809EC588EEDF&pageNumber=1&catID=2", 
   {}, 
   66670, 
   null, 
   1095035760.0
  ], 
  [
   66726, 
   null, 
   "Ursus maritimus", 
   "Evolutionists, of all people, should be the last to accuse creationists of lying and being ignorant! Half the so-called ape men are intentional frauds that are dedicated to get people to believe in evolution.As Christians, they are bound by God's Word which says not to lie.\n\n Your naivete is so charming.\n \n \n \nAs atheists, however, lying and telling the truth are neither \"right\" nor \"wrong\". \n\n Ooh. I love it when this one gets dredged up again!", 
   {}, 
   66652, 
   null, 
   1095037320.0
  ], 
  [
   66729, 
   null, 
   "Duo_Maxwell", 
   "Ursus maritimus, it always amazes me how creationists can call scientists liars. \n \n The whole faked dinosaur carcass along with blantant disregard of science makes it almost amusing. \n \n Creation makes the claim then goes looking for evidence, while ignoring all that doesn't support it. \n Evolution looks that the evidence then makes the theory. Evolution, unlike creation, did not start off with the entire theory first, it looked at the evidence and then incorporated it into a theory.", 
   {}, 
   66726, 
   null, 
   1095038040.0
  ], 
  [
   66731, 
   null, 
   "Ursus maritimus", 
   "Hello, Duo_Maxwell.\n \n Yes, I am always amazed at the reach of this \"conspiracy\" of evolutionists that have managed to keep any and all evidence against evolution out of science.\n \n All scientists are individuals working on their own grants.\n \n Grant money is awarded many different organizations, with their own sources of money and their own committees to choose the awardees.\n \n The scientists work at a multitude of universities, companies, and research laboratories, each one independent of one another and making its own hiring and firing decisions.\n \n Science gets published in many different journals, each one with its own board of editors, choosing its own reviewers, and each one independent of everyone else.\n \n So, you have science as a prime example of an anarchic, decentralized enterprise, with no central control, no single leadership, no one making rules for everyone else.\n \n And yet, somehow, there is a conspiracy that succeeds in keeping unwanted view points out.\n \n But I love conspiracy theories, don't you? ;)", 
   {}, 
   66729, 
   null, 
   1095038400.0
  ], 
  [
   66733, 
   null, 
   "Archilochus", 
   "Evolutionists, of all people, should be the last to accuse creationists of lying and being ignorant! Half the so-called ape men are intentional frauds that are dedicated to get people to believe in evolution.\n \n Why would I care if you \"believe\" in evolution?\n \n Please show us that you are not one of those creationists mentioned and support your assertion about frauds.\n \n First, what is an \"ape man\"? Which \"ape men\" are intentional frauds? Can you name any \"ape men\" that are not frauds? If they are not, then isn't that sufficient to show that the claims of creationists are wrong?", 
   {}, 
   66731, 
   null, 
   1095040980.0
  ], 
  [
   66738, 
   null, 
   "Archilochus", 
   "Excuse me again, Nu Leader. When Duo_Maxwell questioned as to whether the moon dust argument was still used by creationists you claimed that he was illustrating his ignorance of the topic. Quite the contrary. As was pointed out, Mr. Kent Hovind and others still use the argument. I'm sure that as enlightened as you are by the folks at AIG, you haven't heard the argument, but the rest of us have. Just for your informatiion, here is a transcript of Mr. Hovind's seminar in which he talks about moon dust.\n \nSpeaking of the moon, I've got in my office at home a porthole from a space capsule. One of the windows out of a space capsule. I got it. That thing is so scratched you can hardly see through it. Outer space is full of dust. And you see, when they hit the dust at 18,000 miles an hour, it scratches the glass. Well the scientists were worried about this dust in space. Back in the '50s they were trying to calculate how much dust does the moon have on it. Because, you know, like your windshield collects bugs when you drive through a herd of bugs, you know. They get thicker and thicker on there. The moon is going through this dust in space. And they thought there might be as much as one inch of dust collected every 10,000 years. So when they thought about landing on the moon, some of the astronomers said, \"Man, you can't land on the moon.\" Littleton said in 1955, \"There could be a layer of dust several miles deep.\" On the moon.\n \n Isaac Asimov said in 1959 before they went to the moon, Asimov said, \"I get a picture of the first spaceship, picking out a nice level place for landing purposes, coming in slowly downward tail-first and sinking majestically out of sight.\" He thought it would sink in the dust on the moon.\n \n Children's books written at that time say, \"Boys and girls, the moon has nothing but dust, dust, dust, dust.\" Thick layers of dust.\n \n So they built the lunar landing pad with giant snow-shoe effect landing module had pads on the feet to spread the weight out. The guys that made the back pace were instructed to make the back pack dust proof in case they sank in the dust. They even shortened the ladder 18 inches. Turned out to be a problem because the guy was worried about jumping off thinking he might rip the suit. But you watch, when they climb down they had to jump off the last 18 inches. They sawed the ladder off too short, expecting them to sink in the dust.\n \n When they got there and walked on it they found the moon dust was only about 1/2 inch thick. So the Christians at NASA asked the guys who believe in evolution, they said, \"Hey, where's all the dust.\"\n \n Now the atheists didn't say it but I know they were thinking it. They were thinking, \"You know, I'll bet the Baptist went up and cleaned that just to make us look stupid.\" You don't need our help to look stupid. You're doing fine.\n \n Moon dust is about 1/2 inch deep folks, or less. So the question is, if the earth is billions of years old, where's all the dust?\n \n Well this became a problem so they left some plates behind to actually collect dust on the moon. When they actually measured the accumulated dust on the moon, it turned out to be much less than they expected. Only 2.7 inches per million years. But still that works out to be 1000 ft. of dust in 4.6 billion. So the moon dust is still a very valid argument. There's not enough dust on the moon for it to be billions of years old.\n \n Some folks say it's not a good argument. I still think it's a legitimate argument.\n\n Unless you object to my use of Mr. Hovind's material, please take note of the following email that I received from Mr. Hovind.\n \nThank you so much for your e-mail and for taking the time to request\n permission to duplicate my materials...I do not copyright my materials, and I encourage people to duplicate them to get the message out. You are welcome to copy my tapes or transcripts or any of my other materials...\n \n In Christ,\n \n Kent Hovind\n\n Unfortunately, Mr. Hovind has withdrawn his seminars from his web site, except for the first two of seven total. He states that it is a problem of resources. Fortunately, I had the forsight to down load all of them, only about 6.6 megabytes, a paultry amount on an 80 gig disk.\n \n But I digress. The point is that creationists certainly do use the moon dust argument, along with the shrinking sun, the slowing rotation of the earth, and the receding moon. They also use the human tracks in the Paluxy river andthe changing speed of light. In fact, I have bumped into creationists who argued for a flat earth. Even a Ph.D. physicist who argues that the earth is at the center of the universe and everything else is orbiting a fixed an immovable earth (just like the Bible says).\n \n If you really want a good laugh, you should listen to Mr. Hovind's seminars. Oh, wait. Except for the first two, you have to order the tapes from him. Well, I have them - all 7. It shouldn't be a big deal to send them to you if you have a fast connection. They are Real Video files and are around 1mb each.\n \n And if you haven't busted a gut laughing about that one, you should visit Mr. Carl Baugh's \"Creation Evidence Museum\" in Glen Rose, Texas and listen to his version of creation. How ironic that the #11 and #12 nuclear power reactors in the country are just north of there. So much scientific knowledge so close to absolute scientific idiocy.\n \n Really, Nu Leader. I've been reading creationist literature and visiting creationist web sites and debating creationists for more than 15 years. Creationists still use all of the above arguments.", 
   {
    "unicode_changes_made": true
   }, 
   66733, 
   null, 
   1095056280.0
  ], 
  [
   66742, 
   null, 
   "Duo_Maxwell", 
   "*bows to Archilochus*\n \n *throws roses and 100 dollar bills at Archilochus's feet*", 
   {}, 
   66738, 
   null, 
   1095061020.0
  ], 
  [
   66816, 
   null, 
   "Waxy", 
   "In Christ,\n \n Kent Hovind \n \n \n Did this tag line catch anyone else's eye?\n \n Waxy", 
   {}, 
   66742, 
   null, 
   1095109020.0
  ], 
  [
   67501, 
   null, 
   "montalban", 
   "Hello, Duo_Maxwell.\n \n Yes, I am always amazed at the reach of this \"conspiracy\" of evolutionists that have managed to keep any and all evidence against evolution out of science.\n \n All scientists are individuals working on their own grants.\n \n Grant money is awarded many different organizations, with their own sources of money and their own committees to choose the awardees.\n \n The scientists work at a multitude of universities, companies, and research laboratories, each one independent of one another and making its own hiring and firing decisions.\n \n Science gets published in many different journals, each one with its own board of editors, choosing its own reviewers, and each one independent of everyone else.\n \n So, you have science as a prime example of an anarchic, decentralized enterprise, with no central control, no single leadership, no one making rules for everyone else.\n \n And yet, somehow, there is a conspiracy that succeeds in keeping unwanted view points out.\n \n But I love conspiracy theories, don't you?\n\n Without going into the use of the term 'conspiracy'... I'd like to add that all biologists receiving their grants would be subject to review.\n \n They'd have learnt the 'truth' of evolution at school, then at university. They'd have peers reviewing their stuff to make sure that it's also in keeping with materialist evolution.\n \n I guess that means there's no pressure on them at all :)\n But most likely they are willing followers", 
   {}, 
   66731, 
   null, 
   1095514740.0
  ], 
  [
   67519, 
   null, 
   "Mach", 
   "Without going into the use of the term 'conspiracy'... I'd like to add that all biologists receiving their grants would be subject to review.\n \n They'd have learnt the 'truth' of evolution at school, then at university. They'd have peers reviewing their stuff to make sure that it's also in keeping with materialist evolution.\n \n I guess that means there's no pressure on them at all :)\n But most likely they are willing followers\n\n \n So...the entire secular university system is brainwashing people. And the religious fundamentalists are preaching the truth. Wow, that's quite a debate topic to just drop in here!!\n \n FYI, we've told you time and again that science does not proclaim to be truth, it's a process, and it's always open to interperetation, revision, and can be entirely overthrown. Religion on the other hand is dogma and in many cases proposes that it's the \"truth\". Big difference.\n \n If you can show reasons why one should believe in something else other than evolution as the process by which life on earth diversified...you can. But the operative word there is \"reason\".\n \n Science is about curiosity, discovery, and understanding. I realize you have contempt for these things (as indicated by your use of the word consipracy, which implies harmful or lawbreaking), but realize much of the rest of the world appreciates what contributions science has made to our world, as evidinced by the popularity of the subject in schools and universities. \n \n It's sad to me that in your pursuit for compasion, nobility, etc., you spurn the hard work and triumphs of your fellow humans, in favor of some other human telling you that you must believe everything they say in order to go to heaven, things which neither impact your life here, nor have any basis in reason.\n \n -Mach", 
   {}, 
   67501, 
   null, 
   1095529440.0
  ], 
  [
   67544, 
   null, 
   "montalban", 
   "\"Persuasive communication involves [1] gain the person?s interest. [2] create a need. [3] show how that need can be satisfied. [4] Help the receiver to visualise the satisfaction of that need. [5] Encourage the action that will lead to the need satisfaction.\" see M. McWalters (Ed.), (1993), Understanding Psychology, McGraw-Hill; Sydney, p296ff.\n The need for people such as Dawkins is expressed in his notion that Darwinism allows one to be a well-rounded atheist.\n \n \nSo...the entire secular university system is brainwashing people. And the religious fundamentalists are preaching the truth. Wow, that's quite a debate topic to just drop in here!!\n \n FYI, we've told you time and again that science does not proclaim to be truth, it's a process, and it's always open to interpretation, revision, and can be entirely overthrown. Religion on the other hand is dogma and in many cases proposes that it's the \"truth\". Big difference.\n \n If you can show reasons why one should believe in something else other than evolution as the process by which life on earth diversified...you can. But the operative word there is \"reason\".\n \n Science is about curiosity, discovery, and understanding. I realize you have contempt for these things (as indicated by your use of the word conspiracy, which implies harmful or lawbreaking), but realize much of the rest of the world appreciates what contributions science has made to our world, as evidenced by the popularity of the subject in schools and universities. \n \n It's sad to me that in your pursuit for compassion, nobility, etc., you spurn the hard work and triumphs of your fellow humans, in favour of some other human telling you that you must believe everything they say in order to go to heaven, things which neither impact your life here, nor have any basis in reason.\n \n -Mach\n\n The 'brain-washing' aspect is far too extreme a statement to apply to what I said. All educational processes are socialising processes.\n \n You believe materialistic evolution to be 'evolution' and that as such it did happen. And as such it should be taught. There is no 'search for truth' but a teaching of the 'truth' when I comes to evolution.\n \n Yet as a social process it can't help but instil values in the educational process. Darwin himself was a prime example of this...reflecting the values of Victorian ideas....\n \"Darwin postulated that females are ''coy,'' mating rarely and choosing their mates carefully, presumably betting their odds on the males with the best genes to contribute to their offspring. For their part, males are ''ardent'' and promiscuous, and fight amongst themselves for female partners. Later theories added that males are promiscuous because they have less to lose by making babies - unlike eggs, sperm are plentiful and small. Plus, females usually do most of the work to raise the offspring?\n http://www.eurekalert.org/pub_relea...u-sag021003.php\n \n ?In the mid-nineteenth century, social Darwinists invoked evolutionary biology to argue that a woman was a man whose evolution - both physical and mental - had been arrested in a primitive stage. In this same period, doctors used their authority as scientists to discourage women's attempts to gain access to higher education. Women's intellectual development, it was argued, would proceed only at great cost to reproductive development. As the brain developed, so the logic went, the ovaries shrivel. In the twentieth century, scientists have given modern dress to these prejudices. Arguments for women's different (and inferior) nature have been based on hormonal research, brain lateralization, and sociobiology.?\n \n Londa Schiebinger, \"History and Philosophy\", in Sex and Scientific Inquiry, eds. Sandra Harding and Jean F. O'Barr, (Chicago: University of Chicago Press, 1987), p. 26-27.\n Quoted at: http://www.dean.sbc.edu/bart.html\n \n Feminists claim that evolution, long the domain of men has present biased accounts of science in order to explain gender.\n \n ?Men's claims to \"know\" women's natures, abilities, limitations, and so forth have been a fundamental element of feminist criticisms since its genesis, primarily because it is precisely these claims which are used to justify the social and political subordination of women.?\n Ibid.\n \n I have stated many times epistemological evidences for the bias inherent in all aspects of education... science being no exception. Scientists carry the same biases as other people. Education itself is a socialising factor in your life. How you are educated helps you in normalising and rationalising things. Marxists would argue that everything you were taught, including science was for conformity within a western male-dominated capitalistic society. It goes to the stabilization of that society, which is why society is, as a rule, generally cohesive.\n \n That is why we have different spins on 'science' (if there really is just 'science'). If you live in a Communist state you would be taught about the evolution of man through his struggles to form collective solutions to problems. Capitalists tend to talk about evolution in terms of 'competition.'\n Thus...\n \"Einstein (1950) said that everyday knowledge provides a huge store of useful metaphors and ideas. From these, the scientist makes a free selection of a set of axioms, and thereupon begins constructing a theory. Einstein thought the origin of his theory might relate to a childlike exploration of space, and consulted with Piaget on the possible similarities between his personal intellectual development and that of children (Miller, 1986). In analyzing the work of other scientists, philosophers (Black, 1962; Kuhn 1970; Toulmin, 1972) and historians (Miller 1986, Nercessian 1988) emphasize that science is a constructive activity. Its materials are drawn in part from the familiar images and metaphors of prior knowledge (Lightman, 1989, Miller, 1986).\"\n \n Learning in Interactive Environments: Prior Knowledge and New Experience at\n http://www.astc.org/resource/educator/priorknw.htm\n \n \"Just as sociobiology was emerging, a quite different view of science was becoming influential. According to this view, scientists make their decisions in large measure influenced by broader social contexts, such as those of economics and class structure\"\n http://www.stephenjaygould.org/reviews/hull_sociobiology.html\n \n \"We live under capitalism, so we have capitalist science. We want to bring a different set of values into being, to bring about a new set of ruling ideas?ideas of a society without rulers, a part of a different ideology or world-view. We want to bring about a socialist society. It will, if we are vigilant, have a socialist science. I can imagine it, or some of it.\" SCIENCE IS SOCIAL RELATIONS at http://www.human-nature.com/rmyoung/papers/sisr1.html\n \n \"The major political task is seen as showing the reality of capitalist domination in the apparently neutral science\"\n http://www.human-nature.com/rmyoung/papers/pap100h.html\n \n A claim that your version of science is fabricated as 'normative' as part of the social-engineering of capitalism.\n \n Further, my understanding is that to be deemed 'scientific', evolution must be falsifiable. It can't be because every new 'discovery' is immediately assumed to be part of evolution. If a bug is near invisible to predators; that evolution making it had to find. If the opposite is true; that's evolution making it easy to find - to warn predators. All parts of the spectrum are covered because evolution is dogmatically held to be 'true'... even when it can't make predictions, nor the actual process of evolution be shown.\n That is why evolutionary scientists can put on the table mutually exclusive theories, and yet still sell evolution as 'the answer'. It's like saying we don't know if 'A', 'B', or 'C' is correct, but whichever, evolution did it!\n When I was doing pre-history at university our text showed four separate pathways for the ascent of modern man.\n the Unilinear School;\n the Polyphyletic School'\n the Preneanderthal School; and\n the Presapiens School\n (Poirier, F E, \"In Search of Ourselves: An Introduction to Physical Anthropology\", p346ff)\n Each was based on the 'evidence'. BUT each was mutually exclusive of the others. But all were taught. Evolution had the answer, even if scientists didn't know which was the answer. Now, I believe there are other theories put forward, and these too are mutually exclusive.\n \n Just a note for future reference: This does not mean that I am anti-science. But does that mean I accept scientists as being beyond human scruple? No.", 
   {
    "post_info": {
     "post_title": "The new saints"
    }
   }, 
   67519, 
   null, 
   1095548640.0
  ], 
  [
   67674, 
   null, 
   "Mach", 
   "\"Persuasive communication involves [1] gain the person?s interest. [2] create a need. [3] show how that need can be satisfied. [4] Help the receiver to visualise the satisfaction of that need. [5] Encourage the action that will lead to the need satisfaction.\" see M. McWalters (Ed.), (1993), Understanding Psychology, McGraw-Hill; Sydney, p296ff.\n The need for people such as Dawkins is expressed in his notion that Darwinism allows one to be a well-rounded atheist.\n \n \n The 'brain-washing' aspect is far too extreme a statement to apply to what I said. All educational processes are socialising processes.\n \n You believe materialistic evolution to be 'evolution' and that as such it did happen. And as such it should be taught. There is no 'search for truth' but a teaching of the 'truth' when I comes to evolution.\n \n Yet as a social process it can't help but instil values in the educational process. Darwin himself was a prime example of this...reflecting the values of Victorian ideas....\n \"Darwin postulated that females are ''coy,'' mating rarely and choosing their mates carefully, presumably betting their odds on the males with the best genes to contribute to their offspring. For their part, males are ''ardent'' and promiscuous, and fight amongst themselves for female partners. Later theories added that males are promiscuous because they have less to lose by making babies - unlike eggs, sperm are plentiful and small. Plus, females usually do most of the work to raise the offspring?\n http://www.eurekalert.org/pub_relea...u-sag021003.php\n \n ?In the mid-nineteenth century, social Darwinists invoked evolutionary biology to argue that a woman was a man whose evolution - both physical and mental - had been arrested in a primitive stage. In this same period, doctors used their authority as scientists to discourage women's attempts to gain access to higher education. Women's intellectual development, it was argued, would proceed only at great cost to reproductive development. As the brain developed, so the logic went, the ovaries shrivel. In the twentieth century, scientists have given modern dress to these prejudices. Arguments for women's different (and inferior) nature have been based on hormonal research, brain lateralization, and sociobiology.?\n \n Londa Schiebinger, \"History and Philosophy\", in Sex and Scientific Inquiry, eds. Sandra Harding and Jean F. O'Barr, (Chicago: University of Chicago Press, 1987), p. 26-27.\n Quoted at: http://www.dean.sbc.edu/bart.html\n \n Feminists claim that evolution, long the domain of men has present biased accounts of science in order to explain gender.\n \n ?Men's claims to \"know\" women's natures, abilities, limitations, and so forth have been a fundamental element of feminist criticisms since its genesis, primarily because it is precisely these claims which are used to justify the social and political subordination of women.?\n Ibid.\n \n I have stated many times epistemological evidences for the bias inherent in all aspects of education... science being no exception. Scientists carry the same biases as other people. Education itself is a socialising factor in your life. How you are educated helps you in normalising and rationalising things. Marxists would argue that everything you were taught, including science was for conformity within a western male-dominated capitalistic society. It goes to the stabilization of that society, which is why society is, as a rule, generally cohesive.\n \n That is why we have different spins on 'science' (if there really is just 'science'). If you live in a Communist state you would be taught about the evolution of man through his struggles to form collective solutions to problems. Capitalists tend to talk about evolution in terms of 'competition.'\n Thus...\n \"Einstein (1950) said that everyday knowledge provides a huge store of useful metaphors and ideas. From these, the scientist makes a free selection of a set of axioms, and thereupon begins constructing a theory. Einstein thought the origin of his theory might relate to a childlike exploration of space, and consulted with Piaget on the possible similarities between his personal intellectual development and that of children (Miller, 1986). In analyzing the work of other scientists, philosophers (Black, 1962; Kuhn 1970; Toulmin, 1972) and historians (Miller 1986, Nercessian 1988) emphasize that science is a constructive activity. Its materials are drawn in part from the familiar images and metaphors of prior knowledge (Lightman, 1989, Miller, 1986).\"\n \n Learning in Interactive Environments: Prior Knowledge and New Experience at\n http://www.astc.org/resource/educator/priorknw.htm\n \n \"Just as sociobiology was emerging, a quite different view of science was becoming influential. According to this view, scientists make their decisions in large measure influenced by broader social contexts, such as those of economics and class structure\"\n http://www.stephenjaygould.org/reviews/hull_sociobiology.html\n \n \"We live under capitalism, so we have capitalist science. We want to bring a different set of values into being, to bring about a new set of ruling ideas?ideas of a society without rulers, a part of a different ideology or world-view. We want to bring about a socialist society. It will, if we are vigilant, have a socialist science. I can imagine it, or some of it.\" SCIENCE IS SOCIAL RELATIONS at http://www.human-nature.com/rmyoung/papers/sisr1.html\n \n \"The major political task is seen as showing the reality of capitalist domination in the apparently neutral science\"\n http://www.human-nature.com/rmyoung/papers/pap100h.html\n \n A claim that your version of science is fabricated as 'normative' as part of the social-engineering of capitalism.\n \n Further, my understanding is that to be deemed 'scientific', evolution must be falsifiable. It can't be because every new 'discovery' is immediately assumed to be part of evolution. If a bug is near invisible to predators; that evolution making it had to find. If the opposite is true; that's evolution making it easy to find - to warn predators. All parts of the spectrum are covered because evolution is dogmatically held to be 'true'... even when it can't make predictions, nor the actual process of evolution be shown.\n That is why evolutionary scientists can put on the table mutually exclusive theories, and yet still sell evolution as 'the answer'. It's like saying we don't know if 'A', 'B', or 'C' is correct, but whichever, evolution did it!\n When I was doing pre-history at university our text showed four separate pathways for the ascent of modern man.\n the Unilinear School;\n the Polyphyletic School'\n the Preneanderthal School; and\n the Presapiens School\n (Poirier, F E, \"In Search of Ourselves: An Introduction to Physical Anthropology\", p346ff)\n Each was based on the 'evidence'. BUT each was mutually exclusive of the others. But all were taught. Evolution had the answer, even if scientists didn't know which was the answer. Now, I believe there are other theories put forward, and these too are mutually exclusive.\n \n Just a note for future reference: This does not mean that I am anti-science. But does that mean I accept scientists as being beyond human scruple? No.\n\n \n I would like express my lack of desire to read a lot of raw quotes from other sources not related to the topics. I do not feel any \"urge\" to go through raw quotes. Please read them, and condense them into specific points or arguments if you expect me to reply to them. You can assume I have read a lot of published books from scientists, philosophers, and many other subjects, and can also read anything you might present. If you then want to debate a specific point, please do so.\n \n I can summarize by saying:\n \n 1. Someone suggested that science is beyond human scruples?? \n Who did this?\n \n Actually, last I understood, science is open to all and is actually formed around EXACTLY the understanding that humans are fallable and not always rational. Hence the decentralized process, the published findings, and the complete and total openess to change once sufficient evidence is presented (and usually a generation time-wise to get over the shock). You're either arguing vs a strawman, or you misunderstand something about science. Or thirdly, someone here was actually suggesting that \"science is beyond human scruples\".\n \n 2. If you oppose the scientific process not dealing with things outside the physical universe, then you would seem to be anti-science. I would say irrational as well. That is not an insult, it demands to be used in this context.\n \n -Mach", 
   {}, 
   67544, 
   null, 
   1095649560.0
  ], 
  [
   67700, 
   null, 
   "montalban", 
   "A leading evolutionist, R. Dawkins says \"Religion is also, of course, the underlying source of the divisiveness in the Middle East which motivated the use of this deadly weapon in the first place (referring to the September 11 attacks). But that is another story and not my concern here. My concern here is with the weapon itself. To fill a world with religion, or religions of the Abrahamic kind, is like littering the streets with loaded guns. Do not be surprised if they are used.\" \n http://www.royal-ts.de/mtarchives/000328.php\n \n \nI would like express my lack of desire to read a lot of raw quotes from other sources not related to the topics. I do not feel any \"urge\" to go through raw quotes. Please read them, and condense them into specific points or arguments if you expect me to reply to them. You can assume I have read a lot of published books from scientists, philosophers, and many other subjects, and can also read anything you might present. If you then want to debate a specific point, please do so.\n\n This is the most unique debating post I've yet seen. I gave a statement about scientists being creatures of their times; in presenting evidence. And gave an actual example - in the form of Charles Darwin and his scientific beliefs about female behaviour (influenced no doubt on Victorian ideals of femininity)\n Then I gave a statement regarding current western science (being influenced in this case by capitalism) and then gave references to support that. You lack of 'urge' to read - and hence to present an argument is, as I said, unique. I've never yet come across this type of retort before. Kudos.\n \nI can summarize by saying:\n 1. Someone suggested that science is beyond human scruples?? \n Who did this?\n\n You do this. You believe that the science speculation (based on no evidence) about aliens is great, but that the science speculation (based on no evidence) for other things such as the Bunyip, Bigfoot, yeti, trolls etc is not great.\n To use the classic reply...\n \nYou mean it is only ad hoc speculation. A theory is supported by evidence, has explanative value, predicts other observations that can be tested. Things like the theory of gravitation, the helocentric (sic) theory, the germ theory of disease, the theory of plate tectonics, nuclear theory by which we operate nuclear power plants, and so on.\n\n (Post 67 of the \"So, how did they get all those animals on the ark\" thread.)\n But then for something you call 'science fiction' you're quite happy scientists spend squillions of dollars. That you accept so readily this activity is further evidence for my statement... that you'd actually defend them doing such that you yourself deem 'science fiction'.\n Further, you questioned (as you repeat here again), my very questioning of science. As if questioning of science (as you put forward) is itself indicative of an unstable mind. These are the exact same arguments religious people put when they justify inquisitions.\n Obviously (given the quote at top) Dawkins has combated the 'illogical' gene. I understand and appreciate your desire to help free me from such irrational thought. Don't give up just yet. :)\n \nActually, last I understood, science is open to all and is actually formed around EXACTLY the understanding that humans are fallable (sic) and not always rational. Hence the decentralized process, the published findings, and the complete and total openness to change once sufficient evidence is presented (and usually a generation time-wise to get over the shock). You're either arguing vs. a strawman, or you misunderstand something about science. Or thirdly, someone here was actually suggesting that \"science is beyond human scruples\".\n\n As stated, I showed epistemological evidences here, and on other posts with regard to\n a) socialising process of (science) education\n b) influences upon scientists from without\n c) a priori beliefs (or, influences from within)\n If you did really believe in the 'checks and balances', then why do you have a problem with me stating scientists are influenced by factors like any other human engaged in other human activities. You either do believe that they are influenced, or they're not. Please pick a position.\n But, science is not open to all. Studies too have shown gender and cultural bias here as well.\n See the comparison between science and religion...\n \"Natural science in the way it is practised is one of the great pillars of patriarchal domination. It is only in the fields of military and church that androcentristic behaviour, thinking and acting, i.e. thinking and acting fixed on men and on masculine ideals is as crucial as in natural science and technology.\"\n Gender in Bias in Science and Science Education\n http://www.physik.uni-bremen.de/physics.education/schwedes/text/bellater.htm\n \"Standard Tests\" show cultural bias. But why (re-)post them if you feel no 'urge' to read them? Fortunately, I suppose, I post for other people as well - the silent mob who read our debates; and hence do post them again here.\n \n2. If you oppose the scientific process not dealing with things outside the physical universe, then you would seem to be anti-science.\n\n I am pro-science. I would like to see scientists freed from your restrictions. :)\n \nI would say irrational as well. That is not an insult, it demands to be used in this context.\n -Mach\n\n Here we're back to the 'you must be anti-science'. I am not.\n I am not in favour of your defining science by your philosophy of science. You and others here are yet to show your definition of science is science as opposed to philosophy of science. In order to demonstrate your view is science, by your own definition of science, you'd have to define it, using scientific method. So far several posters have responded to such a challenge with rhetorical ploys, gnashing of teeth regarding the impossibility of such a challenge, and philosophy - which is odd that there's a need to defend a definition of science by another discipline. (By the way, I have stated that historically there have been many views on the nature of science - including your materialistic one. Over the centuries others have had different views on what is science. This is in fact empirical - that there have been many views - thus my statement that your idea of science is a philosophy of science, is itself based on empirical evidence - given that\n a) it's historically one of many\n and\n b) your lack of proof for your claim :)\n Further, I like digital watches, TV, etc. Science provides lots of nice, nifty things. However, because of this, I am not 'bought' and recognise that there are factors affecting scientists. You don't. You believe some massive system of checks and balances exists. Either you are correct - and you've shown only your opinion on this, or I am correct, and I've shown citations that agree with me, or rather, that I agree with. And I must point out that in debating your 'side' on this matter for some time, I get this all the time. I post acres of evidences. The retort is \"'no, it just can't be!\" \n Thus again ironically, I present facts from studies, and it's retorted by opinion, or in your case above 'no opinion', which is still making me smile.\n Oddly enough, you can't claim to be unaware of this avalanche of evidence, because you've seen the \"Where does science say we come from?\" thread, which I posted such gems as...\n \"The scientific establishment bears a grisly resemblance to the Spanish Inquisition. Either you accept the rules and attitudes and beliefs promulgated by the 'papacy' (for which read, perhaps, the Royal Society or the Royal College of Physicians), or face a dreadful retribution. We will not actually burn you at the stake, because that sanction, unhappily, is now no longer available under our milksop laws. But we will make damned sure that you are a dead duck in our trade.\" \n (Gould, Donald [former editor of New Scientist], \"Letting poetry loose in the laboratory,\" New Scientist, 29 August 1992, p.51)\n http://www-acs.ucsd.edu/~idea/philoevolquotes.htm\n That's at the beginning, when we acquire science knowledge.... at the other end, biases occur, even in the choosing of which projects are chosen for funding. Often that bias is not even based on 'worth'.\n See \"Evaluation and Adjudication of Research Proposals: Vagaries and Politics of Funding\"\n http://www.qualitative-research.net.../3-02roth-e.htm\n \"Social constructivism characterises the nature of knowledge to include the following: (1) knowledge is not a passive commodity to be transferred from a teacher to learners, (2) pupils cannot and should not be made to absorb knowledge in a spongy fashion, (3) knowledge cannot exist separate from the knower, (4) learning is a social process mediated by the learner's environment, and (5) the prior or indigenous knowledge of the learner is of significance in accomplishing the construction of meaning in a new situation. All learning is mediated by culture and takes place in a social context.\"\n \"Transcending Cultural Borders: Implications for Science Teaching\" at\n http://www.usask.ca/education/people/aikenhead/RSTE.htm\n I know that this sort of stuff can so easily be retorted by 'no it's not', but you're 'retort' \"I haven't the urge to read it\" is very interesting.\n The epistemological case: it is why evolutionary theorists can present mutually exclusive theories and yet still keep a straight face when they tell creationists that evolution is true, because it has all these evidences - evidences that point to what? Evolution. It's such a hollow claim. When you ask 'how?' you're given a half-dozen different, equally plausible ways, but this is supposed to support the idea that evolution is the answer? It is based on people who believe evolution 'just is'. I mean, it has to be, everyone's taught it! Another example is abiogenesis. It's taught that it happened, even though no one's agreed 'how?' In short, it seems that you don't care what theory is put forward, providing it falls into the category of your definition of science. It doesn't even matter if there's a dozen theories there - what this 'proves' I don't know, other then a happy belief that science has at least provided an answer that doesn't involve God.", 
   {
    "post_info": {
     "post_title": "You can still save me"
    }
   }, 
   67674, 
   null, 
   1095683580.0
  ], 
  [
   67733, 
   null, 
   "Mach", 
   "A leading evolutionist, R. Dawkins says \"Religion is also, of course, the underlying source of the divisiveness in the Middle East which motivated the use of this deadly weapon in the first place (referring to the September 11 attacks). But that is another story and not my concern here. My concern here is with the weapon itself. To fill a world with religion, or religions of the Abrahamic kind, is like littering the streets with loaded guns. Do not be surprised if they are used.\" \n http://www.royal-ts.de/mtarchives/000328.php\n \n\n As I said, I've read plenty on the subjects. I have read at least one book by Dawkins (blind watchmaker). I agree with much of his thinking. However, I'm not here debating dawkins, he is not the one here saying things which I find irrational. You can paraphrase their quotes, into your own specific statement tailored for this debate. \n \n \n \nYou do this. You believe that the science speculation (based on no evidence) about aliens is great, but that the science speculation (based on no evidence) for other things such as the Bunyip, Bigfoot, yeti, trolls etc is not great.\n\n How would you support the notion that I do this when in just the last reponse I clearly indicate that science is affected in every way shape and form, human fallability and craziness. It's entire design is shaped by this. I don't know of anything humans engage in that isn't affected by them. Why are you using strawman to argue this point? In your second statement, you are confusing human created fiction, with rational theorizing again, let's confine this to the other thread or admit you have no point on this specific issue.\n \n \nTo use the classic reply...\n \n (Post 67 of the \"So, how did they get all those animals on the ark\" thread.)\n But then for something you call 'science fiction' you're quite happy scientists spend squillions of dollars. That you accept so readily this activity is further evidence for my statement... that you'd actually defend them doing such that you yourself deem 'science fiction'.\n\n No Montalban. Let me say again. It's based on rational knowledge and methods. It's no more fiction than the way we measure the weight of the earth. Did we put in on a big 'ole spring scale and weigh it? No, we didn't did we. Can we go the speed of light? How do we know how fast it is? Were we alive 40M years ago? How do we know this fossil is from that time period? [/QUOTE]\n \n They don't spend \"squillions\", whatever that means. They spend very, very , very little on exobiology, compared to the other fields of science. Exaggeration again. I have already posted links to funding on the other thread, let's see your evidence if you persist in exaggeration.\n \n I do not defend research into bigfoot, because there is no reason to believe it's anything other than a product of the human imaginiation. No sufficient evidence. Likewise with god. However, at one time, before it had been researched, looking into bigfoot was reasonable only to the point where it lead to no evidence. It could have easily been a yet unknown animal, however, the consistent lack of evidence has made it a waste of time IMO to continue researching it, unless it's for \"fun\".\n \n \nFurther, you questioned (as you repeat here again), my very questioning of science. As if questioning of science (as you put forward) is itself indicative of an unstable mind. These are the exact same arguments religious people put when they justify inquisitions.\n Obviously (given the quote at top) Dawkins has combated the 'illogical' gene. I understand and appreciate your desire to help free me from such irrational thought. Don't give up just yet. :)\n\n \n You can question it all you want. Everyone questions specifics with regards to science, again, it's designed to be questioned. However, you're using strawman..i.e. attributing specific aspects to science like \"science cannot theorize about something otherwise it's just like believing in bigfoot\", which are basic misunderstandings of the concepts.\n \n \n\n As stated, I showed epistemological evidences here, and on other posts with regard to\n a) socialising process of (science) education\n b) influences upon scientists from without\n c) a priori beliefs (or, influences from within)\n If you did really believe in the 'checks and balances', then why do you have a problem with me stating scientists are influenced by factors like any other human engaged in other human activities. You either do believe that they are influenced, or they're not. Please pick a position.\n But, science is not open to all. Studies too have shown gender and cultural bias here as well.\n\n Ah, wrong. Go to college. Do well in a particular field of science. Go to graduate school. Continue to get buddy-buddy with various professors and then do a doctorate. Do a thesis on something you think can land you that big research job. Get a job doing research in a field you like. Spend a few years just reading the literature from the thousands of others before you. Then start actually working under another researcher. Maybe one day with enough hard-work, you'll do some novel research independantly. Either that or make a fortune in business then research whatever you want ;)\n \n \n You mean when looking for a job you can run into cultural and gender bias? *shock* Has nothing to do with the scientific proces.\n \n \nSee the comparison between science and religion...\n \"Natural science in the way it is practised is one of the great pillars of patriarchal domination. It is only in the fields of military and church that androcentristic behaviour, thinking and acting, i.e. thinking and acting fixed on men and on masculine ideals is as crucial as in natural science and technology.\"\n Gender in Bias in Science and Science Education\n http://www.physik.uni-bremen.de/physics.education/schwedes/text/bellater.htm\n \"Standard Tests\" show cultural bias. But why (re-)post them if you feel no 'urge' to read them? Fortunately, I suppose, I post for other people as well - the silent mob who read our debates; and hence do post them again here.\n\n Because we aren't debating far-flung, hard-to-understand topics. unless I disagree with a particular point, I don't need reams of links from other people to read, because they serve no purpose if I'm not disagreeing with a strawman. That's why.\n \n \nI am pro-science. I would like to see scientists freed from your restrictions. :)\n\n Strawman. You mean you would like to see science, freed from the constraints of science? Science is a broad term Montalban. I think what you're referring to is you'd like to see pseudo-science and science merged. Well, that's why they use two different terms.\n \n \n\n Here we're back to the 'you must be anti-science'. I am not.\n I am not in favour of your defining science by your philosophy of science. You and others here are yet to show your definition of science is science as opposed to philosophy of science. In order to demonstrate your view is science, by your own definition of science, you'd have to define it, using scientific method. So far several posters have responded to such a challenge with rhetorical ploys, gnashing of teeth regarding the impossibility of such a challenge, and philosophy - which is odd that there's a need to defend a definition of science by another discipline. (By the way, I have stated that historically there have been many views on the nature of science - including your materialistic one. Over the centuries others have had different views on what is science. This is in fact empirical - that there have been many views - thus my statement that your idea of science is a philosophy of science, is itself based on empirical evidence - given that\n a) it's historically one of many\n and\n b) your lack of proof for your claim :)\n Further, I like digital watches, TV, etc. Science provides lots of nice, nifty things. However, because of this, I am not 'bought' and recognise that there are factors affecting scientists. You don't. You believe some massive system of checks and balances exists. Either you are correct - and you've shown only your opinion on this, or I am correct, and I've shown citations that agree with me, or rather, that I agree with. And I must point out that in debating your 'side' on this matter for some time, I get this all the time. I post acres of evidences. The retort is \"'no, it just can't be!\" \n Thus again ironically, I present facts from studies, and it's retorted by opinion, or in your case above 'no opinion', which is still making me smile.\n Oddly enough, you can't claim to be unaware of this avalanche of evidence, because you've seen the \"Where does science say we come from?\" thread, which I posted such gems as...\n \"The scientific establishment bears a grisly resemblance to the Spanish Inquisition. Either you accept the rules and attitudes and beliefs promulgated by the 'papacy' (for which read, perhaps, the Royal Society or the Royal College of Physicians), or face a dreadful retribution. We will not actually burn you at the stake, because that sanction, unhappily, is now no longer available under our milksop laws. But we will make damned sure that you are a dead duck in our trade.\" \n (Gould, Donald [former editor of New Scientist], \"Letting poetry loose in the laboratory,\" New Scientist, 29 August 1992, p.51)\n http://www-acs.ucsd.edu/~idea/philoevolquotes.htm\n That's at the beginning, when we acquire science knowledge.... at the other end, biases occur, even in the choosing of which projects are chosen for funding. Often that bias is not even based on 'worth'.\n See \"Evaluation and Adjudication of Research Proposals: Vagaries and Politics of Funding\"\n http://www.qualitative-research.net.../3-02roth-e.htm\n \"Social constructivism characterises the nature of knowledge to include the following: (1) knowledge is not a passive commodity to be transferred from a teacher to learners, (2) pupils cannot and should not be made to absorb knowledge in a spongy fashion, (3) knowledge cannot exist separate from the knower, (4) learning is a social process mediated by the learner's environment, and (5) the prior or indigenous knowledge of the learner is of significance in accomplishing the construction of meaning in a new situation. All learning is mediated by culture and takes place in a social context.\"\n \"Transcending Cultural Borders: Implications for Science Teaching\" at\n http://www.usask.ca/education/people/aikenhead/RSTE.htm\n I know that this sort of stuff can so easily be retorted by 'no it's not', but you're 'retort' \"I haven't the urge to read it\" is very interesting.\n The epistemological case: it is why evolutionary theorists can present mutually exclusive theories and yet still keep a straight face when they tell creationists that evolution is true, because it has all these evidences - evidences that point to what? Evolution. It's such a hollow claim. When you ask 'how?' you're given a half-dozen different, equally plausible ways, but this is supposed to support the idea that evolution is the answer? It is based on people who believe evolution 'just is'. I mean, it has to be, everyone's taught it! Another example is abiogenesis. It's taught that it happened, even though no one's agreed 'how?' In short, it seems that you don't care what theory is put forward, providing it falls into the category of your definition of science. It doesn't even matter if there's a dozen theories there - what this 'proves' I don't know, other then a happy belief that science has at least provided an answer that doesn't involve God.\n\n \n Are you seriously telling me you cannot paraphrase this into specific points of a few sentences long? Again, and I don't need the links and quotes from various sources unless I disagree. Otherwise, it's akin to filabustering (sp?)\n My hope is that you refine in a few sentences your issue with science so we can discuss it in a timely manner :)\n \n -Mach", 
   {}, 
   67700, 
   null, 
   1095701040.0
  ], 
  [
   67740, 
   null, 
   "gazdata", 
   "As I said, I've read plenty on the subjects. I have read at least one book by Dawkins (blind watchmaker). I agree with much of his thinking. However, I'm not here debating dawkins, he is not the one here saying things which I find irrational. You can paraphrase their quotes, into your own specific statement tailored for this debate. \n \n \n \n How would you support the notion that I do this when in just the last reponse I clearly indicate that science is affected in every way shape and form, human fallability and craziness. It's entire design is shaped by this. I don't know of anything humans engage in that isn't affected by them. Why are you using strawman to argue this point? In your second statement, you are confusing human created fiction, with rational theorizing again, let's confine this to the other thread or admit you have no point on this specific issue.\n \n \n No Montalban. Let me say again. It's based on rational knowledge and methods. It's no more fiction than the way we measure the weight of the earth. Did we put in on a big 'ole spring scale and weigh it? No, we didn't did we. Can we go the speed of light? How do we know how fast it is? Were we alive 40M years ago? How do we know this fossil is from that time period? \n\n \n They don't spend \"squillions\", whatever that means. They spend very, very , very little on exobiology, compared to the other fields of science. Exaggeration again. I have already posted links to funding on the other thread, let's see your evidence if you persist in exaggeration.\n \n I do not defend research into bigfoot, because there is no reason to believe it's anything other than a product of the human imaginiation. No sufficient evidence. Likewise with god. However, at one time, before it had been researched, looking into bigfoot was reasonable only to the point where it lead to no evidence. It could have easily been a yet unknown animal, however, the consistent lack of evidence has made it a waste of time IMO to continue researching it, unless it's for \"fun\".\n \n \n \n You can question it all you want. Everyone questions specifics with regards to science, again, it's designed to be questioned. However, you're using strawman..i.e. attributing specific aspects to science like \"science cannot theorize about something otherwise it's just like believing in bigfoot\", which are basic misunderstandings of the concepts.\n \n \n Ah, wrong. Go to college. Do well in a particular field of science. Go to graduate school. Continue to get buddy-buddy with various professors and then do a doctorate. Do a thesis on something you think can land you that big research job. Get a job doing research in a field you like. Spend a few years just reading the literature from the thousands of others before you. Then start actually working under another researcher. Maybe one day with enough hard-work, you'll do some novel research independantly. Either that or make a fortune in business then research whatever you want ;)\n \n \n You mean when looking for a job you can run into cultural and gender bias? *shock* Has nothing to do with the scientific proces.\n \n \n Because we aren't debating far-flung, hard-to-understand topics. unless I disagree with a particular point, I don't need reams of links from other people to read, because they serve no purpose if I'm not disagreeing with a strawman. That's why.\n \n \n Strawman. You mean you would like to see science, freed from the constraints of science? Science is a broad term Montalban. I think what you're referring to is you'd like to see pseudo-science and science merged. Well, that's why they use two different terms.\n \n \n \n Are you seriously telling me you cannot paraphrase this into specific points of a few sentences long? Again, and I don't need the links and quotes from various sources unless I disagree. Otherwise, it's akin to filabustering (sp?)\n My hope is that you refine in a few sentences your issue with science so we can discuss it in a timely manner :)\n \n -Mach[/QUOTE]", 
   {}, 
   67733, 
   null, 
   1095702540.0
  ], 
  [
   68496, 
   null, 
   "montalban", 
   "They don't spend \"squillions\", whatever that means.\n\n Would it be possible to re-post your comments so that we can see which paragraph is a response to which comment - and who made it, it seems to be you are responding to Mach and myself, but it's difficult to tell some of which comments relate what was said.\n \n If it's possible. :)\n \n Mach your debating style, as stated is quite interesting.\n I quoted Dawkins, not paraphrase. There's a difference", 
   {}, 
   67740, 
   null, 
   1096172100.0
  ], 
  [
   68508, 
   null, 
   "Selasphorus", 
   "Actually not. He is responding to your remarks in post #34. And no, it wasn't a direct quote from Dawkins.", 
   {}, 
   68496, 
   null, 
   1096177380.0
  ], 
  [
   68513, 
   null, 
   "montalban", 
   "Actually not.\n\n Actually, yes. Sorry, another of your 'just-so' refutations falls by the wayside. As I say you make statements of opinion, I present evidence.\n \"Religion's Unguided Missile\"\n From the Guardian\n Saturday September 15, 2001\n http://www.simonyi.ox.ac.uk/dawkins/WorldOfDawkins-archive/Dawkins/Work/Articles/2001-09time_to_stand_up.shtml\n The above site is where he does a lot of back pedalling, it is a response to the out-cry such as...\n \"Today?s Special on the Menu of Hate by John Liechty\"\n On September 15, 2001 The Guardian published ?Religion?s Misguided Missiles?, a comment by Richard Dawkins that sought to explain the motivations behind what had happened four days before. Dawkins? conclusion is summed up in two memorable sentences: ?To fill a world with religion, or religions of the Abrahamic kind, is like littering the streets with loaded guns. Do not be surprised if they are used.?\n http://www.commondreams.org/views02/0711-07.htm\n But it is also found on pro-Dawkins sites\n http://www.geocities.com/knightsglobal/dawkins.html\n and he is viewed as a champion by http://www.blaserco.com/blogs/2002/10/17.html which repeats the claim\n \n However, the whole text is...\n \"Religion's misguided missiles \n Promise a young man that death is not the end and he will willingly cause disaster\n Special report: terrorism in the US\n Richard Dawkins\n Guardian\n Saturday September 15, 2001\n A guided missile corrects its trajectory as it flies, homing in, say, on the heat of a jet plane's exhaust. A great improvement on a simple ballistic shell, it still cannot discriminate particular targets. It could not zero in on a designated New York skyscraper if launched from as far away as Boston. \n That is precisely what a modern \"smart missile\" can do. Computer miniaturisation has advanced to the point where one of today's smart missiles could be programmed with an image of the Manhattan skyline together with instructions to home in on the north tower of the World Trade Centre. Smart missiles of this sophistication are possessed by the United States, as we learned in the Gulf war, but they are economically beyond ordinary terrorists and scientifically beyond theocratic governments. Might there be a cheaper and easier alternative? \n In the second world war, before electronics became cheap and miniature, the psychologist BF Skinner did some research on pigeon-guided missiles. The pigeon was to sit in a tiny cockpit, having previously been trained to peck keys in such a way as to keep a designated target in the centre of a screen. In the missile, the target would be for real. \n The principle worked, although it was never put into practice by the US authorities. Even factoring in the costs of training them, pigeons are cheaper and lighter than computers of comparable effectiveness. Their feats in Skinner's boxes suggest that a pigeon, after a regimen of training with colour slides, really could guide a missile to a distinctive landmark at the southern end of Manhattan island. The pigeon has no idea that it is guiding a missile. It just keeps on pecking at those two tall rectangles on the screen, from time to time a food reward drops out of the dispenser, and this goes on until... oblivion. \n Pigeons may be cheap and disposable as on-board guidance systems, but there's no escaping the cost of the missile itself. And no such missile large enough to do much damage could penetrate US air space without being intercepted. What is needed is a missile that is not recognised for what it is until too late. Something like a large civilian airliner, carrying the innocuous markings of a well-known carrier and a great deal of fuel. That's the easy part. But how do you smuggle on board the necessary guidance system? You can hardly expect the pilots to surrender the left-hand seat to a pigeon or a computer. \n How about using humans as on-board guidance systems, instead of pigeons? Humans are at least as numerous as pigeons, their brains are not significantly costlier than pigeon brains, and for many tasks they are actually superior. Humans have a proven track record in taking over planes by the use of threats, which work because the legitimate pilots value their own lives and those of their passengers. \n The natural assumption that the hijacker ultimately values his own life too, and will act rationally to preserve it, leads air crews and ground staff to make calculated decisions that would not work with guidance modules lacking a sense of self-preservation. If your plane is being hijacked by an armed man who, though prepared to take risks, presumably wants to go on living, there is room for bargaining. A rational pilot complies with the hijacker's wishes, gets the plane down on the ground, has hot food sent in for the passengers and leaves the negotiations to people trained to negotiate. \n The problem with the human guidance system is precisely this. Unlike the pigeon version, it knows that a successful mission culminates in its own destruction. Could we develop a biological guidance system with the compliance and dispensability of a pigeon but with a man's resourcefulness and ability to infiltrate plausibly? What we need, in a nutshell, is a human who doesn't mind being blown up. He'd make the perfect on-board guidance system. But suicide enthusiasts are hard to find. Even terminal cancer patients might lose their nerve when the crash was actually looming. \n Could we get some otherwise normal humans and somehow persuade them that they are not going to die as a consequence of flying a plane smack into a skyscraper? If only! Nobody is that stupid, but how about this - it's a long shot, but it just might work. Given that they are certainly going to die, couldn't we sucker them into believing that they are going to come to life again afterwards? Don't be daft! No, listen, it might work. Offer them a fast track to a Great Oasis in the Sky, cooled by everlasting fountains. Harps and wings wouldn't appeal to the sort of young men we need, so tell them there's a special martyr's reward of 72 virgin brides, guaranteed eager and exclusive. \n Would they fall for it? Yes, testosterone-sodden young men too unattractive to get a woman in this world might be desperate enough to go for 72 private virgins in the next. \n It's a tall story, but worth a try. You'd have to get them young, though. Feed them a complete and self-consistent background mythology to make the big lie sound plausible when it comes. Give them a holy book and make them learn it by heart. Do you know, I really think it might work. As luck would have it, we have just the thing to hand: a ready-made system of mind-control which has been honed over centuries, handed down through generations. Millions of people have been brought up in it. It is called religion and, for reasons which one day we may understand, most people fall for it (nowhere more so than America itself, though the irony passes unnoticed). Now all we need is to round up a few of these faith-heads and give them flying lessons. \n Facetious? Trivialising an unspeakable evil? That is the exact opposite of my intention, which is deadly serious and prompted by deep grief and fierce anger. I am trying to call attention to the elephant in the room that everybody is too polite - or too devout - to notice: religion, and specifically the devaluing effect that religion has on human life. I don't mean devaluing the life of others (though it can do that too), but devaluing one's own life. Religion teaches the dangerous nonsense that death is not the end. \n If death is final, a rational agent can be expected to value his life highly and be reluctant to risk it. This makes the world a safer place, just as a plane is safer if its hijacker wants to survive. At the other extreme, if a significant number of people convince themselves, or are convinced by their priests, that a martyr's death is equivalent to pressing the hyperspace button and zooming through a wormhole to another universe, it can make the world a very dangerous place. Especially if they also believe that that other universe is a paradisical escape from the tribulations of the real world. Top it off with sincerely believed, if ludicrous and degrading to women, sexual promises, and is it any wonder that naive and frustrated young men are clamouring to be selected for suicide missions? \n There is no doubt that the afterlife-obsessed suicidal brain really is a weapon of immense power and danger. It is comparable to a smart missile, and its guidance system is in many respects superior to the most sophisticated electronic brain that money can buy. Yet to a cynical government, organisation, or priesthood, it is very very cheap. \n Our leaders have described the recent atrocity with the customary cliche: mindless cowardice. \"Mindless\" may be a suitable word for the vandalising of a telephone box. It is not helpful for understanding what hit New York on September 11. Those people were not mindless and they were certainly not cowards. On the contrary, they had sufficiently effective minds braced with an insane courage, and it would pay us mightily to understand where that courage came from. \n It came from religion. Religion is also, of course, the underlying source of the divisiveness in the Middle East which motivated the use of this deadly weapon in the first place. But that is another story and not my concern here. My concern here is with the weapon itself. To fill a world with religion, or religions of the Abrahamic kind, is like littering the streets with loaded guns. Do not be surprised if they are used.\n Richard Dawkins is professor of the public understanding of science, University of Oxford, and author of The Selfish Gene, The Blind Watchmaker, and Unweaving the Rainbow\"\n http://www.guardian.co.uk/Archive/Article/0,4273,4257777,00.html\n I hope this link works :) It is linked at http://www.outlookindia.com/full.asp?fodname=20011009&fname=dawkins&sid=1, but I have had some trouble opening it, if it doesn't work I found it through this web-site http://watch.windsofchange.net/themes_02.htm\n \n In short, you are wrong two. It is a quote. Dawkins said it. That is what I call an argument - presentation of a case, with evidence to back it up. I expect either a 'no it isn't' type argument will still continue to be your debating tool of choice. I do not look forward to seeing your other two favourite debates:\n a) I've been refuted somewhere else\n b) that I don't understand English\n \n However, of more import, remember Mach said that it is I who doesn't make sense - not Dawkins. Here is an opportunity for him and you to distance yourself from Dawkin's hateful words. You know what 'hateful' is?\n \n \n He is responding to your remarks in post #34. And no, it wasn't a direct quote from Dawkins.\n\n I guessed he may have been responding, but he's set out paragraphs not directly linked to particular paragraphs in my post - so I would have to match up comment from his with mine. It would be easier if he posts with direct quotes or references to which particular paragraph he's commenting on at any particular time.", 
   {}, 
   68508, 
   null, 
   1096181880.0
  ], 
  [
   68515, 
   null, 
   "Mach", 
   "Actually, yes. Sorry, another of your 'just-so' refutations falls by the wayside. As I say you make statements of opinion, I present evidence.\n \"Religion's Unguided Missile\"\n From the Guardian\n Saturday September 15, 2001\n http://www.simonyi.ox.ac.uk/dawkins/WorldOfDawkins-archive/Dawkins/Work/Articles/2001-09time_to_stand_up.shtml\n The above site is where he does a lot of back pedalling, it is a response to the out-cry such as...\n \"Today?s Special on the Menu of Hate by John Liechty\"\n On September 15, 2001 The Guardian published ?Religion?s Misguided Missiles?, a comment by Richard Dawkins that sought to explain the motivations behind what had happened four days before. Dawkins? conclusion is summed up in two memorable sentences: ?To fill a world with religion, or religions of the Abrahamic kind, is like littering the streets with loaded guns. Do not be surprised if they are used.?\n http://www.commondreams.org/views02/0711-07.htm\n But it is also found on pro-Dawkins sites\n http://www.geocities.com/knightsglobal/dawkins.html\n and he is viewed as a champion by http://www.blaserco.com/blogs/2002/10/17.html which repeats the claim\n \n However, the whole text is...\n \"Religion's misguided missiles \n Promise a young man that death is not the end and he will willingly cause disaster\n Special report: terrorism in the US\n Richard Dawkins\n Guardian\n Saturday September 15, 2001\n A guided missile corrects its trajectory as it flies, homing in, say, on the heat of a jet plane's exhaust. A great improvement on a simple ballistic shell, it still cannot discriminate particular targets. It could not zero in on a designated New York skyscraper if launched from as far away as Boston. \n That is precisely what a modern \"smart missile\" can do. Computer miniaturisation has advanced to the point where one of today's smart missiles could be programmed with an image of the Manhattan skyline together with instructions to home in on the north tower of the World Trade Centre. Smart missiles of this sophistication are possessed by the United States, as we learned in the Gulf war, but they are economically beyond ordinary terrorists and scientifically beyond theocratic governments. Might there be a cheaper and easier alternative? \n In the second world war, before electronics became cheap and miniature, the psychologist BF Skinner did some research on pigeon-guided missiles. The pigeon was to sit in a tiny cockpit, having previously been trained to peck keys in such a way as to keep a designated target in the centre of a screen. In the missile, the target would be for real. \n The principle worked, although it was never put into practice by the US authorities. Even factoring in the costs of training them, pigeons are cheaper and lighter than computers of comparable effectiveness. Their feats in Skinner's boxes suggest that a pigeon, after a regimen of training with colour slides, really could guide a missile to a distinctive landmark at the southern end of Manhattan island. The pigeon has no idea that it is guiding a missile. It just keeps on pecking at those two tall rectangles on the screen, from time to time a food reward drops out of the dispenser, and this goes on until... oblivion. \n Pigeons may be cheap and disposable as on-board guidance systems, but there's no escaping the cost of the missile itself. And no such missile large enough to do much damage could penetrate US air space without being intercepted. What is needed is a missile that is not recognised for what it is until too late. Something like a large civilian airliner, carrying the innocuous markings of a well-known carrier and a great deal of fuel. That's the easy part. But how do you smuggle on board the necessary guidance system? You can hardly expect the pilots to surrender the left-hand seat to a pigeon or a computer. \n How about using humans as on-board guidance systems, instead of pigeons? Humans are at least as numerous as pigeons, their brains are not significantly costlier than pigeon brains, and for many tasks they are actually superior. Humans have a proven track record in taking over planes by the use of threats, which work because the legitimate pilots value their own lives and those of their passengers. \n The natural assumption that the hijacker ultimately values his own life too, and will act rationally to preserve it, leads air crews and ground staff to make calculated decisions that would not work with guidance modules lacking a sense of self-preservation. If your plane is being hijacked by an armed man who, though prepared to take risks, presumably wants to go on living, there is room for bargaining. A rational pilot complies with the hijacker's wishes, gets the plane down on the ground, has hot food sent in for the passengers and leaves the negotiations to people trained to negotiate. \n The problem with the human guidance system is precisely this. Unlike the pigeon version, it knows that a successful mission culminates in its own destruction. Could we develop a biological guidance system with the compliance and dispensability of a pigeon but with a man's resourcefulness and ability to infiltrate plausibly? What we need, in a nutshell, is a human who doesn't mind being blown up. He'd make the perfect on-board guidance system. But suicide enthusiasts are hard to find. Even terminal cancer patients might lose their nerve when the crash was actually looming. \n Could we get some otherwise normal humans and somehow persuade them that they are not going to die as a consequence of flying a plane smack into a skyscraper? If only! Nobody is that stupid, but how about this - it's a long shot, but it just might work. Given that they are certainly going to die, couldn't we sucker them into believing that they are going to come to life again afterwards? Don't be daft! No, listen, it might work. Offer them a fast track to a Great Oasis in the Sky, cooled by everlasting fountains. Harps and wings wouldn't appeal to the sort of young men we need, so tell them there's a special martyr's reward of 72 virgin brides, guaranteed eager and exclusive. \n Would they fall for it? Yes, testosterone-sodden young men too unattractive to get a woman in this world might be desperate enough to go for 72 private virgins in the next. \n It's a tall story, but worth a try. You'd have to get them young, though. Feed them a complete and self-consistent background mythology to make the big lie sound plausible when it comes. Give them a holy book and make them learn it by heart. Do you know, I really think it might work. As luck would have it, we have just the thing to hand: a ready-made system of mind-control which has been honed over centuries, handed down through generations. Millions of people have been brought up in it. It is called religion and, for reasons which one day we may understand, most people fall for it (nowhere more so than America itself, though the irony passes unnoticed). Now all we need is to round up a few of these faith-heads and give them flying lessons. \n Facetious? Trivialising an unspeakable evil? That is the exact opposite of my intention, which is deadly serious and prompted by deep grief and fierce anger. I am trying to call attention to the elephant in the room that everybody is too polite - or too devout - to notice: religion, and specifically the devaluing effect that religion has on human life. I don't mean devaluing the life of others (though it can do that too), but devaluing one's own life. Religion teaches the dangerous nonsense that death is not the end. \n If death is final, a rational agent can be expected to value his life highly and be reluctant to risk it. This makes the world a safer place, just as a plane is safer if its hijacker wants to survive. At the other extreme, if a significant number of people convince themselves, or are convinced by their priests, that a martyr's death is equivalent to pressing the hyperspace button and zooming through a wormhole to another universe, it can make the world a very dangerous place. Especially if they also believe that that other universe is a paradisical escape from the tribulations of the real world. Top it off with sincerely believed, if ludicrous and degrading to women, sexual promises, and is it any wonder that naive and frustrated young men are clamouring to be selected for suicide missions? \n There is no doubt that the afterlife-obsessed suicidal brain really is a weapon of immense power and danger. It is comparable to a smart missile, and its guidance system is in many respects superior to the most sophisticated electronic brain that money can buy. Yet to a cynical government, organisation, or priesthood, it is very very cheap. \n Our leaders have described the recent atrocity with the customary cliche: mindless cowardice. \"Mindless\" may be a suitable word for the vandalising of a telephone box. It is not helpful for understanding what hit New York on September 11. Those people were not mindless and they were certainly not cowards. On the contrary, they had sufficiently effective minds braced with an insane courage, and it would pay us mightily to understand where that courage came from. \n It came from religion. Religion is also, of course, the underlying source of the divisiveness in the Middle East which motivated the use of this deadly weapon in the first place. But that is another story and not my concern here. My concern here is with the weapon itself. To fill a world with religion, or religions of the Abrahamic kind, is like littering the streets with loaded guns. Do not be surprised if they are used.\n Richard Dawkins is professor of the public understanding of science, University of Oxford, and author of The Selfish Gene, The Blind Watchmaker, and Unweaving the Rainbow\"\n http://www.guardian.co.uk/Archive/Article/0,4273,4257777,00.html\n I hope this link works :) It is linked at http://www.outlookindia.com/full.asp?fodname=20011009&fname=dawkins&sid=1, but I have had some trouble opening it, if it doesn't work I found it through this web-site http://watch.windsofchange.net/themes_02.htm\n \n In short, you are wrong two. It is a quote. Dawkins said it. That is what I call an argument - presentation of a case, with evidence to back it up. I expect either a 'no it isn't' type argument will still continue to be your debating tool of choice. I do not look forward to seeing your other two favourite debates:\n a) I've been refuted somewhere else\n b) that I don't understand English\n \n However, of more import, remember Mach said that it is I who doesn't make sense - not Dawkins. Here is an opportunity for him and you to distance yourself from Dawkin's hateful words. You know what 'hateful' is?\n \n \n I guessed he may have been responding, but he's set out paragraphs not directly linked to particular paragraphs in my post - so I would have to match up comment from his with mine. It would be easier if he posts with direct quotes or references to which particular paragraph he's commenting on at any particular time.\n\n \n This *looks at Montalban's post length* is exactly my point. You need to post all this why? To make a point? Nonsense. To refute something? Cite source and the single sentence quote, not the freaking chapter. Good gravy man, stop teaching the controversy (hey, new phrase!).\n \n Just cut and past the bolded text and we'll know what you're getting at. So what is my name being used for? So I can disagree with Dawkins? I don't on most things, from what I've both heard and read of his work. \n \n Yes, I think irrational thought is like a loaded gun in our society, NO MATTER THE SOURCE. It's rational IMO to think that way..not hateful, sorry, I must have missed the point of that big wonker of a post..again. I read something in there about the word \"evidence\". Not sure it why it works to prove this elusive point of yours, yet cannot be used to help us believe in your supernatural diety. \n \n -Mach", 
   {}, 
   68513, 
   null, 
   1096183200.0
  ], 
  [
   68518, 
   null, 
   "montalban", 
   "This *looks at Montalban's post length* is exactly my point. You need to post all this why? To make a point? Nonsense. To refute something? Cite source and the single sentence quote, not the freaking chapter. Good gravy man, stop teaching the controversy (hey, new phrase!)\n \n -Mach\n\n \n You're kidding? That's your retort? That I post evidence only to make a point?\n The point was you said I hadn't quoted Dawkins. I had. You're wrong. I provide the whole text to show this. You made a 'just-so' statement.\n Your buddy Selasphorus repeated the claim that Dawkins never said it, he's thus wrong as well. He made a 'just-so' statement\n \n And now your retort is that I have relied on evidence? This is a truly unique debating style you have. I apologise that I don't use 'just-so' statements so that you can follow the argument I make.\n \n By the way, using your name - well you made the claim that you're not here to argue against Dawkins, and that I don't make sense. I give you the opportunity to distance yourself from Dawkin's silly claim - by implication of your post you believe he does make sense... in that you've no argument with him.", 
   {}, 
   68515, 
   null, 
   1096183800.0
  ], 
  [
   68523, 
   null, 
   "Mach", 
   "You're kidding? That's your retort? That I post evidence only to make a point?\n The point was you said I hadn't quoted Dawkins. I had. You're wrong. I provide the whole text to show this. You made a 'just-so' statement.\n Your buddy Selasphorus repeated the claim that Dawkins never said it, he's thus wrong as well. He made a 'just-so' statement\n \n And now your retort is that I have relied on evidence? This is a truly unique debating style you have. I apologise that I don't use 'just-so' statements so that you can follow the argument I make.\n \n By the way, using your name - well you made the claim that you're not here to argue against Dawkins, and that I don't make sense. I give you the opportunity to distance yourself from Dawkin's silly claim - by implication of your post you believe he does make sense... in that you've no argument with him.\n\n \n \nYou're kidding? That's your retort? That I post evidence only to make a point?\n The point was you said I hadn't quoted Dawkins. I had. You're wrong. \n\n \n You are misunderstanding something, let's get back on track.\n \n Here is my quote below. Nowhere do I (nor should I) say that I didn't think you quoted Dawkins. In fact, if you read it again, you'll see I'm saying exactly the opposite. There is \"no need to quote Dawkins\", because you can assume I'll agree that what you post is correct, if you just site source and continue in your own words. Saying \"I'm not here to debate Dawkins\", is saying, \"why are you quoting dawkins out of the blue, is it relevant?\" Furthermore, I said basically you can assume I agree with Dawkins unless I tell you otherwise, for the sake of expeditious debate.\n \n \nAs I said, I've read plenty on the subjects. I have read at least one book by Dawkins (blind watchmaker). I agree with much of his thinking. However, I'm not here debating dawkins, he is not the one here saying things which I find irrational. You can paraphrase their quotes, into your own specific statement tailored for this debate. \n \n \n I'm asking you to take the sum of those things you find debatable, and present them IN YOUR OWN WORDS, rather than a string of pages and pages of quotes from people that are not on the forums. I want to debate YOUR statements, specific statements. It's fine if your statements are in opposition to a single sentence or two of a cited source. But that's never the case, it's reams of raw data that I see posted. I don't see the need to read through pages and pages to extract a single point when you could save us all some time by cutting down the volume of text.\n \n Is that more clear? I hope so, because by asking for \"fewer raw quotes\", I got a big long one in response!! \n \n -Mach", 
   {}, 
   68518, 
   null, 
   1096188120.0
  ], 
  [
   68525, 
   null, 
   "montalban", 
   "You are misunderstanding something, let's get back on track.\n\n I'm prepared to let it go that you don't acknowledge you're wrong about Dawkins. However, do you support what he says? It seems you do as you believe that only your version of truth - science based, is rational.\n \nHere is my quote below. Nowhere do I (nor should I) say that I didn't think you quoted Dawkins. In fact, if you read it again, you'll see I'm saying exactly the opposite. There is \"no need to quote Dawkins\", because you can assume I'll agree that what you post is correct, if you just site source and continue in your own words. Saying \"I'm not here to debate Dawkins\", is saying, \"why are you quoting dawkins out of the blue, is it relevant?\" Furthermore, I said basically you can assume I agree with Dawkins unless I tell you otherwise, for the sake of expeditious debate.\n I'm asking you to take the sum of those things you find debatable, and present them IN YOUR OWN WORDS, rather than a string of pages and pages of quotes from people that are not on the forums. I want to debate YOUR statements, specific statements. It's fine if your statements are in opposition to a single sentence or two of a cited source. But that's never the case, it's reams of raw data that I see posted. I don't see the need to read through pages and pages to extract a single point when you could save us all some time by cutting down the volume of text.\n Is that more clear? I hope so, because by asking for \"fewer raw quotes\", I got a big long one in response!! \n -Mach\n\n I understand what you are saying. But I won't tailor my argument to suit your attention span. I am at great pains to construct an argument with references. If you don't want to read what I post, then frankly - don't. I believe in information. I work with it.", 
   {}, 
   68523, 
   null, 
   1096188960.0
  ], 
  [
   68530, 
   null, 
   "OccamsRazor", 
   "Montalban wrote: However, of more import, remember Mach said that it is I who doesn't make sense - not Dawkins. Here is an opportunity for him and you to distance yourself from Dawkin's hateful words. You know what 'hateful' is?\n\n \n Well, I'm aware of the meaning of the word hateful, but I'm interested to hear what your implication is in this instance as I do not see the word as being appropriate.", 
   {}, 
   68525, 
   null, 
   1096198440.0
  ], 
  [
   68542, 
   null, 
   "Mach", 
   "I'm prepared to let it go that you don't acknowledge you're wrong about Dawkins. However, do you support what he says? It seems you do as you believe that only your version of truth - science based, is rational.\n \n I understand what you are saying. But I won't tailor my argument to suit your attention span. I am at great pains to construct an argument with references. If you don't want to read what I post, then frankly - don't. I believe in information. I work with it.\n\n \n I do believe that choosing to believe in or draw conclusions from things that have no evidence is irrational. On that level I agree with Dawkins, irrational thought IMO, and his opinion, is dangerous to our human society. One can \"hope\", for something they have insufficient evidence for, or even \"shut out\" certain thoughts to avoid dealing with them. But if they were to DENY them, that's the step into irrationality.\n \n Many things are dangerous to our human society, opening the door to irrational thought is just one of many. \n \n ====\n \n If you mean to say that your version of what you term as \"truth\", is somehow based on rational thought, then we've got a debate. Because it's irrational to believe in something without sufficient evidence...in this case, without ANY evidence.\n \n You believe:\n \n - Love is god\n \n - A human cannot do \"good\" without god, so god = good.\n \n - Life is the design of \"god\" (Assuming this one, correct me if that's not the case)\n \n - The supernatural exists (God, miracles, etc.), and has influence in, the known universe\n \n - Not believing in the general theory of evolution as it applies to the origin of the human species (And all other species except the first) is somehow \"rational\".\n \n - You disagree with a concept in biology, a course which you admittedly didn't, or chose not to, understand sufficiently, and you debate language rather than the science. Not understanding it in one course is human. Saying we should not believe it, and choosing not to believe it, is irrational.\n \n - The position(s) you hold does two things:\n \n 1. Requires you to deny that evolution exists despite the evidence\n 2. Leave you without the ability to provide a rational, alternative theory.\n \n This is why your entire argument is irrational, and in my opinion, to use Dawkins wording to make sure we know I agree, \"dangerous\".\n \n You can question science, it's meant to be questioned, we all WANT it to be questioned, repeatedly. It's accuracy relies on these questions.\n \n That does not however make it a \"controversy\". Evolution in general, is NOT being heatedly debated my science. It's almost universally accepted in the scientific community, because of the vast amount of evidence obtained from:\n \n 1. Observation of the physical world (of life around us)\n 2. Observation of the fossil record ( of life before us)\n 3. Observation of the mechanics of our chemical composition, including genetics, and how genetic information is the blueprint of the creation of an organism, and how this genetic information changes, and can change, over time.\n \n Once you understand the general concepts, it's plain to see how simple of a theory it is, and how it answers so many questions we have about life, and how there is no evidence that indicates it might NOT be able to answer EVERY question we have about life once we're at the end of our scientific journey in that direction (if there is an end).\n \n Why are there males and females? Why do we have sex? Why do I, a man, have nipples? Why do we have different skin hues, hair colors, why do some people have a bad heart, 6 fingers, why do we die. Why is eating (of most foods) pleasurable. Where did other animals come from. Why are there domesticated dogs and \"wild\" dogs. Why do some mammals live in the ocean, and have finger and toe (tarsal and metatarsal?) bone structure in their flippers? The list goes on, to ever question you could ever have about living organisms.\n \n ...and where did we come from?\n \n It's that last one that disagrees with your premise, that \"a supernatural god created life\", and that's an irrational to believe. You venture further into the irrational behavior when you then DENY things with sufficient evidence that do not agree with this irrational belief. Because you know to believe in any part of evolution, no matter how rational, requires that you accept the conclusion (that humans came to be through evolutionary change), you attack ALL of evolution. There is no need to pick and choose little fringe arguments on the subject. Let's cut right to the root causes.\n \n -Mach", 
   {}, 
   68525, 
   null, 
   1096217700.0
  ], 
  [
   68582, 
   null, 
   "montalban", 
   "Well, I'm aware of the meaning of the word hateful, but I'm interested to hear what your implication is in this instance as I do not see the word as being appropriate.\n\n Ah irony. Dawkins talking about irrational hate, and showing it himself", 
   {}, 
   68530, 
   null, 
   1096249980.0
  ], 
  [
   68608, 
   null, 
   "lampornis", 
   "Montalban\n \n Please list which of Dawkins books you have read. You comment on what Darwin really meant without having read anything that he wrote. Is it the same with Dawkins?\n \n By the way, I possess (and have read) many of his books. Because I have read his books and because I feel that I have understood his message, I disagree with him on many points. However, his evolutionary biology is above reproach.", 
   {}, 
   68582, 
   null, 
   1096266960.0
  ], 
  [
   68614, 
   null, 
   "montalban", 
   "Montalban\n Please list which of Dawkins books you have read. You comment on what Darwin really meant without having read anything that he wrote. Is it the same with Dawkins?\n By the way, I possess (and have read) many of his books. Because I have read his books and because I feel that I have understood his message, I disagree with him on many points. However, his evolutionary biology is above reproach.\n\n Are we debating here Dawkins entire theory on evolution, or are we debating what Dawkins said with regards to religion?\n I'll give you a clue\n see post 39 where you, when you posted under another UserID was shown to be wrong. (See - I reference the actual post where you were wrong - not make some hollow and vague reference to 'somewhere else')\n Otherwise you seem to be arguing something else entire. Note also, I gave the entire text of what Dawkins said on this issue. This should be simply registered by you as another mistake, but you want to go on and deny it, even when it's in black and white, with cross-references :)\n \n As I said, me failing Biology has not affected in any way my arguments when I draw on citations that can be checked. You, who claims a degree in all sorts of things make a wave of the hand gesture to somewhere else, as if we are to take your word for that too! It is why you can't debate with reference to references - but make some gesture instead to something in the ether. Did they teach you that at the University of ???\n \n And just in case you've forgotten...\n \" I have called this principle, by which each slight variation, if useful, is preserved, by the term natural selection, in order to mark its relation to man's power of selection. BUT the expression often used by Mr. Herbert Spencer, of the Survival of the Fittest, is more accurate, and is sometimes equally convenient.\"\n (emphasis mine)\n http://www.literature.org/authors/darwin-charles/the-origin-of-species-6th-edition/chapter-03.html\n \n And your retort? Each is as 'useful' as the other, but it's worth re-capping - since you won't let arguments rest.\n a) Darwin didn't use it. (Post 53 of the \"Is it natural?\" thread)\n b) He was convinced to use it by Wallace\n c) He was compelled to use it because it gained currency amongst the wider populace\n d) You taught me that Spencer coined the phrase.", 
   {}, 
   68608, 
   null, 
   1096276680.0
  ], 
  [
   68620, 
   null, 
   "montalban", 
   "In short you have trouble admitting to an error. I admit my mistakes - and short-comings; with regards my science education.\n \n Though this now has little to do with the Moon Dust Theory, it goes to show that when opposed some pro-evolutionists are as addicted to religious-like dogma that even when presented with facts in black and white, they still deny, and revert to insults and accuse the opposition (in this case, me :)) of lying.\n \n To keep with the religious-like zeal, the irony of Dawkins attack on religion is that he displays the same irrational hatred that he accuses fundamentalists of. \n \n Here is part of a reply to one of Berlinski's articles, by one David C Denett...\n \"I love it: another hilarious demonstration that you can publish bull---t at will - just so long as you say what an editorial board wants to hear in a style it favors. Fist there was Alan Soak's delicious unmasking of the editors of Social Text, who fell for his fashionably anti-scientific \"proof\" that according to quantum physics, the world is a social construction. Now David Berlinski has done the same to the editors of  Commentary, who fell just as hard for his parody of \"scientific\" creationism. They must really be oppressed by evolutionary theory to publish such inspired silliness without running it by a biologist or two for soundness. Two such similar pranks in a single month make one wonder if this is just the tip of the Zeitgeist. What next? A hoax extolling the educational virtues of the machine gun for tots in the American Rifleman?\"\n David Berlinski; \"Letters: David Berlinski and Critics\" in Dembski, W. A. (ed) \"Uncommon Dissent: Intellectuals who Find Darwinism Unconvincing\", p290\n \n Note it has the same hallmarks of some of the refutations here - generalised ad hominem and ridicule.\n \n \n \n David Berlinsk's article reminds me of the tactics employed by a certain creationist with whom I once shared a platform in Oxford. The great evolutionist John Maynard Smith was, of course, easily able to destroy the creationist's case, and in his good-natured way he soon had the audience roaring with appreciative laughter at its expense. The creationist has his own peculiar way of dealing with this. He sprang to his feet, palms facing the audience in a gesture eloquent or magnanimous reproof. \"No, no!\" he cried reproachfully, \"Don't laugh. Let Maynard Smith have his say. It's only fair!\" This desperate (sic) pretence that the audience was laughing at Maynard Smith, when in fact it was laughing with Maynard Smith at the creationist himself, reminds me of Mr Berlinski's pretending to misunderstand Jacques Monod and me to the extent of thinking we disagree with each other over the issue of chance.\n \n As for the identity of the creationist who tried to pull this little stunt on Maynard Smith, it was none other than David Berlinski. The audience, by the way, saw through his tactic instantly and treated it with hoots of derision\"\n \n -Richard Dawkins\n \n Ibid, p288.\n \n \n Neither party really attempts to refute Berlinski, but they are keen to make reference to him being a creationist - a misrepresentation, because he's not. Dawkins goes further to recount an instance of somewhere else (sound familiar?) to where he believes Berlinski was wrong. This is what happens when zealots are even dared questioned.", 
   {}, 
   68614, 
   null, 
   1096279200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Moon Dust Theory", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2739-moon-dust-theory.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 2739, 
  "discussion_files": [
   [
    "9348.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2739-moon-dust-theory-print.html"
   ], 
   [
    "9349.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2739-moon-dust-theory-4-print.html"
   ], 
   [
    "9350.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2739-moon-dust-theory-3-print.html"
   ], 
   [
    "9351.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/2739-moon-dust-theory-2-print.html"
   ]
  ], 
  "identifier": 2739
 }
]