[
 [
  [
   58189, 
   null, 
   "Rev. HellH0und", 
   "Even MOORE audacity from Mr. Moore.\n \n From TownHall.com\n Moore's prop\n John McCaslin \n \n \n July 13, 2004\n \n \n The family of U.S. Air Force Maj. Gregory Stone was shocked to learn that video footage of the major's Arlington National Cemetery burial was included by Michael Moore in his movie \"Fahrenheit 9/11.\"\n \n Stone was killed in March 2003 by a grenade that officials said was thrown into his tent by Sgt. Hasan K. Akbar, who is on trial for murder.\n \n It's been a big shock, and we are not very happy about it, to say the least,\" Kandi Gallagher, Stone's aunt and family spokeswoman, tells Washington Times reporter Audrey Hudson.\n \n We are furious that Greg was in that casket and cannot defend himself, and my sister, Greg's mother, is just beside herself,\" Gallagher said. \"She is furious. She called him a 'maggot that eats off the dead.'\"\n \n The movie, described by critics as political propaganda during an election year, shows video footage of the funeral and Stone's fiancee, Tammie Eslinger, kissing her hand and touching it to his coffin.\n \n The family does not know how Moore obtained the video, and Gallagher said they did not give permission and are considering legal recourse.\n \n She described her nephew as a \"totally conservative Republican\" and said he would have found the film to be \"putrid.\"\n \n \"I'm sure he would have some choice words for Michael Moore,\" she said. \"Michael Moore would have a hard time asking our family for a glass of water if he were thirsty.\"", 
   {
    "post_info": {
     "post_title": "Does Moore have any class?"
    }
   }, 
   null, 
   null, 
   1089921000.0
  ], 
  [
   58196, 
   null, 
   "jim's trucking", 
   "Does Moore have any class?\n \n None that I have detected.\n \n I hope they successfully sue and cut deeply into his profits.", 
   {}, 
   58189, 
   null, 
   1089922740.0
  ], 
  [
   58205, 
   null, 
   "Big Orn", 
   "No. But, whatever it takes to make money is the kicker.\n \n I put as much stock in him as I do Steven Spielberg or Alfred Hitchcock when it comes to telling the truth.\n \n Alex Haley got his reward. After he was convicted of plagiarism, who could put stock in his &#8220;stories&#8221;.\n \n How about Stephen E. Ambrose? When it come out that he had copied someone else&#8217;s work, it damaged his credibility.\n \n The same thing is happening to Moore. He&#8217;ll get his reward...and money is money...and what it&#8217;s all about for him.\n \n He may even get more than he thought possible with all this publicity.\n \n The rabbit in the briar patch?", 
   {}, 
   58196, 
   null, 
   1089924300.0
  ], 
  [
   58206, 
   null, 
   "jim's trucking", 
   "No. But, whatever it takes to make money is the kicker.\n \n I put as much stock in him as I do Steven Spielberg or Alfred Hitchcock when it comes to telling the truth.\n Alex Haley got his reward. After he was convicted of plagiarism, who could put stock in his &#8220;stories&#8221;.\n \n How about Stephen E. Ambrose? When it come out that he had copied someone else&#8217;s work, it damaged his credibility.\n \n The same thing is happening to Moore. He&#8217;ll get his reward...and money is money...and what it&#8217;s all about for him.\n \n He may even get more than he thought possible with all this publicity.\n \n The rabbit in the briar patch?\n\n \n Did I miss a Hitchcock movie? I thought all of his were fictional.", 
   {}, 
   58205, 
   null, 
   1089924780.0
  ], 
  [
   58208, 
   null, 
   "Big Orn", 
   "Did I miss a Hitchcock movie? I thought all of his were fictional.\n\n \n So, you get my point....? :) emoticon_xclown", 
   {}, 
   58206, 
   null, 
   1089924900.0
  ], 
  [
   58339, 
   null, 
   "JPSartre12", 
   "Does Moore have any class?\n \n None that I have detected.\n \n I hope they successfully sue and cut deeply into his profits.\n\n \n He IS from Flint,MI after all. What do you expect?\n :)", 
   {}, 
   58196, 
   null, 
   1089953400.0
  ], 
  [
   58357, 
   null, 
   "jerichoholic104", 
   "Ah, you're from michigan too? Must really chap your caboose that a Republican presidential candidate will never win Michigan, eh?\n \n Really though, Flint's trying to make a rebound, give us a break. Had a corrupt mayor, GM pulled most of it's plants out, high unemployment... hopefully the dorms that UM-Flint is putting in, along with Kettering will help stimulate the local economy a little bit with the college scene. One thing about young people is that they have little money, but they will spend every single penny of it.", 
   {}, 
   58339, 
   null, 
   1089960420.0
  ], 
  [
   58493, 
   null, 
   "jim's trucking", 
   "http://www.freerepublic.com/focus/f-news/1161329/posts", 
   {
    "post_info": {
     "post_title": "michael moore beats white chicks!"
    }
   }, 
   58357, 
   null, 
   1090013040.0
  ], 
  [
   58555, 
   null, 
   "jskufan", 
   "Does Moore have any class?\n \n None that I have detected.\n \n I hope they successfully sue and cut deeply into his profits.\n\n \n Were you just as outraged when the families of the 911 victims objected to Bush using the \"9/11 ground zero\" film footage in his early campaign advertisements? Wasn't the goal of the commercials to further his political career? I know, I know, that was totally different because a Republican did it. Here's a link if you want to read it:\n \n http://www.nydailynews.com/news/story/170213p-148587c.html", 
   {}, 
   58196, 
   null, 
   1090033620.0
  ], 
  [
   58564, 
   null, 
   "mizmaxx", 
   "Were you just as outraged when the families of the 911 victims objected to Bush using the \"9/11 ground zero\" film footage in his early campaign advertisements? Wasn't the goal of the commercials to further his political career? I know, I know, that was totally different because a Republican did it.\n\n This thread made me laugh. It's really sad that this guy died, but even sadder that his death could have been prevented if he hadn't been, say, involved in waging war on people. Sorry, but live by the sword, die by the sword. Iraqi ppl's deaths are celebrated nightly on the evening news- but God forbid someone should use a dead bomb-dropper's funeral in a movie about the war (?!).", 
   {}, 
   58555, 
   null, 
   1090044120.0
  ], 
  [
   58623, 
   null, 
   "jim's trucking", 
   "Were you just as outraged when the families of the 911 victims objected to Bush using the \"9/11 ground zero\" film footage in his early campaign advertisements? Wasn't the goal of the commercials to further his political career? I know, I know, that was totally different because a Republican did it. Here's a link if you want to read it:\n \n http://www.nydailynews.com/news/story/170213p-148587c.html\n\n \n I wasn't \"outraged\" by either.\n \n Scenes of a disaster site are not quite the same as scenes of a grieving family at a funeral.\n \n Moore has little sense of respect.", 
   {}, 
   58555, 
   null, 
   1090094400.0
  ], 
  [
   58629, 
   null, 
   "jskufan", 
   "I wasn't \"outraged\" by either.\n \n Scenes of a disaster site are not quite the same as scenes of a grieving family at a funeral.\n \n Moore has little sense of respect.\n\n \n The film footage has no place in either campaign. The government was clueless to predict or defend America from the attack, how can they possibly think people want to see them campaigning at the ruins. It's about respect.", 
   {}, 
   58623, 
   null, 
   1090098540.0
  ], 
  [
   58689, 
   null, 
   "jim's trucking", 
   "The film footage has no place in either campaign. The government was clueless to predict or defend America from the attack, how can they possibly think people want to see them campaigning at the ruins. It's about respect.\n\n Maybe we should just forget about it. emoticon_rolleyes \n \n Maybe Bush was just reminding people of the difference between his response and Kerry's pacifism. He did not show victims families.\n \n Moore was intruding on the privacy of a grieving family.\n \n Moore is feces in men's clothing.", 
   {}, 
   58629, 
   null, 
   1090185720.0
  ], 
  [
   58727, 
   null, 
   "jerichoholic104", 
   "why is it that you're always willing to give Bush the benefit of the doubt, but Moore is always up to deceit of the most sinister kind?", 
   {}, 
   58689, 
   null, 
   1090199220.0
  ], 
  [
   58730, 
   null, 
   "jim's trucking", 
   "why is it that you're always willing to give Bush the benefit of the doubt, but Moore is always up to deceit of the most sinister kind?\n\n \n Why is it that you make statements about me that are false? \"Always\" is inappropriate because you have no clue as to how much I give anyone the \"benefit of the doubt\". I have stated cases where I disagree with Bush policy. There goes your \"always\".\n \n Moore is likewise not always up to deceit. I'm certain he sleeps a lot.\n \n Choose your words more carefully and don't try to describe how I think.", 
   {}, 
   58727, 
   null, 
   1090199820.0
  ], 
  [
   58733, 
   null, 
   "jerichoholic104", 
   "I apologize. Why is it in this particular quote, and during a good number of your posts, you are willing to give Bush the benefit of the doubt, and say that Moore is in the wrong? \n \n \nMaybe we should just forget about it. \n \n Maybe Bush was just reminding people of the difference between his response and Kerry's pacifism. He did not show victims families.\n \n Moore was intruding on the privacy of a grieving family.\n \n Moore is feces in men's clothing.\n", 
   {}, 
   58730, 
   null, 
   1090200120.0
  ], 
  [
   58739, 
   null, 
   "jim's trucking", 
   "I apologize. Why is it in this particular quote, and during a good number of your posts, you are willing to give Bush the benefit of the doubt, and say that Moore is in the wrong?\n\n \n Here's the quote again:\n \n \nMaybe we should just forget about it. \n \n Maybe Bush was just reminding people of the difference between his response and Kerry's pacifism. He did not show victims families.\n \n Moore was intruding on the privacy of a grieving family.\n \n Moore is feces in men's clothing. \n \n\n \n In that particular quote, I gave Bush the benefit of doubt because I can imagine his motives. There were no people in the scene with Bush. It appeared to be a simple reminder of a catastrophic event, prompting me to think perhaps he was just reminding us of the event. Since Bush's was a political ad, perhaps he was trying to contrast himself to Kerry and point out the need for aggressively attacking the terrorists before they kill us all.\n \n Kerry likely had a similar thing in mind when he made his political ad showing himself walking in battle fatigues (supposedly) in Vietnam, as if to say \"I served in Veitnam and you didn't\".\n \n God only knows what that bastard Moore had in mind when he filmed the grieving family. The family that he caught on tape was not aware of his actions and did not give him permission to do what he did.", 
   {}, 
   58733, 
   null, 
   1090201200.0
  ], 
  [
   58742, 
   null, 
   "jskufan", 
   "Maybe we should just forget about it. emoticon_rolleyes \n \n Maybe Bush was just reminding people of the difference between his response and Kerry's pacifism. He did not show victims families.\n \n Moore was intruding on the privacy of a grieving family.\n \n Moore is feces in men's clothing.\n\n \n You say you want to \"forget about it\" yet you keep posting. Your not outraged that someone filmed the event, your just mad because it's in Moore's movie. You'd have been thrilled to see the footage in a Bush commercial. Correct me if I'm wrong, but Arlington National Cemetery is a national \"monument\" that is owned by the government and thus open to the American people. I was in Washington DC 3 weeks ago and went through Arlington as well as several other war monuments. If you choose to be buried there, your open to the public. I'm not aware of any laws prohibiting photography on the premises. Since you haven't seen the movie, you have no idea what context the footage is being used in. What happened to the soldier was a horrible tragedy, yet it could have taken place anywhere in the world. It has nothing to do with Iraq or Bush, it simply illustrates the fact that there are mentally unstable people in every walk of life, and unfortunately innocent people get hurt. Getting back to the 9/11 footage, it's one of the darkest days in our history and I don't want to see Bush, Kerry, Clinton, or any other politician trying to use it as a stepping stone to further their careers. As I said earlier, the government dropped the ball, learn from it and move on.", 
   {}, 
   58689, 
   null, 
   1090204680.0
  ], 
  [
   58774, 
   null, 
   "jim's trucking", 
   "You say you want to \"forget about it\" yet you keep posting. \n\n You failed to recognize the sarcasm. I am definitely not in favor of forgetting about 9-11.\n \n \nYour not outraged that someone filmed the event, your just mad because it's in Moore's movie. You'd have been thrilled to see the footage in a Bush commercial. \n\n Again, you are out to lunch. I'm not mad either.\n \n \n Correct me if I'm wrong, ...\n That would be an all day job.\n \n \n...but Arlington National Cemetery is a national \"monument\" that is owned by the government and thus open to the American people. I was in Washington DC 3 weeks ago and went through Arlington as well as several other war monuments. If you choose to be buried there, your open to the public. I'm not aware of any laws prohibiting photography on the premises. Since you haven't seen the movie, you have no idea what context the footage is being used in. \n\n It is low-down to use footage of a grieving family without their permission.\n \n \n What happened to the soldier was a horrible tragedy, yet it could have taken place anywhere in the world. It has nothing to do with Iraq or Bush,  it simply illustrates the fact that there are mentally unstable people in every walk of life, and unfortunately innocent people get hurt.\nIt has to do with Michael Moore and his insensitivity.\n \n \n Getting back to the 9/11 footage, it's one of the darkest days in our history and I don't want to see Bush, Kerry, Clinton, or any other politician trying to use it as a stepping stone to further their careers. As I said earlier, the government dropped the ball, learn from it and move on.\nVietnam was darker. 58,000+ of our fine young men and women died there. Do you approve of Kerry's using it as a stepping stone? If not, why don't you say so.", 
   {}, 
   58742, 
   null, 
   1090244820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Does Moore have any class?", 
  "url": "http://www.4forums.com/political/current-events-debates/2743-does-moore-have-any-class.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 2743, 
  "discussion_files": [
   [
    "12170.html", 
    "http://www.4forums.com/political/current-events-debates/2743-does-moore-have-any-class-print.html"
   ], 
   [
    "12171.html", 
    "http://www.4forums.com/political/current-events-debates/2743-does-moore-have-any-class-2-print.html"
   ]
  ], 
  "identifier": 2743
 }
]