[
 [
  [
   58227, 
   null, 
   "LadyOreo", 
   "I was thinking why straight men hate the idea of gay men existing in our society. Maybe its because they are insecure of their mascuility. It takes a real man to be touch with their feminity self. A straight man should feel good when a gay man checks him out. It means you are good-looking enough. Why would a gay man bother with a straight man that looks like a little boy with dirt under his nails and holes in the underwear just like grandpa. \n \n Gay men have money and power now a days. They deserve to marry and adop children. There is no damage to children if raised by two men. As least they can teach them love and caring instead of bigotry.", 
   {
    "post_info": {
     "post_title": "Why straight men are afraid of gays"
    }
   }, 
   null, 
   null, 
   1089928320.0
  ], 
  [
   58237, 
   null, 
   "Jaaaman", 
   "I was thinking why straight men hate the idea of gay men existing in our society. Maybe its because they are insecure of their mascuility. It takes a real man to be touch with their feminity self. A straight man should feel good when a gay man checks him out. It means you are good-looking enough. Why would a gay man bother with a straight man that looks like a little boy with dirt under his nails and holes in the underwear just like grandpa. \n \n Gay men have money and power now a days. They deserve to marry and adop children. There is no damage to children if raised by two men. As least they can teach them love and caring instead of bigotry.\n\n And teach them that perversion is ok and morals don't apply to society anymore. Oh, I forgot moral priniciples were thrown out the window 50 years ago. Silly me. emoticon_cry", 
   {}, 
   58227, 
   null, 
   1089930300.0
  ], 
  [
   58240, 
   null, 
   "mana'ia", 
   "And teach them that perversion is ok and morals don't apply to society anymore. Oh, I forgot moral priniciples were thrown out the window 50 years ago. Silly me. emoticon_cry\n\n Don't respond to this. How is a woman going to tell a man what we think when they're generally indecisive.\n \n She doesn't even understand we're not afraid let alone why we're not afraid.", 
   {}, 
   58237, 
   null, 
   1089930480.0
  ], 
  [
   58241, 
   null, 
   "sinjin", 
   "I was thinking why straight men hate the idea of gay men existing in our society. Maybe its because they are insecure of their mascuility. It takes a real man to be touch with their feminity self. A straight man should feel good when a gay man checks him out. It means you are good-looking enough. Why would a gay man bother with a straight man that looks like a little boy with dirt under his nails and holes in the underwear just like grandpa. \n \n Gay men have money and power now a days. They deserve to marry and adop children. There is no damage to children if raised by two men. As least they can teach them love and caring instead of bigotry.\n\n \n My only difficulty with your post is that as a man I reject any assessment of appropriate maleness made by a female. I wouldn't presume to tell you what constitutes a \"real\" woman.", 
   {}, 
   58227, 
   null, 
   1089930540.0
  ], 
  [
   58242, 
   null, 
   "unkerpaulie", 
   "its not that anybody is afraid of gays. most gays i know are quiet submissive and not at all intimidating. its just that straight men disagree with gay ideals. its similar to the way republicans and democrats disagree, or athiests and christians. its not about fear, they just dont see eye to eye on what is a major and sensitive social issue", 
   {}, 
   58237, 
   null, 
   1089930600.0
  ], 
  [
   58247, 
   null, 
   "LadyOreo", 
   "its not that anybody is afraid of gays. most gays i know are quiet submissive and not at all intimidating. its just that straight men disagree with gay ideals. its similar to the way republicans and democrats disagree, or athiests and christians. its not about fear, they just dont see eye to eye on what is a major and sensitive social issue\n\n \n It's not about agreeing with gay men but respecting each other and not being a bigot. What is wrong with being gay or lesbian. As long as no one is getting hurt. What is the problem?", 
   {
    "post_info": {
     "post_title": "overall..."
    }
   }, 
   58242, 
   null, 
   1089931500.0
  ], 
  [
   58320, 
   null, 
   "Kronus", 
   "its not that anybody is afraid of gays. most gays i know are quiet submissive and not at all intimidating. its just that straight men disagree with gay ideals. its similar to the way republicans and democrats disagree, or athiests and christians. its not about fear, they just dont see eye to eye on what is a major and sensitive social issue\n\n \n Nope. As a straight man, the only disagreement I have with gay men is where I like to put my penis. And that's not even exactly true. They can do what they want with theirs, and I'll do what I like with mine. There's really no conflict at all. I don't care who someone else wants to have sex with anymore than I care if they like broccoli or not.\n \n I really don't know why some stright men ( and not all striaght men, could we please make that distinction here?) feel enough anger towards gays to resort to violence and other forms of agression. I can only guess that it's some sort of learned behavior, picked up from the general homophobia that's out there.", 
   {}, 
   58242, 
   null, 
   1089948420.0
  ], 
  [
   58335, 
   null, 
   "weasel fierce", 
   "Im a straight guy and a stubborn supporter of gay rights. \n \n So eh.", 
   {}, 
   58320, 
   null, 
   1089953160.0
  ], 
  [
   58342, 
   null, 
   "SilentPoet", 
   "I was thinking why straight men hate the idea of gay men existing in our society.\n\n \n Your sterotype is too large. I am a hetrosexual male and am a supporter of gay rights. I am not afraid of homosexuals and do not hate the idea of gay men existing in our society.", 
   {}, 
   58335, 
   null, 
   1089955320.0
  ], 
  [
   58348, 
   null, 
   "JakeCJB", 
   "I was thinking why straight men hate the idea of gay men existing in our society. Maybe its because they are insecure of their mascuility. It takes a real man to be touch with their feminity self.\n\n \n Some of them aren't so secure with their straight identity. If they were secure, they'd realize that gay people have nothing to do with and are not threat to their straight person's lives, because they are not gay. However, some secretly long to be gay, but can't deal with that part of themselves. So they need society's disapproval and fear tactics against gay people(claim they are all diseased, etc), otherwise there wouldn't be anything stopping they themselves from being gay.\n \n Notice how some of the anti-gay debaters in this forum, talk about the need for people to make an effort to be straight(if you really are straight it shouldn't require an effort), and that being gay is only a way of acting or behaving?", 
   {}, 
   58227, 
   null, 
   1089956400.0
  ], 
  [
   58385, 
   null, 
   "unkerpaulie", 
   "It's not about agreeing with gay men but respecting each other and not being a bigot. What is wrong with being gay or lesbian. As long as no one is getting hurt. What is the problem?\n\n like i said, the same could be said about the contempt evolutionist hold for creationists or republicans for democrats. none of these ideals are hurting the other person, yet people get very defensive about their beliefs and ideals no matter what its about. as long as there's dogma, theres gonna be heated disagreement, unfortunately to the point of violence in some cases", 
   {}, 
   58247, 
   null, 
   1089987420.0
  ], 
  [
   58407, 
   null, 
   "sinjin", 
   "We all have a threshold:\n \n How many straight men would be completely comfortable to find out that their fishing buddy who they respect and who's company they thoroughly enjoy has a \"crush\" on them and fantasizes about having sex with them regularly?\n Would you fish and sleep in the same tent with them again? \n \n Just supposin'", 
   {}, 
   58385, 
   null, 
   1089994980.0
  ], 
  [
   58413, 
   null, 
   "Kronus", 
   "We all have a threshold:\n \n How many straight men would be completely comfortable to find out that their fishing buddy who they respect and who's company they thoroughly enjoy has a \"crush\" on them and fantasizes about having sex with them regularly?\n Would you fish and sleep in the same tent with them again? \n \n Just supposin'\n\n \n Me, for one. I had a gay housemate, and we went camping together. Three days in the same tent, no problems. And, in the interest of full disclosure, he had said some time before that that if I ever wanted to \"experiment\" he'd be willing to help. I don't know if he was actively fantasizing during the camping trip or not, nor did I care. He knew I wasn't interested in sex, and so that was that.", 
   {}, 
   58407, 
   null, 
   1089995880.0
  ], 
  [
   58424, 
   null, 
   "jerichoholic104", 
   "I only know one guy who is totally anti-gay. He's a known idiot, bigot, and his opinion never counts for anything in any argument my circle of friends has. \n \n The rest of my friends are either supportive of gays, or are indifferent. I think it's mostly older guys (35+) who don't like '*****s'. The same type of people who think that Mexicans are \"stealing our jobs\". Some people are just too narrow minded for their own good.", 
   {}, 
   58413, 
   null, 
   1089998220.0
  ], 
  [
   58435, 
   null, 
   "LadyOreo", 
   "I only know one guy who is totally anti-gay. He's a known idiot, bigot, and his opinion never counts for anything in any argument my circle of friends has. \n \n The rest of my friends are either supportive of gays, or are indifferent. I think it's mostly older guys (35+) who don't like '*****s'. The same type of people who think that Mexicans are \"stealing our jobs\". Some people are just too narrow minded for their own good.\n\n \n Gays, lesbians and straights --- we are all the same. We should respect and learned from each other. Everyone is entitled to the same rights including marriage. That is not a special privilege but a right to marry the person you love. Gays and lesbians should be treated equally in this society. I don't understand why people are afraid of gay marriages. Why question love.", 
   {
    "post_info": {
     "post_title": "Peace within people"
    }
   }, 
   58424, 
   null, 
   1090001520.0
  ], 
  [
   58438, 
   null, 
   "fisher_of_man", 
   "It's not about agreeing with gay men but respecting each other and not being a bigot. What is wrong with being gay or lesbian. As long as no one is getting hurt. What is the problem?\n\n \n ahh...the American catch-phrase....what's wrong with _______ (you fill in the blank) as long as no one is getting hurt. \n \n does the hurt have to be physical? Or does emotional, spiritual, and intellectual hurt count too? \n \n and I think the question actually boils down to: \n \n Do they want my acceptance or my approval. I accept the fact that the gay lifestyle exist...I don't and won't approve of it. Its not natural.", 
   {}, 
   58247, 
   null, 
   1090002120.0
  ], 
  [
   58445, 
   null, 
   "unkerpaulie", 
   "ahh...the American catch-phrase....what's wrong with _______ (you fill in the blank) as long as no one is getting hurt. \n \n does the hurt have to be physical? Or does emotional, spiritual, and intellectual hurt count too? \n \n and I think the question actually boils down to: \n \n Do they want my acceptance or my approval. I accept the fact that the gay lifestyle exist...I don't and won't approve of it. Its not natural.\n\n i have to disagree with the point of hurt=wrong (even though i know you didnt state that, but some people use that as their guide). without hurt, pain or restrictions, how would anybody know whats right. somebody asks \"why does pain exist?\" and it was explained that experiencing pain is a vital function of the human body and it protects us from very harmful and damagaing consequences. furthermore, what good would it be for, say, a parent to give their child every thing he wants just so that he wouldnt cry?", 
   {}, 
   58438, 
   null, 
   1090003620.0
  ], 
  [
   58447, 
   null, 
   "Kronus", 
   "ahh...the American catch-phrase....what's wrong with _______ (you fill in the blank) as long as no one is getting hurt. \n \n does the hurt have to be physical? Or does emotional, spiritual, and intellectual hurt count too? \n \n and I think the question actually boils down to: \n \n Do they want my acceptance or my approval. I accept the fact that the gay lifestyle exist...I don't and won't approve of it. Its not natural.\n\n \n Those other types of hurt count as well. However, I notice you don't address any of them. Instead you pull out the \"it's not natural\" argument, which is a pretty weak arguement.\n \n Either we're natural creatures, in which case any urge, even homosexulaity, is natural and therefore fine, or we're unnatural, in which case your argument would mean we need to stop wearing clothes and living in houses to \"stop being unnatural\" Either way you're just throwing around a vague term without justification.", 
   {}, 
   58438, 
   null, 
   1090003980.0
  ], 
  [
   58448, 
   null, 
   "apathy", 
   "The feeling a straight man feels when a gay man is hitting on him is the same feeling a straight woman feels when a lesbian hits on her (or a man she doesn't like). The feeling is usually just, \"i wish you'd go away.\"", 
   {}, 
   58447, 
   null, 
   1090004160.0
  ], 
  [
   58449, 
   null, 
   "Kronus", 
   "The feeling a straight man feels when a gay man is hitting on him is the same feeling a straight woman feels when a lesbian hits on her (or a man she doesn't like). The feeling is usually just, \"i wish you'd go away.\"\n\n \n Not necessarily. I've been hit on by men, and it was kind of flattering. They were polite, and went away when I said no, so no big deal.", 
   {}, 
   58448, 
   null, 
   1090004460.0
  ], 
  [
   58452, 
   null, 
   "LadyOreo", 
   "Not necessarily. I've been hit on by men, and it was kind of flattering. They were polite, and went away when I said no, so no big deal.\n\n \n I agree with Kronus..I am flattered when a gay man thinks I am attractive. Being gay and lesbian is not a choice. No one wakes up and saids I want to lead a hard life.", 
   {}, 
   58449, 
   null, 
   1090004760.0
  ], 
  [
   58453, 
   null, 
   "bmans301bIMBACK", 
   "Gays, lesbians and straights --- we are all the same. We should respect and learned from each other. Everyone is entitled to the same rights including marriage. That is not a special privilege but a right to marry the person you love. Gays and lesbians should be treated equally in this society. I don't understand why people are afraid of gay marriages. Why question love.\n\n \n \n \n A right to marry the person you love? What if you love your sister? You can't do that because the kids will be messed up. If you're gay or lesbian, you can't even have kids, so you're almost in the same boat. What if I want to marry my cat, who I \"love\"? They should be treated equally I agree, but everyone has the right to dislike or hate gays/lesbians/homosexuals. It is not natural. Adam didn't go around looking for a guy to tap his turds (aka put it in his butt). It was Adam and Eve, not Adam and Steve. If it was \"natural\", you would be able to reproduce. If it was natural, men could have children. Sorry to all you gays/lesbians/homosexuals, but it just wasn't meant to be. It is the same as people hating arrogant people, loud people, athletes, etc. I personally hate gays/lesbians/homosexuals with a passion, and I have the right to, just as they have the right to hate heterosexuals.", 
   {}, 
   58435, 
   null, 
   1090005060.0
  ], 
  [
   58455, 
   null, 
   "Anastasia", 
   "Tapping turds? For a guy who is so smart that's the best you can do?\n and why do so many have to equate beastiality to homosexuality?\n hate is a pretty strong word, I feel sorry for the family member that might one day come out of the closet....", 
   {}, 
   58453, 
   null, 
   1090005300.0
  ], 
  [
   58456, 
   null, 
   "LadyOreo", 
   "A right to marry the person you love? What if you love your sister? You can't do that because the kids will be messed up. If you're gay or lesbian, you can't even have kids, so you're almost in the same boat. What if I want to marry my cat, who I \"love\"? They should be treated equally I agree, but everyone has the right to dislike or hate gays/lesbians/homosexuals. It is not natural. Adam didn't go around looking for a guy to tap his turds (aka put it in his butt). It was Adam and Eve, not Adam and Steve. If it was \"natural\", you would be able to reproduce. If it was natural, men could have children. Sorry to all you gays/lesbians/homosexuals, but it just wasn't meant to be. It is the same as people hating arrogant people, loud people, athletes, etc. I personally hate gays/lesbians/homosexuals with a passion, and I have the right to, just as they have the right to hate heterosexuals.\n\n This is why the world will never improve. Everyone has the right to hate something they are afraid of. I hate ignornant people who need to quote from the Bible to feel secure on their point of views. Homosexuals don't hate heterosexuals but feel sorry for them for feeling hate. It's very ironic... using the Bible to defend Adam and Eve yet God is not hateful. He or She Or It does not teach to hate our brothers and sisters but to embrace everyone. No can call themselves Christians if they hate.", 
   {
    "post_info": {
     "post_title": "This is why the world is ruined"
    }
   }, 
   58453, 
   null, 
   1090005420.0
  ], 
  [
   58461, 
   null, 
   "sinjin", 
   "Me, for one. I had a gay housemate, and we went camping together. Three days in the same tent, no problems. And, in the interest of full disclosure, he had said some time before that that if I ever wanted to \"experiment\" he'd be willing to help. I don't know if he was actively fantasizing during the camping trip or not, nor did I care. He knew I wasn't interested in sex, and so that was that.\n\n \n You big tease you. emoticon_xlove", 
   {}, 
   58413, 
   null, 
   1090006260.0
  ], 
  [
   58462, 
   null, 
   "Kronus", 
   "You big tease you. emoticon_xlove\n\n \n Well, he knew how I felt before we went on the trip. It's not my fault that I have this sexual magnetism that no one can resist! :p", 
   {}, 
   58461, 
   null, 
   1090006920.0
  ], 
  [
   58475, 
   null, 
   "fisher_of_man", 
   "Those other types of hurt count as well. However, I notice you don't address any of them. Instead you pull out the \"it's not natural\" argument, which is a pretty weak arguement.\n \n Either we're natural creatures, in which case any urge, even homosexulaity, is natural and therefore fine, or we're unnatural, in which case your argument would mean we need to stop wearing clothes and living in houses to \"stop being unnatural\" Either way you're just throwing around a vague term without justification.\n\n \n Your right...I didn't expand on those others....but in all reality, I think those are problaby the ones that are affected most by the homosexual/gay lifestyle. but as bmans301bIMBACK so eloquently emoticon_xdonno put it, its not the way things were intended to work. \n \n you know, just like electrical outlets were intended for your fingers or anything else...you can still stick stuff in there, but it doesn't work like is supposed to. Only when the plug hits the outlet is the connection made that gives power. \n \n \n while I agree that just because something hurts doesn't mean its wrong, just because something doesn't hurt doesn't mean its not wrong. \n \n LadyOreo....what's wrong with child porn...as long as nobody gets hurt? I mean as long as they take care of the children...you know give them all the toys and clothes and food they need and want...what difference does it make of someone takes their picture? \n \n I for one think that Americans have sat by far too long using the \"as long as nobody gets hurt\" phrase to cover up their laziness/inability to act on matters that need their attention. Same is true of \"as long as it doesn't concern me\".....wake up, there is reason to be concerned, there are people being hurt physically, emotional, intellecually and spiritually. But for those on the outside of these issues, its a lot harder to see...for those on the outside, you may never know the pain and hurt those involved feel. So...the natural argument may be weak to some of you....but not anymore so than the \"as long as nobody gets hurt\" argument.", 
   {}, 
   58447, 
   null, 
   1090010400.0
  ], 
  [
   58476, 
   null, 
   "bmans301bIMBACK", 
   "This is why the world will never improve. Everyone has the right to hate something they are afraid of. I hate ignornant people who need to quote from the Bible to feel secure on their point of views. Homosexuals don't hate heterosexuals but feel sorry for them for feeling hate. It's very ironic... using the Bible to defend Adam and Eve yet God is not hateful. He or She Or It does not teach to hate our brothers and sisters but to embrace everyone. No can call themselves Christians if they hate.\n\n \n \n Beastiality is the act of having sexual intercourse with an animal. I said marrying a cat, not having sex with a cat. Get your stuff straight. So just because homos don't hate heteros, that means I can't hate homos? I never said God was hateful. I never said he condoned hate. I don't really care, but I will tell you one thing, I do not like gays/lesbians/homos and I think they are sick and the scum of the earth. That's my opinion, and it will never change. I also never said he taught us to hate; he also didn't teach women to go down on other women or guys to take it in the rear from other guys. We can still embrace gays, that doesn't mean we have to allow them to get married. I never said I was Christian, so don't go assuming things. According to your views, you aren't a Christian either because you hate ignorant people and \"no one can call themselves Christians if they hate\" (i rewrote it because your grammar was putrid).", 
   {}, 
   58456, 
   null, 
   1090010700.0
  ], 
  [
   58477, 
   null, 
   "bmans301bIMBACK", 
   "Tapping turds? For a guy who is so smart that's the best you can do?\n and why do so many have to equate beastiality to homosexuality?\n hate is a pretty strong word, I feel sorry for the family member that might one day come out of the closet....\n\n \n \n I feel sorry for the family member who comes out of the closet too.", 
   {}, 
   58455, 
   null, 
   1090010700.0
  ], 
  [
   58480, 
   null, 
   "fisher_of_man", 
   "I feel sorry for the family member who comes out of the closet too.\n\n \n it will make the reunions very interesting emoticon_xdonno", 
   {}, 
   58477, 
   null, 
   1090011120.0
  ], 
  [
   58499, 
   null, 
   "TheoMorphic", 
   "but really, what's wrong with hating homosexuals? to continue with the \"as long as no one gets hurt\"... or more specifically \"as long as you don't take away the rights of others\" it should be ok. \n \n \n There is fundamentally nothing wrong with thinking gay people are scum of the earth, and immoral... there's nothing wrong with telling that to other people as well. There is nothing wrong with seeking out gay people and trying to tell them how they should and should not be behaving.\n \n \n but as soon as an individual infringes on that gay person's rights, that's where the line is drawn. People don't have to be protected from hurtful or bigoted speech. If free speech is actually guaranteed, then it's pretty much a given that you will hear things you don't like.", 
   {}, 
   58480, 
   null, 
   1090014600.0
  ], 
  [
   58507, 
   null, 
   "apathy", 
   "Wasn't there a Village People song call \"Fisher of Men\" ??\n \n Just kidding.. ;)", 
   {}, 
   58480, 
   null, 
   1090017240.0
  ], 
  [
   58511, 
   null, 
   "fisher_of_man", 
   "Wasn't there a Village People song call \"Fisher of Men\" ??\n \n Just kidding.. ;)\n\n \n \n emoticon_frazzled ouch....the village people....really :xbanghead", 
   {}, 
   58507, 
   null, 
   1090018080.0
  ], 
  [
   58513, 
   null, 
   "LadyOreo", 
   "The bottom line is this is world isn't getting better or maybe it is only the United States. People will always hate and people will always be teased for who they are. I am just happy there are some open-minded people with big hearts. I will always be gay. Very simple. I am happy and no one can take that away.", 
   {
    "post_info": {
     "post_title": "bottom line"
    }
   }, 
   58511, 
   null, 
   1090018440.0
  ], 
  [
   58516, 
   null, 
   "Kronus", 
   "The bottom line is this is world isn't getting better or maybe it is only the United States. People will always hate and people will always be teased for who they are. I am just happy there are some open-minded people with big hearts. I will always be gay. Very simple. I am happy and no one can take that away.\n\n \n I wouldn't be that pessimistic. People used to get burned at the stake. Lynchings used to be common. Now gays can get married in Massacusetts. It may be slow, but progress is definately being made.", 
   {}, 
   58513, 
   null, 
   1090018860.0
  ], 
  [
   58519, 
   null, 
   "bmans301bIMBACK", 
   "The bottom line is this is world isn't getting better or maybe it is only the United States. People will always hate and people will always be teased for who they are. I am just happy there are some open-minded people with big hearts. I will always be gay. Very simple. I am happy and no one can take that away.\n\n \n \n The world won't get better either. There will always be people out there who hates gays. I will be one of them. If you want to be gay, then be gay. But you don't deserve to get married. Be happy", 
   {}, 
   58513, 
   null, 
   1090019820.0
  ], 
  [
   58522, 
   null, 
   "TheoMorphic", 
   "There will always be people out there who hates gays. I will be one of them. \n\n \n but you won't always be around...", 
   {}, 
   58519, 
   null, 
   1090021260.0
  ], 
  [
   58523, 
   null, 
   "Maribaza", 
   "The world won't get better either. There will always be people out there who hates gays. I will be one of them. If you want to be gay, then be gay. But you don't deserve to get married. Be happy\n\n \n How can you hate someone that you don't know? You are judging an entire community of people based on only one aspect of their lives? What would you do if you found out a close friend or relative was homosexual? Start hating them because of that one detail?", 
   {
    "post_info": {
     "post_title": "Hate?"
    }, 
    "unicode_changes_made": true
   }, 
   58519, 
   null, 
   1090021620.0
  ], 
  [
   58531, 
   null, 
   "LadyOreo", 
   "but you won't always be around...\n\n \n And maybe by then, gays and lesbians can get married in more states.", 
   {}, 
   58522, 
   null, 
   1090025460.0
  ], 
  [
   58542, 
   null, 
   "Maribaza", 
   "Do you hate murderers? Do you know them? That is judging an entire community based on only one aspect of their lives. I hate the whole gay thing in general. Choosing to be gay is just totally wrong in my mind, so I choose to hate those who live that life. I probably would limit my contact with someone in my family if I found out they were gay. My parents brought me up and taught me that was wrong, so I seriously hope nobody in my family chooses to be a ***.\n\n \n Ok you are being totally extreme. There is no comparison between murder and being gay. But since you asked, I try not to hate anyone. I disagree with many things that people do but that doesn't mean I hate them. I disagree with your beliefs, but that doesn't mean I hate you. I don't know you. I don't know your reasoning for feeling the way you do. Mainly I just feel sorry for you. Sorry that you have so much hate inside you. As far as hoping that nobody in your family \"chooses to be gay\".... Most people don't feel it is a choice. It is very hard being gay especially with people who feel the way you do in this world. Nobody would \"choose\" to be hated and discriminated against. If someone ever does come out to you, I hope that you will be more tolerant.", 
   {
    "post_info": {
     "post_title": "Hate?"
    }, 
    "unicode_changes_made": true
   }, 
   58523, 
   null, 
   1090027200.0
  ], 
  [
   58544, 
   null, 
   "LadyOreo", 
   "I, along with tons of other people, would turn over in their graves. I doubt it will ever happen. If the federal government decides to allow it and I am alive, I will probably move out of the country because then I will know it has turned to sh!t.\n\n \n I am sorry thats how you feel. If thats how you feel, then move. United States has enough small minded people living here. No one will miss you. By the way, why have not moved yet? Marriage is allowed in Mass.", 
   {
    "post_info": {
     "post_title": "Please move then"
    }
   }, 
   58531, 
   null, 
   1090027680.0
  ], 
  [
   58550, 
   null, 
   "Anastasia", 
   "I am sure he will find it hard to actually find somewhere that doesnt have a homosexual population....\n Maybe a deserted island, it will be easy to get votes there emoticon_idea", 
   {}, 
   58544, 
   null, 
   1090029840.0
  ], 
  [
   58569, 
   null, 
   "Ringu", 
   "I was thinking why straight men hate the idea of gay men existing in our society.\n \n You said, \"hate the idea\" or \"afraid\"?\n I am not afraid, but I hate the idea. Because man was created to be a hetero, that's why. If I see a gay, I don't have an impulse to run away from him but I don't have a desire to come talk to him unless he's already a friend. So no, it's not about fear, it's about disgust to everything abnormal (i.e. pedophiles, zoophiles etc.)\n \n \nMaybe its because they are insecure of their mascuility. It takes a real man to be touch with their feminity self.\n \n This is a pure form of speculation.\n \n \nA straight man should feel good when a gay man checks him out. It means you are good-looking enough.\n \n No, NOT SHOULD feel good. What a sick thought!? Why should I feel good when a MAN likes me? No, it repulses me. When a lady likes me, that means I am masculine or whatever, but when a man likes me... see, men like in other men not the same things that ladies like in men. You have very bad presuppositions, LadyOreo.\n \n \nWhy would a gay man bother with a straight man that looks like a little boy with dirt under his nails and holes in the underwear just like grandpa.\n \n Look, you are talking about a kind of man no one likes.... so you say all straight men are like that?\n \n \nGay men have money and power now a days.\n\n Money and power is not anything that makes one DESERVE anything, especially family and children.\n \n \nThey deserve to marry and adop children. There is no damage to children if raised by two men. As least they can teach them love and caring instead of bigotry.\n\n There are things way higher then money or power that makes man a good person, worthy to have a family and children. \n Yes, there is damage. Two men can only raise a boy that won't have a normal family and mother's love, what will be his idea of marriage then? A gay couple will clone gays. \n \"At least\" is a good reservation. What else? If they raise a loved child, yet deprived of woman's attention... gosh, I don't want to be that child.", 
   {}, 
   58227, 
   null, 
   1090045800.0
  ], 
  [
   58620, 
   null, 
   "JakeCJB", 
   "You said, \"hate the idea\" or \"afraid\"?\n I am not afraid, but I hate the idea. Because man was created to be a hetero, that's why.\n\n \n Obviously not all men.\n \n \nIf I see a gay, I don't have an impulse to run away from him but I don't have a desire to come talk to him unless he's already a friend.\n\n \n Why can't you talk to him?\n \n \nSo no, it's not about fear, it's about disgust to everything abnormal (i.e. pedophiles, zoophiles etc.)\n\n \n The things you list are crimes, with victims being harmed, and involve children or members of a different species. Disgust at anything that does not fit the statistical norm, would also limit one's heterosexual life. How can something be disgusting simply because it is outside the statistical norm?\n \n What is accepted as \"normal\" as a moral value in the context of human culture, changes, because human cultures change. People don't get married at age 12 at this point in our history, but there was a time when that was normal in the moral and statistical sense. \n \n \nThis is a pure form of speculation.\n \n \n No, NOT SHOULD feel good. What a sick thought!? Why should I feel good when a MAN likes me? No, it repulses me. When a lady likes me, that means I am masculine or whatever, but when a man likes me... see, men like in other men not the same things that ladies like in men. You have very bad presuppositions, LadyOreo.\n\n \n You just gave some backing to LadyOreo's point about it being a preceived threat to masculinity. If you are secure with being straight, I don't see why you would have such a strong reaction against it, what is the threat you perceive? He's not going to sexually assault you, that would be a different issue, and he can't make you gay. Aren't you presupposing, when you claim ladies don't like in other men the same things men like in other men? \n \n \nMoney and power is not anything that makes one DESERVE anything, especially family and children.\n\n \n Nor should have a hightened social status merely because one is heterosexually oriented, should make one necessarily deserve anything.\n \n \nYes, there is damage. Two men can only raise a boy that won't have a normal family and mother's love, what will be his idea of marriage then? A gay couple will clone gays.\n\n \n The fear here is that people can be made gay. No one can be made gay if he or she is straight and secure with his or her straight identity.\n \n \n\"At least\" is a good reservation. What else? If they raise a loved child, yet deprived of woman's attention... gosh, I don't want to be that child.\n\n \n There are many ways the child can have female influences in his or her life, even if the child has two dads.", 
   {}, 
   58569, 
   null, 
   1090093740.0
  ], 
  [
   58831, 
   null, 
   "LadyOreo", 
   "[QUOTE=Ringu]You said, \"hate the idea\" or \"afraid\"?\n I am not afraid, but I hate the idea. Because man was created to be a hetero, that's why. Two men can only raise a boy that won't have a normal family and mother's love, what will be his idea of marriage then? A gay couple will clone gays. \n \n A GAY AND LESBIAN COUPLE can raise a child. A straight couples doesn't make a child normal.... remember the divorce rate by hetero couples. Are you saying a single mom raising her son isn't normal? Being gay or lesbian doesn't clone gays. It is not a fad.", 
   {
    "post_info": {
     "post_title": "Gay children"
    }
   }, 
   58569, 
   null, 
   1090264680.0
  ], 
  [
   58863, 
   null, 
   "emclean", 
   "Little off the wall question. Is it &#8220;gay&#8221; for a hetro man to want, or like to &#8220;to tap her turds&#8221; of his female partner, or is that manly?\n \n as for fear, or hate the idea, nope, just want to be left alone. i would expect the same behavor that i give to another.", 
   {}, 
   58480, 
   null, 
   1090275660.0
  ], 
  [
   58872, 
   null, 
   "Kronus", 
   "Little off the wall question. Is it \"gay\" for a hetro man to want, or like to \"to tap her turds\" of his female partner, or is that manly?\n \n as for fear, or hate the idea, nope, just want to be left alone. i would expect the same behavor that i give to another.\n\n \n Two men having sex is gay, a man and a woman having sex is straight. Doesn't matter what they're doing.\n \n And did you really mean to imply that the opposite of gay is manly?", 
   {
    "unicode_changes_made": true
   }, 
   58863, 
   null, 
   1090276560.0
  ], 
  [
   58880, 
   null, 
   "Jaaaman", 
   "[QUOTE=LadyOreo]\nYou said, \"hate the idea\" or \"afraid\"?\n I am not afraid, but I hate the idea. Because man was created to be a hetero, that's why. Two men can only raise a boy that won't have a normal family and mother's love, what will be his idea of marriage then? A gay couple will clone gays. \n \n A GAY AND LESBIAN COUPLE can raise a child. A straight couples doesn't make a child normal.... remember the divorce rate by hetero couples. Are you saying a single mom raising her son isn't normal? Being gay or lesbian doesn't clone gays. It is not a fad.\n\n I disagree LadyOreo. We are harming our children's well-being by allowing gay marriages.\n \n Teenagers will also suffer from the effects of homosexuality. When you are a teenager, you want to try everything out. You are not very sure of yourself or what is good for you, and you long to be accepted by your peers. When you are not accepted, you start to wonder if something is wrong with you. You begin to explore different things in order to find an answer. Many young men have been led down to the path of homosexuality during this crisis time. The homosexual lifestyle leads to high rates of suicide, depression, HIV, drug abuse, STDs, and other pathogens. Gay marriage may cause children to think, \"I have another alternative if I get rejected from my girlfriend.\" Instead of training our children to resolve conflict and face their problems, we mess up their minds more by saying, \"we accept you and your wrong behavior as being ok.\" Instead of trying to give a child an alternative to solve a problem, we as parents and teachers should be teaching our children problem solving skills. How do you expect our children to be able to work with people if we don't teach them problem-solving skills?", 
   {
    "unicode_changes_made": true
   }, 
   58831, 
   null, 
   1090278840.0
  ], 
  [
   58881, 
   null, 
   "Ladywolf", 
   "I'm not sure why straight men seem to be so angry or hateful towards gays. At one time, I thought it was perhaps a learned behaviour. I don't really hang out with men unless they have a good soul and can love another human.\n \n It's sad to see all the people on this board who proclaim their hate for gays and lesbians. I don't think hate is productive, I think it holds us back as a spieces. It keeps us ensnared in our negative emotions.\n \n Although I am gay, I don't hate people who claim to hate me because I'm gay. I am just me, who I am, who I was created to be.\n \n My biggest hope someday, is that we all learn and practice more compassion, empathy, teamwork regardless of others being different than ourselves.\n \n One of the saddest things I think we can do as human beings, is to teach our children and others we care about to hate.", 
   {
    "post_info": {
     "post_title": "Why straight men are afraid of gays"
    }
   }, 
   58880, 
   null, 
   1090279860.0
  ], 
  [
   58884, 
   null, 
   "CAN'TholdMEdown", 
   "I'm not sure why straight men seem to be so angry or hateful towards gays. At one time, I thought it was perhaps a learned behaviour. I don't really hang out with men unless they have a good soul and can love another human.\n \n It's sad to see all the people on this board who proclaim their hate for gays and lesbians. I don't think hate is productive, I think it holds us back as a spieces. It keeps us ensnared in our negative emotions.\n \n Although I am gay, I don't hate people who claim to hate me because I'm gay. I am just me, who I am, who I was created to be.\n \n My biggest hope someday, is that we all learn and practice more compassion, empathy, teamwork regardless of others being different than ourselves.\n \n One of the saddest things I think we can do as human beings, is to teach our children and others we care about to hate.\n\n \n \n Being gay is one's choice and lifestyle. Just as some may hate people who choose to ruin their lives with drugs and alcohol (their choice and lifestyle), some may choose to hate gays (their choice and lifestyle). So I believe someone has the right to hate someone because of their choices and lifestyles.", 
   {}, 
   58881, 
   null, 
   1090280280.0
  ], 
  [
   58885, 
   null, 
   "Waxy", 
   "I disagree LadyOreo. We are harming our children's well-being by allowing gay marriages.\n \n Teenagers will also suffer from the effects of homosexuality. When you are a teenager, you want to try everything out. You are not very sure of yourself or what is good for you, and you long to be accepted by your peers. When you are not accepted, you start to wonder if something is wrong with you. You begin to explore different things in order to find an answer. Many young men have been led down to the path of homosexuality during this crisis time. The homosexual lifestyle leads to high rates of suicide, depression, HIV, drug abuse, STDs, and other pathogens. Gay marriage may cause children to think, \"I have another alternative if I get rejected from my girlfriend.\" Instead of training our children to resolve conflict and face their problems, we mess up their minds more by saying, \"we accept you and your wrong behavior as being ok.\" Instead of trying to give a child an alternative to solve a problem, we as parents and teachers should be teaching our children problem solving skills. How do you expect our children to be able to work with people if we don't teach them problem-solving skills?\n\n \n Have you always been part of the \"in crowd\" Jaaaman?\n \n Have you ALWAYS been accepted?\n \n If you're human, the answer to both those questions is no.\n \n Given that, did you begin to explore homosexuality? That's the obvious thing to do right?\n \n Have you ever broken up with a girlfriend?\n \n Did you then think about \"going gay\"? It's a simple choice right? A guy breaks up with his girlfriend and just decides one day he's going to date and have sex with other men. \n \n Who knows, you might decide to make that choice tomorrow.\n \n You should put some of the so called \"problem solving skills\" you were taught to work before you post. emoticon_rolleyes \n \n Waxy", 
   {
    "unicode_changes_made": true
   }, 
   58880, 
   null, 
   1090280580.0
  ], 
  [
   58887, 
   null, 
   "JakeCJB", 
   "Being gay is one's choice and lifestyle. Just as some may hate people who choose to ruin their lives with drugs and alcohol (their choice and lifestyle), some may choose to hate gays (their choice and lifestyle). So I believe someone has the right to hate someone because of their choices and lifestyles.\n\n \n Being gay is being attracted to men or to women. If this is like drugs and alcohol, then being straight, also an attraction to men or to women, can be equated to drugs and alcohol as well.", 
   {}, 
   58884, 
   null, 
   1090281840.0
  ], 
  [
   58891, 
   null, 
   "Kronus", 
   "Being gay is one's choice and lifestyle. Just as some may hate people who choose to ruin their lives with drugs and alcohol (their choice and lifestyle), some may choose to hate gays (their choice and lifestyle). So I believe someone has the right to hate someone because of their choices and lifestyles.\n\n \n Well, you're wrong. You may be allowed to hate anyone you like, but it isn't a right, and you definately don't have the right to act on that hatred. Hating someone for being gay is about the same as hating someone for liking hotdogs more than hamburgers. You can do it if you want, but don't pretend it's acceptable.", 
   {}, 
   58884, 
   null, 
   1090286220.0
  ], 
  [
   58893, 
   null, 
   "CAN'TholdMEdown", 
   "Well, you're wrong. You may be allowed to hate anyone you like, but it isn't a right, and you definately don't have the right to act on that hatred. Hating someone for being gay is about the same as hating someone for liking hotdogs more than hamburgers. You can do it if you want, but don't pretend it's acceptable.\n\n \n You can hate whoever you want, and it is a right. It is not against the law to hate anyone. Acting on that hatred is different. I never said anything about acting on it. Who exactly, in your view, determines if it's acceptable to hate gays? Because in my mind and many others' it is ok. I don't think acting on it is right, but you have the right to hate gays or straights...it's a lifestyle, not a rce/ethnicity.", 
   {}, 
   58891, 
   null, 
   1090288800.0
  ], 
  [
   58894, 
   null, 
   "Kronus", 
   "You can hate whoever you want, and it is a right. \n\n \n Just because something isn't forbidden doesn't mean it's a guaranteed right. Show me any law, and phrase in the constitution, that guarantees you the right to hate. There is none. Emotions aren't regulated, no one will tell you you can't hate, but it isn't a legal right.", 
   {}, 
   58893, 
   null, 
   1090290120.0
  ], 
  [
   58899, 
   null, 
   "CAN'TholdMEdown", 
   "Just because something isn't forbidden doesn't mean it's a guaranteed right. Show me any law, and phrase in the constitution, that guarantees you the right to hate. There is none. Emotions aren't regulated, no one will tell you you can't hate, but it isn't a legal right.\n\n \n \n There are no laws against it, therefore it is legal. There is no law that says you can't drink milk out of the jug, but it is legal. If they wanted it to be illegal, there would be a law. There's not emoticon_ic", 
   {}, 
   58894, 
   null, 
   1090291020.0
  ], 
  [
   58988, 
   null, 
   "Waxy", 
   "There are no laws against it, therefore it is legal. \n\n \n Actually, there are a lot of laws regarding \"hate\", and they carry severe penalties.\n \n Waxy", 
   {}, 
   58899, 
   null, 
   1090342080.0
  ], 
  [
   58997, 
   null, 
   "CAN'TholdMEdown", 
   "Actually, there are a lot of laws regarding \"hate\", and they carry severe penalties.\n \n Waxy\n\n \n \n Against \"hate crimes\", not hate. Check that out. How would they decide if someone hated someone? What exactly defines hate? There are 0 laws banning hate, but there are some banning acting on that hate. Sorry emoticon_emb", 
   {}, 
   58988, 
   null, 
   1090343100.0
  ], 
  [
   59000, 
   null, 
   "Kronus", 
   "There are no laws against it, therefore it is legal. \n\n \n I never said it wan't legal, I said it wasn't a legal right. Go grab a dictionary and then come back when you understand what the terms mean.", 
   {}, 
   58899, 
   null, 
   1090343580.0
  ], 
  [
   59001, 
   null, 
   "CAN'TholdMEdown", 
   "I never said it wan't legal, I said it wasn't a legal right. Go grab a dictionary and then come back when you understand what the terms mean.\n\n \n \n If it's not illegal, then it's legal. If it's legal to do that, it's a legal right. Acting on that is not a legal right. Why would I need a dictionary? I was right emoticon_ic", 
   {}, 
   59000, 
   null, 
   1090343760.0
  ], 
  [
   59002, 
   null, 
   "Kronus", 
   "If it's not illegal, then it's legal. If it's legal to do that, it's a legal right. Acting on that is not a legal right. Why would I need a dictionary? I was right emoticon_ic\n\n \n Yes, why consult a standard reference that might refute a conclusion you reached in ignorance? At least we all know how deep your commitment to intellectual honesty is now.", 
   {}, 
   59001, 
   null, 
   1090344060.0
  ], 
  [
   59004, 
   null, 
   "CAN'TholdMEdown", 
   "Yes, why consult a standard reference that might refute a conclusion you reached in ignorance? At least we all know how deep your commitment to intellectual honesty is now.\n\n \n \n Just because I was right doesn't mean that I am ignorant. You're just mad because I hate gays. Sorry emoticon_xhoho", 
   {}, 
   59002, 
   null, 
   1090344240.0
  ], 
  [
   59005, 
   null, 
   "Waxy", 
   "Against \"hate crimes\", not hate. Check that out. How would they decide if someone hated someone? What exactly defines hate? There are 0 laws banning hate, but there are some banning acting on that hate. Sorry emoticon_emb\n\n \n Nit pick all you want bmans301b, I'll let you and Kronus go back and forth on that one.\n \n The simple fact is -\n \n crime = punishment\n crime + hate = severe punishment\n \n Therefore, I'd say that hate plays a role wouldn't you?\n \n Honestly, I'm not sure how they determine whether or not \"hate\" was a factor in the commision of a crime.\n \n However, the point is, whether or not \"hate\" can be proven as part of a crime carries a lot of weight. The simple fact that someone hates, or has a history of hate, carries significant weight in the eyes of the law. \n \n Hate is not \"embraced\" by our culture in any way, and while it may not be technically illegal, it can carry with it some dire consequences.\n \n Waxy", 
   {}, 
   58997, 
   null, 
   1090344360.0
  ], 
  [
   59006, 
   null, 
   "CAN'TholdMEdown", 
   "Nit pick all you want bmans301b, I'll let you and Kronus go back and forth on that one.\n\n \n \n First off, what is bmans301b?\n \n \n \n \nThe simple fact is -\n \n crime = punishment\n crime + hate = severe punishment\n \n Therefore, I'd say that hate plays a role wouldn't you?\n\n \n Yes it plays a role, therefore a hate crime is illegal. But hate in and of itself isn't. Here's an equation for you:\n \n owning a gun=legal\n owning a gun and committing a crime with a gun=illegal\n \n Just because you hate someone, doesn't mean you are going to kill them. I hate some people, but I haven't committed crimes against them.\n \n \n \nHate is not \"embraced\" by our culture in any way, and while it may not be technically illegal, it can carry with it some dire consequences.\n \n\n \n \n How do you know? Did you do a poll? What consequences does it carry? Do you hate snakes? Hate is hate, there's no other way to put it. If you think hating gays is wrong, then so is hating cell phones. Is it a hate crime to break your cell phone if you hate it?", 
   {}, 
   59005, 
   null, 
   1090344900.0
  ], 
  [
   59007, 
   null, 
   "CAN'TholdMEdown", 
   "And about the title of this thread \"Why straight men are afraid of gays\". I am straight (thank God) and by no means am I afraid of a gay man. However, I do not like them. If one approached me, I would simply walk away. If one tried to hit on me and touched me, I think I would probably hit him. Most straight guys aren't scared; they just think the whole thing is sick and don't want to be around anyone like that.", 
   {}, 
   59005, 
   null, 
   1090345500.0
  ], 
  [
   59009, 
   null, 
   "Waxy", 
   "First off, what is bmans301b?\n\n \n Cute.\n \n \nYes it plays a role, therefore a hate crime is illegal. But hate in and of itself isn't. Here's an equation for you:\n \n owning a gun=legal\n owning a gun and committing a crime with a gun=illegal\n\n \n Again, cute, but apples and oranges.\n \n Try this one -\n \n commiting a crime = punishment\n using a gun + commiting a crime = severe punishment \n \n \nHow do you know? Did you do a poll? What consequences does it carry? Do you hate snakes? Hate is hate, there's no other way to put it. If you think hating gays is wrong, then so is hating cell phones. Is it a hate crime to break your cell phone if you hate it?\n\n \n You think I need to post a poll to prove that society generally doesn't approve of hate? You're kidding right? Or are you just goofing off because you couldn't come up with a reasonable answer?\n \n If hate can be proven as a factor in a crime, it carries harsher penalties, it can even mean the difference between the death penalty and imprisonment.\n \n There's very little in this world that I hate. Hate is a VERY strong word, one that I don't ever use lightly. IMHO, too many people bandy the word about without considering it's true implications.\n \n I don't like snakes, but I certainly don't hate them. There's times when I really don't like my cell phone, but I don't hate cell phones. There are certain people that I don't like, but I can't think of anyone I know that I actually hate.\n \n The rest of your post is just nonsense.\n \n Waxy", 
   {}, 
   59006, 
   null, 
   1090345800.0
  ], 
  [
   59010, 
   null, 
   "Jaaaman", 
   "Have you always been part of the \"in crowd\" Jaaaman?\n \n Have you ALWAYS been accepted?\n \n If you're human, the answer to both those questions is no.\n \n Given that, did you begin to explore homosexuality? That's the obvious thing to do right?\n \n Have you ever broken up with a girlfriend?\n \n Did you then think about \"going gay\"? It's a simple choice right? A guy breaks up with his girlfriend and just decides one day he's going to date and have sex with other men. \n \n Who knows, you might decide to make that choice tomorrow.\n \n You should put some of the so called \"problem solving skills\" you were taught to work before you post. emoticon_rolleyes \n \n Waxy\n\n Its more than that Waxy. \n Same-sex familys will teach little boys and girls that husband/wife and mother/father are merely optional for the family and therefore, meaningless.\n I will never allow my children or grandchildren (if I ever have any) to be taught that their gender doesn't matter for the family. Their masculinity and femininity matter far too much, as does everyone elses.", 
   {
    "unicode_changes_made": true
   }, 
   58885, 
   null, 
   1090346040.0
  ], 
  [
   59013, 
   null, 
   "Waxy", 
   "Its more than that Waxy. \n Same-sex familys will teach little boys and girls that husband/wife and mother/father are merely optional for the family and therefore, meaningless.\n I will never allow my children or grandchildren (if I ever have any) to be taught that their gender doesn't matter for the family. Their masculinity and femininity matter far too much, as does everyone elses.\n\n \n Nice dodge.\n \n Being optional (and even granting you that point is a stretch) doesn't render something meaningless. Again, that's an absurd assertion.\n \n I hope for your sake and theirs that you don't have a homosexual child/grandchild, because it won't matter what you \"allow\".\n \n Waxy", 
   {
    "unicode_changes_made": true
   }, 
   59010, 
   null, 
   1090346400.0
  ], 
  [
   59015, 
   null, 
   "emclean", 
   "And did you really mean to imply that the opposite of gay is manly?\n \n\n no, it was a poor choice of words.\n \n why is it better for me to kill a hetro, than a homo? a \"hate crime\" is still a crime.", 
   {}, 
   59013, 
   null, 
   1090346820.0
  ], 
  [
   59017, 
   null, 
   "CAN'TholdMEdown", 
   "Cute.\n \n \n \n Again, cute, but apples and oranges.\n \n Try this one -\n \n commiting a crime = punishment\n using a gun + commiting a crime = severe punishment \n \n \n \n You think I need to post a poll to prove that society generally doesn't approve of hate? You're kidding right? Or are you just goofing off because you couldn't come up with a reasonable answer?\n \n If hate can be proven as a factor in a crime, it carries harsher penalties, it can even mean the difference between the death penalty and imprisonment.\n \n There's very little in this world that I hate. Hate is a VERY strong word, one that I don't ever use lightly. IMHO, too many people bandy the word about without considering it's true implications.\n \n I don't like snakes, but I certainly don't hate them. There's times when I really don't like my cell phone, but I don't hate cell phones. There are certain people that I don't like, but I can't think of anyone I know that I actually hate.\n \n The rest of your post is just nonsense.\n \n Waxy\n\n \n \n Still don't understand the bmans301 thing. What if someone killed your son/daughter? Would you hate them? You probably would need a poll to determine that. I just asked 5 people what they thought about hate, and all of them said it's your own prerogative. So just because you think it's bad, doesn't mean society thinks like you. I bet at least 50% of the US hates something, whether it be a car, a person, snow, a terrorist, or whatever else it may be. So it really isn't nonsense. Stop talking about hate crimes...that isn't the issue. I am talking about hate, which isn't illegal or nonsense. Do you hate it when you're proven wrong?", 
   {}, 
   59009, 
   null, 
   1090347480.0
  ], 
  [
   59018, 
   null, 
   "Kronus", 
   "\n why is it better for me to kill a hetro, than a homo? a \"hate crime\" is still a crime.\n\n \n Because there aren't alot of people out there saying \"Boy I hate those heteros, I think I'll go out and beat some to death.\" Whereas there are alot of people who do think that way about gays. Some people think it's alright to hate, and the government is trying to say \"no, it really isn't.\"", 
   {}, 
   59015, 
   null, 
   1090347540.0
  ], 
  [
   59029, 
   null, 
   "Ladywolf", 
   "Same-sex familys will teach little boys and girls that husband/wife and mother/father are merely optional for the family and therefore, meaningless.\n\n \n You do not know that same-sex families will teach children that mother/father are merely optional for the family and therefore meaningless. I think people are intelligent enough and enlightened enough to be able to know if they belong with men or with women regardless of the sex of their parents.\n \n Why such strong opionions on gay issues if you are not gay yourself? What happened that would cause you to feel this way? Wouldn't it be better if we all got along as human beings instead of focusing so much energy on gender and \"gender behaviors\"?\n \n I was also wondering, why is it that so many men who have issues with homosexuality, don't have a problem watching 2 women making love? It seems sick to me, but have been approached a lot when out with my fiance.", 
   {
    "post_info": {
     "post_title": "Why straight men are afraid of gays..."
    }
   }, 
   59010, 
   null, 
   1090349100.0
  ], 
  [
   59041, 
   null, 
   "Waxy", 
   "Still don't understand the bmans301 thing. What if someone killed your son/daughter? Would you hate them? You probably would need a poll to determine that. I just asked 5 people what they thought about hate, and all of them said it's your own prerogative. So just because you think it's bad, doesn't mean society thinks like you. I bet at least 50% of the US hates something, whether it be a car, a person, snow, a terrorist, or whatever else it may be. So it really isn't nonsense. Stop talking about hate crimes...that isn't the issue. I am talking about hate, which isn't illegal or nonsense. Do you hate it when you're proven wrong?\n\n \n I might, it would depend on the circumstances, I certainly wouldn't like them much. I think I'd be far more likely to simply wish that they face justice. \n \n Ask those same 5 people if they think society generally condones hate. (My exact words.) \n \n Ask them if they feel it's generally socially acceptable to hate a minority, hate children, hate old people, hate animals, whatever.\n \n Ask them whether they think society general feels love or hate is more socially acceptable. \n \n Your definition of hate is perilously broad IMHO, I don't believe a person can actually hate an inanimate object such as a car or snow. Maybe they really don't like snow, but to hate snow would mean that you've dedicated your life to the dislike of snow, and that the mere thought of snow makes you physically ill and furiously angry to the point where you wish to lash out against it. To hate snow would mean that you would like it wiped off the face of the earth permanently despite any negative consequences that may have, and that you dedicate your life to that effort. \n \n I don't think many people \"hate\" snow.\n \n Hate is a powerful emotion. It is largely irrational, driven by fear and ignorance, and is a counterproductive and destructive.\n \n I don't like being proven wrong, I'll let you know how I feel about it if you ever manage to do it.\n \n Waxy", 
   {}, 
   59017, 
   null, 
   1090350900.0
  ], 
  [
   59046, 
   null, 
   "Phunting", 
   "The problem here is that the word hate has several degrees of meaning, and is often used frivolously. CAN'TholdMEdown seems to be mixing both definitions together.\n \n I hate Beetroot. It's a foul vegetable that tastes disgusting.\n \n I would also hate anyone who harmed the people I love.\n \n Obviously these are to vastly different degrees, and equally obviously any debate is rendered meaningless when one uses them interchangeably.", 
   {}, 
   59041, 
   null, 
   1090351620.0
  ], 
  [
   59058, 
   null, 
   "fisher_of_man", 
   "I don't like being proven wrong, I'll let you know how I feel about it if you ever manage to do it.\n \n Waxy\n\n \n ba hahahahahahahahahahahahaha....ah...the waxy I know and have come to love hasn't changed one bit! emoticon_xgood", 
   {}, 
   59041, 
   null, 
   1090353360.0
  ], 
  [
   59104, 
   null, 
   "LadyOreo", 
   "And about the title of this thread \"Why straight men are afraid of gays\". I am straight (thank God) and by no means am I afraid of a gay man. However, I do not like them. If one approached me, I would simply walk away. If one tried to hit on me and touched me, I think I would probably hit him. Most straight guys aren't scared; they just think the whole thing is sick and don't want to be around anyone like that.\n\n \n It is everyone's right to hate. But to hate is wasteful. It takes energy to hate. Why use the word hate. Why not say I don't like it or approve. Some straight men are afraid of the term \"gay.\" Hanging out with someone gay does not make you gay. It just makes you a person.", 
   {
    "post_info": {
     "post_title": "hate"
    }
   }, 
   59007, 
   null, 
   1090372080.0
  ], 
  [
   59258, 
   null, 
   "joebrummer", 
   "And about the title of this thread \"Why straight men are afraid of gays\". I am straight (thank God) and by no means am I afraid of a gay man. However, I do not like them. If one approached me, I would simply walk away. If one tried to hit on me and touched me, I think I would probably hit him. Most straight guys aren't scared; they just think the whole thing is sick and don't want to be around anyone like that.\n\n \n \n \n One: Gays have approached you thousands of times. You just didn't see it. For all you really know your last prostate exam at the Doctors was by a gay man. You mail may have been delivered by a gay man.\n \n Two: If a gay man hit on you, it is because he thinks you are attractive. You could try saying thank you but I am straight. Most gay men would respect that and say sorry I hope I didn't offend you. At which point you could say \"NO, I am flattered someone thinks I am attractive.\"", 
   {}, 
   59007, 
   null, 
   1090469700.0
  ], 
  [
   59269, 
   null, 
   "Sigma", 
   " \"NO, I am flattered someone thinks I am attractive.\"\n\n \n Heh, I wouldn't be flattered if I was found attractive by a member of the same sex.", 
   {}, 
   59258, 
   null, 
   1090476600.0
  ], 
  [
   59280, 
   null, 
   "JakeCJB", 
   "And about the title of this thread \"Why straight men are afraid of gays\". I am straight (thank God) and by no means am I afraid of a gay man. However, I do not like them. If one approached me, I would simply walk away. If one tried to hit on me and touched me, I think I would probably hit him. Most straight guys aren't scared; they just think the whole thing is sick and don't want to be around anyone like that.\n\n \n In order to avoid thoughts about his own homosexual desires and impulses a person becomes HOMOPHOBIC. In essence he is saying, \"Homosexual desires are sick or evil; I don't have such desires. Those people out there, who have homosexual desires, are sick or evil. I'm going to prove to you that I don't have such desires by showing you how hostile I am towards them, to the point of hurting them or killing them. I will show you how manly I am.\"\n http://www.apsa.org/pubinfo/hreflections.htm\n \n It may be a good idea to send a link to this thread, and perhaps to some others in this forum, to the American Psychoanalytic Association. Someone there may wish to study them.", 
   {}, 
   59007, 
   null, 
   1090487760.0
  ], 
  [
   59300, 
   null, 
   "Phunting", 
   "If one tried to hit on me and touched me, I think I would probably hit him.\nWhy? You claim you aren't scared so why would you feel the need to lash out?", 
   {}, 
   59007, 
   null, 
   1090508400.0
  ], 
  [
   59405, 
   null, 
   "Ringu", 
   "A GAY AND LESBIAN COUPLE can raise a child. A straight couples doesn't make a child normal.... remember the divorce rate by hetero couples. Are you saying a single mom raising her son isn't normal? Being gay or lesbian doesn't clone gays. It is not a fad.\n\n Well, I agree that they can raise a child, and that raising by a straight couple does not guarantee bringing up a normal child.\n \n But see, to answer your question, and JakeCB's questions, I say, that if a child in a gay couple is not gay (yet see, Jake was talking about a SECURE IDENTITY, but children DO NOT have a secure identity) then he'd RATHER be raised in in a NOT GAY family. You see the point? The NOT GAY child needs a mother and a father, not a father and a father or a mother and a mother, because this won't give him a GOOD model for his NOT GAY identity.\n \n As for statistics, see, because you don't have many gay marriages, you don't have much statistics on gay divorce. So if gay marriages ever become many (which I hope will not happen) you will see the true stats.\n \n To JakeCB:\n \n No, when I say that I hate the thought of a gay liking me (for my body and my masculinity) I am not proving a point, that gays are a threat to my masculinity. Absolutely not. You abuse this argument, it's not based on anything. See, there are two definitions. MASCULINITY and FEMININITY. For straight people masculine in men is liked by women, feminine in women is liked my men. So the prove of my masculinity is not that EVERYONE (both men and women) like me. For gays and lesbians yes, it is a prove, but well, for a zoofile, maybe the fact that a dog likes him, it's good. To me it's sick, that's it. Yes, I can say I like Brad Pitt. He's got a well built body. Am I a gay because I think so? Do I threaten him (even if he knew me)? I don't think so. So you use false arguments, sir. Just because you want to prove you point, you twist the reality and twist definitions. I don't respect that.", 
   {}, 
   58831, 
   null, 
   1090561980.0
  ], 
  [
   59412, 
   null, 
   "JakeCJB", 
   "Well, I agree that they can raise a child, and that raising by a straight couple does not guarantee bringing up a normal child.\n \n But see, to answer your question, and JakeCB's questions, I say, that if a child in a gay couple is not gay (yet see, Jake was talking about a SECURE IDENTITY, but children DO NOT have a secure identity) then he'd RATHER be raised in in a NOT GAY family. You see the point? The NOT GAY child needs a mother and a father, not a father and a father or a mother and a mother, because this won't give him a GOOD model for his NOT GAY identity.\n\n \n I'm sure he could very easily find hetero models elsewhere in the family, and on t.v., in books, and in other people. There is no proof that it will harm his being straight, or make him gay, having two gay dads. Even if it could actually make him gay, we would have to assume being gay is a bad thing. It is not. Most gay people were raised in homes with heterosexual parents.\n \n \nAs for statistics, see, because you don't have many gay marriages, you don't have much statistics on gay divorce. So if gay marriages ever become many (which I hope will not happen) you will see the true stats.\n\n \n Why don't you want them to be many? How will you have good stats then?\n \n \nTo JakeCB:\n \n No, when I say that I hate the thought of a gay liking me (for my body and my masculinity) I am not proving a point, that gays are a threat to my masculinity. Absolutely not. You abuse this argument, it's not based on anything.\n\n \n \nNo, NOT SHOULD feel good. What a sick thought!? Why should I feel good when a MAN likes me? No, it repulses me. When a lady likes me, that means I am masculine or whatever, but when a man likes me... see, men like in other men not the same things that ladies like in men. You have very bad presuppositions, LadyOreo.\n\n \n I don't see how I was abusing your argument. \n \n \nSee, there are two definitions. MASCULINITY and FEMININITY. For straight people masculine in men is liked by women, feminine in women is liked my men. So the prove of my masculinity is not that EVERYONE (both men and women) like me. For gays and lesbians yes, it is a prove, but well, for a zoofile, maybe the fact that a dog likes him, it's good. To me it's sick, that's it. Yes, I can say I like Brad Pitt. He's got a well built body. Am I a gay because I think so? Do I threaten him (even if he knew me)? I don't think so. So you use false arguments, sir. Just because you want to prove you point, you twist the reality and twist definitions. I don't respect that.\n\n \n I have no idea what you are on about. You're all over the place, please translate. Or do you even understand what you are talking about? You seem confused. You first say men don't like the same things in men that women like in men. Then you talk about how you can like Brad Pitt's well built body, a feature of his masculinity. You also call gays and lesbians \"sick\" for liking these same things involving masculinity and femininity. You would be very personally \"repulsed\" if a man liked in you what you as a man like in Brad Pitt. Where do dogs fit into all of this?", 
   {}, 
   59405, 
   null, 
   1090568400.0
  ], 
  [
   59428, 
   null, 
   "JakeCJB", 
   "Further, Ringu, your reactions are so strong. How does the mere thought that another man is attracted to you, impact you if you are straight, compelling you to react so strongly? Those are his personal thoughts which you call sick(!) etc., not yours, if you are in fact straight. If you really want us to believe you are straight, you shouldn't post such strong reactions which look so obviously like a defense mechanism against your own gay feelings.", 
   {}, 
   59412, 
   null, 
   1090588260.0
  ], 
  [
   59429, 
   null, 
   "Ringu", 
   "I'm sure he could very easily find hetero models elsewhere in the family, and on t.v., in books, and in other people.\n\n That is so not cool to read about models and see them on TV etc. and NOT see them in your own family. Look, if I extraggerate your view, it's enough to give a child a FAT manual which will teach him all things he;s got to know in life. So he doesn't need ANYONE else, not parents, not friends, only TV and computer. Cool, huh?\n \n \nThere is no proof that it will harm his being straight, or make him gay, having two gay dads.\n \n All you CARE about is PROOF???\n \n \nEven if it could actually make him gay, we would have to assume being gay is a bad thing.\n \n You suppose it's a game? If he happens to be gay then that, if he doesn't, then that's something else. You are talking abstract from REAL PEOPLE, children, individuals.\n \n \nWhy don't you want them to be many? How will you have good stats then?\n\n I don't want them to be many, sir. What are you talking about?\n \n \nI don't see how I was abusing your argument.\n\n You said, that what I said, proves LadyOreo's argument, which was not true.\n \n \nYou seem confused. You first say men don't like the same things in men that women like in men. Then you talk about how you can like Brad Pitt's well built body, a feature of his masculinity. You also call gays and lesbians \"sick\" for liking these same things involving masculinity and femininity. You would be very personally \"repulsed\" if a man liked in you what you as a man like in Brad Pitt. Where do dogs fit into all of this?\n\n No, I am talking not about like, but about lust. If ANYONE likes me in whatever way, I woudn't care, I'd actually be flattered. But if a gay likes my body and lusts after it, I'd be so repulsed.\n \n \nFurther, Ringu, your reactions are so strong. How does the mere thought that another man is attracted to you, impact you if you are straight, compelling you to react so strongly?\n\n Guess.\n \n After you say your guess, I will tell you.\n \n \nThose are his personal thoughts which you call sick(!) etc., not yours, if you are in fact straight. If you really want us to believe you are straight, you shouldn't post such strong reactions which look so obviously like a defense mechanism against your own gay feelings.\n\n Right, tell me more about my gay feelings. Where do you even come with this from??? Any straight, or what I call, normal man, has strong feeling aganst gays. Those who don't care -- they are in the middle. So you are WRONG, sir.", 
   {}, 
   59412, 
   null, 
   1090591440.0
  ], 
  [
   59538, 
   null, 
   "JakeCJB", 
   "That is so not cool to read about models and see them on TV etc. and NOT see them in your own family. Look, if I extraggerate your view, it's enough to give a child a FAT manual which will teach him all things he;s got to know in life. So he doesn't need ANYONE else, not parents, not friends, only TV and computer. Cool, huh?\n\n \n I was just pointing out that those models are everywhere. Many gay people grew up without even that. I think it is enough that parents love one another and the child, and are supportive.\n \n \nAll you CARE about is PROOF???\n\n \n My statement was factual. True heterosexuality isn't so fragile. No one can be made gay, unless they have those desires to begin with. No one can be made to be straight either, if that person is truely gay. \n \n \n \nI don't want them to be many, sir. What are you talking about?\n\n \n The more statistics of gay marriage you have, the better you will be able to judge gay marriage.\n \n \nNo, I am talking not about like, but about lust.\n\n \n Well, gays and lesbians lust after the masculine and feminine, as I believe you indicated straight people also lust after.\n \n \nBut if a gay likes my body and lusts after it, I'd be so repulsed.\n\n \n You are proving my points more with each post. Why do you have such a strong reaction a gay's personal feelings? How are the feelings themselves a perceived threat to you, if they are not a part of you, and if gay men don't have a role to play in your heterosexual life?\n \n \nGuess.\n \n After you say your guess, I will tell you.\n\n \n How a gay man's attraction impacts you? I can't think of a reason it would, or how it would, unless it is your own internalized homophobia, as I believe I explained.", 
   {}, 
   59429, 
   null, 
   1090622220.0
  ], 
  [
   59873, 
   null, 
   "jitobear", 
   "\n But see, to answer your question, and JakeCB's questions, I say, that if a child in a gay couple is not gay (yet see, Jake was talking about a SECURE IDENTITY, but children DO NOT have a secure identity) then he'd RATHER be raised in in a NOT GAY family. You see the point? The NOT GAY child needs a mother and a father, not a father and a father or a mother and a mother, because this won't give him a GOOD model for his NOT GAY identity.\n\n \n What are you blathering about? Just what exactly is GAY or NOT GAY identity? \n \n My son is absolutley THRIVING with a straight mom and a gay \"dad\". \n \n My son's father walked when he was three. He now has a male mentor and has had one for years. This man is extremely dedicated and committed (plans to help him buy fix car, saving for college, etc.) and is also gay.\n \n Let this parent tell you what a kid REALLY needs.\n \n Love. Respect. Discipline. Guidance. Hugs. Compliments. Your time. Good male and female role models. They DO NOT need anyone to guide them in their identities. They come with those, I assure you. They have mind-boggling personalities from day one - that just get richer and richer as they grow. One of the things that they figure out on their own one day is what turns them on. My son has already decided he likes dark-haired girls who can run fast and aren't to silly and giggly. All by himself he decided that.\n \n Kids need to learn how to be good people. To learn about respect, generousity, love, responsibility, hard work, kindness, courage, determination, patience, committment, etc. \n \n The last thing they need is to learn how to fit into some small minded stereotype of whatever being straight or gay means.\n \n I wouldn't trade his loser straight dad for his current gay mentor for a million bucks. Neither would he.\n \n It's funny. Every time I tell this story, the anti-gay crowd just sticks their fingers in their ears. Never mind letting my reality mess with their fantasy, I suppose.\n \n By the way - don't be so freaked if a gay guy finds you cute. If that is the case there is a dang good chance the broads think you are hot, too.", 
   {}, 
   59405, 
   null, 
   1090873800.0
  ], 
  [
   60070, 
   null, 
   "Ringu", 
   "My son is absolutley THRIVING with a straight mom and a gay \"dad\". \n\n How do you know he's THRIVING? It looks like he's thriving now? You know, some changes are slow and you can't just see them in 2 or 5 years. You'll see what he will tell you when he grows up. He may start hating you for depriving him, you just don't know what may happen later.\n \nMy son's father walked when he was three. He now has a male mentor and has had one for years. This man is extremely dedicated and committed (plans to help him buy fix car, saving for college, etc.) and is also gay.\n\n That does not mean anything.\n \nLet this parent tell you what a kid REALLY needs.\n\n No, not parent, but the child, if he knows. See, sometimes he does not have a choice, and so what he knows and likes is based only on his single-sided experience.\n \n \nLove. Respect. Discipline. Guidance. Hugs. Compliments. Your time. Good male and female role models.\n\n Where do you get the female role model if the couple is gay?!\n \n \nThey DO NOT need anyone to guide them in their identities.\n\n And so the don't need anyone to PERVERT them in their identities. \n \nThe last thing they need is to learn how to fit into some small minded stereotype of whatever being straight or gay means.\n\n There is a force of gravitation. It's not a stereotype, it's a law of nature. There are other laws that you can't label stereotypes. Male and female roles and identities is not some old school junk. You are just so wrong it this.\n \nI wouldn't trade his loser straight dad for his current gay mentor for a million bucks. Neither would he.\n\n Sick logic. There are also losser sucker gays. Or are gays perfect people in fact? Haha -- no way. It's just closing your eyes to the fact that gays can as well be loosers and jerks.\n \nIt's funny. Every time I tell this story, the anti-gay crowd just sticks their fingers in their ears. Never mind letting my reality mess with their fantasy, I suppose.\n\n Really? Don't you cover your eyes with your hands? Not want to see the reality? Stick to your perverted lifestyle and protect it, moreover, promote it?", 
   {}, 
   59873, 
   null, 
   1091002440.0
  ], 
  [
   60075, 
   null, 
   "Phunting", 
   "It's just closing your eyes to the fact that gays can as well be loosers and jerks... Don't you cover your eyes with your hands? Not want to see the reality? \nNobody has ever, ever on any of the numerous threads on this topic claimed that homosexuals are somehow 'better' than heteros. Of course everyone realises that there are many who are complete jerks. What we are trying to say is that there are also many who are capable of forming stable, loving and beneficial relationships. And that is what the anti crowd are disagreeing with.\n \n Just what reality are we closing our eyes to?", 
   {}, 
   60070, 
   null, 
   1091012760.0
  ], 
  [
   60099, 
   null, 
   "terral03", 
   "Greetings:\n \n Lady << Why straight men are afraid of gays\n \n Terral's reply << Perhaps you should include the word \"some\" before 'straight\" above. \n \n Lady << I was thinking why straight men hate the idea of gay men existing in our society. \n \n Terral's reply << Ditto. Our diverse society contains some normal folks on their way to gaydom or gay-doom. Those currently straight individuals do not hate the idea of homo's existing anywhere. \n \n Lady << Maybe its because they are insecure of their mascuility. \n \n Terral's reply << Maybe the answer is more simple than you imagine. Personally, I believe that anyone placing tags upon themselves to describe their deviant sexual behavior has a screw loose. For most normal men, the mental image of one man sodomizing another is just abnormal sick behavior. Even the most vile wild beasts of the world have better sense. \n \n Lady << It takes a real man to be touch with their feminity self. A straight man should feel good when a gay man checks him out. It means you are good-looking enough. \n \n Terral's reply << Good looking enough for what? \"My God man! You look good enough to sodomize!\" The natural function of sexual activity is for the bearing of children; for the perpetual replacement of our citizens upon this planet. It is through marriage and this physical/emotional/spiritual union that the two \"become one flesh.\" Genesis 2:24. It should be quite obvious to even the most casual observer that Homos perform their indecent acts for much different purposes indeed. \n \n Lady << Why would a gay man bother with a straight man that looks like a little boy with dirt under his nails and holes in the underwear just like grandpa. \n \n Terral's reply << What motivates a pervert to do anything? The 'in your face' attitude of our growing homo population will play out in many ways. They stalk potential victims along our coastlines in their thongs, annoying fishermen and beachgoers, under the pretense of being out to get some rays. But those who take notice can see the greedy perverted desire within them. Many are predators who victimize the young unfortunate ones among us, who seek some kind of financial security, or some quick fix answer to a seeming futile situation. \n \n Lady << Gay men have money and power now a days. They deserve to marry and adop children. \n \n Terral's reply << I would not know. Practically every person I knew from my youth who turned homo is now dead from aids. Anyone who would turn any child over to be raised by homos does not have the best interests of the child in mind. Every natural person on this planet came into existence through the joining of a father and a mother. Each and every one of them deserves the opportunity to be raised by normal folks. That simple truth should go without saying.\n \n Lady << There is no damage to children if raised by two men. As least they can teach them love and caring instead of bigotry.\n \n Terral's reply << Well then, your Creator is a bigot. Romans 1:20-32. Every word you have written here is based upon a distorted view of reality. All normal people are not the same, and all homo people are not either. There is a spectrum of individuals contained within both groups. In most cases, any child is way ahead being raised by their natural parents. No two homos ever brought a single life into this world by natural processes associated by the joining of their dna. They have no rights over the children of others, unless someone else hands over their very souls to the perverts. \n \n BTW, these depraved individuals have not been out of the closet long enough for you to absolutely confirm that 'no damage' is done to normal children raised by homos. Since God says that they are all \"worthy of death\" (Romans 1:32), then you also believe that raising children outside of a normal Christian home is also quite acceptable. \n \n God bless,\n \n Terral", 
   {
    "post_info": {
     "post_title": "Normal Folks Need To Be More Aware Of Homo Motives"
    }, 
    "unicode_changes_made": true
   }, 
   58237, 
   null, 
   1091036340.0
  ], 
  [
   60103, 
   null, 
   "joebrummer", 
   "Terral's reply << Maybe the answer is more simple than you imagine. Personally, I believe that anyone placing tags upon themselves to describe their deviant sexual behavior has a screw loose. For most normal men, the mental image of one man sodomizing another is just abnormal sick behavior. Even the most vile wild beasts of the world have better sense. \n\n \n \n Time for a science lesson.....\n \n \n Homosexuality has been documented in every species of animals even down to fleas. For further information about these wild vile beasts who I guess didn't have better sense as Terral might have believed. Please click the links below. No excuse me while I get my clip board and head to the beach to recruit. I am working towards a free microwave.\n \n \n http://www.rnw.nl/lifestyle/html/gayanimals000808.html\n \n http://www.*****theory.com/theories/science/*****_zoology.htm\n \n \n and my personal favorite....\n \n \n http://sfgate.com/cgi-bin/article.cgi?f=/c/a/2004/02/07/MNG3N4RAV41.DTL", 
   {
    "post_info": {
     "post_title": "Today's Science Lesson for Terral"
    }, 
    "unicode_changes_made": true
   }, 
   60099, 
   null, 
   1091037360.0
  ], 
  [
   60115, 
   null, 
   "jitobear", 
   "How do you know he's THRIVING? It looks like he's thriving now? You know, some changes are slow and you can't just see them in 2 or 5 years. You'll see what he will tell you when he grows up. He may start hating you for depriving him, you just don't know what may happen later.\n\n \n Depriving him of what? He has a home, support, discipline, and people who love him. Just what am I depriving my son? And what do you know about him or us at all?\n \n Let me tell you about a little five year old boy who cried because he had no dad. Let me tell you about how he was angry about it. Let me tell you how it took more than two years on a waiting list to find a mentor. (Do you mentor or parent? - or do you just rant about how gays shouldn't?)\n \n And let me tell you how much more happy and secure he is now.\n \n Get off your holy cloud, for you know NOTHING - YOU are in NO PLACE  to tell ME about MY SON. \n \n \nThat does not mean anything.\n\n \n Maybe being loving, committed and responsible doesn't matter in YOUR morality, but it most certainly does in mine.\n \n \nNo, not parent, but the child, if he knows. See, sometimes he does not have a choice, and so what he knows and likes is based only on his single-sided experience.\n\n \n What are you talking about, Ask my kid what he needs and he will tell you McDonalds French Fries, video games and Yu-Gi-Oh cards.\n \n If it weren't for the adults knowing and providing what kids need they would die off quick.\n \n \nWhere do you get the female role model if the couple is gay?!\n\n \n Women are all over the place.. Do you think children never leave the house? There teachers, friends, - even gay people have moms and sisters.\n \n \nAnd so the don't need anyone to PERVERT them in their identities.?!\n\n \n Huh. Doing volunteer work, yard work, learning to fish, learning to fix cars, going swimming, shooting archery, going to movies, going bowling, going camping, going biking, getting loved. DANG! I think a lot more kids could use this kind of perversion.\n \n \nThere is a force of gravitation. It's not a stereotype, it's a law of nature. There are other laws that you can't label stereotypes. Male and female roles and identities is not some old school junk. You are just so wrong it this.\n\n \n As a single mother. Let me tell you that you are wrong. I can fish (including baiting my own hook) and fix the breaks on my car as well as I can cook and do a load of laundry. I don't live by your force of gravitation. Biology makes me a woman - not activity.\n \n \nSick logic. There are also losser sucker gays. Or are gays perfect people in fact? Haha -- no way. It's just closing your eyes to the fact that gays can as well be loosers and jerks.\n\n \n Of course gays can be schmucks. I even know some who are. They are just like the rest of us. Some good and some bad.\n \n And why is my logic sick?\n \n My son's father walked (doesn't even call - we don't know where he is), pays no child-support, is a drunk, is extremely abusive, and tried to strangle me (in front of his 3 year old son) the last time I did see him. And you actually think that there is something flawed in my logic because I would rather my son have a loving guide rather than this abusive one? I prefer my sickness to yours.\n \n \nReally? Don't you cover your eyes with your hands? Not want to see the reality? Stick to your perverted lifestyle and protect it, moreover, promote it?\n\n \n It's only perverted to the very narrow minded. \n \n I know for a fact - like I know the sky is overhead - that this man in our life is a miracle. You know nothing about us. You can live the fantasy that my son will hate me and his mentor some day, but that's your little fantasy.\n \n As a matter of fact he has already had to deal with some cruel and small-minded people in regards to his mentor (and himself as my son is Latino). He does not understand it. He does not understand it anymore than he understands people using words like nigger or spic.\n \n I don't teach my son to hate.", 
   {}, 
   60070, 
   null, 
   1091047980.0
  ], 
  [
   60129, 
   null, 
   "Anastasia", 
   "Silly jitobear... tsk tsk tsk\n Did you forget that the only mission in a homosexuals' life is to corrupt and pervert our children.....\n they also have sex with animals\n according to some, since when they talk about gays, beastiality usually comes next\n and of course they are having sex in public, since everyone finds them so disgusting.... unless they are watching gay porn\n and absolutely all gays could never contribute anything good to society.\n just in case anyone could think of any gay people that have made their\n place in society\n here is just a few\n Alexander the Great\n **** *Macedonian Ruler, 300 B.C.\n *Socrates\n **** *Greek Philosopher, 400 B.C.\n *Sappho\n **** *Greek Woman Poet, 600 B.C.\n *Hadrian\n **** *Roman Emperor, 1st-2nd c.\n *Richard the Lionhearted\n **** *English King, 12th c.\n *Saladin\n **** *Sultan of Egypt and Syria\n *Desiderius Erasmus\n **** *Dutch Monk, Philosopher\n *Francis Bacon\n **** *English statesman, author\n *Frederick the Great\n **** *King of Prussia\n *Lord Byron\n **** *English poet, 18th c.\n *Walt Whitman\n **** *U.S. poet, author, 19th c.\n *Oscar Wilde\n **** *Irish author, 19th c.\n *Marcel Proust\n **** *French author, 20th c.\n *Colette\n **** *French author, 20th c.\n *Gertrude Stein\n **** *U.S. poet, author, 20th c.\n *Alice B. Toklas\n **** *U.S. author, 20th c.\n *Federico Garcia Lorca\n **** *Spanish author, 20th c.\n *Cole Porter\n **** *U.S. composer, 20th c.\n *Virginia Woolf\n **** *English author, 20th c.\n Leonard Bernstein\n **** *U.S. composer, 20th c.\n *Pope Julius III\n **** *1550-1555\n *T.E. Lawrence\n **** *English soldier, author, 20th c.\n *Jean Cocteau\n **** *French writer, director, 20th c.\n *Charles Laughton\n **** *English actor, 20th c.\n *Marguerite Yourcenar\n **** *Belgian author, 20th c.\n *Tennessee Williams\n **** *U.S. Playwright, 20th c.\n *James Baldwin\n **** *U.S. author, 20th c.\n *Andy Warhol\n **** *U.S. artist, 20th c.\n *Michelangelo\n **** *Italian artist, 15th c.\n *Leonardo Da Vinci\n **** *Ital. Artist, scientist, 15th c.\n *Christopher Marlowe\n **** *Eng. Playwright, 16th c.\n *Herman Melville\n **** *U.S. author, 19th c.\n *Horatio Alger, Jr.\n **** *U.S. author, 19th c.\n *Tchaikovsky\n **** *Russian composer, 19th c.\n Willa Cather\n **** *U.S. author, 19th c.\n *Amy Lowell\n **** *U.S. author, 19th & 20th c.\n *E.M. Forster\n **** *English author, 20th c.\n *John M. Keynes\n **** *English economist, 20th c.\n *Ludwig Wittgenstein\n **** *Australian mathematician, 20th c.\n *Bessie Smith\n **** *U.S. singer, 20th c.\n *Noel Coward\n **** *English playwright, 20th c.\n *Christopher Isherwood\n **** *English author, 20th c.\n *Pier Paolo Pasolini\n **** *Italian film director, 20th c.\n *Yukio Mishima\n **** *Japanese author, 20th c.\n *Eleanor Roosevelt\n **** *U.S. stateswoman, 20th c.\n *Julius Caesar\n **** *Roman Emperor, 100-44 B.C.\n *Augustus Caesar\n **** *Roman Emperor\n *Harvey Milk\n **** *U.S. politician, 20th c.\n *Bayard Rustin\n **** *U.S. Civil Rights activist, 20th c.\n *James I\n **** *English King, 16th-17th c.\n *Queen Anne\n **** *English Queen, 18th c.\n *Marie Antoinette\n **** *French Empress, 18th c.\n *Melissa Etheridge\n **** *U.S. Rock Star, 20th c.\n *Pope Benedict IX\n **** *1032-1044\n *Mary Sarton\n **** *U.S. author, 20th c.\n *Edna Ferber\n **** *U.S. author, 20th c.\n *Elton John\n **** *English Rock Star, 20th c.\n *Margaret Fuller\n **** *U.S. writer, educator, 20th c.\n *Montezuma II\n **** *Aztec ruler, 16th c.\n *Peter the Great\n **** *Russian Czar, 17th-18th c.\n *Langston Hughes\n **** *U.S. author, 20th c.\n *Pope John XII\n **** *955-964\n *Madame de Stael\n **** *French writer, 17th-18th c.\n *Martina Navratilova\n **** *U.S. tennis star, 20th c.\n *Greg Louganis\n **** *U.S. Olympic swimmer, 20th c.\n *Billie Jean King\n **** *U.S. tennis star, 20th c.\n *Roberta Achtenburg\n **** *U.S. politician, 20th c.\n *Barney Frank\n **** *U.S. Congressman, 20th c.\n *Gerry Studds\n **** *U.S. Congressman, 20th c.\n *Hans Christian Andersen\n **** *Danish author, 19th c.\n *Tom Dooley\n **** *U.S. M.D. missionary, 20th c.\n *J. Edgar Hoover\n **** *U.S. director of the FBI., 20th c.\n *Frida Kahlo\n **** *Mexican artist, 20th c.\n *Suleiman the Magnificent\n **** *Ottoman ruler, 15th c.\n *Rock Hudson\n **** *U.S. actor, 20th c.\n *Sor Juana Ines de la Cruz\n **** *Mexican author, 16th c.\n *Ralph Waldo Emerson\n **** *U.S. author, 19th c.\n *Candace Gingrich\n **** *Gay Rights activist, 20th c.\n *Margarethe Cammermeyer\n **** *U.S. Army Colonel, 20th c.\n *Zoe Dunning\n **** *U.S. Military Reservist, 20th c.\n *Tom Waddel\n **** *U.S. M.D., Olympic star, 20th c.\n *Kate Millet\n **** *U.S. author, 20th c.\n *Janis Joplin\n **** *U.S. singer, 20th c.\n *Rudolf Nuryev\n **** *Russian dancer, 20th c.\n *Waslaw Nijinsky\n **** *Russian dancer, 20th c.\n *Ernst Röhm\n **** *German Nazi leader, 20th c.\n *Dag Hammerskjold\n **** *Swedish UN Secretary, 209th c.\n *Aristotle\n **** *Greek philosopher, 384-322 B.C.\n *Paula Gunn Allen\n **** *Native American author, 20th c.\n *Angela Davis\n **** *U.S. political activist, 20th c.\n *June Jordan\n **** *U.S. author, activist, 20th c.\n *Rainer Maria Rilke\n **** *German poet, 20th c.\n *James Dean\n **** *U.S. actor, 20th c.\n *Montgomery Clift\n **** *U.S. actor, 20th c.\n *Baron VonSteuben\n **** *German General, Valley Forge\n *Edward II\n **** *English King, 14th c.", 
   {}, 
   60115, 
   null, 
   1091053740.0
  ], 
  [
   60136, 
   null, 
   "Ladywolf", 
   "perhaps straight men are afraid of gays because...\n \n gay guys are usually better looking than straight men\n most straight men can't cook, gay men can give you lessons\n straight men don't know how to dress, gay men invent new looks \n straight men \"possess\" their women like they would their property, not people\n straight men treat women like 2nd class citizens, gay men worship women\n straight men are boring and watch too much sports and bad tv programing\n straight men think forplay is turning off the remote", 
   {
    "post_info": {
     "post_title": "Why straight men are afraid of gays"
    }
   }, 
   60129, 
   null, 
   1091056680.0
  ], 
  [
   60138, 
   null, 
   "Jaaaman", 
   "perhaps straight men are afraid of gays because...\n \n gay guys are usually better looking than straight men\n most straight men can't cook, gay men can give you lessons\n straight men don't know how to dress, gay men invent new looks \n straight men \"possess\" their women like they would their property, not people\n straight men treat women like 2nd class citizens, gay men worship women\n straight men are boring and watch too much sports and bad tv programing\n straight men think forplay is turning off the remote\n\n hmmm.... lots of generalizations here. Straight men and women are not perfect and many need to do better, but that doesn't change the fact that homosexuality is a behavioral aberration and is not the norm.", 
   {}, 
   60136, 
   null, 
   1091057280.0
  ], 
  [
   60150, 
   null, 
   "JakeCJB", 
   "Ditto. Our diverse society contains some normal folks on their way to gaydom or gay-doom. Those currently straight individuals do not hate the idea of homo's existing anywhere.\n\n \n So gays can be normal. What is gay-doom? \n \n \nMaybe the answer is more simple than you imagine. Personally, I believe that anyone placing tags upon themselves to describe their deviant sexual behavior has a screw loose.\n\n \n I think anyone who has to tag others with hate words, such as yourself, has a screw loose.\n \n \nFor most normal men, the mental image of one man sodomizing another is just abnormal sick behavior.\n\n \n Why are you even thinking about it, if you are straight? \n \n \nGood looking enough for what? \"My God man! You look good enough to sodomize!\" The natural function of sexual activity is for the bearing of children; for the perpetual replacement of our citizens upon this planet.\n\n \n There are many functions of sexuality.\n \n \nIt is through marriage and this physical/emotional/spiritual union that the two \"become one flesh.\" Genesis 2:24. It should be quite obvious to even the most casual observer that Homos perform their indecent acts for much different purposes indeed.\n\n \n Ruth 1:14, refers to the relationship of Ruth and Naomi, by saying \"Ruth CLAVE onto her.\" (KJV) \n \n Genesis 2:24: \" Therefore shall a man leave his father and his mother, and shall CLEAVE unto his wife: and they shall be one flesh.\" (KJV) \n \n \nWhat motivates a pervert to do anything?\n\n \n More brilliant hate speech.\n \n \nThe 'in your face' attitude of our growing homo population will play out in many ways. They stalk potential victims along our coastlines in their thongs, annoying fishermen and beachgoers, under the pretense of being out to get some rays. But those who take notice can see the greedy perverted desire within them.\n\n \n Perhaps you see homosexuality within yourself. How are they victimizing you? Is this because they look so tempting to you in their swimwear? I'm gay, and I don't know where these beaches with the gay men you give such a vivid description of, are.\n \n \nMany are predators who victimize the young unfortunate ones among us, who seek some kind of financial security, or some quick fix answer to a seeming futile situation.\n\n \n And some heterosexuals get married to millionaires on reality t.v. programs. \n \n \nI would not know. Practically every person I knew from my youth who turned homo is now dead from aids.\n\n \n I doubt if you know very well, many self-respecting, proud gay men. They wouldn't have anything to do with you.\n \n \nAnyone who would turn any child over to be raised by homos does not have the best interests of the child in mind. Every natural person on this planet came into existence through the joining of a father and a mother. Each and every one of them deserves the opportunity to be raised by normal folks. That simple truth should go without saying.\n\n \n Why do you assume that gay parents don't have the best interests of the child in mind? Not every heterosexual can provide a loving home. The fact that one was reproduced by a male and a female, does not mean that one will have a good home with that male and female, just because they had sex. \n \n \nBTW, these depraved individuals have not been out of the closet long enough for you to absolutely confirm that 'no damage' is done to normal children raised by homos. Since God says that they are all \"worthy of death\" (Romans 1:32), then you also believe that raising children outside of a normal Christian home is also quite acceptable.\n\n \n Here's a tip, not everyone is a Christian. The Biblical God killed a lot of people, obviously. The Great Flood, the first born of every Egyptian, etc., etc.. Perhaps if Jesus had been completely taken away from his father, Jesus would not have been killed while nailed to two boards, when his father wanted to show his great love. But then, the Christian God only had a son so he could kill that son. And wow, he didn't even have that son in the traditional way by male and female sex, but by using a surogate in a virgin birth! \n \n \nGod bless,\n \n Terral\n\n \n Unless you are gay of course. It's easy to see the damage you could do to a gay son. Being told that this important part of his human sexual identity, he didn't consiously choose, means he is only worthy of death. Being brainwashed to believe your hate, and to internalize that.", 
   {
    "unicode_changes_made": true
   }, 
   60099, 
   null, 
   1091065080.0
  ], 
  [
   60152, 
   null, 
   "jerichoholic104", 
   "perhaps straight men are afraid of gays because...\n \n gay guys are usually better looking than straight men\n most straight men can't cook, gay men can give you lessons\n straight men don't know how to dress, gay men invent new looks \n straight men \"possess\" their women like they would their property, not people\n straight men treat women like 2nd class citizens, gay men worship women\n straight men are boring and watch too much sports and bad tv programing\n straight men think forplay is turning off the remote\n\n \n \n Uh... Yeah I totally disagree with you there. Don't let a couple XXXXXX paint a bad picture of all straight men. Besides, I'm straight and I'm better looking than ALL men. Gay and straight.", 
   {}, 
   60136, 
   null, 
   1091065260.0
  ], 
  [
   60183, 
   null, 
   "Phunting", 
   "*Ludwig Wittgenstein\n **** *Australian mathematician, 20th c.\nNot to nit pick, but I think you meant Austrian :p", 
   {}, 
   60129, 
   null, 
   1091105160.0
  ], 
  [
   60184, 
   null, 
   "Phunting", 
   "What is gay-doom?\nIt's a classic first person shooter computer game where you go around a military base over-run by strapping, well toned aliens and try to seduce them...", 
   {}, 
   60150, 
   null, 
   1091105340.0
  ], 
  [
   60213, 
   null, 
   "Anastasia", 
   "Not to nit pick, but I think you meant Austrian :p\n\n Whoops\n emoticon_emb", 
   {}, 
   60183, 
   null, 
   1091120460.0
  ], 
  [
   60215, 
   null, 
   "sinjin", 
   "Is the rate of suicide of gay youths higher for those of \"fundamentalist\" families than the general population? It sure wouldn't surprise me.\n \n Terral- You're incredible.", 
   {}, 
   60184, 
   null, 
   1091120760.0
  ], 
  [
   60246, 
   null, 
   "Ladywolf", 
   "hmmm.... lots of generalizations here. Straight men and women are not perfect and many need to do better, but that doesn't change the fact that homosexuality is a behavioral aberration and is not the norm.\n\n \n What could be more of a behavioral aberration than the way you've treated your fellow humans on here? Quoting your bible and twisting it around to support what you belive to hurt others emotionally.\n \n I for one, don't believe your twisted lies.", 
   {
    "post_info": {
     "post_title": "Why straight men are afraid of gays"
    }
   }, 
   60138, 
   null, 
   1091136060.0
  ], 
  [
   60267, 
   null, 
   "jerichoholic104", 
   "What could be more of a behavioral aberration than the way you've treated your fellow humans on here? Quoting your bible and twisting it around to support what you belive to hurt others emotionally.\n \n I for one, don't believe your twisted lies.\n\n \n Yeah, but just because those guys are braindead and completely missed the point of their religion doesn't mean that you should take it out on all of us straight guys. I'm in complete support of gay rights, and i'm a straight dude. I think all it requires is to not have been born before 1975. I think it tends to be the old people, brainwashed with religious falsehoods their whole life, who hate gays. Every single one of my straight peers totally supports gays. And by every single one, I mean everyone but the one idiot who we don't like much anyway. :) \n \n Yeah so anyway... Don't hate on me (a straight guy), I'm not hating on you!", 
   {}, 
   60246, 
   null, 
   1091140080.0
  ], 
  [
   60276, 
   null, 
   "Kronus", 
   " I think all it requires is to not have been born before 1975. I think it tends to be the old people, brainwashed with religious falsehoods their whole life, who hate gays. \n\n \n Why you young whipper snapper! In my day we didn't discriminate against our elders that way! Uphill, in the snow, chased by wolves, both ways.\n \n Which is to say, just as you don't like to be dumped in with the gay bashers just 'cause you're straight, don't dump us \"old folk\" (I was born in '67) in with them either.", 
   {}, 
   60267, 
   null, 
   1091141160.0
  ], 
  [
   60282, 
   null, 
   "Ladywolf", 
   "Yeah, but just because those guys are braindead and completely missed the point of their religion doesn't mean that you should take it out on all of us straight guys. I'm in complete support of gay rights, and i'm a straight dude. I think all it requires is to not have been born before 1975. I think it tends to be the old people, brainwashed with religious falsehoods their whole life, who hate gays. Every single one of my straight peers totally supports gays. And by every single one, I mean everyone but the one idiot who we don't like much anyway. :) \n \n Yeah so anyway... Don't hate on me (a straight guy), I'm not hating on you!\n\n \n Sorry jerichoholic104, I got a little steamed and I was wrong. I also found out I have been debating with about 3 braindead/brainwashed XXXXXX on here who have been extremely hateful, rude, mean and hard headed. I just get so angry with people who hate something I am instead of hating something I do. It's just that it gets too me when my rabbi and my fiance's minister will marry us and acknowledge our lifelong commitment to one another, and the government won't issue a license saying I'm basically responsible for her and she for I. It's just so hard as I am getting married next year and was hoping to have my marriage recognized by the government as well.\n \n I know most straight people accept or at least tolerate gays/lesbians and I appreciate that.", 
   {
    "post_info": {
     "post_title": "Why straight men are afraid of gays"
    }
   }, 
   60267, 
   null, 
   1091142660.0
  ], 
  [
   60290, 
   null, 
   "jitobear", 
   "I am getting married next year...\n\n \n Congratulations. emoticon_love", 
   {}, 
   60282, 
   null, 
   1091145300.0
  ], 
  [
   60291, 
   null, 
   "Jaaaman", 
   "What could be more of a behavioral aberration than the way you've treated your fellow humans on here? Quoting your bible and twisting it around to support what you belive to hurt others emotionally.\n \n I for one, don't believe your twisted lies.\n\n Homosexuality is a behavior, not a condition, and something that some people can and do change, just like they sometimes change other tastes and personality traits. \n Marriage is a common good, not a special interest.\n Every society needs natural marriage -- as many men as possible each finding a woman, caring for and committing himself exclusively to her -- working together to create and raise the next generation.", 
   {}, 
   60246, 
   null, 
   1091145540.0
  ], 
  [
   60295, 
   null, 
   "Jaaaman", 
   "Originally Posted by Ladywolf\n What could be more of a behavioral aberration than the way you've treated your fellow humans on here? Quoting your bible and twisting it around to support what you belive to hurt others emotionally.\n \n I for one, don't believe your twisted lies. \n I'm sorry if you feel I'm hurting others emotionally with my statements, but wrong behavior and unnatural \"relations\" are not going to get my nod of approval. Life is hard. You need to fight this urge that you have for the same sex and not make excuses for this unnatural behavior.", 
   {}, 
   60291, 
   null, 
   1091146320.0
  ], 
  [
   60296, 
   null, 
   "joebrummer", 
   "It's not just an urge to have same-sex, it is an urge to be in a romantic relationship with someone of the same-sex. It goes beyond sex. It is a set of feeling and emotions that you are attracted both physically and emotionally to the same-sex. \n \n PS. It is perfectly normal as well. I have not now, nor have I ever been attracted to women. How would you propose that I start now. OR should I ive my days lonely and unpartnered. Yeah that would make me a productive member of society. \n \n People that wish gays to \"REFRAIN\" from being who they are don't seem to understand that being something else would make us unproductive members of society. Lonely and depressed collecting disability off you tax dollars. Sorta of silly idea don't you think. Letting us be who we are we are productive citizens.......like Elton John, Di Vinci, etheridge...on so on....", 
   {}, 
   60295, 
   null, 
   1091146800.0
  ], 
  [
   60319, 
   null, 
   "JakeCJB", 
   "Homosexuality is a behavior, not a condition,\n\n \n It's an identity, that exists with or without behaviour. It simply means one is attracted(in one's head) to the same sex. \n \n \nand something that some people can and do change, just like they sometimes change other tastes and personality traits.\n\n \n How do you change whom you are attracted to? How do you make yourself be attracted to someone else? If you could, why should you? How many straight fathers would like for their straight daughter to be used in an experiment to see if a gay man can be something he is not? \n \n \nMarriage is a common good, not a special interest.\n Every society needs natural marriage\n\n \n Marriage is naturally occuring now? Does the marriage contract grow on trees?\n \n \n -- as many men as possible each finding a woman, caring for and committing himself exclusively to her -- working together to create and raise the next generation.\n\n \n Only if those men are not gay.", 
   {}, 
   60291, 
   null, 
   1091166480.0
  ], 
  [
   60320, 
   null, 
   "JakeCJB", 
   "I'm sorry if you feel I'm hurting others emotionally with my statements, but wrong behavior and unnatural \"relations\"\n\n \n Why is it wrong behaviour? Why is it unnatural? Humans can't violate a law of nature, if there were such a law of nature against being gay. Humans would not have to enforce such a law either against homosexuality. They wouldn't have to try to oppress against it, and against those people, with hate.\n \n \nare not going to get my nod of approval. Life is hard. You need to fight this urge that you have for the same sex and not make excuses for this unnatural behavior.\n\n \n I didn't see Ladywolf making any excuses. I don't see anyone who is not attacking gay people, making excuses. There is nothing that needs to be excused.", 
   {}, 
   60295, 
   null, 
   1091167440.0
  ], 
  [
   60324, 
   null, 
   "Duo_Maxwell", 
   "JakeCJB: What does natural have to do with marriage? Males are HARDWIRED to have more then one partner. Biologically, half of the species already has a natural problem with marriage and that's not even counting issues outside the womb. \n \n The natural fallacy is a joke. If we banned things because they were \"unnatural\" I wouldn't be here talking to you, and we would probably still be living in caves. I could post a list of things we do everyday that aren't natural, but that would only make the antis run away as fast as they can.", 
   {}, 
   60320, 
   null, 
   1091172900.0
  ], 
  [
   60476, 
   null, 
   "Duo_Maxwell", 
   "wow, they are weaker then I thought. I simply state I can give a number of examples and they run for the hills.", 
   {}, 
   60324, 
   null, 
   1091269200.0
  ], 
  [
   61807, 
   null, 
   "LadyOreo", 
   "I'm sorry if you feel I'm hurting others emotionally with my statements, but wrong behavior and unnatural \"relations\" are not going to get my nod of approval. Life is hard. You need to fight this urge that you have for the same sex and not make excuses for this unnatural behavior.\n\n \n I am sorry you feel that way. I do not get an urge to be gay. I am gay. Very simple. It is natural like going to the bathroom. Or better yet, it is natural like heterosexuality. Excuses for our behavior? Let me just ignore that statement. \n \n Many people think we wake up one morning and decide to be gay. Most gay and lesbians have always been gay but are too afraid to come out openly about it because of people like you. No one wakes up and chooses the harder lifestyle.", 
   {
    "post_info": {
     "post_title": "Gay is not a choice"
    }
   }, 
   60295, 
   null, 
   1092270900.0
  ], 
  [
   61864, 
   null, 
   "Jaaaman", 
   "I am sorry you feel that way. I do not get an urge to be gay. I am gay. Very simple. It is natural like going to the bathroom. Or better yet, it is natural like heterosexuality. Excuses for our behavior? Let me just ignore that statement. \n \n Many people think we wake up one morning and decide to be gay. Most gay and lesbians have always been gay but are too afraid to come out openly about it because of people like you. No one wakes up and chooses the harder lifestyle.\n\n Inborn tendencies toward certain behaviors (such as homosexuality) do not make those behaviors moral. Tendencies toward alcoholism, obesity, and violence are now thought to be genetically influenced, but they are not good behaviors. People born with tendencies toward these behaviors have to fight hard against their natural temptations to drunkenness, gluttony, and physical rage.\n Are there really changed lives, people who were exclusively homosexual and became heterosexual? Yes. Have there not been those who have fallen back into their old lifestyles? Again, the answer is yes, which is to be expected. Just like in Alcoholics Anonymous, the road is rarely easy and involves a tremendous commitment by the individual seeking recovery and healing. Sometimes individuals stumble and never get back up again. Sometimes they stumble, get back up, and continue on in the process of recovery. And occasionally, individuals are healed instantly and never turn back again. But the fact remains that there are many former homosexuals and ex-gays in society today.", 
   {}, 
   61807, 
   null, 
   1092320880.0
  ], 
  [
   61883, 
   null, 
   "JakeCJB", 
   "Inborn tendencies toward certain behaviors (such as homosexuality) do not make those behaviors moral.\n\n \n No kidding, but that does not make those behaviours immoral either.\n \n \nTendencies toward alcoholism, obesity, and violence are now thought to be genetically influenced, but they are not good behaviors.\n\n \n No, but what do any of these things have in common with being gay?\n \n \nPeople born with tendencies toward these behaviors have to fight hard against their natural temptations to drunkenness, gluttony, and physical rage.\n Are there really changed lives, people who were exclusively homosexual and became heterosexual? Yes. Have there not been those who have fallen back into their old lifestyles? Again, the answer is yes, which is to be expected. Just like in Alcoholics Anonymous, the road is rarely easy and involves a tremendous commitment by the individual seeking recovery and healing. Sometimes individuals stumble and never get back up again. Sometimes they stumble, get back up, and continue on in the process of recovery. And occasionally, individuals are healed instantly and never turn back again. But the fact remains that there are many former homosexuals and ex-gays in society today.\n\n \n Are you speaking from experience? At any rate, for the sake of argument, let's say going against being gay is like going against being an aclocholic. Then you are only talking about using sheer willpower, you are not talking about a changing of one's authentic desire. One is still gay. What is the compelling reason a gay person should repress all sexual behaviour?\n \n The Diagnostic and Statistical Manual of Mental Disorders, published by the American Psychiatric Association and defining the standard of the field, does not include homosexuality as a mental disorder. All other major health professional organizations have supported the American Psychiatric Association in its declassification of homosexuality as a mental disorder in 1973. Thus, the idea that homosexuality is a mental disorder or that the emergence of same-gender sexual desires among some adolescents is in any way abnormal or mentally unhealthy has no support among health and mental health professional organizations.\n \n Despite the unanimity of the health and mental health professions on the normality of homosexuality, the idea of \"reparative therapy\" has recently been adopted by conservative organizations and aggressively promoted in the media. Because of this aggressive promotion of \"reparative therapy,\" a number of the health and mental health professional organizations have recently issued public statements about \"reparative therapy\" as well.\n \n The American Academy of Pediatrics in its policy statement on Homosexuality and Adolescence states: Confusion about sexual orientation is not unusual during adolescence. Counseling may be helpful for young people who are uncertain about their sexual orientation or for those who are uncertain about how to express their sexuality and might profit from an attempt at clarification through a counseling or psychotherapeutic initiative. Therapy directed specifically at changing sexual orientation is contraindicated, since it can provoke guilt and anxiety while having little or no potential for achieving changes in orientation.6\n \n The American Counseling Association has adopted a resolution that states that it: opposes portrayals of lesbian, gay, and bisexual youth and adults as mentally ill due to their sexual orientation; and supports the dissemination of accurate information about sexual orientation, mental health, and appropriate interventions in order to counteract bias that is based on ignorance or unfounded beliefs about same-gender sexual orientation.7 Further, at its 1999 World Conference, ACA adopted a position opposing the promotion of \"reparative therapy\" as a \"cure\" for individuals who are homosexual.8\n \n The American Psychiatric Association in its position statement on Psychiatric Treatment and Sexual Orientation states: The potential risks of \"reparative therapy\" are great, including depression, anxiety and self-destructive behavior, since therapist alignment with societal prejudices against homosexuality may reinforce self-hatred already experienced by the patient. Many patients who have undergone \"reparative therapy\" relate that they were inaccurately told that homosexuals are lonely, unhappy individuals who never achieve acceptance or satisfaction. The possibility that the person might achieve happiness and satisfying interpersonal relationships as a gay man or lesbian is not presented, nor are alternative approaches to dealing with the effects of societal stigmatization discussed.9\n \n The American Psychological Association in its Resolution on Appropriate Therapeutic Responses to Sexual Orientation, which is also endorsed by the National Association of School Psychologists, states: That the American Psychological Association opposes portrayals of lesbian, gay, and bisexual youth and adults as mentally ill due to their sexual orientation and supports the dissemination of accurate information about sexual orientation, and mental health, and appropriate interventions in order to counteract bias that is based in ignorance or unfounded beliefs about sexual orientation.10\n \n The National Association of Social Workers in its Policy Statement on Lesbian, Gay and Bisexual Issues: endorses policies in both the public and private sectors that ensure nondiscrimination; that are sensitive to the health and mental health needs of lesbian, gay, and bisexual people; and that promote an understanding of lesbian, gay, and bisexual cultures. Social stigmatization of lesbian, gay, and bisexual people is widespread and is a primary motivating factor in leading some people to seek sexual orientation changes.11 Sexual orientation conversion therapies assume that homosexual orientation is both pathological and freely chosen. No data demonstrate that reparative or conversion therapies are effective, and in fact they may be harmful.12 NASW believes social workers have the responsibility to clients to explain the prevailing knowledge concerning sexual orientation and the lack of data reporting positive outcomes with reparative therapy. NASW discourages social workers from providing treatments designed to change sexual orientation or from referring practitioners or programs that claim to do so.13\n \n As these statements make clear, health and mental health professional organizations do not support efforts to change young people's sexual orientation through \"reparative therapy\" and have raised serious concerns about its potential to do harm. Many of the professional associations listed in the Resources section at the end of this factsheet are able to provide helpful information and local contacts to assist school administrators, health and mental health professionals, educators, teachers, and parents in dealing with school controversies in their communities\n \n http://www.apa.org/pi/lgbc/publications/justthefacts.html", 
   {}, 
   61864, 
   null, 
   1092330480.0
  ], 
  [
   61885, 
   null, 
   "Jaaaman", 
   "\n The Diagnostic and Statistical Manual of Mental Disorders, published by the American Psychiatric Association and defining the standard of the field, does not include homosexuality as a mental disorder. All other major health professional organizations have supported the American Psychiatric Association in its declassification of homosexuality as a mental disorder in 1973. Thus, the idea that homosexuality is a mental disorder or that the emergence of same-gender sexual desires among some adolescents is in any way abnormal or mentally unhealthy has no support among health and mental health professional organizations.\n \n Despite the unanimity of the health and mental health professions on the normality of homosexuality, the idea of \"reparative therapy\" has recently been adopted by conservative organizations and aggressively promoted in the media. Because of this aggressive promotion of \"reparative therapy,\" a number of the health and mental health professional organizations have recently issued public statements about \"reparative therapy\" as well.\n \n The American Academy of Pediatrics in its policy statement on Homosexuality and Adolescence states: Confusion about sexual orientation is not unusual during adolescence. Counseling may be helpful for young people who are uncertain about their sexual orientation or for those who are uncertain about how to express their sexuality and might profit from an attempt at clarification through a counseling or psychotherapeutic initiative. Therapy directed specifically at changing sexual orientation is contraindicated, since it can provoke guilt and anxiety while having little or no potential for achieving changes in orientation.6\n \n The American Counseling Association has adopted a resolution that states that it: opposes portrayals of lesbian, gay, and bisexual youth and adults as mentally ill due to their sexual orientation; and supports the dissemination of accurate information about sexual orientation, mental health, and appropriate interventions in order to counteract bias that is based on ignorance or unfounded beliefs about same-gender sexual orientation.7 Further, at its 1999 World Conference, ACA adopted a position opposing the promotion of \"reparative therapy\" as a \"cure\" for individuals who are homosexual.8\n \n The American Psychiatric Association in its position statement on Psychiatric Treatment and Sexual Orientation states: The potential risks of \"reparative therapy\" are great, including depression, anxiety and self-destructive behavior, since therapist alignment with societal prejudices against homosexuality may reinforce self-hatred already experienced by the patient. Many patients who have undergone \"reparative therapy\" relate that they were inaccurately told that homosexuals are lonely, unhappy individuals who never achieve acceptance or satisfaction. The possibility that the person might achieve happiness and satisfying interpersonal relationships as a gay man or lesbian is not presented, nor are alternative approaches to dealing with the effects of societal stigmatization discussed.9\n \n The American Psychological Association in its Resolution on Appropriate Therapeutic Responses to Sexual Orientation, which is also endorsed by the National Association of School Psychologists, states: That the American Psychological Association opposes portrayals of lesbian, gay, and bisexual youth and adults as mentally ill due to their sexual orientation and supports the dissemination of accurate information about sexual orientation, and mental health, and appropriate interventions in order to counteract bias that is based in ignorance or unfounded beliefs about sexual orientation.10\n \n The National Association of Social Workers in its Policy Statement on Lesbian, Gay and Bisexual Issues: endorses policies in both the public and private sectors that ensure nondiscrimination; that are sensitive to the health and mental health needs of lesbian, gay, and bisexual people; and that promote an understanding of lesbian, gay, and bisexual cultures. Social stigmatization of lesbian, gay, and bisexual people is widespread and is a primary motivating factor in leading some people to seek sexual orientation changes.11 Sexual orientation conversion therapies assume that homosexual orientation is both pathological and freely chosen. No data demonstrate that reparative or conversion therapies are effective, and in fact they may be harmful.12 NASW believes social workers have the responsibility to clients to explain the prevailing knowledge concerning sexual orientation and the lack of data reporting positive outcomes with reparative therapy. NASW discourages social workers from providing treatments designed to change sexual orientation or from referring practitioners or programs that claim to do so.13\n \n As these statements make clear, health and mental health professional organizations do not support efforts to change young people's sexual orientation through \"reparative therapy\" and have raised serious concerns about its potential to do harm. Many of the professional associations listed in the Resources section at the end of this factsheet are able to provide helpful information and local contacts to assist school administrators, health and mental health professionals, educators, teachers, and parents in dealing with school controversies in their communities\n \n\n Bullhockey  \n \n \n The American Psychiatric Association Coup\n \n Homosexuals commonly point to the fact that the 'medical community' and, more specifically, psychiatrists agree with them that homosexuality is a \"normal human sexual response.\"\n \n It is certainly true that the American Psychiatric Association (APA) removed homosexuality from its list of \"mental disorders\" twenty years ago, in 1973. This is a fact that almost always comes up in debates with sodomites.\n \n What the homosexuals do not mention, of course, is that this sudden change in attitude was not based on any new scientific evidence. As described in the following paragraphs, it was a purely political move, induced by a relentless saturation campaign of deception, intimidation, and unethical collusion between the APA committee and activist sodomite groups.\n \n Preparing the Ground:\n \n In 1968, representatives of activist homosexual groups approached leading psychiatrists and the officers of psychiatric organizations and began to lay the groundwork for the reclassification of their perversions as normal manifestations of human sexuality. \n \n These activists correctly recognized that such a move was absolutely mandatory if they were to win public acceptance. After all, society in general would not look very kindly upon the subsequent lobbying done by a group whose members were officially recognized as \"mentally disordered.\" \n \n In the three years during which the APA's Homosexuality Task Force was deliberating, it collaborated actively with several sodomite groups, including the Gay Activist's Alliance, the Mattachine Society, and the Daughters of Bilitis, while completely ignoring organizations with views that contrasted with the homosexuals. \n \n Abram Kardiner, former Professor of Psychiatry at Columbia University, revealed that \"A powerful lobby of \"gay\" organizations has brought pressure on the American Psychiatric Association to remove homosexuality from the category of aberrancy. This is only one facet of the tidal wave of egalitarianism and divisiveness that is sweeping the country....\"\n \n During this unethical collusion, Kinsey colleague Paul Gebhard said that anyone who was known to harbor the view that homosexuality was a disorder was systematically excluded from being a member of the Task Force or from even being able to present his views or evidence to it.\n \n In other words, the sodomites packed this committee in the same manner that pro-abortionist and fetal tissue harvesters do: Only those people with the \"correct\" viewpoint were allowed to voice an opinion.\n \n But the homosexuals did not focus on the APA alone; they intimidated psychiatrists all over the nation. While the APA Task Force ws preparing its report, any psychiatrist or psychoanalyst who dared present documentation that homosexuality was a psychological disorder (anywhere in the country) was shouted down and even physically attacked at public forums or at local and national meetings of mental health professionals.\n \n The APA Caves In:\n \n The years of hard work put in by the sodomites began to pay off in 1972. The \"National Institute of Mental Health (NIMH) Task Force on Homosexuality Final Report\" parroted Alfred Kinsey's proclamation that \"exclusive heterosexuality\" and exclusive homosexuality\" were \"sexual extremes,\" and that most people were basically bisexual.\n \n This report in turn exerted a great deal of influence on the APA. In order to make its final report appear to be scientific, the APA's Homosexuality Task Force sent a letter to all APA member psychiatritst. This letter did not ask whether or not homosexuality should or should not be declared \"normal.\" It was signed by all candidates for the upcoming elections for the APA presidency and urged all members to \"vote\" that homosexuality was thereafter declared to be on a level with normal sexuality.\n \n This view was so voted by a very slim margin. The letter did not, of course, reveal the fact that it was written and funded by the National Gay Task Force. One of the letter's signers, in fact, later confessed that he knew that such knowledge would have been the \"kiss of death\" for a pro homosexual vote. \n \n Subsequently, the APA eliminated homosexuality as a mental disorder from the 1973 edition of its \"Diagnostic and Statistical Manual.\"\n \n APA member Dr. Henry W. Reicken cut to the heart of the APA's motivation as he wrote a scathing dissent in the appendix to the above mentioned NIMH report entitled \"Detailed Reservations Regarding the Task Force Recommendations on Social Policy:\" \"It is as if they 'the Task Force' said, \"Here is a phenomenon about which we know almost nothing and about which there is a great deal of anxiety and concern; therefore, let us suggest a major revision in public policy for dealing with this phenomenon.\" I cannot escape the belief that this is an utterly unreasonable conclusion to draw from the sea of ignorance and misinformation in which we find ourselves.\"\n \n The Essential Point:\n \n The essential point to be made about this chicanery is that the sudden complete reversal in the APA position on homosexuality was not brought about as a result of a careful regime of scholarly research and study; it was a blatantly political move, a 'vote', of all things, on the status of a mental illness. Furthermore, this vote was undertaken in a climate of deception and intimidation.\n \n At no time before or since has the APA or any other psychological or psychiatric professional group 'ever' addressed a mental health question in this manner.\n \n Behind the Scenes:\n \n It is fascinating indeed to see what psychiatrists 'really' think about homosexuality when they are free of the restraints of intimidation and political pressure.\n \n Almost simultaneously with the 1972 National Institute of Mental Health report, the New York County District Branch of the APA's Task Force on Homosexuality produced a second report. According to APA member Charles Socarides, M.D., the document concluded that \"....exclusive homosexuality was a disorder of psychosexual development, and simultaneously asked for civil rights for those suffering from the disorder.\" \n \n It is even more revealing to examine the results of polls of psychiatrists taken since 1973 regarding the issue of homosexual orientation. \n \n The original \"voting\" letter distributed by the APA Homosexuality Task Force in 1973 was answered by only about one-quarter of the recipients, leading one to speculate that the \"volunteer bias\" ignored by Kinsey in his original studies led to pro-homosexual results. It is quite certain that, if 'all' of the APA members had returned their \"ballots,\" homosexuality would have remained a mental disorder in the view of the organization.\n \n A later series of private surveys which could be answered confidentially and without fear of retaliation showed that two-thirds of APA members psychiatrists regarded homosexuality as abnormal despite the parent organization's switch\n \n More specifically, in 1977, four years after the APA 'switch,' the journal \"Medical Aspects of Human Sexuality\" revealed that it had polled 2,500 psychiatrists on their view of what \"current thinking on homosexuality\" was, and, by a lopsided margin of 69% to 18% (nearly four to one, with 13%undecided). the respondents answered that \"Homosexuality was usually a pathological adaptation as opposed to a normal variation.\"\n \n This is certainly a more accurate poll than the original APA letter because the letter was subject to all of the \"volunteer bias\" that self selected populations exhibit. However, by comparison, the 1977 survey was truly random, and so its results should certainly be given more weight. \n \n \n \n courtesy of: EWTN.com", 
   {}, 
   61883, 
   null, 
   1092330840.0
  ], 
  [
   61886, 
   null, 
   "Jaaaman", 
   "This article has merit and it dismisses the position that the APA holds on homosexuality. emoticon_xhoho", 
   {}, 
   61885, 
   null, 
   1092331080.0
  ], 
  [
   61891, 
   null, 
   "JakeCJB", 
   "This article has merit and it dismisses the position that the APA holds on homosexuality. emoticon_xhoho\n\n \n It doesn't dismiss it. There have been surveys of psychiatrists done since that one survey from back in the 1970's your article showed....\n \n In more recent study, it was reported that 47.3% of psychiatric training directors view homosexuality as normal or somewhat normal, 51.2% view homosexuality as neutral, and 1.5% view it as somewhat pathological or pathological. \n \n Townsend-1995, Academic Psychiatry 19:213-218\n \n The article doesn't dismiss the fact that it still holds the position. No one has been able to come forward with compelling, convincing research that would change their minds, after all this time. Can you dismiss the fact that all the major professional health organizations have also stated that being gay is not a pathology?", 
   {}, 
   61886, 
   null, 
   1092333360.0
  ], 
  [
   61893, 
   null, 
   "Jaaaman", 
   "\n The article doesn't dismiss the fact that it still holds the position. No one has been able to come forward with compelling, convincing research that would change their minds, after all this time. Can you dismiss the fact that all the major professional health organizations have also stated that being gay is not a pathology?\n\n Yes, I can dismiss their statements on this due to the fact that they are also swayed by popular opinion and peer pressure; much like the APA in 1973. None of their positions hold water with me.", 
   {}, 
   61891, 
   null, 
   1092333780.0
  ], 
  [
   61926, 
   null, 
   "JakeCJB", 
   "Yes, I can dismiss their statements on this due to the fact that they are also swayed by popular opinion and peer pressure; much like the APA in 1973. None of their positions hold water with me.\n\n \n They were all swayed by popular opinion to make it a pathology before 1973. There was clearly no convincing science behind homosexuality being a pathology, so that pathology classification hasn't remained.", 
   {}, 
   61893, 
   null, 
   1092346020.0
  ], 
  [
   61927, 
   null, 
   "Waxy", 
   "Yes, I can dismiss their statements on this due to the fact that they are also swayed by popular opinion and peer pressure; much like the APA in 1973. None of their positions hold water with me.\n\n \n So you dismiss the work of thousands of educated and experienced medical professionals based on your credentials and knowledge of the subject.\n \n What are your credentials again?\n \n Assuming you have the necessary credentials, what scientific evidence would you cite for your dismissal of their positions?\n \n What evidence do you have to support your claim that these thousands of professionals (or even a hand full of them) acted purely on the basis of popular opinion and peer pressure?\n \n Unless of course this statement is simply your unfounded, biased, and uneducated opinion on the subject. \n \n Waxy", 
   {}, 
   61893, 
   null, 
   1092347100.0
  ], 
  [
   61947, 
   null, 
   "Duo_Maxwell", 
   "Waxy & JakeCJB, has my asseration that the anti- arguments boil down to lies, fallacies and majority oppression been proven correct?", 
   {}, 
   61927, 
   null, 
   1092353400.0
  ], 
  [
   61950, 
   null, 
   "Jaaaman", 
   "Waxy & JakeCJB, has my asseration that the anti- arguments boil down to lies, fallacies and majority oppression been proven correct?\n\n Well, I have proven the APA's position on homosexuality is bullhockey. Its amazing what peer pressure and politics do to a group of \"educated and experienced medical professionals\". emoticon_wow", 
   {}, 
   61947, 
   null, 
   1092353640.0
  ], 
  [
   61956, 
   null, 
   "Waxy", 
   "Well, I have proven the APA's position on homosexuality is bullhockey. Its amazing what peer pressure and politics do to a group of \"educated and experienced medical professionals\". emoticon_wow\n\n \n Did you read my post? Or do your blinders block it out?\n \n Waxy", 
   {}, 
   61950, 
   null, 
   1092354480.0
  ], 
  [
   61960, 
   null, 
   "Duo_Maxwell", 
   "Jaaaman, I will now refer to you as Jaaaman, the lie, fallacy and majority oppression user.", 
   {}, 
   61956, 
   null, 
   1092354780.0
  ], 
  [
   61962, 
   null, 
   "jitobear", 
   "Well, I have proven the APA's position on homosexuality is bullhockey. Its amazing what peer pressure and politics do to a group of \"educated and experienced medical professionals\". emoticon_wow\n\n \n Well as an individual who actually works in the mental health world, I can tell you what is accepted among practicing mental health professionals - and ah - it's not your bullhockey.", 
   {}, 
   61950, 
   null, 
   1092354900.0
  ], 
  [
   61967, 
   null, 
   "Jaaaman", 
   "Jaaaman, I will now refer to you as Jaaaman, the lie, fallacy and majority oppression user.\n\n Whatever floats your boat. emoticon_xlove", 
   {}, 
   61960, 
   null, 
   1092356100.0
  ], 
  [
   61975, 
   null, 
   "Duo_Maxwell", 
   "Jaaaman: Others and I have proved virtually that all of your arguments are lies, fallacies or majority oppression. You don't have anything else left to throw.", 
   {}, 
   61967, 
   null, 
   1092357660.0
  ], 
  [
   61980, 
   null, 
   "Jaaaman", 
   "Jaaaman: Others and I have proved virtually that all of your arguments are lies, fallacies or majority oppression. You don't have anything else left to throw.\n\n You haven't proven a thing.", 
   {}, 
   61975, 
   null, 
   1092358380.0
  ], 
  [
   61985, 
   null, 
   "Duo_Maxwell", 
   "that's good. \n \n So I haven't highlighted your numerous lies and fallacies?\n So I haven't disproved your arguments by giving contrary examples you can't refute?\n So I haven't given terms that would apply under your logic should it actually be true?\n So I haven't given historical references proving you wrong? \n \n There is a reason you contiunally use the same debuked arguments: because you don't acknowledge that you are wrong. \n \n Everyone knows you won't change your mind, but we do this so that new comers will see how wrong you truly are.", 
   {}, 
   61980, 
   null, 
   1092360000.0
  ], 
  [
   61993, 
   null, 
   "joebrummer", 
   "I too work in mental health. The National Association of Social Workers is one of the biggest supports of the gay rights movement. Along with the APA. I have been reading this for days. You haven't proven a thing you have said. When asked to prove your numbers, you change the subject. The majority of the mental health field supports that homosexuality is no disease or disorder.", 
   {}, 
   61985, 
   null, 
   1092361740.0
  ], 
  [
   62007, 
   null, 
   "rightcustoms", 
   "I have a few questions that I can't seem to get around.\n \n Most people are not gay. This is an undeniable fact. It also is an undeniable fact that it is impossible for two primates of the same sex to produce offspring. It would be logical to conclude that homosexuality is not conducive to reproduction in primates. For example, if all currently living orangutans were homosexual, the species would be extinct in a generation. I have yet to see any explanation as to the benefits of homosexual behavior in primates. (Assuming that all behavior in animals is based upon leading them to their ultimate goal, survival as a species.)\n \n That said, if Darwin is correct then homosexuality would not be a \"naturally selected\" gene. However, the complex social groups found in higher primates may make use of bisexuality as a way to form social bonds between members of the same sex, thus improving the groups chances of survival.\n \n Most major religions have something to say about every aspect of life, including sexuality. In fact, it would seem that sex is so important to many of them, they have very strict rules concerning the participation (or lack of participation) in it. Generally, most religions are simply a mirror of the individual morals and values held by their practitioners. People who disagree with a particular religion simply don't practice it. The whole point of this is that God favors whatever His subjects do, depending entirely on what book they swear by. So, the opinion of God has no bearing on this discussion.\n \n What part does genetics play? I have heard that human homosexuality is a genetic trait. It follows that people who have this gene cannot help but be sexually attracted to their own sex. I also believe that it is entirely possible for people without a genetic predisposition to homosexuality to choose it as a lifestyle. This is probably (in my opinion) due to the inherent need for humans to be part of a social group. While most of us would not choose to have sexual relations with those of the same gender, people will do anything to be part of a group. Catholic priests give up sex altogether to be a part of the clergy, so it stands to reason that a social outcast might choose a lifestyle that is historically very tolerant of individuality. Most of the homosexuals I have been acquainted with were outcasts in school. (Which is a very social environment.) \n \n So, arguing that homosexuality should be accepted behavior on the basis that it is an unavoidable genetic trait has a fatal flaw. It can also be proved that some people are genetically predisposed to criminal behavior. By the same logic, criminal behavior should be excused because they simply \"can't help it\". How do sex offenders play into this? Well, who is to say that a rapist or pedophile can help his or her tendencies any more than a pair of \"consenting adults\".\n \n Basically, gayness will be prevalent as long as society continues to tolerate it. When did we as a society make a distinction between what is \"good\" sexual deviance and \"bad\" sexual deviance? The answer is not so simple. That distinction is of a dynamic nature, and changes to fit social trends. There were a lot less openly gay people in the earlier part of the century, because we were less tolerant of it. In fact, I believe (again, my opinion) that there were less gays back then because those who would choose gayness as a lifestyle (even if they were not genetically predisposed) would be less inclined to do so because of the lack of tolerance.\n \n In conclusion, if you find homosexuality repugnant, then you have a right to be vocal about it. (You do not have a right to harm anyone or infringe their right to do whatever they want in the privacy of their own home, however.) The less tolerant society is of homosexuality, the less prevalent it will become. Those who can't help themselves will always be gay. Those who choose the lifestyle will be pressure socially into rethinking the decisions they have made.", 
   {
    "post_info": {
     "post_title": "Genetics, God, Darwin, and criminal sex offenders"
    }
   }, 
   58227, 
   null, 
   1092367080.0
  ], 
  [
   62013, 
   null, 
   "joebrummer", 
   "I have a few questions that I can't seem to get around.\n \n Most people are not gay. This is an undeniable fact. It also is an undeniable fact that it is impossible for two primates of the same sex to produce offspring. It would be logical to conclude that homosexuality is not conducive to reproduction in primates. For example, if all currently living orangutans were homosexual, the species would be extinct in a generation. I have yet to see any explanation as to the benefits of homosexual behavior in primates. (Assuming that all behavior in animals is based upon leading them to their ultimate goal, survival as a species.)\n \n That said, if Darwin is correct then homosexuality would not be a \"naturally selected\" gene. However, the complex social groups found in higher primates may make use of bisexuality as a way to form social bonds between members of the same sex, thus improving the groups chances of survival.\n \n Most major religions have something to say about every aspect of life, including sexuality. In fact, it would seem that sex is so important to many of them, they have very strict rules concerning the participation (or lack of participation) in it. Generally, most religions are simply a mirror of the individual morals and values held by their practitioners. People who disagree with a particular religion simply don't practice it. The whole point of this is that God favors whatever His subjects do, depending entirely on what book they swear by. So, the opinion of God has no bearing on this discussion.\n \n What part does genetics play? I have heard that human homosexuality is a genetic trait. It follows that people who have this gene cannot help but be sexually attracted to their own sex. I also believe that it is entirely possible for people without a genetic predisposition to homosexuality to choose it as a lifestyle. This is probably (in my opinion) due to the inherent need for humans to be part of a social group. While most of us would not choose to have sexual relations with those of the same gender, people will do anything to be part of a group. Catholic priests give up sex altogether to be a part of the clergy, so it stands to reason that a social outcast might choose a lifestyle that is historically very tolerant of individuality. Most of the homosexuals I have been acquainted with were outcasts in school. (Which is a very social environment.) \n \n So, arguing that homosexuality should be accepted behavior on the basis that it is an unavoidable genetic trait has a fatal flaw. It can also be proved that some people are genetically predisposed to criminal behavior. By the same logic, criminal behavior should be excused because they simply \"can't help it\". How do sex offenders play into this? Well, who is to say that a rapist or pedophile can help his or her tendencies any more than a pair of \"consenting adults\".\n \n Basically, gayness will be prevalent as long as society continues to tolerate it. When did we as a society make a distinction between what is \"good\" sexual deviance and \"bad\" sexual deviance? The answer is not so simple. That distinction is of a dynamic nature, and changes to fit social trends. There were a lot less openly gay people in the earlier part of the century, because we were less tolerant of it. In fact, I believe (again, my opinion) that there were less gays back then because those who would choose gayness as a lifestyle (even if they were not genetically predisposed) would be less inclined to do so because of the lack of tolerance.\n \n In conclusion, if you find homosexuality repugnant, then you have a right to be vocal about it. (You do not have a right to harm anyone or infringe their right to do whatever they want in the privacy of their own home, however.) The less tolerant society is of homosexuality, the less prevalent it will become. Those who can't help themselves will always be gay. Those who choose the lifestyle will be pressure socially into rethinking the decisions they have made.\n\n \n \n Have you consider the possiblity that homosexuality is nature's population control? I know for myself this was no chioce I ever made. In fact I fought it tooth and nail until I was 22 years old. Then I just couldn't fight anymore. I have always known I was gay, When I hit puberty, all my friends were chatting up- gilrs and I was checking them out. I hid it well and went on. \n \n \n I always invite those that do not understand homosexuality to ask me3 anything. I will try to answer in an honest way that promtes understanding.", 
   {}, 
   62007, 
   null, 
   1092369540.0
  ], 
  [
   62030, 
   null, 
   "JakeCJB", 
   "I have a few questions that I can't seem to get around.\n \n Most people are not gay. This is an undeniable fact. It also is an undeniable fact that it is impossible for two primates of the same sex to produce offspring. It would be logical to conclude that homosexuality is not conducive to reproduction in primates. For example, if all currently living orangutans were homosexual, the species would be extinct in a generation. I have yet to see any explanation as to the benefits of homosexual behavior in primates. (Assuming that all behavior in animals is based upon leading them to their ultimate goal, survival as a species.)\n\n \n We haven't seen a situation where everyone and everything is gay, however. Some people are attracted to women, some people to men, some to both. If there was a situation where women were the only ones attracted to women, and men were the only ones attracted to men, that would be incredible. We haven't seen where all women are attracted only to men, and all men are attracted only to women, despite our deliberate efforts to create such a society.\n \n \nThat said, if Darwin is correct then homosexuality would not be a \"naturally selected\" gene. However, the complex social groups found in higher primates may make use of bisexuality as a way to form social bonds between members of the same sex, thus improving the groups chances of survival.\n\n \n Yes, perhaps everyone should be bi-sexual then. However, this doesn't explain the fact that homosexuality exists.\n \n \nWhat part does genetics play? I have heard that human homosexuality is a genetic trait. It follows that people who have this gene cannot help but be sexually attracted to their own sex. I also believe that it is entirely possible for people without a genetic predisposition to homosexuality to choose it as a lifestyle. This is probably (in my opinion) due to the inherent need for humans to be part of a social group. While most of us would not choose to have sexual relations with those of the same gender, people will do anything to be part of a group. Catholic priests give up sex altogether to be a part of the clergy, so it stands to reason that a social outcast might choose a lifestyle that is historically very tolerant of individuality. Most of the homosexuals I have been acquainted with were outcasts in school. (Which is a very social environment.)\n\n \n But were they outcasted because of their being gay? \n \n \nSo, arguing that homosexuality should be accepted behavior on the basis that it is an unavoidable genetic trait has a fatal flaw. It can also be proved that some people are genetically predisposed to criminal behavior. By the same logic, criminal behavior should be excused because they simply \"can't help it\". How do sex offenders play into this? Well, who is to say that a rapist or pedophile can help his or her tendencies any more than a pair of \"consenting adults\".\n\n \n The issue of consent, harm, and interfering with the freedom of others, are why we don't accept rapists, criminals, pedophiles, and blah, blah, blah. We don't accept these behaviours simply because someone may be predisposed somehow by genetics or even by social environment.\n \n \nBasically, gayness will be prevalent as long as society continues to tolerate it. When did we as a society make a distinction between what is \"good\" sexual deviance and \"bad\" sexual deviance? The answer is not so simple. That distinction is of a dynamic nature, and changes to fit social trends. There were a lot less openly gay people in the earlier part of the century, because we were less tolerant of it. In fact, I believe (again, my opinion) that there were less gays back then because those who would choose gayness as a lifestyle (even if they were not genetically predisposed) would be less inclined to do so because of the lack of tolerance.\n\n \n You claim it was less prevelent, but also claim that people were less open about it? So how do you know? Maybe that \"old maid spinster\", or that \"eternal confirmed bachelor\", were gay. Perhaps people were pressured into loveless marriages. They were hypocritical and had secret affairs. Is that a good thing?\n \n \nIn conclusion, if you find homosexuality repugnant, then you have a right to be vocal about it. (You do not have a right to harm anyone or infringe their right to do whatever they want in the privacy of their own home, however.)\n\n \n I can't imagine bigots not being vocal.\n \n \nThe less tolerant society is of homosexuality, the less prevalent it will become.\n\n \n You haven't proven this.\n \n \nThose who can't help themselves will always be gay\n Those who choose the lifestyle will be pressure socially into rethinking the decisions they have made.\n\n \n And if those who didn't choose to be gay are hurt by that, they are just collatoral damage? If there are those who chose it, why do they have be treated badly? Perhaps that's the only thing that will possibly keep them away from their true gay identity? If that's the only thing, they were never straight in the first place.", 
   {}, 
   62007, 
   null, 
   1092374280.0
  ], 
  [
   62033, 
   null, 
   "rightcustoms", 
   "We haven't seen a situation where everyone and everything is gay, however. Some people are attracted to women, some people to men, some to both. If there was a situation where women were the only ones attracted to women, and men were the only ones attracted to men, that would be incredible. We haven't seen where all women are attracted only to men, and all men are attracted only to women, despite our deliberate efforts to create such a society.\n Very true. That's why the study of small groups of non human primates is so interesting. I disagree that deliberate attempts are being made to create a strictly heterosexual society, however. On the contrary, I believe (in America at least) there have been deliberate efforts made by special interest groups to promote homosexuality, and they are succeeding largely due to apathy on the part of mainstream society.\n \n Yes, perhaps everyone should be bi-sexual then. However, this doesn't explain the fact that homosexuality exists.\n \n I never denied the existence of homosexuality. I do question it's purpose in the evolution of primates, particularly humans. If it is indeed a genetic trait (and as common as we are led to believe), then there must be some evolutionary purpose for it. I don't believe a single genetic trait constitutes a \"culture\" however. For instance, many of the openly gay people where I live have a different \"dialect\" or way of speaking. This is a learned behavior. No person is born \"flamboyant\", gay or otherwise. Still, the gay culture is historically very flamboyant. It is this culture that I believe attracts people who may not necessarily be genetically homosexual, but are culturally gay and have same sex partners anyway. Perhaps I chose my words poorly. I am not in the least bit offended by genetic homosexuality. I am very offended by the idea that it should be accepted as a \"culture\". \n \n \n But were they outcasted because of their being gay?\n \n This is too much like a chicken before the egg thing, so I'm not going near it. If \"gay\" were not a catch-all explanation for teenage awkwardness, perhaps people would come out if adolescence without wondering who they were supposed to be attracted to.\n \n The issue of consent, harm, and interfering with the freedom of others, are why we don't accept rapists, criminals, pedophiles, and blah, blah, blah. We don't accept these behaviors simply because someone may be predisposed somehow by genetics or even by social environment.\n \n Then genetic predisposition cannot be an argument for going against mainstream society.\n \n You claim it was less prevalent, but also claim that people were less open about it? So how do you know? Maybe that \"old maid spinster\", or that \"eternal confirmed bachelor\", were gay. Perhaps people were pressured into loveless marriages. They were hypocritical and had secret affairs. Is that a good thing?\n \n Well, the divorce rate is certainly up. People are having more secret affairs now. More children are being born to single mothers. Perhaps social pressure to remain in a monogamous heterosexual marriage ain't so bad. You might be right, the very fact that people were quiet about their homosexuality may have made it appear to be less prevalent than it really was. Is that a bad thing? People who are gay are not going to stop being gay because they don't have a \"culture\". What I question is how a sexual orientation qualifies as a culture. You don't see straight pride parades. That's like having a parade celebrating the fact that you have ten fingers and ten toes. So does almost everyone else, so it's not novel enough to warrant celebration. If the world had been 50% straight 25% gay and 25% lesbian and open about it for centuries, I doubt it would be cause for a parade. It would be a commonplace understanding as mundane as being born with the right number of digits. Also, if this were so, there might actually be enough people with the gene to warrant a \"subculture\" within a given culture, but I doubt each culture across the globe would have it's own gay subculture. \n \n Be careful assigning the term \"bigot\" to people. Everyone has their own definition that can differ greatly when a dictionary isn't nearby. I for instance, don't care if there are more gay men than straight ones. That leaves more potential partners for heterosexuals. What I don't like, and am vocal about, is the idea that homosexuality should be explored by confused people. If anything, it should be left for those who know they're gay. If you need to experiment to know, then you are definitely confused.\n \n I do think that if '\"gay culture\" was less prevalent, then people who were not genetically predisposed might not choose it as a lifestyle and as a direct result less people would decide to be \"gay\". This would leave us with less \"social gays\" and the genuine homosexuals would not be affected. How could it be bad to weed out the fakes, so to speak? Would you promote an alternate sexual lifestyle for those who might only be choosing it because of social pressure rather than genetic predisposition? If it is wrong to stifle homosexuality, then it is just as wrong to accept confused heterosexuals into a gay culture.\n \n And if those who didn't choose to be gay are hurt by that, they are just collatoral damage? If there are those who chose it, why do they have be treated badly? Perhaps that's the only thing that will possibly keep them away from their true gay identity? If that's the only thing, they were never straight in the first place.\n \n How are gays damaged? Are you implying that gay people will suffer if those among them who are not truly homosexual suddenly \"switched sides\" en masse? I am not suggesting treating anyone badly. I only suggest that the social acceptance of homosexuality as something more than a sexual preference is directly responsible for potentially heterosexual people choosing it as a lifestyle. The more people that join a particular social group, the more people will want[ to join it. I think there should be a distinction between genetic homosexuality and gay culture. They both exist, but all gays are not necessarily homosexual. For that matter, all homosexuals are not necessarily gay in the cultural sense. Some dress normally, speak normally, carry themselves normally, and make no attempt at in-your-face social rebellion. (For the purpose of this discussion, \"normal\" shall mean that standard by which the majority of society behaves.)\n For those gays who choose to create a false culture by speaking, dressing, talking, and acting different (than normal), I think it would be much easier to just conform, and buy a rainbow for your car's bumper. If you want people to know you're gay, tell them. No need to create a whole new way to interact on every level just because you have different bedroom habits. That's pretty selfish when the rest of us do our best to fit in.", 
   {}, 
   62030, 
   null, 
   1092379920.0
  ], 
  [
   62043, 
   null, 
   "Jaaaman", 
   "Have you consider the possiblity that homosexuality is nature's population control? I know for myself this was no chioce I ever made. In fact I fought it tooth and nail until I was 22 years old. Then I just couldn't fight anymore. I have always known I was gay, When I hit puberty, all my friends were chatting up- gilrs and I was checking them out. I hid it well and went on. \n \n \n I always invite those that do not understand homosexuality to ask me3 anything. I will try to answer in an honest way that promtes understanding.\n\n Homosexuality can be cured and that studies show that long-term, monogamous relationships for homosexual couples are unlikely.\n The success rate for reparative therapy is about one-third, about the same as the success rate in other psychotherapy.\n \n There are not two kinds of people - homosexual and heterosexual, there are two kinds of people - heterosexuals who know that they are heterosexual and heterosexuals who don't know that they are heterosexual.\n \n There is no scientific evidence of a homosexual gene or any of the other politically correct explanations of homosexuality.\n \n The actual fact is that long-term relationships are almost non-existent among homosexuals. Studies show the number of couples who are able to maintain fidelity for longer than five years is zero.", 
   {
    "unicode_changes_made": true
   }, 
   62013, 
   null, 
   1092401460.0
  ], 
  [
   62049, 
   null, 
   "joebrummer", 
   "As usual, I see your numbers are a bit off. Reparative therapy is not only BS. It is very dangerous. As for it's success rate? read below\n \n From the available data, four studies reported a \"success\" rate during conversion therapy of 0.4%, 0.0%, 0.0 and 0.04%. That is, conversion therapy has a failure rate in excess of 99.5% during each study. Considering the anecdotal data which indicates a large percentage of extremely depressed and suicidal clients emerging from conversion therapy, it would appear that this form of therapy is worthless. It my well result in the death by suicide of more gays and lesbians than it \"converts\" to a heterosexual orientation. Unfortunately, we cannot be certain of this. The quality of the studies is extremely poor.\n \n http://www.religioustolerance.org/hom_exod1.htm", 
   {}, 
   62043, 
   null, 
   1092411360.0
  ], 
  [
   62073, 
   null, 
   "JakeCJB", 
   "Homosexuality can be cured and that studies show that long-term, monogamous relationships for homosexual couples are unlikely.\n\n \n There is much evidence of long-term relationships for gay couples(that do last more than five years)...\n \n http://sfgate.com/cgi-bin/article.cgi?f=/c/a/2004/02/27/MNG1H59R5Q1.DTL\n \n http://www.usatoday.com/money/perfi/general/2004-05-16-gay-seniors_x.htm\n \n http://www.usc.edu/isd/archives/oneigla/onepress/abstracts/malecouple.html\n \n http://www.abc.net.au/correspondents/content/2004/s1065302.htm\n \n Being gay is not an illness, so it cannot be cured.\n \n \nThe success rate for reparative therapy is about one-third, about the same as the success rate in other psychotherapy.\n\n \n That is not true, as Joe pointed out, and has been pointed out over and over again in this forum.\n \n \nThere are not two kinds of people - homosexual and heterosexual, there are two kinds of people - heterosexuals who know that they are heterosexual and heterosexuals who don't know that they are heterosexual.\n\n \n Sounds like a closet case trying to convince himself to be straight, or a guy who expects every woman to want him.\n \n \nThere is no scientific evidence of a homosexual gene or any of the other politically correct explanations of homosexuality.\n\n \n Therefore what we are talking about, doesn't exist? Give me a break.", 
   {
    "unicode_changes_made": true
   }, 
   62043, 
   null, 
   1092422700.0
  ], 
  [
   62094, 
   null, 
   "jitobear", 
   "Homosexuality can be cured and that studies show that long-term, monogamous relationships for homosexual couples are unlikely.\n \n\n \n I know three gay couples, 10, 6, and 16 years. And all are happy.", 
   {}, 
   62043, 
   null, 
   1092430680.0
  ], 
  [
   62130, 
   null, 
   "JustineCredible", 
   "I disagree LadyOreo. We are harming our children's well-being by allowing gay marriages.\n \n Teenagers will also suffer from the effects of homosexuality. When you are a teenager, you want to try everything out. \n\n \n Really? Everything? \n Ok, this only leads me to believe that somewhere down the line of growing up you actually tried everything and were disappointed in it's results.\n \n \n\n You are not very sure of yourself or what is good for you, and you long to be accepted by your peers. When you are not accepted, you start to wonder if something is wrong with you. You begin to explore different things in order to find an answer. Many young men have been led down to the path of homosexuality during this crisis time. The homosexual lifestyle leads to high rates of suicide, depression, HIV, drug abuse, STDs, and other pathogens.\n\n \n Pathogens? Hate to remind you that not all drug use causes death. Not all sexual relations cause death. Many STDs are easily treatable, not to mention are not the sole property of sexual encounters.\n Depression is not a pathogen. Treatment is painful but can be sucessful. \n \n \n Gay marriage may cause children to think, \"I have another alternative if I get rejected from my girlfriend.\" Instead of training our children to resolve conflict and face their problems, we mess up their minds more by saying, \"we accept you and your wrong behavior as being ok.\" Instead of trying to give a child an alternative to solve a problem, we as parents and teachers should be teaching our children problem solving skills. How do you expect our children to be able to work with people if we don't teach them problem-solving skills?\n\n Good question. I would suppose that somehow you may have been taught problem solving skills that tells you to simply hate everything you don't understand. \n \n Oh, sure, there will always be those in the GLBT population which are \"testing the waters\" out of having been rejected by a partner down the line. But in the exact same light there are those Homosexuals who are still living as a heterosexual because they got the silly notion that if they behaved like a heterosexual they will somehow become one. \n The problem here is that just because you behave like one doesn't make it true. \n I could listen to rap, get braids in my hair, wear black face paint, and only date people of African descent. But that doesn't make me African-American.\n It makes me a very confused person and sadly in need of care. \n You see, there are those individuals on BOTH sides of the sexuality fence. Until all people stop judging, start accepting people for who they are, stop instilling fear and misinformation (which in some is indeed equated to hate) into their children. We ALL will continue to damage them. \n \n What you adimately refuse to see is that you just might be wrong. You post supposed information which you cannot and will not back up. You refuse to list your sources. \n Sorry to say, that only makes your credibility questionable at best.", 
   {
    "unicode_changes_made": true
   }, 
   58880, 
   null, 
   1092445740.0
  ], 
  [
   62135, 
   null, 
   "JustineCredible", 
   "Its more than that Waxy. \n Same-sex familys will teach little boys and girls that husband/wife and mother/father are merely optional for the family and therefore, meaningless.\n I will never allow my children or grandchildren (if I ever have any) to be taught that their gender doesn't matter for the family. Their masculinity and femininity matter far too much, as does everyone elses.\n\n \n \n I feel sorry for any offspring you might have. \n Just because a man has femine traits does NOT make them gay. Just because a woman is strong doesn't mean she is a lesbian. \n Just because a man doesn't swing his hips or talk with a lisp, does NOT mean they are straight. \n Just because a woman wears dresses and actually enjoys puting on make-up does NOT make her straight. \n \n You're antiquated ideals on what equals feminity or masculinity are outdated at best. \n \n What would you say to Bill Clinton? Ah, sure he's a letch and a two timing bastard, but come on he did sucessfully earn a law degree, he rose to the highest job in the land. And he was the child of a SINGLE mother. \n His actions were not the result of not having a father figure at all. Many more men who do have involved fathers behave exactly the same way, by objectifying women. \n \n Rush Limbaugh not only has had an affair but was accused of spousal abuse, as well as a conviction of drug abuse. He was raised in a \"whole\" family with a mom and a dad and his brother. \n He actually stated:\"9 Dec 1993 \"If [Surgeon General Jocelyn Elders] wants to legalize drugs, send the people who want to do drugs to London and Zurich, and let's be rid of them.\" Rush Limbaugh, admitted drug addict, inexplicably still lives in America. \n So don't go on to tell me that intact or two gender, two parent homes always pop out great kids. \n That's BUNK~!", 
   {
    "unicode_changes_made": true
   }, 
   59010, 
   null, 
   1092447180.0
  ], 
  [
   62139, 
   null, 
   "JustineCredible", 
   "Well, I agree that they can raise a child, and that raising by a straight couple does not guarantee bringing up a normal child.\n \n But see, to answer your question, and JakeCB's questions, I say, that if a child in a gay couple is not gay (yet see, Jake was talking about a SECURE IDENTITY, but children DO NOT have a secure identity) then he'd RATHER be raised in in a NOT GAY family. You see the point? The NOT GAY child needs a mother and a father, not a father and a father or a mother and a mother, because this won't give him a GOOD model for his NOT GAY identity.\n\n \n Funny, because most gays were raised by STRAIGHT FAMILIES! \n \n \n \nAs for statistics, see, because you don't have many gay marriages, you don't have much statistics on gay divorce. So if gay marriages ever become many (which I hope will not happen) you will see the true stats.\n\n \n Please, divorce is already the leading cause of fatherless children. No good louses who don't take up their responcibility are the second. \n \n \n \nTo JakeCB:\n \n No, when I say that I hate the thought of a gay liking me (for my body and my masculinity) I am not proving a point, that gays are a threat to my masculinity. Absolutely not. You abuse this argument, it's not based on anything. See, there are two definitions. MASCULINITY and FEMININITY. For straight people masculine in men is liked by women, feminine in women is liked my men. So the prove of my masculinity is not that EVERYONE (both men and women) like me. For gays and lesbians yes, it is a prove, but well, for a zoofile, maybe the fact that a dog likes him, it's good.\n \n\n \n Typical, there you go again using confussion tactics to somehow win your argument. ANIMALS & HUMANS...not really the same thing. Agh...\n \n \n \n To me it's sick, that's it. Yes, I can say I like Brad Pitt. He's got a well built body. Am I a gay because I think so? Do I threaten him (even if he knew me)? I don't think so. So you use false arguments, sir. Just because you want to prove you point, you twist the reality and twist definitions. I don't respect that.\n\n \n Again you confuse issues. Brad Pitt is straight, he is also a well known celebrity. The mere idea that you would even get close enough to him to threaten him is beyond rediculous. \n I get hit on by straight men. Do I lash out? Do I get offended? No. I simply smile and say \"Sorry, not interested. Nothing personal, I'm sure you're a nice person...it's just that I'm not interested.\"\n I certainly don't hate straight men, nor do I secretely look for their approval. Nope, as I said, I'm not interested. They do nothing for me in any, way shape or form. \n I am not indecisive at all. I know what I want. I always have. Even when I was young and confused about social norms and acceptability, I still knew what I wanted. \n Granted, learning to act on what I wanted and what would actually make me a happier person took some learning and growing on my part. \n But it doesn't change the fact that I always knew.", 
   {}, 
   59405, 
   null, 
   1092447900.0
  ], 
  [
   62143, 
   null, 
   "JustineCredible", 
   "Homosexuality can be cured and that studies show that long-term, monogamous relationships for homosexual couples are unlikely.\n The success rate for reparative therapy is about one-third, about the same as the success rate in other psychotherapy.\n\n \n Exodus International and other \"reparitive therapies\" are NOT concidered as ligitimate by the American Psychiatric Association. In fact the APA actually put out a warning regarding supposed \"Repairitive Therapy\" or \"Conversion therapy.\" \n Most are run by evangelical ministries which figure that if a person is gay it's because they don't pray hard enough. \n \n \nThere are not two kinds of people - homosexual and heterosexual, there are two kinds of people - heterosexuals who know that they are heterosexual and heterosexuals who don't know that they are heterosexual.\n\n \n I have to wonder if in fact you either are a member of one of these supposed \"therapies\" or are a client who has sucessfully been brainwashed by them.\n \n \nThere is no scientific evidence of a homosexual gene or any of the other politically correct explanations of homosexuality.\n\n \n Actually there is no scientific evidence of a gene for left-handedness either, yet we don't continue to beat a child if he/she uses their left hand. In fact we simply accept it as part of who the child is. We have also found many positive attributes that go along with being left handed. Higher artistic abilities...etc. \n There is no genetic evidence of hair color either. The only thing we can find is that it's likely that a child of two brunettes will be a brunette.\n The mere fact there are redheads is an anomily. They are hated or beaten for being redhaired. \n \n \nThe actual fact is that long-term relationships are almost non-existent among homosexuals. Studies show the number of couples who are able to maintain fidelity for longer than five years is zero.\n\n \n \n Hmmm...ever dared to concider that because legal marriage is NOT allowed that it actually contributes to the lack of longevity in homosexual couples? What do you think would happen if heterosexual marriages were made illegal? \n There would be no legal ramifications to seperating. There would be no real structure or need to stay together. \n Because popular media shows promiscuous gays as the norm, that is in fact promoting that exact sort of behavior. :xbanghead", 
   {
    "unicode_changes_made": true
   }, 
   62043, 
   null, 
   1092449760.0
  ], 
  [
   62156, 
   null, 
   "rightcustoms", 
   "One day about three years ago, I was walking down a trail in a park. This trail is an 'arboretum trail' with signs giving names and descriptions of different trees, etc. I was in the process of looking for a geocache (an outdoor game played with GPS receivers) when I left the trail following my GPS receiver to narrow my search. A lone man had been following me a little way behind for most of the trail. I had turned back to cross the trail and search on the other side when I noticed this man staring at me. As I headed back to the trail, I said \"Hi\", and continued my search. He remained, silent, motionless and watchful. After a while I began to feel uncomfortable. Who was this guy and why was he watching me? \n Fast forward to last year. One of my friends and I go in search of another geocache in the same park. This time, we are successful. My friend left me at the cache and went to his car to get a pen to sign the logbook. When he returned he informed me that a man had pulled alongside him in his car as he walked, and made a gesture that can only be interpreted as a depiction of fellatio. \n When we left the cache and went back to the car, we went with newly opened eyes. Looking around, we saw car after car with a single male occupant. At that moment we realized we had inadvertently stumbled upon a \"cruising\" spot (a gathering place for gay men looking for sex).\n At that moment I recalled the strange behavior of the man who had followed me on that trail the last time I was out there. He was I suppose interested in engaging in gay sex with me, but fortunately for both of us cautious enough not to make his intentions known.\n \n So, if the question is why straight men are afraid of gay men, here's one of the answers. The guy in that park was significantly stronger than me and could have easily overpowered me if he chose to. \n You might say that to assume he had something like that in mind is going too far, but consider this...\n Who in their right mind finds sex partners by stalking them on trails, making obscene gestures from their automobiles, and is ready to engage in sex with complete strangers?\n I don't want a strange man who to be following me around a half mile into the woods hoping to have sex with me. This behavior is inexcusable. The possibility that some straight people might engage in it is not a valid defense.\n \n Normal \"straight\" people go through the usual channels to meet each other. They generally don't go to public parks on their lunch breaks and solicit anonymous sex. They don't risk subjecting children to their decadent behavior in a public park in the middle of the day. I know, \"all gays are not like that, and some straight people are\". Let me ask you this, what does the respectable mainstream gay community have to say about public \"cruising\", and what do they propose to do about it?\n \n If you have any problem with my use of the term \"decadence\", then explain why New Orleans has a gay festival by that name. By their own admission, the gay culture is decadent.", 
   {
    "post_info": {
     "post_title": "If the question is why, here's part of the answer."
    }
   }, 
   62143, 
   null, 
   1092456480.0
  ], 
  [
   62166, 
   null, 
   "JakeCJB", 
   "One day about three years ago, I was walking down a trail in a park. This trail is an 'arboretum trail' with signs giving names and descriptions of different trees, etc. I was in the process of looking for a geocache (an outdoor game played with GPS receivers) when I left the trail following my GPS receiver to narrow my search. A lone man had been following me a little way behind for most of the trail. I had turned back to cross the trail and search on the other side when I noticed this man staring at me. As I headed back to the trail, I said \"Hi\", and continued my search. He remained, silent, motionless and watchful. After a while I began to feel uncomfortable. Who was this guy and why was he watching me? \n Fast forward to last year. One of my friends and I go in search of another geocache in the same park. This time, we are successful. My friend left me at the cache and went to his car to get a pen to sign the logbook. When he returned he informed me that a man had pulled alongside him in his car as he walked, and made a gesture that can only be interpreted as a depiction of fellatio.\n\n \n Hearsay. Maybe the other guy was just looking at you. So what?\n \n \nWhen we left the cache and went back to the car, we went with newly opened eyes. Looking around, we saw car after car with a single male occupant. At that moment we realized we had inadvertently stumbled upon a \"cruising\" spot (a gathering place for gay men looking for sex).\n At that moment I recalled the strange behavior of the man who had followed me on that trail the last time I was out there. He was I suppose interested in engaging in gay sex with me, but fortunately for both of us cautious enough not to make his intentions known.\n \n So, if the question is why straight men are afraid of gay men, here's one of the answers. The guy in that park was significantly stronger than me and could have easily overpowered me if he chose to. \n You might say that to assume he had something like that in mind is going too far, but consider this...\n\n \n Yes it is. There is no reason for you to assume that at all. Perhaps you are paranoid. Given your reactions, I'm not even sure you had stumbled upon a \"gay cruising spot\". But then, you are constantly paranoid that gay culture will convert you, I can tell by your previous post on this thread. I think maybe you doth protest too much, or perhaps you are afraid a gay man will treat you as badly as some straight men treat women. \n \n \nWho in their right mind finds sex partners by stalking them on trails, making obscene gestures from their automobiles, and is ready to engage in sex with complete strangers?\n I don't want a strange man who to be following me around a half mile into the woods hoping to have sex with me. This behavior is inexcusable. The possibility that some straight people might engage in it is not a valid defense.\n \n Normal \"straight\" people go through the usual channels to meet each other. They generally don't go to public parks on their lunch breaks and solicit anonymous sex.\n\n \n Many straight guys would brag about it if they did this kind of thing(and they do). Many would call those straight guys, \"studs\".\n \n \nThey don't risk subjecting children to their decadent behavior in a public park in the middle of the day. I know, \"all gays are not like that, and some straight people are\".\n\n \n I've seen straight people act decadent in parks.\n \n \nLet me ask you this, what does the respectable mainstream gay community have to say about public \"cruising\", and what do they propose to do about it?\n\n \n Straight people cruise too. They cruise all the time and everywhere. What does the straight community propose to do about it?\n \n \nIf you have any problem with my use of the term \"decadence\", then explain why New Orleans has a gay festival by that name. By their own admission, the gay culture is decadent.\n\n \n Decadent is not necessarily a bad thing. Ever heard of Mardi Gras, where women bear their breasts for some cheap tacky beads?", 
   {}, 
   62156, 
   null, 
   1092460500.0
  ], 
  [
   62167, 
   null, 
   "Mach", 
   "I suspect it's 90% a society issue.\n \n American men may fear gay men because of the negative social impact it can have on them. Gay men in this country are seen with a great many negative stereotypes. Why would a straight man want to associate or be seen to act like, anyone who is seen in a negative way by their society? Substutute \"gay man\", with \"known criminal\", or any other negative and you'd get the same response.\n \n -Mach", 
   {
    "post_info": {
     "post_title": "society"
    }
   }, 
   58227, 
   null, 
   1092460620.0
  ], 
  [
   62170, 
   null, 
   "Mach", 
   "\n So, if the question is why straight men are afraid of gay men, here's one of the answers. The guy in that park was significantly stronger than me and could have easily overpowered me if he chose to. \n You might say that to assume he had something like that in mind is going too far, but consider this...\n Who in their right mind finds sex partners by stalking them on trails, making obscene gestures from their automobiles, and is ready to engage in sex with complete strangers?\n I don't want a strange man who to be following me around a half mile into the woods hoping to have sex with me. This behavior is inexcusable. The possibility that some straight people might engage in it is not a valid defense.\n .\n\n \n There was nothing that made your situation out of the oridnary other than perhaps you've never been the object other men around you desired. Step into a woman's shoes for a week and you'll come to understand that your shocking experience, is no different than any experience someone has when they are pursued sexually by a male. I.e. women put up with this **** 24/7, it has nothing to do with \"gay\", and everything to do with a sexually confident male. Log in to a popular chat room with a female name and bio for some therapy on just how aggresive for sex with a stranger that your brothers can be.\n \n Don't get me wrong, I think that's eerie too, to be approached like that, and you're justified in being weirded out. But it's a male thing, not a gay thing. The only difference is it's less frequent for straight males to be hit on like that, so you've associated with gays, rather than the more general \"males\".\n \n -Mach", 
   {
    "post_info": {
     "post_title": "gay"
    }
   }, 
   62156, 
   null, 
   1092461580.0
  ], 
  [
   62173, 
   null, 
   "rightcustoms", 
   "Maybe the other guy was just looking at you. So what?\n \n Perhaps. But given the circumstances I'd be willing to bet I'm right about his mindset.\n \n Given your reactions, I'm not even sure you had stumbled upon a \"gay cruising spot\". But then, you are constantly paranoid that gay culture will convert you, I can tell by your previous post on this thread.\n \n This is a common tactic in arguments like this, implying that the other side is a latent homosexual or has a fear of conversion. This makes no sense. How could you convert someone who does not find homosexuality appealing? If your object in this discussion is to make me find men sexually attractive, you are wasting your time. What reactions do you refer to? I told the guy \"Hi\" and went about my business. It wasn't until the nature of the park as a known \"cruising spot\" became known to me that I put two and two together and was able to explain his odd behavior.\n \n I've seen straight people act decadent in parks.\n \n I can honestly say that I haven't seen straight people cruising for anonymous sex during the middle of the day in a public park. Given the fact that most people are straight, and the only people I have encountered doing this are gay, I conclude that a larger percentage of gays do this than straight people.\n \n Straight people cruise too. They cruise all the time and everywhere. What does the straight community propose to do about it?\n \n This is evasive. You offer no solution or explanation for the apparent higher percentage of gay cruisers. Speaking as a straight man (who's opinion of gays you presumably wish to improve), I can tell you that I perceive it as a problem that is more specific to your demographic. Some have laws against certain sex acts which are rarely enforced (except when people are caught in the act in public). Gays like to call this discrimination, when in fact it is a valid solution used for the prosecution of people engaging in public sex regardless of their sexuality.\n \n Decadent is not necessarily a bad thing. Ever heard of Mardi Gras, where women bear their breasts for some cheap tacky beads?\n \n Do you approve of this practice? If not, then why use it as an excuse for the decadence within the gay community. Obviously you don't find women's breasts attractive, so how would you classify their bearing them publicly as a good thing?\n \n There was nothing that made your situation out of the oridnary other than perhaps you've never been the object other men around you desired. Step into a woman's shoes for a week and you'll come to understand that your shocking experience, is no different than any experience someone has when they are pursued sexually by a male. I.e. women put up with this **** 24/7, it has nothing to do with \"gay\", and everything to do with a sexually confident male. Log in to a popular chat room with a female name and bio for some therapy on just how aggresive for sex with a stranger that your brothers can be.\n \n \n I don't agree that being the object of sexual desire by the opposite sex equates to what happened to me. When I go out with my friends socially, and get the impression that a woman is attracted to me, I find the experience pleasant. I don't relish the idea of attracting men.\n Allow me to explain the difference. Many gay men adopt feminine mannerisms even to the point of dressing in drag. This makes little sense when you are attempting to attract someone who doesn't find women attractive, unless you are vainly trying to fool a straight man into sleeping with you.\n How a room full of men who are dressed like women but are attracted to men ever wind up together is baffling. \n Anyway, the only other possibility is that gay men really are attracted to women, and that explains why they are attracted to effeminate men. So, if a gay finds me attractive, there is a possibility that he finds me effeminate, a condition I wish to avoid. I'm not trying to attract men, gay or otherwise, so feminine traits will not serve my best interests. If I happen to have some, finding out by inadvertently attracting a man would be unpleasant to say the least.", 
   {}, 
   62170, 
   null, 
   1092466860.0
  ], 
  [
   62176, 
   null, 
   "JakeCJB", 
   "Maybe the other guy was just looking at you. So what?\n \n Perhaps. But given the circumstances I'd be willing to bet I'm right about his mindset.\n\n \n Why does his mindset bother you?\n \n \nThis is a common tactic in arguments like this, implying that the other side is a latent homosexual or has a fear of conversion. This makes no sense. How could you convert someone who does not find homosexuality appealing?\n\n \n You said in a previous post that some people who are not really gay, find the culture attractive, and go though with gay relationships anyway, for that reason.\n \n [QUOTE=rightcustoms]If your object in this discussion is to make me find men sexually attractive, you are wasting your time. What reactions do you refer to? I told the guy \"Hi\" and went about my business. It wasn't until the nature of the park as a known \"cruising spot\" became known to me that I put two and two together and was able to explain his odd behavior.\n \n \nI can honestly say that I haven't seen straight people cruising for anonymous sex during the middle of the day in a public park. Given the fact that most people are straight, and the only people I have encountered doing this are gay, I conclude that a larger percentage of gays do this than straight people.\n\n \n I've seen straights act out and cruise in public parks, on a beach, on the sidewalk, in a hallway, and everywhere else.\n \n \nThis is evasive. You offer no solution or explanation for the apparent higher percentage of gay cruisers.\n\n \n An apparently higher percentage of gay cruisers, because of the blinders you wear. Cruising is just so accepted in the larger straight world it is not recognized the same way or labelled the same way. Why do I need to offer a solution? I don't see a problem.\n \n \nSpeaking as a straight man (who's opinion of gays you presumably wish to improve),\n\n \n You are not interested in learning about gay people. You are interested in being patronizing and condescending, in moralizing, and in making generalizations and in promoting stereotypes.\n \n \nDo you approve of this practice? If not, then why use it as an excuse for the decadence within the gay community. Obviously you don't find women's breasts attractive, so how would you classify their bearing them publicly as a good thing?\n\n \n It's neither a good nor a bad thing. Because you heard of a gay event called \"Decadence\", any gay person is required to offer some kind of excuse? No. \n \n \nI don't agree that being the object of sexual desire by the opposite sex equates to what happened to me. When I go out with my friends socially, and get the impression that a woman is attracted to me, I find the experience pleasant. I don't relish the idea of attracting men.\n Allow me to explain the difference. Many gay men adopt feminine mannerisms even to the point of dressing in drag. This makes little sense when you are attempting to attract someone who doesn't find women attractive, unless you are vainly trying to fool a straight man into sleeping with you.\n\n \n They don't necessarily do it for the purposes of attracting other gay men. Straight men cross dress as well.\n \n \n How a room full of men who are dressed like women but are attracted to men ever wind up together is baffling.\n\n \n Why do you care? One can tell most drag queens are male. It's not a room full who are all in drag.\n \n \nAnyway, the only other possibility is that gay men really are attracted to women, and that explains why they are attracted to effeminate men.\n\n \n Again, one can tell that most drag queens are male. Many do it to be kitchy or campy, to show off maximum fashion sense, or to be like their favourite star diva. Some are very talented performers on a stage. There are many reasons. We are certainly not talking about the majority of gay men who do drag.\n \n \nSo, if a gay finds me attractive, there is a possibility that he finds me effeminate, a condition I wish to avoid. I'm not trying to attract men, gay or otherwise, so feminine traits will not serve my best interests. If I happen to have some, finding out by inadvertently attracting a man would be unpleasant to say the least.\n\n \n Finding out that you may have more feminine traits is unpleasant? Watch it, you may be revealing a misogynistic side of yourself. Do you think there aren't many straight women who wouldn't welcome some more feminine traits, such as sensitivity? Why do you think many straight women like to hang around gay men? Actually, there are many butch gay men. They even have their own clubs and groups within the gay community.", 
   {}, 
   62173, 
   null, 
   1092469860.0
  ], 
  [
   62181, 
   null, 
   "rightcustoms", 
   "Why does his mindset bother you?\n \n I think that's already clear. It makes me uncomfortable to know that a man might be fantasizing about having sex with me. \n \n You said in a previous post that some people who are not really gay, find the culture attractive, and go though with gay relationships anyway, for that reason.\n \n Does this mean that you wish to \"convert\" people who are not, and never will be truly homosexual in order to swell your ranks?\n \n \n \n An apparently higher percentage of gay cruisers, because of the blinders you wear. Cruising is just so accepted in the larger straight world it is not recognized the same way or labelled the same way. Why do I need to offer a solution? I don't see a problem.\n \n Blinders? Is that how you describe the difference between a welcome advance made by a woman and an unwelcome advance made by a man? I don't think it's unreasonable for people to be more sensitive to things that they find disconcerting. Perhaps your blinders are what prevents you from \"seeing\" the problem.\n \n You are not interested in learning about gay people. You are interested in being patronizing and condescending, and making generalizations and in promoting stereotypes.\n \n Exactly which stereotypes are you accusing me of promoting? That gay men behave differently? Come on now. \n \n Because you heard of a gay event called \"Decadence\", any gay person is required to offer some kind of excuse?\n \n Who better? \n \n They don't necessarily do it for the purposes of attracting other gay men. Straight men cross dress as well.\n \n How do you know they are straight? If anyone is potentially \"in\", then this means nothing. And for that matter why do it at all if not to fly in the face of convention. Very rarely, some brave person does something completely radical and it becomes the norm. Gays have been dressing in drag for years and it hasn't caught on yet. Might be fun at a party, but I doubt you'll see men wearing dresses to business meetings any time soon.\n \n Why do you care? One can tell most drag queens are male. It's not a room full who are all in drag.\n \n I care because contrary to your assertion, I am interested in learning what makes you guys tick.\n \n Many do it to be kitchy or campy, to show off maximum fashion sense, or to be like their favourite star diva. Some are very talented performers on a stage. There are many reasons. We are certainly not talking about the majority of gay men who do drag.\n \n Do you think these are reasons the straight cross dressers you mentioned do it? \n \n Finding out that you may have more feminine traits is unpleasant? Watch it, you may be revealing a misogynistic side of yourself. Do you think there aren't many straight women who wouldn't welcome some more feminine traits, such as sensitivity? Why do you think many straight women like to hang around gay men? Actually, there are many butch gay men. They even have their own clubs and groups within the gay community.\n \n Well, I have yet to encounter any straight women who like their men to wear makeup and share clothes with them. I'm sure they exist somewhere, but not any great abundance. I'm not going to start wearing lipstick on the off chance I'll meet and fall in love with one, though. To suggest that I might hate women because I don't want to become one is ridiculous.", 
   {}, 
   62176, 
   null, 
   1092472260.0
  ], 
  [
   62188, 
   null, 
   "JustineCredible", 
   "rightcustoms~~~\n \n You and your friend \"march?\" or whatever his name...need to get over yourselves. \n \n You know, you really are just letting it bother a bit more than is appropriate. Obviously because whomever it was who was geocaching was NOT attacked should have been proof enough that he needn't have been so worried. \n \n The fact that his friend was not \"coerced\" in anyway, should also have been another example of the lack of need to fear.\n \n Yes, certainly there are \"gay cruising\" spots, but no more than there are \"straight cruising\" spots. \n Come on, Malls, Theaters, Laundromats, Grocery stores...etc \n All are \"straight cruising\" spots. We all know it. Little girls are warned of such places growing up. (Well those who are raised by concerned parents) \n \n Straight men have not only more spots, but it is more widely acceptable behavior. Redlight districts, adult bookstores and peepshows were/are still breeding places for lisivious straight male behavior. But there is in no way as much of an uproar about those places.\n \"Titty\"Bars, strip clubs and \"gentlemen's clubs\" are now being placed closer and closer to \"Respectably\" communities. \n Women's jeans are cut lower and lower each year. Nearly showing their pubic areas. Yet there is no outcry about this. Boys are still wearing their jeans so that they hang off them to the point that if they move just right they will actually fall off. This is not upsetting but rather concidered \"Fashion!\" \n \n But you all want to whine and cry about \"gay cruising\" spots? \n You all are so damned concerned with the behavior of gay men and completely unaware or desensitized over Straight male/female behavior. \n That signifies a real problem with obsessiveness on your parts. \n :xbanghead", 
   {}, 
   62181, 
   null, 
   1092477720.0
  ], 
  [
   62189, 
   null, 
   "rightcustoms", 
   "Huh? If you are referring to Mach who posted earlier, I don't know him. I'm also pretty sure from reading his post that we don't agree about everything. Not that there's anything wrong with that, but I think you misunderstood the meaning of his post, or else I did.\n \n You know, you really are just letting it bother a bit more than is appropriate. Obviously because whomever it was who was geocaching was NOT attacked should have been proof enough that he needn't have been so worried.\n \n I'll decide what's appropriate for me, thank you. If my opinion that gay cruising is inappropriate brings this kind of response, then telling me that my reaction to it is inappropriate is hypocritical. I don't know about you, but it's a tough gritty world out there. I wouldn't go around blindly trusting everyone no matter how strange their behavior is just because they haven't attacked me. You do have a lock on your door, right?\n \n Yes, certainly there are \"gay cruising\" spots, but no more than there are \"straight cruising\" spots. \n Come on, Malls, Theaters, Laundromats, Grocery stores...etc \n All are \"straight cruising\" spots. We all know it. Little girls are warned of such places growing up. (Well those who are raised by concerned parents)\n \n There is a difference between casual flirting, and soliciting anonymous sex. I don't see too many guys walking around malls and grocery stores making obscene gesture depicting fellatio in hopes of attracting a sex partner, and I'd be just as put off if I did.\n \n Straight men have not only more spots, but it is more widely acceptable behavior. Redlight districts, adult bookstores and peepshows were/are still breeding places for lisivious straight male behavior. But there is in no way as much of an uproar about those places.\n \"Titty\"Bars, strip clubs and \"gentlemen's clubs\" are now being placed closer and closer to \"Respectably\" communities. \n Women's jeans are cut lower and lower each year. Nearly showing their pubic areas. Yet there is no outcry about this. Boys are still wearing their jeans so that they hang off them to the point that if they move just right they will actually fall off. This is not upsetting but rather considered \"Fashion!\" \n \n In the first part here, you sound as if you are actually upset that straight people (who are a majority) flirting with each other is widely accepted. Of course it is. That's how come we are still here after two thousand generations.\n As far as strip clubs go, they aren't the sole domain of the straight people.\n No outcry about women's clothing? Clio Fields introduced a bill in Louisiana that would outlaw pants that fell below the waistline. (It didn't pass, but there certainly was an outcry over it.)\n Besides, what does clothing have to do with this? So women are wearing low cut jeans and it's fashionable. Next thing, gay men will be stuffing themselves into those same jeans and calling it fashion. If I had to look at one of them, I'd rather look at women's clothing on a woman.\n \n But you all want to whine and cry about \"gay cruising\" spots? \n You all are so damned concerned with the behavior of gay men and completely unaware or desensitized over Straight male/female behavior. \n That signifies a real problem with obsessiveness on your parts. \n \n I'm not whining or crying. It might not be apparent in writing, but rest assured. This is a forum for debate about gay rights last time I checked. If participation in debate makes me obsessive, then you are guilty of the same. Do you want to play the pot, or the kettle today?", 
   {}, 
   62188, 
   null, 
   1092481680.0
  ], 
  [
   62196, 
   null, 
   "JakeCJB", 
   "I think that's already clear. It makes me uncomfortable to know that a man might be fantasizing about having sex with me.\n\n \n Well get over it. You don't have to have sex with him, and you don't have to fantasize about having sex with him. \n \n \nDoes this mean that you wish to \"convert\" people who are not, and never will be truly homosexual in order to swell your ranks?\n\n \n Yes, that's the conspiracy. You've found us out, oh no! We want people who are not truly into our relationships.\n \n \nBlinders? Is that how you describe the difference between a welcome advance made by a woman and an unwelcome advance made by a man? I don't think it's unreasonable for people to be more sensitive to things that they find disconcerting. Perhaps your blinders are what prevents you from \"seeing\" the problem.\n\n \n Gay and lesbian people have straight people making advances and looking at them, all the time. We don't whine about it to anyone who'll listen. We know who we are, and it's not a threat.\n \n \nHow do you know they are straight?\n\n \n Sorry, cross-dressing doesn't have anything to do with sexual orientation, despite your ignorant assumptions.\n \n \nIf anyone is potentially \"in\", then this means nothing. And for that matter why do it at all if not to fly in the face of convention. Very rarely, some brave person does something completely radical and it becomes the norm. Gays have been dressing in drag for years and it hasn't caught on yet. Might be fun at a party, but I doubt you'll see men wearing dresses to business meetings any time soon.\n\n \n So what if it flies in the face of convention? A lot of fashion and much of art, does so.\n \n \nDo you think these are reasons the straight cross dressers you mentioned do it?\n\n \n Normally, but not always, among that group the reasons are more mundane. Sometimes it is only for a sexual turn on, but that's their business. I don't judge them. \n \n \nWell, I have yet to encounter any straight women who like their men to wear makeup and share clothes with them. I'm sure they exist somewhere, but not any great abundance. I'm not going to start wearing lipstick on the off chance I'll meet and fall in love with one, though. To suggest that I might hate women because I don't want to become one is ridiculous.\n\n \n Okay, fair enough. You did mean feminine traits only in terms of wearing women's clothing and make-up. I wasn't clear on that. However, men today, gay or straight do cosmetic things such as dying their hair, use skin care products, body hair removal products, and are more interested in fashion.", 
   {}, 
   62181, 
   null, 
   1092499680.0
  ], 
  [
   62197, 
   null, 
   "JakeCJB", 
   "There is a difference between casual flirting, and soliciting anonymous sex.\n\n \n Not necessarily. The flirting can lead to a one night stand.\n \n \nI don't see too many guys walking around malls and grocery stores making obscene gesture depicting fellatio in hopes of attracting a sex partner, and I'd be just as put off if I did.\n\n \n Straight people do the act in parks or outside in secluded areas. I've seen them making out on a park bench, and one grabbing the other's derriere in public.\n \n \nIn the first part here, you sound as if you are actually upset that straight people (who are a majority) flirting with each other is widely accepted. Of course it is. That's how come we are still here after two thousand generations.\n\n \n Right. All those people are interested in reproducing.\n \n \nBut you all want to whine and cry about \"gay cruising\" spots? You all are so damned concerned with the behavior of gay men and completely unaware or desensitized over Straight male/female behavior. \n That signifies a real problem with obsessiveness on your parts.\n\n \n Yes, I got that impression too.", 
   {}, 
   62189, 
   null, 
   1092500520.0
  ], 
  [
   62198, 
   null, 
   "Mach", 
   "Huh? If you are referring to Mach who posted earlier, I don't know him. I'm also pretty sure from reading his post that we don't agree about everything. Not that there's anything wrong with that, but I think you misunderstood the meaning of his post, or else I did.\n \n\n \n My post? #1 post was that fear of gay is primarily the negative social stigma. In reality, if your father turned out to be gay, would he be any different other than what he does behind closed doors? No. Same ole dad. So what's the fear? It's social stigma mostly, some is probably power/masculenaty. Not that it's your fault for feeling that way necessarily, but you can rationally overcome your primitive instincts.\n \n Regarding post #2\n Point being your feelings are always validated, you're right, no one can really tell you what you should feel. However, you're taking a very negative stance towards gay men, when reasonably, I think most of us see it as misplaced diapproval.\n Men make women fell the way you describe on a daily basis. Women make men uncomfortable too, and women make other women uncomfortable. \n \n We have sexual discrimination laws now in the workplace, you know why? Yes, inappropriate straight male behavior towards women, in a very inappropriate place (work) (the most likely cause, although it can happen with any combination male/female). What you're not OK with is being \"hit on\", by another man. Well, you can't control what another man might feel towards you, but you can have issues with the way he displayed them in public in a graphic way. It could be a case of public lewdness (such a thing?), and you might have legal grounds there. But I think it's dangerous and unfair for you to direct the anger only at gay men.\n \n I have been hit on by various women before, and you know what generally determined my reaction? If they were hot, I was flattered. If they were very unattractive, I was embarassed or disugsted. (initial reaction, rationally I was flattered either way). If it was in public, it just increased the positive or negative reaction. So what happened to you, in my context, is that you were simply hit on, in a public way, by someone you weren't attracted to, and it was gross and embarassing. We ALL probably feel that way, it's uncomfortable!! But it's not GAY men, it's possible for both males and females, straight or gay (or both) to create this reaction.\n \n Seriously, if it had been a drop dead gorgeous woman who drove by slowly in a convertable, licking her lips and winking at you, you'd be visiting that park every chance you could get ;) Kidding of course on the last part, but you know what I mean.\n \n -Mach", 
   {
    "post_info": {
     "post_title": "-"
    }
   }, 
   62189, 
   null, 
   1092502140.0
  ], 
  [
   62215, 
   null, 
   "jitobear", 
   "\n Blinders? Is that how you describe the difference between a welcome advance made by a woman and an unwelcome advance made by a man?\n\n \n Ok there you on your me, myself and myland. It's not all about you. Mach was actually trying to get you to see that women deal with unwanted advances by men ALL THE TIME. Got it? He was comparing women fending off unwanted advances by men to you having to fend off unwanted advances by men. He was NOT comparing you having to fend off unwanted advances by men to your having wanted advances by women. Stating that being really aggresive sexually like that is a 'guy' thing not a 'gay' thing. However, I think there are plenty of women that can come on equally strong, the dangerous difference being that men are generally physically stronger than women.\n \n \n[Exactly which stereotypes are you accusing me of promoting? That gay men behave differently? Come on now. \n\n \n Well, yes. One of my best friends is gay. Likes carpentry, fishing, going to ball games and rebuilding cars. Doesn't act like anything but hmself. You would not know he was gay unless he told you, but rest assured he will, for his also not ashamed. He also has a home, a cabin, a good job, has been in a committed monogomous relationship for 16 years, never wears women's clothes and thinks over-the-top drag queens are weird.\n \n Anyone can overplay a superficial image. Look at goth kids. How about some of dem homeboyz. Healthy people just act like themselves.\n \n \nFinding out that you may have more feminine traits is unpleasant? Watch it, you may be revealing a misogynistic side of yourself. Do you think there aren't many straight women who wouldn't welcome some more feminine traits, such as sensitivity? Why do you think many straight women like to hang around gay men? Actually, there are many butch gay men. They even have their own clubs and groups within the gay community.\n \n Well, I have yet to encounter any straight women who like their men to wear makeup and share clothes with them. I'm sure they exist somewhere, but not any great abundance. I'm not going to start wearing lipstick on the off chance I'll meet and fall in love with one, though. To suggest that I might hate women because I don't want to become one is ridiculous.\n\n \n You think that make-up and certain clothes a woman make? I am a woman by biology. Outside of that I am ME. I am not more woman when I wear red shoes and lipstick to the bar than I am when I wear no make-up and jeans and tshirt and mow my lawn. I am always the same woman.", 
   {}, 
   62181, 
   null, 
   1092513600.0
  ], 
  [
   62227, 
   null, 
   "rightcustoms", 
   "Gay and lesbian people have straight people making advances and looking at them, all the time. We don't whine about it to anyone who'll listen. We know who we are, and it's not a threat.\nAgain, nobody's whining. I'm discussing a topic in a forum for that purpose. I don't think any of us would be here if we didn't enjoy a good debate. You misinterpret my intentions.\n \n Here's one of my favorites so far...\nSorry, cross-dressing doesn't have anything to do with sexual orientation, despite your ignorant assumptions.\n Followed by...\nSometimes it is only for a sexual turn on, but that's their business. I don't judge them.\n In the same post, no less! Which is it? Sex or something else?\n \n \nWe have sexual discrimination laws now in the workplace, you know why? Yes, inappropriate straight male behavior towards women, in a very inappropriate place (work) (the most likely cause, although it can happen with any combination male/female). \n Many of these cases have involved inappropriate behavior of gay men as well. For that matter, not all women feel that sexual advances in the workplace are a bad thing. Harassment is in the eye of the beholder. If a woman has the right to choose whether an advance by a man is harassment or welcome flirting, so does a man, does he not? You guys keep telling me to \"get over it\". Try telling that to a woman who feels she's being sexually harassed. If she disagrees, you could always just call her \"obsessive\".\n \n \nOk there you on your me, myself and myland. It's not all about you. Mach was actually trying to get you to see that women deal with unwanted advances by men ALL THE TIME. Got it? He was comparing women fending off unwanted advances by men to you having to fend off unwanted advances by men. He was NOT comparing you having to fend off unwanted advances by men to your having wanted advances by women. Stating that being really aggresive sexually like that is a 'guy' thing not a 'gay' thing. However, I think there are plenty of women that can come on equally strong, the dangerous difference being that men are generally physically stronger than women.\n Just because women deal with unwanted advances, it makes it ok for men to have to deal with it? That's like saying it's ok for you to rob a convenience store because you saw some guy in the news that did it. If it's not ok, then it's not ok. The point is, you can never know who might react adversely to an advance, so keep them to yourself. That's what the sexual harassment laws are all about.\n \n \nOne of my best friends is gay. Likes carpentry, fishing, going to ball games and rebuilding cars. Doesn't act like anything but hmself. You would not know he was gay unless he told you, but rest assured he will, for his also not ashamed. He also has a home, a cabin, a good job, has been in a committed monogomous relationship for 16 years, never wears women's clothes and thinks over-the-top drag queens are weird.\n What does he find weird about over the top drag queens? Does the fact that he is gay excuse him from being insensitive to their habits? If a gay guy can find it weird, why can't a straight one?\n \n \nYou think that make-up and certain clothes a woman make? I am a woman by biology. Outside of that I am ME. I am not more woman when I wear red shoes and lipstick to the bar than I am when I wear no make-up and jeans and tshirt and mow my lawn. I am always the same woman.\n Not at all. What I know is that women in our western culture tend to dress differently than men. What I said was that I didn't think that dressing like one would attract many of them. Perhaps my logic is reflected in the habit many lesbians have of wearing men's clothes and hairstyles. How better to attract a woman than to look like a man? Do lesbians wear mens clothes for \"style and fashion\"? A woman stepping out of a 4x4 pickup truck with jeans and a flannel \"wifebeater\" shirt, big brass belt buckle, and a crew cut is no more fashionable than a man doing the same. In fact, at first glance, she might look like an intolerant, uneducated, chauvanistic redneck. \n I thought homosexuals didn't like that kind of person, so why emulate one?", 
   {}, 
   62215, 
   null, 
   1092520320.0
  ], 
  [
   62237, 
   null, 
   "JakeCJB", 
   "Here's one of my favorites so far... Followed by... In the same post, no less! Which is it? Sex or something else?\n\n \n I probably shouldn't have pointed to that, but I did say sometimes. It will mean many different things to many different people who do this. It is not connected to sexual orientation identity, however. Most crossdressers are straight, and of course, most men in the general population are straight.\n \n \nMany of these cases have involved inappropriate behavior of gay men as well. For that matter, not all women feel that sexual advances in the workplace are a bad thing. Harassment is in the eye of the beholder. If a woman has the right to choose whether an advance by a man is harassment or welcome flirting, so does a man, does he not?\n\n \n If you tell a guy you are straight, he will back off. You were talking about a \"look\", you were given, you only later determined may have been involving sexual attraction on the other guy's mind, when you found out the park was frequented by guys. Most gay men won't flirt with just any guy, in areas known to be generally \"straight\". \n \n \nJust because women deal with unwanted advances, it makes it ok for men to have to deal with it? That's like saying it's ok for you to rob a convenience store because you saw some guy in the news that did it. If it's not ok, then it's not ok. The point is, you can never know who might react adversely to an advance, so keep them to yourself. That's what the sexual harassment laws are all about.\n\n \n It depends on the type of advance, and if the woman makes it clear that it isn't welcome, like any other situation.\n \n \nWhat does he find weird about over the top drag queens? Does the fact that he is gay excuse him from being insensitive to their habits? If a gay guy can find it weird, why can't a straight one?\n\n \n Indeed, some gay men find it \"weird\", and are even more hostile than some straight men. This just shows that it isn't connected to sexual orientation identity, whether you are gay or straight. I don't excuse those gay men if they are being insensitive or hostile. \n \n \nNot at all. What I know is that women in our western culture tend to dress differently than men. What I said was that I didn't think that dressing like one would attract many of them. Perhaps my logic is reflected in the habit many lesbians have of wearing men's clothes and hairstyles. How better to attract a woman than to look like a man? Do lesbians wear mens clothes for \"style and fashion\"? A woman stepping out of a 4x4 pickup truck with jeans and a flannel \"wifebeater\" shirt, big brass belt buckle, and a crew cut is no more fashionable than a man doing the same. In fact, at first glance, she might look like an intolerant, uneducated, chauvanistic redneck. \n I thought homosexuals didn't like that kind of person, so why emulate one?\n\n \n They could dress like that for comfort. Many straight women go to the men's clothing section, or buy formless, neutral or masculine looking pants, shirts, or jackets. What's wrong with a woman driving a truck? Many straight women in those rural areas do look like that. I don't see what the problem is if some lesbians have short hair, and are not up to date on the latest fashion trends. We know they are not men. Some wish to reject the \"Barbie Doll\" look perhaps, meant to please straight men. There are also highly feminine \"lipstick\" lesbians.", 
   {}, 
   62227, 
   null, 
   1092526860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why straight men are afraid of gays", 
  "url": "http://www.4forums.com/political/gay-rights-debates/2748-why-straight-men-afraid-gays.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 2748, 
  "discussion_files": [
   [
    "17809.html", 
    "http://www.4forums.com/political/gay-rights-debates/2748-why-straight-men-afraid-gays-print.html"
   ], 
   [
    "17810.html", 
    "http://www.4forums.com/political/gay-rights-debates/2748-why-straight-men-afraid-gays-11-print.html"
   ], 
   [
    "17811.html", 
    "http://www.4forums.com/political/gay-rights-debates/2748-why-straight-men-afraid-gays-9-print.html"
   ], 
   [
    "17812.html", 
    "http://www.4forums.com/political/gay-rights-debates/2748-why-straight-men-afraid-gays-7-print.html"
   ], 
   [
    "17813.html", 
    "http://www.4forums.com/political/gay-rights-debates/2748-why-straight-men-afraid-gays-5-print.html"
   ], 
   [
    "17814.html", 
    "http://www.4forums.com/political/gay-rights-debates/2748-why-straight-men-afraid-gays-4-print.html"
   ], 
   [
    "17815.html", 
    "http://www.4forums.com/political/gay-rights-debates/2748-why-straight-men-afraid-gays-6-print.html"
   ], 
   [
    "17816.html", 
    "http://www.4forums.com/political/gay-rights-debates/2748-why-straight-men-afraid-gays-8-print.html"
   ], 
   [
    "17817.html", 
    "http://www.4forums.com/political/gay-rights-debates/2748-why-straight-men-afraid-gays-10-print.html"
   ], 
   [
    "17818.html", 
    "http://www.4forums.com/political/gay-rights-debates/2748-why-straight-men-afraid-gays-3-print.html"
   ], 
   [
    "17819.html", 
    "http://www.4forums.com/political/gay-rights-debates/2748-why-straight-men-afraid-gays-2-print.html"
   ]
  ], 
  "identifier": 2748
 }
]