[
 [
  [
   58845, 
   null, 
   "David2004", 
   "Prime Minister Sharon, Chairman Arafat, and President Bush are a roadblock to peace. With at least two out of three of these leaders directly connected to the act of terrorisms. The perception of which two leaders that are connected to terrorisms will vary according to what side you are on. The right wing within Israel, the United States and the Islamic nations are the root of many of the problems in the Middle East today. Oil is feeding the roots to the problems in the Middle East and United States making the problems worst, with the military industrial complex leading the way. Only by modifying the right wing leadership in all nations involved can a peace process begin to develop. If all sides look forward for the answers without placing blame and are willing to compromise in their position, progress toward peace can be made. \n \n Understanding that peace and prosperity will be better for all people except for those in the military industrial complex who make the bombs, bullets and weapons to deliver them. Only threw the creation of more new opportunities for the people in the region. As well as addressing the human right issues and the population growth problem. This society is so rich in history and culture that so many people want to preserve that it can?t be divided by a wall. Only by addressing the grievances of the people of the other side will a long-term peace plan work. \n \n What is in the best long-term interest to the people of the State of Israel and Palestine is really the one of the same. Both people as societies want many of the same things for their children and families. One will not be able to have it without the other side having it too, for any great period of time. There is no long-term defense in defending policies and actions that are inhuman and unjust that is being imposed onto another people.", 
   {
    "post_info": {
     "post_title": "Sharon Arafat Bush"
    }
   }, 
   null, 
   null, 
   1090270440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Sharon Arafat Bush", 
  "url": "http://www.4forums.com/political/peace-middle-east/2769-sharon-arafat-bush.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 2769, 
  "discussion_files": [
   [
    "15212.html", 
    "http://www.4forums.com/political/peace-middle-east/2769-sharon-arafat-bush-print.html"
   ]
  ], 
  "identifier": 2769
 }
]