[
 [
  [
   59024, 
   null, 
   "JPSartre12", 
   "Sandy Berger, Clinton's National Security Advisor, claims that he \"inadvertently\" removed classified documents from the National Archives while preparing for testimony before the 9-11 commission. The missing documents were related to the 1999 Millenium Plot.\n My question is \"How does one inadvertently shove documents down his pants? \" emoticon_confused \n I can see it now:\n Are those classified document in your pants or are you just glad to see me? emoticon_emb", 
   {
    "post_info": {
     "post_title": "Sandy Berger - Stealing Classified Documents or just Bulking up?"
    }
   }, 
   null, 
   null, 
   1090348200.0
  ], 
  [
   59027, 
   null, 
   "Waxy", 
   "Not to make excuses for the guy (I really don't know anything about it), but I've inadvertently taken files, logs, etc... out of our file room.\n \n Everything is laid out on a table, things get shoved into file folders, put in the wrong place, gathered up in a pile, etc... \n \n It can happen without it being deliberate.\n \n Waxy", 
   {}, 
   59024, 
   null, 
   1090348800.0
  ], 
  [
   59195, 
   null, 
   "JPSartre12", 
   "Not to make excuses for the guy (I really don't know anything about it), but I've inadvertently taken files, logs, etc... out of our file room.\n \n Everything is laid out on a table, things get shoved into file folders, put in the wrong place, gathered up in a pile, etc... \n \n It can happen without it being deliberate.\n \n Waxy\n\n \n Waxy,\n Did you accidentally put highly classified papers in your pants? \n Did you then go and LOSE some of those highly classified documents?\n Were you the National Security Advisor who, of all people, should have been aware of the ramifications of their \"inadvertent removal\" and should have busted his butt to make sure that ALL of them were returned to the vault?\n And, isn't it odd that all of the documents missing were related to Al Qaeda and the Millenium Plot?\n I smell a rat, a large Arkansan rat. emoticon_idea", 
   {}, 
   59027, 
   null, 
   1090436820.0
  ], 
  [
   59204, 
   null, 
   "daewoo", 
   "I think that we need to give the investigation a week before formin gnay real opinions. If, in fact, he was actually stuffing classified documents down his pants and hiding them in his clothes, then I think the \"oversight\" excuse is pretty lame.", 
   {}, 
   59195, 
   null, 
   1090441200.0
  ], 
  [
   59225, 
   null, 
   "JPSartre12", 
   "I think that we need to give the investigation a week before formin gnay real opinions. If, in fact, he was actually stuffing classified documents down his pants and hiding them in his clothes, then I think the \"oversight\" excuse is pretty lame.\n\n \n I agree. We don't know all of the facts. I was attempting a little humor with my poll and original post. I do think it's interesting how the press isn't all over this one like white on rice, though. If Berger was working for Bush, this'd be Watergate II. In fact, I heard Tom Delay refer to this tongue-in-cheekly as \"a third rate burglary\". Those that were around for te Watergate hearings will see the irony. :)", 
   {}, 
   59204, 
   null, 
   1090453560.0
  ], 
  [
   59231, 
   null, 
   "daewoo", 
   "I agree. We don't know all of the facts. I was attempting a little humor with my poll and original post. I do think it's interesting how the press isn't all over this one like white on rice, though. If Berger was working for Bush, this'd be Watergate II. In fact, I heard Tom Delay refer to this tongue-in-cheekly as \"a third rate burglary\". Those that were around for te Watergate hearings will see the irony. :)\n\n \n \n Absolutly. You have to wonder what will happen if it is found that he intentionally removed classified materials. If he was just removing them to cover his administrations (clintons) backside, I think the consequnces should be severe. If it turns out that his motives were worse (given what we know currently I don't think we can rule anything out with any kind of certainty), the consequnces should be far beyond severe.", 
   {}, 
   59225, 
   null, 
   1090455900.0
  ], 
  [
   59233, 
   null, 
   "jskufan", 
   "It will be interesting to see how this plays out. I would think that only select few could access these \"sensitive\" documents so it wouldn't be hard to trace them back to the thief. In addition, this information is 4 years old, I wouldn't think there's much in the files that the current administration hasn't already seen. If you're Republican, you've got to be skeptical. As an Independent, I'm also skeptical, yet patient enough to wait for more details.", 
   {}, 
   59225, 
   null, 
   1090455960.0
  ], 
  [
   59377, 
   null, 
   "syklopps61", 
   "I think that we need to give the investigation a week before formin gnay real opinions. If, in fact, he was actually stuffing classified documents down his pants and hiding them in his clothes, then I think the \"oversight\" excuse is pretty lame.\n\n\n \n Funny, I THINK I recall you jumping to some major conclusions about the Abu Graib incident, BEFORE all the facts were in...HMMMMMMMMMM interesting, a pattern is becoming blatantly clear", 
   {}, 
   59204, 
   null, 
   1090541520.0
  ], 
  [
   59419, 
   null, 
   "daewoo", 
   "Funny, I THINK I recall you jumping to some major conclusions about the Abu Graib incident, BEFORE all the facts were in...HMMMMMMMMMM interesting, a pattern is becoming blatantly clear\n\n \n \n The Abu Graib incident was not even mentioned here until 3 days after te story broke. In the first 72 hours following the break of the story, we had more than enough information to form an opinion. th Bush administration made an uncharactheristic decision to divulge quite a bit of information. Besides, for those who actually follow world news, as opposed to only listening to what they are spoon fed, the Abu Graib situation was not broken by an American channel, it was broken by the BBC months before the American media got their hands on teh nasty pictures. Stories of prisoner abuse and, in some cases prisoner deaths due to abuse, had been circulating in the world press of rmonths.\n \n The conclusions I drew from the Abu Graib scandle were as follows:\n \n It could not have possibly been the act of a few \"bad apples\" Look at the pictures, there are too many soldiers standing around. Too many people knew abotu it for the chain of command to claim ignorance or to shrug responsibility (though they appear to be trying to do this). Couple this with he fact that you had almost identical stories coming out of Afghanistan for over a year before the American press \"broke the story\", and it is pretty difficult to believe that this was not official policy, especialy taken in the light that tese were 2 seperate prisons, under 2 seperate commands, thousands of miles apart, both apparently using identical tactics. This is not random.\n \n As far as the Berger thing goes, they have been playing that fairly close. All we have is unnamed sources, thus far uncorroborated, that suggest that he might have intentionally stolen a bunch of documents. Until we see some official corroboration to all of this, it is too early to form a fact based opinion. In contrast, when the US press broke the Abu Graib story, we had official corroboration within 5 hours.\n \n If you want my personal opinion, I think he is guilty as sin. I think he went in there and stole a bunch of single copy documents in order to cover either his own backside or that of the Clinton administration. I think he should, at the very least, spend a good portion of the rest of his life in a federal prison for this.\n \n Of course, on the flip side, I once walked out of a business meeting with somebody elses laptop because it was sitting at my end of the conference table. I got up and started tossing my stuff in my briefcase and in it went. I didn't even notice until 2 days later when I opened the briefcase and couldn't figure out where the laptop came from. So, I can see how he could inadvertantly carried off documents by accident. \n \n From a realistic standpoint, until the government chokes up a little more information, there is not much to base an opinion on.", 
   {}, 
   59377, 
   null, 
   1090571700.0
  ], 
  [
   59420, 
   null, 
   "mypov", 
   "I thought that Bill Clinton was a smooth BS artist the very first time I saw him speak on TV. I'm proud of the fact that I twice had the privledge of voting against him.\n \n He was elected twice and I had to accept that. I knew, no matter what he said, he would make deep cuts in the Military. (90% of elected Democrat pols call for cuts in the Military)But we would survive. He wasn't too interested in \"foreign matters\". But we would survive. He came to office 1/93 and almost immediatly fired every Federal prosecuter. Not too interested in Law Enforcement. But we would survive. Pulled out every stop(using his friends in the Media) to fire the head of the FBI. But we would survive. Refused to meet with the head of the CIA for years ( as previous Presidents did daily). But we would survive. Hire low life private investigators to harass and \"dig up dirt\" on American citizens on his \"enimies list\". We would survive.\n \n Put a \"get elected at any cost\", dirty trickster, like Sandy Burger in charge at the NSA. The NSA for God's sake! But we will survive, well most of us would. Not the 3,000 dead on 9/11/01. Including some friends of mine.\n \n How did Usama Bin Laden go from a rich guy with a small group of America haters in 1993 to the head of the most dangerous group of terrorists in the history of the world (60+ countries) by 2001? Maybe our affable leader wasn't taking care of business.", 
   {
    "post_info": {
     "post_title": "ClintonBurger"
    }
   }, 
   59377, 
   null, 
   1090573140.0
  ], 
  [
   59435, 
   null, 
   "jskufan", 
   "I thought that Bill Clinton was a smooth BS artist the very first time I saw him speak on TV. I'm proud of the fact that I twice had the privledge of voting against him.\n \n He was elected twice and I had to accept that. I knew, no matter what he said, he would make deep cuts in the Military. (90% of elected Democrat pols call for cuts in the Military)But we would survive. He wasn't too interested in \"foreign matters\". But we would survive. He came to office 1/93 and almost immediatly fired every Federal prosecuter. Not too interested in Law Enforcement. But we would survive. Pulled out every stop(using his friends in the Media) to fire the head of the FBI. But we would survive. Refused to meet with the head of the CIA for years ( as previous Presidents did daily). But we would survive. Hire low life private investigators to harass and \"dig up dirt\" on American citizens on his \"enimies list\". We would survive.\n \n Put a \"get elected at any cost\", dirty trickster, like Sandy Burger in charge at the NSA. The NSA for God's sake! But we will survive, well most of us would. Not the 3,000 dead on 9/11/01. Including some friends of mine.\n \n How did Usama Bin Laden go from a rich guy with a small group of America haters in 1993 to the head of the most dangerous group of terrorists in the history of the world (60+ countries) by 2001? Maybe our affable leader wasn't taking care of business.\n\n \n If you want to tell the story of how Osama Bin Laden came to power, you might want to go a little farther back than Clinton. \n \n http://slate.msn.com/id/2102243/\n \n The 9/11 commission report is not going to flatter Bush Jr., Clinton, or Bush Sr. What steps did George Jr. undertake in his first 9 months of presidency (up till 9/11) to combat Osama Bin Laden or terrorism in general? Afterwards, everyone got a lot more interested.", 
   {}, 
   59420, 
   null, 
   1090594800.0
  ], 
  [
   59445, 
   null, 
   "Rev. HellH0und", 
   "When I worked for the Airforce. I saw 5 people get prosecuted for things like accidentally leaving a classified safe opened, \"inadvertantly taking documents\", Discussing in an unsecure room the contents of such documents, etc. etc. 2 officers (one full bird), 2 enlisted (one SMS), and one civilin (GS-12). I even had to testify against 2 of em...\n \n \n Sandy the Hamburgler knows the protocol for handling classified documents... intentional or not it his his responsibility and should be charged. He should be held to the same standards I and everyone else who has ever handled such information period.\n \n \n I do notice though the media harping on this \"sloppy handling\" bandwagon and all I have to say is:\n \n \"HEY LIBERAL PRESS PROPAGANDISTS, IF THE HAMBURGLER IS TO SLOPPY TO KEEP HIMSELF \"WELL REGULATED\" THEN HE HAS NO BUSINESS HANDLING CLASSIFIED INFORMATION!", 
   {}, 
   59435, 
   null, 
   1090597800.0
  ], 
  [
   59523, 
   null, 
   "mypov", 
   "If you want to tell the story of how Osama Bin Laden came to power, you might want to go a little farther back than Clinton. \n \n http://slate.msn.com/id/2102243/ \n\n \n I am aware of the basic facts of that article. I strongly disagree with its anti- Reagan SPIN. Had Reagan pulled out of Afganistan and the Soviets kept their word (unlikely IMHO) it would have left a \n 'power vacuum\". One that Bin Laden would have filled. Than he could hve skipped his years in the Sudan. And would not have had to share power with the Taliban. \n \n None of that has to do with the basic question. \n How did Usama Bin Laden go from a rich guy with a small group of America haters in 1993 to the head of the most dangerous group of terrorists in the history of the world (60+ countries) by 2001?\n And why didn't the President of the United States do anything to stop him?", 
   {}, 
   59435, 
   null, 
   1090614120.0
  ], 
  [
   59527, 
   null, 
   "jskufan", 
   "I am aware of the basic facts of that article. I strongly disagree with its anti- Reagan SPIN. Had Reagan pulled out of Afganistan and the Soviets kept their word (unlikely IMHO) it would have left a \n 'power vacuum\". One that Bin Laden would have filled. Than he could hve skipped his years in the Sudan. And would not have had to share power with the Taliban. \n \n None of that has to do with the basic question. And why didn't the President of the United States do anything to stop him?\n\n \n I noticed that you conveniently started your timeline in 1993. That just happened to be after Bush 1 and exactly when Clinton took office. In addition, you don't place any responsibility for the first 9 months Bush 2 was in office. Do you think it's fair to blame Clinton and give his Republican predacessors a free ride?", 
   {}, 
   59523, 
   null, 
   1090617480.0
  ], 
  [
   59568, 
   null, 
   "syklopps61", 
   "Do you think it's fair to blame Clinton and give his Republican predacessors a free ride?[/QUOTE]\n \n HELL yes!!! GEEEEEEEEEEEZ, 8 years vs. 9 months, you REALLY have to be kidding now? How far will you go to blame Bush, or at the very least try to defelct blame off of Clinton?", 
   {}, 
   59527, 
   null, 
   1090635720.0
  ], 
  [
   59598, 
   null, 
   "jskufan", 
   "Do you think it's fair to blame Clinton and give his Republican predecessors a free ride?\n\n \n HELL yes!!! GEEEEEEEEEEEZ, 8 years vs. 9 months, you REALLY have to be kidding now? How far will you go to blame Bush, or at the very least try to defelct blame off of Clinton?[/QUOTE]\n \n I wasn't so much blaming Bush Jr. as I was pointing out that his Republican predecessors propped up and laid the ground work for Osama Bin Laden to rise to his current status. I'm not giving Clinton a free ride by any stretch, but there's enough blame to go around to both parties. Read up on our relationship with Osama Bin Laden during the Afghanistan war with the Soviets. Everyone after that \"inherited\" the problem.", 
   {}, 
   59568, 
   null, 
   1090645680.0
  ], 
  [
   59602, 
   null, 
   "mypov", 
   "I noticed that you conveniently started your timeline in 1993. \n\n \n I could have gone back to 1961 and asked why didn't Democrat J F Kennedy get rid of Osama the year he was born? But that would be silly. Reagan, in the 1980's, could not possibly have known what Osama would become in the 1990's. Osama himself could't have known.\n \n In 1993 he was well organized but no where near as powerful as he would become over the next 8 years. How could the person who swore to \"protect and defend the People of the United States of America\" stand by and do nothing while this this happened? Its digusting. \n \n The American People should never foget it. They should think about it every time they enter a voting booth. The next time a politician who disregards oaths, breaks vows and promises, and lies on a routine basis\n comes along they will know \"character counts\" . No matter what the pundits on TV say.", 
   {}, 
   59527, 
   null, 
   1090651920.0
  ], 
  [
   59624, 
   null, 
   "jskufan", 
   "I could have gone back to 1961 and asked why didn't Democrat J F Kennedy get rid of Osama the year he was born? But that would be silly. Reagan, in the 1980's, could not possibly have known what Osama would become in the 1990's. Osama himself could't have known.\n \n \n\n \n You're right, that would be silly. How could anyone have predicted that arming an Islamic extremist could ever come back to haunt us? What did we think he'd do after the Afghan war was over? Like a lot of our alliances in the Middle East, we think very short term. Looking back, it would have been nice if Clinton would have done more, and Bush 1 would have finished the job in Baghdad in 1991.", 
   {}, 
   59602, 
   null, 
   1090683240.0
  ], 
  [
   59632, 
   null, 
   "syklopps61", 
   "Looking back, it would have been nice if Clinton would have done more, and Bush 1 would have finished the job in Baghdad in 1991.\n[/QUOTE]\n \n SEE? There ya go again, you act like you want to spread some blame on Clinton (to appear reasonable no doubt), but you can't do it without throwing someone else into the mix! Bush 1 would have been crucified by the LEFTIES for finishing the job and you know it. He followed the all-knowing, all-caring UN resolution to expel Iraq from Kuwait. MY GOD, you LEFTIES are on Bush 2 for NOT following the U.N. I think I would be floored if anyone on the LEFT were consistent", 
   {}, 
   59624, 
   null, 
   1090698720.0
  ], 
  [
   59636, 
   null, 
   "JPSartre12", 
   "\n The 9/11 commission report is not going to flatter Bush Jr., Clinton, or Bush Sr. What steps did George Jr. undertake in his first 9 months of presidency (up till 9/11) to combat Osama Bin Laden or terrorism in general? Afterwards, everyone got a lot more interested.\n\n \n I can tell you some of what he was doing. Instead of getting the opportunity to make a smooth transition of power from Clinton to Bush, he was busy fending off a court battle because Algore wouln't admit that he lost the election. This delayed the transition by well over a month. And I'm sure that Clinton's cronies, aside from trashing the Whitehouse on their way out, weren't real interested in bringing Bush up to speed on a terrorist threat that Clinton didn't want to be bothered with.", 
   {}, 
   59435, 
   null, 
   1090701120.0
  ], 
  [
   59652, 
   null, 
   "jskufan", 
   "SEE? There ya go again, you act like you want to spread some blame on Clinton (to appear reasonable no doubt), but you can't do it without throwing someone else into the mix! Bush 1 would have been crucified by the LEFTIES for finishing the job and you know it. He followed the all-knowing, all-caring UN resolution to expel Iraq from Kuwait. MY GOD, you LEFTIES are on Bush 2 for NOT following the U.N. I think I would be floored if anyone on the LEFT were consistent[/QUOTE]\n \n \n I responded to your post but it must have gotten deleted.", 
   {}, 
   59632, 
   null, 
   1090718580.0
  ], 
  [
   60512, 
   null, 
   "jim's trucking", 
   "Burger was obviously not conscious when he stuffed the papers into his clothes. emoticon_rolleyes Yeah, right!\n \n He got some good training under the Clinton's about hiding papers. If I'm not mistaken the Clinton administration had hundreds of FBI files that were not supposed to be in their possession...and Hillary hid the Rose Law Firm papers for quite a while, until an honest maid turned them in after finding them in the Clinton's living quarters. Duh, who could have taken them in the first place?", 
   {}, 
   59568, 
   null, 
   1091303760.0
  ], 
  [
   60521, 
   null, 
   "Bush Is The Man", 
   "Burger was obviously not conscious when he stuffed the papers into his clothes. emoticon_rolleyes Yeah, right!\n \n He got some good training under the Clinton's about hiding papers. If I'm not mistaken the Clinton administration had hundreds of FBI files that were not supposed to be in their possession...and Hillary hid the Rose Law Firm papers for quite a while, until an honest maid turned them in after finding them in the Clinton's living quarters. Duh, who could have taken them in the first place?\n\n \n \n People need to stop trying to put the blame for 9/11 and our entry to war with Iraq on one person. It wasn't Bush's fault, it wasn't Clinton's fault, it wasn't Berger's fault. It was a combination of all of them. Bush got intelligence from the CIA and went with it. So he did what he thought was right. Clinton, if you read the 9/11 Report, had several chances to nab Bin Laden but didn't. I don't know why he didn't, but apparently that's what he thought was right. We need to respect their decisions. 9/11 was not Bush's fault. I am so sick and tired of people saying that. If you think that way, Bush should have never been in the situation he is now, since Clinton had several chances to kill Bin Laden and pussied out.", 
   {}, 
   60512, 
   null, 
   1091306340.0
  ], 
  [
   60522, 
   null, 
   "JPSartre12", 
   "Burger was obviously not conscious when he stuffed the papers into his clothes. emoticon_rolleyes Yeah, right!\n\n \n Come on now, surely you don't think that Clinton's top security advisor would know that shoving highly classified documents down his pants was illegal, do you? emoticon_rolleyes emoticon_xangel \n \n\n He got some good training under the Clinton's about hiding papers. If I'm not mistaken the Clinton administration had hundreds of FBI files that were not supposed to be in their possession...and Hillary hid the Rose Law Firm papers for quite a while, until an honest maid turned them in after finding them in the Clinton's living quarters. Duh, who could have taken them in the first place?\n\n \n I believe that it was 900 FBI files that were stolen by the Clinton Administration. That's 899 more than was needed to impeach Nixon. :)", 
   {}, 
   60512, 
   null, 
   1091306460.0
  ], 
  [
   60874, 
   null, 
   "syklopps61", 
   "SEE? There ya go again, you act like you want to spread some blame on Clinton (to appear reasonable no doubt), but you can't do it without throwing someone else into the mix! Bush 1 would have been crucified by the LEFTIES for finishing the job and you know it. He followed the all-knowing, all-caring UN resolution to expel Iraq from Kuwait. MY GOD, you LEFTIES are on Bush 2 for NOT following the U.N. I think I would be floored if anyone on the LEFT were consistent\n\n \n \n I responded to your post but it must have gotten deleted.\n[/QUOTE]\n \n UMM okay, and you no doubt put me in my place LMAO I'm sure it was pure poetry emoticon_smile", 
   {}, 
   59652, 
   null, 
   1091646480.0
  ], 
  [
   61033, 
   null, 
   "mypov", 
   " I believe that it was 900 FBI files that were stolen by the Clinton Administration. That's 899 more than was needed to impeach Nixon.\n\n \n That is correct. And people from the Nixon White House went to jail for many years for illegally possesing that ONE file. \n \n Let's see. Republicans spend many years in jail for one file. Democrats steal 900 files and get...... re-elected ! \n \n Some would say \"an obvious double standard\". I'd say \"when the Democrats are in control AMERICAN CITIZENS ARE IN DANGER of becoming political prisoners OR WORSE !!\"", 
   {}, 
   60874, 
   null, 
   1091688000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Sandy Berger - Stealing Classified Documents or just Bulking up?", 
  "url": "http://www.4forums.com/political/current-events-debates/2777-sandy-berger-stealing-classified-documents-just-bulking-up.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 2777, 
  "discussion_files": [
   [
    "5991.html", 
    "http://www.4forums.com/political/current-events-debates/2777-sandy-berger-stealing-classified-documents-just-bulking-up-print.html"
   ], 
   [
    "5992.html", 
    "http://www.4forums.com/political/current-events-debates/2777-sandy-berger-stealing-classified-documents-just-bulking-up-2-print.html"
   ]
  ], 
  "identifier": 2777
 }
]