[
 [
  [
   2933, 
   null, 
   "Debater", 
   "I know this is kind of old, but do you think Microsoft was a monopoly?", 
   {
    "post_info": {
     "post_title": "Microsoft"
    }
   }, 
   null, 
   null, 
   1045983420.0
  ], 
  [
   2962, 
   null, 
   "Broker", 
   "The government never considered what the consumer wanted. I liked Microsoft...most of us do. If they took serious action I was going to get all of my friends to stop buying software from any other companies in protest.", 
   {}, 
   2933, 
   null, 
   1046015580.0
  ], 
  [
   3089, 
   null, 
   "Crim", 
   "Most people like Microsoft because they haven't tried any alternatives.", 
   {}, 
   2933, 
   null, 
   1046071860.0
  ], 
  [
   3126, 
   null, 
   "Broker", 
   "Ha! Alternatives just aren't as good...", 
   {}, 
   2933, 
   null, 
   1046098500.0
  ], 
  [
   3396, 
   null, 
   "Crim", 
   "In terms of stability and performance, they're way better.\n But software companies don't support them because everyone gets MS by default.", 
   {}, 
   2933, 
   null, 
   1046333820.0
  ], 
  [
   5796, 
   null, 
   "airhead", 
   "\n I know this is kind of old, but do you think Microsoft was a monopoly?\n \n I think so. Unfortunately, this is what gave them the freedom to sell their products at rediculously high prices.\n \n \n The government never considered what the consumer wanted. I liked Microsoft...most of us do. If they took serious action I was going to get all of my friends to stop buying software from any other companies in protest.\n \n I don't know that most people like Microsoft. I think there is a point in restricting monopoly. How would you to pay several thousand dollars for Windows... or Office... or what have you? If there aren't competitors, this will surely happen.\n \n \n Most people like Microsoft because they haven't tried any alternatives.\n \n I don't know if this is true. A lot of people like Microsoft for because of a lot of other reasons....especially small companies... they definitely don't like Microsoft just because they haven't tried alternatives. I don't need to go into details on this.\n \n \n Ha! Alternatives just aren't as good...\n \n \n Well, for the most part, I think this is true, but it depends on what \"good\" means exactly.\n \n \n In terms of stability and performance, they're way better.\n But software companies don't support them because everyone gets MS by default.\n \n \n Well, I don't think this is true in general. In terms of stability and performance, most Microsoft products are very comparable to competitors (e.g. take Netscapes and Internet Explorer; you have to admit that IE takes less memory to run, runs faster with less processing power, looks better, isn't clunky, takes less time to start up, yada yada yada... than netscape; Or, if you prefer, take Windows, Linux, and MacOs... Windows is the ONLY OS with pure native originally designed for multi threading. Linux's multithreading was hacked up; MacOS went way to far and added several unnecessary multithreading levels which unnecessarily slows the computer down. This is not to mention that Windows looks better, has higher response time [Linux has terrible response time because most the interactive processes don't have higher priority -- e.g. mouse daemon, yada yada yada]; Well, I don't think you need more examples).\n \n Yeah, one reason Microsoft is popular is because they make good propaganda... and the other reasons are: they supposedly claim to have good support, they're a big company and people feel more secure buying products from big companies, and yada yada.", 
   {}, 
   2933, 
   null, 
   1048885440.0
  ], 
  [
   5863, 
   null, 
   "Debater", 
   "I a company a monopoly just because people like its products better?", 
   {}, 
   2933, 
   null, 
   1049002140.0
  ], 
  [
   5877, 
   null, 
   "airhead", 
   "\n I[s] a company a monopoly just because people like its products better? \n \n \n Generally, if a company makes products that people like and it becomes the ONLY product in that category, then the company is a monopoly by definition of monopoly. This is fair monopoly, and there should a problem with it [although I don't know what the laws says exactly against this sort of stuff; I am not a business lawyer], but it's not that simple of an issue. That's a naive question for two reasons:\n \n 1. Generally when a company monopolizes over something, chances are it will try to abuse the power. lawsuits against Microsoft are mostly for this reason. For example, Microsoft uses its monopoly (for the most part; it's not entirely a monopoly here) over PC OS's to try to destroy competitors in other markets like web-browsers, etc. I think this is unfair. \n \n 2. It's hard to keep yourself from asking what are the chances that a company can be so good as to be able make so many good products that people really really like? The answer is obviously that the chances are really low. In fact, it's close to impossible. How does Microsoft do it? Well, it uses the tactic in (1) to destroy competitors, and it acquires competitors with better products along the same line (almost like horizontal integration). If you examine carefully, most of the products from Microsoft aren't originally from them. Let's take a look at some examples:\n The product line of better operating systems from Microsoft (Windows NT, 2000, XP) started when Microsoft hired engineers from other companies to design the first version of Windows NT. This, essentially, is like legally stealing ideas developed by other companies. In fact, ideas used in the architecture of Windows NT were not developed by Microsoft. \n Microsoft voice recognition engine... from another company.\n Microsoft Visio.... from another company.\n .NET framework and C#.... hired engineers from other company to develop it.\n You name it.\n \n \n So a direct answer to your question is: if a company is so good that it can make products that a lot of people like, then yeah it monopolizes that market...but fairly so. Microsoft, on the other hand, is not one of those companies.", 
   {}, 
   2933, 
   null, 
   1049051580.0
  ], 
  [
   5879, 
   null, 
   "Broker", 
   "So? Gates got his start selling software he didn't own yet... big deal.\n \n The government still should consider the consumer when deciding what to do with the company. There are plenty of other software companies...And even if there weren't you could get cheaper off the Internet.", 
   {}, 
   2933, 
   null, 
   1049058540.0
  ], 
  [
   5882, 
   null, 
   "airhead", 
   "\n So? Gates got his start selling software he didn't own yet... big deal.\n \n \n It is a big deal. My point is that the company is actively seeking control of a large part of the software market by buying out competitors. I am sure that they are not doing this just for the fun of it. What happens if Microsoft owns all the decent software products? (*) They can sell it at whatever price they want because you have no other choice.\n \n \n The government still should consider the consumer when deciding what to do with the company.\n \n \n Believe it or not, the government is considering the consumer in mind when it tries to break up monopolies -- for the reason given in (*). Closer to home is the issue with Comcast (maybe not closer to your home, but it certainly has to do with me). I don't know if you've heard it.. There may be some lawsuit against Comcast for using its monopoly of cable modem services to force people into getting cable tv. Anyway, Comcast recently acquired AT&T broadband service (Cable Modem), so they are now the ONLY cable modem service in this area. The first thing they did was raising the price from $35/mo to $53/mo, unless you get cable TV and end up paying $49/mo. Since they more or less monopolize this area for cable modem services, cable modem users are pretty much stuck at pay $53/mo. This is the deal that the government is trying to protect the consumer against.\n \n \n There are plenty of other software companies...And even if there weren't you could get cheaper off the Internet.\n \n \n There are certainly plenty of other software companies, but as I am sure you know, software is a BIG market, and there are a lot of smaller \"sub-markets\". Monopoly doesn't have to work at the big software market level... \n Cheaper software off the internet? cheaper Microsoft software? What's the point of that? If you can get cheaper software off the net, then you are getting it from other companies or from a vendor selling Microsoft software, which is ultimately controlled by Microsoft. \n \n I am not saying Microsoft is a totally bad a company. They are, in fact, very nice from experience with dealing with them, but you have to admit that they are using some devious business practices.\n \n Besides, the government probably won't break them up anyway, but it certainly is fun talking about it :) That'd be bad anyway because for \"academic\" reasons, you need a large body to tie together the pieces of technological advancements. Maybe let them monopolize, but impose a price ceiling? Who knows....", 
   {}, 
   2933, 
   null, 
   1049061840.0
  ], 
  [
   5932, 
   null, 
   "gilligan8503", 
   "i am a biased, due to the fact i am an apple guy, and i did say \"yes\".\n \n even if i was pro-microsoft, i would still hope for a break up; that would spawn huge decline in prices and a rapid development of computer technology.\n \n tot he question of whether it is a monopoly or not... of course. windows controls 90% of the world's computers. that's huge. \"why punish something because it is good?\" well, what is the united states controled 90% of the world... would that be bad? of course... that much control results in high prices.\n \n a recent monopoly example: office depot now sells only computers and computer accesseries with a microsoft stamp of approval.", 
   {}, 
   2933, 
   null, 
   1049093940.0
  ], 
  [
   5955, 
   null, 
   "Broker", 
   "They only sell Microsoft? That's the last time I will ever visit Office Depot then.", 
   {}, 
   2933, 
   null, 
   1049122140.0
  ], 
  [
   6011, 
   null, 
   "Debater", 
   "People like a product the inventor copyrights it, he gets all the money off that product cause he is the only one making it, right.\n \n Microsoft made a great program, people like and they buy it.\n \n Just cause Apple didn't do as well doesn't mean that Microsoft should be penalized.", 
   {}, 
   2933, 
   null, 
   1049218740.0
  ], 
  [
   6018, 
   null, 
   "Broker", 
   "But Microsoft forces stores not to sell anything else! Please... I don't know anyone who likes Apple.That's why they don't sell Apple anywhere... \n \n And they sell other operating sytems... just because Microsoft has the most popular, feature rich OS why would you sell anything else? And they have good applications too... and games...", 
   {}, 
   2933, 
   null, 
   1049241000.0
  ], 
  [
   6206, 
   null, 
   "gilligan8503", 
   "people hate change, that is why switchers are rare.", 
   {}, 
   2933, 
   null, 
   1049671860.0
  ], 
  [
   7807, 
   null, 
   "Debater", 
   "force?\n \n is is a contract", 
   {}, 
   2933, 
   null, 
   1052330700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Microsoft", 
  "url": "http://www.4forums.com/political/politics-debates/278-microsoft.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 278, 
  "discussion_files": [
   [
    "9684.html", 
    "http://www.4forums.com/political/politics-debates/278-microsoft-print.html"
   ], 
   [
    "9685.html", 
    "http://www.4forums.com/political/politics-debates/278-microsoft-2-print.html"
   ]
  ], 
  "identifier": 278
 }
]