[
 [
  [
   59078, 
   null, 
   "jim's trucking", 
   "Why haven't we had a retraction from the accusers?\n \n \"The British Government has learned that Saddam Hussein recently sought significant quantities of uranium from Africa.\"  - George W. Bush, State of the Union address, Jan. 28, 2003.\n \n Those were \"the 16 words\" in a momentous message to a joint session of Congress that were pounced on by the wrong-war left to become the simple centerpiece of its angry accusation that \"Bush lied to us\" - or, as John Kerry more delicately puts it - \"misled\" us into thinking that Saddam's Iraq posed a danger to the United States.\n \n Two exhaustive government reports came out last week showing that it is the president's lionized accuser, and not Bush, who has been having trouble with the truth.\n \n ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ One less thing for the doubters of the world to blah, blah, blah about regarding Bush.", 
   {
    "post_info": {
     "post_title": "The 16 words of George W. Bush..."
    }
   }, 
   null, 
   null, 
   1090363620.0
  ], 
  [
   59085, 
   null, 
   "jskufan", 
   "Jim, I know you must have a point you're trying to make here, but it just isn't jumping out at me??? Since it's \"you\", I know it must be unequivocally \"pro\" Bush and \"anti\" Kerry but I can't make any sense of it. Can you help me out??", 
   {}, 
   59078, 
   null, 
   1090367640.0
  ], 
  [
   59087, 
   null, 
   "apathy", 
   "http://www.cnn.com/2004/ALLPOLITICS/07/10/senate.intelligence/\n \n Bush's main (if not only) reason that we should go to war was WMDs. The justifications made afterward would not have been enough. We MUST go to war, but I can't tell you the real reason. But let's make some post-invasion justifications:\n \n \"Bush said the United States was \"right to go into Iraq. America is safer today because we did,\" he told a cheering crowd of supporters in Pennsylvania.\n \n \"We removed a declared enemy of America, who had the capability of producing weapons of mass destruction, and could have passed that capability to terrorists bent on acquiring them.\"\n \n Excuses. These were not the reasons given for war before the war.\n \n http://abcnews.go.com/sections/nightline/US/globalshow_030425.html\n \n Officials inside government and advisers outside told ABCNEWS the administration emphasized the danger of Saddam's weapons to gain the legal justification for war from the United Nations and to stress the danger at home to Americans. \"We were not lying,\" said one official. \"But it was just a matter of emphasis.\"\n \n Maybe we're getting to some semblance of the truth? \n \n If Bush had gone on TV and said that the reason 1000s must die is:\n \"The Bush administration felt that a new start was needed in the Middle East and that Iraq was the place to show that it is democracy - not terrorism - that offers hope.\"\n \n Hope? So Bush lied so we could spread hope? Nice Job! Just don't spread any on me.\n \n http://www.cnn.com/2004/ALLPOLITICS/07/09/senate.intelligence/index.html\n \n \"Some GOP lawmakers on the panel successfully blocked Democratic efforts to finish the second part of the report -- how the Bush administration used the information from the intelligence community -- until after the November elections.\"\n \n Maybe the GOP doesn't want us to find out how much hope Bush is spreading.\n \n http://www.abcnews.go.com/sections/nightline/DailyNews/woolsey_transcript030422.html\n \n All I'm saying is that Bush is a liar. Why didn't he say \"We need to set an example. We will not be bullied. We need to send a strong message to everyone who hates us; do so at you own peril.\" ??? \n \n I think congress and the people might have gotten behind him on it. But, maybe wasn't good enough. We had to be fooled by the WMD scare.", 
   {
    "post_info": {
     "post_title": "Is Bush honest?"
    }, 
    "unicode_changes_made": true
   }, 
   59078, 
   null, 
   1090368240.0
  ], 
  [
   59439, 
   null, 
   "jim's trucking", 
   "Jim, I know you must have a point you're trying to make here, but it just isn't jumping out at me??? Since it's \"you\", I know it must be unequivocally \"pro\" Bush and \"anti\" Kerry but I can't make any sense of it. Can you help me out??\n\n \n I believe the point was in the question. Why haven't we heard from the accusers on this?\n \n I'm not pro-Bush or anti-Kerry.\n \n I'm pro-truth and pro-\"the best man\". In this season, that's George Bush.", 
   {}, 
   59085, 
   null, 
   1090595940.0
  ], 
  [
   59444, 
   null, 
   "jskufan", 
   "I believe the point was in the question. Why haven't we heard from the accusers on this?\n \n I'm not pro-Bush or anti-Kerry.\n \n I'm pro-truth and pro-\"the best man\". In this season, that's George Bush.\n\n \n Jim, I still don't know if I get the \"gist\" of your post. Are you saying people wrongly accused Bush of misleading the US into war or are you using the uranium story to help justify our going to war? Work with me a little here, I can't help it I'm a KU graduate! ;)", 
   {}, 
   59439, 
   null, 
   1090597500.0
  ], 
  [
   59454, 
   null, 
   "jim's trucking", 
   "Jim, I still don't know if I get the \"gist\" of your post. Are you saying people wrongly accused Bush of misleading the US into war or are you using the uranium story to help justify our going to war? Work with me a little here, I can't help it I'm a KU graduate! ;)\n\n \n I'm not familiar with KU. Is the Kent State, Kentucky, Kansas...?\n \n Part of the criticism of Bush was of his 16 word statement, a statement which has been found after all these months to be well within the bounds of truth. Where are the retractions from the earlier critics?\n \n ...and since Saddam was furthering his development of nuclear weapons, can one not assume he would threaten the US and the rest of the world with nuclear device attacks...whether they were delivered by plane, rocket, boat or ground transport? (To say he didn't have any method of delivery is not acceptable.)\n \n Where are the concessions from the left that the Brits and Bush were right about the uranium deal?", 
   {}, 
   59444, 
   null, 
   1090599540.0
  ], 
  [
   59467, 
   null, 
   "Waxy", 
   "I'm not familiar with KU. Is the Kent State, Kentucky, Kansas...?\n \n Part of the criticism of Bush was of his 16 word statement, a statement which has been found after all these months to be well within the bounds of truth. Where are the retractions from the earlier critics?\n \n ...and since Saddam was furthering his development of nuclear weapons, can one not assume he would threaten the US and the rest of the world with nuclear device attacks...whether they were delivered by plane, rocket, boat or ground transport? (To say he didn't have any method of delivery is not acceptable.)\n \n Where are the concessions from the left that the Brits and Bush were right about the uranium deal?\n\n \n I'm assuming they're waiting for proof that concessions are required.\n \n Seems they aren't willing to concede based on faith and the fact that Bush's statement is \"within the bounds of truth.\"\n \n I hope Bush doesn't state that Bigfoot exists.\n \n Waxy", 
   {}, 
   59454, 
   null, 
   1090602840.0
  ], 
  [
   59468, 
   null, 
   "jim's trucking", 
   "I'm assuming they're waiting for proof that concessions are required.\n \n Seems they aren't willing to concede based on faith and the fact that Bush's statement is \"within the bounds of truth.\"\n \n I hope Bush doesn't state that Bigfoot exists.\n \n Waxy\n\n \n My mother taught me that if find out that you have falsely accused someone publicly, you should correct yourself publicly or at least to that person.\n \n I wonder what the critics will say when we find a large cache of WMDs.", 
   {}, 
   59467, 
   null, 
   1090603140.0
  ], 
  [
   59470, 
   null, 
   "Waxy", 
   "My mother taught me that if find out that you have falsely accused someone publicly, you should correct yourself publicly or at least to that person.\n\n \n Who's to say they won't IF the time comes. ;) \n \n \nI wonder what the critics will say when we find a large cache of WMDs.\n\n \n IF we find WMDs (actual significant amounts worth of going to war over), I will have 2 extra large servings of crow, and I won't even drown it in ketchup. :p\n \n I wonder what the \"faithful\" will say when we haven't found any significant WMDs in the next 5, 10, 20, or 50 years?\n \n Waxy", 
   {}, 
   59468, 
   null, 
   1090603500.0
  ], 
  [
   59471, 
   null, 
   "Rev. HellH0und", 
   "http://news.scotsman.com/international.cfm?id=836232004\n \n \n \n These things keep coming in....", 
   {}, 
   59470, 
   null, 
   1090603860.0
  ], 
  [
   59483, 
   null, 
   "Phunting", 
   "http://news.scotsman.com/international.cfm?id=836232004\n \n \n \n These things keep coming in....\nYou couldn't ask them to come in any further could you? That link doesn't work...", 
   {}, 
   59471, 
   null, 
   1090606440.0
  ], 
  [
   59548, 
   null, 
   "jskufan", 
   "I'm not familiar with KU. Is the Kent State, Kentucky, Kansas...?\n \n Part of the criticism of Bush was of his 16 word statement, a statement which has been found after all these months to be well within the bounds of truth. Where are the retractions from the earlier critics?\n \n ...and since Saddam was furthering his development of nuclear weapons, can one not assume he would threaten the US and the rest of the world with nuclear device attacks...whether they were delivered by plane, rocket, boat or ground transport? (To say he didn't have any method of delivery is not acceptable.)\n \n Where are the concessions from the left that the Brits and Bush were right about the uranium deal?\n\n \n KU = Kansas University\n \n Why don't / didn't we invade North Korea or Iran? Their weapons programs are well documented. Did he actually GET the uranium?", 
   {}, 
   59454, 
   null, 
   1090626540.0
  ], 
  [
   59571, 
   null, 
   "syklopps61", 
   "IF we find WMDs (actual significant amounts worth of going to war over), I will have 2 extra large servings of crow, and I won't even drown it in ketchup. :p\n \n I wonder what the \"faithful\" will say when we haven't found any significant WMDs in the next 5, 10, 20, or 50 years?\n\n \n \n HMMMMMMMMM now it's SIGNIFICANT asmounts..sounds to me like that is code word for wiggle room. We could find 5 tons and the Left will say that it's not SIGNIFICANT. Nice try..I could've sworn from the beginning you all said ANY...maybe you all are a little scared we WILL find some?", 
   {}, 
   59470, 
   null, 
   1090637220.0
  ], 
  [
   59607, 
   null, 
   "daewoo", 
   "HMMMMMMMMM now it's SIGNIFICANT asmounts..sounds to me like that is code word for wiggle room. We could find 5 tons and the Left will say that it's not SIGNIFICANT. Nice try..I could've sworn from the beginning you all said ANY...maybe you all are a little scared we WILL find some?\n\n \n How about \"Any that had not already been accounted for by the UN inspectors and tagged for destruction\".", 
   {}, 
   59571, 
   null, 
   1090658220.0
  ], 
  [
   59617, 
   null, 
   "Duo_Maxwell", 
   "the link is pretty funny. I wonder if you read it. \n \n um, there's a nuclear weapon. We can't name the sources, or what it exactly is, nor can we confirm if it exists or doesn't exist. That will be all. \n \n syklopps61: A vial or two, as well as blue prints are not significent amounts. Chemical weapons need vast amount of resources, large production facilities and disposal facilities. None of that has been found. Not to mention that these weapons need delivery systems, none which have been found or the means to produce them. As for blue prints, go look on google, ANYONE can find the instructions and ingredidents for most weapons. As for a nuclear weapon, do you realize how hard it is to make a working weapon? To get a SINGLE reaction from Uranium, you need 5 TONS of the stuff, as well as the means to refine it into weapons grade uranium, as well as the missiles, targeting computers, warhead components, none which are easy to produce. \n Notice how you ignored the fact that a AMERICAN was caught with more chemical weapons then all of Iraq had. \n \n So unless Saddam could literally pull WMD from thin air, you don't have a argument.", 
   {}, 
   59607, 
   null, 
   1090673700.0
  ], 
  [
   59620, 
   null, 
   "CCR1994", 
   "the link is pretty funny. I wonder if you read it. \n \n um, there's a nuclear weapon. We can't name the sources, or what it exactly is, nor can we confirm if it exists or doesn't exist. That will be all. \n \n syklopps61: A vial or two, as well as blue prints are not significent amounts. Chemical weapons need vast amount of resources, large production facilities and disposal facilities. None of that has been found. Not to mention that these weapons need delivery systems, none which have been found or the means to produce them. As for blue prints, go look on google, ANYONE can find the instructions and ingredidents for most weapons. As for a nuclear weapon, do you realize how hard it is to make a working weapon? To get a SINGLE reaction from Uranium, you need 5 TONS of the stuff, as well as the means to refine it into weapons grade uranium, as well as the missiles, targeting computers, warhead components, none which are easy to produce. \n Notice how you ignored the fact that a AMERICAN was caught with more chemical weapons then all of Iraq had. \n \n So unless Saddam could literally pull WMD from thin air, you don't have a argument.\n\n \n How about purchasing WMD or illegal weaponry? I'm recalling the discovery of Saddam's negotiations with the dear leader of North Korea to purchase illegal missiles and a missile production system. The presence of the coalition and the war itself put an end to this but we didn't discover it was even happening until after Saddam was diposed. The UN inspectors could not have been expected to uncover this.", 
   {}, 
   59617, 
   null, 
   1090680660.0
  ], 
  [
   59634, 
   null, 
   "syklopps61", 
   "A vial or two, as well as blue prints are not significent amounts. \n \n \n I'm assuming that you do not dispute the fact that Hussein HAD WMD at one point, correct? Well, are you really gonna tell me that suddenly, after using them that one time, he just up and destroyed all the leftovers, JUST because we told him too? LMAO you've GOT to be kidding. I really don't want to insult you and use the term naive, BUT... C'mon, the guy was a dictator who thumbed his nose at the rest of the world. By allowing Hussein to boot out the weapons inspectors, he bought himself YEARS in order to do hide that stuff. Do you really think he put those years to good use to destroy it all? ROTFLMAO, you're killing me here. Not to mention that most, if not all, of the world intelligence agencies were saying he had the stuff. Most importantly of all, naturally, CLINTON said it (that MUST make it so LOL). NOW, just because the peaceniks are against the war, SUDDENLY there are none. Okay, maybe gullible perhaps?", 
   {}, 
   59617, 
   null, 
   1090699620.0
  ], 
  [
   59658, 
   null, 
   "jerichoholic104", 
   "What difference does it make if Saddam had WMD or not? Bush said that there were WMD before invading Iraq. People believed him and still said that invading Iraq was a horrible idea. The biggest anti-war protest in the world took place under the assumption that Saddam DID have weapons. \n \n For me, it was never about whether he had the weapons or not, that point is irrelevant. Was he a threat to the USA? Doubtful. He likely wouldn't be able to hit the US, and if he did, he would swiftly be annihilated. Would it stop terrorism? Hell no. If you think that running a \"shock and awe\" campaign on Iraq, and then occupying the country afterward is going to stop a guy in manhattan from carrying a bomb onto a bus, you're out of your damn mind. Also, not a single 9/11 hijacker was from Iraq. I would be more worried about maybe tracking down Osama Bin Laden... a millionaire with a lot more pull in the terrorist world. \n \n I see that Iraq has the world's largest oil reserve. Some European countries are getting oil from Iraq for possibly much less than they would get it otherwise, and the American Dollar was becoming weaker, while the Euro was becoming stronger. I see no motivation behind the war in Iraq besides making money, and taking out a known dictator that happens to be hated by a lot of americans during an election year. Nothing like having the \"It's bad to change leadership during wartime\" line going for you when you're up for re-election either.", 
   {}, 
   59634, 
   null, 
   1090725360.0
  ], 
  [
   59665, 
   null, 
   "Duo_Maxwell", 
   "How about purchasing WMD or illegal weaponry? I'm recalling the discovery of Saddam's negotiations with the dear leader of North Korea to purchase illegal missiles and a missile production system.\n\n \n Hell, I can do that too. Besides, he was backstabbed by North Korea. Go look it up, they took his money and gave him nothing. Pretty funny actually. \n \n \nThe presence of the coalition and the war itself put an end to this but we didn't discover it was even happening until after Saddam was diposed.\n\n \n We found actual WMD, missiles and production systems? You DO realize that the missiles we found were tested with virtually no warhead and a full fuel payload right? Kinda skews things doesn't it? \n \n \nI'm assuming that you do not dispute the fact that Hussein HAD WMD at one point, correct?\n\n \n Correct. \n \n \nWell, are you really gonna tell me that suddenly, after using them that one time, he just up and destroyed all the leftovers, JUST because we told him too?\n\n \n Considering that we destroyed most of the weapons during operation desert storm, along with the means to produce them, and much of the weapons were destroyed by the UN inspectors over the years, and the means to produce them were dismantled as well, what was left to destroy? The only WMD found that were even slightly viable were from the Iraq-Iran war. Let's put it this way, Israel is the closet target Iraq would hit. The Israelis had no intention to attack. If the Isrealis weren't going to attack a direct threat, was there any? Besides, reports as well as interviews from scientists and relatives are all saying the same thing: There were no WMD, the best we got is from a fabrication from Chalabi. The rest is out of date. \n \n \nI really don't want to insult you and use the term naive, BUT... C'mon, the guy was a dictator who thumbed his nose at the rest of the world. \n\n \n There are many like that we support. So therefore all dictators and rouge states are similar are harboring weapons. Guess we have to invade Saudi Arabia, Pakistan, Israel, Iran... how can he produce something without the means to do so? \n \n \n Do you really think he put those years to good use to destroy it all? \n\n \n How could he destroy what he did not have? \n \n \nNot to mention that most, if not all, of the world intelligence agencies were saying he had the stuff. \n\n \n And at the same time the people who were actually there said he didn't. the Isrealis have even gone back on the WMD intelligence, FRICKEN MOSSAD. What does that say? \n \n \nCLINTON said it (that MUST make it so LOL). NOW, just because the peaceniks are against the war, SUDDENLY there are none. Okay, maybe gullible perhaps?\n\n \n Clinton was a compuslive liar out to save his own skin. Any intention or implication to link my beliefs that do not correspond to you to a faith or love in Clinton will fail, and I will point out every fabrication, every attempt, and every half-baked method you do to attempt to succeed in painting a picture that does not exist. DO NOT TRY THAT AGAIN. Clinton was wrong. Your point is?", 
   {}, 
   59658, 
   null, 
   1090727640.0
  ], 
  [
   59755, 
   null, 
   "syklopps61", 
   "Considering that we destroyed most of the weapons during operation desert storm, along with the means to produce them, and much of the weapons were destroyed by the UN inspectors over the years, and the means to produce them were dismantled as well, what was left to destroy? The only WMD found that were even slightly viable were from the Iraq-Iran war.\n \n \n MOST being the operative word. If I'm not mistaken, I thought prior to resumption of hostilities that Hussein had failed to provide documentation for the disposal of a SIGNIFICANT amount of WMD. And I wasn't aware that there was a timestamp placed on the WMD-FIRST it's SIGNIFICANT, NOW it's RECENT?\n \n \n Let's put it this way, Israel is the closet target Iraq would hit. The Israelis had no intention to attack. If the Isrealis weren't going to attack a direct threat, was there any? Besides, reports as well as interviews from scientists and relatives are all saying the same thing: There were no WMD, the best we got is from a fabrication from Chalabi. The rest is out of date. \n \n \n Well, I think we all know that if Israel had their way, they would wipe out the Middle East completely, but obviously they succumb to our pressure to show restraint so that the whole thing doesn't blow up in everyone's faces. And these interviews? We're all aware of the threats made against them and their families, so I guess it depends on when these interviews were conducted and where. Furthermore, I heard a report that Hussein still has people around the world to assassinate dissidents and the like, so I would think even though we have deposed Hussein, the threat still lives on.\n \n \nC'mon, the guy was a dictator who thumbed his nose at the rest of the world. \n \n \n There are many like that we support. So therefore all dictators and rouge states are similar are harboring weapons. Guess we have to invade Saudi Arabia, Pakistan, Israel, Iran... how can he produce something without the means to do so? \n\n \n I said this in reference to the fact that it is naive to believe that just because we told him to destroy all the WMD doesn't mean he did. It's silly to give him the benefit of the doubt. \n \n \nHow could he destroy what he did not have? \n \n \n Said with such authority, but how do you really know?\n \n \n \nAnd at the same time the people who were actually there said he didn't. the Isrealis have even gone back on the WMD intelligence, FRICKEN MOSSAD. What does that say? \n \n \n What that says to me is that Bush cannot be blamed IF there turns out to be no WMD, but many would like to see that happen. Is the President supposed to be omniscient? He makes decisions based on information provide to him-if the intelligence was wrong, reasonable people cannot blame him then.\n \n \n \nClinton was a compuslive liar out to save his own skin. Any intention or implication to link my beliefs that do not correspond to you to a faith or love in Clinton will fail, and I will point out every fabrication, every attempt, and every half-baked method you do to attempt to succeed in painting a picture that does not exist. DO NOT TRY THAT AGAIN. Clinton was wrong. Your point is?\n[/QUOTE]\n \n With all due respect, chill, geeeeeeeez. My intention was to point out those that support Clinton, and with this there is no debate, the ones who are desperate to lay blame on Bush so their \"boy\" can walk free-yes I generalized, but I have not found too many Liberals in my personal life that will proudly claim devotion to him, but still secretly do. IF you truly loathe him, my apologies.", 
   {}, 
   59665, 
   null, 
   1090807980.0
  ], 
  [
   59771, 
   null, 
   "Duo_Maxwell", 
   "MOST being the operative word. If I'm not mistaken, I thought prior to resumption of hostilities that Hussein had failed to provide documentation for the disposal of a SIGNIFICANT amount of WMD. And I wasn't aware that there was a timestamp placed on the WMD-FIRST it's SIGNIFICANT, NOW it's RECENT?\n\n \n Timestamp? Point is most of the weapons, and almost all the means to produce them were destroyed. Question: Do you get Newsweek or Time? \n \n \nWell, I think we all know that if Israel had their way, they would wipe out the Middle East completely, but obviously they succumb to our pressure to show restraint so that the whole thing doesn't blow up in everyone's faces.\n\n \n Except that they depend on many arabs in their economy. Over a million of them work in inner Israel. Not to mention the trade that they do with the regional players. \n \n \nFurthermore, I heard a report that Hussein still has people around the world to assassinate dissidents and the like, so I would think even though we have deposed Hussein, the threat still lives on.\n\n \n he may, but with no support, no payments and no rewards of any sorts, the motivation pretty much evaporates. No religious fanaticsm either: Iraq was the most secular (except for maybe turkey) state in the ME before we invaded. \n \n \nI said this in reference to the fact that it is naive to believe that just because we told him to destroy all the WMD doesn't mean he did. It's silly to give him the benefit of the doubt.\n\n \n But the people who were actually there believed he did. Not some shrub in the pentagon. It is silly to imagine arguments. \n \n \nSaid with such authority, but how do you really know?\n\n \n Well, has there been anything found? emoticon_rolleyes It's been, what a YEAR? \n \n \nWhat that says to me is that Bush cannot be blamed IF there turns out to be no WMD, but many would like to see that happen. Is the President supposed to be omniscient? He makes decisions based on information provide to him-if the intelligence was wrong, reasonable people cannot blame him then.\n\n \n The report on WMD and links thinks otherwise. Bush ignored information that said he didn't, he ignored interviews that didn't help, ignored everytnhing that contricited invasion rational. HE CAN be blamed for that. The intel was sketchy, he shouldn't have gone without concrete proof. Kennedy would be appalled. \n \n \nWith all due respect, chill, geeeeeeeez. My intention was to point out those that support Clinton, and with this there is no debate, the ones who are desperate to lay blame on Bush so their \"boy\" can walk free-yes I generalized, but I have not found too many Liberals in my personal life that will proudly claim devotion to him, but still secretly do. IF you truly loathe him, my apologies.\n\n \n Try not to generalize me or others. I'm not a liberal, but often more conservative then many republicans.", 
   {}, 
   59755, 
   null, 
   1090813920.0
  ], 
  [
   59809, 
   null, 
   "jim's trucking", 
   "KU = Kansas University\n \n Why don't / didn't we invade North Korea or Iran? Their weapons programs are well documented. Did he actually GET the uranium?  \n\n \n That has nothing to do with the fact that the statement was not inaccurate as claimed by the Bushwhackers.", 
   {}, 
   59548, 
   null, 
   1090856940.0
  ], 
  [
   59813, 
   null, 
   "Kronus", 
   "I have conclusive proof that aliens exist, and visit Earth.\n \n Now, if alien do happen to show up tomorrow, does that mean that I just told the truth? No, I just made that up. Even if it turns out that aliens do exist, I still made it up.\n \n The first draft of Bush's speech had him stating outright that Saddam was trying to buy uranium. The CIA told him there was no proof of that, and that it probably wasn't true. So they changed the speech to say that the British say that Saddam was trying to buy uranium, which was technically true, the British did say that. Still, to the best of Bush's knowledge, Saddam didn't do what he was accused of. Even if we do find out now that the statement is correct, when Bush said it he believed it to be false.", 
   {}, 
   59809, 
   null, 
   1090858020.0
  ], 
  [
   59814, 
   null, 
   "unkerpaulie", 
   "I believe the point was in the question. Why haven't we heard from the accusers on this?\n \n I'm not pro-Bush or anti-Kerry.\n \n I'm pro-truth and pro-\"the best man\". In this season, that's George Bush.\n\n i agree that bush may be the better man (compared to kerry), but he's definitely caught in a lie. jim, if you were pro-truth youd face the reality of bush's actions. im not anti-bush either, in fact i hope he wins this coming election, but lets look at the facts\n \n - the fbi knew within 24 hours of 9/11 itself that osama bin laden and the al qaeda was resposible for the attacks\n - bush declared a grand \"war on terrorism\", and yet totally ignores more than a dozen countries that are known for haboring and training american-hating terrorist groups, including those affilliated with al qaeda. america has done absolutely nothing about them\n - saddam was a target of terrorist affilliated with bin laden himself. in fact, the terrorist group from iraq were actually enemies of saddam that were working to assassinate him.\n - saddam himself has been found with neither weapons of mass destruction nor agenda to war against america in any way\n - bush goes to war with iraq anyway. \n \n ok, so lets review the facts. we overlook more than a dozen countries that we know habour terrorists intent on harming americans, and we attack a country that was by all indications incapable and uninterested in harming americans. oh yeah, and we eliminate saddam, the target that bin laden was trying to assissinate.\n \n yet bush tells us that america is safer and we are winning the war on terrorism (a war that, imo, we are not even fighting)\n \n bush is lying. grossly", 
   {}, 
   59439, 
   null, 
   1090858800.0
  ], 
  [
   59815, 
   null, 
   "unkerpaulie", 
   "What difference does it make if Saddam had WMD or not? Bush said that there were WMD before invading Iraq. People believed him and still said that invading Iraq was a horrible idea. The biggest anti-war protest in the world took place under the assumption that Saddam DID have weapons. \n \n For me, it was never about whether he had the weapons or not, that point is irrelevant. Was he a threat to the USA? Doubtful. He likely wouldn't be able to hit the US, and if he did, he would swiftly be annihilated. Would it stop terrorism? Hell no. If you think that running a \"shock and awe\" campaign on Iraq, and then occupying the country afterward is going to stop a guy in manhattan from carrying a bomb onto a bus, you're out of your damn mind. Also, not a single 9/11 hijacker was from Iraq. I would be more worried about maybe tracking down Osama Bin Laden... a millionaire with a lot more pull in the terrorist world. \n \n I see that Iraq has the world's largest oil reserve. Some European countries are getting oil from Iraq for possibly much less than they would get it otherwise, and the American Dollar was becoming weaker, while the Euro was becoming stronger. I see no motivation behind the war in Iraq besides making money, and taking out a known dictator that happens to be hated by a lot of americans during an election year. Nothing like having the \"It's bad to change leadership during wartime\" line going for you when you're up for re-election either.\n\n echoed for impact...", 
   {}, 
   59658, 
   null, 
   1090859100.0
  ], 
  [
   60126, 
   null, 
   "jerichoholic104", 
   "echoed for impact...\n\n \n I didn't figure anyone would have anything to say about it. I guess I'll just declare victory.", 
   {}, 
   59815, 
   null, 
   1091052840.0
  ], 
  [
   60133, 
   null, 
   "jim's trucking", 
   "I didn't figure anyone would have anything to say about it. I guess I'll just declare victory.\nYou can declare whatever you wish. You still have not proved that Bush lied about anything. He simply acted on the same information that others had. Clinton declared Saddam a threat and signed the Iraqi Liberation Act in 1998. Kerry said he was a threat and should be removed. Now that he's running for President, it's Bush that lied.\n \n The 16 words have been shown to be accurate. The Brits hold to their original intelligence that Saddam was trying to buy uranium. That's all Bush said in the 16 words. The liberal logic school precludes the retraction of false accusations...that's why you people won't admit that you were wrong.\n \n I concede to the argument that the war has failed to do all it was intended. I am sorry for the death of every coalition soldier and civilian that has died as a result of the war. I am not sorry that the war started and that Saddam has been deposed as intended by the Iraqi Liberation Act (again, must I say) signed by Bill Clinton in 1998 making it US policy to depose the bastard.\n \n You can claim victory upon victory, but I see this as an empty claim.", 
   {}, 
   60126, 
   null, 
   1091056320.0
  ], 
  [
   60139, 
   null, 
   "jerichoholic104", 
   "And I say the war was still invalid. Seems that Bill O'Reilly even agrees that Bush was wrong (you can find it for yourself in the interview he had with Michael Moore). Having no weapons of mass destruction was NOT a reason that anyone had for not going to war. It just helps debunk the reason given for GOING to war. He could have a full nuclear arsenal and it still wouldn't make a bit of difference as far as the reasons against war go.", 
   {}, 
   60133, 
   null, 
   1091057400.0
  ], 
  [
   60140, 
   null, 
   "jim's trucking", 
   "And I say the war was still invalid. Seems that Bill O'Reilly even agrees that Bush was wrong (you can find it for yourself in the interview he had with Michael Moore). Having no weapons of mass destruction was NOT a reason that anyone had for not going to war. It just helps debunk the reason given for GOING to war. He could have a full nuclear arsenal and it still wouldn't make a bit of difference as far as the reasons against war go.\nApparently, nothing makes any difference to you.", 
   {}, 
   60139, 
   null, 
   1091057580.0
  ], 
  [
   60142, 
   null, 
   "jerichoholic104", 
   "Sure. If I felt that Saddam was a direct threat to the USA, fine, he has to be put down then. He wasn't. I'd like you to show me exactly which parts of my original post that you disagree with. I'm not sure that you can find a point that I made which would invalidate my stance.", 
   {}, 
   60140, 
   null, 
   1091058060.0
  ], 
  [
   60201, 
   null, 
   "jim's trucking", 
   "What difference does it make if Saddam had WMD or not? Bush said that there were WMD before invading Iraq. People believed him and still said that invading Iraq was a horrible idea. The biggest anti-war protest in the world took place under the assumption that Saddam DID have weapons. \n \n For me, it was never about whether he had the weapons or not, that point is irrelevant. Was he a threat to the USA? Doubtful. He likely wouldn't be able to hit the US, and if he did, he would swiftly be annihilated. Would it stop terrorism? Hell no. If you think that running a \"shock and awe\" campaign on Iraq, and then occupying the country afterward is going to stop a guy in manhattan from carrying a bomb onto a bus, you're out of your damn mind. Also, not a single 9/11 hijacker was from Iraq. I would be more worried about maybe tracking down Osama Bin Laden... a millionaire with a lot more pull in the terrorist world. \n \n I see that Iraq has the world's largest oil reserve. Some European countries are getting oil from Iraq for possibly much less than they would get it otherwise, and the American Dollar was becoming weaker, while the Euro was becoming stronger. I see no motivation behind the war in Iraq besides making money, and taking out a known dictator that happens to be hated by a lot of americans during an election year. Nothing like having the \"It's bad to change leadership during wartime\" line going for you when you're up for re-election either.\nIf Saddam was not a threat, why was the Iraqi Liberation Act signed by Clinton, making it US policy to depose him?\n \n If Saddam was not a threat, why did John Kerry say he was?\n \n If Saddam was not a threat, why did Turd Kennedy say he was?\n \n These are the people that changed their minds after GWB actually did something about it. We can't have the Republicans looking good can we?\n \n The probability that Saddam actually had WMDs is quite high. He either hid them quite well or shipped them to another country. There is no proof that they were not there when the invasion started. There are indications that they were moved during the major combat. There were several (30 I believe) MIG jets found buried in the sand. What else could be buried in the sand?\n \n WMDs were not the only reason for attacking. After years of impotence on the part of the UN, after several years had passed since the signing of the Iraqi Liberation Act, time was up.", 
   {}, 
   59658, 
   null, 
   1091114880.0
  ], 
  [
   60204, 
   null, 
   "unkerpaulie", 
   "If Saddam was not a threat, why was the Iraqi Liberation Act signed by Clinton, making it US policy to depose him?\n \n If Saddam was not a threat, why did John Kerry say he was?\n \n If Saddam was not a threat, why did Turd Kennedy say he was?\n \n These are the people that changed their minds after GWB actually did something about it. We can't have the Republicans looking good can we?\n \n The probability that Saddam actually had WMDs is quite high. He either hid them quite well or shipped them to another country. There is no proof that they were not there when the invasion started. There are indications that they were moved during the major combat. There were several (30 I believe) MIG jets found buried in the sand. What else could be buried in the sand?\n \n WMDs were not the only reason for attacking. After years of impotence on the part of the UN, after several years had passed since the signing of the Iraqi Liberation Act, time was up.\n\n maybe they all just didnt like saddam. if 10 years down the road we do find a stockpile of weapons buried in the sand we might look back at today and feel relieved about flattening baghdad.\n \n what's most horrifying is the fact that bush twisted the public's attention away from the culprits that caused almost 3000 deaths (attempted to kill over 12000) and now we're not doing anything about terrorism at all", 
   {}, 
   60201, 
   null, 
   1091115960.0
  ], 
  [
   60208, 
   null, 
   "jim's trucking", 
   "maybe they all just didnt like saddam. if 10 years down the road we do find a stockpile of weapons buried in the sand we might look back at today and feel relieved about flattening baghdad.\n \n what's most horrifying is the fact that bush twisted the public's attention away from the culprits that caused almost 3000 deaths (attempted to kill over 12000) and now we're not doing anything about terrorism at all\n\n \n See how flippantly you cast aside logic? \"Maybe they all just didn't like Saddam.\" \n \n I don't believe the effort to get bin Laden has diminished. He's still a marked man. He just hides really well.", 
   {}, 
   60204, 
   null, 
   1091116860.0
  ], 
  [
   60209, 
   null, 
   "Kronus", 
   "See how flippantly you cast aside logic? \"Maybe they all just didn't like Saddam.\" \n \n I don't believe the effort to get bin Laden has diminished. He's still a marked man. He just hides really well.\n\n \n We know about where he is. He's somewhere along the Afghanistan, Pakistan border. Despite knowing this, we're pulling troops out of Afghanistan so that we can ship them to Iraq.\n \n Still think we're doing all we can to find bin Laden?", 
   {}, 
   60208, 
   null, 
   1091117820.0
  ], 
  [
   60211, 
   null, 
   "jim's trucking", 
   "We know about where he is. He's somewhere along the Afghanistan, Pakistan border. Despite knowing this, we're pulling troops out of Afghanistan so that we can ship them to Iraq.\n \n Still think we're doing all we can to find bin Laden?\n\n \n If you know where he is, why don't you give up the info. It's more correct to say, \"He's believed to be somewhere along...\".\n \n Do you remember how long it took to find Saddam in his rat-hole?\n \n If I knew all that was being done to find him, I couldn't tell you about it. I'm not in the loop. What I said was that I don't believe the effort to find him has diminished. Pulling some troops out of Afghanistan doesn't imply anything regarding bin Laden.", 
   {}, 
   60209, 
   null, 
   1091119980.0
  ], 
  [
   60259, 
   null, 
   "jerichoholic104", 
   "If Saddam was not a threat, why was the Iraqi Liberation Act signed by Clinton, making it US policy to depose him?\n \n If Saddam was not a threat, why did John Kerry say he was?\n \n If Saddam was not a threat, why did Turd Kennedy say he was?\n \n\n \n Since when do you respect the opinion of Clinton, Kerry, and Kennedy? only when they agree with you, right? No, Saddam was not a threat to the USA. He could not have successfully used any of his \"huge arsenal\" to attack the United States on her own soil sucessfully. \n \n \n \nThese are the people that changed their minds after GWB actually did something about it. We can't have the Republicans looking good can we?\n \n The probability that Saddam actually had WMDs is quite high. He either hid them quite well or shipped them to another country. There is no proof that they were not there when the invasion started. There are indications that they were moved during the major combat. There were several (30 I believe) MIG jets found buried in the sand. What else could be buried in the sand?\n \n WMDs were not the only reason for attacking. After years of impotence on the part of the UN, after several years had passed since the signing of the Iraqi Liberation Act, time was up.\n\n As I said, even believing the fact that Saddam had weaopns of mass destruction, it is not enough reason to send our soldiers to attack another sovreign nation. Especially when we have bigger battles to fight, much more pertinent to combating terrorists. Saddam Hussein is not a terrorist, he was a dictator. There is a difference. In order to go to war, there would have to be both the ability and intent to strike our country. I do not believe there was the ability, or intent.", 
   {}, 
   60201, 
   null, 
   1091138700.0
  ], 
  [
   60269, 
   null, 
   "jim's trucking", 
   "Since when do you respect the opinion of Clinton, Kerry, and Kennedy? only when they agree with you, right? No, Saddam was not a threat to the USA. He could not have successfully used any of his \"huge arsenal\" to attack the United States on her own soil sucessfully. \nI figured that when you got home from school you'd reply to my posts...one, two, three!\n \n You're missing the point there, kiddo. Kerry called him a threat. Kennedy called him a threat. Now they've both bashed Bush for calling him a threat.\n \n It's funny that the same arguments used by the liberals seem invalid when used by Bush. All of a sudden he's a liar.\n \n You appear confident in your \"knowledge\" of Saddam's capabilities. I seriously doubt you know anything of what he could have done. It doesn't take a long range missile to strike a blow on US soil...all one has to do is sneak something deadly into the country. Now tell me that can't be done.\n \n You can probably count on something bad happening here before the November election. The weapons may have come from Saddam. He did have a stash of them. (Where are they now?) \n \n \n \n\n As I said, even believing the fact that Saddam had weaopns of mass destruction, it is not enough reason to send our soldiers to attack another sovreign nation. Especially when we have bigger battles to fight, much more pertinent to combating terrorists. Saddam Hussein is not a terrorist, he was a dictator. There is a difference. In order to go to war, there would have to be both the ability and intent to strike our country. I do not believe there was the ability, or intent.\nSaddam wouldn't have to attack our country. He could pay people to attack our people in any country. Oh my, he did that, didn't he? I believe he offered to pay $25,000 per suicide bomber. What do you think about that? Is that not terroristic?\n \n He could use chemical weapons...he did have some, and the capability to make more. (I know we sold him some years ago, but it wasn't sarin.)\n \n Stop being so trusting of the enemy!\n \n emoticon_xkill all  terrorists and those who support them!", 
   {}, 
   60259, 
   null, 
   1091140320.0
  ], 
  [
   60307, 
   null, 
   "jerichoholic104", 
   "... it's summer.... and anyway, I work in Pontiac, building GM trucks. Ford sucks. Just because I'm not an old senile republican idiot doesn't mean that I'm still in high school.\n \n My point is that I don't give a damn what Kerry or Kennedy or Clinton said. I do not sheepishly follow the leadership of the democratic party. I have a mind of my own. I never felt threatened by Saddam Hussein. He is not the #1 threat to America right now. He was not responsible for 9/11. Look for whoever was responsible for the attack on 9/11? Fine. Do what has to be done to bring them to justice (justice, not revenge). Even if something bad does happen here again soon, I can guarantee you that it wont be because of something Saddam did. \n \n I'm not supportive of Saddam Hussein. I am supportive of America, and the interests of American citizens and soldiers. I do not feel that it is okay to have 900 of our sons and daughters die to remove a dictator halfway around the world, who was not a threat to us otherwise. Weapons of Mass destruction are not an issue for me. If he even struck the USA, it would make but a small dent before his whole regime would be completely annihilated. I'm not really worried about whatever insignificant threat Saddam Hussein was. I do believe that there are other terrorists groups in the world that are more important to stop. I think more should be done about that, and less diverting attention to someone unrelated.", 
   {}, 
   60269, 
   null, 
   1091155200.0
  ], 
  [
   60400, 
   null, 
   "jim's trucking", 
   "Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation .... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction... So the threat of Saddam Hussein with weapons of mass destruction is real.\" - Sen. John F. Kerry (D, MA), Jan. 23. 2003.\n \n \"I will be voting to give the President! of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), Oct. 9, 2002", 
   {
    "post_info": {
     "post_title": "If Bush lied, so did Johnny!"
    }
   }, 
   60307, 
   null, 
   1091218020.0
  ], 
  [
   60403, 
   null, 
   "Kronus", 
   "You seem to have a problem with this concept. Lying isn't saying something incorrect, lying is saying something you know is incorrect. Bush was told that by his own people that Saddam probably didn't have any WMDs, and then told the country that Saddam proabably did; that's lying. The Senate was told, by Bush, that Saddam had WMD's, and then they trusted what the president said. That's just poor judgement.", 
   {}, 
   60400, 
   null, 
   1091218620.0
  ], 
  [
   60404, 
   null, 
   "unkerpaulie", 
   "Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime ... He presents a particularly grievous threat because he is so consistently prone to miscalculation .... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction... So the threat of Saddam Hussein with weapons of mass destruction is real.\" - Sen. John F. Kerry (D, MA), Jan. 23. 2003.\n \n \"I will be voting to give the President! of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" - Sen. John F. Kerry (D, MA), Oct. 9, 2002\n\n disarm saddam? saddam had no arms!! \n \n and yes, kerry echoed the lied that bush created.\n \n today in the news an al qaeda operative that helped orchestrate the embassy bombings was caught IN PAKISTAN. have you noticed that ALL the al qaeda terrorist that were caught were outside of iraq? there are no al qaeda terrorists in iraq, none! yet we have a huge military presence in iraq. \n \n jim, you are not dealing with what's important. saddam had no weapons, and iraq has no al qaeda terrorists. the presidents and politicians continue to SAY that saddam is a threat, and you continue to swear by their words, rather than actually looking at the facts. i know politicians lie. hopefully you know politicians lie. theyre all liars. im not defending any politicians, so drop the republican good, democrats bad charade, because you seem to forget that i am pretty immune to political bias. i am not defending any political cause, or attacking any either. but im dealing with the reality.\n \n if we were really fighting terrorism we'd have troops in pakistan, saudi arabia, sudan, jordan, and the other places where we known are terrorist occupations.\n \n you never answered this: what does invading iraq has to do with the war on terrorism?", 
   {}, 
   60400, 
   null, 
   1091219160.0
  ], 
  [
   60405, 
   null, 
   "jim's trucking", 
   "You seem to have a problem with this concept. Lying isn't saying something incorrect, lying is saying something you know is incorrect. Bush was told that by his own people that Saddam probably didn't have any WMDs, and then told the country that Saddam proabably did; that's lying. The Senate was told, by Bush, that Saddam had WMD's, and then they trusted what the president said. That's just poor judgement.\nNo, I have no trouble with that concept. I understand it well. \n \n Bush was told by his own people that Saddam probably had not been dealing for some uranium. He clarified that British intelligence claimed that Saddam had been dealing for uranium. He got chastized for that. Now it turns out to be true.\n \n Bush did not mislead Clinton, Kerry, Kennedy and others into thinking there were WMDs. They were all mislead by the same faulty intelligence. You seem to have a problem with that.", 
   {}, 
   60403, 
   null, 
   1091220240.0
  ], 
  [
   60407, 
   null, 
   "jim's trucking", 
   "disarm saddam? saddam had no arms!! \n \n and yes, kerry echoed the lied that bush created.\nI believe it was Slick Willy Clinton that came up with it first.\n \n \n \n\n jim, you are not dealing with what's important. saddam had no weapons, and iraq has no al qaeda terrorists. the presidents and politicians continue to SAY that saddam is a threat, and you continue to swear by their words, rather than actually looking at the facts. i know politicians lie. hopefully you know politicians lie. theyre all liars. im not defending any politicians, so drop the republican good, democrats bad charade, because you seem to forget that i am pretty immune to political bias. i am not defending any political cause, or attacking any either. but im dealing with the reality.\nEvidently, you have failed to comprehend previous statements where I said I disagree with some of Bush's policies, where I would vote for Lieberman, where I think JFK was a great President. I'm not a Republican.\n \n\n if we were really fighting terrorism we'd have troops in pakistan, saudi arabia, sudan, jordan, and the other places where we known are terrorist occupations.\nTheir time may come.\n \n \n \n\n you never answered this: what does invading iraq has to do with the war on terrorism?\nSaddam was a terrorist. Saddam was backing terrorists. It is a good thing that he's out of business. It's just a pity he didn't start shooting when they found him cowering in the rat-hole...we could have helped him join his sons in hell.", 
   {}, 
   60404, 
   null, 
   1091220720.0
  ], 
  [
   60408, 
   null, 
   "Bush Is The Man", 
   "disarm saddam? saddam had no arms!! \n \n and yes, kerry echoed the lied that bush created.\n\n \n \n So does that make Kerry a liar? If he were President now, and he thought that Iraq had WMDs (which he did), would you criticize him? We had info from MI-6, the Russian intelligence, and the CIA telling us that Saddam either had WMDs or was looking to get WMDs. It is known that he did have chemical weapons (mustard gas and other nerve agents), and he threatened several nations. What if Bush hadn't have invaded Iraq (and ignored the CIA, MI-6, and the Russians) and Saddam attacked the US? You and many other people would probably criticize him for not invading. He was in a lose-lose situation. If he invades, he gets jumped on. If he doesn't and something happens, he gets jumped on. If he doesn't and we end up finding WMDs, he gets jumped on. He did what he thought was right...wouldn't you trust your own CIA (along with the MI-6 and Russians) if you were President? Bush didn't lie to the US. He believed the information that was given to him by several credible agencies, and he had reason to. He didn't go over to Iraq himself and look for WMDs, that's what the CIA is for. So maybe they lied to Bush or were wrong, but there is no way for him to be 100% that they are right. So Bush did not lie to the US. If you want to look at it that way, the CIA and George Tenet lied to the US, and President Bush unknowingly relayed that message to the public. He did what he thought was right with the information given to him. Does anyone not respect that? I doubt anyone in their right mind would have not invaded Iraq because they thought the CIA was wrong. Looking back on that 20/20, maybe you wouldn't have. But nobody has that luxury. \n \n \n \ntoday in the news an al qaeda operative that helped orchestrate the embassy bombings was caught IN PAKISTAN. have you noticed that ALL the al qaeda terrorist that were caught were outside of iraq? there are no al qaeda terrorists in iraq, none! yet we have a huge military presence in iraq.\n\n \n \n \n Does the name Al-Zarqawi ring a bell? He, along with his other cowardly henchmen are kidnapping innocent civilians INSIDE Iraq and holding them hostage IN Iraq. The 9/11 Report (maybe you should read it) also discusses Saddam offering Bin Laden shelter in Iraq in the late 1990s, early 2000s. In my mind, that is aiding terrorism. Saddam was a terrorist himself, hiding under the position of a dictator. He murdered tens of thousands of innocent people, much like Bin Laden and other terrorists are doing. Perhaps he didn't have WMD, perhaps he did. Putting that aside, we still had the right to invade Iraq to free all the innocent Iraqis whose lives were in jeopardy under this brutal dictator. That is what the UN is recommending now, that we go into Sudan to free the Africans from the rebel Muslims. How is that any different than the situation in Iraq? The situation in Iraq was even worse. \n \n \n \n \njim, you are not dealing with what's important. saddam had no weapons, and iraq has no al qaeda terrorists. the presidents and politicians continue to SAY that saddam is a threat, and you continue to swear by their words, rather than actually looking at the facts. i know politicians lie. hopefully you know politicians lie. theyre all liars. im not defending any politicians, so drop the republican good, democrats bad charade, because you seem to forget that i am pretty immune to political bias. i am not defending any political cause, or attacking any either. but im dealing with the reality.\n\n \n \n \n \n I am not sure what you mean by weapons, but Saddam did have weapons. A few months ago we blew up a few of his bombs that then emmitted mustard gas. He also gassed thousands of Kurds. You don't consider that weapons? Nobody is lying about that...he DID do that. That is a concrete fact, no ifs, ands, or buts.\n \n \n \n \nif we were really fighting terrorism we'd have troops in pakistan, saudi arabia, sudan, jordan, and the other places where we known are terrorist occupations.\n\n \n \n \n So we should take over the whole Middle East? That's why we have allies who aid us in eliminating terrorism. For instance, Pakistan caught one high-ranking Al-Qaeda leader the other day. Iraq wasn't helping us. They were knowingly harboring terrorists, that's why we invaded. Saudi Arabia is also helping us.\n \n \n \n \nyou never answered this: what does invading iraq has to do with the war on terrorism\n\n \n \n Did you really just ask that question? Saddam was a terrorist. He killed his own people for power and greed. He also harbored terrorists and paid their families $25,000. So Iraq has a direct tie to terrorism, maybe not 9/11, but to terrorism in general. Any country willingly aiding terrorism should be punished, and that's what we did. We removed the cause of the problem.", 
   {}, 
   60404, 
   null, 
   1091220720.0
  ], 
  [
   60410, 
   null, 
   "jim's trucking", 
   "No matter how much truth is presented, the Michael Moore fans will state otherwise...and they'll call you hardheaded if you don't roll over and agree with them, based on fuzzy logic.", 
   {}, 
   60408, 
   null, 
   1091221080.0
  ], 
  [
   60411, 
   null, 
   "Kronus", 
   "\n Bush did not mislead Clinton, Kerry, Kennedy and others into thinking there were WMDs. They were all mislead by the same faulty intelligence. You seem to have a problem with that.\n\n \n You think a Senator has access to the same intelligence information as the President does? You really have no clue, do you? For months prior to the invasion Bush kept saying how he had secret info, proving that Saddam had WMDs, but he couldn't share it, even with congress, for security reasons. Everyone just had to take his word that Saddam was about to nuke us all. And we know that he didn't have proof because his own people are now coming forward and saying how they were told by the administration to only present worse case scenarios. He wanted an excuse for war, and lied to the American people to generate one.", 
   {}, 
   60405, 
   null, 
   1091222100.0
  ], 
  [
   60414, 
   null, 
   "jim's trucking", 
   "You think a Senator has access to the same intelligence information as the President does? You really have no clue, do you? For months prior to the invasion Bush kept saying how he had secret info, proving that Saddam had WMDs, but he couldn't share it, even with congress, for security reasons. Everyone just had to take his word that Saddam was about to nuke us all. And we know that he didn't have proof because his own people are now coming forward and saying how they were told by the administration to only present worse case scenarios. He wanted an excuse for war, and lied to the American people to generate one.\nCan you prove any of that?", 
   {}, 
   60411, 
   null, 
   1091222520.0
  ], 
  [
   60415, 
   null, 
   "Bush Is The Man", 
   "You think a Senator has access to the same intelligence information as the President does? You really have no clue, do you? For months prior to the invasion Bush kept saying how he had secret info, proving that Saddam had WMDs, but he couldn't share it, even with congress, for security reasons. Everyone just had to take his word that Saddam was about to nuke us all. And we know that he didn't have proof because his own people are now coming forward and saying how they were told by the administration to only present worse case scenarios. He wanted an excuse for war, and lied to the American people to generate one.\n\n \n \n I want to know where exactly you found this information. This is the first time I have heard this. The Senate Intelligence Committee knew everything Bush knew. Where do you think Bush got his info from? So someone other than him had to know about the WMD and whether or not it was a lie. Kerry is on that Senate committee, so why did he say we need to go to Iraq? Your whole post was subjective and by no means factual. If you want to believe that, then so be it. But it's not true.", 
   {}, 
   60411, 
   null, 
   1091223540.0
  ], 
  [
   60417, 
   null, 
   "unkerpaulie", 
   "So does that make Kerry a liar? If he were President now, and he thought that Iraq had WMDs (which he did), would you criticize him? We had info from MI-6, the Russian intelligence, and the CIA telling us that Saddam either had WMDs or was looking to get WMDs. It is known that he did have chemical weapons (mustard gas and other nerve agents), and he threatened several nations. What if Bush hadn't have invaded Iraq (and ignored the CIA, MI-6, and the Russians) and Saddam attacked the US? You and many other people would probably criticize him for not invading. He was in a lose-lose situation. If he invades, he gets jumped on. If he doesn't and something happens, he gets jumped on. If he doesn't and we end up finding WMDs, he gets jumped on. He did what he thought was right...wouldn't you trust your own CIA (along with the MI-6 and Russians) if you were President? Bush didn't lie to the US. He believed the information that was given to him by several credible agencies, and he had reason to. He didn't go over to Iraq himself and look for WMDs, that's what the CIA is for. So maybe they lied to Bush or were wrong, but there is no way for him to be 100% that they are right. So Bush did not lie to the US. If you want to look at it that way, the CIA and George Tenet lied to the US, and President Bush unknowingly relayed that message to the public. He did what he thought was right with the information given to him. Does anyone not respect that? I doubt anyone in their right mind would have not invaded Iraq because they thought the CIA was wrong. Looking back on that 20/20, maybe you wouldn't have. But nobody has that luxury. \n\n bush was advised by the un inspectors that iraq had no wmds. in fact, ever since the 9/11 attacks bush started looking for reasons to pin some blame on iraq. he may have other sources telling him iraq had wmds, but he chose to believe the reports that supported him attacking iraq rather than all the reports that advised against it. bush wasnt misinformed, he had all the information and still insisted on attacking\n \n \nDoes the name Al-Zarqawi ring a bell? He, along with his other cowardly henchmen are kidnapping innocent civilians INSIDE Iraq and holding them hostage IN Iraq. The 9/11 Report (maybe you should read it) also discusses Saddam offering Bin Laden shelter in Iraq in the late 1990s, early 2000s. In my mind, that is aiding terrorism. Saddam was a terrorist himself, hiding under the position of a dictator. He murdered tens of thousands of innocent people, much like Bin Laden and other terrorists are doing. Perhaps he didn't have WMD, perhaps he did. Putting that aside, we still had the right to invade Iraq to free all the innocent Iraqis whose lives were in jeopardy under this brutal dictator. That is what the UN is recommending now, that we go into Sudan to free the Africans from the rebel Muslims. How is that any different than the situation in Iraq? The situation in Iraq was even worse. \n\n the 9/11 commission report indeed tells about al qaeda asking iraq for shelter, and the iraqi officials turned then down (here's the report, page 5 paragraph 4) i dont know where you got your info from...\n \n im glad you mentioned sudan, because the same report identifies sudan as the country that al qaeda first established itself, and it was from there al qaeda launched many attacks on americans. and they were supported completely by the sudan government. its all in the report, and im starting to wonder if you read it...\n \n \nI am not sure what you mean by weapons, but Saddam did have weapons. A few months ago we blew up a few of his bombs that then emmitted mustard gas. He also gassed thousands of Kurds. You don't consider that weapons? Nobody is lying about that...he DID do that. That is a concrete fact, no ifs, ands, or buts.\n\n true, but the concern that he was planning to attack america or a threat to america was based on false info. there are other countries in the middle east where civil atrocities are higher than under saddam, but we dont see it on the news, so to us it doesnt exist. but saddam is always in the forefront, so we all see his evil in the spotlight\n \n \nSo we should take over the whole Middle East? That's why we have allies who aid us in eliminating terrorism. For instance, Pakistan caught one high-ranking Al-Qaeda leader the other day. Iraq wasn't helping us. They were knowingly harboring terrorists, that's why we invaded. Saudi Arabia is also helping us.\n\n i just mentioned the pakistani arrest. iraq had a non-aggression pact with the al qaeda, and had no intentions of stopping them from doing what they were doing. but compared to the iranian, sudanese and egyptian government who actually assisted bin laden with transit and customs privelleges, i hardly see how we were justified in making iraq the number one terrorist enemy\n \n \nDid you really just ask that question? Saddam was a terrorist. He killed his own people for power and greed. He also harbored terrorists and paid their families $25,000. So Iraq has a direct tie to terrorism, maybe not 9/11, but to terrorism in general. Any country willingly aiding terrorism should be punished, and that's what we did. We removed the cause of the problem.\n\n the war was declared in response to the 9/11 attacks, which the fbi knew from the onset was the work of bin laden. we are focusing all our military efforts on iraq, while bin laden, a large part of al qaeda, and dozens of other nations that actively support their anti-american terrorist movements are totally overlooked. thats what you call a war on terrorism?", 
   {}, 
   60408, 
   null, 
   1091224680.0
  ], 
  [
   60420, 
   null, 
   "Kronus", 
   "Can you prove any of that?\n\n \n Don't watch the news much?\n \n Here's 5 minutes worth of googling:\n \n Senate inteligence commitee member still try to get Bush's pre war intel:\n http://www.kristv.com/Global/story.asp?S=2039026\n \n \"the CIA had never stated categorically that Saddam Hussein had WMD\"\n http://www.independent.org/tii/news/040713Eland.html\n \n Cheney's CIA visits pressured us: analysts\n http://www.smh.com.au/articles/2003/06/05/1054700335400.html?oneclick=true\n \n CIA and FBI ordered not to brief committee\n http://slate.msn.com/id/1008322/", 
   {}, 
   60414, 
   null, 
   1091225880.0
  ], 
  [
   60425, 
   null, 
   "Bush Is The Man", 
   "bush was advised by the un inspectors that iraq had no wmds. in fact, ever since the 9/11 attacks bush started looking for reasons to pin some blame on iraq. he may have other sources telling him iraq had wmds, but he chose to believe the reports that supported him attacking iraq rather than all the reports that advised against it. bush wasnt misinformed, he had all the information and still insisted on attacking\n\n \n \n And he was advised by his OWN CIA and the MI-6 and Russian Intelligence that they did have them. So who do you go with? Probably your own agency, the CIA. If he didn't believe the CIA was right, then why do we even have it? It's there for a reason, and he used it accordingly. The UN were cowards and wouldn't go in and search for the weapons in the 90s. If they would have, maybe we wouldn't be in this mess now.\n \n \n \n \nthe 9/11 commission report indeed tells about al qaeda asking iraq for shelter, and the iraqi officials turned then down (here's the report, page 5 paragraph 4) i dont know where you got your info from...\n\n \n \n You misread the sentence. Read it again. Iraq didn't respond. They never turned him down. I don't know where you got your version from, but the real version is not 12 pages long, it's more like 500 pages. So, here is the whole thing \n \n http://www.gpoaccess.gov/911/\n \n Then go to Chapter 2, page 66. Here is exactly what it says:\n \n \"There is also evidence that around this time Bin Ladin sent out a number\n of feelers to the Iraqi regime, offering some cooperation. None are reported\n to have received a significant response.According to one report, Saddam Hussein's efforts at this time to rebuild relations with the Saudis and other Middle Eastern regimes led him to stay clear of Bin Ladin. In mid-1998, the situation reversed; it was Iraq that reportedly took the initiative. In March 1998, after Bin Ladin's public fatwa against the United States, two al Qaeda members reportedly went to Iraq to meet with Iraqi intelligence. In July, an Iraqi delegation traveled to Afghanistan to meet first with the Taliban and then with Bin Ladin. Sources reported that one, or perhaps both, of these meetings was apparently arranged through Bin Ladin's Egyptian deputy, Zawahiri, who had ties of his own to the Iraqis. In 1998, Iraq was under intensifying U.S. pressure, which culminated in a series of large air attacks in December. Similar meetings between Iraqi officials and Bin Ladin or his aides may have occurred in 1999 during a period of some reported strains with the Taliban. According to the reporting, Iraqi officials offered Bin Ladin a safe haven in Iraq. Bin Ladin declined, apparently judging that his circumstances in Afghanistan remained more favorable than the Iraqi alternative. The reports describe friendly contacts and indicate some common themes in both sides' hatred of the United States.\"\n \n \n So, apparently you were wrong. You just found one little sentence in the 500 pages that made it seem as if you were right, when you weren't. Your quote simply stated that at one point in time (1994) the Iraqis didn't respond. Unfortunately 4 years later they did. If they did it once, they'll do it again.\n \n \n \nim glad you mentioned sudan, because the same report identifies sudan as the country that al qaeda first established itself, and it was from there al qaeda launched many attacks on americans. and they were supported completely by the sudan government. its all in the report, and im starting to wonder if you read it...\n\n \n \n Al Qaeda actually first established itself in Afghanistan, then later moved to Sudan. Check that out. It's in Chapter 2 as well.\n \n \n \n \ntrue, but the concern that he was planning to attack america or a threat to america was based on false info. there are other countries in the middle east where civil atrocities are higher than under saddam, but we dont see it on the news, so to us it doesnt exist. but saddam is always in the forefront, so we all see his evil in the spotlight\n\n \n \n \n Tell me what other GOVERNMENT is killing hundreds of thousands of innocent people with mustard gas? And forcing them to live in fear. You'd be hardpressed to find one. \n \n \n \n \ni just mentioned the pakistani arrest. iraq had a non-aggression pact with the al qaeda, and had no intentions of stopping them from doing what they were doing. but compared to the iranian, sudanese and egyptian government who actually assisted bin laden with transit and customs privelleges, i hardly see how we were justified in making iraq the number one terrorist enemy\n\n \n \n \n Neither Sudan, Iran, nor Egypt threatened us or refused to let the UN inspect their country for WMDs. They also didn't kill hundreds of thousands of their own people. That was also in the 90s. Egypt is now our ally, working with us to stop terrorism. And as for Sudan, the UN is working on something to do about them now. Iran also is violating UN resolutions by restarting their uranium treatment plans.\n \n \n \nthe war was declared in response to the 9/11 attacks, which the fbi knew from the onset was the work of bin laden. we are focusing all our military efforts on iraq, while bin laden, a large part of al qaeda, and dozens of other nations that actively support their anti-american terrorist movements are totally overlooked. thats what you call a war on terrorism?\n\n \n \n We have over 30,000 US troops in Afghanistan now. We also have troops in the Philippines, Qatar, UAE, Bahrain, and will be sending 1000s more to Greece for the Olympics.", 
   {
    "unicode_changes_made": true
   }, 
   60417, 
   null, 
   1091227440.0
  ], 
  [
   60426, 
   null, 
   "Bush Is The Man", 
   "I also thought you might want to know this.\n \n \"In a major victory for the White House, the Senate early Friday voted 77-23 to authorize President Bush to attack Iraq if Saddam Hussein refuses to give up weapons of mass destruction as required by U.N. resolutions. Hours earlier, the House approved an identical resolution, 296-133.\"\n \n \"The measure passed the Senate and House by wider margins than the 1991 resolution that empowered the current president's father to go to war to expel Iraq from Kuwait. That measure passed 250-183 in the House and 52-47 in the Senate.\"\n \n \n \n How come everyone is changing their minds now that we haven't found any WMDs? John Kerry voted for it, but now he retracts his statement and says we shouldn't have, but we need to stay until the end. He needs to make up his mind and decide what he wants to tell the American people. He is the LIAR.", 
   {}, 
   60420, 
   null, 
   1091228340.0
  ], 
  [
   60445, 
   null, 
   "Kronus", 
   "\"In a major victory for the White House, the Senate early Friday voted 77-23 to authorize President Bush to attack Iraq if Saddam Hussein refuses to give up weapons of mass destruction as required by U.N. resolutions. Hours earlier, the House approved an identical resolution, 296-133.\"\n \n Emphasis mine.\n \n Looks like Saddam did give up the weapons, and Bush invaded anyway. I guess that means that Bush broke US law, as well as international law. That would be why eveyone is saying we shouldn't have invaded. Thank you for providing the perfect quote to support my argument. :)", 
   {}, 
   60426, 
   null, 
   1091238360.0
  ], 
  [
   60451, 
   null, 
   "Bush Is The Man", 
   "\"In a major victory for the White House, the Senate early Friday voted 77-23 to authorize President Bush to attack Iraq if Saddam Hussein refuses to give up weapons of mass destruction as required by U.N. resolutions. Hours earlier, the House approved an identical resolution, 296-133.\"\n \n Emphasis mine.\n \n Looks like Saddam did give up the weapons, and Bush invaded anyway. I guess that means that Bush broke US law, as well as international law. That would be why eveyone is saying we shouldn't have invaded. Thank you for providing the perfect quote to support my argument. :)\n\n \n \n He actually didn't give them up. He also didn't let the UN in to check for them. But a month or so ago we found a bomb with mustard gas in it, so what does that say? Even IF Saddam didn't have weapons, we had the right to liberate those who were being killed for no reason. If you don't think so, then we should leave Sudan alone and let them keep killing innocent Africans?", 
   {}, 
   60445, 
   null, 
   1091247300.0
  ], 
  [
   60452, 
   null, 
   "Kronus", 
   "He actually didn't give them up. He also didn't let the UN in to check for them. But a month or so ago we found a bomb with mustard gas in it, so what does that say?\n\n It says you don't read the news carefully enough. It wasn't mustard gas, it was sarin gas. It was an old artillery shell that the UN had found and marked for destruction, and which looters grabbed in the chaos following the US invasion.\n \n \n\n Even IF Saddam didn't have weapons, we had the right to liberate those who were being killed for no reason.\n\n No, we didn't. There are international laws governing when you can invade another country, and Bush broke them. You may not like it, but those are the facts.", 
   {}, 
   60451, 
   null, 
   1091248920.0
  ], 
  [
   60459, 
   null, 
   "Bush Is The Man", 
   "It says you don't read the news carefully enough. It wasn't mustard gas, it was sarin gas. It was an old artillery shell that the UN had found and marked for destruction, and which looters grabbed in the chaos following the US invasion.\n \n \n No, we didn't. There are international laws governing when you can invade another country, and Bush broke them. You may not like it, but those are the facts.\n\n \n \n \n Then that means we need to stay out of Sudan, even though rebels are killing thousands of innocent people and forcing millions to leave the country. I don't even want to hear you say anything close to \"We should help them\" because it will be a complete hypocrisy. Also, read the following links about the mustard gas...\n \n http://cfrterrorism.org/weapons/mustard.html (this shows that Saddam used MUSTARD gas on his people)\n \n http://www.foxnews.com/story/0,2933,120137,00.html\n This link completely refutes anything you said. They did find sarin, but they also did find MUSTARD gas. To quote you, \"You may not like it, but those are the facts\".\n \n \n If you still don't believe it was MUSTARD gas, here is the quote from the FOX news site...\"Two weeks ago, U.S. military units discovered mustard gas that was used as part of an IED. Tests conducted by the Iraqi Survey Group (search) - a U.S. organization searching for weapons of mass destruction - and others concluded the mustard gas was \"stored improperly,\" which made the gas \"ineffective.\"\n \n They believe the mustard gas shell may have been one of 550 projectiles for which former Iraqi President Saddam Hussein failed to account when he made his weapons declaration shortly before Operation Iraqi Freedom began last year. Iraq also failed to then account for 450 aerial bombs with mustard gas. That, combined with the shells, totaled about 80 tons of unaccounted for mustard gas.\"\n \n \n \n \n Sorry to show you up emoticon_emb", 
   {
    "unicode_changes_made": true
   }, 
   60452, 
   null, 
   1091252100.0
  ], 
  [
   60485, 
   null, 
   "Kronus", 
   "Then that means we need to stay out of Sudan, even though rebels are killing thousands of innocent people and forcing millions to leave the country. \n\n Gee, last I looked we were talking about Iraq here. You want to stick to the topic?\n \n \n\n a U.S. organization searching for weapons of mass destruction - and others concluded the mustard gas was \"stored improperly,\" which made the gas \"ineffective.\"\n \n Sorry to show you up emoticon_emb\n\n You can apologise when you actually do. A bunch of shells where the gas is ineffective is not \"a bomb with mustard gas in it\", it's a bunch of old ineffective shells. When you stop exaggerating your original statements, then you can gloat if I call you on your facts incorrectly.", 
   {
    "unicode_changes_made": true
   }, 
   60459, 
   null, 
   1091284260.0
  ], 
  [
   60490, 
   null, 
   "georged", 
   "When we routinely map the floors of all the oceans right down to bed geological formations and Iraq has had probably more computer interpreted satellite imagery of its surface than the rest of the world combined, our occupation using 150,000 troops found Saddam in a hole but discovered no WMDs and our government has stated their intelligence was beyond faulty, why are WMD arguments still floating to the surface like tired belief system positions? \n \n Is it because some individuals still believe its acceptable to invade and occupy a sovereign nation based on 'suspicion' or dislike of a ruler's governing policies?", 
   {}, 
   60485, 
   null, 
   1091289060.0
  ], 
  [
   60498, 
   null, 
   "Bush Is The Man", 
   "Gee, last I looked we were talking about Iraq here. You want to stick to the topic?\n\n \n \n Why? You can't respond to my comment?\n \n \n \nYou can apologise when you actually do. A bunch of shells where the gas is ineffective is not \"a bomb with mustard gas in it\", it's a bunch of old ineffective shells. When you stop exaggerating your original statements, then you can gloat if I call you on your facts incorrectly.\n\n \n \n \n Well, I will apologize now because I was right. So you don't interpret that sentence to mean that it was mustard gas? It says, \"and others concluded the mustard gas was \"stored improperly,\" which made the gas \"ineffective\". It may have been stored improperly, but it was still mustard gas. Just because it was ineffective doesn't mean a thing. It was mustard gas. Point proven.", 
   {}, 
   60485, 
   null, 
   1091297760.0
  ], 
  [
   60499, 
   null, 
   "Bush Is The Man", 
   "When we routinely map the floors of all the oceans right down to bed geological formations and Iraq has had probably more computer interpreted satellite imagery of its surface than the rest of the world combined, our occupation using 150,000 troops found Saddam in a hole but discovered no WMDs and our government has stated their intelligence was beyond faulty, why are WMD arguments still floating to the surface like tired belief system positions? \n \n Is it because some individuals still believe its acceptable to invade and occupy a sovereign nation based on 'suspicion' or dislike of a ruler's governing policies?\n\n \n \n \n I agreed we might not find any WMDs, but the facts are there: we found a shell with MUSTARD GAS in it. Some people just can't believe it. I'm not even going to argue about WMDs because he could have given them to other terrorist groups or hidden them in the desert under the sand, like when we found some planes he had buried in the desert. \n \n And yes, I do believe we had the right to invade because of Saddam's \"policies\". He was killing thousands of people, making millions of others live in fear, testing chemicals on them, threatening other ME nations with WMDs, looking to get WMDs, and many other reasons. That is much more than just \"policies\".", 
   {}, 
   60490, 
   null, 
   1091298000.0
  ], 
  [
   60501, 
   null, 
   "georged", 
   "I agreed we might not find any WMDs, but the facts are there: we found a shell with MUSTARD GAS in it. Some people just can't believe it. I'm not even going to argue about WMDs because he could have given them to other terrorist groups or hidden them in the desert under the sand, like when we found some planes he had buried in the desert. \n \n And yes, I do believe we had the right to invade because of Saddam's \"policies\". He was killing thousands of people, making millions of others live in fear, testing chemicals on them, threatening other ME nations with WMDs, looking to get WMDs, and many other reasons. That is much more than just \"policies\".\n\n \n Except for the killing, we use the populations of other nations for that, you've pretty well described our country or Israel. Who should invade us to eliminate our WMDs? Or is our Christian based democracy the only 'real' system of government fit for the rest of the world?", 
   {}, 
   60499, 
   null, 
   1091300100.0
  ], 
  [
   60502, 
   null, 
   "Bush Is The Man", 
   "Except for the killing, we use the populations of other nations for that, you've pretty well described our country or Israel. Who should invade us to eliminate our WMDs? Or is our Christian based democracy the only 'real' system of government fit for the rest of the world?\n\n \n \n I will give you a few good facts, just in case you didn't already know.\n \n 1) Our government leaders aren't purposely murdering tens of thousands of our citizens because of their beliefs\n 2) We don't threaten to use our WMDs on other countries\n 3) We aren't testing our WMDs on our people\n 4) We don't threaten our people and make them live in fear\n 5) Bush doesn't have Jeb killing innocent people (like Saddam's sons were)\n \n \n Just one hypothetical question. What would you do if we find WMDs next month? Would you still complain about Bush lying? Would you give him any credit? Just curious, because I know if wedo find them, John Kerry will once again change his mind and say it was our duty to go in.", 
   {}, 
   60501, 
   null, 
   1091300640.0
  ], 
  [
   60513, 
   null, 
   "Kronus", 
   "\n 2) We don't threaten to use our WMDs on other countries\n \n\n Of course we have. Do you think we have all those nukes to use as paperweights? Back when there was a USSR we were fully prepared, or at least so we threatened, to use them.\n \n \n\n 3) We aren't testing our WMDs on our people\n \n\n Wrong. We marched our own troops into nuclear fallout, so we'd know what would happen. And we've release biological agents in populated region to study dispersal patterns. Read \"Germs\" by Miller, Engelberg, and Broad for more details.\n \n \n\n 4) We don't threaten our people and make them live in fear\n \n\n Unless you're an arab-american, then you should definately fear being locked up as an \"enemy-combatant\" with no trial and no access to a lawyer.\n \n \n\n 5) Bush doesn't have Jeb killing innocent people (like Saddam's sons were)\n \n\n You do know that Jeb is W's brother, not son, right?", 
   {}, 
   60502, 
   null, 
   1091303880.0
  ], 
  [
   60514, 
   null, 
   "Kronus", 
   " So you don't interpret that sentence to mean that it was mustard gas? It says, \"and others concluded the mustard gas was \"stored improperly,\" which made the gas \"ineffective\". It may have been stored improperly, but it was still mustard gas. Just because it was ineffective doesn't mean a thing. It was mustard gas. Point proven.\n\n \n Your \"point\" was that Saddam still had weapons of mass destruction, a shell that's so old that it's payload doesn't even work any more is not a WMD. It's not even a weapon, unless you're going to hit someone on the head with it.", 
   {}, 
   60498, 
   null, 
   1091304000.0
  ], 
  [
   60515, 
   null, 
   "Bush Is The Man", 
   "Your \"point\" was that Saddam still had weapons of mass destruction, a shell that's so old that it's payload doesn't even work any more is not a WMD. It's not even a weapon, unless you're going to hit someone on the head with it.\n\n \n \n Yes I know Jeb is his brother, I just used Saddam's sons because they are his family, just as Jeb is to GW. \n No, mustard gas is mustard gas. It is a weapon of mass destruction. What about sarin as well? What if we found an A-bomb in the desert, but it was stored \"improperly\"? It is still a WMD, no matter how he stored it. The reason it didn't work is probably because he just hid it because he knew we were looking for them. Well if Saddam lied and said he had no WMD, and we then find sarin and mustard gas, what else are we going to find? Same hypothetical question to you... \n What would you do if we find WMDs next month? Would you still complain about Bush lying? Would you give him any credit?", 
   {}, 
   60514, 
   null, 
   1091304780.0
  ], 
  [
   60518, 
   null, 
   "Kronus", 
   "\n What would you do if we find WMDs next month? Would you still complain about Bush lying?\n\n \n Yes, because Bush still would have lied. He said he had proof. If he really had proof we would have found something by now. At the very least Bush would have shown us his proof, so that we wouldknow that the stuff was still hidden, or slipped to terrorists, or whatever. You can't invade a country because you \"think\" they have WMD's. You can't kill 10s of thousands of people because you're \"pretty sure\" that if they had WMD they might possibly use them. And you don't **** off all your allies so that you can fight someone who \"could possibly\" try to strike at you, when you need their help to fight an enemy that you know is coming after you. Bush lied to get us into the wrong war at the wrong time, and he squandered our international good will and respect to do it, at a time when we need the rest of the world to help fight al Queda. Bush screwed up, and finding a cache of 15 year old weapons will not redeem him.", 
   {}, 
   60515, 
   null, 
   1091305980.0
  ], 
  [
   60519, 
   null, 
   "Bush Is The Man", 
   "Of course we have. Do you think we have all those nukes to use as paperweights? Back when there was a USSR we were fully prepared, or at least so we threatened, to use them.\n\n \n \n Ok that was 20+ years ago. Tell me the last time we threatened to nuke a country? Once again, stop living in the past. What happened 20+ years ago is not relevant in this situation.\n \n \n \nWrong. We marched our own troops into nuclear fallout, so we'd know what would happen. And we've release biological agents in populated region to study dispersal patterns. Read \"Germs\" by Miller, Engelberg, and Broad for more details.\n\n \n \n When did we do this? We don't test our weapons on our people, nor any other people. We tested our weapons in New Mexico and Nevada in the desert, where nobody is within the radiation circle. We also test some weapons in the ocean, where nobody will feel the effects of the radiation, nor will it harm the water. When did we release biological agents? The only thing I can think of anthrax, which the government didn't release.\n \n \n \nUnless you're an arab-american, then you should definately fear being locked up as an \"enemy-combatant\" with no trial and no access to a lawyer.\n\n \n \n Arab-Americans in the US are not being locked up. Where do you get your information from? This isn't like WWII where we put some innocent Japanese in \"camps\". We are not rounding up Arabs in the US and putting them away, unless we just take some in for questioning who we think may know something. Once again, terrible example. I suggest using FACTS to prove your point. Go online and find a notable website with information to back up your side, and then try and prove me wrong. If you can find some info that proves me wrong, I will gladly let you know I was wrong. But most of your information is opinion-based, not factual.\n \n \n \nYou do know that Jeb is W's brother, not son, right?\n\n \n \n Yes I do. I live in Florida.", 
   {}, 
   60513, 
   null, 
   1091306100.0
  ], 
  [
   60525, 
   null, 
   "Kronus", 
   "Ok that was 20+ years ago. Tell me the last time we threatened to nuke a country? Once again, stop living in the past. What happened 20+ years ago is not relevant in this situation.\n \n\n Then you stop living in the past. Saddam gassed the Kurds 20 years ago. I guess that's irrelevant now too?\n \n \n\n When did we do this? We don't test our weapons on our people, nor any other people. We tested our weapons in New Mexico and Nevada in the desert, where nobody is within the radiation circle. We also test some weapons in the ocean, where nobody will feel the effects of the radiation, nor will it harm the water. When did we release biological agents? The only thing I can think of anthrax, which the government didn't release.\n \n\n If you think the only biological weapon the US ever produced was anthrax then you really have had your head in a hole. Go and read the book, you'll learn something.\n \n \n \n \n\n Arab-Americans in the US are not being locked up. Where do you get your information from? This isn't like WWII where we put some innocent Japanese in \"camps\". We are not rounding up Arabs in the US and putting them away, unless we just take some in for questioning who we think may know something. \n\n \n No, they're not being rounded up wholesale. Is that the only time you would object? Padilla has been \"disappered\" for years now, without even being charged. Hundred of arabs were deported from California, because of errors the government made on their citizen application forms. Lots of people were in Boston for the DNC, taking pictures. One of them was detained for 5 hours by the SS. Guess what, he was arab. If you don't think Bush's administration has created an atmosphere of fear, then you are blind.\n \n \n You've made it a point to pounce any time you think I may be wrong. Since you haven't contested the point, I have to assume you now believe that Bush did in fact hide info from the Senate, and so any statements Kerry made about how much of threat Saddam was were based on false or incomplete info fed the committee by Bush.", 
   {}, 
   60519, 
   null, 
   1091307600.0
  ], 
  [
   60534, 
   null, 
   "Bush Is The Man", 
   "Yes, because Bush still would have lied. He said he had proof. If he really had proof we would have found something by now. At the very least Bush would have shown us his proof, so that we wouldknow that the stuff was still hidden, or slipped to terrorists, or whatever. You can't invade a country because you \"think\" they have WMD's.\n \n \n \n \n Iraq is pretty big. Finding WMDs isn't as easy as finding a nuclear plant. I have heard we have only explored 1/5 of what we had planned to in Iraq. So there's a lot more places out there to look. Just because you have proof, doesn't mean you're going to find something within 1 year. Are you dumb? If he said he had proof, and then he did find WMDs, how would he be lying? Why wouldn't you accept that? Kerry needs to make his mind up. He had the same info Bush did and he voted TO GO TO WAR and TO REMOVE SADDAM. Now he says we shouldn't. He is so indecisive, he has no reason to lead this country. How would you feel if Bush came out now and said, \"I don't think we should have went to Iraq\"? Well that's how you'd feel now if Kerry was President instead of Bush.\n \n \n \nYou can't kill 10s of thousands of people because you're \"pretty sure\" that if they had WMD they might possibly use them. And you don't **** off all your allies so that you can fight someone who \"could possibly\" try to strike at you, when you need their help to fight an enemy that you know is coming after you.\n\n \n \n \n To my knowledge, we haven't killed tens of thousands of people. Not even close. The only ally we ****** off is France, and they're a bunch of ******* anyway. Chirac can rot in hell. Kerry promises to restore our allies. BS!!! Maybe you didn't see the news today, but there was an interview with Tony Blair and Gerhardt Schroeder. Schroeder said Kerry has no way of restoring ally simply because he will replace Bush. It isn't that easy. \n \n \n \n \n \nBush lied to get us into the wrong war at the wrong time, and he squandered our international good will and respect to do it, at a time when we need the rest of the world to help fight al Queda. Bush screwed up, and finding a cache of 15 year old weapons will not redeem him.\n\n \n \n Wow, I can see you believe everything Micahel Moore says. Good job! Bush didn't lie, he simply believed the information from the most credible intelligence agency in the country, the CIA. What was Bush supposed to do? Go over to Iraq and search for himself for WMDs? You must be smarter than some of your arguments make you out to be. So you need to blame the CIA, not him. Their job is to inform the President, and that's what they did. Blame George Tenet, not Bush. I would like to see Kerry win just so I can laugh at how terrible his Presidency is. It could possibly be worse than Carter's. He has no place in politics. Most liberal person in the world!", 
   {}, 
   60518, 
   null, 
   1091312040.0
  ], 
  [
   60549, 
   null, 
   "Kronus", 
   "To my knowledge, we haven't killed tens of thousands of people. Not even close.\n\n \n To your knowledge...? To your knowledge!? How can you be in this debate and not know this? No wonder you think Bush is such a hero, you have absolutely no clue what's actually going on, do you? You think Bush hasn't lied because you have no idea what he's said or what he's done. Put down your pom-poms, take off your rose colored glasses, and go out and learn something!", 
   {}, 
   60534, 
   null, 
   1091334780.0
  ], 
  [
   60551, 
   null, 
   "Bush Is The Man", 
   "To your knowledge...? To your knowledge!? How can you be in this debate and not know this? No wonder you think Bush is such a hero, you have absolutely no clue what's actually going on, do you? You think Bush hasn't lied because you have no idea what he's said or what he's done. Put down your pom-poms, take off your rose colored glasses, and go out and learn something!\n\n \n \n \n \n Haha!!! No I think your comments are absolutely ludicrous. The phrase \"To my knowledge\" was used because it was showing how dumb your comment was. You need to get your facts straight. We have killed nowhere near \"10s of thousands of people because you're \"pretty sure\" that if they had WMD they might possibly use them\". We have killed nowhere even close to that. You were absolutely as far from the truth as possible. Tell me where you got that \"fact\" from, John Kerry? I know exactly what is going on. Ask me anything and I will tell you. You probably think I am wrong because you believe everything Michael Moore says. I have a great clue of what's going on...Bush has kept this country from being attacked again. What has Kerry done? Here's big of a hypocrit and piece of sh*t he is. He first votes to go to war. Then he votes down the bill to give everyone in Iraq armor. Then, he decides it wasn't right to go to Iraq. He needs to make up his damn mind.", 
   {}, 
   60549, 
   null, 
   1091335800.0
  ], 
  [
   60557, 
   null, 
   "Duo_Maxwell", 
   "Kronus\n \n \nSaddam gassed the Kurds 20 years ago\n\n \n Hate to nitpick, but that's a bit off. 1988-2004 = 16 years, not 20. emoticon_xhoho\n \n \nIraq is pretty big. Finding WMDs isn't as easy as finding a nuclear plant.\n\n \n Ah, but one cannot produce weapons without the means to do so, means we have not found. The only major production facility we have found hasn't been touched in at least 5 years. So tell me, how did Saddam make weapons without the money, facilities and materials? emoticon_rolleyes \n \n \nI have heard we have only explored 1/5 of what we had planned to in Iraq.\n\n \n And you heard this where? \n \n \nJust because you have proof, doesn't mean you're going to find something within 1 year. Are you dumb?\n\n \n Just because you have over 160,000 troops in the region, with thousands more inspectors, more CIA and NSA agents then you can shake a stick at, as well as numerous other agents from the UN and other countries doesn't mean you'll find anything in over a year. emoticon_xgood \n \n \nIf he said he had proof, and then he did find WMDs, how would he be lying?\n\n \n Obviously no. But that hasn't happened. Curveball was a fabrication. The mobile bio labs were a fabrication. The nigerian yellow cake was a fabrication. the chemical weapons were a fabrication. Do I need to go on? \n \n \nKerry needs to make his mind up. He had the same info Bush did and he voted TO GO TO WAR and TO REMOVE SADDAM.\n\n \n So does Bush. However, Kerry wasn't the one selling the war, he was buying it, and after the 9/11 report, the war wouldn't have passed if the knew what they knew now. \n \n \nHe is so indecisive, he has no reason to lead this country.\n\n \n Neither does Bush. Bush is just as bad of a flip flopper as Kerry. \n \n \nHow would you feel if Bush came out now and said, \"I don't think we should have went to Iraq\"? Well that's how you'd feel now if Kerry was President instead of Bush.\n\n \n I would feel that perhaps Bush is living up to his campaign promises, promises he flip flopped on. \n \n \nTo my knowledge, we haven't killed tens of thousands of people. Not even close.\n\n \n The Red Cross estimates we killed over 10,000 Iraqs since the invasion.\n \n \nThe only ally we ****** off is France, and they're a bunch of ******* anyway.\n\n \n Who saved our butts before we were even a country. You forget that the French provided much, if not virtually all of the weapons and gunpowder for much of the revolutionary war, not to mention a fleet of ships of the line. \n \n \nChirac can rot in hell. Kerry promises to restore our allies. BS!!! Maybe you didn't see the news today, but there was an interview with Tony Blair and Gerhardt Schroeder. Schroeder said Kerry has no way of restoring ally simply because he will replace Bush. It isn't that easy.\n\n \n So can Saddam. emoticon_xhoho Perhaps it isn't that easy, but it is better then going it alone. \n \n \nGood job! Bush didn't lie, he simply believed the information from the most credible intelligence agency in the country, the CIA.\n\n \n The CIA also had information that was contrictioary to the invasion rational, but Bush and Tenet ignored it. \n \n \nWhat was Bush supposed to do? Go over to Iraq and search for himself for WMDs? You must be smarter than some of your arguments make you out to be. So you need to blame the CIA, not him.\n\n \n Actually....can you blame Bush for ignoring information he did not want to hear? \n \n \nMost liberal person in the world!\n\n \n Right. Because Kerry is a full fledged welfare socialist. emoticon_rolleyes Bush is pretty liberal himself. All that liberally fiscal policies, the NCLB, the Medicare bill....", 
   {}, 
   60551, 
   null, 
   1091338320.0
  ], 
  [
   60609, 
   null, 
   "georged", 
   "Haha!!! No I think your comments are absolutely ludicrous. The phrase \"To my knowledge\" was used because it was showing how dumb your comment was. You need to get your facts straight. We have killed nowhere near \"10s of thousands of people because you're \"pretty sure\" that if they had WMD they might possibly use them\". We have killed nowhere even close to that. You were absolutely as far from the truth as possible. Tell me where you got that \"fact\" from, John Kerry? I know exactly what is going on. Ask me anything and I will tell you. You probably think I am wrong because you believe everything Michael Moore says. I have a great clue of what's going on...Bush has kept this country from being attacked again. What has Kerry done? Here's big of a hypocrit and piece of sh*t he is. He first votes to go to war. Then he votes down the bill to give everyone in Iraq armor. Then, he decides it wasn't right to go to Iraq. He needs to make up his damn mind.\n\n \n Have you thought of asking for Bush's hand in marriage? Your erroneous opinions of his record indicate a blindness to facts. Over 10,000 Iraqi civilian deaths by Red Cross count from official sources such as morgues and hospitals, closer to 35,000 when estimated by Muslim tradition of burying their dead before sundown without official records. And over 1,000 coalition deaths, 900 of them American. Based on an Iraq population of 23-million, the civilian death toll would equate to 460,000 of our population. And Iraq didn't attack us, nor has Bush kept anyone else from attacking us. We're doing far too much damage to ourselves for any enemy to bother expending unnecessary resources. Political emotion often overcomes reason, but facts are facts.", 
   {}, 
   60551, 
   null, 
   1091380020.0
  ], 
  [
   60656, 
   null, 
   "Bush Is The Man", 
   "Ah, but one cannot produce weapons without the means to do so, means we have not found. The only major production facility we have found hasn't been touched in at least 5 years. So tell me, how did Saddam make weapons without the money, facilities and materials? emoticon_rolleyes\n\n \n \n \n \n Who said he was making them? I sure didn't. It is known that he was searching for people to buy WMDs from. So that's where he would get them from. And for the record, he did have money, lots of money. So you may be right saying he wasn't making them, but he sure had other ways of getting them.\n \n \n \n \n \n \nJust because you have over 160,000 troops in the region, with thousands more inspectors, more CIA and NSA agents then you can shake a stick at, as well as numerous other agents from the UN and other countries doesn't mean you'll find anything in over a year. emoticon_xgood\n\n \n \n \n \n Do you know how big Iraq is? It is roughly the size of California. It could take years to find them, considering we just found an old shell with mustard gas and some planes buried under the sand. Imagine 160,000 people in California. That is nothing at all. \n \n \n \n \nObviously no. But that hasn't happened. Curveball was a fabrication. The mobile bio labs were a fabrication. The nigerian yellow cake was a fabrication. the chemical weapons were a fabrication. Do I need to go on?\n\n \n \n \n \n The chemical weapons were a fabrication? I can't believe you still think that. He had mustard gas (which we found), he used it on his people, and he was looking for weapons. Why was he looking for WMDS? Surely it wasn't because he likes to collect them. There is only one reason to buy or search for WMDs, and that is to use them on someone.\n \n \n \n \n \nSo does Bush. However, Kerry wasn't the one selling the war, he was buying it, and after the 9/11 report, the war wouldn't have passed if the knew what they knew now.\n\n \n \n \n \n Did you not read my statement? Kerry had the SAME information as Bush. The CIA gave them the exact same information. So Bush wasn't selling the war, he was simply stating what was given to him by the CIA. \"and after the 9/11 report, the war wouldn't have passed if the knew what they knew now\", how dumb of a comment. That's so easy to say now, that's like saying we would have attacked Japan first if we knew they were going to attack Pearl Harbor. So, if we would have waited 3 years after 9/11, then we would have decided not to go to war? Then Bush would have been criticized for doing nothing.\n \n \n \n \nBush is pretty liberal himself.\n\n \n \n Please, enlighten me.", 
   {}, 
   60557, 
   null, 
   1091460960.0
  ], 
  [
   60663, 
   null, 
   "georged", 
   "Please, enlighten me.\n\n \n Your emotional support of a politician overcomes all reason.", 
   {}, 
   60656, 
   null, 
   1091464800.0
  ], 
  [
   60665, 
   null, 
   "Bush Is The Man", 
   "Your emotional support of a politician overcomes all reason.\n\n \n \n I not once have supported him emotionally. I simply said he didn't lie. It is called \"backing up\" someone I agree with. If you couldn't try to defend or back up something, then there would be no reason for debates. Show me a time where I haven't backed up any comments with facts. You'd be hardpressed to find one. Your hatred towards Bush overcomes all of your reasoning. I am presenting facts to back up my beliefs, and if you can't accept that they are facts and are correct, then so be it. That is the point of a debate, to support your opinions with facts, which I do. And your only lame excuse for a comeback is \"Your emotional support of a politician overcomes all reason\". That is pretty pathetic, if you ask me.\n \n \n It seems to me that you are having a problem responding to me with facts. Maybe that is because you are conceding, you are ignorant, or maybe a combination of the two. I agree with Bush, and I will defend him until the end. There is absolutely nothing wrong with that, and that by no means implies emotionally supporting him. Tell me which candidate you favor, so when I have trouble responding, I will just use your lame line \"Your emotional support of _________ overcomes all reason\".", 
   {}, 
   60663, 
   null, 
   1091465820.0
  ], 
  [
   60680, 
   null, 
   "georged", 
   "I not once have supported him emotionally. I simply said he didn't lie. It is called \"backing up\" someone I agree with. If you couldn't try to defend or back up something, then there would be no reason for debates. Show me a time where I haven't backed up any comments with facts. You'd be hardpressed to find one. Your hatred towards Bush overcomes all of your reasoning. I am presenting facts to back up my beliefs, and if you can't accept that they are facts and are correct, then so be it. That is the point of a debate, to support your opinions with facts, which I do. And your only lame excuse for a comeback is \"Your emotional support of a politician overcomes all reason\". That is pretty pathetic, if you ask me.\n \n \n It seems to me that you are having a problem responding to me with facts. Maybe that is because you are conceding, you are ignorant, or maybe a combination of the two. I agree with Bush, and I will defend him until the end. There is absolutely nothing wrong with that, and that by no means implies emotionally supporting him. Tell me which candidate you favor, so when I have trouble responding, I will just use your lame line \"Your emotional support of _________ overcomes all reason\".\n\n \n \n I find it difficult to find a starting point to refute your allegations and opinions. Be it your lack of knowledge on WMD usage by Iraq or the US, Iraqi civilian deaths, US legal consequences under the Patriot Act or Bush Jr.'s offspring, others and myself have pointed out your inaccuracies. With no facts to comment on, where else would your support be other than in a politician seeking re-election regardless of his actions? I voted for Bush in 2000, but after watching him ignore his prior campaign promises for four years, invade and occupy a sovereign nation on suspicion, push us into a defensive posture and develop spending habits that would shame an outright socialist, I now consider myself a better judge of his character.\n \n Incidental, examine your statement of backing up someone you agree with. I read no facts, only your opinions. 'I agree with Bush and will defend him to the end isn't emotional?", 
   {}, 
   60665, 
   null, 
   1091469960.0
  ], 
  [
   60684, 
   null, 
   "Bush Is The Man", 
   "I find it difficult to find a starting point to refute your allegations and opinions. Be it your lack of knowledge on WMD usage by Iraq or the US, Iraqi civilian deaths, US legal consequences under the Patriot Act or Bush Jr.'s offspring, others and myself have pointed out your inaccuracies. With no facts to comment on, where else would your support be other than in a politician seeking re-election regardless of his actions? I voted for Bush in 2000, but after watching him ignore his prior campaign promises for four years, invade and occupy a sovereign nation on suspicion, push us into a defensive posture and develop spending habits that would shame an outright socialist, I now consider myself a better judge of his character.\n\n \n \n I do know about WMD. You are just too naive to accept the truth. They did find mustard gas, no ifs ands or buts. So you can argue that all you want, but it's getting you nowhere. About 90% of the Iraqi civilians killed are killed by terrorists. US soldiers have killed a very minimal number of innocent civilians. It is nowhere close to 10,000, more like 1,000. The terrorists are thes doing all the killings. Once again that's the truth and FACT. I have a great amount of knowledge. If you can, point out something I said that was wrong, not just something you disagree with. You might not be able to. So I would not consider myself inaccurate at all. Every point I have made is backed up with a fact, so it is pretty accurate if you ask me. I don't just throw out my opinions and then try to back up people's claims with BS comments like you do. I think you just do that to cover your inadeptness to refute any of my comments; you just don't want to admit that I am right.\n \n \n \n \nIncidental, examine your statement of backing up someone you agree with. I read no facts, only your opinions. 'I agree with Bush and will defend him to the end isn't emotional?\n\n \n \n Either you are blind or ignorant. I suggest rereading the posts, or maybe ask someone what a fact and an opinion are. No it isn't emotional. If I said I felt sorry for him and something along those lines, it would be emotional. Or if I said he was never wrong. However I said nothing of the sort. You have backed up absolutely nothing with facts. So you have absolutely no basis to argue anything. Until you start backing up your weak assertions with facts, I will not respect or consider any of your statements logical. Simply find the facts and use them if you want to make any sense.", 
   {}, 
   60680, 
   null, 
   1091472360.0
  ], 
  [
   60738, 
   null, 
   "Duo_Maxwell", 
   "Who said he was making them? I sure didn't. It is known that he was searching for people to buy WMDs from. So that's where he would get them from. And for the record, he did have money, lots of money. So you may be right saying he wasn't making them, but he sure had other ways of getting them.\n\n \n Right. Why would he be buying the materials, as the Bush team so said, if he was simply in the market for buying fully operation WMD? The Bush team's main argument was that he HAD them and HAD the means to produce them. Neither of which panned out. Also, we know that Saddam funnelled a large amount of his cash to producing weapons, which his lienturants took and told him lies. If you remember the Bush team's spheil, it was on buying the parts and materials to make WMD, and then giving WMD to terrorists, not the other way around, which you are asserating. \n \n \nDo you know how big Iraq is? It is roughly the size of California. It could take years to find them, considering we just found an old shell with mustard gas and some planes buried under the sand. Imagine 160,000 people in California. That is nothing at all. \n\n \n Do you know how much survellience we have over that country? You'd THINK we notice a large convoy of trucks and construction vehciles going to the desert, stopping for hours, then driving back to a known weapons storage facility. Except none of thath appened. The old mustard gas was from the Iraq-Iran war, long time ago. As for the Migs, they were buried before the war. Considering how much time, money and people we have searching for them, it's plausable they never existed, as the scientists and inspectors have been saying for years. \n \n \nThe chemical weapons were a fabrication? I can't believe you still think that. He had mustard gas (which we found), he used it on his people, and he was looking for weapons. Why was he looking for WMDS? Surely it wasn't because he likes to collect them. There is only one reason to buy or search for WMDs, and that is to use them on someone\n\n \n No ANTHRAX, NO VX, NO SARIN. The mustard was from a war decades ago, and had little killing power left. Mustard doesn't have a long shelf life. He used the gas 16 years ago. Mustard doesn't last that long. Everyone is looking for weapons. Deterrence and intimindation are the 2 reasons. Do you know the concept of MAD? \n \n \nDid you not read my statement? Kerry had the SAME information as Bush. The CIA gave them the exact same information. So Bush wasn't selling the war, he was simply stating what was given to him by the CIA. \n\n \n Right. The CIA information that did not support the war was discarded by Bush and Tenet. What remained was given to Congress. You convienetly forgot that. Bush was SELLING THE WAR, how can you say he wasn't? The CIA didn't want to go to war, they simply provide information, Bush pused the war. You also forgot some of the information Bush used was collected OUTSIDE of the CIA. \n \n \nhow dumb of a comment.\n\n \n because we are actually seeing the information that Bush and tenet discarded because it did not fit the rational? Explain that. \n \n \nPlease, enlighten me.\n\n \n Fiscal liberal policies extending for long periods of time. Extremely expensive and questionable NCLB, extermely expensive and questionable Medicare bill.", 
   {}, 
   60684, 
   null, 
   1091495040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The 16 words of George W. Bush...", 
  "url": "http://www.4forums.com/political/politics-debates/2780-16-words-george-w-bush.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2780, 
  "discussion_files": [
   [
    "4240.html", 
    "http://www.4forums.com/political/politics-debates/2780-16-words-george-w-bush-print.html"
   ], 
   [
    "4241.html", 
    "http://www.4forums.com/political/politics-debates/2780-16-words-george-w-bush-6-print.html"
   ], 
   [
    "4242.html", 
    "http://www.4forums.com/political/politics-debates/2780-16-words-george-w-bush-4-print.html"
   ], 
   [
    "4243.html", 
    "http://www.4forums.com/political/politics-debates/2780-16-words-george-w-bush-5-print.html"
   ], 
   [
    "4244.html", 
    "http://www.4forums.com/political/politics-debates/2780-16-words-george-w-bush-3-print.html"
   ], 
   [
    "4245.html", 
    "http://www.4forums.com/political/politics-debates/2780-16-words-george-w-bush-2-print.html"
   ]
  ], 
  "identifier": 2780
 }
]