[
 [
  [
   59155, 
   null, 
   "TruthKeeper", 
   "\"The Qur'an is the word of God and it has many miraculous attributes proving this fact. One of these attributes is the fact that a number of scientific truths that we have only been able to uncover by the technology of the 20th century were stated in the Qur'an 1,400 years ago. Of course the Qur'an is not a book of science. However, many scientific facts that are expressed in an extremely concise and profound manner in its verses have only been discovered with the technology of the 20th century. These facts could not have been known at the time of the Qur'an's revelation, and this is still more proof that the Qur'an is the word of God.\"\n \n The Quran on Human Embryonic Development:  \n \n The Quran on Mountains:  \n \n The Quran on the end of the Heaven  \n \n The Quran on the Origin of the Universe", 
   {
    "post_info": {
     "post_title": "Miracles in the Holy Quran"
    }
   }, 
   null, 
   null, 
   1090415460.0
  ], 
  [
   59177, 
   null, 
   "montalban", 
   "\"The Qur'an is the word of God and it has many miraculous attributes proving this fact. One of these attributes is the fact that a number of scientific truths that we have only been able to uncover by the technology of the 20th century were stated in the Qur'an 1,400 years ago. Of course the Qur'an is not a book of science. However, many scientific facts that are expressed in an extremely concise and profound manner in its verses have only been discovered with the technology of the 20th century. These facts could not have been known at the time of the Qur'an's revelation, and this is still more proof that the Qur'an is the word of God.\"\n\n Firstly the claims are not miraculous. You are making claims that the Koran predicts scientific truths. Therefore the claims are of not miracles, but of truths. Secondly Muslims claim that there are no miracles in the Koran, but that the Koran itself is a miracle.\n \"When asked for a miracle to attest his claim to be a prophet, Muhammad would refer to the miracle of the Koran. \"Qur'an\" (or \"Koran\") is an Arabic word which means \"recite.\"\n \"It is seen as a perfect revelation of God, faithful reproduction of an original engraved on a tablet in heaven which has existed from all eternity. Copies of the Qur'an are therefore venerated very highly and are only touched and read by Muslims after ceremonial cleansing. According to Islamic tradition, the Qur'an was originally written on palm leaves, on shoulder-blade bones of camels and on stones.\"\n http://www.xenos.org/essays/islam.htm\n I recalled this from a film I saw \"Muhammad: Messenger of God\" (aka \"The Message\") which had the approval of an Islamic body in Egypt for its accuracy to Islamic thought.\n \nThe Quran on Human Embryonic Development:  \n\n Debunked at\n http://www.answering-islam.org/Quran/Science/alaqa.html\n and at\n http://www.answering-islam.org/Quran/Science/embryo.html\n However, here is a list of Koranic verses on embryology: you will see that the Koran says man's origins come in so many different ways, from water, from loam, from a clot, from dust, from potter's clay, a drop of fluid, from a seed etc.\n \"The Qur'an and Embryology \n All quotations are taken from Pickthal's translation unless otherwise indicated. \n 3:59 Lo! The likeness of Jesus with Allah is as the likeness of Adam. He created him of dust, then He said unto him: Be! and he is. \n \n 4:56 Lo! Those who disbelieve Our revelations, We shall expose them to the fire. As often as their skins are consumed We shall exchange them for fresh skins that they may taste the torment. Lo! Allah is ever mighty, wise. \n \n 7:172 And (remember) when thy Lord brought forth from the children of Adam, from their loins, their seed, and made them testify themselves, saying: Am I not you Lord? They said: Yea, verily. we testify. This was lest ye should say at the Day of Resurrection: Lo! of this we were unaware. \n \n 11:61 You have no other God save Him. He brought you forth from the earth and hath made you husband of it. \n \n 13:8 Allah knoweth that which every female beareth and that which the wombs absorb and that which they grow. And everything with Him is measured. \n \n 15:26 Verily we created man out of potter's clay of black mud altered. \n \n 15:28 And remember when thy Lord said unto the angels: Lo! I am creating a mortal out of potter's clay of black mud altered. \n \n 15:33 (Iblis) said: Why should I prostrate myself unto a mortal whom Thou hast created out of potter's clay of black mud altered? \n \n 16:4 He created man from a drop of fluid, yet, behold! he is an open opponent. \n \n 17:61 And when We said unto the angels: Fall down prostrate before Adam and they fell prostrate all save Iblis, He said: Shall I fall prostrate before that which Thou hast created of clay? \n \n 18:37 And his comrade (Abel?) while he disputed with him (Cain?) exclaimed: Disbelievest in Him Who created thee of dust, then of a drop (of seed), and then fashioned thee a man? \n \n 19:67 Doth not man remember that We created him before, when he was naught? \n \n 22:5 O mankind! If you are in any doubt concerning the Resurrection, then lo! We have created you from dust, then from a drop of seed, then from a clot, then from a little lump of flesh shapely and shapeless, that We may make it clear for you. And we cause what We will to remain in the wombs for an appointed time, and afterward we bring you forth as infants, then (give you growth) that ye attain your full strength. And among you is he who dieth (young), and among you is he who is brought back to the most abject time of life, so that after knowledge, he knoweth naught. And thou (Muhammad) seest the earth barren, but when We send down water thereon, it doth thrill and swell and put forth every lovely kind (of growth). \n \n 23:12 Verily we created man from a product of wet earth (loam).\n 23:13 Then placed him (as a drop of seed) in a safe lodging; \n 23:14 Then fashioned We the drop a clot, then fashioned We the clot a little lump, then fashioned We the little clot bones, then clothed the bones with flesh, and then produced it as another creature. So blessed be Allah, the Best of Creators! \n \n 25:54 And it is He who hath created man from water, and hath appointed from him kindred by blood and kindred by marriage; for thy Lord is ever powerful. \n \n 30:19 He bringeth forth the living from the dead, and He bringeth forth the dead from the living, and He reviveth the earth after her death. And even so will ye be brought forth. \n 30:20 And of His signs is this: He created you of dust, and behold you human beings, varying widely! \n 30:21 And of His signs is this: He created for you helpmates from yourselves that ye might find rest in them. \n \n 32:7 Who made all things good which He created, and He began the creation of man from clay, \n 32:8 Then He made his seed from a draught of despised fluid; \n 32:9 Then He fashioned him and breathed into him of His spirit: and appointed for you hearing and sight and hearts. Small thanks give ye! \n \n 35:11 Allah created you from dust, then from a little fluid, then He made you pairs (male and female?). No female beareth or bringeth forth save with His knowledge. And no-one groweth old, nor is aught lessened of his life, but it is recorded in a Book. Lo! that is easy for Allah. \n \n 38:71 When thy Lord said unto the angels: Lo! I am about to create a mortal out of mire \n 38:72 And when I have fashioned him and breathed into him of My Spirit, then fall down before him prostrate. \n \n 39:6 He created you from one being, then from that (being) He made its mate; and He hath provided for you of cattle eight kinds. He created you in the \n wombs of your mothers, creation after creation, in a threefold gloom. Such is Allah your Lord. There is no God save Him. How then are ye turned away? \n \n 40:67 He it is who created you from dust, then from a drop (of seed), then from a clot, then bringeth you forth as a child, then ordaineth full strength and afterward that ye become old men though some among you die before-and that ye reach an appointed term, that haply ye may understand. \n \n 49:13 O mankind! Lo! We have created you male and female, and have made you nations and tribes that ye may know one another.... \n \n 52:35 Or were they created out of naught? Or are they the creators?\n 52:36 Or did they create the heavens and the earth? Nay, but they are sure of nothing! \n \n 53:45 And that he created the two spouses, the male and the female, \n 53:46 From a drop (of seed) when it is poured forth; \n 53:47 And that He hath ordained the second bringing forth. \n \n 56:58 Have ye seen that which ye emit? \n 56:59 Do you create it or are We the Creator? \n \n 64:3 He created the heavens and the earth with truth, and He shaped you and made good your shapes.... \n \n 71:14 When He created you by (divers) stages? \n \n 75:3 Thinketh man that We shall not assemble his bones? \n 75:4 Yea, verily. Yea, We are able to restore his very fingers. \n \n 75:37 Was he not a drop of fluid which gushed forth? \n 75:38 Then he became a clot; then (Allah) shaped and fashioned: \n 75:39 And made of him a pair, the male and female. \n \n 76:2 Lo! We create man from a drop of thickened fluid to test him, so we make him hearing, knowing. \n \n 80:18 From what thing doth He create him? \n 80:19 From a drop of seed. He createth him and proportioneth him \n 80:20 Then makeh the way easy for him, \n 80:21 Then causeth him to die, and burieth him; \n 80:22 Then when He will, He bringeth him again to life. \n \n 86:5 So let man consider from what he is created. \n 86:6 He is created from a gushing fluid \n 86:7 That issued from between the loins and ribs. \n \n 95:4 Surely we created man out of the best stature \n 95:5 Then We reduced him to the lowest of the low \n \n 96:2 Who created man from a clot. \n http://www.answering-islam.org/Science/embryo.complete.html\n \n \nThe Quran on Mountains:  \n\n dead link\n \n \nThe Quran on the end of the Heaven  \n\n It states\n \"And when the heaven is split open and becomes rose-collared like oil\"\n The HOLY QUR'AN [55:37]\n and gives a picture of a nebula, the \"Cat's Eye\" nebula,* not the end of the universe.\n Other translations of the Koran state\n And when the heaven splitteth asunder and becometh rosy like red hide - (Pickthall)\n When the sky is rent asunder, and it becomes red like ointment: (Yusuf Ali)\n And when the heaven splits up and turns crimson like red hide (Nooruddin)\n And when the heaven is rent asunder, and then becomes red like red hide. (Shakir)\n When the sky disintegrates, and turns rose collared like paint. (Khalifa)\n And when the sky is rent asunder, and becomes red like [burning] oil (Asad)\n Then when the heaven is rent asunder, and it becomes rosy or red like red oil, or red hide - (Hilali and Khan)\n When the sky splits asunder and reddens like a rose or stained leather (Dawud)\n And when the heaven shall be cleft asunder, and become rose red, like stained leather (Rodwell)\n And when heaven is torn asunder, and turns crimson like red leather (Arberry)\n And when the heaven is rent asunder and become rosy red - (melting) like grease! (Palmer)\n And when the heaven shall be rent in sunder, and shall become [red as] a rose, [and shall melt] like ointment: (Sale)\n http://www.answering-islam.org/Quran/Science/rose-nebula.html\n \n The common word here is that it is 'red'.\n The Crab Nebula for instance is red, but only when viewed in infra-red, as opposed to\n X-ray - purple\n Optical - blue\n Radio - crimson\n \n So, if you view any nebula, it can be red, if you see it in one particular spectrum. So this makes the 'redness' of it meaningless too!\n \n Further to that, a nebula is the end of a star, not the end of the universe.\n \n *seen also at\n http://antwrp.gsfc.nasa.gov/apod/ap991031.html\n \n \nThe Quran on the Origin of the Universe\n\n \n These are quotes from your own site...\n \"Then He turned to the heaven when it was smoke... (Quran, 41:11)\n I am unaware of any prevailing scientific theory that the heavens came from smoke.\n \"Have not those who disbelieved known that the heavens and the earth were one connected entity, then We separated them?\"... (Quran, 21:30)\n This might be a 'Big Bang' explanation. It might not be.\n \n Here are some other miracles of Islam\n Talking Ants\n At length, when they came to a valley of ants, one of the ants said: \"O ye ants, get into your habitations, lest Solomon and his hosts crush you (under foot) without knowing it.\" \n So he smiled, amused at her speech; and he said: \"O my Lord! so order me that I may be grateful for Thy favours, which Thou has bestowed on me and on my parents, and that I may work the righteousness that will please Thee: And admit me, by They Grace to the ranks of Thy Righteous Servants.\" \n -- Sura An-Naml [The Ant] (27):18-19\n \n The earth is shaped like an egg\n \"He (God) made the earth egg-shaped\" Sura 79:30.\n \n Where the sun goes\n Volume 4, Book 54, Number 421: \n Narrated Abu Dharr: \n The Prophet asked me at sunset, \"Do you know where the sun goes (at the time of sunset)?\" I replied, \"Allah and His Apostle know better.\" He said, \"It goes (i.e. travels) till it prostrates Itself underneath the Throne and takes the permission to rise again, and it is permitted and then (a time will come when) it will be about to prostrate itself but its prostration will not be accepted, and it will ask permission to go on its course but it will not be permitted, but it will be ordered to return whence it has come and so it will rise in the west. And that is the interpretation of the Statement of Allah: ?And the sun Runs its fixed course for a term (decreed). That is The Decree of (Allah) The Exalted in Might, The All-Knowing.?\" (36.38)\n \n These issues are raised at the various links from:\n http://www.answering-islam.org/Quran/index.html", 
   {}, 
   59155, 
   null, 
   1090428180.0
  ], 
  [
   59267, 
   null, 
   "montalban", 
   "Where are all the science boffins who argued so doggedly against me? Is there no one willing to challenge the Muslim text that says the embryo is a clot of blood? (Sura 96:2 Who created man from a clot.)", 
   {
    "post_info": {
     "post_title": "Where are all the science boffins?"
    }
   }, 
   59177, 
   null, 
   1090475340.0
  ], 
  [
   59282, 
   null, 
   "TruthKeeper", 
   "Firstly the claims are not miraculous. You are making claims that the Koran predicts scientific truths. Therefore the claims are of not miracles, but of truths. Secondly Muslims claim that there are no miracles in the Koran, but that the Koran itself is a miracle.\n \"When asked for a miracle to attest his claim to be a prophet, Muhammad would refer to the miracle of the Koran. \"Qur'an\" (or \"Koran\") is an Arabic word which means \"recite.\"\n \"It is seen as a perfect revelation of God, faithful reproduction of an original engraved on a tablet in heaven which has existed from all eternity. Copies of the Qur'an are therefore venerated very highly and are only touched and read by Muslims after ceremonial cleansing. According to Islamic tradition, the Qur'an was originally written on palm leaves, on shoulder-blade bones of camels and on stones.\"\n\n \n \n \n \"Ever since the dawn of human life on this planet, Man has always sought to understand Nature, his own place in the scheme of Creation and the purpose of Life itself. In this quest for Truth, spanning many centuries and diverse civilizations, organized religion has shaped human life and determined to a large extent, the course of history. While some religions have been based on books, claimed by their adherents to be divinely inspired, others have relied solely on human experience. \n \n Al-Qur&#8217;aan, the main source of the Islamic faith, is a book believed by Muslims, to be of completely Divine origin. Muslims also believe that it contains guidance for all mankind. Since the message of the Qur&#8217;aan is believed to be for all times, it should be relevant to every age. Does the Qur&#8217;aan pass this test? Here, I intend to give an objective analysis of the Muslim belief regarding the Divine origin of the Qur&#8217;aan, in the light of established scientific discoveries. \n \n There was a time, in the history of world civilization, when &#8216;miracles&#8217;, or what was perceived to be a miracle, took precedence over human reason and logic. But how do we define the term &#8216;miracle&#8217;? A miracle is anything that takes place out of the normal course of life and for which humankind has no explanation. However, we must be careful before we accept something as a miracle. An article in &#8216;The Times of India&#8217; Mumbai, in 1993 reported that &#8216;a saint&#8217; by the name &#8216;Baba Pilot&#8217; claimed to have stayed continuously submerged under water in a tank for three consecutive days and nights. However, when reporters wanted to examine the base of the tank of water where he claimed to have performed this &#8216;miraculous&#8217; feat, he refused to let them do so. He argued by asking as to how one could examine the womb of a mother that gives birth to a child. The &#8216;Baba&#8217; was hiding something. It was a gimmick simply to gain publicity. Surely, no modern man with even the slightest inkling towards rational thinking would accept such a &#8216;miracle&#8217;. If such false miracles are the tests of divinity, then we would have to accept Mr. P. C. Sorcar, the world famous magician known for his ingenious magical tricks and illusions, as the best God-man. \n \n A book, claiming Divine origin, is in effect, claiming to be a miracle. Such a claim should be easily verifiable in any age, according to the standards of that age. Muslims believe, that the Qur&#8217;aan is the last and final revelation of God, the miracle of miracles revealed as a mercy to mankind. Let us therefore investigate the veracity of this belief. \"\n http://www.it-is-truth.org/ModernScience.shtml\n \n \"The Challenge Of The Qur'aan \n \n Literature and poetry have been instruments of human expression and creativity, in all cultures. The world also witnessed an age when literature and poetry occupied pride of position, similar to that now enjoyed by science and technology. \n \n Muslims as well as non-Muslims agree that Al-Qur&#8217;aan is Arabic literature par excellence - that it is the best Arabic literature on the face of the earth. The Qur&#8217;aan, challenges mankind in the following verses:\n \n &#8220;And if ye are in doubt As to what We have revealed From time to time to Our Servant, then produce a Soorah Like thereunto; And call your witnesses or helpers (If there are any) besides Allah, If your (doubts) are true. But if ye cannot &#8211;And of a surety you cannot. hen fear the Fire Whose fuel is Men and Stones &#8211; Which is prepared for those Who reject Faith.&#8221;\n [Al-Qur&#8217;aan 2:23-24] \n \n (Al-Qur&#8217;an 2:23-24 indicates Soorah or Chapter No. 2 and Ayaat or Verses 23 and 24.) \n \n The same notation is followed throughout the book. References and translation of the Qur&#8217;aan are from the translation of the Qur&#8217;aan by Abdullah Yusuf Ali, new revised edition, 1989, published by Amana Corporation, Maryland, USA. \n \n The challenge of the Qur&#8217;aan, is to produce a single Soorah (chapter) like the Soorahs it contains. The same challenge is repeated in the Qur&#8217;aan several times. The challenge to produce a Soorah, which, in beauty, eloquence, depth and meaning is at least somewhat similar to a Qur&#8217;aanic Soorah remains unmet to this day. A modern rational man, however, would never accept a religious scripture, which says, in the best possible poetic language, that the world is flat. This is because we live in an age, where human reason, logic and science are given primacy. Not many would accept the Qur&#8217;aan&#8217;s extraordinarily beautiful language, as proof of its Divine origin. Any scripture claiming to be a divine revelation must also be acceptable on the strength of its own reason and logic. \n \n According to the famous physicist and Nobel Prize winner, Albert Einstein, &#8220;Science without religion is lame. Religion without science is blind.&#8221; Let us therefore study the Qur&#8217;aan, and analyze whether The Qur&#8217;aan and Modern Science are compatible or incompatible? \n \n The Qur&#8217;aan is not a book of science but a book of &#8216;signs&#8217;, i.e. ayats. There are more than six thousand &#8216;signs&#8217; in the Qur&#8217;aan of which more than a thousand deal with science. We all know that many a times Science takes a &#8216;U-turn&#8217;. In this book I have considered only established scientific facts and not mere hypotheses and theories that are based on assumptions and are not backed by proof. \"\n http://www.it-is-truth.org/ModernScience.shtml#Challenge\n \n Montalben , i would really like if you try to show scientists comments about the science miracles of Quran. rather than trying to get your own comments.", 
   {
    "post_info": {
     "post_title": "In the Name of Allah, Most Gracious, Most Merciful"
    }
   }, 
   59177, 
   null, 
   1090490700.0
  ], 
  [
   59283, 
   null, 
   "TruthKeeper", 
   "1 - Keith L. Moore\n Professor Emeritus, Department of Anatomy and Cell Biology, University of Toronto. Distinguished embryologist and the author of several medical textbooks, including Clinically Oriented Anatomy (3rd Edition) and The Developing Human (5th Edition, with T.V.N. Persaud).   \n \n \n Dr. Moore was a former President of the Canadian Association of Anatomists, and of the American Association of Clinical Anatomists. He was honoured by the Canadian Association of Anatomists with the prestigious J.C.B. Grant Award and in 1994 he received the Honoured Member Award of the American Association of Clinical Anatomists \"for outstanding contributions to the field of clinical anatomy.\"\n \n Professor Moore said: \n \"For the past three years, I have worked with the Embryology Committee of King cAbdulaziz University in Jeddah, Saudi Arabia, helping them to interpret the many statements in the Qur'an and Sunnah referring to human reproduction and prenatal development. At first I was astonished by the accuracy of the statements that were recorded in the 7th century AD, before the science of embryology was established. Although I was aware of the glorious history of Muslim scientists in the 10th century AD, and some of their contributions to Medicine, I knew nothing about the religious facts and beliefs contained in the Qur'an and Sunnah.\"[2]\n \n At a conference in Cairo he presented a research paper and stated:\n \n \"It has been a great pleasure for me to help clarify statements in the Qur'an about human development. It is clear to me that these statements must have come to Muhammad from God, or Allah, because most of this knowledge was not discovered until many centuries later. This proves to me that Muhammad must have been a messenger of God, or Allah.\" [1]\n \n Professor Moore also stated that:\n \n \"...Because the staging of human embryos is complex, owing to the continuous process of change during development, it is proposed that a new system of classification could be developed using the terms mentioned in the Qur'an and Sunnah. The proposed system is simple, comprehensive, and conforms with present embryological knowledge.\n \n \"The intensive studies of the Qur'an and Hadith in the last four years have revealed a system of classifying human embryos that is amazing since it was recorded in the seventh century A.D... the descriptions in the Qur'an cannot be based on scientific knowledge in the seventh century...\"\n \n \n 2- E. Marshall Johnson\n \n Professor and Chairman of the Department of Anatomy and Developmental Biology, and Director of the Daniel Baugh Institute, Thomas Jefferson University, Philadelphia, Pennsylvania, USA.\n \n Author of over 200 publications. Former President of the Teratology Society among other accomplishments. Professor Johnson began to take an interest in the scientific signs in the Qur'an at the 7th Saudi Medical Conference (1982), when a special committee was formed to investigate scientific signs in the Qur'an and Hadith. At first, Professor Johnson refused to accept the existence of such verses in the Qur'an and Hadith. But after a dicussuion with Sheikh Zindani he took an interest and concentrated his research on the internal as well as external development of the fetus.\n \n \"...in summary, the Qur'an describes not only the development of external form, but emphasises also the internal stages, the stages inside the embryo, of its creation and development, emphasising major events recognised by contemporary science.\"\n \n \"As a scientist, I can only deal with things which I can specifically see. I can understand embryology and developmental biology. I can understand the words that are translated to me from the Qur'an. As I gave the example before, if I were to transpose myself into that era, knowing what I do today and describing things, I could not describe the things that were described...\n \n I see no evidence to refute the concept that this individual Muhammad had to be developing this information from some place... so I see nothing here in conflict with the concept that divine intervention was involved in what he was able to write...\"\n http://www.islamic-awareness.org/Quran/Science/scientists.html\n \n \n 3-T.V.N. Persaud\n \n Professor of Anatomy, and Professor of Paediatrics and Child Health, University of Manitoba, Winnipeg, Manitoba, Canada\n \n Author and editor of over 20 books, and has published over 181 scientific papers. Co-author of The Developing Human (5th Edition, with Keith L. Moore). He received the J.C.B. Grant Award in 1991. Professor Peraud presented several research papers.\n \"It seems to me that Muhammad was a very ordinary man, he couldn't read, didn't know how to write, in fact he was an illiterate...\n \n We're talking about 1400 years ago, you have some illiterate person making profound statements that are amazingly accurate, of a scientific nature...\n \n I personally can't see how this could be mere chance, there are too many accuracies and like Dr. Moore, I have no difficulty in my mind reconciling that this is a divine inspiration or revelation which lead him to these statements.\" \n http://www.islamic-awareness.org/Quran/Science/scientists.html\n \n 4- Joe Leigh Simpson\n \n Professor and Chairman of the Department of Obstetrics and Gynaecology, Baylor College of Medicine, Houston, Texas, USA\n \n He is the President of the American Fertility Society. He has received many awards, including the Association of Professors of Obstetrics and Gynaecology Public Recognition Award in 1992. Like many others, Professor Simpson was taken by surprise when he discovered that the Qur'an and Hadith contain verses related to his specialised field of study. When he met with Sheikh Abdul-Majeed A.Zindani, he insisted on verifying the text presented to him from the Qur'an and Hadith.\n \n \"... these Hadiths (sayings of Muhammad) could not have been obtained on the basis of the scientific knowledge that was available at the time of the 'writer'... It follows that not only is there no conflict between genetics and religion (Islam) but in fact religion (Islam) may guide science by adding revelation to some of the traditional scientific approaches... There exist statements in the Qur'an shown centuries later to be valid which support knowledge in the Qur'an having been derived from God.\" \n http://www.islamic-awareness.org/Quran/Science/scientists.html\n \n \n 5- Gerald C. Goeringer\n \n Professor and Co-ordinator of Medical Embryology in the Department of Cell Biology, School of Medicine, Georgetown University, Washington DC, USA.\n \n Sheikh cAbdul-Majeed A.Zindani met with Professor Goeringer and asked him whether in the history of embryology was there any mention of the different stages of embryonic development, or whether there existed any embryological texts at the time of the Prophet. Sheikh Zindani also asked his opinion regarding the terms the Qur'an uses to describe the different phases of fetal development. After several long discussions, he presented a study at the 8th Saudi Medical Conference:\n \n \"...In a relatively few ayahs (Qur'anic verses) is contained a rather comprehensive description of human development from the time of commingling of the gametes through organogenesis. No such distinct and complete record of human development such as classification, terminology, and description existed previously. In most, if not all instances, this description antedates by many centuries the recording of the various stages of human embryonic and fetal development recorded in the traditional scientific literature.\" \n http://www.islamic-awareness.org/Quran/Science/scientists.html", 
   {
    "post_info": {
     "post_title": "Scientists' Comments On The Qur'an"
    }
   }, 
   59282, 
   null, 
   1090491780.0
  ], 
  [
   59284, 
   null, 
   "TruthKeeper", 
   "6 - Alfred Kroner\n \n Professor of the Department of Geosciences, University of Mainz, Germany.   \n \n Professor Kroner is one of the world's most famous geologists, becoming well known among his colleague scientists for his criticisms against the theories of some of the major scientists in his field. Sheikh cAbdul-Majeed A. Zindani met with him and presented several Qur'anic verses and Hadith which he studied and commented upon.   \n \n \n \"Thinking where Muhammad came from... I think it is almost impossible that he could have known about things like the common origin of the universe, because scientists have only found out within the last few years with very complicated and advanced technological methods that this is the case.\"\n \n \"Somebody who did not know something about nuclear physics 1400 years ago could not, I think, be in a position to find out from his own mind for instance that the earth and the heavens had the same origin, or many others of the questions that we have discussed here...\n \n If you combine all these and you combine all these statements that are being made in the Qur'an in terms that relate to the earth and the formation of the earth and science in general, you can basically say that statements made there in many ways are true, they can now be confirmed by scientific methods, and in a way, you can say that the Qur'an is a simple science text book for the simple man. And that many of the statements made in there at that time could not be proven, but that modern scientific methods are now in a position to prove what Muhammad said 1400 years ago.\" \n \n 7- Yushidi Kusan\n \n Director of the Tokyo Observatory, Tokyo, Japan.  \n \n Sheikh Abdul-Majeed A. Zindani presented a number of Qur'anic verses describing the beginnings of the universe and of the heavens, and the relationship of the earth to the heavens. He expressed his astonishment, saying that the Qur'an describes the universe as seen from the highest observation point, everything is distinct and clear.   \n \n \"I say, I am very much impressed by finding true astronomical facts in Qur'an, and for us modern astronomers have been studying very small piece of the universe. We have concentrated our efforts for understanding of very small part. Because by using telescopes, we can see only very few parts of the sky without thinking about the whole universe. So by reading Qur'an and by answering to the questions, I think I can find my future way for investigation of the universe.\" \n \n \n 8 - Professor Armstrong\n \n Professor Armstrong works for NASA and is also Professor of Astronomy, University of Kansas, Lawrence, Kansas, USA.  \n \n Prof. Armstrong was asked a number of questions about Qur'anic verses dealing with his field of specialisation. He was eventually asked, \"You have seen and discovered for yourself the true nature of modern Astronomy by means of modern equipment, rockets, and satellites developed by man. You have also seen how the same facts were mentioned by the Qur'an fourteen centuries ago. So what is your opinion?\"   \n \n \n \"That is a difficult question which I have been thinking about since our discussion here. I am impressed at how remarkably some of the ancient writings seem to correspond to modern and recent Astronomy. I am not a sufficient scholar of human history to project myself completely and reliably into the circumstances that 1400 years ago would have prevailed.\n \n Certainly, I would like to leave it at that, that what we have seen is remarkable, it may or may not admit of scientific explanation, there may well have to be something beyond what we understand as ordinary human experience to account for the writings that we have seen\"\n \n 9 - William Hay\n \n Professor of Oceanogprahy, University of Colorado, Boulder, Colorado, USA.  \n \n Professor Hay is one of the best known marine scientist in the USA. Sheikh cAbdul-Majeed A. Zindani met with him and asked him many questions about the marine surface, the divider between upper and lower sea, and about the ocean floor and marine geology.   \n \n \"I find it very interesting that this sort of information is in the ancient scriptures of the Holy Qur'an, and I have no way of knowing where they would have come from. But I think it is extremely interesting that they are there and this work is going on to discover it, the meaning of some of the passages.\"\n \n And when he was asked about the source of the Qur'an, he replied, \"Well, I would think it must be the divine being.\"\n \n \n 10 - Durja Rao\n \n \n Professor of Marine Geology teaching at King Abdulaziz University, Jeddah, Saudi Arabia.   \n \n \n Sheikh Zindani presented to Prof. Rao many verses dealing with his area of specialisation, and asked: \"What do you think of the existence of the scientific information in the Qur'an? How could Prophet Muhammad have known about these facts fourteen centuries ago?\"   \n \n \n \"It is difficult to imagine that this type of knowledge was existing at that time, around 1400 years back. May be some of the things they have simple idea about, but to describe those things in great detail is very difficult. So this is definitely not simple human knowledge. A normal human being cannot explain this phenomenon in that much detail. So, I thought the information must have come from a supernatural source.\" \n \n 11- Professor Siaveda\n \n Professor of Marine Geology, Japan.  \n \n Sheikh Zindani asked him a number of questions in his area of specialisation, and then informed him of the Qur'anic verses and Hadith which mention the same phenomena he spoke of. One of the questions was concerning mountains. Sheikh Zindani asked him about the shape of mountains; and whether they were firmly rooted in the earth. \"What is your opinion of what you have seen in the Qur'an and the Sunnah with regard to the secrets of the Universe, which scientists only discovered now?\"   \n \n \"I think it seems to me very, very mysterious, almost unbelievable. I really think if what you have said is true, the book is really a very remarkable book, I agree.\" \n \n \n 12- Tejatat Tejasen\n \n Chairman of the Department of Anatomy and is the former Dean of the faculty of Medicine, University of Chiang Mai, Chiang Mai, Thailand.  \n \n Professor Tejasen studied various articles concerning the Qur'an and modern embryology. He spent four days with several scholars, Muslims and non-Muslims, discussing this phenomenon in the Qur'an and Hadith. During the 8th Saudi Medical Conference in Riyadh, Saudi Arabia he stood up and said:   \n \n \"In the last three years, I became interested in the Qur'an... From my studies and what I have learned throughout this conference, I believe that everything that has been recorded in the Qur'an fourteen hundred years ago must be the truth, that can be proved by the scientific means.\n \n Since the Prophet Muhammad could neither read nor write, Muhammad must be a messenger who relayed this truth which was revealed to him as an enlightenment by the one who is eligible creator. This creator must be God, or Allah.\n \n I think this is the time to say La ilaha illa Allah, there is no god to worship except Allah (God), Muhammad rasoolu Allah, Muhammad is Messenger of Allah...\n \n The most precious thing I have gained from coming to this conference is La ilaha illa Allah, and to have become Muslim.\" \n \n \n 13- Dr. Maurice Bucaille\n \n Born in 1920, former chief of the Surgical Clinic, University of Paris, has for a long time deeply interested in the correspondences between the teachings of the Holy Scriptures and modern secular knowledge.   \n \n \n \n \n He is the author of a best-seller, \"The Bible, The Qur'an and Science\" (1976). His classical studies of the scriptural languages, including Arabic, in association with his knowledge of hieroglyphics, have allowed him to hold a multidisciplinary inquiry, in which his personal contribution as a medical doctor has produced conclusive arguments. His work, \"Mummies of the Pharaohs - Modern Medical Investigations\" (St. Martins Press, 1990), won a History Prize from the Académie Française and another prize from the French National Academy of Medicine.\n His other works include: \"What is the Origin of Man\" (Seghers, 1988), \"Moses and Pharaoh, the Hebrews in Egypt\", (NTT Mediascope Inc, 1994); and \"Réflexions sur le Coran\" (Mohamed Talbi & Maurice Bucaille, Seghers, 1989) .\n \n \n After a study which lasted ten years, Dr. Maurice Bucaille addressed the French Academy of Medicine in 1976 concerning the existence in the Qur'an of certain statements concerning physiology and reproduction. His reason for doing that was that :\n \n \"...our knowledge of these disciplines is such, that it is impossible to explain how a text produced at the time of the Qur'an could have contained ideas that have only been discovered in modern times.\"\n \n \"The above observation makes the hypothesis advanced by those who see Muhammad as the author of the Qur'an untenable. How could a man, from being illiterate, become the most important author, in terms of literary merits, in the whole of Arabic literature?\n \n How could he then pronounce truths of a scientific nature that no other human-being could possibly have developed at that time, and all this without once making the slightest error in his pronouncement on the subject?\"", 
   {
    "post_info": {
     "post_title": "More&gt;&gt;&gt;"
    }
   }, 
   59283, 
   null, 
   1090492320.0
  ], 
  [
   59288, 
   null, 
   "montalban", 
   "\"Ever since the dawn of human life on this planet, Man has always sought to understand Nature, his own place in the scheme of Creation and the purpose of Life itself. In this quest for Truth, spanning many centuries and diverse civilizations, organized religion has shaped human life and determined to a large extent, the course of history. While some religions have been based on books, claimed by their adherents to be divinely inspired, others have relied solely on human experience. etc...\n\n \n You should forward this post to Mizmaxx, because in attempting to defend your religion, she says that the Koran is not deemed central to Muslims and their faith. She makes un-Islamic defences for Islam.\n \n \n Montalben (note: It's Montalban!), i would really like if you try to show scientists comments about the science miracles of Quran. rather than trying to get your own comments.\n\n \n Firstly, am I to expect from you no answers to my questions? It seems so. It seems your point here is to continually post a number of 'just-so' statements about the Koran and expect that every one here will just have some kind of epiphany and go \"Yeah, you know, you're right.\" Whilst, personally, I hold great faith in the knowledge of others, I have reason to do so. You expect me to accept what you say, full stop.\n \n If you won't even answer basic questions - such as Muhammad killing prisoners-of-war, or having sex with a minor, then you will discredit yourself as a debater... rather you will be like someone interested in monologue. In fact this is what you suggest at the end. To sit back, switch off my mind and just 'accept' which is what Islam means - to surrender.\n \n It is quite clear from the Koran that it says we are created from a number of different things. One of these happens to be 'a clot'. You have sized upon this and said that it proves that Islam knows about embryology. I am no scientist, but I do not believe that an embryo comes from a clot.\n \n You also have non-connected statements such as \n \nAccording to the famous physicist and Nobel Prize winner, Albert Einstein, ?Science without religion is lame. Religion without science is blind.? Let us therefore study the Qur?aan, and analyze whether The Qur?aan and Modern Science are compatible or incompatible?\n\n \n Einstein is not saying he supports the Koran. But yes, when you say 'let us study it' you mean 'let us say that it does agree with science and not question this. Further, let us repeat it often to non-believers and offer no proofs of our statements'.\n \n But getting back to the scientists. Who knows what evidence you presented to these scientists. You may well have stated \"The Koran mentions that the embryo develops such and such a way\" and they here go \"By golly gee, considering where and when it was written, that's pretty amazing\". What ideas were put forward to these people? How many of them are financially dependent on Mohammedans?\n \n We can only guess at this, for sure, but what we do know is that you've taken one sura, ignored all the others in relation to the origins of a human life, and base your argument on this. Did you know that your first scientist (Dr. Moore) was on the pay of Osama bin Laden?\n http://www.geocities.com/freethoughtmecca/moorebinlauden.html\n also see\n http://www.geocities.com/freethoughtmecca/embryo.html\n Thus this site (http://www.answering-islam.org/Quran/Science/alaqa.html) shows that he miss-reads the Arabic terminology quite judiciously.\n \n I should like you to answer my questions. I know it's not the Muslim way to have questions - you prefer learning by rote.", 
   {}, 
   59282, 
   null, 
   1090497900.0
  ], 
  [
   59390, 
   null, 
   "montalban", 
   "Haddith Bukhari vol. 5, #234 says\n \"Narrated Aisha: The prophet engaged me when I was a girl of six. We went to Medina and stayed at the home of Harith Kharzraj. Then I got ill and my hair fell down. Later on my hair grew (again) and my mother, Um Ruman, came to me while I was playing in a swing with some of my girl friends. She called me, and I went to her, not knowing what she wanted to do to me. She caught me by the hand and made me stand at the door of the house. I was breathless then, and when my breathing became all right, she took some water and rubbed my face and head with it. Then she took me into the house. There in the house I saw some Ansari women who said, \"Best wishes and Allah's blessing and a good luck.\" Then she entrusted me to them and they prepared me (for the marriage). Unexpectedly Allah's messenger came to me in the forenoon and my mother handed me over to him, and at that time I was a girl of nine years of age.\"\n Note she was still playing on swings and other child games when she was called to marry Muhammed\n \n and\n Hadith Bukhari 5:58:235.\n \"...[T]he Prophet (Muhammed) said to her (Aisha), 'You have been shown to me twice in my dream. I saw you pictured on a piece of silk and someone said (to me). 'This is your wife.' When I uncovered the picture, I saw that it was yours. I said, 'If this is from Allah, it will be done.'\" \n \n Remember, that she was only a child. He is fantasising about a little girl.", 
   {
    "post_info": {
     "post_title": "Muhammed was a pedophile"
    }
   }, 
   59288, 
   null, 
   1090546140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Miracles in the Holy Quran", 
  "url": "http://www.4forums.com/political/religion-debates/2782-miracles-holy-quran.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 2782, 
  "discussion_files": [
   [
    "17011.html", 
    "http://www.4forums.com/political/religion-debates/2782-miracles-holy-quran-print.html"
   ]
  ], 
  "identifier": 2782
 }
]