[
 [
  [
   59279, 
   null, 
   "mana'ia", 
   "Doesn't this make you wonder why Democrats are spil on every moral issue except abortion and the GOP is strongly united in every issue? Democrats can't agree on anything except George Bush is bad.\n \n \n \n Delegates, ticket differ on gay marriage\n WASHINGTON (AP) - Democratic convention delegates generally are more open to the prospect of gay marriage than are John Kerry and John Edwards, their presumed nominees for the presidential ticket. \n An Associated Press survey of Democratic National Convention delegates found that roughly 41% said they favored marriage for same-sex couples, while about 21% opposed it. Most of the remaining delegates said their position didn't fit into a \"favor\" or \"oppose\" response, or refused to answer the question. \n \n Kerry and Edwards oppose gay marriage itself but also are against a constitutional ban on same-sex nuptials, wanting to allow states to decide the issue. Kerry backs civil unions, which would give same-sex partners the same rights as married couples without wedding. \n \n President Bush, like Kerry, opposes gay marriage. Unlike the Massachusetts senator, the incumbent Republican supported the proposed constitutional amendment forbidding gay marriage that failed in the Senate last week. \n \n \"John Kerry and George Bush are both against gay marriage,\" said Winnie Stachelberg, political director of Human Rights Campaign, a gay rights group. \"The disagreement is about letting discrimination into the U.S. Constitution.\" \n \n Overall, delegates' opinions on gay marriage run contrary to public opinion. For instance, a Pew Research Center poll released Wednesday found that those who opposed gay marriage outnumbered those in favor, 67% to 32%. Among only Democrats, it was 47% opposed, 41% in favor, the Pew poll found. \n \n Convention delegates typically come from the most loyal and activist wing of a political party. Democratic officials say gays will be represented in record numbers on the convention floor, boosted by delegate recruiting efforts in some states. \n \n \"For a group of Democratic Party activists which tends to be more liberal than the general population and even rank-and-file Democrats - it's not totally surprising,\" said Paul Watanabe, a political scientist at the University of Massachusetts in Boston. The city plays host to the convention starting Monday. \n \n The AP surveyed more than 3,100 delegates, or nearly three-quarters of the 4,300-plus who will attend the convention. The results revealed differences along some geographic and racial lines. \n \n About 80% of the delegation from Massachusetts - its highest court has ruled that gay couples should be allowed full, equal marriage rights - favored gay marriage. About 61% of California's delegates shared the same view, along with some 45% of New York's delegation. \n \n But delegates from Southern states such as Alabama, Arkansas and Mississippi tended to oppose gay marriage. \n \n Those differences mirrored results from a Pew Research Center poll conducted in January that found Southern Democrats opposed gay marriage by a margin of 65% to 26%, while Democrats outside the South favored it, 51% to 42%. \n \n Meanwhile, some 39% of black delegates nationwide opposed gay marriage, compared to about 24% in favor. Among whites or Hispanics, a majority in each group favored same-sex nuptials. \n \n A Pew poll released in November found that 60% of blacks opposed gay marriage. And exit polling conducted after primaries March 10 in Florida, Louisiana, Mississippi and Texas found that over half of black voters opposed legal recognition of same-sex marriage. \n \n Lula Gray, 69, a black delegate from Pine Bluff, Ark., opposes gay marriage but is against a constitutional amendment that would outlaw it. \n \n Still, Gray said she thinks Republicans have raised the gay marriage issue as a \"smoke screen to get out of the war, the economy and other issues.\" \n \n \"We have other problems,\" she says. \n \n While blacks' position on gay marriage may be more conservative, the issue likely won't keep them from the polls in November, says Merle Black, a political science professor at Emory University in Atlanta. \n \n \"It won't be a problem at all ... it's not a voting issue,\" Black says.", 
   {
    "post_info": {
     "post_title": "Democrats can't agree what's right or wrong on anything!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1090487220.0
  ], 
  [
   59285, 
   null, 
   "Duo_Maxwell", 
   "So democrats can think for themselves. Is that a bad thing?", 
   {}, 
   59279, 
   null, 
   1090492440.0
  ], 
  [
   59381, 
   null, 
   "jskufan", 
   "What makes you think Republicans are all in agreement on the issue? I'm sure there are Gay Republicans and thus supporters of the issue.", 
   {}, 
   59285, 
   null, 
   1090542000.0
  ], 
  [
   59537, 
   null, 
   "georged", 
   "A majority of conservative morality issue positions can be traced directly to their bibles. Perhaps, in a country evenly split between Democrats and Republicans, fewer non-conservatives are believers in mythology.", 
   {}, 
   59381, 
   null, 
   1090621620.0
  ], 
  [
   59565, 
   null, 
   "mana'ia", 
   "A majority of conservative morality issue positions can be traced directly to their bibles. Perhaps, in a country evenly split between Democrats and Republicans, fewer non-conservatives are believers in mythology.\n\n What is your definiton of mythology? Christianity?\n \n Majority of moral views are based upon religious views. So what? Are secular views better because they are based upon someone's own beliefs and not influenced by a standard? \n \n My point of this article was that there is moral clairty with republicans all agree overwhelmingly while the Democrats can't decide on anything except abortion what is right and wrong.", 
   {}, 
   59537, 
   null, 
   1090635060.0
  ], 
  [
   59594, 
   null, 
   "Duo_Maxwell", 
   "My point of this article was that there is moral clairty with republicans all agree overwhelmingly while the Democrats can't decide on anything except abortion what is right and wrong.\n\n \n Moral clarity changes in each age. Majority belief does not make something right. So democrats can think for themselves, is that a bad thing?", 
   {}, 
   59565, 
   null, 
   1090644300.0
  ], 
  [
   59623, 
   null, 
   "georged", 
   "My point of this article was that there is moral clairty with republicans all agree overwhelmingly while the Democrats can't decide on anything except abortion what is right and wrong.\n\n \n I'm a fiscally conservative agnostic Republican who dislikes any federal government interference in states rights. Are you speaking of Bush supporters who also support our actions in Iraq as morally defensible? Moral clarity is self-defined and not the government's job.", 
   {}, 
   59565, 
   null, 
   1090682820.0
  ], 
  [
   59874, 
   null, 
   "jitobear", 
   "\n My point of this article was that there is moral clairty with republicans all agree overwhelmingly while the Democrats can't decide on anything except abortion what is right and wrong.\n\n \n Maybe between you and all the guys you hang with, but I know Republicans who don't even like each other! I know a Republican who is pro-choice and a Democrat who is pro-life.\n \n Depends on what drives your vote. To assume their is or has to be homogony in either party is absolute FANTASY.\n \n Do you own thinking.\n \n crikey...", 
   {}, 
   59565, 
   null, 
   1090874040.0
  ], 
  [
   59876, 
   null, 
   "apathy", 
   "Democrats can't agree on anything except George Bush is bad.\n\n \n I don't think you have to be a democrat to spot that one.\n \n \nKerry and Edwards oppose gay marriage itself but also are against a constitutional ban on same-sex nuptials, wanting to allow states to decide the issue. Kerry backs civil unions, which would give same-sex partners the same rights as married couples without wedding. \n\n \n You don't have to agree with gay marriage to want to protect the constitution from frivolous amendments. We don't want to have another amendment to repeal the ban. Besides, the constitution is there to protect freedom, not ban things.\n \n \nPresident Bush, like Kerry, opposes gay marriage. Unlike the Massachusetts senator, the incumbent Republican supported the proposed constitutional amendment forbidding gay marriage that failed in the Senate last week. \n\n \n Thank god.\n \n \n\"John Kerry and George Bush are both against gay marriage,\" said Winnie Stachelberg, political director of Human Rights Campaign, a gay rights group. \"The disagreement is about letting discrimination into the U.S. Constitution.\" \n\n \n Exactly. And, the discrimination that was inherent in the constitution should never have been there (3/5 per slave, stuff like that).\n \n \nOverall, delegates' opinions on gay marriage run contrary to public opinion. For instance, a Pew Research Center poll released Wednesday found that those who opposed gay marriage outnumbered those in favor, 67% to 32%. Among only Democrats, it was 47% opposed, 41% in favor, the Pew poll found. \n\n \n Lincoln went against public opinion and freed the slaves.\n \n \nBut delegates from Southern states such as Alabama, Arkansas and Mississippi tended to oppose gay marriage. \n \n\n \n Go figure.\n \n \nLula Gray, 69, a black delegate from Pine Bluff, Ark., opposes gay marriage but is against a constitutional amendment that would outlaw it. \n \n\n \n Sounds like a bunch of flip-flopping to me. ;)", 
   {}, 
   59279, 
   null, 
   1090876380.0
  ], 
  [
   59902, 
   null, 
   "mana'ia", 
   "Moral clarity changes in each age. Majority belief does not make something right. So democrats can think for themselves, is that a bad thing?\n\n \n Yes I know moral clarity changes. \n \n For example:\n \n Whereas the Democratic party has used racist demagoguery to deceive African Americans about the history of the Republican Party that: (a) started as the anti-slavery party in 1854, (b) fought to free African Americans from slavery, (c) designed Reconstruction, a ten-year period of unprecedented political power for African Americans, (d) passed the Thirteenth, Fourteenth, and Fifteenth Amendments to the U. S. Constitution granting African Americans freedom, citizenship, and the right to vote, (e) passed the Civil Rights Acts of 1866 and 1875 granting African Americans protection from the Black Codes and prohibiting racial discrimination in public accommodations, (f) passed the Civil Rights Act of 1957 and the Civil Rights Acts of 1964 and 1965 granting African Americans protection from the Jim Crow laws, (g) established Affirmative Action programs to help African Americans proper with Republican President Richard Nixon's 1969 Philadelphia Plan that set the first goals and timetables and his 1972 Equal Employment Opportunity Act that made Affirmative Action Programs the law of our nation, and (h) never sponsored or launched a program, passed laws, or engaged in practices that resulted in the death of millions of African Americans, \n \n http://www.freerepublic.com/focus/f-news/1147682/posts\n \n While the Republicans always wanted equality.\n \n Democrats do think for themselves, some think gay marriage okay some do not. Some think religion is bad some do not. Some think adultery and marrigae are acceptable some do not. Some think the death penalty is acceptable some do not. They can't agree what's morally acceptable or not but try to tell America what is.", 
   {}, 
   59594, 
   null, 
   1090883940.0
  ], 
  [
   59903, 
   null, 
   "mana'ia", 
   "I'm a fiscally conservative agnostic Republican who dislikes any federal government interference in states rights. Are you speaking of Bush supporters who also support our actions in Iraq as morally defensible? Moral clarity is self-defined and not the government's job.\n\n \n The governement passes laws on waht is morally acceptable and what is not. We allow pornography but not prostitution. We allow fornication but not sex with minors. We allow alcohol but not marijuana. We allow strip clubs but not public nudity. All laws are based on some moral basis. The government defines morality by the laws they pass.", 
   {}, 
   59623, 
   null, 
   1090884120.0
  ], 
  [
   59924, 
   null, 
   "mana'ia", 
   "Maybe between you and all the guys you hang with, but I know Republicans who don't even like each other! I know a Republican who is pro-choice and a Democrat who is pro-life.\n \n Depends on what drives your vote. To assume their is or has to be homogony in either party is absolute FANTASY.\n \n Do you own thinking.\n \n crikey...\n\n It shows though we have a pretty clear line of what is morally acceptable and what is not.", 
   {}, 
   59874, 
   null, 
   1090890720.0
  ], 
  [
   59947, 
   null, 
   "Duo_Maxwell", 
   "mana'ia: The link provides nothing but rhetoric. Not to mention some several large distortions as well as ignoring the fact that the dems of the past are nothing like today's and the republicans of today are nothing like those of the past. it's essentially calling all Germans today Nazis because of their past and all French barbarians. \n \n You missed georged's point. Government exists for three reasons: Protect it's people, protect it's interests and produce domestic works. Nothing else.", 
   {}, 
   59924, 
   null, 
   1090899480.0
  ], 
  [
   60010, 
   null, 
   "apathy", 
   "The governement passes laws on waht is morally acceptable and what is not. We allow pornography but not prostitution. We allow fornication but not sex with minors. We allow alcohol but not marijuana. We allow strip clubs but not public nudity. All laws are based on some moral basis. The government defines morality by the laws they pass.\n\n \n STATES and LOCALITIES decide what is legally allowed and \"moral.\" Prostitution is allowed in some places. Gambling is now legal in many states, where it wasn't a few years ago. This is not the jurisdiction of the federal government.**\n The \"moral basis\" is simply majority opinion. The majority of people don't want to see grampa naked when they cross the street, so their locality forbids it.\n \n **with the exception of interstate commerce, and for some convoluted reason drugs", 
   {}, 
   59903, 
   null, 
   1090964100.0
  ], 
  [
   60019, 
   null, 
   "georged", 
   "STATES and LOCALITIES decide what is legally allowed and \"moral.\" Prostitution is allowed in some places. Gambling is now legal in many states, where it wasn't a few years ago. This is not the jurisdiction of the federal government.**\n The \"moral basis\" is simply majority opinion. The majority of people don't want to see grampa naked when they cross the street, so their locality forbids it.\n \n **with the exception of interstate commerce, and for some convoluted reason drugs\n\n \n And the federal government would certainly like to eliminate those states rights, as exampled by the current administration desire to ban same-sex marriages. If one looks at the enormous failed bureaucracy constructed for the 'war on drugs' complete with czar, now funded and used in S. America to effect policy in support of oil suppliers and political ideologies, think what they could do with porn and gambling.\n \n Nevada is the only US state allowing legalized prostitution, and that's determined by county election. There are about 300 'legal' (registered) prostitutes in Nevada who pay fees and taxes to practice their profession. In Clark County, where Las Vegas is located and prostutition is illegal, there are almost 200 pages of Yellow Pages advertising by 'escorts'.", 
   {}, 
   60010, 
   null, 
   1090967280.0
  ], 
  [
   60038, 
   null, 
   "mana'ia", 
   "mana'ia: The link provides nothing but rhetoric. Not to mention some several large distortions as well as ignoring the fact that the dems of the past are nothing like today's and the republicans of today are nothing like those of the past. it's essentially calling all Germans today Nazis because of their past and all French barbarians. \n \n You missed georged's point. Government exists for three reasons: Protect it's people, protect it's interests and produce domestic works. Nothing else.\n\n The government exist to protect the people and their interest. That encumbers everything.\n \n also good job to dismiss everything because you obviously don't have facts to dispute it.\n \n Who do you think is better prepared to fight for civil rights? The EEOC or the KKK? it shows taht the GOP knows what's moral and doesn't change.", 
   {}, 
   59947, 
   null, 
   1090981080.0
  ], 
  [
   60039, 
   null, 
   "mana'ia", 
   "STATES and LOCALITIES decide what is legally allowed and \"moral.\" Prostitution is allowed in some places. Gambling is now legal in many states, where it wasn't a few years ago. This is not the jurisdiction of the federal government.**\n The \"moral basis\" is simply majority opinion. The majority of people don't want to see grampa naked when they cross the street, so their locality forbids it.\n \n **with the exception of interstate commerce, and for some convoluted reason drugs\n\n \n The fedral government sets what is allowed and what is not. The states can raise that level but they can't go beneath it. Still all laws federal or local have a moral basis.", 
   {}, 
   60010, 
   null, 
   1090981200.0
  ], 
  [
   60062, 
   null, 
   "Duo_Maxwell", 
   "The government exist to protect the people and their interest. That encumbers everything.\n\n \n Read something by the founder of economics, aka it has do with the military. \n \n \n\n also good job to dismiss everything because you obviously don't have facts to dispute it.\n\n \n Nor do you have the facts to prove it. Also, good job in trying to ignore the historical changes of the parities. Do you know that republicans are in reality democrats and dems are republicans? Betcha you didn't know that. \n \n \n\n Who do you think is better prepared to fight for civil rights? The EEOC or the KKK? it shows taht the GOP knows what's moral and doesn't change.\n\n \n Right....here's a link to the EEOC\n \n Frankly, I see alot of DEMOCRAT policies and people in that link.", 
   {}, 
   60039, 
   null, 
   1090992180.0
  ], 
  [
   60325, 
   null, 
   "mana'ia", 
   " Read something by the founder of economics, aka it has do with the military. \n\n You stated that george;s point was:\n \n\n You missed georged's point. Government exists for three reasons: Protect it's people, protect it's interests and produce domestic works. Nothing else. \n \n I stated taht it encumbers everything\n \n \n \n \n\n Nor do you have the facts to prove it. Also, good job in trying to ignore the historical changes of the parities. Do you know that republicans are in reality democrats and dems are republicans? Betcha you didn't know that. \n\n \n Uh I stqated the facts. There was no historical change in the party. No one knows that the GOP and the Democrats changed places because it never happened.\n \n \n \n\n Right....here's a link to the EEOC\n \n Frankly, I see alot of DEMOCRAT policies and people in that link. \n\n \n gave example of the eeoc and the kkk for the main pupose of the organizations. There was one party the REpublican Democratic party taht split into the slavery party ( Democrats) and the anti-slavery (Republicans).\n \n So historically the Democrats group began as a white supremacists and the GOP began as equal rights. Now unless you have some facts to dispute this don;t respond wiht any more false assertions.", 
   {}, 
   60062, 
   null, 
   1091175420.0
  ], 
  [
   60330, 
   null, 
   "Duo_Maxwell", 
   "I stated that it encumbers everything\n\n \n Do you even know who the founder of Economics is? \n \n \nThere was no historical change in the party. No one knows that the GOP and the Democrats changed places because it never happened.\n\n \n Wow, that is ignorant. Something tells me your US history is severely lacking.\n \n Do you realize that the parties were one and the same for a period of time? \n \n Initially, there were the federalists and the anti-federalist..know what, just go here andlearn something from a change. Democrats are following Republican ideas and Republicans are following Democrat ideas, it all stems from the earliest portion of US history. \n \n \nThere was one party the REpublican Democratic party taht split into the slavery party ( Democrats) and the anti-slavery (Republicans).\n\n \n What party did John C. Calhoun belong to, or do you not know who that is? \n (it's a trick question btw) \n \n \n\n So historically the Democrats group began as a white supremacists and the GOP began as equal rights. Now unless you have some facts to dispute this don;t respond wiht any more false assertions.\n\n \n Read the link. It's you who is resorting to false asserations.", 
   {}, 
   60325, 
   null, 
   1091185440.0
  ], 
  [
   60331, 
   null, 
   "mana'ia", 
   "Do you even know who the founder of Economics is? \n\n Adam Smith is the founder of econom ics and he had his theories on teh role of government in economics.\n \n Again your quote said this\n \nYou missed georged's point. Government exists for three reasons: Protect it's people, protect it's interests and produce domestic works. Nothing else. \n \n \n Your statement is so brod it could include anything and everything. Anything could be in the people's interest\n \n \n \n \n\n Wow, that is ignorant. Something tells me your US history is severely lacking.\n \n Do you realize that the parties were one and the same for a period of time? \n \n Initially, there were the federalists and the anti-federalist..know what, just go here andlearn something from a change. Democrats are following Republican ideas and Republicans are following Democrat ideas, it all stems from the earliest portion of US history. \n\n Something tells me your reading comprehension is lacking\n \n Let's look at your link\n \n \n After  the Constitution was ratified, the Anti-Federalists slowly disbanded, and a new party led by Thomas Jefferson was formed. Jefferson&#8217;s party was the Democratic-Republicans, and Jefferson was the first President (in 1800) to not be a Federalist. The Democratic-Republican Party enjoyed great success in elections over the next thirty years, as our basic two-party system that we have today had yet to be established. \n With the arrival of Andrew Jackson onto the election scene, our two-party system that we know today began to develop. Jackson&#8217;s supporters formed the Democratic Party, while supporters of Henry Clay and John Quincy Adams formed the Whig party. The Whigs elected two presidents, William Henry Harrison and Zachary Taylor, but the slavery issue divided the party and led to its disbanding   in the 1850s. \n As the country crept closer to Civil War, a new party began to develop, the Republican Party. Abraham Lincoln was the first Republican president, in 1860. After the Civil War ended, two major parties existed with the Democrats and the Republicans. The parties became extremely regionalized, as the South voted heavily Democratic while the North voted heavily Republican. The Republicans dominated the presidency from 1860-1932, as they only lost four presidential elections during this time. \n In the early 1900s, a new &#8220;Progressive&#8221; movement  occurred within the nation. The Progressives pushed for such reforms as the initiative, the referendum, and the recall, which most states still have today. The Progressive movement hurt the Republican Party by taking away more of its voters. When Teddy Roosevelt ran for President in 1912 against the incumbent William Howard Taft, it split the Republican vote and allowed Democratic candidate Woodrow Wilson  to take over the White House. \n The Progressive movement died down after World War I,  and we consider the era of 1932-present to be the Modern Era of political parties. The two major parties we have are the Republican and Democratic parties. The Democrats and Republicans have both had extended periods in the White House over this time period, but lately the focus has been on divided government in politics &#8211; where one party controls the White House but the other party controls Congress. It appears that the American public enjoys not having one party completely dominating the other. \n \n \n Okay so where does it say that the parties switched? emoticon_confused \n \n \n \n \n \n\n What party did John C. Calhoun belong to, or do you not know who that is? \n (it's a trick question btw) \n\n The same and then it formed The Whig \n \n \n\n Read the link. It's you who is resorting to false asserations.\n \n\n Why don't you read it. Then reread it. Then have someone else read it. Then have someone else explain it to you.", 
   {}, 
   60330, 
   null, 
   1091188320.0
  ], 
  [
   60364, 
   null, 
   "georged", 
   "Adam Smith is the founder of econom ics and he had his theories on teh role of government in economics.\n \n\n \n Joseph Schumpeter is considered by many as the father of economics and offered far greater detail about how market forces are initiated. Smith came along about 50 years later with better publicity as England was then the world power. Actually, Catholic philosophers put forth the theory of price being determined by supply and demand many centuries before Schumpter and Smith, but the world as it existed then was stuck on material possessions such as gold, which could be held and seen, being the definition of wealth. The economist best known for insisting that government take a direct role in market economics is John Maynard Keynes, hence the famous (or infamous) term Keynesian Economics. Many economists consider those such as yourself who still preach Keynesian economics as being responsible for our massive post-WW11 debt and social engineering problems.", 
   {}, 
   60331, 
   null, 
   1091200200.0
  ], 
  [
   60416, 
   null, 
   "mana'ia", 
   "Joseph Schumpeter is considered by many as the father of economics and offered far greater detail about how market forces are initiated. Smith came along about 50 years later with better publicity as England was then the world power. Actually, Catholic philosophers put forth the theory of price being determined by supply and demand many centuries before Schumpter and Smith, but the world as it existed then was stuck on material possessions such as gold, which could be held and seen, being the definition of wealth. The economist best known for insisting that government take a direct role in market economics is John Maynard Keynes, hence the famous (or infamous) term Keynesian Economics. Many economists consider those such as yourself who still preach Keynesian economics as being responsible for our massive post-WW11 debt and social engineering problems.\n\n \n It still only refers to the role of government in terms of economics. What is your point? government exists for more than economic management.", 
   {}, 
   60364, 
   null, 
   1091223720.0
  ], 
  [
   60477, 
   null, 
   "Duo_Maxwell", 
   "Adam Smith is the founder of econom ics and he had his theories on teh role of government in economics.\n\n \n And he also stated the purpose of government, which you have failed to notice. \n \n \nYour statement is so brod it could include anything and everything. Anything could be in the people's interest\n\n \n ....in reference towards Smith. Government is to militarly defend it's citizens, protect it's interests, and produce domestic works. Nothing else. Since the government is not in the business of domestic policy beyond construction, it intersets must therefore be beyond it's borders. \n \n \n as the South voted heavily Democratic while the North voted heavily Republican.\n\n \n Does this occur now? :p \n \n \nThe Progressives pushed for such reforms as the initiative, the referendum, and the recall, which most states still have today. The Progressive movement hurt the Republican Party by taking away more of its voters.\n\n \n Except for the fact that the Progressive moment was Championed by one republican who went by the name of THEODORE ROOSEVELT. Are the republicans today progressives? Not in the slighests, and you have stated there has been no historical change, like usually, as you are in the gay rights debates, you are wrong. \n \n \nOkay so where does it say that the parties switched\n\n \n Explain federalist and anti-federalism. \n \n Nothing it the quote even remotely proves your wild asseration. \n \n \nWhy don't you read it. Then reread it. Then have someone else read it. Then have someone else explain it to you.\n\n \n And you didn't do anything except hurt yourself in the process. \n \n \nWhat is your point? government exists for more than economic management.\n\n \n Actually according to Smith, it didn't. Economics and Government are two almos completely seperate entities.", 
   {}, 
   60416, 
   null, 
   1091269620.0
  ], 
  [
   60588, 
   null, 
   "mana'ia", 
   "[QUOTE]\nAnd he also stated the purpose of government, which you have failed to notice. \n \n Regardless of what you think Adam Smith was implying his view is not accepted by the majority of policy makers. Also as our hsitory of con law has proved anything can be considered economical in it's implications.\n \n \n \n \n....in reference towards Smith. Government is to militarly defend it's citizens, protect it's interests, and produce domestic works. Nothing else. Since the government is not in the business of domestic policy beyond construction, it intersets must therefore be beyond it's borders. \n\n Since citizens are abroad and have interest abroad then ti can easily extend abroad. Also since there are threats abroad then they can go abroad.\n \n \n \nDoes this occur now? \n \n No but it did\n \n \n \n \n \n \nExcept for the fact that the Progressive moment was Championed by one republican who went by the name of THEODORE ROOSEVELT. Are the republicans today progressives? Not in the slighests, and you have stated there has been no historical change, like usually, as you are in the gay rights debates, you are wrong. \n \n What do you mean prograssive? The GOP is progressive. They made progress that the Democrats are still trying to catch up with such as civil rights.\n \n \n \n \nExplain federalist and anti-federalism. \n \n Nothing it the quote even remotely proves your wild asseration. \n \n Considering that the anti-federalist disbanded and only one existed. Then there was one party. Then the party split and we had two again. Then the democrats formed and the GOP split to ban slavery. So maybe you should explain your point again.\n \n \n \n \n \nAnd you didn't do anything except hurt yourself in the process. \n \n Why don't you point it out with some facts.\n \n \n \n \n \nActually according to Smith, it didn't. Economics and Government are two almos completely seperate entities.\n\n Actually according to monetary and fiscal policy they are not. Come back to the current times and quit relying on some outdated science.", 
   {}, 
   60477, 
   null, 
   1091361000.0
  ], 
  [
   61397, 
   null, 
   "Duo_Maxwell", 
   "Regardless of what you think Adam Smith was implying his view is not accepted by the majority of policy makers.\n\n \n The majority is not what is right nor what is correct in the time. Nor was he ever implying anything about acceptance. You're simply changing the subject due to your complete lack on knowledge about the current issue. \n \n \nSince citizens are abroad and have interest abroad then ti can easily extend abroad. Also since there are threats abroad then they can go abroad.\n\n \n But that isn't dealing with domestic issues. \n \n \nNo but it did\n\n \n So yes means no and up means down? \n \n \nWhat do you mean prograssive? The GOP is progressive. They made progress that the Democrats are still trying to catch up with such as civil rights.\n\n \n Do you know who TR was? \n \n \nConsidering that the anti-federalist disbanded and only one existed. Then there was one party. Then the party split and we had two again. Then the democrats formed and the GOP split to ban slavery. So maybe you should explain your point again.\n\n \n I see this is the same quality argumet as your gay arguments, meaning pathetic. You CANNOT explain either because you do not understand either. Either you explain the difference or you shutup. No party split to ban slavery. Those who wanted to ban slavery came from a wide grange of peoples, from free blacks, to rich senators on both sides. If you recall correctly, (but you never do), Lincoln had no intention of banning slavery. The civil war was not about slavery, it was about equal represenation in the government between slave and free. Slavery was the moral means that Lincoln gave to the war, after several years of fighting. \n \n \nWhy don't you point it out with some facts.\n\n \n I'm not the one screwing history up. \n \n \nActually according to monetary and fiscal policy they are not. Come back to the current times and quit relying on some outdated science.\n\n \n Did you even read what I typed?", 
   {}, 
   60588, 
   null, 
   1091927160.0
  ], 
  [
   63073, 
   null, 
   "Mach", 
   "The governement passes laws on waht is morally acceptable and what is not. We allow pornography but not prostitution. We allow fornication but not sex with minors. We allow alcohol but not marijuana. We allow strip clubs but not public nudity. All laws are based on some moral basis. The government defines morality by the laws they pass.\n\n \n You're kidding, right? They define laws, not morality. If you intereperet breaking any law as lacking in morals, that's your own decision.\n \n Arriving at intelligent decisions about the world requires analyzing information, not proclaiming ideology. One requires openess to change and flexibility (kind of like science..hmm), and one requires faith (kind of like mythology..hmm).\n \n I vote for thinking it through personally. And how is it a bad thing? Did conservative talk-radio put that ludicrous idea into your head?\n \n -Mach", 
   {
    "post_info": {
     "post_title": "-"
    }
   }, 
   59903, 
   null, 
   1092934020.0
  ], 
  [
   63510, 
   null, 
   "mana'ia", 
   "[QUOTE]\nThe majority is not what is right nor what is correct in the time. Nor was he ever implying anything about acceptance. You're simply changing the subject due to your complete lack on knowledge about the current issue. \n \n No but his theories have evovled and obviously are a basis not the determinant. You ignorace of that fact is what is killing me. It's liek reciting 200 yr old case law as good law.\n \n \n \nBut that isn't dealing with domestic issues. \n Depends on your definition of domsestic. Is a business worldwide incorporated in the US domestic?\n \n \n \n \nSo yes means no and up means down? \n You're just trying to avoid admitting you were wrong.\n \n \n \n \nDo you know who TR was? \n \n Yes and how is taht relevant?\n \n \n \nI see this is the same quality argumet as your gay arguments, meaning pathetic. You CANNOT explain either because you do not understand either. Either you explain the difference or you shutup. No party split to ban slavery. Those who wanted to ban slavery came from a wide grange of peoples, from free blacks, to rich senators on both sides. If you recall correctly, (but you never do), Lincoln had no intention of banning slavery. The civil war was not about slavery, it was about equal represenation in the government between slave and free. Slavery was the moral means that Lincoln gave to the war, after several years of fighting. \n \n If you remember that Licoln and the Republicans promised no more slave states. So when Licoln was elected teh slaves states succeeded because they thought they would lose slavery. So Licoln went to war because they suceeded. Why did they suceed? They knew Licoln and the GOP would eventually abolish slavery. The people against slavery left the Democrats. \n \n Now instead of making false statement posts something up that backs your version becasue everyhting you psoted backed mine.\n \n \n \n \n \nI'm not the one screwing history up.\n Then it msut be your evil twin because your post did. \n \n \n Remember this quote you made?\n Nor do you have the facts to prove it. Also, good job in trying to ignore the historical changes of the parities. Do you know that republicans are in reality democrats and dems are republicans? Betcha you didn't know that.  \n REmember how you couldn't prove that? That was funny huh?\n \n \nDid you even read what I typed?\n\n Do you even understand what you typed?", 
   {}, 
   61397, 
   null, 
   1093163460.0
  ], 
  [
   63511, 
   null, 
   "mana'ia", 
   "You're kidding, right? They define laws, not morality. If you intereperet breaking any law as lacking in morals, that's your own decision.\n \n Arriving at intelligent decisions about the world requires analyzing information, not proclaiming ideology. One requires openess to change and flexibility (kind of like science..hmm), and one requires faith (kind of like mythology..hmm).\n \n I vote for thinking it through personally. And how is it a bad thing? Did conservative talk-radio put that ludicrous idea into your head?\n \n -Mach\n\n So they are passing immoral laws or alws they feel might be immoral right?\n \n They pass laws on what they beleive is moral so it is not defining morality but based upon what they feel is moral showing what they feel is morality for America.", 
   {}, 
   63073, 
   null, 
   1093163520.0
  ], 
  [
   63606, 
   null, 
   "Duo_Maxwell", 
   "No but his theories have evovled and obviously are a basis not the determinant. You ignorace of that fact is what is killing me. It's liek reciting 200 yr old case law as good law.\n\n \n But they are not his theories if they evolved. I cited Smith's 3 reasons for government, none of which you understood. Then you are saying that they have evolved and therefore I am wrong. Do you even understand that you are saying that I am wrong when you don't even know who Smith is? \n \n \nIs a business worldwide incorporated in the US domestic?\n\n \n No. Not to smith. \n \n \nYou're just trying to avoid admitting you were wrong.\n\n \n i didn't contridict myself in less then 5 words like you did.\n \n \nYes and how is taht relevant\n\n \n Do the terms progressive mean anything to do? How about republican party? \n \n \nIf you remember that Licoln and the Republicans promised no more slave states.\n\n \n True, but not because they thought slavery was wrong. The nation at the time was divided in congress between slave and free. Stopping slavery from growing ensured a dominant power for the free, giving them the ability to do whatever they wanted to do in congress. The civil war was not on slavery, it was on congressional balance of power. \n \n \nSo when Licoln was elected teh slaves states succeeded because they thought they would lose slavery.\n\n \n Your US history is appalling. See above. Republicans didn't care about slavery. In fact, they supported slavery to keep the border states with the South, and they also didn't stop slavery in Maryland when the North took it to stop it from going to the South and taking the District of Columbia with it. \n \n \n\n So Licoln went to war because they suceeded. Why did they suceed? They knew Licoln and the GOP would eventually abolish slavery. The people against slavery left the Democrats.\n\n \n See above. Your US history is completely appalling. Besides, the major outspoken supporter of slavery, and many republican notions was the infamous John C Calhoun, if you even know who that is.", 
   {}, 
   63511, 
   null, 
   1093237980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Democrats can't agree what's right or wrong on anything!", 
  "url": "http://www.4forums.com/political/news-forum/2786-democrats-cant-agree-whats-right-wrong-anything.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 2786, 
  "discussion_files": [
   [
    "23956.html", 
    "http://www.4forums.com/political/news-forum/2786-democrats-cant-agree-whats-right-wrong-anything-print.html"
   ], 
   [
    "23957.html", 
    "http://www.4forums.com/political/news-forum/2786-democrats-cant-agree-whats-right-wrong-anything-2-print.html"
   ]
  ], 
  "identifier": 2786
 }
]