[
 [
  [
   59789, 
   null, 
   "remrem", 
   "\"We came here to protest the program of expelling Jews from their land,\" said Avraham Yitzhaki, 54, from the Gaza settlement of Ganei Tal.\n --\n I love how illegal Jewish settlers can have the gall to protest. These poor poor victims are being victimized again. First their ancestors felt the wrath of Hitler, now they have pillaged, I mean emigrated, rather flocked to the promise land, and their own are trying to victimize them. \n \n I mean this in the nicest way possible. Every single illegal Jewish settler, should be uprooted and placed somewhere else. I'm not for driving anyone to the sea, but I could give a rat's *** what you do with crazy, luny, religious fundamentalists, that think they are god's gift, literally. These people are no different than supporters of Al Qaeda, they think that their agenda is excusable and justifiable at any cost, for any amount of pain on another. And for what reason? Because god said so. \n \n I don't like to knock on the chosen ones but this ridiculous santa like fairy tale, about how \"god picked me and not you\" is just laughable. I can respect anyones opinion, but when common lifestyle infringes on the innocent, it is wrong, and that is the lifestyle of the illegal settlers in Gaza and the West Bank. \n \n And I do find it ironic, that America is engaging in a global war against Islamic fundamentalism, while Zionist fundamentalists are parading around with the green light from US to cause as much destruction as they see fit.", 
   {
    "post_info": {
     "post_title": "Settlers protesting for land that isn't theirs"
    }
   }, 
   null, 
   null, 
   1090834380.0
  ], 
  [
   59808, 
   null, 
   "georged", 
   "And I do find it ironic, that America is engaging in a global war against Islamic fundamentalism, while Zionist fundamentalists are parading around with the green light from US to cause as much destruction as they see fit.\n\n \n It'll be difficult to find anything but agreement for our policies and our support of Israel's policies in our government. These are the same folks who brought us Vietnam and Iraq. Our Christian fundamentalists have a long, bloody history of using force to impose their ideology on non-believers for purposes of utilizing their resources. Ask any Native American.", 
   {}, 
   59789, 
   null, 
   1090855860.0
  ], 
  [
   59829, 
   null, 
   "remrem", 
   "One can only hope through persistance that these policies change. I have a liberal website where I try and \"spread the message\" but it's hard. I will say that dems haven't been this mobilized in a long time. People are just upset about American policy in general. I understand that Kerry won't be a great president, but maybe a fresh start is the opening we need to help try and reform Kerry into the type of candidate Americans want him to be. I figure since he is a flip flopper it shouldn't be too hard. But just about anything besides Bush & co. will do at this point unfortunately", 
   {}, 
   59808, 
   null, 
   1090865820.0
  ], 
  [
   59915, 
   null, 
   "apathy", 
   "Should we uproot all the americans?\n I see a distinct parallel between Jewish settlement of Isreal and European settlement of America (on a larger scale).", 
   {}, 
   59829, 
   null, 
   1090887960.0
  ], 
  [
   59943, 
   null, 
   "remrem", 
   "Should nothing in history or in society ever be wrong apathy? Should apartheid have continued to exist in South Africa? The settlers are there illegally, taking land and resources from a people that have been cornered into ghettos of 22 percent of their homeland since 1948. Should justice not hold up? Should international law, resolutions that Americans have signed not matter? \n \n Maybe your question was harmless. I don't know if you were inferring what happened to Native Americans was justifiable. Europeans were imperialistic and stormed this country and pillaged. And regarding the Palestinian people they were living in Palestine as an indigenous population with a normal flowing society and culture and it was uprooted, it was unjustiable. \n \n These settlers are even seperate from Israel proper, they are part of the occupied territories, land that Israel wants to milk, but doesn't want to take responsibility for. Israel has taken the fruitful parts of the land, created them into settlements and partrols as the aggressors without deeming any rights to the civilian population it occupies. What has happened to the Palestinian people over the last 56 years, especially the 37 years of occupation, has been brutal and agonizing. \n \n So the point is the settlers shouldn't be there, they have no right, humanitarian or law regarding, and are a detriment to peace that is essential for the region and especially the neighbors that have been in this long and bloody conflict", 
   {}, 
   59915, 
   null, 
   1090898880.0
  ], 
  [
   59964, 
   null, 
   "mizmaxx", 
   "Our Christian fundamentalists have a long, bloody history of using force to impose their ideology on non-believers for purposes of utilizing their resources. Ask any Native American.\n\n \nShould we uproot all the americans?\n\n \nMaybe your question was harmless. I don't know if you were inferring what happened to Native Americans was justifiable. Europeans were imperialistic and stormed this country and pillaged. And regarding the Palestinian people they were living in Palestine as an indigenous population with a normal flowing society and culture and it was uprooted, it was unjustiable.\n\n As it happens, I am Native. I agree with georged and remrem, the situations are parallel, and it's no accident that American settlers identify with Isreali settlers.\n \n On whether \"americans\" should be \"uprooted\".... \n \n I think a fundamental misunderstanding caused by the whitewashing of history is the notion that colonisation and \"settling\" are a simple process of moving to a place and trying to \"start a new life\", ie akin to immigration. Colonization and immigration are not at all the same thing. \n \n People have been immigrating to North America for millenia (Kennewick Man was over 9000 yrs old). Despite common belief, Native peoples did not travel to the Americas in a single or even a few \"trips\", but instead there was a relatively constant flow of people. If Europeans had simply wanted to live in the Americas, that could have been arranged. Evidence for this is the ease with which Native nations welcomed African escaped slaves, and remaining members of decimated Native nations. In fact, the early colonial-era meetings between First Nations and Europeans were quite friendly, as Nations were always happy to find new people with whom to trade. \n \n On the contrary, the intent of colonization was not \"finding a new life\" or simply moving away from Europe. The Europeans did not have any intention of \"buying\" the land, or otherwise engaging in equitable exchange. The intent was to steal the land and enslave the people. Anyone who got in the way was to be exterminated. This was clearly articulated in report after report by the Europeans, from Columbus' diaries to the BIA's mandate.\n \n Similarly, the creation of Isreal was a handing over of \"territory\" from one Imperial nation to a new Imperial nation. No concern existed for the people who actually lived in that territory, except for the possibility that they might get in the way. Similar stories about the land being \"unoccupied\" occur in Zionist and American settler arguments- along with similar though contradictory statements about the need to exterminate the indigenous population (the Shas and Molodet Parties are explicit about this as policy in Israel, as was Ariel Sharon at one time). \n \n In conclusion, speaking for myself as just one Native person, I don't think most Native people want to see all Euro-Americans deported en masse. Despite the horrible history which we have to deal with, so long as people are willing to live equitably with us now, we have no problem. Unfortunately, often that is not the case, certainly as reflected in government dealings with us. \n \n I can't speak for Palestinians, but my Palestinian friends simply want what I want for myself and my people, and really for everyone- not to be attacked, relocated, massacred, etc., the freedom to govern ourselves, as we see fit, on our land.", 
   {}, 
   59943, 
   null, 
   1090909980.0
  ], 
  [
   59997, 
   null, 
   "apathy", 
   "Should nothing in history or in society ever be wrong apathy? Should apartheid have continued to exist in South Africa? The settlers are there illegally, taking land and resources from a people that have been cornered into ghettos of 22 percent of their homeland since 1948. Should justice not hold up? Should international law, resolutions that Americans have signed not matter? \n \n Maybe your question was harmless. I don't know if you were inferring what happened to Native Americans was justifiable. Europeans were imperialistic and stormed this country and pillaged. And regarding the Palestinian people they were living in Palestine as an indigenous population with a normal flowing society and culture and it was uprooted, it was unjustiable. \n \n These settlers are even seperate from Israel proper, they are part of the occupied territories, land that Israel wants to milk, but doesn't want to take responsibility for. Israel has taken the fruitful parts of the land, created them into settlements and partrols as the aggressors without deeming any rights to the civilian population it occupies. What has happened to the Palestinian people over the last 56 years, especially the 37 years of occupation, has been brutal and agonizing. \n \n So the point is the settlers shouldn't be there, they have no right, humanitarian or law regarding, and are a detriment to peace that is essential for the region and especially the neighbors that have been in this long and bloody conflict\n\n \n \n I wasn't inferring anything. I don't think that the way european settlers treated native americans was in any way justifiable, but we can't uproot all of us now, after many generations. Just like you can't just go and uproot a nation, even after only 2-3 generations. Whether they have a right to be there is out of the question. Whether americans have the right to occupy all the land between the atlantic and the pacific and then some is out of the question. It's too late now.", 
   {}, 
   59943, 
   null, 
   1090955280.0
  ], 
  [
   59999, 
   null, 
   "sinjin", 
   "I hope I don't get hammered for mentioning that the various tribes of the Americas were at war with each other regularly long before Europeans arrived.\n Any suggestion that Europeans have a different \"nature\" than other humans doesn't hold water with me. Technological advantage was the main difference. Tribes used acquired technology to annihilate their long time enemies in many instances.", 
   {}, 
   59997, 
   null, 
   1090955880.0
  ], 
  [
   60069, 
   null, 
   "remrem", 
   "I wasn't inferring anything. I don't think that the way european settlers treated native americans was in any way justifiable, but we can't uproot all of us now, after many generations. Just like you can't just go and uproot a nation, even after only 2-3 generations. Whether they have a right to be there is out of the question. Whether americans have the right to occupy all the land between the atlantic and the pacific and then some is out of the question. It's too late now\n\n \n So if I come into your home, kill half your family and drive the rest of your family to the end of the neighborhood, I have a right to your home and your land, if I hold out long enough??? Reparations must be paid. Were reparations not paid for the Holocaust? Am I correct in saying that one must abide by international law? If Israel had the right to kill in 1948 and take homes, land and property, would Palestinians not have the same equal right today? I'm for peace, but I'm also for justice. And what the Palestinians are seeing today and what they have been offered in the past is not justice. My parents and grandparents were forcefully removed from their homes, their neighbors were killed, should they not see reparations for these injustices. Is it right that I kill your mother and your father tomorrow, leave the state for 10 years, come back and not be brought to justice? I just don't understand how you can justify what has been done and what is happening. These settlers have chosen, chosen, to go into territory that has internationally been deemed Palestinian land and settled there, they understood what they were doing, they understood the reactions the Palestinians would have, they understood that they were settling on someone elses land, tearing down someone else home, they understood the implications of their actions, they already had a homeland that was given to them by the UN and Britian. They had no right whatsoever to go and settle on that land, it was done with religious and malicious intent. It wasn't these peace happy refugees just looking for a place to stay, it was absolutely intentional. So uprooting them wouldn't be wrong, just as prosecuting a criminal wouldn't be wrong. They are illegal settlers under international law, which America had a part in, and which Israel is suppose to recognize. So no, uproot the settlers, it is completely justified.", 
   {}, 
   59999, 
   null, 
   1091002260.0
  ], 
  [
   60146, 
   null, 
   "apathy", 
   "So if I come into your home, kill half your family and drive the rest of your family to the end of the neighborhood, I have a right to your home and your land, if I hold out long enough???\n\n \n I love it when people use analogies that seem to fit but don't at all. We are talking about whole societies, not one person. Did every single Jew in Isreal kill and take land? No, they were born there or they just migrated after someone else did the killing. Who is going to pay reparations now? Should all white people alive today pay reparations to all black people and native americans today? (Just because native american tribes were at war with each other from time to time doesn't give anyone the right to commit genocide, to answer Sinjin.) \n \n \n Reparations must be paid. Were reparations not paid for the Holocaust? \n \n Were they? Who paid whom?\n \n \nAm I correct in saying that one must abide by international law? If Israel had the right to kill in 1948 and take homes, land and property, would Palestinians not have the same equal right today?\n\n \n It was \"international law\" that created the state of Isreal. But, yes, if Palestinians can invade and conquer Isreal then it will be theirs. Did they have a right to do so? Does anyone ever have the 'right' to do something like that?\n \n \n I'm for peace, but I'm also for justice. And what the Palestinians are seeing today and what they have been offered in the past is not justice. My parents and grandparents were forcefully removed from their homes, their neighbors were killed, should they not see reparations for these injustices.\n \n \n I never said anything about what is fair and just. I only stated that uprooting an entire society, despite how it got there, is not something you can just do without a war or something like that.\n \n \n \nIs it right that I kill your mother and your father tomorrow, leave the state for 10 years, come back and not be brought to justice? I just don't understand how you can justify what has been done and what is happening. \n \n \n Again, I never said any of it was justified.\n \n \nThese settlers have chosen, chosen, to go into territory that has internationally been deemed Palestinian land and settled there, they understood what they were doing, they understood the reactions the Palestinians would have, they understood that they were settling on someone elses land, tearing down someone else home, they understood the implications of their actions, they already had a homeland that was given to them by the UN and Britian. They had no right whatsoever to go and settle on that land, it was done with religious and malicious intent. It wasn't these peace happy refugees just looking for a place to stay, it was absolutely intentional. So uprooting them wouldn't be wrong, just as prosecuting a criminal wouldn't be wrong. They are illegal settlers under international law, which America had a part in, and which Israel is suppose to recognize. So no, uproot the settlers, it is completely justified.\n\n \n Ok, I think I was talking about the original settling of Isreal and the thread is about some recent events. This is what I can never understand about Isreal vs. Palestine. Why should anyone give a flying flaming fudge brownie if your neighbor is Jewish or Muslim, isreali or palestinian? \n \n If a Palestinian wanted to become an Isreali citizen or migrant, could he/she be allowed to do that? I don't know that's why I'm asking.", 
   {}, 
   60069, 
   null, 
   1091060820.0
  ], 
  [
   60148, 
   null, 
   "remrem", 
   "SETTLERS, Israeli settlers, but SETTLERS. They are not in Israel.\n \n Should German insurance companies pay reparations for the Holocaust? They do. Are you kidding me. What do you call Israel? A wrongful reparation, but still a reparation. The problem with that is ones suffering doesn't justify anothers suffering.\n \n And listen most of those settler haven't been there for generations and generations, that is where you are sorely mistaken. Remember that settling doubled in the '90s over 200,000 new settlers (including East Jersualem) have settled illegally in the OT's in the last 13 years, so to say that they were that the majority were there for generations and more is an outright lie. \n \n \n \nOk, I think I was talking about the original settling of Isreal and the thread is about some recent events. This is what I can never understand about Isreal vs. Palestine. Why should anyone give a flying flaming fudge brownie if your neighbor is Jewish or Muslim, isreali or palestinian? \n \n If a Palestinian wanted to become an Isreali citizen or migrant, could he/she be allowed to do that? I don't know that's why I'm asking\n.\n \n That's the problem. I'm for a one state solution. I think that Jews/Muslims/Christians or Israelis/Palestinians should live together. Or I would support a two state solution. The problem for the Palestinians isn't living side by side, they complain about living under apartheid or in ghettos that are completly controlled by Israel, while blanketed with the title of a State. The UN gave Israel 54 percent of the land and they now reside on about 82 to 85 percent of the land. The Gaza Strip is the most overpopulated section of the world, literally. \n \n No a Palestinian can't become an Israeli citizen. That's the whole thing of right of return and not allowing, preserving the Jewish majority of Israel. Israel isn't a state, it's a Jewish state, and must preserve that majority.", 
   {}, 
   60146, 
   null, 
   1091062620.0
  ], 
  [
   60154, 
   null, 
   "apathy", 
   "Really? Current German insurance companies and the current german government pay reparations to jews today? That is very noble of them since they had nothing to do with the holocaust. (Actually, I don't know exactly how many Nazis stayed around after WWII to work in insurance companies.) \n \n By your first post, I think you were advocating putting guns to the backs of children and old ladies and marching them to the border. That's justice?\n \n My response to that was that it would be pretty similar to shipping almost everyone in North and South America back to their countries of heritage.\n \n You are holding ordinary people responsible for the actions of governments and armies.\n \n I'll just leave it by saying that I think it's a shame that Isreal doesn't allow immigration of Palestinians. If the Palestinians really want to live in Isreal that badly and not in Jordan or all the other countries they could migrate to, then they should be allowed. But, something tells me that there is no way that a Palestinian and an Isreali can be neighbors.", 
   {}, 
   60148, 
   null, 
   1091065440.0
  ], 
  [
   60155, 
   null, 
   "apathy", 
   "As it happens, I am Native. I agree with georged and remrem, the situations are parallel, and it's no accident that American settlers identify with Isreali settlers.\n \n On whether \"americans\" should be \"uprooted\".... \n \n I think a fundamental misunderstanding caused by the whitewashing of history is the notion that colonisation and \"settling\" are a simple process of moving to a place and trying to \"start a new life\", ie akin to immigration. Colonization and immigration are not at all the same thing. \n \n People have been immigrating to North America for millenia (Kennewick Man was over 9000 yrs old). Despite common belief, Native peoples did not travel to the Americas in a single or even a few \"trips\", but instead there was a relatively constant flow of people. If Europeans had simply wanted to live in the Americas, that could have been arranged. Evidence for this is the ease with which Native nations welcomed African escaped slaves, and remaining members of decimated Native nations. In fact, the early colonial-era meetings between First Nations and Europeans were quite friendly, as Nations were always happy to find new people with whom to trade. \n \n On the contrary, the intent of colonization was not \"finding a new life\" or simply moving away from Europe. The Europeans did not have any intention of \"buying\" the land, or otherwise engaging in equitable exchange. The intent was to steal the land and enslave the people. Anyone who got in the way was to be exterminated. This was clearly articulated in report after report by the Europeans, from Columbus' diaries to the BIA's mandate.\n \n Similarly, the creation of Isreal was a handing over of \"territory\" from one Imperial nation to a new Imperial nation. No concern existed for the people who actually lived in that territory, except for the possibility that they might get in the way. Similar stories about the land being \"unoccupied\" occur in Zionist and American settler arguments- along with similar though contradictory statements about the need to exterminate the indigenous population (the Shas and Molodet Parties are explicit about this as policy in Israel, as was Ariel Sharon at one time). \n \n In conclusion, speaking for myself as just one Native person, I don't think most Native people want to see all Euro-Americans deported en masse. Despite the horrible history which we have to deal with, so long as people are willing to live equitably with us now, we have no problem. Unfortunately, often that is not the case, certainly as reflected in government dealings with us. \n \n I can't speak for Palestinians, but my Palestinian friends simply want what I want for myself and my people, and really for everyone- not to be attacked, relocated, massacred, etc., the freedom to govern ourselves, as we see fit, on our land.\n\n \n \n Great. I agree. But what can we do about it NOW?", 
   {}, 
   59964, 
   null, 
   1091065740.0
  ], 
  [
   60321, 
   null, 
   "remrem", 
   "I'll just leave it by saying that I think it's a shame that Isreal doesn't allow immigration of Palestinians. If the Palestinians really want to live in Isreal that badly and not in Jordan or all the other countries they could migrate to, then they should be allowed\n\n \n I completely agree.\n \n I'm not saying Israelis should move out of Israel. I'm saying that Settlers who knowingly chose to settle in the West Bank and Gaza Strip --- Palestinian land --- should slowly be shifted back to Israel. Trust they will be compensated. In the past when Israel compensated other settlers, not a peep was heard because they were silenced by the luxury of wealth. This was a large problem during the Oslo years. And it continued with speediness throughout the second intifada. This is what I'm saying, it didn't stop. That's part of the problem. I'm not talking about generations and more. We're not talking about 300 or 500 years ago. I'm talking about 5 years ago, 2 years ago, and yes some from farther back than that. But I don't think you understand what these settlements have done to Palestininian society. The more settlements, the more servere the occupation, the more control and \"security\" and the more abuse put on the Palestinian people. It's not like the settlers come, carve out a spot and that's it. They have new roads and pathways that cut through Palestinian land, destroyed or taken Palestinian land, and continues to shrink the small amount of land the Palestinians live on. I'm a peaceful man, if Israel wanted to say, let's keep the settlements, and form a one state solution and give the Palestinians citizenship I would be all over it. But extremists have decided the future of Israel, as well as corrupt bastards on the side of Palestine, and so no progress is moving forth for justice.\n \n Remi", 
   {}, 
   60155, 
   null, 
   1091167500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Settlers protesting for land that isn't theirs", 
  "url": "http://www.4forums.com/political/politics-debates/2805-settlers-protesting-land-isnt-theirs.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2805, 
  "discussion_files": [
   [
    "13453.html", 
    "http://www.4forums.com/political/politics-debates/2805-settlers-protesting-land-isnt-theirs-print.html"
   ]
  ], 
  "identifier": 2805
 }
]