[
 [
  [
   60203, 
   null, 
   "jim's trucking", 
   "John Kerry knows what he's doing. Tonight he plays on the sympathy of the patriotic voting public by having Max Cleland introduce him for his acceptance speech.\n \n Here's Kerry who got his third band-aid Purple Heart and took an early leave from the war, being introduced by a wheelchair bound fellow vet. Oh, let's be patriotic and vote for Kerry. emoticon_rolleyes \n \n Max, a triple amputee, was not severely wounded while fighting for his country. He accidentally blew off his own arm and legs after dropping a grenade.", 
   {
    "post_info": {
     "post_title": "The charade continues tonight at the DNC!"
    }
   }, 
   null, 
   null, 
   1091115480.0
  ], 
  [
   60206, 
   null, 
   "Kronus", 
   "\n Max, a triple amputee, was not severely wounded while fighting for his country. He accidentally blew off his own arm and legs after dropping a grenade.\n\n \n Are you gunning for an internship if Fox news or something? Cleland was wounded while he was in Vietnam, fighting for his country. The incident didn't occur during combat, true. But he didn't drop the gernade either. Another soldier dropped the gernade and it went off when Cleland tried to retrieve it. You make it sound like he screwed up in basic training.", 
   {}, 
   60203, 
   null, 
   1091116680.0
  ], 
  [
   60217, 
   null, 
   "Big Orn", 
   "DNC or RNC - they put to mind a bunch of spoiled youngsters seeking recognition for peeing on an electric fence.\n \n JMHO... emoticon_rolleyes", 
   {}, 
   60206, 
   null, 
   1091121480.0
  ], 
  [
   60256, 
   null, 
   "jerichoholic104", 
   "Yeah jim, try and say that a triple amputee from Vietnam isn't patriotic, you idiot. Who bothered to spawn you?", 
   {}, 
   60217, 
   null, 
   1091138340.0
  ], 
  [
   60261, 
   null, 
   "jim's trucking", 
   "Yeah jim, try and say that a triple amputee from Vietnam isn't patriotic, you idiot. Who bothered to spawn you?\n\n \n I didn't say Max is not patriotic. He recieved medals for heroism in Vietnam. I referred to Kerry's apparent use of patriotic sympathy.\n \n Cleland's injuries were not a result of warfare, as you might tend to believe. Kerry is simply taking advantage of the circumstances to bolster the idea that Kerry himself was a big war hero. He may get a few of his wartime buddies to speak in his behalf, but several who knew him well have declined.", 
   {}, 
   60256, 
   null, 
   1091139240.0
  ], 
  [
   60412, 
   null, 
   "jim's trucking", 
   "http://ice.he.net/~freepnet/kerry/index.php?topic=SwiftVets\n \n \n http://www.indignantwrath.blogspot.com/", 
   {
    "post_info": {
     "post_title": "Like these...."
    }
   }, 
   60261, 
   null, 
   1091222160.0
  ], 
  [
   60428, 
   null, 
   "apathy", 
   "Max, a triple amputee, was not severely wounded while fighting for his country. He accidentally blew off his own arm and legs after dropping a grenade.\n\n \n Which fully illustrates the pointless waste of war.\n \n (and the speeches given by kerry's daughters and his stepson were about to make me puke, then the movie before Kerry came out finished the deal)", 
   {}, 
   60203, 
   null, 
   1091228520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The charade continues tonight at the DNC!", 
  "url": "http://www.4forums.com/political/politics-debates/2824-charade-continues-tonight-dnc.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2824, 
  "discussion_files": [
   [
    "15493.html", 
    "http://www.4forums.com/political/politics-debates/2824-charade-continues-tonight-dnc-print.html"
   ]
  ], 
  "identifier": 2824
 }
]