[
 [
  [
   60258, 
   null, 
   "joebrummer", 
   "Homosexuality has been documented in most animals and birds. So do tell me how homosexuality is unnatural? If humans are mammals or so I learned in biology 101, would we not fit into the same catagory as other animals? Here are some links to view to prove the point.\n \n \n http://www.rnw.nl/lifestyle/html/gayanimals000808.html\n \n my personal favorite....\n \n http://sfgate.com/cgi-bin/article.c...MNG3N4RAV41.DTL", 
   {
    "post_info": {
     "post_title": "Homosexuality in Nature"
    }
   }, 
   null, 
   null, 
   1091138400.0
  ], 
  [
   60266, 
   null, 
   "Big Orn", 
   "I have never considered man an animal.\n \n When someone refers to a human being as an animal, in most cases, it is demeaning.\n \n Despite the close calls, man is a special creature&#8230;period.\n \n Homosexual humans are special creatures, not animals.\n \n I could plead for mercy here, crying out not to equate the two, but justification to do what one wants would still lean towards the &#8220;natural&#8221; aspect, I&#8217;m afraid.\n \n &#8220;I am who I am; I do what I do regardless of your opinions and an entitled to the same rights as you are, am protected under the same law as you are and could care less whether you liked it or not!&#8221; &#8211; would be a better approach than claiming, &#8220;It&#8217;s alright because animals do it.&#8221;", 
   {}, 
   60258, 
   null, 
   1091140020.0
  ], 
  [
   60268, 
   null, 
   "jerichoholic104", 
   "I have never considered man an animal.\n \n When someone refers to a human being as an animal, in most cases, it is demeaning.\n \n\n \n \n haha! not in the bedroom! you know what i mean... heh heh.. you.. know..", 
   {}, 
   60266, 
   null, 
   1091140140.0
  ], 
  [
   60279, 
   null, 
   "Kronus", 
   "I have never considered man an animal.\n \n \"I am who I am; I do what I do regardless of your opinions and an entitled to the same rights as you are, am protected under the same law as you are and could care less whether you liked it or not!\" - would be a better approach than claiming, \"It's alright because animals do it.\"\n\n \n The point here isn't to say that it's alright because animals do it, but to refute the claim that it's unnatural. If half the animals out there can be gay, if our fellow mammals can be gay, that it can't be unnatural for people to be gay.", 
   {
    "unicode_changes_made": true
   }, 
   60266, 
   null, 
   1091141460.0
  ], 
  [
   60280, 
   null, 
   "Big Orn", 
   "The point here isn't to say that it's alright because animals do it, but to refute the claim that it's unnatural. If half the animals out there can be gay, if our fellow mammals can be gay, that it can't be unnatural for people to be gay.\n\n Still...\n \n So, do you consider humans animals?\n \n My point is that despite what animals do we are superior. If we claim that animalistic behavior is a barometer for our actions, then we can claim any behavior is alright, as long as it&#8217;s legal.\n \n Just put your foot down, stand your ground and be done with it. Don&#8217;t look for reasons or excuses from another, totally different form of life to justify it. That&#8217;s all I&#8217;m saying.\n \n Besides, claiming your ground and sticking to your ideals are more important than referencing them to someone or something else, I believe.", 
   {}, 
   60279, 
   null, 
   1091142180.0
  ], 
  [
   60285, 
   null, 
   "apathy", 
   "why would anyone consider humans to be anything but animals?\n we are certainly not plants or fungi \n and i seriously doubt that we are protists", 
   {}, 
   60280, 
   null, 
   1091143080.0
  ], 
  [
   60286, 
   null, 
   "Kronus", 
   "Still...\n So, do you consider humans animals?\n \n\n Yes, but that's not relevant here.\n \n \n\n Don't look for reasons or excuses from another, totally different form of life to justify it. That's all I'm saying.\n \n\n \n That's not what's happening here. No one is saying \"Animals do it, so it's ok that we do it.\" This argument's sole purpose is to shoot holes in an argument commonly used by homophobes. That's it. It's not support for the actions of gays, but a refutation of an anti-gay argument.", 
   {
    "unicode_changes_made": true
   }, 
   60280, 
   null, 
   1091143200.0
  ], 
  [
   60287, 
   null, 
   "Big Orn", 
   "Yes, but that's not relevant here.\n \n \n \n That's not what's happening here. No one is saying \"Animals do it, so it's ok that we do it.\" This argument's sole purpose is to shoot holes in an argument commonly used by homophobes. That's it. It's not support for the actions of gays, but a refutation of an anti-gay argument.\n\n Well, I read one link, the first one. The second I could not access. But, I guess I just took it that the thread was saying that homosexual behavior is natural because animals do it. Or, \"Why is it unnatural because animals are okay with it?\" Or in reference to those who say it isn't natural - here's the proof.\n \n Guess I was wrong.\n \n \n On edit: I did some reading in other threads and I can see why this one was started. I stepped right in the middle of it.\n \n Next time, Kronus, tell me (or at least provide a link) where the commotion is, will ya'?\n \n BTW - It is misleading for the unsuspecting, though.", 
   {}, 
   60286, 
   null, 
   1091144280.0
  ], 
  [
   60288, 
   null, 
   "Anastasia", 
   "All i could think of was this.. I know this is kinda silly but I could not get it out of my head now\n Bad Touch\n Blood Hound Gang\n Ha-Ha! Well now we call this the act of mating \n But there are several other very important differences \n Between human beings and animals that you should know about \n I'd appreciate your input \n \n You and me baby ain't nothin' but mammals \n So let's do it like they do on the Discovery Channel \n Do it again now \n You and me baby ain't nothin' but mammals \n So let's do it like they do on the Discovery Channel \n Gettin' horny now \n You and me baby ain't nothin' but mammals \n So let's do it like they do on the Discovery Channel \n Do it again now \n You and me baby ain't nothin' but mammals \n So let's do it like they do on the Discovery Channel \n Gettin' horny now... \n \n Sweat baby sweat baby sex is a Texas drought \n Me and you do the kind of stuff that only Prince would sing about \n So put your hands down my pants and I'll bet you'll feel nuts \n Yes I'm Siskel yes I'm Ebert and you're getting two thumbs up \n You've had enough of two-hand touch you want it rough you're out of bounds \n I want you smothered want you covered like my Waffle House hashbrowns \n Come quicker than FedEx never reach an apex like Coca-Cola stock you are inclined \n To make me rise an hour early just like Daylight Savings Time \n Do it now \n \n You and me baby ain't nothin' but mammals \n So let's do it like they do on the Discovery Channel \n Do it again now \n You and me baby ain't nothin' but mammals \n So let's do it like they do on the Discovery Channel \n Gettin' horny now \n \n Love the kind you clean up with a mop and bucket \n Like the lost catacombs of Egypt only God knows where we stuck it \n Hieroglyphics? Let me be Pacific I wanna be down in your South Seas \n But I got this notion that the motion of your ocean means \"Small Craft Advisory\" \n So if I capsize on your thighs high tide B-5 you sunk my battleship \n Please turn me on I'm Mister Coffee with an automatic drip \n So show me yours I'll show you mine \"Tool Time\" you'll Lovett just like Lyle \n And then we'll do it doggy style so we can both watch \"X-Files\" \n Do it now \n \n You and me baby ain't nothin' but mammals \n So let's do it like they do on the Discovery Channel \n Do it again now \n You and me baby ain't nothin' but mammals \n So let's do it like they do on the Discovery Channel \n Gettin' horny now \n \n You and me baby ain't nothin' but mammals \n So let's do it like they do on the Discovery Channel \n Do it again now \n You and me baby ain't nothin' but mammals \n So let's do it like they do on the Discovery Channel \n Do it now \n You and me baby ain't nothin' but mammals \n So let's do it like they do on the Discovery Channel \n Do it again now \n You and me baby ain't nothin' but mammals \n So let's do it like they do on the Discovery Channel \n Gettin' horny now", 
   {}, 
   60287, 
   null, 
   1091144940.0
  ], 
  [
   60289, 
   null, 
   "Jaaaman", 
   "The homosexual community seizes upon scanty evidence to justify something because they want it justified, not because they've examined the evidence carefully. They'll say animals practice homosexuality. How do they know that? Because they have seen male animals mounting other males, smelling each others rectums, or licking each others genital area. They will exclaim, \"See? It's obvious: homosexuality is natural.\" First, one must remember animals such as dogs also mount sofas, trees, and even your the leg. This is not homosexual behavior but this is auto-eroticism. Second, the only way one could show this behavior was homosexual is if one could demonstrate that the animal was desiring the male gender of the animal he was mounting. One can't conclude from the observed activity alone that any animal has homosexual desires. This is just another example of a hasty judgment. Third, animals either in playful antics, stressful conditions such as captivity, or in dominance behavior to assert hierarchy engage in perceived homosexual behavior. Male animals mount other males in a a very powerful way to communicate a higher position in the \"pecking order\". Fourth, every time you bring a female which is in heat into a situation, suddenly the male-male behavior is abandoned in favor of the female.\n Animals sometimes kill their young, roll in or eat excrement, have intercourse with numerous partners, and some engage in cannibalism. Man knows right from wrong and is not on the same level with the animal kingdom. If there were genuinely homosexual lions prowling the Serengheti or homosexual mountain gorillas gorging on bamboo, you can be sure we would have seen them in action on public television.", 
   {
    "unicode_changes_made": true
   }, 
   60288, 
   null, 
   1091145000.0
  ], 
  [
   60293, 
   null, 
   "Big Orn", 
   "All i could think of was this.. I know this is kinda silly but I could not get it out of my head now...\n\n Dang it! Now it's in mine...and I tend to keep those kind of things in there, too!\n What's my wife gonna think when I start trying to put music to the words...\n \n Thanks, Anastasia!!!! :xbanghead :p \n \n Also: Poor sinjin... emoticon_emb", 
   {}, 
   60288, 
   null, 
   1091145780.0
  ], 
  [
   60298, 
   null, 
   "joebrummer", 
   "The homosexual community seizes upon scanty evidence to justify something because they want it justified, not because they've examined the evidence carefully. They'll say animals practice homosexuality. How do they know that? Because they have seen male animals mounting other males, smelling each others rectums, or licking each others genital area. They will exclaim, \"See? It's obvious: homosexuality is natural.\" First, one must remember animals such as dogs also mount sofas, trees, and even your the leg. This is not homosexual behavior but this is auto-eroticism. Second, the only way one could show this behavior was homosexual is if one could demonstrate that the animal was desiring the male gender of the animal he was mounting. One can't conclude from the observed activity alone that any animal has homosexual desires. This is just another example of a hasty judgment. Third, animals either in playful antics, stressful conditions such as captivity, or in dominance behavior to assert hierarchy engage in perceived homosexual behavior. Male animals mount other males in a a very powerful way to communicate a higher position in the \"pecking order\". Fourth, every time you bring a female which is in heat into a situation, suddenly the male-male behavior is abandoned in favor of the female.\n Animals sometimes kill their young, roll in or eat excrement, have intercourse with numerous partners, and some engage in cannibalism. Man knows right from wrong and is not on the same level with the animal kingdom. If there were genuinely homosexual lions prowling the Serengheti or homosexual mountain gorillas gorging on bamboo, you can be sure we would have seen them in action on public television.\n\n \n \n \n \nFourth, every time you bring a female which is in heat into a situation, suddenly the male-male behavior is abandoned in favor of the female.\n\n \n Way off base, The second article clearly shows two male animals who are happy to be partnered and have no interest in a female. The feamle was brought into the picture and they wanted nothing to do with her.\n \n \n \n \nMan knows right from wrong and is not on the same level with the animal kingdom.\n\n \n Yes, but humans being animals still have instinct. Why do you eat when you get hungry? Instinct tells you to eat. Face it human are still animals with higher intelligence, but intelligence doesn't negate the fact we are still animals.\n \n \n \nSecond, the only way one could show this behavior was homosexual is if one could demonstrate that the animal was desiring the male gender of the animal he was mounting. One can't conclude from the observed activity alone that any animal has homosexual desires. \n\n \n Maybe you should re-read the articles before posting. What you have said is the opposite of what both the articles said. There are also hundreds more on the web about more gay animals in nature. AND the point of the thread was to negate those who say it is unnatural (as someone already pointed out).", 
   {
    "unicode_changes_made": true
   }, 
   60289, 
   null, 
   1091148240.0
  ], 
  [
   60301, 
   null, 
   "Anastasia", 
   " If there were genuinely homosexual lions prowling the Serengheti or homosexual mountain gorillas gorging on bamboo, you can be sure we would have seen them in action on public television.\n\n \nOK I have Gay Apes here... and no they are not just humping a stump\n This is an article by a well respected scientist...\n \n Here is the click\n\n I have posted this before\n \n emoticon_rolleyes", 
   {}, 
   60289, 
   null, 
   1091151000.0
  ], 
  [
   60302, 
   null, 
   "Anastasia", 
   "Dang it! Now it's in mine...and I tend to keep those kind of things in there, too!\n What's my wife gonna think when I start trying to put music to the words...\n \n Thanks, Anastasia!!!! :xbanghead :p \n \n Also: Poor sinjin... emoticon_emb\n\n Ron\n It really is a song... very funny one.\n I think you should hunt it out, I am sure you could find a mp3 somewhere...\n then you really wont be able to get it out of your head :)\n Poor sinjin????\n I dont think he is complaining???? emoticon_xangel emoticon_emb", 
   {}, 
   60293, 
   null, 
   1091152380.0
  ], 
  [
   60317, 
   null, 
   "Duo_Maxwell", 
   "Ah, the natural fallacy that anti-marriage users constantly invoke. \n \n Constantly disproven, constantly shown to be a fallacy, and constantly used to show the hypocracy and inconstancy of the antis. \n \n Man was not suppose to fly. Man was not suppose to wear corrective lenses. Man was not suppose to live in towers hundreds of feet high. Man was not suppose to drive at 200 mph. All of that is unnatural. Yet all of it is supported, and even cheered by humans. Cessarian sections aren't natural, yet it is a common and accepted practice. Jumping out of planes for a HALO jump isn't natural, yet it's a key military inseration tactic. Man was not suppose to live 500 feet below the ocean. Man was not suppose to live in the artic. Man was not suppose to spend months at sea. Man was not designed to live in Space. Heck, I can do this for days. Much of what we do today that is accepted is not natural. To say that banning homosexuality because it is \"unnatural\" is hypocritical if you support the thousands of actions we do everyday that are unnatural.", 
   {}, 
   60302, 
   null, 
   1091161860.0
  ], 
  [
   60329, 
   null, 
   "JakeCJB", 
   "It's amazing how humans have to work so hard to try to oppress something that according to the anti-gay nature itself does not allow.", 
   {}, 
   60317, 
   null, 
   1091177220.0
  ], 
  [
   60332, 
   null, 
   "mana'ia", 
   "Homosexuality has been documented in most animals and birds. So do tell me how homosexuality is unnatural? If humans are mammals or so I learned in biology 101, would we not fit into the same catagory as other animals? Here are some links to view to prove the point.\n \n \n http://www.rnw.nl/lifestyle/html/gayanimals000808.html\n \n my personal favorite....\n \n http://sfgate.com/cgi-bin/article.c...MNG3N4RAV41.DTL\n\n \n \n \n \"For example, young goats will jump on each other, mainly because the dominant adult male monopolises the females. So in one way or another they have to do something with their sexuality. But this is usually temporary, as soon as they become adults and manage to become the dominant male in the group, they will then mate with females exclusively.\"\n \n Power\n It may also, as in many of the primate species says Dr Frankenhuis, be simply part of their fight for a place in the hierarchy. \"When you introduce a new animal, the others will jump on it just to show who's boss. Adapted from our programme, Dutch Horizons.\n \n \n This is purely a power game. As soon as the hierarchy is established they will continue to be heterosexual.\" \n \n \n \n I think it's funny becasue it refers to the socialization and the environment and doesn't infer genetics.", 
   {}, 
   60258, 
   null, 
   1091188680.0
  ], 
  [
   60377, 
   null, 
   "Anastasia", 
   "Ron\n It really is a song... very funny one.\n I think you should hunt it out, I am sure you could find a mp3 somewhere...\n then you really wont be able to get it out of your head :)\n Poor sinjin????\n I dont think he is complaining???? emoticon_xangel emoticon_emb\n\n Big Orn\n After I dropped my youngest off at pre-school this morning that very song we talked about was playing on the radio, and I thought of you..\n I had a good laugh hearing it. I had not heard it for a long time, now for sure it is stuck in my head :)\n The witches must have had something to so with this\n emoticon_xangel", 
   {}, 
   60302, 
   null, 
   1091207760.0
  ], 
  [
   60384, 
   null, 
   "Ladywolf", 
   "I agree with you Duo!\n \n emoticon_xhoho \n \n But I'm still curious about why certain members of this board spend so much time and energy on this issue when they aren't even gay. I would expect some uproar from people but I've noticed a few people on here that seem to expend an awful lot of their time and energy when they aren't even part of the population that is fighting for their rights to marry a same sex partner.", 
   {}, 
   60317, 
   null, 
   1091210460.0
  ], 
  [
   60389, 
   null, 
   "joebrummer", 
   "I agree with you Duo!\n \n emoticon_xhoho \n \n But I'm still curious about why certain members of this board spend so much time and energy on this issue when they aren't even gay. I would expect some uproar from people but I've noticed a few people on here that seem to expend an awful lot of their time and energy when they aren't even part of the population that is fighting for their rights to marry a same sex partner.\n\n \n \n \n There is the one word answer to this question: Jesus\n \n \n Then the real reasons which could vary from closet cases to uncomfortable with their own sexuality to they really are religious phanatics who really believe god will have some wrath for the homosexuals in the world having rights.", 
   {}, 
   60384, 
   null, 
   1091211600.0
  ], 
  [
   60393, 
   null, 
   "JakeCJB", 
   "\"For example, young goats will jump on each other, mainly because the dominant adult male monopolises the females. So in one way or another they have to do something with their sexuality. But this is usually temporary, as soon as they become adults and manage to become the dominant male in the group, they will then mate with females exclusively.\"\n \n Power\n It may also, as in many of the primate species says Dr Frankenhuis, be simply part of their fight for a place in the hierarchy. \"When you introduce a new animal, the others will jump on it just to show who's boss. Adapted from our programme, Dutch Horizons.\n \n \n This is purely a power game. As soon as the hierarchy is established they will continue to be heterosexual.\" \n \n \n \n I think it's funny becasue it refers to the socialization and the environment and doesn't infer genetics.\n\n \n The \"deprived of heterosexuality\" argument. A variation on the pseudo-heterosexuality argument, this argument postulates that lower ranked males are deprived of the opportunity to mate and therefore turn to other males for sexual satisfaction. \n \n The problem with this argument is that in many species in which harem-guarding occurs, there is no difference between higher ranking males and lower ranking ones as to the frequency of their homosexual mountings. This has been demonstrated in musk oxen, American bison, and New Zealand sea lions among others. \n \n Among female homosexual pairs of Japanese macaques and Hanuman langurs engaging in homosexual behaviors, males approaching the pair may be threatened or even attacked. \n \n When homosexual bonding does occur in the absence of opposite sex pairs, members of such a pair often resist attempts to 'convert' them back into heterosexual relationships. Even when deprived of their bonded partner, white-fronted Amazon parrots will not revert, and long-eared hedgehogs have refused heterosexual partners for as long as two and a half years, much of their natural lifetime. In the case of Stellar's sea eagles and female barn owls, both housed without opposite sexed members of their species, homosexual pair bonds among females were strong enough that when inseminated, they coparented the chicks that resulted. \n \n Homosexual bonds can be tight. Among male rhesus macaques, crab-eating macaques, bottlenosed dolphins, cheetahs and black-headed gulls with homosexual bonded partners, the members of the pair exhibited considerable distress at being separated from their partners. In all cases, the individuals ignored opposite sex partners offered them, and showed considerable joy and exhuberance at the reintroduction of their partners.\n \n http://www.bidstrup.com/sodomy.htm\n \n http://www.salon.com/it/feature/1999/03/cov_15featurea.html", 
   {}, 
   60332, 
   null, 
   1091215620.0
  ], 
  [
   60475, 
   null, 
   "Duo_Maxwell", 
   "Ladywolf: How much do you want to bet that mana'ia will competely ignore the refuation of the natural fallacy?", 
   {}, 
   60258, 
   null, 
   1091268960.0
  ], 
  [
   60659, 
   null, 
   "Big Orn", 
   "Ron\n It really is a song... very funny one.\n I think you should hunt it out, I am sure you could find a mp3 somewhere...\n then you really wont be able to get it out of your head :)\n\n And that&#8217;s what I&#8217;m afraid of!!!!\n \nPoor sinjin????\n I dont think he is complaining???? emoticon_xangel emoticon_emb\n\n I was trying to be funny.\n \n Shoot! I never could tell a joke&#8230;\n \nBig Orn\n After I dropped my youngest off at pre-school this morning that very song we talked about was playing on the radio, and I thought of you..\n I had a good laugh hearing it. I had not heard it for a long time, now for sure it is stuck in my head :)\n The witches must have had something to so with this\n emoticon_xangel\n\n LOL! Or&#8230;the devil. :)\n \n I can&#8217;t believe little Sinjin is already in pre-school! \n \n Wish I had power brakes to stop time&#8230;sometimes.", 
   {}, 
   60475, 
   null, 
   1091461980.0
  ], 
  [
   60662, 
   null, 
   "Ladywolf", 
   "Ladywolf: How much do you want to bet that mana'ia will competely ignore the refuation of the natural fallacy?\n\n \n It's pretty much a given unless he tries once again to compare us to animals in some very demeaning ways.", 
   {
    "post_info": {
     "post_title": "Homosexuality in Nature"
    }
   }, 
   60475, 
   null, 
   1091464440.0
  ], 
  [
   60670, 
   null, 
   "Anastasia", 
   "\n \n I was trying to be funny.\n\n I know it was a joke :) I was trying to be an angel, must be my witch side coming through.... :p \n \n \nI can't believe little Sinjin is already in pre-school! Wish I had power brakes to stop time...sometimes.\n\n You know, it really is amazing how fast they grow, I will put some pics up on my webshots account and send you the link, I am not saying this just because he is my kid, but he really is the cutest baby ever!!!!! Something about redheads :)", 
   {
    "unicode_changes_made": true
   }, 
   60659, 
   null, 
   1091467620.0
  ], 
  [
   60671, 
   null, 
   "Anastasia", 
   "It's pretty much a given unless he tries once again to compare us to animals in some very demeaning ways.\n\n Oh Cmon ladywolf we all know that all gays have sex with animals... get with the program, you must be in denial\n ;)", 
   {}, 
   60662, 
   null, 
   1091467680.0
  ], 
  [
   60676, 
   null, 
   "Ladywolf", 
   "Oh Cmon ladywolf we all know that all gays have sex with animals... get with the program, you must be in denial\n ;)\n\n \n Well, okay, there was that one time up in Alaska and there was nothing but carabu everywhere...got bored, and hey, well... emoticon_rolleyes \n \n But then along came an Alaskan ranger and told me I had to stop what I was doing. Apparently, that carabu had already been spoken for! Baw haw haw haw ha ha...bahhhhhhhhhhhh", 
   {}, 
   60671, 
   null, 
   1091469420.0
  ], 
  [
   60993, 
   null, 
   "mana'ia", 
   "The \"deprived of heterosexuality\" argument. A variation on the pseudo-heterosexuality argument, this argument postulates that lower ranked males are deprived of the opportunity to mate and therefore turn to other males for sexual satisfaction. \n \n The problem with this argument is that in many species in which harem-guarding occurs, there is no difference between higher ranking males and lower ranking ones as to the frequency of their homosexual mountings. This has been demonstrated in musk oxen, American bison, and New Zealand sea lions among others. \n \n Among female homosexual pairs of Japanese macaques and Hanuman langurs engaging in homosexual behaviors, males approaching the pair may be threatened or even attacked. \n \n When homosexual bonding does occur in the absence of opposite sex pairs, members of such a pair often resist attempts to 'convert' them back into heterosexual relationships. Even when deprived of their bonded partner, white-fronted Amazon parrots will not revert, and long-eared hedgehogs have refused heterosexual partners for as long as two and a half years, much of their natural lifetime. In the case of Stellar's sea eagles and female barn owls, both housed without opposite sexed members of their species, homosexual pair bonds among females were strong enough that when inseminated, they coparented the chicks that resulted. \n \n Homosexual bonds can be tight. Among male rhesus macaques, crab-eating macaques, bottlenosed dolphins, cheetahs and black-headed gulls with homosexual bonded partners, the members of the pair exhibited considerable distress at being separated from their partners. In all cases, the individuals ignored opposite sex partners offered them, and showed considerable joy and exhuberance at the reintroduction of their partners.\n \n http://www.bidstrup.com/sodomy.htm\n \n http://www.salon.com/it/feature/1999/03/cov_15featurea.html\n\n \n You're first link was an esay by an unqualified blogger making inference on abook that makes inference on data. One blogger's inference on another person's inferences is hardly proof.\n \n Also your second link shows that animals are not monolithic. If that is true than everything science says about animals is fales and then they can't rely on any other scientific data.\n \n Animals are considered monolithic. If they stray from that they have a disorder. They're DNA is so similar that it is usually impossible to identify siblings individually.", 
   {}, 
   60393, 
   null, 
   1091665860.0
  ], 
  [
   60994, 
   null, 
   "mana'ia", 
   "Ladywolf: How much do you want to bet that mana'ia will competely ignore the refuation of the natural fallacy?\n\n What natural fallacy?", 
   {}, 
   60475, 
   null, 
   1091665920.0
  ], 
  [
   61009, 
   null, 
   "JakeCJB", 
   "You're first link was an esay by an unqualified blogger making inference on abook that makes inference on data. One blogger's inference on another person's inferences is hardly proof.\n\n \n Neither did you give proof.", 
   {}, 
   60993, 
   null, 
   1091668620.0
  ], 
  [
   61014, 
   null, 
   "JakeCJB", 
   "It appears most animal same-sex activity occurs with mounting...\n \n Affectionate activity often leads to, or is inseparable from, overtly sexual behavior--defined here as any contact between two or more animals involving genital stimulation. Stumptail and Crab-eating Macaques, for example, kiss their same-sex partners during sexual mounting. In fact, mounting is the most common type of sexual behavior found in homosexual contexts: one animal climbs on top of the other in a position similar to heterosexual intercourse, usually from behind in a front-to-back position (that is, one animal mounted on the back of the other). More than 95 percent of mammal and bird species use this position, for both male and female homosexual interactions.\n http://print.google.com/print/doc?isbn=0312192398\n \n Even if it is for power with some, it is still natural. \n \n If animals are monolithic, I suppose we have a disorder for our monogamous pairings which we strayed into. Bi-sexuality is the norm in bonobos, which are closely related to us. We are also the only species which adapts to the environment by using tools we fashion with our own hands. How unnatural of us.", 
   {}, 
   61009, 
   null, 
   1091671320.0
  ], 
  [
   61023, 
   null, 
   "joebrummer", 
   "It appears most animal same-sex activity occurs with mounting...\n \n Affectionate activity often leads to, or is inseparable from, overtly sexual behavior--defined here as any contact between two or more animals involving genital stimulation. Stumptail and Crab-eating Macaques, for example, kiss their same-sex partners during sexual mounting. In fact, mounting is the most common type of sexual behavior found in homosexual contexts: one animal climbs on top of the other in a position similar to heterosexual intercourse, usually from behind in a front-to-back position (that is, one animal mounted on the back of the other). More than 95 percent of mammal and bird species use this position, for both male and female homosexual interactions.\n http://print.google.com/print/doc?isbn=0312192398\n \n Even if it is for power with some, it is still natural. \n \n If animals are monolithic, I suppose we have a disorder for our monogamous pairings which we strayed into. Bi-sexuality is the norm in bonobos, which are closely related to us. We are also the only species which adapts to the environment by using tools we fashion with our own hands. How unnatural of us.\n\n \n \n \n GO JAKE! An award wiiing post!", 
   {}, 
   61014, 
   null, 
   1091677500.0
  ], 
  [
   61155, 
   null, 
   "Duo_Maxwell", 
   "What natural fallacy?\n\n \n That since homosexuality isn't natural (there is hisotrical disagreement as well as biological one as well) that we should ban it. This ignores the fact that virtually everything we do in today's world is unnatural compared to our very early lifestyles, yet the antis don't say a word about that. If we are to ban gays from getting married because it is unnatural, we should tear down all skyscrappers as well, stop all airplanes, stop all artic travel and research, and stop all things that are unnatural.", 
   {}, 
   60994, 
   null, 
   1091749800.0
  ], 
  [
   61166, 
   null, 
   "mana'ia", 
   "That since homosexuality isn't natural (there is hisotrical disagreement as well as biological one as well) that we should ban it. This ignores the fact that virtually everything we do in today's world is unnatural compared to our very early lifestyles, yet the antis don't say a word about that. If we are to ban gays from getting married because it is unnatural, we should tear down all skyscrappers as well, stop all airplanes, stop all artic travel and research, and stop all things that are unnatural.\n\n This is the same reasoning to thta Phunting used so liong ago. There is unnatural and technology. Wht is unnatural about being efficient in living space wiht skyscapers? What is unnatural about the need to travel as we do in airplanes? What is unnatural about the need to for knowledge as in the artic research? They're technological advances but not unnatural.", 
   {}, 
   61155, 
   null, 
   1091756340.0
  ], 
  [
   61168, 
   null, 
   "mana'ia", 
   "Neither did you give proof.\n\n That animals are naturally heterosexual is a rebuttable assumption according to science.", 
   {}, 
   61009, 
   null, 
   1091756760.0
  ], 
  [
   61169, 
   null, 
   "mana'ia", 
   "It appears most animal same-sex activity occurs with mounting...\n \n Affectionate activity often leads to, or is inseparable from, overtly sexual behavior--defined here as any contact between two or more animals involving genital stimulation. Stumptail and Crab-eating Macaques, for example, kiss their same-sex partners during sexual mounting. In fact, mounting is the most common type of sexual behavior found in homosexual contexts: one animal climbs on top of the other in a position similar to heterosexual intercourse, usually from behind in a front-to-back position (that is, one animal mounted on the back of the other). More than 95 percent of mammal and bird species use this position, for both male and female homosexual interactions.\n http://print.google.com/print/doc?isbn=0312192398\n \n Even if it is for power with some, it is still natural. \n \n If animals are monolithic, I suppose we have a disorder for our monogamous pairings which we strayed into. Bi-sexuality is the norm in bonobos, which are closely related to us. We are also the only species which adapts to the environment by using tools we fashion with our own hands. How unnatural of us.\n\n \n Almost all animals moutn from behind. It is the most natural way of doing it. Can you imagine animals such as horse, cows, dogs, trying to do it as humans. That isn't proof of anything.\n \n Now the bonobos are very sexually active. They are heterosexual but enjoy any kind of stimulation which is normal. Yet they I couldn't find where they engaged in sex other than oral sex with each other. Also it is only with males and probably because it is difficult to engage the women. Many speculate they do it because it is reciprocal among each other as femals tend to not enjoy it as often. So they cite social reasons again instead of genetic reasons.\n \n \n \n This is for your animals use of tools.\n \n Benjamin Beck(1980) offers a fascinating story about the ingenuity of a crow which lived in his laboratory. The crow was fed dried mash, which needs to be moistened before the crow can eat it. However, the keepers occasionally forgot to do so. The crow found a solution to his keepers' absent-mindedness; he used a cup to get water to moisten the mash himself! The cup had been given to the crow as a toy but he used it to collect water from a trough on the other side of the room.\n \n The anecdote about the crow offers an example of tool use in animals. The study of tool use in animals illuminates similarities between humans and animals in terms of problem solving skills, dexterity, and intelligence. Does the ability of animals to use tools signify an intelligence level close to that of humans? Many people define intelligence as the ability to adapt to your environment, or make your environment serve your purposes. Is animal tool use symbolic of that definition of intelligence? Tool use in primates is particularly interesting because it sheds light on the abilities and lifestyles of early humans. \n \n Two characteristics of an environment are necessary to support the evolution of tool behaviors in animals. First of all, the use of tools must be advantageous to the animal. The examples which follow illustrate the advantages of tool use for the Egyptian vultures, chimpanzees, hooded monkeys, woodpecker finches, and green herons. Secondly, animal tool use is constrained by the availability of objects in the environment which make feasible tools. Without access to stones, poles, pieces of wood, and cactus spines, these animals would not have been able to acquire the uses of tools which they have.\n \n \n \n http://www.pigeon.psy.tufts.edu/psych26/tools.htm", 
   {}, 
   61014, 
   null, 
   1091757300.0
  ], 
  [
   61175, 
   null, 
   "joebrummer", 
   "It appears that all of those who want to discount this idea of gay animals have steered away from the two gay penguins.\n \n http://www.jrn.columbia.edu/studentwork/cns/2002-06-10/591.asp\n \n \n They were offered a female penguin and had no interest. This is obviously more than just two confused penguins. They appear to be gay. What do you nay-sayes say about his.\n \n \n And one added note:\n Do you ya think the two gay penguins recruit other penguins to be gay?\n Do you think they molest the other younger penguins?\n Is it written in the bible that this is a sin too?\n Do ya think this increases there chances of being avid penguin drug users?", 
   {}, 
   60317, 
   null, 
   1091761980.0
  ], 
  [
   61176, 
   null, 
   "joebrummer", 
   "Didn't realize there were two couples at separate zoo's the first I posted were Cass and Wendle then we have Roy and Silo\n \n http://www.livejournal.com/users/a2gsg/35637.html?thread=38965\n \n \n Explain this!", 
   {}, 
   61175, 
   null, 
   1091762400.0
  ], 
  [
   61180, 
   null, 
   "JakeCJB", 
   "Almost all animals moutn from behind. It is the most natural way of doing it. Can you imagine animals such as horse, cows, dogs, trying to do it as humans. That isn't proof of anything.\n\n \n Exactly. Nor was your evidence proof of anything.\n \n \nNow the bonobos are very sexually active. They are heterosexual but enjoy any kind of stimulation which is normal. Yet they I couldn't find where they engaged in sex other than oral sex with each other. Also it is only with males and probably because it is difficult to engage the women. Many speculate they do it because it is reciprocal among each other as femals tend to not enjoy it as often. So they cite social reasons again instead of genetic reasons.\n\n \n \"There has been a certain cultural shyness about admitting it,\" said Frans de Waal, whose 1997 book, \"Bonobo: The Forgotten Ape\" (University of California Press), unleashed a torrent of discussion about animal sexuality. \n \n Bonobos, apes closely related to humans, are wildly energetic sexually. Studies show that whether observed in the wild or in captivity, nearly all are bisexual and nearly half their sexual interactions are with the same sex. Females have been observed to engage in homosexual activity almost hourly. \n \n Before his own book, \"American scientists who investigated bonobos never discussed sex at all,\" said de Waal, director of the Living Links Center of the Yerkes Primate Center at Emory University in Atlanta. \"Or they sometimes would show two females having sex together, and would say, 'The females are very affectionate.' \" \n \n http://sfgate.com/cgi-bin/article.cgi?f=/c/a/2004/02/07/MNG3N4RAV41.DTL\n \n \nThis is for your animals use of tools.\n \n Benjamin Beck(1980) offers a fascinating story about the ingenuity of a crow which lived in his laboratory. The crow was fed dried mash, which needs to be moistened before the crow can eat it. However, the keepers occasionally forgot to do so. The crow found a solution to his keepers' absent-mindedness; he used a cup to get water to moisten the mash himself! The cup had been given to the crow as a toy but he used it to collect water from a trough on the other side of the room.\n \n The anecdote about the crow offers an example of tool use in animals. The study of tool use in animals illuminates similarities between humans and animals in terms of problem solving skills, dexterity, and intelligence. Does the ability of animals to use tools signify an intelligence level close to that of humans? Many people define intelligence as the ability to adapt to your environment, or make your environment serve your purposes. Is animal tool use symbolic of that definition of intelligence? Tool use in primates is particularly interesting because it sheds light on the abilities and lifestyles of early humans. \n \n Two characteristics of an environment are necessary to support the evolution of tool behaviors in animals. First of all, the use of tools must be advantageous to the animal. The examples which follow illustrate the advantages of tool use for the Egyptian vultures, chimpanzees, hooded monkeys, woodpecker finches, and green herons. Secondly, animal tool use is constrained by the availability of objects in the environment which make feasible tools. Without access to stones, poles, pieces of wood, and cactus spines, these animals would not have been able to acquire the uses of tools which they have.\n \n \n \n http://www.pigeon.psy.tufts.edu/psych26/tools.htm\n\n \n This is obviously not what I was referring to when I as talking about humans fashioning and using their own tools.", 
   {}, 
   61169, 
   null, 
   1091764080.0
  ], 
  [
   61184, 
   null, 
   "JakeCJB", 
   "This is the same reasoning to thta Phunting used so liong ago. There is unnatural and technology. Wht is unnatural about being efficient in living space wiht skyscapers? What is unnatural about the need to travel as we do in airplanes? What is unnatural about the need to for knowledge as in the artic research? They're technological advances but not unnatural.\n\n \n It doesn't happen among animals in nature, in that way. Using your logic, a lesbian couple who uses artificial insemination could also not be described as unnatural, nor could a gay male couple who use a surogate be described as unnatural. Being gay or lesbian itself could not be described as unnatural. As I've said before, humans cannot violate something that is a law of nature and a law of nature doesn't require humans to enforce it. So if being gay violated that law, we wouldn't need to discriminate against gay people to try to enforce this alleged law of nature.", 
   {}, 
   61166, 
   null, 
   1091764560.0
  ], 
  [
   61195, 
   null, 
   "Duo_Maxwell", 
   "This is the same reasoning to thta Phunting used so liong ago. There is unnatural and technology. Wht is unnatural about being efficient in living space wiht skyscapers? What is unnatural about the need to travel as we do in airplanes? What is unnatural about the need to for knowledge as in the artic research? They're technological advances but not unnatural.\n\n \n A number of reasons why it is unnatural. First the human body is designed for a relative few number of climates and altitude ranges. Skyscrappers are not one of them. Anatonmically we are not designed to live hundreds of feet in a sheer tower, if we WERE, we'd be designed with lungs that could properly function at those heights, we'd be designed with grasping claws and other climbing gear, we'd be designed by better vision to combat the distortions of light at higher attitudes. None of that exists. We are not designed to live in skyscrappers. \n \n Moving on. \n \n Same can apply for airplanes. The human body is not designed to travel across large amounts of differing time zones. Nor are we designed to live in attitudes of 30,000 feet. Nor are we designed to travel that quickly. Nor are we designed to eat that sort of junk they feed us. \n \n Moving on. \n \n We are definitely not designed to live in the artic. The human body produces what they call a insulation gap between the skin and the air surrounding it. The artic regions are known for massive wind chill which destroys this insulation and plunges the human body temperature. Notice we don't have fur like a polar bear. Notice we don't have fat like a walrus. Notice we don't have feathers like a pengiun. Each of these animals was evolutionarly designed to live in cold regions. We are not. While we can adapt, our natural state is to stay away from these hostile regions. \n \n So, if you have the guts to come back aganist a anatomically based argument, please do. But I doubt you will be able to. \n \n You've also ignored many of the other examples to pick out a few you'd believe I couldn't argue. Like usual, you were sadly mistaken.", 
   {}, 
   61166, 
   null, 
   1091768040.0
  ], 
  [
   61289, 
   null, 
   "mana'ia", 
   "A number of reasons why it is unnatural. First the human body is designed for a relative few number of climates and altitude ranges. Skyscrappers are not one of them. Anatonmically we are not designed to live hundreds of feet in a sheer tower, if we WERE, we'd be designed with lungs that could properly function at those heights, we'd be designed with grasping claws and other climbing gear, we'd be designed by better vision to combat the distortions of light at higher attitudes. None of that exists. We are not designed to live in skyscrappers. \n \n First off not all human bodies have the same tolerance. Many have a higher tolerance of climates and altitudes than others. The human body is made designed to adapt. There are people that live thousand of feet above sea level. Some in a two story home in Denver is thousands of feet higher than someone in a skyscraper in NY or LA. The lungs once they adjust at high altitude function well. In fact in the 1972 Mexico Olympics it was the highest altitude ever for an Olympics. There wre so many world records set that year taht remained. I beleive the long and high jump still stand from that timne period. Showing that men can actually perform optimally at higher altitudes.\n \n \n \nMoving on. \n \n Same can apply for airplanes. The human body is not designed to travel across large amounts of differing time zones. Nor are we designed to live in attitudes of 30,000 feet. Nor are we designed to travel that quickly. Nor are we designed to eat that sort of junk they feed us. \n \n We are not designed to live in 30,00 feet above sea level. However the fact that we were blessed with the intelligence is what helps us to adapt to the natural need to transport oursleves. We pressurise so that our bodies can accommodate. It is a natural need to transport ourselves the fact that we have a technological advance does not make it unnatural.\n \n \nMoving on. \n \n We are definitely not designed to live in the artic. The human body produces what they call a insulation gap between the skin and the air surrounding it. The artic regions are known for massive wind chill which destroys this insulation and plunges the human body temperature. Notice we don't have fur like a polar bear. Notice we don't have fat like a walrus. Notice we don't have feathers like a pengiun. Each of these animals was evolutionarly designed to live in cold regions. We are not. While we can adapt, our natural state is to stay away from these hostile regions. \n \n If you want to get technical with what we were given then you must include our intelligence. Many animals liek the hermit crab adopt other animls shells for protection. Many animls build nests and other such things to help them dapat. Bears seek shelter in caves. We do likewise by using animal fur and other necessity to help us live in conditions that even though they aren't ideal conditions are more than bearable. Anatomically our body does adjust and use others skills that other animls use to help us survive. \n \n \n \nSo, if you have the guts to come back aganist a anatomically based argument, please do. But I doubt you will be able to. \n \n You've also ignored many of the other examples to pick out a few you'd believe I couldn't argue. Like usual, you were sadly mistaken.\n\n Since you are bringing up the natural argument. Our body anatomically was not designed for airplane travel but it does not make it unnatural to do it. It is a natural desire to tranport ourselves hence the invetion of the wheel and using horses. Anatomically we were not designed for anal, fisting, or other common gay practices. So if we are to discuss anatomically then obviously homosexuality is definitely excluded.", 
   {}, 
   61195, 
   null, 
   1091828520.0
  ], 
  [
   61308, 
   null, 
   "JakeCJB", 
   "Anatomically we were not designed for anal, fisting, or other common gay practices. So if we are to discuss anatomically then obviously homosexuality is definitely excluded.\n\n \n The anus is very rich in sensitive nerve endings like other sex organs. Having the prostate gland stimulated is pleasurable for men. Also, the anus contracts during orgasm like other sexual organs....\n \n Anal sex is pleasurable both for the insertive partner and the receptive partner. The anus contains many of the same kinds of nerves as the penis or clitoris, and stimulating the anus can produce sexual pleasure. \n \n The presence of the prostate gland near the rectal wall is generally seen as a source of pleasure for men who enjoy receiving anal sex. For women, pleasure derived from anal intercourse can be related to the rectum sharing a wall with the vagina (the sexual nerves are actually closer on that side, making the sensation different and sometimes actually stronger) as well as the nerve endings at the opening of the anus and the G-spot.\n \n http://www.wordiq.com/definition/Anal_sex", 
   {}, 
   61289, 
   null, 
   1091831760.0
  ], 
  [
   61343, 
   null, 
   "Jaaaman", 
   "I can't believe we are discussing the pleasures of anal sex. That is definately a \"10\" on the yuck factor. emoticon_ic", 
   {}, 
   61308, 
   null, 
   1091854380.0
  ], 
  [
   61351, 
   null, 
   "Duo_Maxwell", 
   "Another sorry attempt by mana'ia to prove anything....sign, it shouldn't take too long to disprove this attempt at a half baked argument. \n \n [quote]First off not all human bodies have the same tolerance.[quote]\n \n No human is able to withstain the pressures at 30,000 feet above nor the pressure at 30,000 below. Therefore, it is not natural to live or even be at either. \n \n \nMany have a higher tolerance of climates and altitudes than others. The human body is made designed to adapt. There are people that live thousand of feet above sea level.\n\n \n But there is no one who can withstain the pressures of unprotected jet stream travel, nor deep sea habitation. \n \n \nSome in a two story home in Denver is thousands of feet higher than someone in a skyscraper in NY or LA.\n\n \n If it was natural for us to live there, why aren't we found in similar instances? Aka, sheer rock towers rising from the ground, oh wait, there isn't, nor are we given the genetic ability to climb these without unnatural adaptations. \n \n \nThe lungs once they adjust at high altitude function well. In fact in the 1972 Mexico Olympics it was the highest altitude ever for an Olympics.\n\n \n Irrelevant. Explain how that is equilvant to 30,000 feet. \n \n \nShowing that men can actually perform optimally at higher altitudes.\n\n \n But we are not designed to live in skyscrappers. We were not given the ability to climb similar structures, nor were we given the ability to sustain oursleves in similar conditions, nor were we given the ability to rapidly change altitudes without problems. All of that is unnatural, yet it is common. This is the first of your three utter failures at proving anything. \n \n \nWe are not designed to live in 30,00 feet above sea level.\n\n \n Therefore it is unnatural. emoticon_xgood \n \n \nHowever the fact that we were blessed with the intelligence is what helps us to adapt to the natural need to transport oursleves. We pressurise so that our bodies can accommodate. It is a natural need to transport ourselves the fact that we have a technological advance does not make it unnatural\n\n \n Just like we are given the intelligence to explore our bodies in unorthodox ways. How do you like them apples? I can use that argument aganist you just in a far more nerve striking way. Using that logic, you can say anything is natural because we have the ability to do so. Is genetic engineering natural because we have the intelligence to do it? You just opened a huge can of worms that I won't let to put back into the can. Human cloning is therefore natural under your logic as well as everything else we can do or even imagine. People have the intelligence and technology to kidnap and rape little children, is that natural? It would be best of you to stop using that point, it will only burn you in the end. This is your number 2 failure, prepare for #3. \n \n \nIf you want to get technical with what we were given then you must include our intelligence. Many animals liek the hermit crab adopt other animls shells for protection. Many animls build nests and other such things to help them dapat. Bears seek shelter in caves. We do likewise by using animal fur and other necessity to help us live in conditions that even though they aren't ideal conditions are more than bearable. Anatomically our body does adjust and use others skills that other animls use to help us survive.\n\n \n I love how you just gave me a tactical nuclear weapon to use aganist your pea shooter, it is almost makes me feel sorry for you...almost. Under your logic, killing people, boiling their bodies down into the paste, then pressurzing in into a highly efficent fuel to keep us warm is therefore natural because we are using other's to adapt and help us survive. HOW DO YOU LIKE THEM APPLES? If I were you, i'd quickly withdraw the intelligence point before I start the real pounding. \n \n \nSince you are bringing up the natural argument. Our body anatomically was not designed for airplane travel but it does not make it unnatural to do it.\n\n \n Our body anatomically was not designed for anal sex, but it does not make it unnatural to do it. I can't believe you just gave me that to use aganist you. emoticon_xhoho \n \n \nIt is a natural desire to tranport ourselves hence the invetion of the wheel and using horses.\n\n \n Then it is natural to transport ourselves using human slaves pulling a chariot. emoticon_xgood \n \n \nAnatomically we were not designed for anal, fisting, or other common gay practices. So if we are to discuss anatomically then obviously homosexuality is definitely excluded.\n\n \n But you just said that while we are not designed for it, it does not make it unnatural. \n \n \nOur body anatomically was not designed for airplane travel but it does not make it unnatural to do it.\n\n \n Replace airplane travel with anal, fisting, or other common gay practices. \n \n You have failed more then 3 times, as well as giving me numerous weapons I wasn't going to use against you. I'd LOVE to see you come back from this.", 
   {}, 
   61343, 
   null, 
   1091873340.0
  ], 
  [
   61427, 
   null, 
   "Jaaaman", 
   "A recurring theme with pro-gay supporters is that gay marriage is a \"right.\" Saying so does not make it so. \n If it is evil to murder someone, then every person - except a murderer - has a right to live. If rights are the flip side of the universal moral law, then they cannot be the flip side of a practice which is contrary to the universal moral law. If sodomy and \"gay marriage\" are against nature and against the universal moral law, they cannot be a right.\n Self-actualization cannot be achieved by doing something that is against nature - that is contrary to human design.", 
   {
    "unicode_changes_made": true
   }, 
   61351, 
   null, 
   1091976360.0
  ], 
  [
   61431, 
   null, 
   "CCR1994", 
   "If sodomy and \"gay marriage\" are against nature and against the universal moral law, they cannot be a right.\n\n \n Your statement is correct as far as it goes. This would be considered a big \"if\". How can we be so sure that sodomy and same sex marriage are forbidden by moral law? \n \n \nSelf-actualization cannot be achieved by doing something that is against nature - that is contrary to human design. \n\n \n What of the possibility that being gay is natural for those who are? I could be convinced that being gay is biologically contrary to the purpose of sex since the sex organs were designed for procreation. But isn't it a stretch to suggest that homosexuality is not natural? The old question comes up: How is that certain people are attracted to the same sex as opposed to the opposite one? Nature dictates this. It is hardly a choice. It would be contrary to nature for gays to try to be straight just as it would contrary to nature for straights to try to be gay. In short, whatever you are you are.", 
   {
    "unicode_changes_made": true
   }, 
   61427, 
   null, 
   1091981460.0
  ], 
  [
   61454, 
   null, 
   "Duo_Maxwell", 
   "A recurring theme with pro-gay supporters is that gay marriage is a \"right.\" Saying so does not make it so.\n\n \n Human rights are dubious in origin themselves. \n \n \nIf it is evil to murder someone, then every person - except a murderer - has a right to live.\n\n \n How do you know murder is evil? From a evolutionary standpoint, it makes perfect sense to remove competition for land, mates, and other resources, so there murder is NOT evil, but beneficial to propagating one's genes. Let me guess, you didn't even stop to consider that did you? \n \n \nIf rights are the flip side of the universal moral law, then they cannot be the flip side of a practice which is contrary to the universal moral law. If sodomy and \"gay marriage\" are against nature and against the universal moral law, they cannot be a right.\n\n \n Moral and universeral moral law changes with each Era. Sacrificing innocent people was just and common in Acient cultures, but now it is morally henious. Having a harem of teenage brides was common and moral in the past, but now it is morally henious. Kidnapping was a normal form of expanding one's tribe, now it is a crime. Moral and univeral moral law change with each era. To declare that it is right forever is ignorant. \n \n \n\n Self-actualization cannot be achieved by doing something that is against nature - that is contrary to human design.\n\n \n But nothing is aganist nature according to mana'ia's logic. If we have the intelligence to do something, it is therefore not unnatural anymore. \n \n Be careful about what you say in your arguments, it might just come back to bite you.", 
   {
    "unicode_changes_made": true
   }, 
   61431, 
   null, 
   1092005220.0
  ], 
  [
   61469, 
   null, 
   "CCR1994", 
   "How do you know murder is evil? From a evolutionary standpoint, it makes perfect sense to remove competition for land, mates, and other resources, so there murder is NOT evil, but beneficial to propagating one's genes. Let me guess, you didn't even stop to consider that did you? \n\n \n I have to admit, I never considered this. I'm not sure that I want to.", 
   {}, 
   61454, 
   null, 
   1092009360.0
  ], 
  [
   61496, 
   null, 
   "Duo_Maxwell", 
   "CCR1994: I don't like it any more then you do, but the anti-s consistancy think they are morally right without even considering history nor science.", 
   {}, 
   61469, 
   null, 
   1092030720.0
  ], 
  [
   61572, 
   null, 
   "CCR1994", 
   "CCR1994: I don't like it any more then you do, but the anti-s consistancy think they are morally right without even considering history nor science.\n\n \n A recap is in order. First it is suggested that murder is evil. You object, saying that the practice was necessary and fairly common in history and was justified by circumstances. I suggested that consideration of the possibility that murder is not evil was not an option. You sympathize but not without reservations. At some point in history, it must have been decided that murder should be outlawed and it raises the question: Were objections to murder raised because somebody decided that murder should become wrong or because it already was?", 
   {}, 
   61496, 
   null, 
   1092096720.0
  ], 
  [
   61575, 
   null, 
   "Duo_Maxwell", 
   "At some point in history, it must have been decided that murder should be outlawed and it raises the question: Were objections to murder raised because somebody decided that murder should become wrong or because it already was?\n\n \n Well, I'll freely admit it, I don't know for sure. \n \n Let's look at what we know: From a evolutionary stand point, murder is justified and usually helpful, and what is beneficial cannot be evil. We also know that muder, like many other \"crimes\" were not considered crimes in the past, that morality has changed with each culture and which each passing era. So in essence, what is wrong is relative according to the timeline. Also, let's consider the religious point. Thou shall not kill is the typical cliche, but it is mentioned that a adulterous woman should be stoned to death, a form of murder, and that God destroyed and killed (murder again) virtually all of his creations, as well as dubiously two cities full of people. So on one hand, muder is wrong, but on the other hand, murder is justified in Christanity's eyes and even Godsend. \n \n That doesn't mean that the other option, that someone decided it was wrong, is in fact the correct notion, but it does seem so.", 
   {}, 
   61572, 
   null, 
   1092097860.0
  ], 
  [
   61577, 
   null, 
   "mana'ia", 
   "Another sorry attempt by mana'ia to prove anything....sign, it shouldn't take too long to disprove this attempt at a half baked argument. First off not all human bodies have the same tolerance.\n \n Duo I feel sorry for you. You're arguments even though for youre comprehension seem logical are not and I'm about to show you how. You proved that you had no credibility to begin with.\n \n \n \n \nNo human is able to withstain the pressures at 30,000 feet above nor the pressure at 30,000 below. Therefore, it is not natural to live or even be at either. \n \n No one lives are travels to 30,000 ft below sea level. Also we can wihtstaion the pressure at 30,000 ft above sea level. It's the lack of oxygen that makes it impractical to remain. We pressurise planes becasue the jet travel; is too fast for most people to adjust. That is why jet pilots only have helmets.\n \n \n \nBut there is no one who can withstain the pressures of unprotected jet stream travel, nor deep sea habitation. \n \n The travel of in the jet stream is only for efficient purposes. We can travel at any altitude but it becomes efficient to travel at higher. Being efficient is what is natural not the need to protect us from the elements. No one deep sea travels except submariens but they only travel so far. submariens are for military puposes only. So that really isn't relevant wht the military does. Tehy do unnatural things to gain advantage over enemies who aren't quite as adapted.\n \n \n \nIf it was natural for us to live there, why aren't we found in similar instances? Aka, sheer rock towers rising from the ground, oh wait, there isn't, nor are we given the genetic ability to climb these without unnatural adaptations. \n \n Poeple live in the moutnians that are much higher in elevation than any skyscrapers. You made the argument about anatomy but then attack the idea of technology. Why would you confuse the two arguments? The technology of the buildings allows us to genetically climb them without any help. \n \n \n \n \nIrrelevant. Explain how that is equilvant to 30,000 feet. \n \n You brought up the argument of living in scky scrapers and now you mix up the argument of living in 30,000 feet. No one lives at 30,000 feet. They only travel with it.\n \n \n \nBut we are not designed to live in skyscrappers. We were not given the ability to climb similar structures, nor were we given the ability to sustain oursleves in similar conditions, nor were we given the ability to rapidly change altitudes without problems. All of that is unnatural, yet it is common. This is the first of your three utter failures at proving anything. \n \n You're miuxing up arguments with anatomy and technology. There is a natural need to travel. Anatomically we can travel at almost any altitude. The only thing that limits are ability is the level of oxygen. The rapid change is due to efficiency but we could travel at 30,000 feet provided with oxygen if we didn't make an ascent too fast. \n \n You're argument that we have to ahve the anatomical ability to do anything to be natural is not relevant. Many animal species do things that they were not anatomically created to do but it is more efficient.\n \n \n \nTherefore it is unnatural. \n \n No you think it is but you criteria is based on anatomy which excludes homosexuality.\n \n \n \nJust like we are given the intelligence to explore our bodies in unorthodox ways. How do you like them apples? I can use that argument aganist you just in a far more nerve striking way. Using that logic, you can say anything is natural because we have the ability to do so. Is genetic engineering natural because we have the intelligence to do it? You just opened a huge can of worms that I won't let to put back into the can. Human cloning is therefore natural under your logic as well as everything else we can do or even imagine. People have the intelligence and technology to kidnap and rape little children, is that natural? It would be best of you to stop using that point, it will only burn you in the end. This is your number 2 failure, prepare for #3. \n \n First off I didn't open a can of worms for you. You opened another can that i never did. I asserted that the need was enhanced by our intelligence and technology. Having the intelligence to do something doesn't create the need which is the argument you're making. So you need to assess the arguments before you start arguing with yourself.\n \n \n \n \n \n \nI love how you just gave me a tactical nuclear weapon to use aganist your pea shooter, it is almost makes me feel sorry for you...almost. Under your logic, killing people, boiling their bodies down into the paste, then pressurzing in into a highly efficent fuel to keep us warm is therefore natural because we are using other's to adapt and help us survive. HOW DO YOU LIKE THEM APPLES? If I were you, i'd quickly withdraw the intelligence point before I start the real pounding. \n \n Well since you are killing yoursellf in teh process then hey I love them apples. First off you are mixing up the moral and technological terms and mixing them into one argument which is not what we are arguing so you're just arguing with yourself.\n \n \n \n \nOur body anatomically was not designed for anal sex, but it does not make it unnatural to do it. I can't believe you just gave me that to use aganist you. \n \n yes our body was not made for anal sex and there is nothing technological that I am aware that makes it safer except lubrication whihc minimizes damages but doesn't prevent it.\n \n \n \nThen it is natural to transport ourselves using human slaves pulling a chariot.\n \n Again mixing up two separate terms. Tehnology of chariots yes natural. Slavery is immoral and considered not natural. You can't combine two arguments. \n \n \n \nBut you just said that while we are not designed for it, it does not make it unnatural. \n \n The technological adanves that allow up to accomodate our needs does not make it unnatural.\n \n \n \nReplace airplane travel with anal, fisting, or other common gay practices. \n \n You have failed more then 3 times, as well as giving me numerous weapons I wasn't going to use against you. I'd LOVE to see you come back from this.\n\n There is no need to stick somthing up our A$$. If it was it would be very common which it is not. Everyone doesn't engage in those activities because there is no need.\n Also the health risks of ariplane travel compared to anal sex, fisting and everything else is even comparable. There is so little risk of travel by airplane which is why it is anatomically healthy compared to anal sex.\n \n No you've failed the whole time. I haven't given you any weapons but you've given many.", 
   {}, 
   61351, 
   null, 
   1092099540.0
  ], 
  [
   61578, 
   null, 
   "mana'ia", 
   "\n But nothing is aganist nature according to mana'ia's logic. If we have the intelligence to do something, it is therefore not unnatural anymore. \n \n Be careful about what you say in your arguments, it might just come back to bite you.\n\n Exactly Duo be careful what you say. I never siad if we have the intelligence to do something it makes it natural. I said if we have a need to do somehting and we make technological advances to accomodate those needs that doesn't make it unnatural.\n \n Anatomically our intelligence is one of our gifts that help us do things. Therefore you msut include it in your anatomical argument.", 
   {}, 
   61454, 
   null, 
   1092099720.0
  ], 
  [
   61579, 
   null, 
   "mana'ia", 
   "The anus is very rich in sensitive nerve endings like other sex organs. Having the prostate gland stimulated is pleasurable for men. Also, the anus contracts during orgasm like other sexual organs....\n \n Anal sex is pleasurable both for the insertive partner and the receptive partner. The anus contains many of the same kinds of nerves as the penis or clitoris, and stimulating the anus can produce sexual pleasure. \n \n The presence of the prostate gland near the rectal wall is generally seen as a source of pleasure for men who enjoy receiving anal sex. For women, pleasure derived from anal intercourse can be related to the rectum sharing a wall with the vagina (the sexual nerves are actually closer on that side, making the sensation different and sometimes actually stronger) as well as the nerve endings at the opening of the anus and the G-spot.\n \n http://www.wordiq.com/definition/Anal_sex\n\n \n That doesn't prove that we were designed for it. There are a lot of health problems associated with anal sex. Just becasue it is graitifying doesn't make it natural. Eating and sleeping all day for many is gratifying but that doesn't make it natural.", 
   {}, 
   61308, 
   null, 
   1092099900.0
  ], 
  [
   61595, 
   null, 
   "joebrummer", 
   "That doesn't prove that we were designed for it. There are a lot of health problems associated with anal sex. Just becasue it is graitifying doesn't make it natural. Eating and sleeping all day for many is gratifying but that doesn't make it natural.\n\n \n \n There are no documented health problems associated with anal sex. Their are STI's (Sexually transmitted Infections) associated with it. But that is true of all or most sexual contact. Even kissing puts you at risk for mono.\n \n Done safely with a condom there is no health issues invovled. If you have so other info, I would be happy to look at it. AND don't bother with the gay bowel syndrome stuff, because that is a myth. There is no medical condition with this name. (except ones created by the right wing)", 
   {}, 
   61579, 
   null, 
   1092111840.0
  ], 
  [
   61597, 
   null, 
   "JakeCJB", 
   "Duo I feel sorry for you. You're arguments even though for youre comprehension seem logical are not and I'm about to show you how. You proved that you had no credibility to begin with.\n\n \n I doubt it.\n \n \nThe travel of in the jet stream is only for efficient purposes. We can travel at any altitude but it becomes efficient to travel at higher. Being efficient is what is natural not the need to protect us from the elements. No one deep sea travels except submariens but they only travel so far. submariens are for military puposes only. So that really isn't relevant wht the military does. Tehy do unnatural things to gain advantage over enemies who aren't quite as adapted.\n\n \n How are the military doing unnatural things, gaining advantage over an enemy? Protecting ourselves fromt the elements is not natural, even if the elements could kill us? If being efficient is what is natural, how does sex and our many social and recreational and leisure activities fit into that? What is the efficiency of being left-handed? What is the efficiency in being a redhead?\n \n \nPoeple live in the moutnians that are much higher in elevation than any skyscrapers. You made the argument about anatomy but then attack the idea of technology. Why would you confuse the two arguments? The technology of the buildings allows us to genetically climb them without any help.\n\n \n How does this technology change our genetics?\n \n \nYou brought up the argument of living in scky scrapers and now you mix up the argument of living in 30,000 feet. No one lives at 30,000 feet. They only travel with it.\n\n \n Heard of space stations?\n \n \nYou're miuxing up arguments with anatomy and technology. There is a natural need to travel.\n\n \n I donn't see how there is a natural need for travel itself.\n \n \nAnatomically we can travel at almost any altitude. The only thing that limits are ability is the level of oxygen.\n\n \n So anatomically we can NOT travel at any altitude.\n \n \nYou're argument that we have to ahve the anatomical ability to do anything to be natural is not relevant.\n\n \n But yours is that we just need the intelligence to do it to be natural.\n \n \nMany animal species do things that they were not anatomically created to do but it is more efficient.\n\n \n Examples. And how can we be so sure they were not anatomically created to do it. Are you saying what makes it natural is intelligence here too?\n \n \nNo you think it is but you criteria is based on anatomy which excludes homosexuality.\n\n \n But you keep pointing out that we are not anatomically designed to do many of the things we do. How do we know that we were not anatomically designed for homosexuality, if we pull it off, even without technology or necessarily with intelligence?\n \n \nFirst off I didn't open a can of worms for you. You opened another can that i never did. I asserted that the need was enhanced by our intelligence and technology. Having the intelligence to do something doesn't create the need which is the argument you're making. So you need to assess the arguments before you start arguing with yourself.\n\n \n So, it's only about need? How do you define need? Without the intelligence, how do we determine what is a need?\n \n \nWell since you are killing yoursellf in teh process then hey I love them apples. First off you are mixing up the moral and technological terms and mixing them into one argument which is not what we are arguing so you're just arguing with yourself.\n\n \n I don't see that's what Duo_Maxwell is doing. If morals don't enter into this, how do you determine what is a \"need\" worth satisfying, and how best to satisfy it?\n \n \nyes our body was not made for anal sex\n\n \n How are people doing this, if our body won't let us do it?\n \n \nand there is nothing technological that I am aware that makes it safer except lubrication whihc minimizes damages but doesn't prevent it.\n\n \n Use more of it. The only way to surely prevent damage is to stick to masturbation only...with plenty of lubrication.\n \n \nAgain mixing up two separate terms. Tehnology of chariots yes natural.\n\n \n Natural because we have the brains to do it, and you claim travel itself is a need?\n \n \nSlavery is immoral and considered not natural. You can't combine two arguments.\n\n \n It's a human made insitution like marriage.\n \n \nThe technological adanves that allow up to accomodate our needs does not make it unnatural.\n\n \n Like water-based lubricants and condoms for anal or vaginal sex.\n \n \nThere is no need to stick somthing up our A$$. If it was it would be very common which it is not. Everyone doesn't engage in those activities because there is no need.\n\n \n It's about being social, and being close to another person, that is a need. No need to be left-handed, no need for the female orgasm. No need to be an astronaut. You don't have a need to travel to winter in Florida, as some Canadians do.\n \n \nAlso the health risks of ariplane travel compared to anal sex, fisting and everything else is even comparable. There is so little risk of travel by airplane which is why it is anatomically healthy compared to anal sex.\n\n \n What about all the automobile accidents? All sex acts, except masturbation are riskier than airplane travel.\n \n \nNo you've failed the whole time. I haven't given you any weapons but you've given many.\n\n \n I'm just not seeing that.", 
   {}, 
   61577, 
   null, 
   1092112320.0
  ], 
  [
   61600, 
   null, 
   "JakeCJB", 
   "That doesn't prove that we were designed for it. There are a lot of health problems associated with anal sex. Just becasue it is graitifying doesn't make it natural.\n\n \n What proves that we were designed for a certain type of sex? What does make sex natural, if not gratification? \n \n \nEating and sleeping all day for many is gratifying but that doesn't make it natural.\n\n \n Eating and sleeping are now not natural?", 
   {}, 
   61579, 
   null, 
   1092112680.0
  ], 
  [
   61604, 
   null, 
   "JakeCJB", 
   "Exactly Duo be careful what you say. I never siad if we have the intelligence to do something it makes it natural. I said if we have a need to do somehting and we make technological advances to accomodate those needs that doesn't make it unnatural.\n \n Anatomically our intelligence is one of our gifts that help us do things. Therefore you msut include it in your anatomical argument.\n\n \n The tecnological advances which help us do things we could not anatomically do, come about because of our intelligence, so intelligence is what makes those things natural. If we have the intelligence to do anal sex, that is part of our anatomy, making anal sex natural by your logic.\n \n You are saying anal sex isn't a \"need\". I don't know how you claim that anything sexual is a \"need\" or not. In other posts you go by the majority not doing a certain activity, meaning it is not a need. That's really limiting all of our sex lives, and the rest of our lives, gay or straight, mana'ia!", 
   {}, 
   61578, 
   null, 
   1092117300.0
  ], 
  [
   61605, 
   null, 
   "JakeCJB", 
   "What of the possibility that being gay is natural for those who are? I could be convinced that being gay is biologically contrary to the purpose of sex since the sex organs were designed for procreation.\n\n \n Then you would have to say hetero oral sex or using a condom or the birth control pill or masturbation is not using the organs for what they were designed for. Very little of the sex that takes place leads to procreation. Think of the lucky couple who have been together for 40 years, and have two children. That doesn't mean they had sex only twice. \n \n If the only purpose of sex is procreation, sex evolved to be very inefficient.", 
   {}, 
   61431, 
   null, 
   1092118500.0
  ], 
  [
   61606, 
   null, 
   "Duo_Maxwell", 
   "Duo I feel sorry for you. You're arguments even though for youre comprehension seem logical are not and I'm about to show you how. You proved that you had no credibility to begin with.\n\n \n Considering your arguments rely on lies, fallacies and majority oppression, you have no credibility.\n \n \nAlso we can wihtstaion the pressure at 30,000 ft above sea level. It's the lack of oxygen that makes it impractical to remain.\n\n \n Therefore it is unnatural to do so. \n \n \nWe pressurise planes becasue the jet travel; is too fast for most people to adjust. That is why jet pilots only have helmets.\n\n \n and that is also unnatural. \n \n \nTehy do unnatural things to gain advantage over enemies who aren't quite as adapted.\n\n \n And that is seen and accepted. Yet you don't argue aganist it because it is unnatural. Hypocrite. \n \n \nPoeple live in the moutnians that are much higher in elevation than any skyscrapers. You made the argument about anatomy but then attack the idea of technology. Why would you confuse the two arguments? The technology of the buildings allows us to genetically climb them without any help. \n\n \n If we were naturally designed to live on sheer rock cliffs, we would have the ability to scale them without technology. Yet we resort to unnatural processes to do so. No one is endowned with the ability to rapidly descend. Even the best climbers cannot go that fast without major issues to their respiroty functions. \n \n \nYou brought up the argument of living in scky scrapers and now you mix up the argument of living in 30,000 feet. No one lives at 30,000 feet. They only travel with it.\n\n \n Yet it is unnatural to do either. \n \n \nYou're miuxing up arguments with anatomy and technology. There is a natural need to travel. Anatomically we can travel at almost any altitude. The only thing that limits are ability is the level of oxygen. The rapid change is due to efficiency but we could travel at 30,000 feet provided with oxygen if we didn't make an ascent too fast.\n\n \n Technology is designed to make up for the lackins in anatomy. It is a unnatural process to allow us to do unnautrally anatomical acts. You fail to see this. \n \n \nFirst off I didn't open a can of worms for you. You opened another can that i never did.\n\n \n That may be, but you will still lose, just like you lose every argument you enter. \n \n \nI asserted that the need was enhanced by our intelligence and technology. Having the intelligence to do something doesn't create the need which is the argument you're making. So you need to assess the arguments before you start arguing with yourself.\n\n \n You made no such asseration. You simply said that the intelligence to do soemthing doesn't make it unnatural. I counterd with the same logic you used, yet you fail to see how it applies. Besides, if you want to argue that, there is a need for genetic manipulation as well as cloning. \n \n \nFirst off you are mixing up the moral and technological terms and mixing them into one argument which is not what we are arguing so you're just arguing with yourself.\n\n \n No, you gave the logic to support your argument, I am using it direct aganist you. YOU HAVE SHOWN YOUR COMPLETE AND UTTER FAILURE TO ADDRESS THE SAME ISSUES BEING SLAMMED BACK INTO YOUR FACE AND ATTEMPTING TO REMOVE THE FOCUS FROM YOUR FAILURES \n \n \nyes our body was not made for anal sex and there is nothing technological that I am aware that makes it safer except lubrication whihc minimizes damages but doesn't prevent it.\n\n \n No, your asseration was on intelligence, not primarily technology. So my point still stand, and you have lost.\n \n \nThe technological adanves that allow up to accomodate our needs does not make it unnatural.\n\n \n So therefore gay safe sex is not unnatural.\n \n \nThere is no need to stick somthing up our A$$. If it was it would be very common which it is not. Everyone doesn't engage in those activities because there is no need.\n\n \n There is no need to fly at 30,000 feet. Everyone doesn't engage in those activies because there is no need. YOU HAVE LOST. \n \n \nI never siad if we have the intelligence to do something it makes it natural.\n\n \n \nHowever the fact that we were blessed with the intelligence is what helps us to adapt to the natural need to transport oursleves.\n\n \n You have no argument, and this is why. \n \n You made the asseration that having intelligence, the means to build transportation, (without making a argument for need), makes things not unnatural. That very same logic can easily be applied to gay sex, which apparently you are completely obessed with. If we have the intelligence to explore our bodies, and the intelligence to build technological advances to do so, then anal sex is no longer unnatural. \n \n You also said that having intelligence to use other animals and objects to your aid is natural, yet you refuse to comment on the same logic applied in a horrible manner. You have a living, breathing and walking double standard. You also start throwing in morality, which is irrevelant to a anatomical or intelligence-related ability argument. You assume YOUR morality is the correct, and therefore you have right to decide what is right and what is wrong without making a single logical point.\n \n Then you start saying the technology does not make something unnatural. If we have the technology to do anything, then the related field is no longer unnatural due to your very own logic, which you refuse to acknowledge yet use in your very own arguments. Then you have the ignorant comment to even mention efficency, which has no bearing on the means and willingess to utilize intelligence. \n \n Then you decide that only YOU can define what is a need, and only what is needed is therefore unnatural when added to the technology equation. Yet many of your examples, pathetic refutations at that, came from no need, but luxury, unncessity, the absence of need. You ignore that to suit your arguments, yet give the impression that they were needed. \n \n Give up. Now.", 
   {}, 
   61605, 
   null, 
   1092125640.0
  ], 
  [
   61610, 
   null, 
   "JustineCredible", 
   "The basic fact that homosexuality exists and has always existed should certainly be enough. Period.\n \n Those who are left handed exist, but we don't pass laws against them. Those who have blue eyes exist, yet we do not pass laws against them.\n \n Yes, in the history of this country there have been laws against things which are different or foreign. Many of those laws have either been repealed or repaired. \n \n The title of this subject on his forum is \"GAY RIGHTS.\" It's not meant to be a discussion on whether or not being gay is natural. It's not meant to be a discussion of whether or not acting on sexual orientation is natural. \n It is simply because it exists. \n \n All I've read here from those who are attempting to prove or convince others that being gay is in anyway unnatural are simply xenophobes who are terrified of anything or anyone who is in anyway different than they are. \n Too bad. \n Get over it.\n I don't give one iota if anyone tollerates homosexuality, that's really a matter of personal likes or dislikes. But the fact that homosexuals exist, they lead normal, healthy lives, they contribute to society and (get ready to hold yourselves down on this) THEY DO PROCREATE. \n So what if some have gone outside their sexual orientation to do so? So what if they have gained access to outside technology to do so? They are indeed, doing their evolutionary job in reproducing and therefore continuing the species. \n You could wave the most honnest, caring, compassionate, handsome, wealthy, giving, brilliant, well read, interesting, fun loving, funny, strong, forgiving, helpfull man in front of me. It's not gonig to change the fact that I will have absolutely ZERO attraction or inclination to have sex with this person. I am not oriented to copulate with a man. \n The ONLY reason I have a child at all is because of SOCIETAL presures. \n I was truly convinced that living as a heterosexual would in some way change my orientation. I believed that if I dated, married and reproduced with a man I would somehow be \"Cured\" of my NATURAL desire to be with a woman. \n How wrong I was.\n Granted, my sexual orientation had nothing to do with the demise of my legal marriage. But fate interceded and rescused me from a marriage of brutality and infidelity. \n \n I took a very long time to accept who and what I am. What I have always known I was. All those years of television, mass media, peer presure, societal presures, community presures had all played their role in my missery. I had always thought I was strange or different my whole life. \n I had to go through pure hell to find my happiness, my comfort level and my own piece of heaven on earth. \n Once I was able to accept that I was, and have always been gay, then and ONLY then did I make any form of conscious choise. That choice was to live honnestly. To stop accepting the lies that were being fed to me. To stop hoping to become part of any \"in\" group. I had to learn to live for what made me happy. What brought me peace, and what would be the best example of honnesty for my child. \n Self loathing and hatred is descructive and dangerous. Projecting that on my child would be inexcusable. \n My finding myself was the equivalent of being raised with a parent who died my hair and put face paint on me and told me my entire childhood I was something of which I was not and could never be no matter how much paint was applied. \n \n All I am able to do is to argue on behalf of my own experiences. To me and my family, that is natural. I have no regrets or anger towards anyone. I am grateful I was blessed to have a wonderful, accepting and support structure of friends and family around me. \n \n Now for the funny part: when I did finally \"come out\" and the ripe age of 29, my parents actually said; \"Duh, what took you so long to realize this? We always knew...but we couldn't force you to accept it. That was for you to do.\"", 
   {
    "post_info": {
     "post_title": "Existence should be enough"
    }
   }, 
   61606, 
   null, 
   1092128580.0
  ], 
  [
   61687, 
   null, 
   "Mach", 
   "Of course it's natural. And humans are animals. \n \n Fear and hatred of homosexuality is by in large a learned behavior. Naturally, my guess is that it would be a mixed bag. Some would participate in homosexual behavior, some might not. And it might vary over time. Some might also be \"opposed\" to it in some fashion, while others encourage it. Either way, it doesn't matter. The government has no reason to be in the bedroom of consenting adults, or in the role of discriminating based on sex, or sexual preference. = gay rights for everyone, the sooner the better.\n \n -Mach", 
   {
    "post_info": {
     "post_title": "nature"
    }
   }, 
   61606, 
   null, 
   1092201360.0
  ], 
  [
   61688, 
   null, 
   "mizmaxx", 
   "Then you would have to say hetero oral sex or using a condom or the birth control pill or masturbation is not using the organs for what they were designed for.\n\n This is my fave homophobe argument. Apparently, according to them, all our organs were designed with a single function, and doing anything else with them is \"unnatural\". So, your fingers are made to hold and grab things, and your nose is made to smell and breathe (oops, already two functions!), so picking your nose is \"unnatural\". I guess this makes the liver a profoundly unnatural organ, as it performs about 500 functions in the body. \n \n What all parts of our bodies are \"designed\" for, and whether there was a \"design\" at all, cannot be known by any human, as we did not do the designing, nor do we have the blueprints. All we have to know are whether certain actions are dangerous for our health. We choose to do many things, in varying degrees of moderation, that we in fact know are bad for our health (smoking, drinking, sleep-deprivation, etc.). \n \n Are homophobes really that concerned about global health? Will they start flooding boards with messages about how \"despite how satisfying it is to clean one's ear canal with a q-tip, doctors recommend we do not insert objects into the ear canal\"? I doubt it. Obviously, the problem some ppl have with homosexuality is not that it is unusual mammalian behavior (which it isn't), or that homosexual relationships are by definition unhealthy (which they aren't). ;)", 
   {}, 
   61605, 
   null, 
   1092201660.0
  ], 
  [
   61696, 
   null, 
   "mana'ia", 
   "Considering your arguments rely on lies, fallacies and majority oppression, you have no credibility.\n\n Maybe but yours are based upon dismissing mine and then going off on irrelavent tangents\n \n \n \nTherefore it is unnatural to do so. \n \n It is unnatural to do so yes but there is a natural technology that makes it possible natural to travel at that level. \n \n \n \nand that is also unnatural. \n \n Yes but warfare is not natural. It is absed upon doing the unorthodox.\n \n \n \nAnd that is seen and accepted. Yet you don't argue aganist it because it is unnatural. Hypocrite. \n \n Warfare is different from accepted behavior. WArfare is considered unnecessary or a necessary evil depending on the situation. Don't confuse warfare with accepted behavior.\n \n \n \nIf we were naturally designed to live on sheer rock cliffs, we would have the ability to scale them without technology. Yet we resort to unnatural processes to do so. No one is endowned with the ability to rapidly descend. Even the best climbers cannot go that fast without major issues to their respiroty functions. \n \n Sloths go real slow climbing trees. Does that make it an unnatural habitat? Many species build nests and burrow in the gorund that takes time and yet we can do those things faster than them. Does that make it unnatural for them to live in it?\n You need to define what we were intended to live in and what is your term of natural? Does there have to be a need? Does our body have to be capable of doing it without technological advances? You keep going off on different tangents.\n \n \n \nYet it is unnatural to do either. \n \n How is it unnatural to do either? There were people taht lived on sheer cliffs during the history of mankind.\n \n \n \nTechnology is designed to make up for the lackins in anatomy. It is a unnatural process to allow us to do unnautrally anatomical acts. You fail to see this. \n \n No you fail. Technology is part of civilization. Technology has evovled as has our behavior. Technology is for our progress not for what we lack. We lack many things but technology improves our way of life. Where do you get technology being the lack of anatomical abilities?\n \n \n \nThat may be, but you will still lose, just like you lose every argument you enter. \n \n Uhhh yeahhhh okay\n \n \nYou made no such asseration. You simply said that the intelligence to do soemthing doesn't make it unnatural. I counterd with the same logic you used, yet you fail to see how it applies. Besides, if you want to argue that, there is a need for genetic manipulation as well as cloning. \n \n I did make that assertion 42\n \n If you want to get technical with what we were given then you must include our intelligence. Many animals liek the hermit crab adopt other animls shells for protection. Many animls build nests and other such things to help them dapat. Bears seek shelter in caves. We do likewise by using animal fur and other necessity to help us live in conditions that even though they aren't ideal conditions are more than bearable. Anatomically our body does adjust and use others skills that other animls use to help us survive. \n \n I agree that intelligence to do something doesn't make it unnatrual but I never agreed either that the intelligence to something makes it natural either. You can argue taht there is a need for genetic engineering but that is a whole different topic.\n \n \n \n \n \nNo, you gave the logic to support your argument, I am using it direct aganist you. YOU HAVE SHOWN YOUR COMPLETE AND UTTER FAILURE TO ADDRESS THE SAME ISSUES BEING SLAMMED BACK INTO YOUR FACE AND ATTEMPTING TO REMOVE THE FOCUS FROM YOUR FAILURES \n \n Wow form some that responds to every argumetn with you failed. Withous showing me how I failed or manipulating issues its funny taht you're going to try to assert this.\n \n \n \nNo, your asseration was on intelligence, not primarily technology. So my point still stand, and you have lost.\n\n Alright whatever. You say. I never said that but alright whatever.\n \n \n \nSo therefore gay safe sex is not unnatural.\n\n Your statement is a conclusory statement with out any analysis that anyone can follow. I said technological dvances does nto make it natural then you respond with this? You're lost.\n \n \n \nThere is no need to fly at 30,000 feet. Everyone doesn't engage in those activies because there is no need. YOU HAVE LOST. \n Actually over a million people a day engage in the activity.\n There is a need to travel. Everyone that flies generally does engage in this activity. People that don't engage in it isn't because they don't need to it's because they ahve no opportunity to do it. BUt keep smiling with your argument.\n \n \n \n \n \nYou have no argument, and this is why. \n \n You made the asseration that having intelligence, the means to build transportation, (without making a argument for need), makes things not unnatural. That very same logic can easily be applied to gay sex, which apparently you are completely obessed with. If we have the intelligence to explore our bodies, and the intelligence to build technological advances to do so, then anal sex is no longer unnatural. \n \n Taht's like three degrees of seperation form waht I said. You keep making these leaps taht I never made. \n \n \n \nYou also said that having intelligence to use other animals and objects to your aid is natural, yet you refuse to comment on the same logic applied in a horrible manner. You have a living, breathing and walking double standard. You also start throwing in morality, which is irrevelant to a anatomical or intelligence-related ability argument. You assume YOUR morality is the correct, and therefore you have right to decide what is right and what is wrong without making a single logical point.\n\n you're the one taht brought up slavery not me. So that is when you bring in moral issues.\n \n \n \n \nThen you start saying the technology does not make something unnatural. If we have the technology to do anything, then the related field is no longer unnatural due to your very own logic, which you refuse to acknowledge yet use in your very own arguments. Then you have the ignorant comment to even mention efficency, which has no bearing on the means and willingess to utilize intelligence. \n \n CAn you please post the quote where I said that. I said technology does not make it unnatural. Technoilogy helps us fulfill our needs. Teh efficiency argument is res ipsa loquitor \" the thing speaks for itself\". Society won't encourage something thats impractical.\n \n \n \n \nThen you decide that only YOU can define what is a need, and only what is needed is therefore unnatural when added to the technology equation. Yet many of your examples, pathetic refutations at that, came from no need, but luxury, unncessity, the absence of need. You ignore that to suit your arguments, yet give the impression that they were needed. \n \n You need to define need. There is a need for a microwave. However some people never use the microwave so they may say that there is no need. Teh fact that soem people need to use it and others don't doesn't meant here is no need. So luxuries for some are necessities for tohers. You too far gone from the original argument.\n \n Also I said technology aided our needs not the other way around.\n \n \n \nGive up. Now.\n\n If you lose everyone againg i probably will have to ebcause your arguments are so far gone.", 
   {}, 
   61606, 
   null, 
   1092203580.0
  ], 
  [
   61697, 
   null, 
   "JakeCJB", 
   "Maybe but yours are based upon dismissing mine and then going off on irrelavent tangents\n\n \n Yours are confused and contradict depending on your own biases.\n \n \nIt is unnatural to do so yes but there is a natural technology that makes it possible natural to travel at that level.\n\n \n So it's unnatural. But what makes it natural is technology. What am I missing?\n \n \nYes but warfare is not natural. It is absed upon doing the unorthodox.\n\n \n You use unorthodox in a very subjective way, as there is a great history of warfare, many people and many nations have engaged in it.\n \n \nWarfare is different from accepted behavior. WArfare is considered unnecessary or a necessary evil depending on the situation. Don't confuse warfare with accepted behavior.\n\n \n So it is both necessary and unnecessary. I think it's both those things depending on bias, not depending on the situation. \n \n \nHow is it unnatural to do either? There were people taht lived on sheer cliffs during the history of mankind.\n\n \n You only use the there is a history of it and people who did it argument to say the things you personally morally accept are natural.\n \n \nNo you fail. Technology is part of civilization. Technology has evovled as has our behavior.\n\n \n So our behaviour can evolve, it isn't static. But I have a feeling here again, the only behaviours you accept are the ones that fit your personal biases.\n \n \nTechnology is for our progress not for what we lack. We lack many things but technology improves our way of life. Where do you get technology being the lack of anatomical abilities?\n\n \n Of course we require technology to make up for our lack of anatomical abilities.\n \n \n \nI did make that assertion 42\n \n If you want to get technical with what we were given then you must include our intelligence. Many animals liek the hermit crab adopt other animls shells for protection. Many animls build nests and other such things to help them dapat. Bears seek shelter in caves. We do likewise by using animal fur and other necessity to help us live in conditions that even though they aren't ideal conditions are more than bearable. Anatomically our body does adjust and use others skills that other animls use to help us survive. \n \n I agree that intelligence to do something doesn't make it unnatrual but I never agreed either that the intelligence to something makes it natural either.\n\n \n What does make it natural in your view? You've only shown your own personal biases for or against something, or your own personal morality, make something natural or unnatural in your view, from what I can tell so far.\n \n \nYour statement is a conclusory statement with out any analysis that anyone can follow. I said technological dvances does nto make it natural then you respond with this? You're lost.\n\n \n It only makes it natural in your view, when it comes to things you personally agree with. When it comes to things you don't personally agree with, such as being gay, then techonology will not make it natural in your view.\n \n \nActually over a million people a day engage in the activity.\n\n \n Is that the magic number? However, I'm sure if we could find a million people who engage in gay sex, which is hardly inconceivable, you would not agree that it is natural. Because you personally disagree with gay sex.\n \n \nThere is a need to travel.\n\n \n Why do you say there is a need to travel as a tourist, taking pictures, or seeing a friend?\n \n \nCAn you please post the quote where I said that. I said technology does not make it unnatural. Technoilogy helps us fulfill our needs. Teh efficiency argument is res ipsa loquitor \" the thing speaks for itself\". Society won't encourage something thats impractical.\n\n \n Well, practicallity is quite subjective.\n \n \nYou need to define need. There is a need for a microwave. However some people never use the microwave so they may say that there is no need. Teh fact that soem people need to use it and others don't doesn't meant here is no need. So luxuries for some are necessities for tohers. You too far gone from the original argument.\n\n \n Sorry, luxuries are not necessities. Again, you show how subjective you are. That's probably why this argument has strayed so far. It's because you don't have an argument against being gay, that is not merely a simple assertion of your own personal bias against being gay. That's why you are now contemplating leaving the argument.", 
   {}, 
   61696, 
   null, 
   1092207900.0
  ], 
  [
   61827, 
   null, 
   "Duo_Maxwell", 
   "Something is odd with the posting. \n \n mana'ia's arguments are built so that only he can define what is right and what is natural, and what is natural in accordance to technology. \n \n He says technology doesn't it make it not unnatural, but it doesn't make it natural, yet only his examples are natural, and all others he does not approve of are not natural with his twisted logic. \n \n Then he assumes only he can define what is needed, which is irrevelant in terms of natural, and what is moral, which he decides at will. \n \n Arguments based on changing logic, assumptions that only one person can define what is just, and massive numbers of fallacies, and double standards doesn't make you right mana'ia, just a user of poor style. \n \n Post is linear, dealing with each line/paragraph.\n \n Doesn't change the fact you are a lie, fallacy and majority oppression user.\n Besides, you're the only one who thinks that. \n \n And there is also natural technology that makes it possible to explore our\n bodies in formerlly unnatural ways. \n \n Warfare, perhaps, not, but application of violence is definitely natural.\n \n To you perhaps, but many others were itching to start bombing people, not to\n mention that the job of professional soldier exists. If war wasn't a accepted\n behavior, no one would do it. \n \n Slothes were given the mechanical means to climb trees and digest the plant\n matter found at those levels. We are not. Your second point is irrevelant to\n everything. \n \n Because you bring up arguments that are irrevelant to the discussion and I keep\n addressing them as why they are irrevelant. You're bring in the tangents, not\n me. \n \n Not sheer cliffs like skycrappers. Not did they climb vertically to reach them.\n It's called walking up trails to reach the top, not vertically scalling sheer\n cliffs like many other animals who were given the anatomics to do so. \n \n So therefore condoms are as well. \n \n Did you really just say that? We use technology to bridge our of anatomical\n abilities. We cannot fly, therefore we use technology to do so. We cannot climb\n sheer rock faces, so we invent climbing gear to do so. We cannot live 5 miles\n below, so we invent breathing and pressure equipment to do so. We cannot live\n without a heart, so we use technology to do so. How do you not understand this\n very simple concept? \n \n So you have simply given you a one sided pass to decide what is and what is\n natural with the addative of technology. Your arrogance is astounding. \n \n Everyone here except you gets the logic that you have failed. As well that you\n don't respond to parts you don't like, as well as you ignoring your own logic,\n and backpeddling to suit your needs. \n \n Then everything we have is not unatural due to your logic, but then again\n everything is according to your changing logic. \n \n But we did not need this 70 years ago. \n \n We invented the need to travel by plane. \n \n You keep ignoring everything you don't like.\n \n I merely made a observation that used your logic that you did not like. Then you\n dance around it because you don't want to address how your own logic defeats\n your entire argument. \n \n Then your examples contrict your argument. Technology also helps creates leisure\n and unnecessary acts. Society does encourge something that is impratical. it is\n impractical to get a plasma screen yet society looks upon them as signs of\n success and encourges people to get them. it is impractical to leave valuables\n in cars, but society has litterally turned cars into storage vessels. Those two\n mere examples prove you wrong like you always are. \n \n You need to stop assuming you define need for everyone. Need is irrevelant to\n what is natural and what is not.", 
   {}, 
   61697, 
   null, 
   1092279180.0
  ], 
  [
   63246, 
   null, 
   "mana'ia", 
   "Sorry I've been busy but I'll respond when I can.\n \n \nSomething is odd with the posting. \n \n mana'ia's arguments are built so that only he can define what is right and what is natural, and what is natural in accordance to technology. \n \n No my arguments lay out a rational basis that exclude your rationale. It doesn't coincide with your arguments. If you ahve a rationale then you can lay it out and see what seems more logical \n \n \n \nHe says technology doesn't it make it not unnatural, but it doesn't make it natural, yet only his examples are natural, and all others he does not approve of are not natural with his twisted logic. \n \n My point is that technology doesn't make a need natural or unnatural becasue you made the statement\n \n That since homosexuality isn't natural (there is hisotrical disagreement as well as biological one as well) that we should ban it. This ignores the fact that virtually everything we do in today's world is unnatural compared to our very early lifestyles, yet the antis don't say a word about that. If we are to ban gays from getting married because it is unnatural, we should tear down all skyscrappers as well, stop all airplanes, stop all artic travel and research, and stop all things that are unnatural.\n \n So you made the argument technology is unnatural. I just made the argument that technology helps to fulfill our natural needs.\n \n \n \nThen he assumes only he can define what is needed, which is irrevelant in terms of natural, and what is moral, which he decides at will. \n \n No I simply show taht under any criteria that allows homosexuality will allow for other things.\n \n \n \nArguments based on changing logic, assumptions that only one person can define what is just, and massive numbers of fallacies, and double standards doesn't make you right mana'ia, just a user of poor style. \n\n No they never changed. Show me how they changed.\n \n \n \nPost is linear, dealing with each line/paragraph.\n \n Doesn't change the fact you are a lie, fallacy and majority oppression user.\n Besides, you're the only one who thinks that. \n \n First off your statements are conclusory. They make these statements wihtout any analysis and expected it to stand. That is problematic in any debate. Also you call everything a fallacy without proving that they are fallacies when everything you have said have been shown to be fallacies.\n \n Also majority oppresion is what most people call democracy. If you ahve a problem with democracy that is a whole different topic.\n \n \n \n \nAnd there is also natural technology that makes it possible to explore our\n bodies in formerlly unnatural ways. \n \n AGain technology does not make it unnatural. My point is that there never existed a natural need or desire to perform homosexual activities.\n \n \n \nWarfare, perhaps, not, but application of violence is definitely natural.\n\n In some respects\n \n \nTo you perhaps, but many others were itching to start bombing people, not to mention that the job of professional soldier exists. If war wasn't a accepted behavior, no one would do it. \n \n Defense of our country does not necessarily mean that you will go to war. Soldiers perform other tasks than killing people. They prepared to do things to protect us and that is considered alright. Attacking people is not necessarily considered natural.\n \n \n \n \nSlothes were given the mechanical means to climb trees and digest the plant\n matter found at those levels. We are not. Your second point is irrevelant to\n everything. \n \n We can climb most trees better than sloths. Also we eat many things from trees. WE posses more advance means to climb trees than sloths. We can even jump tree to tree which sloths can't.\n \n \n \n \nBecause you bring up arguments that are irrevelant to the discussion and I keep\n addressing them as why they are irrevelant. You're bring in the tangents, not\n me. \n \n Like when?\n \n \n \nNot sheer cliffs like skycrappers. Not did they climb vertically to reach them.\n It's called walking up trails to reach the top, not vertically scalling sheer\n cliffs like many other animals who were given the anatomics to do so. \n \n Many animals live in trees and cliffs. Some fly, some climb, and some find trails. Do the ones that don't climb the face do it unnaturally?\n \n \n \nSo therefore condoms are as well. \n \n ???\n \n \n \nDid you really just say that? We use technology to bridge our of anatomical\n abilities. We cannot fly, therefore we use technology to do so. We cannot climb\n sheer rock faces, so we invent climbing gear to do so. We cannot live 5 miles\n below, so we invent breathing and pressure equipment to do so. We cannot live\n without a heart, so we use technology to do so. How do you not understand this\n very simple concept? \n \n Here is the definition\n \n Main Entry: tech·nol·o·gy \n Pronunciation: -jE\n Function: noun\n Inflected Form(s): plural -gies\n Etymology: Greek technologia systematic treatment of an art, from technE art, skill + -o- + -logia -logy\n 1 a : the practical application of knowledge especially in a particular area : ENGINEERING 2 <medical technology< b : a capability given by the practical application of knowledge <a car's fuel-saving technology<\n 2 : a manner of accomplishing a task especially using technical processes, methods, or knowledge  <new technologies for information storage<\n 3 : the specialized aspects of a particular field of endeavor <educational technology<\n \n Technology is to help us accomplish tasks that we have a need to perform. You may think that it is to fill for what we lack but the definition doesn't support that.\n \n \n \n \nSo you have simply given you a one sided pass to decide what is and what is\n natural with the addative of technology. Your arrogance is astounding. \n \n Funny I thought you started this argument\n \n \n \nEveryone here except you gets the logic that you have failed. As well that you\n don't respond to parts you don't like, as well as you ignoring your own logic,\n and backpeddling to suit your needs. \n \n No jsut a few taht support your ideology.\n \n \n \nThen everything we have is not unatural due to your logic, but then again\n everything is according to your changing logic. \n \n Again show me how I changed. Use quotes instead of your summaries\n \n \n \nBut we did not need this 70 years ago. \n \n \n ????\n \n \n \nWe invented the need to travel by plane. \n \n No we have always had the need to travel fast and to remote places. Technology just gave us the opportunity to accomplish it. There is no travel for the speed of light but is there a need right now?\n \n \n \n \nYou keep ignoring everything you don't like.\n\n \n For example?\n \n \nI merely made a observation that used your logic that you did not like. Then you\n dance around it because you don't want to address how your own logic defeats\n your entire argument. \n \n give me examples form quotes instead of your summaries\n \n \n \n \nThen your examples contrict your argument. Technology also helps creates leisure\n and unnecessary acts. Society does encourge something that is impratical. it is\n impractical to get a plasma screen yet society looks upon them as signs of\n success and encourges people to get them. it is impractical to leave valuables\n in cars, but society has litterally turned cars into storage vessels. Those two\n mere examples prove you wrong like you always are. \n \n Why is it impractical to have a plasma screen? For some the cost makes it impractical for others the cost isn't a factor so the need for better entertainment isn't impractical.\n Leaving valuables in cars is ver pratical for transporting them so that they are available for us at our convenience.\n \n AGain you have proved nothing. I also have proved you wrong and you can't even see it.\n \n \n \nYou need to stop assuming you define need for everyone. Need is irrevelant to\n what is natural and what is not.\n\n \n Maybe for you but for most people need is important factors is some aspects of natural.", 
   {}, 
   61827, 
   null, 
   1092989400.0
  ], 
  [
   63248, 
   null, 
   "JakeCJB", 
   "No I simply show taht under any criteria that allows homosexuality will allow for other things.\n\n \n You really have to explain that further. What criteria is that precisely, and what other things will be allowed by that criteria. Also, heterosexuality can share many of the same criterias as homosexuality.\n \n \n \nAlso majority oppresion is what most people call democracy. If you ahve a problem with democracy that is a whole different topic.\n\n \n So when the majority supported slavery, that was simply democracy in action. A group fighting against inequality and oppression is also democracy.\n \n \nAGain technology does not make it unnatural. My point is that there never existed a natural need or desire to perform homosexual activities.\n\n \n It happens. Who are you to say there isn't a natural need? You define natural need by your own personal politics and by your own personal, subjective morality. Nature doesn't conform to your politics nor to your morality.\n \n \nDefense of our country does not necessarily mean that you will go to war. Soldiers perform other tasks than killing people. They prepared to do things to protect us and that is considered alright. Attacking people is not necessarily considered natural.\n\n \n More of your own politics, not nature.\n \n \nNo we have always had the need to travel fast and to remote places.\n\n \n Why would we have the need to travel fast to remote places? Everytime that happens someone is acting on need? A need to be a tourist and take pictures, or the need to lay on a far-off exotic beach and be served drinks?\n \n \nWhy is it impractical to have a plasma screen? For some the cost makes it impractical for others the cost isn't a factor so the need for better entertainment isn't impractical.\n\n \n There can be a practical need for the \"better\" entertainment, if you are rich? However, there cannot be a social need for a different relationship that meets the needs and desires of a gay person? I can't believe you don't see how completely subjective and politically biased you are being, the blinders you are wearing. \n \n \nLeaving valuables in cars is ver pratical for transporting them so that they are available for us at our convenience.\n\n \n Not if they end up stolen. Luxury items are not practical needs.\n \n \nMaybe for you but for most people need is important factors is some aspects of natural.\n\n \n You don't understand what nature is. You are assigning your politics and your morality to natural needs. Nature has no morality and no politics. Nature does not define \"need\" based on your morality, nor does it define \"need\" based on your politics.", 
   {}, 
   63246, 
   null, 
   1092992400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Homosexuality in Nature", 
  "url": "http://www.4forums.com/political/gay-rights-debates/2830-homosexuality-nature.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 2830, 
  "discussion_files": [
   [
    "4771.html", 
    "http://www.4forums.com/political/gay-rights-debates/2830-homosexuality-nature-print.html"
   ], 
   [
    "4772.html", 
    "http://www.4forums.com/political/gay-rights-debates/2830-homosexuality-nature-5-print.html"
   ], 
   [
    "4773.html", 
    "http://www.4forums.com/political/gay-rights-debates/2830-homosexuality-nature-4-print.html"
   ], 
   [
    "4774.html", 
    "http://www.4forums.com/political/gay-rights-debates/2830-homosexuality-nature-3-print.html"
   ], 
   [
    "4775.html", 
    "http://www.4forums.com/political/gay-rights-debates/2830-homosexuality-nature-2-print.html"
   ]
  ], 
  "identifier": 2830
 }
]