[
 [
  [
   60380, 
   null, 
   "Bush Is The Man", 
   "Here is the link to FoxNews.com and Bill O'Reilly's interview with Michael Moore...\n http://www.foxnews.com/story/0,2933,127236,00.html\n I suggest watching the video rather than reading the transcript, it paints a much better picture of the whole situation.\n \n \n Michael Moore was pretty much made to look like a fool by Bill O'Reilly. Moore made some brutal comments. And when he did, O'Reilly let him know. I can't believe how dumb Michael Moore is. Please read or watch his interview, and then let me know your thoughts on it.", 
   {
    "post_info": {
     "post_title": "Michael Moore interview with Bill O'Reilly"
    }
   }, 
   null, 
   null, 
   1091208660.0
  ], 
  [
   60398, 
   null, 
   "jim's trucking", 
   "Here is the link to FoxNews.com and Bill O'Reilly's interview with Michael Moore...\n http://www.foxnews.com/story/0,2933,127236,00.html\n I suggest watching the video rather than reading the transcript, it paints a much better picture of the whole situation.\n \n \n Michael Moore was pretty much made to look like a fool by Bill O'Reilly. Moore made some brutal comments. And when he did, O'Reilly let him know. I can't believe how dumb Michael Moore is. Please read or watch his interview, and then let me know your thoughts on it.\nMoore appears to think you can have your cake and eat it, too. He fails to answer questions truthfully, he will likely deny to his dieing day that Bush said the same things that Clinton, Kerry, Kennedy, the Brits, the Russians and the CIA told him. He's got nothing to hang on to except, \"Bush lied, people died\". and he'll never let go.\n \n There are other threads on here where posters continue to defend Moore and jump on me for insisting that Bush did not lie. It has recently come to light that the often quoted \"16 words\" in Bush's speech are indeed representative of the truth, but nobody wants to retract their statements about Bush trying to mislead us with those words. That wouldn't be good for the liberal cause.\n \n The absence of WMDs likewise does not offer proof that Bush lied. O'Reilly has sense enough to know this...Moore does not (or he just won't admit it).", 
   {}, 
   60380, 
   null, 
   1091216700.0
  ], 
  [
   60596, 
   null, 
   "Rev. HellH0und", 
   "O'Reilly should have answered \"Its not my decision but my sons, and I would support him in any choice he makes including this noble one\" And followed up with there is no drft so it is still a choice.", 
   {}, 
   60398, 
   null, 
   1091372160.0
  ], 
  [
   60604, 
   null, 
   "CCR1994", 
   "Apparently, Mr. Moore has changed his tune. Not long ago, he said he would not go on TV to face hostile questioning and would sue if anyone \"lied\" about his film. It's nice to see him mellow out and give the rest of us a chance to see him challenged. \n \n I see from the O'Reilly transcript that he continues to circulate the notion that we gave Osama a head start before the outbreak of hostilities in Afganistan. What? Has Moore changed his tune on this as well? In his book \"Dude, Where's my Country\" he tells us Osama was in no condition to direct an attack against us because of a serious health problem. At the 2002 Telluride festival, he told Christopher Hitchens in a debate that Osama was innocent until proven guilty. What the heck has changed?", 
   {}, 
   60596, 
   null, 
   1091376900.0
  ], 
  [
   60632, 
   null, 
   "marc9000", 
   "I thought it went fairly well, but I wish O'Reilly would have challenged him on his assertion, \"Bush sent 900 people to die\". Those people were volunteers, they were doing a job of their own free will just like any other worker in this country. There was no way to predict how many would die. It's much more predictible how many people will die all across this country next year in automobile accidents. Since our government won't lower the speed limit to 10 mph, which would obviously save most of them, will our government be sending 45,000 people out to die next year?", 
   {}, 
   60380, 
   null, 
   1091417040.0
  ], 
  [
   60636, 
   null, 
   "jim's trucking", 
   "One way or another, at some age or another, you're gonna die! There'll likely be more people killed this year in gang warfare and domestic disputes on the streets of America's cities than in the whole present conflict.\n \n emoticon_xkill all terrorists and those who support them! ", 
   {}, 
   60632, 
   null, 
   1091422380.0
  ], 
  [
   60649, 
   null, 
   "Alucard", 
   "What a clash of the extremist titans. I'm not a fan of Bill O'Reilly, but I'm even less a fan of Michael Moore. I'm glad that someone put him in his place, even if it was someone on the other far point of the political spectrum. I think I'd take an ultra-conservative over an ultra-liberal anyday.", 
   {}, 
   60636, 
   null, 
   1091434500.0
  ], 
  [
   60654, 
   null, 
   "georged", 
   "One way or another, at some age or another, you're gonna die! There'll likely be more people killed this year in gang warfare and domestic disputes on the streets of America's cities than in the whole present conflict.\n \n emoticon_xkill all terrorists and those who support them! \n\n \n That's quite a social commentary about a country (USA) that's attempting to force our system of government down the throat of another country (Iraq). We have the highest per-capita prison population and are in the process of destroying ourself with debt, so tell me again what it is that our Christian Crusade is doing so right that Moore and a majority of the world disagrees with?", 
   {}, 
   60636, 
   null, 
   1091456880.0
  ], 
  [
   60669, 
   null, 
   "unkerpaulie", 
   "I thought it went fairly well, but I wish O'Reilly would have challenged him on his assertion, \"Bush sent 900 people to die\". Those people were volunteers, they were doing a job of their own free will just like any other worker in this country. There was no way to predict how many would die. It's much more predictible how many people will die all across this country next year in automobile accidents. Since our government won't lower the speed limit to 10 mph, which would obviously save most of them, will our government be sending 45,000 people out to die next year?\n\n actually, those people that died or got injured, as well as those there fighting still, were sent by bush. they volunteered to serve to protect their country. instead, bush sent them to iraq. when you send people to war, you are literally sending them to die for the cause. you are sending them into a heated conflict with lethal weapons. dont take lightly the obligation of the armed forces. there are serious penalties for mutiny and disservice. its not a voluntary hobby. for most of these men and women, its the way they make their living. sadly they often die doing so. and worse, sometimes they are sent to war for reasons other than protecting the liberty of their country, and thats abuse", 
   {}, 
   60632, 
   null, 
   1091467560.0
  ], 
  [
   60673, 
   null, 
   "Bush Is The Man", 
   "actually, those people that died or got injured, as well as those there fighting still, were sent by bush. they volunteered to serve to protect their country. instead, bush sent them to iraq. when you send people to war, you are literally sending them to die for the cause.\n\n \n \n \n If that was the case, then we would have already lost 165,000 troops (we haven't even lost 1000). Protecting and serving our country doesn't mean you have to be stationed in the US to do that. Sometimes protecting the US involves going into another country. So you are quite wrong there. And you saif the VOLUNTEERED. That means they weren't obligated to go, they voluntarily chose to. So Bush didn't send them there to die.\n \n \n \n \nyou are sending them into a heated conflict with lethal weapons. dont take lightly the obligation of the armed forces. there are serious penalties for mutiny and disservice. its not a voluntary hobby. for most of these men and women, its the way they make their living. sadly they often die doing so. and worse, sometimes they are sent to war for reasons other than protecting the liberty of their country, and thats abuse\n\n \n \n Who said we were taking it lightly? They are there to protect us. We are searching for the man who killed 3000 of our people (whether he is in Iraq or not) and we are trying to eliminate terrorist cells in Iraq and other Middle Eastern countries who pose a threat to us.", 
   {}, 
   60669, 
   null, 
   1091468640.0
  ], 
  [
   60678, 
   null, 
   "emclean", 
   "All the libs who are bitching about loosing 900+ troops, do any of them care about the troops who die every week in training? They love to blame Bush or the deaths of volunteers, they all razed there right hand and agreed to do as they were told. If they were too dumb to understand that meant they could be sent to die on a foreign battle field that is there problem!\n \n I joined the airborne knowing that I could be sent to war, if there was any questions of that, basic training should have cleared it up. When they teach you how to run some one through with your bayonet, there should be little question.", 
   {}, 
   60669, 
   null, 
   1091469720.0
  ], 
  [
   60682, 
   null, 
   "georged", 
   "All the libs who are bitching about loosing 900+ troops, do any of them care about the troops who die every week in training? They love to blame Bush or the deaths of volunteers, they all razed there right hand and agreed to do as they were told. If they were too dumb to understand that meant they could be sent to die on a foreign battle field that is there problem!\n\n \n Not just 'libs' are complaining about the deaths from sending a military force to invade and occupy a sovereign nation that never attacked us, has not been connected to Bin Laden in the 9/11 event by a US bipartisan committee and found to be without the WMDs on which the action was rationalized. WW11 German and Japanese troops were merely following orders they swore to uphold, but that didn't make them any less abused by those issuing the command orders. Who would you recommend for taking responsibility for any of those deaths?", 
   {}, 
   60678, 
   null, 
   1091470740.0
  ], 
  [
   60685, 
   null, 
   "unkerpaulie", 
   "If that was the case, then we would have already lost 165,000 troops (we haven't even lost 1000). Protecting and serving our country doesn't mean you have to be stationed in the US to do that. Sometimes protecting the US involves going into another country. So you are quite wrong there. And you saif the VOLUNTEERED. That means they weren't obligated to go, they voluntarily chose to. So Bush didn't send them there to die.\n\n i said they volunteered to join the army. but being in the army they were sent to iraq. once you join the army, you are obligated to follow the orders of your commanders. yes, sometimes you have to go to where the enemy is to eliminate them, but the objective ultimately should be to defend your country. what we are doing is not defending our country, unless you look at the economic aspect. we have not neutralized any threat to our country by invading iraq. in fact, we have greatly escalated the threat of 165000 americans. the motive of the terrorists is to first eliminate the \"infidel\" americans from their land, and then worldwide. by holding iraq under seige we are perpetuating anti-american attacks on their turf. all this time we are not eliminating the real terrorists, who are the source of the attacks.\n \n \nWho said we were taking it lightly? They are there to protect us. We are searching for the man who killed 3000 of our people (whether he is in Iraq or not) and we are trying to eliminate terrorist cells in Iraq and other Middle Eastern countries who pose a threat to us.\n\n first of all, we all know that bin laden and any al qaeda goons are not in iraq. there are over a dozen countries right in the middle east vicinity that bin laden is in. but we have no troops in the states where we know bin laden is more likely to be. most of the actual terrorist arrests and discoveries have been made everywhere BUT iraq. particularly inplaces where we have NOT sent troops. yet in iraq we have had not arrests of any al qaeda members.", 
   {}, 
   60673, 
   null, 
   1091473320.0
  ], 
  [
   60694, 
   null, 
   "Bush Is The Man", 
   "i said they volunteered to join the army. but being in the army they were sent to iraq. once you join the army, you are obligated to follow the orders of your commanders. yes, sometimes you have to go to where the enemy is to eliminate them, but the objective ultimately should be to defend your country. what we are doing is not defending our country, unless you look at the economic aspect. we have not neutralized any threat to our country by invading iraq. in fact, we have greatly escalated the threat of 165000 americans. the motive of the terrorists is to first eliminate the \"infidel\" americans from their land, and then worldwide. by holding iraq under seige we are perpetuating anti-american attacks on their turf. all this time we are not eliminating the real terrorists, who are the source of the attacks.\n\n \n \n \n \n Defending your country doesn't mean only defending it INSIDE the country. Saddam threatened to use WMDs on us and some of our allies, so I consider that a pretty good threat. And not defending that threat would be putting our counrty at a serious risk. We know he was searching for WMDs, it's a fact. And he obviously planned to use them, or else he wouldn't even bother getting them. We actually have neutralized the terrorist threat by invading Iraq. How many US domestic terror attacks have happened since we invaded? 0. How many threats have their been? Hundreds. How many were successful? 0. I think that is considered neutralizing any threats. \"Real terrorists\"? What is a real terrorist? Any terrorist is an enemy of ours, and we will do whatever we need to do to eliminate terrorism.\n \n \n \n \n \nfirst of all, we all know that bin laden and any al qaeda goons are not in iraq. there are over a dozen countries right in the middle east vicinity that bin laden is in. but we have no troops in the states where we know bin laden is more likely to be. most of the actual terrorist arrests and discoveries have been made everywhere BUT iraq. particularly inplaces where we have NOT sent troops. yet in iraq we have had not arrests of any al qaeda members.\n\n \n \n \n We have no clue where Bin Laden is, or else we would have found him. And Al Qaeda is in Iraq. Have you not seen anything on the news about Al Zarqawi and his members kidnapping people IN Iraq and killing them? If not, I suggest looking at some news. You totally contradict yourself in this post. You first say that we shouldn't be in Iraq because they didn't attack, but then you say we should be in the over a dozen countries right in the Middle East. So you think we shouldn't invade other countries, but we should be in the Middle East? Make up your mind. You have no clue where Bin Laden is, neither do I. There are hundreds of other terrorist groups besides Al Qaeda. We are searching to eliminate all of them, not just Al Qaeda. Some of them are in Iraq.", 
   {}, 
   60685, 
   null, 
   1091478360.0
  ], 
  [
   60707, 
   null, 
   "apathy", 
   "Defending your country doesn't mean only defending it INSIDE the country. Saddam threatened to use WMDs on us and some of our allies, so I consider that a pretty good threat. \n\n \n Saddam never threatened us. Use the first person passive voice.\n We were threatened by Saddam. Big difference.\n (Actually we weren't. At least I wasn't, were you?)\n \n \n \nAnd Al Qaeda is in Iraq.\n\n \n They are everywhere, even in the US.\n \n \n \nThere are hundreds of other terrorist groups besides Al Qaeda. We are searching to eliminate all of them, not just Al Qaeda. Some of them are in Iraq.\n\n \n Are we really searching to eliminate them all? We wouldn't have to search too hard for Hezbollah or the PLO. hehe, we wouldn't have to search too hard for the IRA, either. Terrorist groups are all over and each have their own agenda. I really doubt we are searching for them all to eliminate them all.", 
   {}, 
   60694, 
   null, 
   1091484180.0
  ], 
  [
   60718, 
   null, 
   "apathy", 
   "Michael Moore was pretty much made to look like a fool by Bill O'Reilly. Moore made some brutal comments. And when he did, O'Reilly let him know. I can't believe how dumb Michael Moore is. Please read or watch his interview, and then let me know your thoughts on it.\n\n \n I didn't see it that way at all. \n \n Moore handled himself way better than I expected before I hit the play button. I thought for sure that he would be \"outfoxed\" to use a pun.\n \n All I saw in that debate was a distilled version of the debate that's going on all over. One side sees it one way and the other side sees it another way. One side sees the war as justified, and the other side doesn't. \n \n Both had tough questions for the other. \n \n Moore also said that Bush should apologize for the \"mixup.\" Since the buck stops with him, he really should. \n \n Blair has apologized for prisoner abuse. http://www.denverpost.com/Stories/0,1413,36%257E6439%257E2138266,00.html\n \n And for the war based on \"thin\" and \"shoddy\" intellegence.\n http://sfgate.com/cgi-bin/article.cgi?file=/c/a/2004/07/15/MNGKE7LMNE1.DTL&type=printable\n \"In a speech to Parliament almost immediately after the report was published, Blair said he has to accept that contrary to his expectations, 'it seems increasingly clear that at the time of the invasion, Saddam did not have stockpiles of chemical or biological weapons ready to deploy'......'I accept full personal responsibility for the way the issue was presented and therefore for any errors made,' he said in Parliament.\"\n \n This: \"'No single individual is to blame,' Butler said. 'This was a collective operation in which there were failures we have identified but there was no deliberate attempt on the part of the government to mislead.' But that cannot relieve Blair from the long-standing accusation that he took the country to war under false pretenses. At the very least, Blair did not tell the whole truth. When he made the case for war, his audience was left with the impression his passionate conviction was based on overwhelming evidence.\"\n from: http://china.org.cn/english/international/101437.htm\n You can substitute the name 'Bush' for 'Blair' above if you like and it fits perfectly.\n \n Pretty much spells it out. I guess the British prime minister has more respect for the British people than the American president has for the American people.", 
   {}, 
   60380, 
   null, 
   1091486760.0
  ], 
  [
   60768, 
   null, 
   "unkerpaulie", 
   "Defending your country doesn't mean only defending it INSIDE the country. Saddam threatened to use WMDs on us and some of our allies, so I consider that a pretty good threat. And not defending that threat would be putting our counrty at a serious risk. We know he was searching for WMDs, it's a fact. And he obviously planned to use them, or else he wouldn't even bother getting them. We actually have neutralized the terrorist threat by invading Iraq. How many US domestic terror attacks have happened since we invaded? 0. How many threats have their been? Hundreds. How many were successful? 0. I think that is considered neutralizing any threats. \"Real terrorists\"? What is a real terrorist? Any terrorist is an enemy of ours, and we will do whatever we need to do to eliminate terrorism.\n\n here are some of your misconceptions:\n \n - saddam never threatened to attack america with wmds (he didnt have any to begin with)\n - saddam didnt get any weapons\n - we have not neutralized any terrorist by invading iraq. all the captured terrorists were outside of iraq (you may see reports that jordanian terrorist al Zarqawi was alledgedly killed in iraq after americans bombed a mountain region where they suspected he was. this is the only dubious al qaeda link to iraq we have)\n - any enemy of america is not a terrorist\n \n besides, i did say that sometimes we have to go to another country to fight the enemy (re-read my post)\n \n \nWe have no clue where Bin Laden is, or else we would have found him. And Al Qaeda is in Iraq. Have you not seen anything on the news about Al Zarqawi and his members kidnapping people IN Iraq and killing them? If not, I suggest looking at some news. You totally contradict yourself in this post. You first say that we shouldn't be in Iraq because they didn't attack, but then you say we should be in the over a dozen countries right in the Middle East. So you think we shouldn't invade other countries, but we should be in the Middle East? Make up your mind. You have no clue where Bin Laden is, neither do I. There are hundreds of other terrorist groups besides Al Qaeda. We are searching to eliminate all of them, not just Al Qaeda. Some of them are in Iraq.\n\n there is no way anybody can link the kidnappings to al zarqawi. the kidnappers in iraq only message is to remove forces from iraq. yes their methods are terrorism, but that does not make them al qaeda. al qaeda's mission is to kill all the americans they can. the kidnappers mission is to terrorize the invaders and anybody that assists america.\n \n and yes, i did say put troops in the countries where al qaeda operatives have been actually found, and where we know they are from. places like jordan, sudan, saudi, iran, pakistan, etc. \n \n dont get me wrong, i think we should have a military presence in iraq investigating leads of terrorism. there should be even greater military presence in every single country where even more al qaeda activity has been found. but what bush has done is poured ALL the troops into irq only, and NONE of the troops in the other countries where known al qaeda operations are. explain that", 
   {}, 
   60694, 
   null, 
   1091546100.0
  ], 
  [
   60773, 
   null, 
   "Bush Is The Man", 
   "- saddam never threatened to attack america with wmds (he didnt have any to begin with).\n\n \n \n \n Saddam did threaten us, maybe not directly. He met with Bin Laden and offered him residence in Iraq. He sponsors several terrorist cells, he was searching for WMDs, and he asked all Iraqis to kill Americans. Those are threats, and they shouldn't be taken lightly.\n \n \n \n- saddam didnt get any weapons.\n\n \n \n \n \n He had mustard gas and sarin gas, which are WMDs. Now since nobody seems to believe mustard gas or sarin gas is a WMD, let me define it for you. These definitions come from www.thefreedictionary.com\n \n WMD-a weapon that kills or injures civilian as well as military personnel (nuclear and chemical and biological weapons) \n \n Biological Weapon-any weapon usable in biological warfare\n \n Chemical Weapon-chemical substances that can be delivered using munitions and dispersal devices to cause death or severe harm to people and animals and plants\n \n \n Mustard and sarin gas fit the description for a chemical weapon, and going backwards, you see that a chemical weapon is a WMD, therefore mustard and sarin gas are WMDs. So he did have WMDs, whether you want to believe it or not.\n \n \n \n \n- we have not neutralized any terrorist by invading iraq. all the captured terrorists were outside of iraq (you may see reports that jordanian terrorist al Zarqawi was alledgedly killed in iraq after americans bombed a mountain region where they suspected he was. this is the only dubious al qaeda link to iraq we have).\n\n \n \n \n \n Yes we have. Do you know how many terrorists we have killed or captured in Iraq alone? There have been over 500 killed in Iraq alone, not saying all of those are Al Qaeda. So you are wrong in saying that all captured terrorists were outside of Iraq. \n \n \n \n \n- any enemy of america is not a terrorist.\n\n \n \n \n \n True. I never said that though.\n \n \n \n \n \nthere is no way anybody can link the kidnappings to al zarqawi. the kidnappers in iraq only message is to remove forces from iraq. yes their methods are terrorism, but that does not make them al qaeda. al qaeda's mission is to kill all the americans they can. the kidnappers mission is to terrorize the invaders and anybody that assists america.\n\n \n \n \n \n Why not? He is claiming responsibility, and nobody else has. And get over the whole Al Qaeda thing. There are hundreds of other terrorists groups out there...Hamas, Hezbollah, Ansar Al Isalm, Mujahideen, etc. So perhaps Al Qaeda may not be in Iraq, but someone is.", 
   {}, 
   60768, 
   null, 
   1091552700.0
  ], 
  [
   60774, 
   null, 
   "Bush Is The Man", 
   "I didn't see it that way at all. \n \n Moore handled himself way better than I expected before I hit the play button. I thought for sure that he would be \"outfoxed\" to use a pun.\n \n \n \n \n \n Then you must have expected him to be a mute on the show. He was basically just there; he made no worthy comments. It was so bad he had to resort to an emotional hypothetical. He made no sense, and that comment had no part in the interview. Bush doesn't send kids to Iraq. First of all they volunteer. Second of all, they are older than 18. Please let me know what comments Michael Moore made that you thought were worthy. You might have trouble.\n \n \n \n \nAll I saw in that debate was a distilled version of the debate that's going on all over. One side sees it one way and the other side sees it another way. One side sees the war as justified, and the other side doesn't. \n \n Both had tough questions for the other.\n \n \n \n \n Correct about the first part. But tough questions? Michael Moore had 1 question, which was lame at that. He asked if O'Reilly would sacrifice his kid for Fallujah. What is that? First, we don't just send kids over there to sacrifice them. Second of all, we don't send kids. Third, those who go are volunteers. Fourth, it is to help secure the safety and freedoms for 280 million people. Sometimes people have to lose their lives for freedom, much like we did in the Revolutionary War.\n \n \n \nMoore also said that Bush should apologize for the \"mixup.\" Since the buck stops with him, he really should.\n \n \n \n \n Why should Bush apoligize? He didn't do anything wrong. If anyone needs to apoligize, it would be George Tenet and the CIA. They gave Bush the information that he used to go to war. Should he apologize for being decisive and doing what he thought was best for the safety of our homeland? Should he apologize for believing information from the CIA, about the most credible source he could get information from?", 
   {}, 
   60718, 
   null, 
   1091553480.0
  ], 
  [
   60780, 
   null, 
   "unkerpaulie", 
   "Why not? He is claiming responsibility, and nobody else has. And get over the whole Al Qaeda thing. There are hundreds of other terrorists groups out there...Hamas, Hezbollah, Ansar Al Isalm, Mujahideen, etc. So perhaps Al Qaeda may not be in Iraq, but someone is.\n\n and while the GUYS WHO MURDERED THOUSANDS OF INNOCENT AMERICANS runs around elsewhere actively plotting to attack america, where not gonna chase them, lets the other muslim countries that they belong to bring them in. instead, lets round up these local terrorists in iraq that had nothing to do with 9/11. yeah, that makes a lot of sense. bush is the man", 
   {}, 
   60773, 
   null, 
   1091556600.0
  ], 
  [
   60783, 
   null, 
   "Bush Is The Man", 
   "and while the GUYS WHO MURDERED THOUSANDS OF INNOCENT AMERICANS runs around elsewhere actively plotting to attack america, where not gonna chase them, lets the other muslim countries that they belong to bring them in. instead, lets round up these local terrorists in iraq that had nothing to do with 9/11. yeah, that makes a lot of sense. bush is the man\n\n \n \n \n We have no clue where Bin Laden is, or else we would have already got him. Don't you think? For all we know he could be in Iraq, but we are not in Iraq because of Bin Laden or to retalliate for 9/11. We are there to remove a brutal dictator who killed over 300,000 people and who threatened the world with WMDs. Just because they had nothing to do with 9/11 means absolutely nothing. They are killing people by the hundreds in Iraq right now.", 
   {}, 
   60780, 
   null, 
   1091558400.0
  ], 
  [
   60784, 
   null, 
   "unkerpaulie", 
   "We have no clue where Bin Laden is, or else we would have already got him. Don't you think? For all we know he could be in Iraq, but we are not in Iraq because of Bin Laden or to retalliate for 9/11. We are there to remove a brutal dictator who killed over 300,000 people and who threatened the world with WMDs. Just because they had nothing to do with 9/11 means absolutely nothing. They are killing people by the hundreds in Iraq right now. It does make sense, but maybe not to some ignorant and naive person, such as yourself. I just lost any bit of respect I ever had for you.\n\n pakistanis slaughter bangladesh people: 3,000,000 killed. america furnished pakistan with $3.8 mil (1971)\n cambodia genocide: 3,000,000 killed. america did nothing (1979)\n rwanda genocide: 800,000 killed. america did nothing (1994)\n (source)\n \n saddam's \"genocide\" is nothing compared to whats happening in sudan, libya, jordan, and many other countries that are much more of an immediate threat than iraq. but you are so engrossed in your awe of bush that you totally deny reality. seizing iraq is not making america safer. especially in the light that the 20 or so other countries that actually have terrorists and al qaeda affiliates are at large and being ignored by bush", 
   {}, 
   60783, 
   null, 
   1091561160.0
  ], 
  [
   60791, 
   null, 
   "Bush Is The Man", 
   "pakistanis slaughter bangladesh people: 3,000,000 killed. america furnished pakistan with $3.8 mil (1971)\n cambodia genocide: 3,000,000 killed. america did nothing (1979)\n rwanda genocide: 800,000 killed. america did nothing (1994)\n (source)\n\n \n \n \n \n First off, those events have nothing to do with Bush going to war in Iraq. He wasn't President then and they don't effect his decision to go to war with Iraq. You need to blame Nixon (Pakistan), Carter (Cambodia), and Clinton (Rwanda) for those acts. Bush had absolutely nothing to do with them. They actually further emphasize my point that we need to go to Iraq. We should have helped out those countries as well, but we didn't. And now that we have a President who is willing to do what it takes to keep this country safer, you criticize him. That is kind of hypocritical, if you ask me. You complain that we should have helped those countries out (and 2 of the Presidents who did nothing were Democrats), and then you complain that Bush is helping Iraq out. Make up your mind. Over 150,000 Kurds were killed by Saddam, over 100,000 other innocent civilians were killed, and 100s of politicians in Iraq were killed. So I would say Iraqis are the people right now who are going through the worst times. There is no other group out there that was persecuted as badly as them. \n \n \n \n \nsaddam's \"genocide\" is nothing compared to whats happening in sudan, libya, jordan, and many other countries that are much more of an immediate threat than iraq. but you are so engrossed in your awe of bush that you totally deny reality. seizing iraq is not making america safer. especially in the light that the 20 or so other countries that actually have terrorists and al qaeda affiliates are at large and being ignored by bush\n\n \n \n \n Yes it is. Just read this...\n \n \"Saddam has had approximately 40 of his own relatives murdered.\" \n \"Documented chemical attacks by the regime, from 1983 to 1988, resulted in some 30,000 Iraqi and Iranian deaths.\"\n \"Human Rights Watch estimates that Saddam's 1987-1988 campaign of terror against the Kurds killed as many as 100,000 Kurds.\"\n \"The Iraqi regime used chemical agents to include mustard gas and nerve agents in attacks against at least 40 Kurdish villages between 1987-1988. The largest was the attack on Halabja which resulted in approximately 5,000 deaths. 2,000 Kurdish villages were destroyed during the campaign of terror.\" \n \"Iraq's 13 million Shi'a Muslims, the majority of Iraq's population of approximately 22 million, face severe restrictions on their religious practice, including a ban on communal Friday prayer, and restriction on funeral processions.\" \n \"Over the past five years, 400,000 Iraqi children under the age of five died of malnutrition and disease, preventively, but died because of the nature of the regime under which they are living.\"\n \n \n Source=http://www.whitehouse.gov/infocus/iraq/news/20030404-1.html\n \n \n \n Name one country that is worse than that. Not Sudan (30,000 Africans have been killed, and this was not done by the government like Saddam's was). The numbers are nowhere even close to this in Libya or Jordan.", 
   {}, 
   60784, 
   null, 
   1091567160.0
  ], 
  [
   60795, 
   null, 
   "unkerpaulie", 
   "Yes it is. Just read this...\n \n \"Saddam has had approximately 40 of his own relatives murdered.\" \n \"Documented chemical attacks by the regime, from 1983 to 1988, resulted in some 30,000 Iraqi and Iranian deaths.\"\n \"Human Rights Watch estimates that Saddam's 1987-1988 campaign of terror against the Kurds killed as many as 100,000 Kurds.\"\n \"The Iraqi regime used chemical agents to include mustard gas and nerve agents in attacks against at least 40 Kurdish villages between 1987-1988. The largest was the attack on Halabja which resulted in approximately 5,000 deaths. 2,000 Kurdish villages were destroyed during the campaign of terror.\" \n \"Iraq's 13 million Shi'a Muslims, the majority of Iraq's population of approximately 22 million, face severe restrictions on their religious practice, including a ban on communal Friday prayer, and restriction on funeral processions.\" \n \"Over the past five years, 400,000 Iraqi children under the age of five died of malnutrition and disease, preventively, but died because of the nature of the regime under which they are living.\"\n \n Source= http://www.whitehouse.gov/infocus/iraq/news/20030404-1.html\n \n Name one country that is worse than that. Not Sudan (30,000 Africans have been killed, and this was not done by the government like Saddam's was). The numbers are nowhere even close to this in Libya or Jordan.\n\n and yet you havent once shown that iraq is a greater threat to america than the al qaeda operatives at large everywhere BUT iraq...\n \n what should happen: we know al qaeda operatives are in about 20 arab countries, including iraq. send troops to all these countries, with more powerful enforcements in those countries that have higher reports of al qaeda presence\n \n what bush did: just go to iraq, attempt to totally subdue and overthrow everything, including the resources. and dont send troops to any of the other arab states that we know terrorists are", 
   {}, 
   60791, 
   null, 
   1091568420.0
  ], 
  [
   60797, 
   null, 
   "Bush Is The Man", 
   "and yet you havent once shown that iraq is a greater threat to america than the al qaeda operatives at large everywhere BUT iraq...\n\n \n \n \n Well, I was responding to your assumption that we should have done something in Pakistan, Cambodia, and Rwanda. If you think we should have, then why shouldn't we do the same in Iraq? We have troops all over the place (Afghanistan, Phillippines, Greece, Egypt, UAE, Bahrain, etc). The reason we don't have to go into these countries is because they are helping us round up terrorists. Pakistan found a few high-ranking Al Qaeda members today. The reason we had to go into Iraq was because Saddam was harboring terrorists and would not force them to leave. So that completely answers your question why we don't invade other countries...because their government cooperates with us. \n \n \n \n \nwhat should happen: we know al qaeda operatives are in about 20 arab countries, including iraq. send troops to all these countries, with more powerful enforcements in those countries that have higher reports of al qaeda presence\n\n \n \n \n If the countries are cooperating, like Pakistan and Afghanistan, then we don't need a large force in those countries. But for countries like Iran and Sudan, we might need more troops because they will not cooperate with us. As soon as we get the elections done in Iraq and everything stabilizes, we will have more troops to move around. We can't just send our whole military out of the country at once. You should know that. You can only send what you have.\n \n \n \nwhat bush did: just go to iraq, attempt to totally subdue and overthrow everything, including the resources. and dont send troops to any of the other arab states that we know terrorists are\n\n \n \n \n Resources? We are not stealing oil from Iraq, so what are you trying to say? If we went to war for oil, we wouldn't be paying $2.00 a gallon now, would we? We overthrew Saddam because he was the Hitler of the 90s. He was mass murdering tons of people and threatening to use WMDs. So we got rid of that threat. We are getting NO money from the oil in Iraq. But Bush did send troops to other countries.", 
   {}, 
   60795, 
   null, 
   1091570520.0
  ], 
  [
   60798, 
   null, 
   "apathy", 
   "Then you must have expected him to be a mute on the show. He was basically just there; he made no worthy comments. It was so bad he had to resort to an emotional hypothetical. He made no sense, and that comment had no part in the interview. Bush doesn't send kids to Iraq. First of all they volunteer. Second of all, they are older than 18. Please let me know what comments Michael Moore made that you thought were worthy. You might have trouble.\n\n \n Ok, so you think that he was Outfoxed. Maybe you're right. But actually, most of the interview was Moore asking O'Reilly questions and O'Reilly squirming out of them.\n \n I thought this was a pretty good question:\n MOORE: OK, so he screws up September 11th. Why would you then listen to him, he says this is a \"slam dunk\" and your going to go to war?\n \n I don't think the answer was really sufficient.\n \n O'REILLY: You've got MI-6 and Russian intelligence because they're all saying the same thing that's why. You're not going to apologize to Bush, you are going to continue to call him a liar.\n \n Why would the US president rely on advice from a source (Tenet) that was a known failure, then also trust foreign intellegence services, including Russia, all while thumbing your nose at the UN (they were right this time) who said to hold off (since we already did for 12 years). Was Bush that scared? Why was Bush so passionately behind the war when they knew that the intellegence was thin (this is what MI-6 says, that the intel wasn't the most rock solid)?\n \n Maybe Moore was under too much pressure not to ask these questions, so maybe you're right that he didn't ask enough touhg questions. I don't think O'Rielly asked anything that great either though. That's why I saw the whole thing as a draw.\n \n \n \n \nCorrect about the first part. But tough questions? Michael Moore had 1 question, which was lame at that. He asked if O'Reilly would sacrifice his kid for Fallujah. What is that? First, we don't just send kids over there to sacrifice them. Second of all, we don't send kids. Third, those who go are volunteers. Fourth, it is to help secure the safety and freedoms for 280 million people. Sometimes people have to lose their lives for freedom, much like we did in the Revolutionary War.\n\n \n Let's count the questions.\n (1) MOORE: Over 900 of our brave soldiers are dead. What do you say to their parents?\n O'REILLY: What do I say to their parents? I say what every patriotic American would say: \"We are proud of your sons and daughters. They answered the call that their country gave them. We respect them and we feel terrible that they were killed.\"\n MOORE: But what were they killed for?\n O'REILLY: They were removing a brutal dictator who himself killed hundreds of thousands of people. (post war justification)\n MOORE: Um, but that was not the reason that was given to them to go to war: to remove a brutal dictator.\n O'REILLY: Well, we're back to the weapons of mass destruction.\n MOORE: But that was the reason...\n O'REILLY: The weapons of mass destruction...\n MOORE: That we were told we were under some sort of imminent threat...\n O'REILLY: That's right.\n MOORE: And there was no threat, was there?\n O'REILLY: It was a mistake.\n MOORE: Oh, just a mistake, and that's what you tell all the parents with a deceased child, \"We're sorry.\" I don't think that is good enough.\n O'REILLY: I don't think its good enough either for those parents. (what a liberal)\n MOORE: So we agree on that. \n \n (2) MOORE: Bill, if I made a mistake and I said something or did something as a result of my mistake but it resulted in the death of your child, how would you feel towards me?\n O'REILLY: It depends on whether the mistake was unintentional.\n MOORE: No, not intentional, it was a mistake.\n O'REILLY: Then if it was an unintentional mistake I cannot hold you morally responsible for that.\n MOORE: Really, I'm driving down the road and I hit your child and your child is dead.\n O'REILLY: If it were unintentional and you weren't impaired or anything like that.\n MOORE: So, that's all it is, if it was alcohol, even though it was a mistake - how would you feel towards me\n O'REILLY: OK, now we are wandering.\n MOORE: No, but my point is...\n O'REILLY: I saw what your point is and I answered your question. (evading)\n \n (3) MOORE: But why? What did they die for?\n O'REILLY: They died to remove a brutal dictator who had killed hundreds of thousands of people...\n MOORE: No, that was not the reason...\n O'REILLY: That's what they died for...\n MOORE: ...they were given...\n O'REILLY: The weapons of mass destruction was a mistake.\n MOORE: Well there were 30 other brutal dictators in this world...\n O'REILLY: Alright, I've got anther question...(evading and didn't get a question out)\n \n \n (5) MOORE: Would you sacrifice - just finish on this - would you sacrifice your child to remove one of the other 30 brutal dictators on this planet?\n O'REILLY: Depends what the circumstances were.\n MOORE: You would sacrifice your child?\n O'REILLY: I would sacrifice myself - I'm not talking for any children -to remove the Taliban. Would you?\n MOORE: Uh huh.\n O'REILLY: Would you? That's my next question. Would you sacrifice yourself to remove the Taliban?\n MOORE: I would be willing to sacrifice my life to track down the people that killed 3,000 people on our soil.\n \n Here's where Moore starts to screw up. He knows full well that we were totally justified in removing the Taliban from power. He could have used this to say there are some things that we have done in the name of stamping out terror that are justified and some that are not, since they have nothing to do with terrorism.\n \n (6) MOORE: Are you against that? Stopping this war?\n O'REILLY: No, we cannot leave Iraq right now, we have to...\n MOORE: So, you would sacrifice your child to secure Fallujah? I want to hear you say that.\n O'REILLY: I would sacrifice myself..\n MOORE: Your child? It's Bush sending the children there.\n O'REILLY: I would sacrifice myself.\n \n Really, now. Do you really think that Bill O'Reilly would lay down his life to know that US forces had control of Fallujah, Iraq? Come on.\n \n MOORE: You and I don't go to war, because we're too old...\n O'REILLY: Because if we back down, there will be more deaths and you know it.\n \n How many deaths would have been prevented by NOT invading? It's too late now because we screwed it up too much is not a good defense. Moore should have spotted that. But hey, I've never been on TV, lots of pressure.\n \n (7) MOORE: Wait a minute, terrorism? Iraq?\n O'REILLY: Yes. There are terrorist in Iraq. (and ireland and indonesia and...)\n MOORE: Oh really? So Iraq now is responsible for the terrorism here?\n O'REILLY: Iraq aided terrorists. Don't you know anything about any of that?\n MOORE: So, you're saying Iraq is responsible for what?\n O'REILLY: I'm saying that Saddam Hussein aided all day long. (no answer?)\n MOORE: You're not going to get me to defend Saddam Hussein.\n O'REILLY: I'm not? You're his biggest defender in the media.\n MOORE: Now come on.\n \n Exactly. Fox News LOVES saying people are behind Saddam or the Al-qaida, or that the terrorists support this person or that person. The sad thing is that a lot of people believe it.\n \n (8) MOORE: How do you deliver democracy to a country? You don't do it down the barrel of a gun. That's not how you deliver it.\n \n eh, getting tired of listing them by now... i think that was almost the end of the interview\n \n \n \n \nWhy should Bush apoligize? He didn't do anything wrong. If anyone needs to apoligize, it would be George Tenet and the CIA. They gave Bush the information that he used to go to war. Should he apologize for being decisive and doing what he thought was best for the safety of our homeland? Should he apologize for believing information from the CIA, about the most credible source he could get information from?\n\n \n Oh, but he did do something very wrong. Bush should apologize the way Blair did. Maybe Bush didn't lie, but he was wrong and his administration's mistakes were the cause of the deaths of 900+ american soldiers plus 1000s of innocent iraqi civilians, not to mention all the destruction and chaos. He is ultimately responsible.\n \n Bush wasn't decisive, he was rash. And we keep forgetting that there were plans to invade iraq before Bush was in office. There were plans for Haliburton before the first bomb was dropped. This is all a big lie.", 
   {
    "unicode_changes_made": true
   }, 
   60774, 
   null, 
   1091571720.0
  ], 
  [
   60799, 
   null, 
   "apathy", 
   "\n Yes it is. Just read this...\n \n \"Saddam has had approximately 40 of his own relatives murdered.\" \n \"Documented chemical attacks by the regime, from 1983 to 1988, resulted in some 30,000 Iraqi and Iranian deaths.\"\n \"Human Rights Watch estimates that Saddam's 1987-1988 campaign of terror against the Kurds killed as many as 100,000 Kurds.\"\n \"The Iraqi regime used chemical agents to include mustard gas and nerve agents in attacks against at least 40 Kurdish villages between 1987-1988. The largest was the attack on Halabja which resulted in approximately 5,000 deaths. 2,000 Kurdish villages were destroyed during the campaign of terror.\" \n \"Iraq's 13 million Shi'a Muslims, the majority of Iraq's population of approximately 22 million, face severe restrictions on their religious practice, including a ban on communal Friday prayer, and restriction on funeral processions.\" \n \"Over the past five years, 400,000 Iraqi children under the age of five died of malnutrition and disease, preventively, but died because of the nature of the regime under which they are living.\"\n \n Source=http://www.whitehouse.gov/infocus/iraq/news/20030404-1.html\n\n \n Look at the dates on those. If the war was really about all that then Regean would have sent troops, but he was too busy supporting Iraq in his war with Iran.\n \n And the kids died because of UN sanctions. Did the UN expect Saddam to use the oil money for humanitarian needs? The sanctions were a humanitarian blunder,to say the least, but they still kept Saddam from doing any serious military build up, which is why it was highly unlikely that he had any capability to attack the US or any of its allies.", 
   {}, 
   60791, 
   null, 
   1091572200.0
  ], 
  [
   60802, 
   null, 
   "Bush Is The Man", 
   "Ok, so you think that he was Outfoxed. Maybe you're right. But actually, most of the interview was Moore asking O'Reilly questions and O'Reilly squirming out of them.\n\n \n \n \n The questions had absolutely nothing to do with the interview. Hypothetical questions prove nothing. I could have asked \"Would you sacrifice your kid for Fallujah\" to a number of scenarios. What is the purpose of that question? Kids don't go to war anyway, and not all those adults who go die. So it was a pretty dumb question, if you ask me.\n \n \n \n \nO'REILLY: You've got MI-6 and Russian intelligence because they're all saying the same thing that's why. You're not going to apologize to Bush, you are going to continue to call him a liar.\n\n \n \n \n \n So he had 3 agencies telling him the same stuff. So Bush didn't lie, and maybe none of those agencies did either. TO DATE, we have found no WMDs in Iraq. That does not, by any means, mean that we won't find any. And I will expect an apology from Michael Moore and all his kronies when we do find some.\n \n \n \n \n \nMaybe Moore was under too much pressure not to ask these questions, so maybe you're right that he didn't ask enough touhg questions. I don't think O'Rielly asked anything that great either though. That's why I saw the whole thing as a draw.\n\n \n \n \n \n He was getting torn apart by O'Reilly. And 75,000 people answered the poll, and 85% thought less of Moore and only 15% thought more of him. So apparently, either Moore did extremely poor or O'Reilly did extremely well. Michael Moore contradicted himself very badly in the interview (sort of like how John Kerry changes his mind almost daily). When asked about Hitler, Michael Moore responded with \"I wouldn't have even allowed him to come to power\", which O'Reilly then pointed out was a pre-emption. But earlier in the interview, Michael Moore answered this question...\n \n \"O'REILLY: All right, you would not have removed the Taliban. You would not have removed that government?\n \n MOORE: No, unless it is a threat to us.\"\n \n That contradicts what he previously said. That should discredit his whole interview. He totally changed his mind in 5 seconds. That's pretty bad, if you ask me. \n \n \n \n \n \n \n \nLet's count the questions.\n\n \n \n \n I guess my argument was strong that that is the only thing you can point out. Thanks for the compliment.\n \n \n \n \n \nHere's where Moore starts to screw up. He knows full well that we were totally justified in removing the Taliban from power. He could have used this to say there are some things that we have done in the name of stamping out terror that are justified and some that are not, since they have nothing to do with terrorism.\n\n \n \n \n I lost all respect for Michael Moore when he began to ask questions. O'Reilly's questions were at least relevant and he quickly responded to all of Moore's brutal hypothetical questions. \n \n \n \n \nReally, now. Do you really think that Bill O'Reilly would lay down his life to know that US forces had control of Fallujah, Iraq? Come on.\n\n \n \n \n Does that have anything to do with the topic of the interview? That question has no relevance to the interview. It is all just a bunch of grabage just like Moore's propaganda. I can't believe people actually defend this guy. Does it matter if he would lay down his life? What if he said no? \n \n \n \n \n \n \nHow many deaths would have been prevented by NOT invading? It's too late now because we screwed it up too much is not a good defense. Moore should have spotted that. But hey, I've never been on TV, lots of pressure.\n\n \n \n \n Well, Saddam would probably still be killing innocent civilians and looking for WMDs, so who knows. Moore had no agenda when he went on that interview, and you can tell by the results.\n \n \n \n \nExactly. Fox News LOVES saying people are behind Saddam or the Al-qaida, or that the terrorists support this person or that person. The sad thing is that a lot of people believe it.\n\n \n \n \n They never said that. O'Reilly said that Iraq harbored terrorists. He didn't say they had anything to do with 9/11 or anything like that. Saddam did support terrorists; it's a fact. He paid the families of suicide bombers $25,000. That is supporting terrorism. He also offered Bin Laden a safe haven in Iraq. That is also aiding terrorism. Actually, the sad thing is that people believe Michael Moore's lies. His whole movie is based on snippits of video that are spliced to try and prove something that didn't happen. I consider it a fiction movie, not a documentary. You document true stuff, not lie about them for your own good.\n \n \n \n \n \n \nOh, but he did do something very wrong. Bush should apologize the way Blair did. Maybe Bush didn't lie, but he was wrong and his administration's mistakes were the cause of the deaths of 900+ american soldiers plus 1000s of innocent iraqi civilians, not to mention all the destruction and chaos. He is ultimately responsible.\n\n \n \n He didn't lie, so there is no need to apologize for lying. If you want to nit-pick, Clinton is responsible. He had several chances to kill Bin Laden and to search Saddam for WMDs, and did neither. So I choose to blame him then. He needs to apologize.\n \n \n \nBush wasn't decisive, he was rash. And we keep forgetting that there were plans to invade iraq before Bush was in office. There were plans for Haliburton before the first bomb was dropped. This is all a big lie.\n\n \n \n Maybe, but he wasn't a flip flopping Liberal like Kerry. Kerry would have said yes, and then a month later said no.", 
   {
    "unicode_changes_made": true
   }, 
   60798, 
   null, 
   1091574000.0
  ], 
  [
   60817, 
   null, 
   "apathy", 
   "The questions had absolutely nothing to do with the interview. Hypothetical questions prove nothing. I could have asked \"Would you sacrifice your kid for Fallujah\" to a number of scenarios. What is the purpose of that question? Kids don't go to war anyway, and not all those adults who go die. So it was a pretty dumb question, if you ask me.\n\n \n And O'Reilly's few questions weren't hypothetical? \n O'REILLY: OK, He never said that, but back to the other thing: If you, if Michael Moore is president...\n \n O'REILLY: Would you? That's my next question. Would you sacrifice yourself to remove the Taliban?\n \n O'REILLY: All right, you would not have removed the Taliban. You would not have removed that government?\n \n O'REILLY: Any government? Hitler, in Germany, not a threat to us the beginning but over there executing people all day long - you would have let him go?\n \n O'REILLY: Look, if you were running he would still be sitting there.\n \n O'REILLY: If you were running the country, he'd still be sitting there.\n \n These aren't dumb hypothetical questions? Did they prove anything?\n \n \n \nSo he had 3 agencies telling him the same stuff. So Bush didn't lie, and maybe none of those agencies did either. TO DATE, we have found no WMDs in Iraq. That does not, by any means, mean that we won't find any. And I will expect an apology from Michael Moore and all his kronies when we do find some.\n\n \n Bush, Cheney, and Rumsfeld went to the CIA asking what they had on Iraq, did they have anything they could use. They didn't rest until George Tenet told them what they wanted to hear. Why should I think that Blair didn't do the same with MI-6? I don't know why you see this as a \"mixup\" and not a very well-coordinated lie. \n \n \n \nHe was getting torn apart by O'Reilly. And 75,000 people answered the poll, and 85% thought less of Moore and only 15% thought more of him. So apparently, either Moore did extremely poor or O'Reilly did extremely well.\n\n \n What poll? I didn't see it. Do you have a link?\n Were all 75,000 regular Fox News watchers? or just 85%.\n \n \n \nMichael Moore contradicted himself very badly in the interview (sort of like how John Kerry changes his mind almost daily). When asked about Hitler, Michael Moore responded with \"I wouldn't have even allowed him to come to power\", which O'Reilly then pointed out was a pre-emption. But earlier in the interview, Michael Moore answered this question...\n \n \"O'REILLY: All right, you would not have removed the Taliban. You would not have removed that government?\n \n MOORE: No, unless it is a threat to us.\"\n \n That contradicts what he previously said. That should discredit his whole interview. He totally changed his mind in 5 seconds. That's pretty bad, if you ask me.\n\n \n I agreed that Moore screwed up in places, but I don't see how he contradicted himself right there. The wording in Moore's answer there implies that if they were a threat then he'd remove them, hypothetically. But you were saying that he just got trampled, which he didn't, because O'Reilly evaded question after question. That's pretty bad if you ask me.\n \n \n \nI guess my argument was strong that that is the only thing you can point out. Thanks for the compliment.\n\n \n So you take it as a compliment when someone points out how wrong you were? Your argument was that Moore had one stupid question for O'Reilly.\n I showed you that he asked at least 8 questions and to almost all of them O'Reilly couldn't give a straight answer.\n \n \n \nI lost all respect for Michael Moore when he began to ask questions. O'Reilly's questions were at least relevant and he quickly responded to all of Moore's brutal hypothetical questions. \n\n \n You, Bush Is the Man, had respect for Moore before the interview! They both answered very quickly, a little too quickly. O'Reilly couldn't really answer one of his questions.\n \n \nDoes that have anything to do with the topic of the interview? That question has no relevance to the interview. It is all just a bunch of grabage just like Moore's propaganda. I can't believe people actually defend this guy. Does it matter if he would lay down his life? What if he said no? \n\n \n Yes, it does matter if you would lay down your life. It is the ultimate hyposcisy to ask someone else to die for a \"mistake\" then not sacrifice your own life for the same \"cause.\" \n \n Notice he was very careful not to say no, since he would be a hypocrite.\n \n What was the topic of the interview anyway? \n \n \n \nWell, Saddam would probably still be killing innocent civilians and looking for WMDs, so who knows. Moore had no agenda when he went on that interview, and you can tell by the results.\n\n \n I thought you didn't like hypotheticals. How do you know what Saddam would be doing? How do you know that Iraq won't have the same kind of govt 10 years from now?\n \n Funny, so O'Reilly DID have an agenda? Was it to ask him 3-4 hypothetical questions then get run around his own interview?\n \n \n \n\n Exactly. Fox News LOVES saying people are behind Saddam or the Al-qaida, or that the terrorists support this person or that person. The sad thing is that a lot of people believe it.\n\n \nThey never said that. O'Reilly said that Iraq harbored terrorists. He didn't say they had anything to do with 9/11 or anything like that. Saddam did support terrorists; it's a fact. He paid the families of suicide bombers $25,000. That is supporting terrorism. He also offered Bin Laden a safe haven in Iraq. That is also aiding terrorism. Actually, the sad thing is that people believe Michael Moore's lies. His whole movie is based on snippits of video that are spliced to try and prove something that didn't happen. I consider it a fiction movie, not a documentary. You document true stuff, not lie about them for your own good.\n\n \n I have heard it NUMEROUS times. \"Which candidate would Al-Qaida want in office?\" -< \"anyone but Bush\" and \"kerry\" are typical resposes.\n \n As far as supporters of terrorism, Saddam was way down on the list, below Syria who funds and supports Hizbollah, and from what I understand 2/3 of the Saudi govt, who support AL-QAIDA.\n \n \n \n \nHe didn't lie, so there is no need to apologize for lying. If you want to nit-pick, Clinton is responsible. He had several chances to kill Bin Laden and to search Saddam for WMDs, and did neither. So I choose to blame him then. He needs to apologize.\n\n \n I can't prove that he did lie, even though I'm sure he was part of a long-standing plot to invade Iraq. Even if he really didn't lie, he should apologize for what he is admitting, which is royally screwing up. Blair was in the same boat and apologized. Bush didn't even apologize for the prisoner abuse. But, he continues to insist that the reasons given before the war were ample for invasion and that America is safer because of the war. That is laughable to say the least.\n \n When did Clinton have any opportunity to kill or capture Osama? I've recently heard that Sudan indeed did NOT actually offer him, they way it has been portrayed.\n \n \n \nMaybe, but he wasn't a flip flopping Liberal like Kerry. Kerry would have said yes, and then a month later said no.\n\n \n I'm really starting to think you work for the Bush campaign.\n I don't think any real person would even say \"flip-flop\" with a straight face.\n \n But, lets look at some Bush flip-flops. http://www.americanprogress.org/site/pp.asp?c=biJRJ8OVF&b=42263\n \n BUSH WANTS OSAMA DEAD OR ALIVE... \"I want justice. And there's an old poster out West, I recall, that says, 'Wanted: Dead or Alive.'\" [President Bush, on Osama Bin Laden, 09/17/01]\n \n ...BUSH DOESN'T CARE ABOUT OSAMA \"I don't know where he is.You know, I just don't spend that much time on him... I truly am not that concerned about him.\"[President Bush, Press Conference, 3/13/02]\n \n BUSH WILL NOT OFFER NUCLEAR NORTH KOREA INCENTIVES TO DISARM... \"We developed a bold approach under which, if the North addressed our long-standing concerns, the United States was prepared to take important steps that would have significantly improved the lives of the North Korean people. Now that North Korea's covert nuclear weapons program has come to light, we are unable to pursue this approach.\" [President's Statement, 11/15/02]\n \n ...BUSH ADMINISTRATION OFFERS NORTH KOREA INCENTIVES TO DISARM\"Well, we will work to take steps to ease their political and economic isolation. So there would be -- what you would see would be some provisional or temporary proposals that would only lead to lasting benefit after North Korea dismantles its nuclear programs. So there would be some provisional or temporary efforts of that nature.\" [White House Press Secretary Scott McClellan, 6/23/04]\n \n BUSH INVITES CHALABI TO STATE OF THE UNION ADDRESS...President Bush also met with Chalabi during his brief trip to Iraq last Thanksgiving [White House Documents 1/20/04, 11/27/03]\n \n ...BUSH MILITARY ASSISTS IN RAID OF CHALABI'S HOUSE \"U.S. soldiers raided the home of America's one-time ally Ahmad Chalabi on Thursday and seized documents and computers.\" [Washington Post, 5/20/04]\n \n BUSH SAYS WE FOUND THE WEAPONS OF MASS DESTRUCTION...\"We found the weapons of mass destruction. We found biological laboratories...for those who say we haven't found the banned manufacturing devices or banned weapons, they're wrong, we found them.\" [President Bush, Interview in Poland, 5/29/03]\n \n ...BUSH SAYS WE HAVEN'T FOUND WEAPONS OF MASS DESTRUCTION \"David Kay has found the capacity to produce weapons.And when David Kay goes in and says we haven't found stockpiles yet, and there's theories as to where the weapons went. They could have been destroyed during the war. Saddam and his henchmen could have destroyed them as we entered into Iraq. They could be hidden. They could have been transported to another country, and we'll find out.\" [President Bush, Meet the Press, 2/7/04]\n \n BUSH RESISTS AN OUTSIDE INVESTIGATION ON WMD INTELLIGENCE FAILURE... \"The White House immediately turned aside the calls from Kay and many Democrats for an immediate outside investigation, seeking to head off any new wide-ranging election-year inquiry that might go beyond reports already being assembled by congressional committees and the Central Intelligence Agency.\" [NY Times, 1/29/04]\n \n ...BUSH SUPPORTS AN OUTSIDE INVESTIGATION ON WMD INTELLIGENCE FAILURE \"Today, by executive order, I am creating an independent commission, chaired by Governor and former Senator Chuck Robb, Judge Laurence Silberman, to look at American intelligence capabilities, especially our intelligence about weapons of mass destruction.\" [President Bush, 2/6/04]\n \n BUSH OPPOSES CREATION OF INDEPENDENT 9/11 COMMISSION... \"President Bush took a few minutes during his trip to Europe Thursday to voice his opposition to establishing a special commission to probe how the government dealt with terror warnings before Sept. 11.\" [CBS News, 5/23/02]\n \n ...BUSH SUPPORTS CREATION OF INDEPENDENT 9/11 COMMISSION \"President Bush said today he now supports establishing an independent commission to investigate the Sept. 11 terrorist attacks.\" [ABC News, 09/20/02]\n \n BUSH OPPOSES TIME EXTENSION FOR 9/11 COMMISSION... \"President Bush and House Speaker J. Dennis Hastert (R-Ill.) have decided to oppose granting more time to an independent commission investigating the Sept. 11, 2001, attacks.\" [Washington Post, 1/19/04]\n \n ...BUSH SUPPORTS TIME EXTENSION FOR 9/11 COMMISSION \"The White House announced Wednesday its support for a request from the commission investigating the September 11, 2001 attacks for more time to complete its work.\" [CNN, 2/4/04]\n \n BUSH LIMITS TESTIMONY IN FRONT OF 9/11 COMMISSION TO ONE HOUR... \"President Bush and Vice President Dick Cheney have placed strict limits on the private interviews they will grant to the federal commission investigating the Sept. 11 attacks, saying that they will meet only with the panel's top two officials and that Mr. Bush will submit to only a single hour of questioning, commission members said Wednesday.\" [NY Times, 2/26/04]\n \n ...BUSH SETS NO TIMELIMIT FOR TESTIMONY \"The president's going to answer all of the questions they want to raise. Nobody's watching the clock.\" [White House spokesman Scott McClellan, 3/10/04]\n \n \n BUSH SAYS GAY MARRIAGE IS A STATE ISSUE... \"The state can do what they want to do. Don't try to trap me in this state's issue like you're trying to get me into.\" [Gov. George W. Bush on Gay Marriage, Larry King Live, 2/15/00]\n \n ...BUSH SUPPORTS CONSTITUTIONAL AMENDMENT BANNING GAY MARRIAGE \"Today I call upon the Congress to promptly pass, and to send to the states for ratification, an amendment to our Constitution defining and protecting marriage as a union of man and woman as husband and wife.\" [President Bush, 2/24/04]\n \n BUSH OPPOSES NATION BUILDING... \"If we don't stop extending our troops all around the world in nation-building missions, then we're going to have a serious problem coming down the road.\" [Gov. George W. Bush, 10/3/00]\n \n ...BUSH SUPPORTS NATION BUILDING \"We will be changing the regime of Iraq, for the good of the Iraqi people.\" [President Bush, 3/6/03]\n \n BUSH SAYS IT IS IMPOSSIBLE TO DISTINGUISH BETWEEEN AL QAEDA AND SADDAM... \"You can't distinguish between al Qaeda and Saddam when you talk about the war on terror.\" [President Bush, 9/25/02]\n \n ...BUSH SAYS SADDAM HAD NO ROLE IN AL QAEDA PLOT \"We've had no evidence that Saddam Hussein was involved in Sept. 11.\" [President Bush, 9/17/03]\n \n BUSH VOWS TO HAVE A UN VOTE NO MATTER WHAT... \"No matter what the whip count is, we're calling for the vote. We want to see people stand up and say what their opinion is about Saddam Hussein and the utility of the United Nations Security Council. And so, you bet. It's time for people to show their cards, to let the world know where they stand when it comes to Saddam.\" [President Bush 3/6/03]\n \n ...BUSH WITHDRAWS REQUEST FOR VOTE \"At a National Security Council meeting convened at the White House at 8:55 a.m., Bush finalized the decision to withdraw the resolution from consideration and prepared to deliver an address to the nation that had already been written.\" [Washington Post, 3/18/03]\n \n http://www.citizen.org/pressroom/release.cfm?ID=1674\n http://www.boston.com/news/globe/editorial_opinion/oped/articles/2004/06/05/steadfast_bushs_amazing_flip_flops/\n well just google \"Bush flip flop\"", 
   {
    "unicode_changes_made": true
   }, 
   60802, 
   null, 
   1091582940.0
  ], 
  [
   60857, 
   null, 
   "Bush Is The Man", 
   "And O'Reilly's few questions weren't hypothetical? \n O'REILLY: Any government? Hitler, in Germany, not a threat to us the beginning but over there executing people all day long - you would have let him go?\n \n These aren't dumb hypothetical questions? Did they prove anything?\n\n \n \n Notice the question about Hitler. That was to prove Michael Moore wrong. And that question made Moore contradict himself. He previously said he didn't believe in pre-emptive strikes, and then he said he wouldn't have allowed Hitler to come to power. That is a pre-emptive strike if you ask me. O'Reilly's hypothetical question related to a past event, and asked Moore what he would do if he was in FDRs shoes. Moore's hypothetical question related to nothing. Nobody sends their kids to Fallujah to just die. That's the difference between the 2. And it did prove something, that Michael Moore is nothing but a propagandist liar. Moore's hypothetical questions proved absolutely nothing. \n \n \n \n \n \nBush, Cheney, and Rumsfeld went to the CIA asking what they had on Iraq, did they have anything they could use. They didn't rest until George Tenet told them what they wanted to hear. Why should I think that Blair didn't do the same with MI-6? I don't know why you see this as a \"mixup\" and not a very well-coordinated lie.\n \n \n \n Did you see Gen. Tommy Franks interview last night? He said he met with the leaders of Egypt and Jordan, and they told him that Saddam has WMDs and that he was going to use them. Was he, along with Egypt and Jordan, lying? Was Putin lying? Yea i totally believe all of those countries had the exact same lie. Not really. They knew what Saddam was up to and they knew he was looking to get more weapons. The leader of Egypt specifically told Franks that Saddam had biological weapons and was going to use them against our troops.\n \n \n \n \n \nWhat poll? I didn't see it. Do you have a link?\n Were all 75,000 regular Fox News watchers? or just 85%.\n\n \n \n The poll was on Foxnews.com. He aired the interview last week, and the other day they showed the results. It was exactly 85% of the people who responded said they thought less of him and 15% though more or the same of him. 75,000 people responded. There was a link last week where you could vote, which I did. He announced the results on the show earlier this week. The 75,000 were just 75,000. Obviously, they had to go to Foxnews.com to vote. \n \n \n \n \nI agreed that Moore screwed up in places, but I don't see how he contradicted himself right there. The wording in Moore's answer there implies that if they were a threat then he'd remove them, hypothetically. But you were saying that he just got trampled, which he didn't, because O'Reilly evaded question after question. That's pretty bad if you ask me.\n\n \n \n You don't see how he contradicted himself? Contradicting yourself is saying one thing, and then saying the exact opposite. He first said he didn't believe in pre-emptive strikes, and wouldn't have gone after the Taliban. But then he said he wouldn't have let Hitler come to power, a pre-emption. I don't know if maybe you don't know the definition of \"contradiction\", I suggest looking it up. Well, the Taliban was a threat, and he said he wouldn't remove them. Then, when asked about Hitler, who wasn't a threat between 1933 and 1941, he said he wouldn't have let him come to power. And you calim his answer implies that if they were a threat, he'd remove them. But Hitler wasn't a threat and yet he would remove him, and the Taliban was a threat and yet he wouldn't remove them. You are kind of mixed up there. O'Reilly didn't evade anything. Moore was the one doing the evading. O'Reilly answered every question.\n \n \n \n \n \nSo you take it as a compliment when someone points out how wrong you were? Your argument was that Moore had one stupid question for O'Reilly.\n I showed you that he asked at least 8 questions and to almost all of them O'Reilly couldn't give a straight answer.\n\n \n \n \n Have you heard of the word \"sarcasm\"? Look at one up too. Yes it was a compliment, because you can only point out some small thing like this to say I'm wrong. I was right on every issue and you know it.\n \n \n \n \n \n \nYes, it does matter if you would lay down your life. It is the ultimate hyposcisy to ask someone else to die for a \"mistake\" then not sacrifice your own life for the same \"cause.\" \n\n \n \n \n But you don't have to lay down your life in that situation. It is not guaranteed that you will die, and parents don't just send kids there do sacrifice them. So his hypothetical questions were not all relevant. \n \n \n \n \n \nWhat was the topic of the interview anyway?\n\n \n \n \n It certainly wasn't, \"Would you sacrifice your kid for Fallujah\". Would you sacrifice your kid for New York? Stupid questions. \n \n \n \n \n \nI thought you didn't like hypotheticals. How do you know what Saddam would be doing? How do you know that Iraq won't have the same kind of govt 10 years from now?\n \n Funny, so O'Reilly DID have an agenda? Was it to ask him 3-4 hypothetical questions then get run around his own interview?\n\n \n \n \n It was to ask him his run around, and then prove him wrong. Bush didn't lie. Michael Moore contradicted himself. Moore didn't answer all of O'Reilly's questions. O'Reilly answered all of Moore's question.\n \n \n \n \n \n \n \nI can't prove that he did lie, even though I'm sure he was part of a long-standing plot to invade Iraq. Even if he really didn't lie, he should apologize for what he is admitting, which is royally screwing up. Blair was in the same boat and apologized. Bush didn't even apologize for the prisoner abuse. But, he continues to insist that the reasons given before the war were ample for invasion and that America is safer because of the war. That is laughable to say the least.\n\n \n \n \n Then if you can't prove it, then don't say that he did. That is falsely accusing someone. That is what everyone out there is doing. Why should he apologize for prisoner abuse? He didn't put them up to it. They did it themselves. They need to apologize. Does Bush need to apologize for Mark hacking killing his wife? Does the governor of California apologize when a cop beats up an African American? No, they don't.\n \n \n \nWhen did Clinton have any opportunity to kill or capture Osama? I've recently heard that Sudan indeed did NOT actually offer him, they way it has been portrayed.\n\n \n \n \n I will show you right here and prove whatever doubts you have wrong. \n (Bin Laden shelterd in Iraq) This is from the 9/11 Commission...http://www.gpoaccess.gov/911/ Go to chapter 2, page 66-67. I will pull the quotes out for you.\n (Clinton) http://daily.nysun.com/Repository/getmailfiles.asp?Style=OliveXLib:ArticleToMail&Type=text/html&Path=NYS/2004/07/23&ID=Ar01000\n \n \n Go to chapter 2, page 66-67. I will pull the quotes out for you.\n \n \n Clinton having the chance to kill Bin Laden...\"In 1998, President Clinton announced, \"We will use all the means at our disposal to bring those responsible to justice, no matter what or how long it takes\" talking about Bin Laden\". In 1998, we had drones flying over Afghanistan and spotted Bin Laden and tracked him for 3 days. But Clinton didn't want to do anything because \"if civilian casualties result, we will be blamed\". What a joke. He was one of the most dangerous men in the world. He also had US snipers locked in on Bin Laden and told them to stand down.  \n \n \n Saddam offering Bin Laden shelter in Iraq...\"There is also evidence that around this time Bin Ladin sent out a number\n of feelers to the Iraqi regime, offering some cooperation. None are reported\n to have received a significant response. In mid-1998, the situation reversed; it was Iraq that reportedly took the initiative. In July, an Iraqi delegation traveled to Afghanistan to meet first with\n the Taliban and then with Bin Ladin. Similar meetings between Iraqi officials and Bin Ladin or his aides may have\n occurred in 1999 during a period of some reported strains with the Taliban.\n According to the reporting, Iraqi officials offered Bin Ladin a safe haven in Iraq.\"\n \n \n \nI'm really starting to think you work for the Bush campaign.\n I don't think any real person would even say \"flip-flop\" with a straight face.\n\n \n \n I can, but only when I use Kerry in the same sentence.\n \n \n \n \nBut, lets look at some Bush flip-flops. http://www.americanprogress.org/site/pp.asp?c=biJRJ8OVF&b=42263\n \n well just google \"Bush flip flop\"\n\n \n \n \n Bush doesn't change his cpmpletely mind like Kerry does. He instead said he was focusing on other things at that time. Kerry simply just changes his mind when he feels it will work better for him, not because he really believes it.", 
   {
    "unicode_changes_made": true
   }, 
   60817, 
   null, 
   1091640060.0
  ], 
  [
   60862, 
   null, 
   "jim's trucking", 
   "and yet you havent once shown that iraq is a greater threat to america than the al qaeda operatives at large everywhere BUT iraq...\n \n what should happen: we know al qaeda operatives are in about 20 arab countries, including iraq. send troops to all these countries,  with more powerful enforcements in those countries that have higher reports of al qaeda presence\n \n what bush did: just go to iraq, attempt to totally subdue and overthrow everything, including the resources. and dont send troops to any of the other arab states that we know terrorists are\n\n \n So, you want to invade several more countries? You don't just send troops to another country and say \"Don't mind us. We're just looking for terrorists.\"", 
   {}, 
   60795, 
   null, 
   1091641680.0
  ], 
  [
   60868, 
   null, 
   "unkerpaulie", 
   "So, you want to invade several more countries? You don't just send troops to another country and say \"Don't mind us. We're just looking for terrorists.\"\n\n why not? if its as big a deal as bush said it was just after 9/11, then we would do just that. the rate of terrorist shut downs cold have been way higher if bush really was interested in actually shutting down terrorism.\n \n just as bush convinced the american public that he was right to invade iraq, what makes you think the public wouldnt support him even more if we had military investigators in EVERY country that supports terrorism and start hauling them out. you think we'd be mad at bush for that?", 
   {}, 
   60862, 
   null, 
   1091645220.0
  ], 
  [
   60879, 
   null, 
   "jim's trucking", 
   "why not? if its as big a deal as bush said it was just after 9/11, then we would do just that. the rate of terrorist shut downs cold have been way higher if bush really was interested in actually shutting down terrorism.\n \n just as bush convinced the american public that he was right to invade iraq, what makes you think the public wouldnt support him even more if we had military investigators in EVERY country that supports terrorism and start hauling them out. you think we'd be mad at bush for that?\n\n \n Then you'd have us making many enemies of people who now give us assistance in fighting terrorism.\n \n Bush didn't have to convince me it was right to invade Iraq. I already knew it. He didn't have to convince congress that Saddam should be deposed. They'd already voted on it (before he got in office).\n \n Just because you think you have a better idea about how to conquer terrorism doesn't mean that what Bush is doing is wrong.\n \n There will be another terrorist attack within our borders. I believe strongly that you can count on it. When it happens, it will not have been Bush's fault...but the liberals will make it sound so. You can count on that, too.", 
   {}, 
   60868, 
   null, 
   1091647980.0
  ], 
  [
   60897, 
   null, 
   "unkerpaulie", 
   "Then you'd have us making many enemies of people who now give us assistance in fighting terrorism.\n\n if the state police forces are tracking and capturing terrorists who plan to attack america, and america sends military to help them with this task, how is that making more enemies? i never said invade those countries, i said send troops there. we dont send troops to countries only when we plan to oust their leadership, now do we?\n \n \nBush didn't have to convince me it was right to invade Iraq. I already knew it. He didn't have to convince congress that Saddam should be deposed. They'd already voted on it (before he got in office).\n\n yes, but they were all working towards the same goals. a cadre of politicians agreeing on something hardly makes it legit, even though they can make it legal\n \n \nJust because you think you have a better idea about how to conquer terrorism doesn't mean that what Bush is doing is wrong.\n\n if bush's action is saying he's working towards conquering terrorism, and his actions are totally opposite, then he is wrong. does anybody ever look at actions anymore?\n \n \nThere will be another terrorist attack within our borders. I believe strongly that you can count on it. When it happens, it will not have been Bush's fault...but the liberals will make it sound so. You can count on that, too.\n\n if the attack comes from one of the countries bush didnt bother to send troops to, then it will obviously be his fault. if it comes from within america, i will not blame bush. but if its launched from anywhere in the middle-east, particular from any of the countries that we \"suspect\" bin laden to be, bush will be the laughing stock of much more than the democrats. God forbid", 
   {}, 
   60879, 
   null, 
   1091649960.0
  ], 
  [
   60909, 
   null, 
   "Freedom_Fighter", 
   "if the state police forces are tracking and capturing terrorists who plan to attack america, and america sends military to help them with this task, how is that making more enemies? i never said invade those countries, i said send troops there. we dont send troops to countries only when we plan to oust their leadership, now do we? \n\n \n I didn't realize stopping terrorism was so simple. Apparently all we need to do is send troops to all the countries where terrorist cells are operating and we stop them dead in their tracks. Honestly does anyone think that this would actually work? Lets break down the problems with this approach:\n \n 1)The United States has only invaded countries whose leaders refused to cooperate with the war on terror and threatened the security interests of the United States or allies in the region. Sending troops into another state that was cooperating in the war on terror and didn't request additional assistance would be a violation of that nation's sovereignty. How would American citizens respond if we had coalition troops operating inside our borders to respond intelligence that there are terrorist cells operating inside the US?\n \n \nif bush's action is saying he's working towards conquering terrorism, and his actions are totally opposite, then he is wrong. does anybody ever look at actions anymore? \n\n \n 2) The above statement rings true if one considers forming a 48 nation coalition, (35 have troops in Iraq) achieving support for the war on terror from previously unsupportive nations Pakistan, Afghanistan, etc., freeing over 25 million people from a Gestapo-like totalitarian regime, and destroying 3/4 of the al-qaeda terrorist network actions that are opposite of conquering terrorism. In addition to these there was also the creation of the Dept of Homeland Defense and the fact that there has not been a terrorist attack on US soil since the 9/11 attacks.\n \n The fact of the matter is that the US cannot be everywhere at once. We must focus our troops where they can make the biggest difference and work with our allies to ensure that they bring the fight to the terrorists hiding in their backyards. The United States may not be able to be \"the world's policeman\" but we sure can form a \"community watch\" and lead by determined and unflinching leadership. It is only by encouraging other countries to cooperate with us without actually requiring US to commit troops that we will in the end defeat terrorism.\n We are embroiled in war that is by its very nature a global threat and we must support our friends in the fight and caution our detractors to be wary of taking the wrong side. Eventually this fight will come to all non-fundamentalist nations and our detractors will regret ever faltering in the face of adversity.", 
   {
    "unicode_changes_made": true
   }, 
   60897, 
   null, 
   1091653200.0
  ], 
  [
   60923, 
   null, 
   "jim's trucking", 
   "if the state police forces are tracking and capturing terrorists who plan to attack america, and america sends military to help them with this task, how is that making more enemies? i never said invade those countries, i said send troops there. we dont send troops to countries only when we plan to oust their leadership, now do we?\nJust as the Greeks want to provide the first line of policing the Olympics, some countries may want to be in charge of hunting terrorists on their own soil. We should respect that until they prove themselves insincere.\n \n \n\n yes, but they were all working towards the same goals. a cadre of politicians agreeing on something hardly makes it legit, even though they can make it legal\nYou say this as if democracy means nothing to you. When politicians consider and vote on a subject, it is the policy of the nation, not just the President. It appears that you'll blame the President for anything that happens on his watch.\n \n \n\n if bush's action is saying he's working towards conquering terrorism, and his actions are totally opposite, then he is wrong. does anybody ever look at actions anymore?\n What actions has Bush taken that have increased terrorism directly. Sure, their knee-jerk reaction to our presense in Iraq has increase incidences there, but overall, terrorism is weakening...we're getting information from computers of captured terrorists that will lead to others. Someday they'll be diminished to the point that they can't keep a following.\n \n \n\n if the attack comes from one of the countries bush didnt bother to send troops to, then it will obviously be his fault. if it comes from within america, i will not blame bush. but if its launched from anywhere in the middle-east, particular from any of the countries that we \"suspect\" bin laden to be, bush will be the laughing stock of much more than the democrats. God forbid\nThere won't be any blame that can be validly attached to Bush or whoever is President when it happens. The man is trying to capture (kill) bin Laden. What would you do?\n \n On a much grander scale, terrorism is sort of like some serial killer cases that have put people on nerves. The Son of Sam, The Missing Atlanta Children, Jack the Ripper, the DC Area Sniper, to name a few. Kadafi was threat 'til we put a bomb right next to him. The killers I named have been caught and their killing stopped. When we kill enough of the terrorists, their killing will stop.", 
   {}, 
   60897, 
   null, 
   1091655420.0
  ], 
  [
   60928, 
   null, 
   "jim's trucking", 
   "I didn&#8217;t realize stopping terrorism was so simple. ...\nThat's one reason the opponents of Bush have a problem with what he is doing. The armchair quarterbacks always think they can do better and have a simple plan for doing so.", 
   {}, 
   60909, 
   null, 
   1091655780.0
  ], 
  [
   60935, 
   null, 
   "unkerpaulie", 
   "so while we cant do anything about the terrorist activity in jordan, egypt, sudan, pakistan, for that matter EVERY country other than afghanistan and iraq, lets just totally dominate iraq, and in that way the terrorists will be confused and decide not to continue planning their missions in the safety of the other 2 dozen countries\n \n do you think the afghanis welcomed the us invasion?\n \n and while i still appreciate what the pakistani authorities are doing, i am appaled that bush is making no effort to put troops and military investigators in the OTHER countries that also support the terrorists...\n \n since weve declared ourselves permitted to invade iraq, lets do that with full force. and make no attempt to even infiltrate the other countries that have stronger ties to bin laden than iraq. thats what bush calls logic", 
   {}, 
   60928, 
   null, 
   1091656440.0
  ], 
  [
   60950, 
   null, 
   "jim's trucking", 
   "so while we cant do anything about the terrorist activity in jordan, egypt, sudan, pakistan, for that matter EVERY country other than afghanistan and iraq, lets just totally dominate iraq, and in that way the terrorists will be confused and decide not to continue planning their missions in the safety of the other 2 dozen countries\nObtuse comes to mind.\n \n \n\n do you think the afghanis welcomed the us invasion?\nSome did, some didn't. Talk to the women there and get back to me.\n \n \n\n and while i still appreciate what the pakistani authorities are doing, i am appaled that bush is making no effort to put troops and military investigators in the OTHER countries that also support the terrorists...\nIf you knew everything that Bush is planning, it'd be all over the internet by midnight.\n \n \n\n since weve declared ourselves permitted to invade iraq, lets do that with full force. and make no attempt to even infiltrate the other countries that have stronger ties to bin laden than iraq. thats what bush calls logic\nWe'll spend quite a few years helping rebuild Iraq. I have a friend doing that now. He tells of things you cannot see unless you go there. Those people have lived under a tyrant for more than 30 years. Saddam cared more about his palaces than the infrastructure of his country. Their generating equipment is antique and ill-kept. Unless you expect a Genie to blink and fix it all, you should understand this will be a long rebuilding process. (And it's not due to war damages. It's due to decades of neglect.)\n \n If you want to spend billions more right now to fix every country on your list, you'll advocate more damage to the economy than any President has ever fathered.\n \n We are not there to take over their oil or their soil. As Colin Powell once put it when responding to someone accusing the United States of colonialism, \"We've never ask anything of the countries we go to except for a place to bury our dead\".", 
   {}, 
   60935, 
   null, 
   1091657700.0
  ], 
  [
   60954, 
   null, 
   "unkerpaulie", 
   "We'll spend quite a few years helping rebuild Iraq. I have a friend doing that now. He tells of things you cannot see unless you go there. Those people have lived under a tyrant for more than 30 years. Saddam cared more about his palaces than the infrastructure of his country. Their generating equipment is antique and ill-kept. Unless you expect a Genie to blink and fix it all, you should understand this will be a long rebuilding process. (And it's not due to war damages. It's due to decades of neglect.)\n \n If you want to spend billions more right now to fix every country on your list, you'll advocate more damage to the economy than any President has ever fathered.\n \n We are not there to take over their oil or their soil. As Colin Powell once put it when responding to someone accusing the United States of colonialism, \"We've never ask anything of the countries we go to except for a place to bury our dead\".\n\n what are you talking about. the war is about fighting terrorism. i cant see how liberating iraq could possibly supercede capturing bin laden, but thats what we're spending billions and years to do. and bin laden is still at large. saddam's atrocities should never become a priority over the capture of bin laden", 
   {}, 
   60950, 
   null, 
   1091658120.0
  ], 
  [
   60976, 
   null, 
   "Bush Is The Man", 
   "what are you talking about. the war is about fighting terrorism. i cant see how liberating iraq could possibly supercede capturing bin laden, but thats what we're spending billions and years to do. and bin laden is still at large. saddam's atrocities should never become a priority over the capture of bin laden\n\n \n \n We are fighting terrorism. We have destroyed 3/4 of the Taliban, and we are killing Al Qaeda by the dozens. Pakistan and Afghanistan are capturing terrorists all day long. So it is about fighting terrorism, which we are doing a pretty damn good job of. It's not like we just forgot about Bin Laden. We are still looking for him. We don't need 160,000 troops to look for him though. You dont think killing 300,000 innocent people is severe? I think that should make it a top priority, considering he also threatened to obtain and use WMDs on us and other countries that were in his way.", 
   {}, 
   60954, 
   null, 
   1091660340.0
  ], 
  [
   60985, 
   null, 
   "apathy", 
   "Notice the question about Hitler. That was to prove Michael Moore wrong. And that question made Moore contradict himself. He previously said he didn't believe in pre-emptive strikes, and then he said he wouldn't have allowed Hitler to come to power. That is a pre-emptive strike if you ask me. O'Reilly's hypothetical question related to a past event, and asked Moore what he would do if he was in FDRs shoes. Moore's hypothetical question related to nothing. Nobody sends their kids to Fallujah to just die. That's the difference between the 2. And it did prove something, that Michael Moore is nothing but a propagandist liar. Moore's hypothetical questions proved absolutely nothing. \n\n \n You said, and I quote \"Hypothetical questions prove nothing.\"\n You wouldn't be flip-flopping, would you?\n \n \n \n \n \nDid you see Gen. Tommy Franks interview last night? He said he met with the leaders of Egypt and Jordan, and they told him that Saddam has WMDs and that he was going to use them. Was he, along with Egypt and Jordan, lying? Was Putin lying? Yea i totally believe all of those countries had the exact same lie. Not really. They knew what Saddam was up to and they knew he was looking to get more weapons. The leader of Egypt specifically told Franks that Saddam had biological weapons and was going to use them against our troops.\n\n \n It was on the Guide for the satellite, there it was \"Nightline\" but the GD local station was playing an extra episode of \"Friends.\" :xbanghead \n \n Egypt and Jordan hated Saddam. You don't think they would support a lie to remove him, or even lie so that the US would be more likely to do so? Maybe the deal was: we won't scream and shout to the UN if when you depose Saddam, you get the hell out and install an arab govt, and once you build up the oil infrastructure you can pillage it for a while and we'll look the other way. Putin could have been on the same conference call.\n Just because 10 people lie doesn't mean it's not a lie.\n \n But that's all hypothetical (and quite plausible), I know you don't like that.\n \n \n \n \nThe poll was on Foxnews.com.\n\n Oh, I guessed right!\n \n \nHe aired the interview last week, and the other day they showed the results. It was exactly 85% of the people who responded said they thought less of him and 15% though more or the same of him. 75,000 people responded. There was a link last week where you could vote, which I did. He announced the results on the show earlier this week. The 75,000 were just 75,000. Obviously, they had to go to Foxnews.com to vote. \n\n So the interview was put on Fox News, which is more likely to be watched by republicans than anybody else, since it says things they want to hear. Then the poll was on the website, where a portion of those republicans would voice their opinion. Yeah, that's a pretty good sampling of the entire population.\n I'll bet a poll on Moore's website would be 85% the other way. \n \n \n \nYou don't see how he contradicted himself? Contradicting yourself is saying one thing, and then saying the exact opposite.\n\n \n You mean like when he said that hypothetical questions prove nothing, then said that his answers to hypothetical questions prove something? Oh, wait, that was you.\n \n \n \nHave you heard of the word \"sarcasm\"? Look at one up too. Yes it was a compliment, because you can only point out some small thing like this to say I'm wrong. I was right on every issue and you know it.\n\n \n I have no idea what you're talking about. You gave your opinion of the interview. I gave mine. You can have you're opinion and think it's right, but just saying you're right doesn't make it so.\n \n \n \n \n \n \nIt was to ask him his run around, and then prove him wrong. Bush didn't lie. Michael Moore contradicted himself. Moore didn't answer all of O'Reilly's questions. O'Reilly answered all of Moore's question.\n\n \n If that's the way you want to see it, I can't stop you. \n Maybe you are letting your emotions toward Michael Moore form your opinions for you.\n \n \n \nThen if you can't prove it, then don't say that he did. That is falsely accusing someone.\n\n \n You're right, OJ was innocent. So were the cops that beat Rodney King.\n I can't prove anything, can I?\n \n \nThat is what everyone out there is doing. Why should he apologize for prisoner abuse? He didn't put them up to it. They did it themselves. They need to apologize. Does Bush need to apologize for Mark hacking killing his wife? Does the governor of California apologize when a cop beats up an African American? No, they don't.\n\n \n Hehe, that's funny, but they should. Well, maybe the police chief should. He is responsible for the behavior of those in his command. Rummy apologized for the prison thing, begrudgingly, but he did it. Blair apologized for everything because he realizes that no matter what, it's his responsibilty and his fault.\n Why are these guys apologizing if nobody did anything wrong?\n \n \n \nI will show you right here and prove whatever doubts you have wrong. \n (Bin Laden shelterd in Iraq) This is from the 9/11 Commission...http://www.gpoaccess.gov/911/ Go to chapter 2, page 66-67. I will pull the quotes out for you.\n (Clinton) http://daily.nysun.com/Repository/getmailfiles.asp?Style=OliveXLib:ArticleToMail&Type=text/html&Path=NYS/2004/07/23&ID=Ar01000\n \n \n Go to chapter 2, page 66-67. I will pull the quotes out for you.\n \n \n Clinton having the chance to kill Bin Laden...\"In 1998, President Clinton announced, \"We will use all the means at our disposal to bring those responsible to justice, no matter what or how long it takes\" talking about Bin Laden\". In 1998, we had drones flying over Afghanistan and spotted Bin Laden and tracked him for 3 days. But Clinton didn't want to do anything because \"if civilian casualties result, we will be blamed\". What a joke. He was one of the most dangerous men in the world. He also had US snipers locked in on Bin Laden and told them to stand down.  \n \n \n Saddam offering Bin Laden shelter in Iraq...\"There is also evidence that around this time Bin Ladin sent out a number\n of feelers to the Iraqi regime, offering some cooperation. None are reported\n to have received a significant response. In mid-1998, the situation reversed; it was Iraq that reportedly took the initiative. In July, an Iraqi delegation traveled to Afghanistan to meet first with\n the Taliban and then with Bin Ladin. Similar meetings between Iraqi officials and Bin Ladin or his aides may have\n occurred in 1999 during a period of some reported strains with the Taliban.\n According to the reporting, Iraqi officials offered Bin Ladin a safe haven in Iraq.\"\n\n \n Ok, I can find the first quote in the article you link to, but not in the 9/11 report, the only one i'll take seriously. The second quote comes from the report. Maybe I'm not looking hard enough, that report is long.\n \n If they would have given him safe haven, we would have every right to invade in order to capture him, maybe even despite all the collateral damage.\n But that did not happen. I'm sure there were many other countries willing to take him in, and there were.\n \n As to the article you cite, Berger was right. There was nothing to indicate at the time that a \"war\" with al-qaida was warranted. All of the attacks to that date had been on par with other terrorist groups. They weren't exactly sure where bin laden was. This was all before 9/11, which may or may not have been prevented by bin laden's capture. Are we getting hypothetical here? I hope not since I know how much that bugs you. \n \n To think that some sniper had bin laden in his sites and was told to stand down is funny. Anyway, I did a word search for \"sniper\" in the 9/11 report and there were no hits.\n \n \n \nBush doesn't change his cpmpletely mind like Kerry does. He instead said he was focusing on other things at that time. Kerry simply just changes his mind when he feels it will work better for him, not because he really believes it.\n\n \n So Bush only changes his mind when he can't focus?\n How often does that happen?", 
   {}, 
   60857, 
   null, 
   1091662320.0
  ], 
  [
   60990, 
   null, 
   "Bush Is The Man", 
   "You said, and I quote \"Hypothetical questions prove nothing.\"\n You wouldn't be flip-flopping, would you?\n\n \n \n \n In certain instances they prove nothing, like when they have no relevancy to what they are talking about. O'Reilly's hypothetical question came about because Michael Moore said he wouldn't have attacked the Taliban, but we should attack those who pose a threat to us, which they did. Just a quick question...did you look up contradict like I asked you? Or do you just concede you were wrong again?\n \n \n \n\"I agreed that Moore screwed up in places, but I don't see how he contradicted himself right there. The wording in Moore's answer there implies that if they were a threat then he'd remove them.\" you stated.\n\n \n \n \n \n \nEgypt and Jordan hated Saddam. You don't think they would support a lie to remove him, or even lie so that the US would be more likely to do so? Maybe the deal was: we won't scream and shout to the UN if when you depose Saddam, you get the hell out and install an arab govt, and once you build up the oil infrastructure you can pillage it for a while and we'll look the other way. Putin could have been on the same conference call.\n Just because 10 people lie doesn't mean it's not a lie.\n\n \n \n \n So you basically think the whole world has conspired to allow us to attack Iraq? Come on, you could pass for Michael Moore with that comment.\n \n \n \n \n \n \nSo the interview was put on Fox News, which is more likely to be watched by republicans than anybody else, since it says things they want to hear. Then the poll was on the website, where a portion of those republicans would voice their opinion. Yeah, that's a pretty good sampling of the entire population. I'll bet a poll on Moore's website would be 85% the other way.\n \n \n \n \n Well, considering he interviewed Michael Moore on his TV show, it seems rather obvious that he would be doing the poll. It didn't say do you not like Moore, it said do you think more or less of him. Where else would they put the poll, MSNBC.com? \n \n \n \n \n \n \nIf that's the way you want to see it, I can't stop you. \n Maybe you are letting your emotions toward Michael Moore form your opinions for you.\n\n \n \n \n I don't think so. Everything Moore has produced is a lie.\n \n \n \n \n \nYou're right, OJ was innocent. So were the cops that beat Rodney King.\n I can't prove anything, can I?\n\n \n \n Actually he is. A judge found him innocent, so he is technically innocent (rather you want to believe it or not). you can't argue that.\n \n \n \n \n \nOk, I can find the first quote in the article you link to, but not in the 9/11 report, the only one i'll take seriously. The second quote comes from the report. Maybe I'm not looking hard enough, that report is long.\n\n \n \n Well it is in there (page 66, middle of the page). I have the book in front of me right now.\n \n \n \n \n \nIf they would have given him safe haven, we would have every right to invade in order to capture him, maybe even despite all the collateral damage.\n But that did not happen. I'm sure there were many other countries willing to take him in, and there were.\n\n \n \n \n Huh? He offered a terrorist, and the most dangerous one at that, a safe haven in his country. That is aiding terrorism if I have ever seen it. But the other countries who might have been willing to take him in didn't have a dictator who also killed over 300,000 innocent people and was threatening to use WMDs on many nations.\n \n \n \nAs to the article you cite, Berger was right. There was nothing to indicate at the time that a \"war\" with al-qaida was warranted. All of the attacks to that date had been on par with other terrorist groups. They weren't exactly sure where bin laden was. This was all before 9/11, which may or may not have been prevented by bin laden's capture. Are we getting hypothetical here? I hope not since I know how much that bugs you.\n \n \n \n \n How many times do I have to tell you and everyone else? Al Qaeda isn't the only terrorist cell out there. And we went to war with the Taliban, not Al Qaeda. Now that we are in Iraq, we are constantly killing and capturing more and more Al Qaeda.\n \n \n \n \nTo think that some sniper had bin laden in his sites and was told to stand down is funny. Anyway, I did a word search for \"sniper\" in the 9/11 report and there were no hits.\n\n \n \n \n Well apparently the 9/11 Commission didn't think it was funny. Look at page 140, very top of the page. \n \"Kandahar, May 1999\n It was in Kandahar that perhaps the last, and most likely the best, opportunity arose for targeting Bin Ladin with cruise missiles before 9/11. In May 1999, CIA ssets in Afghanistan reported on Bin Ladin's location in and around Kandahar over the course of five days and nights. The reporting was very detailed and came from several sources. If this intelligence was not \"actionable\", working-level officials said at the time and today, it was hard for them to imagine how any intelligence on Bin Ladin in Afghanistan would meet the standard.\"\n \"This was in our strike zone. It was a fat pitch, a homerun. He expected the missiles to fly. When the decision came back that they should stand down (came from Clinton), not shoot, the officer said, \"we all just slumped.\"\n \"Bin Ladin should have been a dead man.\"\n \"Having the chance to get Bin Ladin three times in 36 hours and foregoing the chance each time has made me a bit angry.\"\n \n So it wasn't in his sites through the barrel of a gun, but it was through the sites on a cruise missle.\n \n \n \nSo Bush only changes his mind when he can't focus?\n How often does that happen?\n\n \n \n Surely not as often as Kerry.", 
   {}, 
   60985, 
   null, 
   1091664600.0
  ], 
  [
   61002, 
   null, 
   "apathy", 
   "In certain instances they prove nothing, like when they have no relevancy to what they are talking about. O'Reilly's hypothetical question came about because Michael Moore said he wouldn't have attacked the Taliban, but we should attack those who pose a threat to us, which they did. Just a quick question...did you look up contradict like I asked you? Or do you just concede you were wrong again?\n\n \n Any comment I can make here is against forum rules. (are you back? brian? did I call you something before?)\n \n \nSo you basically think the whole world has conspired to allow us to attack Iraq? Come on, you could pass for Michael Moore with that comment.\n\n \n That's YOUR comment. I said that those involved conspired. YES i said it, conspiracy. How does anything get done in this world if people don't get together to decide what to do? That's conspiring.\n \n \n \n \nWell, considering he interviewed Michael Moore on his TV show, it seems rather obvious that he would be doing the poll. It didn't say do you not like Moore, it said do you think more or less of him. Where else would they put the poll, MSNBC.com? \n\n The poll is so important to this debate. \n But, considering that it was his show and his interview, why did he look so bad? Why couldn't he do a better job?\n \n \n \nActually he is. A judge found him innocent, so he is technically innocent (rather you want to believe it or not). you can't argue that.\n\n Being judged innocent is not the same thing as being innocent.\n \n \n \n \nWell it is in there (page 66, middle of the page). I have the book in front of me right now.\n\n \n I have the pdf. Ch2 starts on pg 67. There is no quote like the one from the article in the report.\n \n \n \nHuh? He offered a terrorist, and the most dangerous one at that, a safe haven in his country. That is aiding terrorism if I have ever seen it. But the other countries who might have been willing to take him in didn't have a dictator who also killed over 300,000 innocent people and was threatening to use WMDs on many nations.\n\n Did you know he was the most dangerous terrorist before 2001? Nope.\n Wasn't he actually IN Sudan? Did we invade Sudan? Wasn't he actually IN Saudi Arabia? Did we invade Saudi Arabia? \n \n War lovers keep bringing up what Saddam did 15 years ago to justify a war that's happening today.\n \n Can you justify this? http://www.thenausea.com/elements/usa/iraq%202003/2004%20january/iraq%20murder.wmv\n http://www.thenausea.com/elements/usa/iraq%202004/06/loot.wmv\n \n \n \nHow many times do I have to tell you and everyone else? Al Qaeda isn't the only terrorist cell out there. And we went to war with the Taliban, not Al Qaeda. \n\n \n Oh, but we were at war with al-qaeda. The invasion (sort of) of Afghanistan was a battle against Taliban and Al-queda.\n \n Now that we are in Iraq, we are constantly killing and capturing more and more Al Qaeda.\n\n \n They caught ONE guy, an important guy at that, last year. \n Prisoners have claimed Iraq Al-queda ties, maybe to save their butts.\n And they found a training camp run by Ansar al-Islam in northern Iraq.\n That's all I've heard of.\n Maybe there are some payoffs to this war, but what was the price?\n At what cost have we made these incremental gains?\n \n \n \nWell apparently the 9/11 Commission didn't think it was funny. Look at page 140, very top of the page. \n \"Kandahar, May 1999\n It was in Kandahar that perhaps the last, and most likely the best, opportunity arose for targeting Bin Ladin with cruise missiles before 9/11. In May 1999, CIA ssets in Afghanistan reported on Bin Ladin's location in and around Kandahar over the course of five days and nights. The reporting was very detailed and came from several sources. If this intelligence was not \"actionable\", working-level officials said at the time and today, it was hard for them to imagine how any intelligence on Bin Ladin in Afghanistan would meet the standard.\"\n \"This was in our strike zone. It was a fat pitch, a homerun. He expected the missiles to fly. When the decision came back that they should stand down (came from Clinton), not shoot, the officer said, \"we all just slumped.\"\n \"Bin Ladin should have been a dead man.\"\n \"Having the chance to get Bin Ladin three times in 36 hours and foregoing the chance each time has made me a bit angry.\"\n \n So it wasn't in his sites through the barrel of a gun, but it was through the sites on a cruise missle.\n\n \n Here is the quote that says that they were right.\n \"Working-level CIA officials agreed. While there was a conflicting intelligence\n report about Bin Ladin's whereabouts, the experts discounted it.At the\n time, CIA working-level officials were told by their managers that the strikes\n were not ordered because the military doubted the intelligence and worried\n about collateral damage.\" .....\n \n \"He told us that Clarke informed him and others that Tenet assessed the chance of the intelligence being accurate as 50-50. This officer believed that Tenet's assessment was the key to the decision.\"\n \n same page. (pg. 140)\n \n With our 20/20 hindsight we can say that \"collateral damage\" might have been justified, but it wasn't that day.", 
   {
    "unicode_changes_made": true
   }, 
   60990, 
   null, 
   1091667120.0
  ], 
  [
   61061, 
   null, 
   "Bush Is The Man", 
   "Any comment I can make here is against forum rules. (are you back? brian? did I call you something before?)\n\n \n \n No clue what your're talking about or what you apparently called me before. You can't make a comment because I was right, you were wrong. You had, maybe still have, no idea what contradict means. Michael Moore contradicted himself. That's a fact, no way around it. \n \n \n \n \nThat's YOUR comment. I said that those involved conspired. YES i said it, conspiracy. How does anything get done in this world if people don't get together to decide what to do? That's conspiring.\n\n \n \n \n I guess you also believe in the New World Order and Illuminati? \n \n \n \n \n \nThe poll is so important to this debate. \n But, considering that it was his show and his interview, why did he look so bad? Why couldn't he do a better job?\n\n \n \n I don't see how you can actually believe O'Reilly did so bad. He made Moore look like a fool. He made him contradict himself and avoid several questions. O'Reilly answered all of them, and apparently he didn't do bad. 85% of people thought less of Michael Moore. He did do a good job, and he has. That's why his show had better ratings than the DNC and any other news show.\n \n \n \n \nBeing judged innocent is not the same thing as being innocent.\n\n \n \n But he is innocent. People who judge him as not innocent are falsely accusing him.\n \n \n \n \n \nI have the pdf. Ch2 starts on pg 67. There is no quote like the one from the article in the report.\n\n \n \n I have the book. Look at Chapter 2.5 Al Qaeda's Renewal In Afghanistan. Go to page 66, first paragraph. And it is in the PDA too, because I copied and pasted the quote out of there.\n \n \n \n \nDid you know he was the most dangerous terrorist before 2001? Nope.\n Wasn't he actually IN Sudan? Did we invade Sudan? Wasn't he actually IN Saudi Arabia? Did we invade Saudi Arabia?\n\n \n \n He was one of them. He coordinated most of the Embassy bombings, the WTC attacks, and the USS Cole bombing. So he was one of, if not the, most dangerous terrorists before and after 2001. Wasn't he in Afghanistan? Did we find him? No. Just because we know what country he's in does not, by any means, suggest that we will find him. We didn't invade Saudi Arabia because they were and are our allies.\n \n \n \n \nWar lovers keep bringing up what Saddam did 15 years ago to justify a war that's happening today.\n\n \n \n That's just part. Even in 2002, he still was torturing people and forcing them to live in fear. He was also searching for WMDs in 2001-2002. So it isn't just 15 years ago.\n \n \n \n \n \n \nThey caught ONE guy, an important guy at that, last year. \n Prisoners have claimed Iraq Al-queda ties, maybe to save their butts.\n And they found a training camp run by Ansar al-Islam in northern Iraq.\n That's all I've heard of.\n Maybe there are some payoffs to this war, but what was the price?\n At what cost have we made these incremental gains?\n\n \n \n \n Are you serious? They caught one guy the other day. We kill and capture them all the time. Do you ever watch or read the news? Oh, I bet those we capture lie and tell us they're Al Qaeda, because they're also a bigger part of this so-called conspiracy for Bush to attack Iraq? \n \n \n \n \n \nHere is the quote that says that they were right.\n \"Working-level CIA officials agreed. While there was a conflicting intelligence\n report about Bin Ladin's whereabouts, the experts discounted it.At the\n time, CIA working-level officials were told by their managers that the strikes\n were not ordered because the military doubted the intelligence and worried\n about collateral damage.\" .....\n\n \n \"He told us that Clarke informed him and others that Tenet assessed the chance of the intelligence being accurate as 50-50. This officer believed that Tenet's assessment was the key to the decision.\"\n \n \n \n So we had a 50% chance of getting him? That's pretty good. If the cruise missile misses him, then we are either going to hit a camel or a cave.", 
   {
    "unicode_changes_made": true
   }, 
   61002, 
   null, 
   1091723400.0
  ], 
  [
   61063, 
   null, 
   "Sigma", 
   "I don't see how you can actually believe O'Reilly did so bad. He made Moore look like a fool. He made him contradict himself and avoid several questions. O'Reilly answered all of them, and apparently he didn't do bad. 85% of people thought less of Michael Moore. He did do a good job, and he has. That's why his show had better ratings than the DNC and any other news show.\n \n\n \n You have to look at who watches the show and who actually visits the website. It's pretty obvious that more right-leaning people watch the show, so the majority of people voting would be right-leaning. Of course they would vote in a negative way about Micheal Moore and think Bill did better. \n \n If a majority of left-leaning people watched, they would most likely see the opposite and the poll would be different.", 
   {}, 
   61061, 
   null, 
   1091723700.0
  ], 
  [
   61074, 
   null, 
   "Bush Is The Man", 
   "You have to look at who watches the show and who actually visits the website. It's pretty obvious that more right-leaning people watch the show, so the majority of people voting would be right-leaning. Of course they would vote in a negative way about Micheal Moore and think Bill did better. \n \n If a majority of left-leaning people watched, they would most likely see the opposite and the poll would be different.\n\n \n \n Do you think Bill O'Reilly did a poor job?", 
   {}, 
   61063, 
   null, 
   1091724540.0
  ], 
  [
   61077, 
   null, 
   "Sigma", 
   "Do you think Bill O'Reilly did a poor job?\n\n \n I, unfortunately, missed it :( I saw the show the next day when he referenced it and kicked myself for missing it", 
   {}, 
   61074, 
   null, 
   1091725200.0
  ], 
  [
   61079, 
   null, 
   "Bush Is The Man", 
   "I, unfortunately, missed it :( I saw the show the next day when he referenced it and kicked myself for missing it\n\n \n \n Here is the link...(http://www.foxnews.com/story/0,2933,96207,00.html)\n \n \n Go to over a little to the right where it says \"More The O'Reilly Factor\". Look under that and click on \"Moore:'Bush Didn't Tell the Truth'\". Then go to the left and click on Video, and then the Michael Moore link.\n \n \n Let me know what you think.", 
   {}, 
   61077, 
   null, 
   1091725560.0
  ], 
  [
   61088, 
   null, 
   "Waxy", 
   "Any comment I can make here is against forum rules. (are you back? brian? did I call you something before?)\n\n \n And to think, people doubt evolution. :p\n \n Although, I think the idea behind evolution is that each new form is better adapted than the last, so I guess that's a problem in this case.\n \n Waxy", 
   {}, 
   61002, 
   null, 
   1091727180.0
  ], 
  [
   61221, 
   null, 
   "Sigma", 
   "\n Let me know what you think.\n\n \n It was good. It was obvious that Micheal wasn't comfortable there, and I can understand why :P\n \n I agree with Apathy that both gave evasive answers, Bill about the reason we went to Iraq and Moore about whether Bush lied. However, if Moore had been more comfortable, I think he wouldn't have made the mistakes he had and outdone Bill.", 
   {}, 
   61079, 
   null, 
   1091808120.0
  ], 
  [
   61226, 
   null, 
   "Bush Is The Man", 
   "It was good. It was obvious that Micheal wasn't comfortable there, and I can understand why :P\n \n I agree with Apathy that both gave evasive answers, Bill about the reason we went to Iraq and Moore about whether Bush lied. However, if Moore had been more comfortable, I think he wouldn't have made the mistakes he had and outdone Bill.\n\n \n \n Did Michael Moore not contradict himself when he said we should go after anyone who poses a direct threat to us, and then he said he wouldn't have gone after the Taliban (who attacked us), and when asked about Hitler, he said he would have never let him come to power? And then O'Reilly says, \"Oh, a pre-emptive strike from Michael Moore\". Then Moore, say \"If we'd done our job...if we'd done our job...if we'd done our job...you want to get to what happened before WWI\". He knew he totally contradicted himself, and instead of fessing up, he totally evaded it and to get away, he brought up the worst question of the interview \"Would you sacrifice yourself for Fallujah?\" Come on, forget that I like Bush and everything, don't you think that is a pretty bad question? It really has no relevance to the situation in Iraq. No US family sacrifices their kids, nor adults, to free a town. O'Reilly could say nothing to that question because we don't send kids there, they volunteer.", 
   {}, 
   61221, 
   null, 
   1091810400.0
  ], 
  [
   61228, 
   null, 
   "Sigma", 
   "Did Michael Moore not contradict himself when he said we should go after anyone who poses a direct threat to us, and then he said he wouldn't have gone after the Taliban (who attacked us), and when asked about Hitler, he said he would have never let him come to power? And then O'Reilly says, \"Oh, a pre-emptive strike from Michael Moore\". Then Moore, say \"If we'd done our job...if we'd done our job...if we'd done our job...you want to get to what happened before WWI\". He knew he totally contradicted himself, and instead of fessing up, he totally evaded it and to get away, he brought up the worst question of the interview \"Would you sacrifice yourself for Fallujah?\" Come on, forget that I like Bush and everything, don't you think that is a pretty bad question? It really has no relevance to the situation in Iraq. No US family sacrifices their kids, nor adults, to free a town. O'Reilly could say nothing to that question because we don't send kids there, they volunteer.\n\n \n I don't know about contradicting himself, but I do agree that he evaded that because he didn't know how to answer it. \n \n As to the question, it depends on where he takes it. Bill had a good answer with \"I would sacrifice myself\" which took the wind from Moore sails, but could have been answered. If Moore had kept to other issues (which he had a really good case with, imo) he could have stuck Bill with looking like he's just repeating a line stubbornly (which he was starting to a bit, when he was trying to evade about iraq).\n \n The question was relevant, in that it forces one to consider how important Fallujah is and why we're going there, but Moore didn't take it there.", 
   {}, 
   61226, 
   null, 
   1091811420.0
  ], 
  [
   61232, 
   null, 
   "Bush Is The Man", 
   "I don't know about contradicting himself, but I do agree that he evaded that because he didn't know how to answer it.\n \n \n \n \n I just thought of a good way to look at it. You do agree that Michael Moore thinks we shouldn't have went into Iraq because he said they weren't a threat to us. I respect his opinion on that. But look at it this way. Hitler had no WMDs. Before 1941, he was no threat to us. We didn't know he had been killing millions of innocent Jews until well after 1941. He was just simply a leader we didn't agree with who was taking over some countries. Now, look at Saddam Hussein. He used nerve gases to kill his own people, he also invaded other countries, and he posed a threat to us (whether it was a large threat or not). However, Moore says he wouldn't have allowed Hitler to come to power, but he also says we shouldn't have gone to Iraq. That is pretty contradictory to me, saying you would not let Hitler come to power going by his record from 1933-1941 (before we knew how bad he really was), but you wouldn't invade Iraq who posed more of a threat to us than Hitler did from 1933-1941.", 
   {}, 
   61228, 
   null, 
   1091812740.0
  ], 
  [
   61253, 
   null, 
   "Sigma", 
   "I just thought of a good way to look at it. You do agree that Michael Moore thinks we shouldn't have went into Iraq because he said they weren't a threat to us. I respect his opinion on that. But look at it this way. Hitler had no WMDs. Before 1941, he was no threat to us. We didn't know he had been killing millions of innocent Jews until well after 1941. He was just simply a leader we didn't agree with who was taking over some countries. Now, look at Saddam Hussein. He used nerve gases to kill his own people, he also invaded other countries, and he posed a threat to us (whether it was a large threat or not). However, Moore says he wouldn't have allowed Hitler to come to power, but he also says we shouldn't have gone to Iraq. That is pretty contradictory to me, saying you would not let Hitler come to power going by his record from 1933-1941 (before we knew how bad he really was), but you wouldn't invade Iraq who posed more of a threat to us than Hitler did from 1933-1941.\n\n \n It would only be contradictory if Moore considered them to be equal threats, and supported striking one and not the other. They didn't get far enough into it to really make an opinion of it. At worst, it was a quick and not very well thought out response.", 
   {}, 
   61232, 
   null, 
   1091818620.0
  ], 
  [
   61257, 
   null, 
   "jim's trucking", 
   "It would only be contradictory if Moore considered them to be equal threats, and supported striking one and not the other. They didn't get far enough into it to really make an opinion of it.  At worst, it was a quick and not very well thought out response.  \n\n \n ...as was his most recent \"documentary\".", 
   {}, 
   61253, 
   null, 
   1091819580.0
  ], 
  [
   61274, 
   null, 
   "Sigma", 
   "...as was his most recent \"documentary\".\n\n \n Contrary to all this hubub, it is indeed a documentary. A documentary does not need to show all sides of an issue. It uses facts to support speculation that presents a point of view.\n \n And if we find out later that he got some of the facts wrong, we can blame it on the bad intelligence given to him. ;)", 
   {}, 
   61257, 
   null, 
   1091824260.0
  ], 
  [
   61276, 
   null, 
   "Bush Is The Man", 
   "Do you think people in Moore's movies, like Heston, Bush, and Joe Scarborough, could sue Moore and win? Don't you think it is illegal to crop what people say and make sentences out of it, making them out to be exactly what they're not? Do you all know someone is about to release a movie called \"Michael Moore Hates America\" in theaters? It was supposed to be released in the Summer 2004, so it should be here soon. Visit (http://www.michaelmoorehatesamerica.com/). And Moore has the nerve, on an interview on that site, so say that the movie is \"slander\". Come on, this guy makes everyone look like fools by editing his interviews with them, and this guy makes a movie showing what America really is like and Moore charges him with slander and says he might press charges on him. Can we vote to deport Moore?", 
   {
    "post_info": {
     "post_title": "&quot;Michael Moore Hates America&quot;"
    }
   }, 
   61257, 
   null, 
   1091824320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Michael Moore interview with Bill O'Reilly", 
  "url": "http://www.4forums.com/political/politics-debates/2834-michael-moore-interview-bill-oreilly.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2834, 
  "discussion_files": [
   [
    "27667.html", 
    "http://www.4forums.com/political/politics-debates/2834-michael-moore-interview-bill-oreilly-print.html"
   ], 
   [
    "27668.html", 
    "http://www.4forums.com/political/politics-debates/2834-michael-moore-interview-bill-oreilly-4-print.html"
   ], 
   [
    "27669.html", 
    "http://www.4forums.com/political/politics-debates/2834-michael-moore-interview-bill-oreilly-3-print.html"
   ], 
   [
    "27670.html", 
    "http://www.4forums.com/political/politics-debates/2834-michael-moore-interview-bill-oreilly-2-print.html"
   ]
  ], 
  "identifier": 2834
 }
]