[
 [
  [
   60381, 
   null, 
   "Siegfriedson", 
   "Looking at gun control from the standpoint of temperament: It may seem unfair to women to categorize the tendency to surrender as feminine and the tendency to defend oneself as masculine, but at a very fundamental level this categorization corresponds to real differences between feminine and masculine natures. Every person has some of the feminine nature and some of the masculine nature in his character. What we see today is a much greater than normal manifestation of feminine traits in men. It is not a pretty sight.\n \n Those who choose to give up their arms are hoping to be protected by the government. They trust the government. They believe the government has their best interests at heart. They think of the government as a friend and generally approve of the government's policies.\n \n This divide becomes deeper and wider by the day. A Black with an uncontrollable hatred of Whites opens fire on a crowded subway train in New York, killing five Whites and injuring 17 more. Gun control advocates see this massacre as support for their position. \"A gun killed and wounded those people,\" they say. \"If we get rid of all the guns, then Blacks and Whites will not be able to kill each other.\"\n \n Now, this divide certainly didn't exist a century ago. Then every White man was armed, and every woman expected him to be. In that more civilized age violent crime was a minute fraction of what it is today. People could walk the streets of their cities at night and, in most places, leave their doors unlocked without fear. The government interfered relatively little in people's lives. Most communities had police, but a man's right to defend himself, his family, and his property was absolute.\n \n What caused people's attitudes to change so radically?\n \n A century ago the country was substantially less urban than it is now. People living in small towns and rural areas always are more self-reliant and independent, on the average, than city dwellers. Rural people live a little more naturally, a little closer to Nature. They do not depend on the elaborate infrastructure of the city, which provides garbage collection, public transportation, shelters for the homeless, and a thousand other protections and shields against the natural world. Even little things, like drawing water from one's own well and chopping one's own firewood for winter warmth, give one a sense of reality and self-sufficiency that most urbanites and suburbanites lack. As the nation's population became more urban during the past century it also became less self-reliant.\n ...\n \n The Mass Media Hate Guns: Here's Why \n \n When a \"group of concerned citizens\" or an association of mayors or chiefs of police issues a statement to the press calling for the banning of firearms as a way of reducing violence in America's cities, a close examination nearly always will reveal the hidden hand of the ADL. Especially insidious has been the ADL's use of local, state, and federal police agencies as front groups. For the past two decades the ADL has been lobbying actively for a group of what it calls \"model statutes\" restricting firearms ownership and penalizing what it deems to be \"hate crimes\" perpetrated by Whites against members of minority groups. Typically the ADL will have a police official or two in tow when it shows up at a state legislature to lobby for one of these politically oriented laws.\n ...\n Now, far less obvious than the fact of Jewish leadership of the drive to ban the private ownership of firarms is the reason for this Jewish activity. The reason is the so-called \"New World Order,\" a subject I've spoken about several times before on American Dissident Voices. To put it very briefly, the New World Order is a utopian system in which the U.S. economy will be \"globalized,\" the wage levels of U.S. workers will be brought down to those of workers in the Third World, national boundaries will for all practical purposes cease to exist, an increased flow of Third World immigrants into the United States will have produced a non-White majority in the country, and United Nations \"peace keeping\" forces will be used to keep anyone from opting out of the system.\n ...\n \n New World Order = A Disarmed America \n \n There are two prerequisites for safely bringing in the New World Order. First, the people who are not convinced that surrendering national sovereignty and permitting themselves to be \"equalized\" with China's coolies and Mexico's peons are good things must be silenced with \"hate\" laws designed to criminalize any expression of fact or opinion which can be considered \"racist.\" Second, the same people must be disarmed, so that they have no recourse but to obey the laws and remain silent.\n \n In the United States the number of people likely to take up arms against an oppressive government is not large at this time. We live in an age when comfort and safety are valued more highly than freedom. If economic conditions worsen substantially, however, those few willing to fight for freedom may persuade many others who are more concerned with their pocketbooks than their honor to take up arms as well, and if that happens the New World Order will be in serious trouble.\n \n Full essay:\n \n http://www.natvan.com/american-dissident-voices/adv012994.html\n \n \n \n \n .", 
   {
    "post_info": {
     "post_title": "Gun Control: Not What It Seems"
    }
   }, 
   null, 
   null, 
   1091208960.0
  ], 
  [
   60387, 
   null, 
   "sinjin", 
   "Are you a member of the NRA?", 
   {}, 
   60381, 
   null, 
   1091211420.0
  ], 
  [
   60441, 
   null, 
   "apathy", 
   "dude, you only cut and paste other people's opinions then jet\n you don't stick around to debate anything you say\n why am i even leaving this post?", 
   {}, 
   60387, 
   null, 
   1091237040.0
  ], 
  [
   60492, 
   null, 
   "emclean", 
   "what is there to debate, he is nuts. (and i'm a gun nut)", 
   {}, 
   60441, 
   null, 
   1091290980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gun Control: Not What It Seems", 
  "url": "http://www.4forums.com/political/gun-control-debates/2835-gun-control-not-what-seems.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 2835, 
  "discussion_files": [
   [
    "11655.html", 
    "http://www.4forums.com/political/gun-control-debates/2835-gun-control-not-what-seems-print.html"
   ]
  ], 
  "identifier": 2835
 }
]