[
 [
  [
   60517, 
   null, 
   "Bush Is The Man", 
   "This is a pretty shocking story. Romero, one of the directors of the ACLU, tried to cover up his accepting millions of dollars in funding by saying \"I printed out the terrorist watch list. Then I never consulted it\". Great excuse. They knew that they had to obey the law in the Patriot Act which required them to keep up with the terror watch list and not knowingly hire anyone from it in order to receive their government funding. They then accepted the money and did not obey and of these stipulations under the Patriot Act, KNWOINGLY. I guess it's ok to lie and basically steal money from the government, but it isn't right to have a terror watch list because it infringes on peoples' rights? The ACLU says the terror watch lists are unconstitutional and they shouldn't have to use them. Are they serious? Why would you want to hire a known terrorist? Seems like the ACLU has turned to sh*t. I have no respect for them anymore.", 
   {
    "post_info": {
     "post_title": "ACLU Refuses to Obey Terror Watch Lists"
    }
   }, 
   null, 
   null, 
   1091305260.0
  ], 
  [
   60524, 
   null, 
   "lord tammerlain", 
   "If they were a known terrorist they would have been arrested dont you think?", 
   {}, 
   60517, 
   null, 
   1091307480.0
  ], 
  [
   60526, 
   null, 
   "Bush Is The Man", 
   "If they were a known terrorist they would have been arrested dont you think?\n\n \n \n Bin Laden? Al Zarqawi? They aren't arrested, are they? No they are not. The ACLU wouldn't even know who is on the list, because they don't even look at it. And their director even stated that. That is pretty pathetic. That's why this country will never be completely safe, because we'll always have XXXXXX out there like Romero.", 
   {}, 
   60524, 
   null, 
   1091307660.0
  ], 
  [
   60529, 
   null, 
   "lord tammerlain", 
   "ACLU is an American org right, with most of its operations I assume in the states. I dont think that Bin Laden, or any other known terrorist would be walking around in the states using their own name. \n \n So as I stated if there was a known terrorist in the states using his/her own name they would have been arrested.", 
   {}, 
   60526, 
   null, 
   1091308980.0
  ], 
  [
   60532, 
   null, 
   "Bush Is The Man", 
   "ACLU is an American org right, with most of its operations I assume in the states. I dont think that Bin Laden, or any other known terrorist would be walking around in the states using their own name. \n \n So as I stated if there was a known terrorist in the states using his/her own name they would have been arrested.\n\n \n \n Ok Bin Laden was an exaggeration, but there are hundreds of people on that list. I bet you don't know every single one of them, and you certainly wouldn't recognize most of the if you saw them in person. So, there is a chance that some of them will try to get jobs with organizations like ACLU. For instance, known terrorists trained to fly airplanes in Florida. How come they weren't arrested? That was exactly what I am trying to say. Many people don't know every terrorist on that list, therefore they could unknowingly hire one of them. Since the ACLU has publicly stated that they don't use the list, even though they are required to, makes one wonder if any terrorists are actually employed in the US right now. Nobody knows if there is or isn't.", 
   {}, 
   60529, 
   null, 
   1091311260.0
  ], 
  [
   60533, 
   null, 
   "Bush Is The Man", 
   "ACLU is an American org right, with most of its operations I assume in the states. I dont think that Bin Laden, or any other known terrorist would be walking around in the states using their own name. \n \n So as I stated if there was a known terrorist in the states using his/her own name they would have been arrested.\n\n \n \n And how hard is it to actually use that list? How does that infringe on peoples' rights? It is simply protecting the 280 million people in the US from another terror attack. Do you think we shouldn't be using this list?", 
   {}, 
   60529, 
   null, 
   1091311320.0
  ], 
  [
   60537, 
   null, 
   "jitobear", 
   "The terrorist watch list is against the constitution as is much of the Patriot Act(s). \n \n I know someone who made some list (not sure if it was this one) for not being \"American\" enough because he ran a server for Vigan websites - and they were anti-farmer. He actually received notification of this and found taps on his phone and server. \n \n You can unwittingly donate money to a charity that is secretly whisking that money off to terrorist groups and you can be put on that list.\n \n It blatantly disregards 'innocent until proven guilty' - it's the same kind of trash as the black list that listed \"commies\". \n \n Bush has shown the most cowardly disregard for our Constitution and it makes me SICK. He thinks he is above it, can disregard it or do whatever he likes to it to promote his own personal agenda. His treatment our Constituion and Bill of Rights is one of the, if not THE MOST, disgusting thing an elected official has done it this country. It is the reason why I will not vote for him. I don't care what his other merits are. If he doesn't have enough heart or spine to defend the Constitution and Bill of Rights, he has no business being president.", 
   {}, 
   60533, 
   null, 
   1091318940.0
  ], 
  [
   60544, 
   null, 
   "Bush Is The Man", 
   "The terrorist watch list is against the constitution as is much of the Patriot Act(s).\n\n \n \n \n Are you serious? One of the most remarkable comments I have ever heard. How is it against the Constitution? It simply is a list of terrorists or people supporting terror, much like America's Most Wanted. Is that against the Consitutuion? Is the Amber Alert against the Consitution? The terror watch list simply alerts people so they won't hire and can turn in a terrorist or someone supporting terrorism. I don't see at all how that is against the Constitution. The US terror watch list, used to stop suspected terrorists from entering the country, includes not only suspected al Qaeda members but other suspects from a wide spectrum of organizations around the world. \n \n \nI know someone who made some list (not sure if it was this one) for not being \"American\" enough because he ran a server for Vigan websites - and they were anti-farmer. He actually received notification of this and found taps on his phone and server.\n\n \n \n First of all, I don't believe that. Many people on the list go by aliases, so maybe he was mistaken for someone else by name. The people on the list are people who are terrorists or who are supporting terrorists. If I buy a fake gold watch in NY and the guy in turn sends money to Al Qaeda, I won't be on the list. That is absurd.\n \n \n \nYou can unwittingly donate money to a charity that is secretly whisking that money off to terrorist groups and you can be put on that list.\n\n \n \n I think you would know. On the news today there was a story about a Muslim charity donating money to Hamas. I think everyone knows that Hamas is a terrorist group. \n \n \n \n \nIt blatantly disregards 'innocent until proven guilty' - it's the same kind of trash as the black list that listed \"commies\".\n\n \n \n No it doesn't and no it isn't. The people on there are terrorists, not because they are Muslim or Communists. They are on there for what they have done, not for what they believe.\n \n \n \nBush has shown the most cowardly disregard for our Constitution and it makes me SICK. He thinks he is above it, can disregard it or do whatever he likes to it to promote his own personal agenda. His treatment our Constituion and Bill of Rights is one of the, if not THE MOST, disgusting thing an elected official has done it this country. It is the reason why I will not vote for him. I don't care what his other merits are. If he doesn't have enough heart or spine to defend the Constitution and Bill of Rights, he has no business being president.\n\n \n \n \n Well if Kerry wins and does away with this and other programs like this, we'll probably have another attack like 9/11. And if we do, I will blame it squarely on you and Kerry. If he could do what he wanted, he would have passes a Constitutional ban on gay marriages. But why didn't it happen? Because the Senate didn't approve it. However, Congress approved the Patriot Act, so apparently more people than just Bush liked it. So it isn't his own personal agenda. No, the most disgusting thing an elected official can do is lie, cheat, and steal, much like Clinton did. He stole over 900 FBI files, he cheated on his wife while in office and then lied to the whole world about it, and he pardoned some of the most vile people before his Presidency ended. Those are the most disgusting things a President can do, much more disgusting than the Patriot Act (which has the intent of keeping America safe). Apparently Bill Clinton didn't have the \"heart or spine\" to defend the Constitution, because he was impeached by his fellow members in the Senate and the House. Point proven.", 
   {}, 
   60537, 
   null, 
   1091330640.0
  ], 
  [
   60546, 
   null, 
   "Bush Is The Man", 
   "It is the reason why I will not vote for him. \n\n \n \n \n Fine, go ahead. You won't make mad. But when Bush wins, I don't want to hear you complain. And if by some chance he doesn't win, I will let you know every single time Kerry does something wrong. Best believe it.", 
   {}, 
   60537, 
   null, 
   1091330760.0
  ], 
  [
   60616, 
   null, 
   "jitobear", 
   "However, Congress approved the Patriot Act, so apparently more people than just Bush liked it.\n\n \n \n Well I don't like it. And many people who voted for it in a moment of emotional fear the weeks after 9/11 don't support it any more. Not to mention, if you follow the news, the Supreme Court has determined parts of it unconstitutional.\n \n Have you read the Patriot Act? I have. Here is a breif outline (from an article linked below) of what this peice of trash document allows\n \n It is a crime for anyone in this country to contribute money or other material support to the activities of a group on the State Department's terrorist watch list. Organizations are so designated on the basis of secret evidence, and their inclusion on the list cannot be challenged in court. Members of any such targeted organization can be deported even if they have not been involved in any illegal activities. The government freely admits that some of the groups it will designate are broad-based organizations engaged in lawful social, political, and humanitarian activities as well as violent activities.\n \n The FBI can monitor and tape conversations and meetings between an attorney and a client who is in federal custody, whether the client has been convicted, charged, or merely detained as a material witness. \n \n Americans captured on foreign soil and thought to have been involved in terrorist activities abroad may be held indefinitely in a military prison and denied access to lawyers or family members. No federal court can review the reason for the detention. (THIS IS WHAT THE SUPREME COURT HAS NOW OVER-RULED - people cannot be denied access to legal counsel.)\n \n The FBI can order librarians to turn over information about their patrons' reading habits and Internet use. The librarian cannot inform the patron that this information has been provided. \n \n Foreign citizens charged with a terrorist-related act may be denied access to an attorney and their right to question witnesses and otherwise prepare for a defense may be severely curtailed if the Department of Justice says that's necessary to protect national security. \n \n Resident alien men from primarily Middle Eastern and Muslim countries must report for registration. And hundreds of the ones who have reported have been detained and arrested for minor immigration infractions. It recently came to light that immigration authorities are refusing to let the men appear with their attorneys, a refusal that is a violation of Bureau of Citizenship and Immigration Services (BCIS, formerly the INS) regulations.\n \n Lawful foreign visitors may be photographed and fingerprinted when they enter the country and made to periodically report for questioning.\n \n The government can conduct surveillance on the Internet and e-mail use of American citizens without any notice, upon order to the Internet service provider. Internet service providers may not move to quash such subpoenas.\n \n The Transportation Security Administration (TSA) can search any car at any airport without a showing of any suspicion of criminal activity.\n \n The TSA can conduct full searches of people boarding airplanes and, if the passenger is a child, the child may be separated from the parent during the search. An objection by a parent or guardian to the search will put the objector at the risk of being charged with the crime of obstructing a federal law enforcement officer and tried in federal court. Travelers in Portland and Baltimore have reported such arrests.\n \n The TSA is piloting a program to amass all available computerized information on all purchasers of airline tickets, categorize individuals according to their threat to national security, and embed the label on all boarding passes. The Computer Assisted Passenger Prescreening System (CAPPS II) program is designed to perform background checks on all airline passengers and assigns each passenger a \"threat level.\" Passengers will not be able to ascertain their classification or the basis for the classification. (I am failrly certain something like this is now in place.)\n \n The TSA distributes a \"no-fly\" list to airport security personnel and airlines that require refusal of boarding and detention of persons deemed to be terrorism or air piracy risks or to pose a threat to airline or passenger safety. This is an expansion of a regulation that since 1990 has looked out for threats to civil aviation. Names are added daily based upon secret criteria. Several lawsuits that challenge these regulations are now pending, some from irate passengers who were mistaken for people on the list. \n \n American citizens and aliens can be held indefinitely in federal custody as \"material witnesses,\" a ploy sometimes used as a punitive measure when the government does not have sufficient basis to charge the individual with a terror-related crime. The 1984 material witness law allows the government to detain citizens at will for an arbitrary period of time to give testimony that might be useful in the prosecutions of others. \n \n Immigration authorities may detain immigrants without any charges for a \"reasonable period of time.\" The BCIS need not account for the names or locations of the detainees, and what constitutes a \"reasonable period of time\" is not defined. \n \n American colleges and universities with foreign students must report extensive information about their students to the BCIS. BCIS in turn may revoke student visas for missteps as minor as a student's failure to get an advisor's signature on a form that adds or drops classes. College personnel cannot notify students to correct the lapse in order to save them from deportation. To a very large extent, campus police and security personnel have become agents of the immigration authorities.\n \n Accused terrorists labeled \"unlawful combatants\" can be tried in military tribunals here or abroad, under rules of procedure developed by the Pentagon and the Department of Justice. All it takes to be named an unlawful combatant is the affidavit of a Pentagon employee, who is not required to provide the rationale for his or her decision, even to a federal judge. \n \n A warrant to conduct widespread surveillance on any American thought to be associated with terrorist activities can be obtained from a secret panel of judges, upon the affidavit of a Department of Justice official. If arrested as a result of the surveillance (as was the case with the attorney, Lynne Stewart), the defendant has no right to know the facts supporting the warrant request.\n \n The FBI can conduct aerial surveillance of individuals and homes without a warrant, and can install video cameras in places where lawful demonstrations and protests are held. Facial recognition computer programs are used to identify persons the FBI deems suspicious for political reasons.  \n \n Now go read the Constitution and the Bill of Rights.\n \n \n There are those who say we have nothing to fear if we are not a terrorist. They are beyond naive. The absolutely immature idea that just because it's America people won't abuse power is ludricous. \n \n The founding fathers put checks and balances in place, and gave us the Constitution and Bill of Rights precisely to limit power. I DO think terrorism shoul be addressed. I DO NOT think this is how. I fear this much power being granted to MY governnment agencies more than I do the Al-Queda.\n \n \"They that can give up essential liberty to obtain a little temporary safety deserve neither liberty nor safety.\" Ben Franklin\n \n Oh and by the way. I am not a Democrat, nor do I find Clinton any kind of saint. I could care less who he screwed, but some of this started with him. However, my cat is smarter than Bush and would be a more adept president.\n \n Article/Data Source:\n http://www.citypages.com/databank/24/1168/article11196.asp", 
   {}, 
   60544, 
   null, 
   1091394300.0
  ], 
  [
   60648, 
   null, 
   "Sigma", 
   "\n Have you read the Patriot Act? \n\n \n That is very very frightening.", 
   {}, 
   60616, 
   null, 
   1091431320.0
  ], 
  [
   60681, 
   null, 
   "Bush Is The Man", 
   "Well I don't like it. And many people who voted for it in a moment of emotional fear the weeks after 9/11 don't support it any more. Not to mention, if you follow the news, the Supreme Court has determined parts of it unconstitutional.\n\n \n \n \n \n Sorry to tell you, but you can't have everything you want. If they don't support it anymore, then they need to vote to remove it. Nobody forced them to vote on it, they chose to. So blame them and nobody else. If they voted in fear, they still voted. And enough people voted to get it passed. \n \n \n \n \n \nIt is a crime for anyone in this country to contribute money or other material support to the activities of a group on the State Department's terrorist watch list. Organizations are so designated on the basis of secret evidence, and their inclusion on the list cannot be challenged in court. Members of any such targeted organization can be deported even if they have not been involved in any illegal activities. The government freely admits that some of the groups it will designate are broad-based organizations engaged in lawful social, political, and humanitarian activities as well as violent activities. . . .The FBI can conduct aerial surveillance of individuals and homes without a warrant, and can install video cameras in places where lawful demonstrations and protests are held. Facial recognition computer programs are used to identify persons the FBI deems suspicious for political reasons. \n\n \n \n \n \n Where do you get this from? Some of it sounds more like someone reporting on it rather than a government agency writing it. It's from a dot com website, so it is not reliable. Show me in the acutal bill where it says that, then I will believe you. \"Members of any such targeted organization can be deported even if they have not been involved in any illegal activities. The government freely admits that some of the groups it will designate are broad-based organizations engaged in lawful social, political, and humanitarian activities as well as violent activities\". I doubt it says that in the Patriot Act. I can take any bill and add my comments to it to make it look bad too. It's not that hard.\n \n \n \n \nNow go read the Constitution and the Bill of Rights.\n\n \n \n I already have.\n \n \n \n \n\"They that can give up essential liberty to obtain a little temporary safety deserve neither liberty nor safety.\" Ben Franklin\n\n \n \n So John Kerry and all the others who voted to go to war don't deserve liberty nor safety. Once again, they all had the exact same information as Bush and voted accordingly. Here's an idea, let's stop searching people at airports. Let's get rid of America's Most Wanted. Since it takes away their liberty, those who screen them should deserve no freedom. If you aren't a terrorist and have nothing to hide, you should have no problem going through a screen or being questioned. \n \n \n \nOh and by the way. I am not a Democrat, nor do I find Clinton any kind of saint. I could care less who he screwed, but some of this started with him. However, my cat is smarter than Bush and would be a more adept president.\n\n \n \n I highly doubt it. That is, unless you cat got a 1400 on his SATs and graduated from Yale. His score was around a 1210, and I found a chart comparing SATs through various years and races. His score today is equivalent to around a 1400, a pretty good score. And he has a degree from Yale. So you must have one smart cat with some good leadership skills.", 
   {}, 
   60616, 
   null, 
   1091469960.0
  ], 
  [
   60688, 
   null, 
   "jitobear", 
   "The stuff I posted was from a Newspaper article and I included the link.\n \n No, the Patriot Act does not say what the article says and the article even says that. What the Patriot Act did was grant sweeping powers to government agencies that they can use with no recourse for whomever they are being used against. The list is how that power is being used.\n \n I don't have issues with searches at airports. I do have issues with taking people's kids and arresting them for protesting.\n \n I don't have issues detaining suspects or witnesses. I do have issues that people can be and are detained without knowledge of why, or access to family or legal counsel.\n \n I don't have issues with looking into the homes, internet use, library records, bank records, etc. of suspects. I do have issues with it being done without warrants.\n \n I do not have issues with precaution. I do have issues with unchecked power and disregard of the Constitution, the Bill of Rights and due process. And if you really care about America and what it stands for, you should too.\n \n Oh and by the way you said this:\n \n \"Fine, go ahead. You won't make mad. But when Bush wins, I don't want to hear you complain. And if by some chance he doesn't win, I will let you know every single time Kerry does something wrong. Best believe it.\"\n \n Does the word 'hypocrite' mean anything to you?\n \n If Bush wins you don't want to hear me complian, but you will be as vocal as you please if Kerry does.\n \n Darling, I will practice my 1st Ammendment rights and say whatever I please.", 
   {}, 
   60681, 
   null, 
   1091473920.0
  ], 
  [
   60692, 
   null, 
   "Bush Is The Man", 
   "The stuff I posted was from a Newspaper article and I included the link.\n\n \n \n \n Like I said, someone reported that. The link told me all I needed to know, that what you included on the post was bogus. Also, what you included in your post was someone's opinion tied into a description of the Patriot Act. So someone out there could have wrote a newspaper article that said something a little different that I could use for my case. \n \n \n \n \nI don't have issues with searches at airports. I do have issues with taking people's kids and arresting them for protesting.\n\n \n \n You are mistaken. People aren't arrested for just protesting. When they trespass on private property and prohibit people from going to work then they get arrested. Nobody gets arrested for nonviolently protesting. Show me a case where that happened.\n \n \n \n \nI don't have issues with looking into the homes, internet use, library records, bank records, etc. of suspects. I do have issues with it being done without warrants.\n\n \n \n The reason why they do it without warrants is to bypass all of the legal and bureaucratic steps to getting one. Sometime it may be too late to wait and get a warrant before looking at someone's records. It's not like they just check everyone's records. They check people who they have a reasonable assumption that they may be a terrorist; they don't just check every US citizen.\n \n \n \n \nI do not have issues with precaution. I do have issues with unchecked power and disregard of the Constitution, the Bill of Rights and due process. And if you really care about America and what it stands for, you should too.\n\n \n \n \n When did this happen? Congress approved Bush going to war, and they also approved the Patriot Act. So his power was checked, mind you. So apparently enough people approved of it, so once again you need to also charge Kerry and his confidantes with disregarding the Consitution.\n \n \nOh and by the way you said this:\n \n \"Fine, go ahead. You won't make mad. But when Bush wins, I don't want to hear you complain. And if by some chance he doesn't win, I will let you know every single time Kerry does something wrong. Best believe it.\"\n \n Does the word 'hypocrite' mean anything to you?\n\n \n \n \n Yes it does. So when someone, like yourself, puts down someone (in this case Bush) for acting on intelligent information, I simply said I will do the same to you if Kerry wins. That way you will get a chance to go through what I do. It seems as if this website is only for Liberals, because for some reason I have found nobody on here who believes anything I believe in.\n \n \n \n \nDarling, I will practice my 1st Ammendment rights and say whatever I please.\n\n \n \n Go ahead, nobody is stopping you. I will do the same when Bush wins. And I will continue to find errors in your statements and point them out. It works both ways.", 
   {}, 
   60688, 
   null, 
   1091477760.0
  ], 
  [
   60712, 
   null, 
   "apathy", 
   "If they were a known terrorist they would have been arrested dont you think?\n\n \n The terrorist watch list is not of \"known\" terrorists, but of individuals that have fit some computer algorithm that identifies them as potential \"terrorists.\"\n \n http://www.wired.com/news/business/0,1367,58191,00.html\n http://www.ilw.com/lawyers/immigdaily/digest/2004,0622.shtm\n http://www.las-inc.com/media_coverage/2004/Obsolete-algorithm.shtml", 
   {}, 
   60524, 
   null, 
   1091484780.0
  ], 
  [
   60717, 
   null, 
   "jitobear", 
   "Like I said, someone reported that. The link told me all I needed to know, that what you included on the post was bogus. Also, what you included in your post was someone's opinion tied into a description of the Patriot Act. So someone out there could have wrote a newspaper article that said something a little different that I could use for my case.\n\n \n What's bogus? I assure you, it's a real newspaper and it was a real news story. I have read the Patriot Act, so did the writer - not to mention she did some research and cited specific examples of these powers being weilded, reaction to them, etc. All you have done is blown hot air.\n \n The powers granted by the Patriot Act it are quite real. They are not opinion. Go and read it.\n \n \nYou are mistaken. People aren't arrested for just protesting. When they trespass on private property and prohibit people from going to work then they get arrested. Nobody gets arrested for nonviolently protesting. Show me a case where that happened.\n\n \n Actually people are arrested for protesting all the time. And in this case it wasn't protesting that they were arrested for. Did you actually read the article?\n \n \nThe reason why they do it without warrants is to bypass all of the legal and bureaucratic steps to getting one. Sometime it may be too late to wait and get a warrant before looking at someone's records. It's not like they just check everyone's records. They check people who they have a reasonable assumption that they may be a terrorist; they don't just check every US citizen.\n\n \n The point is that they can and there is nothing in place to stop them.\n \n If the process is slow - fix THAT. \n \n This what I mean about naivity. The FBI is not exempt from corruption. A power granted will be a power misused. That is human nature.\n \n \nWhen did this happen? Congress approved Bush going to war, and they also approved the Patriot Act. So his power was checked, mind you. So apparently enough people approved of it, so once again you need to also charge Kerry and his confidantes with disregarding the Consitution.\n\n \n I never supported either of these things. Kerry does not now. Kerry gets my vote.\n \n \nYes it does. So when someone, like yourself, puts down someone (in this case Bush) for acting on intelligent information, I simply said I will do the same to you if Kerry wins. That way you will get a chance to go through what I do. It seems as if this website is only for Liberals, because for some reason I have found nobody on here who believes anything I believe in.\n \n Go ahead, nobody is stopping you. I will do the same when Bush wins. And I will continue to find errors in your statements and point them out. It works both ways.\n\n \n Rant on. I would like to point out that I never said I expected you to be silent - ever. You were the one who had that expectation of me.", 
   {}, 
   60692, 
   null, 
   1091485680.0
  ], 
  [
   60730, 
   null, 
   "apathy", 
   "The terrorist watch list is reminescent of the McCarthy list of those suspected of \"un-American activities.\" There were black lists of those in Hollywood that were merely suspected of having sympathy for communists. It was the same kind of paranoia then that we have now.", 
   {}, 
   60717, 
   null, 
   1091492220.0
  ], 
  [
   60756, 
   null, 
   "Sigma", 
   "\n The reason why they do it without warrants is to bypass all of the legal and bureaucratic steps to getting one. Sometime it may be too late to wait and get a warrant before looking at someone's records. It's not like they just check everyone's records. They check people who they have a reasonable assumption that they may be a terrorist; they don't just check every US citizen.\n \n\n \n Those steps are there for a reason. There is nothing stopping them from checking any US citizen they want to check.", 
   {}, 
   60692, 
   null, 
   1091512560.0
  ], 
  [
   60775, 
   null, 
   "Bush Is The Man", 
   "What's bogus? I assure you, it's a real newspaper and it was a real news story. I have read the Patriot Act, so did the writer - not to mention she did some research and cited specific examples of these powers being weilded, reaction to them, etc. All you have done is blown hot air.\n \n The powers granted by the Patriot Act it are quite real. They are not opinion. Go and read it.\n\n \n \n \n It is a newspaper article. It is partisan. Someone inserted their opinions in there as well, so some of it is fact, but not all of it. They inserted their personal opinions to make it sound like a bad plan.\n \n \n \nActually people are arrested for protesting all the time. And in this case it wasn't protesting that they were arrested for. Did you actually read the article?\n\n \n \n \n \n I did, and it shows you were wrong. I said give me a case where someone was arrested for legally protesting, and you didn't do it. This is what I saw in the article:\n \n \"The FBI can conduct aerial surveillance of individuals and homes without a warrant, and can install video cameras in places where lawful demonstrations and protests are held. Facial recognition computer programs are used to identify persons the FBI deems suspicious for political reasons. An ACLU employee in South Carolina was recently indicted for the federal offense of being in a \"restricted area\" at the Columbia, South Carolina airport in October 2002, when President Bush made a political campaign appearance. (The South Carolina AG, who happens to be the son of retired Senator Strom Thurmond, authorized the indictment.)\"\n \n \n This totally proves my point. Look at the bold phrases. They did not arrest people for legally protesting. And the ACLU member was arrested for being in a \"restricted area\". Point proven. So you failed to show me where people are being arrested for protesting.\n \n \n \n \n \nThis what I mean about naivity. The FBI is not exempt from corruption. A power granted will be a power misused. That is human nature.\n\n \n \n \n I didn't say they were exempt. Please stop assuming things that you do not know. So then anyone who is ever President will abuse their power.\n \n \n \n \nI never supported either of these things. Kerry does not now. Kerry gets my vote.\n\n \n \n \n \n Oh, but he did. He will end up changing his mind in a week, and so will you. I guess it makes sense to endorse a candidate who can't make his mind up and flip flops on every issue. But that's your prerogative.", 
   {}, 
   60717, 
   null, 
   1091554080.0
  ], 
  [
   60786, 
   null, 
   "jitobear", 
   "It is a newspaper article. It is partisan. Someone inserted their opinions in there as well, so some of it is fact, but not all of it. They inserted their personal opinions to make it sound like a bad plan.\n\n \n It is a bad plan. I knew that BEFORE this article. I NEVER approved of the Patriot Act. I understood from day one that it was dangerous and unconstitutional. This article simply does a nice job of summarizing it. You caould always just go read the Patriot Act/s (should point out that there are two) if the article troubles you.\n \n \nI did, and it shows you were wrong. I said give me a case where someone was arrested for legally protesting, and you didn't do it. This is what I saw in the article:\n \n \"The FBI can conduct aerial surveillance of individuals and homes without a warrant, and can install video cameras in places where lawful demonstrations and protests are held. Facial recognition computer programs are used to identify persons the FBI deems suspicious for political reasons. An ACLU employee in South Carolina was recently indicted for the federal offense of being in a \"restricted area\" at the Columbia, South Carolina airport in October 2002, when President Bush made a political campaign appearance. (The South Carolina AG, who happens to be the son of retired Senator Strom Thurmond, authorized the indictment.)\"\n \n This totally proves my point. Look at the bold phrases. They did not arrest people for legally protesting. And the ACLU member was arrested for being in a \"restricted area\". Point proven. So you failed to show me where people are being arrested for protesting.\n\n \n I was referring to THIS:\n \n The TSA can conduct full searches of people boarding airplanes and, if the passenger is a child, the child may be separated from the parent during the search. An objection by a parent or guardian to the search will put the objector at the risk of being charged with the crime of obstructing a federal law enforcement officer and tried in federal court. Travelers in Portland and Baltimore have reported such arrests.\n \n \nI didn't say they were exempt. Please stop assuming things that you do not know. So then anyone who is ever President will abuse their power.\n\n \n No that is not what I said. I said a power granted will be abused. Yes there probably has been abuse of presidential power over the years. However, there is damage control because there are checks and balances in place. The president can't do tons without Congress or the Supreme Court.\n \n My issue with the Patriot Act isn't presidential power. It is the power that the federal government has granted law enforcement agencies (especially the FBI, NSA and TSA) that I am concerned about. The Patriot Act allows them to operate without their checks and balances, namely the courts and due process. \n \n That is frightening. Terrifying. There is nothing to stop them from investigating and holding YOU without warrants. All they have to do is drop the word \"terrorism\". They don't have to prove a thing and YOU have no recourse. Whether they do that by intent or error is irrelevant. Somebody will abuse this power. I'd be willing to bet dollars to pesos it already is. Due process protects all of us. It is absoluetly imperative to get it back. \n \n The Patriot Act is a doorway to facism. If we need to find ways to expediate legal proceeding for terror crimes (warrants, etc.) fine, but we can not allow these agencies free reign.\n \n \nOh, but he did. He will end up changing his mind in a week, **and so will you. I guess it makes sense to endorse a candidate who can't make his mind up and flip flops on every issue. But that's your prerogative.\n\n \n Oh give it up. People change their minds. Admitting you may have been mistaken and changing your mind is a sign of healthy maturity. Fifteen years ago I though smoking was cool. Now I think it's stupid and I quit. Am I flip-flopper for that? The REPUBLICAN Senator from Mn (Norm Coleman) used to be a DEMOCRAT. How's that for a flip-flop? Do you really think you can impress me by showing off how you or the candidates you support are obstinate sticks in the mud who can never learn, grow or change? Sorry - that won't win my vote.\n \n *Don't make assumptions to my character. For when it comes to knowing the nature of me, I am far better equipped than you. ", 
   {}, 
   60775, 
   null, 
   1091563320.0
  ], 
  [
   60794, 
   null, 
   "Bush Is The Man", 
   "It is a bad plan. I knew that BEFORE this article. I NEVER approved of the Patriot Act. I understood from day one that it was dangerous and unconstitutional. This article simply does a nice job of summarizing it. You caould always just go read the Patriot Act/s (should point out that there are two) if the article troubles you.\n\n \n \n \n You have your own right to think it's bad. I personally think it's good. But at least back your opinion up with some good facts. Simply showing me a newspaper article does nothing. Show me something from the actual report.\n \n \n \n \nI was referring to THIS:\n \n The TSA can conduct full searches of people boarding airplanes and, if the passenger is a child, the child may be separated from the parent during the search. An objection by a parent or guardian to the search will put the objector at the risk of being charged with the crime of obstructing a federal law enforcement officer and tried in federal court. Travelers in Portland and Baltimore have reported such arrests..\n\n \n \n \n Ok, but the conversation was arresting people for legally protesting. I told you to show me a case of that, and then you say you're talking about the TSA. Make up your mind which one you are trying to argue. I told you to show me a case of someone arrested for protesting, and you refer me to a site that says they were arrested for trespassing. Then you tell me you meant the whole TSA thing. Well which one is it?\n \n \n \n \n \nThat is frightening. Terrifying. There is nothing to stop them from investigating and holding YOU without warrants. All they have to do is drop the word \"terrorism\". They don't have to prove a thing and YOU have no recourse. Whether they do that by intent or error is irrelevant. Somebody will abuse this power. I'd be willing to bet dollars to pesos it already is. Due process protects all of us. It is absoluetly imperative to get it back.\n\n \n \n \n They detain people for saying \"bomb\" on a plane. But they don't arrest them. It is the same with the Patriot Act. They don't arrest everyone. They usually detain them and question them, and if they have reason to believe that are a suspect to a crime, then they arrest them. They don't just arrest people for saying \"terrorism\". \n \n \n \n \nOh give it up. People change their minds. Admitting you may have been mistaken and changing your mind is a sign of healthy maturity. Fifteen years ago I though smoking was cool. Now I think it's stupid and I quit. Am I flip-flopper for that? The REPUBLICAN Senator from Mn (Norm Coleman) used to be a DEMOCRAT. How's that for a flip-flop? Do you really think you can impress me by showing off how you or the candidates you support are obstinate sticks in the mud who can never learn, grow or change? Sorry - that won't win my vote.\n\n \n \n \n I agree, people change their minds. But when you're 60 years old and have been in politics for 25 years, you don't just change your mind on Iraq and the Patriot Act within a few years. And he does more than change his mind, he actually argues against his first decision. It's safe to say Kerry is mature, he's 60 some odd years old. Changing your mind on smoking is not even in the same league as changing your mind on abortion. If Kerry smoked and told everyone, and then 2 years later he decided to quit smoking and told everyone he didn't like it, then it would be ok (because you don't vote for him because he does or does not smoke). But if he was against abortion 2 years ago, and now he decided for his wife to have an abortion and let everyone know he agrees with abortion now, then that changes everything. You can't just make up some irrelevant comparison like that and think it will work for all situations. When you vote for a President, you want him to be strong and have a concrete like/dislike for some issues. For instance, Iraq. Do you want to vote for someone whose platform is based on the fact that they will leave Iraq, and then in a year have them decide to go into Iraq? I bet you don't. And that is exactly what Kerry is. So vote for him if you want, but don't be surprised if he changes his mind numerous times.", 
   {}, 
   60786, 
   null, 
   1091568240.0
  ], 
  [
   60901, 
   null, 
   "jitobear", 
   "You have your own right to think it's bad. I personally think it's good. But at least back your opinion up with some good facts. Simply showing me a newspaper article does nothing. Show me something from the actual report.\n\n \n Go read it. Or bury your head in the sand. The ducument is a big long, dry legal thing that reads like a car manual though, I warn you. \n \n I would like to point out to you that I have told you I read it and presented an article summmarizing it. Others have also posted links on this topic. You have presented nothing - except either support of it or disbelief.\n \n \nOk, but the conversation was arresting people for legally protesting. I told you to show me a case of that, and then you say you're talking about the TSA. Make up your mind which one you are trying to argue. I told you to show me a case of someone arrested for protesting, and you refer me to a site that says they were arrested for trespassing. Then you tell me you meant the whole TSA thing. Well which one is it?\n\n \n OK. This is how the confusion started.\n \n I said this: I don't have issues with searches at airports. I do have issues with taking people's kids and arresting them for protesting.\n \n You said this thinking I was talking about legal protesting: You are mistaken. People aren't arrested for just protesting. When they trespass on private property and prohibit people from going to work then they get arrested. Nobody gets arrested for nonviolently protesting. Show me a case where that happened.  \n \n I actually was talking about parents protesting being seperated from their kids and being arrested for that.\n \n However I then responded with saying that people get arrested for protesting all the time. Which is true, and usually because they have taken a protest too far. But that was a side note and has nothing to do with the Patriot Act and only added to the confusion. I never meant to make any claims about the Patriot Act in regards to protesting.\n \n \nThey detain people for saying \"bomb\" on a plane. But they don't arrest them. It is the same with the Patriot Act. They don't arrest everyone. They usually detain them and question them, and if they have reason to believe that are a suspect to a crime, then they arrest them. They don't just arrest people for saying \"terrorism\".\n\n \n How do you know? They point is that they have the right to arrest and detain for terrorism on a whim if they so please. THEY DON'T HAVE TO PROVE ANYTHING TO THE COURTS (warrant). Due process is gone. \n \n \nI agree, people change their minds. But when you're 60 years old and have been in politics for 25 years, you don't just change your mind on Iraq and the Patriot Act within a few years.\n\n \n What does age have to do with it? What? Once you reach age 40 you are no longer allowed to re-evaluate and change your mind?\n \n \nAnd he does more than change his mind, he actually argues against his first decision.\n\n \n I know. That is why I will be voting for him.\n \n \nIt's safe to say Kerry is mature, he's 60 some odd years old.\n\n \n So?\n \n \nChanging your mind on smoking is not even in the same league as changing your mind on abortion. If Kerry smoked and told everyone, and then 2 years later he decided to quit smoking and told everyone he didn't like it, then it would be ok (because you don't vote for him because he does or does not smoke). But if he was against abortion 2 years ago, and now he decided for his wife to have an abortion and let everyone know he agrees with abortion now, then that changes everything. You can't just make up some irrelevant comparison like that and think it will work for all situations.\n\n \n Of course not everything has equal weight. But one can change their mind on anything they want.\n \n \nWhen you vote for a President, you want him to be strong and have a concrete like/dislike for some issues.\n\n \n Don't tell me what I want in a president. If you are interested I will tell you. \n \n \nFor instance, Iraq. Do you want to vote for someone whose platform is based on the fact that they will leave Iraq, and then in a year have them decide to go into Iraq? I bet you don't. And that is exactly what Kerry is. So vote for him if you want, but don't be surprised if he changes his mind numerous times.\n\n \n I wouldn't be surprised if anyone changed their minds. I would think that it might sometimes be called for.", 
   {}, 
   60794, 
   null, 
   1091651880.0
  ], 
  [
   60925, 
   null, 
   "Freedom_Fighter", 
   "This is in response to jitobear's comments. I didn't include the original post because it was too long.\n \n It seems to me that your ideas of change and growth of political platforms or idealogies borders on fairweather politics. I believe the point that Bush_is_the_man is attempting to make that respect for a politican comes not from blind obediance to an idea but by showing a willingness to stand for what you believe in. It is true that people change over time but this should not be a radical shift in ideas that swings from one polarity to the next. Why is it that John Kerry speaks so little of his twenty-some years in Congress? This should be his defining period, it is what most qualifies him for the position. The answer to this question lies in his record. John Kerry has at one time or another changed his position on nearly every issue. When negotiating with someone for a major contract I don't like the idea of having to worry if they are going to change their position on the issue at hand any time soon. I can respect them if they stand for an disputed issue even if I am on the other side of the table. \n \n Don't get me wrong, John Kerry is a policitian's politician. For the 2003 Congressional Year John Kerry had the #1 most liberal voting record in the Senate, left of Hillary Clinton and his mentor Ted Kennedy. Now I understand he is free to vote as he wishes but I believe there is no correlation between his record and the way the Kerry campaign currently represents itself to voters. Kerry's votes are far left so he should say \"I believe in liberal style government and follow liberal idealogies.\" Instead the Kerry campaign postions himself as a moderate. How would you, as a Kerry supporter, feel if Pat Buchanan or Pat Roberts advertised themselves as moderates. This would be untrue and I feel the American public is entitled to more.\n \n Politics and change go hand in hand but it is hard to respect a person when they stand on one side of an issue one day and switch their position shortly thereafter, condemning those who stand in their former place.", 
   {
    "post_info": {
     "post_title": "Observation"
    }
   }, 
   60901, 
   null, 
   1091655480.0
  ], 
  [
   60960, 
   null, 
   "apathy", 
   " Don't get me wrong, John Kerry is a policitian's politician. For the 2003 Congressional Year John Kerry had the #1 most liberal voting record in the Senate, left of Hillary Clinton and his mentor Ted Kennedy.\n\n \n \n Please show us where this information comes from?\n Who decided how and why one's vote is liberal and who made the list you are referring to?", 
   {}, 
   60925, 
   null, 
   1091658480.0
  ], 
  [
   60970, 
   null, 
   "Bush Is The Man", 
   "Please show us where this information comes from?\n Who decided how and why one's vote is liberal and who made the list you are referring to?\n\n \n \n \n I was looking at this the other day. Take a look, it'll show you.\n \n #1(http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=37351)\n \n \"The National Journal said today Kerry's rating of 96.5 is far ahead of the scores of Democratic leaders such as Sen. Ted Kennedy and Sen. Hillary Clinton, according to the Drudge Report.\"\n \n #2(http://www.govexec.com/dailyfed/0204/022704nj1.htm)\n This is the best site.\n \n \"But Edwards wasn't far behind: He had a 2003 composite liberal score of 94.5, making him the fourth-most-liberal senator.\"\n \n \"Kerry did not vote with Senate conservatives a single time out of the total of 138 votes used to prepare those ratings.\"\n \n \"Of the 62 Senate votes used to compute the 2003 ratings, Kerry was absent for 37 votes and Edwards missed 22.\" (the issues must not be that important to him if he doesn't have to show up for work?)\n \n \"As a result, in the 2003 vote ratings, Kerry received a rating only in the economic policy category, earning a perfect liberal score. Edwards received ratings in the categories of economic and social issues, also putting up perfect liberal scores.\"\n \n There you go.", 
   {}, 
   60960, 
   null, 
   1091659920.0
  ], 
  [
   60982, 
   null, 
   "Freedom_Fighter", 
   "Please show us where this information comes from?\n Who decided how and why one's vote is liberal and who made the list you are referring to?\n\n \n This information comes from several sources but the most detailed, which contains not only 2003 but all years from 1979, shows all the Democratic candidates lifetime voting records. They are benchmarked to the Americans for Democratic Action (ADA) \"the nation's oldest independent liberal political organization\" stance on issues. \n \n I'm suprised you haven't heard this mentioned before. Many news networks mentioned it in their coverage of the DNC.\n \n http://www.adaction.org/Campaign2004/VotingHistory/votinghistory.html", 
   {}, 
   60960, 
   null, 
   1091661420.0
  ], 
  [
   61112, 
   null, 
   "jitobear", 
   "Well guys, hate to break it to ya, but it's unlikely any white dude in a suit is ever gonna be too liberal for me. emoticon_smile", 
   {}, 
   60982, 
   null, 
   1091734320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  ACLU Refuses to Obey Terror Watch Lists", 
  "url": "http://www.4forums.com/political/politics-debates/2842-aclu-refuses-obey-terror-watch-lists.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2842, 
  "discussion_files": [
   [
    "2019.html", 
    "http://www.4forums.com/political/politics-debates/2842-aclu-refuses-obey-terror-watch-lists-print.html"
   ], 
   [
    "2020.html", 
    "http://www.4forums.com/political/politics-debates/2842-aclu-refuses-obey-terror-watch-lists-2-print.html"
   ]
  ], 
  "identifier": 2842
 }
]