[
 [
  [
   60635, 
   null, 
   "jim's trucking", 
   "Subject: Fwd: Fw: FW: Interesting pics from Iraq.......]\n \n \n In a message dated 7/22/2004 4:53:55 PM Central Daylight Time, wils6909@bellsouth.net writes:\n ----- Something else you won't see on the 6:00 news \n SEEING IS BELIEVING! \n CHECK THESE PICTURES OUT! \n All photos courtesy of MSGT T. Collins, USAF \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n The Iraqi jet, an advanced Russian MiG-25 Foxbat, was found buried in the sand after an informant tipped off U.S. troops. \n \n The MiG was dug out of a massive sand dune near the Al Taqqadum airfield by U.S. Air Force recovery \n teams. The MiG was reportedly one of over two dozen Iraqi jets buried in the sand, like hidden treasure, \n waiting to be recovered at a later date. Contrary to what some in the major media have reported, not all the jets found were from the Gulf War era. \n The Russian-made MiG-25 Foxbat being recovered by U.S. Air Force troops in the photos is an advanced reconnaissance version never before seen in the West and is equipped with sophisticated electronic warfare devices. \n \n U.S. Air Force recovery teams had to use large earth-moving equipment to uncover the MiG, which is over 70 feet long and weighs nearly 25 tons. \n \n The Foxbat is known to be one of Iraq's top jet fighters. The advanced electronic reconnaissance version found by the U.S. Air Force is currently in service with the Russian air force. The MiG is capable of flying at speeds of over 2,000 miles an hour, or three times the speed of sound, and at altitudes of over 75,000 feet. \n \n The recovery of the advanced MiG fighter is considered to be an intelligence coup by the U.S. Air Force. The Foxbat may also be equipped with advanced Russian- and French-made electronics that were sold to Iraq during the 1990s in violation of a U..N. ban on arms sales to Baghdad. \n \n The buried aircraft at Al Taqqadum were covered in camouflage netting, sealed and, in many cases, had their wings removed before being buried more than 10 feet beneath the Iraqi desert. \n \n X Marks the Spot \n \n The discovery of the buried Iraqi jet fighters illustrates the problem faced by U.S. inspection teams searching Iraq for weapons of mass destruction. Iraq is larger in size than California, and the massive deserts south and west of Baghdad were used by Saddam Hussein to hide weapons during the first Gulf war. \n \n U.S. intelligence sources have already uncovered several mass grave burial sites in the open deserts with an estimated 10,000 dead hidden there. In addition, Iraq previously hid SCUD missiles, chemical weapons and biological warheads by burying them under the desert sand. \n \n U.N. inspection teams found the weapons in the early 1990s after detailed information of the exact locations was obtained. \n \n Top U.S. weapons inspector Dr. David Kay is known to favor human intelligence as the primary means to find Iraq's hidden treasure trove of weapons and secrets. \n \n While there are rumors of Iraqi chemical and biological weapons being shipped to nearby Syria, the weapons may very well still remain inside Iraq buried under the vast desert wastelands. \n \n Some critics of the Bush administration have claimed that the inability of U.S. forces to uncover weapons of mass destruction is proof that the president misled the nation into the war with Iraq. \n \n However, in recent days the critics have fallen silent as word quietly leaked from Iraq that major discoveries have already been made and are now being documented completely. Bush administration officials are keeping any such discoveries secret for the moment. Pray they will find something to close the mouths of all his critics before election day.", 
   {
    "post_info": {
     "post_title": "Here's some truth from Iraq..."
    }
   }, 
   null, 
   null, 
   1091421900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Here's some truth from Iraq...", 
  "url": "http://www.4forums.com/political/politics-debates/2849-heres-some-truth-iraq.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2849, 
  "discussion_files": [
   [
    "19360.html", 
    "http://www.4forums.com/political/politics-debates/2849-heres-some-truth-iraq-print.html"
   ]
  ], 
  "identifier": 2849
 }
]