[
 [
  [
   60661, 
   null, 
   "Ladywolf", 
   "Now we all know that there have always been homosexuals in every culture, in every era. We know that there are a lot of same sex couples/households/ families in America. There are gay owned businesses, gay churches, gay schools, etc...\n \n Homosexual secular marriage is a problem for some heterosexual couples. Now if there are going to be gay households, why not just go ahead and make it legal? Homosexuals are not going to stop being homosexuals anymore than heterosexuals will stop being heterosexuals.\n \n As far as the religious debate, I'm talking \"secular\" here. My rabbi has taken care of the rest.\n \n As far as the bible goes, not all people's spiritual belief systems subscribe to the bible or it's teachings (that goes for hetero's and homo's alike). It's like imposing your beliefs on someone else and saying \"I'm right, mine is the only way, and your way is wrong\" which doesn't seem to be the foundation that America was founded on.\n \n Also, since the gay population of the US is pretty much hovering around 10%, the belief that this 10% of the population is going to ruin something heterosexual marriage is pure nonsense. The gays and lesbians are not imposing our values on your families. Why impose your values on us? We are not threatening your marriages. You can still stay married and raise your family as you always have. How does that threaten you?", 
   {
    "post_info": {
     "post_title": "Making Secular Same Sex Marriage Legal..."
    }
   }, 
   null, 
   null, 
   1091463720.0
  ], 
  [
   60667, 
   null, 
   "emclean", 
   "would you have a problem calling a guy marrage a \"civil union\"?", 
   {}, 
   60661, 
   null, 
   1091466900.0
  ], 
  [
   60675, 
   null, 
   "joebrummer", 
   "would you have a problem calling a guy marrage a \"civil union\"?\n\n \n \n Civil Unions do not hold the same power as marriage. The biggest issues are with portablity and Federal benefits. So yes I wold have a problem with it. For more info on the differences between the two visit the links below.\n \n \n http://www.hrc.org/Template.cfm?Section=Center&Template=/ContentManagement/ContentDisplay.cfm&ContentID=16762\n \n \n http://www.yffn.org/spi/marriagevsunion.html", 
   {}, 
   60667, 
   null, 
   1091469180.0
  ], 
  [
   60677, 
   null, 
   "Ladywolf", 
   "Look, I just want to be able to take care of my family like the rest of the couples united in marriage. I feel I should be able to have the same leg up as all the other families.", 
   {
    "post_info": {
     "post_title": "Making Secular Same Sex Marriage Legal..."
    }
   }, 
   60675, 
   null, 
   1091469600.0
  ], 
  [
   60703, 
   null, 
   "joebrummer", 
   "Look, I just want to be able to take care of my family like the rest of the couples united in marriage. I feel I should be able to have the same leg up as all the other families.\n\n \n \n \n Ladywolf,\n It may not be next week, or next month but we will win the right to marry our love ones!", 
   {}, 
   60677, 
   null, 
   1091482860.0
  ], 
  [
   60705, 
   null, 
   "Ladywolf", 
   "I sure hope so. I'd hate to be separated from my life partner when we have to go to nursing homes because we aren't married among the thousands of other situations we can find ourselves in without marriage protections.", 
   {
    "post_info": {
     "post_title": "Making Secular Same Sex Marriage Legal..."
    }
   }, 
   60703, 
   null, 
   1091483520.0
  ], 
  [
   60714, 
   null, 
   "joebrummer", 
   "I sure hope so. I'd hate to be separated from my life partner when we have to go to nursing homes because we aren't married among the thousands of other situations we can find ourselves in without marriage protections.\n\n \n MY partner is seven years older than me, If by some chance he should need to go to a nursing home, they would make me sell the house because we are not married. Most nursing homes take the assets of the people who are there to help pay for what medicare wont. Gays and lesbian older couples have bigger challenges than the rest of us. Some older gays and lesbians have been together 50 or more years. They have no rights in the end. Marriage would out an end to this by protecting those couples from being treated like complete strangers after a 50 year realtionship.\n \n Here are some interestingtid bits on older gay couples who have stayed together for amazing amonts of time, despite the oppression.\n \n \n http://www.usatoday.com/money/perfi/general/2004-05-16-gay-seniors_x.htm\n \n http://www.freep.com/features/living/senior23_20040223.htm\n \n http://www.advocate.com/html/stories/897/897_johnson.asp\n \n \n This one you need to scroll down but it is a cute story of a couple together for 20 years\n \n http://www.queenscourier.com/archives/2002/lead021402b.htm\n \n Oh well, maybe some other have some cute stories of gay couples they can share with us! My partner and I have been together almost five years but I am sure five will become 50 soon enough (marriage or no marrige)", 
   {}, 
   60705, 
   null, 
   1091485080.0
  ], 
  [
   60727, 
   null, 
   "apathy", 
   "This has nothing to do with the govt, but I thought it was curious.\n \n Employees of the university where I work can have certian insurance policies and such. \n \n A married heterosexual can claim their spouse on their health insurance and so can a gay person with his/her significant other, but I am not married and I cannot claim my girlfriend on my insurance and she can't claim me on hers. \n \n Funny world, ain't it?", 
   {}, 
   60714, 
   null, 
   1091490960.0
  ], 
  [
   60733, 
   null, 
   "Duo_Maxwell", 
   "why is marriage even a government issue?", 
   {}, 
   60727, 
   null, 
   1091492940.0
  ], 
  [
   60745, 
   null, 
   "joebrummer", 
   "This has nothing to do with the govt, but I thought it was curious.\n \n Employees of the university where I work can have certian insurance policies and such. \n \n A married heterosexual can claim their spouse on their health insurance and so can a gay person with his/her significant other, but I am not married and I cannot claim my girlfriend on my insurance and she can't claim me on hers. \n \n Funny world, ain't it?\n\n \n \n YTou could if you claim domestic partner, have been together two years and show financial ties! Most Universities will honor that! My partner use to be a professor at a few different colleges. They are usulally pretty liberal.", 
   {}, 
   60727, 
   null, 
   1091505000.0
  ], 
  [
   60749, 
   null, 
   "emclean", 
   "Civil Unions do not hold the same power as marriage. The biggest issues are with portablity and Federal benefits. So yes I wold have a problem with it. For more info on the differences between the two visit the links below.\n \n how about if they were equial, or what might be a better argument (IMO) would be to let the church do the \"marrages\", and the goverment do the \"civial unions\".", 
   {}, 
   60745, 
   null, 
   1091507580.0
  ], 
  [
   60752, 
   null, 
   "Duo_Maxwell", 
   "how about we just get government out of the marriage business all together? \n Let the churchs, whatever church, marry whom ever they wish to.", 
   {}, 
   60749, 
   null, 
   1091508240.0
  ], 
  [
   60777, 
   null, 
   "Ladywolf", 
   "how about we just get government out of the marriage business all together? \n Let the churchs, whatever church, marry whom ever they wish to.\n\n \n Not a bad idea when you think about it. It would require that the government not provide any benefits to any married couples (same sex or not)and their families.", 
   {
    "post_info": {
     "post_title": "Making Secular Same Sex Marriage Legal..."
    }
   }, 
   60752, 
   null, 
   1091555700.0
  ], 
  [
   60805, 
   null, 
   "Duo_Maxwell", 
   "It is infuriating to be a actual conservative who believes in small government and states's rights when your \"party\" supports extreme liberal measures. \n \n GET OUT OF MY LIFE GOVERNMENT. \n \n Smaller government = Better government.", 
   {}, 
   60777, 
   null, 
   1091576100.0
  ], 
  [
   60808, 
   null, 
   "Jaaaman", 
   "Now we all know that there have always been homosexuals in every culture, in every era. We know that there are a lot of same sex couples/households/ families in America. There are gay owned businesses, gay churches, gay schools, etc...\n \n Homosexual secular marriage is a problem for some heterosexual couples. Now if there are going to be gay households, why not just go ahead and make it legal? Homosexuals are not going to stop being homosexuals anymore than heterosexuals will stop being heterosexuals.\n \n As far as the religious debate, I'm talking \"secular\" here. My rabbi has taken care of the rest.\n \n As far as the bible goes, not all people's spiritual belief systems subscribe to the bible or it's teachings (that goes for hetero's and homo's alike). It's like imposing your beliefs on someone else and saying \"I'm right, mine is the only way, and your way is wrong\" which doesn't seem to be the foundation that America was founded on.\n \n Also, since the gay population of the US is pretty much hovering around 10%, the belief that this 10% of the population is going to ruin something heterosexual marriage is pure nonsense. The gays and lesbians are not imposing our values on your families. Why impose your values on us? We are not threatening your marriages. You can still stay married and raise your family as you always have. How does that threaten you?\n\n The fact that a tiny but vocal minority of Americans desire to have someone of the same sex as a partner does not mean that they have a \"right\" to do so, any more than the desires of other tiny (but less vocal) minorities of Americans give them a \"right\" to choose a child, their own brother or sister, or a group of two or more as their marital partners.", 
   {}, 
   60661, 
   null, 
   1091577060.0
  ], 
  [
   60831, 
   null, 
   "joebrummer", 
   "The fact that a tiny but vocal minority of Americans desire to have someone of the same sex as a partner does not mean that they have a \"right\" to do so, any more than the desires of other tiny (but less vocal) minorities of Americans give them a \"right\" to choose a child, their own brother or sister, or a group of two or more as their marital partners.\n\n \n \n ...demographers say the tally of 1.2 million same-sex \"unmarried partners\" is the result of the most substantial polling ever to be done of gays and lesbians in America.\n \n \n 1.2 million doesn't sound like a small minority. They sound like an influential group who should be heard based on the numbers. Not Jaaman's want to be facts.\n \n Source: http://www.advocate.com/html/stories/847/847_census.asp", 
   {
    "unicode_changes_made": true
   }, 
   60808, 
   null, 
   1091593260.0
  ], 
  [
   61760, 
   null, 
   "Jaaaman", 
   "Eventually, as marriage becomes totally debased and meaningless except as a method to get gov't benefits or insurance, most people won't bother to get married and we'll see skyrocketing crime and drug use, single mothers mired in poverty raising their kids, and all the other ills befall our society that go along with illegitimacy. :(", 
   {}, 
   60831, 
   null, 
   1092254220.0
  ], 
  [
   61762, 
   null, 
   "Jaaaman", 
   "how about we just get government out of the marriage business all together? \n Let the churchs, whatever church, marry whom ever they wish to.\n\n Marriage is not just a private affair. Every marriage is a public virtue in that it responsibly regulates human sexuality, brings the two parts of humanity together in a cooperative and mutually beneficial relationship and it delivers mothers and fathers to children. Society benefits from the well-being of marriage; nearly every dollar spent by our government on social welfare is in reaction to a marriage breaking down or failing to form. Good things happen when we honor what marriage is. Bad things happen when we try to change it.", 
   {}, 
   60752, 
   null, 
   1092255300.0
  ], 
  [
   61769, 
   null, 
   "joebrummer", 
   "Marriage is not just a private affair. Every marriage is a public virtue in that it responsibly regulates human sexuality, brings the two parts of humanity together in a cooperative and mutually beneficial relationship and it delivers mothers and fathers to children. Society benefits from the well-being of marriage; nearly every dollar spent by our government on social welfare is in reaction to a marriage breaking down or failing to form. Good things happen when we honor what marriage is. Bad things happen when we try to change it.\n\n \n \n Yes, we have heard this before. Marriage is this wonderful institution that only fertile, straight couples of child bearing age should be entitled to. Does that sum up your dooms-day post.\n \n \n A large portion of social services are there and in place because of marriages that did stay together that shouldn't have.\n \n \n (Bad things happen when we try to change it.)\n \n We changed it when we allowed inter-racial marriage, did bad things happen? No they didn't.\n \n Some people are so negative, is the glass half empty or half full?", 
   {}, 
   61762, 
   null, 
   1092257340.0
  ], 
  [
   61777, 
   null, 
   "JustineCredible", 
   "would you have a problem calling a guy marrage a \"civil union\"?\n\n \n \n Yes, I would. The term is not simply just words. The definition of Civil Unions do not allow for the over 1,100 rights, liberties and protections granted to otherwise Legally Married couples. Civil Unions are non-transportable, meaning a civil union from one state cannot be recognized in other states. \n \n Now if you would like to call ALL legally recognized unions as Legal marriage, fine. That goes for heterosexuals as well. I just can't see that a heterosexual couple would ever want to enter into a \"civil union\" being as they would be denied spousal recognitions and transportability. \n \n I have als been asked before, in another forum, if I would be opposed to leaving the decission up to individual states. My answer is, yes. Due to the fact that legal marriages between heterosexual couples are granted federal recognition, benefits and interstate transportability which would be denied to Civil Unions if left up to individual states. \n \n Also we all know what would have happened if individual states were allowed to have determined women's right to vote, interracial marriage and de-segragation. None of those would have happened. \n Sometimes the general public just doesn't know what's best for their state's citizens. Much of the voting public is simply just too under-informed or misinformed. \n \n HR3313 (Protection of Marriage Act) and DOMA...MUST be repealed and steps to make all rights equal must be taken. \n \n The issue of gay marriage rights is indeed a civil rights issue. There is no way around it.", 
   {}, 
   60667, 
   null, 
   1092260220.0
  ], 
  [
   61802, 
   null, 
   "Jaaaman", 
   "Yes, I would. The term is not simply just words. The definition of Civil Unions do not allow for the over 1,100 rights, liberties and protections granted to otherwise Legally Married couples. Civil Unions are non-transportable, meaning a civil union from one state cannot be recognized in other states. \n \n Now if you would like to call ALL legally recognized unions as Legal marriage, fine. That goes for heterosexuals as well. I just can't see that a heterosexual couple would ever want to enter into a \"civil union\" being as they would be denied spousal recognitions and transportability. \n \n I have als been asked before, in another forum, if I would be opposed to leaving the decission up to individual states. My answer is, yes. Due to the fact that legal marriages between heterosexual couples are granted federal recognition, benefits and interstate transportability which would be denied to Civil Unions if left up to individual states. \n \n Also we all know what would have happened if individual states were allowed to have determined women's right to vote, interracial marriage and de-segragation. None of those would have happened. \n Sometimes the general public just doesn't know what's best for their state's citizens. Much of the voting public is simply just too under-informed or misinformed. \n \n HR3313 (Protection of Marriage Act) and DOMA...MUST be repealed and steps to make all rights equal must be taken. \n \n The issue of gay marriage rights is indeed a civil rights issue. There is no way around it.\n\n A civil right can't justly be denied for any reason. Slavery is a civil rights violation regardless of rationale. Yet, it wouldn't be a civil rights violation if state governments increased the legal age for marriage from 18 to 21 thus denying marriage to some. We may disagree with that law, but it's not a rights violation. If all marriage was illegal, would that violate civil rights? No. It would be a denial of a different right, the right to be free of oppressive laws that would destroy society - but that right is not unique to marriage.\n Civil rights terminology being applied to gay marriage is like a gaudy neon sign illuminating the slippery slope of moral decline. emoticon_ic", 
   {}, 
   61777, 
   null, 
   1092269700.0
  ], 
  [
   61808, 
   null, 
   "JakeCJB", 
   "If all marriage was illegal, would that violate civil rights? No. It would be a denial of a different right, the right to be free of oppressive laws that would destroy society - but that right is not unique to marriage.\n\n \n I don't think you could say that it would destroy society. That's a different issue, however.\n \n \nCivil rights terminology being applied to gay marriage is like a gaudy neon sign illuminating the slippery slope of moral decline. emoticon_ic\n\n \n There's that slippery slope fallacy being used countless times, when no one has a logical argument. Have you ever considered that it may be moral to treat gay and lesbian people with equality?", 
   {}, 
   61802, 
   null, 
   1092271200.0
  ], 
  [
   61946, 
   null, 
   "Jaaaman", 
   "Marriage is an institution and should be recognized and honored as such. A traditional man/woman marriage is the norm, anything outside of that weakens the concept of the marital union. The homo agenda has been very upfront that they will not settle for just homosexual partners, they also plan to introduce adult/children relationships as the norm. It sounds farfetched at this time, but society will eventually be encouraged to recognize people/animal unions as well. The whole concept and application of marriage will be weakened by the acceptance of homosexual unions.\n \n Same-sex couples encounter tremendous medical expenses as a result of their unhealthy, abnormal physical activities. Most of them have no insurance coverage and the cost of their short and long term care, especially as it involves HIV and AIDS, is astronomical. Even those with same-sex health benefits find that the coverage is inadequate. The health insurance carriers simply cannot provide the coverage necessary for this health risk. The cost of this coverage is naturally passed onto the taxpayer. As homosexual marriage is popularized our society will see an explosion of health problems (STD's, HIV, AIDS, etc.)that go along with type of risky, irresponsible behavior. The blood supply runs a huge risk of being tainted even more than it is now, and many communities are already running short of an adequate, healthy blood supply.\n \n The pro-homo agenda is already being pushed in the government school and media elite systems. Our children are being bombarded with nonfactual, slanted information supporting the homosexual agenda. This agenda has a clearcut, focused goal of reaching our young people and presenting homosexuality as the norm. Our children are already confused as a result of the feminist and secular influences, now they are being expected to embrace a \"lifestyle choice\" that has proven to be harmful both physically and emotionally.\n \n This will be the downfall of American society as we know it. Every \"enlightened\" society from the times of Sodom and Gamorrah to the Roman Empire to the Nazi regime to modern day Europe has destructed due in large part to the acceptance and encouragement of the homosexual influence. This influence has proven to be one of social unrest, economic hardship, downfall of the family unit, and widespread disease. THERE IS NO PLACE IN RECORDED HISTORY WHERE A SOCIETY FLOURISHED AFTER IT EMBRACED THE HOMOSEXUAL AGENDA.", 
   {
    "post_info": {
     "post_title": "Here we go again"
    }
   }, 
   61808, 
   null, 
   1092353400.0
  ], 
  [
   61955, 
   null, 
   "Duo_Maxwell", 
   "Marriage is not just a private affair.\n\n \n Apparently everything is a public affair to those who believe they are the regulators of morality, except their own business. Some of us want small government, privacy, low corruption, better use of funds, apparently you don't. \n \n \nEvery marriage is a public virtue in that it responsibly regulates human sexuality, brings the two parts of humanity together in a cooperative and mutually beneficial relationship\n\n \n So therefore gays should be allow to marry.\n \n \nand it delivers mothers and fathers to children.\n\n \n You never proved marriage is related to children even in the face of refuations and challenges. You constantly use the same debuked arguments time and time again, with the same lies and fallacies and hope no one remembers how pathetically weak your argument really are. \n \n \nSociety benefits from the well-being of marriage; nearly every dollar spent by our government on social welfare is in reaction to a marriage breaking down or failing to form.\n\n \n Oversimplifaction. Besides, like always, you have no proof. \n \n \n\n Good things happen when we honor what marriage is. Bad things happen when we try to change it.\n\n \n Then you'd like to go back to the origianl meaning of marriage? The Pagan one eh? \n \n \nTHERE IS NO PLACE IN RECORDED HISTORY WHERE A SOCIETY FLOURISHED AFTER IT EMBRACED THE HOMOSEXUAL AGENDA.\n\n \n True, except all of the birthplaces and rebirth places of Western Society.", 
   {}, 
   61762, 
   null, 
   1092354180.0
  ], 
  [
   61961, 
   null, 
   "JustineCredible", 
   "Eventually, as marriage becomes totally debased and meaningless except as a method to get gov't benefits or insurance, most people won't bother to get married and we'll see skyrocketing crime and drug use, single mothers mired in poverty raising their kids, and all the other ills befall our society that go along with illegitimacy. :(\n\n \n \n What? We don't already have that now? \n When was the last time you were in a major urban area, darlin? \n If I were you, I'd be more concerned with divorce, infidelity, single motherhood, rape and insest. Not Gay marraige. \n Gays aren't going to be the reason if your marriage can't withstand the test of time, kiddo. \n Welcome to the Twenty-first Century.", 
   {}, 
   61760, 
   null, 
   1092354840.0
  ], 
  [
   61964, 
   null, 
   "JustineCredible", 
   "A civil right can't justly be denied for any reason. Slavery is a civil rights violation regardless of rationale. Yet, it wouldn't be a civil rights violation if state governments increased the legal age for marriage from 18 to 21 thus denying marriage to some. We may disagree with that law, but it's not a rights violation. If all marriage was illegal, would that violate civil rights? No. It would be a denial of a different right, the right to be free of oppressive laws that would destroy society - but that right is not unique to marriage.\n Civil rights terminology being applied to gay marriage is like a gaudy neon sign illuminating the slippery slope of moral decline. emoticon_ic\n\n \n Jaaaman: \n \n You really need to get out more. The slippery slope of moral decline is upon us as we speak and it has NOTHING to do with gay marriage. Divorce, infidelity, prostitution, pornography, children abuse/neglect/molestation, spousal abuse, addiction and disease have very little to do with Gay Marriages, if anything at all. \n If I were you, I would be more concerned with those mosly Heterosexual issues which are already lending to moral decline. \n \n If ONLY gays were allowed to marry, would that be a civil rights violation? \n I'm sure heterosexuals woud be up in arms if that were to happen. \n \n Try putting the shoe on the other foot once in a while. I'll tell you now, it doesn't feel very good.", 
   {}, 
   61802, 
   null, 
   1092355260.0
  ], 
  [
   62510, 
   null, 
   "Jaaaman", 
   "Jaaaman: \n \n You really need to get out more. The slippery slope of moral decline is upon us as we speak and it has NOTHING to do with gay marriage. Divorce, infidelity, prostitution, pornography, children abuse/neglect/molestation, spousal abuse, addiction and disease have very little to do with Gay Marriages, if anything at all. \n If I were you, I would be more concerned with those mosly Heterosexual issues which are already lending to moral decline. \n \n If ONLY gays were allowed to marry, would that be a civil rights violation? \n I'm sure heterosexuals woud be up in arms if that were to happen. \n \n Try putting the shoe on the other foot once in a while. I'll tell you now, it doesn't feel very good.\n\n Heterosexual marriages are the model that was intended for the human race. \"Gay\" relationships are an abomination and serve only to lead society to a moral decline.", 
   {}, 
   61964, 
   null, 
   1092701640.0
  ], 
  [
   62530, 
   null, 
   "joebrummer", 
   "Heterosexual marriages are the model that was intended for the human race. \"Gay\" relationships are an abomination and serve only to lead society to a moral decline.\n\n \n \n \n At one time this is what whites siad about blacks. Wasn't right then, isn't right now. So why would you want to start saying it about another group of oppressed people.\n \n \n We have all heard your doomsday speeches Jaaman, we gays , little group of 10% of the population have the power to take down everything. \n \n PS, There never was or will be a gay agenda. It is a stupid myth and funny enough the only ones that belive in the gay agenda also believe in a big book myth with lots of people drinking wine and telling stories. You know what happen when you drink too much wine and tell stories. A lilttle rainstorm turns into a worldwide flood, and people come back from the dead. Jaaman, go have some more wine.", 
   {}, 
   62510, 
   null, 
   1092708900.0
  ], 
  [
   62538, 
   null, 
   "CCR1994", 
   "Now we all know that there have always been homosexuals in every culture, in every era. We know that there are a lot of same sex couples/households/ families in America. There are gay owned businesses, gay churches, gay schools, etc...\n \n Homosexual secular marriage is a problem for some heterosexual couples. Now if there are going to be gay households, why not just go ahead and make it legal? Homosexuals are not going to stop being homosexuals anymore than heterosexuals will stop being heterosexuals.\n \n As far as the religious debate, I'm talking \"secular\" here. My rabbi has taken care of the rest.\n \n As far as the bible goes, not all people's spiritual belief systems subscribe to the bible or it's teachings (that goes for hetero's and homo's alike). It's like imposing your beliefs on someone else and saying \"I'm right, mine is the only way, and your way is wrong\" which doesn't seem to be the foundation that America was founded on.\n \n Also, since the gay population of the US is pretty much hovering around 10%, the belief that this 10% of the population is going to ruin something heterosexual marriage is pure nonsense. The gays and lesbians are not imposing our values on your families. Why impose your values on us? We are not threatening your marriages. You can still stay married and raise your family as you always have. How does that threaten you?\n\n \n Apparently gay marriage is more threatening than unmarried gay couples are. The point about legalizing gay households is certainly puzzling unless one contends that cohabitation is illegal (which it isn't). But just in case I'm wrong, perhaps the authorities should be notified of all the heterosexual unmarried couples and they should be hauled off to jail.", 
   {}, 
   60661, 
   null, 
   1092712860.0
  ], 
  [
   62551, 
   null, 
   "joebrummer", 
   "Apparently gay marriage is more threatening than unmarried gay couples are. The point about legalizing gay households is certainly puzzling unless one contends that cohabitation is illegal (which it isn't). But just in case I'm wrong, perhaps the authorities should be notified of all the heterosexual unmarried couples and they should be hauled off to jail.\n\n \n \n \n oh cc, apparently, 10% of the population has the power to destroy the other 90% somehow. We can't be in the military because we have the power to undermine things, we can't get married cause we will destroy marriage for everyone, we cannot possibly have committed relationships because it would make Britney look bad ( although, I have her beat by 4 years and counting, still happy and going) We have the power. We are gay, ten percent taking out the other 90% or so they say (ask jaaman for more info)", 
   {}, 
   62538, 
   null, 
   1092717300.0
  ], 
  [
   62560, 
   null, 
   "Jaaaman", 
   "oh cc, apparently, 10% of the population has the power to destroy the other 90% somehow. We can't be in the military because we have the power to undermine things, we can't get married cause we will destroy marriage for everyone, we cannot possibly have committed relationships because it would make Britney look bad ( although, I have her beat by 4 years and counting, still happy and going) We have the power. We are gay, ten percent taking out the other 90% or so they say (ask jaaman for more info)\n\n Yes.... 10% of the population has a disorder (homosexuality) that they refuse to deal with in the proper way do to the fact they believe that the majority should just except there so called \"sexual orientation\" and treat it like it is as normal as a traditional relationship between a man and a woman. I'm sorry, but I cannot except this concept that your \"orientation\" is on the same playing field as mine. It is not. Abdominable and wrong behavior do not deserve rights.", 
   {}, 
   62551, 
   null, 
   1092719040.0
  ], 
  [
   62562, 
   null, 
   "Jaaaman", 
   "I'm sorry about the harshness in that last post. I went too far there.", 
   {}, 
   62560, 
   null, 
   1092719220.0
  ], 
  [
   62563, 
   null, 
   "JakeCJB", 
   "Yes.... 10% of the population has a disorder (homosexuality) that they refuse to deal with in the proper way do to the fact they believe that the majority should just except there so called \"sexual orientation\" and treat it like it is as normal as a traditional relationship between a man and a woman. I'm sorry, but I cannot except this concept that your \"orientation\" is on the same playing field as mine. It is not. Abdominable and wrong behavior do not deserve rights.\n\n \n Gays and lesbians are people with an identity, not merely a behaviour. Is one's sexuality all that determines whether one is a decent person, worthy of rights? I hardly think so.", 
   {}, 
   62560, 
   null, 
   1092719400.0
  ], 
  [
   62565, 
   null, 
   "joebrummer", 
   "Yes.... 10% of the population has a disorder (homosexuality) that they refuse to deal with in the proper way do to the fact they believe that the majority should just except there so called \"sexual orientation\" and treat it like it is as normal as a traditional relationship between a man and a woman. I'm sorry, but I cannot except this concept that your \"orientation\" is on the same playing field as mine. It is not. Abdominable and wrong behavior do not deserve rights.\n\n \n \n \n BUT how is it not.....I have a committed realtionship, and after 4 years ( longer than most heterosexual relationships) don't we deserve the same rights as you , even if.....you don't believe it is moral. We have given our lives to each other. How is that different from your relationship. Is yours better in some way?....NO it is not....", 
   {}, 
   62560, 
   null, 
   1092719460.0
  ], 
  [
   62573, 
   null, 
   "Duo_Maxwell", 
   "Heterosexual marriages are the model that was intended for the human race. \"Gay\" relationships are an abomination and serve only to lead society to a moral decline.\n\n \n Then why did the Church willingly hold gay marriages until the 13th century? \n Oh wait, you can't answer that and will subsequentially ignore this. \n \n \n that they refuse to deal with in the proper way do to the fact they believe that the majority should just except there so called \"sexual orientation\" and treat it like it is as normal as a traditional relationship between a man and a woman.\n\n \n It happenend until the 13th cenutry. It happened in renissance Italy, it happened in ancient Greece. It happened in the birth place and rebirth places of Western society. Oh wait, you can't answer that and will subsequentially ignore this. \n \n \nAbdominable and wrong behavior do not deserve rights.\n\n \n I think you are a abomindation, so I can strip you of your rights? Cool! \n Using that logic, we can strip the rights of everyone and everything we so please to do.", 
   {}, 
   62510, 
   null, 
   1092723660.0
  ], 
  [
   62677, 
   null, 
   "Ladywolf", 
   "Secular people, securlar. This thread is about secular marriage...not relgious marriage. I've already got the relgious marriage part covered.\n \n I believe the decisions about secular marriage should be done so without religious considerations, but with human logic considerations only. You know, humanity and all that good stuff.\n \n If people based their opinions on secular marriage on religion, than it wouldn't be about secular marriage now would it? :xbanghead", 
   {
    "post_info": {
     "post_title": "Making Secular Same Sex Marriage Legal..."
    }
   }, 
   62573, 
   null, 
   1092766080.0
  ], 
  [
   63353, 
   null, 
   "Jaaaman", 
   "Secular people, securlar. This thread is about secular marriage...not relgious marriage. I've already got the relgious marriage part covered.\n \n I believe the decisions about secular marriage should be done so without religious considerations, but with human logic considerations only. You know, humanity and all that good stuff.\n \n If people based their opinions on secular marriage on religion, than it wouldn't be about secular marriage now would it? :xbanghead\n\n Ok. Here we go. Human logic? How about this: So where do we stop? If a man can marry a man, then should a man be able to marry as many women as he wants at one time?. Should a man should be able to marry a boy, because that is his sexual orientation? Should a woman be able to marry her brother if they are sexually attracted to each other? Are we really going to live and let live here? Is it a violation of somebody's rights let them only marry one person at a time?\n \n Having this argument is not some far-fetched hypothetical worst-case scenario. This debate is actually raging in Holland, where all forms of alternative families are building on the \"successes\" of the gay community. Because two lesbians need a male to have a baby, they are considering creating a legal entity that would be defined as two gays or lesbians, and a member of the opposite sex. How can you legalize gay marriage but still outlaw bigamy? Don't we want to live and let live? How big do you want the marriage tent to be?", 
   {}, 
   62677, 
   null, 
   1093054620.0
  ], 
  [
   63417, 
   null, 
   "JakeCJB", 
   "Ok. Here we go. Human logic? How about this: So where do we stop? If a man can marry a man, then should a man be able to marry as many women as he wants at one time?\n\n \n Um, if a man can marry one woman, then should a man be able to marry as many women as he wants? Where do we stop? \n \n \nShould a man should be able to marry a boy, because that is his sexual orientation?\n\n \n Not under the age of being able to freely consent.\n \n \nShould a woman be able to marry her brother if they are sexually attracted to each other?\n\n \n If a woman can marry a man outside her family, should she be able to marry a man inside her family? \n \n \nAre we really going to live and let live here? Is it a violation of somebody's rights let them only marry one person at a time?\n\n \n Ask the men who have many wives, not gay people.\n \n \nHaving this argument is not some far-fetched hypothetical worst-case scenario. This debate is actually raging in Holland, where all forms of alternative families are building on the \"successes\" of the gay community. Because two lesbians need a male to have a baby,\n\n \n It's a slippery slope fallacy. The lesbians just need his sperm.\n \n \nthey are considering creating a legal entity that would be defined as two gays or lesbians, and a member of the opposite sex. How can you legalize gay marriage but still outlaw bigamy? Don't we want to live and let live? How big do you want the marriage tent to be?\n\n \n Well, it depends on what kind of legal \"entity\" you are talking about. I can't see gays and lesbians having marriages with straight people. Is it just for the purpose of setting out everyone's rights and what everyone agrees to in a contract? Could it apply to heterosexuals who use a surrogate or a sperm donor too? You are not giving much information on this. How can you have legal straight marriage and not allow bigamy?", 
   {}, 
   63353, 
   null, 
   1093074840.0
  ], 
  [
   63427, 
   null, 
   "Jaaaman", 
   "Gays and lesbians are people with an identity, not merely a behaviour. Is one's sexuality all that determines whether one is a decent person, worthy of rights? I hardly think so.\n\n Lets remember that it is the gays who want to change an institution that is as old as civilization. The burden of proof of the efficacy of this is on them, not the other way around. When a company proposes a new drug, it first has to prove that the drug is safe. First you try a small experiment, and then you go to bigger trials. The early results of this social experiment are coming back from smaller countries in Europe, and the results are not looking so good. The stakes for society are too high to allow this to happen here.", 
   {}, 
   62563, 
   null, 
   1093099920.0
  ], 
  [
   63432, 
   null, 
   "joebrummer", 
   "Lets remember that it is the gays who want to change an institution that is as old as civilization. The burden of proof of the efficacy of this is on them, not the other way around. When a company proposes a new drug, it first has to prove that the drug is safe. First you try a small experiment, and then you go to bigger trials. The early results of this social experiment are coming back from smaller countries in Europe, and the results are not looking so good. The stakes for society are too high to allow this to happen here.\n\n \n \n Burden of proof, that is funny coming from you since you rarely prove anything you state. More lies and unfounded babble. Smaller countries in Europe that have allowed same sex marriage are looking very good. Heterosexual marriage in fact is looking better. Again if you are going to make these claims back them up. Read this!\n \n Despite what Kurtz might say, the apocalypse has not yet arrived. In fact, the numbers show that heterosexual marriage looks pretty healthy in Scandinavia, where same-sex couples have had rights the longest. In Denmark, for example, the marriage rate had been declining for a half-century but turned around in the early 1980s. After the 1989 passage of the registered-partner law, the marriage rate continued to climb; Danish heterosexual marriage rates are now the highest they've been since the early 1970's. And the most recent marriage rates in Sweden, Norway, and Iceland are all higher than the rates for the years before the partner laws were passed. Furthermore, in the 1990s, divorce rates in Scandinavia remained basically unchanged. \n \n source: http://slate.msn.com/id/2100884/\n \n or this tid-bit\n \n Some, like Ettelbrick, contend that these \"marriage-lite\" alternatives - open to heterosexual couples as well - might be doing more to undermine traditional marriage than granting gay couples full marital rights.\n \n Sourcehttp://www.washblade.com/2004/7-30/news/worldnews/early.cfm", 
   {
    "unicode_changes_made": true
   }, 
   63427, 
   null, 
   1093103640.0
  ], 
  [
   63442, 
   null, 
   "Jaaaman", 
   "And the most recent marriage rates in Sweden, Norway, and Iceland are all higher than the rates for the years before the partner laws were passed. Furthermore, in the 1990s, divorce rates in Scandinavia remained basically unchanged. \n \n source: http://slate.msn.com/id/2100884/\n \n \n\n Visit Stockholm and you'll see not only state-sanctioned gay marriages, but every manner of sexual depravity. That culture is on the brink of collapse and its citizens seem unaware.\n Early data from Sweden doesn't look good for the pro-homosexual movement. Legalized gay marriages in Sweden actually suffer dramatically increased numbers of divorces as compared to the heterosexual population: Gay male couples were 50% more likely to divorce as married opposite sex couples, while lesbian couples were 167% more likely to divorce as opposite sex married couples over a similar period of time.\n \n Source:\n The Study \"Same-sex unions and divorce risk\":Data from Sweden\n Institute for Marriage and Public Policy", 
   {}, 
   63432, 
   null, 
   1093112460.0
  ], 
  [
   63469, 
   null, 
   "JakeCJB", 
   "Visit Stockholm and you'll see not only state-sanctioned gay marriages, but every manner of sexual depravity. That culture is on the brink of collapse and its citizens seem unaware.\n\n \n First off, it's registered partnership for same-sex couples, not marriage(although marriage may happen soon). Good for you for bashing Swedes for not being hypocrites and puritans, so that now you may go to heaven. Sweden most certainly is not on the brink of collapse. If Americans can get the child poverty rate anywhere close to 2.6%, as Sweden has done, then I may consider the USA a society of equal morals.\n \n \nEarly data from Sweden doesn't look good for the pro-homosexual movement.\n\n \n First of all what is the \"pro-homosexual movement\" as you call it? That is like saying the pro-black or pro-Jew movement. It just shows your bigotry.\n \n \nLegalized gay marriages in Sweden \n\n \n Again, there is not legalized gay marriage in Sweden. There is registered domestic partnership.\n \n \nactually suffer dramatically increased numbers of divorces as compared to the heterosexual population: Gay male couples were 50% more likely to divorce as married opposite sex couples, while lesbian couples were 167% more likely to divorce as opposite sex married couples over a similar period of time.\n\n \n As long as you want to compare marriages to registered partnerships and civil unions. You may as well look at these statistics too...\n \n Divorce rates for Vermont in 2002....\n \n Straight Marriage Divorce Rate: 42.47%\n Gay Civil Union Divorce Rate: 0.53%\n http://www.gaydemographics.org/USA/states/vermont/2000Census_state_vt_civilunions.htm\n \n Not so fast, said Darren Spedale, a law and business student at Stanford University, who studied divorce rates in Denmark in 1996-97, seven years after same-sex registered partnerships were legalized. He found that 17 percent of gay partnerships ended in divorce compared with 46 percent of the straight relationships.\n http://sfgate.com/cgi-bin/article.cgi?f=/c/a/2004/02/27/MNG1H59R5Q1.DTL\n \n Divorce rates from whatever jusrisdiction we may look at, are not a reason to deny a group of people, gay or straight, the right to marry.", 
   {}, 
   63442, 
   null, 
   1093122360.0
  ], 
  [
   63473, 
   null, 
   "joebrummer", 
   "It appears to be a no win thing with jaaman, He doesn't want to hear the facts or see reality. That might get in the way of what his preacher made up from his bigoted interpretation of the bible.", 
   {}, 
   63469, 
   null, 
   1093123740.0
  ], 
  [
   63476, 
   null, 
   "JustineCredible", 
   "Marriage is an institution and should be recognized and honored as such. A traditional man/woman marriage is the norm, anything outside of that weakens the concept of the marital union. \n\n \n Outside of that. So, that also means premarital sex, single parents without the benefit of a marriage and singles who adopt without the benefit of being in a marraige of any kind?\n \n \n\n The homo agenda has been very upfront that they will not settle for just homosexual partners, they also plan to introduce adult/children relationships as the norm. It sounds farfetched at this time, but society will eventually be encouraged to recognize people/animal unions as well. The whole concept and application of marriage will be weakened by the acceptance of homosexual unions.\n \n\n \n Right! And that exact same arguement was used when the issue of interracial marriage was being fought over too. \n How many times do you have to hear/read the statement \"TWO CONCENTING ADULT HUMANS\" before it sinks in? \n Obviously not enough.\n If a goat can write his/her name and answer freely of his/her concent to marry a human, that will be the day! \n You might as well just pack it up now.\n \n \nSame-sex couples encounter tremendous medical expenses as a result of their unhealthy, abnormal physical activities.\n\n \n Wow, so I guess heterosexuals who throw themselves out of planes, get themselves lost on mountain tops, loose life and limb in farming equipment don't play too highly into your figures now do they?\n \n \n Most of them have no insurance coverage and the cost of their short and long term care, especially as it involves HIV and AIDS, is astronomical.\n\n \n WHOA Nelly! That's to assume that every homosexual has HIV/AIDS. What a misconception you have there. Not to mention the fact that almost as many HETEROSEXUALS are infected with HIV as homosexuals! \n \n \"Eight out of ten Uninsured families are WORKING families. \"\n \"29 Million of the uninsured in 2002 had household incomes of $25,000 or more!\"\n \n \"Washington, DC - A comprehensive analysis of government data shows that a significant number of working Americans in every state do not have health care coverage, with at least 20 million working Americans not having coverage. In six states, at least one in five working adults is uninsured. In 38 other states, at least one working adult in every 10 does not have health insurance. The report further reveals that in every state, adults who do not have health insurance experience significant gaps in medical care compared to those who do. \"\n {Go to the link}\n [URL=http://covertheuninsuredweek.org/media/docs/release050504.php3]\n \n MOST OF THOSE FAMILIES ARE HETEROSEXUAL! \n \n \nEven those with same-sex health benefits find that the coverage is inadequate.\n\n \n Most of ALL Americans insurence coverage is inadiquate. What does that prove? NOTHING\n \n \n The health insurance carriers simply cannot provide the coverage necessary for this health risk. The cost of this coverage is naturally passed onto the taxpayer.\n\n \n \n As homosexual marriage is popularized our society will see an explosion of health problems (STD's, HIV, AIDS, etc.)that go along with type of risky, irresponsible behavior. The blood supply runs a huge risk of being tainted even more than it is now, and many communities are already running short of an adequate, healthy blood supply.\n\n \n MARRIAGE means MONOGOMOUS...which in turn means just the opposite of your statement. But I'm not really shocked that you wouldn't have figured that out. I'm still wondering who you're quoting though? Those statements sound suspisiously like those given on the \"Family Research Council\" website. A Faith based website that is adimently against homosexual marriage and is hell bent on twisting facts to suit their purposes, just so they can raise money. Yeah, real \" Christian like\" behavior...NOT! \n \n \nThe pro-homo agenda is already being pushed in the government school and media elite systems. Our children are being bombarded with nonfactual, slanted information supporting the homosexual agenda. This agenda has a clearcut, focused goal of reaching our young people and presenting homosexuality as the norm.\n\n The Norm? Please, a norm for those who are homosexuals, yes of course. Just as menstruation is A NORM for FEMALES. \n \n \n Our children are already confused as a result of the feminist and secular influences, now they are being expected to embrace a \"lifestyle choice\" that has proven to be harmful both physically and emotionally.\n\n \n Oh now we see your true colors. Blame it on the women. Those nasty, vile creatures of the devil. \n Get over yourself. \n \n \n \nThis will be the downfall of American society as we know it. Every \"enlightened\" society from the times of Sodom and Gamorrah to the Roman Empire to the Nazi regime to modern day Europe has destructed due in large part to the acceptance and encouragement of the homosexual influence.\n\n \n So you're saying that Nazi Germany was good? That genoside was the RIGHT thing to do? \n WOW, now I'm convinced that you are not only deluded but insane! \n \n \n This influence has proven to be one of social unrest, economic hardship, downfall of the family unit, and widespread disease.\n\n \n Ah, so your mental malfunction is due to what, you're gay? Oh well that explains it...\n \n \n THERE IS NO PLACE IN RECORDED HISTORY WHERE A SOCIETY FLOURISHED AFTER IT EMBRACED THE HOMOSEXUAL AGENDA.\n\n \n Yup, and there's none saying those societies didn't. \n BTW, what exactly is they \"Gay Agenda?\" \n \n Now you're starting to remind me of this one gal/guy couple who actually started an organization called \"International Organization Of Heterosexual Rights.\" \n \n The husband was admittedly the product of child molestation and was convinced that his ex-wife was sexually molesting his children. Children which he was NOT granted custody of from their divorce. Mainly due to the fact that he was concidered to be a source of harm to those children because of his extreme views and obvious hatred. \n \n Jaaaman; this post of yours has sealed my conclussion that you are in need of anger management if not psychiatric help. Your views are not only extreme but mysoginistic and dangerous.\n I will have nothing more to do with your posts after this one. You've gone off the deep end here and have zero facts. \n I suggest once you get help, that maybe you should volunteer your time to an AIDS hospice, where you will find that not all of those dieing are gay. \n I suggest you volunteer for \"Covering The Uninsured\" so you see that most uninsured citizens are actually HETEROSEXUAL WORKING FAMILIES...not the 'burnden - gays' you paint them to be.\n \n Until then, don't bother responding. You are wrong, you are twisted and you need help.\n \n No, I have NOT gone too far here, you have and I'm certainly NOT going to sit idly by and read your destructive lies!", 
   {}, 
   61946, 
   null, 
   1093128300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Making Secular Same Sex Marriage Legal...", 
  "url": "http://www.4forums.com/political/gay-rights-debates/2851-making-secular-same-sex-marriage-legal.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 2851, 
  "discussion_files": [
   [
    "11851.html", 
    "http://www.4forums.com/political/gay-rights-debates/2851-making-secular-same-sex-marriage-legal-print.html"
   ], 
   [
    "11852.html", 
    "http://www.4forums.com/political/gay-rights-debates/2851-making-secular-same-sex-marriage-legal-3-print.html"
   ], 
   [
    "11853.html", 
    "http://www.4forums.com/political/gay-rights-debates/2851-making-secular-same-sex-marriage-legal-2-print.html"
   ]
  ], 
  "identifier": 2851
 }
]