[
 [
  [
   61133, 
   null, 
   "Ladywolf", 
   "Was watching \"The Simple Life 2\" the other night and remembered an interview with Donald Trump about Paris and how he thought she was smart. I thought he was crazy for saying that at the time, but watching the show, I can see what they had to do (Paris/Nicole) to cross the southern states without money or food or gas. Although they were given the basics like their truck and trailer, they used a lot of smarts to get through some of the situations they were thrown into. They are also funny and help balance out all the daily stress we have in our lives.\n \n Seeing as I am an animal activist, I particularly favor branding cows with red lipstick instead of brands, lot less painful. I never would have thought of that myself.\n \n What are your thoughts?", 
   {
    "post_info": {
     "post_title": "Paris Hilton &amp; Nicole Ritchie...Smart or Dumb?"
    }
   }, 
   null, 
   null, 
   1091742060.0
  ], 
  [
   61139, 
   null, 
   "Waxy", 
   "Either Paris and Nicole are the best actresses EVER, or they really are that dumb/naieve.\n \n I know where my money is.\n \n Waxy", 
   {}, 
   61133, 
   null, 
   1091743140.0
  ], 
  [
   61144, 
   null, 
   "jitobear", 
   "Anybody hear that comic on \"Last Comic Standing\" the other night?\n \n \"I love Paris Hilton. She is breaking down barriers. She proves one does not have to be poor to be white trash.\" ", 
   {}, 
   61139, 
   null, 
   1091745180.0
  ], 
  [
   61146, 
   null, 
   "Anastasia", 
   "I would say the producers are the smart ones... everyone is watching it, everyone agrees they are both stupid...\n yet we all watch Jerry Springer too emoticon_confused \n At any rate she is making a fortune as if she needed it....", 
   {}, 
   61144, 
   null, 
   1091747340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Paris Hilton & Nicole Ritchie...Smart or Dumb?", 
  "url": "http://www.4forums.com/political/fun-debates/2881-paris-hilton-nicole-ritchie-smart-dumb.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 2881, 
  "discussion_files": [
   [
    "5441.html", 
    "http://www.4forums.com/political/fun-debates/2881-paris-hilton-nicole-ritchie-smart-dumb-print.html"
   ]
  ], 
  "identifier": 2881
 }
]