[
 [
  [
   61729, 
   null, 
   "jim's trucking", 
   "From: \"Omega Letter Daily Intelligence Briefing\" \n Date: Fri, 30 Jul 2004 10:27:08 -0400\n Subject: Friday, July 30, 2004\n \n \n The Omega Letter Intelligence Digest\n Vol: 34 Issue: 30 - Friday, July 30, 2004\n \n <http://www.omegaletter.com/images/omegaletter.jpg< \n Special Report: Which America Should We Love Best? \n \n For the first time in my life, I've had just about all the politics that I can stand, and I am pretty sure you feel almost the same way. \n \n I would rather comment on almost anything that the Democratic National Convention, but I can't think of anything more important to understanding the Big Picture for the last days than who will lead America for the next four years. \n \n And Kerry's speech provided a wealth of insight into what his America would look like. \n \n John Kerry's acceptance speech for the Democratic nomination for President opened with Kerry delivering a passable military salute to his audience, saying, \"My name is John Kerry, and I am reporting for duty.\" \n \n He then launched into his speech. When it was over, it occurred to me that the phrase, \"My name is John Kerry\" was the only true statement contained in it. \n \n It was more than a little ironic, since, so far, the Kerry campaign has built its entire platform around accusing the Bush administration of lying. \n \n At the risk of repeating myself, I am NOT enamored of George Bush. He has disappointed me on a number of levels, as he has no doubt disappointed you. But I love America more than I hate George Bush. And John Kerry's vision is of two Americas -- he says so in his own campaign hand-outs. \n \n I'm not sure which America I am supposed to love best. Can anybody help me out with this one? While you're at it, can somebody please email me with a list of George Bush's lies? \n \n Because if someone knowingly, falsely accuses someone else as a liar, by definition, he indicts himself. \n \n So far, every single alleged lie about the Iraq war has been examined by a panel of five Republicans and five Democrats. \n \n After having examined more than two million supporting documents, dozens of witnesses, and reams of transcripts, they unanimously concluded that the administration relied on flawed intelligence, but that the administration acted appropriately, given the intelligence they had. \n \n They also concluded that every other politician, Republican, Democrat, French, German, American, Australian, Israeli or Egyptian, all had similar intelligence. \n \n There's no need to trot out the statements made prior to the Iraq War by Kerry, Daschle, Edwards, Kennedy, etc., all of whom concluded exactly the same thing the Bush administration did and based on the SAME intelligence reports. \n \n The 9/11 Commission examined them all, and exonerated the current administration. It determined the administration acted in 'good faith' and did exactly what Kerry/Daschle/Edwards/Kennedy and the rest would have done, if their own pre-war rhetoric is any guide. \n \n So, we return to the liars who lie by continuing to accuse the administration of lying even after they KNOW their accusations are false. \n \n For example, Kerry accused the Bush administration of sending our forces into battle without the necessary equipment. He droned, \"You don't value families if you force them to take up a collection to buy body armor for a son or daughter in the service.\" \n \n But both Kerry and his running mate, John Edwards, voted AGAINST the $87 billion funding package that would have paid for the body armor in the first place. Families had to take up collections for body armor because of Kerry and Company, not because the administration doesn't value families. Liar. \n \n Kerry told the convention, \"We need to lead a global effort against nuclear proliferation - to keep the most dangerous weapons in the world out of the most dangerous hands in the world.\" \n \n Liar. Isn't that exactly what Bush was doing in the conflict that Kerry and his party's base now criticize so harshly? \n \n The 9/11 Commission concluded that - contrary to the shrill gainsaying of Kerry advisor Joe Wilson - Saddam Hussein had attempted to purchase yellowcake uranium from Niger. In fact, according to the report, this is one of the few claims about Saddam's WMD programs conclusively accepted by the Commission as being unequivocally true. \n \n Ted Kennedy explained the difference between Kerry and Bush last week on the Democrats' new favorite network, al-Jazeera. Last week, Teddy told the terrorist-friendly network: \n \n \"I am personally convinced that if John Kerry was president of the United States during that time we never would have had an Iraq war. We never would have gone to war.\" No wonder ten out of ten terrorists support John Kerry. \n \n Kerry told the convention-goers, \"Let there be no mistake: I will never hesitate to use force when it is required. Any attack will be met with a swift and certain response.\" \n \n Liar. What if the UN won't let him? Would he 'go it alone' and risk 'squandering America's good-will' like he says Bush did? \n \n Note that Kerry only vowed to \"protect the American people...from a threat that was real and imminent...this is the only justification for going to war.\" How does one define 'real and imminent' in John Kerry's world? \n \n The Twin Towers collapsed almost three years ago. That was real. The same folks who attacked us then still want to attack us now. That is justification. \n \n And what WAS Saddam gonna do with that yellowcake uranium, anyway? \n \n As the anybody-but-Bushers are quick to parrot, there was no other hard evidence that Saddam was reconstituting his nuclear program. But there is plenty of evidence of pre-9/11 contact between Saddam Hussein's government and al-Qaeda. \n \n So, I repeat my question; how DOES one define 'real and imminent' in John Kerry's world? Liar. \n \n That returns us to the view of the War on Terror as \"primarily an intelligence and law enforcement operation.\" \n \n Translated, that means waiting for the terrorists to strike, appointing them legal counsel, sentencing them to American prisons often more luxurious than their homes, and occasionally launching blind retaliatory raids against aspirin factories and empty tents. \n \n \"I will immediately reform the intelligence system,\" Kerry told them, \"so policy is guided by facts, and facts are never distorted by politics.\" Liar. \n \n The 9/11 Commission concluded President Bush had not distorted the facts for political reasons; whatever mistakes were made happened long before the intelligence reached the president's desk. \n \n It is this kind of hysterical rhetoric that has destroyed President Bush's (and America's) credibility and diminished his ability to stop nuclear proliferation in the world's most dangerous hot spots: Iran and North Korea. \n \n Kerry used the phrase \"middle class\" eight times, while referring to \"terror\" or \"terrorism\" only five. \n \n He promised us nationalized health care, protectionism and environmentalism. He vowed to increase funding for the failure known as Head Start, shrink class sizes and increase social spending. He didn't say where he'd get the increased funding from. Another lie. \n \n John Kerry's running mate, John Edwards, invented the slogan, \"two Americas\" but now warns against \"narrow appeals that divide us.\" Liar. \n \n Kerry will discuss national security when forced, but prefers his platform of redistributing America's wealth as being the nation's top priority. \n \n Kerry thanked Dennis Kucinich and Al Sharpton by name \"for teaching me and testing me - but mostly, we say thank you for standing up for our country and giving us the unity to move America forward.\" (I can only hope Kerry's lying there) \n \n Consider: John Kerry learned umm, WHAT from Dennis Kucinich? That US troops are deliberately slaughtering Iraqi civilians, as Kucinich has publicly charged? And I am still trying to figure out what the 'Reverend' Al Sharpton taught John Kerry about 'unity'. Does anybody else remember the Tawana Brawley case? It makes you wonder what is going on in the minds of almost half of Americans. \n \n Perhaps nothing. \n \n Kerry's campaign-opening speech outlined his vision for America. It would have been a wonderful speech, almost Clintonesque in its scope. Except for the 'war' thingy that Kerry the war hero doesn't quite seem to understand. \n \n Among the INVITED guests to the DNC Convention was that bastion of unbiased truth, the al-Jazeera network. In fact, the original plan was for al-Jazeera to have an al-Jazeera sign, including its name and logo, as part of the network's backdrop during photo shots from its skybox across the FleetCenter. \n \n At the last moment, Kerry campaign officials decided to remove the sign, but not because al-Jazeera is an anti-American propaganda rag with ties to al-Qaeda. Nope, they took down the sign because they needed the space to put up a 20-foot-long \"JohnKerry.com\" sign. I'm NOT making this up!!! \n \n \"We needed that spot for our production,\" said Peggy Wilhide, a convention spokeswoman. \n \n \"We're glad Al-Jazeera is here and that they have a skybox,\" Wilhide said. \"But the bottom line is we're not here to advertise for the media, we're here to put on a convention.\" \n \n Without the DNC to straighten things out, one might have suspected Kerry took down the sign out of respect for the thousands of Americans killed by the terrorists al-Jazeera regularly incites. But by the DNC's own admission, al-Jazeera is more than welcome, but John Kerry wanted more ad space for himself. \n \n Although many have feared terrorists would strike one of this summer's political conventions, the Democratic Party allowed Jihad TV, a network whose media roster occasionally includes terrorists, into a skybox overlooking the entire Fleet Center. \n \n From al-Jazeera's coverage, the terrorists back home were able to see the party's attack on the War on Terrorism, especially in Jimmy Carter and Al Sharpton's demagogic remarks. \n \n John Kerry's America is best exemplified by his own words. \n \n \"I ask you to judge me by my record . . .\" whereupon he bragged that he \"reached across the aisle to work with John McCain, to find the truth about our POW's and missing in action, and to finally make peace with Vietnam.\" \n \n To this day, John Kerry holds a place of honor (and notably, John McCain does not) in the Communist Vietnamese \"War Crimes Museum\" (AMERICAN war crimes) -- not as a war criminal, but in recognition of his antiwar activities that helped to 'end the war' (a euphemism for helping Vietnam WIN the war). \n \n As I said before, I love America more than I hate George Bush. And neither of John Kerry's two Americas look like the one America I've loved since that day in 1969 when I took the Marine Corps oath to defend her against all enemies, foreign and domestic. \n \n I have seen the enemy, and it is Skerry. Archives of past issues of The Omega Letter Intelligence Digest plus many other Omega Letter member features can be found at: www.omegaletter.com <http://www.omegaletter.com/< The Omega Letter is published daily by Jack Kinsella and exists through subscriptions <http://www.omegaletter.com/subscribe.asp< and free will contributions.", 
   {
    "post_info": {
     "post_title": "A political email arrived..."
    }
   }, 
   null, 
   null, 
   1092238740.0
  ], 
  [
   61743, 
   null, 
   "jskufan", 
   "It doesn't really sound like this person is as tired of \"politics\" as they claim to be. What it sounds like is a Republican spouting off about the Democratic candidates with all their faults. They admit that the current administration has let them down more than once, yet they fail to give us those details. The rest of the letter is more wasted bandwidth by someone else trying to justify the US invasion of Iraq. For the sake of argument, let's say the administration didn't lie, it was still a monumental mistake in foreign policy.", 
   {}, 
   61729, 
   null, 
   1092244320.0
  ], 
  [
   61744, 
   null, 
   "jim's trucking", 
   "It doesn't really sound like this person is as tired of \"politics\" as they claim to be. What it sounds like is a Republican spouting off about the Democratic candidates with all their faults. They admit that the current administration has let them down more than once, yet they fail to give us those details. The rest of the letter is more wasted bandwidth by someone else trying to justify the US invasion of Iraq. For the sake of argument, let's say the administration didn't lie, it was still a monumental mistake in foreign policy.\nThank you for your opinion.", 
   {}, 
   61743, 
   null, 
   1092244440.0
  ], 
  [
   61757, 
   null, 
   "billsco", 
   "From: \"Omega Letter Daily Intelligence Briefing\" \n Date: Fri, 30 Jul 2004 10:27:08 -0400\n Subject: Friday, July 30, 2004\n \n \n The Omega Letter Intelligence Digest\n Vol: 34 Issue: 30 - Friday, July 30, 2004\n \n \n\n \n Omega? Spells and smells too much like smegma.", 
   {}, 
   61729, 
   null, 
   1092252600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A political email arrived...", 
  "url": "http://www.4forums.com/political/politics-debates/2915-political-email-arrived.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2915, 
  "discussion_files": [
   [
    "17041.html", 
    "http://www.4forums.com/political/politics-debates/2915-political-email-arrived-print.html"
   ]
  ], 
  "identifier": 2915
 }
]