[
 [
  [
   61787, 
   null, 
   "Kronus", 
   "As you may have seen in the news,\n \n http://thescotsman.scotsman.com/international.cfm?id=916432004\n \n scientists are predicting that a hunk of the Canary Islands the size of the Isle of Man is likely to fall into the ocean soon. This is supposed to cause a tidal wave which will reach North America 4000 miles away, destroying New York, Boston, DC, etc. The wave will be 500 feet high to start, and still be 100 feet high when it reaches America.\n \n This makes no sense to me. The landslide would be, essentially, a point source of energy, which would radiate out into the ocean, dispersing as it goes. That means that if it's 500 feet high one mile from the impact point, it would be 500/4000 feet high, or about an inch and a half, by the time it reaches the US. Can anyone see what I'm missing here, or is the guy making this prediction a quack and the papers just aren't fact checking?", 
   {
    "post_info": {
     "post_title": "Killer tidal wave"
    }
   }, 
   null, 
   null, 
   1092264300.0
  ], 
  [
   62327, 
   null, 
   "jim's trucking", 
   "I think it's an alarmist's story. I don't know where he gets the numbers or how he calculates the projected initial wave height. I do know that if you drop a rock into the water, the circular patterned waves diminish rapidly as the radius increases. An 80% reduction in 4000 miles seems not enough to me.", 
   {}, 
   61787, 
   null, 
   1092593760.0
  ], 
  [
   65025, 
   null, 
   "Mach", 
   "As you may have seen in the news,\n \n http://thescotsman.scotsman.com/international.cfm?id=916432004\n \n scientists are predicting that a hunk of the Canary Islands the size of the Isle of Man is likely to fall into the ocean soon. This is supposed to cause a tidal wave which will reach North America 4000 miles away, destroying New York, Boston, DC, etc. The wave will be 500 feet high to start, and still be 100 feet high when it reaches America.\n \n This makes no sense to me. The landslide would be, essentially, a point source of energy, which would radiate out into the ocean, dispersing as it goes. That means that if it's 500 feet high one mile from the impact point, it would be 500/4000 feet high, or about an inch and a half, by the time it reaches the US. Can anyone see what I'm missing here, or is the guy making this prediction a quack and the papers just aren't fact checking?\n\n \n Old post, but interesting! I found a better link same thing, it explains a lot more. I think the scotsman article was misleading. 500 feet high..I thought tsunamis were invisble until they reached shallow water..odd. Anyway, they also don't seem to be alarmists, but simply realists. They mention that they are confident the piece of land will fall from the periodic nearby volcano, and while they volcano does seem to periodically erupt, they of course can't predict when. They do urge putting in place better monitoring equipment so that when it does occur, they have reaction time. Very non-alarmist.\n \n Jim, it's usually journalists trying to make a story that make science seem alarmist. Or scientists pushing for grant money to which they are beholden. Neither ever seem to be what the actual science shows. \n \n Another link with a smidgen of math (coudnt find any better ones :/ )\n \n http://www.crystalinks.com/tsunami.html\n \n Basically it's because the water is so deep there, it generates a massive amount of energy with a huge wavelength. Having such a massive wavelength makes it very energy efficient. When it reaches shore, it compresses and bam, tidal wave.\n \n \nTsunamis are unlike wind-generated waves, which many of us may have observed on a local lake or at a coastal beach, in that they are characterized as shallow-water waves, with long periods and wave lengths. The wind-generated swell one sees at a California beach, for example, spawned by a storm out in the Pacific and rhythmically rolling in, one wave after another, might have a period of about 10 seconds and a wave length of 150 m. A tsunami, on the other hand, can have a wavelength in excess of 100 km and period on the order of one hour. \n \n As a result of their long wave lengths, tsunamis behave as shallow-water waves. A wave becomes a shallow-water wave when the ratio between the water depth and its wave length gets very small. Shallow-water waves move at a speed that is equal to the square root of the product of the acceleration of gravity (9.8 m/s/s) and the water depth - let's see what this implies: In the Pacific Ocean, where the typical water depth is about 4000 m, a tsunami travels at about 200 m/s, or over 700 km/hr. Because the rate at which a wave loses its energy is inversely related to its wave length, tsunamis not only propagate at high speeds, they can also travel great, transoceanic distances with limited energy losses.\n\n \n \n -Mach", 
   {
    "post_info": {
     "post_title": "tidal wave"
    }
   }, 
   61787, 
   null, 
   1093923120.0
  ], 
  [
   65091, 
   null, 
   "Kronus", 
   "\n Another link with a smidgen of math (coudnt find any better ones :/ )\n \n http://www.crystalinks.com/tsunami.html\n \n Basically it's because the water is so deep there, it generates a massive amount of energy with a huge wavelength. Having such a massive wavelength makes it very energy efficient. When it reaches shore, it compresses and bam, tidal wave.\n \n\n \n The part about the volcano falling into the ocean I'm willing to accept. It's the tidal wave reaching the east coast of the US I'm sceptical of. As I understand it, the reason tsunamis created by earthquakes are so deadly is that the earthquake causes a shift along a fault line. When you have energy dumped into a system in a line, it will then propogate in two directions, perpendicular to the line. Energy at the two ends of the fault line will dissipate, but energy in the middle has nowhere to dissipate to, and so can travel great distances. In the Canary Island model, energy is being input as a point source, and spreading in a circle. Thus, it seems that it ought to be decreasing as the radius of the circle increases.\n \n I saw a documentary based on this guys work. He showed an example of this having happened once before, but the landslide was in a fjord. The fjord kept the energy from spreading, and so when it reached the end of the fjord there was a huge wave. I just don't see that happening in the open ocean, without something to channel the energy.", 
   {}, 
   65025, 
   null, 
   1093973820.0
  ], 
  [
   66805, 
   null, 
   "jim's trucking", 
   "The part about the volcano falling into the ocean I'm willing to accept. It's the tidal wave reaching the east coast of the US I'm sceptical of. As I understand it, the reason tsunamis created by earthquakes are so deadly is that the earthquake causes a shift along a fault line. When you have energy dumped into a system in a line, it will then propogate in two directions, perpendicular to the line. Energy at the two ends of the fault line will dissipate, but energy in the middle has nowhere to dissipate to, and so can travel great distances. In the Canary Island model, energy is being input as a point source, and spreading in a circle. Thus, it seems that it ought to be decreasing as the radius of the circle increases.\n \n I saw a documentary based on this guys work. He showed an example of this having happened once before, but the landslide was in a fjord. The fjord kept the energy from spreading, and so when it reached the end of the fjord there was a huge wave. I just don't see that happening in the open ocean, without something to channel the energy.\nThis is why I believe the energy level would be drastically reduced in 4000 miles.\n \n ...", 
   {}, 
   65091, 
   null, 
   1095106620.0
  ], 
  [
   68055, 
   null, 
   "Haulingboat", 
   "While living in Hawaii I had the displeasure of experiencing several tsunami warning. Fortunaly we never experienced a actual wave.\n \n The first time I was in Maui. An earthquake occurred in the Aluthean islands (I'm sure i have mispelled them, the little chain of islands off the southern coast of Alaska) overnight. We woke up to a warning that the tidal wave could possibly hit the islands. It was reported to be moving at 500 mhp and could result in a massive destruction of live and property or it could be almost unnoticable. It turned out to be unnoticable, but it kept us on our toes throughout the day.\n \n While severing as captian for one particular company it was our duty to get the boat out to sea in the event of a tsunami. There is ample warning if the event triggering the wave happens on the other side of the ocean. However if the event takes place on one of the neighboring islands there may only be a matter of minutes before the wave strikes. This fact makes for a rather uncomfortable feeling when awaken by the tsnumi warning sirens at 2:00 am. Our worst nightmare would be half way out the bay in route to deep water and the wave strikes.\n \n On the first Monday of each month the state would test their sirens at noon. Our tour didn't leave the bay till 12:30. We moored in four feet of water 20 feet from a 200' sea cliff of jagged lava rock. The crew knew what the siren meant and was well aware of the results that would befall us and our guests if we did not recognize the siren and leave the bay before catastrophy hit. \n \n On the first Monday of each month you could watch a moment of fear pass across the faces of my crew followed by a sigh of relief after realizing it was test day. Those sirens could cause some serious pucker.\n \n Most of our tsunami warnings ended in a flotilla of boats tied together over 38,000 feet of water with the beer taps flowing and the grill blazing.", 
   {}, 
   66805, 
   null, 
   1095896040.0
  ], 
  [
   68247, 
   null, 
   "accipitridae", 
   "Well, all of you seem skeptical. But how much do any of you know about the topic? The question is one of energy. If a mountain falls into the ocean in the Canary Islands, then you all seem to think that it would produce nothing more than ripples along the beaches of Long Island. History has examples of destructive tsunamis striking Japan, Hawaii, Australia from many miles away.\n \n So how about some numbers. How weak and how far away does an event have to be before it isn't a problem?", 
   {}, 
   68055, 
   null, 
   1096014540.0
  ], 
  [
   68260, 
   null, 
   "jim's trucking", 
   "Well, all of you seem skeptical. But how much do any of you know about the topic? The question is one of energy. If a mountain falls into the ocean in the Canary Islands, then you all seem to think that it would produce nothing more than ripples along the beaches of Long Island. History has examples of destructive tsunamis striking Japan, Hawaii, Australia from many miles away.\n \n So how about some numbers. How weak and how far away does an event have to be before it isn't a problem?\nLogically, it would seem that a wave resulting from a point source origin would rapidly decrease in strength as the radius from center increased. A line source, such as a rift 300 miles or so long, would produce a relatively straight pattern wave which would decrease in strength a lot more slowly.", 
   {}, 
   68247, 
   null, 
   1096035900.0
  ], 
  [
   68334, 
   null, 
   "accipitridae", 
   "Then I guess I'll have to find my own numbers. The following is from the Tsunami! web site of the Earth and Space Sciences department at the University of Washington.\n \nTsunamis are unlike wind-generated waves, which many of us may have observed on a local lake or at a coastal beach, in that they are characterized as shallow-water waves, with long periods and wave lengths. The wind-generated swell one sees at a California beach, for example, spawned by a storm out in the Pacific and rhythmically rolling in, one wave after another, might have a period of about 10 seconds and a wave length of 150 m. A tsunami, on the other hand, can have a wavelength in excess of 100 km and period on the order of one hour.\n \n As a result of their long wave lengths, tsunamis behave as shallow-water waves. A wave becomes a shallow-water wave when the ratio between the water depth and its wave length gets very small. Shallow-water waves move at a speed that is equal to the square root of the product of the acceleration of gravity (9.8 m/s/s) and the water depth - let's see what this implies: In the Pacific Ocean, where the typical water depth is about 4000 m, a tsunami travels at about 200 m/s, or over 700 km/hr. Because the rate at which a wave loses its energy is inversely related to its wave length, tsunamis not only propagate at high speeds, they can also travel great, transoceanic distances with limited energy losses.\n\n In 1960 an earthquake off the coast of Chile generated a tsunami that hit Hawaii 14.8 hours later as a 10.7m wave. It killed 61 people in Hawaii. In Japan, over 17000km away, it killed 200 people.\n \n The failure of Cumbre Vieja would cause about 500 billion tons of rock to fall into the ocean. One problem with rock slide generated tsunami is that the rock continues to slide out to sea under water, pushing the wave along as it goes. The collapse will generate about 5 thousand trillion joules of kinetic energy.\n \n The energy of the wave would dissapate as it crossed the Atlantic so it would run up into a wave only 40 meters high when it hit the eastern seaboard of the U.S., some 4000km away. The waves hitting Africa, Spain and other European coast lines would be more than twice that high.", 
   {}, 
   68260, 
   null, 
   1096062900.0
  ], 
  [
   68452, 
   null, 
   "Kronus", 
   "\n The failure of Cumbre Vieja would cause about 500 billion tons of rock to fall into the ocean. One problem with rock slide generated tsunami is that the rock continues to slide out to sea under water, pushing the wave along as it goes. The collapse will generate about 5 thousand trillion joules of kinetic energy.\n \n The energy of the wave would dissapate as it crossed the Atlantic so it would run up into a wave only 40 meters high when it hit the eastern seaboard of the U.S., some 4000km away. The waves hitting Africa, Spain and other European coast lines would be more than twice that high.\n\n \n I don't think your numbers work out. Let's start with total energy E=5E15. This expands in a circle, which will have a radius = 4000 km by the time it hits North america. So, circumphrance (that can't be spelled right) is c=2 pi r, = about 25E6 meters. E/c gives an energy density of about 2E8 J/m.\n \n Assume no losses on the trip over. That means that energy will be converted fully into kinetic and potential energy. E/c = KE + PE.\n KE = 1/2 m v^2 and PE = mgh (where h is the average height of the wave, half the total hieght, H) \n \n So, E = 1/2 m v^2 + mgH/2 = m/2(v^2 + gH)\n m is denisty times volume. denisty of water is about 1000 kg/m^3. Volume of a tidal wave is tricky. I modeled it as a rectangle, with a height 5 times it's width. Thus, volume = 1 * H * H/5, or 1/5 H^2, and m = 200 H^2\n \n g = 9.8 and v = 200m/s.\n \n Put it all together and we get:\n E/c = KE + PE = m/2(v^2 + gH) = 100 H^2(v^2 + gH)\n 2E8 = 100 H^2(200^2 + 9.8H)\n \n Solve for H and you get H=7 meters, or about 20 feet. We see that with a good storm.", 
   {}, 
   68334, 
   null, 
   1096133280.0
  ], 
  [
   68457, 
   null, 
   "Selasphorus", 
   "I see. So you didn't check the info at the link that was given. Three different sites on tsunamis gave comparable numbers.\n \n The energy from the colapse of Cumbre Vieja would not spread equally in all directions. The slide chute would direct much of the energy out across the Atlantic towards North America. Africa and Europe would get the worst of it even though less of the energy would go in that direction - they are closer.\n \n Also, note that the much smaller 1960 Chile event generated a 10.7 m wave in Hawaii. Also, all of the sites mentioned that tsunami travel great distances without much disapation of energy. They are not wind generated surface waves.\n \n I think that if experts (such as there are) state the case as more serious than you, and if their calculations yield more serious consequences, I'll go with them.", 
   {}, 
   68452, 
   null, 
   1096139160.0
  ], 
  [
   68471, 
   null, 
   "Kronus", 
   "I see. So you didn't check the info at the link that was given. Three different sites on tsunamis gave comparable numbers.\n \n The energy from the colapse of Cumbre Vieja would not spread equally in all directions. The slide chute would direct much of the energy out across the Atlantic towards North America. Africa and Europe would get the worst of it even though less of the energy would go in that direction - they are closer.\n \n Also, note that the much smaller 1960 Chile event generated a 10.7 m wave in Hawaii. Also, all of the sites mentioned that tsunami travel great distances without much disapation of energy. They are not wind generated surface waves.\n \n I think that if experts (such as there are) state the case as more serious than you, and if their calculations yield more serious consequences, I'll go with them.\n\n \n I've only seen one \"expert\" voice an opinion on this. If only one person in a field predicts doom, and none of his colleauges back him up, it's only right to question his results, not to mention his motives. \n \n The Chile event, was that a landslide, or an earthquake?", 
   {}, 
   68457, 
   null, 
   1096152840.0
  ], 
  [
   68478, 
   null, 
   "Selasphorus", 
   "Chili was an earthquake. A 10.7m wave hit Hawaii, more than 4000km away.\n \n Mach posted some info that I also found on the web. He explains a problem with tsunamis that I also mentioned. Again, a land slide like that of the colapse of Cumbre Vieja would not be merely a point source. As the slide hits the water it continues down the slope, pushing the water away from the land. It can continue out along the sea floor for some miles so that the kinetic energy is much greater in the direction of the slide.\n \n I notice that your calculations didn't even mention the wavelength and the period of the tsunami. At least two sites I found mentioned those as factors in the propagation of a tsunami. Apparently they tend to retain the energy as the move, not following standard models of wave propagation.\n \nI've only seen one \"expert\" voice an opinion on this.\n\n Then you haven't looked. I have seen at a couple of shows on TV.\n \n Some information HERE. Note that the Chili event reached Japan in 22 hours and still had waves 6m high.\n \nIf only one person in a field predicts doom, and none of his colleauges back him up, it's only right to question his results, not to mention his motives.\n\n But it's not only one person. Try the University of Washington site that I gave you. It's irrelevant whether either of us believes it, and it sure won't do much damage to the University of Washington. I don't know enough to form a meaningful opinion.", 
   {}, 
   68471, 
   null, 
   1096159020.0
  ], 
  [
   68486, 
   null, 
   "Kronus", 
   "\n Mach posted some info that I also found on the web. He explains a problem with tsunamis that I also mentioned. Again, a land slide like that of the colapse of Cumbre Vieja would not be merely a point source. As the slide hits the water it continues down the slope, pushing the water away from the land. It can continue out along the sea floor for some miles so that the kinetic energy is much greater in the direction of the slide.\n \n I notice that your calculations didn't even mention the wavelength and the period of the tsunami. At least two sites I found mentioned those as factors in the propagation of a tsunami. Apparently they tend to retain the energy as the move, not following standard models of wave propagation.\n \n But it's not only one person. Try the University of Washington site that I gave you. It's irrelevant whether either of us believes it, and it sure won't do much damage to the University of Washington. I don't know enough to form a meaningful opinion.\n\n \n You're missing my point. I fully believe that earthquakes can form killer tidal waves, because the energy is input along a line, thus minimizing dissipation. Landslides are essentialy point sources of energy. The fact that the rock mass \"pushes\" the water is largely irrelevant, because once you get any distance out from the point of impact, dissipation becomes the primary factor. The energy will travel in every direction more or less evenly. And I do know enough to from a meaningful opinion; my degrees are in mechanical and aeronautical engineering. Fluid dynamics is something that I can speak about with some authority. \n \n By the way, the reason I didn't mention wavelength is that it was irrelevant. I stated my assumption that no energy was lost in transit, therefore the means by which the energy is transmitted is of no concern. I was assuming, as a simplfiying assumption, that the transmition of energy was actually even more efficient than it actually is, which means that any waves formed would be even smaller than my calculations indicated.\n \n If you have any sources concerning landslides causing tsunami, and not earthquakes, please post links, I'd like to see them.", 
   {}, 
   68478, 
   null, 
   1096163160.0
  ], 
  [
   68507, 
   null, 
   "Selasphorus", 
   "I googled tsunami and started reading.\n \n By the way, the reason that I did mention wave length is that from what I have read on the subject it is important. Surface waves (that you analyze) and tsunamis do not behave the same according to what I have read. According to several sites, wave length is very important, as is period. In your assumption you didn't calculate the effect of the runup into shallow water that occurs as the tsunami aproaches land. As the water becomes more shallow, the friction causes the wave to slow. The energy is converted to wave height. By your calculations, Hawaii had high surf and Japan had a slight chop from the 1960 Chile event. Real events don't agree.", 
   {}, 
   68486, 
   null, 
   1096177020.0
  ], 
  [
   68553, 
   null, 
   "Kronus", 
   "\n By the way, the reason that I did mention wave length is that from what I have read on the subject it is important. Surface waves (that you analyze) and tsunamis do not behave the same according to what I have read. According to several sites, wave length is very important, as is period. In your assumption you didn't calculate the effect of the runup into shallow water that occurs as the tsunami aproaches land. As the water becomes more shallow, the friction causes the wave to slow. The energy is converted to wave height. By your calculations, Hawaii had high surf and Japan had a slight chop from the 1960 Chile event. Real events don't agree.\n\n \n Again, no. My calculations do not work at all for tsunami caused by earthquakes, as I've said. I'm not trying to use them to predict wave hieght for tsunami caused by earthquakes, because as you point out, it wouldn't work. These calculations are only to be used to predict the height of waves caused by landslides.\n \n Further, period and wavelength of the waves is irrelevant because I'm not concerned with what happens while the wave is travelling. I'm doing a strict conservation of energy calculation here. Energy in equals energy out. Energy in is the energy input by the landslide. Energy out is the total of the kinetic and potential energy of the wave at the other end. If you assume no losses in between, which I did, then you don't care what happens in between.\n \n You are correct that I ignore runup. However, the article I site in my first post also seems to ignore runup. Again, it's a simplifying assumption, but I don't think it's going to throw my results off by the order of magnitude neccesary to make the doomsday predictions correct. Those predictions simply don't seen to take into account the fact that the energy dissipates as it moves across the ocean.", 
   {}, 
   68507, 
   null, 
   1096222920.0
  ], 
  [
   68661, 
   null, 
   "Waxy", 
   "I watched on show on Discovery (or maybe it was NG?) this weekend on the Mega Tsunami. Well part of it anyway, I was flipping back and forth between the NFL. :p\n \n Very interesting.\n \n It dealt with landslide generated waves.\n \n It referenced a bay in Alaska where the event was actually witnessed and recorded, (I can't remember the name) and pointed to a volcanic island in the Canaries (I think) as being a very possible source for such a wave that would hit the eastern seaboard.\n \n I'm not expert on the mechanics, but there explanation was that the wave would maintain the majority of it's energy due to its wavelength. Even with all the losses in energy, the shear amount of initial energy would ensure that when combined with runup, it's affect would be devastating.\n \n Waxy", 
   {}, 
   68553, 
   null, 
   1096308720.0
  ], 
  [
   68663, 
   null, 
   "Kronus", 
   "I watched on show on Discovery (or maybe it was NG?) this weekend on the Mega Tsunami. Well part of it anyway, I was flipping back and forth between the NFL. :p\n \n\n \n I've seen that show too. It's based on the works of the guy mentioned in the link in post #1. I maintain he's a bit of a quack. As you may recall, all the real life data that gets sited concerns landslides in channels or fjords; places where the energy can't spread out. A landslide in the ocean would cause energy to radiate in all directions, becoming weaker as the circle grew bigger. I think the guy was just trying to scare enough people to get some government grant money, or something along those lines.", 
   {}, 
   68661, 
   null, 
   1096309140.0
  ], 
  [
   68957, 
   null, 
   "amazilia", 
   "First of all, I apologize for my constant name changes. This is my third handle in this thread alone. I'm sure you'll be able to figure out my other two handles.\n \nAgain, no. My calculations do not work at all for tsunami caused by earthquakes, as I've said.\n\n Why not? I understand that a vertical fault in the sea bed would generate considerable energy into sea along a line. But a land slide the size of Cumbre Viejo would also generate a directional shock wave. As I explained before, the colapse doesn't just drop into the water like a pebble. It slides into the water and then out across the sea floor for several miles, lifting the water above and thus inserting considerable energy into the wave.\n \nI'm not trying to use them to predict wave hieght for tsunami caused by earthquakes, because as you point out, it wouldn't work. These calculations are only to be used to predict the height of waves caused by landslides.\n\n Then enlighten me. Why are they different? I'm not sure that I pointed out that calculations wouldn't work on earthquake produced tsunami. I don't know that it isn't true.\n \nFurther, period and wavelength of the waves is irrelevant because I'm not concerned with what happens while the wave is travelling. I'm doing a strict conservation of energy calculation here. Energy in equals energy out.\n\n If you say so. I'm sure that it is true. I'm really too ignorant to grasp the point.\n \nEnergy in is the energy input by the landslide. Energy out is the total of the kinetic and potential energy of the wave at the other end.\n\n Certainly. That seems logical.\n \nIf you assume no losses in between, which I did, then you don't care what happens in between.\n\n Well, I don't know enough to make assumptions. It's just that some authoritiative sites (University of Washington), apparently written by scientists who are more educated than I, seem to agree that there may be a problem. Personally, it wouldn't have much effect on me (except for the money I would be taxed to rebuild coastal cities if it is true).\n \nYou are correct that I ignore runup. However, the article I site in my first post also seems to ignore runup.\n\n Well, I read and linked articles that seemed to think that runup was a problem. Since waves of large period and large wavelength (as I have read) don't lose energy according to your calculations, especially when they are directional as would be the colapse of Cumbre Viejo, then the runup would pose a problem. For example, the 1960 Chile event that killed in Hawaii and Japan, both much farther from the site than is the eastern seaboard from the Canary Islands.\n \nAgain, it's a simplifying assumption, but I don't think it's going to throw my results off by the order of magnitude neccesary to make the doomsday predictions correct. Those predictions simply don't seen to take into account the fact that the energy dissipates as it moves across the ocean.\n\n Yes it does. Wind generated waves lose energy. Even at that, I watched the waves lap at the shoulder of the road in Rockport, Texas as a hurricane slammed into the panhandle of Florida. Wind generated waves that added a meter or so to the tide from about 525 miles away. So as I understand it, tsunamis are deep waves - generated from below rather than at the surface. As I have read, the slide chute of a huge landslide invests huge amounts of energy into the water above, injecting additional energy into the wave above as it lifts the water and runs out over the sea floor. As I understand it, such a wave is very much directional in that most of the energy is invested in the direction of the slide. It is not a point source (as a pebble in a pond).\n \n But this is all out of my field. I only know what I have read. Could be that I am listening to the wrong people. I was listening to the people in the department of Earth and Space Sciences at the University of Washinton. Probably they are wrong.", 
   {}, 
   68663, 
   null, 
   1096440120.0
  ], 
  [
   68988, 
   null, 
   "Kronus", 
   "\n Those predictions simply don't seen to take into account the fact that the energy dissipates as it moves across the ocean.\n \n\n \n \n\n Yes it does. Wind generated waves lose energy. \n\n \n I think this is the core of the misunderstanding. My language may not have been precise enough, sorry. When you have energy travelling in waves two things can happen to it. The energy can be lost to friction, turbulance, things like that. That's what keeps surface waves from getting too large, in general. The other thing that can happen is that the energy can spread out, like the ripples in a pond when you throw in a stone. That's what I've been calling dissipation. I've been saying that the losses won't happen at all, and only looking at the second effect. \n \n You've been saying that the landslide will produce a directional wave, due to sliding. While that effect would be present, it wouldn't be a very strong effect; certainly not enough to last a whole ocean. Water conducts shock waves very well, and it would take very little time before the wave was heading out in all directions.", 
   {}, 
   68957, 
   null, 
   1096472340.0
  ], 
  [
   69150, 
   null, 
   "amazilia", 
   "it wouldn't be a very strong effect; certainly not enough to last a whole ocean.\n\n But as I understand it, it is a very strong effect. And it is quite directional. And even though water conducts shock waves very well, as you state, that doesn't reduce the colapse of Cumbre Viejo to a pebble in a pond. Certainly, the coasts of Africa and Europe would be devestated. The such an event would be more serious than the Chile event, and the coast of the U.S. is closer to the Canary Islands than Hawaii is to the Chile event. Do your numbers on that event and tell me how high the wave will be at Hawaii.", 
   {}, 
   68988, 
   null, 
   1096525500.0
  ], 
  [
   84685, 
   null, 
   "jim's trucking", 
   "The recent Indian Ocean tsunami should convince even the more skeptical that wave behavior is complicated and that predictions of coastal wave heights are complicated by variations in the water depth.\n \n That was one powerful wave, moving at jetliner cruising speed and devastating everywhere it made landfall...and this all from a sudden rise or fall of a relatively small portion of the ocean floor. The effects of a large chunk of land falling into the ocean are expected to be quite different from the effects of a sudden change in the shape of the ocean floor. Though they both eventially produce a change in the shape of the ocean floor, the earthquake driven undersea plate shifting STARTS at the ocean floor where the water is already under tremendous pressure and it ceases motion rather quickly unlike the landslide scenario that starts at the surface and proceeds much more slowly downward to the higher pressure water.", 
   {
    "post_info": {
     "post_title": "I'm a believer!"
    }
   }, 
   69150, 
   null, 
   1104702480.0
  ], 
  [
   85631, 
   null, 
   "zachvac", 
   "The recent Indian Ocean tsunami should convince even the more skeptical that wave behavior is complicated and that predictions of coastal wave heights are complicated by variations in the water depth.\n \n That was one powerful wave, moving at jetliner cruising speed and devastating everywhere it made landfall...and this all from a sudden rise or fall of a relatively small portion of the ocean floor. The effects of a large chunk of land falling into the ocean are expected to be quite different from the effects of a sudden change in the shape of the ocean floor. Though they both eventially produce a change in the shape of the ocean floor, the earthquake driven undersea plate shifting STARTS at the ocean floor where the water is already under tremendous pressure and it ceases motion rather quickly unlike the landslide scenario that starts at the surface and proceeds much more slowly downward to the higher pressure water.\n\n \n And no one knew it would happen. If one happened near the US, we would know about it, if it happened in the Pacific ocean, we have things to detect that. But there are no systems like that in the Indian Ocean. So there were people at the beach when a 50 foot wave came in at 500 MPH. And the wave also reached Somolia (East coast of Africa). That's a long way and it started at only 50 feet.", 
   {}, 
   84685, 
   null, 
   1105255080.0
  ], 
  [
   85921, 
   null, 
   "jim's trucking", 
   "And no one knew it would happen. If one happened near the US, we would know about it, if it happened in the Pacific ocean, we have things to detect that. But there are no systems like that in the Indian Ocean. So there were people at the beach when a 50 foot wave came in at 500 MPH. And the wave also reached Somolia (East coast of Africa). That's a long way and it started at only 50 feet.\n\n I heard that there were some people in Thailand that knew it was coming but did not say anything for fear of being blamed for it. They were fired.", 
   {}, 
   85631, 
   null, 
   1105453020.0
  ], 
  [
   87615, 
   null, 
   "Tastyfish", 
   "How large was the amount of land from the section of plate dropping compared to the canary island slide though?", 
   {}, 
   85921, 
   null, 
   1106259180.0
  ], 
  [
   170620, 
   null, 
   "Ooaman", 
   "A tsunami (as many people know now) is a wave that is stronger than a typical wave. The Force of a wave in a tsunami = The force of the entire ocean. That is why a tsunami causes so much distruction...No matter how high the wave is.\n Sometime a little over a year ago, I saw a special on the Discovery Channel or the National Geographic Channel about tsunamis. One of the main points that they were showing was that Americans have no idea what one is. They went to a beach and asked people what they would do if a tsunami were coming and they got answers like...\n \"I don't know. Stay here?\"\n \"Get my surfboard and ride the wave\"\n Now, if anyone doesn't know what a tsunami is, they are either under 6 years old or living under a rock. (I say 6 because if they are students and don't know anything, that's the science and or social studies teachers fault.)", 
   {}, 
   87615, 
   null, 
   1129268400.0
  ], 
  [
   170654, 
   null, 
   "jim's trucking", 
   "A tsunami (as many people know now) is a wave that is stronger than a typical wave. The Force of a wave in a tsunami = The force of the entire ocean. That is why a tsunami causes so much distruction...No matter how high the wave is.\n Sometime a little over a year ago, I saw a special on the Discovery Channel or the National Geographic Channel about tsunamis. One of the main points that they were showing was that Americans have no idea what one is. They went to a beach and asked people what they would do if a tsunami were coming and they got answers like...\n \"I don't know. Stay here?\"\n \"Get my surfboard and ride the wave\"\n Now, if anyone doesn't know what a tsunami is, they are either under 6 years old or living under a rock. (I say 6 because if they are students and don't know anything, that's the science and or social studies teachers fault.)\nDon't blame the teachers for lack of learning by lazy, inattentive, preoccupied students. No teacher can force anyone to learn anything.", 
   {}, 
   170620, 
   null, 
   1129298040.0
  ], 
  [
   174312, 
   null, 
   "Ooaman", 
   "Don't blame the teachers for lack of learning by lazy, inattentive, preoccupied students. No teacher can force anyone to learn anything.\n\n Actually, you're right about the teachers and I am sorry. There could also be other reasons though:\n The school district doesn't think it's important (I don't know why, maybe they live in the center of Kansas or something)\n The student could have ADD. (Yes, I know, it's over-diagnosed but it could still be a factor.)\n \n Basically, I don't know why the student would not be interested in learning about it and when I originally posted my comment, I assumed students would know about it unless for some reason, it wasn't being taught.", 
   {}, 
   170654, 
   null, 
   1130300700.0
  ], 
  [
   174568, 
   null, 
   "Liminus", 
   "How large was the amount of land from the section of plate dropping compared to the canary island slide though?\n\n \n I've been looking for stats on this and can't find anything specific, but wherever it's mentioned everyone says the rock around the fault rose by up to 20 metres for hundreds of miles!", 
   {}, 
   87615, 
   null, 
   1130360040.0
  ], 
  [
   176986, 
   null, 
   "omega", 
   "well u have me scared if this happens just post something ill have my suitcase waiting and my stuff all packed. Untill then.", 
   {}, 
   174568, 
   null, 
   1131071640.0
  ], 
  [
   177036, 
   null, 
   "Iuris", 
   "You know, when I saw that discovery show, I soon began to wonder, whether Al Quaida had any trained geologists to go with those nukes they are supposed to be looking for so hard.", 
   {}, 
   176986, 
   null, 
   1131096660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Killer tidal wave", 
  "url": "http://www.4forums.com/political/science-math-debates/2919-killer-tidal-wave.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 2919, 
  "discussion_files": [
   [
    "27637.html", 
    "http://www.4forums.com/political/science-math-debates/2919-killer-tidal-wave-print.html"
   ], 
   [
    "27638.html", 
    "http://www.4forums.com/political/science-math-debates/2919-killer-tidal-wave-3-print.html"
   ], 
   [
    "27639.html", 
    "http://www.4forums.com/political/science-math-debates/2919-killer-tidal-wave-2-print.html"
   ]
  ], 
  "identifier": 2919
 }
]