[
 [
  [
   62208, 
   null, 
   "CCR1994", 
   "At the risk of beating a dead horse, let's examine the nature of sexual orientation once again. Let's test a theory. The theory being this: that sexual orientation is a matter of choice, not biology or genetics.\n \n Test the theory by saying to yourself that you will not be heterosexual today. You will be attracted to your own sex instead of the opposite sex. If you are a man, say to yourself, \"Pamela Anderson or (insert favorite female sex symbol) doesn't do it for me\" and then say \"I'm going to be attracted to men instead\". Now try it. I mean really try it.\n \n .......\n \n Does it work???", 
   {
    "post_info": {
     "post_title": "The &quot;choice&quot; test!"
    }
   }, 
   null, 
   null, 
   1092509100.0
  ], 
  [
   62262, 
   null, 
   "JustineCredible", 
   "At the risk of beating a dead horse, let's examine the nature of sexual orientation once again. Let's test a theory. The theory being this: that sexual orientation is a matter of choice, not biology or genetics.\n \n Test the theory by saying to yourself that you will not be heterosexual today. You will be attracted to your own sex instead of the opposite sex. If you are a man, say to yourself, \"Pamela Anderson or (insert favorite female sex symbol) doesn't do it for me\" and then say \"I'm going to be attracted to men instead\". Now try it. I mean really try it.\n \n .......\n \n Does it work???\n\n \n \n \n ROFLMLAO!\n \n Holy Cow...too funny. \n \n Funny because I tried that, but in the opposite for many years. Whew...I'm so glad something inside me said it was time to stop playing that game!", 
   {}, 
   62208, 
   null, 
   1092536100.0
  ], 
  [
   62266, 
   null, 
   "CCR1994", 
   "ROFLMLAO!\n \n Holy Cow...too funny. \n \n Funny because I tried that, but in the opposite for many years. Whew...I'm so glad something inside me said it was time to stop playing that game!\n\n \n Obviously, I was targeting heterosexuals with this because they (not all of them of course) are the ones that insist that being gay is not natural which of course leads to the obvious conclusion that sexual orientation is a choice. I'm challenging them to prove it.", 
   {}, 
   62262, 
   null, 
   1092541980.0
  ], 
  [
   62273, 
   null, 
   "joebrummer", 
   "Obviously, I was targeting heterosexuals with this because they (not all of them of course) are the ones that insist that being gay is not natural which of course leads to the obvious conclusion that sexual orientation is a choice. I'm challenging them to prove it.\n\n \n \n Thats exactly why they won't respond. But i love the idea.", 
   {}, 
   62266, 
   null, 
   1092544860.0
  ], 
  [
   62345, 
   null, 
   "AMD4EVER", 
   "Obviously, I was targeting heterosexuals with this because they (not all of them of course) are the ones that insist that being gay is not natural which of course leads to the obvious conclusion that sexual orientation is a choice. I'm challenging them to prove it.\n\n \n Just because it is not natural doesn't mean that it has to be a choice. It isn't natural to want to commit suicide yet people will do it. Now if you try to contend that they make the choice to commit suicide then you have to distinguish what the difference between than and choosing to like men are.\n \n As to answer your question, why do you believe that straight people think that being gay is a choice? I mean anyone can make the case that choice factors in and I doubt you will debate that since choice also factors into committing suicide and any other unnatural thing that people do. That doesn't mean that people who contend that choice is involved believe that choice is the only thing involved. So perhaps you are misunderstanding what is actually being said.\n \n If someone was to say that choice is all that is involved then I will side with you. If someone simply debates that choice is involved then I will want clarification on their stance but odds are I'm not siding with you.", 
   {}, 
   62266, 
   null, 
   1092609120.0
  ], 
  [
   62354, 
   null, 
   "JakeCJB", 
   "Some amount of choice is involved in anything. I think CCR's point is that being gay is no more a choice than being straight. Determining what is natural or unnatural, is quite difficult, and is often used in a hyporcitical way as a moral judgement.", 
   {}, 
   62345, 
   null, 
   1092616620.0
  ], 
  [
   62397, 
   null, 
   "JustineCredible", 
   "Just because it is not natural doesn't mean that it has to be a choice. It isn't natural to want to commit suicide yet people will do it. Now if you try to contend that they make the choice to commit suicide then you have to distinguish what the difference between than and choosing to like men are.\n\n \n Actually distinguishing that difference is quite obvious. Those who commit suicide do not have any kind of inexplicable urge to do so whilst many whom are homosexual do.\n The mere fact that those who have ATTEMPTED suicide will always state traumatic circumstances which lead to their decission. The fact that those who have attempted suicide do not argue that indeed it is a choice.\n Equating suicide with homosexuality is apples and oranges. Being homosexual can't kill you. Sexually transmitted disease can kill, but they aren't discriminating at all about their victims. They kill homosexuals and heterosexuals alike. \n \n \n \nAs to answer your question, why do you believe that straight people think that being gay is a choice? I mean anyone can make the case that choice factors in and I doubt you will debate that since choice also factors into committing suicide and any other unnatural thing that people do. That doesn't mean that people who contend that choice is involved believe that choice is the only thing involved. So perhaps you are misunderstanding what is actually being said.\n\n \n What you seem to be confussing is the choice factor involved in being sexually active vs. identifying as one or another sexual orientation. All humans have sex. Whether you are a male or a female. All humans have sexuality. The choice only gets into the mix when a person makes the concious decission to act on that sexuality via sexual contact. \n You are attempting to say being homosexual is as much as choice as being left-handed or what color eyes you are born with. \n Most humans babies are born with blue eyes, just as cats are. The fact that the eye color quickly changes within hours for some and over a longer period of time for others and not at all for more still. Are you saying that there is some type of choice involved there? \n \n \n \nIf someone was to say that choice is all that is involved then I will side with you. If someone simply debates that choice is involved then I will want clarification on their stance but odds are I'm not siding with you.\n\n \n Scientific laws of averages would disagree with you heavily. \n :xbanghead", 
   {}, 
   62345, 
   null, 
   1092668400.0
  ], 
  [
   62679, 
   null, 
   "Ladywolf", 
   "At the risk of beating a dead horse, let's examine the nature of sexual orientation once again. Let's test a theory. The theory being this: that sexual orientation is a matter of choice, not biology or genetics.\n \n Test the theory by saying to yourself that you will not be heterosexual today. You will be attracted to your own sex instead of the opposite sex. If you are a man, say to yourself, \"Pamela Anderson or (insert favorite female sex symbol) doesn't do it for me\" and then say \"I'm going to be attracted to men instead\". Now try it. I mean really try it.\n \n .......\n \n Does it work???\n\n \n Results: You know, I actually did this for real in high school. I didn't even want to date at all until I graduated high school so I could date women like I wanted too. Men would ask me out. I believe my last heterosexual date ended when I barfed in the guy's lap (he was naked and I was trying to do oral sex) after he shoved his manhood down my throat by pushing my head down. Now all you heterosexual guys, would you want a lesbian barfing in your naked lap on a date? I think not. Nothing personal, but I think men have the ugliest sex organs on earth. Now would you want to \"cure\" me and be with someone who thinks that men are ugly? I think a man would like to be with a woman who would appreciate him as a man.", 
   {}, 
   62208, 
   null, 
   1092766560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The \"choice\" test!", 
  "url": "http://www.4forums.com/political/gay-rights-debates/2942-choice-test.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 2942, 
  "discussion_files": [
   [
    "17379.html", 
    "http://www.4forums.com/political/gay-rights-debates/2942-choice-test-print.html"
   ]
  ], 
  "identifier": 2942
 }
]