[
 [
  [
   62309, 
   null, 
   "montalban", 
   "Just to stir most of you up I'd like to publish this...\n \n The Current Olympics Medals Tally\n G S B\n 1. China 4 1 1 \n 2. Australia 2 1 2 \n 3. Italy 2 0 0 \n 4. Japan 2 0 0 \n 5. U.S.A. 1 3 1 \n 6. Ukraine 1 0 1 \n 7. Turkey 1 0 0 \n 8. Russia 0 3 1 \n 9. Hungary 0 1 1 \n 10. France 0 1 0 \n 11. Georgia 0 1 0 \n 12. Great Britain 0 1 0 \n 13. Portugal 0 1 0 \n 14. Argentina 0 0 1 \n 15. Belgium 0 0 1 \n 16. Czech Republic 0 0 1 \n 17. Germany 0 0 1 \n 18. Korea 0 0 1 \n 19. Mongolia 0 0 1 \n 20. Netherlands 0 0 1 \n 21. Thailand 0 0 1", 
   {
    "post_info": {
     "post_title": "Gold Gold Gold"
    }
   }, 
   null, 
   null, 
   1092569580.0
  ], 
  [
   62312, 
   null, 
   "georged", 
   "Out of curiosity, I know Christian Rulers at one time outlawed the Olympic Games as a pagan ritual, when were they again deemed politically acceptable?", 
   {}, 
   62309, 
   null, 
   1092582780.0
  ], 
  [
   62338, 
   null, 
   "jim's trucking", 
   "Just to stir most of you up I'd like to publish this...\n \n The Current Olympics Medals Tally\n G S B\n 1. China 4 1 1 \n 2. Australia 2 1 2 \n 3. Italy 2 0 0 \n 4. Japan 2 0 0 \n 5. U.S.A. 1 3 1 \n 6. Ukraine 1 0 1 \n 7. Turkey 1 0 0 \n 8. Russia 0 3 1 \n 9. Hungary 0 1 1 \n 10. France 0 1 0 \n 11. Georgia 0 1 0 \n 12. Great Britain 0 1 0 \n 13. Portugal 0 1 0 \n 14. Argentina 0 0 1 \n 15. Belgium 0 0 1 \n 16. Czech Republic 0 0 1 \n 17. Germany 0 0 1 \n 18. Korea 0 0 1 \n 19. Mongolia 0 0 1 \n 20. Netherlands 0 0 1 \n 21. Thailand 0 0 1\n\n \n Let's revisit you list after the closing ceremonies. We're in the easy part now.", 
   {}, 
   62309, 
   null, 
   1092599220.0
  ], 
  [
   63425, 
   null, 
   "montalban", 
   "Let's revisit you list after the closing ceremonies. We're in the easy part now.\n\n \n Why not revist it now the USA is ahead.\n \n That was never going to be in doubt, as you won in Sydney too, and we came fourth. I expect us to come in the top 10 again, and you to reach #1, though China will give you a run.\n \n However, consider this, you have 293,027,571 people* we have 19,913,144.** Per head of population we are doing quite well even to be where we are :)\n \n I must say one more thing in conclusion, there is no 'easy part' of the Olympics and it's rather odd for you to suggest this.\n \n \n \n \n * http://www.cia.gov/cia/publications/factbook/geos/us.html\n ** http://www.cia.gov/cia/publications/factbook/geos/as.html", 
   {}, 
   62338, 
   null, 
   1093099560.0
  ], 
  [
   63428, 
   null, 
   "montalban", 
   "Out of curiosity, I know Christian Rulers at one time outlawed the Olympic Games as a pagan ritual, when were they again deemed politically acceptable?\n\n \n There were many different ancient games, ones held at Olympus, others held at Corinth etc. They were suppressed by Theodosius c.400 AD. I don't know why, but I suspect that it would seem odd to dedicate Christians to games in honour of Zeus. Further, a pagan emperor, Nero had kind of killed of the idea of competition by competing and winning (forcibly) all kinds of races.\n \n The current Olympics date from 1896 and were held in Greece. Revitalised by Baron de Coubertin, whom (I read somewhere) wanted the people to represent only themselves, not nations (so it'd have been competitor -v- competitor, not nation -v- nation)\n \n Only three nations have sent athletes to all Olympics; Great Britian, France, and Australia. (the US boycotted 1980 because the Soviets invaded Afghanistan). There were no Olympics during WWI (1916) and WWII (1940 & 1944).", 
   {}, 
   62312, 
   null, 
   1093100160.0
  ], 
  [
   63430, 
   null, 
   "georged", 
   "Smithsonian Magazine has a current article on the original Olympic Games at Olympia, before Christian rulers banned them. I found it interesting that there were no team sports, all partcipents performed nude and other than eye gouging all was judged fair in one-on-one contests. \n \n Ironic that the US boycotted the 1980 Olympics for Russia invading Afghanistan, but our Christian Crusaders see no conflict with our invasion and occupation of Iraq.", 
   {}, 
   63425, 
   null, 
   1093101060.0
  ], 
  [
   63484, 
   null, 
   "montalban", 
   "Smithsonian Magazine has a current article on the original Olympic Games at Olympia, before Christian rulers banned them. I found it interesting that there were no team sports, all partcipents performed nude and other than eye gouging all was judged fair in one-on-one contests. \n\n Is this magazine on-line?\n My understanding that the idea of man against man is what the good Baron wanted for the modern games. Unfortunately, we're tribal creatures.\n Certainly naked (women) competitors would have made ratings higher. There's a re-enactment of the original olympics on tv where they all do the same sports done back then - but that's a male-only affair, and to go with modern tastes, they're all got something to cover their modesty.\n \nIronic that the US boycotted the 1980 Olympics for Russia invading Afghanistan, but our Christian Crusaders see no conflict with our invasion and occupation of Iraq.\n\n Don't feel bad, just to be spiteful, they all (the Soviet bloc) boycotted the 1984 Olympics (in Los Angeles) to get back at you. And, one of the arguments we put forward when we wanted the games in Sydney is that we've always supported the Olympics.\n I think though about the US attack on Iraq is that the USA is the 'good-guys' and they are the 'bad-guys'. :) Once you realise this, then you can justify anything.\n On another thread one guy's been telling me that the UN are 'left-leaning', I suspect they'll be the next target. :)", 
   {}, 
   63430, 
   null, 
   1093142520.0
  ], 
  [
   63531, 
   null, 
   "georged", 
   "Is this magazine on-line?\n\n \n Article:\n \n http://www.smithsonianmag.com/smithsonian/issues04/aug04/olympics.html\n \n Main site:\n \n http://www.si.edu/websites_a_z/S.htm", 
   {}, 
   63484, 
   null, 
   1093189260.0
  ], 
  [
   63555, 
   null, 
   "jim's trucking", 
   "Why not revist it now the USA is ahead.\n \n That was never going to be in doubt, as you won in Sydney too, and we came fourth. I expect us to come in the top 10 again, and you to reach #1, though China will give you a run.\n \n However, consider this, you have 293,027,571 people* we have 19,913,144.** Per head of population we are doing quite well even to be where we are :)\n \n I must say one more thing in conclusion, there is no 'easy part' of the Olympics and it's rather odd for you to suggest this.\n \n \n \n \n * http://www.cia.gov/cia/publications/factbook/geos/us.html\n ** http://www.cia.gov/cia/publications/factbook/geos/as.html\nRelatively speaking, everything is easy...to somebody. Look at the men's 1500 meter free-style winner. He makes it look easy.\n \n I respect and admire every athlete competing in the Olympics. They all did great just to get there. In the end, somebody wins, somebody wins less, somebody wins even less and somebody wins nothing. There are no losers at the Olympics.", 
   {}, 
   63425, 
   null, 
   1093212960.0
  ], 
  [
   63624, 
   null, 
   "montalban", 
   "Relatively speaking, everything is easy...to somebody. Look at the men's 1500 meter free-style winner. He makes it look easy.\n \n I respect and admire every athlete competing in the Olympics. They all did great just to get there. In the end, somebody wins, somebody wins less, somebody wins even less and somebody wins nothing. There are no losers at the Olympics.\n\n \n Well, I recognise that China's got professional sportsmen and women - who have the state to sponsor them, so they can work on their stuff 24/7. This isn't to take away from the triumphs of their winners.\n \n Who do you think's going to come out on top? China? the USA? I would have put money with you guys, but, at time of writing China's just moved past you.\n \n Australia's also pretty good at sports no one cares about :)\n We're world champions at Cricket, and Rugby League, and were runners up in Rugby Union. \"Woopee!\" you say :p as none of these are played at the Olympics.\n \n Hey, are there any sports that really get up your nose? (Especially at the Olympics). I don't 'get' synchronised diving.", 
   {}, 
   63555, 
   null, 
   1093269300.0
  ], 
  [
   63667, 
   null, 
   "Bush Is The Man", 
   "Just to stir most of you up I'd like to publish this...\n \n The Current Olympics Medals Tally\n\n \n \n \n Just to stir up the latest news, Australia is getting it handed to them by the United States. \n \n \n Country Gold Silver Bronze Total  \n \n \n United States 22 21 16 59    \n China 22 15 11 48  \n Australia 13 09 13 35 \n Japan 13 07 07 27  \n Germany 08 10 11 29  \n France 09 07 07 23 \n \n \n \n The US has it in the bag. They have the most golds, silvers, and bronzes, and obviously the most medals. The have nearly twice as many golds as Australia, over twice as many silvers, more bronzes, and 24 more total medals. France has performed even worse (hahahaha Chirac!!) \n \n \n And just to throw in a table of the 2000 Olympics, which were held in Australia's own backyard. How did the Australians perform? They were completely dominated by the US!\n \n \n \n Country Gold Silver Bronze Total\n United States 44 24 33 101\n Russia 32 22 28 82\n China 28 16 15 69\n Australia 16 25 17 58\n \n \n The US had nearly 50 more medals, nearly 3 times as many golds, 1 less silver, and nearly twice as many bronzes. DOMINATION!!!!", 
   {}, 
   62309, 
   null, 
   1093287420.0
  ], 
  [
   63676, 
   null, 
   "lord tammerlain", 
   "Not domination, but an embarasment for the US, that a country 1/10 the size(population) of the US could come within 1/2 of the total US medal count is shocking. Australia is not one of the Communist countries with extreme sports programs with massive drug programs to help its athletes.\n \n I expect better of a country with 300 million people then just doubling the medal count of a country with 24 million.\n \n Joking aside, Australia's medal count is a fine achievement for a country of that size.", 
   {}, 
   63667, 
   null, 
   1093289880.0
  ], 
  [
   63691, 
   null, 
   "jim's trucking", 
   "Every olympian should be proud just to have participated in the games. For every one that went, there are thousands who tried.", 
   {}, 
   63676, 
   null, 
   1093293240.0
  ], 
  [
   63699, 
   null, 
   "Bush Is The Man", 
   "Not domination, but an embarasment for the US, that a country 1/10 the size(population) of the US could come within 1/2 of the total US medal count is shocking. Australia is not one of the Communist countries with extreme sports programs with massive drug programs to help its athletes.\n \n I expect better of a country with 300 million people then just doubling the medal count of a country with 24 million.\n \n Joking aside, Australia's medal count is a fine achievement for a country of that size.\n\n \n \n How do you figure that? The US had nearly 250 people in the 2000 Olympics, yet managed to win 101 medals. That means about 1 out of every 2 US Olympic athletes won a medal. Australia had right around 210 athletes in the 2000 Olympics, yet managed to get only 58, or 1 out of every 4. And your assumption that size has a correlation with the number of medals won is totally unsubstantiated. India has over 1 billion people, however they have 1 medal in Athens (silver). Medals are correlated with overall athletic ability, not population. The best athletes qualify for the Olympics. So if Australia has more or less athletes in the Olympics, it's because they did or didn't qualify. The US has dominated in nearly every major sport...baseball, basketball (men and women), soccer (women), and softball. The only major presence Australia has is in swimming. 45% of all of Australia's Olympic medals have come from swimming.\n \n The US is also not a Communist country that forces athletics on its citizens. How can you expect better of a country the size of the US? There's a limit to the number of participants in the Olympics, therefore the US can only have so many athletes in it. And we have dominated, and will continue to dominate. China has nearly 5 times the population of the US, however we continually smoke them as well (looking at it in your point of view). Maybe you think Australia's achievement is fine, but it is not number 1. It looks like you guys may not make the top 3 this year. Better luck in 2008 (because Australia has a brutal winter Olympics team...I wonder if it's because swimming isn't a part of it?)", 
   {}, 
   63676, 
   null, 
   1093295040.0
  ], 
  [
   63702, 
   null, 
   "lord tammerlain", 
   "For individual countries achievements in the Summer Olympics, I would rank Australia's as the best. Generally for taking what would be considered more limited resources then the US and getting very strong results.\n \n For most suprising, China. China's Olympic achievements have been improving over the last few years, but to remain as close to the US as they are now is a suprise. I wondeer what Being 2008 will bring for the Chinese?\n \n None of this is meant to detract from US achievements either. It is just that it is somewhat expected, with past history and the collapse of the USSR's olympic teams.", 
   {}, 
   63699, 
   null, 
   1093296300.0
  ], 
  [
   63808, 
   null, 
   "montalban", 
   "Just to stir up the latest news, Australia is getting it handed to them by the United States. \n\n \n It's 'late' news, not 'latest' news - I recognised this back in post #4.\n \nThe US has it in the bag. They have the most golds, silvers, and bronzes, and obviously the most medals. The have nearly twice as many golds as Australia, over twice as many silvers, more bronzes, and 24 more total medals. France has performed even worse (hahahaha Chirac!!) \n\n Yes, you are a nation immensely more numerous than us, see also post #4\n However, consider this, you have 293,027,571 people* we have 19,913,144.** Per head of population we are doing quite well even to be where we are\n (referenced in that post), therfore, per head of population, compared to us, you should have more than 1,000 gold.\n \n And just to throw in a table of the 2000 Olympics, which were held in Australia's own backyard. How did the Australians perform? They were completely dominated by the US!\n\n Again, not news. see again post #4!\n \nThe US had nearly 50 more medals, nearly 3 times as many golds, 1 less silver, and nearly twice as many bronzes. DOMINATION!!!!\n\n Again, on stats, per head of population you should have done far better.", 
   {
    "post_info": {
     "post_title": "You're really not up to date."
    }
   }, 
   63667, 
   null, 
   1093348320.0
  ], 
  [
   63809, 
   null, 
   "montalban", 
   "Not domination, but an embarasment for the US, that a country 1/10 the size(population) of the US could come within 1/2 of the total US medal count is shocking. Australia is not one of the Communist countries with extreme sports programs with massive drug programs to help its athletes.\n \n I expect better of a country with 300 million people then just doubling the medal count of a country with 24 million.\n \n Joking aside, Australia's medal count is a fine achievement for a country of that size.\n\n \n Thanks \n \n \n :)", 
   {}, 
   63676, 
   null, 
   1093348440.0
  ], 
  [
   63810, 
   null, 
   "montalban", 
   "How do you figure that? The US had nearly 250 people in the 2000 Olympics, yet managed to win 101 medals. That means about 1 out of every 2 US Olympic athletes won a medal. Australia had right around 210 athletes in the 2000 Olympics, yet managed to get only 58, or 1 out of every 4.\n\n Then by this rationale, Nauru did far better than you, sending I believe 1 competitor (Renos Doweiya), who came away with a silver. That's 100% medal success, (As you discount the total size of the team sent :) ) (It might have been at the Commonwealth Games, not the Olympics - but the 100% success rate still shows that your 'statistics' are illogical\n \nAnd your assumption that size has a correlation with the number of medals won is totally unsubstantiated. India has over 1 billion people, however they have 1 medal in Athens (silver). Medals are correlated with overall athletic ability, not population.\n\n If you have a very large nation; such as China or the USA, and you have lots of resources being put into lots of sports, such as in China (government sponsored), or the USA (government and corporate sponsored), then the 100 people you send are going to be of better quality than if Upper Volta sends 100. Size does matter, and also the wealth of energy you're able to devote into sport.\n You have sports scholarships through university, these are novel to Australia.\n If you have a large nation, such as India, with not a wealth of energy put into sport - most Indians are more concerned with eating, then with even their most passionate sports passion - Cricket - which is not an Olympic sport (incidentally we're world champions in that -but I at least recognise mitigating factors)\n \n The best athletes qualify for the Olympics. So if Australia has more or less athletes in the Olympics, it's because they did or didn't qualify. The US has dominated in nearly every major sport...baseball, basketball (men and women), soccer (women), and softball. The only major presence Australia has is in swimming.\n\n Yes, the best from our nation does compete. Yes you got more medals, and look how you class 'major sports' Baseball? Softball? These are not major sports in the majority of the world. It is akin to me crowing about how Australia continually beats the USA in Rugby Union and Rugby League. By your logic, you should dominate these sports too - because you send 'your best' to compete. (and there are genuine 'World Cups' in Rugby Union, with nations all over the world competing). For baseball, how many nations compete in the \"World\" Series? It is 'your' national sport. Just about every boy and his dog would have had a baseball mitt. Rugby Union is not our national sport, but we've continually hammered the USA. However, as your player base increases, you are bound to get better players - it's called 'logic'. :)\n I would expect that if American football was an Olympic sport, you'd dominate that.\n \n45% of all of Australia's Olympic medals have come from swimming.\n\n That gives you the clue. Australia is a warmer nation, kids swim. Public pools abound. India might be as warm, but I don't think they've got the quality of facilities for swimming, and even if they send 'the best' Indian swimmers to the Olympics (and even if it's a team of 100s or only a half dozen), there are all these factors. Swimming is in our culture, the fastest swim stroke, the freestyle, is a form of another; the Australian Crawl.\n \nThe US is also not a Communist country that forces athletics on its citizens. How can you expect better of a country the size of the US?\n\n But, you have more money to spend on sport, research, development etc.\n \nThere's a limit to the number of participants in the Olympics, therefore the US can only have so many athletes in it. And we have dominated, and will continue to dominate. China has nearly 5 times the population of the US, however we continually smoke them as well (looking at it in your point of view). Maybe you think Australia's achievement is fine, but it is not number 1. It looks like you guys may not make the top 3 this year. Better luck in 2008 (because Australia has a brutal winter Olympics team...I wonder if it's because swimming isn't a part of it?)\n\n Again you hit the nail on the head. We've got a tiny snow-area compared to the USA, so none of these sports are very much played in Australia. Another advantage you've got.\n In summary, the USA has the massive population, the economic muscle, sports that are 'natural' to America tend to be played; baseball, softball, many winter sports.\n Some Americans are ungracious, even in victory.\n I'll see you at the next Rugby World Cup - you didn't even qualify for the one held last year. (but I suppose a sport you've probably not even heard of doesn't count; whereas sports like 'curling' (??) that most Australians don't know of, does count :) )", 
   {
    "post_info": {
     "post_title": "Logic's not your best 'sport'"
    }
   }, 
   63699, 
   null, 
   1093350000.0
  ], 
  [
   63836, 
   null, 
   "Waxy", 
   " (but I suppose a sport you've probably not even heard of doesn't count; whereas sports like 'curling' (??) that most Australians don't know of, does count :) )\n\n \n HEY! \n \n I like curling! And it IS a sport!\n \n And, FYI, the Americans generally suck at it, Canada dominates. :p\n \n Waxy", 
   {}, 
   63810, 
   null, 
   1093366740.0
  ], 
  [
   63840, 
   null, 
   "sinjin", 
   "Not to pick but China's population is over four times that of the U.S.\n \n We are both populous countries but not nearly equivalent.", 
   {}, 
   63836, 
   null, 
   1093367640.0
  ], 
  [
   63850, 
   null, 
   "Bush Is The Man", 
   "Then by this rationale, Nauru did far better than you, sending I believe 1 competitor (Renos Doweiya), who came away with a silver. That's 100% medal success, (As you discount the total size of the team sent :) ) (It might have been at the Commonwealth Games, not the Olympics - but the 100% success rate still shows that your 'statistics' are illogical\n \n If you have a very large nation; such as China or the USA, and you have lots of resources being put into lots of sports, such as in China (government sponsored), or the USA (government and corporate sponsored), then the 100 people you send are going to be of better quality than if Upper Volta sends 100. Size does matter, and also the wealth of energy you're able to devote into sport.\n You have sports scholarships through university, these are novel to Australia.\n If you have a large nation, such as India, with not a wealth of energy put into sport - most Indians are more concerned with eating, then with even their most passionate sports passion - Cricket - which is not an Olympic sport (incidentally we're world champions in that -but I at least recognise mitigating factors)\n \n Yes, the best from our nation does compete. Yes you got more medals, and look how you class 'major sports' Baseball? Softball? These are not major sports in the majority of the world. It is akin to me crowing about how Australia continually beats the USA in Rugby Union and Rugby League. By your logic, you should dominate these sports too - because you send 'your best' to compete. (and there are genuine 'World Cups' in Rugby Union, with nations all over the world competing). For baseball, how many nations compete in the \"World\" Series? It is 'your' national sport. Just about every boy and his dog would have had a baseball mitt. Rugby Union is not our national sport, but we've continually hammered the USA. However, as your player base increases, you are bound to get better players - it's called 'logic'. :)\n I would expect that if American football was an Olympic sport, you'd dominate that.\n \n That gives you the clue. Australia is a warmer nation, kids swim. Public pools abound. India might be as warm, but I don't think they've got the quality of facilities for swimming, and even if they send 'the best' Indian swimmers to the Olympics (and even if it's a team of 100s or only a half dozen), there are all these factors. Swimming is in our culture, the fastest swim stroke, the freestyle, is a form of another; the Australian Crawl.\n \n But, you have more money to spend on sport, research, development etc.\n \n Again you hit the nail on the head. We've got a tiny snow-area compared to the USA, so none of these sports are very much played in Australia. Another advantage you've got.\n In summary, the USA has the massive population, the economic muscle, sports that are 'natural' to America tend to be played; baseball, softball, many winter sports.\n Some Americans are ungracious, even in victory.\n I'll see you at the next Rugby World Cup - you didn't even qualify for the one held last year. (but I suppose a sport you've probably not even heard of doesn't count; whereas sports like 'curling' (??) that most Australians don't know of, does count :) )\n\n \n \n \n Apparently you don't have too much logic yourself. If you watched any of the track events, you would have seen the Iraqi girl run the 100m. Her best time ever recorded was 15 seconds. I could almost run that backwards. The best athletes from each region qualify. Since the US, Canada, and Mexico are so big, they can only send a limited number of athletes. Nobody in our (or my) region would ever come close to qualifying with a time of 15 seconds. I think there are probably 100,000 women in the US that could beat 15 seconds in the 100m. Why don't they all go to the Olympics? Because we can only send a set number. If we just took the top 25 best 100m times in the world and sent those peopel to the Olympics, it would basically be probably half US runners and half Jamaican runners. Nobody from Iraq would hardly ever have a chance. \n \n You seem to refer to the Olympics as some type of Affirmative Action program. You complain that the US performs better because we offer scholarships to our athletes or have better facilities. Should we give other countries more atheltes in the Olmypics since we have an advantage in other areas (funding, facilities, etc)?", 
   {}, 
   63810, 
   null, 
   1093372200.0
  ], 
  [
   63867, 
   null, 
   "Waxy", 
   "Canada's population is approximately comparable to that of the state of New York if I remember correctly, when it comes to the Olympics, we're anything but \"big\". (Unless it's curling or hockey, :p )\n \n Waxy", 
   {}, 
   63850, 
   null, 
   1093387560.0
  ], 
  [
   63930, 
   null, 
   "montalban", 
   "Apparently you don't have too much logic yourself. If you watched any of the track events, you would have seen the Iraqi girl run the 100m. Her best time ever recorded was 15 seconds. I could almost run that backwards. The best athletes from each region qualify.\n\n That just proves my point. She comes from a very poor nation, where even the best that they can send, are second best on the world stage. As stated in my previous post, had your theory worked, then you'd be world champs at Rugby Union, but you're not. I understand this is because you expend very little resources into this, and have a very small player base to draw upon. In other words, I recognise the realities. Instead of doing likewise, you jump up and down with hollow jingo singing and flag-waving.\n \nSince the US, Canada, and Mexico are so big, they can only send a limited number of athletes. Nobody in our (or my) region would ever come close to qualifying with a time of 15 seconds. I think there are probably 100,000 women in the US that could beat 15 seconds in the 100m. Why don't they all go to the Olympics? Because we can only send a set number. If we just took the top 25 best 100m times in the world and sent those people to the Olympics, it would basically be probably half US runners and half Jamaican runners. Nobody from Iraq would hardly ever have a chance.\n\n Again you prove my point. With more people, you've more choice to pull someone out of the hat who's a better runner.\n \n You seem to refer to the Olympics as some type of Affirmative Action program. You complain that the US performs better because we offer scholarships to our athletes or have better facilities. Should we give other countries more athletes in the Olympics since we have an advantage in other areas (funding, facilities, etc)?\n\n No, I don't complain at all. I affirmed post #4 that you'd probably come out on top, but that China would give you a run. You decided to enter the debate to point score to show just how great America is - in your opinion. Instead of basking in the affirmation I gave, you intended to bring this down by attacking my nation; naturally I go into counter-attack. Your latest attempt to re-work the argument is proof.\n You enter into this argument a statistic regarding the overall amount of athletes entered by the USA compared to that of Australia, and I showed that this is a false analogy because a small nation such as Nauru can enter one athlete and come up with a 100% medal rate - although this was, after further research, at the Commonwealth Games, not the current Olympics - but the theory of the one athletes one medal still shows that you're using the wrong analysis.\n Further to that, if the EU were a single nation - they've got the approximate population to the USA, and the similar wealth - we'd have a more equal basis for comparison, and just comparing some of their member nations - they have (at time of publishing) 41 gold medals. That would be a truer indicator of where you stand - giant against giant - and you come second. :)\n China a poor nation, but willing to expend vast resources is high on the table.\n Australia is a small nation in population, and only moderately well-off. Despite having only 20,000,000 people we've got. We do well in swimming because we've got swimming pools all over the place, it's on national TV all the time - swimmers on our stamps - Dawn Fraser is a national icon. This doesn't lessen the individuals glory, but it is also why we'd be better at it than nations such as Sudan.\n \n Then you laughably introduced the \"Winter Olympics\". Yes, we're up there with other hot nations such as Indonesia, Papua New Guinea, etc. And you wonder why? See again the reference to Rugby League and Rugby Union - they are sports most Americans would not have heard about. I recall actor Robin Williams in an interview when he was out here promoting a film. He was talking about going to see a game of \"Australian Rules\" football, but he described a game of Rugby League - he just didn't know (Australian Rules is also, a totally different form of football from the two styles of Rugby; Union and League). We don't jump up and down and say \"Oh, isn't the USA pathetic - they didn't even qualify for last year's world cup\". We're two times world #1, and runners-up last year. If I were you, and ungracious in victory, I'd harp on and on about your nation. But, I recognise (as stated above) that as a game, it's not even on the radar for most Americans.\n \n PS\n We've made the gold medal game of the Baseball, it's your national game, not ours. I add this because you seem to respond to arrogance", 
   {}, 
   63850, 
   null, 
   1093427220.0
  ], 
  [
   63931, 
   null, 
   "montalban", 
   "Canada's population is approximately comparable to that of the state of New York if I remember correctly, when it comes to the Olympics, we're anything but \"big\". (Unless it's curling or hockey, :p )\n \n Waxy\n\n I work with a Canadian and he's trying to educate me in the ideas of ice hockey - which I always thought should have been called \"Ice Wrestling\"", 
   {}, 
   63867, 
   null, 
   1093427280.0
  ], 
  [
   64007, 
   null, 
   "Gator", 
   "If you watched any of the track events, you would have seen the Iraqi girl run the 100m. Her best time ever recorded was 15 seconds. I could almost run that backwards.\nI watched some of the track events. The participation of female sprinters from such Muslim countries as Pakistan, Bahrain, Kuwait, and Afghanistan is noted. I find no merit in using distortion to disparage the female Iraqi competitor. \n \n Firstly, it's inaccurate to say that Alaa Jassim's best recorded time is 15 seconds, since she ran the 100m in Athens in 12.70 seconds. (In comparison, the winning time in her heat was 11.14 seconds.)\n \n Care to disclose your 'best time ever recorded' in running the 100m backwards?\n \n Secondly, the significance of Muslim women competing in athletics is not their best time or final score but rather the fact that they compete at all. Several Muslim countries sent no women athletes at all to the Athens games. Iran is taking part with only one woman, attired in full hijab. The Ministry of Islamic Guidance and Culture cautioned Iran's TV editors to \"take care to prevent viewers from being confronted with uncovered parts of the female anatomy in contests,\" an order that amounts to a blanket ban on images of female athletics. The Tehran municipality planned a womens-only stadium with 12-foot-high walls to make sure no one could see the women from outside, but the plan was scrapped when critics noted that a nearby airport might allow men to see them from jetliners in flight.\n \n The controversy of how much of a woman's body may be seen in public is dealt with in Saudi Arabia by simply banning women altogether from sports and physical education.\n \n Rather than belittle the Iraqi 100m sprinter for lack of blazing speed, why not credit her with courage and determination for having made it to Athens at all? Especially given the poverty, and cultural and religious oppression she faces. For more background on Alaa Jassim, check out her Profile and General Interests at the official web site of the Athens Games.", 
   {}, 
   63850, 
   null, 
   1093463760.0
  ], 
  [
   64010, 
   null, 
   "jim's trucking", 
   "I watched some of the track events. The participation of female sprinters from such Muslim countries as Pakistan, Bahrain, Kuwait, and Afghanistan is noted. I find no merit in using distortion to disparage the female Iraqi competitor. \n \n Firstly, it's inaccurate to say that Alaa Jassim's best recorded time is 15 seconds, since she ran the 100m in Athens in 12.70 seconds. (In comparison, the winning time in her heat was 11.14 seconds.)\n \n Care to disclose your 'best time ever recorded' in running the 100m backwards?\n \n Secondly, the significance of Muslim women competing in athletics is not their best time or final score but rather the fact that they compete at all. Several Muslim countries sent no women athletes at all to the Athens games. Iran is taking part with only one woman, attired in full hijab. The Ministry of Islamic Guidance and Culture cautioned Iran's TV editors to \"take care to prevent viewers from being confronted with uncovered parts of the female anatomy in contests,\" an order that amounts to a blanket ban on images of female athletics. The Tehran municipality planned a womens-only stadium with 12-foot-high walls to make sure no one could see the women from outside, but the plan was scrapped when critics noted that a nearby airport might allow men to see them from jetliners in flight.\n \n The controversy of how much of a woman's body may be seen in public is dealt with in Saudi Arabia by simply banning women altogether from sports and physical education.\n \n Rather than belittle the Iraqi 100m sprinter for lack of blazing speed, why not credit her with courage and determination for having made it to Athens at all?   Especially given the poverty, and cultural and religious oppression she faces. For more background on Alaa Jassim, check out her Profile and General Interests at the official web site of the Athens Games.\nExactly!   All this chest-beating about the medals score seems to hide the fact that only winners make it to the games.\n \n It's not important to me that some country got more medals than some other. What's important is that we have the Olympics and learn more about other cultures. The competitive spirit and the ultimate goal of ranking the contenders forces us to award prizes for the best, second-best, third best performance under the gun, but there really are no losers at the Olympics.", 
   {}, 
   64007, 
   null, 
   1093464780.0
  ], 
  [
   64217, 
   null, 
   "montalban", 
   "Exactly!   All this chest-beating about the medals score seems to hide the fact that only winners make it to the games.\n \n It's not important to me that some country got more medals than some other. What's important is that we have the Olympics and learn more about other cultures. The competitive spirit and the ultimate goal of ranking the contenders forces us to award prizes for the best, second-best, third best performance under the gun, but there really are no losers at the Olympics.\n\n \n I like that 'no losers' attitude. It's a good way to look at the Olympics.\n \n Australia, at the Montreal performed really badly, and we began the Australian Institute of Sport - a place dedicated to sports science. The government pumped in heaps of $$$ which is why, for a relatively small nation, we have great success.\n \n However, most nations can't do this. Their competitors face all sorts of other challenges just to make it to the Olympics. One African swimmer (known last Olympics as \"Eddy the Eel\") could only train in the only pool in his nation - at a hotel, and even that was only 30m long -not 50m like the Olympic sized pools.\n \n Incidentally, I recall watching American news of the Atlanta Olympics. On day one, Australia was ahead with 2 gold, and the USA had 1, but American news casters showed America ahead, because for that day only, they decided to calculate the top positions by total medals won; not by gold medals first, as is the way noramlly. Then, when America got a few more golds, they decided to calculate it by the gold medal number - and they were still number one! No matter what, America was shown to be on top - hence I posted my little jibe earlier on - the medals table as it stood then (post #1). It seems this may have been taken as an affront to an enitre nation :)", 
   {}, 
   64010, 
   null, 
   1093518180.0
  ], 
  [
   64289, 
   null, 
   "jim's trucking", 
   "...\n Australia, at the Montreal performed really badly, and we began the Australian Institute of Sport - a place dedicated to sports science. The government pumped in heaps of $$$ which is why, for a relatively small nation, we have great success.\n ...\nOh, I see! I thought y'all got good at swimmin' from havin' to outrun the crocks! ;)", 
   {}, 
   64217, 
   null, 
   1093549740.0
  ], 
  [
   64395, 
   null, 
   "montalban", 
   "Oh, I see! I thought y'all got good at swimmin' from havin' to outrun the crocks!\n\n Crocs? No, fortunately the sharks ate them all.\n There's actually quite a number of funny stories about Americans who arrive in Sydney expecting to see kangaroos on the streets! The obvious retort is, \"How many Bald Eagles have you seen?\"\n But then, in contrast to this, every morning, standing at the railway station, waiting for the train to school, I could see kangaroos! No one at school believed me. I lived, at the time in Penrith which is 60km from Sydney, and, whilst still classed as 'suburban', it had at the time, a very small army reserve (base) right next to one side of the station - and they had kangaroos roaming around freely.\n On swimmers, we had two famous ones Fanny Durack and Annette Kellerman, at the beginning of the 1900s, one of whom wowed American audiences in early cinema with her riske swimmers - she was the first in your nation - that I'm aware of - who wore practical swimwear... not the old neck to knee stuff.\n Spedos were an Aussie brand till you guys bought them out.\n \n Hey, what do you think of this story...\n US athletes on best behaviour notice\n The US Olympic team has been told to act with dignity and decorum at the opening ceremony in Athens early tomorrow morning. \n The team has been criticised in the past for being too exuberant, particularly when US runners won the 4x100 metres men's relay at the Sydney Olympics. \n Team leaders say there is a chance American athletes will be booed when they enter the Olympic stadium, due to hostility towards the US-led invasion of Iraq. \n The US has the largest team competing in Athens.\n http://www.abc.net.au/sport/content/200408/s1175643.htm", 
   {}, 
   64289, 
   null, 
   1093605840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gold Gold Gold", 
  "url": "http://www.4forums.com/political/current-events-debates/2945-gold-gold-gold.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 2945, 
  "discussion_files": [
   [
    "24530.html", 
    "http://www.4forums.com/political/current-events-debates/2945-gold-gold-gold-print.html"
   ], 
   [
    "24531.html", 
    "http://www.4forums.com/political/current-events-debates/2945-gold-gold-gold-2-print.html"
   ]
  ], 
  "identifier": 2945
 }
]