[
 [
  [
   62585, 
   null, 
   "Duo_Maxwell", 
   "A few nameless users here have given the opinion that the left hates America and wants to destroy her. Many on other boards share this same view. Many of these same people often claim that their opponent's arguments have no proof because they are opinions and therefore they are correct, even when their arguments are based on proof-less opinions, also many are self described patriots. These people are almost always rabid Bush supporters and oppose every \"liberal\" change to America while pushing their own radical changes all in the name of preserving the American way of life. Contradictory you ask?Very much so. Hypocritical you ask? Very much so. Inconsistent you ask? Very much so.\n \n Is the left out to destroy America and does the Left hate America? Hard to say. Those on the left have a very different view of how America should proceed in this world and how to fix the problems caused by a myriad of factors. Those on the right have their own views on how to go about fixing this world gone wrong. Both often think they are exclusively right when they are in fact both wrong. Even odder in this messed up world is that the views that were normally on the right and the left have switched parities. Many on the right, like Bush, see no problems with exorbitant deficits and debts, fiscal responsibility and tax and spend is no longer part of their views, instead high deficits, low revenue, and high debt are all good things. Many on the left are appalled at the spending and how large this government has gotten. Many wish a return to the budget surplus and low growth of the federal deficit and debt. It is as if someone has taken this world, placed it in a snow globe placed it in an industrial grade tumbler. \n \n But enough of that, is the left really out to destroy America? Raising taxes is one of the points mentioned in that argument, but is raising taxes such a bad thing? The current deficit is large, not ridiculously large, but nevertheless, not something you can just ignore. Also, medicare and social security are ill prepared to deal with the baby boomers. Raising taxes now brings in revenue to help start lower the deficit and decrease the problems we will be facing in the future. Sure, no one likes taxes, but it's better to pay them now when we have a larger work force and fewer elderly, instead of the reverse. The amount of damage that high taxes on a small work force to support a large retired populace on this country is something no one likes to think about. \n \n How about the UN? Sure, the UN is a corrupt, inefficient mess that can't figure out its right from its left, much less how to deal with the problems of the world, but the other option hasn't been to successful. Terrorism is a specific example. Terrorist attacks are up in every regard, terrorists ranks are increasing in unforeseen rates. Attacks of unprecedented sizes are ranging from the South Pacific to the shores of the Atlantic. Osama Bin Laden is still loose, along with his top leaders. Iraq has turned from a former secular, domestic terrorist country into a full blown fundamentalist, international terrorist magnet. Many of the countries that supported terrorists are still supporting terrorists, and many of them are our allies. The war on terrorism has recently been coined the war for terrorism. Terrorism in the past has been successfully fought by cooperation and non-military methods, which many on the left are pushing for, many through the UN. A good reason to support the UN is simply for fiscal reasons. The US is literally footing the bill for both wars. Operation desert storm billed the US less then 10% of this current war. Also, lack of UN approval casts whatever the US does as illegitimate, causing many to view it poorly and many to fight against the US.UN help would provide money, legitimacy, and allies not bought through mafiso tactics. \n \n Those who call liberals anti-American often ignore those two in their crusades against them. Simply because someone else sees another way of achieving the same goal does not mean they want to destroy America. Often using that phrase that liberals hate America is a cover to ignore the actual issues. Think before you use that phrase.", 
   {
    "post_info": {
     "post_title": "Liberals hate America - Silly Claim"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1092733980.0
  ], 
  [
   62607, 
   null, 
   "syklopps61", 
   "It's on the tip of my tongue..moral relativism is it? Something like that. Anyway, yeah, I think Liberals hate America but since changing the meaning of words to suit themselves is a huge thing to the Left, they can make everything sound so righteous. I guess Johnny Bin Walker was Patriotic IN HIS OWN WAY, RIGHT? Sorry, I really don't buy it.\n \n I have a concern with something you said, and it seems to be consistent with those on the Left. You acknowledge that the U.N. is corrupt, but then you say we should support the U.N. if only for fiscal reasons. Well, if I'm not mistaken, if WE stop paying our dues to the U.N., it will collapse, so how can THEY pay for these military actions. Would the Third World countries involved in any of these military actions ACTUALLY put anything of substance toward the actions? NOT Secondly, there is an inference that even though the U.N. is corrupt, we should trust them MORE because the U.S. is even MORE corrupt. As long as you all want the corrupt U.N. to determine our policies around the world I would have to say that yes, Liberals do indeed hate the U.S. I guess I'm about as UN-PC as you can get...oh well", 
   {}, 
   62585, 
   null, 
   1092757740.0
  ], 
  [
   62625, 
   null, 
   "emclean", 
   "how about that the \"left\" has strong socilist tendencys? lets give money to pepole who are not working.\n \n as for the UN IMO they are now, and have been anti americian ever sence the fall of the USSR. there were the counteries that were (or are) communist who dislike the US. you should admit there is a problem with an orgnation that condems the (granted f'ed up) the prisners in Guidmo, but has China on there humanaterian comity. you cant compare Guidmo to china's record of abuces.\n \n any orgnation that is working to try to govern over the leaders of sovern counterys should be consitered an anit-(any country)", 
   {}, 
   62607, 
   null, 
   1092760440.0
  ], 
  [
   62632, 
   null, 
   "jim's trucking", 
   "A few nameless users  here have given the opinion that the left hates America and wants to destroy her. \nActually, we all have names.\n \n \n \n \n \nMany on other boards share this same view. Many of these same people often claim that their opponent&#8217;s arguments have no proof because they are opinions and therefore they are correct, even when their arguments are based on proof-less opinions, also many are self described patriots.\nThat should tell you something.\n \n \n \n \n \n These people are almost always rabid Bush supporters and oppose every &#8220;liberal&#8221; change to America while pushing their own radical changes all in the name of preserving the American way of life. Contradictory you ask?Very much so. Hypocritical you ask? Very much so. Inconsistent you ask? Very much so.\nI missed the contradiction.\n \n I missed the hypocracy.\n \n I missed the inconsistency.\n \n Can you point out how these things reveal themselves?\n \n \n \n \n \n \n\n Is the left out to destroy America and does the Left hate America? Hard to say.  \nThis contradicts your premise.\n \n \n \n \n \nThose on the left have a very different view of how America should proceed in this world and how to fix the problems caused by a myriad of factors. Those on the right have their own views on how to go about fixing this world gone wrong.\nTwo sentences saying the same thing.\n \n \n \n \n \n Both often think they are exclusively right when they are in fact both wrong.\nThen you should present a third alternative to each issue.\n \n \n \n \n \n Even odder in this messed up world is that the views that were normally on the right and the left have switched parities. Many on the right, like Bush, see no problems with exorbitant deficits and debts, fiscal responsibility and tax and spend is no longer part of their views, instead high deficits, low revenue, and high debt are all good things. Many on the left are appalled at the spending and how large this government has gotten. Many wish a return to the budget surplus and low growth of the federal deficit and debt. It is as if someone has taken this world, placed it in a snow globe placed it in an industrial grade tumbler. \nI believe both parties continue to ask for more expenditure. There's pork on everybody's plate.\n \n \n \n \n \n \n\n But enough of that, is the left really out to destroy America? Raising taxes is one of the points mentioned in that argument, but is raising taxes such a bad thing? The current deficit is large, not ridiculously large, but nevertheless, not something you can just ignore. Also, medicare and social security are ill prepared to deal with the baby boomers. Raising taxes now brings in revenue to help start lower the deficit and decrease the problems we will be facing in the future. Sure, no one likes taxes, but it&#8217;s better to pay them now when we have a larger work force and fewer elderly, instead of the reverse. The amount of damage that high taxes on a small work force to support a large retired populace on this country is something no one likes to think about.\nWill you ever learn that high taxes always slow the economy?\n \n \n \n \n \n \n\n How about the UN? Sure, the UN is a corrupt, inefficient mess that can&#8217;t figure out its right from its left, much less how to deal with the problems of the world, but the other option hasn&#8217;t been to successful. Terrorism is a specific example. Terrorist attacks are up in every regard, terrorists ranks are increasing in unforeseen rates. Attacks of unprecedented sizes are ranging from the South Pacific to the shores of the Atlantic. Osama Bin Laden is still loose, along with his top leaders. Iraq has turned from a former secular, domestic terrorist country into a full blown fundamentalist, international terrorist magnet. Many of the countries that supported terrorists are still supporting terrorists, and many of them are our allies. The war on terrorism has recently been coined the war for terrorism. Terrorism in the past has been successfully fought by cooperation and non-military methods, which many on the left are pushing for, many through the UN. A good reason to support the UN is simply for fiscal reasons. The US is literally footing the bill for both wars. Operation desert storm billed the US less then 10% of this current war. Also, lack of UN approval casts whatever the US does as illegitimate, causing many to view it poorly and many to fight against the US.UN help would provide money, legitimacy, and allies not bought through mafiso tactics. \nWho would advocate support of a corrupt, inefficient mess that can&#8217;t figure out its right from its left, much less how to deal with the problems of the world? That is, who besides you?\n \n \n \n \n \n \nThose who call liberals anti-American often ignore those two in their crusades against them. Simply because someone else sees another way of achieving the same goal does not mean they want to destroy America. Often using that phrase that liberals hate America is a cover to ignore the actual issues. Think before you use that phrase.\nI have thought about it often.\n \n \n \n \n Your original post is a vain attempt to be profoundly insightful. As I see often inside my candy wrapper, \"This is not a winner! Please try again!\"", 
   {}, 
   62585, 
   null, 
   1092761520.0
  ], 
  [
   62786, 
   null, 
   "marc9000", 
   "how about that the \"left\" has strong socilist tendencys? lets give money to pepole who are not working. \n\n \n Exactly right. According to Marxist doctrine, socialism is a stage between capitalism and communism where private ownership and control over private property are eliminated.", 
   {}, 
   62625, 
   null, 
   1092791700.0
  ], 
  [
   62819, 
   null, 
   "Duo_Maxwell", 
   "Actually, the argument that the right hates America could easily be given, and with more accuracy. Every major empire in this world was brought down by a coalition of smaller forces. The right's current crusade of going it alone is percisely the step towards alligning these weaker groups aganist America.", 
   {}, 
   62632, 
   null, 
   1092827880.0
  ], 
  [
   62829, 
   null, 
   "Phunting", 
   "I would say that the statement in question is as innacurate as any other flippant blanket stereotype.", 
   {}, 
   62819, 
   null, 
   1092836460.0
  ], 
  [
   63042, 
   null, 
   "Duo_Maxwell", 
   "Phunting, i didn't really expect them to understand, after all, these are the people who call people communists and facists at the same time.", 
   {}, 
   62829, 
   null, 
   1092903480.0
  ], 
  [
   63052, 
   null, 
   "Rick", 
   "I don't have any direct anger towards the left, per se, because I'm neither direction. I just hate the idea that this culture supports a government that is overgrown it's welcome. The realities of Social Security and Medicare are upon us, and if they don't change or sunset, then I do believe they'll collapse. The left created these programs, and thus they'll probably lose the support of Americans when it comes to a head; and honestly I would rather have it that way...I just hope there's something to replace them, because I do fear having a nearly pure 'right' executive branch.\n \n Note: These are conjectures of coarse, and who knows...maybe the Americans will go crazy, and opt for a 60% income tax to supplement their programs...haa. And that won't even do it.", 
   {}, 
   63042, 
   null, 
   1092911580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Liberals hate America - Silly Claim", 
  "url": "http://www.4forums.com/political/current-events-debates/2953-liberals-hate-america-silly-claim.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 2953, 
  "discussion_files": [
   [
    "7416.html", 
    "http://www.4forums.com/political/current-events-debates/2953-liberals-hate-america-silly-claim-print.html"
   ]
  ], 
  "identifier": 2953
 }
]