[
 [
  [
   62913, 
   null, 
   "emclean", 
   "most of us have herd of U.S. v. Miller, but there are others. it amases me how much the rulings changed in 60 years.\n \n \n U.S. Supreme Court and the Second Amendment \n Eric Jeffery \n \n Opponents of the 2nd Amendment rarely mention Supreme Court rulings due to the fact that of the five major cases regarding this fundamental right the Supreme Court consistently backs gun owners.\n \n U.S. v. Cruikshank (1876): \n \n The court stated the 2nd Amendment was a right that existed before the Constitution and that &#8220;This is one of the amendments that has no other effect than to restrict the powers of the national government,&#8221; There was no sweeping declaration for or against the right to keep and bear arms other than it is a right that existed prior to the Constitution so the Government cannot restrict that right.\n \n Presser v. People of Illinois (1886)\n \n &#8220;It is undoubtedly true that all citizens capable of bearing arms constitute the reserved military force or reserve militia of the United States as well as of the States; and, in view of this prerogative of the General Government, as well as of its general powers, the States cannot, even laying the constitutional provision in question out of view [the Second Amendment] prohibit the people from keeping and bearing arms, so as to deprive the United States of their rightful resource for maintaining the public security, and disable the people from performing their duty to the General Government.&#8221;\n \n Miller v. Texas (1894)\n \n Reaffirmed U.S. v. Cruikshank (1876)\n \n U.S. v. Miller (1939):\n \n This case commented that IF a weapon cannot be shown to have &#8220;some reasonable relationship to the preservation or efficiency of a well-regulated militia, it cannot be said the Second Amendment to the Federal Constitution guarantees the right to keep and bear such an instrument&#8221; THAN the Government can outlaw that weapon.\n \n &#8220;In the absence of evidence tending to show that possession or use of a 'shotgun having a barrel of less than 18 inches in length,' which is the subject of regulation and taxation by the National Firearms Act of June 26, 1934, has some reasonable relationship to the preservation or efficiency of a well-regulated militia, it cannot be said the the Second Amendment to the Federal Constitution guarantees the right to keep and bear such an instrument, or that the statute violates such constitutional provision.&#8221;\n \n This case also went into detail about the definition of a &#8220;Militia&#8221;\n \n &#8220;The signification attributed to the term Militia appears from the debates in the Convention, the history and legislation of Colonies and States, and the writings of approved commentators. These show plainly enough that the Militia comprised all males physically capable of acting in concert for the common defense. \"A body of citizens enrolled for military discipline.\" And further, that ordinarily when called for service these men were expected to appear bearing arms supplied by themselves and of the kind in common use at the time.&#8221;\n \n To conclude this case only required evidence that the weapon contribute to the efficiency of a well-regulated militia. The Court never said the defendants had to belong to a well-regulated militia. In other words the Miller case interpreted the Second Amendment to mean one has the right to own militia type weapons. \n \n Lewis v. U.S. (1980):\n \n In upholding the decision that prevented a felon from owning a weapon the court restated the decision of Miller (1939) related to the purpose of the weapon; \n \n &#8220;These legislative restrictions on the use of firearms are neither based upon constitutionally suspect criteria, nor do they trench upon any constitutionally protected liberties. See United States v. Miller, 307 U.S. 174, 178 (1939) (the Second Amendment guarantees no right to keep and bear a firearm that does not have \"some reasonable relationship to [445 U.S. 55, 66] the preservation or efficiency of a well regulated militia\"). \n \n The courts main decision affirmed the right of the state to prevent a felon from owning a weapon based on the facts that felons cannot vote, hold union office, or practice medicine.\n \n American Citizens have the right to own and maintain weapons for their defense. U.S. v. Cruikshank (1876) stated it was such an apparent right that the Constitution doesn&#8217;t need to grant it and that decision was upheld in 1894. \n \n So, irrelevant of the Constitution, Americans can and do posses weapons. Based on this fact there&#8217;s no reason to invoke the 2nd Amendment to defend such a basic right.", 
   {
    "post_info": {
     "post_title": "The Supreme Court and the Second Amendment"
    }
   }, 
   null, 
   null, 
   1092864000.0
  ], 
  [
   63134, 
   null, 
   "Bryan", 
   "It was a fundamental belief of our founding fathers that the Constitution did NOT grant rights. The Bill of Rights only recognized certain rights which were inherent. \n \n Lewis v. U.S. was a 6th. Amendment case holding that a person can be prosecuted for possession of a firearm as a convicted felon even when the defendant was not represented by a lawyer when he was convicted of the prior felony. However, the digression in the majority footnote into the 2nd. Amendment shows (similar to Miller) that the Court is unlikely to adhere to a collective rights interpretation whenever it is confronted again by a 2nd. Amendment case.\n \n The collective rights theory of the 2nd. Amendment holds that it guarantees only the right of the states to possess arms for their militias or, alternatively, only the right of those individuals enrolled in a state militia to possess their militia arms. Yet, both Miller and Lewis were private citizens (bootlegger and convicted felon, respectively) who were not enrolled in any state-sponsored militia. If the Court adhered to the collective interpretation, then it would have summarily dismissed each of their claims to 2nd. Amendment protection as void for lacking standing. Under the collective right interpretation, neither Miller nor Lewis would be entitled to raise their 2nd. Amendment claim unless they could show that they were in a state militia and were being denied their militia arms.\n \n The bottom line is this: A SCOTUS decision that the collective rights interpretation of the 2nd. Amendment is correct would allow (but not require) the total ban on any private ownership of any firearm. On the other hand, a SCOTUS decision that the 2nd. Amendment recognizes an individual right, even if it further declared the right to be \"fundamental\" (which it should be), would still not be a doomsday decision for gun control proponents. The majority of firearms related legislation we have today could still survive a challenge that they impermissibly infringe upon an individual RKBA.", 
   {
    "unicode_changes_made": true
   }, 
   62913, 
   null, 
   1092946680.0
  ], 
  [
   63229, 
   null, 
   "emclean", 
   "would it be legal for the feds to wright laws negating rights recnised by my state? in Indiana the RTBA is an indiviguy right \nSection 32. The people shall have a right to bear arms, for the defense of themselves and the State.\n", 
   {}, 
   63134, 
   null, 
   1092974640.0
  ], 
  [
   63265, 
   null, 
   "Bryan", 
   "A good question., and one that I haven't considered much. Here is my quick opinion: \n \n I believe that the only protection you can find from federal legislation is what you can find in the federal constitution. The reason for this is the \"Supremacy Clause\" of Article 6: \"This Constitution, and the laws of the United States which shall be made in pursuance thereof; and all treaties made, or which shall be made, under the authority of the United States, shall be the supreme law of the land; and the judges in every state shall be bound thereby, any thing in the Constitution or laws of any state to the contrary notwithstanding.\"  So long as a law is made pursuant to Congress' legitimate authority and not in violation of the federal constitution, then it is the supreme law of the land and your state-recognized RKBA would have to bow down before it\n \n Therefore, if the 2nd. Amendment is declared void of any individual right, then the only thing which would limit the reach of congress into your gun cabinet is its own stated authority (for example, its limited authority to regulate \"interstate commerce\") and possibly the 10th. Amendment (which was used to invalidate a portion of the Brady Act). \n \n \"The issue, however, is not whether court rules are \"mutable\"; they assuredly are. It is not whether, in the light of \"various circumstances,\" they can be \"modifi[ed]\"; they assuredly can. The issue is whether, as mutated and modified, they must make sense. The requirement that they do so is the only thing that prevents this Court from being some sort of nine-headed Caesar, giving thumbs-up or thumbs-down to whatever outcome, case by case, suits or offends its collective fancy.\" From Justice Scalia's dissent in the case of DICKERSON v. UNITED STATES, 530 U.S. ___ 995525, Slip opinion (Scalia's dissent) p.12 (June 26, 2000)\n \n Everything seems to depend upon who will be members of the 9-headed Caesar once the issue is finally forced upon them.", 
   {
    "post_info": {
     "post_title": "Don't know if I got the answer, but here goes..."
    }, 
    "unicode_changes_made": true
   }, 
   63229, 
   null, 
   1093016880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Supreme Court and the Second Amendment", 
  "url": "http://www.4forums.com/political/gun-control-debates/2964-supreme-court-second-amendment.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 2964, 
  "discussion_files": [
   [
    "9320.html", 
    "http://www.4forums.com/political/gun-control-debates/2964-supreme-court-second-amendment-print.html"
   ]
  ], 
  "identifier": 2964
 }
]