[
 [
  [
   63060, 
   null, 
   "syklopps61", 
   "I heard today that some guest conductor of the Atlanta symphony stated that if Bush wins again, he would consider leaving the country. That got me to thinking about all the other celebrities who have said the same thing. And I realized that I don't recall anyone on the right (and yes, there ARE celebrities with those leanings) whining and crying like that when Clinton was President. God knows we weren't pleased with him winning TWICE, but we deep down knew things would right themselves. I realize it's not a scientific sampling of the populace, but so far the evidence points to those on the Left secretly wearing diapers. LMAO Is it just me? Also, makes me wonder about the true patriotism of these people (I know, this guy is a British citizen, but Depp, Baldwin, et al are U.S. citizens)-when things get tough or don't go their way, they bolt, only to return when things are \"better\" for them. Would we want friends like that in our personal lives? I think not, so don't throw some new fangled stupid definition of patriotism out and try to make it stick", 
   {
    "post_info": {
     "post_title": "Are those on the Left big babies?"
    }
   }, 
   null, 
   null, 
   1092929400.0
  ], 
  [
   63065, 
   null, 
   "jskufan", 
   "I heard today that some guest conductor of the Atlanta symphony stated that if Bush wins again, he would consider leaving the country. That got me to thinking about all the other celebrities who have said the same thing. And I realized that I don't recall anyone on the right (and yes, there ARE celebrities with those leanings) whining and crying like that when Clinton was President. God knows we weren't pleased with him winning TWICE, but we deep down knew things would right themselves. I realize it's not a scientific sampling of the populace, but so far the evidence points to those on the Left secretly wearing diapers. LMAO Is it just me? Also, makes me wonder about the true patriotism of these people (I know, this guy is a British citizen, but Depp, Baldwin, et al are U.S. citizens)-when things get tough or don't go their way, they bolt, only to return when things are \"better\" for them. Would we want friends like that in our personal lives? I think not, so don't throw some new fangled stupid definition of patriotism out and try to make it stick\n\n \n Are you serious? Bush is President now and virtually every one of your posts is spent whining about Kerry and Clinton. Maybe you should adjust your own diaper. :p By the way, some of those celebrities already have homes and live part time outside the US, their just shooting off their mouths. No one but Americans would ever pay them anywhere near what they get here, I don't think you have to worry about them leaving.", 
   {}, 
   63060, 
   null, 
   1092931320.0
  ], 
  [
   63066, 
   null, 
   "Waxy", 
   "The title of this post, combined with it's contents, should point you straight in the direction of those that are the most childish.\n \n Waxy", 
   {}, 
   63065, 
   null, 
   1092931740.0
  ], 
  [
   63086, 
   null, 
   "jim's trucking", 
   "The title of this post, combined with it's contents, should point you straight in the direction of those that are the most childish.\n \n Waxy\nI believe it's a legitimate question. It does appear that those who claim they'll leave the country if so-and-so wins are usually from the liberal left.\n \n Their statements, much like those of the silly little kid who takes his baseball and goes home if the rules don't suit him, are childish. It's really unfortunate though that these people very seldom follow through with their threats to leave. Rosie, Alec and other empty heads are still here.", 
   {}, 
   63066, 
   null, 
   1092938820.0
  ], 
  [
   63109, 
   null, 
   "jitobear", 
   "I believe it's a legitimate question. It does appear that those who claim they'll leave the country if so-and-so wins are usually from the liberal left.\n \n Their statements, much like those of the silly little kid who takes his baseball and goes home if the rules don't suit him, are childish. It's really unfortunate though that these people very seldom follow through with their threats to leave. Rosie, Alec and other empty heads are still here.\n\n \n Maybe this guy is a baby. He's one guy. No need to measure the entire left by him. That's like saying - \"hey that child molester is right-wing -right wingers are child-molesters.\"\n \n Generalizations are so stupid - and both sides throw them around like facts.\n \n Gah", 
   {}, 
   63086, 
   null, 
   1092942240.0
  ], 
  [
   63112, 
   null, 
   "sinjin", 
   "Where in the world could a American \"right-winger\" go to find a society more in keeping with their sensibilities? What a laugh. :p", 
   {}, 
   63109, 
   null, 
   1092942780.0
  ], 
  [
   63130, 
   null, 
   "syklopps61", 
   "Are you serious? Bush is President now and virtually every one of your posts is spent whining about Kerry and Clinton. Maybe you should adjust your own diaper. :p By the way, some of those celebrities already have homes and live part time outside the US, their just shooting off their mouths. No one but Americans would ever pay them anywhere near what they get here, I don't think you have to worry about them leaving.\n\n\n \n I'm dead serious actually. I see that you didn't come up with any sort of explanation as to why this attitiude is so predominantly a Left way of thinking. Jim's trucking put it best, the kid grabbing his stuff and going home because he doesn't get his way. You accuse me of \"living in the past\" but that seems to be a safety net for you when confronted with something that doesn't fit your way of thinking. You claim that you fall mostly on the right (I THINK this is you) and my doubts about that continue to be reinforced. IF you truly fell so often on the right, you wouldn't have so many criticisms of Bush. As I've said before, I don't like a few things Bush has done, but that doesn't mean I go overboard and say he should be out of office", 
   {}, 
   63065, 
   null, 
   1092945660.0
  ], 
  [
   63132, 
   null, 
   "sinjin", 
   "Here's a question:\n \n Exclusive of military service, for those Americans who have never set foot out of the US, would more be likely to vote Rep or Dem?", 
   {}, 
   63130, 
   null, 
   1092946380.0
  ], 
  [
   63136, 
   null, 
   "jim's trucking", 
   "Here's a question:\n \n Exclusive of military service, for those Americans who have never set foot out of the US, would more be likely to vote Rep or Dem?\nWhat does that have to do with the price of eggs?", 
   {}, 
   63132, 
   null, 
   1092947520.0
  ], 
  [
   63158, 
   null, 
   "sinjin", 
   "What does that have to do with the price of eggs?\n\n \n Those who claim America is the greatest country and yet have never been to another invariably are on the \"right\". Those who spout \"America, love it or leave it\" are invariably on the \"right\". Those who believe immigrants are ruining this country are invariably on the \"right\". Those who have comtempt for the UN and foreigners in general are invariably on the \"right\". I'd bet that the vast majority of the expat American community is composed of people on the \"left\". The sitting President had never travelled outside the US until elected.\n \n The thread asked why no one on the \"right\" threatens to leave the country if \"X\" Dem is elected. It's just a ridiculous notion.", 
   {}, 
   63136, 
   null, 
   1092954540.0
  ], 
  [
   63163, 
   null, 
   "Sarenha Speaks", 
   "Their statements, much like those of the silly little kid who takes his baseball and goes home if the rules don't suit him, are childish. It's really unfortunate though that these people very seldom follow through with their threats to leave. Rosie, Alec and other empty heads are still here\n\n \n I would rather my child come home than be hurt and inconvienienced by the rules of others. Your speeceh reminds me of that of bullies. The two celebrities you named are actually quite intellegent, if you'll believe that. You want them to leave? What ever happented to conservative unity?\n \n Sarenha", 
   {}, 
   63158, 
   null, 
   1092955680.0
  ], 
  [
   63167, 
   null, 
   "jim's trucking", 
   "I would rather my child come home than be hurt and inconvienienced by the rules of others. Your speech reminds me of that of bullies. The two celebrities you named are actually quite intelligent, if you'll believe that. You want them to leave? What ever happented to conservative unity?\n \n Sarenha\nThey are indeed intelligent. They just don't do what they promise to do. They make empty statements.\n \n Your child needs to learn to play by the rules of others...unless he(she) is going to make up all the rules. People play baseball by the rules, bridge by the rules, billiards by the rules...whatever by the rules. In street games and a lot of card games, sometimes the rules are by mutual agreement at the site...but there are still rules to play by.", 
   {}, 
   63163, 
   null, 
   1092956520.0
  ], 
  [
   63169, 
   null, 
   "jim's trucking", 
   "Those who claim America is the greatest country and yet have never been to another invariably are on the \"right\". Those who spout \"America, love it or leave it\" are invariably on the \"right\". Those who believe immigrants are ruining this country are invariably on the \"right\". Those who have comtempt for the UN and foreigners in general are invariably on the \"right\". I'd bet that the vast majority of the expat American community is composed of people on the \"left\". The sitting President had never travelled outside the US until elected.\n \n The thread asked why no one on the \"right\" threatens to leave the country if \"X\" Dem is elected. It's just a ridiculous notion.\nWhere did you get these \"facts\"? I realize your argument is not that all people from the right side believe as you state, but let me say these things: \n \n I don't say, \"Love it or leave it!\" I say, \"If you promise to leave it under certain conditions and those conditions prevail, please honor your promise and leave.\"\n \n Immigrants made this country what it is. They are certainly welcome. Illegal aliens are not. Let them immigrate under the legal means available.\n \n I've been to several countries. None is greater than the USA. Some are on par, but they're no better. Some countries suck.\n \n The UN sucks and mooches off the US. Move it to another country and let them pay the bills.", 
   {}, 
   63158, 
   null, 
   1092957360.0
  ], 
  [
   63170, 
   null, 
   "Duo_Maxwell", 
   "I guess then under that logic, McCain is also a big baby, considering that anyone who disagrees with the rank and file notions of the republican party is a liberal and therefore on the left. \n \n As for the UN, we haven't paid them a dime in years.", 
   {}, 
   63060, 
   null, 
   1092957600.0
  ], 
  [
   63176, 
   null, 
   "jskufan", 
   " You accuse me of \"living in the past\" but that seems to be a safety net for you when confronted with something that doesn't fit your way of thinking. You claim that you fall mostly on the right (I THINK this is you) and my doubts about that continue to be reinforced. IF you truly fell so often on the right, you wouldn't have so many criticisms of Bush. As I've said before, I don't like a few things Bush has done, but that doesn't mean I go overboard and say he should be out of office\n\n \n You have the right person, as I stated in an earlier post somewhere I consider myself Conservative, yet more moderate than the extreme right. Who said I had so many criticisms of Bush? Those are words you're putting in my mouth. I have one large, insurmountable criticism of Bush; the invasion and occupation of Iraq. Unfortunately, unlike you, I have a hard time \"overlooking\" this difference of opinion and re-electing him. In addition, I think it's a real stretch labelling this administration Conservative.", 
   {}, 
   63130, 
   null, 
   1092958740.0
  ], 
  [
   63178, 
   null, 
   "sinjin", 
   "Where did you get these \"facts\"? I realize your argument is not that all people from the right side believe as you state, but let me say these things: \n \n I don't say, \"Love it or leave it!\" I say, \"If you promise to leave it under certain conditions and those conditions prevail, please honor your promise and leave.\"\n \n Immigrants made this country what it is. They are certainly welcome. Illegal aliens are not. Let them immigrate under the legal means available.\n \n I've been to several countries. None is greater than the USA. Some are on par, but they're no better. Some countries suck.\n \n The UN sucks and mooches off the US. Move it to another country and let them pay the bills.\n\n \n Jim,\n \n Those weren't facts but observations based on my personal experience. Sorry. I should have put IME or IMO.\n \n I personally would not hold someone to something said in the heat of passion or in disgust.", 
   {}, 
   63169, 
   null, 
   1092958920.0
  ], 
  [
   63197, 
   null, 
   "Duo_Maxwell", 
   "jskufan: I have a hard time calling the Republican party as a whole conservative. \n \n Let's see: NCLB, the medicare bill, gay ammendement, massive government, huge deficit, huge debt, fisically liberal policies, unilateral actions.....conservative notions? hardly.", 
   {}, 
   63178, 
   null, 
   1092964800.0
  ], 
  [
   63204, 
   null, 
   "jskufan", 
   "jskufan: I have a hard time calling the Republican party as a whole conservative. \n \n Let's see: NCLB, the medicare bill, gay ammendement, massive government, huge deficit, huge debt, fisically liberal policies, unilateral actions.....conservative notions? hardly.\n\n \n I agree with you. Although their are some Conservative Republicans, as I stated in another post, being Republican doesn't assure a politician is Conservative. I think the best way to describe this administration is fiscally inept. They want to stimulate the economy with a tax cut, but they can't control their spending and governmental growth. Granted, I don't think the Democrats are any more responsible with my money, but at least the last administration had enough sense not to commit us to a long, expensive war that was completely avoidable, and I don't mean the war on terrorism.", 
   {}, 
   63197, 
   null, 
   1092967740.0
  ], 
  [
   63212, 
   null, 
   "syklopps61", 
   "[QUOTE]\nI guess then under that logic, McCain is also a big baby, considering that anyone who disagrees with the rank and file notions of the republican party is a liberal and therefore on the left. \n \n \n YOU BET! He has nothing but Depends in his drawer. And if you think that McCain represents Republicans, you couldn't be more mistaken. He's a nutjob!\n Guess that's why you on the Left love him so much! :-D", 
   {}, 
   63170, 
   null, 
   1092971100.0
  ], 
  [
   63215, 
   null, 
   "Duo_Maxwell", 
   "syklopps61, \n \n I suggest you actually learn something before mouthing off\n \n \nThe Real McCain\n \n I'm sure nothing is more amusing to John McCain than hearing charges that he's a liberal. A recent ABC News poll indicates that nearly 60% of Americans think John McCain is liberal or moderate. Only 28% see him as conservative. The Senator from Arizona, one of the most conservative places in the universe, is the son and grandson of four-star admirals, a lineage not usually thought of as moderate or liberal. Mr. McCain is the hand picked successor for the Senate seat of Barry Goldwater, a man who symbolizes American conservatism in the second half of the 20th century. Less than a year ago McCain was calling for an invasion of Yugoslavia by US ground troops. That he is now being portrayed as some left leaning radical is staggering.\n\n \n http://www.ctgreens.org/~tpethier/mccain.html\n \n It goes on, and on, and on, and it does highlight why those who use the term liberal really have no idea what it means.", 
   {}, 
   63212, 
   null, 
   1092971820.0
  ], 
  [
   63219, 
   null, 
   "syklopps61", 
   "I think it's a real stretch labelling this administration Conservative.[/\nQUOTE]\n \n I'm not sure I specifically said it was, but, unlike some here, if you can show me a quote, I will freely admit then, without spin, that I said it. Having said that, without a quote, I will have to say that YOU have put words in MY mouth. I certainly am not under the illusion that this administration is Conservative in the truest sense of the word, but it certainly bears more resemblance than a Kerry administration would. Lower taxes vs. higher taxes?\n Strong military vs weak? National Security vs. none? A judiciary that interprets law vs. one than makes law? Just a few things of great importance that at least under Bush would be maintained. In a perfect world, would I want the free spending and big government policies changed, you betcha. Would I want the Immigration policies to be much stricter, you betcha. Anyway, hopefully this sheds some light that I'm not some fanatical supporter. I DO feel that my support and defense of Bush is much more rational than the hatred and degree of citicism of my counterparts", 
   {}, 
   63176, 
   null, 
   1092972720.0
  ], 
  [
   63223, 
   null, 
   "Duo_Maxwell", 
   " but it certainly bears more resemblance than a Kerry administration would. Lower taxes vs. higher taxes?\n\n \n Let's increase the deficit and debt while decreasing revenue in a growing economy. Fisically liberal? You betcha. Now increasing revenue and lowering deficit to make ends meet is fisically conservative. That definitely isn't Bush. \n \n \nStrong military vs weak? National Security vs. none?\n\n \n Both parties want a strong military and national security. You are almost to the point of using the fallacy of \n \n Straw Man (Fallacy Of Extension): \n attacking an exaggerated or caricatured version of your opponent's position. \n For example, the claim that \"evolution means a dog giving birth to a cat.\" \n \n Another example: \"Senator Jones says that we should not fund the attack submarine program. I disagree entirely. I can't understand why he wants to leave us defenseless like that.\" \n \n On the Internet, it is common to exaggerate the opponent's position so that a comparison can be made between the opponent and Hitler. \n \n \nA judiciary that interprets law vs. one than makes law?\n\n \n Um...the judiciary is suppose to interpret laws, if that requires enforcing the consitution over the state's rights, then so be it. \n \n \n? Just a few things of great importance that at least under Bush would be maintained.\n\n \n By cutting pay, cutting benefits, inefficent use of money for war, attacking state's rights...sure, if you live in la-la-land.\n \n Bush and the republican party are not conservative.", 
   {}, 
   63219, 
   null, 
   1092973020.0
  ], 
  [
   63224, 
   null, 
   "syklopps61", 
   "I suggest you actually learn something before mouthing off\n\n \n \n With all due respect, I really could care less what suggestions you may have for me. I'm fully aware of all that, but it seems to me that I was berated for living in the past in an earlier post. McCain WAS all those things, NOW he's a nutjob! LOL", 
   {}, 
   63215, 
   null, 
   1092973200.0
  ], 
  [
   63226, 
   null, 
   "syklopps61", 
   "Now increasing revenue and lowering deficit to make ends meet is fisically conservative.\n \n \n Not by raising taxes though, sorry, Reagan proved that (uh oh, living in the past again)\n \n \nBoth parties want a strong military and national security. \n \n \n ROTFLMAO! Whew, I needed that one, it's been a rough day!\n \n \nAnother example: \"Senator Jones says that we should not fund the attack submarine program. I disagree entirely. I can't understand why he wants to leave us defenseless like that.\" \n \n \n How else is one to show that he wants a strong military? By big tough words like Kerry or Clinton? STOP, you're killing me!! LMAO Are you one of those that actually thinks one's record shouldn't be used to show something of the man? If not the record, then WHAT?", 
   {}, 
   63223, 
   null, 
   1092973860.0
  ], 
  [
   63228, 
   null, 
   "jskufan", 
   "QUOTE]\n \n I'm not sure I specifically said it was, but, unlike some here, if you can show me a quote, I will freely admit then, without spin, that I said it. Having said that, without a quote, I will have to say that YOU have put words in MY mouth. I certainly am not under the illusion that this administration is Conservative in the truest sense of the word, but it certainly bears more resemblance than a Kerry administration would. Lower taxes vs. higher taxes?\n Strong military vs weak? National Security vs. none? A judiciary that interprets law vs. one than makes law? Just a few things of great importance that at least under Bush would be maintained. In a perfect world, would I want the free spending and big government policies changed, you betcha. Would I want the Immigration policies to be much stricter, you betcha. Anyway, hopefully this sheds some light that I'm not some fanatical supporter. I DO feel that my support and defense of Bush is much more rational than the hatred and degree of citicism of my counterparts\n\n \n Actually, your post does shed some light. Let's face it, other than the dillusion that we're fighting terrorism in Iraq, this President doesn't fit any of the qualifications you as a Conservative should require in a candidate. He is however, Republican, and that's enough to trump everything else. Hardline party members vote the party, period. As for your rational support of Bush, what else is new, he's your candidate. When you post on Kerry are you any different from Bush's critics, remember, old posts are archived!", 
   {}, 
   63219, 
   null, 
   1092974520.0
  ], 
  [
   63232, 
   null, 
   "Master_Shake", 
   "They are indeed intelligent. They just don't do what they promise to do. They make empty statements.\n\n \n They aren't empty statements, because anyone in their right mind knows they are making a point not necessarily threatening to leave the country. The fact that there is even an argument about this is beyond stupid.", 
   {}, 
   63167, 
   null, 
   1092975900.0
  ], 
  [
   63233, 
   null, 
   "Master_Shake", 
   "I have one large, insurmountable criticism of Bush; the invasion and occupation of Iraq. Unfortunately, unlike you, I have a hard time \"overlooking\" this difference of opinion and re-electing him. In addition, I think it's a real stretch labelling this administration Conservative.\n\n \n You are absolutely right about it being \"a real stretch labelling this administration Conservative.\" In a millions ways, they go against so many of the precepts of true conservativism. We call them \"neo-cons,\" but we shouldn't even call them anything with the word \"conservative\" in it.", 
   {}, 
   63176, 
   null, 
   1092976260.0
  ], 
  [
   63242, 
   null, 
   "montalban", 
   "I believe it's a legitimate question. It does appear that those who claim they'll leave the country if so-and-so wins are usually from the liberal left.\n\n \n What do you care what celebrities say anyway?", 
   {}, 
   63086, 
   null, 
   1092982080.0
  ], 
  [
   63267, 
   null, 
   "syklopps61", 
   "this President doesn't fit any of the qualifications you as a Conservative should require in a candidate. \n \n \n Well, I think this is the closest we'll get from you that you are, in fact, NOT one to fall more on the right side. You said earlier that your big complaint with Bush was the war (I won't bother to qoute you, it just ends up being deniued anyway). NO qualifications? If you fell on the right, you would LOVE the fact he cut taxes and should be praying for more tax cuts. If you fell on the right, you would be cheering a strong military. IF you fell on the right, you would want the type of judges that he would appoint\n \n \n \nHardline party members vote the party, period. \n \n \n Yes and no...Republicans/Conservatives have principles and have shown in the past that they vote their conscience-does Perot ring a bell? Anyone in their right mind that thinks Bush would have lost to Clinton if Perot WASN'T in the race is insane-Conservatives were disappointed in Bush and voted for Perot, plain and simple. Now, on the other hand, Democrats/Liberals vote for THEIR guy, gotta beat them evil Republicans at all costs, no matter who it is", 
   {}, 
   63228, 
   null, 
   1093017480.0
  ], 
  [
   63269, 
   null, 
   "syklopps61", 
   "What do you care what celebrities say anyway?\n\n\n \n Funny you say that, but I think that question should be asked of the Left. Afterall, beginning with Clinton, the Left has courted the celebrities in Hollywood and never condemns the **** that spews out of their yaps, no matter HOW whacked out it is. The point of all this, if you read the initial post, is that it is always Left leaning celebrities that threaten to leave, and never seems to be Right leaning folks that say that", 
   {}, 
   63242, 
   null, 
   1093017720.0
  ], 
  [
   63274, 
   null, 
   "Sigma", 
   "Well, I think this is the closest we'll get from you that you are, in fact, NOT one to fall more on the right side. You said earlier that your big complaint with Bush was the war (I won't bother to qoute you, it just ends up being deniued anyway). NO qualifications? If you fell on the right, you would LOVE the fact he cut taxes and should be praying for more tax cuts. If you fell on the right, you would be cheering a strong military. IF you fell on the right, you would want the type of judges that he would appoint\n\n \n I would think those that fall on the right would LOVE the cut taxes if it came with decreased spending. Is it reasonable to LOVE the tax breaks if it comes with a huge deficit? Can someone on the right know that this is not the right time for tax breaks? You contradict yourself in this post. Someone on the right can BE on the right and still disagree with what Bush is doing, correct?\n \n \n \n\n Yes and no...Republicans/Conservatives have principles and have shown in the past that they vote their conscience-does Perot ring a bell? Anyone in their right mind that thinks Bush would have lost to Clinton if Perot WASN'T in the race is insane-Conservatives were disappointed in Bush and voted for Perot, plain and simple. Now, on the other hand, Democrats/Liberals vote for THEIR guy, gotta beat them evil Republicans at all costs, no matter who it is\n\n \n Bah, the same case could be made with Nader in 2000. I seem to remember lots of hubbub about him being in the race splitting the democratic vote.\n \n The \"gotta beat them evil Republicans at all costs\" is because of Bush Jr. \n \n I haven't yet met or seen a \"rabid Liberal\" yet I have seen many examples, just on this board, of unreasoning and hardcore conserv... excuse me, Republicans.", 
   {}, 
   63267, 
   null, 
   1093018980.0
  ], 
  [
   63281, 
   null, 
   "montalban", 
   "Funny you say that, but I think that question should be asked of the Left. Afterall, beginning with Clinton, the Left has courted the celebrities in Hollywood and never condemns the **** that spews out of their yaps, no matter HOW whacked out it is. The point of all this, if you read the initial post, is that it is always Left leaning celebrities that threaten to leave, and never seems to be Right leaning folks that say that\n\n \n Still, the question remains, what do you care about what celebrities think? Should it worry you that the 'left' is courting them?\n \n Brittney Spears (who recently spoke out against anti-war critiques), to now Californian Gov. big Arnie are right wing celebrities whom you seem to have somehow missed.", 
   {}, 
   63269, 
   null, 
   1093020300.0
  ], 
  [
   63288, 
   null, 
   "jskufan", 
   "Well, I think this is the closest we'll get from you that you are, in fact, NOT one to fall more on the right side. You said earlier that your big complaint with Bush was the war (I won't bother to qoute you, it just ends up being deniued anyway). \n\n \n Why would I deny it, I just posted it yesterday. It's in black and white.\n \n \n \n NO qualifications? If you fell on the right, you would LOVE the fact he cut taxes and should be praying for more tax cuts. If you fell on the right, you would be cheering a strong military. IF you fell on the right, you would want the type of judges that he would appoint\n\n \n Re-read my post/posts. I'm not against tax cuts, I'm against excessive spending coupled with tax cuts. Everyone in America is for a strong military. The question is, how much is enough. We already spend more than the next ten countries put together, there reaches a point when your wasting tax money. I don't know if we're there yet, but considering defense spending comes from tax money, I want accountability. I haven't taken issue with any Supreme Court ruling in my posts.\n \n \n \nYes and no...Republicans/Conservatives have principles and have shown in the past that they vote their conscience-does Perot ring a bell? Anyone in their right mind that thinks Bush would have lost to Clinton if Perot WASN'T in the race is insane-Conservatives were disappointed in Bush and voted for Perot, plain and simple. Now, on the other hand, Democrats/Liberals vote for THEIR guy, gotta beat them evil Republicans at all costs, no matter who it is\n\n \n I agree, Perot probably cost Bush 1 lots of votes. Actually, Bush 1 cost himself lots of votes. I also agree that more Republicans probably voted for Perot than Democrats. By the way, I voted for Perot.", 
   {}, 
   63267, 
   null, 
   1093021200.0
  ], 
  [
   63304, 
   null, 
   "syklopps61", 
   "Brittney Spears (who recently spoke out against anti-war critiques), to now Californian Gov. big Arnie are right wing celebrities whom you seem to have somehow missed.\n[/QUOTE]\n \n Hot AND smart!!! LOL But is SHE talking about leaving IF Kerry wins? I'm not concerned with LISTENING to them, I'm just wondering why the immature attitude always seems to appear on the Left", 
   {}, 
   63281, 
   null, 
   1093028100.0
  ], 
  [
   63306, 
   null, 
   "syklopps61", 
   "[QUOTE]\nWhy would I deny it, I just posted it yesterday. It's in black and white.\n\n \n Welllll, so was another quote you made but you denied saying it, but ANYWAY. I actually meant that you said it was your only complaint\n \n \nI'm against excessive spending coupled with tax cuts. \n\n \n I'm not happy with the excessive spending of this administration, but I'm even MORE against HIGHER taxes and excessive spending\n \n \nEveryone in America is for a strong military. The question is, how much is enough. We already spend more than the next ten countries put together, there reaches a point when your wasting tax money. \n \n \n Yeah, that's easy to say and even easier to hide behind that \"what's enough\" cover. A strong military at least produces something that benefits EVERYONE in the country. Would you also say that social programs are a complete waste of money? Afterall, what do they produce, other than laziness that is?\n \n \nI haven't taken issue with any Supreme Court ruling in my posts.\n\n \n Well, I wasn't talking ONLY about Supreme Court, it includes ALL the Federal Judiciary, and I'll bet, IF you are falling on the right so often, you'd have MANY complaints about rulings from all of these courts.", 
   {}, 
   63288, 
   null, 
   1093029000.0
  ], 
  [
   63308, 
   null, 
   "syklopps61", 
   "I would think those that fall on the right would LOVE the cut taxes if it came with decreased spending.\n\n \n I personally love them no matter what. Reagan showed (stop wincing) that the decrease in taxes INCREASED the revenue. The spending to beef up the military after it was decemated by Carter increased the defecit, and later in his administration the defecit was drastically reduced as the economy was kicking into gear. I agree that Bush should be using the veto more frequently and the Congress should have some backbone and not even vote for the spending to begin with.\n \n \nIs it reasonable to LOVE the tax breaks if it comes with a huge deficit? \n \n \n Well, the economy is bouncing back, so for the time being, yeah, I think it's something we can handle\n \n \nBah, the same case could be made with Nader in 2000. I seem to remember lots of hubbub about him being in the race splitting the democratic vote.\n\n \n I suppose I was wrong...what was it 2%, 4%? So, THAT many on the Left have principples, compared to what, 20% of Republicans that voted for Perot?\n \n \nThe \"gotta beat them evil Republicans at all costs\" is because of Bush Jr. \n \n \n Thank you for admitting the irrational hatred you have for him. What could he possibly have done that deserves this much hate? And PLEASE don't pull the lying BS, it won't fly\n \n \n \nI haven't yet met or seen a \"rabid Liberal\" yet I have seen many examples, just on this board, of unreasoning and hardcore conserv... excuse me, Republicans.\n\n \n Of course not, it's only the EVIL Conservatives LMAO", 
   {}, 
   63274, 
   null, 
   1093029600.0
  ], 
  [
   63345, 
   null, 
   "montalban", 
   "Hot AND smart!!! LOL But is SHE talking about leaving IF Kerry wins? I'm not concerned with LISTENING to them, I'm just wondering why the immature attitude always seems to appear on the Left\n\n \n I'm concerned why you'd only be concerned with people who voice opinions different from you.\n \n If they wanted to leave, wouldn't that be a positive for you? - less communists in Hollywood? :p", 
   {}, 
   63304, 
   null, 
   1093049400.0
  ], 
  [
   63356, 
   null, 
   "jskufan", 
   "[QUOTE=syklopps61]\n\n \n Welllll, so was another quote you made but you denied saying it, but ANYWAY. I actually meant that you said it was your only complaint \n\n \n What in the world are you talking about??? Please enlighten me on this flip/flop I supposedly made. Just because you misunderstand my post doesn't mean it's content is contradictory. I have a feeling you're still referring to my post on the definition of \"Conservative\" and how it doesn't relate to your candidate. Re-read, I think it'll make sense.\n \n \nI'm not happy with the excessive spending of this administration, but I'm even MORE against HIGHER taxes and excessive spending\n\n \n Boy, you've said a mouthfull. Is there anyone on this planet that would be \"for\" higher taxes and excessive spending? Please don't say Democrats.\n \n \nYeah, that's easy to say and even easier to hide behind that \"what's enough\" cover. A strong military at least produces something that benefits EVERYONE in the country. Would you also say that social programs are a complete waste of money? Afterall, what do they produce, other than laziness that is?\n\n \n Again, I already said I was for a strong military. Look back at the Soviet Union to see what happens when you spend a dissproportionate amount of your countries wealth on the \"military\". Using this administration as an example, you are correct, if you want to occupy multiple regions in the middle east for extended periods, we don't have a large enough military. \n \n Any program subsidized by tax dollars is a \"social program\". We have the largest \"social program\" in history going on right now as we rebuild Iraq with US dollars. Then we have our trillion dollar prescription drug plan to pay for. Then, if there's any money left over in the till, I say give the rest away in tax cuts. After the election, we can start paying our bills with Monopoly money.\n \n \nWell, I wasn't talking ONLY about Supreme Court, it includes ALL the Federal Judiciary, and I'll bet, IF you are falling on the right so often, you'd have MANY complaints about rulings from all of these courts.\n\n \n Give me some specific examples of rulings you object to. That shouldn't be hard given your obvious level of dissatisfaction. Unless I'm mistaken, the Supreme Court is made up mostly of Republican appointees, please correct me if I'm wrong.", 
   {}, 
   63306, 
   null, 
   1093055700.0
  ], 
  [
   63360, 
   null, 
   "JPSartre12", 
   "Those who claim America is the greatest country and yet have never been to another invariably are on the \"right\". Those who spout \"America, love it or leave it\" are invariably on the \"right\". Those who believe immigrants are ruining this country are invariably on the \"right\". Those who have comtempt for the UN and foreigners in general are invariably on the \"right\". I'd bet that the vast majority of the expat American community is composed of people on the \"left\". The sitting President had never travelled outside the US until elected.\n \n The thread asked why no one on the \"right\" threatens to leave the country if \"X\" Dem is elected. It's just a ridiculous notion.\n\n \n You can't get much farther right than I am and I've been out of the country many, many times. I always dread it, too, because no other country has the same flavor and characteristics of the US. I even feel a sense of relief when I cross the border coming home from Canada. emoticon_xdonno \n As for the UN. the reason that the Right doesn't like the UN is because the UN is a decidedly Socialist organization. Their entire goal is to redistribute wealth from the haves to the have-nots. This means from the US to other nations. Only a blind Democrat would see this as a good thing. emoticon_rolleyes", 
   {}, 
   63158, 
   null, 
   1093057380.0
  ], 
  [
   63363, 
   null, 
   "montalban", 
   "You can't get much farther right than I am and I've been out of the country many, many times. I always dread it, too, because no other country has the same flavor and characteristics of the US. I even feel a sense of relief when I cross the border coming home from Canada. emoticon_xdonno \n As for the UN. the reason that the Right doesn't like the UN is because the UN is a decidedly Socialist organization. Their entire goal is to redistribute wealth from the haves to the have-nots. This means from the US to other nations. Only a blind Democrat would see this as a good thing. emoticon_rolleyes\n\n \n I thank God too that the United States is unique :)\n \n However, how is the UN a 'decidedly Socialist organisation'?", 
   {}, 
   63360, 
   null, 
   1093058280.0
  ], 
  [
   63366, 
   null, 
   "syklopps61", 
   "Boy, you've said a mouthfull. Is there anyone on this planet that would be \"for\" higher taxes and excessive spending? Please don't say Democrats\n\n \n LOL Can I say Liberals then?\n \n \nAgain, I already said I was for a strong military. Look back at the Soviet Union to see what happens when you spend a dissproportionate amount of your countries wealth on the \"military\". \n \n \n Are you comparing a Communist system with a Capitalist system? Seems to me to be apples and oranges\n \n \n Using this administration as an example, you are correct, if you want to occupy multiple regions in the middle east for extended periods, we don't have a large enough military. \n \n \n Hey, I'm all for giving people a chance, and if they can't or won't do the rest themselves, let them rot. We should stay in Iraq until things are reasonably stable-I don't think we should stay there until things are perfect because they won't be. I personally don't think those people have a snowball's chance in hell of having a stable country. But I also feel that if they blow their chance and present a threat to us in anyway, we should then do what we need to do to eliminate that threat, when and if it comes. And considering the fact that there are so many of these dirtball little countries and various whacko groups out there, yeah, I think we need a huge military to eliminate the threat.\n \n \nAny program subsidized by tax dollars is a \"social program\". We have the largest \"social program\" in history going on right now as we rebuild Iraq with US dollars. Then we have our trillion dollar prescription drug plan to pay for. \n \n \n I notice the only two examples you give of social programs is the rebuilding of Iraq and the prescription drug program. You don't have a problem with the trillions WASTED on welfare programs? What in God's name did we get for those trillions? NADA, ZIP, ZERO, ZILCH And now that we have the advantage of 20/20 hindsight, do you think it was a waste of money to rebuild Germany and Japan after WWII?\n \n \nGive me some specific examples of rulings you object to. That shouldn't be hard given your obvious level of dissatisfaction. Unless I'm mistaken, the Supreme Court is made up mostly of Republican appointees, please correct me if I'm wrong.\n[/QUOTE]\n \n \n Honestly, I can't think of any one specifically, but we've all heard of the whacko decisions by activist judges around the country. I'm sure someone out there has some specific examples. :-D", 
   {}, 
   63356, 
   null, 
   1093058520.0
  ], 
  [
   63377, 
   null, 
   "jskufan", 
   "LOL Can I say Liberals then?\n\n \n No, it has no rationale.\n \n \n \n \nAre you comparing a Communist system with a Capitalist system? Seems to me to be apples and oranges\n \n \n It had nothing to do with communism. It was about a country spending all their revenues on \"military\" hardware and personell. What return on investment do you achieve when a Tomahawk missile explodes? You've just flushed tax money down the drain. Do you think a Capitalist system can't go bankrupt? \n \n \n \n \nHey, I'm all for giving people a chance, and if they can't or won't do the rest themselves, let them rot. We should stay in Iraq until things are reasonably stable-I don't think we should stay there until things are perfect because they won't be. I personally don't think those people have a snowball's chance in hell of having a stable country. But I also feel that if they blow their chance and present a threat to us in anyway, we should then do what we need to do to eliminate that threat, when and if it comes. And considering the fact that there are so many of these dirtball little countries and various whacko groups out there, yeah, I think we need a huge military to eliminate the threat\n.\n \n That's a reassuring response, and your worried about wasting money on the domestic poor. Sounds like you're already braced for the inevitable in Iraq and ready to spread more of that \"Conservative\" diplomacy around the world. By the way, since you don't plan on being in Iraq long term, you might want to tell our government to quit building military bases there.\n \n \nI notice the only two examples you give of social programs is the rebuilding of Iraq and the prescription drug program. You don't have a problem with the trillions WASTED on welfare programs? What in God's name did we get for those trillions? NADA, ZIP, ZERO, ZILCH And now that we have the advantage of 20/20 hindsight, do you think it was a waste of money to rebuild Germany and Japan after WWII?\n \n \n\n \n If you want to compare our invasion of Iraq with WWI or WWII, I'm sorry, I won't even dignify that with a response. Talk about apples and oranges.\n \n \nHonestly, I can't think of any one specifically, but we've all heard of the whacko decisions by activist judges around the country. I'm sure someone out there has some specific examples. :-D\n\n \n So let me get this straight, you don't really know about any specific decisions, you just know you're upset about something.", 
   {}, 
   63366, 
   null, 
   1093061700.0
  ], 
  [
   63382, 
   null, 
   "JPSartre12", 
   "I thank God too that the United States is unique :)\n \n However, how is the UN a 'decidedly Socialist organisation'?\n\n \n You're kidding, right? The UN has had communist and socialist leaders since its inception. The first Secretary General, Alger Hiss, was convicted of being a Soviet agent.\n All seven Secretary Generals and 15 Under Secretaries have been either communists or socialists according to one reference that I read.\n Barry Goldwater called for us to get out of the UN in the 60's and Reagan warned us about the UN in the 80's. It isn't a newly-discovered fact.\n \n Read the UN's Principles and tell me it isn't Socialist dogma:\n http://www.biblebelievers.org.au/srocke.htm", 
   {}, 
   63363, 
   null, 
   1093062600.0
  ], 
  [
   63386, 
   null, 
   "montalban", 
   "You're kidding, right? The UN has had communist and socialist leaders since its inception. The first Secretary General, Alger Hiss, was convicted of being a Soviet agent.\n All seven Secretary Generals and 15 Under Secretaries have been either communists or socialists according to one reference that I read.\n Barry Goldwater called for us to get out of the UN in the 60's and Reagan warned us about the UN in the 80's. It isn't a newly-discovered fact.\n \n Read the UN's Principles and tell me it isn't Socialist dogma:\n http://www.biblebelievers.org.au/srocke.htm\n\n \n No, I think you're kidding. It does indeed have left-wing members, but it also has right-wing members too. It has democratic members, and oligarchial members. It has members that are monarchies - so, by your logic (and I use the word here in the most loose of terms), the UN is a supporter of monarchies.", 
   {}, 
   63382, 
   null, 
   1093063080.0
  ], 
  [
   63409, 
   null, 
   "JPSartre12", 
   "No, I think you're kidding. It does indeed have left-wing members, but it also has right-wing members too. It has democratic members, and oligarchial members. It has members that are monarchies - so, by your logic (and I use the word here in the most loose of terms), the UN is a supporter of monarchies.\n\n \n We're not just talking about left-wing members, we're talking about ALL Secretary Generals. If every leader of an organization is a Commie or Socialist, it's a good bet that's the way the organization leans. \n emoticon_rolleyes", 
   {}, 
   63386, 
   null, 
   1093069860.0
  ], 
  [
   63413, 
   null, 
   "montalban", 
   "We're not just talking about left-wing members, we're talking about ALL Secretary Generals. If every leader of an organization is a Commie or Socialist, it's a good bet that's the way the organization leans. \n \n\n Even after changing the goal-posts, you're still wrong. Kurt Waldheim was a Nazi before being secretary-general\n http://www.commondreams.org/headlines03/0814-07.htm\n \n So which were commies...\n Trygve Lie (1896 - 1968)\n Dag Hammerskjöld (1905 - 1961)\n U Thant (1909 - 1974)\n Kurt - no not him, he was a Nazi\n \n How about anyone since Kurt Waldheim?\n \n I'd like to still see the evidences. I suspect you'll move the goal posts again.\n \n In case you don't know who they are; and I suspect you don't...\n http://www.un.org/News/ossg/sg/pages/formersgs.html", 
   {}, 
   63409, 
   null, 
   1093073700.0
  ], 
  [
   63424, 
   null, 
   "syklopps61", 
   "No, it has no rationale.\n\n \n It doesn't? They DO want to redistribute the wealth and increase social spending, national health care ring a bell? Don't tell me, you're FOR that, but against the drug prescription program, right? LOL\n \n \n \nIt had nothing to do with communism. It was about a country spending all their revenues on \"military\" hardware and personell. What return on investment do you achieve when a Tomahawk missile explodes? You've just flushed tax money down the drain. Do you think a Capitalist system can't go bankrupt? \n \n \n Well, their economy sucked, we can absorb that proportion better than they can. Besides, I'm not so sure we are spending the proportion of our GDP that the USSR did anyway. And yes, a capitalist system can go bankrupt. I'll answer YOUR question- military might buys us security. Now, I'll ask YOU AGAIN, what do social programs produce? Got quick feet there\n \n .\n \n \nThat's a reassuring response, and your worried about wasting money on the domestic poor. Sounds like you're already braced for the inevitable in Iraq and ready to spread more of that \"Conservative\" diplomacy around the world. By the way, since you don't plan on being in Iraq long term, you might want to tell our government to quit building military bases there.\n\n \n YOU BET SKIPPY, WELFARE IS A WASTE OF MONEY. And yes, the inevitable in iraq? They are animals and couldn't run a stable government of their lives depended on it-funny it does and they can't!!\n \n \nIf you want to compare our invasion of Iraq with WWI or WWII, I'm sorry, I won't even dignify that with a response. Talk about apples and oranges\n.\n \n Still with the quick feet? I wasn't comparing the nature of the wars, I'm talking about the fact that we spent money to rebuild two countries that involved us in a war that we did not want, and we STILL picked up the tab. Now, granted, we attacked Iraq, or rather resumed hostilities with Iraq, and now we are rebuilding there. SO, why is it a waste NOW and not then. Real simple question Ace\n \n \nSo let me get this straight, you don't really know about any specific decisions, you just know you're upset about something.\n\n\n \n Well, I don't have the quick feet you do, sorry. BUT, I DO have integrity and can admit when I don't have the information swimming around my skull, available in an instant, like you do. I swear, you really ought to try it sometime, I PROMISE it won't hurt. Well, maybe in YOUR case....", 
   {}, 
   63377, 
   null, 
   1093099500.0
  ], 
  [
   63474, 
   null, 
   "jskufan", 
   "Well, I don't have the quick feet you do, sorry. BUT, I DO have integrity and can admit when I don't have the information swimming around my skull, available in an instant, like you do. I swear, you really ought to try it sometime, I PROMISE it won't hurt. Well, maybe in YOUR case....\n\n \n Quick feet?, Skippy?, Ace???? Well I guess I should be glad you're not still beating the \"liberal\" drum. Anyway, this thread seems to have been reduced to you and I debating each other in a circular fashion so I think I might take a breather and give some of the other members a chance. Truthfully, if Bush and company hadn't gotten us into this mess in the Middle East, I'd probably be on the same side of most of these issues as you are.", 
   {}, 
   63424, 
   null, 
   1093124100.0
  ], 
  [
   63501, 
   null, 
   "Sigma", 
   "I personally love them no matter what. Reagan showed (stop wincing) that the decrease in taxes INCREASED the revenue. The spending to beef up the military after it was decemated by Carter increased the defecit, and later in his administration the defecit was drastically reduced as the economy was kicking into gear. I agree that Bush should be using the veto more frequently and the Congress should have some backbone and not even vote for the spending to begin with.\n\n \n It's insane to love them when getting them digs us deeper and deeper into a hole that will be damn hard to get out of. IMO of course. What Bush is doing is not helping the economy, surely you see that? A vast hole that is the Iraq War, rapidly sucking away our revenue (not to mention the various spending habits that Bush has), the decreased revenue... I'm sorry, \"Reganomics\" didn't work then and it certainly isn't working now.\n \n \n\n Well, the economy is bouncing back, so for the time being, yeah, I think it's something we can handle\n\n \n A big fat HA!\n \n \n\n I suppose I was wrong...what was it 2%, 4%? So, THAT many on the Left have principples, compared to what, 20% of Republicans that voted for Perot?\n\n \n Well, I don't have figures (and I somehow think yours are made up :p ) but there was a lot of talk about the split when Nader ran. IMO, more of the \"left\" have principles... the \"right\" only have their fanatic devotion to the party. That's \"blind loyalty\" not principles.\n \n \n\n Thank you for admitting the irrational hatred you have for him. What could he possibly have done that deserves this much hate? And PLEASE don't pull the lying BS, it won't fly\n\n \n Irrational? Hardly. I disagree majorly with his policy, find it inconcievable that people can still back him, find him irresponsible, and yes, he is a liar in my eyes. Lying by implication and omission is still lying to me. Clinton may have \"technically\" told the truth, but obviously he was lying by implication. Both intentionally misled the American people.\n \n Hatred? Not really. I disagree with pretty much everything he does and can't believe Americans are stupid enough to vote for him, but I don't hate the man. I am very much against him being our President :p\n \n \n\n Of course not, it's only the EVIL Conservatives LMAO\n\n \n I suppose. Can you point out a \"rabid\" liberal? Moore is certainly far left, but I find it hard to label him \"rabid\". He's really not irrational, and isn't even as offensive as you and other \"right-wingers\" I've seen on this board are. Whether or not he lied is really immaterial in these terms.", 
   {}, 
   63308, 
   null, 
   1093156800.0
  ], 
  [
   63534, 
   null, 
   "syklopps61", 
   "What Bush is doing is not helping the economy, surely you see that? A vast hole that is the Iraq War, rapidly sucking away our revenue (not to mention the various spending habits that Bush has), the decreased revenue... I'm sorry, \"Reganomics\" didn't work then and it certainly isn't working now.\n\n \n I know the truth is hard to face, especially when something good happens during a Republican administration, but the economy IS better. This hole national debt BS is only brought up by Liberals whenever it suits them. Ithink you all said the same exact thing under Reagan and the economy chugged along just fine. I've heard that experts around the world, those without an agenda that is, have attributed much to Reaganomics, but for those to admit that on the Left is tantamount to an admission that your entire belief system is and has been wrong, so I don't really expect you to be able to face the truth now. Furthermore, the amount being spent in Iraq is a drop in the bucket when you look at the entire budget-get real\n \n \nWell, I don't have figures (and I somehow think yours are made up :p ) but there was a lot of talk about the split when Nader ran. IMO, more of the \"left\" have principles... the \"right\" only have their fanatic devotion to the party. That's \"blind loyalty\" not principles.\n\n \n LMAO It's actually common sense really. Nader got HOW many percent of the vote in 2000, maybe 2-4 percent. I think it's REAL safe to say that he did not steal any of the Republicans who MIGHT have wanted to vote for Gore. Perot got how many percent, maybe 18-20 I believe. Perot, if I recall correctly, was coming across as a \"Conservative\", so how many DEMOCRATIC votes could he have taken (from those that WOULD have voted for BUSH)? I think a safe guess would be none, THEREFORE, seems to me that 20% of Republicans voted their conscince VS. mayb 4% of Democrats voting theirs in 2000. SO who is REALLY blindly fanatical?\n \n \n \nIrrational? Hardly. I disagree majorly with his policy, find it inconcievable that people can still back him, find him irresponsible, and yes, he is a liar in my eyes. Lying by implication and omission is still lying to me. Clinton may have \"technically\" told the truth, but obviously he was lying by implication. Both intentionally misled the American people.\n\n \n I'm talking psychotically irrational, you betcha. You all are so desperate to pin something, ANYTHING on Bush, you actually still think this Iraq thing was a lie on his part. If you had a child who several people said had done something that deserved punishment, and you took action based on those witnesses, you were relying on the information provided in order to decide what punishment to administer, If it turned out later that they were incorrect, would you consder yourself a liar for having punished the child? I realize not the greatest analogy, but the since the simple circumstances surrounding Bush are too difficult for you to understand, I had to try to simplify it for you.\n \n \nI suppose. Can you point out a \"rabid\" liberal? Moore is certainly far left, but I find it hard to label him \"rabid\". He's really not irrational, and isn't even as offensive as you and other \"right-wingers\" I've seen on this board are. Whether or not he lied is really immaterial in these terms.\n[/QUOTE]\n \n See, this proves without a doubt your fanaticism for your party. Take Moore, an absolutely disgusting excuse for a human being, as far left as you can possibly be, and yet you find ways to defend him and then try to portray me and other like-thinkers as being fanatical. We happen to support Bush, but not fanatically. Remember, Clinton's polls went up after he did NOTHING but get caught lying (a fact, remember?). Just based on people THINKING Bush lied, his polls have dropped. THAT does NOT reflect fanatical support", 
   {}, 
   63501, 
   null, 
   1093200420.0
  ], 
  [
   63538, 
   null, 
   "daewoo", 
   "I know the truth is hard to face, especially when something good happens during a Republican administration, but the economy IS better. This hole national debt BS is only brought up by Liberals whenever it suits them. Ithink you all said the same exact thing under Reagan and the economy chugged along just fine. I've heard that experts around the world, those without an agenda that is, have attributed much to Reaganomics, but for those to admit that on the Left is tantamount to an admission that your entire belief system is and has been wrong, so I don't really expect you to be able to face the truth now. Furthermore, the amount being spent in Iraq is a drop in the bucket when you look at the entire budget-get real\n\n \n The economy is still headed south from a practical standpoint, though I really don't think trying to pin it it on one party or the other is reasonable, it is the result of a long term trend which has seen the blessing of both democrats and republicans. \n \n The national deficit is a problem, especiually when you consider the roughly $44 trillion in unfunded federal obligations, which almost ensures the debt will continue to rise. I don't think this will become a major issue for another 3 or 4 years, though, when the middle class actually wakes up and realises that they have become the lower class.\n \n \n \n \nI'm talking psychotically irrational, you betcha. You all are so desperate to pin something, ANYTHING on Bush, you actually still think this Iraq thing was a lie on his part. If you had a child who several people said had done something that deserved punishment, and you took action based on those witnesses, you were relying on the information provided in order to decide what punishment to administer, If it turned out later that they were incorrect, would you consder yourself a liar for having punished the child? I realize not the greatest analogy, but the since the simple circumstances surrounding Bush are too difficult for you to understand, I had to try to simplify it for you.\n\n \n Personally, i don't think Buish lied about the situation in Iraq as far as WMD's went. I think he honestly believed they were there, despite the evidence to the contrary. It seems to me that we shoul;d still be seriously questioning his qualifications to lead the country, though. If he had waited another few weeks before begining mobilisation of our military, we would have had the final report of the UN inspection team. We also would not have allowed hundreds fo weapons that the UN inspectors had control over to disapear.\n \n To me, this is somewhat simimlar to the whole Clinton sex scandle. I don't really care if he got a hummer from his intern, I do care that he apparently did not have the common sense to deal with the situation without getting himself impeached. The lack of judgement was astounding.\n \n The same is true with Bush and the whole Iraq situation. We had inspectors on the gound doing their job and reporting that th Iraqis were cooperating. They asked for 2 more weeks to finish up their inspections. I think it shows an incredible lack of judgement on the part of the Bush administration to squander hundreds of billions of dollars of American taxpayer money, tie up our military (which frankly has better things to do) and polarise world opinion against us, without giving those guys the little bit of time they were asking for. \n \n \nSee, this proves without a doubt your fanaticism for your party. Take Moore, an absolutely disgusting excuse for a human being, as far left as you can possibly be, and yet you find ways to defend him and then try to portray me and other like-thinkers as being fanatical. We happen to support Bush, but not fanatically. Remember, Clinton's polls went up after he did NOTHING but get caught lying (a fact, remember?). Just based on people THINKING Bush lied, his polls have dropped. THAT does NOT reflect fanatical support\n\n \n I don't think the left fanatically supports their party, I think it is a fanatical hatred of the right that drives them. Too many views that are traditionaly leftist views simply make no sense from a logical standpoint for it to simply be a question of fanatical support of their own party. If you think about it, a lot of the \"leftists\" seem to hold the views they do not becuase they are well thought out and sensible, but merely because they are contrary to the views of the right.", 
   {}, 
   63534, 
   null, 
   1093205160.0
  ], 
  [
   63540, 
   null, 
   "Sigma", 
   "I know the truth is hard to face, especially when something good happens during a Republican administration, but the economy IS better. This hole national debt BS is only brought up by Liberals whenever it suits them. Ithink you all said the same exact thing under Reagan and the economy chugged along just fine. I've heard that experts around the world, those without an agenda that is, have attributed much to Reaganomics, but for those to admit that on the Left is tantamount to an admission that your entire belief system is and has been wrong, so I don't really expect you to be able to face the truth now. Furthermore, the amount being spent in Iraq is a drop in the bucket when you look at the entire budget-get real\n\n \n lol. \"National debt BS\". Ok...\n \n \n\n LMAO It's actually common sense really. Nader got HOW many percent of the vote in 2000, maybe 2-4 percent. I think it's REAL safe to say that he did not steal any of the Republicans who MIGHT have wanted to vote for Gore. Perot got how many percent, maybe 18-20 I believe. Perot, if I recall correctly, was coming across as a \"Conservative\", so how many DEMOCRATIC votes could he have taken (from those that WOULD have voted for BUSH)? I think a safe guess would be none, THEREFORE, seems to me that 20% of Republicans voted their conscince VS. mayb 4% of Democrats voting theirs in 2000. SO who is REALLY blindly fanatical?\n\n \n So you aren't going to prove your statistics?\n \n \n\n I'm talking psychotically irrational, you betcha. You all are so desperate to pin something, ANYTHING on Bush, you actually still think this Iraq thing was a lie on his part. If you had a child who several people said had done something that deserved punishment, and you took action based on those witnesses, you were relying on the information provided in order to decide what punishment to administer, If it turned out later that they were incorrect, would you consder yourself a liar for having punished the child? I realize not the greatest analogy, but the since the simple circumstances surrounding Bush are too difficult for you to understand, I had to try to simplify it for you.\n \n\n \n Ok, lets take your analogy. Some witnesses say that the child did something bad, some say he didn't do something bad (and yes there was information that he didn't have WMDs... Bush used the information that said he did). You didn't like this kid anyway, so you go to a mob and convince them to go and beat the **** out of this kid. Later it turns out that the kid didn't do what you said he did. Should you apologize for misleading all of these people? Or is it just an oops?\n \n \n\n See, this proves without a doubt your fanaticism for your party. Take Moore, an absolutely disgusting excuse for a human being, as far left as you can possibly be, and yet you find ways to defend him and then try to portray me and other like-thinkers as being fanatical. We happen to support Bush, but not fanatically. Remember, Clinton's polls went up after he did NOTHING but get caught lying (a fact, remember?). Just based on people THINKING Bush lied, his polls have dropped. THAT does NOT reflect fanatical support\n\n \n Whether or not he's disgusting is opinion. Whether or not he's wrong is immaterial. I happen to not agree with a lot he does. However, he is not so irrational that I label him \"rabid\". I find it easy to label you and others on this board \"rabid\" because of how offensive you come across and how little sense you show when in regards to evidence against Bush.", 
   {}, 
   63534, 
   null, 
   1093205820.0
  ], 
  [
   63544, 
   null, 
   "JPSartre12", 
   "Even after changing the goal-posts, you're still wrong. Kurt Waldheim was a Nazi before being secretary-general\n http://www.commondreams.org/headlines03/0814-07.htm\n \n So which were commies...\n Trygve Lie (1896 - 1968) [I]Prior to becoming Scretary General, he was the Labor Party leader in Norway. [/I]\n Dag Hammerskjöld (1905 - 1961)Don't know too much about him other than he was a Swede and Sweden is a very socialistic country. It's economics are schizophrenic. Capitalism with heavy dose of welfare.\n U Thant (1909 - 1974) from Burma, a country that has a strong governmental control of the economy \n Kurt - no not him, he was a Nazi - True.\n \n How about anyone since Kurt Waldheim?\n BOUTROS BOUTROS-GHALI\n \"Between 1949 and 1977, Mr. Boutros-Ghali was Professor of International Law and International Relations at Cairo University. From 1974 to 1977, he was a member of the Central Committee and Political Bureau of the Arab Socialist Union.\"\n The above quote is from YOUR REFERENCE\n \n Kofi Annan is a prime example of a Socialist. Just read his speech given at Notre Dame.\n http://www.freerepublic.com/forum/a3928723e655f.htm\n \n I'd like to still see the evidences. I suspect you'll move the goal posts again.\n \n Sorry to disappoint you. ;)\n \n In case you don't know who they are; and I suspect you don't...\n http://www.un.org/News/ossg/sg/pages/formersgs.html[/QUOTE]", 
   {}, 
   63413, 
   null, 
   1093208340.0
  ], 
  [
   63588, 
   null, 
   "Duo_Maxwell", 
   "NOW he's a nutjob! LOL\n\n \n Considering that those in the Republican party wish to discredit the real conservatives so that the public doesn't realize the party itself as a whole is rather liberal, it makes sense why you call him a nutjob. \n \n \nNot by raising taxes though, sorry, Reagan proved that (uh oh, living in the past again)\n\n \n Oversimplification. Reagan had a huge military buildup. Did you forgot that? \n \n \nAre you one of those that actually thinks one's record shouldn't be used to show something of the man?\n\n \n I think records are very important, but you won't when it comes to Bush's record. Bush has failed in every business venture he got into, only to be saved by another who took the fall for him. That's just the beginning. \n \n \nAre you comparing a Communist system with a Capitalist system? Seems to me to be apples and oranges\n\n \n the Soviet Union wasn't very Communist. In fact, this would hasn't seen true communism yet, the closest thing is pure altrusim, which works wonders on a small scale.", 
   {}, 
   63224, 
   null, 
   1093227540.0
  ], 
  [
   63598, 
   null, 
   "theLIBERTARIAN", 
   "Who is on the left? Who is conservative? With Bush&#8217;s prescription drug program, money for African Aids, money for Iraqi schools, and a huge deficit, would you consider him a conservative?", 
   {}, 
   63176, 
   null, 
   1093232340.0
  ], 
  [
   63601, 
   null, 
   "JPSartre12", 
   "..... I'm sorry, \"Reganomics\" didn't work then and it certainly isn't working now.\n \n\n Reaganomics did work. Unfortunately, when you have to appease an ultra-liberal Democratic Congress in order to rebuild a weakened defense, you create a deficit...in spite of doubling tax revenues. :( \n \n\n Well, I don't have figures (and I somehow think yours are made up :p ) but there was a lot of talk about the split when Nader ran. IMO, more of the \"left\" have principles... the \"right\" only have their fanatic devotion to the party. That's \"blind loyalty\" not principles.\n\n \n What \"principle\" were the Democrats in Congress upholding when they blindly supported Clinton by holding a solidarity lovefest on the Whitehouse lawn during his impeachment? What \"principle\" wewre they upholding when they defended Barney Frank who was using his pages? These must be \"principles\" that I'm not privy to being a true Conservative that doesn't rubberstamp any party. emoticon_confused", 
   {}, 
   63501, 
   null, 
   1093234980.0
  ], 
  [
   63607, 
   null, 
   "Sigma", 
   "\n What \"principle\" were the Democrats in Congress upholding when they blindly supported Clinton by holding a solidarity lovefest on the Whitehouse lawn during his impeachment? What \"principle\" wewre they upholding when they defended Barney Frank who was using his pages? These must be \"principles\" that I'm not privy to being a true Conservative that doesn't rubberstamp any party. emoticon_confused\n\n \n I said \"more\", not \"all\". Certainly, though, solidarity isn't a lack of principles. I'm not going to defend the Democratic Party, all I know is from my personal experience. IMO both parties are corrupt and don't work for anyone's benefit but their own, but most on the \"right\" that I meet still swear and die by the Republican Party.", 
   {}, 
   63601, 
   null, 
   1093238760.0
  ], 
  [
   63643, 
   null, 
   "JPSartre12", 
   "I said \"more\", not \"all\". Certainly, though, solidarity isn't a lack of principles. I'm not going to defend the Democratic Party, all I know is from my personal experience. IMO both parties are corrupt and don't work for anyone's benefit but their own, but most on the \"right\" that I meet still swear and die by the Republican Party.\n\n \n Here in Michigan, I've found the opposite. For example, in Detroit they rubberstamp every liberal Democrat that's put on the ticket. They kept a corrupt mayor in power for 20 years whose only claim to fame was stirring up suburb vs city animosity that cost Detroit $BILLIONS.\n Another example is the UAW. They are supporting Kerry despite te fact that, if passed, Kerry's new CAFE requirement would cost over a million UAW jobs and we'd lose the only profittable segment of the domestic auto market, namely trucks/SUVs, to the Japanese imports. Al Gore was a smilar, but even more vocal threat and they backed him as well. Now, THAT'S what I'd call blind loyalty.\n :xbanghead", 
   {}, 
   63607, 
   null, 
   1093277460.0
  ], 
  [
   63646, 
   null, 
   "Sigma", 
   "Here in Michigan, I've found the opposite. For example, in Detroit they rubberstamp every liberal Democrat that's put on the ticket. They kept a corrupt mayor in power for 20 years whose only claim to fame was stirring up suburb vs city animosity that cost Detroit $BILLIONS.\n Another example is the UAW. They are supporting Kerry despite te fact that, if passed, Kerry's new CAFE requirement would cost over a million UAW jobs and we'd lose the only profittable segment of the domestic auto market, namely trucks/SUVs, to the Japanese imports. Al Gore was a smilar, but even more vocal threat and they backed him as well. Now, THAT'S what I'd call blind loyalty.\n :xbanghead\n\n \n Perhaps, then, it is simply the area I live in, which does tend to be a conservative stronghold.\n \n Blind devotion to either party is asnine. Both parties do dirt to the other, and to Americans. We don't seem to notice or care, however. Just stupid.", 
   {}, 
   63643, 
   null, 
   1093279140.0
  ], 
  [
   63655, 
   null, 
   "sinjin", 
   "You can't get much farther right than I am and I've been out of the country many, many times. I always dread it, too, because no other country has the same flavor and characteristics of the US.\n\n \n I can only assume you are required to travel for other than recreation. Why else would you have been outside of the U.S. \"...many, many times\" and find it so unrewarding. I find the \"flavor\" of most of the U.S. to be that of white bread. Still I will probably always be most comfortable here as it is the land of my birth.", 
   {}, 
   63360, 
   null, 
   1093282020.0
  ], 
  [
   63680, 
   null, 
   "JPSartre12", 
   "I can only assume you are required to travel for other than recreation. Why else would you have been outside of the U.S. \"...many, many times\" and find it so unrewarding. I find the \"flavor\" of most of the U.S. to be that of white bread. Still I will probably always be most comfortable here as it is the land of my birth.\n\n \n You're assumption is correct. I'd never give France one dime of my own money if I had my way.\n As for the US, I've been in probably 2/3 of all of the states and like most of them.", 
   {}, 
   63655, 
   null, 
   1093291200.0
  ], 
  [
   63759, 
   null, 
   "syklopps61", 
   "So you aren't going to prove your statistics?\n\n \n If I'm not mistaken, those are roughly the percent of the vote that the two candidates received, what else is there to prove?\n \n \nOk, lets take your analogy. Some witnesses say that the child did something bad, some say he didn't do something bad (and yes there was information that he didn't have WMDs... Bush used the information that said he did). You didn't like this kid anyway, so you go to a mob and convince them to go and beat the **** out of this kid. Later it turns out that the kid didn't do what you said he did. Should you apologize for misleading all of these people? Or is it just an oops?\n\n \n Okay, so you have one or two kids that say one thing and 100 that say he's guilty...what would YOU do? I think you go with the preponderance of evidence, even IF some said the opposite (I don't know ALL the information Bush had, so I will not concede to you that he DID have information telling him otherwise)\n \n \nWhether or not he's disgusting is opinion. Whether or not he's wrong is immaterial. I happen to not agree with a lot he does. However, he is not so irrational that I label him \"rabid\". I find it easy to label you and others on this board \"rabid\" because of how offensive you come across and how little sense you show when in regards to evidence against Bush.\n[/QUOTE]\n \n This is really a sily statement on your part. I give you a name of someone who is a rabid Liberal/Democrat and because it doesn't suit YOUR definition, you dismiss it as opinion, YET, you say that I, and like-minded, are rabid with definitive statements based on what.....YOUR opinion?", 
   {}, 
   63540, 
   null, 
   1093313460.0
  ], 
  [
   63763, 
   null, 
   "syklopps61", 
   "Oversimplification. Reagan had a huge military buildup. Did you forgot that?\n \n \n Not at all, I've said that's a big reason why the deficit was as big as it was during his administration, thanks to Carter \n \n \n \n \nI think records are very important, but you won't when it comes to Bush's record. Bush has failed in every business venture he got into, only to be saved by another who took the fall for him. That's just the beginning. \n\n \n How many business ventures did Gates fail before he hit it big? Just because a business venture fails, does NOT mean someone is inept or has a \"bad record\". So, I'm not real sure how this has a THING to do with a public service voting record \n \n \nthe Soviet Union wasn't very Communist. In fact, this would hasn't seen true communism yet, the closest thing is pure altrusim, which works wonders on a small scale.\n[/QUOTE]\n \n LMAO, okay, so now we have degrees of Communism: VERY Communist, just a tad bit Communist, MAJORLY Communist...tell me, what is the highest degree of communism, very VERY?", 
   {}, 
   63588, 
   null, 
   1093313760.0
  ], 
  [
   63770, 
   null, 
   "Sigma", 
   "If I'm not mistaken, those are roughly the percent of the vote that the two candidates received, what else is there to prove?\n\n \n I was thinking along the lines of a source :P Yes, I am too lazy to look it up for myself, but I didn't make the statement.\n \n \n\n Okay, so you have one or two kids that say one thing and 100 that say he's guilty...what would YOU do? I think you go with the preponderance of evidence, even IF some said the opposite (I don't know ALL the information Bush had, so I will not concede to you that he DID have information telling him otherwise)\n \n\n \n I don't know all the evidence he had either :P But there was evidence that was flatly not listened to, and the UN inspection team was not given the 2 weeks they asked for to complete their reports. That is irresponsible.\n \n Frankly, even if all the evidence pointed to WMDs, the point is that he was wrong, and we paid for that mistake with over one thousand American lives. Bush should have apologized. The fact that he won't admit he was wrong and has instead shifted the focus to \"liberating Iraq\" really makes me not trust him. I dislike people who will not take responsibility for their mistakes.\n \n \n\n This is really a sily statement on your part. I give you a name of someone who is a rabid Liberal/Democrat and because it doesn't suit YOUR definition, you dismiss it as opinion, YET, you say that I, and like-minded, are rabid with definitive statements based on what.....YOUR opinion?\n\n \n Er, of course it's my opinion emoticon_confused I never meant to imply otherwise. My point is that you come across offensive and unreasonable, and so it is easy to label you \"rabid\". Moore comes across passionate and reasonable, even if he is wrong, therefore I do not label him \"rabid\".\n \n What was the name you gave me again? I probably didn't know much about him, which is why I didn't respond.", 
   {}, 
   63759, 
   null, 
   1093317420.0
  ], 
  [
   63774, 
   null, 
   "Duo_Maxwell", 
   "Not at all, I've said that's a big reason why the deficit was as big as it was during his administration, thanks to Carter\n\n \n So all the blame is on Carter I see? Figures, self responsibility isn't something practiced in modern republicanism. \n \n \n\n How many business ventures did Gates fail before he hit it big? Just because a business venture fails, does NOT mean someone is inept or has a \"bad record\". So, I'm not real sure how this has a THING to do with a public service voting record\n\n \n Gates didn't fail, at all in his business ventures. \n Here is a basic summary of his business.\n http://abcnews.go.com/reference/bios/gates.html\n Bush on the other hand hasn't had a successful business ventures yet. \n Here is a bunch of links you should read before making another stupid comment.\n www.wpkn.org/wpkn/news/btl032400.htm\n www.geocities.com/ambricol/bush_corruption_scandal.html \n dug.seattleactivist.org\n www.freep.com/voices/letters/ecorp16_20020716.htm courtingdisaster.blogspot.com/Chapter2.htm \n www.mikehersh.com/printer_No_Bush_No_911_No_War.shtml\n www.buzzle.com/editorials/text7-14-2002-22357.asp \n www.multinationalmonitor.org/mm2000/00march/wheat.html \n \n As for his voting record, you conviently ignore that, Bush, McCain, and Cheney all voted the same way Kerry did, as well as preach anti-military expansion stances throughout their political histories. \n \n \n\n LMAO, okay, so now we have degrees of Communism: VERY Communist, just a tad bit Communist, MAJORLY Communist...tell me, what is the highest degree of communism, very VERY?\n\n \n Explain to me how it's communist. Really, I doubt you even know what communism IS. Collective farms? Hardly. Polterian rule? Hardly. Anti-peasant stance? Slightly.", 
   {}, 
   63763, 
   null, 
   1093322220.0
  ], 
  [
   63788, 
   null, 
   "Duo_Maxwell", 
   "The inclusion of some of the items listed here is all the more ridiculous given that they were weapons systems that a previous Republican administration advocated eliminating. For example, it was Dick Cheney himself, in his capacity as Secretary of Defense under President George H.W. Bush, who testified before the House Armed Services Committee on 13 August 1989 that he had recommended cancelling the AH-64 Apache Helicopter program: \n \n Likewise, on 1 February 1992, Secretary of Defense Cheney complained to the Senate Armed Services Committee that he was being \"forced\" to spend money on unneeded weapons such as the M-1, the F-14, and the F-16: \n \n And President Bush noted in his 1992 State of the Union that he was phasing out several weapons systems, including the B-2, to \"reflect the changes of the new era\":\n \n http://www.snopes.com/politics/kerry/weapons.asp\n \n \nInhofe said McCain has supported base closings that could threaten South Carolina facilities, voted against technology improvements in the military and has a poor voting record in supporting military growth, according to the Center for Security Policy, a pro-military watchdog organization.\n\n \n Free Republic\n \n \nCheney Proposed Cutting Weapons Programs That Were Important to Success in Iraq. In 1990, Cheney proposed cutting 90 C-17 Air Force cargo transport planes and 14 B-52 bombers. Cheney also sought the retirement of two Navy battleships, two nuclear cruisers, and eight nuclear-powered attack submarines. In 1991, Cheney scrapped the Navy's A-12 Stealth attack plane, a fighter that was proclaimed to be a key part of the future of navy aviation in advanced stealth technology. [Newday, 2/5/91; NY Times, 1/8/91; Boston Globe, 4/27/90; Boston Globe, 1/30/90] \n \n ...\n \n THE CHENEY RECORD: Cheney Cut Program, Costing Jobs. Cheney plan cut 9 of original 25 ships planned, putting shipyard in jeopardy [States News Service, 8/14/90; Aviation Week and Space Technology, 9/24/90]\n \n ...\n \n THE CHENEY RECORD: Bush-Cheney Budget Terminated The Bradley. \"Major weapons killed include the Army's M-2 Bradley Fighting Vehicle, the Navy's Trident submarine and F-14 aircraft, and the Air Force's F-16 airplane. Cheney decided the military already has enough of these weapons.\" [Boston Globe, 2/5/91]\n \n \n C-17s and B-52s Vital to Operation Iraqi Freedom. According to Defense Daily, \"From January through mid-April C-17s in the Central Command's Middle East theater of operations conducted 2,600 missions, carrying more than 23,000 personnel, and more than 73 million pounds of cargo.\" An analysis by Anthony Cordesman at the Center for Strategic and International Studies showed that the Air Force B-1, B-2, and B-52 bombers dropped nearly two-thirds of the total bombs in the war. [Defense Daily, 5/21/03; Copley News Service, 7/3/03]\n[/quote]\n \n http://www.independentsforkerry.org/info/index.php?category_id=1272\n \n Voting records? Looks like Cheney and Bush are pretty anti- military expansion. More so then Kerry.", 
   {
    "post_info": {
     "post_title": "Lookie What I Found"
    }
   }, 
   63774, 
   null, 
   1093325400.0
  ], 
  [
   63853, 
   null, 
   "jim's trucking", 
   "The inclusion of some of the items listed here is all the more ridiculous given that they were weapons systems that a previous Republican administration advocated eliminating. For example, it was Dick Cheney himself, in his capacity as Secretary of Defense under President George H.W. Bush, who testified before the House Armed Services Committee on 13 August 1989 that he had recommended cancelling the AH-64 Apache Helicopter program: \n \n Likewise, on 1 February 1992, Secretary of Defense Cheney complained to the Senate Armed Services Committee that he was being \"forced\" to spend money on unneeded weapons such as the M-1, the F-14, and the F-16: \n \n And President Bush noted in his 1992 State of the Union that he was phasing out several weapons systems, including the B-2, to \"reflect the changes of the new era\":\n \n http://www.snopes.com/politics/kerry/weapons.asp\n \n \n \n Free Republic\n \n \n \n http://www.independentsforkerry.org/info/index.php?category_id=1272\n \n Voting records? Looks like Cheney and Bush are pretty anti- military expansion. More so then Kerry.\nI suppose that when the taser gun gets perfected and we need to phase out all the M-16s, you'll claim anybody that voted to do it is anti-military.\n \n Cheney easily recognizes when we have too many of some weapon...then he wants to cut it from the budget. It's that simple.", 
   {}, 
   63788, 
   null, 
   1093378500.0
  ], 
  [
   63868, 
   null, 
   "Waxy", 
   "I suppose that when the taser gun gets perfected and we need to phase out all the M-16s, you'll claim anybody that voted to do it is anti-military.\n \n Cheney easily recognizes when we have too many of some weapon...then he wants to cut it from the budget. It's that simple.\n\n \n :p :p\n \n Beautiful.\n \n Waxy", 
   {}, 
   63853, 
   null, 
   1093387620.0
  ], 
  [
   63886, 
   null, 
   "pnac=ww3", 
   "I think I saw a thread somewhere on this board that discussed Jim's Trucking's proclivity toward double standards. emoticon_xbye\n \n We haven't phased out one weapon that was on that list.\n \n I don't understand how Cheney could be talking this talk in 1992, but signed the PNAC statement in 1997.\n \n That wouldn't be a flip flop would it?\n \n (Excellent stuff, Duo_Maxwell!)", 
   {}, 
   63868, 
   null, 
   1093392000.0
  ], 
  [
   63916, 
   null, 
   "Duo_Maxwell", 
   "pnac=ww3: Jim's trucking is probably the biggest double standard user I have seen in a few years on boards. Considering I spent some time on a board filled with American hating Arabs, that's quite a consideration. It is totally okay for OBl to attack and murder civilians, but it is NOT okay for America to invade other countries because of WMD, and kill 10,000 civilians. And Jim is worse then they are. \n \n \nI suppose that when the taser gun gets perfected and we need to phase out all the M-16s, you'll claim anybody that voted to do it is anti-military.\n\n \n Bush and Cheney repetively tried to shut down, phase out and stop funding crucial parts of the military we need. YOU ARE A LIVING BREATHING DOUBLE STANDARD. I gave you a bunch of articles repetively showing Cheney's desire to cut funding and programs, I gave you the same for Bush. Yet you can't even apply the same attacks you use on Kerry for the SAME reasons to people you support who did the SAME things. It applies here but not here because I don't like him and I like her. Double standards. \n \n \nCheney easily recognizes when we have too many of some weapon...then he wants to cut it from the budget. It's that simple.\n\n \n And you cry foul when people try to spin Kerry. You're no better.", 
   {}, 
   63886, 
   null, 
   1093406940.0
  ], 
  [
   64109, 
   null, 
   "JPSartre12", 
   ".....\n Voting records? Looks like Cheney and Bush are pretty anti- military expansion. More so then Kerry.\n\n \n I'm sorry. Did I miss something? Is GW2 running for President or is his dad running as Cheney's VP? Who cares what GW1 voted in favor of or against, he isn't running. And Cheney was VP, not President last time I checked. If you want to look at THE CANDIDATE's military spending record, look at GW2's not his Dad's or mother's or uncle's. \n emoticon_confused emoticon_rolleyes \n \n \"Military spending would be boosted by 7 percent, but that does not include money needed to keep troops in Iraq and Afghanistan after the current $87.5 billion wartime supplemental runs out. Officials said a new supplemental will not be requested until 2005, after the November elections.\"\n http://www.cnn.com/2004/ALLPOLITICS/02/02/bush.budget.ap/\n \n \"U.S. Military Budget\n Site Last Modified: August 5, 2004\n \n The administration of President George W. Bush is requesting $399.1 billion for the military in fiscal year 2004 ($379.9 billion for the Defense Department and $19.3 billion for the nuclear weapons functions of the Department of Energy). This is $16.9 billion above current levels, an increase of 4.4 percent. In all, the administration plans to spend $2.7 TRILLION on the military over the next six years - and this as both the Office of Management and Budget and the Congressional Budget Office project a federal deficit as high as $200 billion to $300 billion next year.\n http://www.cdi.org/program/index.cfm?programid=15", 
   {
    "unicode_changes_made": true
   }, 
   63788, 
   null, 
   1093478220.0
  ], 
  [
   64128, 
   null, 
   "Duo_Maxwell", 
   "I'm sorry. Did I miss something? Is GW2 running for President or is his dad running as Cheney's VP? Who cares what GW1 voted in favor of or against, he isn't running. And Cheney was VP, not President last time I checked. If you want to look at THE CANDIDATE's military spending record, look at GW2's not his Dad's or mother's or uncle's.\n\n \n You people are ridiculous. You can attack Kerry for wanting to cut the military, but you ignore the fact that Bush AND Cheney wanted to do the same. It's a serious double standard how it is not okay for Kerry to want to cut, but it is TOTALLY okay for Cheney to want to cut litterally every program that was used to help win the war in Iraq. Bush supporters have RAGING double standards. \n \n \n\n \"Military spending would be boosted by 7 percent, but that does not include money needed to keep troops in Iraq and Afghanistan after the current $87.5 billion wartime supplemental runs out. Officials said a new supplemental will not be requested until 2005, after the November elections.\"\n http://www.cnn.com/2004/ALLPOLITICS/02/02/bush.budget.ap/\n \n\n \n All while Bush Jr seeks to backstab every vet and their famlies \n http://www.commondreams.org/views03/0328-11.htm\n http://www.veteransforpeace.org/bush_cuts_vet_benefits_041503.htm\n http://www.democrats.org/news/200306200002.html\n http://www.andrewtobias.com/newcolumns/030722.html\n www.pandagon.net/archives/00000981.htm \n dangerouscitizen.com/Opinions/793.aspx \n edworkforce.house.gov/democrats/militaryfamilydc.html \n abcnews.go.com/sections/wnt/AmericanFamily/militaryschools030224.html \n www.commondreams.org/headlines03/0814-02.htm \n www.sfgate.com/cgi-bin/article.cgi?file=/c/a/2003/08/14/MN94780.DTl", 
   {}, 
   64109, 
   null, 
   1093480020.0
  ], 
  [
   64141, 
   null, 
   "JPSartre12", 
   "You people are ridiculous. You can attack Kerry for wanting to cut the military, but you ignore the fact that Bush AND Cheney wanted to do the same. It's a serious double standard how it is not okay for Kerry to want to cut, but it is TOTALLY okay for Cheney to want to cut litterally every program that was used to help win the war in Iraq. Bush supporters have RAGING double standards. \n\n Again, since when was Cheney at the top of the GOP ticket?emoticon_confused \n \n \n\n All while Bush Jr seeks to backstab every vet and their famlies \n http://www.commondreams.org/views03/0328-11.htm\n http://www.veteransforpeace.org/bush_cuts_vet_benefits_041503.htm\n http://www.democrats.org/news/200306200002.html\n http://www.andrewtobias.com/newcolumns/030722.html\n www.pandagon.net/archives/00000981.htm \n dangerouscitizen.com/Opinions/793.aspx \n edworkforce.house.gov/democrats/militaryfamilydc.html \n abcnews.go.com/sections/wnt/AmericanFamily/militaryschools030224.html \n www.commondreams.org/headlines03/0814-02.htm \n www.sfgate.com/cgi-bin/article.cgi?file=/c/a/2003/08/14/MN94780.DTl\n\n \n Nice collection of unbiased sources there, Duo. emoticon_xgood \n \n http://www.dcmilitary.com/army/standard/7_25/national_news/20630-1.html\n http://usmilitary.about.com/library/milinfo/pay/bl2005enlbasepay.htm\n http://usmilitary.about.com/library/weekly/aa010502a.htm\n \n None of these say that GW2 has cut anybody's pay...quite the contrary. Where your Democratic buddys tried to pull the wool over people's eyes was when Daniels, IIRC, \"recommended\" some pay reductions. GW2 didn't act on those recommendations. You can verify that in the official record, not some Leftwing rag that only gives half of the story.\n It never fails to amaze me that Democrats will sink to any level and leave out key parts of a story whenever they attack GW. \n emoticon_xdonno", 
   {}, 
   64128, 
   null, 
   1093482120.0
  ], 
  [
   64170, 
   null, 
   "Duo_Maxwell", 
   "Again, since when was Cheney at the top of the GOP ticket?\n\n \n You really don't see the problem do you? \n \n \nNice collection of unbiased sources there, Duo.\n\n \n at least they are recent. Your's are 2 years old and out of date with the 2003 and 2004 budgets.", 
   {}, 
   64141, 
   null, 
   1093490160.0
  ], 
  [
   64369, 
   null, 
   "JPSartre12", 
   "You really don't see the problem do you? \n\n No, I don't. Daddy Bush isn't President any more so what he did or didn't do is irrelevant and Dick Cheney isn't President so it doesn't matter what he says. All you have to do is read the links and see the facts for yourself. \n \n\n at least they are recent. Your's are 2 years old and out of date with the 2003 and 2004 budgets.\n\n \n Maybe you aren't capable of reading; I overestimated your abilities, I guess. \n Either that or you'd better get those eyes checked. Link #2 was Fiscal Year 2005 \n http://usmilitary.about.com/library/milinfo/pay/bl2005enlbasepay.htm emoticon_rolleyes emoticon_wow", 
   {}, 
   64170, 
   null, 
   1093580640.0
  ], 
  [
   64393, 
   null, 
   "Duo_Maxwell", 
   "All you have to do is read the links and see the facts for yourself. \n\n \n Why is it that you let Cheney have a free ride but attack Kerry for the same issues? Are you telling me you have NEVER attacked ANY politican who has made bad decisions if they weren't running for president? \n \n Your second link is the 2nd time you've gotten something right. congrdulations. However, the rest of bush;s cuts are still facts until proevn otherwise.", 
   {}, 
   64369, 
   null, 
   1093601580.0
  ], 
  [
   64685, 
   null, 
   "JPSartre12", 
   "Why is it that you let Cheney have a free ride but attack Kerry for the same issues? Are you telling me you have NEVER attacked ANY politican who has made bad decisions if they weren't running for president? \n\n Good question. I'd say \"yes, I have\" but we are talking about Presidential candidates NOT VP's. If you'd like, I can attack Edwards as a high priced ambulance chaser. ...but he isn't running for President either. \n \n\n Your second link is the 2nd time you've gotten something right. congrdulations.\n\n Yet another left-handed compliment, eh Duo?\n ;)\n \n\n However, the rest of bush;s cuts are still facts until proevn otherwise.\n\n Are you talking about military cuts or cuts in general? If you're talking about military pay cuts, there aren't any. If you're talking about other cuts in spending, there probably aren't any of those either. emoticon_angry", 
   {}, 
   64393, 
   null, 
   1093763580.0
  ], 
  [
   64704, 
   null, 
   "Duo_Maxwell", 
   "Good question. I'd say \"yes, I have\" but we are talking about Presidential candidates NOT VP's.\n\n \n You've got some strange sense of consistancy. I don't care if you're running for president or not. To call one side anti-military and therefore as reason not to support them when many of your own high ranking officials did the same thing is hypocritical. \n \n \nYet another left-handed compliment, eh Duo?\n\n \n I give you credit where it is due. It's not my fault that it is not a common occurance. \n \n \nIf you're talking about other cuts in spending, there probably aren't any of those either.\n\n \n Like housing? How about education? Long term benefits? waiting for you to disprove those. As for cuts in spending, the Comache program has just bit the dust, but most of that money is going towards upkeeps of other combat helios.", 
   {}, 
   64685, 
   null, 
   1093768740.0
  ], 
  [
   64738, 
   null, 
   "JPSartre12", 
   "You've got some strange sense of consistancy. I don't care if you're running for president or not. To call one side anti-military and therefore as reason not to support them when many of your own high ranking officials did the same thing is hypocritical. \n\n \n Let's get back to the ebate. It was claimed that George Bush\n  cut the pay to soldiers. I proved that statement was false. You then countered with links to Cheney and GW, Sr's positions on cutting various defense programs. emoticon_confused \n If you want to know what GW2 does in terms of his military spending policy, you have to look at HIS position, not his father's or Cheney's.\n Conversely, if you want to look at the Democratic candidate's position, you have to check his record because his words are meaningless. Flipper changes his position to fit the audience, just like Clinton did. ;) \n \n\n I give you credit where it is due. It's not my fault that it is not a common occurance. \n\n In your opinion....and we all know what they say about opinions being like orifices. \n \n\n Like housing? How about education? Long term benefits? waiting for you to disprove those. As for cuts in spending, the Comache program has just bit the dust, but most of that money is going towards upkeeps of other combat helios.\n\n \n I'm confused again. Do you want me to tell you which housing, education and social programs he CUT? I wish I could, but he's increased at least two of them as far as I know. (I'm not familiar with any housing funding changes).\n If he did what I'd like, he'd have cut Federal Education programs to ZERO and NOT have created NCLB laws with Ted Kennedy and Senior Prescription Plan for whiteheads.", 
   {}, 
   64704, 
   null, 
   1093793640.0
  ], 
  [
   64853, 
   null, 
   "Duo_Maxwell", 
   "If you want to know what GW2 does in terms of his military spending policy, you have to look at HIS position, not his father's or Cheney's.\n\n \n I believe I have showed several links of Bush cutting housing, education and benefits. \n \n However, Cheney supported many of the cuts to the military Kerry did. That is irrefutable. \n \n \nI'm confused again. Do you want me to tell you which housing, education and social programs he CUT? I wish I could, but he's increased at least two of them as far as I know.\n\n \n My links said he didn't increase, but cut funding for military education, military housing, and military benefits. Not to mention screwing the NG in virtually every fashion. \n \n \nIf he did what I'd like, he'd have cut Federal Education programs to ZERO and NOT have created NCLB laws with Ted Kennedy and Senior Prescription Plan for whiteheads.\n\n \n Well, I guess we'll be dependent upon Japan for technological breakthrought if we do that. We are arleady slipping in science witihin America's learning systems. Scientific technological superority has been the key to American sucess since WWII. I'd hate to see that go. Losing federal funds for scientific education endevours will result in the loss of science-minded students, who are the future of America. That and education at universities will skyrocket reducing the number of students who can go to college, reducing the education of the overall workforce, and well, you can figure out where that goes. Except for those two reasons, feds should stay out of education.", 
   {}, 
   64738, 
   null, 
   1093845900.0
  ], 
  [
   64924, 
   null, 
   "JPSartre12", 
   "I believe I have showed several links of Bush cutting housing, education and benefits. \n\n I WISH that was the case.\n \n\n However, Cheney supported many of the cuts to the military Kerry did. That is irrefutable. \n\n Are you going to claim that Cheney's voting record is similar to Kerry's? I'd like to see that one. Or are you saying that, on occasion, Cheney also thought that a particular weapon system shouldn't be funded?\n \n\n My links said he didn't increase, but cut funding for military education, military housing, and military benefits. Not to mention screwing the NG in virtually every fashion. \n\n How many times do I have to post the facts to rebut your claims? \n http://usmilitary.about.com/library/milinfo/pay/bl2005enlbasepay.htm\n http://www.spacewar.com/2004/040805145343.r543e7cz.html\n For example:\n \n\n Another substantial chunk of Bush's buildup has gone toward higher salary, health care and retirement costs associated with sustaining a fully professional, family-oriented military. This, too, contrasts with Reagan's spending increase, much of which went to buying fleets of tanks, helicopters, aircraft and other military equipment\n http://www.tdn.com/articles/2004/03/08/nation_world/news02.prt\n\n \n You'd think that being wrong twice recently and having to eat crow would make it less palatable to you, but obviously, you've acquired a taste for it. ;)\n \n\n Well, I guess we'll be dependent upon Japan for technological breakthrought if we do that. We are arleady slipping in science witihin America's learning systems. Scientific technological superority has been the key to American sucess since WWII. I'd hate to see that go. Losing federal funds for scientific education endevours will result in the loss of science-minded students, who are the future of America. That and education at universities will skyrocket reducing the number of students who can go to college, reducing the education of the overall workforce, and well, you can figure out where that goes. Except for those two reasons, feds should stay out of education.\n\n The only areas of research that Uncle Sam should be supporting are drugs and military weapons , which doesn't fall in the normal realm of \"education\". The rest should be funded by individual states, counties, companies and individuals.", 
   {}, 
   64853, 
   null, 
   1093892580.0
  ], 
  [
   64957, 
   null, 
   "kickin50", 
   "Another substantial chunk of Bush's buildup has gone toward higher salary, health care and retirement costs associated with sustaining a fully professional, family-oriented military.\n\n \n family-oriented... Tell that to my nephew who missed the birth of his 2nd child and may miss the birth of his 3rd. Obviously he came home for a while. emoticon_smile \n \n To the original question: Is the left babies? I'm not. In fact, I think I'm pretty tough. I'm tough enough to say that I refuse to vote for GWB because I'm afraid of OBL. Where does GWB rank best in the polls? The question: who can fight terrorism best? He's winning with the chickens. The right, evidently, is terrorized. And those chickens have decided, that GWB is more likely to bomb something. Maybe they're right. Maybe they're wrong. No matter who pulls the trigger, bombing something doesn't equate to safety.\n \n By the way, will somebody please define the war on terrorism to me. I'm a little unclear on what that is, exactly. I think it's just a temperature taking of how terrorized we are. If our terror level goes down, we must be winning the war on terrorism. This is a war we're fighting in our own heads.\n \n GWB had better not win the war on terrorism too soon. Then, what would he run on.", 
   {}, 
   64924, 
   null, 
   1093903920.0
  ], 
  [
   64965, 
   null, 
   "Duo_Maxwell", 
   "\n Are you going to claim that Cheney's voting record is similar to Kerry's? I'd like to see that one. Or are you saying that, on occasion, Cheney also thought that a particular weapon system shouldn't be funded?\n\n \n Cheney has wanted to cut programs and cut funding for numerous programs, including the Apache, F-14, F-15 and F-16. It's all in the Snopes. \n \n The links only show military pay, missile defense and Iraq-Afghanistan. They don't talk about that Bush has cut military education funds, military benefits and military housing funds (exception, but it doesn't talk about that Bush has cutting money for building military housing). You talk big but can't put up most of the time. You outta read the links you post for once.\n \n \n\n You'd think that being wrong twice recently and having to eat crow would make it less palatable to you, but obviously, you've acquired a taste for it. ;)\n\n \n That is a problem you didn't mention. While CONGRESS, NOT BUSH, has increased spending for military healthcare, their increases are lower then average, while a estimated 120,000 new veterns are using these funds. In a sense, they have actually CUT the amount of money avaliable to each vetern and their family. So in reality, each vetern and their family have less money avaliable to them then before. I'd like to see you wiggle your way out of THAT. \n \n \nThe only areas of research that Uncle Sam should be supporting are drugs and military weapons , which doesn't fall in the normal realm of \"education\". \n\n \n Yes it does. Without a fresh batch of new students interested in science, we WILL be left behind. We will be forced to import scientists, pay money to educate them, and watch them return to their home countries. Science starts at the very early level. Many students are truned off to science due to the lack of enthusasim from poorely paid and poorely funded teachers. Science is the foundation upon which this country spreads it's influence, without it we will fall behind. You cannot simply BUY scientists, you must get them on the track from their early days in elementary.", 
   {}, 
   64924, 
   null, 
   1093904940.0
  ], 
  [
   65002, 
   null, 
   "JPSartre12", 
   "Cheney has wanted to cut programs and cut funding for numerous programs, including the Apache, F-14, F-15 and F-16. It's all in the Snopes. \n\n And for the umpteenth time, Cheney isn't running for President. What HE did is irrelevant!\n \n\n The links only show military pay, missile defense and Iraq-Afghanistan. They don't talk about that Bush has cut military education funds, military benefits and military housing funds (exception, but it doesn't talk about that Bush has cutting money for building military housing). You talk big but can't put up most of the time. You outta read the links you post for once.\n \n\n ??? From my link:\n \"In addition to the 3.5 percent raise in basic pay, both committees also approved raising BAH (Basic Allowance for Housing) to the point where it will pay 100 percent of the average housing costs. This concludes DOD's five-year plan to completely eliminate out-of-pocket housing expenses by FY 2005 (average out-of-pocket housing expenses in FY 2004 is 3.5 percent).\n \n This is the first time in five years that Congress will not \"target\" the pay raise by giving some ranks a higher raise percentage than other ranks. In FY 2004, the average pay raise was 4.1 percent, but some members received as little as 3.7 percent, while others received as much as 6.25 percent. In 2005, all members will receive a base pay raise of 3.5 percent.\n \n This is the sixth consecutive year that Congress will approve a pay raise larger than the level of private sector pay raises. Once implemented, this raise is expected to decrease the \"pay gap\" from 5.5 percent to 5.1 percent. \"\n \n What part of that is can't you comprehend? They have attempted to reduce out-of-pocket housing costs to ZERO, CIPHER, NADDA, ZILCH, OUGHT, NAUGHT, ZIP. \n \n\n That is a problem you didn't mention. While CONGRESS, NOT BUSH, has increased spending for military healthcare, their increases are lower then average, while a estimated 120,000 new veterns are using these funds. In a sense, they have actually CUT the amount of money avaliable to each vetern and their family. So in reality, each vetern and their family have less money avaliable to them then before. I'd like to see you wiggle your way out of THAT. \n\n Again with the Democratic bookkeeping tactic. Just because the RATE OF INCREASE is lower doesn't make it a CUT. If you think that you're getting a 10% raise but your boss actually gives you a 5% raise, did you get a salary cut? NO, you still got an increase.\n \n\n Yes it does. Without a fresh batch of new students interested in science, we WILL be left behind. We will be forced to import scientists, pay money to educate them, and watch them return to their home countries. Science starts at the very early level. Many students are truned off to science due to the lack of enthusasim from poorely paid and poorely funded teachers. Science is the foundation upon which this country spreads it's influence, without it we will fall behind. You cannot simply BUY scientists, you must get them on the track from their early days in elementary.\n\n \n Obviously you haven't been paying attention. We import scientists TODAY because too many young kids prefer to take the easy way out and major in Liberal Arts instead of science. Before we can produce more US scientists, we have to get more US students to enter scientific undergrad programs, on that we agree, but Federal funding doesn't have anything to do with that. And we don't have to worry about too many of the foreign scientists returning home. The pay for scientists in the US is much higher than it is in their homelands and jobs are easier to obtain, especially if they don't have to compete with entry-level American scientists coming out of school.", 
   {}, 
   64965, 
   null, 
   1093914480.0
  ], 
  [
   65191, 
   null, 
   "Duo_Maxwell", 
   "And for the umpteenth time, Cheney isn't running for President. What HE did is irrelevant!\n\n \n But you DID say this:\n \n \nOr are you saying that, on occasion, Cheney also thought that a particular weapon system shouldn't be funded?\n\n \n Yes, on MANY occasions Cheney thought many particular weapons systems shouldn't be funded.\n \n \n\n ??? From my link:\n \"In addition to the 3.5 percent raise in basic pay, both committees also approved raising BAH (Basic Allowance for Housing) to the point where it will pay 100 percent of the average housing costs. This concludes DOD's five-year plan to completely eliminate out-of-pocket housing expenses by FY 2005 (average out-of-pocket housing expenses in FY 2004 is 3.5 percent).\n\n \n That assumes they are actually increasing funds to build more military housing, which is not true. BAH doesn't state anything about increasing the number of houses for the military, but simply that it will pay average costs, which in reality is a shaft for a signifcent amount of US troops. The cost to live in say, Texas, is significently less then that of Hawaii, yet the US troops in Hawaii (which is above 50,000) will be forced to pay for the rest. So in reality, a bunch of US troops are getting the shaft by dear ol' Bush. \n \n I conceded the pay rase. \n \n \n\n What part of that is can't you comprehend? They have attempted to reduce out-of-pocket housing costs to ZERO, CIPHER, NADDA, ZILCH, OUGHT, NAUGHT, ZIP.\n\n \n Read above. \n \n \n\n Again with the Democratic bookkeeping tactic. Just because the RATE OF INCREASE is lower doesn't make it a CUT. If you think that you're getting a 10% raise but your boss actually gives you a 5% raise, did you get a salary cut? NO, you still got an increase.\n\n \n Actually it does. With the increase of roughly 120,000 new veterans, and a serious decrease with average raise, military veterans who were recieving benefits, actually recieve LESS money then they did before. Also, with the rising costs of healthcare, the amount they formerly recieved has been cut significently in terms of buying power. 50 people recieved 5,000 a month. Now 70 people are now recieving 3,500 a month. All while the buying power of the dollars has dropped in terms of benefits. What do you call a drop in the amount of money previously avaliable to you? A CUT in funds. \n \n \n\n Obviously you haven't been paying attention. We import scientists TODAY because too many young kids prefer to take the easy way out and major in Liberal Arts instead of science.\n\n \n Exaclty WHY we need to expand funding for science. As I said before, and obviously you weren't paying attention, the US is slipping in scientific domiance BECAUSE of this lack of interests in science. \n \n \nBefore we can produce more US scientists, we have to get more US students to enter scientific undergrad programs, on that we agree, but Federal funding doesn't have anything to do with that.\n\n \n With the majority of states in the red, who else is going to do it? After all, Republican governers are in Power, and we all know how they mix with Science. Heck, Bush as President has been mangaling and ignoring science since day 1. \n \n \nAnd we don't have to worry about too many of the foreign scientists returning home.\n\n \n But they are. India has seen a large return in the number of US trained scientists. There is a reason besides US investment that India is threatening Silicon Valley. Israel also owes much of it's non-stolen technology from Us trained Israeli scientists. \n \n \n\n The pay for scientists in the US is much higher than it is in their homelands and jobs are easier to obtain, especially if they don't have to compete with entry-level American scientists coming out of school.\n\n \n That's not necessarily true at this moment, and it is also quite ignorant. India again is paying it's scientists comparable amounts when you place the currency values together corresponding to their buying power. Indian scienists can litterally buy whatever they want in their homelands and are deeply respected. That's not true in America. It's even better in India, with currently weak science schools, the competition is next to nothing.", 
   {}, 
   65002, 
   null, 
   1094018400.0
  ], 
  [
   65396, 
   null, 
   "JPSartre12", 
   "...\n Yes, on MANY occasions Cheney thought many particular weapons systems shouldn't be funded.\n\n \n OK, so Cheney didn't rubberstamp every weapons appropriations bill. It still doesn't change the fact that he AIN'T running for President. emoticon_rolleyes \n \n\n That assumes they are actually increasing funds to build more military housing, which is not true. BAH doesn't state anything about increasing the number of houses for the military, but simply that it will pay average costs, which in reality is a shaft for a signifcent amount of US troops. The cost to live in say, Texas, is significently less then that of Hawaii, yet the US troops in Hawaii (which is above 50,000) will be forced to pay for the rest. So in reality, a bunch of US troops are getting the shaft by dear ol' Bush. \n\n What the article said was that the out of pocket costs to most servicemen for housing would be ZERO. How, if someone stationed in Hawaii, living off-base has to shuck out a few bucks to live there, I'm cool with that. Most people pay a lot to live in Hawaii. ;)\n \n\n I conceded the pay rase. \n\n Score one for the good guys. :)\n \n\n Actually it does. With the increase of roughly 120,000 new veterans, and a serious decrease with average raise, military veterans who were recieving benefits, actually recieve LESS money then they did before. Also, with the rising costs of healthcare, the amount they formerly recieved has been cut significently in terms of buying power. 50 people recieved 5,000 a month. Now 70 people are now recieving 3,500 a month. All while the buying power of the dollars has dropped in terms of benefits. What do you call a drop in the amount of money previously avaliable to you? A CUT in funds.\n\n A reduction in INCREASE isn't a decrease. Only a blind bookkeeper can't see that. As for buying power, we are all suffering under the rising costs of healthcare. That's a fact of life.\n \n\n Exaclty WHY we need to expand funding for science. As I said before, and obviously you weren't paying attention, the US is slipping in scientific domiance BECAUSE of this lack of interests in science.\n\n And maybe Uncle Sam shouldn't be in the R&D business other than Defense?\n \n\n With the majority of states in the red, who else is going to do it? After all, Republican governers are in Power, and we all know how they mix with Science. Heck, Bush as President has been mangaling and ignoring science since day 1. \n\n \n Oh really? So now the bad Republican governmors are anti-science?! If they're so pro-business as Liberals claim and business is very pro-science, then how can epublicans be both pro-business and anti-science. ..Error...Error...Does not compute....does not compute\n And if Bush allocated $1Billion for development of a H2 powered car, can you REALLY say with a straight face that GW is anti-science? emoticon_confused \n \n\n But they are. India has seen a large return in the number of US trained scientists. There is a reason besides US investment that India is threatening Silicon Valley. Israel also owes much of it's non-stolen technology from Us trained Israeli scientists. \n\n The reason that they returned home is because INS doesn't want productive foreigners with skills competing with Americans for good jobs. The liberals only want poor illegal aliens immigrating because they will typically vote Democratic and not compete with Americans for the better-paying jobs.\n \n\n That's not necessarily true at this moment, and it is also quite ignorant. India again is paying it's scientists comparable amounts when you place the currency values together corresponding to their buying power. Indian scienists can litterally buy whatever they want in their homelands and are deeply respected. That's not true in America. It's even better in India, with currently weak science schools, the competition is next to nothing.\n\n \n You only speak about India. In my area, Chemistry, the threat comes from Eastern Europe. There, you can have 10 PhD chemists working for less that we pay one US PhD...and more companies are going that route every day to do their basic research....and part of the attraction is the number of available scientists and their ability to work in conjunction with local universities.", 
   {}, 
   65191, 
   null, 
   1094170920.0
  ], 
  [
   65401, 
   null, 
   "Duo_Maxwell", 
   "OK, so Cheney didn't rubberstamp every weapons appropriations bill. It still doesn't change the fact that he AIN'T running for President. emoticon_rolleyes\n\n \n Cheney has spoken out aganist many defense bills, even more hypocritical was his reading of Kerry's votes aganist these bills, many of which he wanted cut himself! This adminstration's hypocracy knows no bounds. \n \n \n\n What the article said was that the out of pocket costs to most servicemen for housing would be ZERO. How, if someone stationed in Hawaii, living off-base has to shuck out a few bucks to live there, I'm cool with that. Most people pay a lot to live in Hawaii. ;)\n\n \n Average costs and it doesn't talk about increasing housing, which is the most important issue. \n \n \n\n Score one for the good guys. :)\n\n \n Good guys? How about dillusional? \n \n \n\n A reduction in INCREASE isn't a decrease. Only a blind bookkeeper can't see that. As for buying power, we are all suffering under the rising costs of healthcare. That's a fact of life.\n\n \n Um, a reduction in increase is a decrease. Vets are suffering from a cut in overall funds avaliable to them by the Bush adminstration. You CAN'T refute that one. Their inability to properly increase funds to match the rise of dependent vets is a slap in the face of every veteran. \n \n \n\n And maybe Uncle Sam shouldn't be in the R&D business other than Defense?\n \n\n \n Perhaps. But many non-military advances make their way into stragetic defenses. \n \n \n\n Oh really? So now the bad Republican governmors are anti-science?!\n\n \n No, but that most of the states that are in the red have republican governers. \n \n \nIf they're so pro-business as Liberals claim and business is very pro-science, then how can epublicans be both pro-business and anti-science.\n\n \n Pro busines is not necessarily pro science. Chemical and industrial groups have been distorting science so that their waste products and those consequences are made public. Bush has ignored the science behind global warming, which is part is due to energy and chemical industies desire to get out from under the heel of what was formerly a enviromental watch agency designed to protect America's enviromental health: the EPA. Business in selectively pro-science when it comes to the bottom line. There is a reason Bush put many former chemical CEOs on groups designed to write envriomental legislation: distort and ignore science for their own profits. \n \n \n..Error...Error...Does not compute....does not compute\n And if Bush allocated $1Billion for development of a H2 powered car, can you REALLY say with a straight face that GW is anti-science? emoticon_confused\n\n \n You obviously live in a tiny box. Bush did allocate that money, but he did support a lawsuit aganist California to slow the production and use of Hybrid cars. Explain that. Bush is anti-science. Here's a report that you are probablying either going to attempt the fallacy of poisiong the well or simply going it ignore. \n \n \nHowever, at a time when one might expect the federal government to increasingly rely on impartial researchers for the critical role they play in gathering and analyzing specialized data, there are numerous indications that the opposite is occurring. A growing number of scientists, policy makers, and technical specialists both inside and outside the government allege that the Bush administration has suppressed or distorted the scientific analyses of federal agencies to bring these results in line with administration policy. In addition, these experts contend that irregularities in the appointment of scientific advisors and advisory panels are threatening to upset the legally mandated balance of these bodies.\n\n http://www.ucsusa.org/global_environment/rsi/page.cfm?pageID=1322\n \n \n\n The reason that they returned home is because INS doesn't want productive foreigners with skills competing with Americans for good jobs. The liberals only want poor illegal aliens immigrating because they will typically vote Democratic and not compete with Americans for the better-paying jobs.\n\n \n That's horse **** and you know it. We train them, and then they return to a society that praises them and drops loads of cash on their doorsteps. Think about it, if you could get a US education, then return home and make comparative twice as much and be respected and revered, would you do it? \n \n \n\n You only speak about India. In my area, Chemistry, the threat comes from Eastern Europe. There, you can have 10 PhD chemists working for less that we pay one US PhD...and more companies are going that route every day to do their basic research....and part of the attraction is the number of available scientists and their ability to work in conjunction with local universities.\n\n \n But you, like usually, ignore the differences in cost of living, as well as the currency conversion rate, which makes life significently different and derails your arguments.", 
   {}, 
   65396, 
   null, 
   1094174880.0
  ], 
  [
   65709, 
   null, 
   "JPSartre12", 
   "Cheney has spoken out aganist many defense bills, even more hypocritical was his reading of Kerry's votes aganist these bills, many of which he wanted cut himself! This adminstration's hypocracy knows no bounds.\n\n Cheney's position on the issue is irrelevent. HE ISN\"T RUNNING FOR PRESIDENT! Do you think that Clinton and Gore agreed on EVERY issue when Gore was in the Senate and Clinton was in Arkansas? No, so stop comparing apples and oranges. KERRY voted against most of the defense bills and KERRY IS running for President.\n \n\n Average costs and it doesn't talk about increasing housing, which is the most important issue. \n\n If you need to argue nuances in military housing policy to find an area that the President might not have an advantage on, then you're really scraping the bottom of the issues barrel. To me, stating that the majority of servicmen will have zero out-of-pocket costs is good enough. I don't really think it'd be earthshattering if some navy serviceman in Hawaii has to kick in a few bucks for his prime location. emoticon_rolleyes \n \n\n Um, a reduction in increase is a decrease. Vets are suffering from a cut in overall funds avaliable to them by the Bush adminstration. You CAN'T refute that one. Their inability to properly increase funds to match the rise of dependent vets is a slap in the face of every veteran. \n\n How can they be \"suffering from a cut in overall funds\" if you agree that the funds are INCREASING? Only Democrats would see an increase in spending as a decrease. emoticon_confused \n [quote]\n Perhaps. But many non-military advances make their way into stragetic defenses. [/quote}\n And that's a problem because............?\n \n\n No, but that most of the states that are in the red have republican governers. \n \n\n Got any proof? I'm in Michigan with a Democratic governor and we're in the red, so you can forget about my state supporting your assertion. California was way into the red before Arnold under a Democratic governor, so you can forget CA. \n Here, maybe this will help you:\n http://www.cbpp.org/12-23-02sfp.htm\n \n\n Pro busines is not necessarily pro science. Chemical and industrial groups have been distorting science so that their waste products and those consequences are made public. Bush has ignored the science behind global warming, which is part is due to energy and chemical industies desire to get out from under the heel of what was formerly a enviromental watch agency designed to protect America's enviromental health: the EPA. Business in selectively pro-science when it comes to the bottom line. There is a reason Bush put many former chemical CEOs on groups designed to write envriomental legislation: distort and ignore science for their own profits. \n\n Now THAT'S one of your funniest paragraphs yet. You have swallowed every liberal BS argument under the sun, I see. Global warming, bad polluters, chemical CEO conspiracies, yadda, yadda, yadda. \n Have you ever watched Stone Phillip's special on Scaring America to Death? If not, I would recommend watching it. In it, they calculated the net effects of all of the environmental regulations as an increase in the average life expectancy as well as look at other factors that have a negative impact on life expectancy using cost/benefit anayysis techniques and found that all of the environmental regulations imposed to date may have increased the average life expectancy by a few days, IIRC. If ended poverty instead, we would increase the life expectancy by 7.5 YEARS. I wish I could find a transcript from the program. It was very enlightening. Perhaps it's in his new book.\n [quote]\n You obviously live in a tiny box. Bush did allocate that money, but he did support a lawsuit aganist California to slow the production and use of Hybrid cars. Explain that. Bush is anti-science. Here's a report that you are probablying either going to attempt the fallacy of poisiong the well or simply going it ignore. \n \n \n http://www.ucsusa.org/global_environment/rsi/page.cfm?pageID=1322\n [quote]\n Their board reads like a who's who in leftwing science. ;)\n \n http://www.ucsusa.org/ucs/about/page.cfm?pageID=769\n Oh boy, here's one of their more credible members, Martin Sheen. \n http://www.ucsusa.org/ucs/members/page.cfm?pageID=1016\n \n\n That's horse **** and you know it. We train them, and then they return to a society that praises them and drops loads of cash on their doorsteps. Think about it, if you could get a US education, then return home and make comparative twice as much and be respected and revered, would you do it? \n\n I love it. You have absolutely ZERO idea of what you are saying. I work with Indian Middle Eastern, and Asian engineers daily. I visit many Indian, Middle Eastern and Asian engineers working at the Big Three's engineering facilities all of the time. One of the reasons that Dearborne has the highest concentration of Middle Easterners outside of the Middle East is because many of them work in the auto industry as engineers and in other professional capacities. You can't find an American doctor without looking real hard because most of them in the area are Asian or Indian. Don't believe me? Do a search on physicians in the SE Michigan area. It reads like a New Dehli phonebook.\n The first chemist that I trained under right out of school was Indian. He even went back to India for a while after being layed off at another company, only to return to the US once again. Why? Because the bucks and opportunities to make a good life are in the US, NOT India.\n \n\n But you, like usually, ignore the differences in cost of living, as well as the currency conversion rate, which makes life significently different and derails your arguments.\n\n \n The cost of living, huh? How much cheaper is a comparable car in the Ukraine vs one in the US? For that matter, what's the cost of a comparable car in China? The cost of living difference argument falls flat on its face when you're buying international goods like cars, Nikes, Levis. \n In the Ukraine, 29% live below the poverty line and 3% live in extreme poverty.\n http://www.bsec-business.org/country_inf.asp?category=11\n \n\n As a consequence of the shortcomings of economic reform and a deep economic crisis generated by the fall of the eastern markets and the low capacity of adaptation to a competitive economic environment, the years following the start of economic and political transition wittnessed a sharp decrease in the living standards, both in Ukraine and Romania. In fact, given the huge proportions of this phenomenon, it is adequate to speak not just about the expansion of social marginality, but also about an en mass pauperisation, which affects the life standards of the majority of population.\n \n The fall of production and of markets had a negative effect on the real income of the population. In Transcarpathian Ukraine the average income is even below the country's average (monthly 161.3 hrivnya - about 40 USD). The income pro capita is 49.0 hrivnya (13 USD), while the official amount of the subsistence wage is 91 hrivnya. They bring the food either from Hungary or from Slovakia in the private shops and markets (1 kg. pork is about 2-3 USD, 1 liter milk 20 cents, 1 liter oil 1 USD). \n http://www.policy.hu/szilagyi/respaper1.htm\n \n\n \n Next time you want to argue, bring some facts.", 
   {
    "unicode_changes_made": true
   }, 
   65401, 
   null, 
   1094412900.0
  ], 
  [
   65763, 
   null, 
   "Duo_Maxwell", 
   "Cheney's position on the issue is irrelevent. HE ISN\"T RUNNING FOR PRESIDENT! Do you think that Clinton and Gore agreed on EVERY issue when Gore was in the Senate and Clinton was in Arkansas? No, so stop comparing apples and oranges. KERRY voted against most of the defense bills and KERRY IS running for President.\n\n \n It's even more relevenat after Cheney's speech in which he derided Kerry for voting aganist many of the weapons that won the cold war, weapons he himself was aganist. How can a vice president, who has the polential to be a president deride a candidate who he shared numerous views with, as not being a good candidate because of? That's hypocritical and you aren't comment at all about that. Cheney can attack Kerry for votes aganist programs he himself wanted to cut. Pot calling the kettle black. \n \n \n\n If you need to argue nuances in military housing policy to find an area that the President might not have an advantage on, then you're really scraping the bottom of the issues barrel. To me, stating that the majority of servicmen will have zero out-of-pocket costs is good enough. I don't really think it'd be earthshattering if some navy serviceman in Hawaii has to kick in a few bucks for his prime location. emoticon_rolleyes\n\n \n Apparently you think that actually building more housing is a nunace. \n \n \n\n How can they be \"suffering from a cut in overall funds\" if you agree that the funds are INCREASING? Only Democrats would see an increase in spending as a decrease. emoticon_confused \n \n\n \n Funds are increasing, but they amount avaliable has been cut. What do you call a drop in avaliable funds? A cut. What do you call a reduction in benefits? A cut. What do you call decreasing the money sent to vets? a cut. \n \n \n\n And that's a problem because............?\n\n \n You said that Uncle Sam should only do military research, but many non-military advances end up in the military. Therefore if we want to keep technological superotity we must keep funding non-military research. \n \n \n\n Got any proof?\n\n \n That was just a jest. Most states are in the red for a number of reasons, regardless of their govenors. \n \n \n\n Now THAT'S one of your funniest paragraphs yet. You have swallowed every liberal BS argument under the sun, I see. Global warming, bad polluters, chemical CEO conspiracies, yadda, yadda, yadda.\n\n \n And you can't refute a single thing. Like usual. And I see you completely ignored the report detailing Bush's distortion and ignorance of science as a correctly predicted.\n \n Please, bring some facts. If you can. And try not to ignore detailed reports blowing your claims out of the water. \n \n [quote]\n You obviously live in a tiny box. Bush did allocate that money, but he did support a lawsuit aganist California to slow the production and use of Hybrid cars. Explain that. Bush is anti-science. Here's a report that you are probablying either going to attempt the fallacy of poisiong the well or simply going it ignore. \n \n \n \n\n Their board reads like a who's who in leftwing science. ;)\n \n Oh boy, here's one of their more credible members, Martin Sheen. \n \n\n \n Fallacy: Poisoning the wells. Highlight: complete lack of any ability to disporve anything on the site. \n \n \n\n I love it. You ...the US, NOT India.\n\n \n You obviously consider a tiny sample to be idicative of the entire world. Foolish. Please, go research the computer industry in India, as well as the chemical one. Then you'll see you are wrong like usual. \n \n \n\n The cost of living difference argument falls flat on its face when you're buying international goods like cars, Nikes, Levis. \n\n \n The link you post doesn't do anything in proving you are right. In fact it simply goes to show with a economy significently weaker then the US and with a US education, the buying and selling power of that education is exponentially higher then in the US. \n \n \n\n Next time you want to argue, bring some facts.\n\n \n That goes more to you then anyone else here. \n \n The 2nd article doesn't talk about the cost of living in weaker economic countries which is important when regarding the usefulness of a US education in non-US countries. As for international goods, you really think that they are selling at US prices? That's the most naive thing I ever heard.", 
   {}, 
   65709, 
   null, 
   1094443740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Are those on the Left big babies?", 
  "url": "http://www.4forums.com/political/current-events-debates/2970-those-left-big-babies.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 2970, 
  "discussion_files": [
   [
    "21350.html", 
    "http://www.4forums.com/political/current-events-debates/2970-those-left-big-babies-print.html"
   ], 
   [
    "21351.html", 
    "http://www.4forums.com/political/current-events-debates/2970-those-left-big-babies-6-print.html"
   ], 
   [
    "21352.html", 
    "http://www.4forums.com/political/current-events-debates/2970-those-left-big-babies-4-print.html"
   ], 
   [
    "21353.html", 
    "http://www.4forums.com/political/current-events-debates/2970-those-left-big-babies-5-print.html"
   ], 
   [
    "21354.html", 
    "http://www.4forums.com/political/current-events-debates/2970-those-left-big-babies-3-print.html"
   ], 
   [
    "21355.html", 
    "http://www.4forums.com/political/current-events-debates/2970-those-left-big-babies-2-print.html"
   ]
  ], 
  "identifier": 2970
 }
]