[
 [
  [
   63081, 
   null, 
   "Traveler", 
   "Senate.gov\n \n U.S. Senate Roll Call Votes 108th Congress - 2nd Session as compiled through Senate LIS by the Senate Bill Clerk under the direction of the Secretary of the Senate.\n \n  Vote Summary \n \n  Question : On Passage of the Bill(H.R. 1997)\n \n Vote Number 63\n \n  Vote Date : March 25, 2004, 05:39 PM\n \n  Required For Majority : 1/2\n \n  Vote Result : Bill Passed\n \n  Measure Number H.R. 1997  (Laci and Conner's Law)\n \n  Measure Title : A bill to amend title 18, United States Code, and the Uniform Code of Military Justice to protect unborn children from assault and murder, and for other purposes.\n \n  Vote counts : YEAs 61 NAYs 38 Not Voting 1\n \n Kerry (D-MA),  Nay \n \n http://www.senate.gov/legislative/LIS/roll_call_lists/roll_call_vote_cfm.cfm?congress=108&session=2&vote=00063", 
   {
    "post_info": {
     "post_title": "Kerry voted Nay on Laci &amp; Conners Law which protects pregnant women &amp; unborn children"
    }
   }, 
   null, 
   null, 
   1092937920.0
  ], 
  [
   63083, 
   null, 
   "Traveler", 
   "President Bush signed this bill into law on 4/1/2004.\n \n  President Bush Signs Unborn Victims of Violence Act of 2004 \n \n http://www.whitehouse.gov/news/releases/2004/04/20040401-3.html", 
   {}, 
   63081, 
   null, 
   1092938100.0
  ], 
  [
   63084, 
   null, 
   "jskufan", 
   "Senate.gov\n \n U.S. Senate Roll Call Votes 108th Congress - 2nd Session as compiled through Senate LIS by the Senate Bill Clerk under the direction of the Secretary of the Senate.\n \n  Vote Summary \n \n  Question : On Passage of the Bill(H.R. 1997)\n \n Vote Number 63\n \n  Vote Date : March 25, 2004, 05:39 PM\n \n  Required For Majority : 1/2\n \n  Vote Result : Bill Passed\n \n  Measure Number H.R. 1997  (Laci and Conner's Law)\n \n  Measure Title : A bill to amend title 18, United States Code, and the Uniform Code of Military Justice to protect unborn children from assault and nurder, and for other purposes.\n \n  Vote counts : YEAs 61 NAYs 38 Not Voting 1\n \n Kerry (D-MA),  Nay \n \n http://www.senate.gov/legislative/LIS/roll_call_lists/roll_call_vote_cfm.cfm?congress=108&session=2&vote=00063\n\n \n Can you explain exactly what the bill provides? I'm curious why 38 Senators voted against it. Granted, they were primarilly Democrat, but I'd still like to know the full extent of the bill.", 
   {}, 
   63081, 
   null, 
   1092938520.0
  ], 
  [
   63087, 
   null, 
   "Traveler", 
   "The law which Bush signed provides that any person who causes death or injury to a child in the womb shall be charged with a seperate offense, in addition to any charges relating to the mother.\n \n A person who assaults a pregnant woman and injures or kills her baby can be federally charged with a seperate charge for the injury or death of her child in addition to any injury he/she may have caused to the mother\n \n At the link I provided, click on H.R. 1997 and you can read to your hearts content. \n \n There you and everyone else can follow this bill from its start and can follow Kerry on it, too.\n \n Bush signed H.R. 1997, Laci and Conner's Law, which passed on March 25, 2004, into law on 4/1/2004. \n \n Thank God for President Bush's leadership!", 
   {}, 
   63084, 
   null, 
   1092939060.0
  ], 
  [
   63088, 
   null, 
   "Waxy", 
   "I think the reason for Kerry's vote was spelled out quite clearly by dsadevil in the \"Conservatives Unite Against Bush\" thread.\n \n Here's the exchange -\n \n \nDSADEVIL - Kerry votes NAY on \"Laci and Conner's Law\" which would allow for a seperate murder charge for the killing of a fetus if its done in the attack of a pregnant women. The democrats charged that this was a cynical ploy to create a legislative history recognizing a fetus as a \"person\" and that the goals of the bill could just as easily be achieved by making the killing of fetus an aggrevating factor in sentencing. I lean pro-life, so I'm not outright opposed to the labeling of a fetus as a living person. But that makes the vote defensable in my view.\n\n \n \nJIM'S TRUCKING - A fetus is a person. Kerry said recently that he believes life begins at conception. How can he justify this vote to not punish someone who murders a fetus? Is he flipping again? \n \n \n \nDSADEVIL - Once again, I answered this. Sen. Kerry is in favor of punishing someone who murders a fetus, its just a question of methodology. To the extent that Kerry is pro-choice (im sure u disagree with that stance), a preferable way to go about punishing someone is by making the death of a fetus an aggrevating factor in a crime, rather than simply defining the fetus as a seperate person. I honestly don't have a problem with this vote, since the end result is the same. Indeed, I'm a bit annoyed the republicans are playing politics with this, since there was a bipartisan, non-controversial idea on the table to accomplish the same goal as this bill, but the GOP felt compelled to pick an election year fight.\n\n \n Again, as was dsadevil's point at the beginning of this exchange, anything can be taken out of context and spun if you so desire to do so. You'd do well to take a look at the thread this exchange is from if you haven't already.\n \n Waxy", 
   {}, 
   63084, 
   null, 
   1092939180.0
  ], 
  [
   63090, 
   null, 
   "Traveler", 
   "I think the reason for Kerry's vote was spelled out quite clearly by dsadevil in the \"Conservatives Unite Against Bush\" thread.\n \n Here's the exchange -\n \n \n \n \n \n \n \n Again, as was dsadevil's point at the beginning of this exchange, anything can be taken out of context and spun if you so desire to do so. You'd do well to take a look at the thread this exchange is from if you haven't already.\n \n Waxy\n\n \n  This is what it all comes down too : It appears that Kerry will vote nay on any bill that he thinks will undermine the pro-choice position. There is no definitive proof that H.R. 1997 (Laci and Conners Law) would do that, though.\n \n He should have voted Yea on this bill, but he didn't, regardless of the reasons he may or may not have given.", 
   {}, 
   63088, 
   null, 
   1092939660.0
  ], 
  [
   63093, 
   null, 
   "Waxy", 
   "This is what it all comes down too: It appears that Kerry will vote nay on any bill that he thinks will undermine the pro-choice position. There is no definitive proof that H.R. 1997 (Laci and Conners Law) would do that, though.\n \n He should have voted Yea on this bill, but he didn't, regardless of the reasons he may or may not have given.\n\n \n That's your opinion, and your welcome to it. Many would disagree with you.\n \n Kerry had plenty of solid reasons to vote as he did, and he voted according to his beliefs.\n \n There is no proof, but plenty of precedent, to suggest that the bill WILL be used to undermine the pro-choice position. Considering how fond most conservatives are of the slippery slope argument, that should be plainly obvious.\n \n Maybe if the GOP was truly interested in passing such a law to defend pregnant mothers and their unborn children, they would have worded it in a manner that was acceptable to all, rather than attempting to advance their agenda in an underhanded manner disguised as being righteous.\n \n Waxy", 
   {}, 
   63090, 
   null, 
   1092939840.0
  ], 
  [
   63094, 
   null, 
   "Traveler", 
   "Dsadevil stated that the Gop is playing election year politics.\n \n Or is it really that Kerry and the Dems don't want to talk about how they voted on certain issues? They voted on them, therefore they are fair game to talk about.", 
   {}, 
   63090, 
   null, 
   1092940020.0
  ], 
  [
   63095, 
   null, 
   "Waxy", 
   "Dsadevil stated that the Gop is playing election year politics.\n \n Or is it really that Kerry and the Dems don't want to talk about how they voted on certain issues? They voted on them, therefore they are fair game to talk about.\n\n \n The whole thing went right over your head didn't it?\n \n Waxy", 
   {}, 
   63094, 
   null, 
   1092940080.0
  ], 
  [
   63100, 
   null, 
   "Traveler", 
   "That's your opinion, and your welcome to it. Many would disagree with you.\n\n \n Exactly the reason that I porovided the link. So that people can read all things pertaining to this bill & hopefully discover Kerry's justification for voting against this bill.\n \n \nKerry had plenty of solid reasons to vote as he did, and he voted according to his beliefs.\n\n \n What exactly are Kerry's solid reasons for voting against this bill as he did?\n \n \nThere is no proof, but plenty of precedent, to suggest that the bill WILL be used to undermine the pro-choice position. Considering how fond most conservatives are of the slippery slope argument, that should be plainly obvious.\n Actually if any would be guilty of engaging in the slippery slope argument this time it would be the liberals. There is no definite proof to show that this bill will undermine Roe v. Wade, for instance.\n \n \nMaybe if the GOP was truly interested in passing such a law to defend pregnant mothers and their unborn children, they would have worded it in a manner that was acceptable to all, rather than attempting to advance their agenda in an underhanded manner disguised as being righteous.\n\n \n I fail to see just how this law could have been worded any different to make this acceptable to all.  This law,The Unborn Victims of Violence Act, states that if a woman is pregnant and you injure her baby maliciously you will be charged seperately for injuring the baby, as well as being charged with any injuries to her. Period.  Liberals can spin all they like, but that's what it comes down to. The only way this law would have been acceptable to the liberals would have been to scuttle it. They can name call it all they want, but its a good law that protects defenseless babies.", 
   {}, 
   63093, 
   null, 
   1092940800.0
  ], 
  [
   63103, 
   null, 
   "Traveler", 
   "I's like to see Kerry spin his way out of this issue.\n \n  The Unborn Victims Of Violence Act provides that under federal law, any person who causes death or injury to a child in the womb shall be charged with a seperate offense, in addition to any charges relating to the mother.\n \n Violence against women often does have two victims, and the second victim(baby) should be protected as well. If some thug hits a pregnant woman and she and the baby dies he should be charged with two murders. This law provides for that.", 
   {}, 
   63100, 
   null, 
   1092941280.0
  ], 
  [
   63110, 
   null, 
   "dsadevil", 
   "Wow, I'm being quoted! That's pretty cool actually.\n \n Traveler, I'll try and put Sen. Kerry's vote in a context you can understand. The democratic alternative to Laci and Conner's bill (or more precisely, the amendment they put forward to the bill) was the Lofgren (D-CA) Amendment in the house. I don't know if Republican leaders ever let a similar amendment come to the floor in the senate, but it was the primary democratic alternative. As I stated earlier, the purpose of this amendment was to make the killing of a pregnant women (and her fetus) an aggrevating factor in the crime, thus subject to stiffer punishments, rather than simply making it two seperate crimes. As such, your statement that the only acceptable way to democrats to handle this bill was to scuttle it is factually inaccurate.\n \n The reason for this, again as I said earlier, is that Democrats didn't want to create a legislative track history for recognizing a fetus as a \"person,\" because if it is a person than presumably it should get all the protections afforded to persons under our constitution (essentially overruling Roe v. Wade). Would the passage of this bill, alone, cause Roe to be overturned? Doubtfully. But it definitely is a step in that direction. Since the Democratic proposal would have had the same end result (in that people who killed pregnant women and fetus's would be punished more severely) in a far less controversial manner, I don't understand why Republican's would want to push for a more controversial bill UNLESS they were gunning for an election year fight.\n \n The importance of a legislative track history in terms of the legal status of a fetus cannot be underestimated. Indeed, as the court wrote in Roe v. Wade (410 US 113, 156-158 1973)\n \nThe appellee and certain amici argue that the fetus is a \"person\" within the language and meaning of the Fourteenth Amendment. In support of this, they outline at length and in detail the well-known facts of fetal development. If this suggestion of personhood is established, the appellant's case, of course, collapses, for the fetus' right to life would then be guaranteed specifically by the Amendment. The appellant conceded as much on reargument. On the other hand, the appellee conceded on reargument that no case could be cited that holds that a fetus is a person within the meaning of the Fourteenth Amendment. \n \n The Constitution does not define \"person\" in so many words. Section 1 of the Fourteenth Amendment contains three references to \"person.\" The first, in defining \"citizens,\" speaks of \"persons born or naturalized in the United States.\" The word also appears both in the Due Process Clause and in the Equal Protection Clause. \"Person\" is used in other places in the Constitution: in the listing of qualifications for Representatives and Senators, Art. I, 2, cl. 2, and 3, cl. 3; in the Apportionment Clause, Art. I, 2, cl. 3; 53 in the Migration and Importation provision, Art. I, 9, cl. 1; in the Emolument Clause, Art. I, 9, cl. 8; in the Electors provisions, Art. II, 1, cl. 2, and the superseded cl. 3; in the provision outlining qualifications for the office of President, Art. II, 1, cl. 5; in the Extradition provisions, Art. IV, 2, cl. 2, and the superseded Fugitive Slave Clause 3; and in the Fifth, Twelfth, and Twenty-second Amendments, as well as in 2 and 3 of the Fourteenth Amendment. But in nearly all these instances, the use of the word is such that it has application only postnatally. None indicates, with any assurance, that it has any possible pre-natal application.\n \n All this, together with our observation, supra, that throughout the major portion of the 19th century prevailing legal abortion practices were far freer than they are today, persuades us that the word \"person,\" as used in the Fourteenth Amendment, does not include the unborn. \n\n \n The lack of compelling evidence that congress/framers meant for the unborn to be included in the context of a \"person\" was a key pillar on which the holding in Roe rested on.", 
   {}, 
   63100, 
   null, 
   1092942480.0
  ], 
  [
   63111, 
   null, 
   "Waxy", 
   "I's like to see Kerry spin his way out of this issue.\n \n  The Unborn Victims Of Violence Act provides that under federal law, any person who causes death or injury to a child in the womb shall be charged with a seperate offense, in addition to any charges relating to the mother.\n \n Violence against women often does have two victims, and the second victim(baby) should be protected as well. If some thug hits a pregnant woman and she and the baby dies he should be charged with two murders. This law provides for that.\n\n \n You seem unable, or perhaps unwilling, to recognize how loaded the wording of that Act is when it comes to pro-life vs. pro-choice. You're pro-life, that's obvious, but does that blind you to logic and reason? There's no spin needed at all, just a belief in pro-choice. One can easily be against violence against women and at the same time, pro-choice. IMHO, it's you that's spinning Kerry's vote into something it's not. You're suggesting that Kerry is soft on violence against women and children because he voted nay on one loaded bill. That's preposterous.\n \n The filing of a separate charge on behalf of the fetus make the fetus a person by default, complete with all the rights attached to being a person. It sets a precedent as such within the legal system, a precedent that could, and WILL, be used as grounds for legal challenges of a fetus's rights as a person.\n \n Are you really unable to see how that could have an affect, both in the short term, and in the long term, when it comes to the abortion issue?\n \n Further to that, it's clear to me that you didn't read the other thread, and dsadevil's point on how easy it is to spin these votes or comments.\n \n Waxy", 
   {}, 
   63103, 
   null, 
   1092942660.0
  ], 
  [
   63113, 
   null, 
   "Waxy", 
   "I fail to see just how this law could have been worded any different to make this acceptable to all. \n\n \n Simply put, that's your failure.\n \n Again, right from the quote of dsadevil in my first post -\n \n \na preferable way to go about punishing someone is by making the death of a fetus an aggrevating factor in a crime, rather than simply defining the fetus as a seperate person.\n\n \n Seems simple enough, and I'm sure it could be expounded upon so as to be very tough on violence against women and unborn fetuses.\n \n Waxy", 
   {}, 
   63100, 
   null, 
   1092942840.0
  ], 
  [
   63114, 
   null, 
   "dsadevil", 
   "Unfortuntately, that thread died off immediately after I made my post as to the ease of vote distortion (and to be clear, this isn't a problem unique to Republicans). I was looking forward to an answer by Jim's Trucking or the not-quite-on-the-level BISM to that, but they appeared to have fled from it.", 
   {}, 
   63111, 
   null, 
   1092942840.0
  ], 
  [
   63118, 
   null, 
   "Traveler", 
   "The whole thing went right over your head didn't it?\n \n Waxy\n\n \n No, it didn't, thank you.\n \n Are you just spinning?", 
   {}, 
   63095, 
   null, 
   1092943320.0
  ], 
  [
   63119, 
   null, 
   "Waxy", 
   "No, it didn't, thank you.\n \n Are you just spinning?\n\n \n emoticon_frazzled emoticon_confused \n \n Waxy", 
   {}, 
   63118, 
   null, 
   1092943860.0
  ], 
  [
   63123, 
   null, 
   "Carlene", 
   "I's like to see Kerry spin his way out of this issue.\n \n  The Unborn Victims Of Violence Act provides that under federal law, any person who causes death or injury to a child in the womb shall be charged with a seperate offense, in addition to any charges relating to the mother.\n \n Violence against women often does have two victims, and the second victim(baby) should be protected as well. If some thug hits a pregnant woman and she and the baby dies he should be charged with two murders. This law provides for that.\n\n Here's my spin on it and why I feel Kerry voted the only way he could.\n \n This law clearly provides for your \"thug\" scenario, but lets look at the words a little closer, more particularly:\n \n \"any person who causes death or injury to a child in the womb shall be charged with a separate offense\".\n \n Not only does this open the door to the complete reversal of Rowe v. Wade, it also could subject doctors to murder charges - and not just abortion doctors. Complications during pregnancy and delivery occur all the time and now there is a law to better help this sue-happy society we live in.\n \n Open your mind and really read the words written into the law, not just your interpretation of them.", 
   {
    "unicode_changes_made": true
   }, 
   63103, 
   null, 
   1092944700.0
  ], 
  [
   63124, 
   null, 
   "Traveler", 
   "Wow, I'm being quoted! That's pretty cool actually.\n \n Traveler, I'll try and put Sen. Kerry's vote in a context you can understand. The democratic alternative to Laci and Conner's bill (or more precisely, the amendment they put forward to the bill) was the Lofgren (D-CA) Amendment in the house. I don't know if Republican leaders ever let a similar amendment come to the floor in the senate, but it was the primary democratic alternative. As I stated earlier, the purpose of this amendment was to make the killing of a pregnant women (and her fetus) an aggrevating factor in the crime, thus subject to stiffer punishments, rather than simply making it two seperate crimes. As such, your statement that the only acceptable way to democrats to handle this bill was to scuttle it is factually inaccurate.\n \n The reason for this, again as I said earlier, is that Democrats didn't want to create a legislative track history for recognizing a fetus as a \"person,\" because if it is a person than presumably it should get all the protections afforded to persons under our constitution (essentially overruling Roe v. Wade). Would the passage of this bill, alone, cause Roe to be overturned? Doubtfully. But it definitely is a step in that direction. Since the Democratic proposal would have had the same end result (in that people who killed pregnant women and fetus's would be punished more severely) in a far less controversial manner, I don't understand why Republican's would want to push for a more controversial bill UNLESS they were gunning for an election year fight.\n \n The importance of a legislative track history in terms of the legal status of a fetus cannot be underestimated. Indeed, as the court wrote in Roe v. Wade (410 US 113, 156-158 1973)\n \n \n The lack of compelling evidence that congress/framers meant for the unborn to be included in the context of a \"person\" was a key pillar on which the holding in Roe rested on.\n\n \n In a context that I can understand? PLease...\n \n Anyway, I realize the ramification of a legislative track record. \n \n Let me put it to you this way. This is what I was headed to all along, anyway.\n \n If Kerry voted against Laci and Conners Law, and supports and/or supported the Lofgren Amendment, how can he reconcile that with the fact that he believes that life begins at conception? If the Lofgren Amendment doesn't hold a fetus to be a person and was created because its framers held Laci and Conners Law to be crafted in a way that supports the belief that life begins at conception and to be a person how will he be able to reconcile the two?\n \n I will be surprised if he isn't asked if he supported any altenatives to Laci and Conners Law. If he goes on record during the debates as supporting the Lofgren amendment he will be picked to shreds over it.", 
   {}, 
   63110, 
   null, 
   1092944760.0
  ], 
  [
   63127, 
   null, 
   "Traveler", 
   "You seem unable, or perhaps unwilling, to recognize how loaded the wording of that Act is when it comes to pro-life vs. pro-choice. You're pro-life, that's obvious, but does that blind you to logic and reason? There's no spin needed at all, just a belief in pro-choice. One can easily be against violence against women and at the same time, pro-choice. IMHO, it's you that's spinning Kerry's vote into something it's not. You're suggesting that Kerry is soft on violence against women and children because he voted nay on one loaded bill. That's preposterous.\n \n The filing of a separate charge on behalf of the fetus make the fetus a person by default, complete with all the rights attached to being a person. It sets a precedent as such within the legal system, a precedent that could, and WILL, be used as grounds for legal challenges of a fetus's rights as a person.\n \n Are you really unable to see how that could have an affect, both in the short term, and in the long term, when it comes to the abortion issue?\n \n Further to that, it's clear to me that you didn't read the other thread, and dsadevil's point on how easy it is to spin these votes or comments.\n \n Waxy\n\n \n I could care less about all the slippery slope arguments being used for or against this law. What matters to me is if this issue will be brought up in the debates/ Tv ad, and see Kerry reconcile his belief that life begins at conception and his not voting for this act. He would be asked if he supported the Lofgren alternative and how he can reconcile that amendment with his belief that life begins at conception.", 
   {}, 
   63111, 
   null, 
   1092945060.0
  ], 
  [
   63128, 
   null, 
   "Waxy", 
   "In a context that I can understand? PLease...\n \n Anyway, I realize the ramification of a legislative track record. \n \n Let me put it to you this way. This is what I was headed to all along, anyway.\n \n If Kerry voted against Laci and Conners Law, and supports and/or supported the Lofgren Amendment, how can he reconcile that with the fact that he believes that life begins at conception? If the Lofgren Amendment doesn't hold a fetus to be a person and was created because its framers held Laci and Conners Law to be crafted in a way that supports the belief that life begins at conception and to be a person how will he be able to reconcile the two?\n \n I will be surprised if he isn't asked if he supported any altenatives to Laci and Conners Law. If he goes on record during the debates as supporting the Lofgren amendment he will be picked to shreds over it.\n\n \n You're making some daring inferences, and putting a definite spin (your perspective) on Kerry's vote. Maybe they're valid, maybe they aren't.\n \n Perhaps, as has been pointed out to you (and as a result you changed the subject) Kerry simply objected to the wording of the Act. Does that necessarily put him at odds with the Lofgren Amendment?\n \n Perhaps it's me, but you're wording seems somewhat convoluted, so I'm not real sure what you're trying to get across here \nIf the Lofgren Amendment doesn't hold a fetus to be a person and was created because its framers held Laci and Conners Law to be crafted in a way that supports the belief that life begins at conception and to be a person how will he be able to reconcile the two?\n\n \n Waxy", 
   {}, 
   63124, 
   null, 
   1092945540.0
  ], 
  [
   63131, 
   null, 
   "sinjin", 
   "Maybe unlike you he feels his personal beliefs do not take precedence over the fact that a majority of Americans want abortions to remain legal.", 
   {}, 
   63127, 
   null, 
   1092945900.0
  ], 
  [
   63141, 
   null, 
   "dsadevil", 
   "Couldn't have put it better myself, sinjin.\n \n The issue of abortion is an important one, one in which there should be a strong and intense national dialogue. However, there are priorities in this nation which should not be tied to a hot button issue like abortion. Increasing penalties for crimes against pregnant women is one of them. I give credit to Sen. Kerry (and more so to Rep. Lofgren) for trying to build a consensus on this important matter, not pick a fight over it.", 
   {}, 
   63131, 
   null, 
   1092948900.0
  ], 
  [
   63220, 
   null, 
   "Duo_Maxwell", 
   "Doesn't this bill open a huge can of worms? \n \n While it may be a fallacy of the camel's nose, this bill could conviecebly lead to the repeal of virtually all abortion laws by giving a unborn fetus rights.", 
   {}, 
   63141, 
   null, 
   1092972720.0
  ], 
  [
   63221, 
   null, 
   "Sigma", 
   "There is a topic about this in the Abortion forum.\n \n Here is another aspect of the bill that may be why Kerry voted against it:\n \n \nBecause the UVVA[Unborn Victims of Violence Act] is a Federal Bill, it cannot actually be used in any murder\n case, which would fall under State Law. This would make the UVVA\n ineffectual in actually protecting a pregnant woman, but create a stepping\n stone for a national ban on abortion. An alternate version of the bill,\n which recognizes the pregnant woman as the victim, and includes a provision\n to the Tenth Amendment (States Rights), was voted against by the same people\n who voted for the UVVA.\n \n\n \n It was simply a case of Republicans playing politics, not actually trying to save lives. John Kerry voted for the alternative bill, which would actually do some good.", 
   {}, 
   63141, 
   null, 
   1092972780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Kerry voted Nay on Laci & Conners Law which protects pregnant women & unborn children", 
  "url": "http://www.4forums.com/political/politics-debates/2971-kerry-voted-nay-laci-conners-law-protects-pregnant-women-unborn-children.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2971, 
  "discussion_files": [
   [
    "13556.html", 
    "http://www.4forums.com/political/politics-debates/2971-kerry-voted-nay-laci-conners-law-protects-pregnant-women-unborn-children-print.html"
   ], 
   [
    "13557.html", 
    "http://www.4forums.com/political/politics-debates/2971-kerry-voted-nay-laci-conners-law-protects-pregnant-women-unborn-children-2-print.html"
   ]
  ], 
  "identifier": 2971
 }
]