[
 [
  [
   63133, 
   null, 
   "joebrummer", 
   "I have lately been fascinated by the idea of an ex-gay movement. It starts with my fascination with religion in general, and it seems all of these groups are religious in nature. It appears all of these are bible related. None of these groups are bible free and they all base their reasons for change on the bible. So apparently the only ones who believe you can change are Christians. Most medical and behavioral health groups agree that these groups are dangerous and due more harm than good. It also appears that there are no clear statistics showing that these groups have any documented success stories other than testimonies of people claiming to have changed, but no follow up to whether or not it stuck and that people remained heterosexual aftertime.\n \n On the other hand, even the founders of Exodus, one of the largest of these ex-gay Christian groups, later stated that it was not possible to change sexual orientation and that the groups was in fact doing more harm than good. In one interview I read with the men the described horrific damage these groups due to the people in them. Michael Busse, a co-founder of Exodus, recalls that some people who went through the Exodus program had breakdowns or committed suicide. \n \"One man slashed his genitals with a razor and poured Drano on his wounds.\" Another man impulsively underwent an incomplete sex-change operation because he believed his sexual desires might receive divine approval were he biologically a woman.\" \n \"After dealing with hundreds of people,\" Bussee concluded, he and his partner Cooper hadn't \"met one who went from gay to straight. Even if you manage to alter someone's sexual behavior, you cannot change their true sexual orientation.\" \n \"If you got them away from the Christian limelight,\" he said, \"and asked them, 'Honestly now, are you saying that you are no longer homosexual and you are now heterosexually oriented?'... not one person said, 'Yes, I am actually now heterosexual.'\"\n It does surprise me that the religious right would continue to promote these \"conversion\" therapies when they are clearly dangerous and unproven. Most radical Christians swear that thousands have changed the sexual orientation when in reality it appears to be unfounded. \n I would be interested in people's thoughts not on whether or not gays can change, but on how \"Christians\" can continue to promote something so dangerous and unproven. I would tend to think any of them that did change where most likely bi-sexual and had some attraction to the opposite sex in order to have heterosexual relations. \n \n \n Sources: http://andrejkoymasky.com/liv/fam/biob3/buss1.html", 
   {
    "post_info": {
     "post_title": "The Ex-gay Movement"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1092946680.0
  ], 
  [
   63145, 
   null, 
   "Ladywolf", 
   "Wow! What a topic.\n \n Reading your post, it seems sad to me that people bend and twist and maime and kill to be able to think they are okay with their religious orientation/ lifestyle. It would seem healthier if the gay people who belong to a christian denomination would just go shopping for a church/christian belief system that would accept them (even their sexuality) as they are.\n \n Now here is a good example: www.mccaustin.com\n \n My question is, how many people really want to change their sexual orientation in the first place unless their religious belief system provided some type of \"movation\" or peer pressure to do so.\n \n Personally, even though as a lesbian, lots of people have negative/hateful things to say about my sexual orientation, I wouldn't ever give up the love of my life partner for the world. We also believe and have felt G*d with us many times and believe that it's okay to be who we are as a couple.", 
   {
    "post_info": {
     "post_title": "The Ex-gay Movement"
    }
   }, 
   63133, 
   null, 
   1092950940.0
  ], 
  [
   63153, 
   null, 
   "joebrummer", 
   "Wow! What a topic.\n \n Reading your post, it seems sad to me that people bend and twist and maime and kill to be able to think they are okay with their religious orientation/ lifestyle. It would seem healthier if the gay people who belong to a christian denomination would just go shopping for a church/christian belief system that would accept them (even their sexuality) as they are.\n \n Now here is a good example: www.mccaustin.com\n \n My question is, how many people really want to change their sexual orientation in the first place unless their religious belief system provided some type of \"movation\" or peer pressure to do so.\n \n Personally, even though as a lesbian, lots of people have negative/hateful things to say about my sexual orientation, I wouldn't ever give up the love of my life partner for the world. We also believe and have felt G*d with us many times and believe that it's okay to be who we are as a couple.\n\n \n \n I don't even think some evangelical groups use motivation, I think the brainwash or at best scare people. I am facinated by most extreme religions. Who take the bible word for word. Especially when the words have been translated into tons of versions so the words vary from version to version. BUT to go and change who you are so your church will accept you sounds so drastic. I also can't image leaving my partner and my house (and my dogs) just to fake that I am now born again and straight. I just don't believe in conversion therapies. I am amzaed that anyonw would promote something so dangerous in the name of god.", 
   {}, 
   63145, 
   null, 
   1092952860.0
  ], 
  [
   63179, 
   null, 
   "Ladywolf", 
   "I don't even think some evangelical groups use motivation, I think the brainwash or at best scare people. I am facinated by most extreme religions. Who take the bible word for word. Especially when the words have been translated into tons of versions so the words vary from version to version. BUT to go and change who you are so your church will accept you sounds so drastic. I also can't image leaving my partner and my house (and my dogs) just to fake that I am now born again and straight. I just don't believe in conversion therapies. I am amzaed that anyonw would promote something so dangerous in the name of god.\n\n \n It amazes me that someone else is also facinated by other religions. Sometimes I find stuff about other religions that just make my jaw drop. I never gave much thought to people like Pat Robertson/Jerry Falwell until I actually heard that they blamed us for 9/11 and then appologized (surely not heart felt). On one hand I hear that Christianity is about love, kindness, caring and compassion. Then I read about it and it's like anything BUT love, kindness, caring and compassion. People kill themselves for self perceived descresions (excuse my spelling...meds again) against their diety they claim loves them and everyone no matter what. It's like watching someone that's crazy act out in front of you. It's a contradiction in terms. I mean, they can do what they want, think and believe what they want, but when it spills over into my life and the life of my family, it's insanity.", 
   {
    "post_info": {
     "post_title": "The Ex-gay Movement"
    }
   }, 
   63153, 
   null, 
   1092959340.0
  ], 
  [
   63182, 
   null, 
   "Jaaaman", 
   "Real change is hard and it costs a great deal because it requires strong motivation, hard work, and perseverance. But hundreds of former homosexuals have found a large degree of change, attaining abstinence from homosexual behaviors, lessening of homosexual temptations, strengthening their sense of masculine or feminine identity, correcting distorted styles of relating with members of the same and opposite gender. Some former homosexuals marry and some don't, but the bottom line is, change is possible.", 
   {}, 
   63179, 
   null, 
   1092959580.0
  ], 
  [
   63183, 
   null, 
   "JustineCredible", 
   "I don't even think some evangelical groups use motivation, I think the brainwash or at best scare people. I am facinated by most extreme religions. Who take the bible word for word. Especially when the words have been translated into tons of versions so the words vary from version to version. BUT to go and change who you are so your church will accept you sounds so drastic. I also can't image leaving my partner and my house (and my dogs) just to fake that I am now born again and straight. I just don't believe in conversion therapies. I am amzaed that anyonw would promote something so dangerous in the name of god.\n\n \n You know you've just opened the door for Jaaaman to come in here and restate everything you just said less the proof of how dangerous these \"therapies\" are. \n He has stated over and over again about people who supposedly stop being gay. What he never bothers to do is show proof. \n All his claims are easily disproven. Every major psychological association in the US debunks this sort of \"therapy\" and we have all read the APA's warnings about such groups. \n What's worse, in my opinion, are those who go through this \"therapy\", marry, have children and latter find just how miserable it has made them and then divorce. Leaving these children to have to cope not only with the idea that their parents are gay, but that their mere existance is based on a lie. \n What a terrible injustice to children.", 
   {}, 
   63153, 
   null, 
   1092959700.0
  ], 
  [
   63185, 
   null, 
   "JustineCredible", 
   "Real change is hard and it costs a great deal because it requires strong motivation, hard work, and perseverance. But hundreds of former homosexuals have found a large degree of change, attaining abstinence from homosexual behaviors, lessening of homosexual temptations, strengthening their sense of masculine or feminine identity, correcting distorted styles of relating with members of the same and opposite gender. Some former homosexuals marry and some don't, but the bottom line is, change is possible.\n\n \n Yup, sorry I paused in the middle of posting my last and didn't get it up before Jaaaman here did.\n \n Again, you offer no proof. Not one of these supposed \"therapies\" have anykind of follow-up routines or statistics to prove they work. \n \n How can anyone be at peace when they live a lie? \n \n I know I couldn't, and didn't for long. I just don't suffer fools well and your insistence that \"change is possible\" is just that, foolish. \n Self-loathing, depression, suicide attempts, and even leaving possible off-spring from such \"converted\" gays once it wears off is IMMORAL. To put that on any human being is shameful. \n \n I was blessed when I stopped living the social lie. I was blessed with inner peace, a happier and well adjusted child, and the love of my life. I have the love and support from my family and friends. What more could I ask for? \n Oh yes, the acceptance from people like you that with all your faith and beliefs that maybe, just maybe...you might be WRONG.", 
   {}, 
   63182, 
   null, 
   1092960120.0
  ], 
  [
   63186, 
   null, 
   "Ladywolf", 
   "Real change is hard and it costs a great deal because it requires strong motivation, hard work, and perseverance. But hundreds of former homosexuals have found a large degree of change, attaining abstinence from homosexual behaviors, lessening of homosexual temptations, strengthening their sense of masculine or feminine identity, correcting distorted styles of relating with members of the same and opposite gender. Some former homosexuals marry and some don't, but the bottom line is, change is possible.\n\n \n Jason,\n \n Reformation of my sexual orientation is NOT an option! The love I share with my life partner is not something I would ever give up. If you were rich, would you let a bank robber talk you out of your money and allow them to tell you how much better life would be for you if you were poor? I think not Jason.", 
   {
    "post_info": {
     "post_title": "The Ex-gay Movement"
    }
   }, 
   63182, 
   null, 
   1092960300.0
  ], 
  [
   63187, 
   null, 
   "Ladywolf", 
   "You know you've just opened the door for Jaaaman to come in here and restate everything you just said less the proof of how dangerous these \"therapies\" are. \n He has stated over and over again about people who supposedly stop being gay. What he never bothers to do is show proof. \n All his claims are easily disproven. Every major psychological association in the US debunks this sort of \"therapy\" and we have all read the APA's warnings about such groups. \n What's worse, in my opinion, are those who go through this \"therapy\", marry, have children and latter find just how miserable it has made them and then divorce. Leaving these children to have to cope not only with the idea that their parents are gay, but that their mere existance is based on a lie. \n What a terrible injustice to children.\n\n \n That's what the \"ignore\" button is for on here. Works great, but sometimes Jason's ramblings are entertaining...sad, but entertaining.", 
   {
    "post_info": {
     "post_title": "The Ex-gay Movement"
    }
   }, 
   63183, 
   null, 
   1092960480.0
  ], 
  [
   63188, 
   null, 
   "JustineCredible", 
   "That's what the \"ignore\" button is for on here. Works great, but sometimes Jason's ramblings are entertaining...sad, but entertaining.\n\n \n You can actually ignor a poster? Whoa, shows how much I paid attention in class. emoticon_ic", 
   {}, 
   63187, 
   null, 
   1092960660.0
  ], 
  [
   63189, 
   null, 
   "Anastasia", 
   "Real change is hard and it costs a great deal because it requires strong motivation, hard work, and perseverance. But hundreds of former homosexuals have found a large degree of change, attaining abstinence from homosexual behaviors, lessening of homosexual temptations, strengthening their sense of masculine or feminine identity, correcting distorted styles of relating with members of the same and opposite gender. Some former homosexuals marry and some don't, but the bottom line is, change is possible.\n\n *Former ex-gays who realized that their sexuality had not changed have found the freedom to be honest with themselves and others. Through education and many gay-affirming Christian resources they have integrated their Christian faith and homosexual orientation into healthy and productive lives. These ex-ex-gays have found that speaking the truth, though costly, is more important than acceptance based on external conformity and are making their stories known in order to spare others the pain of the ex-gay illusion.\n ****Ex-gay ministries claim anywhere from a 30 to 70% success rate for their programs, but typically define success in terms of external behavior and not true reversal of sexual orientation. \"Success\" (a.k.a \"freedom from homosexuality\") then, becomes life-long celibacy or commitment to a \"comfortable\" heterosexual marriage. To date, no ex-gay ministries we are aware of have produced any long-term follow-up studies to justify their claims of \"success\". Exodus International, a clearing house for ex-gay ministries, \"keeps no figures on how many people have gone through treatment\" and Dr. Joseph Nicolosi, head of NARTH (The National Association of Research and Therapy of Homosexuality) simply says \"I don't have time\".\n Newsweek, Aug. 17, 1998 pg 47\n I found this \n here \n There was a lot of web pages when I went looking... so have fun Jaaaaman", 
   {
    "unicode_changes_made": true
   }, 
   63182, 
   null, 
   1092960780.0
  ], 
  [
   63217, 
   null, 
   "joebrummer", 
   "*Former ex-gays who realized that their sexuality had not changed have found the freedom to be honest with themselves and others. Through education and many gay-affirming Christian resources they have integrated their Christian faith and homosexual orientation into healthy and productive lives. These ex-ex-gays have found that speaking the truth, though costly, is more important than acceptance based on external conformity and are making their stories known in order to spare others the pain of the ex-gay illusion.\n ****Ex-gay ministries claim anywhere from a 30 to 70% success rate for their programs, but typically define success in terms of external behavior and not true reversal of sexual orientation. \"Success\" (a.k.a \"freedom from homosexuality\") then, becomes life-long celibacy or commitment to a \"comfortable\" heterosexual marriage. To date, no ex-gay ministries we are aware of have produced any long-term follow-up studies to justify their claims of \"success\". Exodus International, a clearing house for ex-gay ministries, \"keeps no figures on how many people have gone through treatment\" and Dr. Joseph Nicolosi, head of NARTH (The National Association of Research and Therapy of Homosexuality) simply says \"I don't have time\".\n Newsweek, Aug. 17, 1998 pg 47\n I found this \n here \n There was a lot of web pages when I went looking... so have fun Jaaaaman\n\n \n \n The biigest problem with the ex-gay things is that no evaluation of sexial orientation before the \"Change\" was ever done. So they could have been bisexual, or not gay to begin with. In the research online I have read tons of pro and con articles. The cons seem to outwiegh any pro's these programs contain. The fact of the matter is they are dangerous. Reinforce by some of the very people who started them. Jaamman will believe what ever appears to be what his church wants him to believe. Si I very much doubt that he has the objectivity to really look at anything he says and see both sides of the story. That is part of the brainwashing I talked of earlier. Many of these ex-gays are brought into churches and taught homosexuality is wrong. Then they are given love and attention and \"ACCEPTANCE\" if they promise they will change. Many gay people are emotionally starved for acceptance so of course they want this. It is cruel and unchristian to do this.", 
   {
    "unicode_changes_made": true
   }, 
   63189, 
   null, 
   1092972420.0
  ], 
  [
   63222, 
   null, 
   "joebrummer", 
   "Real change is hard and it costs a great deal because it requires strong motivation, hard work, and perseverance. But hundreds of former homosexuals have found a large degree of change, attaining abstinence from homosexual behaviors, lessening of homosexual temptations, strengthening their sense of masculine or feminine identity, correcting distorted styles of relating with members of the same and opposite gender. Some former homosexuals marry and some don't, but the bottom line is, change is possible.\n\n \n \n \n Gee how did I know you would be first to support these ex-gay groups.\n \n Hard work to be something you are not is what you are really saying. It doesn't take any work to just be a gay or lesbian. You just are. Why on earth would I want to make my life work. I myself choose the less work choice. It is not only easier, it is healthy for my emotional well being. Iremember what it was like to pretend I was straight. It was horrible. I drank alot, I was depressed, I had a double life with my friends. I lied to everyone about everything trying to cover up my sexuality. Now I am an honest man, with a loving relationship and a healthier lifestyle. Don't drink to hide my problems (now it is just for fun). I eat better because I care more about me. \n \n They funnist pasrt of this statement you have made is the part about stregthing your masculine side. Most of the gay men I know are very masculine, leather wearing, marlboroh man types. Nothing feminte about them except a strange appreciation for Barbara that I do not share.\n \n \n But as usual I will say .....show me the money dude, Where are the numbers and statistics. Where is the evidence from any reputable study that these conversion therapies work. Because I can discount anything you got, but try anyway, It will be fun for me. Remeber this thread isn't about wether or not gays can change. It is about wether or not thoses therapies are dangerous. And they are.", 
   {}, 
   63182, 
   null, 
   1092972960.0
  ], 
  [
   63282, 
   null, 
   "Jaaaman", 
   "It seems many homosexual activists can give it out, but they can't take it. After all the ridicule they heap on ex-gay ministries, it would seem that at least they should allow them to tell their side of the story. But once again, we see that in the 'gay' world, tolerance and diversity are one-way streets. \n The homosexual lobby is deeply afraid of the obvious truth: that thousands of men and women have left homosexuality behind and are living happy, productive lives.", 
   {
    "unicode_changes_made": true
   }, 
   63222, 
   null, 
   1093020480.0
  ], 
  [
   63284, 
   null, 
   "Waxy", 
   "It seems many homosexual activists can give it out, but they can't take it. After all the ridicule they heap on ex-gay ministries, it would seem that at least they should allow them to tell their side of the story. But once again, we see that in the 'gay' world, tolerance and diversity are one-way streets. \n The homosexual lobby is deeply afraid of the obvious truth: that thousands of men and women have left homosexuality behind and are living happy, productive lives.\n\n \n Not to be a jerk Jaaaman, but do you think it's true because you say so?\n \n If you supplied some evidence, it would really help your case.\n \n Waxy", 
   {
    "unicode_changes_made": true
   }, 
   63282, 
   null, 
   1093020720.0
  ], 
  [
   63287, 
   null, 
   "joebrummer", 
   "It seems many homosexual activists can give it out, but they can't take it. After all the ridicule they heap on ex-gay ministries, it would seem that at least they should allow them to tell their side of the story. But once again, we see that in the 'gay' world, tolerance and diversity are one-way streets. \n The homosexual lobby is deeply afraid of the obvious truth: that thousands of men and women have left homosexuality behind and are living happy, productive lives.\n\n \n \n \n The fact of the matter is the opposite. You cannot make a claim that is unfounded. Thousands of men and women have NOT left homosexuality behind. You have no documented proof of that. Where they really gay or were they bisexual? How do you know that they stayed \"Straight\"? Where is the evidence. If I said to you that thousands of men and women have learned to breath underwater than you would want proof, wouldn't you?\n \n \n \n You also failed to stick with the topic, which is not wether or not people can change. It is wether or not these programs are dangerous, and why would christian organizations promote something that is dangerous.", 
   {
    "unicode_changes_made": true
   }, 
   63282, 
   null, 
   1093021200.0
  ], 
  [
   63325, 
   null, 
   "Jaaaman", 
   "The fact of the matter is the opposite. You cannot make a claim that is unfounded. Thousands of men and women have NOT left homosexuality behind. You have no documented proof of that. Where they really gay or were they bisexual? How do you know that they stayed \"Straight\"? Where is the evidence. If I said to you that thousands of men and women have learned to breath underwater than you would want proof, wouldn't you?\n \n \n \n You also failed to stick with the topic, which is not wether or not people can change. It is wether or not these programs are dangerous, and why would christian organizations promote something that is dangerous.\n\n These programs are not dangerous.... not any more so than AA or 12 step programs. It takes real committment for change. It is a hard road, some fall and must get back up again, but many have succeeded in this endeavor and live as heterosexuals and become productive members of society (per family unit values).\n \n http://www.exodus.to/pdf/Randy_Ad.pdf", 
   {}, 
   63287, 
   null, 
   1093041060.0
  ], 
  [
   63328, 
   null, 
   "Anastasia", 
   "These programs are not dangerous.... not any more so than AA or 12 step programs. It takes real committment for change. It is a hard road, some fall and must get back up again, but many have succeeded in this endeavor and live as heterosexuals and become productive members of society (per family unit values).\n \n http://www.exodus.to/pdf/Randy_Ad.pdf\n\n AA has a 5% success rate....\n The example you gave is one guy and that was an advertisement.\n Hardly convincing\n \n emoticon_frazzled", 
   {}, 
   63325, 
   null, 
   1093041600.0
  ], 
  [
   63329, 
   null, 
   "joebrummer", 
   "These programs are not dangerous.... not any more so than AA or 12 step programs. It takes real committment for change. It is a hard road, some fall and must get back up again, but many have succeeded in this endeavor and live as heterosexuals and become productive members of society (per family unit values).\n \n http://www.exodus.to/pdf/Randy_Ad.pdf\n\n So you post a link to Exodus? The founders of exodus, Gary Cooper and Michael Bussee have already left exodus because the saw they were doing more harm than good. They also stated that no one had really changed. When you take people away from the limelight of their church most admit they are still....yup..you guessed it..GAY!\n \n \n Here is my question for you, Should therapy be controlled by the FDA in the same way drugs are? If a particular therapy is found to do more harm than good, should it be banned.", 
   {}, 
   63325, 
   null, 
   1093041600.0
  ], 
  [
   63332, 
   null, 
   "Jaaaman", 
   "AA has a 5% success rate....\n The example you gave is one guy and that was an advertisement.\n Hardly convincing\n \n emoticon_frazzled\n\n Homosexuals who constantly through torts and legislation, purse institutions and societal standards to recognize their \"sexuality\" are in great pain. It's this driving need to justify what they know deep down is wrong and it gnaws at them like a festering wound on their soul. Instead of spending so much time trying to bring society down to their level, I would wish they would spend that wasteful time more productively by trying to find out why they are the way they are. :xbanghead", 
   {
    "unicode_changes_made": true
   }, 
   63328, 
   null, 
   1093042500.0
  ], 
  [
   63333, 
   null, 
   "Jaaaman", 
   "So you post a link to Exodus? The founders of exodus, Gary Cooper and Michael Bussee have already left exodus because the saw they were doing more harm than good. They also stated that no one had really changed. When you take people away from the limelight of their church most admit they are still....yup..you guessed it..GAY!\n \n \n \n\n Studies and many years of successful treatment show that homosexual behavior can be changed. Homosexual activists claim that homosexuality is an unchangeable condition and insist that therapy does not work. They attempt to justify their claim by defining success in absolute terms stipulating that: before treatment a person must have never experienced opposite-sex attraction and never engaged in heterosexual relations. After treatment the person must be fully heterosexual in behavior and never have another same-sex thought or temptation for the rest of his/her life. This would be the equivalent of saying that no diet program works unless the person never gains back one ounce and is never tempted to overeat again.", 
   {}, 
   63329, 
   null, 
   1093043100.0
  ], 
  [
   63335, 
   null, 
   "Anastasia", 
   "Studies and many years of successful treatment show that homosexual behavior can be changed. Homosexual activists claim that homosexuality is an unchangeable condition and insist that therapy does not work. They attempt to justify their claim by defining success in absolute terms stipulating that: before treatment a person must have never experienced opposite-sex attraction and never engaged in heterosexual relations. After treatment the person must be fully heterosexual in behavior and never have another same-sex thought or temptation for the rest of his/her life. This would be the equivalent of saying that no diet program works unless the person never gains back one ounce and is never tempted to overeat again.\n\n so....\n are you saying that gays can fall off the wagon?", 
   {}, 
   63333, 
   null, 
   1093043400.0
  ], 
  [
   63358, 
   null, 
   "joebrummer", 
   "Studies and many years of successful treatment show that homosexual behavior can be changed. \n\n So you mention these studies, who did them and where are the results? You also start off your post with how it is successful, people have been changed, then finish it saying well, maybe not completely changed. Which is it?\n \n\n Homosexual activists claim that homosexuality is an unchangeable condition and insist that therapy does not work. \n\n \n Even the founders of the ex-gay movement say it doesn't work. The people who have done it say it doesn't work. AND if it works I am willing to accept that, but first you need to back up your claim that it does, and you have yet to do that. If you have some data you would like to share, I would be happy to take a look at it. The overall problems is these programs don't evaluate the people before they are \"cured\", so how do you know they needed to be. I could go around saying I was cured of cancer by a miracle, but no one would believe me unless I could show I had cancer in the first place.\n \n \nThey attempt to justify their claim by defining success in absolute terms stipulating that: before treatment a person must have never experienced opposite-sex attraction and never engaged in heterosexual relations. After treatment the person must be fully heterosexual in behavior and never have another same-sex thought or temptation for the rest of his/her life. \n\n \n Well if you say that it is changed and they are no longer homosexual, then I wouldn't expect them to have same-sex thoughts or temptations. Remember they say they are cured. That would be my definition of (success) changed. Either the therapy worked or it didn't. \n \n It is not about success as much as it is the fact to get to this success, you are risking lives. The is ample evidence from the APA, and ex-exgay members that this type of therapy is dangerous. I personally think it should be outlawed. How about I find some more horror stories about it. They seem easier to define than the success stories.", 
   {}, 
   63333, 
   null, 
   1093056900.0
  ], 
  [
   63361, 
   null, 
   "joebrummer", 
   "oh jaaman, remember that link you posted. Here is the response to it!\n \n \n http://www.exgaywatch.com/xgw/political_ads/index.html", 
   {}, 
   63358, 
   null, 
   1093057800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Ex-gay Movement", 
  "url": "http://www.4forums.com/political/gay-rights-debates/2972-ex-gay-movement.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 2972, 
  "discussion_files": [
   [
    "389.html", 
    "http://www.4forums.com/political/gay-rights-debates/2972-ex-gay-movement-print.html"
   ], 
   [
    "390.html", 
    "http://www.4forums.com/political/gay-rights-debates/2972-ex-gay-movement-2-print.html"
   ]
  ], 
  "identifier": 2972
 }
]