[
 [
  [
   63292, 
   null, 
   "Traveler", 
   "The Kerry campaign calls on a publisher to 'withdraw book' written by group of veterans claiming veterans are lying about Kerry's service in Vietnam and operating as a front organization for Bush. Kerry campaign has told Salon.com that the publisher of UNFIT FOR COMMAND is 'retailing a hoax'... 'No publisher should want to be selling books with proven falsehoods in them,' Kerry campaign spokesman Chad Clanton tells the online mag...developing...\n \n http://www.drudgereport.com\n \n 1.) Kerry campaign: Please prove that the veterans are lying about Kerry's service in Vietnam.\n \n 2.) Please prove that the book is a 'hoax'.\n \n Do this with objective, verifiable proof, otherwise you might be perceived as misleading or lying to Americans.\n \n 3.) There are proven falsehoods in this book? What proven falsehoods?\n \n Withdraw book?\n \n To that I say, Seig Heil. <sarcasm<", 
   {
    "post_info": {
     "post_title": "Kerry Campaign Calls For Book Ban. Drudgereport.com"
    }
   }, 
   null, 
   null, 
   1093022520.0
  ], 
  [
   63297, 
   null, 
   "jskufan", 
   "The Kerry campaign calls on a publisher to 'withdraw book' written by group of veterans claiming veterans are lying about Kerry's service in Vietnam and operating as a front organization for Bush. Kerry campaign has told Salon.com that the publisher of UNFIT FOR COMMAND is 'retailing a hoax'... 'No publisher should want to be selling books with proven falsehoods in them,' Kerry campaign spokesman Chad Clanton tells the online mag...developing...\n \n http://www.drudgereport.com\n \n 1.) Kerry campaign: Please prove that the veterans are lying about Kerry's service in Vietnam.\n \n 2.) Please prove that the book is a 'hoax'.\n \n Do this with objective, verifiable proof, otherwise you might be perceived as misleading or lying to Americans.\n \n 3.) There are proven falsehoods in this book? What proven falsehoods?\n \n Withdraw book?\n \n To that I say, Seig Heil. <sarcasm<\n\n \n My gosh, you guys just can't let go of Kerry's military record can you? I wouldn't care if your your candidate was General Schwartzkoff (sp) or equivalent, but come on, remember the old saying about glass houses and throwing rocks?", 
   {}, 
   63292, 
   null, 
   1093024740.0
  ], 
  [
   63299, 
   null, 
   "Traveler", 
   "My gosh, you guys just can't let go of Kerry's military record can you? I wouldn't care if your your candidate was General Schwartzkoff (sp) or equivalent, but come on, remember the old saying about glass houses and throwing rocks?\n\n \n Hey, Kerry is the one who during the Democratic Convention made his Vietnam record a centerpiece of his campaign. Well, time to back up his Vet record that he says is true. When you make your record, any record, a centerpiece you open yourself up to scrutiny. Maybe Kerry fears that. \n \n But the Kerry campaign is going about this all wrong attacking the book and vets the way they have.\n \n I distinctly remember Bush being called a liar/misleader by Democrats. Looks like the chickens might have come home to roost on Kerry. If the Kerry campaign can't back up their statements he'll be branded as a misleader or possibly a liar, trying to cover his tracks.", 
   {}, 
   63297, 
   null, 
   1093025700.0
  ], 
  [
   63301, 
   null, 
   "jitobear", 
   "All I care to say regarding Kerry's service record vs. Bush's is - AT LAST HE HAS ONE.", 
   {}, 
   63299, 
   null, 
   1093027440.0
  ], 
  [
   63302, 
   null, 
   "jim's trucking", 
   "Yes, let's ban all books that are critical of Massachusetts Senators. After all, they are above us!\n \n The book is just too matter of fact for Kerry's group.", 
   {}, 
   63299, 
   null, 
   1093027620.0
  ], 
  [
   63309, 
   null, 
   "Kronus", 
   "Yes, let's ban all books that are critical of Massachusetts Senators. After all, they are above us!\n \n The book is just too matter of fact for Kerry's group.\n\n \n I believe the legal term here is \"libel\". As in, it's against the law to lie about someone in print and present it as truth. Everyday more and more evidence comes out that the book is full of lies and fabrications.", 
   {}, 
   63302, 
   null, 
   1093029660.0
  ], 
  [
   63311, 
   null, 
   "jim's trucking", 
   "I believe the legal term here is \"libel\". As in, it's against the law to lie about someone in print and present it as truth. Everyday more and more evidence comes out that the book is full of lies and fabrications.\nEnlighten me. What evidence came out Monday, Tuesday Wednesday, Thursday or Friday of this week?", 
   {}, 
   63309, 
   null, 
   1093030860.0
  ], 
  [
   63316, 
   null, 
   "Kronus", 
   "Enlighten me. What evidence came out Monday, Tuesday Wednesday, Thursday or Friday of this week?\n\n \n I guess you missed the release of the military documents that showed that the person who said there was no enemy fire when Kerry received his Bronze star also received a Bronze star at the same engagment, for action under enemy fire? No wait, you didn't miss it, you commented on it earlier. You've just chosen to forget it because it's inconvenient.\n \n What else came out this week? Interviews with the other two guys in Kerry's boat when he got his first purple heart say there was definately not a fourth person in the boat, as the book claims, and that there was no way Kerry wounded himself with a grenade launcher, that in fact there was no way Kerry even fired a grenade launcher. Financial records have been found linking the publishers of the book to the Bush family. Quotes have been found from various SBV members from just a year or two ago saying how great Kerry was.\n \n Alot of this can be found in the New York Times, which I am sure you will dismiss as \"liberal media\" but the facts still remain. Feel free to do your own research if you think you can disprove any of this, but the evidence continues to mount that the book is a politcal hack job, written by people with a 30 year old grudge, and financed by Bush's Texas buddies.", 
   {}, 
   63311, 
   null, 
   1093034340.0
  ], 
  [
   63330, 
   null, 
   "Master_Shake", 
   "Let's think about this for a minute. Bush has so little to run on that he is attempting to hold up one of Kerry's strong points (Viet Nam) as something bad. It is unbelievable that Bush supporters are making an issue of this when it is there candidate who is so weak on this issue (among many others, but that's beside the point). The administration and it's supporters must be either very scared or very dumb, but I think it's a little of both.", 
   {}, 
   63316, 
   null, 
   1093041780.0
  ], 
  [
   63352, 
   null, 
   "marc9000", 
   "This is going to be fun to watch. If the book is so full of lies, why is Kerry so scared of it? Why is he trying to ban free speech? Are the war veterans who wrote that book less qualified to speak freely than Micheal Moore, a hollywood hack, was about 9/11? Moore got a special seat at the Democratic convention. Bush is not as well connected with the authors of that book as Kerry is with Moore. \n \n Is the quick tempered Kerry qualified to be president? When he hissed \"bring it on\", referring to a debate about his military record, was he talking about Bush, or John O'Neil, the book's main author??", 
   {}, 
   63292, 
   null, 
   1093054380.0
  ], 
  [
   63355, 
   null, 
   "JPSartre12", 
   "All I care to say regarding Kerry's service record vs. Bush's is - AT LAST HE HAS ONE.\n\n \n Yes, he has one. The question before us is \"is it fiction or fact?\"\n He appears to be a legend in his own mind, if nothing else. \n emoticon_rolleyes", 
   {}, 
   63301, 
   null, 
   1093055580.0
  ], 
  [
   63357, 
   null, 
   "JPSartre12", 
   "I guess you missed the release of the military documents that showed that the person who said there was no enemy fire when Kerry received his Bronze star also received a Bronze star at the same engagment, for action under enemy fire? No wait, you didn't miss it, you commented on it earlier. You've just chosen to forget it because it's inconvenient.\n \n What else came out this week? Interviews with the other two guys in Kerry's boat when he got his first purple heart say there was definately not a fourth person in the boat, as the book claims, and that there was no way Kerry wounded himself with a grenade launcher, that in fact there was no way Kerry even fired a grenade launcher. Financial records have been found linking the publishers of the book to the Bush family. Quotes have been found from various SBV members from just a year or two ago saying how great Kerry was.\n \n Alot of this can be found in the New York Times, which I am sure you will dismiss as \"liberal media\" but the facts still remain. Feel free to do your own research if you think you can disprove any of this, but the evidence continues to mount that the book is a politcal hack job, written by people with a 30 year old grudge, and financed by Bush's Texas buddies.\n\n \n I heard an interview with O'Neil this morning on Fox. He is quite convincing and answered many tough questions. For example, I remember reading that the Democrats tried to discredit Dr. Letson by saying that he didn't treat Kerry. They used the signiture on the medical sheet as proof that he wasn't the attending physician. When asked, O'Neil said that the signature was that of Dr. Letson's corpsman, a fact that was easily verifiable. To me, that suggests an attempt to use subterfuge to discredit the fact that Dr. Letson did see Kerry.\n He was also asked if they took money from rich Republicans. He said \"yes\" and went on to say that they solicited funding and would have accepted it from anyone who was willing to fund them. He told Fox that they wanted their message out and even if Bush asked them to stop running the ad, they would continue because they were doing it for themselves NOT Bush. \n \n Here's another interesting swiftboat Kerry link to check out.\n http://justoneminute.typepad.com/main/2004/08/the_swift_vets_.html", 
   {}, 
   63316, 
   null, 
   1093056660.0
  ], 
  [
   63359, 
   null, 
   "jskufan", 
   "This is going to be fun to watch. If the book is so full of lies, why is Kerry so scared of it? Why is he trying to ban free speech? Are the war veterans who wrote that book less qualified to speak freely than Micheal Moore, a hollywood hack, was about 9/11? Moore got a special seat at the Democratic convention. Bush is not as well connected with the authors of that book as Kerry is with Moore. \n \n \n\n \n I don't think Kerry is \"scared\" of the book. He is excersizing his legal right to remove a document that he claims is an outright lie. We all have free speech, and if someone abuses the right by accusing someone of something that isn't true, our legal system is set up to punish them. If their statements are true, they have nothing to worry about. The problem with the veterans group as I've read, is they are apparently linked to the Bush family and Republican money to finance their endeavor. That is against the law. The Democrats embraced Micheal Moore after his movie was released because his views were similar to theirs. That's not the same.", 
   {}, 
   63352, 
   null, 
   1093057020.0
  ], 
  [
   63362, 
   null, 
   "marc9000", 
   "The problem with the veterans group as I've read, is they are apparently linked to the Bush family and Republican money to finance their endeavor. That is against the law. The Democrats embraced Micheal Moore after his movie was released because his views were similar to theirs. That's not the same.\n\n \n That's why I say it will be fun to watch, maybe we'll find out. I have a hard time believing that the Democrats didn't know who Moore was as his movie was being made. It also seems far fetched to think that such a diverse group of veterans are closely linked to the Bush family.\n \n One thing seems clear, Bush handled Moore's movie in a much more mature way than Kerry is handling O'Neil's book.", 
   {}, 
   63359, 
   null, 
   1093057920.0
  ], 
  [
   63370, 
   null, 
   "syklopps61", 
   "I don't think Kerry is \"scared\" of the book. He is excersizing his legal right to remove a document that he claims is an outright lie. We all have free speech, and if someone abuses the right by accusing someone of something that isn't true, our legal system is set up to punish them. If their statements are true, they have nothing to worry about. The problem with the veterans group as I've read, is they are apparently linked to the Bush family and Republican money to finance their endeavor. That is against the law. The Democrats embraced Micheal Moore after his movie was released because his views were similar to theirs. That's not the same.\n\n\n \n Say WHAT? If I'm not mistaken, that BS spewed out by Moore is certainly considered a bunch of lies by Bush, but I don't recall HIM filing complaints. And this \"connection\" with the Bush's? LOL, C'mon, if you dig hard enough I bet we ALL have some connection with Bush. Plus, even the New York Times has admitted that there is no evidence of Bush talking with any of these groups about this stuff. Now, please be fair and use the same argument with the Moore/Kerry connection. LORD, Moore was in Kerry's box at the convention! No connection there of course, right? And what about Soros with his Moveon.org, and all the money he has given to Kerry. Honest to God, being fair and telling the truth really doesn't hurt a bit", 
   {}, 
   63359, 
   null, 
   1093059960.0
  ], 
  [
   63371, 
   null, 
   "syklopps61", 
   "Let's think about this for a minute. Bush has so little to run on that he is attempting to hold up one of Kerry's strong points (Viet Nam) as something bad. It is unbelievable that Bush supporters are making an issue of this when it is there candidate who is so weak on this issue (among many others, but that's beside the point). The administration and it's supporters must be either very scared or very dumb, but I think it's a little of both.\n\n\n \n Man, could you be any more gullible? Bush would rather talk about Kerry's record, which is an absolute joke over the last 20 years. It's KERRY who made Vietnam the issue-that's a fact that cannot be argued-by the rational that is!", 
   {}, 
   63330, 
   null, 
   1093060080.0
  ], 
  [
   63426, 
   null, 
   "jskufan", 
   "Say WHAT? If I'm not mistaken, that BS spewed out by Moore is certainly considered a bunch of lies by Bush, but I don't recall HIM filing complaints. And this \"connection\" with the Bush's? LOL, C'mon, if you dig hard enough I bet we ALL have some connection with Bush. Plus, even the New York Times has admitted that there is no evidence of Bush talking with any of these groups about this stuff. Now, please be fair and use the same argument with the Moore/Kerry connection. LORD, Moore was in Kerry's box at the convention! No connection there of course, right? And what about Soros with his Moveon.org, and all the money he has given to Kerry. Honest to God, being fair and telling the truth really doesn't hurt a bit\n\n \n Once again, the \"facts\" seem to be grazed over and your posts wind up looking like campaign speeches. It's OK to agree with a person or organization that criticizes your opponent (Kerry/Moore), however, you're not allowed to finance the effort, that's against the law(Bush/Swift Boat Vets...). The word is that money funneled to this group can be traced back to the Bush family as well as some prominant Texas Republicans. Here's a link to the story as it appeared on CNN yesterday.\n \n http://www.msnbc.msn.com/id/5771731/", 
   {}, 
   63370, 
   null, 
   1093099740.0
  ], 
  [
   63429, 
   null, 
   "jskufan", 
   "Man, could you be any more gullible? Bush would rather talk about Kerry's record, which is an absolute joke over the last 20 years. It's KERRY who made Vietnam the issue-that's a fact that cannot be argued-by the rational that is!\n\n \n It's a shame that the incumbent President doesn't have enough accomplishments over the last 4 years to build his re-election campaign on. Rather than talk about what he's done, he's forced to focus on trying to discredit his opponent.", 
   {}, 
   63371, 
   null, 
   1093100400.0
  ], 
  [
   63452, 
   null, 
   "Master_Shake", 
   "Bush would rather talk about Kerry's record, which is an absolute joke over the last 20 years. It's KERRY who made Vietnam the issue-that's a fact that cannot be argued-by the rational that is!\n\n \n Ok, whatever, who gives a rip who brought it up? I'm sure we can go back further and further to see who brought up various issues that led to this point like Israelis and Palestinians fighting over who started it, but you'd still be missing the point. The point is Bush's \"military record\" is a joke, and he will ultimately be the loser if he wants to talk about it.\n \n Kerry's record over the last 20 years is joke? How about Bush's over the last four?", 
   {}, 
   63371, 
   null, 
   1093115100.0
  ], 
  [
   63454, 
   null, 
   "CCR1994", 
   "Seems to me this whole issue is a joke. Campaign Finance Reform makes it a joke. Does the 1st Amendment mean anything? The shame of this is that Bush signed the law and may end up paying the price. He should have vetoed this unconstitutional law without reservation but it would have been politically unpopular to do so. The media seemed to be championing the law and the public lent it's support not realizing what would happen. Now a campaign ad is being challenged and a sitting President may actually be condemned for violating the oath of his office twice: once for signing an unconstitutional bill to begin with and again for violating a law he himself signed. How ironic.", 
   {}, 
   63452, 
   null, 
   1093115700.0
  ], 
  [
   63457, 
   null, 
   "georged", 
   "Now a campaign ad is being challenged and a sitting President may actually be condemned for violating the oath of his office twice: once for signing an unconstitutional bill to begin with and again for violating a law he himself signed. How ironic.\n\n \n Seems to be right in line with his countless other blunders.", 
   {}, 
   63454, 
   null, 
   1093116180.0
  ], 
  [
   63462, 
   null, 
   "CCR1994", 
   "Seems to be right in line with his countless other blunders.\n\n \n I would have to be in agreement with you that this is a blunder. My main point would have to be this: Why should what Bush is accused of doing be made illegal in the first place? What's the point? And will this highlight the obvious flaw in McCain-Feingold or will the media and the more \"progressive\" minded simply gloss over this? I have no interest in shutting down any voice in democracy on any grounds because under this pretext, I and you and everyone else is NEXT!!!\n \n As I suggested in my prior post, I do blame Bush for this. The warning bells were sounded by some. McCain-Faingold violates free speech. Was he listening? Did he care? Was politically expediency more important than a principled defense of the constitution?", 
   {}, 
   63457, 
   null, 
   1093118340.0
  ], 
  [
   63465, 
   null, 
   "georged", 
   "Your last sentence says it all.", 
   {}, 
   63462, 
   null, 
   1093119360.0
  ], 
  [
   63466, 
   null, 
   "CCR1994", 
   "Say WHAT? If I'm not mistaken, that BS spewed out by Moore is certainly considered a bunch of lies by Bush, but I don't recall HIM filing complaints. And this \"connection\" with the Bush's? LOL, C'mon, if you dig hard enough I bet we ALL have some connection with Bush. Plus, even the New York Times has admitted that there is no evidence of Bush talking with any of these groups about this stuff. Now, please be fair and use the same argument with the Moore/Kerry connection. LORD, Moore was in Kerry's box at the convention! No connection there of course, right? And what about Soros with his Moveon.org, and all the money he has given to Kerry. Honest to God, being fair and telling the truth really doesn't hurt a bit\n\n \n It is important to stress the general concept here. It should not be illegal for any campaign to fund or run any political ad they desire or be associated with anyone they desire. The 1st Amendment is there for a reason. But I understand your point. The hypocrisy of some knows no bounds. \n \n Just to underscore the point: I have no interest in shutting down Kerry, Moore, Soros or Moveon.org under any condition because under this pretext, everyone else is NEXT!! I believe I already said this a few minutes ago.", 
   {}, 
   63370, 
   null, 
   1093119720.0
  ], 
  [
   63471, 
   null, 
   "pnac=ww3", 
   "I may be getting into it here because I don't know all the intricacies of McCain-Feingold.\n \n But where would we be today if there hadn't been Anti-trust laws 100 years ago?\n \n Laws like McCain-Feingold are an attempt (in principle) to limit political monopolies, or oligarchies as we have today in our 2-party system.\n \n A 2 party system is not a true democracy.", 
   {}, 
   63466, 
   null, 
   1093123020.0
  ], 
  [
   63477, 
   null, 
   "CCR1994", 
   "I may be getting into it here because I don't know all the intricacies of McCain-Feingold.\n \n But where would we be today if there hadn't been Anti-trust laws 100 years ago?\n \n Laws like McCain-Feingold are an attempt (in principle) to limit political monopolies, or oligarchies as we have today in our 2-party system.\n \n A 2 party system is not a true democracy.\n\n \n The monopolization of our political system by the 2 parties is the result of voter preference. Are you suggesting a set of laws that have the effect of limiting freedom of choice in this regard? \n \n In any case, it would seem that we are dealing with the law of unintended consequences. We have a law that limits contributions but allows a loophole for 527 organizations who don't endorse or oppose candidates directly but deal instead with issue advocacy (including, apparently, the issue of a candidates character which would seem to be indirect opposition to a candidate in the case of the Swiftboat vets). We also have the restriction on campaign ads 60 days before an election. And what are the results? A candidate can try to get an ad banned for violating a campaign finance law which perfectly illustrates how the law is a 1st amendment violation to say nothing of the 60 day prohibition. And yet we have all kinds of campaign finance records being broken. A law that supposedly limits financing is resulting in more financing of both direct and indirect campaigning than ever before. \n \n To top it off, 3rd parties are getting nowhere. Nader's candidacy is not getting the attention it did 4 years ago. Progressives are still livid about his 2000 candidacy costing the Democrats the White House and are furious that he hasn't learned his lesson. His influence is waning. The Reform party, thought to be an emerging alternative in 1996 with Perot's candidacy is nowhere to be heard. Are the Green's even fielding a candidate? I haven't heard. The Libertarians... you get my point.", 
   {}, 
   63471, 
   null, 
   1093134540.0
  ], 
  [
   63479, 
   null, 
   "pnac=ww3", 
   "And how do you get voters to prefer you? By their knowing your party even exists. By making sure they see your party as mainstream and stable.\n It's hard to get americans to back some party they've never heard of and that is calling for reform. Generally, they don't trust these parties. They trust the old standbys, Donkeys and Elephants.\n \n Like I said, campaign finance reform is great in principle. These little details about 60 days this, soft money that are not what campaign finance reform should be. It should be about leveling the playing field for all candidates. But, leveling the playing field at this point, so that every candidate is heard (as opposed to the media being saturated by two and only two campaigns) will be an almost impossible feat.\n \n To tell you the truth, I can't think of a good way that all voters can be influenced equally by every candidate. \n \n Getting back to the anti-trust analogy: The companies were able to form monopolies by people buying their products, by public approval, if you will. Does this mean they have a right to drive markets where they please and set whatever price they want? Some would say that certain companies became monopolies by intimidating and buying out competitors. That sounds a lot like the 2 party system. The 2 big parties will just out-cash a small, poor party every time, with TV ads, teams of political strategists and spin doctors, all there to keep the party in power. \n \n Monopolies are no good, no matter how they got to be that way.", 
   {}, 
   63477, 
   null, 
   1093136580.0
  ], 
  [
   63480, 
   null, 
   "CCR1994", 
   "And how do you get voters to prefer you? By their knowing your party even exists. By making sure they see your party as mainstream and stable.\n\n \n Like the Reform party? Everyone knew what the Reform party was. Are they getting traction today? Everyone is aware of who Nader is and generally what he stands for. How much traction does he have? How mainstream are his views? \n \n \nIt's hard to get americans to back some party they've never heard of and that is calling for reform. Generally, they don't trust these parties. They trust the old standbys, Donkeys and Elephants.\n\n \n How would the voters come to the conclusion that 3rd parties can't be trusted if they knew nothing about them or their views?", 
   {}, 
   63479, 
   null, 
   1093137720.0
  ], 
  [
   63488, 
   null, 
   "JPSartre12", 
   "Once again, the \"facts\" seem to be grazed over and your posts wind up looking like campaign speeches. It's OK to agree with a person or organization that criticizes your opponent (Kerry/Moore), however, you're not allowed to finance the effort, that's against the law(Bush/Swift Boat Vets...). The word is that money funneled to this group can be traced back to the Bush family as well as some prominant Texas Republicans. Here's a link to the story as it appeared on CNN yesterday.\n \n http://www.msnbc.msn.com/id/5771731/\n\n \n I saw the supposed link. The swiftboat guys got money from somebody who once met GW2 when he was the governor. Big Whoop!", 
   {}, 
   63426, 
   null, 
   1093145160.0
  ], 
  [
   63493, 
   null, 
   "jskufan", 
   "I saw the supposed link. The swiftboat guys got money from somebody who once met GW2 when he was the governor. Big Whoop!\n\n \n If they weren't being \"encouraged\" by the Republicans, what possible motivation would they have to come forward after 30+ years. Let me guess, their sudden need to \"clear the air\" has nothing to do with the election. Where were they when Kerry was running for Congress????", 
   {}, 
   63488, 
   null, 
   1093149720.0
  ], 
  [
   63494, 
   null, 
   "JPSartre12", 
   "If they weren't being \"encouraged\" by the Republicans, what possible motivation would they have to come forward after 30+ years. Let me guess, their sudden need to \"clear the air\" has nothing to do with the election. Where were they when Kerry was running for Congress????\n\n \n You're kidding, right? These are a group of men who witnessed Kerry's performance in Vietnam firsthand, then had to watch him disgrace the entire US military personnel in Vietnam on internationally-broadcasted TV. Would you stand by if someone that you knew personally, who lied about his service AND disgraced his uniform, was running for president of the United States?\n As O'Neill stated the other day, even if Bush asked them to stop running the ads by saying it was back-firing on him, they wouldn't stop because they were doing it for THEMSELVES, not Bush.", 
   {}, 
   63493, 
   null, 
   1093150080.0
  ], 
  [
   63497, 
   null, 
   "marc9000", 
   "If they weren't being \"encouraged\" by the Republicans, what possible motivation would they have to come forward after 30+ years. Let me guess, their sudden need to \"clear the air\" has nothing to do with the election. Where were they when Kerry was running for Congress????\n\n \n Motivation?? Could it have been one of Kerry's recent TV adds, where John Edwards said, \"if you have ANY QUESTIONS about the [leadership] (whatever word he used) of John Kerry, JUST ASK the people who served with him in Vietnam.\n \n That just may have been the motivation that stirred them up.", 
   {}, 
   63493, 
   null, 
   1093151880.0
  ], 
  [
   63528, 
   null, 
   "CCR1994", 
   "If they weren't being \"encouraged\" by the Republicans, what possible motivation would they have to come forward after 30+ years. Let me guess, their sudden need to \"clear the air\" has nothing to do with the election. Where were they when Kerry was running for Congress????\n\n \n I prefer and would hope others prefer to discuss the issues and charges raised by Michael Moore, George Soros and the Swiftboat vets instead of speculating about funding sources or motivations. I can't guess what's inside a person's mind or heart. One can speculate about motivations after one has evaluated the charges against known facts and evidence. Of course we know everyones interest is winning in November. That's a given regardless of who's being discussed or what issue is raised.", 
   {}, 
   63493, 
   null, 
   1093183860.0
  ], 
  [
   63543, 
   null, 
   "Sigma", 
   "I prefer and would hope others prefer to discuss the issues and charges raised by Michael Moore, George Soros and the Swiftboat vets instead of speculating about funding sources or motivations. I can't guess what's inside a person's mind or heart. One can speculate about motivations after one has evaluated the charges against known facts and evidence. Of course we know everyones interest is winning in November. That's a given regardless of who's being discussed or what issue is raised.\n\n \n Truly told. However, since the veterans who served with Kerry say that Kerry is a good guy, and other veterans who were in vietnam (though didn't serve with him) say he is not a good guy, we're basically down to who would have the motivation for lying.\n \n That's where the question of funding comes in. If the Swift Boat guys have funding from the Republican Party, it lends credence to the belief that they're a political tool, and that the members have been paid or somehow compensated to say these things. In that case, whether or not the charges were true it would not be \"moral outrage\" that brought them out, but money. That doesn't really make Kerry look bad, but it makes this Administration look really bad.", 
   {}, 
   63528, 
   null, 
   1093207620.0
  ], 
  [
   63546, 
   null, 
   "JPSartre12", 
   "Truly told. However, since the veterans who served with Kerry say that Kerry is a good guy, and other veterans who were in vietnam (though didn't serve with him) say he is not a good guy, we're basically down to who would have the motivation for lying.\n \n That's where the question of funding comes in. If the Swift Boat guys have funding from the Republican Party, it lends credence to the belief that they're a political tool, and that the members have been paid or somehow compensated to say these things. In that case, whether or not the charges were true it would not be \"moral outrage\" that brought them out, but money. That doesn't really make Kerry look bad, but it makes this Administration look really bad.\n\n \n Let's be fair now. Kerry solicited the help of those who served with him to bolster his side of the story. Who knows what he promised them. The SB guys went to the Democratic Party FIRST, telling them what they knew about Kerry. When they turned a deaf ear, O'Neill solicited funding from everybody who would listen. One of the people who listened was a large contributor to Texas Republicans. So what. Soros and McCaulley, both rich Democratic supporters (and one the chair of the DNC) have funded lots of anti-Republican ads and other campaign dirty tricks. Why, one of Teresa Kerry's organizations funded thr 9-11 family members tour who feined disgust over Bush using 9-11 scenes in ads.\n Wake up and smell the BS. It's being flung on and from both sides.\n emoticon_rolleyes", 
   {}, 
   63543, 
   null, 
   1093208880.0
  ], 
  [
   63547, 
   null, 
   "JPSartre12", 
   "Motivation?? Could it have been one of Kerry's recent TV adds, where John Edwards said, \"if you have ANY QUESTIONS about the [leadership] (whatever word he used) of John Kerry, JUST ASK the people who served with him in Vietnam.\n \n That just may have been the motivation that stirred them up.\n\n \n I guess the lesson there is \"If you don't want to know the truth, don't ask for it.\" Edwards shouldn't have made that request. People actually took him up on the challenge and not all of those asked were in Kerry's pocket. emoticon_ic", 
   {}, 
   63497, 
   null, 
   1093209060.0
  ], 
  [
   63560, 
   null, 
   "CCR1994", 
   "Truly told. However, since the veterans who served with Kerry say that Kerry is a good guy, and other veterans who were in vietnam (though didn't serve with him) say he is not a good guy, we're basically down to who would have the motivation for lying.\n \n That's where the question of funding comes in. If the Swift Boat guys have funding from the Republican Party, it lends credence to the belief that they're a political tool, and that the members have been paid or somehow compensated to say these things. In that case, whether or not the charges were true it would not be \"moral outrage\" that brought them out, but money. That doesn't really make Kerry look bad, but it makes this Administration look really bad.\n\n \n See, this is my beef. Your skepticism is selective. Is there no reason in your mind to be skeptical of the other side? I grant equal skepticism to all parties before making a judgement on the validity of issues raised. I haven't seen F9-11 by Michael Moore and I haven't read \"Unfit for Command\" by John O'Neill. I don't know who to be more skeptical of. John Kerry has issued a complaint with the FEC. An investigation will no doubt shed light on the truth of his allegation. Michael Moore's movie has been roundly condemned for it's lack of accuracy but I really can't make an informed judgement without watching it. His appearance at the DNC troubles many but I don't know how to evaluate that either. In any case, as I said before, I prefer to evaluate claims against known facts and evidence. It doesn't interest me in the least to evaluate any claim based on who is funding who or who is in who's pocket because it seems everyone is in somebody's pocket.", 
   {}, 
   63543, 
   null, 
   1093216800.0
  ], 
  [
   63565, 
   null, 
   "Sigma", 
   "See, this is my beef. Your skepticism is selective. Is there no reason in your mind to be skeptical of the other side? I grant equal skepticism to all parties before making a judgement on the validity of issues raised. I haven't seen F9-11 by Michael Moore and I haven't read \"Unfit for Command\" by John O'Neill. I don't know who to be more skeptical of. John Kerry has issued a complaint with the FEC. An investigation will no doubt shed light on the truth of his allegation. Michael Moore's movie has been roundly condemned for it's lack of accuracy but I really can't make an informed judgement without watching it. His appearance at the DNC troubles many but I don't know how to evaluate that either. In any case, as I said before, I prefer to evaluate claims against known facts and evidence. It doesn't interest me in the least to evaluate any claim based on who is funding who or who is in who's pocket because it seems everyone is in somebody's pocket.\n\n \n No, my skpticism isn't selective :P I really have no illusions that Kerry and his supporters are working for \"the good of America\" and are all that altruistic. As JP said, I'm sure he solicited help from those veterans who are helping him, but I seriously doubt he's paying them off since the relationship is an open one and I don't think he'd be stupid enough to do that. It's just that so many bad things are happening with regards to Bush that isn't believed by his fanatical supporters that anyone trying to point out \"Hey, this looks fishy\" is jumped on and branded a dirty liberal. I, too, would like this to be investigated so we know the truth of the claims.\n \n I did see Moore's movie and have seen many of the criticisms and praise and have concluded that Moore was accurate in regards to many disturbing things even if he was inaccurate in many of the details. I won't get into it here since it tends to turn into a shouting match and there are other threads discussing it.\n \n As to your evaluation, that works fine dandy... most of the time. In this situation, we have a doctor who says he treated Kerry but his name doesn't appear on the medical records. He insists that he treated him and someone else signed it. He said, quote, \"You'll have to take my word for it.\" From what this doctor has said, that was indeed practised so it might be true. I would be more inclined to believe him if he did not have an alleged conflict of interest because of the funding.", 
   {}, 
   63560, 
   null, 
   1093219620.0
  ], 
  [
   63633, 
   null, 
   "Bush Is The Man", 
   "All I care to say regarding Kerry's service record vs. Bush's is - AT LAST HE HAS ONE.\n\n \n \n \n Is that all you care about? Clinton didn't have a war record.", 
   {}, 
   63301, 
   null, 
   1093276140.0
  ], 
  [
   63638, 
   null, 
   "Bush Is The Man", 
   "I don't think Kerry is \"scared\" of the book. He is excersizing his legal right to remove a document that he claims is an outright lie. We all have free speech, and if someone abuses the right by accusing someone of something that isn't true, our legal system is set up to punish them. If their statements are true, they have nothing to worry about. The problem with the veterans group as I've read, is they are apparently linked to the Bush family and Republican money to finance their endeavor. That is against the law. The Democrats embraced Micheal Moore after his movie was released because his views were similar to theirs. That's not the same.\n\n \n \n \n Apparently he IS scared of the book and of the ads. Rather than releasing his war records and proving them all wrong, he has his henchmen send out letters to TV stations that play the ad and threaten to sue them if they don't take it off. Then he threatens to sue for libel. If so, Bush has the right to sue Moveon.org for the ads they put out that say he got into the Air National Guard because of his father (which hasn't been proven) and that say he supports the SBVFT (which has been proven to be false). Moveon.org is funded by George Soros, one of the biggest funders for the Democrats. He has given tens of millions of dollars to moveon.org, which is making these ads against Bush. Is Kerry not somehow connected to the ads, since that is the reasoning he uses against Bush? Just because Bob Perry gave money to Republicans and is from Texas, does not mean Bush is connected to the ads. Bush stated that these ads should be taken off the air and even proposed stricter laws onthese 527s. But when moveon.org comes out with one, Kerry seems to think the opposite of what he does when one come out against him.\n \n And as for libel. We know that at least some of the book \"Unfit for Command\" is true. Kerry has either lied or flip flopped about Cambodia, throwing his medals away, the atrocities that went on, etc. And the SBVFT have over 250 people supporting their claims. How do we know Kerry isn't lying about the rest?", 
   {}, 
   63359, 
   null, 
   1093276980.0
  ], 
  [
   63641, 
   null, 
   "JPSartre12", 
   ".....\n As to your evaluation, that works fine dandy... most of the time. In this situation, we have a doctor who says he treated Kerry but his name doesn't appear on the medical records. He insists that he treated him and someone else signed it. He said, quote, \"You'll have to take my word for it.\" From what this doctor has said, that was indeed practised so it might be true. I would be more inclined to believe him if he did not have an alleged conflict of interest because of the funding.\n\n \n The fact that Dr Letson's name doesn't appear was easily explained and verified. Kerry's medical record was signed by the corpsman assigned to assist Dr. Letson. As for Dr. Letson's credibility, I heard the man being interviewed and I'd say that he was a reluctant participant who only went public because his name was brought up and his reputation was being smeared by the Kerry camp in an attempt to discredit him. He was perfectly content being a retired doctor in Alabama when he was thrust into the limelight and felt the need to defend his name.\n I would suggest that, if you get te opportunity to, you listen to an interview with Dr Letson. He isn't an enraged Kerry hater. He's a soft-spoken country gentleman whose reputation was attacked as a result of the Democratic response to the SW book. While you may question others' motives, I don't think that you'd find Letson to be a political hack.", 
   {}, 
   63565, 
   null, 
   1093276980.0
  ], 
  [
   63758, 
   null, 
   "Duo_Maxwell", 
   "you do realize that O'neil was picked by Reagan (might have been nixon) to attack Kerry, and that he got his butt kicked in the past by Kerry. Does the Term grudge and paid goon mean anything to you guys?", 
   {}, 
   63641, 
   null, 
   1093313340.0
  ], 
  [
   63912, 
   null, 
   "JPSartre12", 
   "you do realize that O'neil was picked by Reagan (might have been nixon) to attack Kerry, and that he got his butt kicked in the past by Kerry. Does the Term grudge and paid goon mean anything to you guys?\n\n And when did Reagan or Nixon pick O'Neil? before or after they were buried? \n :xcensored", 
   {}, 
   63758, 
   null, 
   1093405200.0
  ], 
  [
   63913, 
   null, 
   "Carlene", 
   "He was picked by Nixon some 23 years ago. Even though Nixon didn't look it, I do believe he was alive then.\n \n http://radioinsidescoop.com/mt-posts-archive/000172.html", 
   {}, 
   63912, 
   null, 
   1093405380.0
  ], 
  [
   64147, 
   null, 
   "JPSartre12", 
   "He was picked by Nixon some 23 years ago. Even though Nixon didn't look it, I do believe he was alive then.\n \n http://radioinsidescoop.com/mt-posts-archive/000172.html\n\n \n Are you sure it wasn't just a propped up image? emoticon_smile", 
   {}, 
   63913, 
   null, 
   1093483020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Kerry Campaign Calls For Book Ban. Drudgereport.com", 
  "url": "http://www.4forums.com/political/politics-debates/2979-kerry-campaign-calls-book-ban-drudgereport-com.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2979, 
  "discussion_files": [
   [
    "1796.html", 
    "http://www.4forums.com/political/politics-debates/2979-kerry-campaign-calls-book-ban-drudgereport-com-print.html"
   ], 
   [
    "1797.html", 
    "http://www.4forums.com/political/politics-debates/2979-kerry-campaign-calls-book-ban-drudgereport-com-3-print.html"
   ], 
   [
    "1798.html", 
    "http://www.4forums.com/political/politics-debates/2979-kerry-campaign-calls-book-ban-drudgereport-com-2-print.html"
   ]
  ], 
  "identifier": 2979
 }
]