[
 [
  [
   63464, 
   null, 
   "pnac=ww3", 
   "Before 9/11, before Iraq, the main criticism of Bush was that he is an uncouth, vulgar, idiot. Well, that's still true today.\n \n I just found this website so if you've known about it forever, forgive me.\n \n http://www.dubyaspeak.com/\n \n These are the best:\n http://www.dubyaspeak.com/incidents.shtml\n \n poor Pope!\n The one about the PM of Canada is classic:\n \nTHE POUTINE INCIDENT\n (Sent into DubyaSpeak by close to 20 Canadian readers. Excerpted from AP article.)\n \n Stung by a pop quiz about foreign leaders earlier in his campaign, Republican presidential candidate George W. Bush now has fallen victim to a foreign affairs prank.\n \n Canadians are chuckling over his on-air answer when a comic posing as a reporter made up a story that Canadian Prime Minister \"Jean Poutine\" had endorsed him. \"I appreciate his strong statement, he understands I believe in free trade,\" Bush replied.\n \n \"He understands I want to make sure our relations with our most important neighbor to the north of us, the Canadians, is strong and we'll work closely together,\" he continued.\n \n Canada's prime minister is Jean Chretien, not Poutine, and he has endorsed no one in U.S. politics. Poutine is a fast food meal of french fries, gravy and cheese curd popular in French-speaking Quebec.\n \n The stunt was pulled by comic Rick Mercer from \"This Hour Has 22 Minutes,\" a satirical TV show in Canada. Mercer, who sets up politicians on both sides of the border for laughs, buttonholed Bush at a campaign event in Michigan last month and fired several questions at him about a Prime Minister Poutine. The CBC program showed the exchange twice last week.\n \n The real prime minister's office took the episode in stride, offering this response: \"Clearly, Canada is not in the Bush leagues.\" \n\n \n Please, for the love of god, vote this XXXXX out of office.", 
   {
    "post_info": {
     "post_title": "Dubyaspeak"
    }
   }, 
   null, 
   null, 
   1093119240.0
  ], 
  [
   63570, 
   null, 
   "Sigma", 
   "It almost hurts to read it and know that he is supposed to represent us. After all, supposedly we elected him.", 
   {}, 
   63464, 
   null, 
   1093221840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Dubyaspeak", 
  "url": "http://www.4forums.com/political/politics-debates/2988-dubyaspeak.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 2988, 
  "discussion_files": [
   [
    "17523.html", 
    "http://www.4forums.com/political/politics-debates/2988-dubyaspeak-print.html"
   ]
  ], 
  "identifier": 2988
 }
]