[
 [
  [
   63750, 
   null, 
   "Siegfriedson", 
   "Sharon says U.S. should also disarm Iran, Libya and Syria\n \n Prime Minister Ariel Sharon said yesterday that Iran, Libya and Syria should be stripped of weapons of mass destruction after Iraq. \"These are irresponsible states, which must be disarmed of weapons mass destruction, and a successful American move in Iraq as a model will make that easier to achieve,\" Sharon said to a visiting delegation of American congressmen.\n \n In a meeting with U.S. Undersecretary of State John Bolton yesterday, Sharon said that Israel was concerned about the security threat posed by Iran, and stressed that it was important to deal with Iran even while American attention was focused on Iraq.\n \n Full article:\n \n http://www.haaretzdaily.com/hasen/pages/ShArt.jhtml?itemNo=263941\n \n \n Let's not forget: Sharon Urged US Military Confrontation with Iran, Syria in April, 2003\n \n Israel will suggest that the United States also take care of Iran and Syria because of their support for terror and pursuit of weapons of mass destruction. Israel will point out the support of Syria and Iran for Hezbollah, which the U.S. considers an important target in the war against international terrorism.\n \n (Sharon's bureau chief) Weisglass is scheduled to meet National Security Advisor Condoleezza Rice and present Israel's reservations on the road map. Senior government sources said Weisglass's goal is \"to make sure things that disturb us (Israelis) won't happen.\"\n \n Full article:\n \n http://www.haaretzdaily.com/hasen/pages/ShArt.jhtml?itemNo=283271&contrassID=1\n \n \n When Sharon Says Jump, Bush Says, \"How High?\"\n \n This article is going to be about Jews. So if you're uncomfortable with the subject I suggest you bail out right now.\n \n Several months ago I wrote an article for our daily newspaper that I shouldn't have written if I were promoting my career.\n \n It seems that I had the unmitigated gall to question what America was getting in return for the 3 to 5 billion dollars we are \"investing\" in Israel every year.\n \n The article got me blackballed. Well, not exactly blackballed. But along with being demonized as an anti-Semitic, the paper never accepted any further articles I wrote. Naïve me, I couldn't understand what I had done wrong. Now I know better.\n \n Continued:\n \n http://www.etherzone.com/2003/moor022403.shtml\n \n \n \n .", 
   {
    "post_info": {
     "post_title": "Sharon &quot;Suggests&quot; (wink,wink) That US &quot;Disarm&quot; Iran, Syria"
    }
   }, 
   null, 
   null, 
   1093310820.0
  ], 
  [
   63833, 
   null, 
   "Waxy", 
   "SHEEEEEEESHHHH,\n \n You had a busy day Siegfriedson.\n \n You must be getting close to your spam quota and a big promotion over at stormfront.\n \n Waxy", 
   {}, 
   63750, 
   null, 
   1093366260.0
  ], 
  [
   64245, 
   null, 
   "Siegfriedson", 
   "SHEEEEEEESHHHH,\n \n You had a busy day Siegfriedson.\n \n You must be getting close to your spam quota and a big promotion over at stormfront.\n \n Waxy\n\n \n Waxy, what does your post have to do with the amount of influence Ariel Sharon holds over America's foreign policy in the Middle East? Please stick to the topic at hand.", 
   {}, 
   63833, 
   null, 
   1093538220.0
  ], 
  [
   64250, 
   null, 
   "Waxy", 
   "Waxy, what does your post have to do with the amount of influence Ariel Sharon holds over America's foreign policy in the Middle East? Please stick to the topic at hand.\n\n \n I'll tell you what Siegfriedson, the day you actually stick around and debate/defend one of your posts, I'll quit calling you a spammer/troll, and I'll keep to the subject.\n \n Any hack can cut and paste. emoticon_rolleyes\n \n Waxy", 
   {}, 
   64245, 
   null, 
   1093539180.0
  ], 
  [
   64259, 
   null, 
   "Siegfriedson", 
   "I'll tell you what Siegfriedson, the day you actually stick around and debate/defend one of your posts, I'll quit calling you a spammer/troll, and I'll keep to the subject.\n\n \n Not that I care what you call me, but I've debated several times on this board. If you haven't come across these threads, it's not my problem. Here's an example:\n \n http://4forums.com/political/showthread.php?t=2604", 
   {}, 
   64250, 
   null, 
   1093540320.0
  ], 
  [
   64261, 
   null, 
   "Waxy", 
   "Not that I care what you call me, but I've debated several times on this board. If you haven't come across these threads, it's not my problem. Here's an example:\n \n http://4forums.com/political/showthread.php?t=2604\n\n \n Please.\n \n I read every thread posted here, including your spam.\n \n You managed about 3 replies to ONE of the dozens of threads you've initiated and you're going to blow your horn about it?\n \n Waxy", 
   {}, 
   64259, 
   null, 
   1093540680.0
  ], 
  [
   65607, 
   null, 
   "pnac=ww3", 
   "Again I ask why a white supremacist would take any side in a war between two \"inferior\" races? Why do you care if the Kews beat the Arabs? Would it be better for you if the Arabs beat the Jews?", 
   {}, 
   64261, 
   null, 
   1094332980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Sharon \"Suggests\" (wink,wink) That US \"Disarm\" Iran, Syria", 
  "url": "http://www.4forums.com/political/current-events-debates/3005-sharon-suggests-wink-wink-us-disarm-iran-syria.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 3005, 
  "discussion_files": [
   [
    "5080.html", 
    "http://www.4forums.com/political/current-events-debates/3005-sharon-suggests-wink-wink-us-disarm-iran-syria-print.html"
   ]
  ], 
  "identifier": 3005
 }
]