[
 [
  [
   64251, 
   null, 
   "Ladywolf", 
   "Just thought I'd share about secular rights for gays...not \"special rights\" but equal rights...\n \n No, homosexuals do not have the same rights as heterosexuals do. We cannot serve in the military because of our sexual orientation. \n \n We do not all have protections against being fired because of our sexual orientation.\n \n As for the secular rights, I don't think this is right.\n \n From a religious standpoint, I've never seen more ignorance, hatred or twisted lies put into words as I have on this board from some of the folks who are Christians. Personally, I don't see the difference between what is \"good\" and what is \"evil\" when it comes to religion on here. I've seen satanists say nicer things than what has been written here.\n \n If this is your idea of what is good, I want no part of it.\n \n As far as the two, secular rights and religious rights, it seems that although the constitution has a freedom of religion clause in it, faith based people cannot and will not separate the two out making the separation clause invalid...what's the point in that?", 
   {
    "post_info": {
     "post_title": "Secular Gay Rights &amp; Religious Philosophy"
    }
   }, 
   null, 
   null, 
   1093539240.0
  ], 
  [
   64264, 
   null, 
   "JustineCredible", 
   "Just thought I'd share about secular rights for gays...not \"special rights\" but equal rights...\n \n No, homosexuals do not have the same rights as heterosexuals do. We cannot serve in the military because of our sexual orientation. \n \n We do not all have protections against being fired because of our sexual orientation.\n \n As for the secular rights, I don't think this is right.\n \n From a religious standpoint, I've never seen more ignorance, hatred or twisted lies put into words as I have on this board from some of the folks who are Christians. Personally, I don't see the difference between what is \"good\" and what is \"evil\" when it comes to religion on here. I've seen satanists say nicer things than what has been written here.\n \n If this is your idea of what is good, I want no part of it.\n \n As far as the two, secular rights and religious rights, it seems that although the constitution has a freedom of religion clause in it, faith based people cannot and will not separate the two out making the separation clause invalid...what's the point in that?\n\n \n I think they are doing it out of fear. They see the moral decline in America and they have latched onto the GLBT Community as their scapegoat. Since it's no longer PC To attack African-Americans for their obvious differences, it's not PC to go after other religions (especially Judaism - not that it actually stops pure hate groups from doing it) they have decided that attacking a group of people which are sexually different should be the way to go.\n I mean, their religion tells them that premarital sex is bad and wrong. Even though there is a multi-billion dollar industry based around HETEROSEXUAL sex, they actually depend on that money too much to bite the hand that feeds them. \n Insted, they attack a group that has not legal rights to marriage let alone little legal standing as far as individual rights. \n It's easier that way.", 
   {}, 
   64251, 
   null, 
   1093541940.0
  ], 
  [
   64267, 
   null, 
   "Ladywolf", 
   "I think they are doing it out of fear. They see the moral decline in America and they have latched onto the GLBT Community as their scapegoat. Since it's no longer PC To attack African-Americans for their obvious differences, it's not PC to go after other religions (especially Judaism - not that it actually stops pure hate groups from doing it) they have decided that attacking a group of people which are sexually different should be the way to go.\n I mean, their religion tells them that premarital sex is bad and wrong. Even though there is a multi-billion dollar industry based around HETEROSEXUAL sex, they actually depend on that money too much to bite the hand that feeds them. \n Insted, they attack a group that has not legal rights to marriage let alone little legal standing as far as individual rights. \n It's easier that way.\n\n \n I can see what you are saying. It's pretty much true...being a Jewish homosexual, I know it first hand. But just for once, couldn't they pick on somebody else?\n \n It seems almost like a bully tactic for the Christian heterosexuals who are against same sex marriages to pick on someone who doesn't have a legal leg to stand on...that's sad.", 
   {}, 
   64264, 
   null, 
   1093542360.0
  ], 
  [
   64269, 
   null, 
   "JustineCredible", 
   "I can see what you are saying. It's pretty much true...being a Jewish homosexual, I know it first hand. But just for once, couldn't they pick on somebody else?\n \n It seems almost like a bully tactic for the Christian heterosexuals who are against same sex marriages to pick on someone who doesn't have a legal leg to stand on...that's sad.\n\n \n Indeed it is. Instead of being true to their supposed faith and being true \"CHRISTIANS\" be helping others less fortunate, they come up with lies, deceit and hate towards them.\n The American Christian movement is anything but what America was founded on let alone real Christian faith.", 
   {}, 
   64267, 
   null, 
   1093542780.0
  ], 
  [
   64294, 
   null, 
   "joebrummer", 
   "Did we note the 'unbelieving' and 'immoral' parts, and how God's Word places these folks in with murderers? And that is why Paul writes to the Romans (the greatest civilization of his day) and says, \n \n\n \n \n Paul said it, not GOD! and it did not refer to homosexuality, The concept of homosexuality didn't exist then. A man wrote this, who could have been gay for all you know!", 
   {
    "unicode_changes_made": true
   }, 
   64251, 
   null, 
   1093551900.0
  ], 
  [
   64295, 
   null, 
   "joebrummer", 
   "You know what 'hearty approval' means in our day? It is homos coming into public forums with the attitude that they deserve special rights, because of this same deviant behavior that the Creator condemns. \n\n \n \n I don't think you should speak about civil matters and add the creator into the mix. We have separation of church and state in this country and I think you might be confused. See we don't make public law based on fictional books written by 100's of people thousands of years ago. It would be right to make laws based on somwthing not all americans believe.", 
   {
    "unicode_changes_made": true
   }, 
   64294, 
   null, 
   1093552020.0
  ], 
  [
   64304, 
   null, 
   "Ladywolf", 
   "Like my Rabbi said, some people take the Bible a little too literally.\n \n My Rabbi has taught me to use the Bible as a guide, not a law. God loves all his creatures regardless. \n \n Please don't preach your Christian hate speeches to me...I am still human afterall.\n \n Just because the majority of US Citizens claim to be Christian doesn't mean our government should throw out the secular basis for our constitution. There are other Americans who aren't Christian that still have the same rights as any other person in the US.", 
   {}, 
   64269, 
   null, 
   1093554000.0
  ], 
  [
   64311, 
   null, 
   "terral03", 
   "Hi Joe:\n \n \nJoe wrote << Paul said it, not GOD!, \n \n \n No. Holy Scripture is God's Word. \n \n \n\"All Scripture is inspired by God and profitable for teaching, for reproof, for correction, for training in righteousness; so that the man of God may be adequate, equipped for every good work.\" 2Tim. 3:16+17.\n\n \n Scripture says, \n \n \n\"But know this first of all, that no prophecy of Scripture is {a matter} of one's own interpretation, for no prophecy was ever made by an act of human will, but men moved by the Holy Spirit spoke from God.\" 2Peter 1:20+21.\n\n \n \nJoe << and it did not refer to homosexuality.\n\n \n Really? Let's see, \n \n \n\"For this reason God gave them over to degrading passions; for their women exchanged the natural function for that which is unnatural, and in the same way also the men abandoned the natural function of the woman and burned in their desire toward one another, men with men committing indecent acts and receiving in their own persons the due penalty of their error. And just as they did not see fit to acknowledge God any longer, God gave them over to a depraved mind, to do those things which are not proper.\" Romans 1:26-28.\n\n \n Okay, Joe. I give up. What is God's Word talking about? \n \n \nJoe << The concept of homosexuality didn't exist then.\n \n \n So the concept of homosexuality did not exist in the Bible days . . . You know, I cant remember being addressed by someone willing to make such an idiotic statement. Please forgive if this side is a little short on words . . . Have you read the story about Sodom and Gomorrah? \n \n \nGen 19:4 Before they lay down, the men of the city, the men of Sodom, surrounded the house, both young and old, all the people from every quarter; and they called to Lot and said to him, \"Where are the men who came to you tonight? Bring them out to us that we may have relations with them.\" Genesis 19:4+5.\n\n \n This place was surrounded by the young and old men of the city. Did you catch that 'have relations with them' part? This is where the word 'sodomy' comes from Joe, and people have known about this stuff for a while now. And you know what? The Lord God did not care for it all that much back then either. This same theme keeps showing up from Genesis to Revelation with the fire and brimstone. And these are no small camp fires . . . \n \n \n\"Then the LORD rained on Sodom and Gomorrah brimstone and fire from the LORD out of heaven.\" Gen. 19:24.\n \n \"And he looked down toward Sodom and Gomorrah, and toward all the land of the valley, and he saw, and behold, the smoke of the land ascended like the smoke of a furnace.\" Gen. 19:28.\n\n \n \nJoe << A man wrote this, who could have been gay for all you know!\n\n \n Highly doubtful, Joe. And with all of these descriptions of fire and brimstone that is waiting for this lot, it just amazes me that anyone can use the word 'gay' in the same sentence. \n \n In Christ,\n \n Terral", 
   {
    "post_info": {
     "post_title": "What The Bible Says About This Gay Business"
    }, 
    "unicode_changes_made": true
   }, 
   64294, 
   null, 
   1093555200.0
  ], 
  [
   64317, 
   null, 
   "joebrummer", 
   "Genesis 18:20 to 19:29--The Sodom Story\n \n \n \n Some consider the sin of Sodom to be same-gender sex, although we are not told in Genesis what Sodom's sins were, only that they were so great that God determined to destroy the city. On the evening before its destruction he sent two angels, in disguise as men, to the city to lead Lot and his family out early the next day. Hospitable Lot invited them to spend the night at his house. During the evening the men of the city surrounded the house and demanded of Lot that he bring the two men out so that they could [19:5]\n \n King James Version: \"know them.\"\n \n Revised Standard Version: \"know them.\"\n \n New International Version: \"have sex with them.\"\n \n When Lot refused to bring his guests out, the men of the city were about to break his door down when the angels struck them all blind and the mob dispersed. The next day Lot and his family were led out of Sodom, and the city was destroyed by fire and brimstone from heaven.\n \n \n \n The Hebrew verb used here, \"yadha,\" \"to know,\" is used 943 times in the OT and only ten times clearly to mean \"have sex,\" then it always means heterosexual sex. The word normally used for homosexual sex is \"shakhabh.\" Many scholars believe that in Gen. 19:5 yadha means \"know\" in the sense of \"get acquainted with\" (the city's men may have wondered if these were enemy spies or they might have sensed the city's impending doom and been concerned with what these strangers were doing there) and have several arguments for this, including Sodom's being used as an example of great sin numerous times in the Old and New Testaments with nothing ever said about same-sex sex, and the context of Jesus' references to Sodom (Luke 10:10-13) which seems to imply lack of hospitality as the sin.\n \n \n \n Other scholars think it was the common practice of showing dominance over and humiliating outsiders by forcing them to take the part of a (an inferior) woman in a same-gender rape.\n \n \n \n Others think it means \"have sex,\" and point to Lot's offering his two virgin daughters to the crowd if sex is what they want, if they will just leave his guests alone. If this is the right interpretation, it is clearly about violent, criminal, gang rape, something always condemnable.\n \n \n \n Another thought is expressed by Religion Professor David L. Bartlett: \"This story is certainly an unlikely starting point for a `biblical' understanding of sexual ethics. While the attempted homosexual rape by the men of Sodom is explicitly condemned, the offer by Lot to hand his two virgin daughters over to the violent and lecherous inhabitants of Sodom is related without a word of judgment.\"B-2\n \n \n \n Conservative theologian Richard Hays says, \"The notorious story of Sodom and Gomorrah--often cited in connection with homosexuality--is actually irrelevant to the topic.\"B-3\n \n \n \n There is nothing in this story applicable to our consideration of homosexuality.\n \n \n \n www.godmademegay.com", 
   {}, 
   64304, 
   null, 
   1093556460.0
  ], 
  [
   64330, 
   null, 
   "Jaaaman", 
   "There is nothing in this story applicable to our consideration of homosexuality.\n \n \n \n \n\n Thats a load of hogwash and you know it!", 
   {}, 
   64317, 
   null, 
   1093559580.0
  ], 
  [
   64332, 
   null, 
   "Ladywolf", 
   "Here we go again with the religious philosophy again...\n \n can't we just agree that neither side is going to persude the other side of anything? To agree to disagree and just get along side by side?", 
   {}, 
   64330, 
   null, 
   1093561980.0
  ], 
  [
   64335, 
   null, 
   "Waxy", 
   "Here we go again with the religious philosophy again...\n \n can't we just agree that neither side is going to persude the other side of anything? To agree to disagree and just get along side by side?\n\n \n Ummmmmmm, you started the post. emoticon_confused \n \n Waxy", 
   {}, 
   64332, 
   null, 
   1093562940.0
  ], 
  [
   64336, 
   null, 
   "Ladywolf", 
   "Ummmmmmm, you started the post. emoticon_confused \n \n Waxy\n\n \n There were 2 sides to this post...sorry if I wasn't clear...I went back and saw that it was indeed confusing...\n \n I guess I wanted to hear some about secular stuff too, not just the bible. It just seems the bible takes over everything around here like somekind of holy flyswatter or something. I haven't heard any secular arguments regarding marriage.", 
   {}, 
   64335, 
   null, 
   1093564140.0
  ], 
  [
   64344, 
   null, 
   "sinjin", 
   " What is the difference between two homos saying \"I do,\" and two roommates? Co-workers? Business partners? Priests? Anyone can make their mouths say anything if there is a buck in it. One male business partner says to the other, \"Hey, if we tie the knot, look at all the money we can save!\" Or the roommate says, \"Hey, I can share in your health plan if we get hitched!\" \n\n \n I think most people have the integrity to marry for love and no other reason.", 
   {
    "unicode_changes_made": true
   }, 
   64251, 
   null, 
   1093566120.0
  ], 
  [
   64349, 
   null, 
   "sinjin", 
   "\n From this side of the debate, you are certainly a very brave individual indeed. You spit in the face of Holy Scripture and the Creator at the same time, and want no part of Christians.\n\n \n It really takes no bravery unless you are a believer.\n \n btw a non-believer can't accept your reasoning that it's not you but God that they have a problem with. \n \n I also happen to be of the opinion that Paul is the impetus to much of the bigotry propogated by some Christians. I think Jesus would be ashamed of much that has been done and said in His name. JMO of course.", 
   {}, 
   64251, 
   null, 
   1093566720.0
  ], 
  [
   64355, 
   null, 
   "marc9000", 
   " I haven't heard any secular arguments regarding marriage.\n\n \n Did you see the top of page 4, in your thread, \"when gay marriage becomes legal.............\"?? Joebrummer even gave me a pat on the head for that one, which I appreciate. :) I'd like to see your reaction to it.", 
   {}, 
   64336, 
   null, 
   1093567980.0
  ], 
  [
   64358, 
   null, 
   "JustineCredible", 
   "Greetings to Lady, Justine and Waxy (mentioned):\n \n \n \n No. Some among us are simply standing up for what is right. Today this problem is like a sore that is slow to heal. Left alone, it might fester into something serious. This recent same sex marriage scare just might be what the doctor ordered to wake the sleeping giant represented by the huge population of professing Christians in this country. My feeling is that what you see as one step forward is really about a dozen steps back. \n \n \n Too bad for you, good for EQUALITY in AMERICA. Just in case you weren't aware, laws in THIS country are not THEOCRACY based. \n You agenda to do away with Civil rights in favor of your religion will go down. \n You mistake Man's laws for Gods laws. They are NOT the same.\n \n \n \n \nDid this side of the debate initiate a single thread to this Gay Rights section? Or, am I simply answering your posts? BTW, in case you are unaware, people like Waxy are on the attack in these threads, and not against homos. Are we big boys and girls? Or not?\n\n \n Try making sence and maybe I can reply to this. \n \n \n \nThe poor defenseless homos . . . The porn industry in this country is not Christian based. What kind of argument is that?\n\n \n Typical, you got that one completely backwards. I never said the porn industry is Christian based, I did say the so called Christian Community depends on Porn MONEY. Other way around...\n \n \n Sex outside of marriage is still fornication, but I do not see those folks seeking special rights. Do you have the right to exercise your faith in any way you see fit?\n\n \n Actually no, when laws are made based on one specific concept of one paticular faith system, if FORCES all CITIZENS to live by that faith.\n \n \n Freedom of speech?\n\n \n Not a religious based freedom or law.\n \n \n Right to bear arms?\n\n \n Not a faith based freedom or law.\n \n \n Have any soldiers dropped by to use your house in peace time?\n\n \n Actually yes, but not for the purposes of ilegal search or seisure, I have active duty military friends. They drop by all the time. Obviously your great lack of friends makes that idea hard to understand.\n \n \n Can you own property?\n\n \n Actually no. My state does NOT protect gays and lesbians in matters regarding land ownership, employment or temporary shelter. (Such as hotel and motel accomodations)\n \n \n Has anybody been by to search your house without a warrant?\n\n \n Already answered this, now you're just getting redundent.\n Obviously you're stretching at this point.\n \n \n Are homos forced to testify against themselves?\n\n Not a faith based freedom or law.\n \n \n Are their trials speedy enough, or is there a double standard? . . . And you have no legal standing as far as individual rights? You have the same rights to get married as everyone else in the land. But, that is not good enough, right? You want 'special rights' that nobody else has from sea to shining sea.\n\n \n Hmmm, if special means that those who are physically handicaped get to have \"Special ramps\" built so they may enter public buildings. YOU BET'CHA\n A virtual ramp into Marriage is EXACTLY what we as CITIZENS are demanding.\n \n Are you forced to marry someone of the same gender? Are you denied the ability to see your lifepartner in ICU during restrictive visiting hours?\n \n Are you/will you, be denied Social Security Benefits, Medicare, or survivor benefits if/when your partner dies?\n \n Are straight married partners denied Military or Veteran's Benefits?\n \n Are you denied medical health coverage through your partners employer because you are Married?\n \n Are you denied to take family leave if your partner is ill?\n \n Are you denied berievement time if someone in your partners family dies?\n \n Are Step Parents denied the ability to make medical decisions for their step children?\n \n Are you denied access to your partner's or your partners children's medical care providers?\n \n Will you be denied the ability to live in an assisted living center or nursing home with your partner?\n \n Will you be denied the ability or concideration to concent to after death medical examinations (ie autopsies) done on your partner?\n \n Will you be denied the ability to sue to wrongful death or malpractice in your partner's name?\n \n Will you be denied access to obtaining domestic violence orders of protection?\n \n Until all those things, which you take for granted are Taken Away from you, only then will you see the EMENSE IMPACT denial of LEGAL Marriage to Gays has NOW.\n \n I really don't care what your faith/religion says about homosexuality or gays. Your religious beliefs are not up for debate in this LEGAL issue. \n \n \n \nYou cats are no more less fortunate or disadvantaged than anybody else. And if anyone attacked Israel, I would be the first in line to defend her. The same rules apply to everyone equally under the Constitution. But, that is the real problem right? You do not want to be treated the same, under the law, as everyone else. No . . . you think playing house with your girlfriend is the same as the God fearing folks down the street raising four children. And, you think that those kids should have the option of marrying a man or a woman, of the same sex, like choosing between wheat or rye bread.\n\n \n You just hate the fact that I actually am a MOTHER and am RAISING a son, don't you? \n You just can't stand it.\n I'm not PLAYING at anything, you imbusile, I'm talking about MY SON'S FUTURE! \n You think it's all about playing with Barbies and pretend, and I'm talking about REAL LIFE.\n Something, I can see, eludes you. \n \n \n \nJust remember that when our congress makes these kinds of decisions, they do so for themselves AND THEIR POSTERITY. What posterity are you going to have with your girlfriend? To whom are you being eternally responsible? Who among the coming generations is going to look back and thank you for taking on the responsibility of bringing them into the world? Just go ahead and admit that the things you want have nothing to do with God, Country and Family. It is all about you and what you want for yourselves, no matter who has to pay for it down the road.\n\n \n WOW you actually do live under a rock don't you?! \n {rhetorical}\n Again, just so you have no doubt in your mind, I AM A PARENT! MY SON IS MY BIOLOGICAL CHILD! HE IS YOUR FUTURE! GET USED TO IT! \n \n Gays can and do, OFTEN, have and raise children.\n \n Damn, you denceness is overshadowed only by your inability to comprehend any sort of reality.\n \n My ex-spouse was ANYTHING but Abandoned by me.\n He was the one who was incapable of being loyal. He had not concept of fidelity or perminance. His example was to imediately do exactly what he did to me, to his next wife!\n \n Now he's on yet another marriage with a wife who pops babies out like there's no tommarow and guess who foots the bill? \n I DO! \n YOU Do!\n Every Citizen does! \n Why? \n Because he decided that after ten years out of military service that he should go back because he couldn't hack it in the REAL world. \n Now every citizen foots his bill, while he doesn't actually \"Serve\" his country. No, this looser extrordinaire is a RECRUITER! He's paid to LIE to innocent teens just out of high school and make promices he cannot keep just so our CORRUPT Commander in Chief can use then as CANNON Fodder! \n And you DARE TO POINT YOUR RIGHTEOUS FINGER AT ME!? \n SHAME ON YOU!\n \n \n \nYou people are going to have to excuse me and my perceptions of the principals in this debate. What are we really talking about when comparing a real life male/female/family situation to you and your girlfriend? When I look at the typical God-fearing Christian family, then I see pages, and chapters and volumes of coming generations. My thoughts go to our family reunions in North Florida with literally hundreds of relatives from the old and very wise to the children in arms. When looking at a homo couple seeking the same marriage status, all I see is selfishness and emptiness and nothing that compares. So try looking at this debate from the perspective of nature now and then. Try blaming Mother Nature for your situation, instead of Christians.\n\n \n Situation? \n Honey, again, just because I'm sure you've missed it everytime I've posted it...\n \n I AM A MOTHER!   \n \n \nJustine << The American Christian movement is anything but what America was founded on let alone real Christian faith.\n \n American Christians are continuing in the family oriented traditions handed down for generations. Most have a Bible based perception of what is right and what is wrong. And you know what? Most would rather continue what they are doing without even taking notice of the goings on between you and your girlfriend. What you do behind closed doors between yourselves is really none of their business. \n \n It is when you come out into public and parade this kind of behavior in front of their children, that they begin to take offense; when you begin petitioning for special rights and privileges that the \"We The People\" provide ONLY for those among our ranks who are willing to take on the responsibilities associated with fathering and mothering the next generation. At some point, then, our silence in these matters makes us an accessory to the crime. So expect us to speak up. Our children and their children are watching . . . are yours?\n\n \n YOU BETTER BELIEVE HE IS! \n \n He sees your hate for what it really is. He sees through your sharade of forgiving and faith for the hate and selfishness it really is! \n He knows you haven't got a CLUE as to what the Bible was meant for let alone the ABILITY to read it for what it is! \n He sees you taking the words literally, yet having no concept of their concequences!\n He knows the contradictory behaviors of so called \"Christians.\" He sees the hypocritical demands you place on the ENTIRE NATION! He sees how you people are competely disregarding of the fact that not all of this NATION is CHRISTIAN yet you are FORCE FEEDING your religious INTOLLERENCE down the throats of EVERY CITIZEN! \n You're Damned Right He Watching, and he's learning just what LIARS YOU ALL ARE!", 
   {
    "unicode_changes_made": true
   }, 
   64269, 
   null, 
   1093568580.0
  ], 
  [
   64585, 
   null, 
   "Duo_Maxwell", 
   "if you can deny rights on the grounds of religion, citing what can be called good fiction, can I do the same using other pieces of fiction?", 
   {}, 
   64358, 
   null, 
   1093673760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Secular Gay Rights & Religious Philosophy", 
  "url": "http://www.4forums.com/political/gay-rights-debates/3031-secular-gay-rights-religious-philosophy.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 3031, 
  "discussion_files": [
   [
    "18236.html", 
    "http://www.4forums.com/political/gay-rights-debates/3031-secular-gay-rights-religious-philosophy-print.html"
   ], 
   [
    "18237.html", 
    "http://www.4forums.com/political/gay-rights-debates/3031-secular-gay-rights-religious-philosophy-2-print.html"
   ]
  ], 
  "identifier": 3031
 }
]