[
 [
  [
   64316, 
   null, 
   "Bush Is The Man", 
   "Yesterday, Janeane Garofalo hosted a Bush bashing party in New York City that was sponsored by MoveOn.org (which George Soros has spent 12 million dollars on, who has also donated millions to Demcrats, even John Kerry) where she called Karl Rove a \"deuche bag\". MoveOn.org is now unveiling a new TV ad campaign featuring such Hollywood stars as Scarlett Johannson, Rebecca Romijn-Stamos and Matt Damon. They also praised Whoopi Goldberg's comments that used Bush's name to refer to part of a woman's anatomy.\n \n Can anyone take MoveOn.org seriously? They make ads equating people to Hitler, they condone this type of childish name-calling behavior often using obscene language, and praise anyone who partakes in this. This is absolutely vile. At least attempt to use some substance in your argument. But calling someone a \"deuche bag\" is totally uncalled for and I demand that Kerry denounce all behavior like this, whether it comes from the Left or the Right.\n \n President Bush denounces all 527 ads and says that all of them should be dealt with. However, what happens next? Someone produces anti-Bush rhetoric and ads and Kerry sits back and does nothing. What a hypocrite!!", 
   {
    "post_info": {
     "post_title": "More MoveOn.org smear ads"
    }
   }, 
   null, 
   null, 
   1093556340.0
  ], 
  [
   64337, 
   null, 
   "pnac=ww3", 
   "Thanks for letting us know about it.\n I had no idea.\n Now we can all tune in.\n \n You are an asset to the cause!", 
   {}, 
   64316, 
   null, 
   1093564320.0
  ], 
  [
   64345, 
   null, 
   "dsadevil", 
   "I love how BITM can start all these new threads that ironically, say the same thing over and over, yet somehow when pressed to backup his own POLICY positions he continually flees the threads.\n \n We're still WAITING on you BITM...", 
   {}, 
   64337, 
   null, 
   1093566180.0
  ], 
  [
   64351, 
   null, 
   "jskufan", 
   "\n Can anyone take MoveOn.org seriously? They make ads equating people to Hitler, they condone this type of childish name-calling behavior often using obscene language, and praise anyone who partakes in this. This is absolutely vile. At least attempt to use some substance in your argument. But calling someone a \"deuche bag\" is totally uncalled for and I demand that Kerry denounce all behavior like this, whether it comes from the Left or the Right.\n \n \n\n \n Apparently, people like you take them seriously. For the rest of the independent thinkers, we see them for what they are, an admittedly liberal organization that is unhappy with the current administration and is willing to put their money where their mouth is. I'm not sure what you're expectations are, but the reality is this administration was elected by a narrow margin and four years later they're still hanging on by a thread. Unfortunately for the Republicans, I think just about anyone could give George Bush a run for the money in the November election, and that means the independents must be voting Democrat.", 
   {}, 
   64316, 
   null, 
   1093567320.0
  ], 
  [
   64364, 
   null, 
   "Bush Is The Man", 
   "Apparently, people like you take them seriously. For the rest of the independent thinkers, we see them for what they are, an admittedly liberal organization that is unhappy with the current administration and is willing to put their money where their mouth is. I'm not sure what you're expectations are, but the reality is this administration was elected by a narrow margin and four years later they're still hanging on by a thread. Unfortunately for the Republicans, I think just about anyone could give George Bush a run for the money in the November election, and that means the independents must be voting Democrat.\n\n \n I am just wondering if you saw the newest poll data today? 49% vs 46%? And the Republicans haven't even had their convention yet? \n \n \n I am actually attending the convention on Monday, so I will give you guys an update on it.", 
   {}, 
   64351, 
   null, 
   1093570860.0
  ], 
  [
   64368, 
   null, 
   "marc9000", 
   "I am actually attending the convention on Monday, so I will give you guys an update on it.\n\n \n Hey good for you - have a good time! emoticon_xgood The one thing that we're most likely not going to see completely covered on the news is the anti - Bush demonstrations. Hope you'll be able to give us a report on that, should be some good entertainment. :)", 
   {}, 
   64364, 
   null, 
   1093574220.0
  ], 
  [
   64413, 
   null, 
   "Bush Is The Man", 
   "Hey good for you - have a good time! emoticon_xgood The one thing that we're most likely not going to see completely covered on the news is the anti - Bush demonstrations. Hope you'll be able to give us a report on that, should be some good entertainment. :)\n\n \n \n \n Don't worry. I will fill my camera up with pictures of anti-Bush protestors. I will put them on here when I get back.", 
   {}, 
   64368, 
   null, 
   1093621740.0
  ], 
  [
   64436, 
   null, 
   "jim's trucking", 
   "I don't care who funds what as long as they present the truth.\n \n The Kerry campers have been hit in the groin with the reaction to SVBT. \n \n They would have me believe that these servicemen are not as honorable as John Forbes Kerry. It's just their word against his.\n \n With all the seemingly insignificant details coming out to show that Kerry may have lied (and in some cases that he did lie), I see more and more people being turned off by John Kerry's whole Vietnam association.\n \n There are disproportionate sums of money being spent by the left and the right.", 
   {}, 
   64413, 
   null, 
   1093628640.0
  ], 
  [
   64464, 
   null, 
   "pnac=ww3", 
   "I am just wondering if you saw the newest poll data today? 49% vs 46%? And the Republicans haven't even had their convention yet? \n\n \n I know you are going to compare me to M. Moore, but this just makes me sad. It says how ignorant and stupid most americans are. Or at least the one's that take polls.", 
   {}, 
   64364, 
   null, 
   1093635360.0
  ], 
  [
   64467, 
   null, 
   "dsadevil", 
   "You're absolutely right. It is hypocritical (though no more so than Republican's new-found aversion to \"soft money\", with the exception of John McCain, Christopher Shays, and a few others, they fought the soft money ban tooth and nail. Ultimate flip-flop). Luckily, I've opposed McCain-Feingold from the start, so I'm not caught in this predicament.\n \n The reason for opposition to the SBVT ads (and several comparable MoveOn ads as well), is twofold.\n 1) They play fast and loose with the truth\n 2) They distract the American people from the ISSUES, which they (and this board) seems to have forgotten about.\n \n I could care less about the sources of funding. And no, I'm not happy with Kerry's FEC challenge to SBVT either.\n \n However, this novel emphasis on the CONTENT of the ads, rather than who's funding them or how many connections you can link from the ads to the campaigns, means that I can look at independent ads from both sides and decide, case-by-case, that certain ads are on the issues and others are just slime. And while the slime ads should be condemned, the issue ads should be allowed. That's my stance.\n \n Oddly enough, this distraction phenomona has manifested itself particularly acutely on the boards. Of the 9 threads that have posted on in the Politics Forum today (as of posting time), 7 of them are on political advertisements, while two are on \"issues.\" BITM hasn't made a post on an \"issue\" thread in the politics forum since August 23rd, in that time he's made 26 posts on the Politics forum have been on \"ad\" topics or other non-issue threads (like the Phelps thread). And of course, I have outstanding challenges to BITM in several threads on this boards concerning the issues which BITM has yet to answer.\n \n I've deliberately refrained from posting on the threads about ads because I think everyone has become hyper-partisanized about them and is just using them to try and score political points. I've made some efforts to try and steer the board back to the issues, but it doesn't seem to be working. Maybe if I post on the only threads BITM actually appears to READ, we can get the debate started again.", 
   {}, 
   64436, 
   null, 
   1093635660.0
  ], 
  [
   64486, 
   null, 
   "jim's trucking", 
   "...\n \n The reason for opposition to the SBVT ads (and several comparable MoveOn ads as well), is twofold.\n 1) They play fast and loose with the truth\nExcept for the one guy recanting on one statement, where have the SBVT ads been untruthful? Just because they differ with Kerry doesn't mean they're lying.\n \n \n\n 2) They distract the American people from the ISSUES, which they (and this board) seems to have forgotten about.\nKerry made his war record an issue. It's biting him in the *** now.\n \n \n \n\n I could care less about the sources of funding. And no, I'm not happy with Kerry's FEC challenge to SBVT either.\nLikewise. It makes no difference who funds what as long as they tell the truth.", 
   {}, 
   64467, 
   null, 
   1093638060.0
  ], 
  [
   64488, 
   null, 
   "dsadevil", 
   "Where have they played \"fast and loose\"? Here's some\n -We \"served with Kerry.\" That implies they were on the same boat as Kerry, when they weren't. The people who were closest to Kerry support him.\n -O'neill's statement that Kerry was never in Cambodia, because he was with O'Neill, and O'Neill was never any closer than 50 miles from Cambodia. Contradicted by O'Neill telling President Nixon he was in Cambodia at the time he said neither was there.\n http://news.yahoo.com/news?tmpl=story&cid=694&u=/ap/20040825/ap_on_el_pr/kerry_critic_swift_boats_1&printer=1\n and\n http://www.tnr.com/blog/campaignjournal?pid=1956\n -O'Neill said that Kerry wounded himself while \"playing with a hand grenade in a rice field.\" The actual account was that he used a hand grenade to blow up a VietCong rice cache, and was hit by some of the sharapnel.\n http://www.tnr.com/blog/campaignjournal?pid=1962\n -NO ONE connected to SBVT was present for the incident where Kerry won his silver star, but that hasn't stopped them from throwing that into question.\n -The Doctor who claims \"he treated\" Kerry for one of his purple heart wounds didn't have his name on the medical report for it.\n -O'Neill claims that Kerry put himself in for his bronze star and 3rd purple heart. His evidence? That Kerry's initials are on the paper. The problem? The initials are KJW, not JFK. Which only proves O'Neill is illiterate.\n http://www.tnr.com/doc.mhtml?i=20040906&s=lizza090604\n -Thurlow says that there was no enemy fire the day that Kerry won his bronze star. But his own citation for HIS bronze star on the same day says that there was enemy fire. O'Neill says that it was Kerry's report that lead to that citation which a) is an entirely unwarrented assertion and b) is unlikely, considering that THURLOW, as the ranking officer present, should have been the one to file the report.\n -Steve Gardner, the man trotted out as an expert on Kerry's first Purple Heart because he served on Kerry's boat, wasn't even on board the day Kerry came under fire.\n http://www.tnr.com/doc.mhtml?i=20040906&s=lizza090604 \n \n Kerry didn't make his war record an issue in the sense that it was a valid point of contention between the parties. If he had, he would have been COMPARATIVE, that is, run ads saying \"here's what I did, here's what Bush did (flossed well, apparently).\" He never did that. Was Kerry's machosimo war-imagery at the convention and elsewhere over the top? Sure. But that doesn't make it an issue (and definitely not a POLITICAL issue). If it is an issue, than I assume you think that Kerry and his surrogates can attack Bush on all the claims of draft dodging, being awol, etc., right?", 
   {}, 
   64486, 
   null, 
   1093639200.0
  ], 
  [
   64490, 
   null, 
   "jim's trucking", 
   "Where have they played \"fast and loose\"? Here's some\n -We \"served with Kerry.\" That implies they were on the same boat as Kerry, when they weren't. \nYou don't have to serve on the same boat with a guy to know what's going on in a tactical group.\n \n \n \nThe people who were closest to Kerry support him.\nNot one of his commanding officers supports him.\n \n \n \n\n -O'neill's statement that Kerry was never in Cambodia, because he was with O'Neill, and O'Neill was never any closer than 50 miles from Cambodia. Contradicted by O'Neill telling President Nixon he was in Cambodia at the time he said neither was there.\nIf you'll pay attention to what O'neal said to Nixon, you'll find that he said he was near Cambodia, not in it.\n \n From your link:\n \n \n \"I was in Cambodia, sir. I worked along the border,\" said John E. O'Neill in a conversation that was taped by the former president's secret recording system. The tape is stored at the National Archives in College Park, Md. \n \n \n In an interview with The Associated Press on Wednesday, O'Neill did not dispute what he said to Nixon, but insisted he was never actually in Cambodia. \n \n \n \"I think I made it very clear that I was on the border, which is exactly where I was for three months. I was about 100 yards from Cambodia,\" O'Neill said in clarifying the June 16, 1971, conversation with Nixon.  \n \n \n \n \n\n http://news.yahoo.com/news?tmpl=story&cid=694&u=/ap/20040825/ap_on_el_pr/kerry_critic_swift_boats_1&printer=1\n and\n http://www.tnr.com/blog/campaignjournal?pid=1956\n -O'Neill said that Kerry wounded himself while \"playing with a hand grenade in a rice field.\" The actual account was that he used a hand grenade to blow up a VietCong rice cache, and was hit by some of the sharapnel.\n http://www.tnr.com/blog/campaignjournal?pid=1962\n -NO ONE connected to SBVT was present for the incident where Kerry won his silver star, but that hasn't stopped them from throwing that into question.\n -The Doctor who claims \"he treated\" Kerry for one of his purple heart wounds didn't have his name on the medical report for it.\n Is it just Kerry's account we are to believe? The doctor that treated Kerry's first wound has made his statements. The hospital tech that signed Kerry's medical treatment report was not a doctor.\n \n \n\n -O'Neill claims that Kerry put himself in for his bronze star and 3rd purple heart. His evidence? That Kerry's initials are on the paper. The problem? The initials are KJW, not JFK. Which only proves O'Neill is illiterate.\n http://www.tnr.com/doc.mhtml?i=20040906&s=lizza090604\n -Thurlow says that there was no enemy fire the day that Kerry won his bronze star. But his own citation for HIS bronze star on the same day says that there was enemy fire. O'Neill says that it was Kerry's report that lead to that citation which a) is an entirely unwarrented assertion and b) is unlikely, considering that THURLOW, as the ranking officer present, should have been the one to file the report.\nI can't speak to the initials on the papers as I have not seen the originals. As Kerry has proved, files can be manipulated. Why is the assertion unwarranted?\n \n \n\n -Steve Gardner, the man trotted out as an expert on Kerry's first Purple Heart because he served on Kerry's boat, wasn't even on board the day Kerry came under fire.\nKerry's group has admitted he wasn't under fire that time. Remember now? Kerry wrote in his diary some days later that they had not been under fire yet. This is just one of the recent concessions from the Kerry campers.\n \n \n\n http://www.tnr.com/doc.mhtml?i=20040906&s=lizza090604 \n \n Kerry didn't make his war record an issue in the sense that it was a valid point of contention between the parties. If he had, he would have been COMPARATIVE, that is, run ads saying \"here's what I did, here's what Bush did (flossed well, apparently).\" He never did that. Was Kerry's machosimo war-imagery at the convention and elsewhere over the top? Sure. But that doesn't make it an issue (and definitely not a POLITICAL issue). If it is an issue, than I assume you think that Kerry and his surrogates can attack Bush on all the claims of draft dodging, being awol, etc., right?\nKerry's main claim to fame is his service in Vietnam. This is by his own choosing. It is then to be expected that people who disagree with the claims of greatness will attack those claims. It's concievable that Kerry's brief stint in Vietnam was for the sole purpose of establishing a \"PT-109\" legend for future use. Kerry didn't exactly volunteer for the most hazardous duty either. When he joined the swiftboats, he thought he'd be patrolling non-combat areas.\n \n Bush hasn't tried to make an issue of his military service. He was attacked before on the same issue and it fell through. He got an honorable discharge from the National Guard.\n \n \n\n THE PATRIOT PERSPECTIVE\n \n \n Top of the fold -- Kerry's Quagmire...\n \n There is a chronic state of superciliousness manifest in some members of Congress who are perennially re-elected by their loyal lemmings -- an unmitigated arrogance called \"Potomac Mentation Syndrome\" (PMS). Its primary symptom is the angry projection of invincibility by its victim, and John Kerry, who's been occupying a seat in the Senate for the last two decades, appears to have a terminal case. \n \n Kerry, a privileged but neglected trust baby, hobnobbed with the rich and infamous Kennedy clan as a youngster and decided that one day, he wanted to follow in the footsteps of the original JFK. Fast forward 40 years, and, under the tutelage of his corpulent mentor, Teddy Kennedy, John F. Kerry is the Democrat presidential nominee. \n \n Unfortunately for Kerry, he does not have the advantage of having JFK's old man, Joe, on his team. The elder Kennedy massaged the Navy's official record of Jack's PT-109 debacle and had his version of the story released to the media, creating an instant \"hero\" and paving the way for JFK's ascension through the House and Senate to the presidency. \n \n Kerry, now gravely ill with PMS, thought he could ride high on his updated version of PT-109 and get away with it. But Ted Kennedy is no Joe Kennedy -- and Kerry, who built his whole campaign on a foundation of embellished wartime heroics, is now bogged down in his personal Vietnam quagmire. Indeed, Kerry assumed he was bulletproof, but he's taking far more hits now than he ever did in his abbreviated combat tour. \n \n The opening salvo:\n \n Last March, Demo National Committee loudmouth Terry McAuliffe (also in the tenacious grip of PMS) estimated that Kerry would have to win the hearts and minds of veterans in order to defeat George W. Bush. So he wrapped Kerry in his embellished war record and, a month later, took a cheap shot at President Bush, proclaiming that he was AWOL during his last year of service as an Air National Guard fighter pilot. \n \n Right about now, McAuliffe and Kerry are wishing they'd never fired that shot. Much to their surprise, several Vietnam veterans groups had the audacity to take a gander at Kerry's service record -- both his record of \"giving aid and comfort to the enemy\" by slandering his fellow veterans while they were still fighting or captive in Vietnam, and his contrived record of heroic acts as evidenced by his impressive list of military decorations. By early May, those veterans were firing back at Kerry and his cadre. \n \n Initially, Kerry took the defensive: \"I think a lot of veterans are going to be very angry at a president who can't account for his own service in the National Guard...criticizing somebody who fought for their country and served.\" (Oops, another cheap shot at our National Guard and Reserve forces.) \n \n Fortunately, President Bush can account for his service. He wanted to fly fighter jets, he earned his wings, and he logged many air defense hours in an F-102 Delta Dagger with the 147th Fighter Group and its subordinate 111th FIS, Texas ANG. Mr. Bush's unit was subject to rotation in Vietnam under the Palace Alert Program. In fact, 15 F-102 pilots were killed in Vietnam, but American involvement in that conflict was de-escalating by 1972, and Bush was honorably discharged from his service with the ANG. \n \n Of course, as noted in The Patriot many times before, George Bush's most distinguished military service has been in his role as Commander-in-Chief since the 9/11 attack on our nation -- one of the most difficult and challenging periods for any president since World War II. \n \n Implicit in Kerry's warning, however, is the notion that he, himself, volunteered for service in Vietnam. Remember Bill Clinton's repetitive \"Send me\" paean at the Demo Convention? Try again. Kerry's anti-military sentiments were well known when he was a student at Yale. After graduating, Kerry petitioned his draft board for a student deferment so he could study in -- where else? -- Paris. His deferment denied, Kerry then calculated that he could avoid Vietnam by joining the Naval Reserves, where he'd likely be able to serve stateside even if his unit was activated. Kerry's service record indicates that on 18 February 1966 he enlisted in the USNR under \"inactive\" status. This puts the lie to any assertion that Kerry \"volunteered\" for dangerous swift boat duty while George W. Bush somehow slunk off to fly fighter-jets. \n \n As fate would have it, Kerry's reserve unit was activated, while the President's ANG unit remained stateside -- yet both circumstances were far beyond the control of these two junior officers. As for Kerry's choice of Swift Boats, he told the Boston Globe last year, \"I didn't really want to get involved in the war. When I signed up for the swift boats, they had very little to do with the war. They were engaged in coastal patrolling....\" \n \n Four months and a heap of medals:\n \n Unable to avoid service in Vietnam, Kerry, infatuated with JFK and his mythical PT-109 heroics, worked his way into an assignment as a swift boat skipper. In under four months in the coastal regions of Vietnam, Kerry managed to collect a Bronze Star with combat \"V\", a Silver Star and, of course, the requisite three Purple Hearts -- which got him a quick ticket home to launch his political career. \n \n But his medals are melting. \n \n Regarding his Bronze Star Kerry claimed, at the Demo-confab, that he got the medal for actions on the night of 13 March 1969. It was then, he said, after a mine explosion and while under fire, that five swift boats in the patrol team fled the area while he kept his boat back to rescue Lt. James Rassmann. Kerry's campaign now admits that he fled while the other boats remained on station, and returned later to pull Rassmann out of the water -- the same Rassmann who'd been dumped into the water when Kerry's boat sped off. \n \n Regarding his Silver Star (the nation's third-highest decoration after the Medal of Honor and Service Crosses), it was awarded for \"gallantry\" after Kerry's boat was fired on and his gunner fired back, wounding a young combatant on the shore. Kerry then beached his boat (a reckless dereliction of duty), chased the wounded VC around the corner of a hut, and shot him. Gallantry? \n \n Further, Kerry's DD 214 Record of Transfer or Separation (posted on his website), lists a Silver Star with a combat \"V\" (for valor) -- but, according to the Navy Awards Manual, the \"V\" Combat Distinguishing Device is never awarded with the Silver Star. Stranger yet, Kerry's Silver Star has not one citation, but three -- each one a revision of the previous, and the last revision made more than 20 years after the first. \n \n For an excellent analysis of these altered citations, link to <http://kerry-04.org/war/citations.php< and read the report by Henry Mark Holzer, Professor Emeritus at Brooklyn Law School, and Erika Holzer, a lawyer and co-author, with Professor Holzer, of Fake Warriors: Identifying, Exposing and Punishing Those Who Falsify Their Military Service. (A second edition is forthcoming with a new preface entitled \"John Kerry: The Ultimate Fake Warrior.\") \n \n According to the Holzers, \"John Kerry may soon learn that three citations for a single Silver Star is two too many.\" \n \n One burning question yet to be answered is, who prepared the \"Personal Award Recommendations\" for these two decorations? In all probability, they were authored by Kerry himself -- whose embellishment of the details has now been questioned by credible witnesses. \n \n As for those three Purple Hearts, this week, Kerry has backed off of his first medal claim that he was hit by hostile fire, because it was discovered that he wrote in his journal nine days after the incident in question, \"We hadn't been shot at yet, and Americans at war who haven't been shot at are allowed to be cocky.\" Indeed, the injury in question (a small abrasion on his arm which was treated with the equivalent of Neosporin and a Band-Aid) was most likely self-inflicted, and Kerry's request for a Purple Heart was flatly rejected by both his treating physician and command -- until he re-applied through an alternate chain of command some weeks later. \n \n The circumstances around his second and third Purple Hearts are equally questionable. \n \n Portrait of a hero:\n \n Remember those heroic images of John Kerry in Vietnam in the introductory preceding his big entry at the Demo-confab? Well, Kerry reenacted those scenes, which his subordinates filmed with his Super-8 hand-held movie camera. The book \"Unfit For Command\" notes, \"Kerry would revisit ambush locations for reenacting combat scenes where he would portray the hero, catching it all on film. Kerry would take movies of himself walking around in combat gear, sometimes dressed as an infantryman walking resolutely through the terrain. He even filmed mock interviews of himself narrating his exploits. A joke circulated among Swiftees was that Kerry left Vietnam early not because he received three Purple Hearts, but because he'd recorded enough film of himself to take home for his planned political campaigns.\" \n \n Indeed, a few years back, Kerry's hometown paper, The Boston Globe (far left of The New York Times) noted his Vietnam self-portraits \"reveal something indelible about the man who shot them -- the...young man...so focused on his future ambitions that he would reenact the moment for film. It is as if he had cast himself in the sequel to the experience of his hero, John F. Kennedy, on the PT-109.\" \n \n Indeed he had. Thomas Vallely, one of Kerry's closest political advisers, said in an interview last year, \"John was thinking Camelot when he shot that film, absolutely.\" \n \n Seared into memory, or just pan-fried:\n \n There is plenty of additional evidence of Kerry's Vietnam fabrications, like his claimed exploits in Cambodia. \"I remember spending Christmas Eve of 1968 five miles across the Cambodian border being shot at by our South Vietnamese allies.... The absurdity of almost being killed by our own allies in a country in which president Nixon claimed there were no American troops was very real.\" Of course, Kerry was, by all accounts, never anywhere near Cambodia, and Nixon wasn't even president in 1968. So much for that \"memory that was seared, seared\" into him. \n \n The Kerry record is replete with examples of such \"seared memories.\" For example, this past MLK Day, Kerry told a captive audience, \"I remember well April, 1968 -- I was serving in Vietnam -- a place of violence -- when the news reports [of King's murder] reached me and my shipmates.\" Kerry wasn't even in Vietnam until November, 1968. \n \n Aid and comfort to the enemy:\n \n When Kerry returned stateside, he dedicated himself to slandering American military personnel still fighting -- and captive -- in Vietnam. In his 1971 congressional testimony, he claimed, \"[American military personnel in Vietnam] personally raped, cut off ears, cut off heads, taped wires from portable telephones to human genitals and turned up the power, cut off limbs, [blew] up bodies, randomly shot at civilians, razed villages in fashion reminiscent of Genghis Khan, shot cattle and dogs for fun, poisoned food stocks, and generally ravaged the countryside of South Vietnam in addition to...the normal and very particular ravaging which is done by the applied bombing power of this country.\" \n \n After his testimony, he told the media, \"There are all kinds of atrocities and I would have to say that, yes, yes, I committed the same kind of atrocities as thousands of other soldiers have committed....\" \n \n The consequences of Kerry's anti-American actions in 1971 were far-reaching. An upcoming documentary, \"Stolen Honor,\" includes devastating testimony from former POWs about how Kerry's testimony was \"thrown in their faces\" as they were tortured by their captors. Or, as POW Paul Galanti says in a devastating new Swiftees' ad, \"Kerry gave the enemy for free what we...took torture to try to avoid saying.\" \n \n Enter the Swiftvets: \n \n In his victory speech after the New Hampshire primary, Kerry said, \"I pledge that those who wore the uniform of the United States of America will have a voice and a champion in the Oval Office.\" (Of course, they do now!) However, Kerry is trying to silence \"those who wore the uniform of the United States of America\" who are challenging his record. Kerry was able to muster 14 swift boat vets who support him. On the other hand, there are 254 swift boat veterans who say Kerry is a fraud and is \"Unfit for Command.\" Do the math! \n \n The pundits think the Swiftees will disappear in September, after the Republican convention. We think they will remain a factor until Kerry sets his military record straight -- which he won't. \n \n It should be noted that The Patriot's position on Kerry's account of his service in Vietnam is tempered by the fact that our staff and National Advisory Committee rosters include many military veterans -- some of whom were decorated Vietnam vets and one of whom spent seven years as Ho Chi's guest in the Hanoi Hilton after his F-105 was shot down. He was subjected to all manner of torture while Kerry was busy accusing his \"fellow veterans\" of war crimes and meeting with VC Communists in Paris. \n \n In every case, our colleagues, who came home with Purple Hearts, also brought home injuries that left them, in most cases, badly scarred and mutilated; some will limp to their grave. They don't wear those medals on their lapels and don't ask for privileged parking spaces. They love their nation and served their countrymen with dignity, humility and honor. They are, in short, great American Patriots. \n \n John Kerry, on the other hand, is, at best, a phony and fraud. At worst, he is a traitor. Not only is he \"Unfit for Command,\" but he should be prosecuted for \"providing aid and comfort to the enemy in time of war\" and disqualified for public office. \n \n Please join more than 125,000 of your fellow Patriots who have already signed a letter asking that Kerry by held accountable for his actions. The Patriot will release this letter to the media in September, and though there would obviously be no action on this prosecution prior to Kerry's defeat in November (yes, we are confident he will be defeated), we believe he is not fit to serve in the Senate and should be removed. To sign the letter, link to -- <http://patriotpetitions.us/kerry/< \n \n Quote of the week...\n \n \"[T]hree Purple Hearts? I mean, the first one whether he ought to have a Purple Heart. He got two in one day -- [Kerry] never bled that I know of. They were all superficial wounds. As far as I know, he never spent one day in the hospital, I don't think he draws any disability pay. He doesn't have any disability. And he's boasting about three Purple Hearts, when you think of some of the people who really got shot up in Vietnam.... Maybe he should apologize to all the other two-and-a-half million veterans who served. He wasn't the only one who was in Vietnam. I think Senator Kerry needs to talk about his Senate record, which is pretty thin. That's probably why he's talking about his war record, which is pretty confused.\" --Retired Senator Bob Dole, who was severely wounded in action with the 10th Mountain Division in Italy during WW II \n \n _____ \n \n To DEFEND the voice of LIBERTY: Support The Patriot Fund -- <http://FederalistPatriot.com/support.asp< \n \n _____ \n \n On cross-examination...\n \n \"I saw some war heroes...John Kerry is not a war hero. He couldn't tie the shoes of some of the people in Coastal Division 11. His allegations that people committed war crimes in that unit, and throughout Vietnam, were lies. He knew they were lies when he said them, and they were very damaging lies.\" --John O'Neill, co-author, \"Unfit for Command,\" who became skipper of John Kerry's Swiftboat after Kerry collected his third Purple Heart in as many months for minor cuts and abrasions, and headed home to run for Congress. \n \n \"This is not a campaign to elect George Bush. It's a campaign to say John Kerry is unfit for command, period.\" --Jerome Corsi, co-author, \"Unfit for Command\" \n \n Open query...\n \n \"Maybe the media could put some of the energy they spend trying to discredit Mr. Kerry's critics into finding out the facts. Or don't they dare risk finding out?\" --Thomas Sowell \n \n The BIG lie...\n \n \"For 35 years I have stood up, and fought, and kept faith with my fellow veterans.\" --John Kerry to the VFW. \n \n From the Bush campaign journal... \n \n On Monday, President Bush reiterated his position on IRS 527 organization political advertisements: \"I said this kind of unregulated soft money is wrong for the process. And I asked Senator Kerry to join me in getting rid of all that kind of soft money, not only on TV, but used for other purposes, as well.\" \n \n Undeterred by the President's condemnation of 527 political advertising, John Kerry, in full panic mode after pollsters advised him that his marginal veteran support was waning, called out his big gun, former Senator Max Cleland, who lost three limbs in Vietnam when he picked up a live grenade during a non-combat exercise. In a shamelessly staged media event Wednesday, Cleland took a letter of protest to President Bush's Crawford, Texas, residence, and demanded that Bush specifically condemn the veterans groups hammering Kerry -- noting his \"outrage over these advertisements and tactics,\" and his \"pain from seeing these slanderous attacks.\" \n \n (This, by the way, would be the same Max Cleland who was appointed in 2003 by President Bush to show up at occasional board meetings of the Export-Import Bank of the United States and pocket $150,000 a year through 2007 for his effort. We're currently checking into the legality of Ex-I Bank board members acting as campaign lobbyists.) \n \n Shortly after being greeted at a security gate, Cleland left and later told the media, \"I tried to deliver a letter to the president's home and hand it to either him or one of his aides, but that was unsuccessful\" -- which ensured the letter's contents would get plenty of Leftmedia airtime. Of course, like the Kerry war record he's trying to cover, Cleland's claim was greatly embellished. \n \n Cleland was, in fact, met at the security gate by another Vietnam veteran, Jerry Patterson, who was asked to formally accept Cleland's letter. \"I tried to accept that letter and he would not give it to me,\" said Patterson. \"He would not face me. He kept rolling away from me.\" \n \n Of course, Kerry's braying about the drop-in-the-bucket 527 ads by the Swiftees, and his complaint they have links to the Bush administration, fully affirms our assertion that there is no limit to his hypocrisy. As prevaricators go, Kerry is a match for Bill Clinton. \n \n The fact is, Kerry's 527 groups like MoveOn.org, Campaign for America's Future, Joint Victory Campaign and some 30 other Demo fronts (some of which receive legal counsel from Kerry and DNC lawyers) have raised more than $185 million in soft money for Kerry. And talk about connections, America Coming Together's spokesman is former Kerry campaign manager Jim Jordan, and Media Fund is run by Clintonista Harold Ickes. \n \n According to the Center for Responsive Politics, 21 of the 22 individuals who have contributed at least $500,000 to 527s have donated a cumulative $56.7 million to Demo-groups -- folks like Peter Lewis ($14 million), George Soros ($12.6 million) and Steven Bing ($8.1 million). By contrast, only one of the major donors has supported 527s with a conservative message -- Carl Lindner ($1.02 million). \n \n Did we mention all the union graft flowing into Demo-coffers and all the mileage Kerry as gotten out of crockumentaries like Michael Moore's \"Fahrenheit 9/11?\" Of course, the value of the Leftmedia's biased reporting against Bush is incalculable. Newsweek's Evan Thomas tried to calculate it a few weeks back, however, when he said, \"The media, I think, want Kerry to win. And I think they're going to portray Kerry and Edwards...as being young and dynamic and optimistic and all, there's going to be this glow about them that...collectively, the two of them, that's going to be worth maybe 15 points.\" \n \n By comparison, the Swifty vets have raised about $2 million for advertising their opinion about John Kerry's qualifications to be Commander-in-Chief. \n \n So has candidate Kerry stepped up to condemn 527 advertising as he was challenged to do by President Bush? Columnist Zev Chafets said it best: \"On Monday, Dubya hitched up his jeans, sauntered out to a press conference and allowed as to how he'd be glad to help his worthy opponent...shut down...all 527 groups. Just say the word, Sen. Kerry, and we'll take all the nasty dollars out of politics. But Kerry hasn't said that word. His entire campaign finance structure is predicated on 527 money. Of the top ten soft donors, nine are Kerry supporters. For Bush, soft money is just a dab of Texas perfume; for Kerry, it's oxygen.\" \n \n On Thursday, in an excellent strategic move, President Bush joined forces with John McCain and threatened to sue the FEC over their failure to shut down 527 organizations. While The Patriot did not and does not support so-called campaign-finance reform, clearly what Bush and McCain are doing is setting up Kerry for a fall. As noted above, Kerry has spent the last month howling about 527s (because one of them has cost him significant support). But Kerry's 527s are getting ready to launch millions of dollars in salvos against George Bush next week. By stepping up to the plate with McCain, President Bush has preempted that salvo, and Kerry will now look more like the hypocrite he is unless he aggressively joins Bush in condemning Leftist 527s. \n \n From the JFK DEMO-lition derby... \n \n Mark Alexander's column calling on John Kerry to be prosecuted for providing \"Aid and comfort to the enemy\" [ <http://kerry-04.org/war/record.php<] provides substantial evidence of Kerry's coddling of Vietnamese Communists. The evidence continues to mount. \n \n Several Vietnamese-Americans are suing the University of Massachusetts (Boston) for discrimination in denying them fellowships to study the \"Vietnamese Diaspora\" -- those who fled the Communist government in the years following the Vietnam War. One of the plaintiffs, Bui Diem, is the former Ambassador to the United States from South Vietnam. Another plaintiff, Luyen Huu Nguyen, was a Captain in the South Vietnamese Army and was captured by the Communists in 1966 and tortured in a re-education camp in Vietnam for 21 years. Nguyen was arrested twice more trying to escape the regime and spent two more years in prison before moving to the U.S. \n \n Not only did the University exclude many South Vietnamese refugees (the plaintiffs allege) but in fact awarded its fellowships to two Communist scholars from the Socialist Republic of Vietnam -- scholars whose sympathies lie with the oppressive Communist regime from which the South Vietnamese fled. Many in the refugee community describe it as equivalent to hiring Nazis to study Jewish refugees from Germany after World War II. \n \n What does this have to do with John Kerry? He sides with the University, of course, commending them by letter for \"[c]hoosing two established and accomplished scholars from Vietnam.\" While Kerry's embellished military service claims are subject to dispute, there is little question about his record when it comes to coddling Vietnamese Communists. \n \n \n", 
   {}, 
   64488, 
   null, 
   1093641000.0
  ], 
  [
   64498, 
   null, 
   "dsadevil", 
   "Jim, I do wish you would read that post I made awhile back on the ease of distorting the truth. That federalist post is absolutely laughable on so many counts, I don't have time to run through them all.\n \n My faves:\n \n Regarding his Silver Star (the nation's third-highest decoration after the Medal of Honor and Service Crosses), it was awarded for \"gallantry\" after Kerry's boat was fired on and his gunner fired back, wounding a young combatant on the shore. Kerry then beached his boat (a reckless dereliction of duty), chased the wounded VC around the corner of a hut, and shot him. Gallantry? \n\n One mans \"reckless derelection\" is anothers \"innovative combat tactics.\" (and lo and behold, the Navy agrees with the latter). For the record, the VC was carrying a grenade launcher that could easily have blown Kerry's boat out of the water. When he ran for cover, the odds were he was getting ready to fire a shot at the boat (that being what enemy combatants tend to do). Hence, Kerry saved his entire boat crew from death by that action. And since neither Thurlow, O'Neill, or ANYONE ELSE in SVBT was there, I cannot FATHOM where they are getting these accounts, aside from making it up, which seems to be their forte.\n \nOne burning question yet to be answered is, who prepared the \"Personal Award Recommendations\" for these two decorations? In all probability, they were authored by Kerry himself -- whose embellishment of the details has now been questioned by credible witnesses. \n\n In all probabilty? Not a SHRED of evidence has been presented to support that. This is a claim that has been tossed around with NOTHING to support it aside from random insinuations by SBVT. The only question is why didn't THURLOW write these reports, as he was the commanding officer and it was his responsibilty. Blaming it on Kerry is a nice responsibilty dodge, but it hasn't had any support brought up to support it.\n \nWhen Kerry returned stateside, he dedicated himself to slandering American military personnel still fighting -- and captive -- in Vietnam. In his 1971 congressional testimony, he claimed, \"[American military personnel in Vietnam] personally raped, cut off ears, cut off heads, taped wires from portable telephones to human genitals and turned up the power, cut off limbs, [blew] up bodies, randomly shot at civilians, razed villages in fashion reminiscent of Genghis Khan, shot cattle and dogs for fun, poisoned food stocks, and generally ravaged the countryside of South Vietnam in addition to...the normal and very particular ravaging which is done by the applied bombing power of this country.\" \n\n I've heard alot of outrage about this. What I haven't heard is anyone seriously contesting its validaty. TNR 8/26/04\n \nCalling Kerry unpatriotic is a useful way of delegitimizing his allegations without disproving them. Some of the organizers of the Winter Soldier Investigation have been discredited, but most of the testimonies themselves have not. Miami University Professor Jeffrey Kimball, one of the most respected Vietnam historians, says, \"On the whole, the Winter Soldier Investigations established that some Americans committed atrocities in Vietnam. Claims that their testimony has been discredited are unwarranted.\" Another prominent historian of the war, Wayne State University's Mel Small, says, \"Most of the evidence of atrocities presented by the [Winter Soldier] vets remains unchallenged to this day.\" \n \n On the question of atrocities more broadly, Kerry's claims also find widespread academic support. The University of Kentucky's George Herring, author of America's Longest War, says, \"The atrocities that took place are pretty much those described by Kerry in 1971.\" In a recent interview with The Boston Globe, Stanley Karnow, author of Vietnam: A History, also said Kerry got it right. Even Robert McNamara himself has stated that \"there were atrocities, without any question. ...\"\n\n \n That entire post is pathetic propoganda. In debate-lingo, we'd call it a blip spread, so many unwarrented assertions there isn't time to deal with all of them.\n \n Moving to your stuff, its a step up (though barely).\n First of all, though I agree that being part of the same tactical group gives you some claim to know what's going on, the closer one is to the actual item/event/person one is reporting on, the more credance we can give to their report. Thus, when the people ON Kerry's boat say one thing and those OFF it say another, I'm inclined to go with the people who were closer. His \"commanding officers\" weren't on ANY boat, so I don't have the foggiest idea where they are coming from except a pathetic attempt to discredit someone who showed the abuses of the US armed forces in Vietnam.\n \nIf you'll pay attention to what O'neal said to Nixon, you'll find that he said he was near Cambodia, not in it.\n\n From the Nixon Tapes:\n \"John O'Neill and Richard Nixon in the Oval Office, June 16, 1971: \n \n O'NEILL: I was in Cambodia, sir. I worked along the border on the water. \n \n NIXON: In a swift boat? \n \n O'NEILL: Yes, sir.\"\n At best, he was on the border a few yards away, which is STILL disproves his statement that they were never closer than 50 MILES from the border.\n \n \nIs it just Kerry's account we are to believe? The doctor that treated Kerry's first wound has made his statements. The hospital tech that signed Kerry's medical treatment report was not a doctor. \n\n Its Rassmussen's account. And without ANY supporting documentation to back him up, I don't find Letson credible. Certainly remembering the specific details from one random injury report 30 years seems kind of sketchy to me.\n \nI can't speak to the initials on the papers as I have not seen the originals. As Kerry has proved, files can be manipulated. Why is the assertion unwarranted?\n\n When has Kerry \"proved\" that? \"unwarrented\" means \"without supportive factual/analytical evidence.\" None has yet been provided (see above).\n \nKerry's group has admitted he wasn't under fire that time. Remember now? Kerry wrote in his diary some days later that they had not been under fire yet. This is just one of the recent concessions from the Kerry campers.\n\n Nope actually. Haven't heard a thing about it. Link me?\n \nKerry's main claim to fame is his service in Vietnam. This is by his own choosing. It is then to be expected that people who disagree with the claims of greatness will attack those claims. It's concievable that Kerry's brief stint in Vietnam was for the sole purpose of establishing a \"PT-109\" legend for future use. Kerry didn't exactly volunteer for the most hazardous duty either. When he joined the swiftboats, he thought he'd be patrolling non-combat areas.\n\n Contradictory. Either he was an egomaniac with presidential ambitions who deliberately wanted to get wounded in a hero story (which, in addition to being implausable, means he would request hazardous duty), or he volunteered for relatively tame duty that odds are wouldn't have been fodder for a future politcal career. This entire thing reveals a degree of paranoia that exceeds any of the stuff the Deaniacs spouted about our war in Iraq.\n \n \nBush hasn't tried to make an issue of his military service. He was attacked before on the same issue and it fell through. He got an honorable discharge from the National Guard.\n\n Saying \"Bush got an honorable discharge\" is the same thing as saying \"Kerry won a silver star, and bronze star, and three purple hearts.\" That's official record, the question is was the record correct? SBVT thinks that Kerry shouldn't have gotten those awards and the Navy screwed up. Mike Moore et. al believes that Bush shouldn't have gotten an honorable discharge and should have been considered AWOL.\n And the allegations never \"fell through\" they were just kinda forgotten about. In terms of overall credibilty, the Bush AWOL story exceeded SBVT on several accounts (validity of sources, the main one being a retired General from Alabama, who odds are, is not a flaming liberal; and support of official record, which unlike in Kerry's case BOLSTERS the case against Bush rather than undermining it). But you'll notice that despite that, I haven't started 50 threads on that, because it is, IMO, tangental to the important issues at hand.", 
   {}, 
   64490, 
   null, 
   1093644600.0
  ], 
  [
   64525, 
   null, 
   "CCR1994", 
   "A gentle reminder. Although it is preferable for campaign or political ads to deal with issues, the 1st Amendment makes no distinction regarding the content of speech. I fear that McCain-Feingold is only the beggining. After this election, who knows what will come next.", 
   {}, 
   64498, 
   null, 
   1093652400.0
  ], 
  [
   64537, 
   null, 
   "jskufan", 
   "The way I see it, The Republicans have spent 100% of their energy trying to discredit John Kerry for events that transpired 30+ years ago when he was a 19-20 year old man. Just about all the criticism of George Bush from the Democrats has focused on his performance as President over the last 4 years. Does anyone else see the difference here?", 
   {}, 
   64525, 
   null, 
   1093656300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  More MoveOn.org smear ads", 
  "url": "http://www.4forums.com/political/politics-debates/3032-more-moveon-org-smear-ads.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3032, 
  "discussion_files": [
   [
    "16210.html", 
    "http://www.4forums.com/political/politics-debates/3032-more-moveon-org-smear-ads-print.html"
   ], 
   [
    "16211.html", 
    "http://www.4forums.com/political/politics-debates/3032-more-moveon-org-smear-ads-2-print.html"
   ]
  ], 
  "identifier": 3032
 }
]