[
 [
  [
   65201, 
   null, 
   "Duo_Maxwell", 
   "This is primarily for Americans, a thousand apologies to everyone else.\n \n Do you support international and domestic welfare? \n \n Yes or No?\n \n There's a depedent question that follows this so think about it.", 
   {
    "post_info": {
     "post_title": "Welfare"
    }
   }, 
   null, 
   null, 
   1094022840.0
  ], 
  [
   65202, 
   null, 
   "faeden", 
   "This is primarily for Americans, a thousand apologies to everyone else.\n \n Do you support international and domestic welfare? \n \n Yes or No?\n \n There's a depedent question that follows this so think about it.\n\n \n \n I support using our wealth to influence global events and opinions. For example, the money we provide to Egypt used to be worth it. Peace in the Suez Canal area and the resulting free-flow of commerce was much more cost efficient than physical and/or military influence (control) could have been. What is wrong with international AND domestic welfare is that there is no end-game. We don't place limits or conditions on our largess, as we should. These types of welfare should have been fazed out by now and the same funds could be better applied to areas like China or Africa.\n \n By itself, international and domestic welfare are legitimate and often wize tools to protect our interests.\n \n P", 
   {
    "post_info": {
     "post_title": "grey area"
    }
   }, 
   65201, 
   null, 
   1094023620.0
  ], 
  [
   65209, 
   null, 
   "Rick", 
   "No, but I don't mind domestic funds out of voluntary hands.", 
   {}, 
   65202, 
   null, 
   1094033880.0
  ], 
  [
   65296, 
   null, 
   "Duo_Maxwell", 
   "hmmmm...not quite the exposure I expected. I'll wait for some other people to post before posting the 2nd question.", 
   {}, 
   65209, 
   null, 
   1094081940.0
  ], 
  [
   65348, 
   null, 
   "emclean", 
   "it will depend on what is consitered welfair. is the pay for not growing crops welfair, and what of forgiving debt?\n \n any hand out is not helpful to the person, or the country. when some one is having problems making ends meat, they need a hand up, help improving themselvs, not a never ending gift from the goverment.", 
   {}, 
   65296, 
   null, 
   1094138640.0
  ], 
  [
   65414, 
   null, 
   "Mach", 
   "Giving money to the lowest income range in the nation? \n \n Giving to who exactly? Is philanthropy \"welfare\"? Or is it government funded welfare we're siding for or against? I need some more input please Duo!\n \n In general, I think there is good welfare and bad welfare. Some welfare does more harm long-term than the immediate help it offers. Tearing down a persons drive or struggle can be a life-long thing. But there are ALWAYS cases of legitimate suffering that isn't within a persons control. There is also the welfare that we use regardless of the good or bad it does (maybe mostly in international), just to win an ally or to otherwise, benefit the nation in some other way. Finally, political parties might use welfare to gain votes, so they might do other \"good things\" while in office. \n \n I support good welfare, so I suppose technically that's a yes I FREAKING LOVE WELFARE AND SUPPORT IT ALWAYS according to Bush monkeys, but a \"qualified yes, but only good welfare\" if you are smart enough to understand Kerry's platform ;)\n \n -Mach", 
   {
    "post_info": {
     "post_title": "welfare"
    }
   }, 
   65201, 
   null, 
   1094182560.0
  ], 
  [
   65418, 
   null, 
   "Master_Shake", 
   "This is primarily for Americans, a thousand apologies to everyone else.\n \n Do you support international and domestic welfare? \n \n Yes or No?\n \n There's a depedent question that follows this so think about it.\n\n \n Not to be unresponsive, but could you please be more specific in defining welfare? Does this include corporate welfare? Crop Rotation stuff as emclean stated? Other farming subsidies?", 
   {}, 
   65201, 
   null, 
   1094183580.0
  ], 
  [
   65421, 
   null, 
   "daewoo", 
   "I am all for public welfare. It is cheaper to pay off the unwashed masses than it is to kill them. Welfare in this country is designed to keep people from reaching the point where they kill you and take your money. Heavily armed securty guards are expensive.\n \n As far as international welfare, I frankly think there are better agancies than the US government to administer it. Why would we send 500 singer sewing machines to parts of kenya that have no power?\n \n Just like everything else, the governemnt has screwed up our international aid system. \n \n \n is the pay for not growing crops welfair, \n \n \n farm subsidies are a type of welfare, but not for the farmer. Farm subsidies exist because the government, in its infinite wisdom, has decided that we need cheap food. I think that many, if not most, farmers would prefer to sell their crops and beef at fair market value rather than having the massive subsidies system in place that we now do. It is all just a big price control scheme.", 
   {}, 
   65414, 
   null, 
   1094184600.0
  ], 
  [
   67072, 
   null, 
   "theLIBERTARIAN", 
   "I am all for public welfare. It is cheaper to pay off the unwashed masses than it is to kill them. Welfare in this country is designed to keep people from \n\n \n I thought you were going to say &#8220;working&#8221; after that. LOL\n \n I am against payouts in this form. It promotes poverty (Hey, you had better not work). It also destroys the family (Hey, don&#8217;t live with anyone that works). I have seen this first hand and did not realize it until many years later when a friend told me that it breaks up families. At first I did not know what he was talking about, but then realized he was right.\n \n \nI am all for public welfare. It is cheaper to pay off the unwashed masses than it is to kill them. Welfare in this country is designed to keep people from reaching the point where they kill you and take your money. Heavily armed securty guards are expensive. \n\n \n I have not seen a study like that. I have seen studies that describe the cost of the drug war in regards to theft. \n \n \n As far as international welfare, I frankly think there are better agancies than the US government to administer it. Why would we send 500 singer sewing machines to parts of kenya that have no power? \n\n \n Great question and observation.\n \n \n Just like everything else, the governemnt has screwed up our international aid system. \n\n \n We tend to like puppets that we can work with. The question is: Who is &#8220;we&#8221;? Why would we support dictators like Noriega, or Marcos, or Saddam, or the Shah&#8230;?\n \n \n farm subsidies are a type of welfare, but not for the farmer. Farm subsidies exist because the government, in its infinite wisdom, has decided that we need cheap food. I think that many, if not most, farmers would prefer to sell their crops and beef at fair market value rather than having the massive subsidies system in place that we now do. It is all just a big price control scheme.\n\n \n I think you are right. It takes money and time to apply for any subsidy. I don&#8217;t like to see productive people waste time applying for handouts. They need to study the regulations, determine if it is better to not grow their crop or grow it. Should they hire an attorney to fill the paperwork out? Pay an accountant to fill in the blanks? \n \n Who does it benefit? I think it benefits the larger corporate farmers who have the money and time to investigate these matters. Meanwhile the less wealthy farmer slaves away not realizing his tax money supports his competitors. \n \n Who does it hurt? All regulations (maybe somebody can point one out that does not) hurt poor people. Poor people have less funds to purchase Peanut Butter that is artificially inflated due to limited production in the US. They have less money to buy milk that has minimum wholesale price controls. They have less money to purchase inflated produce because less food in grown than otherwise would have. \n \n \n \n Dae, I can&#8217;t think of one welfare program I support. Like Rick, I believe people should be free to give their money to any charity they wish.", 
   {}, 
   65421, 
   null, 
   1095235440.0
  ], 
  [
   67198, 
   null, 
   "Duo_Maxwell", 
   "any form of free handouts.", 
   {}, 
   67072, 
   null, 
   1095327240.0
  ], 
  [
   67229, 
   null, 
   "kickin50", 
   "This is primarily for Americans, a thousand apologies to everyone else.\n \n Do you support international and domestic welfare? \n \n Yes or No?\n \n There's a depedent question that follows this so think about it.\n\n \n Okay. I'll give a straight answer, if only because I want to hear the second question.\n \n I'll assume that by \"domestic welfare\" you mean cash given directly to needy individuals. Yes. Of course. There will always be those among us who are down on their luck. Agreed, some are working the system. Some people's luck is of their own making. BUT the bottom line is, we can't let children starve in our streets. Until we find a way to weed the truly needy from the rest........\n \n If by \"international welfare\" you mean money given to individuals or organizations or even governments to care for their needy, I'm okay with that too. It's called charity. It won't hurt us to build a few schools or hospitals. We, as a country, like to tout our good will and desire to help the world. Put your money where your mouth is.\n \n If by \"international welfare\" you mean money given to a government in the hope of buying their favor, that's neither welfare nor charity. In some situations, it may be wise but I'd have to answer on a point by point basis.", 
   {}, 
   65201, 
   null, 
   1095353220.0
  ], 
  [
   67250, 
   null, 
   "jitobear", 
   "I agree with Kckin on the domestic welfare, but I would like to see programs greatly improved to do a better job of promoting independence and weeding out abusers. And there is no excuse whatsoever for the richest nation in the world to allow any children within it's borders to starve.\n \n International help as we can afford it.\n \n I am all for helping small businesses - but handouts to large corporations is like Paris Hilton going on the dole.", 
   {}, 
   67229, 
   null, 
   1095363120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Welfare", 
  "url": "http://www.4forums.com/political/politics-debates/3084-welfare.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3084, 
  "discussion_files": [
   [
    "26852.html", 
    "http://www.4forums.com/political/politics-debates/3084-welfare-print.html"
   ]
  ], 
  "identifier": 3084
 }
]