[
 [
  [
   65232, 
   null, 
   "Sigma", 
   "From: http://story.news.yahoo.com/news?tmpl=story&cid=1896&ncid=1896&e=1&u=/nm/20040821/us_nm/campaign_kerry_dc\n \n \n \nFormer Swift Boat Commander Backs Kerry on Vietnam\n \n Sat Aug 21, 7:47 PM ET Add U.S. National - Reuters to My Yahoo! \n \n \n By Carol Giacomo \n \n PITTSBURGH (Reuters) - An American journalist who commanded a boat alongside John Kerry (news - web sites) in Vietnam broke a 35-year silence on Saturday and defended the Democratic presidential candidate against Republican critics of his military service and integrity. \n \n \n Reuters Photo \n \n \n AP Photo \n Slideshow: John Kerry \n \n \n \n \n Weighing in on the bitterly divisive issue, William Rood of the Chicago Tribune said the tales told by Kerry's detractors are simply untrue. \n \n \n \"There were three swift boats on the river that day in Vietnam more than 35 years ago -- three officers and 15 crew members. Only two of those officers remain to talk about what happened on February 28, 1969,\" he wrote in a story on the newspaper's Web site. \n \n \n \"One is John Kerry ... who won a Silver Star for what happened on that date. I am the other.\" \n \n \n Before now, Rood refused all interviews, wanting to put memories of war and killing behind him. \"But Kerry's critics, armed with stories I know to be untrue, have charged that the accounts of what happened were overblown,\" he wrote. \n \n \n \"It's gotten harder and harder for those of us who were there to listen to accounts we know to be untrue, especially when they come from people who were not there,\" he added. \n \n \n Kerry, a former Navy lieutenant, is a highly decorated Vietnam veteran, and his war service is essential to his challenge to President Bush (news - web sites) as commander-in-chief when America is facing terrorism and other threats. \n \n \n Increasingly, veterans opposed to Kerry and allied with Bush, led by a group called Swift Boat Veterans for Truth, have tried to undermine Kerry's record and credibility. \n \n \n Many veterans are bitter that after returning from Vietnam, Kerry became one of the war's most prominent critics. \n \n \n After a new CBS poll showing Kerry's support among veterans slipping since the Democratic convention, the Massachusetts senator launched a counterattack. \n \n \n On Friday, he accused the Swift Boat Veterans for Truth of collaborating with the Bush campaign and asked the Federal Election Commission (news - web sites) to force the group to withdraw its ads. \n \n \n Bush spent the war in the United States serving in the Texas Air National Guard. Some Democrats accuse Bush of going absent without leave from the guard, citing gaps in his attendance record. \n", 
   {
    "post_info": {
     "post_title": "Commander breaks silence"
    }
   }, 
   null, 
   null, 
   1094054100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Commander breaks silence", 
  "url": "http://www.4forums.com/political/news-forum/3088-commander-breaks-silence.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 3088, 
  "discussion_files": [
   [
    "12505.html", 
    "http://www.4forums.com/political/news-forum/3088-commander-breaks-silence-print.html"
   ]
  ], 
  "identifier": 3088
 }
]