[
 [
  [
   65460, 
   null, 
   "thebootfitter", 
   "What would it mean to you if Jesus the Christ of the Gospels did not exist on this earth as an actual human being? If this allegedly divine being was never physically present on earth and did not actually suffer and die on a cross?\n \n Just consider for a moment what this would mean to you in your journey through life... \n \n Would it devastate you?\n Would it allow you to be more free?\n Would it significantly change the manner in which you live your life?\n \n If you have never done so, I encourage you to consider the possibility... because no matter how hard you BELEIVE in something, it may or may not coincide with reality. IF the reality is that Jesus the Christ of the Gospels existed as described in the Gospels, then he existed. IF the reality is that he did not exist, then he did not exist. Belief one way or another cannot change the reality of what is.\n \n I'm interested in hearing from all perspectives...", 
   {
    "post_info": {
     "post_title": "What would it mean to you?"
    }
   }, 
   null, 
   null, 
   1094233800.0
  ], 
  [
   65461, 
   null, 
   "Kronus", 
   "There's a third possibility that you didn't mention, which is the position that I hold. Jesus existed, but just as a human being. He preached peace and religious reform, stepped on the wrong toes, and was executed for being a trouble maker. The divinity stuff was tacked on later by his followers.\n \n If it turns out he never existed at all, it wouldn't change things for me. If the messages that are attributed to Jesus are actually a composite from many people, the messages are still the same. A message is good because of its content, not because of its source.", 
   {}, 
   65460, 
   null, 
   1094235000.0
  ], 
  [
   65465, 
   null, 
   "thebootfitter", 
   "There's a third possibility that you didn't mention...\n\n True. In fact, there are many possibilities that I did not mention.", 
   {}, 
   65461, 
   null, 
   1094236800.0
  ], 
  [
   65488, 
   null, 
   "Ladywolf", 
   "I believe as Kronus does.\n \n Except for one fact: if Jesus didn't ever exist, there wouldn't be Cristians running around knocking on my door trying to turn me into a believer.", 
   {}, 
   65465, 
   null, 
   1094250900.0
  ], 
  [
   65494, 
   null, 
   "thebootfitter", 
   "Except for one fact: if Jesus didn't ever exist, there wouldn't be Cristians running around knocking on my door trying to turn me into a believer.\n\n This statement is not necessarily true. It is quite conceivable that a physical person of Jesus as described in the Gospels did not exist, but rather was a fictional character that a community of individuals came to believe was an actual historical person over time. The Christians knocking on your door today do not depend on the truth of a historical Jesus, but rather just the BELIEF in a historical Jesus of Nazareth as described by the Gospels.", 
   {}, 
   65488, 
   null, 
   1094252520.0
  ], 
  [
   65496, 
   null, 
   "epaphras_faith", 
   "I believe there would be no hope.\n \n There is too much dismay, mayhem, and difficulty to have nothing real that can deal with it. We often like to think humans can deal with it if we jsut know enough. Is that really true. Our knowledge far excedes those of the time Jesus was on the earth and our world is far less safe.", 
   {}, 
   65494, 
   null, 
   1094252940.0
  ], 
  [
   65539, 
   null, 
   "montalban", 
   "I believe as Kronus does.\n \n Except for one fact: if Jesus didn't ever exist, there wouldn't be Cristians running around knocking on my door trying to turn me into a believer.\n\n So you think no other religion would come knocking? I take it that the Hare Krishna's don't jump up and down your city streets.\n \n The fact Jesus Christ does exist makes this thread a rather strange exercise.", 
   {
    "post_info": {
     "post_title": "I'm aware of the irony of posting here"
    }
   }, 
   65488, 
   null, 
   1094299320.0
  ], 
  [
   65540, 
   null, 
   "montalban", 
   "There's a third possibility that you didn't mention, which is the position that I hold. Jesus existed, but just as a human being. He preached peace and religious reform, stepped on the wrong toes, and was executed for being a trouble maker. The divinity stuff was tacked on later by his followers.\n\n If this is true, then it's a pity you were absent from Mizmaxx's thread \"Harry Potter is more popular than Jesus\" thread.\n \nIf it turns out he never existed at all, it wouldn't change things for me. If the messages that are attributed to Jesus are actually a composite from many people, the messages are still the same. \n\n How would it 'turn out that he never existed at all'? Are you expecting some proof of non-existence?\n \nA message is good because of its content, not because of its source.\n\n That would depend on the message. If you claimed to be able to levitate, but offered no proofs, then your message would be tied into the source - if you lack credibility, or not.\n Jesus was not just here to provide 'a messge'. He was not a lifestyle guru with a really neat attitude to life. He was the Son of God.", 
   {}, 
   65461, 
   null, 
   1094299560.0
  ], 
  [
   65550, 
   null, 
   "Kronus", 
   "\n How would it 'turn out that he never existed at all'? Are you expecting some proof of non-existence?\n \n\n You clearly missed the part where thebootfitter was proposing a hypothetical.\n \n \n\n Jesus was not just here to provide 'a messge'. He was not a lifestyle guru with a really neat attitude to life. He was the Son of God.\n \n\n And again, you're missing the point of the thread.", 
   {}, 
   65540, 
   null, 
   1094310600.0
  ], 
  [
   65660, 
   null, 
   "montalban", 
   "You clearly missed the part where thebootfitter was proposing a hypothetical.\n And again, you're missing the point of the thread.\n\n No, I didn't miss it. I question the reason for this hypothetical. Someone who is anti-Christian might get a kick out of it; dreaming that Christians might all be wrong\n \n It makes as much sense as asking astronomers what would they think if the moon really did contain cheese; would it affect their beliefs in astronomy?\n \n It is therefore a rather pointless exercise.\n \n PS Why have you still not answered my questions on \"The Cross\" thread?", 
   {}, 
   65550, 
   null, 
   1094362560.0
  ], 
  [
   65727, 
   null, 
   "Tastyfish", 
   "Why would it be any different? The fact that a large number of people feel that this is the case anyway seems to imply that there wouldn't be vast difference.\n Perhaps a better point would how would the world differ if everyone was held that view? And again, I still don't think there would be a vast difference. Personally I doubt a large number of people are only held in check by religious beleifs and would get to all kinds of evil things otherwise.", 
   {}, 
   65660, 
   null, 
   1094432340.0
  ], 
  [
   65833, 
   null, 
   "thebootfitter", 
   "No, I didn't miss it. I question the reason for this hypothetical. Someone who is anti-Christian might get a kick out of it; dreaming that Christians might all be wrong...\n\n You question the reason for a hypothetical??? Sorry, but there need not be a reason for a hypothetical question. I'm curious... that's enough.\n \n Though you certainly aren't required to do so in order to participate on this thread, you haven't answered the question: What would it mean to you?\n \n Consider the possibility that everything you've been taught... everything you currently believe about Jesus the Christ is the result of something other than an actual historical figure. No matter how strongly you believe that Jesus walked on this earth as a human, that possibility is certainly valid. I'm just curious what it would mean to you. Do you not ever question seemingly absurd possibilities? I think it's quite fun, myself! :-)\n \n I suspect that it would rock the very foundation of life for a lot of Christians. For other Christians, I don't believe it would be much of an issue.\n \n \n \n \n \nWhy would it be any different? The fact that a large number of people feel that this is the case anyway seems to imply that there wouldn't be vast difference.\n Perhaps a better point would how would the world differ if everyone was held that view? And again, I still don't think there would be a vast difference. Personally I doubt a large number of people are only held in check by religious beleifs and would get to all kinds of evil things otherwise.\n\n Just for clarification, I wasn't asking what difference it would make in the world or in society... but what difference would it make to you as an individual.", 
   {}, 
   65660, 
   null, 
   1094512320.0
  ], 
  [
   65888, 
   null, 
   "unkerpaulie", 
   "i think it would greatly change the behavior of most people that believe God exists. for many, me included, it would be a huge relief in that my range of behavior wouldnt have to be strictly limited by the instructions of the bible. as a result, ex-believers with this new-found \"freedom\" might run amok, causing an increase in immorality and respect for life in general. then again, there are christians that whole-heartedly want to believe that God exists, and would be devastated by the news, falling into severe depressino. more than that, most christians will undoubtedly brush aside such reports as typical anti-christian science and deny such claims to be true, strengthening their faith even more.\n \n as kronus said, i think its important to consider that jesus may have been an ordinary man with a very strong conviction of his belief (possibly extremely self-deluded), to the extent that he could get all these people to go along with him. the gospels would then be nothing more than exagerated versions of the life of this charismatic guy. the fact that he challenged the norms, including the religious and political establishments, would be highly notable. his style was subliminally revolutionary, and unorthodox to what everybody else was accustomed to. to them, it would have been like God himself in the form of a man.\n \n for me, it would raise a lot of questions: if jesus wasnt the son of God, then what of the prophecies and signs that pointed to his arrival and actions? and how did he figure he should fulfill the prophecies (which he would have been aware of, since he was a scripture scholar of his day)? and why would he say he was the son of God? and more than that, how come nobody else has since made that claim? and what made the crowd stupefied into seeing things that never occured (miraculous works)? how does the entire bible story pan out in the light that jesus, the christ, was never anything more than jesus, the brazen motivational speaker?\n \n by extension, did God ever exist? or was this whole God thing a perpetuation of delusion?", 
   {}, 
   65833, 
   null, 
   1094573400.0
  ], 
  [
   65897, 
   null, 
   "thebootfitter", 
   "@unkerpaulie -- You raise a lot of interesting questions... If you're interested in exploring some potential answers to these questions from one particular point of view, I'd encourage you to check out this website:\n \n http://pages.ca.inter.net/~oblio/home.htm\n \n Please note that I am not suggesting that Earl Doherty has all the answers or that his answers are the right ones. But he does have a perspective that is not often considered (at least not by Christians). And his conclusions are certainly within the realm of possibilities.", 
   {}, 
   65888, 
   null, 
   1094578140.0
  ], 
  [
   65903, 
   null, 
   "billsco", 
   "\n Please note that I am not suggesting that Ed has all the answers or that his answers are the right ones. But he does have a perspective that is not often considered. And his conclusions are certainly within the realm of possibilities.\n\n \n \n I'm sure you meant to say Earl, as in Earl Doherty, author of the piece you linked to. Thank you for pointing out his work. I have read it and enjoyed it greatly. \n \n Richard Carrier examined this piece critically. http://www.infidels.org/library/modern/richard_carrier/jesuspuzzle.shtml\n \n An excerpt:\n \n \"...this book must be taken seriously. It is not a quack theory, it is not shoddy work, it is not amateurish. Though elements of Doherty's method of presentation do indicate he is an amateur in the literal sense (I would not believe from reading it that he had a Ph.D. in any relevant field), he is one of the most expert amateurs I have ever encountered. He has read a vast amount of scholarship and he actually understands what he reads. More importantly, he deals with ancient texts directly and competently. The scope of his work would be of dissertation quality, if it were only polished according to existing conventions. In short, I was very impressed. This is serious scholarship, marshaling a great deal of important evidence and observations, and the lack of letters behind the author's name does nothing to remove from the importance of this work as something one must read and interact with before dismissing.\"\n \n \n\n \n Just consider for a moment what this would mean to you in your journey through life... \n \n Would it devastate you?\n Would it allow you to be more free?\n Would it significantly change the manner in which you live your life?\n\n \n Shedding my religion has allowed me to discover the world of critical thinking, and that certainly has made for a freer environment. Anytime one changes the foundation beneath them, I suppose it could be called significant. Morality has been a non-issue; people should quit worrying that non-belief will lead to rampant crime. Most people are good because people are mostly good. IMO.", 
   {}, 
   65897, 
   null, 
   1094580840.0
  ], 
  [
   65908, 
   null, 
   "unkerpaulie", 
   "@unkerpaulie -- You raise a lot of interesting questions... If you're interested in exploring some potential answers to these questions from one particular point of view, I'd encourage you to check out this website:\n \n http://pages.ca.inter.net/~oblio/home.htm\n \n Please note that I am not suggesting that Earl Doherty has all the answers or that his answers are the right ones. But he does have a perspective that is not often considered (at least not by Christians). And his conclusions are certainly within the realm of possibilities.\n\n i read the 12 pieces and the main article (basically the same). it entertains the idea that jesus may have never existed based on the writings that describe his life and the surrounding situations under which they were written. the article falls apart at piece 8 though, because the 4 gospels are indeed consistent (except for very minor technicalities), and the fact that they reference the old testament does not mean that it was made up to fit the old testament. at peice 9 in says that the gospel was written to facilitate an already active christian movement. whats more, it doesnt address what exactly sparked this brand new and suddenly expanding christian movement. all of a sudden, people are turning to this christ for salvation, and the practice is spreading like wildfire. because of that it says mark, and the other writers put together biographies of some figure called jesus christ, and it agrees with what the christians already believe\n \n then paul's mission of killing this revolutionary generation of christians begins. by this time its a problem that the authorities had to organize action against. consider that paul became converted, evangelized throughtout europe for years, and only wrote those epistles under house arrest. paul died in 64 AD according to this site. according to this one, paul was crusading against this movement within 1 year of jesus' death.\n \n if jesus did not exist, what started the christian movement, and what caused the uncontrolable expansion starting at that point?", 
   {}, 
   65897, 
   null, 
   1094583600.0
  ], 
  [
   65918, 
   null, 
   "thebootfitter", 
   "...whats more, it doesnt address what exactly sparked this brand new and suddenly expanding christian movement. all of a sudden, people are turning to this christ for salvation, and the practice is spreading like wildfire.\n ...\n if jesus did not exist, what started the christian movement, and what caused the uncontrolable expansion starting at that point?\n\n \"All of a sudden\"?  Starting at what point, precisely?\n \n That's one of the subjects of Doherty's book -- an interesting read, in my opinion.\n \n There were many philisophical movements in that period of the history of humanity... some of which contained teachings that were very different from traditional Jewish teachings, for example. It is certainly conceivable that people at the time followed one of the many 'preachers' at the time as they preached about a Christ who resided in the spiritual world and offered himself as a bloody sacrifice for the sins of humanity -- not on the physical earth, but in the spirit realm. (Especially since this idea of a 'savior' making a sacrifice for humanity in the spiritual world was not contained to Christianity.) \n \n It is certainly conceivable that someone at some point in the midst of all these different ideas of a spiritual Christ, someone thought it would be a good idea to create a story around an alleged historical human figure. So, they looked back into the Jewish scriptures to find 'prophecies' and wrote a story that fulfilled these prophecies.\n \n If an individual is not intimately linked with the implications of the conclusion of such an inquiry, and if an individual does not have pre-conceived assumptions about the truth of whether or not there was a historical Jesus Christ, I believe an individual may find the process of inquiry quite interesting, indeed.\n \n Another way to look at this is that anyone who believes that a historical Jesus Christ died on a cross for the sins of humanity (and that is the only way they could have eternal life in heaven with God) cannot be expected to consider the question without bias. Such an individual has a vested interest (and a very intense, personal, spiritual one at that) in believing that there was a historical figure of Christ -- for if there wasn't, it means that they've been duped. And from the perspective of such an individual, that may mean they are damned to hell for eternity... or perhaps that there is no such thing as 'life after death.' This is a tough proposition for many people. The implications certainly don't lend themselves to objectivity.\n \n On the other hand, an individual for whom it does not matter one way or the other whether or not there was a historical Jesus Christ who died for our sins as described by the gospel is in an arguably better position to seek the objective truth. Like pure scientific inquiry, this type of person is not necessarily motivated by finding evidence of one sort or another, but rather discovering the evidence that exists... viewing it objectively... and determining what possible conclusions there might be.\n \n One of those possible conclusions is that there really was a Jesus Christ who walked this earth and was described accurately by the Gospels. Another possible conclusion is that there wasn't. When viewed objectively, with only the objective of discovering the truth, the latter conclusion of these two appears more probable, in my humble opinion.", 
   {}, 
   65908, 
   null, 
   1094587020.0
  ], 
  [
   65934, 
   null, 
   "unkerpaulie", 
   "\"All of a sudden\"?  Starting at what point, precisely?\n\n at some point. at one point, nobody is talking about salvation via jesus christ, then at some point, this salvation doctrine starts sprading at an explosive rate. this is the \"sudden\" im talking about\n \n \nIt is certainly conceivable that someone at some point in the midst of all these different ideas of a spiritual Christ, someone thought it would be a good idea to create a story around an alleged historical human figure. So, they looked back into the Jewish scriptures to find 'prophecies' and wrote a story that fulfilled these prophecies.\n\n according to the very research that earl did, mark's gospel was presumably written AFTER the story of jesus was already being talked about. in other words, no writer made this up, is was in circulation long before it was actually written, and the writer must have written the gospel from collective sources.\n \n \nIf an individual is not intimately linked with the implications of the conclusion of such an inquiry, and if an individual does not have pre-conceived assumptions about the truth of whether or not there was a historical Jesus Christ, I believe an individual may find the process of inquiry quite interesting, indeed.\n \n Another way to look at this is that anyone who believes that a historical Jesus Christ died on a cross for the sins of humanity (and that is the only way they could have eternal life in heaven with God) cannot be expected to consider the question without bias. Such an individual has a vested interest (and a very intense, personal, spiritual one at that) in believing that there was a historical figure of Christ -- for if there wasn't, it means that they've been duped. And from the perspective of such an individual, that may mean they are damned to hell for eternity... or perhaps that there is no such thing as 'life after death.' This is a tough proposition for many people. The implications certainly don't lend themselves to objectivity. \n \n On the other hand, an individual for whom it does not matter one way or the other whether or not there was a historical Jesus Christ who died for our sins as described by the gospel is in an arguably better position to seek the objective truth. Like pure scientific inquiry, this type of person is not necessarily motivated by finding evidence of one sort or another, but rather discovering the evidence that exists... viewing it objectively... and determining what possible conclusions there might be.\n \n One of those possible conclusions is that there really was a Jesus Christ who walked this earth and was described accurately by the Gospels. Another possible conclusion is that there wasn't. When viewed objectively, with only the objective of discovering the truth, the latter conclusion of these two appears more probable, in my humble opinion.\n\n i dont have any biases at all, im looking at the work from a wholistic view. the one fact we can all agree on, for starts, is that the epistles were written by paul. numerous sources also agree that paul died at 64 AD. with or without the existence of a phyiscal human jesus christ, the christian religion had become a serious problem to the authorities by 31 AD, just 1 year after the death of this alleged jesus. prior to this, jesus was unheard of. now lets assume that jesus was made up. how would this writer convince all these people that a mane name jesus christ had been crucified and resurrected just 1 year ago? particularly if the man was said to be a local, but he really didnt exist? this is what the article fails to address", 
   {}, 
   65918, 
   null, 
   1094591280.0
  ], 
  [
   65938, 
   null, 
   "Big Orn", 
   "What would it mean to you if Jesus the Christ of the Gospels did not exist on this earth as an actual human being? If this allegedly divine being was never physically present on earth and did not actually suffer and die on a cross?\n \n Just consider for a moment what this would mean to you in your journey through life... \n \n Would it devastate you?\n Would it allow you to be more free?\n Would it significantly change the manner in which you live your life?\n \n If you have never done so, I encourage you to consider the possibility... because no matter how hard you BELEIVE in something, it may or may not coincide with reality. IF the reality is that Jesus the Christ of the Gospels existed as described in the Gospels, then he existed. IF the reality is that he did not exist, then he did not exist. Belief one way or another cannot change the reality of what is.\n \n I'm interested in hearing from all perspectives...\n\n Thebootfitter,\n Would this be a recent discovery? If not then if He never existed I would not know how to be &#8211; one way or the other. See what I&#8217;m getting at?\n Or are you putting it that I should find this out personally?\n \n For someone in my position it is impossible to disbelieve.\n But, for sake of argument, let&#8217;s say it was a recent discovery. That a written document was found in which there was irrefutable proof that it was all a hoax, then I would be devastated to say the least.\n If I discovered this personally, through some spiritual encounter, I would still be distraught, I think. However, if I came to my own conclusion, then I think (as I have seen on this board and others) I would feel free.\n \n But, it would really depend on what kind of relationship you have with Him now. It would be like you asking me how I would feel if my wife and kids didn&#8217;t exist. I would contemplate suicide&#8230;maybe.\n There are those that know, there are those that belief, and there are those that do neither. Those that go to church, follow the rules of religion and believe in God could possibly entertain the thought that Christ was a myth. Those that constantly feel His presence know better.", 
   {}, 
   65934, 
   null, 
   1094592360.0
  ], 
  [
   65943, 
   null, 
   "thebootfitter", 
   "There are those that know, there are those that belief, and there are those that do neither. Those that go to church, follow the rules of religion and believe in God could possibly entertain the thought that Christ was a myth. Those that constantly feel His presence know better.\n\n Separate issue here, but you seem to be implying that \"going to church, following the rules of religion and believing in God\" is mutually exclusive to \"constantly feeling His presence.\" These two ideas are not necessarily mutually exclusive, though they can be for some people. Just a point of clarification.", 
   {}, 
   65938, 
   null, 
   1094593620.0
  ], 
  [
   65944, 
   null, 
   "Big Orn", 
   "Separate issue here, but you seem to be implying that \"going to church, following the rules of religion and believing in God\" is mutually exclusive to \"constantly feeling His presence.\" These two ideas are not necessarily mutually exclusive, though they can be for some people. Just a point of clarification.\n\n Not necessarily, no, but there is a very big difference and this is why so many fall away (and will fall away) as knowledge increases.\n I just wanted to point that out - it is directly associated with your topic.", 
   {}, 
   65943, 
   null, 
   1094593920.0
  ], 
  [
   65947, 
   null, 
   "thebootfitter", 
   "...according to the very research that earl did, mark's gospel was presumably written AFTER the story of jesus was already being talked about. in other words, no writer made this up, is was in circulation long before it was actually written, and the writer must have written the gospel from collective sources.\n\n \"Presumably\" is the key word here. That presumption is not necessary to investigate the issue. When that particular presumption is made, the traditional viewpoint seems to make sense. However, if you remove the underlying assumption that a historical, human Jesus was being talked about prior to the writing of Mark's Gospel, then we can investigate the matter more objectively. Afterall, from where does this presumption come? There is nothing written in Christian or historical texts that suggests that a human Jesus existed. That existence must be presumed in order for the traditional view to make sense.\n \n Does this make sense?\n \n \n \n... i dont have any biases at all, im looking at the work from a wholistic view. the one fact we can all agree on, for starts, is that the epistles were written by paul. numerous sources also agree that paul died at 64 AD. with or without the existence of a phyiscal human jesus christ, the christian religion had become a serious problem to the authorities by 31 AD, just 1 year after the death of this alleged jesus. prior to this, jesus was unheard of. now lets assume that jesus was made up. how would this writer convince all these people that a mane name jesus christ had been crucified and resurrected just 1 year ago? particularly if the man was said to be a local, but he really didnt exist? this is what the article fails to address \n\n 1) I'm not certain we can agree that all the epistles were written by Paul.\n 2) I'll go with your idea that \"with or without the existence of a physical human Jesus Christ, the Christian religion had become a serious problem to the authorities by 31 AD.\" I'll even go with your idea that \"...prior to this, [a historical, human] jesus was unheard of...\" The religion or movement or bands of 'believers' or however you wish to refer to them did not necessarily rely on a historical physical Jesus for their beliefs. Not until Mark's Gospel (allegedly written between 70-90 AD) was there any definite reference in Christian or secular texts to a historical figure of the Jesus of Nazareth.\n \n If you read a bit more of Doherty, he actually addresses these points quite well.", 
   {}, 
   65934, 
   null, 
   1094594580.0
  ], 
  [
   65949, 
   null, 
   "thebootfitter", 
   "Not necessarily, no, but there is a very big difference and this is why so many fall away (and will fall away) as knowledge increases.\n I just wanted to point that out - it is directly associated with your topic.\n\n How about if we consider that some people feel a presence that they believe to be from God's Only Son, who came to earth to die for the sins of humanity... In fact, some people feel this presence to the point that there is nothing else they can ascribe this feeling to except to the truth of what they believe... and so they call this feeling, this belief, \"knowledge.\"", 
   {}, 
   65944, 
   null, 
   1094594820.0
  ], 
  [
   65954, 
   null, 
   "Big Orn", 
   "How about if we consider that some people feel a presence that they believe to be from God's Only Son, who came to earth to die for the sins of humanity... In fact, some people feel this presence to the point that there is nothing else they can ascribe this feeling to except to the truth of what they believe... and so they call this feeling, this belief, \"knowledge.\"\n\n The Knowledge of God is what the Bible is for. There is no greater knowledge.\n When knowledge fails us is when ideas and beliefs are so fantastic that they explain away Christ. You know that one day that kind of knowledge will fool even the saints, if possible.\n Even that article, if given credence, will cause fear and doubt in some who are teetering on the brink.", 
   {}, 
   65949, 
   null, 
   1094596440.0
  ], 
  [
   65957, 
   null, 
   "thebootfitter", 
   "The Knowledge of God is what the Bible is for. There is no greater knowledge.\n When knowledge fails us is when ideas and beliefs are so fantastic that they explain away Christ. You know that one day that kind of knowledge will fool even the saints, if possible.\n Even that article, if given credence, will cause fear and doubt in some who are teetering on the brink.\n\n I don't follow...\n \n How can knowledge, if it is truly knowledge (or objective understanding of reality), 'fool' us?\n \n If the historical Jesus Christ existed, then knowledge and reason should be able to lead us to this conclusion. If the historical Jesus Christ did not exist, then knowledge and reason should be able to lead us to this conclusion. The fact is... no one alive today has KNOWLEDGE whether or not Jesus Christ existed as described in the Gospels. \n \n If someone's faith is such that a little knowledge, combined with reason and common sense can shake their faith... then perhaps they don't have much of a faith to hold onto in the first place.", 
   {}, 
   65954, 
   null, 
   1094597460.0
  ], 
  [
   65970, 
   null, 
   "Big Orn", 
   "I don't follow...\n \n How can knowledge, if it is truly knowledge (or objective understanding of reality), 'fool' us?\n \n If the historical Jesus Christ existed, then knowledge and reason should be able to lead us to this conclusion. If the historical Jesus Christ did not exist, then knowledge and reason should be able to lead us to this conclusion. The fact is... no one alive today has KNOWLEDGE whether or not Jesus Christ existed as described in the Gospels. \n \n If someone's faith is such that a little knowledge, combined with reason and common sense can shake their faith... then perhaps they don't have much of a faith to hold onto in the first place.\n\n I guess I didn't make it clear enough. It's not the fact that knowledge of Him does/does not exist, it's the information given us from a much more technologically advanced world that will lead us astray. The things that can fool us are signs, wonders and miracles coupled with a very convincing explanation (the kind of knowledge I am talking about) and an advanced society will eat it up.\n I know I&#8217;m getting off track here, but if someone can show enough convincing evidence that Christ was a myth, and that idea grows worldwide, it is the wrong kind of knowledge, put here and perpetrated by the Powers of Darkness for just that purpose.", 
   {}, 
   65957, 
   null, 
   1094601600.0
  ], 
  [
   65995, 
   null, 
   "billsco", 
   "\n I know I'm getting off track here, but if someone can show enough convincing evidence that Christ was a myth, and that idea grows worldwide, it is the wrong kind of knowledge, put here and perpetrated by the Powers of Darkness for just that purpose.\n\n \n Ya know Big Orn, it's those kind of statements that send us both back to the riverbanks with guns fully loaded and aimed, ready to fire if one of us so much as flinches, instead of us meeting reasonably in the middle.\n \n Am I an instrument of Satan, in your opinion? Is that what you think when you log onto 4Forums and see a post by billsco? \"Well there's the Powers of Darkness again. Let us pray before reading.\" \n \n And \"the wrong kind of knowledge\"? Sheesh.", 
   {
    "unicode_changes_made": true
   }, 
   65970, 
   null, 
   1094610180.0
  ], 
  [
   66007, 
   null, 
   "thebootfitter", 
   "I guess I didn't make it clear enough. It's not the fact that knowledge of Him does/does not exist, it's the information given us from a much more technologically advanced world that will lead us astray. The things that can fool us are signs, wonders and miracles coupled with a very convincing explanation (the kind of knowledge I am talking about) and an advanced society will eat it up.\n I know I'm getting off track here, but if someone can show enough convincing evidence that Christ was a myth, and that idea grows worldwide, it is the wrong kind of knowledge, put here and perpetrated by the Powers of Darkness for just that purpose. \n\n What if... consider for just a moment... what if Jesus Christ really didn't exist? Then is the knowledge that Jesus Christ didn't exist 'the wrong kind of knowledge'? Or is it objective knowledge that has no intrinsic value? IF this were the case, then wouldn't the idea that Jesus Christ really did exist be objectively incorrect? Of course it would!\n \n Regarding your statement about 'signs, wonders and miracles'... You are saying that this will happen today in this day and age? Unlikely. However, a few thousand years ago that is exactly what happened in many circumstances. 'Signs, wonders and miracles' were explained with fascinating stories that people readily believed because they didn't have a better explanation. In this day and age, people have the tools to be able to verify many things for themselves if they so desire. And there are a wealth of resources that are typically very well documented for anyone who wishes to research any particular topic in order to gain a better understanding.\n \n Consider that many people at one time in our history believed the earth was flat, the moon was made out of cheese, and that lunar eclipses consisted of a monster that was eating the cheese. These people had no less capacity for intelligence than we have. They just didn't have the same access to information.\n \n \n \nIt would be like you asking me how I would feel if my wife and kids didn't exist.\n\n Also... I meant to comment on this earlier. I consider this to be a poor analogy. Your wife and kids currently exist objectively in the same physical realm in which you exist. Jesus doesn't. Some of the 'evidence' we have available to us to suggest the existence of Jesus of Nazareth are the written Gospels and subjective 'feelings.' I'm not saying that either of these are invalid with regard to personal belief. But they do not constitute objective evidence.", 
   {
    "unicode_changes_made": true
   }, 
   65970, 
   null, 
   1094625060.0
  ], 
  [
   66023, 
   null, 
   "unkerpaulie", 
   "\"Presumably\" is the key word here. That presumption is not necessary to investigate the issue. When that particular presumption is made, the traditional viewpoint seems to make sense. However, if you remove the underlying assumption that a historical, human Jesus was being talked about prior to the writing of Mark's Gospel, then we can investigate the matter more objectively. Afterall, from where does this presumption come? There is nothing written in Christian or historical texts that suggests that a human Jesus existed. That existence must be presumed in order for the traditional view to make sense.\n \n Does this make sense?\n\n the presumption is key. if jesus never existed, then somebody made him up. the article implies that by all account mark was the first to write a jesus biography. if mark himself didnt make up the character, that means that this character was talked about or known of prior to mark's writing. from the timeline of paul, this jesus character was known of since 31 AD. this suggests that the jesus character was not invented by mark, since mark's writing is some 40-50 years later. so who invented this character?\n \n \n1) I'm not certain we can agree that all the epistles were written by Paul.\n 2) I'll go with your idea that \"with or without the existence of a physical human Jesus Christ, the Christian religion had become a serious problem to the authorities by 31 AD.\" I'll even go with your idea that \"...prior to this, [a historical, human] jesus was unheard of...\" The religion or movement or bands of 'believers' or however you wish to refer to them did not necessarily rely on a historical physical Jesus for their beliefs. Not until Mark's Gospel (allegedly written between 70-90 AD) was there any definite reference in Christian or secular texts to a historical figure of the Jesus of Nazareth.\n \n If you read a bit more of Doherty, he actually addresses these points quite well.\n\n the fact that paul wrote some of the epistles is enough for this exercise. the date 31 AD is also key. this is said to be the date that stephev was stoned to death, at the time when the problem of christianity reached critical mass amongst the jewish elders. \n \n if no jesus existed, then how could the word of his existence among jews spread so soon after his assumed death? people of that time believed he existed 1 year ago. this is not a case of a historical character that these people were talking about, to them the character in question lived in their very time, in their very locale. how could so many people be fooled into believing in a non-existent person walked all over jerusalem teaching and doing wonderous works, and was crucified less than a year ago?\n \n the only way word of a fictional jesus could be convincing is if the dates are wrong, and there was no stoning of stephen, and there was no christian movement until after mark's work (or some other writer's work) was discovered. i havent seen doherty tackle the issue from that angle yet. is that in the book? or perhaps you have a link?\n \n does that make sense?", 
   {}, 
   65947, 
   null, 
   1094655300.0
  ], 
  [
   66029, 
   null, 
   "Big Orn", 
   "Ya know Big Orn, it's those kind of statements that send us both back to the riverbanks with guns fully loaded and aimed, ready to fire if one of us so much as flinches, instead of us meeting reasonably in the middle.\n \n Am I an instrument of Satan, in your opinion? Is that what you think when you log onto 4Forums and see a post by billsco? \"Well there's the Powers of Darkness again. Let us pray before reading.\" \n \n And \"the wrong kind of knowledge\"? Sheesh.\n\n You know better than that! \n And why would that statement bring you to that conclusion? If I thought for one minute that the Bible was wrong and that that teaching was &#8220;aimed&#8221; at my fellowman, I would put it down and question it.\n What causes meanness, and heartlessness is forgetting that it is not flesh and blood that causes the problems, but that it is the unseen things. Bad knowledge exists &#8211; right or wrong &#8211; religion or not. There is another layer of knowledge out there that creeps in and implants itself into society&#8230;whether we want to believe it or not.", 
   {}, 
   65995, 
   null, 
   1094657340.0
  ], 
  [
   66036, 
   null, 
   "billsco", 
   "All right. OK then. I'm putting the safety back on the gun. But I ain't getting back in the boat. ;) \n \n I am almost afraid to ask this. What kind of examples do you have over there of unseen bad knowledge?", 
   {}, 
   66029, 
   null, 
   1094659560.0
  ], 
  [
   66037, 
   null, 
   "Big Orn", 
   "What if... consider for just a moment... what if Jesus Christ really didn't exist? Then is the knowledge that Jesus Christ didn't exist 'the wrong kind of knowledge'? Or is it objective knowledge that has no intrinsic value? IF this were the case, then wouldn't the idea that Jesus Christ really did exist be objectively incorrect? Of course it would!\n\n I will need to take myself out of this state, this position I&#8217;m in, in order to answer that. If that&#8217;s what you want to get your point across &#8211; okay. But, I can&#8217;t use His name. If a powerful religious figure, one that caused the world to fight against itself, hate one another, which instigated wars for any reason, and ultimately imprisoned mankind, was discovered to be a hoax and that knowledge set free the world to live in peace? Yes, that knowledge would be valuable.\n \nRegarding your statement about 'signs, wonders and miracles'... You are saying that this will happen today in this day and age? Unlikely. However, a few thousand years ago that is exactly what happened in many circumstances. 'Signs, wonders and miracles' were explained with fascinating stories that people readily believed because they didn't have a better explanation. In this day and age, people have the tools to be able to verify many things for themselves if they so desire. And there are a wealth of resources that are typically very well documented for anyone who wishes to research any particular topic in order to gain a better understanding.\n\n No. The things that will be so fantastic are yet to come.\n But, I am afraid that you are right about the explaining away the things of God. It happens all the time. A child is born, brain dead, no hope to live another night. People gather and pray, calling upon the name of Jesus and performing His word, and the baby is healed and lives. So soon is it passed off as coincidence or something &#8220;natural&#8221;.\n The tools we have to explain away God and His works are those tools that came from the wrong kind of knowledge&#8230;period. The Powers of Darkness does not want us to have faith, does not want us to enter the Lord&#8217;s Rest. That is why so much is focused on religion and not the things of God.\n And as far as a wealth of resources &#8211; we have yet to look at the One Source enough, IMO.\n \nConsider that many people at one time in our history believed the earth was flat, the moon was made out of cheese, and that lunar eclipses consisted of a monster that was eating the cheese. These people had no less capacity for intelligence than we have. They just didn't have the same access to information.\n\n That sort of info is good. We agree here.\n If there&#8217;s one thing I would like to make clear, it is this: I cannot separate myself from my belief and that belief is not based on religion, but on faith, which came by hearing and understanding the Word of God. My posts are not aimed at anyone whose belief is different from mine, nor am I set against any person. I am true to myself because of Christ, and true to Christ because I am being myself. I have no hidden agenda. If anything I say is contrary to the things of God, then I hold myself liable, not any person.\n \nAlso... I meant to comment on this earlier. I consider this to be a poor analogy. Your wife and kids currently exist objectively in the same physical realm in which you exist. Jesus doesn't. Some of the 'evidence' we have available to us to suggest the existence of Jesus of Nazareth are the written Gospels and subjective 'feelings.' I'm not saying that either of these are invalid with regard to personal belief. But they do not constitute objective evidence.\n\n I can feel Him physically. But, I am aware that there are those that can&#8217;t. \n \n And I don&#8217;t consider myself insane. :)", 
   {}, 
   66029, 
   null, 
   1094660820.0
  ], 
  [
   66115, 
   null, 
   "Big Orn", 
   "I am almost afraid to ask this. What kind of examples do you have over there of unseen bad knowledge?\n\n I blinked and blinked, swallowed hard and still couldn't answer this question. :p \n \n And I thought you were into boats repairs.....once. emoticon_cool", 
   {}, 
   66036, 
   null, 
   1094682780.0
  ], 
  [
   66773, 
   null, 
   "unkerpaulie", 
   "im bumping this because im ancipating thebootfitter's response to my post #29", 
   {}, 
   66115, 
   null, 
   1095096540.0
  ], 
  [
   66820, 
   null, 
   "thebootfitter", 
   "im bumping this because im ancipating thebootfitter's response to my post #29 \n\n I was in Maine since last week for a wedding...\n \n \nthe presumption is key. if jesus never existed, then somebody made him up. \n \n Right. If Jesus never existed as a physical human being on this earth, then somebody had to have fabricated the biography of this figure. The distinction here, according to Doherty, is that Paul (and others in that time) discussed a spiritual figure of Christ - not an actual human figure called Jesus of Nazareth. Within the context of the spiritual/religious movements of the time, this spiritual Christ makes perfect sense, while a human figure of Jesus does not coincide with what Paul preaches.\n \n According to Doherty, there is absolutely no reference to the character known as Jesus of Nazareth until Mark's gospel - which is most often dated in the latter half of the first century AD. Without the underlying assumption that there was an historical figure, the spiritual Christ discussed in the first century epistles can be seen independently.\n \n \nso who invented this character? \n\n Doherty shows that the figure of Jesus of Nazareth is the literary creation of the author of the Gospel of Mark that brings together various movements and traditions of the time - as well as Jewish scriptures. Doherty even suggests that Mark's Gospel wasn't intended to tell the story of a specific human being, but rather it was intended to tell the story of the movement to which he belonged... using a central mythical character to convey the central themes of that movement.\n \n \nthe date 31 AD is also key. this is said to be the date that stephev was stoned to death, at the time when the problem of christianity reached critical mass amongst the jewish elders. \n \n if no jesus existed, then how could the word of his existence among jews spread so soon after his assumed death? \n\n From where are you getting the date of 31 AD? From where do you get the idea that this was when Christianity reached 'critical mass' amongst the Jewish elders? From where do you get the idea that the word of the existence of such a figure spread 'so soon' after his assumed death? Doherty shows that there is no written record of such a figure until Mark's Gospel. And in fact, there is much written in the first century that shows that the authors have no knowledge of any such human character.\n \n \npeople of that time believed he existed 1 year ago. this is not a case of a historical character that these people were talking about, to them the character in question lived in their very time, in their very locale. how could so many people be fooled into believing in a non-existent person walked all over jerusalem teaching and doing wonderous works, and was crucified less than a year ago? \n\n Doherty shows that there is no record of any such belief until long after the alleged crucifiction took place. And he shows many examples of first century writings that preclude any knowledge of the existence of a human Jesus.\n \n \nthe only way word of a fictional jesus could be convincing is if the dates are wrong, and there was no stoning of stephen, and there was no christian movement until after mark's work (or some other writer's work) was discovered. i havent seen doherty tackle the issue from that angle yet. is that in the book? or perhaps you have a link? \n\n Consider the possibility that there was no stoning of Stephen. Where, except in Acts (which is usually dated sometime in the second century AD), is there any record of such an event?\n \n Doherty is not suggesting that there was no Christian movement until after Mark's Gospel... He is suggesting that early Christianity was not based upon a human character of Jesus, but rather the spiritual Christ that Paul preached. Certainly there were people who called themselves Christians in the first half of the first century... but did these people have a central human character upon which their faith was founded? Historical records say no. (And a central human character is not essential to the growth and development of a religious movement.)\n \n I am happy to answer whatever question that you may have to the best of my ability. However, I do not claim 'ownership' of this material. I have only recently discovered this line of research and scholarship. I can only give you my interpretations from reading one book on the subject. If you are truly interested in learning more about the historicity of Jesus, I'd encourage you to do a little reading yourself. It's pretty fascinating!", 
   {
    "unicode_changes_made": true
   }, 
   66773, 
   null, 
   1095109920.0
  ], 
  [
   66837, 
   null, 
   "unkerpaulie", 
   "lets work with\n \nDoherty shows that the figure of Jesus of Nazareth is the literary creation of the author of the Gospel of Mark that brings together various movements and traditions of the time - as well as Jewish scriptures. Doherty even suggests that Mark's Gospel wasn't intended to tell the story of a specific human being, but rather it was intended to tell the story of the movement to which he belonged... using a central mythical character to convey the central themes of that movement.\n\n and\n \nConsider the possibility that there was no stoning of Stephen. Where, except in Acts (which is usually dated sometime in the second century AD), is there any record of such an event?\n \n Doherty is not suggesting that there was no Christian movement until after Mark's Gospel... He is suggesting that early Christianity was not based upon a human character of Jesus, but rather the spiritual Christ that Paul preached. Certainly there were people who called themselves Christians in the first half of the first century... but did these people have a central human character upon which their faith was founded? Historical records say no. (And a central human character is not essential to the growth and development of a religious movement.)\n\n mark is said to have created his gospel sometime in 70 AD or thereafter. paul died in 64 AD. if paul preached about jesus, theres no way mark could have invented him afterwards, since this character already existed.\n \n the context of a \"spiritual jesus\" in paul's sermon makes sense since at the time paul preached jesus would have died and only his \"spirit\" (the holy spirit, aka the \"comforter\") is what would continually guide the christian followers after jesus' death.\n \n now mark writes about a physical and human jesus and sends this information to the churches paul preached and beyond. how would this possibly happen if paul was already preaching from a viewpoint that no human physical jesus ever existed less than 30 years ago?\n \n once again, which comes first? we have paul preaching about the spirit of the ascended jesus, and mark writing about the life of the physical jesus. lets say paul's ministry begins 5-10 years after the said date of jesus' death. prior to this time it is said that paul was on various missions imprisoning and executing christians under the order of the jewish parliment. these christians were obviously thriving before paul's preaching, if such a record is true. without the preaching of paul's doctrine, nor the reading of mark's gospel, how did these pre-paul, pre-mark \"christians\" come to be?", 
   {
    "unicode_changes_made": true
   }, 
   66820, 
   null, 
   1095113520.0
  ], 
  [
   66857, 
   null, 
   "thebootfitter", 
   "mark is said to have created his gospel sometime in 70 AD or thereafter. paul died in 64 AD. if paul preached about jesus, theres no way mark could have invented him afterwards, since this character already existed.\n\n True. IF Paul preached about an historical human being named Jesus, who was born in Bethlehem, lived in Nazareth, and was crucified in Jerusalem, then Mark didn't make up this character. Now... find one single reference from Paul that indicates he is discussing a physical human being who walked the earth.\n \n \nthe context of a \"spiritual jesus\" in paul's sermon makes sense since at the time paul preached jesus would have died and only his \"spirit\" (the holy spirit, aka the \"comforter\") is what would continually guide the christian followers after jesus' death.\n\n This is certainly the traditional interpretation of Paul. But this interpretation relies on an the assumption of an actual historical Jesus. Remove this assumption, and IF Paul was discussing an actual historical Jesus, it should be evident that he is. However, this is not evident at all. Rather, without this underlying assumption, Paul's Christ fits the mold of other spiritual saviors prominent at the time.\n \n \nnow mark writes about a physical and human jesus and sends this information to the churches paul preached and beyond. how would this possibly happen if paul was already preaching from a viewpoint that no human physical jesus ever existed less than 30 years ago?\n\n I don't understand what you are asking here... Are you asking how the same people who heard Paul preach about a spiritual Christ (without physical existence on earth) would later believe that an actual Jesus walked the earth and died on a cross in Jerusalem? This isn't difficult to imagine, but it's probably not the way it happened. Even though Mark is estimated to have been written around 70 AD, there isn't much discussion (even in Christian writings) of an historical character of Jesus of Nazareth until the middle of the second century. \n \n \n \nonce again, which comes first? we have paul preaching about the spirit of the ascended jesus, and mark writing about the life of the physical jesus. lets say paul's ministry begins 5-10 years after the said date of jesus' death. prior to this time it is said that paul was on various missions imprisoning and executing christians under the order of the jewish parliment. these christians were obviously thriving before paul's preaching, if such a record is true. without the preaching of paul's doctrine, nor the reading of mark's gospel, how did these pre-paul, pre-mark \"christians\" come to be? \n\n Paul was just one of many preachers or 'prophets' of his time, who claimed that their ideas about the Savior Christ were revealed to them through the Spirit. What did Paul say in Corinthians about the other 500 witnesses to Christ's spiritual resurrection? He wasn't the only one preaching such things.\n \n And... where does it say that Paul was a Roman citizen, imprisoning and executing Christians? I may be mistaken -- as this is only from my own memory, not a reference from Doherty -- but isn't this account in Acts only? And Paul's conversion on the road to Damascus? Is not this only to be found in Acts as well? I don't believe Paul himself ever mentions any of this. (Again, I may be mistaken here. Please feel free to point out if I am.) Consider that Acts was written well into the second century.", 
   {}, 
   66837, 
   null, 
   1095120240.0
  ], 
  [
   66858, 
   null, 
   "Big Orn", 
   "Now... find one single reference from Paul that indicates he is discussing a physical human being who walked the earth.\n \n\n Ephesians 2 : 15 ...having abolished in His (Lord Jesus Christ) flesh the emnity, that is, the law of commandments contained in ordinances, so as to create in Himself one new man from the two, thus making peace.", 
   {}, 
   66857, 
   null, 
   1095120960.0
  ], 
  [
   66859, 
   null, 
   "thebootfitter", 
   "Ephesians 2 : 15 ...having abolished in His (Lord Jesus Christ) flesh the emnity, that is, the law of commandments contained in ordinances, so as to create in Himself one new man from the two, thus making peace.\n\n Do some research into the Greek phrase 'kata sarka,' which is literally interpreted to mean 'in the sphere of the flesh.' Doherty shows that the manner in which Paul is writing is similar to other savior figures of the time who descended to the lowest of the seven spiritual realms... often referred to as 'the sphere of the flesh' in order to make a blood sacrifice. For only in the sphere of the flesh is blood a valid concept. However, Doherty shows that this sphere of the flesh is still considered to be a spiritual realm by Paul and others of his time (and before), not an earthly one.\n \n Again, without the underlying presumption that Jesus was an actual historical human figure, there are no references to Jesus' earthly ministry in Paul or any of the first century epistles.", 
   {}, 
   66858, 
   null, 
   1095121980.0
  ], 
  [
   66887, 
   null, 
   "maximus", 
   "Bootfitter,\n I'm jumping in mid-stream but I think this Doherty guy is way off.\n \n \nRight. If Jesus never existed as a physical human being on this earth, then somebody had to have fabricated the biography of this figure. The distinction here, according to Doherty, is that Paul (and others in that time) discussed a spiritual figure of Christ - not an actual human figure called Jesus of Nazareth. Within the context of the spiritual/religious movements of the time, this spiritual Christ makes perfect sense, while a human figure of Jesus does not coincide with what Paul preaches.\n\n \n \nDoherty shows that the figure of Jesus of Nazareth is the literary creation of the author of the Gospel of Mark that brings together various movements and traditions of the time - as well as Jewish scriptures. Doherty even suggests that Mark's Gospel wasn't intended to tell the story of a specific human being, but rather it was intended to tell the story of the movement to which he belonged... using a central mythical character to convey the central themes of that movement.\n\n \n \nTrue. IF Paul preached about an historical human being named Jesus, who was born in Bethlehem, lived in Nazareth, and was crucified in Jerusalem, then Mark didn't make up this character. Now... find one single reference from Paul that indicates he is discussing a physical human being who walked the earth.\n\n \n \nThis is certainly the traditional interpretation of Paul. But this interpretation relies on an the assumption of an actual historical Jesus. Remove this assumption, and IF Paul was discussing an actual historical Jesus, it should be evident that he is. However, this is not evident at all. Rather, without this underlying assumption, Paul's Christ fits the mold of other spiritual saviors prominent at the time.\n\n 1 Corinthians 15:21  \"For as by a man   came death, by a man   has come also the resurrection of the dead.\"\n \n Earlier Paul says in 1 Corinthians 15:13 \"But if there is no resurrection of the dead, then Christ has not been raised; if Christ has not been raised, then our preaching is in vain and your faith is in vain.\" \n \n I would say that if there is a resurrection from the dead then one must have previously lived and died. If there is no life then there is no death. If there is no death then there is no resurrection. If there is no resurrection, then as Paul says, our faith is in vain. If there was no Jesus living as man then our faith is in vain. (I also wonder if Paul preaches only a spiritual being in Jesus how he preaches only \"Jesus and him crucified.\" How is a spiritual being crucified?)\n \n Another verse to consider on Paul's knowledge of Jesus as a man: Colossians 2:9 \"For in him the whole fulness of deity dwells bodily...\" How does the fulness of the deity dwell bodily in a spiritual being?\n \n \nI don't understand what you are asking here... Are you asking how the same people who heard Paul preach about a spiritual Christ (without physical existence on earth) would later believe that an actual Jesus walked the earth and died on a cross in Jerusalem? This isn't difficult to imagine, but it's probably not the way it happened. Even though Mark is estimated to have been written around 70 AD, there isn't much discussion (even in Christian writings) of an historical character of Jesus of Nazareth until the middle of the second century. \n \n I've already discussed non-Christian writings on the subject in other threads and I gave you those links on another thread. But in terms of Christian writings on a \"historical Jesus\" you may not find that spelled out. There is a good reason--it was probably a given--well understood and accepted. Accepted as passed on from one to another--from eyewitnesses as the Gospel of Luke says, \"Inasmuch as many have undertaken to compile a narrative of the things which have been accomplished among us, just as they were delivered to us by those who from the beginning   were eyewitnesses   and ministeres of the word...\" (Luke 1:1-2)\n \n It is also important to note that both Mark and Luke were followers of Paul (Colossians 4:10, Colossians 4:14, 2 Timothy 4:11, Philemon 1:24). If we take it that Paul preached a real, human Jesus from the scripture I have quoted above, then we must also take it that Luke and Mark did the same in their gospels because they were companions of Paul.\n \n \nAnd... where does it say that Paul was a Roman citizen, imprisoning and executing Christians? I may be mistaken -- as this is only from my own memory, not a reference from Doherty -- but isn't this account in Acts only? And Paul's conversion on the road to Damascus? Is not this only to be found in Acts as well? I don't believe Paul himself ever mentions any of this. (Again, I may be mistaken here. Please feel free to point out if I am.) Consider that Acts was written well into the second century.\n\n 1 Timothy 1:12-13  \"I thank him who has given me strength for this, Christ Jesus our Lord, because he judged me faithful by appointing me to his service, though I formerly blasphemed and persecuted   and insulted him; but I received mercy because I had acted ignorantly in unbelief...\"\n \n What is the origin of these 7 spiritual realms that Doherty talks about?", 
   {
    "unicode_changes_made": true
   }, 
   66857, 
   null, 
   1095132840.0
  ], 
  [
   66925, 
   null, 
   "thebootfitter", 
   "1 Timothy 1:12-13  \"I thank him who has given me strength for this, Christ Jesus our Lord, because he judged me faithful by appointing me to his service, though I formerly blasphemed and persecuted   and insulted him; but I received mercy because I had acted ignorantly in unbelief...\"\n\n Maximus... sometimes you make me think too hard! (Thank you!)\n \n According to Doherty (pg 13), \"Among the 13 epistles assigned to Paul, scholarly study and computer anlaysis have judged only seven as genuine: Romans, 1 and 2 Corinthians, Galatians, Philippians, 1 Thessalonians, and Philemon... 1 & 2 Timothy and Titus are... assigned to the early second century, usually 110-130.\"\n \n I have been searching for the specific reference, and I cannot now find it, but there is also a biblical passage in one of the epistles that says something like, \"If Jesus Christ had actually been on earth...\" Perhaps you know which passage that is? I'll continue to look...\n \n [Edited later: I found it... Hebrews 8:4. See post below.]\n \n \nWhat is the origin of these 7 spiritual realms that Doherty talks about?\n\n Doherty suggests that the separation between earth and the heavens (and the realms in between) are a result of Platonic thinking that was prominent at the time.\n \n I'll continue this discussion later, but we've got a busy day at the office today... :-)", 
   {}, 
   66887, 
   null, 
   1095175140.0
  ], 
  [
   66928, 
   null, 
   "Big Orn", 
   "Do some research into the Greek phrase 'kata sarka,' which is literally interpreted to mean 'in the sphere of the flesh.' Doherty shows that the manner in which Paul is writing is similar to other savior figures of the time who descended to the lowest of the seven spiritual realms... often referred to as 'the sphere of the flesh' in order to make a blood sacrifice. For only in the sphere of the flesh is blood a valid concept. However, Doherty shows that this sphere of the flesh is still considered to be a spiritual realm by Paul and others of his time (and before), not an earthly one.\n \n Again, without the underlying presumption that Jesus was an actual historical human figure, there are no references to Jesus' earthly ministry in Paul or any of the first century epistles.\n\n Looking at Romans 1 : 1-4 Paul, a servant of Jesus Christ, a called apostle, separated to God's gospel which He had promised beforehand by His prophets in Holy Scriptures concerning His Son, who became of the seed of David according to the flesh, who was appointed Son of God miraculously according to the spirit of holiness by resurrection from the dead, Jesus Christ our Lord.\n To me this means that Jesus had been a human being by belonging to the family of David, and had been ordained, or appointed to be the \"Spirit of Holiness,\" by being raised from the dead. This is coming from the spiritual realm to the fleshly realm, walking on earth as man. Why would Paul state that if he did not believe that Christ was once born of a woman through the genealogy of David?\n Why Paul never gave us a historical account of Jesus may be because he felt it had already been established. JMHO.", 
   {}, 
   66925, 
   null, 
   1095177960.0
  ], 
  [
   66929, 
   null, 
   "thebootfitter", 
   "Why Paul never gave us a historical account of Jesus may be because he felt it had already been established. JMHO.\n \n This is certainly possible. Doherty shows that it is quite unlikely.\n \n \n Looking at Romans 1 : 1-4 Paul, a servant of Jesus Christ, a called apostle, separated to God's gospel which He had promised beforehand by His prophets in Holy Scriptures concerning His Son, who became of the seed of David according to the flesh, who was appointed Son of God miraculously according to the spirit of holiness by resurrection from the dead, Jesus Christ our Lord.\n To me this means that Jesus had been a human being by belonging to the family of David, and had been ordained, or appointed to be the \"Spirit of Holiness,\" by being raised from the dead. This is coming from the spiritual realm to the fleshly realm, walking on earth as man. Why would Paul state that if he did not believe that Christ was once born of a woman through the genealogy of David?\n \n Consider this for a moment... Did Jesus even come from 'the seed of David'? Not according to the various geneologies provided to us in the Gospels. The geneologies (which differ markedly from one Gospel to the next), all end with Joseph. How does Joseph fit in? If Jesus were a descendant of David, the Geneology would have to end with Mary, because according to the Gospels, she had no relations with Joseph. Saying that Jesus comes from the seed of David negates the possibility of a virgin birth.", 
   {}, 
   66928, 
   null, 
   1095178620.0
  ], 
  [
   66939, 
   null, 
   "unkerpaulie", 
   "Now... find one single reference from Paul that indicates he is discussing a physical human being who walked the earth.\n\n in 1 cor 11: 23-25 paul describes jesus eating bread and drinking wine with his disciples, in the same way described in the other gospels (which were written after paul died). this shows that paul referred to an actual man that walked around eating, drinking and talking to people (at least while sitting around a dinner table). paul also refers to the betrayal, the event leading up to his crucifixion. unless doherty believes in coincidences, or that mark plagerized from paul's letters, there is something very interesting about this event appearing (seemingly independantly) in both paul's letter to the corinthians and each of the 4 gospels.\n \n paul does not describe the life and activities because in the context his letters were written to existing churches that would have started 5-10 years after the aleged date oj jesus' death. he discusses the spiritual and conscientious aspects pertaining to the workings of the holy spirit in the era after jesus' departure. this was his main focus, and therefore the prevailing theme of his writings.\n \n however, in at least 1 instance he does reference an eating, drinking, talking, about-to-be-betrayed jesus. im sure there are others, this was the one that i remembered first", 
   {}, 
   66929, 
   null, 
   1095185340.0
  ], 
  [
   66945, 
   null, 
   "Big Orn", 
   "This is certainly possible. Doherty shows that it is quite unlikely. \n Consider this for a moment... Did Jesus even come from 'the seed of David'? Not according to the various geneologies provided to us in the Gospels. The geneologies (which differ markedly from one Gospel to the next), all end with Joseph. How does Joseph fit in? If Jesus were a descendant of David, the Geneology would have to end with Mary, because according to the Gospels, she had no relations with Joseph. Saying that Jesus comes from the seed of David negates the possibility of a virgin birth.\n\n I think that what is confusing is in Luke 1 : 36 where it says, Even Elizabeth your relative is going to have a child in her old age, and she who was said to be barren is in her sixth month.\n Elizabeth is a Levite, that&#8217;s certain. But, that doesn&#8217;t mean that Mary is also. Could it not be that Mary&#8217;s mother and Elizabeth&#8217;s mother were sisters? Who knows, but being related does not mean coming from the same lineage.\n \n Romans 9 : 4-5 says, &#8230;who are Israelites. To them belong the adoption as sons, the glory, the covenants, the giving of the law, the temple worship, and the promises. To them belong the patriarchs, and from them, by human descent, came the Christ, who is God over all, blessed forever! Amen. So let&#8217;s see if Mary really was from the tribe of Judah. I don&#8217;t think there&#8217;s enough proof that she&#8217;s a Levite, really, but, like I said, it can be confusing.\n There is no written proof in the Bible that can confirm what Luke said in Chapter 3 verse 23 that Jesus came from the lineage of Heli. But it is implied. And from what I can gather Mary was the daughter of Heli, who was of the Davidic line. It is understood that &#8220;back in the day&#8221;, the Jews did not typically trace genealogies through women, (See Numbers 1 : 18) and whether they still don&#8217;t, I have no idea.\n But if we look closer, Jesus could not have taken the &#8220;Throne of David&#8221; through Joseph (Mary&#8217;s husband) due to Joseph&#8217;s lineage being connected to Jechonias &#8211; or Jeconiah (Matthew 1 : 12) who sinned so badly that God cut off his seed from ever sitting on the &#8220;Throne of David. (see Jeremiah 22: 24-30 whereas Coniah and Jechonia are the same person).\n \n Even though there is no direct proof, we can see that Christ came from the tribe of Judah. And, again, going back to the original text, Mary and Elizabeth do not have to be cousins of the same lineage, but related as if their mother&#8217;s were sisters, for example.", 
   {}, 
   66929, 
   null, 
   1095186300.0
  ], 
  [
   66966, 
   null, 
   "thebootfitter", 
   "in 1 cor 11: 23-25 paul describes jesus eating bread and drinking wine with his disciples, in the same way described in the other gospels (which were written after paul died). this shows that paul referred to an actual man that walked around eating, drinking and talking to people (at least while sitting around a dinner table). paul also refers to the betrayal, the event leading up to his crucifixion. unless doherty believes in coincidences, or that mark plagerized from paul's letters, there is something very interesting about this event appearing (seemingly independantly) in both paul's letter to the corinthians and each of the 4 gospels.\n\n This passage is comparable to stories that other mystery cults of Paul's time had, where a mythical meal was shared. Such a story gives credence to a symbolic meal that was being shared by members of Paul's community. It is not necessary for this scene to have taken place at a point in historical time somewhere on earth.\n \n In fact, Paul begins this passage by saying, \"For I received [paralambano*] from the Lord that which I passed on to you...\" *The verb Paul uses here is the same verb as he uses many other times in his letters, which Doherty points out means 'received through revelation.' Paul speaks about his doctrine as coming through a spiritual channel... through direct revelation from the Lord. Not from Peter or some other apostle who was supposedly present at this gathering.", 
   {}, 
   66939, 
   null, 
   1095193260.0
  ], 
  [
   66970, 
   null, 
   "thebootfitter", 
   "Even though there is no direct proof, we can see that Christ came from the tribe of Judah. And, again, going back to the original text, Mary and Elizabeth do not have to be cousins of the same lineage, but related as if their mother's were sisters, for example.\n\n I do not understand whatever point it is that you are attempting to communicate.\n \n I was simply pointing out that traditional understanding of the Gospels is that Jesus descended from the line of David. And the lineage documented in the Gospels leads to Joseph. Yet, Jesus isn't of the same lineage as Joseph. That's all.", 
   {
    "unicode_changes_made": true
   }, 
   66945, 
   null, 
   1095194400.0
  ], 
  [
   66973, 
   null, 
   "Big Orn", 
   "I do not understand whatever point it is that you are attempting to communicate.\n\n That Jesus was of the tribe of Judah.\n \nI was simply pointing out that traditional understanding of the Gospels is that Jesus descended from the line of David.\n\n Agreed\n \nAnd the lineage documented in the Gospels leads to Joseph.\n\n Not necessarily.\n \nYet, Jesus isn't of the same lineage as Joseph. That's all.\n\n Agreed.\n \n So was that not enough to show that Jesus was a human being, of flesh and blood?\n \n I know you're swamped at work, so I won't be biting a bullet waiting.", 
   {}, 
   66970, 
   null, 
   1095195240.0
  ], 
  [
   66979, 
   null, 
   "thebootfitter", 
   "I have been searching for the specific reference, and I cannot now find it, but there is also a biblical passage in one of the epistles that says something like, \"If Jesus Christ had actually been on earth...\" Perhaps you know which passage that is? I'll continue to look...\n\n I found it...\n Hebrews 8:4 \"Now, if he had been on earth, he [Jesus] would not even have been a priest.\"\n \n Is there an explanation for this passage that coincides reasonably with an actual historical Jesus the Christ?", 
   {}, 
   66925, 
   null, 
   1095196680.0
  ], 
  [
   66981, 
   null, 
   "thebootfitter", 
   " That Jesus was of the tribe of Judah.\n ...\n So was that not enough to show that Jesus was a human being, of flesh and blood?\n\n I still don't understand what you are getting at... \n We have different geneologies in different gospels, some of which have large gaps when compared with others... some of which have names that are completely different than others for certain supposed eras... all of which end with Joseph.\n \n There are definitely problems with the historical accuracy of these geneologies, because they do not coincide with each other. Even if they did coincide, what is the point of showing them in relation to Jesus fulfilling the prophecy that he is David's descendant when they all end with Joseph? (And Jesus has no biological relation to Joseph...)\n \n So, if are you asking whether inaccurate geneologies that start with David and end with Joseph are \"enough to show that Jesus was a human being, of flesh and blood,\" I would have to say that, no, this is not enough.", 
   {}, 
   66973, 
   null, 
   1095197280.0
  ], 
  [
   66987, 
   null, 
   "unkerpaulie", 
   "This passage is comparable to stories that other mystery cults of Paul's time had, where a mythical meal was shared. Such a story gives credence to a symbolic meal that was being shared by members of Paul's community. It is not necessary for this scene to have taken place at a point in historical time somewhere on earth.\n \n In fact, Paul begins this passage by saying, \"For I received [paralambano*] from the Lord that which I passed on to you...\" *The verb Paul uses here is the same verb as he uses many other times in his letters, which Doherty points out means 'received through revelation.' Paul speaks about his doctrine as coming through a spiritual channel... through direct revelation from the Lord. Not from Peter or some other apostle who was supposedly present at this gathering.\n\n its still begs the question: which came first? were these \"cults\" based on the writings, or the writings based on the cults? the difference is important. and if all this (paul's letter to corinth and all the gospels) were based on those cults, then neither paul nor mark invented a jesus that had a supper before being betrayed. somehow this supper-eating jesus was being talked about elsewhere, if this \"cult\" explanation is valid. \n \n how could paul refer to this supper-eating jesus if his letter recipients werent familiar with the story already? unless doherty is saying that mark used paul's ideas to reconstruct his tale\n \n paul also mentions the death/resurrection of this same jesus character numerous times in romans 1:4, 4:24, 6:3, 8:11, 8:34 and 10:9, as well as 1 cor 2:2. now all of this must have been written before paul died, which was nearly a decade before mark wrote the gospel. i think its very clear that an eating, drinking, talking, betrayed, crucified and resurrected jesus was in no way mark's invention. paul had clearly referred to all these terms and concepts before mark's literary release.\n \n so, i think doherty's research is incomplete at best. mark's gospel obviously orignated from sources outside his own imagination.", 
   {}, 
   66966, 
   null, 
   1095198960.0
  ], 
  [
   66991, 
   null, 
   "unkerpaulie", 
   "I found it...\n Hebrews 8:4 \"Now, if he had been on earth, he [Jesus] would not even have been a priest.\"\n \n Is there an explanation for this passage that coincides reasonably with an actual historical Jesus the Christ?\n\n the revised standard version reads \"Now if he were on earth, he would not be a priest at all\". the kjv says \"For if he were on earth, he should not be a priest\". both your wording and the ones here show that the writer is talking about if jesus were alive in the present, not if jesus was ever alive. obviously at the time the convention was that jesus was at the time dead and resurrected, and nowhere near earth.\n \n what do you think of heb 5:7 \"In the days of his flesh, Jesus offered up prayers and supplications, with loud cries and tears, to him who was able to save him from death, and he was heard for his godly fear.\"", 
   {}, 
   66979, 
   null, 
   1095199500.0
  ], 
  [
   66992, 
   null, 
   "Big Orn", 
   "I still don't understand what you are getting at... \n We have different geneologies in different gospels, some of which have large gaps when compared with others... some of which have names that are completely different than others for certain supposed eras... all of which end with Joseph.\n\n Again, that is because the Jews did not typically trace genealogies through women. It was acceptable to them that they should go through her husband in speaking of Mary. The scriptures are clearly not understandable as a stand-alone text in that area. For instance when they talk of Joseph they say (as was supposed to be) the father of Jesus and suggests that it is Mary's genealogy which is being presented, with Joseph acting as the male representative.\n \nThere are definitely problems with the historical accuracy of these geneologies, because they do not coincide with each other. Even if they did coincide, what is the point of showing them in relation to Jesus fulfilling the prophecy that he is David's descendant when they all end with Joseph? (And Jesus has no biological relation to Joseph...)\n\n I can only say that it&#8217;s the study of Heli and how he fits in that shows that it ends with Mary in Luke.\n From http://philologos.org/__eb-jl/luke03.htm\n Which is only a partial explanation and the only reference I can come up with at this time:\n \nWhich was the son of Heli. There is neither need nor reason, nor indeed any foundation at all, for us to frame I know not what marriages, and the taking of brothers' wives, to remove a scruple in this place, wherein there is really no scruple in the least. For, \n &#8220;Joseph is not here called the son of Heli, but Jesus is so: for the word Jesus must be understood, and must be always added in the reader's mind to every race in this genealogy, after this manner: \"Jesus (as was supposed) the son of Joseph, and so the son of Heli, and of Matthat, yea and, at length, the son of Adam, and the Son of God.\" For it was very little the business of the evangelist either to draw Joseph's pedigree from Adam, or, indeed, to shew that Adam was the son of God: which not only sounds something harshly, but in this place very enormously, I may almost add, blasphemously too. For when St. Luke, verse 22, had made a voice from heaven, declaring that Jesus was the Son of God, do we think the same evangelist would, in the same breath, pronounce Adam 'the son of God' too? So that this very thing teacheth us what the evangelist propounded to himself in the framing of this genealogy; which was to shew that this Jesus, who had newly received that great testimony from heaven, \"This is my Son,\" was the very same that had been promised to Adam by the seed of the woman. And for this reason hath he drawn his pedigree on the mother's side, who was the daughter of Heli, and this too as high as Adam, to whom this Jesus was promised. In the close of the genealogy, he teacheth in what sense the former part of it should be taken; viz. that Jesus, not Joseph, should be called the son of Heli, and consequently, that the same Jesus, not Adam, should be called the Son of God. Indeed, in every link of this chain this still should be understood, \"Jesus the son of Matthat, Jesus the son of Levi, Jesus the son of Melchi\"; and so of the rest...&#8221; \n", 
   {}, 
   66991, 
   null, 
   1095199560.0
  ], 
  [
   66997, 
   null, 
   "thebootfitter", 
   "unless doherty is saying that mark used paul's ideas to reconstruct his tale.\n\n Bingo.\n \n \npaul also mentions the death/resurrection of this same jesus character numerous times in romans 1:4, 4:24, 6:3, 8:11, 8:34 and 10:9, as well as 1 cor 2:2. now all of this must have been written before paul died, which was nearly a decade before mark wrote the gospel. i think its very clear that an eating, drinking, talking, betrayed, crucified and resurrected jesus was in no way mark's invention. paul had clearly referred to all these terms and concepts before mark's literary release.\n\n Paul's Christ is consistently located in the Spiritual realm \"of the flesh,\" consistent with other mythical saviors of the day whose bloody sacrifices were located 'in the sphere of the flesh' (kata sarka). Nowhere does Paul mention anything about any specific location or time of the sacrifice of Jesus. \n \n I did not intend to imply that Mark fabricated the idea of Jesus, but rather the biographical details of an alleged historical figure who was born in Bethlehem, raised in Nazareth, and crucified in Jerusalem. No such details can be found anywhere from Paul. There is only the spiritual Christ who exists in the sphere of the flesh. In the spiritual realm, it is only in the sphere of the flesh that it is possible to eat, drink, talk, suffer, shed blood, etc., as the Christ did. Christ had to descend to the sphere of the flesh in order to undergo this process. \n \n Without the underlying assumption of an historical Jesus, there is no reason to suspect that Paul was referring to an historical individual anymore than any of the other mythical savior stories were referring to an individual.\n \n \nso, i think doherty's research is incomplete at best. mark's gospel obviously orignated from sources outside his own imagination.\n\n Interesting that you reach this conclusion without even taking the time to read his book. I would suggest that your evaluation of Doherty's research is incomplete at best. :-P\n \n Doherty does not suggest that Mark created the story out of thin air. Rather he shows that the author of Mark brings together the elements of Paul's spiritual Christ with the teachings of the Q community -- attributing the Wisdom sayings of Q to \"Jesus\" and making this same \"Jesus\" a human character who suffered death on a tree as Paul's spiritual Christ did.", 
   {}, 
   66987, 
   null, 
   1095200340.0
  ], 
  [
   67003, 
   null, 
   "thebootfitter", 
   "the revised standard version reads \"Now if he were on earth, he would not be a priest at all\". the kjv says \"For if he were on earth, he should not be a priest\". both your wording and the ones here show that the writer is talking about if jesus were alive in the present, not if jesus was ever alive. obviously at the time the convention was that jesus was at the time dead and resurrected, and nowhere near earth.\n\n Doherty covers this in detail in Appendix 5 of his book, \"The Jesus Puzzle.\" I do not currently have the time to summarize his points without plagierizing... and I do not have permission from him to reprint his text.\n \n \nwhat do you think of heb 5:7 \"In the days of his flesh, Jesus offered up prayers and supplications, with loud cries and tears, to him who was able to save him from death, and he was heard for his godly fear.\"\n\n Jesus descended to \"the sphere of the flesh\" (kata sarka). Isn't it easy to see how the author of Mark could take this scene and turn it into Gethsemane?", 
   {}, 
   66991, 
   null, 
   1095201120.0
  ], 
  [
   67004, 
   null, 
   "thebootfitter", 
   "Again, that is because the Jews did not typically trace genealogies through women. \n ...\n I can only say that it's the study of Heli and how he fits in that shows that it ends with Mary in Luke.\n From http://philologos.org/__eb-jl/luke03.htm\n Which is only a partial explanation and the only reference I can come up with at this time:\n\n Okay. I understand what you're getting at now. Interesting.", 
   {
    "unicode_changes_made": true
   }, 
   66992, 
   null, 
   1095201300.0
  ], 
  [
   67025, 
   null, 
   "thebootfitter", 
   "I found a relatively concise summary of Doherty's position here:\n http://www.earlychristianwritings.com/theories.html#doherty\n \n Earl Doherty holds that Christianity began with a mythical Christ. Earl Doherty argues that the diffuse undercurrent of religious thought called early Christianity can be shown to be a plausible descendant or cousin of Jewish mystical speculation on the scriptures (found in such writings as the Odes of Solomon, the Wisdom of Solomon, and Philo of Alexandria) and was probably well-received by those converts to early Christianity who were influenced by Platonism and Hellenistic soteriological ideas of the day. According to Doherty, religious thinking of the time saw the heavens as multi-layered and would understand the descent of a heavenly Christ to be sacrificed in the lower spheres of the heavens before being raised to the right hand of the Father. This is called the \"Jerusalem Tradition,\" and it is exemplified by the epistles of Paul, seven of which are accepted as authentic. \n \n As the other tributary to early Christianity, we have the \"Galilean Tradition,\" a separate Kingdom of God preaching movement located in Syro-Palestine. According to Doherty, the earliest version of Q had no mention of any kind of founder of the Q community but rather was an anonymous wisdom collection. Doherty maintains that the final redaction of Q as well as the Gospel of Thomas derived from this original document and added the \"Jesus said\" references only at a subsequent stage. Doherty sees the author of the Gospel of Mark as one who had been brought up in the \"Galilean Tradition\" and devised a brilliant bit of religious syncretism in identifying the fictional Q founder with the exalted Pauline Christ in fashioning the passion story whole cloth. Mark's narrative (c. 85-90 CE) was the sole basis upon which the later evangelists retold the story: Matthew (c. 100 CE), Luke (c. 125 CE), and John (c. 125 CE) all depended upon Mark. The book of Acts is a catholicizing fiction of the mid second century. Although certain second century apologists continued to espouse a purely divine Christ, the Gospel myth eventually came to dominate Christian thought.", 
   {}, 
   67004, 
   null, 
   1095205680.0
  ], 
  [
   67055, 
   null, 
   "maximus", 
   "Bootfitter,\n \nAccording to Doherty (pg 13), \"Among the 13 epistles assigned to Paul, scholarly study and computer anlaysis have judged only seven as genuine: Romans, 1 and 2 Corinthians, Galatians, Philippians, 1 Thessalonians, and Philemon... 1 & 2 Timothy and Titus are... assigned to the early second century, usually 110-130.\"\n\n So the verses I quoted from 1 Corinthians 15  are considered authentic by Doherty? He has no comment on those verses and the statement that salvation came through man ? Shall we remove the statement from Colossians on the fact that the deity dwelled in Jesus bodily due to it not being considered authentic?\n \n \nThis passage is comparable to stories that other mystery cults of Paul's time had, where a mythical meal was shared. Such a story gives credence to a symbolic meal that was being shared by members of Paul's community. It is not necessary for this scene to have taken place at a point in historical time somewhere on earth.\n \n In fact, Paul begins this passage by saying, \"For I received [paralambano*] from the Lord that which I passed on to you...\" *The verb Paul uses here is the same verb as he uses many other times in his letters, which Doherty points out means 'received through revelation.' Paul speaks about his doctrine as coming through a spiritual channel... through direct revelation from the Lord. Not from Peter or some other apostle who was supposedly present at this gathering.\n\n Paul does not say that the Eucharistic meal is a symbolic  or mythical  meal. He says just the opposite:\n \n 1 Corinthians 10:16-17  \"The cup of blessing which we bless, is it not a participation in the blood of Christ? The bread which we break, is it not a participation in the body of Christ? Because there is one bread, we who are many are one body, for we all partake of the one bread.\"\n \n Look what it says if you read further in Corinthians past the statement on the reception via revelation:\n 1 Corinthians 11:23-27  \"For I received from the Lord what I also delivered to you, that the Lord Jesus on the night when he was betrayed took bread, and when he had given thanks, he broke it, and said, 'This is my body which is for you. Do this in remembrance of me.' In the same way also the cup, after supper, saying, 'This cup is the new covenant in my blood. Do this, as often as you drink it, in remembrance of me.' For as often as you eat this bread and drink the cup, you proclaim the Lord's death  until he comes.\n \n Whoever, therefore, eats the bread or drinks the cup of the Lord in an unworthy manner will be guilty of profaning the body and blood of the Lord. Let a man examine himself, and so eat of the bread and drink of the cup. For any one who eats and drinks without discerning the body   eats and drinks judgment upon himself.\" \n \n Paul believed in the Real Presence of Jesus in the Eucharistic meal.", 
   {}, 
   66966, 
   null, 
   1095220320.0
  ], 
  [
   67056, 
   null, 
   "maximus", 
   "I found it...\n Hebrews 8:4 \"Now, if he had been on earth, he [Jesus] would not even have been a priest.\"\n \n Is there an explanation for this passage that coincides reasonably with an actual historical Jesus the Christ?\n\n My translation says, \"if he were on earth\" meaning he has already ascended into heaven and is there now. There is a question of tense in this passage and I believe the context of the entire passage fits better with \"if he were on earth.\"", 
   {}, 
   66979, 
   null, 
   1095220560.0
  ], 
  [
   67092, 
   null, 
   "unkerpaulie", 
   "paul, mark and other writers of the gospels all inply that jesus was a living, breathing, talking, dying, resurrecting human that walked the earth. doherty claims that paul is not implying such, even though his epistles clearly describe jesus' interactions with humans, a feat no mythical level-7 spiritual being could accomplish. \n \n how did the christian movement originate? doherty suggests a graduation out of hellenistic and platonic belief. though plato and hellen teaches about realms of spirituality, \"lesser gods\" and the like, the character jesus was never heard of until around the time his was said to have walked the earth. if at this time the population was to think that this newly discovered son of God character was to be accepted as their savior, they would need to believe that he came to the realm of the flesh (earth), was crucified by humans, and resurrected. this is all consistent with what the gospels say.\n \n doherty seems to agree, except he states that this jesus character did all this, but in the unseen realm of the spirit. if this is the case, then jesus never interacted with humans in the way described by paul or the gospels\n \n but if this is true, then why did paul write that he did? and why did mark and the other gospel writers follow suit? according to this source paul started writing epistles 19 years after jesus' death. (this ia also the source that dates stephen's stoning and the commencement of paul's persecution on the christians. mind you, its an atheism site) \n \n does doherty believe that its a coincidence that the christian religion started growing immediately after the dates when christ was allegedly killed? apparently christians started appearing just around this time. whoever invented the christian doctrine was creating quite a stir, and jews saw this religion as radical, to the point where christians was prejudiced against (the name 'christian' itself was a derogatory name that the early disciples adopted). my question is: what is doherty's explanation for this sudden explosion of christian membership from 30 ce and onward?", 
   {}, 
   67056, 
   null, 
   1095263880.0
  ], 
  [
   67170, 
   null, 
   "maximus", 
   "Bootfitter,\n Does Doherty believe Jesus is simply a myth created by men and nothing more? Or does Doherty believe that Jesus in fact existed but only as a spiritual being that delivered a message to earthlings? \n \n If Doherty does believe that Jesus existed as a spiritual being then does he speak on why God would send a spiritual Jesus? \n \n A spiritual Jesus (sent by God) makes no sense to me in preserving the continuity of the Judeo-Christian history. The Jews were awaiting a Messiah and they all expected a man (if not a God-man) not a spirit. Jesus put a face on a faceless God, he became a living icon. God, the Father, did not want a spiritual Jesus. The Father could have communicated directly with the people spiritually or used prophets as he did in the Old Testament. The Father wanted a son--one to be as close to mankind as possible, to feel as a human, to think as a human, to live as a human, but to die as a God--so that salvation would be ours.", 
   {}, 
   67092, 
   null, 
   1095291600.0
  ], 
  [
   67828, 
   null, 
   "thebootfitter", 
   "Does Doherty believe Jesus is simply a myth created by men and nothing more? Or does Doherty believe that Jesus in fact existed but only as a spiritual being that delivered a message to earthlings?\n\n I understand Doherty to suggest that there was no individual human being named Jesus who was born in Bethlehem, was raised in Nazareth, and was crucified in Jerusalem as described in the Gospels. I understand Doherty to suggest that Paul (and others like him) preached a spiritual Christ, similar to other mythical saviors of the time. Paul and the other apostles 'received' (original verb implies [through revelation] -- not through eye-witness testimony) the message about Jesus Christ directly from God. And they were preaching the message that was given them through revelation.\n \n \nIf Doherty does believe that Jesus existed as a spiritual being then does he speak on why God would send a spiritual Jesus?\n\n I understand Doherty to be atheistic, so he doesn't concern himself with the spiritual question of \"If there is a God as described by the Hebrew bible, why would that God send a spiritual Jesus instead of an actual Jesus.\" Rather, he is concerned with the question whether Jesus as described in the Gospels ever existed in this physical realm.\n \n \nA spiritual Jesus (sent by God) makes no sense to me in preserving the continuity of the Judeo-Christian history. The Jews were awaiting a Messiah and they all expected a man (if not a God-man) not a spirit. Jesus put a face on a faceless God, he became a living icon. God, the Father, did not want a spiritual Jesus. The Father could have communicated directly with the people spiritually or used prophets as he did in the Old Testament. The Father wanted a son--one to be as close to mankind as possible, to feel as a human, to think as a human, to live as a human, but to die as a God--so that salvation would be ours.\n\n This makes sense in retrospect... If there wasn't, in fact, an historical Jesus when the Jews were awaiting one... believing that there WAS an historical Jesus would be pretty convenient. It would mean that the prophecies were fulfilled.\n \n Did the Father want a son? Or was that just a more powerful way for people to believe in the message preached by Paul? To make Paul's spiritual figure a human figure with a biography?\n \n From earlier:\n \nEarlier Paul says in 1 Corinthians 15:13 \"But if there is no resurrection of the dead, then Christ has not been raised; if Christ has not been raised, then our preaching is in vain and your faith is in vain.\" \n \n I would say that if there is a resurrection from the dead then one must have previously lived and died. If there is no life then there is no death. If there is no death then there is no resurrection. If there is no resurrection, then as Paul says, our faith is in vain. If there was no Jesus living as man then our faith is in vain. (I also wonder if Paul preaches only a spiritual being in Jesus how he preaches only \"Jesus and him crucified.\" How is a spiritual being crucified?)\n\n Here is one of Doherty's responses to this text (taken from http://pages.ca.inter.net/~oblio/siltop20.htm):\n \n9. - 1 Corinthians 15:12-16 \n \n 12But if it is preached that Christ has been raised from the dead, how can some of you say that there is no resurrection of the dead? 13If there is no resurrection of the dead, then not even Christ has been raised. 14And if Christ has not been raised, then our preaching is vain, your faith also is vain. 15Moreover, we are even found to be false witnesses of God, because we witnessed against God that he raised Christ, whom he did not raise if in fact the dead are not raised. 16For if the dead are not raised, not even Christ has been raised. [NASB/NIV]\n There are some devastating implications to be drawn from this passage. Paul expresses himself as though the raising of Christ from the dead is a matter of faith, not of historical record as evidenced by eyewitness to a physical, risen Jesus at Easter. He is so adamant about the necessity to believe that the dead will be raised, that he is prepared to state-and he repeats it four times-that if they are not, then Christ himself \"has not been raised.\" If men he knew had witnessed the actual return of Jesus from the grave, I do not think he would have thought to make even a rhetorical denial of it. \n Moreover, the verb for \"witness\" (martureo) is often used in the sense of witnessing to, of declaring one's belief in, an item of faith, not of factual record (though it can mean this in some contexts). Such a meaning here is strongly supported by what follows this verb: kata tou theou, or \"against God.\" Translators often seem uncertain of the exact import of this phrase, but Bauer's Lexicon firmly declares it as meaning \"give testimony in contradiction to God.\" The idea that Paul is trying to get across here is that if in fact God did not raise Jesus from death (which would have to be the conclusion, he says, if all of the dead are not raised) then, rhetorically speaking, he and other apostles have been contradicting God and lying about Jesus' resurrection. \n \n The point is, and it's unmistakable, Paul is saying that knowledge about Jesus' raising has come from God, and that his own preaching testimony, true or false, is something which relates to information which has come from God-in other words, through revelation. Not history, not apostolic tradition about recent events on earth. In all this discussion about the trueness of Christ's resurrection, Paul's standard is one of faith, faith based on God's testimony-meaning, in scripture. (Cf. Romans 8:25, 10:9, 1 Thess. 4:14.) Historical human witness plays no part. \n", 
   {
    "unicode_changes_made": true
   }, 
   67170, 
   null, 
   1095743940.0
  ], 
  [
   67830, 
   null, 
   "thebootfitter", 
   "paul, mark and other writers of the gospels all inply that jesus was a living, breathing, talking, dying, resurrecting human that walked the earth.\n\n Before we can assert that Paul implied that Jesus was a living, breathing, etc. human, I think we need to determine whether the language Paul used is comparable to language that other 'prophets' used for their own mythical saviors. Doherty shows that Paul's use of key phrases indicate that Paul received all of the knowledge he is preaching through spiritual channels -- Not through eye-witness testimony.\n \n \ndoherty claims that paul is not implying such, even though his epistles clearly describe jesus' interactions with humans, a feat no mythical level-7 spiritual being could accomplish.\n\n Stories of mythical beings and human beings interacting were abundant. Think Greek and Roman mythology. The idea certainly was not foreign or strange to people living at the time.\n \n \nhow did the christian movement originate? doherty suggests a graduation out of hellenistic and platonic belief. though plato and hellen teaches about realms of spirituality, \"lesser gods\" and the like, the character jesus was never heard of until around the time his was said to have walked the earth.\n\n [Slight clarification: I don't believe there is any written record of the 'character' of Jesus until several years after his alleged crucifixion. And there is no written record of any of the biographical details of the life of Jesus the Christ of Nazareth until the Gospel of Mark.] \n \n...if at this time the population was to think that this newly discovered son of God character was to be accepted as their savior, they would need to believe that he came to the realm of the flesh (earth), was crucified by humans, and resurrected. this is all consistent with what the gospels say.\n\n Why? Why would he have to come to earth in the same physical realm in which we exist? If belief in Jesus Christ is dependent upon faith (as Paul implies) and not upon knowledge of an actual human being in recent history (for which Paul gives no details anywhere), then why must there be an historical figure? Faith doesn't require there to be.\n \n \ndoherty seems to agree, except he states that this jesus character did all this, but in the unseen realm of the spirit. if this is the case, then jesus never interacted with humans in the way described by paul or the gospels\n\n I don't understand Doherty to agree. I understand Doherty to show that Paul preached a Jesus who \"did all this\" in the unseen realm of the spirit. As an atheist, Doherty likely does not believe that any Christ figure was crucified in any realm -- spiritual or earthly. \n \n \n...but if this is true, then why did paul write that he did? and why did mark and the other gospel writers follow suit?\n\n How did Mark and the other gospel writers 'follow suit'? The Jesus that Paul preached had no earthly ministry. Paul doesn't mention any biographical details ('born of a woman' -- what woman? where?). Paul doesn't quote an historical Jesus when proclaiming God's revealed word, but rather says that the word was revealed to him.\n \n \ndoes doherty believe that its a coincidence that the christian religion started growing immediately after the dates when christ was allegedly killed? apparently christians started appearing just around this time. whoever invented the christian doctrine was creating quite a stir, and jews saw this religion as radical, to the point where christians was prejudiced against (the name 'christian' itself was a derogatory name that the early disciples adopted). my question is: what is doherty's explanation for this sudden explosion of christian membership from 30 ce and onward?\n\n I haven't seen any evidence anywhere for an 'explosion' of Christian membership beginning around 30 CE. If you have some, I would be genuinely interested in seeing it. Regardless, an 'explosion' of a spiritual movement is not dependent upon historical facts. Consider the formation of the LDS Church, for example.\n \n In summary... we have moved far away from my original hypothetical question. I am not really so much interested in defending Doherty's position. I think he does that on his own rather well. (Though recently, I came across a website from an atheist that had several good counterpoints to Doherty's arguments. I wish I would have bookmarked it to share it here. Later: http://www.didjesusexist.com/doherty-muller.html) If you are genuinely interested in understanding Doherty's arguments, I would suggest you read his book as well as critiques of his book. \n \n My intention for starting this thread was not to argue for Doherty's position in any way, but rather to inquire into the implications for you as an individual if Doherty's theory (or any other non-historical Jesus theory for that matter) accurately reflected the historical truth of the matter.\n \n The way I see it currently is this: If Jesus existed as described by the Gospels, then He did. If Jesus didn't exist, then he didn't exist. Nothing I can do, say, or believe will ever change the reality of what happened in history.", 
   {}, 
   67092, 
   null, 
   1095746820.0
  ], 
  [
   67832, 
   null, 
   "maximus", 
   "Bootfitter,\n \nDid the Father want a son? Or was that just a more powerful way for people to believe in the message preached by Paul? To make Paul's spiritual figure a human figure with a biography?\n\n I think if you read scripture in its entirety then it is evident that there was an account of a historical event. \n \n Regarding Paul--I think Doherty's assertions fall apart when one looks at scripture verse I cited in Post 58 and the previous post I wrote on the subject. \n \n Paul was going to make his spiritual message more believable by claiming that a man was the Son of God and that he rose from the dead on the third day after being crucified? He was going to make it more believable by including his conversion in which he was blinded and thrown off of a horse and spoken to directly by God?\n \n Also, if Paul is proposed as an originator of sorts of this story then why would he not put himself in as one of the eyewitness apostles. To say that he was an eyewitness to this man he created to shore up his spirit story would be more believable then to say he received a revelation. Yet he talks about all of the other apostles who were with Christ.\n \n (By the way, I have also found Paul's statement on his persecution of the Church in one of the books that Doherty would accept as authentic: 1 Corinthians 15:9).\n \n I yield though, so the thread can be taken back to your original question.", 
   {}, 
   67828, 
   null, 
   1095748740.0
  ], 
  [
   67877, 
   null, 
   "unkerpaulie", 
   "[Slight clarification: I don't believe there is any written record of the 'character' of Jesus until several years after his alleged crucifixion. And there is no written record of any of the biographical details of the life of Jesus the Christ of Nazareth until the Gospel of Mark.] \n\n the name Jesus appeared in Paul's first written letter to the thesalonians in 49 ce. this was a mere 19 years after the date of jesus' death. the people of thesalonica were no doubt already familiar with the name since paul talks about this jesus character quite comfortably. whether in 'character' or not, the entity jesus was already known in the region long before mark's writing.\n \n \nWhy? Why would he have to come to earth in the same physical realm in which we exist? If belief in Jesus Christ is dependent upon faith (as Paul implies) and not upon knowledge of an actual human being in recent history (for which Paul gives no details anywhere), then why must there be an historical figure? Faith doesn't require there to be.\n\n did you read the passage maximus quoted? if there was no death and ressurection, then there is no validity in the preaching of the gospel. paul's writing was being sent out to those who were not jews or pallestinians, and therefore not eye-witnesses of jesus' death and resurrection. this by no means implies that these events didnt happen, but paul's words about having faith would apply to those that did not see the resurrection themselves.\n \n \nI don't understand Doherty to agree. I understand Doherty to show that Paul preached a Jesus who \"did all this\" in the unseen realm of the spirit. As an atheist, Doherty likely does not believe that any Christ figure was crucified in any realm -- spiritual or earthly. \n\n what i was saying is the gospel requires that this jesus christ to have come to earth (or at least to the 7th spiritual sphere) die and resurrect back to the upper spiritual levels in order to make the salvation plan available to humans. the gospels and doherty agree that this is the formula they were trying to describe. the difference is, doherty suggests that the early christians accepted that this jesus never existed, while the gospel writers asserts that he was actually a physical person. \n \n \nHow did Mark and the other gospel writers 'follow suit'? The Jesus that Paul preached had no earthly ministry. Paul doesn't mention any biographical details ('born of a woman' -- what woman? where?). Paul doesn't quote an historical Jesus when proclaiming God's revealed word, but rather says that the word was revealed to him.\n\n the jesus that paul preached about had disciples with which he ate, drank and talked with, one of which betrayed him. the jesus that paul preached about died, and resurrected. this is strikingly similar to the jesus that mark and the other gospel writers wrote about. i'd say its the same exact jesus\n \n \nI haven't seen any evidence anywhere for an 'explosion' of Christian membership beginning around 30 CE. If you have some, I would be genuinely interested in seeing it. Regardless, an 'explosion' of a spiritual movement is not dependent upon historical facts. Consider the formation of the LDS Church, for example.\n\n well, i think that its quite remarkable that in about 20-30 years after the stated time of jesus' death there are christian churches all over greece, rome, turkey, and spreading into europe and asia. considering that this concept of \"christ\" was basically non-existent before that, it seems like it could be considered an explosion by some.\n \n \nIn summary... we have moved far away from my original hypothetical question. I am not really so much interested in defending Doherty's position. I think he does that on his own rather well. (Though recently, I came across a website from an atheist that had several good counterpoints to Doherty's arguments. I wish I would have bookmarked it to share it here. Later: http://www.didjesusexist.com/doherty-muller.html) If you are genuinely interested in understanding Doherty's arguments, I would suggest you read his book as well as critiques of his book. \n \n My intention for starting this thread was not to argue for Doherty's position in any way, but rather to inquire into the implications for you as an individual if Doherty's theory (or any other non-historical Jesus theory for that matter) accurately reflected the historical truth of the matter.\n \n The way I see it currently is this: If Jesus existed as described by the Gospels, then He did. If Jesus didn't exist, then he didn't exist. Nothing I can do, say, or believe will ever change the reality of what happened in history.\n\n we are not asking you to back up doherty's beliefs, but just to explain the details, since we (well, i) dont have his book to reference, and the website you linked only has a superficial overglossing of the idea.\n \n it does matter whether jesus existed or not, and though our beliefs wont change the fact, we should facts to change our beliefs. im not attacking you or doherty, and i dont want to put you in a defensive position, because i want to see this topic pursued. i am just presenting the case from the perspective that doherty may have jumped to a premature conclusion, and that there is much more to be considered thanwhat doherty presents\n \n finally, as far as the hypothetical goes, i, as well as a number of other participants answered that question. it was only after that you brought to the discussion a case for the possibility that jesus actually never existed, and that is what steered the discussino in this direction", 
   {}, 
   67830, 
   null, 
   1095793140.0
  ], 
  [
   67895, 
   null, 
   "thebootfitter", 
   "the name Jesus appeared in Paul's first written letter to the thesalonians in 49 ce. this was a mere 19 years after the date of jesus' death. the people of thesalonica were no doubt already familiar with the name since paul talks about this jesus character quite comfortably. whether in 'character' or not, the entity jesus was already known in the region long before mark's writing.\n\n This isn't in dispute. 19 years is 19 years. It can be seen as a relatively long period, or as a relatively short period, depending on the viewpoint.\n \n \ndid you read the passage maximus quoted? if there was no death and ressurection, then there is no validity in the preaching of the gospel. paul's writing was being sent out to those who were not jews or pallestinians, and therefore not eye-witnesses of jesus' death and resurrection. this by no means implies that these events didnt happen, but paul's words about having faith would apply to those that did not see the resurrection themselves.\n\n See my post #62 for Doherty's response to this argument.\n \n \nwhat i was saying is the gospel requires that this jesus christ to have come to earth (or at least to the 7th spiritual sphere) die and resurrect back to the upper spiritual levels in order to make the salvation plan available to humans. the gospels and doherty agree that this is the formula they were trying to describe. the difference is, doherty suggests that the early christians accepted that this jesus never existed, while the gospel writers asserts that he was actually a physical person.\n\n This isn't necessarily the case. Doherty suggests that even Mark didn't believe that there was an actual historical figure behind his literary creation, but rather that he put biographical details to the spiritual Christ of Paul in order to tell the story that his movement was trying to communicate to its followers.\n \n \nthe jesus that paul preached about had disciples with which he ate, drank and talked with, one of which betrayed him. the jesus that paul preached about died, and resurrected. this is strikingly similar to the jesus that mark and the other gospel writers wrote about. i'd say its the same exact jesus.\n\n Depending on how you define 'the exact same jesus,' this need not be in dispute either. However, Doherty shows that there are many contradictions between Paul's Jesus and Mark's Jesus for both of them to be referring to a single historical figure.\n \n \nwell, i think that its quite remarkable that in about 20-30 years after the stated time of jesus' death there are christian churches all over greece, rome, turkey, and spreading into europe and asia. considering that this concept of \"christ\" was basically non-existent before that, it seems like it could be considered an explosion by some.\n\n Okay... even if one considers it an 'explosion,' is it necessary that a single historical figure be behind this explosion? (In fact, some people will argue that Christianity could not have risen from one individual and his twelve apostles, but rather that it had many different sources preaching similar messages around the same time. And later, these similar teachings were unified under the Church.)\n \n \ni am just presenting the case from the perspective that doherty may have jumped to a premature conclusion, and that there is much more to be considered thanwhat doherty presents\n\n This certainly is a possibility. There are certainly no shortage of scholars that disagree with Doherty's conclusion. I don't see anything premature about his conclusion, though. Nothing has been brought up in this short discussion that he hasn't addressed. And he has addressed many more rigorous critiques than this one over the years.", 
   {}, 
   67877, 
   null, 
   1095800640.0
  ], 
  [
   68003, 
   null, 
   "unkerpaulie", 
   "This isn't necessarily the case. Doherty suggests that even Mark didn't believe that there was an actual historical figure behind his literary creation, but rather that he put biographical details to the spiritual Christ of Paul in order to tell the story that his movement was trying to communicate to its followers.\n\n hmmm... even more interesting. so doherty supposes that mark's writing was mean to personify a non-existent, unseen, imaginary figure. and doherty also supposes that all the followers of the christian religion at the time understood this. (of course, doherty's supposition is subject to the actual intent of mark and paul, which we have no means of finding out.) the thing is, doherty's supposition is plausible, but not likely. the same could be said about any historical figure or event that ever took place in history. for example, we could as easily suppose that to the egyptians cleopatra was never a living human person, but a similar imaginary figure that the egyptians all acknowledged as a legend/deity. of course if we look at their writings today, it would SEEM as if they were describing a physical queen, but from doherty's point of view its just as likely that they were only speeaking of a spiritual revelation of the cleopatra character\n \n the question that follows is: what caused the shift? if the early christians acknowlegded only a spiritual mythical non-existent jesus, then what caused that belief to be replaced for the ones christians hold today? where in the timeline does doherty account for the sudden or gradual belief that jesus was a person, rather than a spirit as originally believed\n \n \nDepending on how you define 'the exact same jesus,' this need not be in dispute either. However, Doherty shows that there are many contradictions between Paul's Jesus and Mark's Jesus for both of them to be referring to a single historical figure.\n\n i'd be more than happy to see doherty's examples of these differences\n \n \nOkay... even if one considers it an 'explosion,' is it necessary that a single historical figure be behind this explosion? (In fact, some people will argue that Christianity could not have risen from one individual and his twelve apostles, but rather that it had many different sources preaching similar messages around the same time. And later, these similar teachings were unified under the Church.)\n\n various sources simultaneously coming up with independent doctrines that just happen to coincide with each other? you have to remember that the areas the early church \"spread\" to were already dominated by various other religions, like taoism in aisa, norse in europe, and hundreds of \"dialect\" religions in africa. to propose that out of these diverse background, spontaneously and almost simultaneously, emerges these christ/salvation religions is a ridiculously far-fledged assuption. does doherty really think its more likely that these \"churches\" started independently in various areas of the known world and happened to coincide? particularly in the face of contradicting reports?\n \n \nThis certainly is a possibility. There are certainly no shortage of scholars that disagree with Doherty's conclusion. I don't see anything premature about his conclusion, though. Nothing has been brought up in this short discussion that he hasn't addressed. And he has addressed many more rigorous critiques than this one over the years.\n\n here are a list of things i'd like to hear doherty's views on:\n - what caused the spread of christianity around the time just before paul's ministry\n - what influenced the romans to begin counting years from this point?\n - what caused the shift in belief convention from a spirit jesus to a physical jesus\n - how did the name \"jesus\" originate? (it was in paul's letter as early as 19 years after jesus's alleged death)\n - how does doherty suppose mark was writing about a mythical jesus, when this jesus was doing so many miracles and talking to so many people?", 
   {}, 
   67895, 
   null, 
   1095871080.0
  ], 
  [
   68006, 
   null, 
   "unkerpaulie", 
   "i want to address in detail doherty's response to 1 cor 15:12-16\n \nThere are some devastating implications to be drawn from this passage. Paul expresses himself as though the raising of Christ from the dead is a matter of faith, not of historical record as evidenced by eyewitness to a physical, risen Jesus at Easter. He is so adamant about the necessity to believe that the dead will be raised, that he is prepared to state-and he repeats it four times-that if they are not, then Christ himself \"has not been raised.\" If men he knew had witnessed the actual return of Jesus from the grave, I do not think he would have thought to make even a rhetorical denial of it. \n\n lets look at the context. paul addresses the people of corinth, who were obviously not around to witness jesus' death and resurrection. for their context, they would have to take paul's word that jesus had indeed been risen, and would have to believe by faith that the dead raise. as doherty says, \"If men he knew had witnessed the actual return of Jesus from the grave, I do not think he would have thought to make even a rhetorical denial of it.\" obviously, these men he wrote to did not witness the return of jesus from the grave, so the emphasis paul makes about it is reasonable in this case\n \n \nMoreover, the verb for \"witness\" (martureo) is often used in the sense of witnessing to, of declaring one's belief in, an item of faith, not of factual record (though it can mean this in some contexts). Such a meaning here is strongly supported by what follows this verb: kata tou theou, or \"against God.\" Translators often seem uncertain of the exact import of this phrase, but Bauer's Lexicon firmly declares it as meaning \"give testimony in contradiction to God.\" The idea that Paul is trying to get across here is that if in fact God did not raise Jesus from death (which would have to be the conclusion, he says, if all of the dead are not raised) then, rhetorically speaking, he and other apostles have been contradicting God and lying about Jesus' resurrection. \n\n the word \"witness\" is in the context \"we are even found to be false witnesses of God, because we witnessed against God\". the \"we\" implies himself and anybody else that testifies the same, including those he wrote to. again, the people he wrote to would not be eye-witnesses of the resurrection, but witnesses by faith. however, paul charged that they would be false witnesses, if they testified that God HAD raised Jesus from the dead if God didnt in reality.\n \n \nThe point is, and it's unmistakable, Paul is saying that knowledge about Jesus' raising has come from God, and that his own preaching testimony, true or false, is something which relates to information which has come from God-in other words, through revelation. Not history, not apostolic tradition about recent events on earth. In all this discussion about the trueness of Christ's resurrection, Paul's standard is one of faith, faith based on God's testimony-meaning, in scripture. (Cf. Romans 8:25, 10:9, 1 Thess. 4:14.) Historical human witness plays no part. \n\n this is an illogical conclusion. paul's wording is clearly to corinthians that had not been eye-witnesses. paul doesnt give the impression that jesus' resurrection was \"revealed\" to him in this passage at all. in fact, paul adamantly insists that if christ has not raised from the dead, then their preaching would be in vain, and furthermore that if they witnessed (testified/expressed their belief) that christ was raised, when in fact he wasnt, then they themselves would be false witnesses. how doherty comes up with such a contrary conclusion is totally beyond me", 
   {
    "unicode_changes_made": true
   }, 
   68003, 
   null, 
   1095872580.0
  ], 
  [
   69420, 
   null, 
   "unkerpaulie", 
   "mr bootfitter?", 
   {}, 
   68006, 
   null, 
   1096646220.0
  ], 
  [
   69469, 
   null, 
   "thebootfitter", 
   "mr bootfitter?\n\n Or Ms.? Or Mrs.? I'm not certain I've ever disclosed my gender here. ;-)\n \n Anyway, yes? You don't have any questions in your most recent post. If you are really curious about understanding Doherty's work, I'd encourage you to pick up his book.", 
   {}, 
   69420, 
   null, 
   1096660500.0
  ], 
  [
   69485, 
   null, 
   "unkerpaulie", 
   "Or Ms.? Or Mrs.? I'm not certain I've ever disclosed my gender here. ;-)\n \n Anyway, yes? You don't have any questions in your most recent post. If you are really curious about understanding Doherty's work, I'd encourage you to pick up his book.\n\n see post #67. i posted that and the last on the same day", 
   {}, 
   69469, 
   null, 
   1096663260.0
  ], 
  [
   70005, 
   null, 
   "thebootfitter", 
   "...where in the timeline does doherty account for the sudden or gradual belief that jesus was a person, rather than a spirit as originally believed\n ...\n i'd be more than happy to see doherty's examples of these differences\n ...\n does doherty really think its more likely that these \"churches\" started independently in various areas of the known world and happened to coincide? particularly in the face of contradicting reports?\n ...\n here are a list of things i'd like to hear doherty's views on:\n - what caused the spread of christianity around the time just before paul's ministry\n - what influenced the romans to begin counting years from this point?\n - what caused the shift in belief convention from a spirit jesus to a physical jesus\n - how did the name \"jesus\" originate? (it was in paul's letter as early as 19 years after jesus's alleged death)\n - how does doherty suppose mark was writing about a mythical jesus, when this jesus was doing so many miracles and talking to so many people?\n\n If you are really interested in hearing Doherty's opinions on these items, I'd encourage you to read the book and/or contact Earl Doherty himself through his website. You'll find answers to many of your questions. I don't mean this in any sort of demeaning way, but I don't have the time or interest to interpret Doherty for you. BTW... Doherty is certainly not the only individual to research this subject and come up with similar conclusions.", 
   {}, 
   68003, 
   null, 
   1096958760.0
  ], 
  [
   70029, 
   null, 
   "unkerpaulie", 
   "im sorry that the discussion died. i was of the impression that you held doherty's views as valid and could present reasons to back up that view. its always very enlightening engaging in a debate with you though, so it was cool while it lasted", 
   {}, 
   70005, 
   null, 
   1096987620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What would it mean to you?", 
  "url": "http://www.4forums.com/political/religion-debates/3099-what-would-mean-you.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 3099, 
  "discussion_files": [
   [
    "17538.html", 
    "http://www.4forums.com/political/religion-debates/3099-what-would-mean-you-print.html"
   ], 
   [
    "17539.html", 
    "http://www.4forums.com/political/religion-debates/3099-what-would-mean-you-5-print.html"
   ], 
   [
    "17540.html", 
    "http://www.4forums.com/political/religion-debates/3099-what-would-mean-you-4-print.html"
   ], 
   [
    "17541.html", 
    "http://www.4forums.com/political/religion-debates/3099-what-would-mean-you-3-print.html"
   ], 
   [
    "17542.html", 
    "http://www.4forums.com/political/religion-debates/3099-what-would-mean-you-2-print.html"
   ]
  ], 
  "identifier": 3099
 }
]