[
 [
  [
   3634, 
   null, 
   "kelvin90701", 
   "Anti-gunners propose that they only want sensible guncontrol: reduce availibility to criminals, reduce gun violence, safety, etc\n \n When they achive this, will they stop? Will they go so far as ban toy guns? Will they go after hunting rifles? Will they go after duck guns? Will they ban handguns? As in the UK? As in Austrailia?", 
   {
    "post_info": {
     "post_title": "Rational guncontrol?  Where will it stop?"
    }
   }, 
   null, 
   null, 
   1046544360.0
  ], 
  [
   3637, 
   null, 
   "kelvin90701", 
   "I've only been an NRA member for a few short years. Guncontrol was never much of an issue to me. The restriction of assault rifles, magazine capacity, registration made sense until Million Mom March Day. It was by accident I saw in CSPAN a MMM proudly and openly proclaim on the Mall in D.C. \"first we get the guns, then we get a ship, put the guns on the ship, then sink the ship.\" That was they day guncontrol became an issue for me. That was the day I looked for the NRA website and phone number and joined the NRA.\n \n The NRA is quite open about what they want. Protection of firearms for law abiding citizens.\n \n MMM say they want sensible guncontrol.\n \n Who has the hidden agenda?", 
   {}, 
   3634, 
   null, 
   1046545380.0
  ], 
  [
   3642, 
   null, 
   "JFriday", 
   "From reading what they (the guncontrol crowd) have been saying in commercials and interviews it will stop when we end up like the U.K., people being arrested for \"anit-social behavior\" and crime going through the roof. The idea of RATIONAL gun control has escaped many on that side of the fence. Like you mentioned Kelvin, they wont stop until they have completely disarmed us (the unwashed masses) and we are completely defenceless except for those few of us that can afford private security.\n Rational Guncontrol, no such thing.", 
   {}, 
   3634, 
   null, 
   1046547240.0
  ], 
  [
   3643, 
   null, 
   "Tim", 
   "My question would be what makes you think that they have a hidden agenda? They say that they only want sensible gun laws and don't want to ban guns. Look at Canada. They have strict gun-control laws, but there are millions of privately-owned firearms. Maybe that's what they want.", 
   {}, 
   3634, 
   null, 
   1046547240.0
  ], 
  [
   3650, 
   null, 
   "JFriday", 
   "Oh yeah and this...\n \n Million Mom Shoots off more than her mouth.\n This is about one of the Oganizers (Barbara Graham) who spoke at the MMM. Her and an accomplice (also a MMM member) shot up an innocent man. Read about it here\n Wait this also needs to go in the Gun Control Hypocracy thead.\n \n http://www.usdoj.gov/usao/dc/press/01035b.html", 
   {}, 
   3634, 
   null, 
   1046547900.0
  ], 
  [
   3667, 
   null, 
   "kelvin90701", 
   "Originally posted by JFriday \n Oh yeah and this...\n \n Million Mom Shoots off more than her mouth.\n This is about one of the Oganizers (Barbara Graham) who spoke at the MMM. Her and an accomplice (also a MMM member) shot up an innocent man. Read about it here\n Wait this also needs to go in the Gun Control Hypocracy thead.\n \n http://www.usdoj.gov/usao/dc/press/01035b.html \n \n \n Wow!", 
   {}, 
   3634, 
   null, 
   1046550960.0
  ], 
  [
   3677, 
   null, 
   "kelvin90701", 
   "Originally posted by Tim \n My question would be what makes you think that they have a hidden agenda? They say that they only want sensible gun laws and don't want to ban guns. Look at Canada. They have strict gun-control laws, but there are millions of privately-owned firearms. Maybe that's what they want. \n \n \n We are on our way to being just like Canada. Sadly the Canada is on it's way to becoming just like UK and Austrailia.", 
   {}, 
   3634, 
   null, 
   1046551980.0
  ], 
  [
   3679, 
   null, 
   "kelvin90701", 
   "This is from Aussies down under:\n \n http://www.heraldsun.news.com.au/common/story_page/0,5478,6050463%255E2862,00.html\n \n \n Summary after a student killed two classmates:\n \n \n \"That report revealed student Huan Yun Xiang - who allegedly killed two class mates and wounded five others - owned seven legal handguns and sparked a national agreement to toughen handgun laws.\n \n Victoria yesterday became the first state to move on the agreement to outlaw all semi-automatic pistols with a barrel length of 120mm or more and 100mm or more for single shot pistols or revolvers.\" -Herald Sun\n \n If the guns are already illegal. Why do you need another law to make them illegal again? Do you make it \"doubly\" and \"trippley\" illegal until the killing stops?", 
   {}, 
   3634, 
   null, 
   1046552820.0
  ], 
  [
   3819, 
   null, 
   "Patriot", 
   "Originally posted by JFriday \n Oh yeah and this...\n \n Million Mom Shoots off more than her mouth.\n This is about one of the Oganizers (Barbara Graham) who spoke at the MMM. Her and an accomplice (also a MMM member) shot up an innocent man. Read about it here\n Wait this also needs to go in the Gun Control Hypocracy thead.\n \n http://www.usdoj.gov/usao/dc/press/01035b.html \n \n \n makes me want to turn conspiricy theorist... did they do it on purpose just to up the statistics??? yikes.", 
   {}, 
   3634, 
   null, 
   1046819460.0
  ], 
  [
   3831, 
   null, 
   "kelvin90701", 
   "Barbara Graham is in total denial. She had the gun, she shot the bullets, she chased the guy down, there were other witnesses. According to her it is all a frame up.", 
   {}, 
   3634, 
   null, 
   1046830320.0
  ], 
  [
   3862, 
   null, 
   "JFriday", 
   "Is she still for sensible gun control laws?\n And leniant penalties for those who break them?\n (namely her and her accomplice)", 
   {}, 
   3634, 
   null, 
   1046850420.0
  ], 
  [
   3867, 
   null, 
   "sarablaze", 
   "If she was trying to up the statistics.....damn! Some ppl are just nuts!emoticon_frazzled", 
   {}, 
   3634, 
   null, 
   1046852640.0
  ], 
  [
   4342, 
   null, 
   "kelvin90701", 
   "Children-TV Violence Link Has Effect\n \n By MALCOLM RITTER, AP Science Writer\n \n Both boys and girls who watch a lot of violence on television have a heightened risk of aggressive adult behavior including spouse abuse and criminal offenses, no matter how they act in childhood, a new study says.\n \n While the results may not be surprising, experts say the study is important because it included hundreds of participants and showed the effect in females as well as males.\n \n The participants were interviewed at ages 6 to 9 and again in their early 20s, making the study one of the few to follow children into adulthood to gauge the long-term effects of televised violence.\n \n The findings are presented in the March issue of the journal Developmental Psychology by psychologists L. Rowell Huesmann and colleagues at the University of Michigan's Institute for Social Research.\n \n Huesmann said televised violence suggests to young children that aggression is appropriate in some situations, especially when it is used by charismatic heroes. It also erodes a natural aversion to violence, he said.", 
   {
    "post_info": {
     "post_title": "How to stop gun violence, without gun control"
    }
   }, 
   3634, 
   null, 
   1047265860.0
  ], 
  [
   5711, 
   null, 
   "Tim", 
   "This is what Sarah Brady said in response to the question,\n \"What is your ultimate goal? At what point will there be enough gun control?\"\n \n \"I want to emphasize that my goal and the goal of my organization is to reduce gun violence in this nation. We have no hidden agenda to eliminate a law abiding citizen's right to own or purchase guns. No one would readily hand a weapon to another knowing they were going to commit a murder or rob a bank. Without common sense laws however, that's precisely what our nation did for many years. I feel that by closing loop holes in the instant check system, (which includes a three day waiting period to allow for the most comprehensive background check possible) closing the gun show loop hole (which would mandate that all gun show purchases would be subject to the waiting period and background check) and by extending the background check to all purchases (not just purchases from dealers) we would go a long way in solving our problems. Additionally, a law making adults responsible for keeping guns out of the hands of children is necessary as well as laws regulating the manufacture of guns in the same way any other manufactured item in this nation is held responsible.\" \n \n http://abcnews.go.com/sections/us/DailyNews/chat_990226brady.html", 
   {}, 
   3634, 
   null, 
   1048750440.0
  ], 
  [
   5713, 
   null, 
   "Pie", 
   "\"I want to emphasize that my goal and the goal of my organization is to reduce gun violence in this nation\"\n 10 bucks says you fail miserably.\n \n \"We have no hidden agenda to eliminate a law abiding citizen's right to own or purchase guns.\"\n It's not hidden...everybody knows about it.\n \n \"Without common sense laws however, that's precisely what our nation did for many years. \"\n None of your BS laws did anything to stop this. And, we can't stop it.\n \n \"I feel that by closing loop holes in the instant check system, (which includes a three day waiting period to allow for the most comprehensive background check possible) closing the gun show loop hole (which would mandate that all gun show purchases would be subject to the waiting period and background check) and by extending the background check to all purchases (not just purchases from dealers) we would go a long way in solving our problems. \"\n \n 1)There are no loopholes. The current system works fine.\n 2)There is no \"gun show loophole\". Those 50% of sellers not required to give background checks selll hot dogs, not guns.\n 3)Anyone buying gun is legally required to have a background check. Already. Shaddap, Sarah Bee.\n \n \". Additionally, a law making adults responsible for keeping guns out of the hands of children is necessary as well as laws regulating the manufacture of guns in the same way any other manufactured item in this nation is held responsible.\" \n 1)Tis common frieakin sense. Education'll solve this.\n 2)Companys are held responsible if they manufacture a faulty product. In no shooting heard of to man has the gun malfunctioned..", 
   {}, 
   3634, 
   null, 
   1048753440.0
  ], 
  [
   7177, 
   null, 
   "kelvin90701", 
   "A slight change in thread? Where did the rational gun control stop in Australia?", 
   {}, 
   3634, 
   null, 
   1051290360.0
  ], 
  [
   7184, 
   null, 
   "JFriday", 
   "It hasnt.", 
   {}, 
   3634, 
   null, 
   1051292040.0
  ], 
  [
   11237, 
   null, 
   "kelvin90701", 
   "What is this? Is this gun control? Or gun confiscation? It is very clear anti-gun Senataor Diane Feinstein wants all the guns. Not just assault weapons, not just machine guns, she wants them all.\n \n \"If it were up to me, I would tell Mr. and Mrs. America to turn them in -- turn them all in.\" - Senator Diane Feinstein\n \n http://www.reviewjournal.com/lvrj_home/1997/Oct-13-Mon-1997/opinion/6211250.html", 
   {}, 
   7184, 
   null, 
   1056874260.0
  ], 
  [
   11336, 
   null, 
   "DHard3006", 
   "What is this? Is this gun control? Or gun confiscation? It is very clear anti-gun Senataor Diane Feinstein wants all the guns. Not just assault weapons, not just machine guns, she wants them all.\n \n \"If it were up to me, I would tell Mr. and Mrs. America to turn them in -- turn them all in.\" - Senator Diane Feinstein\n \n http://www.reviewjournal.com/lvrj_home/1997/Oct-13-Mon-1997/opinion/6211250.html\n\n \n \n Gun haters will stop when the right to bear arms is banned! \n \n Criminals do not obey laws so they will have guns. Of course the gun haters like Sen. Feinstein will still have armed bodyguards. \n \n Gun haters like Sen. Feinstein, and Sarah Brady could careless about keeping guns away from dangerous criminals. If these gun haters are so concerned about this. Why do gun haters pass laws that keep law abiding citizens from having guns? \n Gun bans only keep guns away from the law abiding citizen!", 
   {}, 
   11237, 
   null, 
   1057075320.0
  ], 
  [
   11373, 
   null, 
   "grayhawk", 
   "When will it stop? Never. They will take every gun, every toy gun, disarm the law enforcment community, give us Nerf batons so we don't actually hurt the criminals, and say that this kinder gentler way of doing things will help. In the meantime murders will go through the roof, like in Australia, rape will escalate, breaking and entering will become common place, and cops will die by the minute. They will not only confiscate the guns, but then charge the owners of those guns for being terrorists. It won't end. In order to establish true dependency upon a government you must force the populous to rely completely on the government for every aspect of life including safety. emoticon_rolleyes", 
   {}, 
   11336, 
   null, 
   1057219320.0
  ], 
  [
   11380, 
   null, 
   "voiceofreason", 
   "When will it stop? Never. They will take every gun, every toy gun, disarm the law enforcment community, give us Nerf batons so we don't actually hurt the criminals, and say that this kinder gentler way of doing things will help. In the meantime murders will go through the roof, like in Australia, rape will escalate, breaking and entering will become common place, and cops will die by the minute. They will not only confiscate the guns, but then charge the owners of those guns for being terrorists. It won't end. In order to establish true dependency upon a government you must force the populous to rely completely on the government for every aspect of life including safety. emoticon_rolleyes\n\n The claim that the gun buy-back in Australia caused the crime rate to increase has been refuted as an urban legend. http://www.snopes.com/science/stats/ausguns.htm\n \n The people that make this claim are either ignorant or intentionally trying to mislead people. The same with the UK. From reading grayhawk and DHard3006's posts it appears that they get most of their information (or misinformation) from pro-gun websites. Do a little bit of research on your own.", 
   {}, 
   11373, 
   null, 
   1057233660.0
  ], 
  [
   11382, 
   null, 
   "kelvin90701", 
   "The claim that the gun buy-back in Australia caused the crime rate to increase has been refuted as an urban legend. http://www.snopes.com/science/stats/ausguns.htm\n \n The people that make this claim are either ignorant or intentionally trying to mislead people. The same with the UK. From reading grayhawk and DHard3006's posts it appears that they get most of their information (or misinformation) from pro-gun websites. Do a little bit of research on your own.\n\n \n \n I can not comment on Austraila, but the UK stats are definately misleading. In Jan 2003 the office in charge of public saftey was caught purposely fudging the statistics.\n \n Remember? One attack by multiple attackers in the UK is one attack. One atttack by multiple attackers in the USA is counted each as one attack. A dead body in the UK is not murder unless a perp is convicted. A dead body in the USA is murder.", 
   {}, 
   11380, 
   null, 
   1057245060.0
  ], 
  [
   11413, 
   null, 
   "grayhawk", 
   "You can blindly believe whatever you wish voice of reason. I however am not ignorant, nor am I trying to mislead anyone. My information comes from friends of mine who happen to be law enforcement officers in Oz. If they tell me that crime has escalated since the gun ban, I'm going to believe them. When they say that murder has gone up I'm not going to argue with them or point them to anti-gun websites that life down there is peachy. These are the guys doing the job, and if they say crime has gone up, I'm going to hold that as truth, with no spin, no shiny little creative light stuck on it, just plain, simple fact. Take it for what you will, as I'm sure you'll simply blow it off, after all your pro gun websites are much more accurate than the mere words of a cop. \n Statistics are nothing more than a view of whoever took the statistics. Take the class someday, you'll find out how easy it would be to get whatever statistics you'd like and how easy it is to do. If you want to know about what crimes are occuring, ask a cop, don't look at a webpage. They can tell you what's really going on. \n I can tell you that the most used weapon in the town I work in is a rock. I kid you not. More assaults have been charged with a dangerous weapon (rock) than any per se dangerous weapon in the history of the town. (per se dangerous weapon meaning a instrument or object that is inherently dangerous such as a gun or a knife)", 
   {}, 
   11382, 
   null, 
   1057305660.0
  ], 
  [
   11417, 
   null, 
   "voiceofreason", 
   "You can blindly believe whatever you wish voice of reason. I however am not ignorant, nor am I trying to mislead anyone. My information comes from friends of mine who happen to be law enforcement officers in Oz. If they tell me that crime has escalated since the gun ban, I'm going to believe them. \n\n So anything a cop says must be true? Learn to think for yourself.\n It's interesting how my link said that an Australian cop was spreading the misinformation. http://www.snopes.com/science/stats/ausguns.htm", 
   {}, 
   11413, 
   null, 
   1057309740.0
  ], 
  [
   11498, 
   null, 
   "kelvin90701", 
   "So anything a cop says must be true? Learn to think for yourself.\n It's interesting how my link said that an Australian cop was spreading the misinformation. http://www.snopes.com/science/stats/ausguns.htm\n\n \n Your post was a very balanced regarding the use of statics in general. You can not use this as evidence that the reduction in crime is due to the gun ban. The reduction in crime was already an existing trend before the gun ban. After the gun ban the trend was merely on the same path.", 
   {}, 
   11417, 
   null, 
   1057567860.0
  ], 
  [
   11751, 
   null, 
   "DHard3006", 
   "The people that make this claim are either ignorant or intentionally trying to mislead people. The same with the UK. From reading grayhawk and DHard3006's posts it appears that they get most of their information (or misinformation) from pro-gun websites. Do a little bit of research on your own.[/QUOTE]\n \n Gun haters are blinded by their hatred of a right. Why is this? Gun haters like racist are so blinded by their hatred they cannot understand a right. If gun bans worked there would be no gun deaths in the countries that have banned guns. Since there are gun deaths in countries that have banned guns, the gun bans did not work. Since the gun haters have stated they are comfortable with fewer gun deaths, it is clear gun haters have no answer for preventing gun deaths. \n \n This makes it clear that gun bans are not obeyed by criminals. The only people affected by gun bans are the law abiding citizens.\n \n Now as for the infringements gun haters have forced on the American people. It takes time to get rid of bad laws. It took many years to get rid of laws based on sex and race. It will take time to roll back illegal laws that infringe on the right to bear arms.\n \n Gun haters if the 2nd amend did not protect the right to bear arms then all guns in America would be banned.", 
   {}, 
   11380, 
   null, 
   1057815660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Rational guncontrol?  Where will it stop?", 
  "url": "http://www.4forums.com/political/gun-control-debates/310-rational-guncontrol-where-will-stop.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 310, 
  "discussion_files": [
   [
    "12306.html", 
    "http://www.4forums.com/political/gun-control-debates/310-rational-guncontrol-where-will-stop-print.html"
   ], 
   [
    "12307.html", 
    "http://www.4forums.com/political/gun-control-debates/310-rational-guncontrol-where-will-stop-2-print.html"
   ]
  ], 
  "identifier": 310
 }
]