[
 [
  [
   65555, 
   null, 
   "sglaine", 
   "Just wanted to hear your thoughts on mental health workers are good or are they brain washers?", 
   {
    "post_info": {
     "post_title": "Mental health Workers Are They Good Or Are They Brain washers?"
    }
   }, 
   null, 
   null, 
   1094312160.0
  ], 
  [
   65588, 
   null, 
   "joebrummer", 
   "I am a mental health worker! A lot has been done to have people with serious mental illnesses working and being productive members of society!", 
   {}, 
   65555, 
   null, 
   1094324100.0
  ], 
  [
   65595, 
   null, 
   "emclean", 
   "how about all of the above, depending in who is trying to help what. having one cat shrink is too many IMO.", 
   {}, 
   65588, 
   null, 
   1094324640.0
  ], 
  [
   65646, 
   null, 
   "daewoo", 
   "I think that looking at the history of the mental health profession, you see a long line of well intentioned snake oil salesmen.\n \n The current argument for the existence of this entire sector of soft science nonsense is that \"we have come a long ways and learned quite a bit about the human condition\". Sigmund Frued said the same thing, and his views are widely accepted as being incorrect by todays new batch of \"mental health experts\".\n \n It seems almost certian that in 20 years, they will have \"come a long ways and learned quite a bit about the human condition\" and the views of todays quacks and charlatans will be laughed at.\n \n My mothe believes strongly in the field (and I have a sister who is a psychologist), and as far as I can tell, you pay some well meaning quack to explain to you why all your problems are somebody elses fault.\n \n In certain situations, such as state health care programs, the quacks, who are being paid by the state, instead explain to yu why all your problems are your fault, even though they have been caused by somebody else.\n \n Of course, now we have large numbers of chemicals available which we can use to alter peoples brains. Prozac is one that the quacks love. They hand this out to teenage girls like it is candy. It is an antidepressant.\n \n Prozac more or less works by stimulating the brain to produce certain chemicals, chemicals that make you happy. We have recently found that people who are on prozac and go off are prone to commiting suicide, because apparently after you take it for a long time then go off of it, your brain no longer produces these happiness causeing chemicals on its own. It took years for the quacks to figure this out (or at least years for the pharmaceutical companies to admit to it). Of course, and good drug dealer could have told them this from the start.\n \n I think that having some psychologists around may be a good idea, but they should not be allowed to pretend that sitting there talking to you for an hour a week or more is \"treatment\". It can be nice to have somebody to talk to that is legally prohibited from disclosing your conversation. Of course, a loyal friend could perform the same function, is cheaper, and most likely won't pretend to be treating you for some imagined disorder.", 
   {}, 
   65595, 
   null, 
   1094358840.0
  ], 
  [
   65649, 
   null, 
   "joebrummer", 
   "I think you reply knowing nothing of people with serious mental illness. People out there on the front lines, like caseworkers and mobile treatment team workers know that we are keeping the seriously mentally ill off the streets. (homeless, that guy on to the corner isn't talking to himself, he is seeing anotehr person, hearing another person) With proper medications, the most seriously mentally ill can hold down jobs, function at some sort of a baseline. You consider mental health to be some shrink that deals only in depression. People only get out of mental health treatment what they put into it! You don't seem to know about the seriously mentally ill and what they go through on a day to day! If you go to a shrink once a week and feel you are getting nothing out of it, then you must not be putting anything into it either. Recovery is a process which you must participate. The doctor and the meds are only one part, YOU are the rest of the puzzle.", 
   {}, 
   65646, 
   null, 
   1094359380.0
  ], 
  [
   65655, 
   null, 
   "Mach", 
   "I think that looking at the history of the mental health profession, you see a long line of well intentioned snake oil salesmen.\n \n The current argument for the existence of this entire sector of soft science nonsense is that \"we have come a long ways and learned quite a bit about the human condition\". Sigmund Frued said the same thing, and his views are widely accepted as being incorrect by todays new batch of \"mental health experts\".\n \n It seems almost certian that in 20 years, they will have \"come a long ways and learned quite a bit about the human condition\" and the views of todays quacks and charlatans will be laughed at.\n \n My mothe believes strongly in the field (and I have a sister who is a psychologist), and as far as I can tell, you pay some well meaning quack to explain to you why all your problems are somebody elses fault.\n \n In certain situations, such as state health care programs, the quacks, who are being paid by the state, instead explain to yu why all your problems are your fault, even though they have been caused by somebody else.\n \n Of course, now we have large numbers of chemicals available which we can use to alter peoples brains. Prozac is one that the quacks love. They hand this out to teenage girls like it is candy. It is an antidepressant.\n \n Prozac more or less works by stimulating the brain to produce certain chemicals, chemicals that make you happy. We have recently found that people who are on prozac and go off are prone to commiting suicide, because apparently after you take it for a long time then go off of it, your brain no longer produces these happiness causeing chemicals on its own. It took years for the quacks to figure this out (or at least years for the pharmaceutical companies to admit to it). Of course, and good drug dealer could have told them this from the start.\n \n I think that having some psychologists around may be a good idea, but they should not be allowed to pretend that sitting there talking to you for an hour a week or more is \"treatment\". It can be nice to have somebody to talk to that is legally prohibited from disclosing your conversation. Of course, a loyal friend could perform the same function, is cheaper, and most likely won't pretend to be treating you for some imagined disorder.\n\n \n Daewoo :(\n \n We attack problems from two sides.\n \n We research the basic science. This takes forever and as you know, we have a long long long way to go before we understand the fundamentals of everything.\n \n In the mean-time, before we figure out exactly how every single atom in our body intereacts, we HAVE to approach the problem from the behavioral or physically measureable side in parallel with that. \n \n So science on one end, and health care on the other...Doctors, those that monitor our bodies \"behavior\", and our \"mental\" behavior. (really one and the same to some degree).\n \n Doctors have braved into the unknown of the human body with the desire (on the whole), to improve the human condition. They attempt to use science in determining what works, and what doesn't, but they cannot yet know WHY everything works, or WHY everything doesn't. And frankly I don't care if they do, as long as it's legit medicince. The same with psychologists. They DO provide a very real function, that IMO is necessary. And we cannot fault them for not understanding fully everything that their observations and treatments entail.\n \n But there is a big difference between statistical/experimental driven treatments, and \"snake water\". While I do agree America has some crazy lack of regulation on a lot of things like holistic medicine, etc., I think the hardcore psychology has roots in a good service to humankind, based on as much science as they can produce.\n \n I do agree that psychiatrists have an odd job in saying \"yes, you need more vists, you're not quite cured yet\" to have a profession...that is a little odd, but we have to use our judgement like anyone else and determine when we \"need' to have therapy and when we're OK on our own.\n \n \n Those people with REAL mental issues, well that's easy, of course mental health professionals can help them, and in many cases, rehabilitate them to be able to have a \"normal life\".\n \n (And excuse my long-standing use of America as my reference)\n \n -Mach", 
   {}, 
   65646, 
   null, 
   1094361060.0
  ], 
  [
   65857, 
   null, 
   "valet_dave", 
   "While this isn't always the case, I am constantly amazed by psychologists who base their diagnosis soley on interviews with a patient.\n \n Some recommendations or prescriptions that are based on insufficent information are unprofessional at best, and can have serious consequences for the patient, long after the psychologist has cashed the cheque.\n \n Even if a patient is being truthful about their situation, their perception of their environment and the people around them is largely subjective.\n \n This industry needs to sit on the couch and take a long look at itself.", 
   {}, 
   65655, 
   null, 
   1094537820.0
  ], 
  [
   65880, 
   null, 
   "emclean", 
   "there are the two side of mental health, one is the treatment of serisould disterbed people, who do not have the ability to fuction in the world with out help. the other side is the one that hands out pills to socker moms when they are feeling a little blue over little johnie's game.\n \n the first is needed, the second are the snake oil men.", 
   {}, 
   65857, 
   null, 
   1094566140.0
  ], 
  [
   65881, 
   null, 
   "joebrummer", 
   "While this isn't always the case, I am constantly amazed by psychologists who base their diagnosis soley on interviews with a patient.\n \n Some recommendations or prescriptions that are based on insufficent information are unprofessional at best, and can have serious consequences for the patient, long after the psychologist has cashed the cheque.\n \n Even if a patient is being truthful about their situation, their perception of their environment and the people around them is largely subjective.\n \n This industry needs to sit on the couch and take a long look at itself.\n\n \n \n \n \n Those interviews with the patient are based in proven scales and measures. The DSM IV provides clear set of symptoms for many of the most common behavioral health disorders. Withoout some form of a diagnosis the insurance companies won't pay for treatment. Mental Health workers are known for changing a diagnosis after time and getting to know the patient. They are trainied to look for signs that a particular disorder is present and treat accordingly. Patients are not always truthful about what they are experiencing but most are pretty open about their symptoms because they want the symptoms treated. They want to feel better. The exception to this rule would be substance abuse, they don't tend to admit to certain symtoms or they down play symptoms so they can continue \"using\".\n \n As for soccer mom, it is taking care of the pateint so the symptoms don't progress. Most mental illness is progressive. Untreated depression can lead to substance abuse, anxiety disorders etc.....\n \n Without mental health workers there would also be twice as many homeless people with severe mental illness. No snakes oil men, just compassion.", 
   {}, 
   65857, 
   null, 
   1094568720.0
  ], 
  [
   95679, 
   null, 
   "zelma", 
   "I chose, I think we don't have enough mental health care workers. People are neurotic and don't even realize it. Depression is prevalent in all ages. Physicians treat physical symptoms and really don't take the time to assess emotional disease in the clinic, in my opinion. Schools should have mental health care professionals available to identify problem children and maybe some lives could be improved. There are lots of types of mental disease and they are important factors in a persons well-being. Lets not act like they don't exist. Everyone is manic depressive to a point, when it becomes problematic to that person or causes problems in society--it needs to be treated. Everyone associated with that person will feel better.\n \n Whoever posted that medicines are given that have not been evaluated and serious side effects can occur....do you believe mental health care workers are the only people who prescribe those kinds of medications? How many people have taken Celebrex or Vioxx in the last five years?? They are just now finding late effects from these drugs. Adverse effects of drugs are given a code and info is sent to World Health Organization and statistics are compiled after the medication has been FDA improved. \n \n The only problem I have with mental health care is the interplay with the legal system. Of course, I have current dealings with the SASSI being ordered by the district attorney and demanding results. This info should be governed by confidential regulations--but I don't see that in the court house.\n \n I don't feel like that is appropriate, but I know it is currently a highly used tool in the legal system.", 
   {}, 
   65881, 
   null, 
   1110060480.0
  ], 
  [
   95885, 
   null, 
   "jitobear", 
   "I think the nay sayers need to do some volunteer work in a crisis center or mental wealth wing of a hospital, or maybe just spend five minutes with a schizophrenic who has seriously decompensated.\n \n Plus the term \"mental health worker\" is quite a generic one. Just what kind of worker or they referring to? Nurses? Doctors? Case Workers? Psychologists? Counselors? The woman who manages the meal planning at the center I work? Or the activities? The folks like me who are simply there to help and monitor? A miriad of people work with the mentally ill.\n \n I am not snake oik salesman.", 
   {}, 
   95679, 
   null, 
   1110203040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mental health Workers Are They Good Or Are They Brain washers?", 
  "url": "http://www.4forums.com/political/health-debates/3105-mental-health-workers-they-good-they-brain-washers.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 3105, 
  "discussion_files": [
   [
    "23214.html", 
    "http://www.4forums.com/political/health-debates/3105-mental-health-workers-they-good-they-brain-washers-print.html"
   ]
  ], 
  "identifier": 3105
 }
]