[
 [
  [
   65586, 
   null, 
   "Elijah", 
   "In case you are wondering why Terral03 is not answering your posts, he has upset Admin of this site with numerous arguments against 'Gay Rights' to the point that he has been banned from posting here. Here is a copy of the exchange of letters. The charge is 'name calling,' as you can see below. \n \n From : 4Forums.com <support@4forums.com<\n Sent : Friday, September 3, 2004 9:10 PM\n To : \"'Terral Croft'\" <terralcroft@hotmail.com<\n Subject : RE: Hi Admin\n \n Sorry you were banned do to repeated name calling.\n Admin\n \n -----Original Message-----\n From: Terral Croft [mailto:terralcroft@hotmail.com] \n Sent: Friday, September 03, 2004 5:36 PM\n To: admin@4forums.com\n Subject: Hi Admin\n \n Hi Admin:\n \n I tried to join the forum and it looks like you did something to my account? \n Please advise.\n \n Thank you,\n \n Terral\n terral03\n \n If you need assistance with issues pertaining to Bible Doctrine, then email the address above. After posting tens of thousands of words on this site, Admin offered only nine that say, \"Never come back.\" There was no mention of exactly of any examples of name calling. Although, Admin did issue a warning some time ago, for using the word 'homos.' Are heterosexuals offended when called a 'hetero?' When did using the term 'homo' become an offense that warranted being banned from any forum of debate? \n \n This is a sign that the Gay Rights proponents have a serious problem defending their arguments on this forum. When you cannot defeat your debating opponent, or adequately defend your own positions, then ban the opposition. Look who started this thread on Gay Marriage.\n \n http://4forums.com/political/showthread.php?t=41&page=1\n \n If you believe that Terral03 has been improperly banned from posting here, please write Admin with your concerns, at:\n \n support@4forums.com\n \n Regards,\n \n Elijah", 
   {
    "post_info": {
     "post_title": "Terral03 Has Been Banned From Posting Here"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1094321940.0
  ], 
  [
   65642, 
   null, 
   "montalban", 
   "In case you are wondering why Terral03 is not answering your posts, he has upset Admin of this site with numerous arguments against ?Gay Rights? to the point that he has been banned from posting here. Here is a copy of the exchange of letters. The charge is 'name calling,' as you can see below. \n \n From : 4Forums.com <support@4forums.com<\n Sent : Friday, September 3, 2004 9:10 PM\n To : \"'Terral Croft'\" <terralcroft@hotmail.com<\n Subject : RE: Hi Admin\n \n Sorry you were banned do to repeated name calling.\n Admin\n \n -----Original Message-----\n From: Terral Croft [mailto:terralcroft@hotmail.com] \n Sent: Friday, September 03, 2004 5:36 PM\n To: admin@4forums.com\n Subject: Hi Admin\n \n Hi Admin:\n \n I tried to join the forum and it looks like you did something to my account? \n Please advise.\n \n Thank you,\n \n Terral\n terral03\n \n If you need assistance with issues pertaining to Bible Doctrine, then email the address above. After posting tens of thousands of words on this site, Admin offered only nine that say, ?Never come back.? There was no mention of exactly of any examples of name calling. Although, Admin did issue a warning some time ago, for using the word ?homos.? Are heterosexuals offended when called a ?hetero?? When did using the term ?homo? become an offense that warranted being banned from any forum of debate? \n \n This is a sign that the Gay Rights proponents have a serious problem defending their arguments on this forum. When you cannot defeat your debating opponent, or adequately defend your own positions, then ban the opposition. Look who started this thread on Gay Marriage.\n \n http://4forums.com/political/showthread.php?t=41&page=1\n \n If you believe that Terral03 has been improperly banned from posting here, please write Admin with your concerns, at:\n \n support@4forums.com\n \n Regards,\n \n Elijah\n\n Is there a way Admin can present its case? (if it has one) (Or, does it need to?)", 
   {}, 
   65586, 
   null, 
   1094357220.0
  ], 
  [
   65698, 
   null, 
   "billsco", 
   "Well, if Elijah is not terral03 reincarnated, is he merely his sycophant? How did \"Elijah\" come into possession of terral's private emails?", 
   {}, 
   65642, 
   null, 
   1094406360.0
  ], 
  [
   65700, 
   null, 
   "Kronus", 
   "Well, if Elijah is not terral03 reincarnated, is he merely his sycophant? How did \"Elijah\" come into possession of terral's private emails?\n\n \n Not to mention the fact that I believe it's against board rules to post someones real e-mail address, like Elijah has done for Terral.", 
   {}, 
   65698, 
   null, 
   1094406540.0
  ], 
  [
   65708, 
   null, 
   "billsco", 
   "Just found this in post 15 of the suicide thread:\n \n \n\n I am going to be offline for a while now; moving to North Florida.\n \n\n \n \n\n In case you are wondering why Terral03 is not answering your posts, he has upset Admin of this site with numerous arguments against 'Gay Rights' to the point that he has been banned from posting here.\n \n\n \n Enquiring minds want to know.", 
   {
    "unicode_changes_made": true
   }, 
   65700, 
   null, 
   1094412360.0
  ], 
  [
   65711, 
   null, 
   "greg 79 f150", 
   "I see that Elijah only joined 9/3 and has only 3 posts, all three about teral, hmmmm", 
   {}, 
   65708, 
   null, 
   1094413500.0
  ], 
  [
   65739, 
   null, 
   "montalban", 
   "I for one trusted Elijah, taking him for his word. It seems more skeptical minds have smelt him out.", 
   {}, 
   65711, 
   null, 
   1094434260.0
  ], 
  [
   65753, 
   null, 
   "maximus", 
   "Wasn't it obvious in the first post that Elijah is Terral? Does it matter? I have seen others be banned and immediately sign up under another name, sometimes a variant of their original. As long as they show proper conduct from that point, admin usually doesn't have a problem with it as far as I know. (I am saying nothing about Terral's guilt or innocence mind you).", 
   {}, 
   65739, 
   null, 
   1094441640.0
  ], 
  [
   65754, 
   null, 
   "montalban", 
   "Wasn't it obvious in the first post that Elijah is Terral? Does it matter? I have seen others be banned and immediately sign up under another name, sometimes a variant of their original. As long as they show proper conduct from that point, admin usually doesn't have a problem with it as far as I know. (I am saying nothing about Terral's guilt or innocence mind you).\n\n It seems it was obvious to most, but I tend to take people at their word... unless they present statements that seem contrary to facts I know.\n \n I believe that Lurch has re-surfaced as another poster, following his ban for abuse.\n \n But what I think is still pertinent is the actual case for Terral's banning. So far we only have Elijah (or Terral's case).\n Anyone who has read my debates with Terral will know that he is no friend of mine. But he does seem to feel that a number of people have ganged up on him. One person (who for obvious reasons, shall remain nameless) contacted me by PM to suggest a concerted strategy; of not responding to Terral.", 
   {}, 
   65753, 
   null, 
   1094441940.0
  ], 
  [
   65771, 
   null, 
   "billsco", 
   "I don't see a reason to put a dog in this fight. Apparently, Elijah has been banned also, so we won't learn any more of his case. How paltry it was, the little he wrote. He claims at one point that the other side was out of ammo, and went on a witch hunt, but I don't find that to be the case at all.\n \n \n \n The charge is 'name calling,' as you can see below. \n\n \n Are we being led to believe a singular event caused his problems? Only nine words were ever received on the matter? I read a few of his latest posts (not a fun thing to do) and he was at one point sincerely apologizing for offending a poster in the Gay Rights forum. I can only assume this was on the heels of a stern and clear shot across the bow. First, second, third? No way of knowing, but it is hard to believe only one communication was exchanged. It wasn't a voluntary action for terral to back down from a previous statement, IMO, since he was in complete knowledge of and full truth in all things biblical. What does Paul have to say about it, after all? How many previous warnings, how many after? That's between admin, him and his stunted, pinched god.\n \n \n\n Anyone who has read my debates with Terral will know that he is no friend of mine. But he does seem to feel that a number of people have ganged up on him. One person (who for obvious reasons, shall remain nameless) contacted me by PM to suggest a concerted strategy; of not responding to Terral. \n \n \n An obviously failed conspiracy since people almost felt compelled to answer to his arrogance. \n \n Elija's inclusion of his email address is troubling. Is he attempting to form a cabal with his sympathizers? And what does it matter in his defense who started the thread? \n \n Should I be concerned about any issues of censorship or bias on this site in regard to the case presented by terral/Elijah? I don't think so.", 
   {}, 
   65586, 
   null, 
   1094450340.0
  ], 
  [
   65815, 
   null, 
   "maximus", 
   "Terral was banned for name calling? I tried the link Elijah supplied but I couldn't find interaction between Terral and others. Perhaps admin deleted those posts?? \n \n Elijah has already been banned? Was it for the same reason?", 
   {}, 
   65771, 
   null, 
   1094499840.0
  ], 
  [
   65834, 
   null, 
   "pnac=ww3", 
   "The admins are pretty nazi about certain things on this board.\n Sometimes it's hard to tell what they will ban you for and what they won't.\n \n I certainly don't think saying someone is a homo is offensive. It's just short for homosexual. (And the N word is just \"negro\" said wrong;)) Funny, I know someone who was banned for jokingly using the word \"wigger.\" \n \n It's their forum and they can do with it what they please, but shutting out arbitrarily \"offensive\" things keeps a forum from being what it could be. If admins see a board devolving into one big name calling, curse word festival, where nothing is really being discussed that's one thing. The occasional p-word, s-word, and yes, even a c-word (carp?) might make certain arguments sound less wimpy (wanted to use the p-word). Anyway, shouldn't just complain about it......", 
   {}, 
   65815, 
   null, 
   1094512800.0
  ], 
  [
   66002, 
   null, 
   "zachvac", 
   "If Elijah is really Terral03 back again, why did he try to get a his old account re-activated? He already had a new account. I don't know what's going on, but then again the link he gave had no posts by terral03 at all. Deleted? Didn't seem like there was anything missing. Did he just want to cause trouble? He pretty much disagreed with me on all counts but he respected others' opinions while clearly stating his own (sometimes a little lengthy).\n \n If Elijah really was terral03, he's probably already posting stuff under a new name.", 
   {}, 
   65586, 
   null, 
   1094612340.0
  ], 
  [
   66004, 
   null, 
   "Master_Shake", 
   "Goodness, why is this such a big deal. Of course Elijah is terral, BUT WHO GIVES A RIP?! Admin banning anyone is completely pointless cuz they can just re-register (wink wink, nudge nudge). As for the reasons for his banning, I don't give a good gosh darn, but, as much as I don't like him, I don't think banning him was the best idea.", 
   {}, 
   66002, 
   null, 
   1094621040.0
  ], 
  [
   66127, 
   null, 
   "Bush Is The Man", 
   "The admins are pretty nazi about certain things on this board.\n Sometimes it's hard to tell what they will ban you for and what they won't.\n \n I certainly don't think saying someone is a homo is offensive. It's just short for homosexual. (And the N word is just \"negro\" said wrong;)) Funny, I know someone who was banned for jokingly using the word \"wigger.\" \n \n It's their forum and they can do with it what they please, but shutting out arbitrarily \"offensive\" things keeps a forum from being what it could be. If admins see a board devolving into one big name calling, curse word festival, where nothing is really being discussed that's one thing. The occasional p-word, s-word, and yes, even a c-word (carp?) might make certain arguments sound less wimpy (wanted to use the p-word). Anyway, shouldn't just complain about it......\n\n \n \n I agree with you. I received a message from Admin warning me because I said \"I F-ING KNOW THIS\". I typed it just like that. And they said I could be banned for it. How childish is that? I actually sensored the word for them!!! And how do they reward me...they threaten to ban me. It is pathetic that they spend their time looking for words like that to sensor.", 
   {}, 
   65834, 
   null, 
   1094685060.0
  ], 
  [
   66129, 
   null, 
   "Bush Is The Man", 
   "I was looking at a thread and this amazed me. Admin sensored the sentence, \"The ONLY people I can see as actually living a \"homosexual lifestyle\" would be those straight guys who get make overs from those guys on \"***** Eye For the Straight Guy.\" So, that kind of backfires doesn't it?\" Why can't you say *****, especially when it is the name of a TV show?\n \n By the way, I was trying to type Q U E E R. Admin sensors it whenever it's typed. Let's get a poll going on whether or not Admin sensors too much stuff.", 
   {}, 
   66127, 
   null, 
   1094685720.0
  ], 
  [
   66136, 
   null, 
   "Anastasia", 
   "I was looking at a thread and this amazed me. Admin sensored the sentence, \"The ONLY people I can see as actually living a \"homosexual lifestyle\" would be those straight guys who get make overs from those guys on \"***** Eye For the Straight Guy.\" So, that kind of backfires doesn't it?\" Why can't you say *****, especially when it is the name of a TV show?\n \n By the way, I was trying to type Q U E E R. Admin sensors it whenever it's typed. Let's get a poll going on whether or not Admin sensors too much stuff.\n\n Don't you have better things to do with your time than to pound on admin on their site for their rules? and to some the word in question is rude... and to others is not, but we have already been on this topic trying to make a point.\n Not picking on you....just an observation emoticon_xangel", 
   {}, 
   66129, 
   null, 
   1094686440.0
  ], 
  [
   66140, 
   null, 
   "Bush Is The Man", 
   "Don't you have better things to do with your time than to pound on admin on their site for their rules? and to some the word in question is rude... and to others is not, but we have already been on this topic trying to make a point.\n Not picking on you....just an observation emoticon_xangel\n\n \n \n I have spent 5 minutes asking people what they thought about Admin. Maybe you didn't look at any of the posts on here...this is the first one I have made!!! Do you have better things to do than defend Admin? Excuse me, but how is ***** rude? In its context, it is the name a freaking show (am I allowed to say freaking?). It is aired on TV and kids can see it on TV. But nope, not on 4forums.com will you see it. What else are we supposed to call \"them\"? If you call them homos, you get warned by Admin.", 
   {}, 
   66136, 
   null, 
   1094686680.0
  ], 
  [
   66147, 
   null, 
   "Anastasia", 
   "I have spent 5 minutes asking people what they thought about Admin. Maybe you didn't look at any of the posts on here...this is the first one I have made!!! Do you have better things to do than defend Admin? Excuse me, but how is ***** rude? In its context, it is the name a freaking show (am I allowed to say freaking?). It is aired on TV and kids can see it on TV. But nope, not on 4forums.com will you see it. What else are we supposed to call \"them\"? If you call them homos, you get warned by Admin.\n\n Did it ever occur to you that the guidelines were set before that show?\n and why not call homosexuals homosexuals... or gays I am pretty sure that would be OK...\n Remember when we had that little chat about tone, and how so often stuff gets lost and misread... then flame wars start.\n I think that is the case a lot here... and In terrals case he did go off the deep end so IMO it was a just ban...\n It is the admins right to set their rules, have you not been on a forum where every other word is a curse... it gets old! \n But like religion things will change with time and maybe your word for homosexuals will soon be pc...personally I have no problem with it nor do my gay friends FWIW", 
   {}, 
   66140, 
   null, 
   1094687940.0
  ], 
  [
   66166, 
   null, 
   "pickleweaseler", 
   "I was looking at a thread and this amazed me. Admin sensored the sentence, \"The ONLY people I can see as actually living a \"homosexual lifestyle\" would be those straight guys who get make overs from those guys on \"***** Eye For the Straight Guy.\" So, that kind of backfires doesn't it?\" Why can't you say *****, especially when it is the name of a TV show?\n \n By the way, I was trying to type Q U E E R. Admin sensors it whenever it's typed. Let's get a poll going on whether or not Admin sensors too much stuff.\n\n \n Are you sure it was admin that censored it and not the gay person who posted it? Perhaps the person posting was offended by the show's title.", 
   {}, 
   66129, 
   null, 
   1094691600.0
  ], 
  [
   66179, 
   null, 
   "zachvac", 
   "I don't know, but they banned Bush is the man. Maybe because he posted stuff the admin told him not to.", 
   {}, 
   66166, 
   null, 
   1094702280.0
  ], 
  [
   66180, 
   null, 
   "maximus", 
   "I agree with you. I received a message from Admin warning me because I said \"I F-ING KNOW THIS\". I typed it just like that. And they said I could be banned for it. How childish is that? I actually sensored the word for them!!! And how do they reward me...they threaten to ban me. It is pathetic that they spend their time looking for words like that to sensor.\n\n Is taking 2 letters out of a word censoring? We all know what you were trying to say right? You'll be hearing from the FCC on this one buddy. Expect a stiff fine.", 
   {}, 
   66127, 
   null, 
   1094702400.0
  ], 
  [
   66211, 
   null, 
   "GWB 2004", 
   "I don't know, but they banned Bush is the man. Maybe because he posted stuff the admin told him not to.\n\n \n \n But I am back. What did I post that they told me not to? One word of advice for everyone out there...do not ever question the Admin because they have no tolerance. I simply said they sensor too much stuff, and what happens? No warning, they just banned me. That is pathetic. This is supposed to be a site where people express their thoughts, feelings, emotions, etc. And I try to express my concerns that too much stuff is being sensored, and what happens? Admin tries to oppress my freedom of speech. It is sick if you ask me.", 
   {}, 
   66179, 
   null, 
   1094743500.0
  ], 
  [
   66219, 
   null, 
   "Freedom_Fighter", 
   "But I am back. What did I post that they told me not to? One word of advice for everyone out there...do not ever question the Admin because they have no tolerance. I simply said they sensor too much stuff, and what happens? No warning, they just banned me. That is pathetic. This is supposed to be a site where people express their thoughts, feelings, emotions, etc. And I try to express my concerns that too much stuff is being sensored, and what happens? Admin tries to oppress my freedom of speech. It is sick if you ask me.\n\n \n Apparently Dissension=Ban.", 
   {}, 
   66211, 
   null, 
   1094744760.0
  ], 
  [
   66230, 
   null, 
   "unkerpaulie", 
   "Apparently Dissension=Ban.\n\n not just dissention, mere questioning the system...\n \n i was also warned once for calling plotter (now banned) a bunch of degrading names in a post. words like \"stupid\", \"idiot\", etc. admin editted them out with softer words and warned me. from then on i choose my words carefully. im not in the habit on personal attacks anyway, and i think the board is much better without posters that are prone to throw personal attacks. if you can strongly debate a point or argument by bring a strong counter case, rather than insulting the person that posted, i think the admin will overlook some strong language to a certain extent. i myself have treaded close to that border, but avoided attacking the person him/herself, and so far have been spared the wrath of the admin :p", 
   {}, 
   66219, 
   null, 
   1094747940.0
  ], 
  [
   66285, 
   null, 
   "spartacus", 
   "Sorry you were banned do to repeated name calling.\n Admin\n \n \n\n \n So long as the \"banning\" is \"fair and balanced\"...I have no problem with admin banningpeople who cross given boundaries...\n \n Do people who use less-than-charitable words like :xcensored receive the same treatment here?", 
   {}, 
   65586, 
   null, 
   1094761020.0
  ], 
  [
   66289, 
   null, 
   "JustineCredible", 
   "Are you sure it was admin that censored it and not the gay person who posted it? Perhaps the person posting was offended by the show's title.\n\n \n \n Alright, since I was the one who posted that sentence, I can speak for myself. I DID NOT censor that word. It was an auto-censor within a program admin utilizes on this site. Honestly, I was a bit shocked that within a title of a television show it was censored, but it didn't really matter. People knew what was intended.", 
   {}, 
   66166, 
   null, 
   1094761500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Terral03 Has Been Banned From Posting Here", 
  "url": "http://www.4forums.com/political/religion-debates/3108-terral03-has-been-banned-posting-here.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 3108, 
  "discussion_files": [
   [
    "19245.html", 
    "http://www.4forums.com/political/religion-debates/3108-terral03-has-been-banned-posting-here-print.html"
   ], 
   [
    "19246.html", 
    "http://www.4forums.com/political/religion-debates/3108-terral03-has-been-banned-posting-here-2-print.html"
   ]
  ], 
  "identifier": 3108
 }
]