[
 [
  [
   65909, 
   null, 
   "pnac=ww3", 
   "Here is a site with a lot of quotes. Funny they only used one pre-9/11 Condi quote when there are a few, even on video, stating how Saddam wouldn't be a threat even if he DID have WMDs.\n \n http://lunaville.org/WMD/billmon.aspx\n \nHow the United States should react if Iraq acquired WMD. \"The first line of defense...should be a clear and classical statement of deterrence-if they do acquire WMD, their weapons will be unusable because any attempt to use them will bring national obliteration.\" \n Condoleeza Rice, US National Security Advisor\n January/February 2000 issue of Foreign Affairs\n 2/1/2000 \n\n http://lunaville.org/WMD/ALQ_UGGAB.aspx\n \nThe war on terror, you can't distinguish between al Qaeda and Saddam when you talk about the war on terror. And so it's a comparison that is -- I can't make because I can't distinguish between the two, because they're both equally as bad, and equally as evil, and equally as destructive.\n George W. Bush, President\n Remarks By President Bush, The Oval Office\n 9/25/2002 \n\n http://lunaville.org/WMD/Democracy.aspx\n \nAs long as we're here, we are the occupying power. It's a very ugly word, but it's true. \n L. Paul Bremer, Special Envoy to Iraq\n Washington Post Interview\n\n \nFirst-and this is really the overarching principle-the United States seeks to liberate Iraq, not occupy Iraq . . If the President should decide to use force, let me assure you again that the United States would be committed to liberating the people of Iraq, not becoming an occupation force. \n Paul Wolfowitz, Deputy Secretary of Defense\n Speech to Iraqi-American Community\n 2/23/2003\n \n \n Good old Wolfy.\n \n Anyway, I'm just reminding folks that Saddam wasn't a threat before 9/11 and then he instantly became a threat afterwards.\n \n For some funny flashes:\n http://www.toostupidtobepresident.com/shockwave/startrek.htm\n http://www.toostupidtobepresident.com/", 
   {
    "post_info": {
     "post_title": "A tangled web"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1094583840.0
  ], 
  [
   65914, 
   null, 
   "pnac=ww3", 
   "Jeb Bush's Executive Orders\n \n Before 9/11\n http://sun6.dms.state.fl.us/eog_new/eog/orders/2001/september/eo2001-261-09-07-01.html\n http://sun6.dms.state.fl.us/eog_new/eog/orders/2001/january/eo2001-17-01-19-01.html\n \n\n Section 3.\n \n The Florida National Guard may order selected members on to state active duty for service to the State of Florida pursuant to Section 250.06(4), Florida Statutes, to assist FDLE in performing port security training and inspections. Based on the potential massive damage to life and property that may result from an act of terrorism at a Florida port, the necessity to protect life and property from such acts of terrorism, and inhibiting the smuggling of illegal drugs into the State of Florida, the use of the Florida National Guard to support FDLE in accomplishing port security training and inspections is \"extraordinary support to law enforcement\" as used in Section 250.06(4), Florida Statutes. \n\n This EO replaced the one from that January to include language about terrorist acts. Remember it was 9/7. Funny, huh?\n \n On 9/11\n http://sun6.dms.state.fl.us/eog_new/eog/orders/2001/september/eo2001-262-09-11-01.html\n \n http://forums.go.com/abcnews/thread?threadID=7401\n \n http://www.rense.com/general14/jebdeclared.htm\n \nThere is no declared expiration of this Florida Executive Order. In case you haven't figured it out yet, Florida is now under martial law and will remain so until this EO is revoked. We tried to warn the people of Florida about this in 1998 when our State Constitution was changed in order to allow this to take place, but no-one listened. See \"Martial Law Now Legal in Florida\" at http://ecclesia.org/lawgiver/flaconst.asp ).\n\n \n http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=25051\n \nWHO KNEW? Jeb Bush signed Florida TWO YEAR emergency order 4 days BEFORE ATTACK\n\n \n http://proliberty.com/observer/20011008.htm\n \nTALLAHASSEE, Fla. -- Florida Governor Jeb Bush signed Executive Order 01-261 September 7, 2001, four days before the WTC tragedy of Sept. 11, which paves the way for a declaration of martial law in his state. The governor, in his EO, delegated to, \"...the Adjutant General of the state of Florida all necessary authority....to order members of the Florida National Guard into Active Service.\"\n \n Immediately after the second WTC tower fell, Governor Bush signed EO 01-262 to make Florida the first state to declare a state of emergency though his state did not experience any terrorist events that day. Governor Bush is reportedly the only governor in the U.S. outside of NY and D.C. to make a declaration of martial law in the wake of the WTC tragedy. Interestingly, Governor Bush's declaration came before authorities in New York or Washington, D.C. declared states of emergency. \n\n \n http://www.davidicke.net/newsroom/america/florida/092401a.html\n \n \n Ah, here is something nice:\n http://www.davidicke.com/icke/articles3/suppress.html", 
   {
    "unicode_changes_made": true
   }, 
   65909, 
   null, 
   1094585340.0
  ], 
  [
   65916, 
   null, 
   "unkerpaulie", 
   "The war on terror, you can't distinguish between al Qaeda and Saddam when you talk about the war on terror. And so it's a comparison that is -- I can't make because I can't distinguish between the two, because they're both equally as bad, and equally as evil, and equally as destructive.\n George W. Bush, President\n\n this is the point where the shift became official. on one hand you have a radically violent and deadly fundamentalist, backed by a world-wide network of indoctrinated suicide killers, that just murdered americans on american soil, defied america and utterly destroyed the sense of security that we as americans held forever. on the other hand you have this egotistical tyrant that rules his country with and iron fist and has a few non-fucntional weapons. and somehow bush manages to fool the entire nation into believing that they are equals\n \n are we really that sheep-like?", 
   {}, 
   65909, 
   null, 
   1094585760.0
  ], 
  [
   65920, 
   null, 
   "lord tammerlain", 
   "Unfortunately when the average person spends more time on local or collage sports scores then on national or international affairs, yes people can be that sheep like. \n \n Examples include why a large majority of the American people believed that Saddam had a part in 9/11. Reason, the number of times the fed gov talked about 9/11, Saddam's name was brought up, guilt by association.\n \n Advertising works, and no other country in the world has as good an advertising industry in the world then the US", 
   {}, 
   65916, 
   null, 
   1094587740.0
  ], 
  [
   65961, 
   null, 
   "pnac=ww3", 
   "This, to me, is extremely interesting:\n http://emperors-clothes.com/analysis/ritter.htm\n There are 5 parts. It's kind of long and opinionated, but it's starting to make me feel like I did in 2002 when all the swordbanging about Iraq started. That is, \"I have no idea what the hell is going on. I don't know the real reasons for anything I'm hearing or reading.\"", 
   {}, 
   65920, 
   null, 
   1094598900.0
  ], 
  [
   65966, 
   null, 
   "lord tammerlain", 
   "Ritter may have all along felt Iraq had no WMD, and was just forced as part of his job to get with the program. After all the VX nerve gas was the main reason for the cruise missile attacks on the pharmacetical factory in Sudan. \n \n The basis for that attack was extremely weak though\n \n 1. An egyptian CIA agent takes an unpreserved soil sample 20 meters outside the factory.\n \n 2. The chemical found while a component of VX gas is also a byproduct of the degradation of Glyphosate (weed killer) which would be used outside of a fence to keep weeds down.\n \n 3. The assets of the factory owner, a Saudi National, was confescated at the time, only to have been released citing no evidence that he was involved in terrorism. I believe this occured after 9/11.\n \n Perhaps Ritter finally got sick and tired of the lies about Iraqs WMD and felt he in good conscience allow the Iraqi people to suffer the effects of an invasion", 
   {}, 
   65961, 
   null, 
   1094600640.0
  ], 
  [
   65977, 
   null, 
   "Broker", 
   "Your perception of the world changes after an event like 9/11. I know mine did. Maybe yours didn't, but that would probably make you an exception.\n \n \n Occupation power was significant in the context it was used. The United States was an occupation power, yes. The objection was to the context that was being used in.\n \n \n I believe the Pentagon had some kind of terrorism drill on 9/11, didn't it? Coincidence. I'm reading a book right now. In the book, Labor day just passed. A couple of days ago I watched \"Evita.\" In the book, the song \"Don't cry for me, Argentina\" and Eva Peron are referenced at one point.\n \n Coincidence.\n \n So no, not at all. By the way, it would make sense that that order would be issued on the 7th, seeing that Bush was going to visit Florida.\n \n Do you have any source other than that web site? After an extensive search, I am unable to produce a single somewhat indepepdent source to verify the claims made.", 
   {}, 
   65909, 
   null, 
   1094603100.0
  ], 
  [
   66109, 
   null, 
   "pnac=ww3", 
   "Who are you addressing?\n \n If it is me, I referenced Florida's online list of EO's.\n There are too many coincidences surrounding 9/11.", 
   {}, 
   65977, 
   null, 
   1094681220.0
  ], 
  [
   66141, 
   null, 
   "Broker", 
   "Yes, you.\n \n You showed the order. I don't dispute that the order exists. I'm referring to what the last web site you posted had to say.\n \n \n As for coincidences and 9/11, I would say not. I just used a real example that I just experienced. The larger an event, the easier to find coincidence.", 
   {}, 
   66109, 
   null, 
   1094686740.0
  ], 
  [
   66156, 
   null, 
   "pnac=ww3", 
   "A \"larger\" event maybe means that more people are affected? and it wouldn't happen that often? so maybe coincidences surrounding them would be more rare? \n \n The last site: http://www.davidicke.com/icke/articles3/suppress.html\n is just saying here are 17 common ways to suppress the truth and to warp people's perceptions through the media to meet your needs. I'm not sure what claims you are disputing. Why would it need other \"sources\" to corroborate the info. \n \n Do you mean, go through and systematically provide examples for each number?\n \n You wouldn't happen to be one of those folks from #17 would you? ;)", 
   {}, 
   66141, 
   null, 
   1094688780.0
  ], 
  [
   66171, 
   null, 
   "Broker", 
   "No... I would disagree. But I don't think we're going to get anywhere.\n \n I was talking about the site in general, not that specific page.", 
   {}, 
   66156, 
   null, 
   1094696640.0
  ], 
  [
   66334, 
   null, 
   "pnac=ww3", 
   "What? How can you not see that the world is run by shapeshifting reptilian aliens?\n \n http://www.bridgeoflove.com/bookstore/bol/rept-agenda1.html", 
   {}, 
   66171, 
   null, 
   1094771940.0
  ], 
  [
   66377, 
   null, 
   "Broker", 
   "That makes me sad.\n \n Really sad. \n \n I just lost hope for people.", 
   {}, 
   66334, 
   null, 
   1094781960.0
  ], 
  [
   66476, 
   null, 
   "pnac=ww3", 
   "That makes me a Saaaad Panda!\n http://entertainment.msn.com/movies/movie.aspx?m=13673", 
   {}, 
   66377, 
   null, 
   1094860320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A tangled web", 
  "url": "http://www.4forums.com/political/politics-debates/3127-tangled-web.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3127, 
  "discussion_files": [
   [
    "33083.html", 
    "http://www.4forums.com/political/politics-debates/3127-tangled-web-print.html"
   ]
  ], 
  "identifier": 3127
 }
]