[
 [
  [
   65923, 
   null, 
   "jitobear", 
   "When I was a girl the big bad boogie man of the world was a thing called Communism. It was an evil, faceless phantom - and when we needed to substantiate this menace we looked to the Soviet Union. Russians became dehumanized - they were the bad guy, they become cliches in film, and we believed. Just like a previous generation had believed it of Germans and Japs. \n \n Fast forward to today and we know that we were wrong. We may have had arguments with the governments of those nations, but the dehumanization was wrong. Japanese concentration camps were wrong.\n \n In the past week we got to watch as parents in Russia mourned the butchering of their children in a school. In the past week this girl who grew up with the cold war menace got to see that Russians hurt just as bad as me. The monster that was portrayed was a lie.\n \n But we keep doing this the world over. We force people into neat little stereotypes, label them good or bad, and dehumanize them. With these simple acts humankind has done injustice to each other ever since the dawn of ourselves. With this mentality we have justified the mistreatment of women, slaves, we have allowed for classism, we have butchered each other and each other's children in name of God, greed and lines on a map. We have had holocausts, World Wars, flown planes into building, shot school-children in the back and bombed the **** out of countries a fraction our our size.\n \n We are all guilty - every country, religion and race and we are all wrong. One day, when the smoke clears, my son will face what we do today. \n \n Today the monster is terrorism - not communism. But instead dealing with it's reality we have given it an Arab face so we don't have to cry when Iraqi children die.\n \n I am sick of this. Why does God bother with any of us at all?", 
   {
    "post_info": {
     "post_title": "Russia -"
    }
   }, 
   null, 
   null, 
   1094588700.0
  ], 
  [
   65935, 
   null, 
   "georged", 
   "Amusement?", 
   {}, 
   65923, 
   null, 
   1094591340.0
  ], 
  [
   65992, 
   null, 
   "billsco", 
   " Just like a previous generation had believed it of Germans and Japs. \n \n \n\n \n I just want to point out the term \"Japs\" is offensive to some people, IMO. I read your post in its entirety and believe every bone in your body is good down to the core. I thought for awhile that perhaps I should PM you to point \"Japs\" out, but since I know you didn't mean for any offense to be taken, I thought I would write this openly, just in hopes that it can reach an ear that never thought it might be.\n \n Plus, I wanted to mention it before sinjin did.", 
   {}, 
   65923, 
   null, 
   1094608560.0
  ], 
  [
   66063, 
   null, 
   "jitobear", 
   "I just want to point out the term \"Japs\" is offensive to some people, IMO. I read your post in its entirety and believe every bone in your body is good down to the core. I thought for awhile that perhaps I should PM you to point \"Japs\" out, but since I know you didn't mean for any offense to be taken, I thought I would write this openly, just in hopes that it can reach an ear that never thought it might be.\n \n Plus, I wanted to mention it before sinjin did.\n\n \n Yes, I know. I used the term on purpose. It was the attitude and tone towards Japanese people during WWII (an attitude we now know was wrong) and I wanted to capture that difference by using the term. If there was a similar derogatory term for the Germans I would have used it as well, but I am unuaware of one. My intent was not to offend, and I apologize to everyone if I did.", 
   {}, 
   65992, 
   null, 
   1094668980.0
  ], 
  [
   66067, 
   null, 
   "Bush Is The Man", 
   "Just like a previous generation had believed it of Germans and Japs.\n\n \n WOW!! Don't worry about offending anyone.\n \n \nJapanese concentration camps were wrong.\n\n \n They were call internment camps. We didn't kill people or torture people. \n \n \nYes, I know. I used the term on purpose.\n\n \n WOW again!! You have no business posting on this forum if you plan to defame people on here like that, and then say you did it on purpose. That is absolutely uncalled for. Hopefully you get banned for this!!", 
   {}, 
   65923, 
   null, 
   1094672040.0
  ], 
  [
   66070, 
   null, 
   "Ladywolf", 
   "Why does God bother with any of us at all?\n\n \n To teach us. Sometimes it seems the only way us mere mortals seem to learn. Obviously, the powers that be seem to believe we have a long way to go.", 
   {}, 
   65923, 
   null, 
   1094672700.0
  ], 
  [
   66089, 
   null, 
   "sinjin", 
   "I just want to point out the term \"Japs\" is offensive to some people, IMO. I read your post in its entirety and believe every bone in your body is good down to the core. I thought for awhile that perhaps I should PM you to point \"Japs\" out, but since I know you didn't mean for any offense to be taken, I thought I would write this openly, just in hopes that it can reach an ear that never thought it might be.\n \n Plus, I wanted to mention it before sinjin did.\n\n \n Thank you.", 
   {}, 
   65992, 
   null, 
   1094677680.0
  ], 
  [
   66091, 
   null, 
   "sinjin", 
   "Yes, I know. I used the term on purpose. It was the attitude and tone towards Japanese people during WWII (an attitude we now know was wrong) and I wanted to capture that difference by using the term. If there was a similar derogatory term for the Germans I would have used it as well, but I am unuaware of one. My intent was not to offend, and I apologize to everyone if I did.\n\n \n The term \"kraut\" for Germans would be offensive. Given that Germans are of the same \"race\" as a majority of Americans there never was the same loathing of Germans as the Japanese.", 
   {}, 
   66063, 
   null, 
   1094677920.0
  ], 
  [
   66094, 
   null, 
   "Anastasia", 
   "WOW!! Don't worry about offending anyone.\n \n \n \n They were call internment camps. We didn't kill people or torture people. \n \n \n \n WOW again!! You have no business posting on this forum if you plan to defame people on here like that, and then say you did it on purpose. That is absolutely uncalled for. Hopefully you get banned for this!!\n\n I think you missed her point...\n I really doubt that she said that from her heart.... besides it wouldnt be the first time someone made the same mistake", 
   {}, 
   66067, 
   null, 
   1094678640.0
  ], 
  [
   66099, 
   null, 
   "Bush Is The Man", 
   "I think you missed her point...\n I really doubt that she said that from her heart.... besides it wouldnt be the first time someone made the same mistake\n\n \n \n How could she not say it from her heart? She typed it!!! It's not like she was in a confrontation with someone and couldn't control herself and made a mistake calling people Japs. She specifically called them Japs. It would be the same if I was talking about the Alamo and called Mexicans \"Spicks\", or slavery and called blacks \"Niggers\". She knew she was making a slur with that remark.", 
   {}, 
   66094, 
   null, 
   1094679420.0
  ], 
  [
   66101, 
   null, 
   "Freedom_Fighter", 
   "The term \"kraut\" for Germans would be offensive. Given that Germans are of the same \"race\" as a majority of Americans there never was the same loathing of Germans as the Japanese.\n\n \n Just so you know many Germans and Italians were also mistreated throughout the war though they never recieved the reperations or the recognition. Here are a couple of examples.\n \n \n http://www.serve.com/shea/germusa/itintern.htm\n http://www.foitimes.com/internment/", 
   {}, 
   66091, 
   null, 
   1094679960.0
  ], 
  [
   66105, 
   null, 
   "Anastasia", 
   "Yes, I know. I used the term on purpose. It was the attitude and tone towards Japanese people during WWII (an attitude we now know was wrong) and I wanted to capture that difference by using the term. If there was a similar derogatory term for the Germans I would have used it as well, but I am unuaware of one. My intent was not to offend, and I apologize to everyone if I did.\n\n Bush Is The Man\n Did you read this post? I am against that word just as much as the next guy, but if you have read any of jitobear's posts you would come to realize that is not in her character, maybe it was in poor taste to use it, but she was driving a point home.", 
   {}, 
   66063, 
   null, 
   1094680680.0
  ], 
  [
   66116, 
   null, 
   "Bush Is The Man", 
   "Bush Is The Man\n Did you read this post? I am against that word just as much as the next guy, but if you have read any of jitobear's posts you would come to realize that is not in her character, maybe it was in poor taste to use it, but she was driving a point home.\n\n \n \n Oh, so it's ok to degrade a whole race by using an ethnic slur to refer to them when you want to drive home a point?", 
   {}, 
   66105, 
   null, 
   1094682780.0
  ], 
  [
   66123, 
   null, 
   "Anastasia", 
   "Oh, so it's ok to degrade a whole race by using an ethnic slur to refer to them when you want to drive home a point?\n\n No I am not saying it was OK\n \n :xbanghead", 
   {}, 
   66116, 
   null, 
   1094684280.0
  ], 
  [
   66130, 
   null, 
   "jitobear", 
   "I do not in any way shape or form agree with using derogatory terminology. I was stepping outside of my shoes as a writer. I said it here with the intent of driving home a point. \n \n I called them \"Japs\" because that is what the American people and leadership called them during WWII. Had I known about the word \"Kraut\" I would have used it, too. During WWII it was part of how we dehumaized the Japanese and Japanese Americans, we see that clearly now, as people's reactions here clearly demonstrate.\n \n I am just challenging us to look at the present. We (humanity) still do this. We are doing it today.....stereotypes and dehuminazation leads to more evil.\n \n I am truly sorry if my intentions were not clear. \n \n Maybe it would have helped if I put them in quotes? \n \n Bush Is The Man - You can back right off.\n You just used many derogitory slurs in your post below. Did they come from your heart? Or are you just making a point? I was not intentionally trying to make a slur, (how would that even make sense in my argument?) and I truly am sorry that my intent was misunderstood.\n \n HOWEVER - I am sick and tired of asking you to quit putting words or intentions in my mouth. It comes up with you again and again. \n \n By the way, have I ever mentioned to you that my son isn't white? \n \n How could she not say it from her heart? She typed it!!! It's not like she was in a confrontation with someone and couldn't control herself and made a mistake calling people Japs. She specifically called them Japs. It would be the same if I was talking about the Alamo and called Mexicans \"Spicks\", or slavery and called blacks \"Niggers\". She knew she was making a slur with that remark.", 
   {}, 
   66123, 
   null, 
   1094685840.0
  ], 
  [
   66137, 
   null, 
   "Bush Is The Man", 
   "I called them \"Japs\" because that is what the American people and leadership called them during WWII. Had I known about the word \"Kraut\" I would have used it, too. During WWII it was part of how we dehumaized the Japanese and Japanese Americans, we see that clearly now, as people's reactions here clearly demonstrate.\n\n \n \n \n So what would you call black slaves before the Civil War? Would you refer to them as \"niggers\", since many people referred to them that way in the 1800s?\n \n \n \nBush Is The Man - You can back right off.\n You just used many derogitory slurs in your post below. Did they come from your heart? Or are you just making a point? I was not intentionally trying to make a slur, (how would that even make sense in my argument?) and I truly am sorry that my intent was misunderstood.\n \n HOWEVER - I am sick and tired of asking you to quit putting words or intentions in my mouth. It comes up with you again and again. \n \n By the way, have I ever mentioned to you that my son isn't white? \n \n How could she not say it from her heart? She typed it!!! It's not like she was in a confrontation with someone and couldn't control herself and made a mistake calling people Japs. She specifically called them Japs. It would be the same if I was talking about the Alamo and called Mexicans \"Spicks\", or slavery and called blacks \"Niggers\". She knew she was making a slur with that remark.\n\n \n \n But I didn't call them \"niggers\" or \"spicks\". I likened that to when you referred to the Japanese as \"Japs\". I have not once on this forum used a slur of this nature towards anyone. I am not putting words in your mouth. You said them !!! Since you may have offended many Japanese by your labeling of them as \"Japs\" and seem to think it wasn't a big deal, how would you feel if someone accidentally referred to your son as the N word?", 
   {}, 
   66130, 
   null, 
   1094686440.0
  ], 
  [
   66139, 
   null, 
   "Jaaaman", 
   "So what would you call black slaves before the Civil War? Would you refer to them as \"niggers\", since many people referred to them that way in the 1800s?\n \n \n \n \n \n But I didn't call them \"niggers\" or \"spicks\". I likened that to when you referred to the Japanese as \"Japs\". I have not once on this forum used a slur of this nature towards anyone. I am not putting words in your mouth. You said them !!! Since you may have offended many Japanese by your labeling of them as \"Japs\" and seem to think it wasn't a big deal, how would you feel if someone accidentally referred to your son as the N word?\n\n Good point. That labeling was totally unnecessary.", 
   {}, 
   66137, 
   null, 
   1094686680.0
  ], 
  [
   66146, 
   null, 
   "jim's trucking", 
   "A very good post there, jito.\n \n It's sad that more people don't have your compassion. There are however, things done in times of war that don't exactly fit the mold of political correctness. All countries do this. It's human nature. We are clannish, tribal, family or whatever you want to call it. God help us all.\n \n There's probably a derogatory term for every group of people you can come up with. Some people are offended when you call them by those names, some are not. (My mother helped me overcome the quickness to be offended by telling me that just because someone calls you a name doesn't mean tha's what you are.)\n \n \n \nI do not in any way shape or form agree with using derogatory terminology. I was stepping outside of my shoes as a writer. I said it here with the intent of driving home a point. \n \n I called them \"Japs\" because that is what the American people and leadership called them during WWII. Had I known about the word \"Kraut\" I would have used it, too. During WWII it was part of how we dehumaized the Japanese and Japanese Americans, we see that clearly now, as people's reactions here clearly demonstrate.\n \n I am just challenging us to look at the present. We (humanity) still do this. We are doing it today.....stereotypes and dehuminazation leads to more evil.\n \n I am truly sorry if my intentions were not clear. \n \n Maybe it would have helped if I put them in quotes.  \n That would have lessened the impact of the \"offensiveness\" and strengthened the idea of your disdain for it.\n \n \n \n\n Bush Is The Man - You can back right off.\n You just used many derogatory slurs in your post below. Did they come from your heart? Or are you just making a point? I was not intentionally trying to make a slur, (how would that even make sense in my argument?) and I truly am sorry that my intent was misunderstood.\n \n HOWEVER - I am sick and tired of asking you to quit putting words or intentions in my mouth. It comes up with you again and again. \n \n By the way, have I ever mentioned to you that my son isn't white? \nDon't worry about criticism here. BITM can't even spell SPIC. That word was explained to me by a Tex-Mex friend of mine. It's supposedly an acronym for Spanish Person In Country, invented by the immigration authorities.", 
   {}, 
   66130, 
   null, 
   1094687820.0
  ], 
  [
   66149, 
   null, 
   "pnac=ww3", 
   "The term \"kraut\" for Germans would be offensive. Given that Germans are of the same \"race\" as a majority of Americans there never was the same loathing of Germans as the Japanese.\n\n \n HUH? I dunno. I think folks were hatin em some Germans even right after WWII. I doubt people were hating Japanese any more.\n \n The things that are offensive are silly. Come on, Jap is just short for Japanese.\n \n It's easier to say. \"Nips\" was supposed to be a little more offensive, but I can't imagine a Jap being offended by being called a Jap or a Nip (Nippon), just as I am not offended by being called Whitey. I am white and calling a \"white\" person whitey just can't be offensive. \n \n Yankee was supposed to be derogatory at one point, even though the people were proud to be Yankees. But, when I was a kid (in the south) to call someone a yankee was an insult. \"This food is too hot.\" \"Oh, you're just a yankee.\"\n \n A Wanker is someone from the west bank of the mississippi across from New Orleans, sort of one of those named people were proud of and could be used as an insult as well. But, we used the word in front of an English guy one time and he was quite offended, thinking we were highly insulting someone.\n \n Anyway, I never could see how anyone could be offended by being called a name. People are just too sensitive ( I can't use the p-word ).", 
   {}, 
   66091, 
   null, 
   1094688180.0
  ], 
  [
   66151, 
   null, 
   "jitobear", 
   "So what would you call black slaves before the Civil War? Would you refer to them as \"niggers\", since many people referred to them that way in the 1800s?\n\n \n If it is relevant in the writing - yes. Mark Twain uses the word \"nigger\" A LOT in his books. That did not make him a racist. That's how they talked. Shall we pretend they didn't?\n \n Our grandparents used the word \"Japs\". It was BAD THING. I DON'T AGREE WITH IT. I had hoped my post made it clear. It did not and I have apologized for the misunderstanding about four times now.\n \n \nBut I didn't call them \"niggers\" or \"spicks\". I likened that to when you referred to the Japanese as \"Japs\". I have not once on this forum used a slur of this nature towards anyone. I am not putting words in your mouth. You said them !!!\n \n \n I did not mean to use the word as a slur. That was not my INTENT. And it is my INTENT you are defining for me - once again.\n \n \nSince you may have offended many Japanese by your labeling of them as \"Japs\" and seem to think it wasn't a big deal, how would you feel if someone accidentally referred to your son as the N word?\n\n \n If I offended anyone I do think that is a big deal, which is why I have apologized and tried to explain my intent. You on the other hand can't seem to get off the idea that I had seem darker intent, I DIDN'T.\n \n By the way, my son is Mexican.\n \n And Jamaan - I would like to point out to you that I have read countless amounts of demonizing and stereotyping from you in the Gay Rights forum.", 
   {}, 
   66137, 
   null, 
   1094688360.0
  ], 
  [
   66159, 
   null, 
   "Big Orn", 
   "What has this got to do with Russia?\n \n It sounds like Billy Bob found his cat in the trailer park under Bubba's porch.\n \n Name-calling? How grown-up.", 
   {}, 
   66151, 
   null, 
   1094689080.0
  ], 
  [
   66160, 
   null, 
   "sinjin", 
   "HUH? I dunno. I think folks were hatin em some Germans even right after WWII. I doubt people were hating Japanese any more.\n \n The things that are offensive are silly. Come on, Jap is just short for Japanese.\n \n It's easier to say. \"Nips\" was supposed to be a little more offensive, but I can't imagine a Jap being offended by being called a Jap or a Nip (Nippon), just as I am not offended by being called Whitey. I am white and calling a \"white\" person whitey just can't be offensive. \n \n Yankee was supposed to be derogatory at one point, even though the people were proud to be Yankees. But, when I was a kid (in the south) to call someone a yankee was an insult. \"This food is too hot.\" \"Oh, you're just a yankee.\"\n \n A Wanker is someone from the west bank of the mississippi across from New Orleans, sort of one of those named people were proud of and could be used as an insult as well. But, we used the word in front of an English guy one time and he was quite offended, thinking we were highly insulting someone.\n \n Anyway, I never could see how anyone could be offended by being called a name. People are just too sensitive ( I can't use the p-word ).\n\n \n Have you seen any films from the WWII era where the Japanese are referred to as \"monkeys\"? Neither the Germans nor the Italians were suggested as being of another species. Not even in the same league IMO.\n \n btw what is the most derogatory word used by a non-white to refer to a \"white\" person?", 
   {}, 
   66149, 
   null, 
   1094689380.0
  ], 
  [
   66161, 
   null, 
   "Anastasia", 
   "Have you seen any films from the WWII era where the Japanese are referred to as \"monkeys\"? Neither the Germans nor the Italians were suggested as being of another species. Not even in the same league IMO.\n \n btw what is the most derogatory word used by a non-white to refer to a \"white\" person?\n\n Cracker? :xcensored", 
   {}, 
   66160, 
   null, 
   1094689500.0
  ], 
  [
   66163, 
   null, 
   "Anastasia", 
   "What has this got to do with Russia?\n \n It sounds like Billy Bob found his cat in the trailer park under Bubba's porch.\n \n Name-calling? How grown-up.\n\n oh wait... it must be Bubba\n shame on you Ron", 
   {}, 
   66159, 
   null, 
   1094689620.0
  ], 
  [
   66167, 
   null, 
   "Maineiac", 
   "I find this thread amazing.lol.Everyone is upset over the term used to describe the Japanese,yet make even cruder remarks describing other people.\n I don't believe the term would have been mentioned again in the the thread if it wouldn't have been blown all out of porportion.BTW,did someo emoticon_mad ne mention that the Italians were mistreated?", 
   {}, 
   66163, 
   null, 
   1094692740.0
  ], 
  [
   66332, 
   null, 
   "Anastasia", 
   "Speaking of Russia\n check out This", 
   {}, 
   66167, 
   null, 
   1094771520.0
  ], 
  [
   66341, 
   null, 
   "El Gato Grande", 
   "I find this thread amazing.lol.Everyone is upset over the term used to describe the Japanese,yet make even cruder remarks describing other people.\n\n \n \n You are probably referring to me (I once was known as Bush Is The Man). I did not refer to anyone as derrogatory words. I said that what the person who called Japanes \"Japs\" said could be likened to calling a black person or a Mexican the terms I stated. How can you take that that far out of context?", 
   {}, 
   66167, 
   null, 
   1094772420.0
  ], 
  [
   66347, 
   null, 
   "jitobear", 
   "Here kitty, kitty, kitty..... emoticon_angry", 
   {}, 
   66341, 
   null, 
   1094773440.0
  ], 
  [
   66354, 
   null, 
   "Freedom_Fighter", 
   "BTW,did someo emoticon_mad ne mention that the Italians were mistreated?\n\n \n I made a post near the beginning noting the treatment of the Italians and the Germans. Check it out Post #11.", 
   {}, 
   66167, 
   null, 
   1094774220.0
  ], 
  [
   66355, 
   null, 
   "Big Orn", 
   "You are probably referring to me (I once was known as Bush Is The Man). I did not refer to anyone as derrogatory words. I said that what the person who called Japanes \"Japs\" said could be likened to calling a black person or a Mexican the terms I stated. How can you take that that far out of context?\n\n If I'm not mistaken he was talking to everyone/anyone who would stoop to that level, not just you.\n \n There seems to be a trend where when intelligence plays out mean, hateful words take over, sort of the same thing sinjin was talking about in the thread you started about the admin moderation. The lack of vocabulary is a b...bad thing.\n \n \n Maineiac was, I think, referring to any and all that share that lack of intel.", 
   {}, 
   66354, 
   null, 
   1094774460.0
  ], 
  [
   66360, 
   null, 
   "Maineiac", 
   "Sometimes it doesn't take much to rub people the wrong way.I got the impression that the person starting this thread was making a statement on the way things sometimes turn out,in this case Russia.Not knowing a lot of the current events taking place there,I followed the thread.\n \n The thread turns from Russia,to argueing over who said what about who.\n \n I did find,through the posted link,who Aslan Maskhadov was,and his connection to current events.\n \n As for the Italians,were proabably better lovers than fighters,so I can see how we would be easily defeated.", 
   {}, 
   66355, 
   null, 
   1094775900.0
  ], 
  [
   66456, 
   null, 
   "jim's trucking", 
   "Speaking of Russia\n check out This\nI agree with the Russians. The US and Britian should stay out of this mess. Our offering asylum to the Chechen secessionist rebels would be similar to Russia offering political asylum to Jefferson Davis and the Southern generals of our Civil War. The only difference being that our Southern generals were fighting without using hostages and blowing up a Northern highschool.\n \n According to the article, the Chechen people voted to stay in the Russian Federation.\n \n This is a Russian Civil War going on. I don't condone the terrorism that happened in the school. I think the terrorists should be shot on sight, not offered a home across the sea.\n \n Kill emoticon_xkill all terrorists and those who support them.", 
   {}, 
   66332, 
   null, 
   1094845380.0
  ], 
  [
   66459, 
   null, 
   "jim's trucking", 
   "I find this thread amazing.lol.Everyone is upset over the term used to describe the Japanese,yet make even cruder remarks describing other people.\n I don't believe the term would have been mentioned again in the the thread if it wouldn't have been blown all out of porportion.BTW,did someo emoticon_mad ne mention that the Italians were mistreated?\nI believe that talking about the derogatory names (and having to mention them) is not the same as calling someone by one of them.\n \n I have friends in almost any of the groups described by these words. Most of them are not offended when those words come up unless they are directed at them in a serious, contemptible manner.\n \n My friends are:\n \n Russian\n German\n Italian\n Jewish\n Mexican\n Black\n Polish\n French\n Portugese\n Saudi\n Korean\n Japanese\n Indian\n Pakistani\n Laotian\n Hawaiian\n Chinese\n French Canadian\n Bulgarian\n \n \n and a few others.\n \n \n ...", 
   {}, 
   66167, 
   null, 
   1094846580.0
  ], 
  [
   66544, 
   null, 
   "AMD4EVER", 
   "When I was a girl\n\n \n Your a guy now? lol, j/k. You have had enough verbal abuse and I don't want to cause more :p \n \n \nFast forward to today and we know that we were wrong. We may have had arguments with the governments of those nations, but the dehumanization was wrong.\n\n \n Was it really? Maybe we should have fought WWII with kids gloves? Sure maybe it would be nicer if we recognized that they were living people as well and that not all of them were trying to kill us, but that certainly would not change the minds of those we were fighting. We would try to empathize with the enemy while they tried to kill us. That is what we are doing in Iraq and North Korea. If we had our WWII faces on we would have blockaded North Korea by now starving them to death while bombing their nuclear and communication centers and we would have probably done about the same to Falluja and any other part of Iraq that gave us any troubles. We would be saving the lives of those we recognize as Americans who are fighting for a better world. Yeah how evil it is that we have to go to war to make the world a better place but it is true that this is what has to be done. Stop looking at this all like the world is a good place or you will get those you love killed.\n \n \nwe have butchered each other and each other's children in name of God, greed and lines on a map.\n\n \n How about in the name of freedom? WWI, WWII, Cold War, War on Terrorism. They are all about the same thing. It isn't God or greed or lines on a map. It is about not allowing people to take away our rights to be free. If you want the root of modern wars it is the human belief that they deserve to be free and that their fellow humans also deserve that right.\n \n \nWe have had holocausts, World Wars, flown planes into building, shot school-children in the back and bombed the **** out of countries a fraction our our size.\n\n \n OK Germans had the holocaust and they were enemies of freedom. Terrorists flew planes into buildings and they are enemies of freedom. Those who shot the children in the school were terrorists and enemies of freedom. The World Wars and the bombs droped on countries a fraction of our size were the same ones who supported the German cause or the terrorists. Do you see the connection here? How can you not see that there is a common face can be put on these countries when they all have the same core objective in common? Thank goodness those of fight for freedom have not tried to empathize with those who wish to have them killed. I hope the Russians burn the Chechan terrorists into the ground without giving it a second thought.\n \n \nToday the monster is terrorism - not communism. But instead dealing with it's reality we have given it an Arab face so we don't have to cry when Iraqi children die.\n\n \n Where were you when Saddam was killing the Iraqi children? Were you crying then? Did you not care that they were an enslaved people with no rights and no one to go to for help when the government came to kill them all? Thank God and the US that they are now actually seen as people instead of slaves to a dictator. You can accuse us of pretending like Iraqi children don't matter when infact they are now more important in the eyes of their government than they have ever been since you were born. And yet you accuse us of not caring. Screw you! I hate your kind! I will never understand what goes on inside of your head! You have nothing better to do than critisize those who are risking everything to help the less fortunate of this world! And of course had we done nothing you would critisize them all the same!\n \n \nI am sick of this. Why does God bother with any of us at all?\n\n \n Can't you see proof of Gods efforts in what is happening? God believes in free will. The US is the most powerful nation in the world, the protector of the Holy Land of Israel, and the greatest chance for freedom in the world of men. We have fought for and accomplished amazing things with the help of God including our victories in WWII and the war against communism. We have now set Iraq free as it is meant to be even for those countries who do not believe in our God.\n \n It is just amazing to me how people will hate the world today even though acts of God can be seen all around us especially in the wars we are fighting today. We are helping to create the world God would want us to live in. The United States brings this gift to areas of the world that have never had it before and that still upsets so many. I just have to shake my head.", 
   {}, 
   65923, 
   null, 
   1094882880.0
  ], 
  [
   66794, 
   null, 
   "jitobear", 
   "Your a guy now? lol, j/k. You have had enough verbal abuse and I don't want to cause more :p \n \n \n \n Was it really? Maybe we should have fought WWII with kids gloves? Sure maybe it would be nicer if we recognized that they were living people as well and that not all of them were trying to kill us, but that certainly would not change the minds of those we were fighting. We would try to empathize with the enemy while they tried to kill us. That is what we are doing in Iraq and North Korea. If we had our WWII faces on we would have blockaded North Korea by now starving them to death while bombing their nuclear and communication centers and we would have probably done about the same to Falluja and any other part of Iraq that gave us any troubles. We would be saving the lives of those we recognize as Americans who are fighting for a better world. Yeah how evil it is that we have to go to war to make the world a better place but it is true that this is what has to be done. Stop looking at this all like the world is a good place or you will get those you love killed.\n \n \n \n How about in the name of freedom? WWI, WWII, Cold War, War on Terrorism. They are all about the same thing. It isn't God or greed or lines on a map. It is about not allowing people to take away our rights to be free. If you want the root of modern wars it is the human belief that they deserve to be free and that their fellow humans also deserve that right.\n \n \n \n OK Germans had the holocaust and they were enemies of freedom. Terrorists flew planes into buildings and they are enemies of freedom. Those who shot the children in the school were terrorists and enemies of freedom. The World Wars and the bombs droped on countries a fraction of our size were the same ones who supported the German cause or the terrorists. Do you see the connection here? How can you not see that there is a common face can be put on these countries when they all have the same core objective in common? Thank goodness those of fight for freedom have not tried to empathize with those who wish to have them killed. I hope the Russians burn the Chechan terrorists into the ground without giving it a second thought.\n \n \n \n Where were you when Saddam was killing the Iraqi children? Were you crying then? Did you not care that they were an enslaved people with no rights and no one to go to for help when the government came to kill them all? Thank God and the US that they are now actually seen as people instead of slaves to a dictator. You can accuse us of pretending like Iraqi children don't matter when infact they are now more important in the eyes of their government than they have ever been since you were born. And yet you accuse us of not caring. Screw you! I hate your kind! I will never understand what goes on inside of your head! You have nothing better to do than critisize those who are risking everything to help the less fortunate of this world! And of course had we done nothing you would critisize them all the same!\n \n \n \n Can't you see proof of Gods efforts in what is happening? God believes in free will. The US is the most powerful nation in the world, the protector of the Holy Land of Israel, and the greatest chance for freedom in the world of men. We have fought for and accomplished amazing things with the help of God including our victories in WWII and the war against communism. We have now set Iraq free as it is meant to be even for those countries who do not believe in our God.\n \n It is just amazing to me how people will hate the world today even though acts of God can be seen all around us especially in the wars we are fighting today. We are helping to create the world God would want us to live in. The United States brings this gift to areas of the world that have never had it before and that still upsets so many. I just have to shake my head.\n\n \n Not every fight fought is a bad one and without good cause. That is not what I am saying.\n \n But even if we had to to \"fight the good fight\" - like putting an end to Nazi power. The reason that fight had to be fought is because Hitler and his ilk dehumanized nearly everyone which made it easy for them to justify doing what they did.\n \n People of good conscience should not utilize the same tactics. If we are fighting for something, be honest about it, do not stoop to false propoganda and scapegoating (like we did to Japanese Americans is WWII). It's NEVER ok to do that. EVER. No matter who you are. If your \"greatness\" is acheived at the expense of lies about another - you are not great. \n \n Nor am I fingering any one people here. We are all guilty of it.\n \n And would you please provide biblical proof that God is backing the USA? WHAT A LOAD OF HOGWASH!!!!! Yes, he did grant us free will. I wonder why he continues to deal with us, considering what we have done with that free will.\n \n The only nation God ever backed was Insreal and according to the New Testament that ended with Christ. It is up to indivuduals to find God now.\n \n Help of God in our wars indeed......", 
   {}, 
   66544, 
   null, 
   1095104280.0
  ], 
  [
   66800, 
   null, 
   "AMD4EVER", 
   "People of good conscience should not utilize the same tactics. If we are fighting for something, be honest about it, do not stoop to false propoganda and scapegoating (like we did to Japanese Americans is WWII). It's NEVER ok to do that. EVER. No matter who you are. If your \"greatness\" is acheived at the expense of lies about another - you are not great.\n\n \n Of course it is necessary to do this. Anytime we label a certain country an enemy of peace we take care of it and anyone who protects it. We put a blanket label on them saying they are bad and there is no other way to do it. If we didn't then that country would win and would continue to threaten peace.\n \n \nAnd would you please provide biblical proof that God is backing the USA? WHAT A LOAD OF HOGWASH!!!!! Yes, he did grant us free will. I wonder why he continues to deal with us, considering what we have done with that free will.\n\n \n Wow your freaking out about this one. lol, thats funny. The greatest protector of what he created is the US and the protector of his chosen land is the US and amazingly we are the most powerful country in the world as well. Yeah, God sure isn't on our side, no doubt about it. For how evil we were in foiling Fascisim and Communism from sweeping the globe and how we continue to uphold peace. These are all things God is viciously against I'm sure. hehehe, commence freaking out :)", 
   {}, 
   66794, 
   null, 
   1095105300.0
  ], 
  [
   66843, 
   null, 
   "jitobear", 
   "Of course it is necessary to do this. Anytime we label a certain country an enemy of peace we take care of it and anyone who protects it. We put a blanket label on them saying they are bad and there is no other way to do it. If we didn't then that country would win and would continue to threaten peace.\n\n \n Maybe YOU do. But I don't. I can see a need to fix a problem without demonizing a population. For example - I think that proof could have been provided to justify stopping Japan from attacking us (with war) WITHOUT telling lies about and hurting the Japanese Americans. Just like, at least for me, dealing with the Al-Queda does not require the demonization of all things Arab.\n \n But to give your idea some credit and let me say that I think a great many people would not get it. Maybe some people really aren't able to grasp that. Pretty sad state of affairs to admit we are so dumb, though.\n \n \nWow your freaking out about this one. lol, thats funny. The greatest protector of what he created is the US and the protector of his chosen land is the US and amazingly we are the most powerful country in the world as well. Yeah, God sure isn't on our side, no doubt about it. For how evil we were in foiling Fascisim and Communism from sweeping the globe and how we continue to uphold peace. These are all things God is viciously against I'm sure. hehehe, commence freaking out :)\n\n \n Freaking out is over the top. But I think you are dead wrong. And since we are talking about God's word, it concerns me. So, back it up. There are tons of Bible websites if you don't own a Bible.\n \n I read it often (nearly daily and almost done with reading it covert to cover). God isn't backing nations anymore. But don't take my word for it, go read the New Testament. Or just Revelation.\n \n Here is a summary of what I have learned in my reading of the Bible \n Christ said to pay unto Ceasar what is Ceasar's and to God what is God's. Christ preached the message of God's coming kingdom. They are not particularly interested in our petty squabbles or the little lines we draw on maps of his creation. Paul also said that men of all nations are acceptable to God. Revelation speaks pretty clearly to destrucution of man's governments.\n \n Not to mention God's plan for all having their needs met, and the communal way in which the early Christians lived is much more akin to communism than capatalism, for God also said that one can not love him and money.", 
   {}, 
   66800, 
   null, 
   1095114300.0
  ], 
  [
   66861, 
   null, 
   "Haulingboat", 
   "When I was a girl the big bad boogie man of the world was a thing called Communism. It was an evil, faceless phantom - and when we needed to substantiate this menace we looked to the Soviet Union. Russians became dehumanized - they were the bad guy, they become cliches in film, and we believed. Just like a previous generation had believed it of Germans and Japs. \n \n Fast forward to today and we know that we were wrong. We may have had arguments with the governments of those nations, but the dehumanization was wrong. Japanese concentration camps were wrong.\n \n In the past week we got to watch as parents in Russia mourned the butchering of their children in a school. In the past week this girl who grew up with the cold war menace got to see that Russians hurt just as bad as me. The monster that was portrayed was a lie.\n \n But we keep doing this the world over. We force people into neat little stereotypes, label them good or bad, and dehumanize them. With these simple acts humankind has done injustice to each other ever since the dawn of ourselves. With this mentality we have justified the mistreatment of women, slaves, we have allowed for classism, we have butchered each other and each other's children in name of God, greed and lines on a map. We have had holocausts, World Wars, flown planes into building, shot school-children in the back and bombed the **** out of countries a fraction our our size.\n \n We are all guilty - every country, religion and race and we are all wrong. One day, when the smoke clears, my son will face what we do today. \n \n Today the monster is terrorism - not communism. But instead dealing with it's reality we have given it an Arab face so we don't have to cry when Iraqi children die.\n \n I am sick of this. Why does God bother with any of us at all?\n\n \n \n I know this is going to upset you and all the people here that agree with you,but I'm going to type it anyway.\n \n The world is full of boogie men and people that support boogie men. The Russians that you saw crying for their dead children are the same Russians that built an enormous nuclear stockpile with the intent of destroying us! They were evil! So were we! It was us or them. Do you believe that they would be as passionate to us, if we had lost the cold war, as we have been to them since their decline? Hell No they wouldn't. They'd be spreding Communism faster than we can spread Democracy.\n \n The Japanese pulled the biggest suprise attack in world history to date. We as Americans had the cahones to round them up and sort them out before they had the chance to pull off another attack from within. Yeah, alot of innocent people were detained and that was certainly an unfortunate event, but you cannot liken defending our country in a time of war with trying to wipe out an entire race of people. This you certainly what you did by stating \" Japanese concentration camps.\" \n \n You posters with your political correctness and sensitivety wooing attitudes are the reason Muslim terrorists can waltz into this country and blow us up! Everyone is so afraid of you pointing your finger and yelling \"That is offensive & you are a racist\" that we allowed murderers to live amoungst us for years while they concocted and deployed their plan to kill thousands of us. And still you sit there and type about not dehumanizing them. Tell me what kind of human flys a plane into a building full of people? \n \n We need to be suspicious of foreignors and countries that openly tell the world they wish us dead. That is what the Russians did then, and what the extremists do now. So if you folks want to have compassion for them and not \"dehumanize\" them you can go right ahead, but the rest of us are going to do what it takes to keep them out. If that means hurting some feelings or stepping on some toes then you guys and gals had better get some steel toed shoes, because this war won't be won with pleasentries and sensitivity. We are going to have recognize the boogie men, focus in and kill them before they kill us. \n \n It is that or get ready to join your Russian companions in the line for firewood and food to keep your homes warm in the winter, and food in the pantry. \n \n This entire thread is extremely dishearting. For all we know there is probably not a single Japanese person on these forums and yet we have a bunch of white people on here trying not to offend any of them. How would you like to be a WWII veteran that had to defend his life, and yours, against them and be here reading you people tripping all over yourselves to not offend anyone. Your disgusting.\n \n Now that I have ****** everyone off I'm going go back to reading your posts and keep my discussions to a minimum.", 
   {}, 
   65923, 
   null, 
   1095122760.0
  ], 
  [
   66880, 
   null, 
   "syklopps61", 
   "I know this is going to upset you and all the people here that agree with you,but I'm going to type it anyway.\n \n The world is full of boogie men and people that support boogie men. The Russians that you saw crying for their dead children are the same Russians that built an enormous nuclear stockpile with the intent of destroying us! They were evil! So were we! It was us or them. Do you believe that they would be as passionate to us, if we had lost the cold war, as we have been to them since their decline? Hell No they wouldn't. They'd be spreding Communism faster than we can spread Democracy.\n \n The Japanese pulled the biggest suprise attack in world history to date. We as Americans had the cahones to round them up and sort them out before they had the chance to pull off another attack from within. Yeah, alot of innocent people were detained and that was certainly an unfortunate event, but you cannot liken defending our country in a time of war with trying to wipe out an entire race of people. This you certainly what you did by stating \" Japanese concentration camps.\" \n \n You posters with your political correctness and sensitivety wooing attitudes are the reason Muslim terrorists can waltz into this country and blow us up! Everyone is so afraid of you pointing your finger and yelling \"That is offensive & you are a racist\" that we allowed murderers to live amoungst us for years while they concocted and deployed their plan to kill thousands of us. And still you sit there and type about not dehumanizing them. Tell me what kind of human flys a plane into a building full of people? \n \n We need to be suspicious of foreignors and countries that openly tell the world they wish us dead. That is what the Russians did then, and what the extremists do now. So if you folks want to have compassion for them and not \"dehumanize\" them you can go right ahead, but the rest of us are going to do what it takes to keep them out. If that means hurting some feelings or stepping on some toes then you guys and gals had better get some steel toed shoes, because this war won't be won with pleasentries and sensitivity. We are going to have recognize the boogie men, focus in and kill them before they kill us. \n \n It is that or get ready to join your Russian companions in the line for firewood and food to keep your homes warm in the winter, and food in the pantry. \n \n This entire thread is extremely dishearting. For all we know there is probably not a single Japanese person on these forums and yet we have a bunch of white people on here trying not to offend any of them. How would you like to be a WWII veteran that had to defend his life, and yours, against them and be here reading you people tripping all over yourselves to not offend anyone. Your disgusting.\n \n Now that I have ****** everyone off I'm going go back to reading your posts and keep my discussions to a minimum.\n\n\n \n AMEN BROTHER! KEEP YOUR OPINIONS COMING PLEASE, LOTS OF THEM!!!!", 
   {}, 
   66861, 
   null, 
   1095128220.0
  ], 
  [
   66881, 
   null, 
   "AMD4EVER", 
   "Maybe YOU do. But I don't. I can see a need to fix a problem without demonizing a population. For example - I think that proof could have been provided to justify stopping Japan from attacking us (with war) WITHOUT telling lies about and hurting the Japanese Americans. Just like, at least for me, dealing with the Al-Queda does not require the demonization of all things Arab.\n\n \n We really are not demonizing all things Arab. The Arabs in our own country are still Americans more than they are Arabs. Arabs in Turkey and Egypt and Kuwait and Pakistan are not our enemies. I would debate that we demonize countries, not people. Iraq, Iran, North Korea. These are the demons of our time. If I seen an Arab right now I wouldn't think of them as the enemy.\n \n \nFreaking out is over the top. But I think you are dead wrong. And since we are talking about God's word, it concerns me. So, back it up. There are tons of Bible websites if you don't own a Bible.\n \n I read it often (nearly daily and almost done with reading it covert to cover). God isn't backing nations anymore. But don't take my word for it, go read the New Testament. Or just Revelation.\n\n \n I just don't get where you are coming up with this. Where did I say it was foretold in the Bible that America was Gods chosen nation? I never said that so I don't see why you are trying to suggest that I did. What I did suggest is that God is truely with the US otherwise we would have fallen by now. That isn't to say God isn't with any other country but he is certainly with us. We have done what he wanted to see done and we have been rewarded. That is what I contend at least. But to be honest, I am not that much of a believer in God anyways. The only reason I can still find to believe in God is the fact that the US is the most powerful nation on Earth. Name one other country that you believe God would pick to be this powerful. But don't get all bent out of shape by this. Either debate what I am presenting or don't debate me at all. Stop throwing out **** like \"read the New Testament\" because that doesn't even make sense in this debate. I'm debating a theoretical and your asking me to show where it says that in the Bible.\n \n \nHere is a summary of what I have learned in my reading of the Bible \n Christ said to pay unto Ceasar what is Ceasar's and to God what is God's. Christ preached the message of God's coming kingdom. They are not particularly interested in our petty squabbles or the little lines we draw on maps of his creation. Paul also said that men of all nations are acceptable to God. Revelation speaks pretty clearly to destrucution of man's governments.\n \n Not to mention God's plan for all having their needs met, and the communal way in which the early Christians lived is much more akin to communism than capatalism, for God also said that one can not love him and money.\n\n \n First of all God is interested in lines on a map. He ordered his fair share of wars. heh, just another reason to not take the Bible seriously I guess. As far as all nations being acceptable, that does not mean all ideals are acceptable. Ideals are what we have wared over recently. Fascism and Communism and now terrorism. These are not nations. Revelations also covers the end of time so how a government can even survive that is beyond me. How can you even use this in this sort of debate anyways? As far as Communism, Communism is an ideal that was warped by those who preached it. The practiced form of Communism was nothing close to how Christians lived especially since religion was forbidden in many places. As far as love and money go, heck we are the richest nations on Earth and other countries can't believe how religiously set in our ways we are.\n \n So I'll leave it open to you to rebut my points but please try to stay away from asking me to point to where it says this is true as it is all theoretical. I base it on evidence that I see around the world, not on what the Bible, which I am skeptical about anyways, says.", 
   {}, 
   66843, 
   null, 
   1095128940.0
  ], 
  [
   66884, 
   null, 
   "AMD4EVER", 
   "Now that I have ****** everyone off I'm going go back to reading your posts and keep my discussions to a minimum.\n\n \n Nah you are right. We have 1000 dead Americans in Iraq right now only because we are afraid to offend the world by actually fighting this war. We could have thousands dead in LA because we don't want to starve the people of North Korea or bomb their nuclear plants. Same with Iran. And oh no, we can't close our Southern border. That would be racist. Just let the drugs, criminals, and terrorists keep on coming. We will do something after thousands are dead but not until then. Lets not allow our airport screeners to pick out people to search based on instincts, lets make it random leaving far greater holes in our security but making everyone feel as if they are not being discriminated against. Wake up children! You could be the next to die and what will it be for? Osama wants you dead. Kim Jung Il wants you dead. Muslim fanatics around the world want you dead. And you are more worried about their feelings than your own life or the lives of those around you. The level of stupidity are just incredible.\n \n So there, now I've ****** off everyone here as well. Let me have it.", 
   {}, 
   66861, 
   null, 
   1095129720.0
  ], 
  [
   66888, 
   null, 
   "syklopps61", 
   "Nah you are right. We have 1000 dead Americans in Iraq right now only because we are afraid to offend the world by actually fighting this war. We could have thousands dead in LA because we don't want to starve the people of North Korea or bomb their nuclear plants. Same with Iran. And oh no, we can't close our Southern border. That would be racist. Just let the drugs, criminals, and terrorists keep on coming. We will do something after thousands are dead but not until then. Lets not allow our airport screeners to pick out people to search based on instincts, lets make it random leaving far greater holes in our security but making everyone feel as if they are not being discriminated against. Wake up children! You could be the next to die and what will it be for? Osama wants you dead. Kim Jung Il wants you dead. Muslim fanatics around the world want you dead. And you are more worried about their feelings than your own life or the lives of those around you. The level of stupidity are just incredible.\n \n So there, now I've ****** off everyone here as well. Let me have it.\n\n\n \n I'M LOVIN' IT! You and Hauling are nailing it big time...glad to be on your side!", 
   {}, 
   66884, 
   null, 
   1095133800.0
  ], 
  [
   66942, 
   null, 
   "sinjin", 
   "Confusing your enemy with anyone who remotely resembles your enemy is patently bigoted. Sort of like calling people \"Japs\" and \"AYrabs\". If upholding our principles exposes us to harm, that is the price of freedom. Those of you who would live constantly under \"martial law\" would actually be quite content in North Korea. People who would justify killing someones kids make me sick.\n \n I am incidentally free of all \"mind control\". Are you?", 
   {}, 
   66888, 
   null, 
   1095185520.0
  ], 
  [
   66947, 
   null, 
   "jitobear", 
   "Adam - saying we are successful because God is on our side is ludricous Biblicaly and in the real world. The Mafia is successful, on 9/11 terrorists were, for many years Nazis were. Do you mean to suggest God supported them at any point? God is simply hands off when it comes to our governments. It is us who make it fail or succeed.\n \n God ordering wars happened in the old testament when he backed a nation called Isreal and spoke through prophets. Not doing that anymore. In our day and age anyone claiming to be fighting at the behest of God is considered a lunatic and fanatic. (i.e., muslim extremists)\n \n THE US is successful because of lots of work, good folk, a good system and a bit of luck - not because God wants it that way. \n \n Regarding terrorists being able to attack us on 9/11. Granted we may have had some security issues, but it certainly was not the result of a lack of bigotry against muslims. It was however, partly due to some muslims being able to dehumanize American citizens as so evil and bad that we deserved such an attack.\n \n I would also like to point out that most of the terrorism that happens in the US is carried out by your fellow Americans (Oklahoma City, the Una-Bomber, inner-city gangs, the Mafia). If we focus on some false image - the innocent will be hurt (Japenese concentration camps) and many of the real demons will escape us (last I heard most orginzed crime sindicates in the US were still thriving).\n \n I can see an enemy without lies and mistreatment. Why can't you Adam, Haulingboat and Skylopps. Is it really that hard?", 
   {}, 
   66942, 
   null, 
   1095186780.0
  ], 
  [
   66949, 
   null, 
   "Big Orn", 
   "I'M LOVIN' IT! You and Hauling are nailing it big time...glad to be on your side!\n\n Same here. I see your point as clear as glass. It's not negative, IMHO.", 
   {}, 
   66888, 
   null, 
   1095186900.0
  ], 
  [
   66953, 
   null, 
   "georged", 
   "Confusing your enemy with anyone who remotely resembles your enemy is patently bigoted. Sort of like calling people \"Japs\" and \"AYrabs\". If upholding our principles exposes us to harm, that is the price of freedom. Those of you who would live constantly under \"martial law\" would actually be quite content in North Korea. People who would justify killing someones kids make me sick.\n \n I am incidentally free of all \"mind control\". Are you?\n\n \n Exactly. Martial law is interchangeable with delusional paranoia. We engage in foreign policy that invites extreme retaliation, the public is refocused to a siege mentality that allows easy removal of civil rights and our founding principles. A strange definition of leadership for a democracy.", 
   {}, 
   66942, 
   null, 
   1095188520.0
  ], 
  [
   66967, 
   null, 
   "Big Orn", 
   "THE US is successful because of lots of work, good folk, a good system and a bit of luck - not because God wants it that way.\n\n I have to disagree with you here, but am reluctant due to that proverbial can-opening and worms a-crawling.\n \nRegarding terrorists being able to attack us on 9/11. Granted we may have had some security issues, but it certainly was not the result of a lack of bigotry against muslims. It was however, partly due to some muslims being able to dehumanize American citizens as so evil and bad that we deserved such an attack.\n\n Jitobear - get off-a me! Just because they said we deserved it don't make it so! No matter what you or I think of our fellow Americans - we are still far better-off than other nations...by far. Maybe I'm prejudiced, but where on earth is there a country as clean and wholesome as this one?\n \nI would also like to point out that most of the terrorism that happens in the US is carried out by your fellow Americans (Oklahoma City, the Una-Bomber, inner-city gangs, the Mafia). If we focus on some false image - the innocent will be hurt (Japenese concentration camps) and many of the real demons will escape us (last I heard most orginzed crime sindicates in the US were still thriving).\n\n That's not what they're talking about. They're not talking about rebellion, it's the pure, unadulterated hate of the USA that they want to convey.", 
   {}, 
   66947, 
   null, 
   1095193260.0
  ], 
  [
   66968, 
   null, 
   "Waxy", 
   "Maybe I'm prejudiced, but where on earth is there a country as clean and wholesome as this one?\n\n \n Just north of the 49th parallel. :p\n \n Waxy", 
   {}, 
   66967, 
   null, 
   1095193800.0
  ], 
  [
   66972, 
   null, 
   "Big Orn", 
   "Just north of the 49th parallel. :p\n \n Waxy\n\n Well...I always considered ya'll one of us anyway! emoticon_cool", 
   {}, 
   66968, 
   null, 
   1095194880.0
  ], 
  [
   66974, 
   null, 
   "lord tammerlain", 
   "I have to disagree with you here, but am reluctant due to that proverbial can-opening and worms a-crawling.\n \n Jitobear - get off-a me! Just because they said we deserved it don't make it so! No matter what you or I think of our fellow Americans - we are still far better-off than other nations...by far. Maybe I'm prejudiced, but where on earth is there a country as clean and wholesome as this one?\n \n That's not what they're talking about. They're not talking about rebellion, it's the pure, unadulterated hate of the USA that they want to convey.\n\n \n \n Now what you have to figure out is why they hate the USA. Perhaps it is the because the last 100 years of western powers helping their governments be oppressive? Perhaps it is the lack of respect for their culture and morals when westerners are in their lands?", 
   {}, 
   66967, 
   null, 
   1095195720.0
  ], 
  [
   66978, 
   null, 
   "georged", 
   "Now what you have to figure out is why they hate the USA. Perhaps it is the because the last 100 years of western powers helping their governments be oppressive? Perhaps it is the lack of respect for their culture and morals when westerners are in their lands?\n\n \n I don't see those as issues as being intellectually viable for the average American. The Western dependency on Christianity and democracy as rationalizations for all politically motivated actions allows no room for other belief systems or cultures.", 
   {}, 
   66974, 
   null, 
   1095196500.0
  ], 
  [
   66983, 
   null, 
   "lord tammerlain", 
   "Which truely baffles me when I hear so many clamor for the deaths of the terrorists, and ( no offensive meant to the families or friends) how the US should kill more Iraqis because of the US soldiers who are dieing in Iraq when if they werent in Iraq they wouldnt be dieing, or that 120 000 thousand military troops if in the US or at ports shipping to the US could provide more security to the US then a war in a country that has never attacked the US, had no means to attack the US, let alone any of its neighboring countries.", 
   {}, 
   66978, 
   null, 
   1095197640.0
  ], 
  [
   66986, 
   null, 
   "georged", 
   "We're ruled by professional politicians being guided by special interests. The public is always putty in those hands. We're easily refocused by the media, one of those many special interests, while Russia uses a combination of state media and fear. Same results.", 
   {}, 
   66983, 
   null, 
   1095198780.0
  ], 
  [
   66990, 
   null, 
   "Haulingboat", 
   "Allow me to contribute a little more.\n \n The recent events that unfolded in Russia were unfortunate to say the least. I have compassion for the parents and others that lost children in the trajedy. However, I think the Russian officials diserve credit for their handling of the event. I believe that we Americans would be wise to learn from this incident and perhaps take a page from the Russians book the next time we face a hostage crisis here at home.\n \n I applaude the sledge hammer tatics that the Ruskies used to quelsh this uprising. They did not cave into Muslim terrorist demands. They did not quiver in the face of evil. They stood their ground and flushed the Muslim terrorists out without giving ground.\n \n The same can be said for the incedent involving the downed submarine. The Russians refused help from foreigners. They stood behind their principles. They were willing to sacrifice the lives of their very best men to protect the anonimy of the technology. Again, they took the hard road. They chose the sledge hammer approach to the solution as appossed to the feel good, sensitve, \" how're we going to make everyone happy\" approach.\n \n If we stopped tippy toeing around Iraq and Afganistan we would be wrapping things up about now. If we stopped the politicing today, and employed the Russian sledge hammer technic we could storm into the hills of Pakistan shove an American boot down Osama's throat and return with his head on a platter, just like the Muslim terrorists do in Iraq.", 
   {}, 
   66949, 
   null, 
   1095199500.0
  ], 
  [
   66995, 
   null, 
   "lord tammerlain", 
   "Allow me to contribute a little more.\n \n The recent events that unfolded in Russia were unfortunate to say the least. I have compassion for the parents and others that lost children in the trajedy. However, I think the Russian officials diserve credit for their handling of the event. I believe that we Americans would be wise to learn from this incident and perhaps take a page from the Russians book the next time we face a hostage crisis here at home.\n \n I applaude the sledge hammer tatics that the Ruskies used to quelsh this uprising. They did not cave into Muslim terrorist demands. They did not quiver in the face of evil. They stood their ground and flushed the Muslim terrorists out without giving ground.\n \n The same can be said for the incedent involving the downed submarine. The Russians refused help from foreigners. They stood behind their principles. They were willing to sacrifice the lives of their very best men to protect the anonimy of the technology. Again, they took the hard road. They chose the sledge hammer approach to the solution as appossed to the feel good, sensitve, \" how're we going to make everyone happy\" approach.\n \n If we stopped tippy toeing around Iraq and Afganistan we would be wrapping things up about now. If we stopped the politicing today, and employed the Russian sledge hammer technic we could storm into the hills of Pakistan shove an American boot down Osama's throat and return with his head on a platter, just like the Muslim terrorists do in Iraq.\n\n \n \n So you applaude the Russian genocide in Chechnya since 1996 where 28 % of the Chechnyan people have been killed, where Grozny has been flattened by the Russian military. Where the hostage taking by Chechnyan people was in reaction to the terrorit activities of the Russian military ( rape, murder indiscriminate bombing for the last 8 years)\n \n So you want the US to follow in those footprints and be forever linked to genocide.\n \n By the way I wouldnt want to push Pakistan to far. With a good portion of their military being fundamentalist and having access to nukes distabilizing Pakistan would be a very bad choice for international security.", 
   {}, 
   66990, 
   null, 
   1095199980.0
  ], 
  [
   66999, 
   null, 
   "georged", 
   "Allow me to contribute a little more.\n \n The recent events that unfolded in Russia were unfortunate to say the least. I have compassion for the parents and others that lost children in the trajedy. However, I think the Russian officials diserve credit for their handling of the event. I believe that we Americans would be wise to learn from this incident and perhaps take a page from the Russians book the next time we face a hostage crisis here at home.\n \n I applaude the sledge hammer tatics that the Ruskies used to quelsh this uprising. They did not cave into Muslim terrorist demands. They did not quiver in the face of evil. They stood their ground and flushed the Muslim terrorists out without giving ground.\n\n \n Though the current administration would prefer the public combine them as one issue, the truth of the matter is that particular Russian issue has been in place and active for 300-years and has little to do with Islamic extremists acting against the US. We haven't even been a nation that long, but we've employed brutality in the name of democracy since Vietnam. Don't fear, we're well on our way to becoming a full-fledged police state. There aren't that many constitutional rights to subdue.", 
   {}, 
   66990, 
   null, 
   1095200580.0
  ], 
  [
   67009, 
   null, 
   "jitobear", 
   "I would also like to come out and state that I don't agree when people make the US the bad guy/target based on bs propoganda either.\n \n My comments in my original post were about human kind. They were not to be linked to any one group or nation.\n \n Waxy - I LOVE IT UP THERE!", 
   {}, 
   66999, 
   null, 
   1095201720.0
  ], 
  [
   67010, 
   null, 
   "Haulingboat", 
   "So you applaude the Russian genocide in Chechnya since 1996 where 28 % of the Chechnyan people have been killed, where Grozny has been flattened by the Russian military. Where the hostage taking by Chechnyan people was in reaction to the terrorit activities of the Russian military ( rape, murder indiscriminate bombing for the last 8 years)\n \n So you want the US to follow in those footprints and be forever linked to genocide.\n \n By the way I wouldnt want to push Pakistan to far. With a good portion of their military being fundamentalist and having access to nukes distabilizing Pakistan would be a very bad choice for international security.\n\n \n Nice try, trying to pin everything Russia does or, has done, onto my quote, but I said I applaude their handling of those two events. Lets try and stay on coarse here. :xbanghead", 
   {}, 
   66995, 
   null, 
   1095201780.0
  ], 
  [
   67036, 
   null, 
   "lord tammerlain", 
   "Nice try, trying to pin everything Russia does or, has done, onto my quote, but I said I applaude their handling of those two events. Lets try and stay on coarse here. :xbanghead\n\n \n If your post did not mean to imply that the US should follow a harsher stance in Iraq or Afghanistan, then I will retract the statement.\n \n \n\n If we stopped tippy toeing around Iraq and Afganistan we would be wrapping things up about now. If we stopped the politicing today, and employed the Russian sledge hammer technic we could storm into the hills of Pakistan shove an American boot down Osama's throat and return with his head on a platter, just like the Muslim terrorists do in Iraq.\n\n \n It was this part of the statement, that lead me to believe that you wished to use Russian methods used in Chechnya, in Iraq Afghanistan and Pakistan. If I miss read it I apologize. Could you then clarify what you meant?", 
   {}, 
   67010, 
   null, 
   1095208980.0
  ], 
  [
   67038, 
   null, 
   "AMD4EVER", 
   "It was this part of the statement, that lead me to believe that you wished to use Russian methods used in Chechnya, in Iraq Afghanistan and Pakistan. If I miss read it I apologize. Could you then clarify what you meant?\n\n \n I think he meant we should stop using baby gloves when we have a war to fight. On a toughness scale of 1 to 10 we are about a 3 while Russia is about an 8. Lets get up around the 5 range and maybe we can start to accomplish something.", 
   {}, 
   67036, 
   null, 
   1095210120.0
  ], 
  [
   67043, 
   null, 
   "georged", 
   "I think he meant we should stop using baby gloves when we have a war to fight. On a toughness scale of 1 to 10 we are about a 3 while Russia is about an 8. Lets get up around the 5 range and maybe we can start to accomplish something.\n\n \n In Iraq? Where we're instilling democracy? Russia is in a situation that's been in play for centuries. They're using genocide in an attempt to win where the czars, Lenin, Stalin and the rest failed to break the spirit of a minority population. Maybe revive the KKK and give them police state powers to solve our domestic problems?", 
   {}, 
   67038, 
   null, 
   1095212820.0
  ], 
  [
   67057, 
   null, 
   "AMD4EVER", 
   "In Iraq? Where we're instilling democracy?\n\n \n Instilling democracy can only be done if those who wish to destroy it are removed. Luckly for us most of them gathered in just a few key places such as Falluja. We could have put the hurt on them if we wanted to but we didn't and their leader marches on. Do you think we should leave it to the Iraqi democracy to take on these guys? Good luck with that.", 
   {}, 
   67043, 
   null, 
   1095220980.0
  ], 
  [
   67084, 
   null, 
   "billsco", 
   "You posters with your political correctness and sensitivety wooing attitudes are the reason Muslim terrorists can waltz into this country and blow us up! \n\n \n I pointed out the term \"Japs\" is offensive to some people. Now I'm in bed with Osama?", 
   {}, 
   66861, 
   null, 
   1095257280.0
  ], 
  [
   67102, 
   null, 
   "georged", 
   "Instilling democracy can only be done if those who wish to destroy it are removed. Luckly for us most of them gathered in just a few key places such as Falluja. We could have put the hurt on them if we wanted to but we didn't and their leader marches on. Do you think we should leave it to the Iraqi democracy to take on these guys? Good luck with that.\n\n \n I'm a person who fails to see how a Western style democracy will ever mesh with Islamic Law, unless we kill off the male members of any nation we've chosen to dominate with our crusade. We didn't seem to learn our lesson in Vietnam. Russia has had the same problem, political domination, with Chechnya for longer than we've been a nation. Now they're trying genocide by turning government heads away from their military actions. Is that our next step, using an Iraqi Army controlled by us?", 
   {}, 
   67057, 
   null, 
   1095269100.0
  ], 
  [
   67105, 
   null, 
   "Big Orn", 
   "I'm a person who fails to see how a Western style democracy will ever mesh with Islamic Law, unless we kill off the male members of any nation we've chosen to dominate with our crusade.\n\n That's been an issue that, when seriously discussed, some seem to want to don house shoes and lightly tiptoe around, then crouching, very gently swat around the bush. You and I have brought this up a couple of times and have met serious opposition, but what is so hard for me to swallow is that the notion simply does not gel here or anyplace else. Sure we have those that agree, but very few times have they carried it further without the added &#8220;but&#8230;&#8221;. There is really no &#8220;but&#8221; to it. Either we do away with the Islamic religion, outlawing it and all it&#8217;s practices, or kill those who perpetuate it &#8211; the male population. Then and only then will there be a successful inauguration of democracy for the populace.\n \n 2 + 2 = 4 and I can&#8217;t make it equal anything else. Can you?", 
   {}, 
   67102, 
   null, 
   1095270360.0
  ], 
  [
   67109, 
   null, 
   "georged", 
   "\n \n 2 + 2 = 4 and I can't make it equal anything else. Can you?\n\n \n No, but I'm not trained in government or belief system accounting. The recent Russian experience brought out our basic Christian racist mentality in many posters. Get tough, do what's necessary, kill off Islamic leaders and supporters who encourage fundamentalism and, above all, suppress and destroy any shred of nationalism or belief system that doesn't embrace our political ideology. Quite a step from the US public being shepherded into intimidation by possible Iraqi WMDs to genocide peeking out from under our civilized facade.", 
   {
    "unicode_changes_made": true
   }, 
   67105, 
   null, 
   1095272160.0
  ], 
  [
   67113, 
   null, 
   "Big Orn", 
   "No, but I'm not trained in government or belief system accounting. The recent Russian experience brought out our basic Christian racist mentality in many posters. Get tough, do what's necessary, kill off Islamic leaders and supporters who encourage fundamentalism and, above all, suppress and destroy any shred of nationalism or belief system that doesn't embrace our political ideology. Quite a step from the US public being shepherded into intimidation by possible Iraqi WMDs to genocide peeking out from under our civilized facade.\n\n Don't get me wrong, I am all for letting sleeping dogs lie. But, and if, we are going to do this stupid little dance, let's get the right music playing.", 
   {}, 
   67109, 
   null, 
   1095273180.0
  ], 
  [
   67118, 
   null, 
   "georged", 
   "Don't get me wrong, I am all for letting sleeping dogs lie. But, and if, we are going to do this stupid little dance, let's get the right music playing.\n\n \n Won't happen. Naked hate is always concealed behind rationalizations. Most of the public was ignorant of our past ME presence and assistance with oppression of those nations and prefers to retain that mindset. Few could even find it on a world map. The 9/11 attack has been spun as an aggressive, unwarranted attack on our nation, not the retaliation it actually was. After the failure in Afghanistan and our fear of riling Pakistan, Iraq spin has gone from WMDs to freeing the Iraqis from a tyrannical dictator to instilling democracy to those ungrateful Muslim extremist foreigners killing our troops. Our internal propoganda comes from the finest and most effective advertising machine in the world. Once a pack of dogs smells blood, all formal training disappears.", 
   {}, 
   67113, 
   null, 
   1095275100.0
  ], 
  [
   67648, 
   null, 
   "Haulingboat", 
   "I pointed out the term \"Japs\" is offensive to some people. Now I'm in bed with Osama?\n\n Hhhhhhhhhhmmmmmmm,...................No.", 
   {}, 
   67084, 
   null, 
   1095631860.0
  ], 
  [
   67650, 
   null, 
   "Haulingboat", 
   "If your post did not mean to imply that the US should follow a harsher stance in Iraq or Afghanistan, then I will retract the statement.\n \n \n \n It was this part of the statement, that lead me to believe that you wished to use Russian methods used in Chechnya, in Iraq Afghanistan and Pakistan. If I miss read it I apologize. Could you then clarify what you meant?\n\n \n \n Sure I'd be glad too.\n The point was that we should have Killed Al Sadr in Fallujha the first time we took the city. Instead, we smacked them around a bit patted them on the butt and sent them back on to the playground. If we had utilized the sledge hammer Al Sadr would be dead and we would not be there fighting the same battle over again. \n \n As far a Pakistan goes, If they were a true ally then why don't they allow us to go into THEIR mountains where Osama is thought to be hiding and squash him with the sledge hammer? \n \n Genocide is wrong. No one can justify genocide.\n \n My point was, Russia doesn't mind ruffling a few feathers in order to draw a conclusion. I think we could take a lesson or two from them on this issue. Not genocide.", 
   {}, 
   67036, 
   null, 
   1095632580.0
  ], 
  [
   67656, 
   null, 
   "lord tammerlain", 
   "Sure I'd be glad too.\n The point was that we should have Killed Al Sadr in Fallujha the first time we took the city. Instead, we smacked them around a bit patted them on the butt and sent them back on to the playground. If we had utilized the sledge hammer Al Sadr would be dead and we would not be there fighting the same battle over again. \n \n As far a Pakistan goes, If they were a true ally then why don't they allow us to go into THEIR mountains where Osama is thought to be hiding and squash him with the sledge hammer? \n \n Genocide is wrong. No one can justify genocide.\n \n My point was, Russia doesn't mind ruffling a few feathers in order to draw a conclusion. I think we could take a lesson or two from them on this issue. Not genocide.\n\n \n A few errors, Sadr is a Shiite Cleric who was staying Najaf, for the most part. Killing Sadr would drive moderate/hard leaning Shiites who normally follow Sistani over the edge towards the resistance. It would not get rid of the problem but maka a martyr out of him.\n \n Fallujha, is a Sunni stronghold, supposedly where the Jordanian guy with one leg is hold out. Overall if the goal is to create a democracy is it not better to have the Iraqi people like you, then to hate you for killing their people.", 
   {}, 
   67650, 
   null, 
   1095635340.0
  ], 
  [
   67894, 
   null, 
   "Haulingboat", 
   "A few errors, Sadr is a Shiite Cleric who was staying Najaf, for the most part. Killing Sadr would drive moderate/hard leaning Shiites who normally follow Sistani over the edge towards the resistance. It would not get rid of the problem but maka a martyr out of him.\n \n Fallujha, is a Sunni stronghold, supposedly where the Jordanian guy with one leg is hold out. Overall if the goal is to create a democracy is it not better to have the Iraqi people like you, then to hate you for killing their people.\n\n Thanks for the correction. I get my terrorist thugs confused sometimes. Perhaps we need baseball card collectibles.\n \n You have missed my point completely. Do you think they would have missed an oppurtunuty to kill Bush, Powell, or Franks when any of them were there? Do you think they would be concerned about the American populas opinion? Hell no! They would have taken the shot. You win wars by beating the enemy not appeasing the citizens. Would you have sent the Americans to the beach of Normandy and told them not to kill Germans? How about he Japanese? \n \n The Iraqi citizens will be happy when the Amercans are gone and they no longer live under dictatorship. The faster we squash the enemy the faster the citizenery can get on with living.", 
   {}, 
   67656, 
   null, 
   1095800040.0
  ], 
  [
   67897, 
   null, 
   "lord tammerlain", 
   "Thanks for the correction. I get my terrorist thugs confused sometimes. Perhaps we need baseball card collectibles.\n \n You have missed my point completely. Do you think they would have missed an oppurtunuty to kill Bush, Powell, or Franks when any of them were there? Do you think they would be concerned about the American populas opinion? Hell no! They would have taken the shot. You win wars by beating the enemy not appeasing the citizens. Would you have sent the Americans to the beach of Normandy and told them not to kill Germans? How about he Japanese? \n \n The Iraqi citizens will be happy when the Amercans are gone and they no longer live under dictatorship. The faster we squash the enemy the faster the citizenery can get on with living.\n\n \n \n I didnt miss your point I just dissagree with it. While the Iraqi resistance would not miss a chance at Franks or Bush, if the Iraqi had killed either one the US would have poured more military force into Iraq, correct? If the US had killed Sadr, who is a religious cleric of the Shiite sect, what do you think many of the Shiite Iraqis would have done? I believe that they would at the very least have more sympathy for the resistance, if not join or directly help it. This would not have been a good thing for Iraq as it would have led to more destablization. \n \n By waiting and allowing Iraqi troops when they are ready to take on the insurgents, fewer Iraqis will join the resistance because it will be a Iraqi vs Iraqi instead of Iraqi vs foreign invader.\n \n Dont forget the US is the agressor here, with the stated goal (at least now) of bringing democracy to Iraq. If the Iraqis hate their government and hate the US after the newly elected democratic government is elected, the new government wont last and Iraqi \"freedom\" will be long forgotten.", 
   {}, 
   67894, 
   null, 
   1095801840.0
  ], 
  [
   67898, 
   null, 
   "georged", 
   "The Iraqi citizens will be happy when the Amercans are gone and they no longer live under dictatorship. The faster we squash the enemy the faster the citizenery can get on with living.\n\n \n So we're back to the genocide solution? That 'enemy' is Iraqi citizens rebelling against a US puppet government. Ghazi al-Yawer, the interim president of Iraq, was living in the UK and US for an extended period of time until he returned to Iraq after the invasion and occupation in 2003. A Westernized Sunni, he represents everything the Shia, the majority in Iraq, despise. Iraqis have a lifetime of waiting to 'get on with living' under our occupation. Then there's the upcoming civil war.", 
   {}, 
   67894, 
   null, 
   1095801840.0
  ], 
  [
   67912, 
   null, 
   "Haulingboat", 
   "So we're back to the genocide solution? That 'enemy' is Iraqi citizens rebelling against a US puppet government. Ghazi al-Yawer, the interim president of Iraq, was living in the UK and US for an extended period of time until he returned to Iraq after the invasion and occupation in 2003. A Westernized Sunni, he represents everything the Shia, the majority in Iraq, despise. Iraqis have a lifetime of waiting to 'get on with living' under our occupation. Then there's the upcoming civil war.\n\n \n \n Every single post you make is doom and gloom. What would you suggest we do? Perhaps fold up shop there as well as here back home. We can give the key to the country to the muslum terrorists and North Koreans and bow out of our lives as we know it. Perhaps the Mexicans could use some good house slaves.", 
   {}, 
   67898, 
   null, 
   1095804060.0
  ], 
  [
   67956, 
   null, 
   "georged", 
   "Every single post you make is doom and gloom. What would you suggest we do? Perhaps fold up shop there as well as here back home. We can give the key to the country to the muslum terrorists and North Koreans and bow out of our lives as we know it. Perhaps the Mexicans could use some good house slaves.\n\n \n Write the check and leave. There's nothing there for us but death and building additional hatred of Americans. We have the military capability to defend ourselves against any enemy in the world, except those who want us out of their countries. If more Americans would admit they've been conned by a special interest driven government we might begin cleaning house, but that won't happen. \n \n I'm doom and gloom regarding both our foreign and domestic economic policies. They're both detrimental to our moral and financial strength. I'm old enough to have a lot to lose and see no signs of any government fiscal responsibility. I won't pay the piper with a future crushing tax load in a total service economy like younger people, but it really ****** me off to watch my dollars devaluate at such a rapid rate because of uncontrolled government growth and military spending. We'll be defeated not by random attacks or conventional war, but financially bled out.", 
   {}, 
   67912, 
   null, 
   1095818340.0
  ], 
  [
   68291, 
   null, 
   "Haulingboat", 
   "Write the check and leave. There's nothing there for us but death and building additional hatred of Americans. We have the military capability to defend ourselves against any enemy in the world, except those who want us out of their countries. If more Americans would admit they've been conned by a special interest driven government we might begin cleaning house, but that won't happen. \n \n I'm doom and gloom regarding both our foreign and domestic economic policies. They're both detrimental to our moral and financial strength. I'm old enough to have a lot to lose and see no signs of any government fiscal responsibility. I won't pay the piper with a future crushing tax load in a total service economy like younger people, but it really ****** me off to watch my dollars devaluate at such a rapid rate because of uncontrolled government growth and military spending. We'll be defeated not by random attacks or conventional war, but financially bled out.\n\n \n Regardless of whether we like it or not we are in Iraq. If we do as you suggest and wrap up shop and leave, what is to come of the citizens left behind? If we pull out now before assisting a government set up and some kind of control the Iraqi citizens will wind up under the direction of another Saddam with a new name.\n I agree with your premise. Lets get out ASAP. But writting a check and waltzing out will result in a replay of the aftermath of the last exit.\n \n Our objectives of this war were to eliminate the threat of WMDs and make Iraq an ally instead of a terrorist breeding ground. We have established the WMD mission, not exactly the way it was sold to us but none the less. Now we need to finish the rest and leave. I am not promoting genocide. I am promoting the death of the small bands of trouble makers, establishing a government that can rule the country and fight its own wars and then bring the boys and girls home. \n \n The small band of trouble makers and the Iraqi public are two diffrent things. The trouble makers support the Saddam way of doing things, tyrany and oppression. I can't believe that is what the citizens want.\n \n I agree with your position on government spending. Bush is a big spender. I do not agree with many of the decisions he has made concerning the issue. The prescription medicare bill is a joke. No one is signing up for cards. We are pouring money into a system that has to be force fed to the public. \n \n The Iraq situation is expensive. However, it does have an end. National health care, propossed by Kerry, on the other hand is endless. Once given to the public no one will be able to take it back. It will be a never ending drag on the economy much like social security.\n \n Both world wars and the cold war were also a drag on the American economy. People have watched their dollars \"devaluate\" during recessions resulting from a variety of different reasons. This is no different. The economy can not be in constant state of incline. It must experience periods of correction. These periods of correction end with periods of prosperity. And the cycle goes on. A president does not control the ups and downs, he can only hedge against them.\n \n I don't know your age or your monitary situation. If this peiod of correction has fallen in an inconvienent time in relation to your retirement/investment situation, then I suggest you do what the rest of us looking forward to those years are doing, and look for different investments.", 
   {}, 
   67956, 
   null, 
   1096049040.0
  ], 
  [
   68300, 
   null, 
   "georged", 
   "Regardless of whether we like it or not we are in Iraq. If we do as you suggest and wrap up shop and leave, what is to come of the citizens left behind? If we pull out now before assisting a government set up and some kind of control the Iraqi citizens will wind up under the direction of another Saddam with a new name.\n I agree with your premise. Lets get out ASAP. But writting a check and waltzing out will result in a replay of the aftermath of the last exit.\n \n Our objectives of this war were to eliminate the threat of WMDs and make Iraq an ally instead of a terrorist breeding ground. We have established the WMD mission, not exactly the way it was sold to us but none the less. Now we need to finish the rest and leave. I am not promoting genocide. I am promoting the death of the small bands of trouble makers, establishing a government that can rule the country and fight its own wars and then bring the boys and girls home. \n \n The small band of trouble makers and the Iraqi public are two diffrent things. The trouble makers support the Saddam way of doing things, tyrany and oppression. I can't believe that is what the citizens want.\n \n I agree with your position on government spending. Bush is a big spender. I do not agree with many of the decisions he has made concerning the issue. The prescription medicare bill is a joke. No one is signing up for cards. We are pouring money into a system that has to be force fed to the public. \n \n The Iraq situation is expensive. However, it does have an end. National health care, propossed by Kerry, on the other hand is endless. Once given to the public no one will be able to take it back. It will be a never ending drag on the economy much like social security.\n \n Both world wars and the cold war were also a drag on the American economy. People have watched their dollars \"devaluate\" during recessions resulting from a variety of different reasons. This is no different. The economy can not be in constant state of incline. It must experience periods of correction. These periods of correction end with periods of prosperity. And the cycle goes on. A president does not control the ups and downs, he can only hedge against them.\n \n I don't know your age or your monitary situation. If this peiod of correction has fallen in an inconvienent time in relation to your retirement/investment situation, then I suggest you do what the rest of us looking forward to those years are doing, and look for different investments.\n\n \n I spent a long career in private finance, mostly on the treasury side, and don't consider our current economic circumstances a period of correction. We're in decline due to a change from industrial king of the hill to service economy. While I'm in a position to take advantage of lower priced help for domestic purposes and other services, I don't have to like an administration using a war started under deceptive reasons that expands government, shoots the price of oil up and polishes their GDP for public consumption. Especially when I made the mistake of voting for them. With regard to investments, a deteriorating dollar adversly affects any US investment and the purchasing power of wage earners. There's no fixing that one. Young people are in for a real financial beating.", 
   {}, 
   68291, 
   null, 
   1096050780.0
  ], 
  [
   68305, 
   null, 
   "Haulingboat", 
   "I spent a long career in private finance, mostly on the treasury side, and don't consider our current economic circumstances a period of correction. We're in decline due to a change from industrial king of the hill to service economy. While I'm in a position to take advantage of lower priced help for domestic purposes and other services, I don't have to like an administration using a war started under deceptive reasons that expands government, shoots the price of oil up and polishes their GDP for public consumption. Especially when I made the mistake of voting for them. With regard to investments, a deteriorating dollar adversly affects any US investment and the purchasing power of wage earners. There's no fixing that one. Young people are in for a real financial beating.\n\n You are absoluetly right, you don't have to like them.\n \n Do you believe:\n George purposley decieved us? Was he out for revenge?\n \n George is personally responsible for increasing oil prices? We have been living with extremely low fuel prices for some time when compared to other civilized nations. I recently had a man from the UK in to purchase a boat. He demanded diesels due the $7/per gallon price tag on gasoline back home. Gas prices have not changed much over the years. Don't you think a $10 increase in the price of a barrell is one of the corrections I mentioned before?", 
   {}, 
   68300, 
   null, 
   1096051980.0
  ], 
  [
   68310, 
   null, 
   "georged", 
   "You are absoluetly right, you don't have to like them.\n \n Do you believe:\n George purposley decieved us? Was he out for revenge?\n \n George is personally responsible for increasing oil prices? We have been living with extremely low fuel prices for some time when compared to other civilized nations. I recently had a man from the UK in to purchase a boat. He demanded diesels due the $7/per gallon price tag on gasoline back home. Gas prices have not changed much over the years. Don't you think a $10 increase in the price of a barrell is one of the corrections I mentioned before?\n\n \n All commodity pricing is based on supply and demand. When supply is reduced or endangered, prices go up. The majority of price increases driving oil up have been due to ME unrest created by our support of Israel and occupation of Iraq, which threaten Saudi supplies. We recently saw a small spike from the Gulf hurricanes reducing production, a prime example of commodity pricing. Venezuela's problems have always created some fluctuation in oil prices, and Russia's political situation with their largest producer caused a brief spike, but nothing like what we've experienced in the past year from our Iraq adventure. Future contracts are based on supplying the commodity, not the pricing. When it looks as if production stands a chance of being reduced, futures holders bid the price up to ensure they can meet their obligations or wind up holding the bag. Oil prices have increased from $32/barrel before we invaded Iraq to a current $47/barrel, a 32% increase. When you refer to market corrections, 32% is way beyond normal fluctuations, that's a definite change with a definable cause.", 
   {}, 
   68305, 
   null, 
   1096053660.0
  ], 
  [
   68333, 
   null, 
   "Haulingboat", 
   "All commodity pricing is based on supply and demand. When supply is reduced or endangered, prices go up. The majority of price increases driving oil up have been due to ME unrest created by our support of Israel and occupation of Iraq, which threaten Saudi supplies. We recently saw a small spike from the Gulf hurricanes reducing production, a prime example of commodity pricing. Venezuela's problems have always created some fluctuation in oil prices, and Russia's political situation with their largest producer caused a brief spike, but nothing like what we've experienced in the past year from our Iraq adventure. Future contracts are based on supplying the commodity, not the pricing. When it looks as if production stands a chance of being reduced, futures holders bid the price up to ensure they can meet their obligations or wind up holding the bag. Oil prices have increased from $32/barrel before we invaded Iraq to a current $47/barrel, a 32% increase. When you refer to market corrections, 32% is way beyond normal fluctuations, that's a definite change with a definable cause.\n\n \n Ok, so your not blaming it on Bush. Or what a minute you kind of are blaming him. Which is it? Ok you don't have to answer that. The hurricanes along with the South Americans and the Russian's and Bush's Iraq policy combined together made for a jump in prices. In the post before your last one you put it squarely on Bush's shoulders.\n \n Now about the deception. Do you think he did that intentionally?", 
   {}, 
   68310, 
   null, 
   1096062420.0
  ], 
  [
   68339, 
   null, 
   "georged", 
   "Ok, so your not blaming it on Bush. Or what a minute you kind of are blaming him. Which is it? Ok you don't have to answer that. The hurricanes along with the South Americans and the Russian's and Bush's Iraq policy combined together made for a jump in prices. In the post before your last one you put it squarely on Bush's shoulders.\n \n Now about the deception. Do you think he did that intentionally?\n\n \n We were and are 90% of the cause of oil price increases. We're also the single largest oil consumer. Bush is our leader. Where does the buck stop in this administration? \n \n Of all the politicians I've ever known personally and professionally, none did anything without carefully designed intent. Cheney strikes me as the type of person who carefully calculates and recalculates every move he makes.", 
   {}, 
   68333, 
   null, 
   1096063800.0
  ], 
  [
   68344, 
   null, 
   "Haulingboat", 
   "We were and are 90% of the cause of oil price increases. We're also the single largest oil consumer. Bush is our leader. Where does the buck stop in this administration? \n \n Of all the politicians I've ever known personally and professionally, none did anything without carefully designed intent. Cheney strikes me as the type of person who carefully calculates and recalculates every move he makes.\n\n Yes we are the largest oil consumers in the world. The rich Saudi oil guardians would be wise to remember that fact. They control the price of oil far more than Bush does. If they were our true allies they would kick up production a bit while we fixed the mess right next door to them.\n \n Us being in Iraq plays its part, granted, but its far less than 90% of the factor IMHO.\n \n \n Now about that deception. Do you think he did that on purpose?", 
   {}, 
   68339, 
   null, 
   1096066560.0
  ], 
  [
   68346, 
   null, 
   "lord tammerlain", 
   "Saudi Arabia is pretty much maxed out. The only spare cap is from medium grades of oil, which require more refining, which is a problem due to lack of refining capacity.", 
   {}, 
   68344, 
   null, 
   1096067040.0
  ], 
  [
   68350, 
   null, 
   "Waxy", 
   "Yes we are the largest oil consumers in the world. The rich Saudi oil guardians would be wise to remember that fact. They control the price of oil far more than Bush does. If they were our true allies they would kick up production a bit while we fixed the mess right next door to them. \n\n \n I think this is a common misconception. \n \n The oil fields of the ME and other OPEC regions are amazing, but you can't just turn the dial from 1 to 10 according to your whims and have instant production control. There are way too many factors involved, ranging anywhere from the rock itself to refining and transport.\n \n The other misconception IMHO is the power that OPEC actually wields. We've seen plenty of OPEC announcements lately, have you seen any impact on oil prices? \n \n The fear mongers on Wall Street have a lot more to do with the price than OPEC.\n \n Waxy", 
   {}, 
   68344, 
   null, 
   1096068120.0
  ], 
  [
   68353, 
   null, 
   "Haulingboat", 
   "I think this is a common misconception. \n \n The oil fields of the ME and other OPEC regions are amazing, but you can't just turn the dial from 1 to 10 according to your whims and have instant production control. There are way too many factors involved, ranging anywhere from the rock itself to refining and transport.\n \n The other misconception IMHO is the power that OPEC actually wields. We've seen plenty of OPEC announcements lately, have you seen any impact on oil prices? \n \n The fear mongers on Wall Street have a lot more to do with the price than OPEC.\n \n Waxy\n\n \n Or Bush emoticon_xgood", 
   {}, 
   68350, 
   null, 
   1096068780.0
  ], 
  [
   68355, 
   null, 
   "georged", 
   "\n \n The fear mongers on Wall Street have a lot more to do with the price than OPEC.\n \n Waxy\n\n \n Exactly. Any commodity, and especially oil in these times, is priced by supplt and demand. If the supply is threatened, imagined or real, any trader who doesn't bid it up to cover his/her committments will soon be panhandling for change.", 
   {}, 
   68350, 
   null, 
   1096068900.0
  ], 
  [
   68362, 
   null, 
   "Haulingboat", 
   "Exactly. Any commodity, and especially oil in these times, is priced by supplt and demand. If the supply is threatened, imagined or real, any trader who doesn't bid it up to cover his/her committments will soon be panhandling for change.\n\n \n \n That leaves us to believe that the media has a tremendous influence on prices as well. If the fear mongers are driving prices based on the news out of Iraq, then we should be supporting news agencies that report positive news. Lets hear about the new schools and new civil rights of the Iraqis. Let's hear about the great number of people that come to join the police force and defend the new country instead of focusing on the bombers that want them destroyed. \n \n How about reporting on the new economy in Iraq and new options for all the citizens now that Sadaam is out. How about reporting the diligence of the Iraqis repairing the oil lines after Terrorists blow them up, instead of making up forged documents and trying to unseat the current president. How about working towards the advancement of America when we can instead of shooting ourselves in the foot because we don't like republicans.\n \n Just a thought.", 
   {}, 
   68355, 
   null, 
   1096070340.0
  ], 
  [
   68369, 
   null, 
   "Waxy", 
   "That leaves us to believe that the media has a tremendous influence on prices as well. If the fear mongers are driving prices based on the news out of Iraq, then we should be supporting news agencies that report positive news. Lets hear about the new schools and new civil rights of the Iraqis. Let's hear about the great number of people that come to join the police force and defend the new country instead of focusing on the bombers that want them destroyed. \n \n How about reporting on the new economy in Iraq and new options for all the citizens now that Sadaam is out. How about reporting the diligence of the Iraqis repairing the oil lines after Terrorists blow them up, instead of making up forged documents and trying to unseat the current president. How about working towards the advancement of America when we can instead of shooting ourselves in the foot because we don't like republicans.\n \n Just a thought.\n\n \n I think you give the media way to much credit in your jumping on that conclusion.\n \n Oil traders don't care about human interest stories, and for the most part, I don't think they care whether it's Bush or Kerry. They care about the bottom line, and about covering their own butts in case things do go wrong in a volatile market. They deal with the reality of risk to their assets and commodity, not whether little Raj has new school to go to. Reporting in the US media has very little influence on their assessment of risk in Iraq, Venezuala, etc... to those that actual wield the power, and public opinion of gas prices just isn't that important, if you produce it, they'll buy it.\n \n As a matter of personal interest, I wouldn't mind hearing some good. There has to be some somewhere.\n \n Waxy", 
   {}, 
   68362, 
   null, 
   1096072080.0
  ], 
  [
   68370, 
   null, 
   "Haulingboat", 
   "I think you give the media way to much credit in your jumping on that conclusion.\n \n Oil traders don't care about human interest stories, and for the most part, I don't think they care whether it's Bush or Kerry. They care about the bottom line, and about covering their own butts in case things do go wrong in a volatile market. They deal with the reality of risk to their assets and commodity, not whether little Raj has new school to go to. Reporting in the US media has very little influence on their assessment of risk in Iraq, Venezuala, etc... to those that actual wield the power, and public opinion of gas prices just isn't that important, if you produce it, they'll buy it.\n \n As a matter of personal interest, I wouldn't mind hearing some good. There has to be some somewhere.\n \n Waxy\n\n \n To bad you are not an oil baron.\n \n Oh wait!\n \n J/K emoticon_cool", 
   {}, 
   68369, 
   null, 
   1096072260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Russia -", 
  "url": "http://www.4forums.com/political/current-events-debates/3129-russia.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 3129, 
  "discussion_files": [
   [
    "11240.html", 
    "http://www.4forums.com/political/current-events-debates/3129-russia-print.html"
   ], 
   [
    "11241.html", 
    "http://www.4forums.com/political/current-events-debates/3129-russia-6-print.html"
   ], 
   [
    "11242.html", 
    "http://www.4forums.com/political/current-events-debates/3129-russia-4-print.html"
   ], 
   [
    "11243.html", 
    "http://www.4forums.com/political/current-events-debates/3129-russia-5-print.html"
   ], 
   [
    "11244.html", 
    "http://www.4forums.com/political/current-events-debates/3129-russia-3-print.html"
   ], 
   [
    "11245.html", 
    "http://www.4forums.com/political/current-events-debates/3129-russia-2-print.html"
   ]
  ], 
  "identifier": 3129
 }
]