[
 [
  [
   3638, 
   null, 
   "Debater", 
   "What do you think of the recent Supreme Court decision: Scheidler v. NOW?", 
   {
    "post_info": {
     "post_title": "Scheidler v. NOW?"
    }
   }, 
   null, 
   null, 
   1046545500.0
  ], 
  [
   3648, 
   null, 
   "Crim", 
   "Is this the one about prolife protestors being able to picket clinics?", 
   {}, 
   3638, 
   null, 
   1046547600.0
  ], 
  [
   3652, 
   null, 
   "Debater", 
   "yes", 
   {}, 
   3638, 
   null, 
   1046548080.0
  ], 
  [
   3659, 
   null, 
   "Crim", 
   "Ok. I support the decision then. As long as the people picketing aren't being complete aholes, they have the right to stand there and voice their opinion.", 
   {}, 
   3638, 
   null, 
   1046549280.0
  ], 
  [
   3664, 
   null, 
   "Debater", 
   "Do you think that they are guilty of coercion?\n \n The Court opinion is at: \n http://www.supremecourtus.gov/opinions/02pdf/01-1118.pdf", 
   {}, 
   3638, 
   null, 
   1046549940.0
  ], 
  [
   86340, 
   null, 
   "simone", 
   "If protesters are blocking access to the clinic or getting into the face of approaching patients, I'd call that coercion.", 
   {}, 
   3664, 
   null, 
   1105584000.0
  ], 
  [
   86412, 
   null, 
   "Jessica", 
   "And if they're abusive or threatening that's verbal assault.", 
   {}, 
   86340, 
   null, 
   1105626960.0
  ], 
  [
   86428, 
   null, 
   "jyoshu", 
   "Nope, we have a right to protest in this country, and under no other situation are people allowed to go about an activity completely shielded from hearing protest and opinions of others.\n \n Free speech is alive and well, and your right to abortion doesn't trump it, even if you perceive it as \"coercion\" or \"vebal assault.\"", 
   {}, 
   86412, 
   null, 
   1105632420.0
  ], 
  [
   86443, 
   null, 
   "Sigma", 
   "Nope, we have a right to protest in this country, and under no other situation are people allowed to go about an activity completely shielded from hearing protest and opinions of others.\n \n Free speech is alive and well, and your right to abortion doesn't trump it, even if you perceive it as \"coercion\" or \"vebal assault.\"\n\n \n \nIt is undisputed that peti-tioners interfered with, disrupted, and in some instances completely deprived respondents of their ability to exercise their property rights. Likewise, petitioners' counsel has acknowledged that aspects of his clients' conduct were criminal. But even when their acts of interfer-ence and disruption achieved their ultimate goal of shutting down an abortion clinic, such acts did not constitute extortion because peti-tioners did not \"obtain\" respondents' property.\n\n \n Despite their criminal acts, since they did not \"obtain\" any property, they do not fall under the RICO act.\n \n \n2. Without an underlying RICO violation, the District Court's in-junction must necessarily be vacated. The Court therefore need not address the second question presented-whether a private plaintiff in a civil RICO action is entitled to injunctive relief\n\n \n Somewhat of a technicality. They acknowledge unlawful behavior, but it didn't technically fall under what they were sued for. They should have had an injunction against them for any unlawful behavior. Seems like the Court is dodging the question.\n \n Bah.", 
   {
    "unicode_changes_made": true
   }, 
   86428, 
   null, 
   1105636260.0
  ], 
  [
   86449, 
   null, 
   "simone", 
   "Nope, we have a right to protest in this country, and under no other situation are people allowed to go about an activity completely shielded from hearing protest and opinions of others.\n \n Free speech is alive and well, and your right to abortion doesn't trump it, even if you perceive it as \"coercion\" or \"vebal assault.\"\nI take it that you get off on verbally abusing women and enjoy other methods of abuse. What an interesting mindset!", 
   {}, 
   86428, 
   null, 
   1105639200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Scheidler v. NOW?", 
  "url": "http://www.4forums.com/political/abortion-debates/313-scheidler-v-now.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 313, 
  "discussion_files": [
   [
    "9324.html", 
    "http://www.4forums.com/political/abortion-debates/313-scheidler-v-now-print.html"
   ]
  ], 
  "identifier": 313
 }
]