[
 [
  [
   65975, 
   null, 
   "jskufan", 
   "The US Army has announced they would break up the multibillion dollar logistics contracts in Iraq and rebid them competitively. This comes after \"cost\" differences between the Army and Halliburton and accusations of \"overcharging\". It looks like it took this administration a little longer, but they finally learned what the private sector has known forever; competition is healthy, specifically when it involves the use of tax dollars. emoticon_rolleyes \n \n http://www.msnbc.msn.com/id/5928734/", 
   {
    "post_info": {
     "post_title": "Army to rebid contracts"
    }
   }, 
   null, 
   null, 
   1094602800.0
  ], 
  [
   65997, 
   null, 
   "georged", 
   "Do you think Bechtal and Halliburton will rename the new subs?", 
   {}, 
   65975, 
   null, 
   1094611380.0
  ], 
  [
   66033, 
   null, 
   "lord tammerlain", 
   "Probably, I bet they will be given Arabic names to con the American people into believing that the Iraqi rebuilding is going well to. Like the con job on that the US would pay for the rebuilding and use Iraqi oil for Iraqis, instead of proping up Dick Cheneys retirement.", 
   {}, 
   65997, 
   null, 
   1094658120.0
  ], 
  [
   66079, 
   null, 
   "georged", 
   "Especially since the White House has announced it will shift a portion of the reconstruction funds (I take that to mean the $20-billion approved by congress to rebuild what we destroyed in Iraq) to 'security' for the oil pipelines. Sooner or later all Iraqis will get the message that when it comes to their country, they are not our primary interest.", 
   {}, 
   66033, 
   null, 
   1094676240.0
  ], 
  [
   66095, 
   null, 
   "Broker", 
   "Firstly, there was absolutely no misdeed in assigning Halliburton the no-bid contracts in the first place. It is standard practice and the same thing was done with the same company by the Clinton Administration. Formal bidding processes take too long.\n \n In any case, good. Halliburton has had so many problems overcharging, they don't deserve the contract anymore. After the first few incidents this was warranted.\n \n Better sooner than never.\n \n You can bet Kellog, Brown, & Root is probably going to lose its general services contract next time they bid for it.\n \n \nEspecially since the White House has announced it will shift a portion of the reconstruction funds (I take that to mean the $20-billion approved by congress to rebuild what we destroyed in Iraq) to 'security' for the oil pipelines. Sooner or later all Iraqis will get the message that when it comes to their country, they are not our primary interest.\n \n Since past us that oil is the only money they have, I think it's pretty important that it be protected.\n \n When you export 2 million barrels a day it can be quite helpful.", 
   {}, 
   66079, 
   null, 
   1094678700.0
  ], 
  [
   66108, 
   null, 
   "georged", 
   "Considering they were exporting 3.5mm/barrels/day before sanctions in the '90s and 1.8mm/barrels/day before our invasion (depends on the source, some say over 2mm), I guess appreciation of having one's country devastated and occupied by foreign troops and foreign companies taking all oil industry jobs could be a matter of personal opinion. Under the same circumstances, I wonder how many Americans would put protecting oil needed by China as a priority if we were occupied by the Chinese.", 
   {}, 
   66095, 
   null, 
   1094681040.0
  ], 
  [
   66162, 
   null, 
   "jskufan", 
   "Firstly, there was absolutely no misdeed in assigning Halliburton the no-bid contracts in the first place. It is standard practice and the same thing was done with the same company by the Clinton Administration. Formal bidding processes take too long.\n\n \n Standard practice for what?? Are you implying we have some repetitive history of invading sovereign countries that would establish a pattern of protocol? We set the timeline for the Iraq invasion and it was done on our terms. In the months preceding, I would think there was plenty of time to solicit bids. There's only so many companies that would even qualify to do the work, but they're entitled to bid it since it's being paid for with tax money.\n \n \nIn any case, good. Halliburton has had so many problems overcharging, they don't deserve the contract anymore. After the first few incidents this was warranted.\n\n \n Agreed\n \n \nBetter sooner than never.\n\n \n This is your idea of sooner?\n \n \nYou can bet Kellog, Brown, & Root is probably going to lose its general services contract next time they bid for it.\n\n \n That's the beauty of the bid system, it keeps companies competitive.\n \n \nSince past us that oil is the only money they have, I think it's pretty important that it be protected.\n \n When you export 2 million barrels a day it can be quite helpful.\n\n \n So basically it's come down to Americans putting their lives on the line to protect the Iraqi oil industry? Meanwhile, we're paying some of the highest gas prices in US history.", 
   {}, 
   66095, 
   null, 
   1094689560.0
  ], 
  [
   66172, 
   null, 
   "lord tammerlain", 
   "It also served to help Haliburton avoid bankrupcty. Which before the Iraq war was a very strong possiblity. Part of being a good political/statesmen is avoiding even the appearances of conflict of interest.\n \n In this Dick Cheney has failed miserably, which along with the Haliburton accounting issues heighten the issue even more.", 
   {}, 
   66162, 
   null, 
   1094696820.0
  ], 
  [
   66177, 
   null, 
   "Broker", 
   "Standard practice for what?? Are you implying we have some repetitive history of invading sovereign countries that would establish a pattern of protocol? We set the timeline for the Iraq invasion and it was done on our terms. In the months preceding, I would think there was plenty of time to solicit bids. There's only so many companies that would even qualify to do the work, but they're entitled to bid it since it's being paid for with tax money.\n \n \n Kellog, Brown, & Root won the general services contract. Whenever there is a deployment temporary, no-bid contracts are issued to supplment this contract since it doesn't cover everything. That's what always happens.\n \n \nSo basically it's come down to Americans putting their lives on the line to protect the Iraqi oil industry? Meanwhile, we're paying some of the highest gas prices in US history.\n \n \n Unless you want to leave them with nothing when our money runs out, yes.\n \n And adjusted for inflation, gas prices aren't any higher than they've ever been. They're high, but as long as there's terrorism oil will trade with a terrorism premium.", 
   {}, 
   66172, 
   null, 
   1094700300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Army to rebid contracts", 
  "url": "http://www.4forums.com/political/news-forum/3133-army-rebid-contracts.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 3133, 
  "discussion_files": [
   [
    "31394.html", 
    "http://www.4forums.com/political/news-forum/3133-army-rebid-contracts-print.html"
   ]
  ], 
  "identifier": 3133
 }
]