[
 [
  [
   66054, 
   null, 
   "Bush Is The Man", 
   "I know Kerry's flip flopping has been a big issue and has many posts on this forum. However (all kidding aside), doesn't his many stances on one of the biggest issues in the election turn some people off to voting for him? First he voted to authorize power to go into Iraq, then he defended it, then he said he wouldn't have done it, then he said knowing what we know now he would have went into Iraq, and then the other day he says it was the \"W\"rong war at the \"W\"rong time. The war in Iraq is one of the biggest issues in this election, and Kerry cannot seem to pin down a concrete stance on it. \n \n I would like this thread to just address the issue of whether or not his complete change in stances on the war in Iraq causes some voters to shy away from him, rather than people addressing his many flip flops.", 
   {
    "post_info": {
     "post_title": "Can anyone honestly take Kerry seriously?"
    }
   }, 
   null, 
   null, 
   1094664120.0
  ], 
  [
   66058, 
   null, 
   "Freedom_Fighter", 
   "As an unaffliated voter I find John Kerry's many positions on the Iraq debate discomforting. As many of the people who regularly post on this website know, you simply can't change positions multiple times on a certain issue over a relatively short period of time. You risk totally losing support for your stance because people can't rely on you to stand firm on your position regardless of what that position might be. Everyone can respect a person who takes and stance based on what they believe is right and then stands firm. Even if you think their stance is completely wrong you must admit that having a stance is better than ambiguity. \n \n People change their opnions over time as new information is presented to them but Kerry takes opposing sides of an important issue far to often for my liking. When someone asks you what you think about ____? Your answer should be what you think. If your answer changes twice in one month then you need to seriously start wondering if you really posses any convictions at all.", 
   {}, 
   66054, 
   null, 
   1094666400.0
  ], 
  [
   66164, 
   null, 
   "pnac=ww3", 
   "The problem with John Kerry is that he's got no \"game.\" \n \n He was going to try to run his campaign based on the fact that he was in Vietnam for 4 months and that he \"turns his boat into the fight.\" This was going to be his stupid mantra. The Bushies are master spinners, better than anyone has ever seen. They managed to diffuse that already wimpy, stupid mantra before anyone even knew about it by using the Swifties. \n \n Then I can't believe Kerry would be so stupid to fall into the Bushies trap.\n The asked a no-win question. \"Would you vote the same way?\"\n Answer no: \"See, he's a flipper just like we've been saying. We started saying that just so we can ask this question and he could answer no.\"\n \n Answer yes: \"I'm glad to see the opponent would do exactly the way I did.\"\n \n The DUMBASS actually answered the question in a very usable sound byte with the worse of the two answers.\n \n The correct answer was \"No! Knowing what I know now about how Bush abused the power we gave him, I would not vote the same way.\"\n That way it's technically not a flip-flop, but recognizing you made a mistake trusting the opponent. Jesus Christ how hard was that?", 
   {}, 
   66058, 
   null, 
   1094689980.0
  ], 
  [
   66168, 
   null, 
   "Maineiac", 
   "Still looking for the perfect president are we? emoticon_rolleyes Kerry is no better,or worse than Bush at flip-flopping.I don't find the \"flipper\" issue as important as the other issues that need attention. Acording to all accounts Kerry has the lead,but then again,Bush's flipper count has a more direct impact on me,personally through his policies.\n I some ways,I'm glad Bush doesn't flip-flop as much.By voting for him I would be assured 4 years from now my country would be just as dependant on foreign oil,I might get to send not one, but possibly 2, more of my son's of to fight in a country we didn't really need to be in,or I could get to watch how Bush drives the country further into financial ruin with his spending policies. emoticon_xgood", 
   {}, 
   66164, 
   null, 
   1094695020.0
  ], 
  [
   66186, 
   null, 
   "dsadevil", 
   "Biased question, and not particularly accurate either (SURPRISE!)\n \n Kerry supported the war in Iraq, but not how it was executed. That's been a consistent position the entire way through his campaign. It shouldn't be a particularly difficult position to understand.\n \n If I vote to give our local police force the authority to take tougher measures on crime, and they do it by taking two burly cops and slicing random wrists off of the townsfolk, can I not legitimately claim to still support the stance of \"cracking down on crime\" even as I opposed the measures taken?\n \n I'm not a Kerry fan by any means, but on this issue he's right, and he's been pretty consistently right (with a few very notable exceptions).\n \n By contrast, Bush has not articulated a coherent Iraq policy beyond \"we need to stay the course.\" What course is that? Our mission has creeped from WMD destruction to War on Terror to Democratization to Stabilization. I have no idea what constitutes \"success\" in Iraq anymore, and I certainly have no idea how we're going to achieve whatever \"success\" is (beyond \"staying\" which, while I agree is important, certainly is not the SOLE ingridient to success). Bush seems to be redefining success in whatever terms seem feasible at the moment. But he refuses to change tacts to bring his lofty rhetoric to reality. He still has resisted calls for more troops, still has resisted doing anything to reassure the Iraqi's as to the legitimacy of their government, resisted accountability for Abu Gharib and other similar scandels. Despite the fact that Iraq is officially a debacle at the moment, President Bush seems to see no place for a change in strategy. He's \"flipflopping\" worse than Kerry, but yet in the areas where we actually NEED to change, he's being stubborn. That's mindboggling.", 
   {}, 
   66168, 
   null, 
   1094715420.0
  ], 
  [
   66194, 
   null, 
   "Duo_Maxwell", 
   "There is thing as giving too many extra chances as well as throwing good money after bad money. \n \n Bush has consistancy showed his incompetence in dealing with Iraq. He has used up his extra chances. Why would you alllow a proven failure to continue the job for 4 more years?\n \n \n \nIt shouldn't be a particularly difficult position to understand.\n\n \n You'd be suprised. these are the same people who celebrated when the Congressional Budget commite came out with the deficit at $422 billion, not $450 billion. That's still $422 billion too much, in fact, Bush should be building up a surplus to deal with his incompetence in dealing with Medicare and Social Security.", 
   {}, 
   66186, 
   null, 
   1094731380.0
  ], 
  [
   66225, 
   null, 
   "unkerpaulie", 
   "i think maineiac nailed it perfectly. bush is headstrong and stubborn, driving the country into imminent ruin at breakneck speed. kerry is fumbling and guessing his way through this campaign and is destined to follow bush's path blindly. with either at the reigns the direction will be the same\n \n how could anybody with any commonsense figure that the iraqi invasion is actually beneficial to our fight against terrorism?? there are thousands of terrorists being trained throughout sudan, egypt, syria, saudi arabia, yemen, pakistan, the list is long, all of which are capable of actually attacking america. bin laden himself is at large and under the radar, still actively plotting his next attack. we decide to send 150,000 troops into iraq to capture 1 \"terrorist\" that had no means of attacking america whatsoever, and no links to al qaeda.\n \n does anybody actually ever look at the facts? or do we just watch the news and do as we're told?", 
   {}, 
   66194, 
   null, 
   1094745480.0
  ], 
  [
   66251, 
   null, 
   "emclean", 
   "Since we are on the subject of Iraq, what is Kerry's plan, other than to bring home our troops as soon as he can, and to stop the \"back door draft\" (asking reserves to do what they were contracted to do)?", 
   {
    "unicode_changes_made": true
   }, 
   66225, 
   null, 
   1094752440.0
  ], 
  [
   66261, 
   null, 
   "pnac=ww3", 
   "Are they asking?", 
   {}, 
   66251, 
   null, 
   1094754180.0
  ], 
  [
   66262, 
   null, 
   "unkerpaulie", 
   "Since we are on the subject of Iraq, what is Kerry's plan, other than to bring home our troops as soon as he can, and to stop the \"back door draft\" (asking reserves to do what they were contracted to do)?\n\n did kerry actually say he's gonna bring the troops home as soon as he can? because that would be a positive thing, if kerry actually knows what he means by that. i mean how is he going to end this war at all, particularly in the position we are in and after he claimed that he thought the invasion was a good thing?\n \n but if kerry really intends at some point to cease bush's never-ending war, then i think i just changed my mind about him", 
   {
    "unicode_changes_made": true
   }, 
   66251, 
   null, 
   1094754360.0
  ], 
  [
   66269, 
   null, 
   "dsadevil", 
   "The \"backdoor draft\" isn't merely calling up reservists to fight. The backdoor draft is when the army extends the tours of duty for reservists so that they are fighting even after their service was supposed to have concluded. Different issues.\n \n As for Kerry, his position on Iraq (or at least Spencer Ackerman's take on it) can be found here.", 
   {}, 
   66262, 
   null, 
   1094755620.0
  ], 
  [
   66274, 
   null, 
   "emclean", 
   "The key issue on which Kerry's position on Iraq diverges from Bush's is on internationalization. As I've written before, I don't see much hope for foreign troops in any significant number to relieve overburdened U.S. forces. However, Kerry's internationalization strategy doesn't only mean foreign troops. It means a renewed diplomatic push for debt forgiveness and foreign aid that Bush has been unable to produce. While I'm not expecting a President Kerry to hit the foreign-treasury jackpot, it's likely that Kerry could produce at least some diplomatic results that the loathed Bush can't. \n \n ok so Kerry wants the UN to come to the rescue?\n \n \nThe \"backdoor draft\" isn't merely calling up reservists to fight. The backdoor draft is when the army extends the tours of duty for reservists so that they are fighting even after their service was supposed to have concluded. Different issues.\n \n there tour of duty to when the Army says it is over, that is what the contracts say, mine was for no less that 8 years (some active some in-active) but is said that i could be extended per the needs of the army. i knew it going in, and so did the reservists and guards men, if not that if there falut, not the armys.", 
   {}, 
   66269, 
   null, 
   1094756460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Can anyone honestly take Kerry seriously?", 
  "url": "http://www.4forums.com/political/politics-debates/3138-can-anyone-honestly-take-kerry-seriously.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3138, 
  "discussion_files": [
   [
    "8555.html", 
    "http://www.4forums.com/political/politics-debates/3138-can-anyone-honestly-take-kerry-seriously-print.html"
   ]
  ], 
  "identifier": 3138
 }
]