[
 [
  [
   66231, 
   null, 
   "pnac=ww3", 
   "So the ban on assualt weapons (which Bush promised he would uphold in 2000) is about to expire. Even the kits that convert them to fully automatic will be will be legal again. Some say it's because of the political clout of the NRA. Apparently police chiefs across the country are speaking out to keep the ban.\n \n Does the NRA really want assault weapons to be available to everyone? If so, why? Don't they preach responsible gun ownership? Can we trust everyone to be responsible with an SKS or an M-16?", 
   {
    "post_info": {
     "post_title": "Is it really pressure from the NRA?"
    }
   }, 
   null, 
   null, 
   1094748420.0
  ], 
  [
   66243, 
   null, 
   "Bryan", 
   "Since the topic of the month appears to the the sunset of the AW ban, I though I'd cut and past the ban here so everyone can see what it really says: \n \n 1. DEFINITION OF A \"SEMIAUTOMATIC ASSAULT WEAPON\" AND A \"LARGE CAPACITY AMMUNITION FEEDING DEVICE\"--18 U.S.C. § 921 [THIS STATUTE CONTAINS MANY FIREARMS DEFINITIONS, PARAGRAPHS 30 AND 31 WERE ADDED WHEN THE AW BAN WAS ENACTED]: \n \n (30) The term \"semiautomatic assault weapon\" means -\n (A) any of the firearms, or copies or duplicates of the firearms in any caliber, known as -\n (i) Norinco, Mitchell, and Poly Technologies Avtomat Kalashnikovs (all models);\n (ii) Action Arms Israeli Military Industries UZI and Galil;\n (iii) Beretta Ar70 (SC-70);\n (iv) Colt AR-15;\n (v) Fabrique National FN/FAL, FN/LAR, and FNC;\n (vi) SWD M-10, M-11, M-11/9, and M-12;\n (vii) Steyr AUG;\n (viii) INTRATEC TEC-9, TEC-DC9 and TEC-22; and\n (ix) revolving cylinder shotguns, such as (or similar to) the Street Sweeper and Striker 12;\n (B) a semiautomatic rifle that has an ability to accept a detachable magazine and has at least 2 of - [NOTE, THESE ARE THE \"COSMETIC\" FEATURES WHICH NO SEMI-AUTO MAY POSSESS TWO OR MORE OF]\n (i) a folding or telescoping stock;\n (ii) a pistol grip that protrudes conspicuously beneath the action of the weapon;\n (iii) a bayonet mount;\n (iv) a flash suppressor or threaded barrel designed to accommodate a flash suppressor; and\n (v) a grenade launcher;\n (C) a semiautomatic pistol that has an ability to accept a detachable magazine and has at least 2 of -\n (i) an ammunition magazine that attaches to the pistol outside of the pistol grip;\n (ii) a threaded barrel capable of accepting a barrel extender, flash suppressor, forward handgrip, or silencer;\n (iii) a shroud that is attached to, or partially or completely encircles, the barrel and that permits the shooter to hold the firearm with the nontrigger hand without being burned;\n (iv) a manufactured weight of 50 ounces or more when the pistol is unloaded; and\n (v) a semiautomatic version of an automatic firearm; and\n (D) a semiautomatic shotgun that has at least 2 of -\n (i) a folding or telescoping stock;\n (ii) a pistol grip that protrudes conspicuously beneath the action of the weapon;\n (iii) a fixed magazine capacity in excess of 5 rounds; and\n (iv) an ability to accept a detachable magazine.\n (31) The term \"large capacity ammunition feeding device\" -\n (A) means a magazine, belt, drum, feed strip, or similar device manufactured after the date of enactment of the Violent Crime Control and Law Enforcement Act of 1994 that has a capacity of, or that can be readily restored or converted to accept, more than 10 rounds of ammunition; but\n (B) does not include an attached tubular device designed to accept, and capable of operating only with, .22 caliber rimfire ammunition.\n \n 2. THE ASSAULT WEAPON BAN STATUTE-18 U.S.C. § 922 [THE AW BAN ADDED PARAGRAPHS v AND w TO THE EXISTING STATUTE AS WELL AS APPENDIX A)\n \n (v)(1) It shall be unlawful for a person to manufacture, transfer, or possess a semiautomatic assault weapon.\n (2) Paragraph (1) shall not apply to the possession or transfer of any semiautomatic assault weapon otherwise lawfully possessed under Federal law on the date of the enactment of this subsection.\n (3) Paragraph (1) shall not apply to -\n (A) any of the firearms, or replicas or duplicates of the firearms, specified in Appendix A to this section, as such firearms were manufactured on October 1, 1993;\n [NOTE: APPENDIX A IS SEVERAL PAGES LONG, AND I DID NOT INCLUDE IT HERE. IF ANYONE WANTS TO SEE IT, ASK AND I'LL TRY TO POST IT, BUT IT MAY HAVE TO BE BROKEN INTO MORE THAN ONE FOLLOW UP]\n (B) any firearm that -\n (i) is manually operated by bolt, pump, lever, or slide action;\n (ii) has been rendered permanently inoperable; or\n (iii) is an antique firearm;\n (C) any semiautomatic rifle that cannot accept a detachable magazine that holds more than 5 rounds of ammunition; or\n (D) any semiautomatic shotgun that cannot hold more than 5 rounds of ammunition in a fixed or detachable magazine.\n The fact that a firearm is not listed in Appendix A shall not be construed to mean that paragraph (1) applies to such firearm. No firearm exempted by this subsection may be deleted from Appendix A so long as this subsection is in effect.\n (4) Paragraph (1) shall not apply to -\n (A) the manufacture for, transfer to, or possession by the United States or a department or agency of the United States or a State or a department, agency, or political subdivision of a State, or a transfer to or possession by a law enforcement officer employed by such an entity for purposes of law enforcement (whether on or off duty);\n (B) the transfer to a licensee under title I of the Atomic Energy Act of 1954 for purposes of establishing and maintaining an on-site physical protection system and security organization required by Federal law, or possession by an employee or contractor of such licensee on-site for such purposes or off-site for purposes of licensee-authorized training or transportation of nuclear materials;\n (C) the possession, by an individual who is retired from service with a law enforcement agency and is not otherwise prohibited from receiving a firearm, of a semiautomatic assault weapon transferred to the individual by the agency upon such retirement; or\n (D) the manufacture, transfer, or possession of a semiautomatic assault weapon by a licensed manufacturer or licensed importer for the purposes of testing or experimentation authorized by the Secretary.\n (w)(1) Except as provided in paragraph (2), it shall be unlawful for a person to transfer or possess a large capacity ammunition feeding device.\n (2) Paragraph (1) shall not apply to the possession or transfer of any large capacity ammunition feeding device otherwise lawfully possessed on or before the date of the enactment of this subsection.\n (3) This subsection shall not apply to -\n (A) the manufacture for, transfer to, or possession by the United States or a department or agency of the United States or a State or a department, agency, or political subdivision of a State, or a transfer to or possession by a law enforcement officer employed by such an entity for purposes of law enforcement (whether on or off duty);\n (B) the transfer to a licensee under title I of the Atomic Energy Act of 1954 for purposes of establishing and maintaining an on-site physical protection system and security organization required by Federal law, or possession by an employee or contractor of such licensee on-site for such purposes or off-site for purposes of licensee-authorized training or transportation of nuclear materials;\n (C) the possession, by an individual who is retired from service with a law enforcement agency and is not otherwise prohibited from receiving ammunition, of a large capacity ammunition feeding device transferred to the individual by the agency upon such retirement; or\n (D) the manufacture, transfer, or possession of any large capacity ammunition feeding device by a licensed manufacturer or licensed importer for the purposes of testing or experimentation authorized by the Secretary.\n (4) If a person charged with violating paragraph (1) asserts that paragraph (1) does not apply to such person because of paragraph (2) or (3), the Government shall have the burden of proof to show that such paragraph (1) applies to such person. The lack of a serial number as described in section 923(i) of this title shall be a presumption that the large capacity ammunition feeding device is not subject to the prohibition of possession in paragraph (1).", 
   {
    "post_info": {
     "post_title": "The text of the current AW ban"
    }, 
    "unicode_changes_made": true
   }, 
   66231, 
   null, 
   1094751180.0
  ], 
  [
   66264, 
   null, 
   "georged", 
   "So the ban on assualt weapons (which Bush promised he would uphold in 2000) is about to expire. Even the kits that convert them to fully automatic will be will be legal again. Some say it's because of the political clout of the NRA. Apparently police chiefs across the country are speaking out to keep the ban.\n \n Does the NRA really want assault weapons to be available to everyone? If so, why? Don't they preach responsible gun ownership? Can we trust everyone to be responsible with an SKS or an M-16?\n\n \n Can we trust everyone to be responsible with vehicles? Of course not, but that doesn't mean they should be denied. The SKS is a semi-automatic piece while M16s are full or selective full auto burst. Even if the SKS is banned, full-auto M16s are available (up to about $10k since the ban) to anyone who qualifies for a Class 3 permit. All those laws do is increase the market cost of a pre-ban weapon out of the range of the average person. Any criminal or would-be shooter can still easily obtain whatever he/she wants from our ever-expanding underground society. Banning guns is no different than drugs, alcohol or such; legislating morality has been proven impossible on many occasions. All it does is create an easily exploitable market based on demand and without taxation.", 
   {}, 
   66231, 
   null, 
   1094755140.0
  ], 
  [
   66272, 
   null, 
   "emclean", 
   "So the ban on assualt weapons (which Bush promised he would uphold in 2000) is about to expire\n \n how did he not \"uohold\" the ban, congress was unable to sends it to him.\n \nEven the kits that convert them to fully automatic will be will be legal again\n \n this was outlawed by the NFA of '34\n \nSome say it's because of the political clout of the NRA.\n \n the ban in '94 cost the dems 20 seats. no i would say it is clear that most of the country do not see the link of a bayonet mount or a flash suppressor and crime.\n \nApparently police chiefs across the country are speaking out to keep the ban.\n \n some are, some think it was dumb to start with.\n \nCan we trust everyone to be responsible with an SKS or an M-16? \n \n how about just the law abiding citizens", 
   {}, 
   66264, 
   null, 
   1094756100.0
  ], 
  [
   66361, 
   null, 
   "pickleweaseler", 
   "So the ban on assualt weapons (which Bush promised he would uphold in 2000) is about to expire. Even the kits that convert them to fully automatic will be will be legal again.  Some say it's because of the political clout of the NRA. Apparently police chiefs across the country are speaking out to keep the ban.\n \n Does the NRA really want assault weapons to be available to everyone? If so, why? Don't they preach responsible gun ownership? Can we trust everyone to be responsible with an SKS or an M-16?\n\n Wrong Wrong Wrong.\n \n FULL AUTO GUNS (and conversion kits) WILL NOT BE LEGAL TO MANUFACTURE ONCE THE BAN EXPIRES.\n \n Lies like that whopper are one of the main reasons people favor this ban.\n \n FYI: The president can only veto bills once they reach his desk. Blame congress for this bill expiring, not the president.", 
   {}, 
   66231, 
   null, 
   1094775900.0
  ], 
  [
   66370, 
   null, 
   "pnac=ww3", 
   "Can we trust everyone to be responsible with vehicles? Of course not, but that doesn't mean they should be denied. The SKS is a semi-automatic piece while M16s are full or selective full auto burst. Even if the SKS is banned, full-auto M16s are available (up to about $10k since the ban) to anyone who qualifies for a Class 3 permit. All those laws do is increase the market cost of a pre-ban weapon out of the range of the average person. Any criminal or would-be shooter can still easily obtain whatever he/she wants from our ever-expanding underground society. Banning guns is no different than drugs, alcohol or such; legislating morality has been proven impossible on many occasions. All it does is create an easily exploitable market based on demand and without taxation.\n\n \n Cars have another purpose. The ONLY purpose of an AW is to kill and maim.", 
   {}, 
   66264, 
   null, 
   1094778660.0
  ], 
  [
   66371, 
   null, 
   "pnac=ww3", 
   "Wrong Wrong Wrong.\n \n FULL AUTO GUNS (and conversion kits) WILL NOT BE LEGAL TO MANUFACTURE ONCE THE BAN EXPIRES.\n \n Lies like that whopper are one of the main reasons people favor this ban.\n \n FYI: The president can only veto bills once they reach his desk. Blame congress for this bill expiring, not the president.\n\n \n EXCUUUUUUUUUSE ME! It's just what I saw on the 'news'.\n \n Look, I'm not anti-gun ownership, I've got one myself. I just don't see why anyone needs an assault rifle. Sure, maybe someone should have the right to own one, I dunno. I'd like to know what they want to use it for. \n \n Whoever is to blame, the ban needs to be upheld. You can bare arms without their being able to mow down a crowd. At some point people decided where the firepower is too much for the individual citizen. I doubt I can go out and buy an RPG or a AAA setup. \n \n Anyway, the question had to do with the NRA.\n Is this ban expiring due to their work?", 
   {}, 
   66361, 
   null, 
   1094779440.0
  ], 
  [
   66372, 
   null, 
   "pnac=ww3", 
   "I'm sorry that I didn't address Georged's other points that were quite good.\n \n It sounds like the ban needs reworking then if you can buy a burst/auto rifle and not a semi-auto.\n \n If the ban drove up the price of an M-16 to $10k then that's great. That means that Joe Average crack dealer won't be able to buy one (sure he won't have a Class 3 permit, but the price on the black market is always higher than at the store.)", 
   {}, 
   66371, 
   null, 
   1094779680.0
  ], 
  [
   66374, 
   null, 
   "pnac=ww3", 
   "I'm sorry for so many posts in a row.\n \n But this article talks about Bush's stance on the ban:\n \n http://www.oregonlive.com/editorials/oregonian/index.ssf?/base/editorial/1088856233264771.xml\n \n \nWhen a man used an assault rifle to shoot three people at a California community center in 1999, then-presidential candidate George W. Bush declared, \"It makes no sense for assault weapons to be around our society.\"\n\n \nThe White House claims Bush supports extending the ban and would sign a bill renewing the law if Congress sends him one. But earlier this year, Bush helped defeat a gun bill that included the ban on assault weapons. The president also has done nothing to encourage Congress to act on the issue in the dwindling days of this session.\n\n \n \nWhile several studies show a marked decline since 1994 in assault weapons traced to crime, we'll concede that the federal ban has not been a fully effective defense against these guns. The law grandfathered existing assault weapons in 1994, and manufacturers have exploited loopholes in the law by producing copycat weapons with only cosmetic differences.\n \n A responsible Congress, and one not in the thrall of the National Rifle Association, would tighten the law, fix the loopholes and make the ban on these weapons permanent. If that's too much to ask, we'd settle for the president to keep his word on this issue and demand that Congress renew the existing ban on assault weapons. \n\n \n \nEvery major law enforcement organization in the nation backs the ban on assault weapons, including the Fraternal Order of Police, the National Sheriffs' Association and the International Association of Chiefs of Police. Every police agency understands the dangers of these weapons in the hands of drug traffickers, gangs and terrorists.\n\n \n I don't think that these organizations are anti-2nd ammendment.", 
   {}, 
   66372, 
   null, 
   1094780160.0
  ], 
  [
   66382, 
   null, 
   "emclean", 
   "If the ban drove up the price of an M-16 to $10k then that's great. That means that Joe Average crack dealer won't be able to buy one (sure he won't have a Class 3 permit, but the price on the black market is always higher than at the store.)\n \n here is the problem the $10K+ is only for someone wanting to get a full automatac weapon legaly. the illegal guns are cheaper than legal ones.\n \n AAA, or grenade launchers are legal to own, if the gun is bigger than .50 cal, of fires explosives they are \"Destructive Devices\", and are covered by the same laws as a machine gun. If you want a RPG you can buy one, pay the $200 tax stamp, and also have to go through all the paper work, and $200 tax stamp if you want any ammo. \n with the right paper work you can get one.\n I have no problem if someone wants the one registered Mk19 (automatic grenade launcher), after paying the $500,000 for it, if they ever want to fire it they will be very careful not to have it taken away from them.\n \n \nI just don't see why anyone needs an assault rifle.\n \n How about it is a comfortable rifle to fire, low recoil, and easy to maintain. Also my AR type rifle I use to teach others to shoot on, I am familiar with it from my time in service.\n \n Why dose there have to be \"need\" attached? Why not those who can use it safely, and legally.\n \n I have gotten tired of seeing legal gun owners and criminals treated the same way. If a gun is used illegally, punish the person who did it, and leave my collection alone.", 
   {
    "unicode_changes_made": true
   }, 
   66374, 
   null, 
   1094786520.0
  ], 
  [
   66383, 
   null, 
   "pickleweaseler", 
   "pnac, I will not excuse your ignorance.\n \n You obviously don't understand what this law does.\n \n This law did NOT affect the prices of full-auto/burst fire weapons whatsoever. It ONLY applies to semi-autos.\n \n http://www.ont.com/users/kolya/AR15/awc.htm\n The above quiz link will help show what the AWB does.\n \n I suggest learning more before attempting debate.", 
   {}, 
   66382, 
   null, 
   1094790960.0
  ], 
  [
   66407, 
   null, 
   "georged", 
   "It sounds like the ban needs reworking then if you can buy a burst/auto rifle and not a semi-auto.\n \n If the ban drove up the price of an M-16 to $10k then that's great. That means that Joe Average crack dealer won't be able to buy one (sure he won't have a Class 3 permit, but the price on the black market is always higher than at the store.)\n\n \n Unfortunately, with guns that's not the case. A majority of weapons sold in the underground society are considered 'throwaways', discarded after one usage. That's because they're generally obtained in thefts and robberies and the criminal doesn't want to be associated with it for the original crime or one he/she commits using it. As an example, a handgun that retails in the legal market for $600 will typically sell for $2-300. The same is true with assault and full auto pieces. Those folks aren't collectors. \n \n The average dealer in hard drugs normally has far better cash flow than most citizens, so cost isn't actually an issue to anyone but legitimate individuals.\n \n Has the NRA been a significant factor in gun control? Since the ban originally passed with the NRA strongly against it, I'd say no. At this point, the current administration is looking for every possible vote and keeps Gore's big loss of votes for being adamantly anti-gun in the front of their minds.", 
   {}, 
   66372, 
   null, 
   1094821440.0
  ], 
  [
   66468, 
   null, 
   "pnac=ww3", 
   "pnac, I will not excuse your ignorance.\n \n You obviously don't understand what this law does.\n \n This law did NOT affect the prices of full-auto/burst fire weapons whatsoever. It ONLY applies to semi-autos.\n \n http://www.ont.com/users/kolya/AR15/awc.htm\n The above quiz link will help show what the AWB does.\n \n I suggest learning more before attempting debate.\n\n \n Good lord, don't get your panties in a bunch. You act like I'm coming to take your guns away.\n \n No one has answered the original question. (Apologies if it wasn't clear.)\n \n Is the NRA responsible for the death of the ban? This has nothing to do with whether you agree with the ban or not.\n \n And, regardless of black market prices and regular market prices and how much cash flow low-end drug dealers have (which you guys sound like experts on, but it really sounds like you watch too much tv) why would any \"law abiding\" citizen want or need an assault rifle? \n \n Ok, based on that quiz, I'd say the law was a silly one that was in place of a real law that could actually reduce the number of actual assualt weapons in circulation.\n \n Now, do you agree that we need a real law that would actually limit the number of AW's? I'm sure that you don't. You'll probably give all the reasons why ANY gun isn't banned. \"Criminals will always have access.\" That's not really true. If there were no grandfather clause and it banned the manufacture, sale, and possession of all AWs then over time there would be a real reduction in the numbers of these guns in the country. If an AW is used at all, it would most likely be relinquished, as georged said. You guys talk like every petty criminal or drug dealer is Scarface or something and can smuggle guns into the country anytime they want.\n \n Another question. Where would YOU draw the line as to how much firepower the average citizen should have available to him?", 
   {}, 
   66383, 
   null, 
   1094855940.0
  ], 
  [
   66491, 
   null, 
   "pnac=ww3", 
   "durn it, wouldn't ya know it, one of ya did answer the NRA question", 
   {}, 
   66468, 
   null, 
   1094864640.0
  ], 
  [
   66492, 
   null, 
   "emclean", 
   "No one has answered the original question. (Apologies if it wasn't clear.)\n \n i did in post #4 (in with a bit of other stuff)\n \n \nQuote:emclean\n Some say it's because of the political clout of the NRA. \n \n the ban in '94 cost the dems 20 seats. no i would say it is clear that most of the country do not see the link of a bayonet mount or a flash suppressor and crime.\n \n the NRA is not responsible for the death of the ban, the politision relised that banning guns hurt them.\n \n \nNow, do you agree that we need a real law that would actually limit the number of AW's\n \n i do not see a need, what would a ban do?\n \n \nYou guys talk like every petty criminal or drug dealer is Scarface or something and can smuggle guns into the country anytime they want.\n \n even noticed that the dealers can get as much drugs as they can sell, what would lead you to beleve that they could not get illegal objects? with the tuns of drugs coming in to the country every day, how would outlawing guns get them out of the hands of crimanals?\n \n \n \n (which you guys sound like experts on, but it really sounds like you watch too much tv) \n \n nope, just work with people who grew up on the south side of Chicago\n \n \nAnother question. Where would YOU draw the line as to how much firepower the average citizen should have available to him?\n \n i will have no problem with where the lins is on the 14th.\n \n what gun do you have, and why (do you need it)?\n where do you feel the line should be?", 
   {}, 
   66468, 
   null, 
   1094864820.0
  ], 
  [
   66498, 
   null, 
   "pnac=ww3", 
   "i did in post #4 (in with a bit of other stuff)\n \n \n the NRA is not responsible for the death of the ban, the politision relised that banning guns hurt them.\n \n \n i do not see a need, what would a ban do?\n \n \n even noticed that the dealers can get as much drugs as they can sell, what would lead you to beleve that they could not get illegal objects? with the tuns of drugs coming in to the country every day, how would outlawing guns get them out of the hands of crimanals?\n \n \n \n nope, just work with people who grew up on the south side of Chicago\n \n \n i will have no problem with where the lins is on the 14th.\n \n what gun do you have, and why (do you need it)?\n where do you feel the line should be?\n\n \n \n Jesus Christ, I didn't know you could go and buy all the \"destructive devices\" you want!\n http://www.gunsamerica.com/1244/1244-random-1.htm\n But you can't buy the grenades for it? Apparently you can't buy hand grenades.\n http://www.ahwatukee.com/afn/crime/articles/040730a.html\n \n I have a 9mm. I bought it after an \"incident\" about 6 years ago where some kids broke through my living room window and pointed a shotgun at me telling me to open the door. I ran to the other room and dialed 911 while they started to kick at my door (thankfully it was steel in a steel frame) and smash out my window. I felt helpless and was. Thank god the cops weren't very far and got there in about a minute (the kids ran off never to be caught). The next day I bought the gun from a friend. \n \n Now, that gun is plenty. If something like that happens again I will \"feel\" like I have some power over the situation. I do not need an AK-47 to defend my home.\n \n Actually I couldn't tell you what a ban would do because I don't know how many crimes lately have been committed using AWs. I remember though, before 1994, that gang violence was a big problem and now it's not so big. This is most likely NOT due to the silly ban that was in place.\n \n Ok, so I must concede.\n (Actually I don't know why, except that I started arguing about something that wasn't in my first post.)\n It's difficult to perceive what an actual ban on actual AWs would do because we've never had it (and I don't think we currently have a problem with AWs). So all a ban would do is keep people from buying them and playing with them as toys. By all means, we can't have that. (Also, in the rare instance that a revolution or revolt actually sprang up in this country we'd have to die with real guns in our hands and not paltry ones. [since we'd never win if it were civilians against the military.]) \n So you win. (I think.)", 
   {}, 
   66492, 
   null, 
   1094867340.0
  ], 
  [
   66508, 
   null, 
   "tarawa12", 
   "Jesus Christ, I didn't know you could go and buy all the \"destructive devices\" you want!\n http://www.gunsamerica.com/1244/1244-random-1.htm\n But you can't buy the grenades for it? Apparently you can't buy hand grenades.\n http://www.ahwatukee.com/afn/crime/articles/040730a.html\n \n I have a 9mm. I bought it after an \"incident\" about 6 years ago where some kids broke through my living room window and pointed a shotgun at me telling me to open the door. I ran to the other room and dialed 911 while they started to kick at my door (thankfully it was steel in a steel frame) and smash out my window. I felt helpless and was. Thank god the cops weren't very far and got there in about a minute (the kids ran off never to be caught). The next day I bought the gun from a friend. \n \n Now, that gun is plenty. If something like that happens again I will \"feel\" like I have some power over the situation. I do not need an AK-47 to defend my home.\n \n Actually I couldn't tell you what a ban would do because I don't know how many crimes lately have been committed using AWs. I remember though, before 1994, that gang violence was a big problem and now it's not so big. This is most likely NOT due to the silly ban that was in place.\n \n Ok, so I must concede.\n (Actually I don't know why, except that I started arguing about something that wasn't in my first post.)\n It's difficult to perceive what an actual ban on actual AWs would do because we've never had it (and I don't think we currently have a problem with AWs). So all a ban would do is keep people from buying them and playing with them as toys. By all means, we can't have that. (Also, in the rare instance that a revolution or revolt actually sprang up in this country we'd have to die with real guns in our hands and not paltry ones. [since we'd never win if it were civilians against the military.]) \n So you win. (I think.)\n\n \n \n Many so called \"AWs\" as also used in competition in marksmanship across the US.\n \n The biggest reason for the law was to get people used to being limeted in what they could own so in the future it would be easier to enact a new larger more restrictive law.\n \n Considering AW's were used in ~1% of crime...I never saw a great danger in them when mechanically they are no different than many other non-banned rifles.", 
   {}, 
   66498, 
   null, 
   1094869980.0
  ], 
  [
   66519, 
   null, 
   "RooK", 
   "\n Now, that gun is plenty. If something like that happens again I will \"feel\" like I have some power over the situation. I do not need an AK-47 to defend my home.\n\n \n There is an old saying: Never bring a handgun to a gun fight. Police have their own \"assault rifles\" and shotguns they use when they know they are going into trouble. The only purpose a sidearm serves is portability. I would personally tell you to at least pick up a short 12 gauge shotgun. A 9mm is borderline for effectivness when it comes to stopping an opponent. If you want to protect yourself, please apply the maximum force necessary.\n \n \nActually I couldn't tell you what a ban would do because I don't know how many crimes lately have been committed using AWs. I remember though, before 1994, that gang violence was a big problem and now it's not so big. This is most likely NOT due to the silly ban that was in place.\n\n \n They never have been used in crimes to any degree. Most crimes (80%+) are committed with cheap handguns in the .25acp or .380acp chambering. Usually Lorcins, Brycos and Jennings. Criminals want small, affordable, concealable weapons.\n \n \nOk, so I must concede.\n (Actually I don't know why, except that I started arguing about something that wasn't in my first post.)\n It's difficult to perceive what an actual ban on actual AWs would do because we've never had it (and I don't think we currently have a problem with AWs). So all a ban would do is keep people from buying them and playing with them as toys. By all means, we can't have that. (Also, in the rare instance that a revolution or revolt actually sprang up in this country we'd have to die with real guns in our hands and not paltry ones. [since we'd never win if it were civilians against the military.]) \n So you win. (I think.)\n\n \n You may think the features in the ban list just toy accessories, but having a pistol grip on a semi-auto gun and a threaded barrel means 10yrs in prison. Even if that stock was designed for ergonomics and the barrel threaded for a compensator. Such describes a Ruger 10/22 competition rifle. It's a rediculous law and I'm glad to see leave.\n \n \nMany so called \"AWs\" as also used in competition in marksmanship across the US.\n \n The biggest reason for the law was to get people used to being limeted in what they could own so in the future it would be easier to enact a new larger more restrictive law.\n \n Considering AW's were used in ~1% of crime...I never saw a great danger in them when mechanically they are no different than many other non-banned rifles.\n\n \n One of those competitions is called Service Rifle. Held at Camp Perry no less.\n \n Yep, one of the guys who helped write the law stated that himself. Another said they didn't know what the guns were or how dangerous they were, but they looked \"ominous.\" You can't make this stuff up.\n \n AWs, per AWB definition, were used in 2-3% of crimes in pre-'94. 3% would be a maximum estimate. This is based on a study conducted in a journal on crime by people with degrees and citied sources. I could email it to anyone interested.", 
   {}, 
   66498, 
   null, 
   1094873040.0
  ], 
  [
   66525, 
   null, 
   "pickleweaseler", 
   "Is the NRA responsible for the death of the ban?...\n \n ...Ok, based on that quiz, I'd say the law was a silly one...\n \n \n\n \n Maybe common sense killed the ban.", 
   {}, 
   66468, 
   null, 
   1094876460.0
  ], 
  [
   66606, 
   null, 
   "emclean", 
   "why do you feel the NEED for a loaded gun in your home? i have \"AW's\" (am AR, a SKS, and an 20 gage AK), but i do not keep them loaded, or anyother firearm i have. they are part of one of my hobbies. why should i not be alowed to enjoy my hobby?", 
   {}, 
   66525, 
   null, 
   1094934480.0
  ], 
  [
   66739, 
   null, 
   "Shooterman", 
   "So the ban on assualt weapons (which Bush promised he would uphold in 2000) is about to expire. Even the kits that convert them to fully automatic will be will be legal again. Some say it's because of the political clout of the NRA. Apparently police chiefs across the country are speaking out to keep the ban.\n\n \n Don't get caught converting a semi to full auto. Serious jail time. \n \n \nDoes the NRA really want assault weapons to be available to everyone? If so, why? Don't they preach responsible gun ownership? Can we trust everyone to be responsible with an SKS or an M-16?\n\n \n It is obvious you do not know what an assault weapon is. Beyond that, I'll use my own case as an example. I own one of those (gasp) Bushmaster AR-15s. It doesn't have a bayonet lug nor a flash suppressor. It may be similar to an M-16, but it only fires in the semi automatic, selfloading mode, requiring a pull of the trigger for each round fired. \n \n I also own an SKS, firing a 7.62X39 round. Like the AR-15, it only fires one round per trigger pull. It is a semi automatic weapon like the AR.\n \n With the AR, I can put 10 rounds in 70 seconds ( actually more ) down range at 200 yards and kill a black and white target. I did this yesterday. Admittedly, my killing of those paper targets was not as efficient as some of the other guys I was shooting with. The point being, inspite of all the rhetoric and total BS involved in the gun control debate, my weapons are legal and shall remain so. I certainly do not have the money to blow on a fully auto rifle, and don't know that I would if I had the money. \n \n Questions?\n \n BTW, my friend, if you can't trust those like me to own a, cough, cough, 'assault weapon', I doubt if you would trust anyone with any type of weapon.", 
   {}, 
   66231, 
   null, 
   1095057300.0
  ], 
  [
   66846, 
   null, 
   "3sgte", 
   "To those who believe that the ban should be renewed (or strengthened) what makes these guns more dangerous than non banned guns exactly? Please don't just say \"firepower\" or anything about \"mowing down.\" I want to know in your own words, what makes these guns such a menace to society?", 
   {}, 
   66739, 
   null, 
   1095115200.0
  ], 
  [
   66851, 
   null, 
   "pnac=ww3", 
   "Arrrgh. \n \n Now everyone is going to think I'm some Marxist (not marksman) or something.\n \n Look, I made the mistake of starting a thread about something I wasn't up to speed on. For some reason I had been convinced that the 1994 ban had something to do with automatic weapons and that the ban was a direct response to gang violence, which declined after the ban. This is the fault of cable news. I googled a few things but the wording never told me anything to change my mind. Thankfully, there were good folks like emclean on this board who, thinking I want to repeal the second ammendment or something, were perfectly willing to treat me like a Bolshevik.", 
   {}, 
   66846, 
   null, 
   1095117060.0
  ], 
  [
   66894, 
   null, 
   "pickleweaseler", 
   "Arrrgh. \n \n Now everyone is going to think I'm some Marxist (not marksman) or something.\n \n Look, I made the mistake of starting a thread about something I wasn't up to speed on. \n\n \n Thanks for admitting your mistake. Don't do it again, and I won't count it against you.", 
   {}, 
   66851, 
   null, 
   1095137520.0
  ], 
  [
   67602, 
   null, 
   "Jeffersonian", 
   "Arrrgh. \n \n Now everyone is going to think I'm some Marxist (not marksman) or something.\n \n Look, I made the mistake of starting a thread about something I wasn't up to speed on. For some reason I had been convinced that the 1994 ban had something to do with automatic weapons and that the ban was a direct response to gang violence, which declined after the ban. This is the fault of cable news. I googled a few things but the wording never told me anything to change my mind. Thankfully, there were good folks like emclean on this board who, thinking I want to repeal the second ammendment or something, were perfectly willing to treat me like a Bolshevik.\n\n \n Want to see somthing really open your eyes:\n \n First read this from an anti-gun website: http://www.bradycampaign.org/press/release.php?release=283\n \n Then read this regarding the anti-gun research: http://www.freerepublic.com/focus/news/808010/posts\n \n Then check out this anti-gunner in jail for attempted murder with a gun:\n http://www.tincher.to/mmm.htm", 
   {}, 
   66851, 
   null, 
   1095587640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is it really pressure from the NRA?", 
  "url": "http://www.4forums.com/political/gun-control-debates/3145-really-pressure-nra.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 3145, 
  "discussion_files": [
   [
    "17288.html", 
    "http://www.4forums.com/political/gun-control-debates/3145-really-pressure-nra-print.html"
   ], 
   [
    "17289.html", 
    "http://www.4forums.com/political/gun-control-debates/3145-really-pressure-nra-2-print.html"
   ]
  ], 
  "identifier": 3145
 }
]