[
 [
  [
   66605, 
   null, 
   "AMD4EVER", 
   "Is it time that we just pull our forces out of every country that we currently have them stationed and just bring them home to protect ourselves?\n \n It seems to me that everyone hates that America tries to play global police even though I think the entire world is better off because of it. So I'd like to hear from people in the US and from all around the world. Do you really want the US to just pull back to Fortress America and become isolationist again? Would that really make you happy? We leave Iraq and Afghanistan right now. We leave South Korea and Japan and Cuba and Africa. Should we also pull out of NATO and the UN and leave them to themselves?\n \n I wouldn't mind seeing the US do just this. I am an American and I know our country would be better off during my lifetime if our troops just all came home and we focused on Fortress America. We would be safer, we would spend more money on ourselves and less on others, and we would prosper because of it.\n \n Does this sound good to everyone else? How about those of you in Southeast Asia? Middle East? Europe? Russia? I can't wait to see what the opinion of the people on this board really are when it comes right down to it.", 
   {
    "post_info": {
     "post_title": "Fortress America"
    }
   }, 
   null, 
   null, 
   1094933580.0
  ], 
  [
   66612, 
   null, 
   "JustineCredible", 
   "Is it time that we just pull our forces out of every country that we currently have them stationed and just bring them home to protect ourselves?\n \n It seems to me that everyone hates that America tries to play global police even though I think the entire world is better off because of it. So I'd like to hear from people in the US and from all around the world. Do you really want the US to just pull back to Fortress America and become isolationist again? Would that really make you happy? We leave Iraq and Afghanistan right now. We leave South Korea and Japan and Cuba and Africa. Should we also pull out of NATO and the UN and leave them to themselves?\n \n I wouldn't mind seeing the US do just this. I am an American and I know our country would be better off during my lifetime if our troops just all came home and we focused on Fortress America. We would be safer, we would spend more money on ourselves and less on others, and we would prosper because of it.\n \n Does this sound good to everyone else? How about those of you in Southeast Asia? Middle East? Europe? Russia? I can't wait to see what the opinion of the people on this board really are when it comes right down to it.\n\n \n Something tells me that the words:\n \n \"Give me your tired, your poor,  \n Your huddled masses yearning to breathe free, \n The wretched refuse of your teeming shore.  \n Send these, the homeless, tempest-tossed, to me:  \n I lift my lamp beside the golden door.\"  \n \n Mean nothing to you? \n \n Or what about the term; \"America the Melting pot?\" \n \n \"Land of the free, Home of the Brave.\" \n \n Still nothing? \n \n Well how about those who colonized this country? \n The fact that we do not have a national tongue or state sanctioned religion? \n \n Fortressing off America directly opposes the entire premice of what America stands for, what we were built on. \n \n Fortress America = Bad Idea ", 
   {}, 
   66605, 
   null, 
   1094939940.0
  ], 
  [
   66615, 
   null, 
   "syklopps61", 
   "I wouldn't mind seeing the US do just this. I am an American and I know our country would be better off during my lifetime if our troops just all came home and we focused on Fortress America. We would be safer, we would spend more money on ourselves and less on others, and we would prosper because of it.\n \n Does this sound good to everyone else? How about those of you in Southeast Asia? Middle East? Europe? Russia? I can't wait to see what the opinion of the people on this board really are when it comes right down to it.\n[/QUOTE]\n \n There is a big part of me that agrees with you, I have to admit. The funny thing is, the U.S. is damned if we do and damned if we don't. They hate us because of our policies (supposedly), but yet if we sit back and watch the rest of the world rot (which it WOULD), we will be hated for NOT doing anything. Don't get me wrong, I could care less if we ARE hated, I just think it's funny the attitudes of these people...like little children", 
   {}, 
   66605, 
   null, 
   1094940240.0
  ], 
  [
   66617, 
   null, 
   "AMD4EVER", 
   "Fortress America = Bad Idea \n\n \n What country are you from? I'm assuming the US. If so I can respect what your saying. But doesn't it make you wonder why if Fotress America is a bad idea that so many other countries want us to move in that direction? Countries that we have helped and continue to support even as they disrespect us and our efforts. Doesn't it make you wonder why we even try to help them instead of doing just what is in our best interest? Remember, in Fortress America we don't have 1000 dead Americans in Iraq right now and thousands of others could be with their families right now while the Iraqis rot under the thumb of Saddam. Fortress America is the military principle we were built on anyways. We were meant to have a defensive military stance, not one that is practically on the offense all around the world. The benefits of doing this for us would be incredible as I'm sure you realize.\n \n Out of the goodness of our hearts we continue to give aid and help to almost every country in need and in return America is hands down the most hated country on the face of the earth.", 
   {}, 
   66612, 
   null, 
   1094942640.0
  ], 
  [
   66618, 
   null, 
   "AMD4EVER", 
   "There is a big part of me that agrees with you, I have to admit. The funny thing is, the U.S. is damned if we do and damned if we don't. They hate us because of our policies (supposedly), but yet if we sit back and watch the rest of the world rot (which it WOULD), we will be hated for NOT doing anything. Don't get me wrong, I could care less if we ARE hated, I just think it's funny the attitudes of these people...like little children\n\n \n Yeah I do agree with you. The US is damned either way. If we leave South Korea and they are invaded, it is our fault. If we stay in South Korea and North Korea makes nuclear weapons, it is our fault. If we invade North Korea, we are a warmongering nation. If we blockade North Korea, we are starving a nation and are baby killers for it. We just can't win no matter what we do. But France can sit back and defame the US while doing nothing beneificial themselves at all and they are respected for it.\n \n If we were to pull back into Fortress America the world would probably just collapse and everything that we had helped create over the past century would be lost. I don't wish to see this happen but I can't stand the fact that no one really appreciates what we have done and are doing and they have no idea what they are asking when they ask us not to play world police.", 
   {}, 
   66615, 
   null, 
   1094942880.0
  ], 
  [
   66620, 
   null, 
   "syklopps61", 
   "Out of the goodness of our hearts we continue to give aid and help to almost every country in need and in return America is hands down the most hated country on the face of the earth.\n[/QUOTE]\n \n I'd like to add to that there is no other country in history that has sacrificed so many people for the liberty of others than we have. The enormity of that is awe-inspiring, and I think too few people stop to think about it..instead, they subscribe to the popular opinions of the day that say we are evil and have alterior motives for everything we do. I know we aren't perfect and I'm sure that we have interests, but not with the evil intent that so many claim", 
   {}, 
   66617, 
   null, 
   1094944560.0
  ], 
  [
   66651, 
   null, 
   "JustineCredible", 
   "What country are you from? I'm assuming the US. If so I can respect what your saying. But doesn't it make you wonder why if Fotress America is a bad idea that so many other countries want us to move in that direction? Countries that we have helped and continue to support even as they disrespect us and our efforts. Doesn't it make you wonder why we even try to help them instead of doing just what is in our best interest? Remember, in Fortress America we don't have 1000 dead Americans in Iraq right now and thousands of others could be with their families right now while the Iraqis rot under the thumb of Saddam. Fortress America is the military principle we were built on anyways. We were meant to have a defensive military stance, not one that is practically on the offense all around the world. The benefits of doing this for us would be incredible as I'm sure you realize.\n \n Out of the goodness of our hearts we continue to give aid and help to almost every country in need and in return America is hands down the most hated country on the face of the earth.\n\n \n Fortress America = Bad\n New PR company = Better\n \n Obviously we've just had a lot of bad press. \n But I'm not suprised actually. Our media-heads are perfectly content feeding the American public what they feel they want us to know. \n Heck yeah the rest of the world is mad at us. We represent everything they feel is wrong. We pump millions of dollars into a certain country when it does US good. Kindness of our heart my foot.\n Then our citizens sit there are wonder why everyone hates us. Wake up! \n We funded Iraq when it suited our purposes, not out of the kindness of our hearts. Then once we got our hostiges freed we filled Iran with tons of money to fight the Iraqis. Then when Russia decided to invade Iraq we flip-flopped again and went back to funding them. Donald Rumsfeld himself went over there to pledge our support to Saddam! \n \n Later while we THOUGHT no one was watching we filtered millions to the Israelese to occupy Palestinian territories. \n Iraq and Saddam gets snitty off and invades Kuwait because he knows thats where we've been getting our oil from while they were gasing the Kurds. \n We go in, bomb the snot out of Iraq and tell Saddam to back off. Which for a while he does, reluctantly so, but still does...sort of. \n The whole time we're still chumming it up with the Saudi Royal family and telling dirty jokes about those stupid Iraqis/Iranians, which ever is the brunt of the day. \n Again, we turn our attentions to the Israelese and so does Osama Bin Laddan. He gets all uppity and takes out the World Trade Centers. We have no idea where he's hiding out so we threaten Saddam because someone said in some steamroom at one time or another that Saddam may have appeared to have backed down eleven years earlier, but was probably building a stockpile of nuclear and biological weapons and had allowed Osama to train his Saudi national buddies there. \n Granted, we don't have an real evidence so insted we'll have the son of the President who started the first war with Iraq to stand up there and confuse the public while we bomb the stink out of Iraq but we're going to say we're \"liberating\" them. Of course the American people will buy it because those sanddwellers are all worshiping this strange religion which we don't know anything about, although it's the fastest growning religion on the face of the planet. But to save face we'll say it's evil. And to back up that notion of evil, we'll have that same son of a Bush start a whole bunch of other religious based whoopla and what not just so no one is really paying attention to everything else we've screwed up. \n \n KINDNESS OF OUR HEARTS MY ARSE! ", 
   {}, 
   66617, 
   null, 
   1094972940.0
  ], 
  [
   66752, 
   null, 
   "Duo_Maxwell", 
   "Isolation is not the answer, nor will it ever be.\n \n Even if we wanted to pull out for the reasons discussed, we couldn't. We would be jeapordizing our interets and our economy. If we became a fortress, our standard of living would plummet. If mere for economics, we cannot become isolantionists.", 
   {}, 
   66651, 
   null, 
   1095072060.0
  ], 
  [
   66796, 
   null, 
   "AMD4EVER", 
   "Isolation is not the answer, nor will it ever be.\n \n Even if we wanted to pull out for the reasons discussed, we couldn't. We would be jeapordizing our interets and our economy. If we became a fortress, our standard of living would plummet. If mere for economics, we cannot become isolantionists.\n\n \n Wouldn't we be saving ourselves a whole lot of money just by pulling our forces out of other countries? Wouldn't we also be able to invest that in ourselves and become even more economically powerful? Especially if all other countries started to fall a bit we would establish an even greater advantage over others as we remain stable.", 
   {}, 
   66752, 
   null, 
   1095104820.0
  ], 
  [
   66812, 
   null, 
   "jim's trucking", 
   "Wouldn't we be saving ourselves a whole lot of money just by pulling our forces out of other countries? Wouldn't we also be able to invest that in ourselves and become even more economically powerful? Especially if all other countries started to fall a bit we would establish an even greater advantage over others as we remain stable.\nAs Duo mentioned, isolationism will not benefit us. This is a complicated interdependent world we live in.\n \n In 500BC, isolationism was not all that bad a thing. There was not nearly the national interdependency that we have today. Now that the world's land masses and people have been thoroughly explored, settled and claimed in the name of some entity, there's a definite need for a world policeman. The job falls to us by choice...we are the strongest, most heavily armed bully and natural born freedom-maker on the block. Isolationism would severely curtail our power and leave a lot of wimpy countries to the mercy of the other bullies who may have fewer freedoms in mind. Then after one of those other bullies takes over the rest of the world, we'll be the weakest of two entities and will eventually fall victim to the big guy.\n \n ...", 
   {}, 
   66796, 
   null, 
   1095108600.0
  ], 
  [
   66878, 
   null, 
   "AMD4EVER", 
   "In 500BC, isolationism was not all that bad a thing. There was not nearly the national interdependency that we have today. Now that the world's land masses and people have been thoroughly explored, settled and claimed in the name of some entity, there's a definite need for a world policeman. The job falls to us by choice...we are the strongest, most heavily armed bully and natural born freedom-maker on the block. Isolationism would severely curtail our power and leave a lot of wimpy countries to the mercy of the other bullies who may have fewer freedoms in mind. Then after one of those other bullies takes over the rest of the world, we'll be the weakest of two entities and will eventually fall victim to the big guy.\n\n \n Then explain why the big guy right now is falling victim to everyone else. North Korea mocks us! Iran will soon do the same! We are the victim here regardless of our size. We have long been doing what is generally good for the world yet we are hated throughout the world. We lose billions of dollars every year with our military stationed to protect countries who would like to see us perish. I don't think it makes any sense especially now that the terrorists are trying to bring war to our lands while our military is fighting battles on way too many fronts. We will fall eventually just because of this nonsense wouldn't you agree? Shouldn't we just take up the role of the big guy and force countries like North Korea to submit to us rather than having to live in fear of them?", 
   {}, 
   66812, 
   null, 
   1095127380.0
  ], 
  [
   66905, 
   null, 
   "Duo_Maxwell", 
   "Wouldn't we be saving ourselves a whole lot of money just by pulling our forces out of other countries? Wouldn't we also be able to invest that in ourselves and become even more economically powerful? Especially if all other countries started to fall a bit we would establish an even greater advantage over others as we remain stable.\n\n \n No. Without the ability to protect our interests, investment via the US to the rest of the world will drop. Would YOU invest in a area that was not under any form of US protection? Economic power rests upon stability. Force is often a crude form of stability. You will not have growth if your MickeyD's is getting blown up every other day. Besides, if we become a fortress, our standard of living and trade will drop like a rock. voluntary trade creates wealth. Shutting down our ports and borders, part of isolationism, does not help that premise.", 
   {}, 
   66796, 
   null, 
   1095152400.0
  ], 
  [
   66918, 
   null, 
   "AMD4EVER", 
   "No. Without the ability to protect our interests, investment via the US to the rest of the world will drop. Would YOU invest in a area that was not under any form of US protection? Economic power rests upon stability. Force is often a crude form of stability. You will not have growth if your MickeyD's is getting blown up every other day. Besides, if we become a fortress, our standard of living and trade will drop like a rock. voluntary trade creates wealth. Shutting down our ports and borders, part of isolationism, does not help that premise.\n\n \n Our military forces are not everywhere that there is a McDonalds so why are they not getting blown up everyday? It is because there is a rule of law in those countries just like there are here. I seriously doubt that if we pulled our military forces out of Europe that all our interests would suddenly be under attack unless the Russian army unexpectedly invaded. Also I don't think we need to shut down our ports and borders completely as long as we have them protected much better than they are today. A military Fortress America is more to my liking as it allows us to be safer and preserve our economic abilities.", 
   {}, 
   66905, 
   null, 
   1095170820.0
  ], 
  [
   66944, 
   null, 
   "JustineCredible", 
   "Our military forces are not everywhere that there is a McDonalds so why are they not getting blown up everyday? It is because there is a rule of law in those countries just like there are here. I seriously doubt that if we pulled our military forces out of Europe that all our interests would suddenly be under attack unless the Russian army unexpectedly invaded. Also I don't think we need to shut down our ports and borders completely as long as we have them protected much better than they are today. A military Fortress America is more to my liking as it allows us to be safer and preserve our economic abilities.\n\n \n Well no one is stopping you from barrackading yourself in your home. If you don't like the way America is and has been for decades, by all means, live under a rock. I'm sure the rest of the country will just fine without you.", 
   {}, 
   66918, 
   null, 
   1095186060.0
  ], 
  [
   66958, 
   null, 
   "AMD4EVER", 
   "Well no one is stopping you from barrackading yourself in your home. If you don't like the way America is and has been for decades, by all means, live under a rock. I'm sure the rest of the country will just fine without you.\n\n \n Oh come on now. Do you just want to throw insults around or do you want to debate the issue?\n \n I'm only here to debate an issue that I am interested in. I am of the belief that the US is doing the right thing in helping to secure the world but I also see that it is completely unappreciated and it is now getting to the point where people are trying to kill us for our actions. I would love for the US to be able to keep the peace in the world but the world hates us. We cannot go on like this forever, wouldn't you agree? Something big will happen to us one day and maybe even soon. What do you want us to do if that should happen? Continue policing the world or worry about ourselves for once?", 
   {}, 
   66944, 
   null, 
   1095190320.0
  ], 
  [
   66960, 
   null, 
   "JustineCredible", 
   "Oh come on now. Do you just want to throw insults around or do you want to debate the issue?\n \n I'm only here to debate an issue that I am interested in. I am of the belief that the US is doing the right thing in helping to secure the world but I also see that it is completely unappreciated and it is now getting to the point where people are trying to kill us for our actions. I would love for the US to be able to keep the peace in the world but the world hates us. We cannot go on like this forever, wouldn't you agree? Something big will happen to us one day and maybe even soon. What do you want us to do if that should happen? Continue policing the world or worry about ourselves for once?\n\n \n Neither option is an easy one. To attempt to over simplify it is ludicris at best. Fortress America is crazy, policing the world is suicidal. But trying to get back to what this country was meant to be is a better idea. Equality, Freedoms and openness. Only we can rebuild our country, but do fortress it off is impossible.", 
   {}, 
   66958, 
   null, 
   1095191100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Fortress America", 
  "url": "http://www.4forums.com/political/politics-debates/3165-fortress-america.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3165, 
  "discussion_files": [
   [
    "14836.html", 
    "http://www.4forums.com/political/politics-debates/3165-fortress-america-print.html"
   ], 
   [
    "14837.html", 
    "http://www.4forums.com/political/politics-debates/3165-fortress-america-2-print.html"
   ]
  ], 
  "identifier": 3165
 }
]