[
 [
  [
   67162, 
   null, 
   "Siegfriedson", 
   "Uncovered: The Whole Truth About The Iraq War\n \n An impressive roster of experts is assembled to provide a generally withering commentary on the quality of evidence and possible motivations of the neoconservatives who provided the momentum and muscle behind America's venture into 'preemptive' war. Among them are veteran CIA analysts and operatives, military officers, diplomats, politicians, arms inspectors, and U.S. and British government officials.\n \n Click the link below and the video will begin streaming into your browser:\n \n http://www.informationclearinghouse.info/article6423.htm\n \n \n Still No Osama bin Laden or 'Weapons of Mass Destruction' After Two Years\n \n All of President Bush's chest-puffing, swaggering and tough talk over winning the war on terrorism reduce to one big nothing when you consider - with the kind of cold-eyed logic and dispassion that eludes today's courtier press and punditry - that on the two biggest issues of his term, he is a miserable failure.\n \n The War President has broken both of the major promises he made to the American people to protect them from future terrorism. He vowed to get Osama bin Laden \"dead or alive,\" and then, when that didn't happen, he said he'd secure Iraq's weapons of mass destruction so they wouldn't fall into bin Laden's hands.\n \n On both counts, he has come up empty. Two big fat goose eggs. The bottom line is, after stripping away all the campaign bull and feel-good patriotic pap, Bush is 0-2 in '04: No OBL, no WMD.\n \n Full article:\n \n http://www.antiwar.com/sperry/index.php\n \n \n Related Threads:\n \n Bush & Neocons Planned \"Regime Change\" Before 9/11\n \n  \"Regime Change\": Not an Excuse for War\n \n  Conservatives, Unite Against Bush!\n \n \n \n .", 
   {
    "post_info": {
     "post_title": "Bush Admin's Lies, Treason Documented in Online Video"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1095287760.0
  ], 
  [
   71717, 
   null, 
   "Siegfriedson", 
   "Conservative Columnist Reese Endorses Kerry, Blasts Dubya\n \n Americans should realize that if they vote for President George W. Bush's re-election, they really are voting for the architects of war - Dick Cheney, Donald Rumsfeld, Paul Wolfowitz and the rest of that cabal of neoconservative ideologues and their corporate backers.\n ...\n It's no wonder the president avoids news conferences like the plague. Take away his cue cards, and he can barely talk. Americans should be embarrassed that an Arab king - Abdullah of Jordan - spoke more fluently and articulately in English than our own president at their joint news conference recently.\n ...\n It is not at all conservative to balloon government spending, to vastly increase the power of government, to show contempt for the Constitution and the rule of law or to tell people that foreign outsourcing of American jobs is good for them, that giant fiscal and trade deficits don't matter, and that people should not know what their government is doing. Bush is the most prone to classify, the most secretive president in the 20th century.\n \n Full article:\n \n http://www.showmenews.com/2004/May/20040523Comm002.asp\n \n \n \n \n .", 
   {
    "unicode_changes_made": true
   }, 
   67162, 
   null, 
   1097807160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush Admin's Lies, Treason Documented in Online Video", 
  "url": "http://www.4forums.com/political/politics-debates/3195-bush-admins-lies-treason-documented-online-video.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3195, 
  "discussion_files": [
   [
    "12331.html", 
    "http://www.4forums.com/political/politics-debates/3195-bush-admins-lies-treason-documented-online-video-print.html"
   ]
  ], 
  "identifier": 3195
 }
]