[
 [
  [
   67194, 
   null, 
   "Quixote", 
   "Liberty\n \n In 2003, a horrible injustice occurred within our beloved court system. Edward Rosenthal was accused of growing marijuana for his consumption. Understandably, he was convicted and sent to prison. It seems that this was just a simple case, but the whole story has not been revealed. Rosenthal had been deputized by the city of Oakland to grow marijuana for medical purposes, under the recommendation of his doctor. The judge forbade the lawyers from mentioning any of this information to the jury. Things like this should never happen, and wouldn't if drugs were made legal. For the benefit of civil liberty, drugs of all types should be legalized. \n To take away people's independence under the assumption of \"protecting\" them is simply wrong. As John Stuart Mill, a famous 19th century philosopher, wrote in his essay on freedom, \"The only reason for which power can be rightfully exercised over any member of the community, against his will, is to prevent harm to others.\" I fully agree with Mill, and believe the government should not deign to protect us from ourselves. Such a responsibility is one that should be entrusted to the community. Our founding fathers recognized the need for individual independence, and so made laws and amendments to protect it. The American government has strayed from this path, and the citizens are the only ones still with the power to correct them.\n Many skeptics believe the legalization of drugs will cause increased usage, and subsequently, more crime in America. This viewpoint may be valid to some extent, but has major flaws. First of all, the legalization of drugs will put many drug pushers out of business. No one will want to buy drugs from a shady drug lord, when all they must do is walk to the nearest coffee shop. The pushers will lose their customers and be forced to adopt a more legitimate form of income. Furthermore, the assumption that addicts are more prone to crime than others is unfounded. In the Netherlands, where drugs are legal, 1.3 million of 16 million people are convicted of crime. In America, 23.7 billion of 292.6 billion people are convicted. This works out to be an 8.1% crime rate for both countries, proving that drug legalization will not have an impact on crime. Moreover, America would save billions of dollars by legalizing drugs. According to the 1997 U.S. budget, we spent $15.033 billion on drug prevention and prosecution in the year 1997. This money could be put to much better use if drugs were legalized. We could put this money into the education budget to encourage kids not to take drugs.\n There are many people in America who believe the government must protect it's citizens from their own stupidity by taking away one's right to take care of oneself. This view is utterly biased. Drug use will not affect the general health of America. Drug use will actually drop in response to the legalization thereof. This is due to the fact that the majority of the people taking drugs illicitly do so as an act of civil disobedience. Once a thing is made legal, there is no immediate risk in using it and so it becomes less \"cool\" and gives one less of a tough image. Furthermore, Dr. Benson B. Roe, MD, Professor and Chief Emeritus Cardiothoracic Surgery at University of California, San Francisco has discovered that most if not all deaths caused by drugs are caused by overdose, not extended use. This is true also with prescription drugs, making them no less lethal.\n In conclusion, it is obvious that the only solution to the war on drugs is to simply stop fighting. The illegalization of drugs is not what our founding fathers would have wanted. Legalizing drugs will save America billions of dollars, and will not have a detrimental effect on general health. To keep drugs legal accomplishes one thing only. It moves us just one step closer to a nation ruled by Big Brother.\n \n That's all. Questions? Comments? Criticism?", 
   {
    "post_info": {
     "post_title": "Drugs."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1095320100.0
  ], 
  [
   67208, 
   null, 
   "syklopps61", 
   "In the Netherlands, where drugs are legal, 1.3 million of 16 million people are convicted of crime. In America, 23.7 billion of 292.6 billion people are convicted. This works out to be an 8.1% crime rate for both countries, proving that drug legalization will not have an impact on crime.\n\n \n I'm basing the following comment on some apparently well researched crime statistics by someone in the civil rights forum. I can't quote it exactly because I can't recall the thread it's under, but in effect, crime statistics in this country are somewhat skewed by race. The Netherlands are a rather homogenous society (white) with an 8.1% crime rate cited by you. I believe the whites in this country have a much lower crime rate, so the 8.1% you cite for the U.S. would therefore be much lower if you took out the black element. MY conclusion would then be that drugs must make whites commit more crimes. Certainly not scientific, but at least can give pause for consideration\n \n \nWe could put this money into the education budget to encourage kids not to take drugs.\n\n \n Good God, PLEASE don't tell me that MORE money means better education. Explain to me then how we spend MORE than the rest of the world on education and for all that we are 10th in the world and falling. \n \n The only thing I agree with in your post is that legalizing drugs would take away the criminal element such as gangs who would lose basically all of their income overnight. This COULD however cause several problems. One I say half jokingly is the Blacks would probably scream racism because the government would be taking away their \"livelihood\". The other would be an INCREASE in crime because these gangs and drug dealers would have to find SOME way to support themselves-God forbid they would seek employment.\n \n The other comment I have is that to be consistent, I would hope that you are completely against any form of welfare...afterall, government should not be protecting us from ourselves, right? I mean, one could make a case that if you are going to be lazy and unproductive and uneducated (people dropout of their own accord) that that is a form of self destruction and therefore they should not be supported by \"Big Brother\", right? Also, surely you are opposed to any kind of gun control and strongly support my right to a grenade launcher if I choose, right? I mean, since the government can't predict what drug users are going to go out and hurt others while under the influence and you support legalization of drugs, then I'm sure you would agree that the government can't predict who is going to go nuts and kill someone with a gun so therefore there should be unrestricted/unregulated ownership of guns, right?\n \n Furthermore, there is too much evidence of the pain and suffering inflicted on others by people driving under the influence of alcohol, right? Surely you aren't saying that drug users are more responsible somehow than abusers of alcohol, right?", 
   {}, 
   67194, 
   null, 
   1095337860.0
  ], 
  [
   67217, 
   null, 
   "emclean", 
   "drugs of all types should be legalized. \n \n not all types, PCP comes to mind as one that should remain illegal. as for pot, i dont see it any diffrent from booze, i would like to see it legalized, and taxed.", 
   {}, 
   67208, 
   null, 
   1095344640.0
  ], 
  [
   67228, 
   null, 
   "sinjin", 
   "...Drug use will actually drop in response to the legalization thereof. This is due to the fact that the majority of the people taking drugs illicitly do so as an act of civil disobedience. Once a thing is made legal, there is no immediate risk in using it and so it becomes less \"cool\" and gives one less of a tough image.\n\n \n I believe this to be an unsupported assertion. Did alcohol consumption go down or up immediately following the lifting of prohibition? I suspect up. Most people take drugs as recreation. While one might make the case that post-legalization fewer young people would encounter \"hard drugs\" and possibly become addicted due to \"poor judgement\" common in youth, the percentage of young adults using \"soft drugs\" would likely rise to approximately that of alcohol IMO which is far greater than drugs presently.\n \n I would still support legalization in principle.", 
   {
    "unicode_changes_made": true
   }, 
   67194, 
   null, 
   1095352860.0
  ], 
  [
   67247, 
   null, 
   "pnac=ww3", 
   "not all types, PCP comes to mind as one that should remain illegal. as for pot, i dont see it any diffrent from booze, i would like to see it legalized, and taxed.\n\n \n Ah! So banning certain kinds of guns is unthinkable, but banning certain drugs is sensible. I see!\n \n Look if we are going to be libertarian then there can be no half measures.\n \n Making heroin illegal makes it much harder to get, but we can still get it if we try hard enough. This sounds like the gun control debate now.\n \n What remains is to determine if the analogy is a good one. \n We can trust everyone to exercise caution and common sense with regard to weapons but not to chemicals, herbs, and fungi. \n \n The only point I'm even coming close to trying to make is that we can either have a totally free society or we can't. Once upon a time it was much more free. There were no regulations regarding things like this (at least on a federal level), but now there are. Why are there regulations now?\n \n (ps-I don't think there should be these regulations.)", 
   {}, 
   67217, 
   null, 
   1095362100.0
  ], 
  [
   67252, 
   null, 
   "JustineCredible", 
   "Ah! So banning certain kinds of guns is unthinkable, but banning certain drugs is sensible. I see!\n \n Look if we are going to be libertarian then there can be no half measures.\n \n Making heroin illegal makes it much harder to get, but we can still get it if we try hard enough. This sounds like the gun control debate now.\n \n What remains is to determine if the analogy is a good one. \n We can trust everyone to exercise caution and common sense with regard to weapons but not to chemicals, herbs, and fungi. \n \n The only point I'm even coming close to trying to make is that we can either have a totally free society or we can't. Once upon a time it was much more free. There were no regulations regarding things like this (at least on a federal level), but now there are. Why are there regulations now?\n \n (ps-I don't think there should be these regulations.)\n\n \n Now now, no, this is NOT the same as the gun control debate. There is NO constitutional amendment regarding drugs or their limitations. There is, however an amendment regarding the freedom to own guns. \n Don't try to confuse the subject.\n There are indeed drugs which are extremely harmful and there are some which are beneficial as well as recreational. \n Marijuana can be more beneficial that it's ability to do harm. Anyone who has looked into it at all knows that marijuana is not a drug that the human body can ever become physiologically addicted to. Emotionally, yes, physically, no.\n Booze and cigarettes do far more harm than pot, yet they are leagal and pot is not. I don't profess to understand it, nor do I agree with it.", 
   {}, 
   67247, 
   null, 
   1095363600.0
  ], 
  [
   67260, 
   null, 
   "pnac=ww3", 
   "Why isn't there an amendment to protect everyone's personal freedom to do what they please as long as it doesn't hurt anyone?\n \n Who are anti-drug laws protecting? The drug user? \n \n I agree that it's not entirely the same, but when you are talking about freedom/liberty, then it is pretty much the same.", 
   {}, 
   67252, 
   null, 
   1095365580.0
  ], 
  [
   67327, 
   null, 
   "Quixote", 
   "\n Good God, PLEASE don't tell me that MORE money means better education. Explain to me then how we spend MORE than the rest of the world on education and for all that we are 10th in the world and falling. \n \n\n Because we have many more people, and therefore must spend much more money. You shouldn't base this on a raw dollar amount. Rather, a percentage? And yes, one can solve just about any problem by throwing enough money at it. The only question is whether or not the benefits outweigh the cost.\n \n\n The other comment I have is that to be consistent, I would hope that you are completely against any form of welfare...afterall, government should not be protecting us from ourselves, right? I mean, one could make a case that if you are going to be lazy and unproductive and uneducated (people dropout of their own accord) that that is a form of self destruction and therefore they should not be supported by \"Big Brother\", right? Also, surely you are opposed to any kind of gun control and strongly support my right to a grenade launcher if I choose, right? I mean, since the government can't predict what drug users are going to go out and hurt others while under the influence and you support legalization of drugs, then I'm sure you would agree that the government can't predict who is going to go nuts and kill someone with a gun so therefore there should be unrestricted/unregulated ownership of guns, right?\n \n\n \n Yes, pretty much. If you have the money to buy the grenade launcher, and you can find a vendor, what should be the problem? Not every gon store is going to be able to pay for a constant stock of oversized weapons and such.", 
   {}, 
   67208, 
   null, 
   1095387360.0
  ], 
  [
   67338, 
   null, 
   "syklopps61", 
   "Because we have many more people, and therefore must spend much more money. You shouldn't base this on a raw dollar amount. Rather, a percentage? \n\n \n Oh, c'mon now, you can shrink it to the size of a city and blow your contention out of the water. Isn't it D.C. that spends more per child than any other city and it has the lowest scores?\n \n \nAnd yes, one can solve just about any problem by throwing enough money at it. \n \n \n Well, at least I know where you stand, I'll say that much for you LOL We HAVE thrown trillions toward welfare and the \"great society\" and that hasn't solved a thing-does that mean we just have to keep throwing more and more? And, let me ask you this, would you mind throwing billions more toward SDI/Star Wars?\n \n \n The only question is whether or not the benefits outweigh the cost.\n\n \n A working SDI program would provide security from the launching of ICBM's, that seems pretty worthwhile.\n \n \n \nYes, pretty much. If you have the money to buy the grenade launcher, and you can find a vendor, what should be the problem? Not every gon store is going to be able to pay for a constant stock of oversized weapons and such.\n\n\n \n I see you responded to the gun part, but how about welfare?", 
   {}, 
   67327, 
   null, 
   1095393960.0
  ], 
  [
   67355, 
   null, 
   "emclean", 
   " Ah! So banning certain kinds of guns is unthinkable, but banning certain drugs is sensible. I see!\n \n Look if we are going to be libertarian then there can be no half measures.\n \n Making heroin illegal makes it much harder to get, but we can still get it if we try hard enough. This sounds like the gun control debate now.\n \n \n Yes it dose sound like what I say about guns, that is why I picked on PCP, a drug knowen to cause psychotic behavior, there be behavior that is likely to infringe on the rights of others. I agree with PCP, and nukes remaining outlawed for the same reason.", 
   {}, 
   67338, 
   null, 
   1095434340.0
  ], 
  [
   67407, 
   null, 
   "Quixote", 
   "What about welfare? I shouldn't be forced, against my will, to support someone who does not have enough money. By choice, perhaps. But that isn't the government's place. When I'm being forced to support a person, I will not make the distinction between incapable and unwilling.", 
   {}, 
   67355, 
   null, 
   1095455760.0
  ], 
  [
   67412, 
   null, 
   "pnac=ww3", 
   "Throwing money at problems:\n \n Obviously all the money in the world won't solve the problem unless you know how to solve the problem. Then you pay for the solution. The problem here is the system, not the amount of money.\n \n \n Welfare:\n \n It's a nice thought to think that if I were to end up in dire straights that I could be bailed out and set on my feet again. This is the intention of welfare. The reality is that the rules about who gets welfare, when and why, all result in single mother households that are totally dependent on welfare. The system is set up to make it hard to escape the welfare system once you're in it. The problem here is the system, not the idea.\n \n \n PCP:\n \n I agree that PCP should remain illegal (or maybe the manufacture and distribution should remain illegal). But, there is also alcohol-related psychosis. This is more rare than the psychotic state induced by PCP, but it's still a case of alcohol being known to cause psychosis. LSD is reported to have caused psychotic episodes, and while I can see the possibilty in some people, I have never known anyone to have an experience like that, and I certainly haven't (although I've done a herd of elephants' share in my life). Same can be said for psilocybin. And I am all for legalization of both.", 
   {}, 
   67407, 
   null, 
   1095456600.0
  ], 
  [
   67429, 
   null, 
   "Famous Amos", 
   "Why isn't there an amendment to protect everyone's personal freedom to do what they please as long as it doesn't hurt anyone?\n \n \n Who are anti-drug laws protecting? The drug user? \n \n I agree that it's not entirely the same, but when you are talking about freedom/liberty, then it is pretty much the same.\n\n \n \n Ant-drug laws protect law abiding citizens from having to worry about crack heads and heroin addicts who drive the wrong way on 1 way roads and kill people. They protect the government from having to pay for the treatment of people who abuse the drugs. What do you define as harm-physical, verbal, emotional? If we allow anything as long as it doesn't harm someone, then I can drive 185mph and weave around cars on the wrong side of the road (as long as nobody is harmed), I could fly a plane with no license 25 feet over the highway, 2 year olds could buy booze and get drunk, capable 8 year olds could drive a car, etc. None of those things harm others, so why shouldn't they be legal?", 
   {}, 
   67260, 
   null, 
   1095463500.0
  ], 
  [
   67444, 
   null, 
   "pnac=ww3", 
   "Ant-drug laws protect law abiding citizens from having to worry about crack heads and heroin addicts who drive the wrong way on 1 way roads and kill people. They protect the government from having to pay for the treatment of people who abuse the drugs. What do you define as harm-physical, verbal, emotional? If we allow anything as long as it doesn't harm someone, then I can drive 185mph and weave around cars on the wrong side of the road (as long as nobody is harmed), I could fly a plane with no license 25 feet over the highway, 2 year olds could buy booze and get drunk, capable 8 year olds could drive a car, etc. None of those things harm others, so why shouldn't they be legal?\n\n \n Anti-drug laws do nothing of the sort. They don't stop people from buying and using drugs. It just makes it harder and more expensive, while raising the likelihood of impurity. They don't stop \"the government\" from paying for the treatment of drug users because there are still plenty of people with drug problems that need medical treatment. It also creates a population of \"criminals\" that are filed into overcrowded prisons and jails, and have to be supported by \"the government.\"\n \n Real crackheads don't have cars, they traded theirs for crack. And cocaine doesn't impair your ability to drive.(unless your freebasing while driving, which is not advised) By your argument of wreckless driving, alcohol is what should REALLY be banned. But, we saw how that turned out.\n \n What you are talking about in the last part is regulation, not prohibition.\n We don't ban cars because of the potential for harm. We don't ban movies and video games because some mommies think that it will make their kids violent. We \"regulate.\" We don't allow minors (who obviously make poorer choices than adults) to drink alcohol, but we didn't ban alcohol for use by consenting adults. \n \n But all this talk about banning things for people's safety sure makes you sound a lot like Ralph Nader. :p\n \n Look, my sensible alternative is to leave it to the states to decide. This would be the constitutional way (as opposed to the currently unconstitutional Controlled Substances Act). Individual states and localities could decide their own list of banned/regulated drugs. Votes have come up in a few states that would have legalized marijuana, but they go against Federal \"Law.\" This, to me, is wrong.", 
   {}, 
   67429, 
   null, 
   1095471000.0
  ], 
  [
   67603, 
   null, 
   "Jeffersonian", 
   "Ah! So banning certain kinds of guns is unthinkable, but banning certain drugs is sensible. I see!\n \n\n \n Yes that is sensible and there is legal justification. It fits very seemless into the Constitution. You hit it right on the money.\n \n Illict drugs are CONTRABAN and Congress is specifically empowered to ban certain items for sale under Article 1 section 8 or 10? I can not remember. The Commerce Clause in the Constitution empowers Congress to do just than, ban drugs. While the same Constitution is also prevents Congress to ban guns.", 
   {}, 
   67247, 
   null, 
   1095588180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Drugs.", 
  "url": "http://www.4forums.com/political/civil-rights-debates/3197-drugs.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 3197, 
  "discussion_files": [
   [
    "15482.html", 
    "http://www.4forums.com/political/civil-rights-debates/3197-drugs-print.html"
   ]
  ], 
  "identifier": 3197
 }
]