[
 [
  [
   67339, 
   null, 
   "mypov", 
   "Or is he just a senile old man who got \"hoodwinked\" by Democrat operatives?\n \n It's been established that the \"documents\" he used in his 60 Minutes II report, to discredit G.W. Bush's Air National Guard service, are fakes. Bad ones at that. \"Cooked-up in Texas, for political puposes\". \n \n I'm not sure who \"cooked-up\" the forgeries, (Dem Nat Committee, Move-On.Org are pointing at each other) or some Yahoo Dems in texas. But Dan Rather was so eager to go negative on \"W\" , he went for the obvious fakes HOOK, LINE and SINKER! Those of you who depend on CBS, NBC, ABC, NYT, Boston Globe, Wash Post etc. etc. ARE LOST to THE TRUTH!", 
   {
    "post_info": {
     "post_title": "Is Dan Rather &quot;in the tank&quot; for KERRY?"
    }
   }, 
   null, 
   null, 
   1095395160.0
  ], 
  [
   67361, 
   null, 
   "jim's trucking", 
   "Or is he just a senile old man who got \"hoodwinked\" by Democrat operatives?\n \n It's been established that the \"documents\" he used in his 60 Minutes II report, to discredit G.W. Bush's Air National Guard service, are fakes. Bad ones at that. \"Cooked-up in Texas, for political puposes\". \n \n I'm not sure who \"cooked-up\" the forgeries, (Dem Nat Committee, Move-On.Org are pointing at each other) or some Yahoo Dems in texas. But Dan Rather was so eager to go negative on \"W\" , he went for the obvious fakes HOOK, LINE and SINKER! Those of you who depend on CBS, NBC, ABC, NYT, Boston Globe, Wash Post etc. etc. ARE LOST to THE TRUTH!\nI heard they've now claimed that even though the documents are fake, they are essentially correct...like that's some good excuse for airing the story.\n \n Dan Rather and Cheezy Broadcasting System are nothing more than whores for the Democratic Party...supported by and supportive of left wing America.\n \n http://www.powerlineblog.com/archives/007778.php\n \n ...", 
   {}, 
   67339, 
   null, 
   1095438000.0
  ], 
  [
   67560, 
   null, 
   "Haulingboat", 
   "Or is he just a senile old man who got \"hoodwinked\" by Democrat operatives?\n \n It's been established that the \"documents\" he used in his 60 Minutes II report, to discredit G.W. Bush's Air National Guard service, are fakes. Bad ones at that. \"Cooked-up in Texas, for political puposes\". \n \n I'm not sure who \"cooked-up\" the forgeries, (Dem Nat Committee, Move-On.Org are pointing at each other) or some Yahoo Dems in texas. But Dan Rather was so eager to go negative on \"W\" , he went for the obvious fakes HOOK, LINE and SINKER! Those of you who depend on CBS, NBC, ABC, NYT, Boston Globe, Wash Post etc. etc. ARE LOST to THE TRUTH!\n\n \n Conny Chong lost her career for reporting lies. I'm not sure what makes this any diffrent. \n \n To answer your question, yes he is in the tank. If he were not, he'd be reporting the news. Home ownership is up, unemployment is here it's lowest in a while, the economy is moving up, etc.", 
   {}, 
   67339, 
   null, 
   1095555600.0
  ], 
  [
   67566, 
   null, 
   "jskufan", 
   "Maybe if the Whitehouse could provide something more than pay stubs accounting for the last year and a half of George's service in the Guard it would stifle all the conjecture once and for all. Besides, according to Haulingboat, everything is perfect in America anyway, why change leadership??? Let's see how upbeat Republicans are when we're in year 3, 4, 5 ........ of our armed occupation in Iraq. Don't forget to register for selective service. Seeing someone you know head off to the Middle East tends to put a more personal spin on this mess.", 
   {}, 
   67560, 
   null, 
   1095558720.0
  ], 
  [
   67616, 
   null, 
   "jim's trucking", 
   "Maybe if the Whitehouse could provide something more than pay stubs accounting for the last year and a half of George's service in the Guard it would stifle all the conjecture once and for all. Besides, according to Haulingboat, everything is perfect in America anyway, why change leadership??? Let's see how upbeat Republicans are when we're in year 3, 4, 5 ........ of our armed occupation in Iraq. Don't forget to register for selective service. Seeing someone you know head off to the Middle East tends to put a more personal spin on this mess.\nIINM, GWB signed a form (100 or 180 or something like that) releasing ALL of his military records to the public. John Kerry has not done so.\n \n The media and the public now have access to ALL of George W. Bush's records. There is nothing more for him to release.\n \n The media and the public have found nothing new against GWB.\n \n The media and the public have been denied access to John Forbes Kerry's military record. Though he claims to be a well respected war hero, his contemporaries (quite a large number of them) think otherwise. Why doesn't John sign the form that releases ALL of his records so we can discern the truth about this commie-lover?\n \n ...", 
   {}, 
   67566, 
   null, 
   1095610980.0
  ], 
  [
   67633, 
   null, 
   "Famous Amos", 
   "Maybe if the Whitehouse could provide something more than pay stubs accounting for the last year and a half of George's service in the Guard it would stifle all the conjecture once and for all.\n\n \n \n So it's not Dan Rather's fault that he reported on these blatantly false documents, but it's those who can't find his pay stubs? This is not about pay stubs. It's about Dan Rather wanting to air this story. Two or three examiners all told CBS that there were major questions. Even if that was all the information Rather had, why would he still report on it? And then he comes out and says he isn't going to apologize because the substance is true, it's just the documents that are fake? Come on, that's a joke. Everything in this case has seemed to discredit every single part of those documents. Even the purported people who said they \"sugarcoated\" Bush's record and gave him special treatment have recently came out and said they never did so. And the results are showing; CBS has its lowest ratings in 20+ years and have fallen behind ABC, NBC, CNN, and FOX News. Looks Dan Rather has brought about the demise of CBS.", 
   {}, 
   67566, 
   null, 
   1095621060.0
  ], 
  [
   67644, 
   null, 
   "Haulingboat", 
   "When did I say everything in America was perfect? We have plenty of things wrong. \n \n The second and third generation of welfare abusers.\n \n The court appointed judges making decisions contrary to 68% of the majority on the gay marriage issue.\n \n The Mexican-American advicy groups, such as LULLAC, have opened our southern border to anyone that has a pair of walking shoes.(including Muslim terrorists)\n \n Bankruptcy laws have become so loose that all the shame in filing has disappeared, thus incouraging people to walk out on the debt they acumulate. \n \n The growing perception that the American government is responsible for providing health insurance. (you XXXXXX should take a look at the debocile north of our border)\n \n An outdated, overpriced, underqualified tax system and IRS that is to complicated for the majority of citizens to understand.\n \n Shall I continue............\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n OK..............\n \n How about the federal housing program that is booked to capacity with deadbeats mooching free rent from the backs of those of us that work to pay our own way. All the while trashing the residence they are giving. Should we be paying their rent also?\n \n \n It used to be that the food stamp folks had to stand in a seperate line to pay for, exuse me, to be giving thier food. Nowadays we can't affend anyone. We can't shame someone for taking a free ride, so everyone stands in the same line and pays with a card. We have taken the shame and embarassment out of the system and at the same time removed incentive to get off the free ride. Humility used to be part of the cure. Now no one knows so why stop?\n \n And the point that brings us back to this thread is the bias media. Facts no longer matter. The line between truth and lies no longer exist. The major networks all push the same agenda. The entire industry has been taken over by CEOs that push Democratic views. If you are a young reporter and are trying to make it big in the media or an actor trying to make it big in Hollywood, you had better not show any signs of conservatism or you're outta there. If you write a story for the New York times praising the work of George W.Bush, it won't make it past the editing table. \n \n All stories containing positive news end on a sour note. \" Job reports are out. Numbers are up. The economy gained 144000 jobs. However, reports also say salaries are down from the years of the Clinton administration. So while people are back to work, unfortunatly they won't be bringing home as much as they used to. Reporting for eyewitness news, Jsku, I mean Dan Rather. Have a good evening.\"\n \n Dan Rather approves or disapproves of everything that crosses his desk. He does not receive orders, he runs the show. He approved the National Guard piece because of his long standing hatered for the Bush family. George Sr burned his XXX on air back in the run for president in 1988 and Dan's pompous attitude won't allow him to let it go. \n \n So contrary to some beliefs I don't think everything in American is hunkydory. I do believe Rather is pushing an agenda. I do believe he is wrong.", 
   {}, 
   67633, 
   null, 
   1095628680.0
  ], 
  [
   67661, 
   null, 
   "Broker", 
   "CBS admits that they didn't make any attempt to verify the documents. They wanted the story as quickly as possible.\n \n I think their credibility has been lost.", 
   {}, 
   67644, 
   null, 
   1095637680.0
  ], 
  [
   67669, 
   null, 
   "jskufan", 
   "When did I say everything in America was perfect? We have plenty of things wrong. \n \n The second and third generation of welfare abusers.\n \n The court appointed judges making decisions contrary to 68% of the majority on the gay marriage issue.\n \n The Mexican-American advicy groups, such as LULLAC, have opened our southern border to anyone that has a pair of walking shoes.(including Muslim terrorists)\n \n Bankruptcy laws have become so loose that all the shame in filing has disappeared, thus incouraging people to walk out on the debt they acumulate. \n \n The growing perception that the American government is responsible for providing health insurance. (you XXXXXX should take a look at the debocile north of our border)\n \n An outdated, overpriced, underqualified tax system and IRS that is to complicated for the majority of citizens to understand.\n \n Shall I continue............\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n OK..............\n \n How about the federal housing program that is booked to capacity with deadbeats mooching free rent from the backs of those of us that work to pay our own way. All the while trashing the residence they are giving. Should we be paying their rent also?\n \n \n It used to be that the food stamp folks had to stand in a seperate line to pay for, exuse me, to be giving thier food. Nowadays we can't affend anyone. We can't shame someone for taking a free ride, so everyone stands in the same line and pays with a card. We have taken the shame and embarassment out of the system and at the same time removed incentive to get off the free ride. Humility used to be part of the cure. Now no one knows so why stop?\n \n And the point that brings us back to this thread is the bias media. Facts no longer matter. The line between truth and lies no longer exist. The major networks all push the same agenda. The entire industry has been taken over by CEOs that push Democratic views. If you are a young reporter and are trying to make it big in the media or an actor trying to make it big in Hollywood, you had better not show any signs of conservatism or you're outta there. If you write a story for the New York times praising the work of George W.Bush, it won't make it past the editing table. \n \n All stories containing positive news end on a sour note. \" Job reports are out. Numbers are up. The economy gained 144000 jobs. However, reports also say salaries are down from the years of the Clinton administration. So while people are back to work, unfortunatly they won't be bringing home as much as they used to. Reporting for eyewitness news, Jsku, I mean Dan Rather. Have a good evening.\"\n \n Dan Rather approves or disapproves of everything that crosses his desk. He does not receive orders, he runs the show. He approved the National Guard piece because of his long standing hatered for the Bush family. George Sr burned his XXX on air back in the run for president in 1988 and Dan's pompous attitude won't allow him to let it go. \n \n So contrary to some beliefs I don't think everything in American is hunkydory. I do believe Rather is pushing an agenda. I do believe he is wrong.\n\n \n If Dan Rather reported on documents that were \"uncooberated\" and not proven to be truthful, I also consider that to be wrong and unexcusable when they contain information that could damage someone else's reputation. I don't know him personally so I won't speculate on his motives, but it's safe to assume he's not voting Republican. As for the accusation that the media is biased, I don't doubt that to be false either. People in the entertainment industry, newspapers, magazines, and television will have political leanings just like everyone else. They will use resources available to further that agenda. Anyone opposed to or offended by these leanings has the constitutional right to turn the channel, cancel his subscription, or boycott movies affiliated with the aforementioned. Were you equally offended when the dozens of Swift Boat Vets were running forward to try to discredit Kerry's service?", 
   {}, 
   67644, 
   null, 
   1095640320.0
  ], 
  [
   67670, 
   null, 
   "Maineiac", 
   "Shooting the messenger are we? The only ones crying about Rather are other networks and the Republican party.Bush is letting the media run with this issue,while he does little to furnish any additional info to back up his claims.\n \n Smart choice for Bush.\n \n Bush used the Guard to avoid Vietnam.A lot of other men used the same tactic.Whats the big deal?\n \n If I was going to vote for Bush,I would look to his strengths, not his weaknesses. ;)", 
   {}, 
   67661, 
   null, 
   1095642300.0
  ], 
  [
   67725, 
   null, 
   "Waxy", 
   " (you XXXXXX should take a look at the debocile north of our border).\n\n \n Care to back this up with any facts, or are you just running your mouth?\n \n Waxy", 
   {}, 
   67644, 
   null, 
   1095697860.0
  ], 
  [
   67760, 
   null, 
   "jskufan", 
   "Care to back this up with any facts, or are you just running your mouth?\n \n Waxy\n\n \n I was going to comment on that thread but I didn't want to be mistaken for one of the \"you XXXXXX\" as he so diplomatically put it. ;) So much for forum etiquette!", 
   {}, 
   67725, 
   null, 
   1095713040.0
  ], 
  [
   67783, 
   null, 
   "Master_Shake", 
   "Don't you guys see it? These documents weren't \"cooked up\" by the DNC, Move-On.org, some \"Yahoo Dems in Texas\" or any Democrat or liberal. These were obviously \"cooked up\" by the Republicans or a conservative group. Now, before you get your panties in a twist, let me say that, from a political standpoint, I sort of admire this. The republicans have always been better at this kind of stuff then the dems. It was quite a genius move actually. Make the other guy look like they're forging documents and they lose credibility. Kudos to the republicans. As for the Democrats, as stupid as they may be sometimes, they aren't this stupid. The forgeries are relatively obvious and if they really wanted to forge something they would have done a much better job.", 
   {}, 
   67339, 
   null, 
   1095722520.0
  ], 
  [
   67791, 
   null, 
   "CCR1994", 
   "Don't you guys see it? These documents weren't \"cooked up\" by the DNC, Move-On.org, some \"Yahoo Dems in Texas\" or any Democrat or liberal. These were obviously \"cooked up\" by the Republicans or a conservative group. Now, before you get your panties in a twist, let me say that, from a political standpoint, I sort of admire this. The republicans have always been better at this kind of stuff then the dems. It was quite a genius move actually. Make the other guy look like they're forging documents and they lose credibility. Kudos to the republicans. As for the Democrats, as stupid as they may be sometimes, they aren't this stupid. The forgeries are relatively obvious and if they really wanted to forge something they would have done a much better job.\n\n \n Too bad you aren't the producer of 60 Minutes II. You could have prevented a lot of grief.", 
   {}, 
   67783, 
   null, 
   1095724320.0
  ], 
  [
   67861, 
   null, 
   "Haulingboat", 
   "Care to back this up with any facts, or are you just running your mouth?\n \n Waxy\n\n \n \n Ok, the \"XXXXXX\" comment was uncalled for, but why does voicing my opinions constitute running my mouth?\n \n Here is a few that will back me up.\n http://www.brokenpromises.ca/comments.html\n \n http://www.creativeresistance.ca/awareness/2002-dec01-the-real-reason-medicare-is-in-trouble-ted-schrecker.htm\n \n http://csmonitor.com/cgi-bin/durableRedirect.pl?/durable/2000/03/23/p1s3.htm\n \n \n Are these guys just running their mouth also? Look, I realize our system has it's flaws, but your system is no better. You run into just as many, as well as many of the same problems we do. Plus you are taxed heavily for it. Many Americans see Canada's system as a solution. It is not. It is just as flawed as ours plus provides a heavy tax burden.", 
   {}, 
   67725, 
   null, 
   1095786240.0
  ], 
  [
   67863, 
   null, 
   "Alan Ryan", 
   "[QUOTE=jim's trucking]I heard they've now claimed that even though the documents are fake, they are essentially correct...like that's some good excuse for airing the story.\n \n \n I understand that Mr Rather claims he broadcast this (false) information in\n \"good faith\" - as though that makes everything OK. The whole point is that\n Dan Rather WANTS the story to be true and this wish was father to that\n thought.", 
   {}, 
   67361, 
   null, 
   1095787560.0
  ], 
  [
   67864, 
   null, 
   "Haulingboat", 
   "So he issued an appology. Yet, he managed to take no responsoblity for the action at all. According to Dan it was all their fault. He was misled. \n \n Take some responsibility for yourself man!", 
   {}, 
   67863, 
   null, 
   1095787920.0
  ], 
  [
   67868, 
   null, 
   "Waxy", 
   "Ok, the \"XXXXXX\" comment was uncalled for, but why does voicing my opinions constitute running my mouth?\n \n Here is a few that will back me up.\n http://www.brokenpromises.ca/comments.html\n \n http://www.creativeresistance.ca/awareness/2002-dec01-the-real-reason-medicare-is-in-trouble-ted-schrecker.htm\n \n http://csmonitor.com/cgi-bin/durableRedirect.pl?/durable/2000/03/23/p1s3.htm\n \n Are these guys just running their mouth also? Look, I realize our system has it's flaws, but your system is no better. You run into just as many, as well as many of the same problems we do. Plus you are taxed heavily for it. Many Americans see Canada's system as a solution. It is not. It is just as flawed as ours plus provides a heavy tax burden.\n\n \n The running your mouth comment was also uncalled for, but was basically in response to the idiot thing, and the general lack of understanding of the Canadian health care system and the real numbers that I see in most Americans. \n \n I'll certainly never claim that our system is perfect, because it's far from it, but compared to US style health insurance, I'll take our system hands down, both from a practical and a philosophical standpoint.\n \n Your first link to some guy's book, there's no info there to be had, just a couple links to short excerpts of his opinion.\n \n The other two definately highlight some problems, but they also support the notion of the Canadian system.\n \n Myth  - Canadians have a higher tax burden for health care.\n \n Fact - Americans pay nearly double that of every other industrialized nation for health care - whether it's tax dollars or after tax dollars in the form of insurance, it's still coming out of your pocket.\n \n Myth - Canadians have substandard health care in comparison\n \n Fact  - While there is a grain of truth in this statement, it's a myth because the health care that is superior to that in Canada is only available to a very small percentage of Americans that are able to pay for it. \n \n Here's a couple of quick links for comparison, the first one is very good, the third provides an interesting comparison of costs, and last one is a rather long report done on the Canadian health care system by the government.\n \n http://www.thirdworldtraveler.com/Health/O_Canada_KP.html\n \n http://www.thirdworldtraveler.com/Health/Health_watch.html\n \n http://members.shaw.ca/tfrisen/which_is_the_better_health_care_.htm\n \n http://www.hc-sc.gc.ca/english/pdf/romanow/pdfs/MendelsohnEnglish.pdf\n \n Also, the Canadian health care system generally ranks higher than the US's in studies, as well as by WHO, here's a couple of quick links on that - \n \n http://www.law.uh.edu/healthlawperspectives/HealthPolicy/000807Myth.html\n \n http://www.jhsph.edu/Press_Room/Press_Releases/PR_2004/Starfield_childhealth.html\n \n http://dll.umaine.edu/ble/U.S.%20HCweb.pdf\n \n Anyhoo, I'll leave it at that, no point in hijacking the thread any further.\n \n Waxy", 
   {}, 
   67861, 
   null, 
   1095790140.0
  ], 
  [
   67869, 
   null, 
   "Waxy", 
   "A quick note on topic -\n \n Should GWB and other coalition members not then take some responsibility for acting on info regarding WMDs that they hadn't fully corroborated?\n \n Replace Rather with Bush, and that story with WMDs, and I think you have a pretty analagous situation. One in which most Reps are very quick to defend Bush for acting on the info that he had available at the time.\n \n It would seem to me to be quite hypocritical to not grant that same benefit of the doubt to Rather.\n \n Waxy", 
   {}, 
   67868, 
   null, 
   1095790380.0
  ], 
  [
   67883, 
   null, 
   "georged", 
   "A quick note on topic -\n \n Should GWB and other coalition members not then take some responsibility for acting on info regarding WMDs that they hadn't fully corroborated?\n \n Replace Rather with Bush, and that story with WMDs, and I think you have a pretty analagous situation. One in which most Reps are very quick to defend Bush for acting on the info that he had available at the time.\n \n It would seem to me to be quite hypocritical to not grant that same benefit of the doubt to Rather.\n \n Waxy\n\n \n Especially since Rather's error didn't destroy the infrastructure of a country and kill 30,000 plus people.", 
   {}, 
   67869, 
   null, 
   1095796980.0
  ], 
  [
   67884, 
   null, 
   "Haulingboat", 
   "A quick note on topic -\n \n Should GWB and other coalition members not then take some responsibility for acting on info regarding WMDs that they hadn't fully corroborated?\n \n Replace Rather with Bush, and that story with WMDs, and I think you have a pretty analagous situation. One in which most Reps are very quick to defend Bush for acting on the info that he had available at the time.\n \n It would seem to me to be quite hypocritical to not grant that same benefit of the doubt to Rather.\n \n Waxy\n\n I have been waiting for one of you guys to throw this rediculous analogy out.\n \n Bush acted on information that was supported by two former presidential administrations as well as the U.N. Everybody on god's green earth knows that Sadaam had WMD. Hence the weapon inspectors in Iraq searching for WMDs. Hans Blitz. Remember him. \n \n Dan Rather took to air, documents that had little evidence backing them up and even fewer people atesting to their authenticity. These were documents passed around at a rodeo! No other news agency would get within ten feet of the documents. Yet CBS and Rather took the ball and ran. Comparing the two incedents is assinine and frankly I wouldn't have expected you, Waxy, to liken them to one another.\n \n At least Colin Powell had some pictures and supporting evidence. I hope this isn't too out of line for you.", 
   {}, 
   67869, 
   null, 
   1095797040.0
  ], 
  [
   67886, 
   null, 
   "Waxy", 
   "I have been waiting for one of you guys to throw this rediculous analogy out.\n \n Bush acted on information that was supported by two former presidential administrations as well as the U.N. Everybody on god's green earth knows that Sadaam had WMD. Hence the weapon inspectors in Iraq searching for WMDs. Hans Blitz. Remember him. \n \n Dan Rather took to air, documents that had little evidence backing them up and even fewer people atesting to their authenticity. These were documents passed around at a rodeo! No other news agency would get within ten feet of the documents. Yet CBS and Rather took the ball and ran. Comparing the two incedents is assinine and frankly I wouldn't have expected you, Waxy, to liken them to one another.\n \n At least Colin Powell had some pictures and supporting evidence. I hope this isn't too out of line for you.\n\n \n ....and I figured the typical knee jerk response would be exactly that. \"We're not hypocrits, that's apples and oranges.\" Complete with the righteuous indignation.\n \n I'm not going to go into the whole WMD debate here again, it's been done to death. Suffice to say we disagree on their existance at the time of the invasion and the UN's activities. The two key words in your paragraph are \"had\" and \"searching\".\n \n Bottom line, two people stood up and read what they were told to read and were assured was true by those that supplied the info. So, kill the messenger, or go after those that supplied the false info?\n \n Like it or not, \"assinine\" or not, them's the facts.\n \n Waxy", 
   {}, 
   67884, 
   null, 
   1095797700.0
  ], 
  [
   67890, 
   null, 
   "Haulingboat", 
   "....and I figured the typical knee jerk response would be exactly that. \"We're not hypocrits, that's apples and oranges.\" Complete with the righteuous indignation.\n \n I'm not going to go into the whole WMD debate here again, it's been done to death. Suffice to say we disagree on their existance at the time of the invasion and the UN's activities. The two key words in your paragraph are \"had\" and \"searching\".\n \n Bottom line, two people stood up and read what they were told to read and were assured was true by those that supplied the info. So, kill the messenger, or go after those that supplied the false info?\n \n Like it or not, \"assinine\" or not, them's the facts.\n \n Waxy\n\n But Rather wasn't \"assured\" anything. The so called experts told him nothing could be authenticated and he ran with it anyway. If you need some authentication on the WMD issue ask the Kurds whether he had them or not. They'll show the mass graves that prove he used them.\n \n There is nothing \"knee jerk\" about this response.", 
   {}, 
   67886, 
   null, 
   1095798600.0
  ], 
  [
   67891, 
   null, 
   "jim's trucking", 
   "....and I figured the typical knee jerk response would be exactly that. \"We're not hypocrits, that's apples and oranges.\" Complete with the righteuous indignation.\n \n I'm not going to go into the whole WMD debate here again, it's been done to death. Suffice to say we disagree on their existance at the time of the invasion and the UN's activities. The two key words in your paragraph are \"had\" and \"searching\".\n \n Bottom line, two people stood up and read what they were told to read and were assured was true by those that supplied the info. So, kill the messenger, or go after those that supplied the false info?\n \n Like it or not, \"assinine\" or not, them's the facts.\n \n Waxy\nLike it or not, this is \"apples and oranges\"...and Haulingboat is right. Rather had people in his own staff questioning the documents. He had people close to the supposed author saying they were not representative of what he would do. Rather and CBS chose to overlook those things.\n \n Bush had Clinton, GB, the UN and a host of others agreeing that Iraq had WMD.\n \n There is no way you or anybody else can prove they were wrong. Iraq had WMD. Where they went, we don't know, but they had them.\n \n It's amazing how simple logic goes out the window with a political cause.", 
   {}, 
   67886, 
   null, 
   1095798660.0
  ], 
  [
   67893, 
   null, 
   "Waxy", 
   "Like it or not, this is \"apples and oranges\"...and Haulingboat is right. Rather had people in his own staff questioning the documents. He had people close to the supposed author saying they were not representative of what he would do. Rather and CBS chose to overlook those things.\n \n Bush had Clinton, GB, the UN and a host of others agreeing that Iraq had WMD.\n \n There is no way you or anybody else can prove they were wrong. Iraq had WMD. Where they went, we don't know, but they had them.\n \n It's amazing how simple logic goes out the window with a political cause.\n\n \n Don't get all high and mighty here with the logic thing Jim. We could go back and forth all day setting up negatives for the other to try and prove. We've been through the whole WMD thing, we don't need to do it again.\n \n Bush too had several high ranking officials, both within and outside of his administration and the UN, that warned him about the veracity of the intelligence reports, many officially going on the record as such. \n \n He chose to overlook those things and charge ahead. \n \n How is that different again? \n \n Waxy", 
   {}, 
   67891, 
   null, 
   1095799740.0
  ], 
  [
   67896, 
   null, 
   "jim's trucking", 
   "Don't get all high and mighty here with the logic thing Jim. We could go back and forth all day setting up negatives for the other to try and prove. We've been through the whole WMD thing, we don't need to do it again.\n \n Bush too had several high ranking officials, both within and outside of his administration and the UN, that warned him about the veracity of the intelligence reports, many officially going on the record as such. \n \n He chose to overlook those things and charge ahead. \n \n How is that different again? \n \n Waxy\nI'm not operating here from smugness...just simple facts and logic. Dan Rather had no credible agreement with the authenticity of the document. Bush had the past administration, other governments and the UN seeing the same thing he did.\n \n I don't know what intelligence reports you're referring to (likely the African nuclear material purchase) so please elaborate on \"those things\".\n \n I realize we've \"been through\" the WMD thing time and again, but there seems to be no convincing of the skeptical that Iraq actually had any...simply because they haven't been found. What's your conclusion on the Iraqi WMD question? Did they ever have any?", 
   {}, 
   67893, 
   null, 
   1095800940.0
  ], 
  [
   67901, 
   null, 
   "Waxy", 
   "I'm not operating here from smugness...just simple facts and logic. Dan Rather had no credible agreement with the authenticity of the document. Bush had the past administration, other governments and the UN seeing the same thing he did.\n \n I don't know what intelligence reports you're referring to (likely the African nuclear material purchase) so please elaborate on \"those things\".\n \n I realize we've \"been through\" the WMD thing time and again, but there seems to be no convincing of the skeptical that Iraq actually had any...simply because they haven't been found. What's your conclusion on the Iraqi WMD question? Did they ever have any?\n\n \n Is it a perfect analogy? No. \n \n Nonetheless, the similiariteis are there and I think it stands up quite well. Try as you might, you certainly haven't debased it beyond a reasonable comparison meant simply to illustrate my point regarding hypocrisy and the \"kill the messenger\" mentality. I think it served quite well.\n \n As for WMD, I'm not interested. I've posted my stance several times previously, even in a debate with you, on other threads. Look it up if you care to.\n \n Waxy", 
   {}, 
   67896, 
   null, 
   1095802620.0
  ], 
  [
   67905, 
   null, 
   "jim's trucking", 
   "Is it a perfect analogy? No. \n \n Nonetheless, the similiariteis are there and I think it stands up quite well. Try as you might, you certainly haven't debased it beyond a reasonable comparison meant simply to illustrate my point regarding hypocrisy and the \"kill the messenger\" mentality. I think it served quite well.\n \n As for WMD, I'm not interested. I've posted my stance several times previously, even in a debate with you, on other threads. Look it up if you care to.\n \n Waxy\nThat is a weak response. The situations are about as similar as are a Yugo and a Bugatti. They're both cars with funny names. By your way of thinking here, if I had one of each, both painted red, they'd be the same.\n \n CBS and Dan Rather have been pro-Democrat, pro-liberal for years. The only thing they haven't been is pro-fessional.", 
   {}, 
   67901, 
   null, 
   1095803160.0
  ], 
  [
   67908, 
   null, 
   "Haulingboat", 
   "That is a weak response. The situations are about as similar as are a Yugo and a Bugatti. They're both cars with funny names. By your way of thinking here, if I had one of each, both painted red, they'd be the same.\n \n CBS and Dan Rather have been pro-Democrat, pro-liberal for years. The only thing they haven't been is pro-fessional.\n\n \n They are also treading very closely to a scandal of epic proportion. Here we have a MAJOR news organisation with forged documents that are aimed at defacing a current president. The sole purpose of running the story was to discredit the president. Period. That is a fine line.", 
   {}, 
   67905, 
   null, 
   1095803460.0
  ], 
  [
   67913, 
   null, 
   "Waxy", 
   "That is a weak response. The situations are about as similar as are a Yugo and a Bugatti. They're both cars with funny names. By your way of thinking here, if I had one of each, both painted red, they'd be the same.\n \n CBS and Dan Rather have been pro-Democrat, pro-liberal for years. The only thing they haven't been is pro-fessional.\n\n \n This is a weak response.\n \n Try as you might to belittle or trivialize it (unsuccessfully IMHO), I stand by my point.\n \n I'm not surprised at your resorting to generalizations and \"catty\" quips.\n \n Waxy", 
   {}, 
   67905, 
   null, 
   1095804360.0
  ], 
  [
   67915, 
   null, 
   "jim's trucking", 
   "This is a weak response.\n \n Try as you might to belittle or trivialize it (unsuccessfully IMHO), I stand by my point.\n \n I'm not surprised at your resorting to generalizations and \"catty\" quips.\n \n Waxy\nWhy, Waxy, I wasn't being catty. I was simply using an analogy.\n \n I thought I was quite specific. Where did I generalize? \n \n As you did not answer the request to elaborate on \"those things\", I'm assuming you won't answer this either.", 
   {}, 
   67913, 
   null, 
   1095804840.0
  ], 
  [
   67916, 
   null, 
   "jskufan", 
   "They are also treading very closely to a scandal of epic proportion. Here we have a MAJOR news organisation with forged documents that are aimed at defacing a current president. The sole purpose of running the story was to discredit the president. Period. That is a fine line.\n\n \n The only way this goes beyond chapping the \"rear ends\" of Republicans is for someone to step up with detailed, definitive information on what George Jr. actually did for the last year and a half of his Air National Guard service. We all know that's not going to happen; if the information was around to silence the Democrats for good, it would have been brought out by now.", 
   {}, 
   67908, 
   null, 
   1095805080.0
  ], 
  [
   67917, 
   null, 
   "jim's trucking", 
   "The only way this goes beyond chapping the \"rear ends\" of Republicans is for someone to step up with detailed, definitive information on what George Jr. actually did for the last year and a half of his Air National Guard service. We all know that's not going to happen; if the information was around to silence the Democrats for good, it would have been brought out by now.\nIIRC, GWB released ALL of his military records by signing a form that specifically released them...ALL of them. He has nothing to hide.\n \n Kerry, on the other hand, merely says that his documents are available for anyone to come and look at. (Fat chance you'll ever have of looking at them.) Why doesn't he sign the same form George did? ...cause he's got something to hide. [The TRUTH!] He's already told so many lies about his military service, he doesn't want you to see documented evidence to the contrary.\n \n This is something Dan Rather would rather not tell you.\n \n ...", 
   {}, 
   67916, 
   null, 
   1095805620.0
  ], 
  [
   67919, 
   null, 
   "Haulingboat", 
   "The only way this goes beyond chapping the \"rear ends\" of Republicans is for someone to step up with detailed, definitive information on what George Jr. actually did for the last year and a half of his Air National Guard service. We all know that's not going to happen; if the information was around to silence the Democrats for good, it would have been brought out by now.\n\n Wrong, if the source of these documents are linked to the democratic party or Kerry's campaign in anyway then we got us a scandal to the likes of Watergate. Another disgrace to the already flidgling Democratic party.", 
   {}, 
   67916, 
   null, 
   1095805980.0
  ], 
  [
   67924, 
   null, 
   "jskufan", 
   "Wrong, if the source of these documents are linked to the democratic party or Kerry's campaign in anyway then we got us a scandal to the likes of Watergate. Another disgrace to the already flidgling Democratic party.\n\n \n You certainly have a fertile imagination. If you can find 10 people in America (excluding you and Jim's Trucking) that care who wrote the document I'd be suprised. What exactly are you hoping will come out of all this? Enjoy all the media coverage, every minute they're criticizing Dan Rather is a minute they're not reporting on Iraq.", 
   {}, 
   67919, 
   null, 
   1095807480.0
  ], 
  [
   67927, 
   null, 
   "jim's trucking", 
   "You certainly have a fertile imagination. If you can find 10 people in America (excluding you and Jim's Trucking) that care who wrote the document I'd be suprised. What exactly are you hoping will come out of all this? Enjoy all the media coverage, every minute they're criticizing Dan Rather is a minute they're not reporting on Iraq.\nYou don't want to know who forged the documents because you suspect it was someone connected with your candidate.\n \n People who value honesty want to know who did it.", 
   {}, 
   67924, 
   null, 
   1095808380.0
  ], 
  [
   67933, 
   null, 
   "georged", 
   "Honesty in politics? Informed Americans? Iraq? the economy? Hahahahahahahahahahaha.", 
   {}, 
   67927, 
   null, 
   1095810060.0
  ], 
  [
   67938, 
   null, 
   "Haulingboat", 
   "You certainly have a fertile imagination. If you can find 10 people in America (excluding you and Jim's Trucking) that care who wrote the document I'd be suprised. What exactly are you hoping will come out of all this? Enjoy all the media coverage, every minute they're criticizing Dan Rather is a minute they're not reporting on Iraq.\n\n \n \n A little retribution, a little payback for all the times Dan and the gang have pounched on anyone on the right. Like when they called Lott a bigot thru association w/Thurman, or when they ran Gingrich out of office all for infractions of a lesser degree than this. I'd like to see Dan take the fall for every single person that call Limbaugh a racist because of his McNabb comment. Turned out that he was right when McNabb lost his third straight NFC Championship. Rush was forced to resign from ESPN.\n \n Now, I have been around here long enough to know what is coming next. So before you start bashingm, know that I have not pledge my allegiance to any of the above figures. But I have taken notice, and ask you all to do the same, that one of your top dogs has landed himself in hot water. I'd like to see him suffer the same fate as some of his victims.\n \n A quick list of Rathers failures that come to mind.\n \n *Stormed off the set of a live shoot while throwing a temper tantrum. 8minutes of dead air were broadcast while he pouted.\n \n *Ignored the stolen document-Sandy Berger issue to cover the kicked chickens in the south.\n \n *Ran the forged document story.\n \n *Stood behind the forged document story on 60 minutes.\n \n *Said the documents might not be true but the story is.\n \n *Admitted it was all a crock and appologized for being a bad journalist.Yet blamed someone else for the whole thing and accepted no responsiblity.\n \n \n Anyone that continues to watch this man for information gathering purposes is more foolish the he is.", 
   {}, 
   67924, 
   null, 
   1095811980.0
  ], 
  [
   67940, 
   null, 
   "Waxy", 
   "like to see Dan take the fall for every single person that call Limbaugh a racist because of his McNabb comment. Turned out that he was right when McNabb lost his third straight NFC Championship. Rush was forced to resign from ESPN.\n\n \n Wow. emoticon_confused :( \n \n I'm shocked at this one Haulingboat, even given your leanings and general disdain for anything \"PC\", this one is glaring.\n \n I can't begin to imagine how you're going explain that McNabb's race is at all relevent, let alone how you're going to explain that the EAGLES losing a third NFC Championship proves Limbaugh's point. emoticon_confused \n \n Do you follow football at all? Are you aware of McNabb's stats? Are you aware of the receivers he had around him? Do you realize how hard it is just to get to an championship game? That it takes a TEAM effort to win a SuperBowl?\n \n Again. Unreal. :( \n \n You should be apologizing for that one IMHO.\n \n Waxy\n \n ON EDIT: Actually, after some thought, I'm not shocked by this post - given the source, I shouldn't even really be surprised, I try to give people the benefit of the doubt though. \n \n Disgusted would be more appropriate.", 
   {}, 
   67938, 
   null, 
   1095812580.0
  ], 
  [
   67941, 
   null, 
   "Justin Leither", 
   "Wrong, if the source of these documents are linked to the democratic party or Kerry's campaign in anyway then we got us a scandal to the likes of Watergate. Another disgrace to the already flidgling Democratic party.\n\n \n That would be a huge scandal if that turned out to be the case. And I'm sure the congressional leadership that has been calling out CBS (Blunt and Co.) will find a link if one exists.", 
   {}, 
   67919, 
   null, 
   1095812580.0
  ], 
  [
   67946, 
   null, 
   "jskufan", 
   "You don't want to know who forged the documents because you suspect it was someone connected with your candidate.\n \n People who value honesty want to know who did it.\n\n \n Jim, if I didn't have the benefit of reading your 2,000,000+/- previous politically biased posts I might actually think you were sincere, but unfortunately, I did. ;) Let me put it this way, I could care less about who forged the documents because it has no bearing on anything that's even remotely important to anything that matters in America. If it turns out to be a Democrat, I'm not suprised. If it turns out to be a Republican, I'm not suprised. If I was a Republican, I'd try to move off Bush's Guard service as quickly as possible, it's a lose/lose either way.", 
   {}, 
   67927, 
   null, 
   1095814440.0
  ], 
  [
   68026, 
   null, 
   "Haulingboat", 
   "[QUOTE=Waxy]Wow. emoticon_confused :( \n \n I\\'m shocked at this one Haulingboat, even given your leanings and general disdain for anything \"PC\", this one is glaring.\n \n I can\\'t begin to imagine how you\\'re going explain that McNabb\\'s race is at all relevent, let alone how you\\'re going to explain that the EAGLES losing a third NFC Championship proves Limbaugh\\'s point. emoticon_confused \n \n Do you follow football at all? Are you aware of McNabb\\'s stats? Are you aware of the receivers he had around him? Do you realize how hard it is just to get to an championship game? That it takes a TEAM effort to win a SuperBowl?\n \n Again. Unreal. :( \n \n What is so shocking? The comment limbaugh made was not a racial slur. It was accusing the press of giving the guy preferetial treatment because he is black. Reverse racism, which I believe we have discussed here. The press and ESPN cast took it as a racial slur instead of understanding what Limbaugh meant. \n Truth be told he should not have brought his politics to the show. But that does not make him a racist. It does go to show how bias the media is though. They couldn\\'t stand having him on the show and they pounced on the first thing they could to get him off.\n \n Yes, I do follow football. I follow college football much more closely than the NFL. The Terrell Owens and Warren Sapp attitude is killing the professional game. I\\'ll also throw Winslow and Keyshawn Johnson into that mix.\n \n College player\\'s are still hungry. They still have something to achieve and therefore provide better sports. \n \n I stand by my statement of McNabb. Your right, he can put up stats and win enough games to get to the playoffs but he has proven he cannot win a big game. During the regular season he losses big match ups. The Pathers were big time underdogs last year and they smoked him and the Eagles. If I were a coach in the NFC I\\'d be begging to play them in the NFC Championship this year. It is reminiscent of the Buffalo Bills in the Jim Kelly era. Always get to the big one but never quite pull it off. He is almost great.", 
   {}, 
   67940, 
   null, 
   1095880980.0
  ], 
  [
   68101, 
   null, 
   "CCR1994", 
   "Wow. emoticon_confused :( \n \n I\\'m shocked at this one Haulingboat, even given your leanings and general disdain for anything \"PC\", this one is glaring.\n \n I can\\'t begin to imagine how you\\'re going explain that McNabb\\'s race is at all relevent, let alone how you\\'re going to explain that the EAGLES losing a third NFC Championship proves Limbaugh\\'s point. emoticon_confused \n \n Do you follow football at all? Are you aware of McNabb\\'s stats? Are you aware of the receivers he had around him? Do you realize how hard it is just to get to an championship game? That it takes a TEAM effort to win a SuperBowl?\n\n \n You are right to point out that it takes a TEAM effort to win a Super Bowl. If I remember correctly, Rush stated that McNabb was getting credit that the DEFENSE deserved for getting the Eagles to the Championship games. I do have to wonder why it is that Coy Detmer and A J Feely were able to step right in for an injured McNabb and do so well with it back in \\'02. Normally, backup qb\\'s don\\'t perform as well as the starter yet both of these backups actually performed better with the same mediocre receivers.", 
   {}, 
   67940, 
   null, 
   1095945540.0
  ], 
  [
   68124, 
   null, 
   "Waxy", 
   "I told myself I wasn\\'t going to respond to this any further, but the support for Limbaugh just baffles me.\n \n Here\\'s Rush\\'s quote.\n \n \n\"McNabb is overrated ... what we have here is a little social concern in the NFL. The media has been very desirous that a black quarterback can do well-black coaches and black quarterbacks doing well. There\\'s a little hope invested in McNabb, and he got a lot of credit for the performance of his team that he didn\\'t deserve. The defense carried this team.\" \n \n \n Why didn\\'t he just say \"McNabb is overrated, the defense is the key.\"?\n \n Guess what, a lot of people would have said, \"You know, he might have a point there.\"\n \n Instead, he chose to make it an issue of race.\n \n What the hell does his race have to do with anything? NOTHING. \n \n There are lots of black quarterbacks in the NFL, some great, some not so great, some win, some don\\'t. \n \n Based purely on statistics, McNabb is undeniably off to one of the best starts of any QB in NFL history. His numbers compare to Favre\\'s and Elway\\'s, he plays tough, and he plays smart. The only knock on the guy is not winning the Championship games. If you watched any of those 3 games, you\\'d know that the reason they lost had a little to do with McNabb himself. Philly\\'d offense consistently ranks somewhere around the middle of the back, to as high as 11th in 2002. That\\'s partly McNabb, but mostly the system and the players he\\'s surrounded with.\n \n Does McNabb get a lot of attention? Of course he does. He\\'s a QB in the NFL. They ALL do. Not only that, but the guy has a great personality.\n \n Anyhoo, I could go on and on, but the bottom line is, Limbaugh\\'s comments were completely out of line, baseless, and quite frankly, assinine.\n \n If you want to talk stats or argue about who\\'s the best QB, McNabb, etc... I\\'m game, we could go on for days, but what would race have to do with that conversation?\n \n Waxy", 
   {
    "unicode_changes_made": true
   }, 
   68101, 
   null, 
   1095958560.0
  ], 
  [
   68193, 
   null, 
   "Justin Leither", 
   "Anyhoo, I could go on and on, but the bottom line is, Limbaugh\\'s comments were completely out of line, baseless, and quite frankly, assinine.\n \n \n Totally agree. Glad they got rid of him.", 
   {}, 
   68124, 
   null, 
   1095988560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is Dan Rather \"in the tank\" for KERRY?", 
  "url": "http://www.4forums.com/political/current-events-debates/3210-dan-rather-tank-kerry.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 3210, 
  "discussion_files": [
   [
    "19665.html", 
    "http://www.4forums.com/political/current-events-debates/3210-dan-rather-tank-kerry-print.html"
   ], 
   [
    "19666.html", 
    "http://www.4forums.com/political/current-events-debates/3210-dan-rather-tank-kerry-3-print.html"
   ], 
   [
    "19667.html", 
    "http://www.4forums.com/political/current-events-debates/3210-dan-rather-tank-kerry-2-print.html"
   ]
  ], 
  "identifier": 3210
 }
]