[
 [
  [
   67880, 
   null, 
   "SLP", 
   "This board had died for a while, now it looks like it is getting active again.\n \n We often hear creationists ask that the 'controversey' be taught, that 'both sides' should be presented, that the evidence for creation be taught alongside the evidence for evolution.\n \n My question - what evidence for creation could be taught?\n \n What IS the evidence for creation?\n \n \n Keep in mind, claiming such things as radiometric dating is flawed does not mean that the earth is no more than 10,000 years old.\n \n What actually points to a 10,000 year old earth?\n \n What evidence actually indicates a world-wide flood?\n \n What evidence actually indicates the seperate creation of humans?\n \n Etc.", 
   {
    "post_info": {
     "post_title": "Teach the controversey"
    }
   }, 
   null, 
   null, 
   1095795060.0
  ], 
  [
   67885, 
   null, 
   "OccamsRazor", 
   "Well, where to start? emoticon_ic\n \n Firstly, the use of language is a powerful thing- it is quite possible to make something seem more than it really is by th selection of the right words. So controversy is a good example in this case, particularly in the context most of us use it today- it sounds so much better than disagreement or debate. If Creationists say there is controversy surrounding evolution and its associated sciences and say it enough people start to think it.\n \n As to teaching creationism alongside evolution, well how do you do that?\n \n What is the audience? I suppose we are on about children here. Well, if we are going to take account of one faith based outlook on earth history, we should make efforts to cover any and all such stories, per the cultural background of the children.\n \n So what setting do we choose for this to taught in? many Young Earth Creationists seem to think that science class is a suitable forum, but we could just as easily put evolution into religous education class as well. One is as unsuitable as the other.\n \n Then we really get to a crux- once we teach a faith based interpretation alongside a scienfic one based on the objections of people who hold that belief anything is open to the same treatment. Where do you draw the line?\n \n \n Anyway, I digress- to address your point SLP, the evidence for YEC stems from passages in the Bible. Sooner or later, thats what it comes back too. Creation \"science\" aims to prove the Bible re: earth and life history by making up material in the style of science that supports a 6000 year old earth and also is at odds with the mainstream scientific conclusions that have been reached.\n \n So basically, do we teach the Bible in science class? emoticon_xangel", 
   {}, 
   67880, 
   null, 
   1095797460.0
  ], 
  [
   67997, 
   null, 
   "SLP", 
   "\n Anyway, I digress- to address your point SLP, the evidence for YEC stems from passages in the Bible. Sooner or later, thats what it comes back too. Creation \"science\" aims to prove the Bible re: earth and life history by making up material in the style of science that supports a 6000 year old earth and also is at odds with the mainstream scientific conclusions that have been reached.\n \n So basically, do we teach the Bible in science class?\n\n \n Indeed.\n \n But the creationists claim that is has 'true science' on its side.\n \n I wonder why the resident creationists have not graced us with a brief summary of their science?", 
   {}, 
   67885, 
   null, 
   1095868200.0
  ], 
  [
   68030, 
   null, 
   "Alan Ryan", 
   "Well, where to start? emoticon_ic\n \n \n So basically, do we teach the Bible in science class?\n\n \n The answer is, or should be, No. The study of the Bible should \n be a private activity. There is quite enough essential information\n to acquire (and basic skills to master) in school without teachers\n wasting the students' time inculcating metaphysics and myths.", 
   {
    "post_info": {
     "post_title": "Teaching the Bible"
    }
   }, 
   67885, 
   null, 
   1095885720.0
  ], 
  [
   68238, 
   null, 
   "accipitridae", 
   "The answer is, or should be, No. The study of the Bible should be a private activity.\n\n Not \"should be.\" The answer is no. When I was teaching 7th grade science I made Friday a question day. Any question about any scientific topic was allowed. My purpose was to instruct in what science is and how it works. My promise was to answer the question to the best of my knowledge, and if I didn't have an answer, to research it and present it on Monday. Friday was the day that students wanted to come to school for my class. They actually thought that they were somehow escaping \"school work\" by asking questions. The usual drill was to try to draw answers from the students themselves. Sometimes, explanations and board diagrams were necessary to lead them to the conclusion. Man! We had fun on Friday.\n \nThere is quite enough essential information to acquire (and basic skills to master) in school without teachers wasting the students' time inculcating metaphysics and myths.\n\n Certainly true. Science class is no place for either.", 
   {}, 
   68030, 
   null, 
   1096009260.0
  ], 
  [
   68809, 
   null, 
   "SLP", 
   "This board had died for a while, now it looks like it is getting active again.\n \n We often hear creationists ask that the 'controversey' be taught, that 'both sides' should be presented, that the evidence for creation be taught alongside the evidence for evolution.\n \n My question - what evidence for creation could be taught?\n \n What IS the evidence for creation?\n \n \n Keep in mind, claiming such things as radiometric dating is flawed does not mean that the earth is no more than 10,000 years old.\n \n What actually points to a 10,000 year old earth?\n \n What evidence actually indicates a world-wide flood?\n \n What evidence actually indicates the seperate creation of humans?\n \n Etc.\n\n Yeah, this one...", 
   {}, 
   67880, 
   null, 
   1096393380.0
  ], 
  [
   68913, 
   null, 
   "pnac=ww3", 
   "The \"controversy\" should be brought up when discussing evolution in school science class.\n \n The kids are likely going to hear about it anyway. They may go to church and be told that all that stuff they are told in science class about evolution is bunk. The kid has to decide which to believe and in the end becomes more cynical for it. (not that it's a bad thing)\n \n If, in class, it is demonstrated what science is, how it works, and how it's done, then it is shown how science has led to conclusions that favor the theory of evolution, it would be time to bring in the \"controversy.\"\n \n Creationism can be brought in with all its various claims. In a modern class there would be computers and internet connections. They could go to AiG or something similar to look up what the claims of creationism are. Then students would have to figure out which claims are supported by scientific evidence and which are not.\n \n Students could be given an assignment to determine which \"theory\" is science , if either, and which is not, if either. \n \n The problem will come when little Billy goes home and tells Mum that the teacher said that the Bible is wrong. Then comes the real \"controversy.\"", 
   {}, 
   68809, 
   null, 
   1096419840.0
  ], 
  [
   68982, 
   null, 
   "SLP", 
   "\n \n The problem will come when little Billy goes home and tells Mum that the teacher said that the Bible is wrong. Then comes the real \"controversy.\"\n\n \n \n Indeed.\n \n If a teacher teaches 'the controversey' correctly, and lays out the facts and let's kids decide for themselves (is that done for ANY subject?), certainly, the most indoctrinated will say creation wins. But what about the open-minded? What about the students that can actually grasp the fact that creationism offers nothing in the way of supporting evidence? that is rests solely on trying to poke holes in evolution and appeals to biblical authority? Those students will conclude that creatiomnism is bogus, and may cause them to question their 'beliefs.'\n \n Two things could happen:\n \n 1. the Right -wing zealots will enforce laws making it a crime to put creationism ina poor light, forcing teachers to bow down or be fired. Conservative correctness with the force of law.\n \n 2. the Right-wing zealots will realize that their little plan backfired, and let the issue die \n \n \n Scarily, if this should come to pass, if things do not change much politically, I see option 1 as the most likely.\n During the Cold War, politicians had 'godless Soviet atheism' to rally against with religious fervor. The Conservatives are now latching onto Fundamentalist Islam as the new 'Red Horde'. And lots of gullible people are\n buying into it.", 
   {}, 
   68913, 
   null, 
   1096469760.0
  ], 
  [
   72354, 
   null, 
   "stormboy", 
   "Indeed.\n \n But the creationists claim that is has 'true science' on its side.\n \n I wonder why the resident creationists have not graced us with a brief summary of their science?\n\n How do we get a tree to stand upright long enough for it to petrify, and how do we get upright petrified trees in layers of strata.\n There is evidence all over the world that stands up for biblical events, all you need to do is open yourself up and have a look..\n I urge you guys to get a hold of the movie \"The search for the real Mt Sianai\". This movie is rivetted with evidence for the Moses account in the bible. Any person with there head screwed on right will not be able to deny it!", 
   {}, 
   67997, 
   null, 
   1098198000.0
  ], 
  [
   72357, 
   null, 
   "stormboy", 
   "Indeed.\n \n But the creationists claim that is has 'true science' on its side.\n \n I wonder why the resident creationists have not graced us with a brief summary of their science?\n\n How can a evolutionist see when they simply dont want to..\n To agree that the earth was created means to admit there is a GOD, and to admit there is a GOD will mean being confronted with the descision to give up the sinful life with all its desires..\n John 12:24 \"I tell you the truth, unless a kernel of wheat falls to the ground and dies, it remains only a single seed. But if it dies, it produces many seeds. The man who loves his life will lose it, while the man that hates his life in this world will keep it for eternal life\"", 
   {}, 
   67997, 
   null, 
   1098199260.0
  ], 
  [
   72388, 
   null, 
   "Waxy", 
   "How do we get a tree to stand upright long enough for it to petrify, and how do we get upright petrified trees in layers of strata.\n\n \n LOL. :p \n \n Do you have a link or some evidence for this mystery tree?\n \n How do trees become petrified? How long does that take? What conditions are required? How did those layers of strata become emplaced? What caused them to solidify into stone?\n \n Come on Stormboy, this assertion is laughable. Please take the time to understand what you're talking about before you dismiss, or even worse, cite as evidence such unfounded claims to support your argument.\n \n \nThere is evidence all over the world that stands up for biblical events, all you need to do is open yourself up and have a look..\n\n \n I'd love to have a look, why don't you post some of it, or even just some links to it. ;)\n \n \nI urge you guys to get a hold of the movie \"The search for the real Mt Sianai\". This movie is rivetted with evidence for the Moses account in the bible. Any person with there head screwed on right will not be able to deny it!\n\n \n Interesting. Where might one find this movie?\n \n Waxy", 
   {}, 
   72354, 
   null, 
   1098206640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Teach the controversey", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3241-teach-controversey.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 3241, 
  "discussion_files": [
   [
    "4417.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3241-teach-controversey-print.html"
   ]
  ], 
  "identifier": 3241
 }
]