[
 [
  [
   67931, 
   null, 
   "jim's trucking", 
   "Dan Rather, visibly shaken by the recent disclosure of his ineptness, has come up with a redeeming story disclaiming the resurrection of Christ. He has proof that it didn't happen.\n \n http://www.holyobserver.com/detail.php?isu=v02i04&art=cbs\n \n Please disregard the fact that the document is in English cursive, written with a Flair Roller-Writer. It may be fake, but it's accurate.\n \n ...", 
   {
    "post_info": {
     "post_title": "CBS has another scoop for you!"
    }
   }, 
   null, 
   null, 
   1095809280.0
  ], 
  [
   67934, 
   null, 
   "Big Orn", 
   "A cheap shot, Jim...but it was funny and that's one up on the other one, huh? emoticon_smile", 
   {}, 
   67931, 
   null, 
   1095810180.0
  ], 
  [
   67951, 
   null, 
   "pnac=ww3", 
   "Did you know that Dan Rather and Donald Rumsfeld co-own a ranch in New Mexico?\n \n http://www.time.com/time/press_releases/article/0,8599,565993,00.html\n \nCo-Owns New Mexico Ranch with Dan Rather, among others: You would think, especially after Saddam's capture, that Rumsfeld could pack it in, go out on top and settle down in that ranch in Taos, N.M., that he co-owns with, among others, Dan Rather, TIME reports. Boyhood chum Ned Jannotta, who ran his first campaign for Congress in 1962, notes that Rumsfeld never has cared about staying anywhere very long. \"He doesn't look for security in his life,\" says Jannotta. \"It gives him great freedom to do and try and risk and fail. He's prepared to go head to head-winner take all, no second-place money-and still fail. That runs through his life.\"\n", 
   {
    "unicode_changes_made": true
   }, 
   67934, 
   null, 
   1095815820.0
  ], 
  [
   67987, 
   null, 
   "jim's trucking", 
   "A cheap shot, Jim...but it was funny and that's one up on the other one, huh? emoticon_smile\nMaybe so. I just thought it to be a good joke a that hits the new CBS motto very well. \"It may be fake, but it's accurate!\"\n \n Loosen up!\n \n ...", 
   {}, 
   67934, 
   null, 
   1095861420.0
  ], 
  [
   67990, 
   null, 
   "Big Orn", 
   "Loosen up!\n \n ...\n\n The \"cheap shot\" made it funny, Jim.... \n \n Hello? :p", 
   {}, 
   67987, 
   null, 
   1095864360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  CBS has another scoop for you!", 
  "url": "http://www.4forums.com/political/fun-debates/3244-cbs-has-another-scoop-you.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 3244, 
  "discussion_files": [
   [
    "21981.html", 
    "http://www.4forums.com/political/fun-debates/3244-cbs-has-another-scoop-you-print.html"
   ]
  ], 
  "identifier": 3244
 }
]