[
 [
  [
   68208, 
   null, 
   "syklopps61", 
   "Should military and civilian personnel have a locator device implanted in their bodies while in Iraq? Seems to me that this could end the problem of people being kidnapped and beheaded...we would know where they are at and obviously could nab or kill a good number of these animals. Naturally, when word got out, if they were smart they would stop taking hostages and at least that would be one less problem to worry about. And no, I'm not saying that would stop ALL the killing, but it certainly would deny the terrorists the thrill of beheading people on camera for the world to see", 
   {
    "post_info": {
     "post_title": "Question"
    }
   }, 
   null, 
   null, 
   1095992700.0
  ], 
  [
   68212, 
   null, 
   "lord tammerlain", 
   "It could lead to many more problems though. \n \n If the insurgents realise that chips are implanted and know about it. \n \n Here is a scenario. \n \n 1. Kidnap a civilian.\n 2. Immediately remove said body part that contains chip. ( putting in the head wouldnt help here)\n 3. Place said body part and chip in area where they set up an ambush (land mines, car bombs, or even a good gunfight.\n \n Second scenario depending on what US response would be to finding out where chip is. Assuming US response would be no negotiation just drop a bomb. \n \n 1. Kidnap a civilian.\n 2. Immediately remove said body part that contains chip. ( putting in the head wouldnt help here)\n 3. Place chip in location that is not anti US occupation and wait for the US to drop bombs on suspected terrorist hideout, killing Iraqi civilians, or any other target the insurgents wanted the US to hit.\n \n Things like locator chips are only really usefull in limited cases when the enemy would not expect there use.", 
   {}, 
   68208, 
   null, 
   1095993480.0
  ], 
  [
   68290, 
   null, 
   "Famous Amos", 
   "It could lead to many more problems though. \n \n If the insurgents realise that chips are implanted and know about it. \n \n Here is a scenario. \n \n 1. Kidnap a civilian.\n 2. Immediately remove said body part that contains chip. ( putting in the head wouldnt help here)\n 3. Place said body part and chip in area where they set up an ambush (land mines, car bombs, or even a good gunfight.\n \n Second scenario depending on what US response would be to finding out where chip is. Assuming US response would be no negotiation just drop a bomb. \n \n 1. Kidnap a civilian.\n 2. Immediately remove said body part that contains chip. ( putting in the head wouldnt help here)\n 3. Place chip in location that is not anti US occupation and wait for the US to drop bombs on suspected terrorist hideout, killing Iraqi civilians, or any other target the insurgents wanted the US to hit.\n \n Things like locator chips are only really usefull in limited cases when the enemy would not expect there use.\n\n \n \n I don't think it is that easy to determine if someone has a chip. When people sell expensive and rare dogs or snakes, very small chips are surgically implanted underneath the skin. It does not harm the animal at all, can be taken out when needed, and it cannot be seen. And I highly doubt that terrorists are thinking about devices. I think Skylopps idea is great. If the military kept the idea on the down low nobody would know, neither us nor terrorists, and we could save more hostages and kill those who kidnap them. Great idea Skylopps!!", 
   {}, 
   68212, 
   null, 
   1096048440.0
  ], 
  [
   68294, 
   null, 
   "lord tammerlain", 
   "I was going on the premise that it was going to be a large scale thing.\n \n \n \n A little Abu Graib interrogation by the insurgents could give them the informationt that they need about any chips.", 
   {}, 
   68290, 
   null, 
   1096049580.0
  ], 
  [
   68297, 
   null, 
   "Waxy", 
   "How do you know they don't have them already. ;) \n \n As for a large scale effort, kind of like replacing the dog tag, I would tend to agree with Lord Tammerlain in that scenario.\n \n Waxy", 
   {}, 
   68294, 
   null, 
   1096050480.0
  ], 
  [
   68312, 
   null, 
   "Famous Amos", 
   "I was going on the premise that it was going to be a large scale thing.\n \n \n \n A little Abu Graib interrogation by the insurgents could give them the informationt that they need about any chips.\n\n \n \n Even if it were a large scale thing, your 2 plans for the terrorists won't work. How will they know what body part to cut off if they can't see the device?", 
   {}, 
   68294, 
   null, 
   1096053900.0
  ], 
  [
   68320, 
   null, 
   "lord tammerlain", 
   "A little Abu Ghraib interrogation to get the people to tell then emoticon_idea Or just kill the person and disect them to find it.\n \n The prisoner given enough incentive will probably tell the insurgents where it is located.\n \n Again this could work on small scale levels where certain people have the chips not everyone. Dont forget the insurgents have tv's and phones, and possibly internet access in some form. A few warning and they will expect it and plan for it.", 
   {}, 
   68312, 
   null, 
   1096056420.0
  ], 
  [
   68321, 
   null, 
   "Waxy", 
   "Even if it were a large scale thing, your 2 plans for the terrorists won't work. How will they know what body part to cut off if they can't see the device?\n\n \n They'll just cut them all off. :( \n \n If they even cut them off at all, in most cases they wouldn't need to dismember the captive in order to use his chip as a trap.\n \n I would also think there would be a way of detecting the device, x-ray, gamma ray, etc...\n \n Waxy", 
   {}, 
   68312, 
   null, 
   1096056600.0
  ], 
  [
   68479, 
   null, 
   "Famous Amos", 
   "They'll just cut them all off. :( \n \n If they even cut them off at all, in most cases they wouldn't need to dismember the captive in order to use his chip as a trap.\n \n I would also think there would be a way of detecting the device, x-ray, gamma ray, etc...\n \n Waxy\n\n \n Great idea!! Zarqawi is running around Iraq with X-ray machines and making the hostages run through them before they behead them? We are dealing with an enemy using Cold War weapons, not a doctor or a baggage screener at the airport.", 
   {}, 
   68321, 
   null, 
   1096159860.0
  ], 
  [
   68484, 
   null, 
   "syklopps61", 
   "I don't think it is that easy to determine if someone has a chip. When people sell expensive and rare dogs or snakes, very small chips are surgically implanted underneath the skin. It does not harm the animal at all, can be taken out when needed, and it cannot be seen. And I highly doubt that terrorists are thinking about devices. I think Skylopps idea is great. If the military kept the idea on the down low nobody would know, neither us nor terrorists, and we could save more hostages and kill those who kidnap them. Great idea Skylopps\n\n \n Amos, I wish I could take credit for it! I heard it on a talk show here in Atlanta. :-D You're right though, these people are going to be more concerned about what they are doing NOW and how they can get the next one. I don't think they are going to waste time and money worrying about whether or not we put chips in people. From what I hear, this Zarqawi guy is the one they think is doing the beheadings, and all it would take is ONE time and we could take him out. You made a good point that these can be hidden in all sorts of areas and the terrorists most likely do not have the equipment to look for them. Hey, for all we know, the terrorists can do their work stress free because they know the ACLU would fight this sort of thing to the death anyway LOL Bottom line to me is that we would be taking a weapon away from them, no more propaganda or exploitation of the hostages. There is no question, they could easily go into these places and still kill people that WOULD have been hostages, but at least there would not be any suffering and anguish endured by the hostages and their families", 
   {}, 
   68290, 
   null, 
   1096162620.0
  ], 
  [
   68488, 
   null, 
   "daewoo", 
   "Great idea!! Zarqawi is running around Iraq with X-ray machines and making the hostages run through them before they behead them? We are dealing with an enemy using Cold War weapons, not a doctor or a baggage screener at the airport.\n\n \n Unfortunatly you are also talking about an enemy with hundreds of millions, if not billions of dollars in oil money backing them. \n \n This kind of idea has it's down side, namely that it would be such a valuable tool for the insurgents that it is unlikely that they would let the opportunity pass to exploit it. If you start putting tracking chips in people, you can be certain that the terrorists will start tracking them. \n \n I have a brother who is a mechanic. He recently purchased a new car, and the first thing he did was disable the onboard assistance system (I think it was Onstar). He explained that they can use the system to unlock your doors by sattelite. Unfortunatly, car theives have learned to replicate the signal and can unlock your doors without ever touching tht ecar (and in some models even start the vehicle).", 
   {}, 
   68479, 
   null, 
   1096166040.0
  ], 
  [
   68562, 
   null, 
   "lord tammerlain", 
   "Amos, I wish I could take credit for it! I heard it on a talk show here in Atlanta. :-D You're right though, these people are going to be more concerned about what they are doing NOW and how they can get the next one. I don't think they are going to waste time and money worrying about whether or not we put chips in people. From what I hear, this Zarqawi guy is the one they think is doing the beheadings, and all it would take is ONE time and we could take him out. You made a good point that these can be hidden in all sorts of areas and the terrorists most likely do not have the equipment to look for them. Hey, for all we know, the terrorists can do their work stress free because they know the ACLU would fight this sort of thing to the death anyway LOL Bottom line to me is that we would be taking a weapon away from them, no more propaganda or exploitation of the hostages. There is no question, they could easily go into these places and still kill people that WOULD have been hostages, but at least there would not be any suffering and anguish endured by the hostages and their families\n\n \n Groups supposedly associated with Zarqawi are generally doing most of the kidnapping. They are getting help from the general public and the Iraqi police. Do you not think that word would get out if people were being chipped on a large scale. I would seriously doubt that Zarqawi is able to get out of Fallujah on a regular basis to do all of the beheading, as he is not that easy to hide, with a reported amputated leg/", 
   {}, 
   68484, 
   null, 
   1096224540.0
  ], 
  [
   68659, 
   null, 
   "Waxy", 
   "Great idea!! Zarqawi is running around Iraq with X-ray machines and making the hostages run through them before they behead them? We are dealing with an enemy using Cold War weapons, not a doctor or a baggage screener at the airport.\n\n \n Sarcasm aside, this is the exact type of attitude that IMHO is the terrorists greatest weapon.\n \n They do a great Columbo act.\n \n As long as the west continues to think of them as bumbling XXXXXX trapped in a cold war world, they will continue to be successful.\n \n These guys have millions of dollars behind them, all the technology of the modern world, and you better believe that if they thought for a second that they could gain an advantage by being able to track or somehow use US soldiers as bait that they would find a way to detect these implants.\n \n It's way easier to be the hacker than it is to be the programmer. That should be pretty obvious for all to see.\n \n Naievty is no excuse.\n \n Waxy", 
   {}, 
   68479, 
   null, 
   1096307820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Question", 
  "url": "http://www.4forums.com/political/politics-debates/3256-question.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3256, 
  "discussion_files": [
   [
    "5590.html", 
    "http://www.4forums.com/political/politics-debates/3256-question-print.html"
   ]
  ], 
  "identifier": 3256
 }
]