[
 [
  [
   68366, 
   null, 
   "Haulingboat", 
   "The gap widens.\n \n http://quote.bloomberg.com/apps/news?pid=10000103&sid=aZDW71UvKciI&refer=us\n \n emoticon_xhoho :) emoticon_xhoho", 
   {
    "post_info": {
     "post_title": "The wheels are coming off the bus!"
    }
   }, 
   null, 
   null, 
   1096071060.0
  ], 
  [
   68382, 
   null, 
   "Broker", 
   "The debates will determine what happens with this election.\n \n Kerry can't say anything about Iraq or the broader War on Terror or it's going to show up in a Republican attack ad. Sadly, Kerry's still talking.\n \n Now he's against the Iraq war. My hope would be that Bush brings with him about three pieces of paper that quote John Kerry on Iraq.\n \n Kerry's only aiding the Republicans in painting him as flipper. Big mistake... even all my liberal friends are getting tired of Kerry's new opinions regarding Iraq.", 
   {}, 
   68366, 
   null, 
   1096078860.0
  ], 
  [
   68384, 
   null, 
   "jskufan", 
   "The gap widens.\n \n http://quote.bloomberg.com/apps/news?pid=10000103&sid=aZDW71UvKciI&refer=us\n \n emoticon_xhoho :) emoticon_xhoho\n\n \n I look for the debates to play a large factor in the coming weeks. So far the candidates have spent most of their money criticizing each other's service records, the debates will know doubt showcase problems with the economy and the mess in Iraq. I think if the Republicans can continue to convince voters \"all is going well in Iraq\" and \"we're winning the war on terrorism\", Bush probably will get re-elected. In some ways, it's probably only fair that this administration get saddled with the aftermath of what they've gotten this country into. Let's see if the party can put on their \"happy face\" for 4 more years while we continue to divert precious monetary resources to the Middle East.", 
   {}, 
   68366, 
   null, 
   1096079280.0
  ], 
  [
   68387, 
   null, 
   "billsco", 
   "Yes, the wheels are coming off, and faster than I thought. America may not be all that evenly divided as we think. I would like to proffer here one of my famous predictions--this one that Bush will win the popular vote by a margin of at least 10%. \n \n I don't expect the debates to play a large role. \n \n I've decided to plug my nose and vote Republican again, probably across the board. I'll do it reluctantly but with the understanding that the alternatives are simply worse, IMO .", 
   {}, 
   68382, 
   null, 
   1096080480.0
  ], 
  [
   68445, 
   null, 
   "Haulingboat", 
   "Yes, the wheels are coming off, and faster than I thought. America may not be all that evenly divided as we think. I would like to proffer here one of my famous predictions--this one that Bush will win the popular vote by a margin of at least 10%. \n \n I don't expect the debates to play a large role. \n \n I've decided to plug my nose and vote Republican again, probably across the board. I'll do it reluctantly but with the understanding that the alternatives are simply worse, IMO .\n\n I couldn't have said it any better Billsco. You hit the nail right on the head. Neither guy offers my ideal candidate, but I think Kerry is dangerous.", 
   {}, 
   68387, 
   null, 
   1096128000.0
  ], 
  [
   68686, 
   null, 
   "pnac=ww3", 
   "Who are these people being polled?\n \n The debates will do nothing. This time they will be so scripted and rehearsed that it will surely be a rehash of the whole debate, which Republicans have controlled for quite some time now. \n \n The problem with Kerry, as I have said before, is that he and his campaign suck at campaigning. Or maybe they don't have 20 radio talk show hosts and an entire 24hr cable news network to constantly campaign for them. \n \n Kerry's position on Iraq hasn't changed at all from the beginning. \n The problem for him is that his position is complicated and \"nuanced.\" \n The average american hates complicated nuance and loves black and white simplicity. Kerry doesn't offer this. Bush does. \n \n Winning the hearts and minds of Americans has very little to do with what our leaders do. It has much more to do with how they present what they did and how easy it is for the average American to understand the position. \n \n Anyway, Bush and Kerry are distant relatives. Kerry is also distantly related to QEII.\n \n http://msnbc.msn.com/id/4286105/\n http://www.infowars.com/print/kerry/related_to_queen.htm\n http://msnbc.msn.com/id/5723115/\n \n Does this mean anything? \n At the very least we can say the ruling class hasn't changed since Henry III.", 
   {}, 
   68445, 
   null, 
   1096322460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The wheels are coming off the bus!", 
  "url": "http://www.4forums.com/political/politics-debates/3262-wheels-coming-off-bus.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3262, 
  "discussion_files": [
   [
    "7428.html", 
    "http://www.4forums.com/political/politics-debates/3262-wheels-coming-off-bus-print.html"
   ]
  ], 
  "identifier": 3262
 }
]