[
 [
  [
   68492, 
   null, 
   "Siegfriedson", 
   "Chinaman Claims Whites are in a \"Death Phase\"\n \n I have visited your site, and understand your affirmations. However, you don't quite understand the predicament the white race is in. There is a life phase, and death phase. The time we live in today, is the final chapter of the white race. I admire the achievements of your race, but am befuddled by it as well.\n \n I am from Taiwan, and have lived in many other countries, as well. In Taiwan, problems of race are unknown. In Europe, and wherever whites live, there exists racial problems. Whites, as a whole, have seemed to have lost the ability to maintain a civilized society. This inability of your race to properly govern a nation has been increasingly apparent since the defeat of Germany, in 1945.\n \n My guess is, the influence, and military power, of whites will continue to decline. There seems no interest on the part of white governments to help strengthen their nation, but only bank accounts. That is something else I have noticed amongst your people. A high percentage of men who betray the interests of their nation for gain of self.\n \n China is ascending to the world throne, so to speak, and I don't believe there is anything Whites, or any other, can do to prevent it. The white man, as it were, had his opportunity.\n \n Source:\n \n http://www.vdare.com/letters/tl_041201.htm\n \n \n \n .", 
   {
    "post_info": {
     "post_title": "Chinaman Claims Whites are in a &quot;Death Phase&quot;"
    }
   }, 
   null, 
   null, 
   1096168800.0
  ], 
  [
   68709, 
   null, 
   "sinjin", 
   "From Dictionary.com:\n \n chinaman\n \n n 1: offensive terms for a person of Chinese descent [syn: chink, Chinaman] \n \n You're almost intuitively offensive.", 
   {}, 
   68492, 
   null, 
   1096328700.0
  ], 
  [
   68738, 
   null, 
   "Siegfriedson", 
   "From Dictionary.com:\n \n chinaman\n \n n 1: offensive terms for a person of Chinese descent [syn: chink, Chinaman] \n \n You're almost intuitively offensive.\n\n \n Oh dear, it seems that I've committed a \"hate crime\". The police had better come and arrest me for my speech violation.", 
   {}, 
   68709, 
   null, 
   1096342380.0
  ], 
  [
   68792, 
   null, 
   "sinjin", 
   "Oh dear, it seems that I've committed a \"hate crime\". The police had better come and arrest me for my speech violation.\n\n \n My thought was only that you might consider showing respect to someone whose words you're using to make your case. Why you felt the need to alter the original text is all too apparent.\n \n I fail to see the need to be assess the world from a racial standpoint even if some of another race choose to do so.", 
   {}, 
   68738, 
   null, 
   1096389840.0
  ], 
  [
   69252, 
   null, 
   "OccamsRazor", 
   "There is only one race; the human type emoticon_xgood", 
   {}, 
   68492, 
   null, 
   1096572000.0
  ], 
  [
   70695, 
   null, 
   "Darkest Shadow", 
   "I really don't see why we should judge world affairs from a racial standpoint....I mean that's only going to promote racism and hatred, and serves no real purpose. (And incidentally I don't see any race going down in flames anytime soon)", 
   {}, 
   69252, 
   null, 
   1097286660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Chinaman Claims Whites are in a \"Death Phase\"", 
  "url": "http://www.4forums.com/political/society-debates/3268-chinaman-claims-whites-death-phase.html", 
  "breadcrumbs": [
   "Society"
  ], 
  "id_number": 3268, 
  "discussion_files": [
   [
    "30768.html", 
    "http://www.4forums.com/political/society-debates/3268-chinaman-claims-whites-death-phase-print.html"
   ]
  ], 
  "identifier": 3268
 }
]