[
 [
  [
   69001, 
   null, 
   "Waxy", 
   "Since we have a VERY diverse crowd here, I'd like to get some opinions on these shows and others like them.\n \n What are people's thoughts about gay men in primetime?\n \n How about the \"image\" of gay men being presented?\n \n What about the rise of rise of cable networks and shows dealing with gay and lesbian topics? Are they popular? Realistic?\n \n I've always been curious as to how the gay community and others viewed these shows and the growing trend toward \"acceptance\", and, I have a very limited cross section of people to draw conclusions from.\n \n Waxy", 
   {
    "post_info": {
     "post_title": "Will and Grace, ***** Eye for the Straight Guy, etc..."
    }
   }, 
   null, 
   null, 
   1096477140.0
  ], 
  [
   69005, 
   null, 
   "joebrummer", 
   "HI Waxy, Great idea for discussion.\n \n Will and Grace is funny but really show gay men as stereotypical. Niether Will or Jack can ever seem to have a relationship. It isn't what gay men are really like at all.\n \n On cable we have ***** as folk. Now that is an exagerated version of gay life. Some of what is there does reflect a small portion of gay life accurately, but exagerated. At least the charactors have relationships that seem to last. I have to admit, even though the story lines have gotten really out there, I am still just addicted to this show, or course I jsut cancelled cable cause I was tired of paying so much for it.\n \n ***** eye fot the....\n \n What a dumb show! Not all gay men dress well, or can they decorate and cook. AND some striaght men dress way nicer than any gay man I know. Again more stereotypes.\n \n Then there is the L-Word. I just couldn't get into it. The charactors were shallow in my eyes and I couldn't really follow the story. So I stopped watching after the second episode. So I don't really know how it depicted Lesbians, But my lesbians friends love it and my partner liked it.", 
   {}, 
   69001, 
   null, 
   1096478220.0
  ], 
  [
   69009, 
   null, 
   "Waxy", 
   "Huh, I guess ***** is considered derogatory by the BB's software. emoticon_confused \n \n Waxy", 
   {}, 
   69005, 
   null, 
   1096478880.0
  ], 
  [
   69017, 
   null, 
   "Anastasia", 
   "Well I am huge fan of ***** as Folk, and yes I agree with Joe.. It seems a bit much at times, but the characters are great and I adore Brian :) He is such a good schmuck...\n I dont watch Will and Grace so I have no opinion there...\n L-Word only saw my first episode recently... not sure yet.\n I think all of the shows are a little stereotypical but entertaining.\n I think in light of the \"acceptance\" of gays in the media, it would only be fair to also show a side of gay men that is not the \"Show Queen\" type.. I work with dozens of gay men and only a few fit that description.", 
   {}, 
   69009, 
   null, 
   1096480740.0
  ], 
  [
   69055, 
   null, 
   "jitobear", 
   "I love Will and Grace - because of Karen. She is the funniest character on TV!", 
   {}, 
   69017, 
   null, 
   1096492800.0
  ], 
  [
   69095, 
   null, 
   "Ladywolf", 
   "Since we have a VERY diverse crowd here, I'd like to get some opinions on these shows and others like them.\n \n What are people's thoughts about gay men in primetime?\n \n How about the \"image\" of gay men being presented?\n \n What about the rise of rise of cable networks and shows dealing with gay and lesbian topics? Are they popular? Realistic?\n \n I've always been curious as to how the gay community and others viewed these shows and the growing trend toward \"acceptance\", and, I have a very limited cross section of people to draw conclusions from.\n \n Waxy\n\n \n I think the shows are sterotyped too much. Although they are entertaining, They are not good educational tools for straight people to learn that gay people are just like them.\n \n I think these shows are more popular than they are realistic...I mean look at Karen on Will and Grace (how real is that likely to happen in life?)\n \n I think that these shows do offer more exposure to gay people overall and the acceptance of them (even if skewed a bit).\n \n I'd say, give a bit more time and perhaps the stereotype stuff will wash away...at least the extreme stuff, acceptance will grow.", 
   {}, 
   69001, 
   null, 
   1096501320.0
  ], 
  [
   69099, 
   null, 
   "Freedom_Fighter", 
   "I think the shows are sterotyped too much. Although they are entertaining, They are not good educational tools for straight people to learn that gay people are just like them.\n \n I think these shows are more popular than they are realistic...I mean look at Karen on Will and Grace (how real is that likely to happen in life?)\n \n I think that these shows do offer more exposure to gay people overall and the acceptance of them (even if skewed a bit).\n \n I'd say, give a bit more time and perhaps the stereotype stuff will wash away...at least the extreme stuff, acceptance will grow.\n\n \n No offense, but I think most people don't look to sitcoms to learn about the ways in which other people live their lives. Stereotypes can be funny when used in a upbeat connotation, dance like a white guy, big fat greek wedding, etc. I think what is more promising for homosexuals is the new season of The Real World on MTV. I was reading that there are two gay guys on it, one is kind of feminine in a stereotypical way, the other the complete opposite. It is shows like this that are aimed at the younger generation that will have a huge impact because you have to start with those people whose opinions aren't rooted in decades old ideas. At least that is this heterosexual's opinion.", 
   {}, 
   69095, 
   null, 
   1096501740.0
  ], 
  [
   71106, 
   null, 
   "Tastyfish", 
   "Is the ***** as folk the same one that came over from the UK, or is it an new American version.\n \n Despise Will and Grace with a passion though never seen ***** eye for the straight guy (though they look to be the same type as was on the Salon, i.e XXXXXX who are as excessively camp so they can be on TV). I agree that Sitcoms are hardly the best way to get your perceptions of the world but would also add that most of these kind of 'themed' shows have a tendancy not to really bother with jokes sometimes and just rely on the 'Oh! how gay/black/wacky is this guy!!1!!one!' factor too much.", 
   {}, 
   69099, 
   null, 
   1097508660.0
  ], 
  [
   71137, 
   null, 
   "joebrummer", 
   "Is the ***** as folk the same one that came over from the UK, or is it an new American version.\n \n Despise Will and Grace with a passion though never seen ***** eye for the straight guy (though they look to be the same type as was on the Salon, i.e XXXXXX who are as excessively camp so they can be on TV). I agree that Sitcoms are hardly the best way to get your perceptions of the world but would also add that most of these kind of 'themed' shows have a tendancy not to really bother with jokes sometimes and just rely on the 'Oh! how gay/black/wacky is this guy!!1!!one!' factor too much.\n\n \n \n QAF is a new American version. I have watched both and both are good, but the American version's charactors have more depth to them. I also think the story lines are more broad and more interesting in the American.", 
   {}, 
   71106, 
   null, 
   1097520180.0
  ], 
  [
   71223, 
   null, 
   "Tastyfish", 
   "QaF i the UK is very old, at least 10 years or so and was much more contraversal then here. What with QEftSG and W&G it wouldn't suprise me that the US version was more character driven than issue driven. (You win this one, but we're keeping our Red Dwarf and possibly Coupling as superior ;))", 
   {}, 
   71137, 
   null, 
   1097552400.0
  ], 
  [
   71289, 
   null, 
   "OccamsRazor", 
   "QaF i the UK is very old, at least 10 years or so and was much more contraversal then here. What with QEftSG and W&G it wouldn't suprise me that the US version was more character driven than issue driven. (You win this one, but we're keeping our Red Dwarf and possibly Coupling as superior ;))\n\n \n Yes, Q u e e r as folk caused a huge stir when it was first aired in the UK in 1999- I remember the usual throthing at the mouth response from papers like the Daily Mail etc. about how Channel 4 was corrupting us all blah blah...\n \n No doubt much of that was to do with the fact the show was about gay men (although Brookside's famous lesbian kiss also kicked up a stir- particularly in relation to the relatively early time the show was aired).\n \n One portrayal of a gay (in this case gay women) relationship in TV that I always thought was well done was in the BBC Police drama Between the Lines where the main female character was gay. Firstly it dealt with the hostility she faced from some collegues when she \"outed\" and secondly because it dealt with the stresses a high powered career puts on a relationship- this was clever as it put a story that is not uniquely to do with a gay relationshop in that context, making a point of not just having the characters being gay just to have specific storylines relating to that. This series ran between 1992 and 1994.\n \n Although slightly OT, one thing that I find interesting is the portrayal of same sex desire in advertising. Over the last few years there has been a fair amount of imagery that features 2 women posed in a way as to indicate desire for one another. No doubt this appeals to most of the men amongst us emoticon_xangel but I find it difficult to imagine the same sort of imagery but using men instead.", 
   {}, 
   71223, 
   null, 
   1097604060.0
  ], 
  [
   71292, 
   null, 
   "joebrummer", 
   "Yes, Q u e e r as folk caused a huge stir when it was first aired in the UK in 1999- I remember the usual throthing at the mouth response from papers like the Daily Mail etc. about how Channel 4 was corrupting us all blah blah...\n \n No doubt much of that was to do with the fact the show was about gay men (although Brookside's famous lesbian kiss also kicked up a stir- particularly in relation to the relatively early time the show was aired).\n \n One portrayal of a gay (in this case gay women) relationship in TV that I always thought was well done was in the BBC Police drama Between the Lines where the main female character was gay. Firstly it dealt with the hostility she faced from some collegues when she \"outed\" and secondly because it dealt with the stresses a high powered career puts on a relationship- this was clever as it put a story that is not uniquely to do with a gay relationshop in that context, making a point of not just having the characters being gay just to have specific storylines relating to that. This series ran between 1992 and 1994.\n \n Although slightly OT, one thing that I find interesting is the portrayal of same sex desire in advertising. Over the last few years there has been a fair amount of imagery that features 2 women posed in a way as to indicate desire for one another. No doubt this appeals to most of the men amongst us emoticon_xangel but I find it difficult to imagine the same sort of imagery but using men instead.\n\n \n They do use men in very sexy ads, especially for Bud Light, but they are usually in gay magazines and papers. Companies are figureing out that gays are a big demographic. They tend to spend alot of money. Travel ads are really big right now.", 
   {}, 
   71289, 
   null, 
   1097605440.0
  ], 
  [
   71299, 
   null, 
   "OccamsRazor", 
   "They do use men in very sexy ads, especially for Bud Light, but they are usually in gay magazines and papers. Companies are figureing out that gays are a big demographic. They tend to spend alot of money. Travel ads are really big right now.\n\n \n I was a bit vague with my observation... I was thinking of \"mainstream\" advertising (if there is such a thing!), the sort of thing that might be on a billboard for example.", 
   {}, 
   71292, 
   null, 
   1097611260.0
  ], 
  [
   72100, 
   null, 
   "JustineCredible", 
   "Since we have a VERY diverse crowd here, I'd like to get some opinions on these shows and others like them.\n \n What are people's thoughts about gay men in primetime?\n \n How about the \"image\" of gay men being presented?\n \n What about the rise of rise of cable networks and shows dealing with gay and lesbian topics? Are they popular? Realistic?\n \n I've always been curious as to how the gay community and others viewed these shows and the growing trend toward \"acceptance\", and, I have a very limited cross section of people to draw conclusions from.\n \n Waxy\n\n \n Q-U-E-E-R Eye For the Straight Guy: UGH! Give me a break! I watch two episodes and gave up. I lasted out two because I just had to see if the second one was going to be as grating as the first. It was.\n That blond one comes across as such an exagerated stereotype that I wanted to vomit! \n (and this comming from a lesbian)\n \n Q-U-E-E-R as Folk: Ok, I'm guilty! I love it. It's a gay soap opera, pure and simple. \n While in regular daytime soaps the characters are overly exagerated and not that believable, the same is true for the characters of Brian, Justin, Michael, Emmet, Ted, Lindsey and Melony(and most recently the fluid characters of Hunter and Ben). (Although the two lesbians are probably the most believable of them all). Debbie is the exageration of the PFLAG nightmare. You just have to love her! \n Yup, I'm certainly not so pyos that I can't enjoy a little \"make-believe\" once in a while.\n \n The L-word: Ok, that's where my interest waines. I suffered through the first season because my partner really likes the show. I personally can't stand it. I agree with the others who deemed the characters as shallow. That is the best description for them. \n Shallow, taudry, white-washed and laking in any form of reality. Kind of how I felt about Twin Peaks. HATED IT! \n \n Will and Grace: Oh come on guys...it's a SITCOM! It's not supposed to actually reflect reality in any way, shape or form. It's pure entertainment! I still get a chuckle out of it when I catch it. \n \n \n Now what gets me is that Melissa Etheridge, recently diagnosed with breast cancer, has signed a deal to do a sitcom as well. Kind of the reverse of \"Will and Grace\" as Melissa is a lesbian living with a straight male roommy and raising her best friend's teenage kid. \n Talk about strange. \n Yeah, I'll give it a couple of weeks. But until it airs I really can't imagine what I would be like.", 
   {}, 
   69001, 
   null, 
   1098038280.0
  ], 
  [
   72101, 
   null, 
   "joebrummer", 
   "OK Justine, I hate to say it but I know a PFLAG mom who is just like debbie. She cracks me up too! The buttons, the t shirts all of it. She is much older than Debbie and not as loud, but she is very close otherwise.", 
   {}, 
   72100, 
   null, 
   1098038460.0
  ], 
  [
   72130, 
   null, 
   "JustineCredible", 
   "OK Justine, I hate to say it but I know a PFLAG mom who is just like debbie. She cracks me up too! The buttons, the t shirts all of it. She is much older than Debbie and not as loud, but she is very close otherwise.\n\n \n \n And I'll bet you just can't help but love her too, right? \n \n That's what I'm talking about. LOL :)", 
   {}, 
   72101, 
   null, 
   1098046980.0
  ], 
  [
   72133, 
   null, 
   "joebrummer", 
   "And I'll bet you just can't help but love her too, right? \n \n That's what I'm talking about. LOL :)\n\n \n \n She drives me crazy!", 
   {}, 
   72130, 
   null, 
   1098048540.0
  ], 
  [
   72212, 
   null, 
   "Tastyfish", 
   "I was a bit vague with my observation... I was thinking of \"mainstream\" advertising (if there is such a thing!), the sort of thing that might be on a billboard for example.\n\n Female/Female is pretty much mainstream as far as heterosexual male advertising (among other things) goes, at least in the fantasy aspect of it.\n Probably stemming from the Playboy mansion 'harem' type of thing. Although it seems voyerism is more of a male thing anyway (no stats to back it up, just an impression) and suppose is comes under this partly.", 
   {}, 
   71299, 
   null, 
   1098108840.0
  ], 
  [
   72224, 
   null, 
   "emclean", 
   "PFLAG mom \n \n what is one?", 
   {}, 
   72212, 
   null, 
   1098113280.0
  ], 
  [
   73108, 
   null, 
   "JustineCredible", 
   "what is one?\n\n \n Um, it's a stereotype. Kind of like the stereotypical stage mother or cheerleader. Granted not completely flattering, but most people understand the meaning.", 
   {}, 
   72224, 
   null, 
   1098528720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Will and Grace, ***** Eye for the Straight Guy, etc...", 
  "url": "http://www.4forums.com/political/gay-rights-debates/3295-will-grace-eye-straight-guy-etc.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 3295, 
  "discussion_files": [
   [
    "23247.html", 
    "http://www.4forums.com/political/gay-rights-debates/3295-will-grace-eye-straight-guy-etc-print.html"
   ], 
   [
    "23248.html", 
    "http://www.4forums.com/political/gay-rights-debates/3295-will-grace-eye-straight-guy-etc-2-print.html"
   ]
  ], 
  "identifier": 3295
 }
]