[
 [
  [
   69326, 
   null, 
   "pnac=ww3", 
   "Here are a few pages with audio and video clips of John Kerry expressing his views on the war in Iraq. Some of them are cut off, especially those involved with the $87b vote. But, most of them are quite accurate in portraying what Kerry meant at the time. Whenever the URL says (rtsp), just replace that with (http) after cutting and pasting.\n \n http://freerepublic.com/focus/f-news/1076750/posts\n \n http://www.freerepublic.com/focus/f-news/1208582/posts\n \n Some of them sound like nuance and trying to have it both ways, but some are just out and out supportive of the president and his decisions.\n \n This is my favorite. \n http://media1.streamtoyou.com/rnc/KerryBOS-Cut6-28secs.mp3\n Here he says he supported the president's decisions, then Howard Dean breaks in with the line that Kerry has been using lately. \"The wrong war at the wrong time.\"\n \n \n And this one where he calls Saddam Hussein a terrorist.\n http://real.stream2you.com/rnc/020904R6.rm\n So basically, he believes that the war in Iraq is part of the war on terror.\n \n Here he says France and Russia have no backbone.\n http://media1.streamtoyou.com/rnc/KerryBOS-Cut13-40secs.mp3\n \n Can someone tell me what the critical ammendment was?\n Kerry eventually voted for the bill even though an ammendment he wanted was missing. What was it?\n http://media1.streamtoyou.com/rnc/KerryBOS-Cut10-48secs.mp3\n \n \n Anyway, Kerry has dug a hole for himself because his position is so muddled, or has been by the media. His position (if I understand it) is:\n 1. Saddam was a threat and had to be removed.\n 2. Military action is a last resort, but an option in this case.\n 3. Diplomacy must be thoroughly exhausted before military action.\n 4. The way the current administration managed the war was bad.\n 5. The current administration used deception to rush to war.\n 6. He would have gone to war to remove Saddam, but he would have done it better.\n 7. Despite Saddam being an ongoing threat and a terrorist, the invasion was a distraction from the war on terror.\n \n Am I wrong about these?\n \n \n \n \n \n .", 
   {
    "post_info": {
     "post_title": "Me too!"
    }
   }, 
   null, 
   null, 
   1096591500.0
  ], 
  [
   69327, 
   null, 
   "jskufan", 
   "It makes little difference who supported the war 16 months ago. With the data this administration spoon fed the public, the majority of people could be talked into it while believing it was vital to our national security. Now, given what we all know, lots of people have changed their perspective. This administration alone was responsible for interpreting the data and relentlessly pursuing military action against Iraq. I personally want to make sure that mistake doesn't happen again in the next 4 years. For that reason alone, I can't see voting Republican.", 
   {}, 
   69326, 
   null, 
   1096592520.0
  ], 
  [
   69341, 
   null, 
   "pnac=ww3", 
   "Why does it make little difference? Kerry STILL supports war. Just not Bush's war. He wanted Kerry's war.\n \n John Kerry was in favor of ousting Saddam well before the Bush administration.\n \n He then said, after the invasion was in full swing (March 2003 during the Democratic debates), that he supported the president's decision to disarm him. To me, that sounds like he supported the decision to go to war.\n \n What information was Kerry spoonfed before 2001?\n \n Colin Powell and Condoleeza Rice said that Saddam was not a real threat in 2001. They both said that he was being contained and that containment was working. They both said that even if Saddam possessed WMDs, he couldn't pose a real threat without his own demise. Of course, this tune changed after 9/11.\n \n Kerry's tune did not change. He continued to say that Hussein was out of control, a terrorist, and that he must be disarmed, which is what he was saying all through the nineties.\n \n There are a myriad of reasons to vote against Republicans, but the fact that Bush took us to war isn't one of them. A democrat president would have done it too. Then it boils down to \"misled us into war\" or \"rushed into war.\" \n No matter what, we were going to have this war. \n \n Kerry still supports the concept of us overthrowing Saddam with military force. What he says is that the Bush administration grossly mismanaged it (which it did), but he still would have gone to war.\n \n .", 
   {}, 
   69327, 
   null, 
   1096596000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Me too!", 
  "url": "http://www.4forums.com/political/politics-debates/3305-me-too.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3305, 
  "discussion_files": [
   [
    "27545.html", 
    "http://www.4forums.com/political/politics-debates/3305-me-too-print.html"
   ]
  ], 
  "identifier": 3305
 }
]