[
 [
  [
   69876, 
   null, 
   "jim's trucking", 
   "Thus was passed me, but I can't understand it. Maybe you can,\n \n I'm trying to get all this political stuff straightened out in my head\n so I'll know how to vote come November. Right now, we have one guy saying\n one thing. Then the other guy says something else. Who to believe. Lemme\n see; have I got this straight? \n \n Clinton awards Halliburton no-bid contract in Yugoslavia - good... \n Bush awards Halliburton no-bid contract in Iraq - bad... \n \n Clinton spends 77 billion on war in Serbia - good... \n Bush spends 87 billion in Iraq - bad... \n \n Clinton imposes regime change in Serbia - good... \n Bush imposes regime change in Iraq - bad... \n \n Clinton bombs Christian Serbs on behalf of Muslim Albanian terrorists- good... \n Bush liberates 25 million from a genocidal dictator - bad... \n \n Clinton bombs Chinese embassy - good... \n Bush bombs terrorist camps - bad... \n \n Clinton commits felonies while in office - good... \n Bush lands on aircraft carrier in jumpsuit - bad... \n \n No mass graves found in Serbia - good... \n No WMD found Iraq - bad... \n \n Stock market crashes in 2000 under Clinton - good... \n Economy on upswing under Bush - bad... \n \n Clinton refuses to take custody of Bin Laden - good... \n World Trade Centers fall under Bush - bad... \n \n Clinton says Saddam has nukes - good... \n Bush says Saddam has nukes - bad... \n \n Clinton calls for regime change in Iraq - good... \n Bush imposes regime change in Iraq - bad... \n \n Terrorist training in Afghanistan under Clinton - good... \n Bush destroys training camps in Afghanistan - bad... \n \n Milosevic not yet convicted - good... \n Saddam turned over for trial - bad... \n \n Ahh, it's so confusing!\n \n Every year an independent tax watchdog group analyzes the average tax burden on Americans, and then calculates the \"Tax Freedom Day\". This is the day after which the money you earn goes to you, not the government. This year, tax freedom day was April 11th. That's the earliest it has been since 1991. It's latest day ever was May 2nd, which occurred in 2000. Notice anything special about those dates? \n \n Recently, John Kerry gave a speech in which he claimed Americans are \n actually paying more taxes under Bush, despite the tax cuts. He gave\n no explanation and provided no data for this asinine claim. \n \n Another interesting fact: Both George Bush and John Kerry are wealthy men. \n Bush owns only one home, his ranch in Texas. Kerry owns 4 mansions, \n all worth several million dollars. (His ski resort home in Idaho is an old barn \n brought over from Europe in pieces. Not your average A-frame). \n \n Bush paid $250,000 in taxes this year; Kerry paid $90,000. Does that\n sound right? The man who wants to raise your taxes obviously has figured out\n a way to avoid paying his own. \n \n Somebody please help me understand this liberal double standard!", 
   {
    "post_info": {
     "post_title": "I'm confused!  Somebody help me!"
    }
   }, 
   null, 
   null, 
   1096903440.0
  ], 
  [
   69913, 
   null, 
   "pnac=ww3", 
   "AMAZING I GOT THIS EMAIL JUST WHEN YOU DID.\n \n The reply:\n \n You know, I tried to google some of the things on this list about clinton but all i got was 10 google pages of webpages with this list on it.\n \n I can't find any real information about what was spent and details about money for Kosovo and Serbia. \n \n This gives some genereal info: http://www.flashpoints.info/countries-conflicts/Kosovo-Serbia-web/Kosovo-Serbia_briefing.html\n \n Anyway, any idiot can see the differences in the circumstances and especially the death/money toll. I do remember everyone jumping on Clinton's butt for involving US troops. I remember everyone bitching about American Imperialism just like they are now with Bush. http://www.globalsecurity.org/military/ops/global-deployments.htm\n \n I think we have one brigade in Kosovo. At least it's what it says on that webpage. That's 3000-5000 men? I think there were 20,000 or so deployed for the \"action.\"\n \n Actually the $87 billion was ONE of many payments into the war effort. The first go, when bush thought he'd do it on the cheap was $79 billion. Then came the 87, then came another, I think like $25 billion.\n \n Lemme do these point by point:\n < Clinton awards Halliburton no-bid contract in Yugoslavia - good...\n < Bush awards Halliburton no-bid contract in Iraq - bad...\n \n Clinton's VP was not CEO of Haliburton. It looks awfully suspicious, especially since there has been some graft scandal type stuff with about $8billion of that $87 billion. Also, the reason the \"world\" is ****** at Bush is because after he circumvented the UN, he cut-out any international re-building effort, making it all US/UK. Now he's having to go hat in hand to ask for a little help.\n \n < Clinton spends 77 billion on war in Serbia - good...\n < Bush spends 87 billion in Iraq - bad...\n \n I don't know how much was spent in Kosovo, or how much we got back (it's always an investment). We won't be getting back too much of the $130billion+ that we have been dumping into Iraq. It's almost like a grant system. We are investing in a \"free and prosperous Iraq.\" Hopefully this gamble will pay off within 10 years since we will be spending a couple hundred billion a year to keep our occupation and Iraq afloat. This is going on current rates of reconstruction. If the UN will allow other countries in (despite their pottery barn policy) maybe that will shift some of the burden on us, which is significant.\n \n \n < Clinton imposes regime change in Serbia - good...\n < Bush imposes regime change in Iraq - bad...\n \n Clinton imposed regime change on a dinky little country in the middle of ethnic cleansing/genocide. American casualties for doing so: nil. Ethnic cleansing that went on after the campaign: nada. Still he was criticized left and right, especially because he supported the KLA which had used terrorist tactics against Serbia. Why he didn't do the same in Rwanda a few years earlier is still a source of criticism for Clinton. Only after the results in kosovo turned out so well did people say \"regime change in Yugoslavia - good.\"\n \n Bush imposed regime change on a dictator that was already being \"contained\" with sanctions and no-fly zones. Before 9/11 everyone was going by the containment strategy. After 9/11 irrational fears of WMDs \"getting into the hands of terrorists\" drove congress to accept the idea of regime change in Iraq. This had been the idea of some in Washington since the first GW. They thought it was a mistake to leave Saddam in control of Iraq (which he kept under control). \n Everyone was \"for\" regime change after being \"convinced\" by all this make-believe \"intellegence.\" Even with support from congress to wage war, Bush circumvented the UN process and went in hastily. This MIGHT have been a good strategy (even though it still means bombing and killing 10,000+ civilians) if he had enough boots on the ground to secure a country the size of California after the invasion. Even if a war could be considered \"just and moral\" Bush went about waging the war in an \"unjust and immoral\" way. \n \n < Clinton bombs Christian Serbs on behalf of Muslim Albanian terrorists-good..\n < Bush liberates 25 million from a genocidal dictator - bad...\n \n http://www.slobodan-milosevic.org/kosovo-deaths.htm\n It's hard to make out by this page, but it looks like maybe a few hundred civilians were killed by the US/NATO in the Kosovo campaign, which was started to stop a genocide in progress.\n \n When did Saddam become \"genocidal\"? Anyway, 10,000-15,000 of those Iraqis were liberated from their lives. 40% or something like that were liberated from power and water, most have gotten it back but not nearly all. I dunno haw many thousands have been liberated from their homes by bombs. And, apparently whole militias worth of Iraqis that are now fighting us didn't feel so liberated, since they are now fighting us for their \"freedom.\" The concept of \"liberating Iraq\" sounds good, but the reality of the situation is not very liberating. \n \n \n < Clinton bombs Chinese embassy - good...\n < Bush bombs terrorist camps - bad...\n \n Who the hell said bombing the Chinese embassy was good?!?!\n Who the hell said bombing terrorist training camps was bad?!?!\n Both clinton and bush did that last one. Clinton was seriously bashed for bombing that \"weapons factory\" in Sudan. He sent missiles al-qaeda's way a few times. \n \n < Clinton commits felonies while in office - good...\n < Bush lands on aircraft carrier in jumpsuit - bad...\n \n Again, who the hell said that committing felonies was good?!?!\n Yes, that lame photo-op of Bush landing on the aircraft carrier was sickening, about as sickening as kerry trotting out a bunch of vets and saying \"reporting for duty.\"\n \n < No mass graves found in Serbia - good...\n < No WMD found in Iraq - bad...\n \n There were no mass graves in Serbia because they were in Kosovo and Albania.\n Anyway, most of the dead were just lying around where they were killed, still \"fresh\" by the time Clinton took action. If the war in Iraq were really about mass graves (which were quite exaggerated) then we would have been doing this war quite differently 12 years ago. \n \n < Stock market crashes in 2000 under Clinton - good...\n < Economy on upswing under Bush - bad...\n \n Huh? Bush has presided over the 2 of the worst stock market plunges in history (by numbers not percentage), both on the Nasdaq and the Dow. No one said that any stock market \"crash\" was good.\n \n < Clinton refuses to take custody of Bin Laden - good...\n < World Trade Centers fall under Bush - bad...\n \n There were many opportunities to capture or kill him or other members of al-qeada, but every time our hands were tied by our own jurisprudence. Our own laws wouldn't allow us to capture him under the circumstances. I guess now those laws have changed. Again, no one has ever said that letting al-qaeda operate when we could have shut them down was good.\n \n < Clinton says Saddam has nukes - good...\n < Bush says Saddam has nukes - bad...\n \n Clinton never said \"Saddam definitiely has nukes.\" The UN said Saddam might have chemical and biological weapons and Clinton was criticized for his apparently pansy stance on it, not wanting military involvement. Clinton never said \"We have these documents (that were forged) that says Saddam bought uranium from Niger.\" That's why what Bush said was bad.\n \n < Clinton calls for regime change in Iraq - good...\n < Bush imposes regime change in Iraq - bad...\n \n We happen to know the disctinct differences in the way regime change was proposed. http://frankwarner.typepad.com/free_frank_warner/2004/06/clintons_approa.html\n \n \n < Terrorist training in Afghanistan under Clinton - good...\n < Bush destroys training camps in Afghanistan - bad...\n \n Terrorist training camps under Bush, Sr. - good?\n Clinton kicks up anti-terrorism efforts and destroys training camps - bad?\n http://www.makethemaccountable.com/myth/ClintonAndTerrorism.htm\n Bush starts giving a **** about terrorism ONLY after 9/11 - good?\n http://www.fromthewilderness.com/free/ww3/051602_liewontstand.html\n \n < Milosevic not yet convicted - good...\n < Saddam turned over for trial - bad...\n \n Saddam not yet convicted - good, then? \n http://www.iht.com/articles/536420.html\n They have both been captured. One is awaiting trial in an international court. One is awaiting trial by his conquerors (I mean citizens).\n \n \n The tax thing isn't even worth bothering.\n \n .", 
   {}, 
   69876, 
   null, 
   1096918020.0
  ], 
  [
   69971, 
   null, 
   "jskufan", 
   "\n I'm confused! Somebody help me! \n\n \n This is the first thing you've said that I actually agree with you on. ;)", 
   {}, 
   69876, 
   null, 
   1096930860.0
  ], 
  [
   69975, 
   null, 
   "pnac=ww3", 
   "Also, the one important thing to remember about this list:\n \n \n CLINTON ISN'T RUNNING!", 
   {}, 
   69971, 
   null, 
   1096935540.0
  ], 
  [
   70026, 
   null, 
   "jim's trucking", 
   "Also, the one important thing to remember about this list:\n \n \n CLINTON ISN'T RUNNING!\nIt draws attention to the double standards of liberal supporters.", 
   {}, 
   69975, 
   null, 
   1096986660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  I'm confused!  Somebody help me!", 
  "url": "http://www.4forums.com/political/politics-debates/3334-im-confused-somebody-help-me.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3334, 
  "discussion_files": [
   [
    "7383.html", 
    "http://www.4forums.com/political/politics-debates/3334-im-confused-somebody-help-me-print.html"
   ]
  ], 
  "identifier": 3334
 }
]