[
 [
  [
   70053, 
   null, 
   "jskufan", 
   "In an article posted on MSN today from the Washingtonpost.com, Paul Bremer makes the following observation with respect to our post combat planning in Iraq:\n \n \"WASHINGTON - The former U.S. official who governed Iraq after the invasion said yesterday that the United States made two major mistakes: not deploying enough troops in Iraq and then not containing the violence and looting immediately after the ouster of Saddam Hussein.\"\n \n Obviously this is a recurring accusation against this administration, however, I find it particularly credible when it comes from the mouth of someone who knows better than most. The article goes on to say that his criticisms basically parallel those of the Democratic party as well as other administration critics:\n \n \"Bremer's comments were striking because they echoed contentions of many administration critics, including Democratic presidential nominee John F. Kerry, who argue that the U.S. government failed to plan adequately to maintain security in Iraq after the invasion. Bremer has generally defended the U.S. approach in Iraq but in recent weeks has begun to criticize the administration for tactical and policy shortfalls.\"\n \n Here is a link to the article: http://www.msnbc.msn.com/id/6180514/", 
   {
    "post_info": {
     "post_title": "Bremer Criticizes Troop Levels In Iraq"
    }
   }, 
   null, 
   null, 
   1096997100.0
  ], 
  [
   70078, 
   null, 
   "Freedom_Fighter", 
   "In an article posted on MSN today from the Washingtonpost.com, Paul Bremer makes the following observation with respect to our post combat planning in Iraq:\n \n \"WASHINGTON - The former U.S. official who governed Iraq after the invasion said yesterday that the United States made two major mistakes: not deploying enough troops in Iraq and then not containing the violence and looting immediately after the ouster of Saddam Hussein.\"\n \n Obviously this is a recurring accusation against this administration, however, I find it particularly credible when it comes from the mouth of someone who knows better than most. The article goes on to say that his criticisms basically parallel those of the Democratic party as well as other administration critics:\n \n \"Bremer's comments were striking because they echoed contentions of many administration critics, including Democratic presidential nominee John F. Kerry, who argue that the U.S. government failed to plan adequately to maintain security in Iraq after the invasion. Bremer has generally defended the U.S. approach in Iraq but in recent weeks has begun to criticize the administration for tactical and policy shortfalls.\"\n \n Here is a link to the article: http://www.msnbc.msn.com/id/6180514/\n\n \n Perfect example of selective quoting. I read the entire article and it states numerous times that Bremer believes that we are currently on the right track and that he \"stongly supports\" President Bush reelection bid. You represent quite a different situation in your statements. Hindsight is 20/20 and what really matters is where you think things are going from here on out.", 
   {}, 
   70053, 
   null, 
   1097002980.0
  ], 
  [
   70116, 
   null, 
   "jskufan", 
   "Perfect example of selective quoting. I read the entire article and it states numerous times that Bremer believes that we are currently on the right track and that he \"stongly supports\" President Bush reelection bid. You represent quite a different situation in your statements. Hindsight is 20/20 and what really matters is where you think things are going from here on out.\n\n \n I don't think there was any selective quoting. The article basically stated that troop miscalculations in the beginning were responsible for numerous problems we were, and still are having today. The fact that we didn't secure crucial areas after the initial conflict has cost us dearly. Bremer stated he supported the invasion, that's not the same as complimenting this administration for their handling of it. It's not exactly hindsight, the military was asking for more troops from the beginning and there is still intelligent data saying we still don't have enough manpower. The problem is, sending more troops now would have a negative impact on election popularity.", 
   {}, 
   70078, 
   null, 
   1097016600.0
  ], 
  [
   70127, 
   null, 
   "pnac=ww3", 
   "\"The new administration seems to be paying no attention to the problem of terrorism. What they will do is stagger along until there's a major incident and then suddenly say, 'Oh, my God, shouldn't we be organized to deal with this?' That's too bad. They've been given a window of opportunity with very little terrorism now, and they're not taking advantage of it. Maybe the folks in the press ought to be pushing a little bit.\"\n \n - Paul Bremer, a member of the Hart/Rudman Commission on Terrorism and, most recently, the U.S. Administrator in Iraq, speaking in Wheaton, IL, February 26, 2001, at the Robert R. McCormick Tribune Foundation's \"Terrorism: Informing the Public\": \n\n \n \n http://www.chireader.com/hottype/2004/040423_1.html\n \n\n Before 9/11 the nation wasn't blind to the peril it was in. In 1998 Congress told the Clinton administration to conduct a study of the nation's ability to defeat terrorists armed with weapons of mass destruction. An advisory panel that became known as the Gilmore commission was assembled and issued a series of annual reports. Its second, released in December 2000, asserted that \"the United States has no coherent, functional national strategy for combating terrorism. . . . The organization of the Federal government's programs for combating terrorism is fragmented, uncoordinated, and politically unaccountable.\" The commission recommended that \"the next President should develop and present to the Congress a national strategy for combating terrorism within one year of assuming office.\"\n\n \n \n .", 
   {
    "post_info": {
     "post_title": "Another Bremer Quote"
    }
   }, 
   70116, 
   null, 
   1097020200.0
  ], 
  [
   70614, 
   null, 
   "billsco", 
   "Is Bremer on record for asking for more troops while he was there?", 
   {}, 
   70127, 
   null, 
   1097258340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bremer Criticizes Troop Levels In Iraq", 
  "url": "http://www.4forums.com/political/news-forum/3341-bremer-criticizes-troop-levels-iraq.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 3341, 
  "discussion_files": [
   [
    "3665.html", 
    "http://www.4forums.com/political/news-forum/3341-bremer-criticizes-troop-levels-iraq-print.html"
   ]
  ], 
  "identifier": 3341
 }
]