[
 [
  [
   70865, 
   null, 
   "God_is_real", 
   "when you get married, you should both have the same religion. i think that should be christian but thats your choice", 
   {
    "post_info": {
     "post_title": "marriage: they should have 1 religion"
    }
   }, 
   null, 
   null, 
   1097360700.0
  ], 
  [
   70909, 
   null, 
   "Dzeron", 
   "when you get married, you should both have the same religion. i think that should be christian but thats your choice\n\n \n I think they should have 3 religions.", 
   {}, 
   70865, 
   null, 
   1097386140.0
  ], 
  [
   71098, 
   null, 
   "Tastyfish", 
   "Well this is fun!\n \n Any reasons? If you arn't particulary devout or completely atheist, then your partners religion is not overly important to you in itself, its importance to him or her is and you would respect that rather than the beleif itself. However the same would be the same of their vegetarianism or political beleifs - you wouldn't nessesarily force them to change but would think it unreasonable for them to force their opinions on you (you wouldn't rub it in their face but it shouldn't really stop you having a bacon sandwich alone with your friends). \n \n If it was really a problem chances are you wouldn't be getting married anyway.", 
   {}, 
   70909, 
   null, 
   1097506920.0
  ], 
  [
   71210, 
   null, 
   "zachvac", 
   "Well I think that it would present a problem if either parent thought it important to teach their child that their religion was right. My parents are different religions but they just both presented what they believe and encouraged me to explore others and to decide for myself.", 
   {}, 
   71098, 
   null, 
   1097545020.0
  ], 
  [
   71217, 
   null, 
   "emclean", 
   "each couple should decide for them selves, there is no good rule of thumb other than to love and respect your spouce", 
   {}, 
   71210, 
   null, 
   1097550300.0
  ], 
  [
   71221, 
   null, 
   "Tastyfish", 
   "If both were truly dedicated then it is unlikely that they would marry in the first place, seeing as they did then they would probably stress the imporatance of some kind of spiritual aspect. Quite what you would expect if you had both being Abrahamic religions, probably some kind of pseudo-jewish awaiting a Messiah I would guess, or something fairly random.\n Otherwise they would probably reject both parents relgions (seeing as both would be subtley discrediting the other) or follow whoever was most devout.", 
   {}, 
   71217, 
   null, 
   1097551920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  marriage: they should have 1 religion", 
  "url": "http://www.4forums.com/political/fun-debates/3396-marriage-they-should-have-1-religion.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 3396, 
  "discussion_files": [
   [
    "30258.html", 
    "http://www.4forums.com/political/fun-debates/3396-marriage-they-should-have-1-religion-print.html"
   ]
  ], 
  "identifier": 3396
 }
]