[
 [
  [
   71021, 
   null, 
   "God_is_real", 
   "to uniforms, not being able to pray in school, all this religion stuff. i think kids should be able to exspress their religion", 
   {
    "post_info": {
     "post_title": "i am in 8th grade and i say no"
    }
   }, 
   null, 
   null, 
   1097460480.0
  ], 
  [
   71026, 
   null, 
   "Dzeron", 
   "to uniforms, not being able to pray in school, all this religion stuff. i think kids should be able to exspress their religion\n\n \n Kids can pray in school. It's just that teachers can't force them to pray.", 
   {}, 
   71021, 
   null, 
   1097462220.0
  ], 
  [
   72135, 
   null, 
   "badax22", 
   "to uniforms, not being able to pray in school, all this religion stuff. i think kids should be able to exspress their religion\n\n \n you can pray in most schools, at least if you are not disturbing the class or offending another person's religion at the same time. I have a person who is muslim who used to go to my school. He was allowed to leave school to pray. He did that everyday. He left during lunch and during class.", 
   {
    "post_info": {
     "post_title": "What Dzeron said"
    }
   }, 
   71021, 
   null, 
   1098048660.0
  ], 
  [
   74677, 
   null, 
   "finnedartist", 
   "The reason you cannot be forced to pray at school is to protect the rights of children who do NOT share your beliefs or do not believe in a god at all (which would include me). In fact, public schools no longer have prayer because it is a violation of separation between church and state. This actually protects students' right to \"express their religion.\" \n \n Besides, why do you have to pray at school? There are plenty of places for teens to \"express their religion\": church, home, on the front of T-shirts. Religion is practically everywhere.", 
   {}, 
   71021, 
   null, 
   1099351740.0
  ], 
  [
   74685, 
   null, 
   "JPSartre12", 
   "....\n \n Besides, why do you have to pray at school? There are plenty of places for teens to \"express their religion\": church, home, on the front of T-shirts. Religion is practically everywhere.\n\n \n What business of yours is it to question his desire to pray? Big Brother hasn't increased his hold on your that much, has he? emoticon_rolleyes", 
   {}, 
   74677, 
   null, 
   1099353060.0
  ], 
  [
   74690, 
   null, 
   "Big Orn", 
   "Besides, why do you have to pray at school? There are plenty of places for teens to \"express their religion\": church, home, on the front of T-shirts. Religion is practically everywhere.\n\n Prayer, to a Christian, is not a form of religion. It is merely talking to God and that can be at any time and in any way - even silently.", 
   {}, 
   74677, 
   null, 
   1099353420.0
  ], 
  [
   74704, 
   null, 
   "finnedartist", 
   "Prayer, to a Christian, is not a form of religion. It is merely talking to God and that can be at any time and in any way - even silently.\n\n \n I agree that prayer has many forms. I assumed that the poster referred to organized prayer (such as a Bible verse in the daily announcements, students joining hands and praying every morning, etc.) and I questioned why this was necessary in a public school. If God_is_real was indicating something quieter and less intrusive, then my post was unnecessary. I should have asked him (or her) to clarify.", 
   {}, 
   74690, 
   null, 
   1099356780.0
  ], 
  [
   74708, 
   null, 
   "finnedartist", 
   "What business of yours is it to question his desire to pray? Big Brother hasn't increased his hold on your that much, has he? emoticon_rolleyes\n\n \n I am not questioning his desire to pray as much as where he wants to pray. I'm assuming that the poster refers to something along the lines of a teacher leading a class in prayer, not quiet reflection before lunch. As long you aren't intruding on anyone's rights, I do not see any problem with prayer in public school. And the god_is_real and I are in agreement. :) \n \n However something like a teacher leading a class in prayer is completely different, even if an alternative activity such as sitting quietly is offered. Something as little as not praying with one's classmates can be excruciating for an adolescent, especially if he is already being alienated for his beliefs. Then consider the pressures that teachers face (standardized testing, controlling rowdy kids...) and the fact that this is unconstitutional (seperation of church and state).\n \n Again, there's nothing wrong with prayer that doesn't ostracize or offend others. In my post I was attacking organized prayer, although I realize that god_is_real may not have been referring to that sort of prayer.", 
   {}, 
   74685, 
   null, 
   1099358880.0
  ], 
  [
   74711, 
   null, 
   "finnedartist", 
   "to uniforms, not being able to pray in school, all this religion stuff. i think kids should be able to exspress their religion\n\n \n What do you mean by expressing religion? T-shirts? Silent prayer?", 
   {}, 
   71021, 
   null, 
   1099359120.0
  ], 
  [
   74713, 
   null, 
   "Tboy321025", 
   "I'm sorry, but there are more ways then on a T-shirt. Wearing a crucifix, talking about it, going to church, i know the ones you listed were just a few examples, but on a t-shirt?", 
   {}, 
   74711, 
   null, 
   1099359360.0
  ], 
  [
   74740, 
   null, 
   "zachvac", 
   "The reason you cannot be forced to pray at school is to protect the rights of children who do NOT share your beliefs or do not believe in a god at all (which would include me). In fact, public schools no longer have prayer because it is a violation of separation between church and state. This actually protects students' right to \"express their religion.\" \n \n\n I don't get what you mean by they \"no longer have prayer\". They are allowed to pray, just not be led by a teacher in a school-sponsored prayer (but the pledge is more religious than I'd like it).\n \n \n\n Besides, why do you have to pray at school? There are plenty of places for teens to \"express their religion\": church, home, on the front of T-shirts. Religion is practically everywhere.\n\n But not allowing them to pray at school would be just as bad as forcing people to pray in schools.", 
   {}, 
   74677, 
   null, 
   1099373580.0
  ], 
  [
   74777, 
   null, 
   "emclean", 
   "this is unconstitutional (seperation of church and state).\n \n side issue, can anyone show me where in the constution \"seperation of church and state\" is?", 
   {}, 
   74740, 
   null, 
   1099411320.0
  ], 
  [
   74784, 
   null, 
   "georged", 
   "side issue, can anyone show me where in the constution \"seperation of church and state\" is?\n\n \n It doesn't specifically separate them, the first amendment protects religion from state. By the same token, that same amendment and subsequent supreme court interpretations prevents state from dominance by religion (though the standing US president would like part of that changed). Freedom of religion from dominance by both religion and/or state was the intent of our founding fathers. A review of why the US was formed and Church of England dominance over that government helps in understanding this issue. I've often wondered if the US wouldn't be bowed by fundamentalist views had not several of the founding fathers been agnostics.", 
   {}, 
   74777, 
   null, 
   1099415940.0
  ], 
  [
   74794, 
   null, 
   "emclean", 
   "true, but the bill of rights dose not say that there has to be a seporation, as seems to be commonly beleved.", 
   {}, 
   74784, 
   null, 
   1099419840.0
  ], 
  [
   74814, 
   null, 
   "georged", 
   "true, but the bill of rights dose not say that there has to be a seporation, as seems to be commonly beleved.\n\n \n For all practical, not ideological, purposes, I think the first amendment does an effective job of separating them. If one believes they're not separated, the supreme court seems very capable of defining the differences, even with the virtuous, moralistic demands of pseudo conservatives intent on stripping states rights out of the constitution to satisfy belief system followers.", 
   {}, 
   74794, 
   null, 
   1099425840.0
  ], 
  [
   74871, 
   null, 
   "finnedartist", 
   "I don't get what you mean by they \"no longer have prayer\". They are allowed to pray, just not be led by a teacher in a school-sponsored prayer (but the pledge is more religious than I'd like it).\n\n \n That's exactly what I have trying to explain in my replies:\n \n \nI am not questioning his desire to pray as much as where he wants to pray. I'm assuming that the poster refers to something along the lines of a teacher leading a class in prayer, not quiet reflection before lunch. As long you aren't intruding on anyone's rights, I do not see any problem with prayer in public school.\n", 
   {}, 
   74740, 
   null, 
   1099444380.0
  ], 
  [
   75257, 
   null, 
   "badax22", 
   "Originally Posted by finnedartist\n I am not questioning his desire to pray as much as where he wants to pray. I'm assuming that the poster refers to something along the lines of a teacher leading a class in prayer, not quiet reflection before lunch. As long you aren't intruding on anyone's rights, I do not see any problem with prayer in public school. \n\n \n completely agree emoticon_xhoho", 
   {}, 
   74871, 
   null, 
   1099546560.0
  ], 
  [
   75263, 
   null, 
   "zachvac", 
   "completely agree emoticon_xhoho\n\n \n same emoticon_xhoho", 
   {}, 
   75257, 
   null, 
   1099547520.0
  ], 
  [
   75551, 
   null, 
   "finnedartist", 
   "same emoticon_xhoho\n\n \n Hurray! emoticon_xhoho", 
   {}, 
   75263, 
   null, 
   1099627080.0
  ], 
  [
   75565, 
   null, 
   "Mach", 
   "For all practical, not ideological, purposes, I think the first amendment does an effective job of separating them. If one believes they're not separated, the supreme court seems very capable of defining the differences, even with the virtuous, moralistic demands of pseudo conservatives intent on stripping states rights out of the constitution to satisfy belief system followers.\n\n \n with 1-4 supreme court judge slots that will be filled by the current far right conservatives in power, do you think this may change?\n \n -Mach", 
   {}, 
   74814, 
   null, 
   1099633080.0
  ], 
  [
   75758, 
   null, 
   "finnedartist", 
   "with 1-4 supreme court judge slots that will be filled by the current far right conservatives in power, do you think this may change?\n \n\n \n *Shudder* Hearing that sort of thing makes me feel angry and scared.", 
   {}, 
   75565, 
   null, 
   1099706580.0
  ], 
  [
   75779, 
   null, 
   "georged", 
   "with 1-4 supreme court judge slots that will be filled by the current far right conservatives in power, do you think this may change?\n \n -Mach\n\n \n Yes. The general US public is currently in a position of experiencing declining standards of living from migrating to a service level economy with the resulting sinking dollar, fearful of being at war in an unconventional circumstance due to foreign policy and our social structure has been rapidly deteriorating for the past 25-years. They'll respond to 'family values' and other mythical beliefs that hold futile hopes of returning to the 'good old days' of prosperity and world trade dominance. The politicians will use public money to promise them those things. Without a liberal supreme court influence (I'm a conservative who prefers judicial balance), our system of government will continue the blend into one system trend without opposing viewpoints.", 
   {}, 
   75565, 
   null, 
   1099712820.0
  ], 
  [
   75784, 
   null, 
   "Dzeron", 
   "But not allowing them to pray at school would be just as bad as forcing people to pray in schools.\n\n \n I don't think students are allowed to just randomly stand up in the middle of class and start shouting the Lord's Prayer, if that's what you mean (when I was in high school, someone actually did that to test the system.) Also, if students are not listening to the teacher because they are praying (silently,) then the teacher has the right to repremand them just as if they were twiddling their thumbs, sleeping, or doodling. It's only reasonable.\n \n It does not go to the extent of \"When you are in school, you must hail Atheism, denounce your gods, and salute the Hammer and Sickle.\"", 
   {}, 
   74740, 
   null, 
   1099713420.0
  ], 
  [
   75887, 
   null, 
   "JPSartre12", 
   "with 1-4 supreme court judge slots that will be filled by the current far right conservatives in power, do you think this may change?\n \n -Mach\n\n \n I'm not aware of any far right conservatives in power. Didn't GW, the liberal, er....\"compassionate conservative' win the election? \n emoticon_confused", 
   {}, 
   75565, 
   null, 
   1099780380.0
  ], 
  [
   75889, 
   null, 
   "georged", 
   "I'm not aware of any far right conservatives in power. Didn't GW, the liberal, er....\"compassionate conservative' win the election? \n emoticon_confused\n\n \n I believe the point was made with regard to interpretations of constitutional rights being influenced by born-again mentality and Christian belief system values, not fiscal policy.", 
   {}, 
   75887, 
   null, 
   1099781580.0
  ], 
  [
   75912, 
   null, 
   "zachvac", 
   "I don't think students are allowed to just randomly stand up in the middle of class and start shouting the Lord's Prayer, if that's what you mean (when I was in high school, someone actually did that to test the system.) Also, if students are not listening to the teacher because they are praying (silently,) then the teacher has the right to repremand them just as if they were twiddling their thumbs, sleeping, or doodling. It's only reasonable.\n \n It does not go to the extent of \"When you are in school, you must hail Atheism, denounce your gods, and salute the Hammer and Sickle.\"\n\n \n I meant we shouldn't outright ban praying in school. If a kid wants to pray at lunch, they should be allowed to, if they want to before or after class, fine. Just like we have the freedom of speech but can't yell \"FIRE!!\" in a crowded room or lie or speak during a class. I didn't say people should be able to pray whenever they want, but we shouldn't ban prayer in schools as it would be just as bad as making it mandatory.", 
   {}, 
   75784, 
   null, 
   1099796700.0
  ], 
  [
   76029, 
   null, 
   "JPSartre12", 
   "I believe the point was made with regard to interpretations of constitutional rights being influenced by born-again mentality and Christian belief system values, not fiscal policy.\n\n \n The majority of our forefathers who wrote the Constitution were Christians. If we \"survived\" Christianity then, I'm willing to bet we'd do it again. \n emoticon_rolleyes", 
   {}, 
   75889, 
   null, 
   1099853400.0
  ], 
  [
   76067, 
   null, 
   "georged", 
   "The majority of our forefathers who wrote the Constitution were Christians. If we \"survived\" Christianity then, I'm willing to bet we'd do it again. \n emoticon_rolleyes\n\n \n 98% of original Americans were professed protestants (to not profess that belief involved dunking, hangings and such). Your profession and social enlightenment have reduced that number to under 70%, with 42% (Gallup, all denominations) currently attending worship services on a regular basis in a formal manner. The downward trend began in the 1930s, with post-WW11 contributing larger percentages as America shed some of our geographical and intellectual isolation. Europe has far higher numbers of agnostics and atheists, but they're far older societies with more inter-cultural mixtures than the US and shed much of their ethnic racism long ago. By the middle of this century followers of Islam are expected to exceed Christianity as the world's largest belief system, based on birth rates and documented conversion rates. \n \n As a nation we're moving away from belief system based morality, expected to continue at the rate of over 1%/year. As common, geographically opposed examples, Washington State and Vermont have 25% and 22% of adults who claim no religious affiliation. The exception is growth of the Church of Latter Day Saints (Mormon) as they immerse their lives (no pun intended) in their religion, but thats a very small percentage of the population and they're unevenly split between fundamentalism and reformed classes of worship. So the times are, fortunately, a changin'.", 
   {}, 
   76029, 
   null, 
   1099865700.0
  ], 
  [
   76070, 
   null, 
   "joebrummer", 
   "The majority of our forefathers who wrote the Constitution were Christians. If we \"survived\" Christianity then, I'm willing to bet we'd do it again. \n emoticon_rolleyes\n\n \n \n Sorry, No go. The majority of our Founding Fathers were Diests! They may have liked the morality of the bible, but they didn't believe Jesus was the son of man, and certainly didn't beleive he was a god!\n \n \n \n http://www.sullivan-county.com/news/ffnc/", 
   {}, 
   76029, 
   null, 
   1099867740.0
  ], 
  [
   76977, 
   null, 
   "unkerpaulie", 
   "Besides, why do you have to pray at school? There are plenty of places for teens to \"express their religion\": church, home, on the front of T-shirts. Religion is practically everywhere.\n\n tell me, wouldnt it be offensive to theists if an atheist walked around with a t-shirt that says \"God is not real\" or something to that effect?", 
   {}, 
   74677, 
   null, 
   1100208720.0
  ], 
  [
   77174, 
   null, 
   "finnedartist", 
   "tell me, wouldnt it be offensive to theists if an atheist walked around with a t-shirt that says \"God is not real\" or something to that effect?\n\n \n Possibly. I know that I don't care when I see Christians wearing their shirts. However if all of these Christians can wear T-shirts from their churches, maybe atheists should be able to wear their shirts. \n \n Or maybe no body should be allowed to wear any shirt that makes ANY kind of statement. emoticon_rolleyes \n \n I personally don't care when Christians wear T-shirts. I start getting offended when I'm handed a pamphlet or something.", 
   {}, 
   76977, 
   null, 
   1100326020.0
  ], 
  [
   77225, 
   null, 
   "zachvac", 
   "Possibly. I know that I don't care when I see Christians wearing their shirts. However if all of these Christians can wear T-shirts from their churches, maybe atheists should be able to wear their shirts. \n \n Or maybe no body should be allowed to wear any shirt that makes ANY kind of statement. emoticon_rolleyes \n \n I personally don't care when Christians wear T-shirts. I start getting offended when I'm handed a pamphlet or something.\n\n \n People should have the right to wear whatever they want on their T-shirts (as long as it doesn't disturb the learning environment, such as profanity, obsenity, etc.). You can wear a shirt saying \"All atheists are jerks\" or one kid in my school has the T-shirt \"Religion is a crutch for those who can't think\". You have the freedom of expression.", 
   {}, 
   77174, 
   null, 
   1100386980.0
  ], 
  [
   77233, 
   null, 
   "finnedartist", 
   "You can wear a shirt saying \"All atheists are jerks\" or one kid in my school has the T-shirt \"Religion is a crutch for those who can't think\". You have the freedom of expression.\n\n \n He was brave to wear that T-shirt to school. Nothing wrong with it, but I can think of some kids who would take it personally.", 
   {}, 
   77225, 
   null, 
   1100394240.0
  ], 
  [
   77328, 
   null, 
   "zachvac", 
   "He was brave to wear that T-shirt to school. Nothing wrong with it, but I can think of some kids who would take it personally.\n\n \n Well I don't know him personally, just saw it in the hall. Who knows, it could have started a fight. Wouldn't surprise me.", 
   {}, 
   77233, 
   null, 
   1100464260.0
  ], 
  [
   77332, 
   null, 
   "georged", 
   "He was brave to wear that T-shirt to school. Nothing wrong with it, but I can think of some kids who would take it personally.\n\n \n Those who can't think?", 
   {}, 
   77233, 
   null, 
   1100464980.0
  ], 
  [
   79616, 
   null, 
   "amadeus_reborn", 
   "you kids are hyped up on nothing. your obsession to be wanted is overwhelming, (i would know, im 15) but the people who will really be your friends in the long run are the ones who dont give a damn about what you wear.", 
   {}, 
   77332, 
   null, 
   1101774300.0
  ], 
  [
   79631, 
   null, 
   "pandion", 
   "side issue, can anyone show me where in the constution \"seperation of church and state\" is?\n\n I would be happy to explain the principle to you if you would first point out to me where in the Constitution God or Jesus are mentioned.\n \nbut the bill [sic] of rights [sic] dose [sic] not say that there has to be a seporation [sic], as seems to be commonly beleved.\n\n But according to Jefferson the intent and purpose of the religious freedom clauses of the 1st Amendment are to establish a \"wall of separation between church and state.\"\n \nThe majority of our forefathers who wrote the Constitution were Christians.\n\n Actually they weren't. The majority were deists.\n \n98% of original Americans were professed protestants\n\n Only about 15% of Americans at the time of the Revolution attended any church.", 
   {}, 
   79616, 
   null, 
   1101775320.0
  ], 
  [
   79647, 
   null, 
   "amadeus_reborn", 
   "...u know, that had nothing to do w/this...sorry, i read the wrong thing, and clicked the wrong post. my bad! emoticon_emb sry.", 
   {}, 
   79631, 
   null, 
   1101776700.0
  ], 
  [
   79687, 
   null, 
   "emclean", 
   "I would be happy to explain the principle to you if you would first point out to me where in the Constitution God or Jesus are mentioned.\n \n as we both know, it is not in the text anywhere. so where is the seperation of church and state", 
   {}, 
   79647, 
   null, 
   1101791760.0
  ], 
  [
   86356, 
   null, 
   "chaoticgnome", 
   "As any proper Christian who reads the bible would know, Jesus supported the separation of Church and state: Matthew (ch. XXII, v. 21) \n \n \"Render unto Caesar the things that are Caesars; and unto God the things that are God's.\"\n \n This quote is obviously open to interpretation, but seems more clear cut than most.", 
   {
    "post_info": {
     "post_title": "Separation of Church and State"
    }
   }, 
   79687, 
   null, 
   1105587960.0
  ], 
  [
   86359, 
   null, 
   "JPSartre12", 
   "As any proper Christian who reads the bible would know, Jesus supported the separation of Church and state: Matthew (ch. XXII, v. 21) \n \n \"Render unto Caesar the things that are Caesars; and unto God the things that are God's.\"\n \n This quote is obviously open to interpretation, but seems more clear cut than most.\n\n \n Actually, what was meant was that God's kingdom is in Heaven, not on earth, so he laid no claim to worldly possessions.", 
   {}, 
   86356, 
   null, 
   1105588260.0
  ], 
  [
   86363, 
   null, 
   "Dzeron", 
   "Actually, what was meant was that God's kingdom is in Heaven, not on earth, so he laid no claim to worldly possessions.\n\n \n But the integration of church and state defies this principle.", 
   {}, 
   86359, 
   null, 
   1105589280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  i am in 8th grade and i say no", 
  "url": "http://www.4forums.com/political/education-debates/3404-i-am-8th-grade-i-say-no.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 3404, 
  "discussion_files": [
   [
    "21579.html", 
    "http://www.4forums.com/political/education-debates/3404-i-am-8th-grade-i-say-no-print.html"
   ], 
   [
    "21580.html", 
    "http://www.4forums.com/political/education-debates/3404-i-am-8th-grade-i-say-no-3-print.html"
   ], 
   [
    "21581.html", 
    "http://www.4forums.com/political/education-debates/3404-i-am-8th-grade-i-say-no-2-print.html"
   ]
  ], 
  "identifier": 3404
 }
]