[
 [
  [
   71051, 
   null, 
   "greg 79 f150", 
   "Where do you see the prime interest rate headed in '05 ? Will '05 bring a spiraling upward trend, or will the prime stay somwhere in the single digits ?", 
   {
    "post_info": {
     "post_title": "Prime interest rate"
    }
   }, 
   null, 
   null, 
   1097467260.0
  ], 
  [
   71104, 
   null, 
   "georged", 
   "Up. Demand for commercial expansion just isn't there. we're not experiencing any real inflation, but our declining dollar is making things seem more expensive to the consumer and the fed will use that excuse to raise their interest rate to pacify foreign investors who purchase 45% of our treasury issues and keep us afloat.\n \n The big danger of increasing rates is damage to our only strong domestic industry, residential housing construction. I believe each point of increase eliminates 5% of potential qualifiers and four additional points would devastate that market. Increases would also adversely affect our already fragile domestic vehicle manufacturers, caught in their traps of free financing and rebates. \n \n There are so many existing negative and potentially negative factors with no positives in our economy that realistic interest rate predictions are difficult to ascertain. To me, the big questions are how high our insane deficits will go with a declining tax base and Iraq and what will happen with oil prices and our trade imbalance. Those issues are what make foreign investors look closer at our mess and determines their interest rate requirements.", 
   {}, 
   71051, 
   null, 
   1097508120.0
  ], 
  [
   71177, 
   null, 
   "greg 79 f150", 
   "Good reply George, thanks . Your 100 % right on, the uncertainty of the economy along with the incumbent President's spending spree , is making the possibility of the prime going up quickly in '05 very real. I just cannot fathom where the billions and billions of dollars is supposed to come from, when so many of our jobs are being outsourced.", 
   {}, 
   71104, 
   null, 
   1097537280.0
  ], 
  [
   71180, 
   null, 
   "georged", 
   "IMO the outsourcing is small potatoes when the current 'job gains' propoganda includes a majority of government jobs. I know where the money we don't have our current administration is spending will come from, workers and their descendants with crushing tax burdens. The administration is covered by personal well-hedged trust funds and government workers have their own lucrative retirement programs not associated with social security. The joke is on the American public and their current blind support of professional politicians.", 
   {}, 
   71177, 
   null, 
   1097538300.0
  ], 
  [
   71441, 
   null, 
   "Dono", 
   "Quote: \"The joke is on the American public and their current blind support of professional politicians.\"\n \n Very true. What really bothers me is today's almost universal acceptance of debt as a good thing. I am not speaking of the proper use of debt as a building tool, I am talking about the attitude of get it now, pay later that is so common in the populace. The average credit card debt is over $7000 and growing, I doubt that these people, who can't control their own spending, have a clue regarding the governments spending habits .... or care. We, as a nation, save very little of what we make and we outspend the rest of the world by a wide margin, on credit. My grandfather, who planted the seeds of my fiscal beliefs, saved something from every payday he ever had and avoided debt like a sickness. He told me once, \"If you dance, you have to pay the fiddler\". Problem is, we are doing the dancing and our children and grandchildren will have to pay the fiddler. We are living on borrowed money .... and borrowed time.\n Dono", 
   {}, 
   71180, 
   null, 
   1097697180.0
  ], 
  [
   71453, 
   null, 
   "billsco", 
   "\n The average credit card debt is over $7000 and growing, I doubt that these people, who can't control their own spending, have a clue regarding the governments spending habits .... or care.\n\n \n Why is that figure representative of people \"who can't control their spending\"? Seems impossibly arbitrary to me.\n \n \n \n\n \n We, as a nation, save very little of what we make and we outspend the rest of the world by a wide margin, on credit. My grandfather, who planted the seeds of my fiscal beliefs, saved something from every payday he ever had and avoided debt like a sickness. He told me once, \"If you dance, you have to pay the fiddler\". Problem is, we are doing the dancing and our children and grandchildren will have to pay the fiddler. We are living on borrowed money .... and borrowed time.\n Dono \n\n \n Avoiding debt like a sickness is not good advice, IMO. It sounds more like a recipe for poverty.", 
   {}, 
   71441, 
   null, 
   1097699400.0
  ], 
  [
   71461, 
   null, 
   "georged", 
   "Why is that figure representative of people \"who can't control their spending\"? Seems impossibly arbitrary to me.\n \n \n \n \n Avoiding debt like a sickness is not good advice, IMO. It sounds more like a recipe for poverty.\n\n \n This will probably bring me some flack, but I consider anyone paying 18+% interest on any credit card debt in serious need of professional financial counseling. For those who advocate debt at those interest rates, good luck with life. \n \n There's nothing wrong with personal debt on an asset that appreciates at an annual rate that exceeds interest costs, such as a residence. Debt on assets that depreciate, such as vehicles, are merely increasing one's cost of living. Not the way to build wealth unless it increases income by a factor exceeding the depreciation and interest rates. \n \n Avoiding debt like a sickness for anything but appreciating assets is not bad advice, its excellent advice. The only reason debt should be used for depreciating assets is if the interest rate on the item is less than the income from an investment, leaving a positive spread on the investment to debt and the ability to retire the debt if one's income suddenly decreases. \n \n Living in personal debt is a form of poverty practiced by a great number of Americans. Servicing that debt helped increase our standard of living costs to a point where we're no longer competitive in world markets. We're just beginning to pay the piper on that one, with some very rough patches ahead.\n \n That's personal finance. Business differs in that cost of capital is the primary consideration of incurring debt and the type of debt.", 
   {}, 
   71453, 
   null, 
   1097702280.0
  ], 
  [
   71462, 
   null, 
   "georged", 
   "Dono - How was that for words wasted on most instant gratification required Americans? Especially those who think they're getting 'free' financing on their vehicles?", 
   {}, 
   71461, 
   null, 
   1097702820.0
  ], 
  [
   71599, 
   null, 
   "Dono", 
   "Dono - How was that for words wasted on most instant gratification required Americans? Especially those who think they're getting 'free' financing on their vehicles?\n\n I appreciate the words. I am still stuck on \"impossibly arbitrary\", an interesting choice of words. Since I prefaced my statement not to include properly used credit, I find the \"recipe for poverty\" statement somewhat comical. For the record, my grandfather, who had no formal education and was a meat-cutter in a market, used that recipe through and after the depression to feed, shelter, educate his children and accumulate property. He experienced many things, poverty was not one of them.\n Dono", 
   {}, 
   71462, 
   null, 
   1097783880.0
  ], 
  [
   71653, 
   null, 
   "georged", 
   "When a country has leadership that encourages the citizenry to make consumer purchases to make America strong, knowing full well the majority of those purchases will be on 18%+ credit cards, and creates record public deficits to pursue aggressive foreign policy, all for purposes of polishing the GDP, the example set for citizens is what we now experience; a true recipe for eventual poverty when the piper comes calling. That's why I've gone to AAA insured muni bonds.", 
   {}, 
   71599, 
   null, 
   1097794980.0
  ], 
  [
   71794, 
   null, 
   "billsco", 
   "I appreciate the words. I am still stuck on \"impossibly arbitrary\", an interesting choice of words. Since I prefaced my statement not to include properly used credit, I find the \"recipe for poverty\" statement somewhat comical. For the record, my grandfather, who had no formal education and was a meat-cutter in a market, used that recipe through and after the depression to feed, shelter, educate his children and accumulate property. He experienced many things, poverty was not one of them.\n Dono\n\n \n Your preface (properly used credit) is mutually exclusive to the following statement that your grandfather avoided debt like a sickness, and that's why I missed it. I have never sought properly used sickness, it's an oxymoron. The term means that debt is to be avoided at all costs, something your grandfather, in another era, apparently did. I don't agree with him.\n \n I take issue with your contention that $7000 is somehow a sign that my spending is out of control, and that, in addition, I'm oblivious to the country's fiscal policies.\n \n \n\n The average credit card debt is over $7000 and growing, I doubt that these people, who can't control their own spending, have a clue regarding the governments spending habits .... or care. \n\n \n I will only agree that carrying that balance at 18% is stupid, let alone unnecessary. There are a myriad of offers which represent good deals which my local bank can't match.\n \n I disagree that one should never borrow money unless it's to increase equity. This is a philosophical choice I make--not a strictly dollars and cents issue-- and again does not mean my spending is out of control. I don't wish to die with the largest amount of money I could possibly have amassed in my savings account. If you wish to, that's fine. The difference is I'm not calling you clueless and out of control.", 
   {}, 
   71599, 
   null, 
   1097853840.0
  ], 
  [
   71805, 
   null, 
   "georged", 
   "The only ways I know of for an individual to borrow money at less than preferred bank rates, generally prime or prime plus X basis points, is from family/friends or on margin against a securities account. If borrowed against an asset, such as 'free' vehicle or other consumer product financing, the spread is always in the product cost. \n \n There are two issues that also block financing below market rates:\n \n 1. The IRS classifies a below market rate loan from a family member as a gift for the portion of interest below market rate.\n \n 2. Commerical loans made at below existing market rates are generally uncollectable in a court of law as they're classified as favorable contracts. \n \n Money has no friends.", 
   {}, 
   71794, 
   null, 
   1097856240.0
  ], 
  [
   71854, 
   null, 
   "Dono", 
   "\"Your preface (properly used credit) is mutually exclusive to the following statement that your grandfather avoided debt like a sickness, and that's why I missed it. I have never sought properly used sickness, it's an oxymoron. The term means that debt is to be avoided at all costs, something your grandfather, in another era, apparently did. I don't agree with him.\"\n \n I usually post in the same way I would argue opinions with a friend over a drink and I am usually able to get my point across. I reread the post and I believe most will get the point I was making, notwithstanding any real or alleged boo-boos in the composition.\n \n \"I take issue with your contention that $7000 is somehow a sign that my spending is out of control, and that, in addition, I'm oblivious to the country's fiscal policies.\"\n \n Again, my point was to the out of control debt habits I perceive in the general populous and the government, and were not directed to you or any other specific individual(s). From the content of your posts I have no doubt that you are aware of the country's fiscal policies. I look forward to exchanging more views with you.\n \n \"I will only agree that carrying that balance at 18% is stupid, let alone unnecessary. There are a myriad of offers which represent good deals which my local bank can't match.\"\n \n This stupidity we agree on is rampant and growing.\n \n \"I disagree that one should never borrow money unless it's to increase equity. This is a philosophical choice I make--not a strictly dollars and cents issue-- and again does not mean my spending is out of control. I don't wish to die with the largest amount of money I could possibly have amassed in my savings account. If you wish to, that's fine.\"\n \n Good for you ... and thank you.\n \n \"The difference is I'm not calling you clueless and out of control.\"\n\n \n Most will have no problem with my post and the point which I still believe is clear and valid. I had no intent to offend anyone, including any closet paranoids, sensitive individuals, or specific individuals in general. \"clueless and out of control\" are not my words, but are apt in most cases to the point. I see it as a \"shoe fits\" thing.\n \n The Treasury Department just announced a record $413 billion deficit for 2004 (inflation adjusted, the highest shortfall since WW ll). Since the original projection was $477 billion, expect an announcement soon that the administration has cut the deficit by $64 billion dollars. Expect also that many people will buy that. Disclaimer: I am not saying that any specific individual will believe that.\n Dono", 
   {}, 
   71794, 
   null, 
   1097873940.0
  ], 
  [
   71887, 
   null, 
   "Dono", 
   "For some interesting reading on the candidates and the deficit check out FISCAL POLICY IN CAMPAIGN 2004 at concordcoalition.org . \n Dono", 
   {}, 
   71854, 
   null, 
   1097891100.0
  ], 
  [
   72093, 
   null, 
   "billsco", 
   "America is still the land of opportunity. Where else could you earn enough to owe so much? :) \n \n As to the OP, I think it's going to be very hard to raise the prime rate much more as long as oil prices continue to act as a brake on the economy.", 
   {}, 
   71887, 
   null, 
   1098036300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Prime interest rate", 
  "url": "http://www.4forums.com/political/government-debates/3407-prime-interest-rate.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 3407, 
  "discussion_files": [
   [
    "20819.html", 
    "http://www.4forums.com/political/government-debates/3407-prime-interest-rate-print.html"
   ]
  ], 
  "identifier": 3407
 }
]