[
 [
  [
   71088, 
   null, 
   "jim's trucking", 
   "http://www.citizensunited.org/manyfaces.html\n \n new biography exposes the many different faces of John Kerry\n Washington, D.C.: From David Bossie, former chief congressional investigator comes the first comprehensive political biography of the man no one really knows&#8212;the 2004 democratic presidential nominee. In The Many Faces of John Kerry: Why this Massachusetts Liberal is Wrong for America (WND Books), Bossie exposes how John Kerry has had his eye on the White House since childhood and has been willing to do and say whatever it takes to win the presidency. \n Using his trademark in-depth investigating, Bossie gives readers the real scoop on the presidential challenger- offering the only analysis of Kerry's peculiar voting record; early Naval discharge (so he could protest the Vietnam War); self-contradictory positions on such vital issues as the war in Iraq, fighting terrorism, tax cuts, health care, education, and campaign finance; and shady political dealings he'd rather voters not know about.\n With an exclusive jailhouse interview with former Kerry finance chairman, Bossie exposes Kerry biggest character flaw: He is a hypocrite. While criticizing Republicans for their close ties with big business and corporate scandal, Kerry himself is actually guilty of such conduct.\n \n In The Many Faces of John Kerry, Bossie unearths many shocking revelations from Kerry's lifelong ambition of climbing the political latter, including:\n &#61623; How in 1972 Kerry, the political opportunist went district to district, shopping for any constituency that would take him&#8212;locally the term became known as \"Kerrymandering\" \n &#61623; How, in a dramatic speech in front of the United States Senate on April 22, 1971, Kerry lied under oath to the U.S. Congress&#8212;it was discovered later when pressed that he had not actually witnessed war crimes he claims were committed by fellow soldiers in Vietnam \n &#61623; How Kerry has accused the Bush administration of corruption but he himself had a close political relationship with David Paul, a central figure in the BCCI banking scandal of the late 1980s \n &#61623; How Kerry's anti-war protests during the Vietnam war actually affected treatment of the POWs by the North Vietnamese- Senator John McCain remarked after six years in captivity at the infamous Hanoi Hilton prison that his captors were bombarding him with anti-war rhetoric from the United States \n &#61623; How Kerry, while leading the Senate investigation into BCCI, attended extravagant lavish parties, used the personal jets, luxury yachts and hob-knobbed with the main suspects of the investigation. \n &#61623; How, despite Kerry claims to have \"never taken a dime of political action committee (PAC) money,\" he is the Senate's \"top recipient of individual campaign contributions from paid lobbyists; he's taken more money from them over the past fifteen years than any of his Senate colleagues.\" \n &#61623; How Kerry bashes \"big corporations\" on the campaign trail, but has hundreds of thousands of dollars in campaign donations from \"big corporations\" \n &#61623; How Kerry has criticized the Bush administration for pursuing economic policies which encourage corporations to send jobs overseas, but his wife's own Heinz Corp. has been off-shoring hundreds of American jobs, and his own presidential campaign has outsourced jobs to Canada \n &#61623; How members of Veterans Against the War - the group he formed after Vietnam - viewed Kerry as a \"power-grabbing elitist,\" and unlike the rest of the members. He was the brunt of jokes for his servants and his upper-class persona \n &#61623; How Kerry intervened in the Senate to keep open a major loophole that allowed an insurance company to divert millions from the nation's most expensive construction project, then received tens of thousand of dollars in donations from the same company \n &#61623; How Kerry has supported nearly every tax increase or piece of legislation that would repeal tax cuts during his 20-plus years in the Senate, and is vowing to scale back tax cuts passed by the Bush administration \n &#61623; How Kerry has championed his Vietnam service and belittled President Bush for getting an early discharge from the Texas Air National Guard to pursue politics, but Kerry also requested-and received-an early discharge from the U.S. Navy so he could run for Congress on an \"anti-war platform\" \n &#61623; How Kerry demeans those that serve in the National Guard - even though \"about one-fifth of the 130,000 soldiers in Iraq- 28,000-were members of the National Guard and Reserve,\" and Air National Guard members have served in nearly every conflict fought by the U.S. since WWI. \n &#61623; How Kerry, on the surface, champions environmentalism, but he has refused to weigh in on a proposed wind farm project near one of his homes in Cape Cod, to the point of drawing criticism for his silence from environmental group Greenpeace \n After producing the goods on Kerry&#8212;his elitist background, his long history of flip-flops on the important issues, his practice of dirty campaign tricks, his hypocritical stance on special interest money from big corporations, and his willingness to do whatever it takes to win the presidency, putting his own political gain ahead of national security&#8212;David Bossie with The Many Faces of John Kerry, delivers a shattering indictment of the Massachusetts liberal.", 
   {
    "post_info": {
     "post_title": "Books abound!"
    }
   }, 
   null, 
   null, 
   1097504460.0
  ], 
  [
   71092, 
   null, 
   "jskufan", 
   "http://www.citizensunited.org/manyfaces.html\n \n new biography exposes the many different faces of John Kerry\n Washington, D.C.: From David Bossie, former chief congressional investigator comes the first comprehensive political biography of the man no one really knows-the 2004 democratic presidential nominee. In The Many Faces of John Kerry: Why this Massachusetts Liberal is Wrong for America (WND Books), Bossie exposes how John Kerry has had his eye on the White House since childhood and has been willing to do and say whatever it takes to win the presidency. \n Using his trademark in-depth investigating, Bossie gives readers the real scoop on the presidential challenger- offering the only analysis of Kerry's peculiar voting record; early Naval discharge (so he could protest the Vietnam War); self-contradictory positions on such vital issues as the war in Iraq, fighting terrorism, tax cuts, health care, education, and campaign finance; and shady political dealings he'd rather voters not know about.\n With an exclusive jailhouse interview with former Kerry finance chairman, Bossie exposes Kerry biggest character flaw: He is a hypocrite. While criticizing Republicans for their close ties with big business and corporate scandal, Kerry himself is actually guilty of such conduct.\n \n In The Many Faces of John Kerry, Bossie unearths many shocking revelations from Kerry's lifelong ambition of climbing the political latter, including:\n &#61623; How in 1972 Kerry, the political opportunist went district to district, shopping for any constituency that would take him-locally the term became known as \"Kerrymandering\" \n &#61623; How, in a dramatic speech in front of the United States Senate on April 22, 1971, Kerry lied under oath to the U.S. Congress-it was discovered later when pressed that he had not actually witnessed war crimes he claims were committed by fellow soldiers in Vietnam \n &#61623; How Kerry has accused the Bush administration of corruption but he himself had a close political relationship with David Paul, a central figure in the BCCI banking scandal of the late 1980s \n &#61623; How Kerry's anti-war protests during the Vietnam war actually affected treatment of the POWs by the North Vietnamese- Senator John McCain remarked after six years in captivity at the infamous Hanoi Hilton prison that his captors were bombarding him with anti-war rhetoric from the United States \n &#61623; How Kerry, while leading the Senate investigation into BCCI, attended extravagant lavish parties, used the personal jets, luxury yachts and hob-knobbed with the main suspects of the investigation. \n &#61623; How, despite Kerry claims to have \"never taken a dime of political action committee (PAC) money,\" he is the Senate's \"top recipient of individual campaign contributions from paid lobbyists; he's taken more money from them over the past fifteen years than any of his Senate colleagues.\" \n &#61623; How Kerry bashes \"big corporations\" on the campaign trail, but has hundreds of thousands of dollars in campaign donations from \"big corporations\" \n &#61623; How Kerry has criticized the Bush administration for pursuing economic policies which encourage corporations to send jobs overseas, but his wife's own Heinz Corp. has been off-shoring hundreds of American jobs, and his own presidential campaign has outsourced jobs to Canada \n &#61623; How members of Veterans Against the War - the group he formed after Vietnam - viewed Kerry as a \"power-grabbing elitist,\" and unlike the rest of the members. He was the brunt of jokes for his servants and his upper-class persona \n &#61623; How Kerry intervened in the Senate to keep open a major loophole that allowed an insurance company to divert millions from the nation's most expensive construction project, then received tens of thousand of dollars in donations from the same company \n &#61623; How Kerry has supported nearly every tax increase or piece of legislation that would repeal tax cuts during his 20-plus years in the Senate, and is vowing to scale back tax cuts passed by the Bush administration \n &#61623; How Kerry has championed his Vietnam service and belittled President Bush for getting an early discharge from the Texas Air National Guard to pursue politics, but Kerry also requested-and received-an early discharge from the U.S. Navy so he could run for Congress on an \"anti-war platform\" \n &#61623; How Kerry demeans those that serve in the National Guard - even though \"about one-fifth of the 130,000 soldiers in Iraq- 28,000-were members of the National Guard and Reserve,\" and Air National Guard members have served in nearly every conflict fought by the U.S. since WWI. \n &#61623; How Kerry, on the surface, champions environmentalism, but he has refused to weigh in on a proposed wind farm project near one of his homes in Cape Cod, to the point of drawing criticism for his silence from environmental group Greenpeace \n After producing the goods on Kerry-his elitist background, his long history of flip-flops on the important issues, his practice of dirty campaign tricks, his hypocritical stance on special interest money from big corporations, and his willingness to do whatever it takes to win the presidency, putting his own political gain ahead of national security-David Bossie with The Many Faces of John Kerry, delivers a shattering indictment of the Massachusetts liberal.\n\n \n I predict this book will sell a \"strong\" 3-4 copies. One to you, and 2-3 copies to the Bush family. Enjoy!!", 
   {
    "unicode_changes_made": true
   }, 
   71088, 
   null, 
   1097505900.0
  ], 
  [
   71093, 
   null, 
   "jim's trucking", 
   "I predict this book will sell a \"strong\" 3-4 copies. One to you, and 2-3 copies to the Bush family. Enjoy!!\nI won't be buying a copy. I doubt the Bush's will either.\n \n We already know Kerry is slimeball.\n \n I've known it for YEARS!\n \n The book may be enlightening for those who've been drinking the liberal Kool-Aid and who actually think Kerry may have some redeeming values.\n \n Kerry is a self-serving snake....has been for quite some time now.", 
   {}, 
   71092, 
   null, 
   1097506020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Books abound!", 
  "url": "http://www.4forums.com/political/politics-debates/3409-books-abound.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3409, 
  "discussion_files": [
   [
    "31788.html", 
    "http://www.4forums.com/political/politics-debates/3409-books-abound-print.html"
   ]
  ], 
  "identifier": 3409
 }
]