[
 [
  [
   71111, 
   null, 
   "chugalugalug", 
   "Dear friends, \n \n Can you imagine a day when the intimate details of our financial lives are no longer subject to the scrutiny of a faceless bureaucracy with an abysmal record of bungling inefficiency, inaccuracy and abuse of taxpayer rights? DARE TO DREAM! If HR 25 / S1493 becomes the law of the land, the abolition of the IRS will be a dream will come true. Some say this will never come to pass, but I believe there is reason for hope. Not only has the proposal been in the news a great deal, but Treasury Secretary Snow has said that in a Bush second term, Tax Reform will be \"BOLD!\" Please see: http://quote.bloomberg.com/apps/news?pid=10000087&sid=a7CUqFGlG648&refer=top_world_news \n \n Even though I have a lot invested in the study of this Rube Goldberg like device, there are a number of reasons why I support the sales tax proposal. First, a sales tax is really a return to the vision of the Founding Fathers who believed in taxes on consumption only. Please see Federalist Paper No. 21, found at http://federalistpatriot.us/fedpapers/fed_21.html. Second, recent retaliatory actions and rulings of the World Trade Organization would be nullified by the repeal of Title 26 and the concomitant imposition of a national sales tax. Because a sales tax is easily border adjusted, our goods would be better able to compete in the world market which would lead to rapid economic expansion---an expansion that should help ALL Americans. Third, The sales tax would be pay-as-you-go for virtually all, meaning that the vast majority of taxpayers would no longer be subject to audit, lien and levy of their private property in satisfaction of tax debt. This proposal would be a boon for private property rights and privacy rights. Fourth, this is the only plan which will solve the looming Social Security and Medicare crises. \n \n Many have unfairly criticized this proposal. Rebuttals of recent criticisms can be found at: http://www.fairtaxvolunteer.org/smart/rebuttals.html. I feel I must address one of the oft repeated criticisms........that the sales tax will be REGRESSIVE. Let's be clear, the current proposal IS NOT REGRESSIVE, as many who are ignorant of the specifics of the bill suggest. In fact, when the net effect of all changes are considered, the current sales tax proposal is MORE PROGRESSIVE than our current system because the FairTax: 1. Prebates the sales tax charged on povertly level expenditures, 2. Removes the cost of embedded taxation from the price of goods by repealing the corporate tax, and 3. It eliminates the cruelly regressive payroll tax. The payroll tax is openly acknowledged by all to hit low income workers the hardest, yet critics of the sales tax plan conveniently omit the repeal of said from their \"analysis,\" and many refuse to acknowledge what every armchair economist knows......corporations don't pay taxes, people do...often in the form of higher prices. A graph of the effective FairTax rates can be found at: http://www.pafairtax.org/resrcs/taxrates.pdf \n \n We must act in concert if this is to become a reality. Please spread the word and help to dispel the popular myths about the sales tax. Please visit http://www.fairtaxvolunteer.org/opinion/elec_petition.html and sign the electronic petition. Please write to your Congressional Representative, Secretary Snow and the President. Let them know of your support for the bill and ask for their support of HR 25/S 1493, The Fair Tax Act of 2003. Additional information can be found at www.pafairtax.org. Please feel free to forward this e-mail to your friends. Together, we can make April 15th just another beautiful spring day! \n \n Many Thanks. \n \n HJohnMcDaniel@netscape.net", 
   {
    "post_info": {
     "post_title": "President Bush's BOLD AGENDA"
    }
   }, 
   null, 
   null, 
   1097510040.0
  ], 
  [
   71116, 
   null, 
   "georged", 
   "I'm still waiting for realistic details on the manpower, facilities, software and hardware costs of changeover, how long it will take for full implementation, how long it will run parallel with current IRS code, who's developing the code to track components from manufacturer to consumer to ensure accurate tax collection, what will happen to state sales tax revenue and what deficit will be required for the initial capitalization and loss of cash flow from our present collection system regarding employer withholding. Then we can match proposed benefits to existing methodology and forecast the effects on existing industries such as automobiles, housing and other high-ticket consumer goods. Financing 125% of those items will make for some creative imagination. \n \n Otherwise, it still sounds like a pie-in-the-sky political method of short-term polishing the GDP with yet more public debt. Our government, as usual, seems to be long on promises and short on reality.", 
   {}, 
   71111, 
   null, 
   1097512140.0
  ], 
  [
   71126, 
   null, 
   "emclean", 
   "georged, i think we have anouther post and run type here. this is the 4th post on this subject, with out responding to any of the questions.", 
   {}, 
   71116, 
   null, 
   1097516580.0
  ], 
  [
   71150, 
   null, 
   "georged", 
   "georged, i think we have anouther post and run type here. this is the 4th post on this subject, with out responding to any of the questions.\n\n \n Looks like it. Their pattern has been to periodically return with more fluff without answering any questions. That appeals to the average voter, no downside, not unlike send me a check and you'll go to heaven.", 
   {}, 
   71126, 
   null, 
   1097527560.0
  ], 
  [
   71939, 
   null, 
   "GreenMtnBoy", 
   "how would you alleviate the issue of non profit organizations? What about the taxation of services? what about items that already have a federal tax on them (gas) or items that states don't tax (in VT it's food, and clothing items under $100)", 
   {}, 
   71150, 
   null, 
   1097916000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  President Bush's BOLD AGENDA", 
  "url": "http://www.4forums.com/political/tax-debates/3411-president-bushs-bold-agenda.html", 
  "breadcrumbs": [
   "Tax"
  ], 
  "id_number": 3411, 
  "discussion_files": [
   [
    "25230.html", 
    "http://www.4forums.com/political/tax-debates/3411-president-bushs-bold-agenda-print.html"
   ]
  ], 
  "identifier": 3411
 }
]