[
 [
  [
   71153, 
   null, 
   "unkerpaulie", 
   "i think its finally settled that physical (testable or tangible) evidence of God can never be found. this is not only because of its elusive nature to science, but also because of religious requirements.\n \n from a scientic perspective, nothing ever occurs outside of the realm of phyical law. that is, physical laws are constant and unbreakable, and there is nothing new or unpredictable or inexplicable about them. because the laws of physics completely govern ever aspect of the universe, there is nothing left for a supernatural being to do, at least where the phsical realm is concerned. there is no supernatural phenomenon, and no occurance that natural physical laws do not affect\n \n from a religious perspective, knowledge of God can only come through faith. we already know that faith is certainty in the absence of rational evidence, in other word believing without evidence. Hebrews 11:6 says \"And without faith it is impossible to please him. For whoever would draw near to God must believe that he exists and that he rewards those who seek him.\" faith is the key to religion, and only through faith can religion be established. therefore, if some physical observation could verify God's existence, then it would contradict what religion says about God. this is a real catch 22. you search for evidence to solidify your faith, but if evidence comes you dont need faith, and without faith you cannot relate to God\n \n in all, as far as i'm concrned, it is totally futile to seek rational proof of God's existence. even if it was found, it wouldnt be found. i remember saying that it is possible to prove that God exists; that is, in the event that God showed up and said \"hey, it's Me!\". but even this can never happen, because such a scenario would contradict the bible, and thus not prove God exists as far as the bible is concerned.\n \n and when all is said and done, it still doesnt answer the question \"does God exist?\"", 
   {
    "post_info": {
     "post_title": "God by evidence?"
    }
   }, 
   null, 
   null, 
   1097529480.0
  ], 
  [
   71183, 
   null, 
   "Big Orn", 
   "I think you've just about covered it, unkerpaulie.\n \n To me faith, itself, is evidence, but it will never withstand physical/natural scrutiny.\n \n I can&#8217;t add anything.", 
   {}, 
   71153, 
   null, 
   1097538720.0
  ], 
  [
   71220, 
   null, 
   "Mach", 
   "i think its finally settled that physical (testable or tangible) evidence of God can never be found. this is not only because of its elusive nature to science, but also because of religious requirements.\n \n from a scientic perspective, nothing ever occurs outside of the realm of phyical law. that is, physical laws are constant and unbreakable, and there is nothing new or unpredictable or inexplicable about them. because the laws of physics completely govern ever aspect of the universe, there is nothing left for a supernatural being to do, at least where the phsical realm is concerned. there is no supernatural phenomenon, and no occurance that natural physical laws do not affect\n \n from a religious perspective, knowledge of God can only come through faith. we already know that faith is certainty in the absence of rational evidence, in other word believing without evidence. Hebrews 11:6 says \"And without faith it is impossible to please him. For whoever would draw near to God must believe that he exists and that he rewards those who seek him.\" faith is the key to religion, and only through faith can religion be established. therefore, if some physical observation could verify God's existence, then it would contradict what religion says about God. this is a real catch 22. you search for evidence to solidify your faith, but if evidence comes you dont need faith, and without faith you cannot relate to God\n \n in all, as far as i'm concrned, it is totally futile to seek rational proof of God's existence. even if it was found, it wouldnt be found. i remember saying that it is possible to prove that God exists; that is, in the event that God showed up and said \"hey, it's Me!\". but even this can never happen, because such a scenario would contradict the bible, and thus not prove God exists as far as the bible is concerned.\n \n and when all is said and done, it still doesnt answer the question \"does God exist?\"\n\n \n But then it also doesn't answer the question \"does anything exist\", nor does it answer an infinite number of \"existence\" questions. Do \"trolls\" exist, follows the same reasoning. If you find one, they are no longer a fairy tale/imaginary creature, they are some organic life form that can be measured, tested, and quantified..i.e. no longer an imaginary creature. So they can no more be found than god.\n \n So replace god/troll with an infinite number of other imaginary things and you'll see why the question \"Does god exist?\", has no real importance in the physical universe.\n (does the tooth fairy exist, does a unicorn exist, do flying pigs exist, etc.)\n \n In fact, I like that statement. The existence of god is not imporant...\n \n Rather - the FAITH in god(s, etc.) is what is \"important\", and the thoughts most certainly exist in the physical world and have a measureable impact. \n \n I think that's why I don't mind so much \"religion\" per se, it's the human condition that brings suffering, and uncertainty, into our lives and for some people, the feelings brought about by their faith seems to treat the condition. (the human condition also brings joy, love, etc., but I'd like that without the pain personally)\n \n I only mind it when things in the physical universe are \"attacked\" with the premise of belief in god(s), which is a waste of human energy...we have a limited time, don't spend it using fallacy to undermine those who are actually trying to build on the foundation of human knowledge. And any belief in something without evidence scares me if it becomes a driving force behind decisions.\n \n ...she's a witch because she MADE the crops die...she must be burned. \n \n ...he broke \"god's\" law and therefore must be guilty..\n \n ...this is \"god's\" war..\n \n Yeah, that still scares me. That's why I think, at least in the US, the seperation of church and state is so ridiculously important, and accepted. While there are fundamentalists that rail against it...it's hopefully obvious that with ~80% of the US believing in an imaginary \"god\", but also having a separation of church and state and the most generally advanced scienctific community in the world, then the two can obviously co-exist, and I'd go so far as to say thrive as long as the line is drawn and not crossed.\n \n I learned something in responding, thanks for the spark.\n \n -Mach", 
   {}, 
   71153, 
   null, 
   1097551740.0
  ], 
  [
   71272, 
   null, 
   "unkerpaulie", 
   "But then it also doesn't answer the question \"does anything exist\", nor does it answer an infinite number of \"existence\" questions. Do \"trolls\" exist, follows the same reasoning. If you find one, they are no longer a fairy tale/imaginary creature, they are some organic life form that can be measured, tested, and quantified..i.e. no longer an imaginary creature. So they can no more be found than god.\n \n So replace god/troll with an infinite number of other imaginary things and you'll see why the question \"Does god exist?\", has no real importance in the physical universe.\n (does the tooth fairy exist, does a unicorn exist, do flying pigs exist, etc.)\n\n no, with trolls, aliens, ghosts etc, a different case applies. if we discover a troll/alien/ghost, then we verify with physical evidence that these things exist. with God it is imperative, by God's very definition, that nothing but faith be used to verify his existence. this specific rule doesnt apply to anything else.\n \n \nIn fact, I like that statement. The existence of god is not imporant...\n\n i didnt imply that. the question of God's existence is unique and distinct from the other beings. whether it is deemed important rests on the asker, but it cannot be treated under the same light as with other beings\n \n \nRather - the FAITH in god(s, etc.) is what is \"important\", and the thoughts most certainly exist in the physical world and have a measureable impact. \n\n this is true, and thats what locks the catch. by faith one believes that God exists in REALITY, and if so God's existence affects reality. through faith, one views reality and sees \"evidence\" of God's existence affcting it. yet, if this \"evidence\" were to be rational, then faith would no longer be needed. and if faith is not needed then we cannot believe that God exists. the catch traps you into accepting the irrational as evidence, yet knowing that it is not evidence but only a strong conviction that it is\n \n \nI think that's why I don't mind so much \"religion\" per se, it's the human condition that brings suffering, and uncertainty, into our lives and for some people, the feelings brought about by their faith seems to treat the condition. (the human condition also brings joy, love, etc., but I'd like that without the pain personally)\n\n yes. i brought this up in another thread. for every person that finds joy and peace in the name of religion, there is someone that causes destruction and pain in the name of religion. as extreme as the love of God is, just as extreme is the condemnation. it balances perfectly. if religion were to be totally removed, the equilibrium of good/bad would still be maintained\n \n \n I only mind it when things in the physical universe are \"attacked\" with the premise of belief in god(s), which is a waste of human energy...we have a limited time, don't spend it using fallacy to undermine those who are actually trying to build on the foundation of human knowledge. And any belief in something without evidence scares me if it becomes a driving force behind decisions.\n\n this sentiment i dont share. as sadistic as it may sound, sometimes ignorance is some people's only bliss. yes it sounds like civilization backwards, but honestly, i havent seen anything that civil progress has brought us that has made the state of humanity better overall. for every time-saving luxury is a new form of oppression. it always balances\n \n \n...she's a witch because she MADE the crops die...she must be burned. \n \n ...he broke \"god's\" law and therefore must be guilty..\n \n ...this is \"god's\" war..\n \n Yeah, that still scares me. That's why I think, at least in the US, the seperation of church and state is so ridiculously important, and accepted. While there are fundamentalists that rail against it...it's hopefully obvious that with ~80% of the US believing in an imaginary \"god\", but also having a separation of church and state and the most generally advanced scienctific community in the world, then the two can obviously co-exist, and I'd go so far as to say thrive as long as the line is drawn and not crossed.\n \n I learned something in responding, thanks for the spark.\n \n -Mach\n\n I hope more people share their views. thank you for the response", 
   {}, 
   71220, 
   null, 
   1097596500.0
  ], 
  [
   71279, 
   null, 
   "Mach", 
   "no, with trolls, aliens, ghosts etc, a different case applies. if we discover a troll/alien/ghost, then we verify with physical evidence that these things exist. with God it is imperative, by God's very definition, that nothing but faith be used to verify his existence. this specific rule doesnt apply to anything else.\n\n \n That's a stretch you don't need to make though.\n \n Not even considering the fact that the bible contradicts itself..i.e. god performs miracles, speaks to people, etc... \n \n .. it's the definition that god is supernatural that in itself, cannot be reconciled with god \"appearing\". The same goes for any diety, or imaginary thing, if by definition they are imaginary/supernatural. Once you \"find\" something supernatural, they are no longer imaginary or supernatural, thus, you can never find them, they can only exist, by definition, without evidence, with faith. It's relativity in action yet again :)\n \n The contradiction you illustrate stands apart from the bible.\n \n -Mach", 
   {}, 
   71272, 
   null, 
   1097598360.0
  ], 
  [
   71285, 
   null, 
   "unkerpaulie", 
   "That's a stretch you don't need to make though.\n \n Not even considering the fact that the bible contradicts itself..i.e. god performs miracles, speaks to people, etc... \n \n .. it's the definition that god is supernatural that in itself, cannot be reconciled with god \"appearing\". The same goes for any diety, or imaginary thing, if by definition they are imaginary/supernatural. Once you \"find\" something supernatural, they are no longer imaginary or supernatural, thus, you can never find them, they can only exist, by definition, without evidence, with faith. It's relativity in action yet again :)\n \n The contradiction you illustrate stands apart from the bible.\n \n -Mach\n\n that is not true. a levitating guru that has been seen and proven to levitate doesnt make the process natural. an alien that has been seen and proven to teleport and abduct people in their retractor beam doesnt make the process less paranormal. the definition of supernatural/paranormal doesnt automatically mean they can never be observed, just that they defy physical law. the definition of God is a special case that includes never being observed/proven", 
   {}, 
   71279, 
   null, 
   1097599920.0
  ], 
  [
   71298, 
   null, 
   "Kronus", 
   "i think its finally settled that physical (testable or tangible) evidence of God can never be found. this is not only because of its elusive nature to science, but also because of religious requirements.\n \n from a scientic perspective, nothing ever occurs outside of the realm of phyical law. \n\n \n That's not quite right. More accurate would be: Nothing that occurs outside the realm of physical law is in the realm of science. Science by no means precludes the possibility of there being something outside the realm of science.\n \n \n\n from a religious perspective, knowledge of God can only come through faith.\n \n Who says God cares about religion? If God felt like giving us certain knowledge, he could just show up, and to heck with what it did to religion.\n \n \n\n in all, as far as i'm concrned, it is totally futile to seek rational proof of God's existence. even if it was found, it wouldnt be found. i remember saying that it is possible to prove that God exists; that is, in the event that God showed up and said \"hey, it's Me!\". but even this can never happen, because such a scenario would contradict the bible, and thus not prove God exists as far as the bible is concerned.\n \n\n \n That would just prove the Bible wrong, not that God didn't exist. I see no problem with that.", 
   {}, 
   71153, 
   null, 
   1097611140.0
  ], 
  [
   71308, 
   null, 
   "unkerpaulie", 
   "I see what you're saying. i should have noted that i was referring to the biblical God whenever i mentioned \"God\" in post 1\n \n noone has ever observed anything occuring outside of natural law (except the claims the bible makes). you are right that science does not preclude the possibility of an occurance outside of natural law, but we have no such occurance to work with, so they are no more than possibilities (and whether it is even possible for an occurance to be outside of natural law is questionable)\n \n let's take a look at a non-biblical God, then. if such a God exists, what is his definition. can he interact with the physical realm?", 
   {}, 
   71298, 
   null, 
   1097617020.0
  ], 
  [
   71321, 
   null, 
   "Kronus", 
   "\n let's take a look at a non-biblical God, then. if such a God exists, what is his definition. can he interact with the physical realm?\n\n \n Well, your typical diety is generally immortal, omnipotent or nearly so, all knowing or nearly so, and concerned with humanity in some way. Creating the universe is a bonus, but not required. They're all described as living outside the world, but being able to interact with it. Whatever their relationship with our universe is, it's clearly outside the realm of science as we know it. \n \n What does this mean in terms of proving their existence? Since their interactions with us are outside the realm of science, science can't really say anything unless the dieties in question specifically choose to interact with us in a way which science could verify. That is to say, the existence of any God can't be proven against that God's will, but I believe that if a diety wanted to have it's existence known than it would certainly be able to do so.", 
   {}, 
   71308, 
   null, 
   1097619240.0
  ], 
  [
   71327, 
   null, 
   "unkerpaulie", 
   "Well, your typical diety is generally immortal, omnipotent or nearly so, all knowing or nearly so, and concerned with humanity in some way. Creating the universe is a bonus, but not required. They're all described as living outside the world, but being able to interact with it. Whatever their relationship with our universe is, it's clearly outside the realm of science as we know it. \n\n a deity with all this power, yet not necessarily credited with the creation of the universe (or any other task suitable for an all-powerful, all-knowing God)? so what has this God done for us to assume he has any power at all?\n \n \nWhat does this mean in terms of proving their existence? Since their interactions with us are outside the realm of science, science can't really say anything unless the dieties in question specifically choose to interact with us in a way which science could verify. That is to say, the existence of any God can't be proven against that God's will, but I believe that if a diety wanted to have it's existence known than it would certainly be able to do so.\n\n yes, but if we cannot even observe the effects of such a deity, what difference does it make to man whether such a God exists or not? for now, i think we can comfortably conclude that this deity, if he exists, doesnt want to have his existence known. furthermore, this deity doesnt seem interested in interacting with mankind in any physical sense. what good is such a God? whether he exists or not holds absolutely no bearing on reality.", 
   {}, 
   71321, 
   null, 
   1097620080.0
  ], 
  [
   71344, 
   null, 
   "Kronus", 
   "a deity with all this power, yet not necessarily credited with the creation of the universe (or any other task suitable for an all-powerful, all-knowing God)? so what has this God done for us to assume he has any power at all?\n\n Depends on your mythology. You can read the various stories from the Greeks, Norse, or Indians to get some ideas. Generally they do intervene directly and do miraculous stuff. Of course, they don't seem to do that sort of thing lately.\n \n \n\n yes, but if we cannot even observe the effects of such a deity, what difference does it make to man whether such a God exists or not? for now, i think we can comfortably conclude that this deity, if he exists, doesnt want to have his existence known. furthermore, this deity doesnt seem interested in interacting with mankind in any physical sense. what good is such a God? whether he exists or not holds absolutely no bearing on reality.\n\n \n Not neccesarily. There may be a maniac hiding in your house. He doesn't want his existance known, and you have no evidence he's there. However, it will have a big impact on your reality when you wander into the room he's in. Likewise, most modern Gods don't seem inclined to demonstrate their existance, but most religions say that if you don't do what their God says, there will be consequences when you die. I would say that if a diety can't go out of his way to demonstrate his existance and make clear what he wants, then I'm not going to change the way I lead my life based on what people who claim to speak for him say. That's not the same as saying that, if he exists, he doesn't have some bearing on reality. We just may not know what it is, or it may only happen after we die.", 
   {}, 
   71327, 
   null, 
   1097623440.0
  ], 
  [
   71378, 
   null, 
   "Nu Leader", 
   "To a variety of people:\n i think its finally settled that physical (testable or tangible) evidence of God can never be found. \n \n That much can be said. But we can provide evidence for the existence of God in other ways that require us to use logic and reasoning. We might reason for instance, say that if Jesus' body was still rotting in the tomb, then it is most likely that the authorities would have displayed it in order to crush the Christian faith (for they had every motive to). And if they had produced the corpse, then it is almost certain that Christianity would have been destroyed (for the early Christians believed in nothing less than the literal bodily resurrection). Given that the faith was not destroyed, it is implausible that His body was still in the tomb. Of course, there is a whole lot more to consider than this.\n \n Furthermore, a miraclous event (such as Jesus' resurrection) is improbable on the assumption that the miracle did not occur - but is to be expected on the assumption that it did. That is, if there was no resurrection, the emergence of Christianity is highly improbable; but if there was a resurrection, the emergence of Christianity is very likely. This is in the form \"if A happened, then it is most likely that B\".\n \n Miracles, such as Jesus' resurrection, can provide evidence for a religious belief, which hence, provides evidence for God's existence, following directly from a principle which J. L. Mackie has defended, and requires no assumptions about violations of natural laws. The principle states that a piece of evidence raises the likelihood of a hypothesis whenever that evidence is more likely given the hypothesis. The principle follows from the axioms of probability and is central to common sense reasoning. Footprints in the dirt confirm that someone has been walking there since the footprints are more likely to be there given that someone did walk there. The sound of the siren suggests that there is a fire nearby, for a siren is more likely to be heard when there is a fire nearby.\n \n Antony Flew and Mackie both agree that while miracles are extremely improbable, their occurrence is more likely on the assumption that God exists. More specific religious beliefs may rise further the likelihood of a miracle. So it follows from Mackie's criterion of confirmation that the occurrence of miralces may confirm religious hypotheses. For instance, since the resurrection of Jesus is far more likely on the assumption that He was divine, the resurrection, if we knew it to have occurred, would confirm Jesus' divinity and thus the truth of the Bible and it's revelation about God and His existence. Of course, it does not prove it, but it does provide substantial support.\n \n But then it also doesn't answer the question \"does anything exist\", nor does it answer an infinite number of \"existence\" questions. Do \"trolls\" exist, follows the same reasoning. If you find one, they are no longer a fairy tale/imaginary creature, they are some organic life form that can be measured, tested, and quantified..i.e. no longer an imaginary creature. So they can no more be found than god. \n \n But then we have to ask the logical question, is there any evidence for trolls that may lead us to believe that such creatures exist? The answer is no. What about God, is there any evidence at all to suggest  that He may  exist? The answer is yes. \n \n Design is a major area that implies the existence of an all knowing and all powerful Creator God (although many have stated that natural process can account for it - they haven't provided any real evidence for this - thus making it a belief). God of the Bible said that He has put enough evidence in His creation to persuade us that He exists. It is up to people to acknowledge this, which ultimately depends on their belief system. \n \n The issue of Universal love and welfare of the species [humans], and feelings (morals/values/ethics) such as goodness, love, kindness, generosity, sympathy, just and so on, provides a strong clue that there is some transcendent standard that affects us all. Although many may dispute this point, the infallibity of the Bible - all arguments thus far have been answered and no contradition stands up to real scrutiny (to my knowldge anway) implies that there is an all knowing Creator God who made it as a revelation of God's relationship with man. The existence of miracles can also provide evidence for a religious belief and hence, that God exists. \n \n I would say that if a diety can't go out of his way to demonstrate his existance and make clear what he wants \n \n This may surprise you, although we cannot observe not test this, God has come down to Earth many times throughout human history. The first time God has been on Earth is in Genesis 1:2, and the Spirit of God was hovering over the waters during the first day of the creation week. He was also present on Earth when He made Adam from dust and Eve from Adam's ribs, and demonstrated His will when He created them and punished them when they rebelled against Him. In Genesis 11 we read of the Tower of Babel - which is where the world's population resided after Noah's Flood (about 4,500 years ago) - and how man was refusing to \"increase in number fill the Earth\" command that God had issued in Genesis 9:1; and as a result, the LORD came down to see the city and the tower that the men were building... So the LORD scattered them from there over all the Earth, and they stopped building the city.(Genesis 11:8) This is evidence of God personally coming down and illustrating His will. The destruction of countless cities and their leaders also demonstrates that God comes down and makes His will be done (these cities and kings were that immoral that God obviously didn't stand it). God coming down hard of Egypt, in verse 4 of chapter 11 of Exodus (Exodus 11:8) we read the following, So Moses said, \"This is what the LORD says: \"About midnight tonight I will go throughout Egypt.\" [and smiting down the first born in order to free God's people]\n \n Perhaps the biggest example of where God came down to Earth to demonstrate His existence and will is in the body of His Son, Jesus Christ. People saw Him, talked to Him and so forth. Jesus came to tell people about Him and to tell us what He wants, e.g. for all to repent their sins so that they can spend eternity with Him and not suffer. The Holy Spirt is also here, as Jesus promised It would be. The Holy Spirit's presence is evident in many lives and It's ability to change people's attitudes and to turn their life around is also appearent.\n \n but if we cannot even observe the effects of such a deity \n \n You are assuming that God (if there is one) is not somehow sustaining His creation. Once again, this cannot be proven nor disproven by science as it cannot be tested or observed - as you said in your original topic starting post. But it is reasonable to believe, that if there is a God who created the whole universe, then without Him sustaining it somehow, it would cease to exist - hence, since it does exist, it is logical to believe that He is somehow sustaining it (obviously not as much as He can). So, if true, the observations that we see and/or take, are the effects of God acting on His creation; and miracles can be explained in such a way to say that it is God just acting on a part of His creation in a different way, this is not only plausible but logical.\n \n it's the definition that god is supernatural that in itself, cannot be reconciled with god \"appearing\" \n \n Jesus is an example that God can be reconciled with God appearing and talking to people... Angels are another example. Angels have even been said to be observed in some wars. Remember that Jesus is a Deity and is the Son of God, or God the Son. These examples contradict your statement. God appeared in the burning bush to Moses and talked to Moses too. We can't even start to comprehend all the issues involved with the supernatural, e.g. their makeup, so why do we try to?", 
   {
    "post_info": {
     "post_title": "Are there other ways of providing some evidence of God?"
    }
   }, 
   71153, 
   null, 
   1097647140.0
  ], 
  [
   71389, 
   null, 
   "unkerpaulie", 
   "Depends on your mythology. You can read the various stories from the Greeks, Norse, or Indians to get some ideas. Generally they do intervene directly and do miraculous stuff. Of course, they don't seem to do that sort of thing lately.\n\n i thought we were going with a non-biblical God. we have already established that if God exists, and his nature is as the bible (or any written work) describes, then his existence can never be proven through observable physical evidence. it doesnt disprove his existence, but it settles that his existence cannot be proven\n \n on the other hand, if a God exists, and has never been written about or described in any book, then the question still remains: what has this God done to demonstrate his power?\n \n \nNot neccesarily. There may be a maniac hiding in your house. He doesn't want his existance known, and you have no evidence he's there. However, it will have a big impact on your reality when you wander into the room he's in. Likewise, most modern Gods don't seem inclined to demonstrate their existance, but most religions say that if you don't do what their God says, there will be consequences when you die. I would say that if a diety can't go out of his way to demonstrate his existance and make clear what he wants, then I'm not going to change the way I lead my life based on what people who claim to speak for him say. That's not the same as saying that, if he exists, he doesn't have some bearing on reality. We just may not know what it is, or it may only happen after we die.\n\n yes, but at some point we can observe the effects of the maniac's existence. if the maniac is hiding in my house and i never find out, yet this maniac does nothing to affect any aspect in or around my house, or anything to affect my life in the slightest, then his existence is non-consequential to me. i could just leave him to be, and he would leave everything as it is. it is only when such an existence affects my life or surroundings that it becomes a concern of mine", 
   {}, 
   71344, 
   null, 
   1097677200.0
  ], 
  [
   71418, 
   null, 
   "Kronus", 
   "\n I would say that if a diety can't go out of his way to demonstrate his existance and make clear what he wants \n \n This may surprise you, although we cannot observe not test this, God has come down to Earth many times throughout human history.\n\n \n Your reason for believing this lies entirely within the Bible. I hardly consider a 1500 year old book \"making clear what he wants\". Particularly given that even among those who believe the book, they still can't agree on what God wants. And of course, that doesn't even beging to address the issue of all the other holy books which contradict the Christian Bible. You may personally believe that you know what God wants, but if so it's not because God has been clear about it.", 
   {}, 
   71378, 
   null, 
   1097688840.0
  ], 
  [
   71420, 
   null, 
   "Kronus", 
   "\n yes, but at some point we can observe the effects of the maniac's existence. if the maniac is hiding in my house and i never find out, yet this maniac does nothing to affect any aspect in or around my house, or anything to affect my life in the slightest, then his existence is non-consequential to me. i could just leave him to be, and he would leave everything as it is. it is only when such an existence affects my life or surroundings that it becomes a concern of mine\n\n \n My point was that most modern Gods tend to leave their influence until after you die. They don't mess with you directly now, but if you didn't live correctly then you're screwed after you die. A very handy catch-22 for religions to exploit.", 
   {}, 
   71389, 
   null, 
   1097689200.0
  ], 
  [
   71427, 
   null, 
   "unkerpaulie", 
   "That much can be said. But we can provide evidence for the existence of God in other ways that require us to use logic and reasoning. We might reason for instance, say that if Jesus' body was still rotting in the tomb, then it is most likely that the authorities would have displayed it in order to crush the Christian faith (for they had every motive to). And if they had produced the corpse, then it is almost certain that Christianity would have been destroyed (for the early Christians believed in nothing less than the literal bodily resurrection). Given that the faith was not destroyed, it is implausible that His body was still in the tomb. Of course, there is a whole lot more to consider than this.\n \n Furthermore, a miraclous event (such as Jesus' resurrection) is improbable on the assumption that the miracle did not occur - but is to be expected on the assumption that it did. That is, if there was no resurrection, the emergence of Christianity is highly improbable; but if there was a resurrection, the emergence of Christianity is very likely. This is in the form \"if A happened, then it is most likely that B\".\n\n yes, on the grounds of \"mostly likely\" we can make reasonable assumptions. but we must still treat them as such.\n \n part of the catch of God's existence is that no evidence of his existence cn ever be found. if Jesus actually physically performed observable miracles, even 2000 years ago, then it would surely proven that the supernatural can and does (or did) exist in reality. however, even jesus's ministry contradicts the faith theory. how can God expect faith from those who haven't observed on the grounds of those who have? if people can observe the manifested power of God in reality, then they have physical evidence that God exists. but this conflicts with the nature of God from a biblical standpoint. in other words, the bible cannot claim that physical evidence for the existence of God can exist, and then that it cannot exist, without contradicting itself. what we end up with is the predicament that ANY physical evidence that could possibly support God's existence is evidence against God's existence (at least from a biblical standpoint)\n \n \nMiracles, such as Jesus' resurrection, can provide evidence for a religious belief, which hence, provides evidence for God's existence, following directly from a principle which J. L. Mackie has defended, and requires no assumptions about violations of natural laws. The principle states that a piece of evidence raises the likelihood of a hypothesis whenever that evidence is more likely given the hypothesis. The principle follows from the axioms of probability and is central to common sense reasoning. Footprints in the dirt confirm that someone has been walking there since the footprints are more likely to be there given that someone did walk there. The sound of the siren suggests that there is a fire nearby, for a siren is more likely to be heard when there is a fire nearby.\n \n Antony Flew and Mackie both agree that while miracles are extremely improbable, their occurrence is more likely on the assumption that God exists. More specific religious beliefs may rise further the likelihood of a miracle. So it follows from Mackie's criterion of confirmation that the occurrence of miralces may confirm religious hypotheses. For instance, since the resurrection of Jesus is far more likely on the assumption that He was divine, the resurrection, if we knew it to have occurred, would confirm Jesus' divinity and thus the truth of the Bible and it's revelation about God and His existence. Of course, it does not prove it, but it does provide substantial support.\n\n again, this is only good as a reasonable assumption, and nothing more. in many cases, the least likely answer is true. you cannot create evidence out of assumptions. you test the assumptions against reality, then the assumptions can be confirmed. i agree that reasonable assumptions are useful, but basing an assumption upon another assumption causes the likeliness to decrease.\n \n for example, under the assumption that (a) jesus is devine, and that (b) God exists, it is likely that (c) jesus performed miracles. c can only be considered a reasonable assumption of a and b were already true. since a and b are assumptions themselves, then it makes c much more unlikely.\n \n as opposed to the case of the footprints. if (a) people wear shoes and (b) there is a footprint in the lawn, it is likely that (c) a person stood on the lawn. in this case, a and b are verifiable, and by they being true, we can consider c a reasonable assumption\n \n \nBut then we have to ask the logical question, is there any evidence for trolls that may lead us to believe that such creatures exist? The answer is no. What about God, is there any evidence at all to suggest  that He may  exist? The answer is yes. \n \n Design is a major area that implies the existence of an all knowing and all powerful Creator God (although many have stated that natural process can account for it - they haven't provided any real evidence for this - thus making it a belief). God of the Bible said that He has put enough evidence in His creation to persuade us that He exists. It is up to people to acknowledge this, which ultimately depends on their belief system. \n \n The issue of Universal love and welfare of the species [humans], and feelings (morals/values/ethics) such as goodness, love, kindness, generosity, sympathy, just and so on, provides a strong clue that there is some transcendent standard that affects us all. Although many may dispute this point, the infallibity of the Bible - all arguments thus far have been answered and no contradition stands up to real scrutiny (to my knowldge anway) implies that there is an all knowing Creator God who made it as a revelation of God's relationship with man. The existence of miracles can also provide evidence for a religious belief and hence, that God exists. \n\n \"evidence\" can be anything, as you point out above. one could say that trolls live under bridges, and the existence of bridges is evidence that trolls could possibly exist. the thing about trolls is that by definition they can be physically observed if they exist. by God's definition, he can never be physically observed if he exists. (we are still using the biblical definition of God)\n \n \nYou are assuming that God (if there is one) is not somehow sustaining His creation. Once again, this cannot be proven nor disproven by science as it cannot be tested or observed - as you said in your original topic starting post. But it is reasonable to believe, that if there is a God who created the whole universe, then without Him sustaining it somehow, it would cease to exist - hence, since it does exist, it is logical to believe that He is somehow sustaining it (obviously not as much as He can). So, if true, the observations that we see and/or take, are the effects of God acting on His creation; and miracles can be explained in such a way to say that it is God just acting on a part of His creation in a different way, this is not only plausible but logical.\n\n as far as all observable evidence dictates, the laws of nature are what sustains the universe. there is not one single function of nature that isnt on \"autopilot\" as it were. that is, no function needed to sustain the universe occurs outside of natural law. what's more, nothing that defies natural law (whether universe-sustaining or not) ever occurs in observable reality\n \n \n I'm glad you responded Nu Leader. this is this issue that really hits the religion/science divide. as it is, God has been gradually and subliminally coralled in the spiritual realm. there is absolutely nothing in the physical and observable world that is a function of God, or a manifestation of supernatural power. in other words, in the realm of the physical, God has no turf. even if God does exist, he does not (and by biblical definition, cannot) physically manifest his being nor the effect of his power\n \n this leaves us with the spiritual realm. this realm, whether it exists or not, does affect people. yet this realm is as elusive and intangible as God himself. the same realm that God is believed to abive and reign in, is said to be the same realm that humans enter only when they die. i have many thoughts about the effects of this spiritual realm on reality, but for now i think its sufficient to say that God is limited to the spiritual realm only", 
   {}, 
   71378, 
   null, 
   1097692140.0
  ], 
  [
   71584, 
   null, 
   "unkerpaulie", 
   "ok, i might be jumping the gun here, but i reread this thread this morning and i believe there's a further conclusion we can come to, or more like a list of precepts we can establish\n \n 1. the existence of God can never be proven\n 2. the existence of God can never be disproven\n 3. the existence of God has no impact on reality\n 4. the belief in God has a great impact on reality\n \n i think 1 and 2 are safe. by all indications these can be considered as axioms. 3 and 4 are possibly debatable, but i doubt it. \n \n 3 seems to be true because reality is the physical (testable and tangible) entities and environment around us. God's existence doesnt affect natural law as far as we can observe. natural law is predictable and reliable, and there has been no occurance in physical reality that isnt governed completely by it\n \n 4 seems to be true because the belief in God exists, and its effects can be observed. these effects are limited to the mentality and behaviors of people, but it is real nevertheless. the realm of mentality and behavior is a strange and little-charted world to science. we dont have any effective way of observing the workings of this aspect. as a result, this is the aspect that religion dominates. and until science can come up with a way of effectively observing how mentality and behavior works, religion will have a turf", 
   {}, 
   71427, 
   null, 
   1097778780.0
  ], 
  [
   71606, 
   null, 
   "Kronus", 
   "\n \n 1. the existence of God can never be proven\n 2. the existence of God can never be disproven\n 3. the existence of God has no impact on reality\n 4. the belief in God has a great impact on reality\n \n i think 1 and 2 are safe. by all indications these can be considered as axioms. 3 and 4 are possibly debatable, but i doubt it. \n \n\n \n I have to disagree with 1 and 3. If God exists, and he wanted his existence proven, he could prove it. Likewise, if he wanted to have an impact, he could. I will agree with 1 and 3 if you add \"as things stand now\", or words to that effect.", 
   {}, 
   71584, 
   null, 
   1097785500.0
  ], 
  [
   71611, 
   null, 
   "unkerpaulie", 
   "I have to disagree with 1 and 3. If God exists, and he wanted his existence proven, he could prove it. Likewise, if he wanted to have an impact, he could. I will agree with 1 and 3 if you add \"as things stand now\", or words to that effect.\n\n if God, even a non-biblical God, existed, then would you say that he would have always existed? wouldnt this God be the same and consistent throughout eternity? so far, we agree that the existence of a documented/biblical God cannot be proven. an undocumented/non-biblical God has never even been encountered, not even in the last 5000 years when the other Gods were being written about. if this God had the ability to make himself known at his perogative, why would he not do so until now? and if he doesnt show himself/make his existence known now why would he wait until later? we could extrapolate this forever, and this undocumented/non-biblical God would never \"choose to\" manifest. therefore, the existence of such a God can never be proven\n \n the same applies for 3. if such a God never \"decides to\" manifest his presence, then even if he exists it would be of absolutely no consequence to mankind at all", 
   {}, 
   71606, 
   null, 
   1097786700.0
  ], 
  [
   71661, 
   null, 
   "Kronus", 
   "if God, even a non-biblical God, existed, then would you say that he would have always existed? wouldnt this God be the same and consistent throughout eternity? so far, we agree that the existence of a documented/biblical God cannot be proven. \n\n \n No, we don't agree on that. His existence can't be proven right now, with what we currently know. That's not the same as \"can never be proven\". If he showed up tomorrow, that would prove his existence. It's your use of the word never that I'm objecting to. It's use implies that God, if he did exist, couldn't prove it, which is absurd. He may choose not to, being all ineffable and all, but clearly he could if he wanted.", 
   {}, 
   71611, 
   null, 
   1097796300.0
  ], 
  [
   71700, 
   null, 
   "Dzeron", 
   "I have to disagree with 1 and 3. If God exists, and he wanted his existence proven, he could prove it. Likewise, if he wanted to have an impact, he could. I will agree with 1 and 3 if you add \"as things stand now\", or words to that effect.\n\n \n We cannot prove the existence of God for, by definition, he dwells in a reality outside our own. Similarly, I cannot prove the existence of a Flying Shoe in Hyperspace, nor can I disprove it, but I can prove that the Flying Shoe does not exist in our world because it exists, by definition, in Hyperspace.\n \n I can make up anything I want and say it exists in another universe. A round square, a colorless green idea that sleeps furiously, you name it.", 
   {}, 
   71606, 
   null, 
   1097804460.0
  ], 
  [
   71715, 
   null, 
   "Kronus", 
   "We cannot prove the existence of God for, by definition, he dwells in a reality outside our own. Similarly, I cannot prove the existence of a Flying Shoe in Hyperspace, nor can I disprove it, but I can prove that the Flying Shoe does not exist in our world because it exists, by definition, in Hyperspace.\n \n I can make up anything I want and say it exists in another universe. A round square, a colorless green idea that sleeps furiously, you name it.\n\n \n We may not be able to prove God's existance on our own, but does that mean that God couldn't prove his existence to us? My point here is simply that \"never\" is too strong a word. If \"the existence of God can never be proven\" was changed to \"the existence of God can not be proven by people at the present time\" I'd have no problems.", 
   {}, 
   71700, 
   null, 
   1097806860.0
  ], 
  [
   71722, 
   null, 
   "Dzeron", 
   "We may not be able to prove God's existance on our own, but does that mean that God couldn't prove his existence to us? My point here is simply that \"never\" is too strong a word. If \"the existence of God can never be proven\" was changed to \"the existence of God can not be proven by people at the present time\" I'd have no problems.\n\n \n And the Flying Shoe of Hyperspace can prove its existence to us.", 
   {}, 
   71715, 
   null, 
   1097808480.0
  ], 
  [
   71730, 
   null, 
   "Kronus", 
   "And the Flying Shoe of Hyperspace can prove its existence to us.\n\n \n Um, I'm trying to be precise. What are you doing? Which is to say, what is your point here?", 
   {}, 
   71722, 
   null, 
   1097811240.0
  ], 
  [
   71741, 
   null, 
   "Mach", 
   "We may not be able to prove God's existance on our own, but does that mean that God couldn't prove his existence to us? My point here is simply that \"never\" is too strong a word. If \"the existence of God can never be proven\" was changed to \"the existence of God can not be proven by people at the present time\" I'd have no problems.\n\n \n I've already said this, but I'll restate since the question boiled back up.\n I believe this is also what Dzeron was discussing.\n ================\n \n You say \n\"but does that mean that God couldn't prove his existence to us\"\n\n \n Who is \"god\"? You cannot know, it's unknowable. It's in your imagination, there is no evidence. So each person has their own \"idea\" of what god is. Just as we might also have our own idea of what a dragon is, or a space monkey, or a ghost (and so on, we could fill the forum with made-up stuff to ponder existence on).\n \n However, you seem to think that if something in the physical world was suddenly observed for the first time, we could then claim it's god, or the dragon we thought of, or a ghost, or a space monkey (or an infinte number of other made-up things).\n \n No god can be \"known\" UNTIL it's observed in the physical universe. Then for you to claim that was somehow what your imaginary idea was based on would be illogical. It would be nothing more than a coincidence, and certainly not a complete match as to what is, and what your imaginary thing was.\n \n \"but does that mean that God couldn't prove his existence to us\"\n \n Correct, your idea of god cannot be proven by the appearance of some super-being, it has no frame of reference.\n \n So yes, some super-being might appear one day, whatever that means, but to claim it somehow has a one-to-one correspondance with your complete fabrication of some thing, is illogical.\n \n -Mach", 
   {}, 
   71715, 
   null, 
   1097816820.0
  ], 
  [
   71744, 
   null, 
   "Kronus", 
   "\n So yes, some super-being might appear one day, whatever that means, but to claim it somehow has a one-to-one correspondance with your complete fabrication of some thing, is illogical.\n \n -Mach\n\n \n I never claimed that God would meet anyones expectations. All I said was that if God, by which I mean some being that would fit a general definition of a divine being, was out there and had up to this point not felt like having his presence known, there's no reason that he couldn't change his mind tomorrow and show up. Whether he fits the exact description of the Christian god or the Hindu god or the VooDoo god is irrelevant. We all have a common idea of what a God is, even if we don't agree on the details. All I'm saying is that if such a being existed, it could show up and demonstrate that it does exist. We can't prove he exists, but he could, if he wanted. If he existed, of course.", 
   {}, 
   71741, 
   null, 
   1097818200.0
  ], 
  [
   71800, 
   null, 
   "unkerpaulie", 
   "No, we don't agree on that. His existence can't be proven right now, with what we currently know. That's not the same as \"can never be proven\". If he showed up tomorrow, that would prove his existence. It's your use of the word never that I'm objecting to. It's use implies that God, if he did exist, couldn't prove it, which is absurd. He may choose not to, being all ineffable and all, but clearly he could if he wanted.\n\n i meant to say the biblically described God can never be proven. if the one true living God showed up and said \"hey, its Me!\", then that would prove that God exists, but it would contradict bibilcal description and thus not prove that God as described in the bible exists.\n \n thus the existence of God as documented in religious writings can never be proven\n \n in the case of the undocumented God (such as the one you concede can possibly be discovered), this God has no known record of manifesting himself nor his power in any aspect of physical reality for as long as science and history can tell.\n \n my argument is that such a God, if he is constant and eternal (or at least constant for the last 5000-10000 years) will remain constant and eternal for the next 5000-10000 years. and after that period, he will remain constant for the next 10000-20000 years, and so on and so forth. even though he may one day reveal his existence, it will take him an infinite number of years to do so. in other words, he will never be proven.\n \n of course, if such a God is NOT constant and eternal, he may show up unexpectedly at any time, maybe even today, and present proof of his existence. however, such a God may not be existing right now (either he hasnt started existing yet, or he stopped existing in the past), making it even less likely to show up and present proof of himself. \n \n so we have a non-documented God that can be one of 2 types: either eternal or non-eternal. the eternal God will continue along the course he is on now, which is not showing up. the non-eternal God is much more likely to show up, if he is existing at this point in time, but a finite amount of time within eternity is an infinitesmally small window of time. we have a one-in-infinity chance of meeting a non-eternal God\n \n regardless of the scenario, it seems like none of these Gods can ever be proven to exist", 
   {}, 
   71661, 
   null, 
   1097855040.0
  ], 
  [
   71802, 
   null, 
   "unkerpaulie", 
   "We cannot prove the existence of God for, by definition, he dwells in a reality outside our own. Similarly, I cannot prove the existence of a Flying Shoe in Hyperspace, nor can I disprove it, but I can prove that the Flying Shoe does not exist in our world because it exists, by definition, in Hyperspace.\n \n I can make up anything I want and say it exists in another universe. A round square, a colorless green idea that sleeps furiously, you name it.\n\n certain things can be proven or disproven by their definition. define hyperspace (i think flying shoe is self-explanatory) and i'll prove that it doesnt exist", 
   {}, 
   71700, 
   null, 
   1097855400.0
  ], 
  [
   71833, 
   null, 
   "Kronus", 
   "i meant to say the biblically described God can never be proven. if the one true living God showed up and said \"hey, its Me!\", then that would prove that God exists, but it would contradict bibilcal description and thus not prove that God as described in the bible exists.\n \n\n No, it would just prove the description in the Bible was wrong. That's a completely different thing. I'm picking nits here, but your original statement was \"the existence of God can never be proven\". If you want to change that to \"the existence of God as exactly described in the Christian Bibile can never be proven\" then that's something else.\n \n \n \n\n my argument is that such a God, if he is constant and eternal (or at least constant for the last 5000-10000 years) will remain constant and eternal for the next 5000-10000 years. and after that period, he will remain constant for the next 10000-20000 years, and so on and so forth. even though he may one day reveal his existence, it will take him an infinite number of years to do so. in other words, he will never be proven.\n \n of course, if such a God is NOT constant and eternal, he may show up unexpectedly at any time, maybe even today, and present proof of his existence. however, such a God may not be existing right now (either he hasnt started existing yet, or he stopped existing in the past), making it even less likely to show up and present proof of himself. \n \n\n You're making alot of unwarrented assumptions here. Why assume God is constant? And what does that mean? Just becuase he hasn't shown up in the past couple of millenium he won't show up at all? There's no logical basis for that assumption. And as for this bit: \"such a God may not be existing right now\", if you're trying to decide if you can prove the existence of something, you can't start as an assumption that it doesn't exist. Of course if you assume that something doesn't exist then you can't prove it exists.", 
   {}, 
   71800, 
   null, 
   1097863260.0
  ], 
  [
   71847, 
   null, 
   "unkerpaulie", 
   "ok, lets get some bases down first. \n \n by \"biblical God\" i mean God as described in the bible. this God is just as the bible says he is. \n \n by \"non-biblical/undocumented God\" i mean God that is different from the way the bible/any religious writing describes him. there may be similarities, but this God doesnt conform to the exact definition of the biblical God\n \n either God can be biblical or non-biblical\n \n my first asserttion was that the existence of a biblical God can never be proven\n \n now, considering a non-biblical God, he can either be eternal or non-eternal. it is debatable that an eternal God will continuously be the same ay he has always been; in this case, not showing up. with a non-eternal God, there would be some point in time when he doesnt exist. such a God may or may not be existing at this point in time. (reread\n \n as far as possibly providing physical evidence of existence, i say we can rule out the biblical God and the non-biblical non-eternal God\n \n my argument is that the eternal God will continue to do what he always does, which is not show up. if he continuously doesnt show up, then his existence can never be proven", 
   {}, 
   71833, 
   null, 
   1097868180.0
  ], 
  [
   71850, 
   null, 
   "Kronus", 
   "\n my argument is that the eternal God will continue to do what he always does, which is not show up. if he continuously doesnt show up, then his existence can never be proven\n\n \n And my refutation is that you have no basis for that assumption. First off, we don't know that he's never shown up. He may have shown up and it was just never written about. Secondly, even if he has never shown up, that's no reason to assume that he never will. We're talking about Gods here, we have no way of knowing their motivation. It's simply not justifiable to say that we know, for a fact, that God won't appear tomorrow. He may have decided to leave us alone for 2000 years to see what we do on our own, and the alarm clock for that will go off next week. There's simply no way for us to know, and so there's no way for us to rule out the possibility. And so, there's no way for us to definitively say that God's existence can't ever be proven. We can't prove it ourselves, but we can't say that God couldn't prove it.", 
   {}, 
   71847, 
   null, 
   1097869440.0
  ], 
  [
   71852, 
   null, 
   "unkerpaulie", 
   "And my refutation is that you have no basis for that assumption. First off, we don't know that he's never shown up. He may have shown up and it was just never written about. Secondly, even if he has never shown up, that's no reason to assume that he never will. We're talking about Gods here, we have no way of knowing their motivation. It's simply not justifiable to say that we know, for a fact, that God won't appear tomorrow. He may have decided to leave us alone for 2000 years to see what we do on our own, and the alarm clock for that will go off next week. There's simply no way for us to know, and so there's no way for us to rule out the possibility. And so, there's no way for us to definitively say that God's existence can't ever be proven. We can't prove it ourselves, but we can't say that God couldn't prove it.\n\n i was making this assumption on the basis that this eternal God is unchanging (never does anything different from what he always does). so you're saying that this eternal God may be either sporadic (does something different on a whim) or conditional (does something different based on circumstances). if God is unchangable, then what he does today is what he will always do, i.e., not show up. if he is sporadic, then he could show up at anytime at all. if he is conditional then he would show up if something happens.\n \n so we can rule out the \"eternal unchanging God\" as far as presenting proof of existence is concerned\n \n in the case of the \"cosmic alarm clock\" scenario, that would make him a conditional God. when a set event occurs, he'll show up. if on an unpredictable whim God decides to show up, that would classify him as sporadic. in either case, there exists the possibility that God can show up.\n \n now the problem with an eternal sporadic God is that the chances of him showing up is infinitesmally small. his timing would be completely random. it may very well be tomorrow, but the chances are virtually infinity to one\n \n with an eternal conditional God, he may show up based on specific event happening. we dont know what it is that would cause God to show up. so far no event has yet triggered his appearance, and it may not even be an event that humans can control or even observe. yet this may be the best model of a provable God we can come up with...", 
   {}, 
   71850, 
   null, 
   1097872140.0
  ], 
  [
   71891, 
   null, 
   "Kronus", 
   "\n in the case of the \"cosmic alarm clock\" scenario, that would make him a conditional God. when a set event occurs, he'll show up. if on an unpredictable whim God decides to show up, that would classify him as sporadic. in either case, there exists the possibility that God can show up.\n \n now the problem with an eternal sporadic God is that the chances of him showing up is infinitesmally small. his timing would be completely random. it may very well be tomorrow, but the chances are virtually infinity to one\n \n with an eternal conditional God, he may show up based on specific event happening. we dont know what it is that would cause God to show up. so far no event has yet triggered his appearance, and it may not even be an event that humans can control or even observe. yet this may be the best model of a provable God we can come up with...\n\n \n So here's the question. Are we trying to come up with a convienient model for God, or are we asking if the existence of God, whatever his exact specifications are, is provable? Since we have no real clue which of your various categories God might fall into, we can't know that he isn't in the most easily provable category, and so we can't rule out having his existence be proven. I am by no means whatsoever trying to say that he is in that category. I'm just saying that, given that there is a category of God in which his existence is provable, and we can't know that God isn't in that category, then we can't say that proving his existence is impossible.", 
   {}, 
   71852, 
   null, 
   1097893440.0
  ], 
  [
   71897, 
   null, 
   "Mach", 
   "So here's the question. Are we trying to come up with a convienient model for God, or are we asking if the existence of God, whatever his exact specifications are, is provable? Since we have no real clue which of your various categories God might fall into, we can't know that he isn't in the most easily provable category, and so we can't rule out having his existence be proven. I am by no means whatsoever trying to say that he is in that category. I'm just saying that, given that there is a category of God in which his existence is provable, and we can't know that God isn't in that category, then we can't say that proving his existence is impossible.\n\n \n Again, it's only possible to prove something once it's observed (directly or indirectly, in the physical universe of course). This business of proving an imaginary concept without evidence is pointless.\n \n You cannot prove \"God\" exists, in any case, if there is no evidence of God (directly or indirectly, in the physical universe). Because it's imaginary, it will always remain imaginary, God, upper case, some specific Christian deity, is not provable, even if \"a god\" shows up.\n \n You can prove, sufficiently, that \"a god\" exists, if \"a god\" shows up, through normal observation, measurement, etc. You could then re-define your imaginary god as \"this God\" that appeared, but that certainly wouldn't mean you proved your original concept of god.\n \n If you're just going for a proving a broad concept of god, and not an entity that exists, you can DEFINE god (why would you have to prove a descriptive category?), but it doesn't imply existence, and follows the same rules as above.\n \n -Mach", 
   {}, 
   71891, 
   null, 
   1097895660.0
  ], 
  [
   71916, 
   null, 
   "Kronus", 
   "Again, it's only possible to prove something once it's observed (directly or indirectly, in the physical universe of course). This business of proving an imaginary concept without evidence is pointless.\n \n You cannot prove \"God\" exists, in any case, if there is no evidence of God (directly or indirectly, in the physical universe). Because it's imaginary, it will always remain imaginary, God, upper case, some specific Christian deity, is not provable, even if \"a god\" shows up.\n \n\n \n I think you're completely missing my point here. I am absolutely not trying to say that you can prove God exists. My personal belief is that God doesn't exist. However, I could be wrong; I can't prove it one way or the other. I can not conclusively prove that the Bibilical God isn't real. I'm sure he isn't, but I recognize that I can't prove it. And given that, I have to acknowledge the logical possibility that he does exist, and could prove it by showing up. My own personal beliefs, or yours for that matter, are utterly irrelevant if we're sticking to what we can or can not logically prove. I'm simply striving for precision here. The statement that \"the existence of God can never be proven\" is simply too strong. There is, in logical theory, a way in which the existence of God could be proven; he could show up. The fact that you and I are utterly sure that won't happen has no bearing on this, the fact remains. If he shows up, then his existence is proven. The fact that the first part will never happen does not, in strictly logical terms, make the statement false. There does exist a potential situation in which the existence of God could be proven, and therefor it's incorrect to say that his existence could never be proven. Again, I personally believe that his existence will never be proven because he isn't real, but since I can't back that up with any sort of logical proof, it has no real weight in this discussion.", 
   {}, 
   71897, 
   null, 
   1097899860.0
  ], 
  [
   71930, 
   null, 
   "Mach", 
   "I think you're completely missing my point here. I am absolutely not trying to say that you can prove God exists.\n \n Right, that part more applies to unkerpaulie, his 4 statements using \"God\" in them required that specific rebuttal. But it's still tricky, saying you cannot prove \"god\" , as a statement, has problems as well (continued)\n \n \n My personal belief is that God doesn't exist. However, I could be wrong; I can't prove it one way or the other. I can not conclusively prove that the Bibilical God isn't real. I'm sure he isn't, but I recognize that I can't prove it.\n\n You can be wrong about anything, true. But, we cannot even discuss this without defining god. God is either outside the knowable universe, and is therefore, completley irrelevant to discuss since we can't know what we're even discussing, OR, inside the physical universe.\n \n So you don't have to admit you cannot \"prove\" god, if god is defined as \"outisde the knowable universe..supernatural, etc.\" Proof has no releance in this case, so you're of the hook! It's an unintelligble utterance...mumbo jumbo, entirely irrational. Reason will not apply because it's nonsense.\n \n If god IS defined as being inside the physical unvierse, one could most certainly could prove his existence (given the physical means, but entirely within the scope of reason). in fact, to admit \"inside the physical unvierse\", necessarily implies it can be known through reason/evidence, etc.\n \n \nAnd given that, I have to acknowledge the logical possibility that he does exist, and could prove it by showing up. \n \n No, it's not defined. Logical possibility only applies to the frame of reference that logic is based on, namely, the physical universe/existence, etc.\n \n Recall secondly that if \"he\" showed up, it would not be directly related to your belief, a belief that was based without evidence/reason. Your reason and evidence only apply to that which is is knowable. For you to even suggest \"god\" could show up, still begs the question, what are you defining as god? It better be some entitiy inside the physical universe, otherwise you just said \" \". nothing.\n \n \n \n My own personal beliefs, or yours for that matter, are utterly irrelevant if we're sticking to what we can or can not logically prove. I'm simply striving for precision here. The statement that \"the existence of God can never be proven\" is simply too strong. \n \n Proven implies it's in the physical/knowable universe. If God is NOT in the physical/knowable universe, then you can't make sense of any statement with \"god\" in it. it's nonsense. You cannot prove what you cannot know, and something that is \"unknowable\" is meaningless. I don't think \"strong\" is a good word for it, I think \"unecessary\" might be better?\n \n You are correct in that man can know everything that is knowable, so to claim something is unknowable presumes knowledge of the unknowable, which is fallacy. To claim something is unknowable is not rational. That's why you don't have to prove or disprove it.\n \n \nThere is, in logical theory, a way in which the existence of God could be proven; he could show up.\n\n Youre premise is that you've somehow defined god in an intelligble way. We cannot, so it's a meaningless statement.\n \n \n The fact that you and I are utterly sure that won't happen has no bearing on this, the fact remains. If he shows up, then his existence is proven. \n \n \n Who shows up? It's nonsensical, unless it's based on reason..i.e. based on some premise that we can \"know\".\n \n \n The fact that the first part will never happen does not, in strictly logical terms, make the statement false. \n \n That's true, however, that's only for rational discussion. Discussing an unknowable god is not rational.\n \n \n There does exist a potential situation in which the existence of God could be proven, and therefor it's incorrect to say that his existence could never be proven. Again, I personally believe that his existence will never be proven because he isn't real, but since I can't back that up with any sort of logical proof, it has no real weight in this discussion.\n\n \n I'd just be restating at this point, I think I parsed your quotes up a little too fine.\n \n -Mach", 
   {}, 
   71916, 
   null, 
   1097913240.0
  ], 
  [
   71957, 
   null, 
   "Kronus", 
   "\n Proven implies it's in the physical/knowable universe. If God is NOT in the physical/knowable universe, then you can't make sense of any statement with \"god\" in it. it's nonsense. You cannot prove what you cannot know, and something that is \"unknowable\" is meaningless. I don't think \"strong\" is a good word for it, I think \"unecessary\" might be better?\n \n You are correct in that man can know everything that is knowable, so to claim something is unknowable presumes knowledge of the unknowable, which is fallacy. To claim something is unknowable is not rational. That's why you don't have to prove or disprove it.\n \n\n \n The thrust of your argument, if I understand correctly, is that God, if he exists, exists outside the universe, and is therefore unknowable. I would buy that if God existed exclusively outside the universe. That isn't a necessary condition, however. Every diety we hear tell of interacts with people in some way. Which only makes sense, of course. If there are Gods that live exclusively outside the universe then, as you say, we could never know. The ones we do hear about seem able to 'travel' back and forth between their realm and ours. And when they're in our realm, then logic and reason could be used to demonstrate existence. It's your assertion that God would have to be either from our realm or from outside our universe, but couldn't move from one to the other that doesn't hold up logically.", 
   {}, 
   71930, 
   null, 
   1097937120.0
  ], 
  [
   71971, 
   null, 
   "Mach", 
   "The thrust of your argument, if I understand correctly, is that God, if he exists, exists outside the universe, and is therefore unknowable. I would buy that if God existed exclusively outside the universe. That isn't a necessary condition, however. Every diety we hear tell of interacts with people in some way. Which only makes sense, of course. If there are Gods that live exclusively outside the universe then, as you say, we could never know. The ones we do hear about seem able to 'travel' back and forth between their realm and ours. And when they're in our realm, then logic and reason could be used to demonstrate existence. It's your assertion that God would have to be either from our realm or from outside our universe, but couldn't move from one to the other that doesn't hold up logically.\n\n \n It's \"AND\" that gets you on that.\n You can't be both unitelligble/unknowable, and \"knowable\".\n \n These words are not independant. It's not like saying \"he's happy and sad\". \n These words, knowable and unknowable, are the opposite of one another, to combine them is nonsensical.\n \n To say someone can be both dead, and alive, is nonsense. It's an either-or by definition (strict usage, which is what we're after).\n \n If any part of it is unknowable, logically it's all unknowable, or rather, it's a basic contradiction in terms. And if it's unknowable, it's not able to be rationally discussed. \n \n You can discuss it, no doubt, but it's not subject to being true or false (real or not real), since it cannot be known. You can dismiss it because it's not intelligble, and no one on this forum is going to suddenly show how we can somehow know the unknowable, rationally, that's fallacy.\n \n -Mach", 
   {}, 
   71957, 
   null, 
   1097943900.0
  ], 
  [
   72226, 
   null, 
   "unkerpaulie", 
   "So here's the question. Are we trying to come up with a convienient model for God, or are we asking if the existence of God, whatever his exact specifications are, is provable? Since we have no real clue which of your various categories God might fall into, we can't know that he isn't in the most easily provable category, and so we can't rule out having his existence be proven. I am by no means whatsoever trying to say that he is in that category. I'm just saying that, given that there is a category of God in which his existence is provable, and we can't know that God isn't in that category, then we can't say that proving his existence is impossible.\n\n the question is, what description of God would make him possibly provable\n \n I'm saying that God's existence can only be provable if he falls into one of the last 2 categories.", 
   {}, 
   71891, 
   null, 
   1098114480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  God by evidence?", 
  "url": "http://www.4forums.com/political/religion-debates/3414-god-evidence.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 3414, 
  "discussion_files": [
   [
    "26261.html", 
    "http://www.4forums.com/political/religion-debates/3414-god-evidence-print.html"
   ], 
   [
    "26262.html", 
    "http://www.4forums.com/political/religion-debates/3414-god-evidence-3-print.html"
   ], 
   [
    "26263.html", 
    "http://www.4forums.com/political/religion-debates/3414-god-evidence-2-print.html"
   ]
  ], 
  "identifier": 3414
 }
]