[
 [
  [
   71181, 
   null, 
   "God_is_real", 
   "what kids age is better", 
   {
    "post_info": {
     "post_title": "kids"
    }
   }, 
   null, 
   null, 
   1097538480.0
  ], 
  [
   71208, 
   null, 
   "zachvac", 
   "I picked 15 because that's my age now, and I picked 16 because that's how old I'll be in June. (But 18 is better still because we graduate from high school :))", 
   {}, 
   71181, 
   null, 
   1097544900.0
  ], 
  [
   71212, 
   null, 
   "college_girl", 
   "The teenage years are a very rough time for a lot of people, myself included. I think that 10 is the last age at which children are really free to be themselves, and not to worry about the future or what people think of them. At 10 most people are still blissfully innocent and have not yet been exposed to pressures such as cliques, puberty, parent/child power struggles, learning to deal with sex and relationships, etc. For girls there is the stress of reconciling the image of women as sex objects in the media with their own self image. It is a very confusing time, and mistakes have consequences. I would not go back if given the choice.", 
   {}, 
   71208, 
   null, 
   1097546040.0
  ], 
  [
   71216, 
   null, 
   "emclean", 
   "as a kid, or as a perant to have a kid that age?", 
   {}, 
   71212, 
   null, 
   1097550180.0
  ], 
  [
   71313, 
   null, 
   "God_is_real", 
   "as a kid, or as a perant to have a kid that age?\n\n either one", 
   {}, 
   71216, 
   null, 
   1097618460.0
  ], 
  [
   71396, 
   null, 
   "emclean", 
   "in that case, i would want to be 16, the freedom of the open road, when you run low on gas, just go home and snag the other perant's car. i had a job at the local collage as a life guard, and no worries\n \n 10 is a good age to have your kids, big enough to help, young enough that they still think dad knows something", 
   {}, 
   71313, 
   null, 
   1097681280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  kids", 
  "url": "http://www.4forums.com/political/fun-debates/3419-kids.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 3419, 
  "discussion_files": [
   [
    "12767.html", 
    "http://www.4forums.com/political/fun-debates/3419-kids-print.html"
   ]
  ], 
  "identifier": 3419
 }
]