[
 [
  [
   71245, 
   null, 
   "thebootfitter", 
   "Lurch/Ungerdunn/Selasphorus -- \n \n If you are out there... please come back. Just try not to get banned this time. ;-)", 
   {
    "post_info": {
     "post_title": "Where is Lurch/Ungerdunn/Selasphorus/etc???"
    }
   }, 
   null, 
   null, 
   1097568660.0
  ], 
  [
   71253, 
   null, 
   "montalban", 
   "Lurch/Ungerdunn/Selasphorus -- \n \n If you are out there... please come back. Just try not to get banned this time. ;-)\n\n It is my understanding that the rules are if you're banned, you can't simply create a new ID and return under it. This happened when Terral03 was banned and returned using a new ID.\n \n But...\n How do you know that Lurch is Ungerdunn?\n \n Perhaps also you might want to consider where you should have posted this thread as it has nothing to do with Creation -v- Evolution.", 
   {
    "post_info": {
     "post_title": "Is this the right sort of post for this thread"
    }
   }, 
   71245, 
   null, 
   1097579580.0
  ], 
  [
   71284, 
   null, 
   "thebootfitter", 
   "It is my understanding that the rules are if you're banned, you can't simply create a new ID and return under it. This happened when Terral03 was banned and returned using a new ID.\n\n Oh. Thanks for pointing that out. I didn't recall reading that rule, but it certainly makes sense. \n \n \n \nHow do you know that Lurch is Ungerdunn?\n\n I don't. (For all I know, YOU could be both Lurch and Ungerdunn -- just to create a stir! :-) \n \n Whoever any one of these individuals were... I would like to see them posting again. They all appeared to be quite knowledgable with regard to the creation/evolution debate.\n \n \n \nPerhaps also you might want to consider where you should have posted this thread as it has nothing to do with Creation -v- Evolution.\n\n On the contrary... These individuals (or individual -- whichever it may be), contributed significantly to the creation/evolution forum. Evidently, each one of them at some point posted something deemed worthy to have them banned by the forum moderators according to the subjective rules of the forum. \n \n Their presence is missed. I figured this would be the one forum that would most likely catch their attention, should they be perusing through.\n \n Without the strong presence of a resident biologist, my opinion is that this forum has limited opportunities to learn new and interesting information about evolution. Such information can help individuals see evolution as reasonable instead of perceiving it as something evil that is devoid of God, or put in their minds by the devil, etc.\n \n If the moderators feel that this is not an appropriate post for this forum, then they have to make the call to delete it. Just to make it a debate, though, I'll pose this question:\n \n ***********************************\n Does anyone else miss the presence of any one of the individuals who was behind the usernames of Lurch and Ungerdunn? \n \n Why or why not?\n ***********************************", 
   {}, 
   71253, 
   null, 
   1097599260.0
  ], 
  [
   71293, 
   null, 
   "Waxy", 
   " ***********************************\n Does anyone else miss the presence of any one of the individuals who was behind the usernames of Lurch and Ungerdunn? \n \n Why or why not?\n ***********************************\n\n \n Yes and no.\n \n Yes, I miss his (their) knowledge of the subject.\n \n No, in that I don't miss his (their) attitude. (I can empathize though, BELIEVE ME, I can empathize.) You'd think you'd learn your lesson eventually and figure the forum out. He's (they've) been given plenty of opportunities, and I think if he (they) would come back and obey the forum rules, the mods would likely look the other way.\n \n Waxy", 
   {}, 
   71284, 
   null, 
   1097606880.0
  ], 
  [
   71382, 
   null, 
   "montalban", 
   "On the contrary... These individuals (or individual -- whichever it may be), contributed significantly to the creation/evolution forum. Evidently, each one of them at some point posted something deemed worthy to have them banned by the forum moderators according to the subjective rules of the forum.\n\n The title of your thread clearly shows you believe that they are all the same person. You said \"Where is...?\", not \"Where are...?\"\n \nTheir presence is missed. I figured this would be the one forum that would most likely catch their attention, should they be perusing through.\n\n I disagree, your post whilst valid, is not about evolution and creation, even though he/they may have talked of it. However, I do agree that ultimately, this is up to the moderator(s).\n \n Without the strong presence of a resident biologist, my opinion is that this forum has limited opportunities to learn new and interesting information about evolution. Such information can help individuals see evolution as reasonable instead of perceiving it as something evil that is devoid of God, or put in their minds by the devil, etc.\n\n Who know who may turn up. Many of the arguments here aren't based on biology anyway.\n \nIf the moderators feel that this is not an appropriate post for this forum, then they have to make the call to delete it. Just to make it a debate, though, I'll pose this question:\n Does anyone else miss the presence of any one of the individuals who was behind the usernames of Lurch and Ungerdunn? \n Why or why not?\n\n This is dangerously like inviting ad hominem; especially from those such as myself who don't miss him at all. And he is not here to defend himself.", 
   {}, 
   71284, 
   null, 
   1097662380.0
  ], 
  [
   72543, 
   null, 
   "Clive14", 
   "Lurch/Ungerdunn/Selasphorus -- \n \n If you are out there... please come back. Just try not to get banned this time. ;-)\nThat seems unlikely. He gets banned everywhere he goes with his multiple names. He's not very good at hiding his identity and not very good at controlling his temper when dealing with the sort of creation believing XXXXXX that you get frequenting these boards (I can't say I blame him on the latter point).\n \n Look around the web though and you will find him elsewhere...", 
   {}, 
   71245, 
   null, 
   1098281700.0
  ], 
  [
   72549, 
   null, 
   "Big Orn", 
   " creation believing XXXXXX that you get frequenting these boards (I can't say I blame him on the latter point).\n\n So, Clive, everyone that believes that God created the earth is an idiot?\n \n You need to spend some quality time with some that do and I think you'd change your tune.", 
   {}, 
   72543, 
   null, 
   1098284040.0
  ], 
  [
   72564, 
   null, 
   "Clive14", 
   "So, Clive, everyone that believes that God created the earth is an idiot?\nNo. Anyone who sticks to beliefs that a god created the earth just 6,000 years ago is an idiot. People are free to believe that a god created the Earth billions of years ago though without deserving the \"idiot\" label.\n \n Hope this clarifies things for you. emoticon_xangel", 
   {}, 
   72549, 
   null, 
   1098287940.0
  ], 
  [
   72567, 
   null, 
   "Big Orn", 
   "No. Anyone who sticks to beliefs that a god created the earth just 6,000 years ago is an idiot. People are free to believe that a god created the Earth billions of years ago though without deserving the \"idiot\" label.\n \n Hope this clarifies things for you. emoticon_xangel\n\n Thanks, Clive, you're a good sport. Of course I can't agree with the idiot part. Rash, unwise, unknowledgeable, maybe, but not fools.", 
   {}, 
   72564, 
   null, 
   1098288780.0
  ], 
  [
   72695, 
   null, 
   "montalban", 
   "No. Anyone who sticks to beliefs that a god created the earth just 6,000 years ago is an idiot. People are free to believe that a god created the Earth billions of years ago though without deserving the \"idiot\" label. \n\n So, one set of creationists are XXXXXX, but the others are not?", 
   {}, 
   72564, 
   null, 
   1098354180.0
  ], 
  [
   72733, 
   null, 
   "Clive14", 
   "So, one set of creationists are XXXXXX, but the others are not?\nWell done Monty. Mark that up as your first ever 100% honest and accurate post here.", 
   {}, 
   72695, 
   null, 
   1098378480.0
  ], 
  [
   72987, 
   null, 
   "montalban", 
   "Well done Monty. Mark that up as your first ever 100% honest and accurate post here.\n\n How long have you been on these boards?\n \n So you support one group of creationists.\n \n Which theory/theories of creation do you think aren't supported by XXXXXX", 
   {}, 
   72733, 
   null, 
   1098461580.0
  ], 
  [
   73236, 
   null, 
   "Clive14", 
   "How long have you been on these boards?\nI signed up in May 2004.\n \n \nSo you support one group of creationists.\nNo.\n \n \nWhich theory/theories of creation do you think aren't supported by XXXXXX\nI suspect that there are XXXXXX that support all theories of creation. You are wandering into logical fallacy territory already Monty. Time to stop, engage your brain and re-read what I wrote then what you wrote. If you are still confused, I'd recomend a stint at studying set theory.", 
   {}, 
   72987, 
   null, 
   1098710520.0
  ], 
  [
   73240, 
   null, 
   "montalban", 
   "I signed up in May 2004.\n\n You've been pretty quiet then.\n [QUOTE=Clive14]I suspect that there are XXXXXX that support all theories of creation.[/quot]\n And any that support all the theories of evolution?\n \nYou are wandering into logical fallacy territory already Monty. Time to stop, engage your brain and re-read what I wrote then what you wrote. If you are still confused, I'd recomend (sic) a stint at studying set theory.\n\n \n Oddly enough, in post 11 you seemed to support my statement in relation to yours.\n I said\n \nSo, one set of creationists are XXXXXX, but the others are not?\n\n you replied\n \nWell done Monty. Mark that up as your first ever 100% honest and accurate post here.\n\n \n So, you do seem to support one group of creationists. But then you say that there are XXXXXX in all the groups. And that you don't support any. Why the flip? What has studying set-theory got to do with your own change of mind?\n \n Also, how do you know Lurch/Ungerdunn/Selasphorus/etc are the same person?", 
   {}, 
   73236, 
   null, 
   1098712500.0
  ], 
  [
   73247, 
   null, 
   "Clive14", 
   "You've been pretty quiet then.\nYep. I signed up around the time of many temporary & permanent bannings (including you I think) and lost interest when it all went quiet soon after. I've been \"lurking\" for a month or so and finally decided to start reposting recently.\n \n \nOddly enough, in post 11 you seemed to support my statement in relation to yours.\n\"seemed\" is the key. You have jumped to conclusions based on partial knowledge rather than seeking clarification.\n \n Perhaps if I explain it in detail, you might get it:\n 1. Anyone who holds to the thoroughly disproven position that the Earth is only a few thousand years old and that all life was created over a period of just a couple of days by a god is an idiot.\n 2. Someone who doesn't hold the above view (they accept that the Earth is demonstrably old and that life came to be through evolution [possibly directed by God depending upon your view]) can still be an idiot through other views/ beliefs (they may think that GW Bush is a good president for example).\n \n I don't agree with the idea that God directed evolution, but I understand why a theist would agree with the idea. I do not support \"one group of creationists\", but I understand their position.\n \n \nWhat has studying set-theory got to do with your own change of mind?\nBecause you wouldn't spout so many logical fallacies if you did understand set theory.\n \n \nAlso, how do you know Lurch/Ungerdunn/Selasphorus/etc are the same person?\nI can't comment upon \"Selasphorus\", but I know that Lurch has used the names \"Lurch\" and \"Ungerdunn\" on other boards. There are a few things about his life that he is very proud of. He fails to resist commenting upon them regardless of identity and tends to give himself away each time...", 
   {}, 
   73240, 
   null, 
   1098713580.0
  ], 
  [
   73432, 
   null, 
   "montalban", 
   "Yep. I signed up around the time of many temporary & permanent bannings (including you I think) and lost interest when it all went quiet soon after. I've been \"lurking\" for a month or so and finally decided to start reposting recently.\n\n Good to see you then\n \n\"seemed\" is the key. You have jumped to conclusions based on partial knowledge rather than seeking clarification.\n\n I did ask you what you meant, and phrased it as a question, and as how I understood what you were saying. What this means that no matter what you write, no one can comment on it, because when it could be interpreted one way or the other, we are to await some mystical experience and just get it, for if we question it, we are denounced as to not understand set-theroy, and the full implications of what you really meant to say!\n Hence...\n \nBecause you wouldn't spout so many logical fallacies if you did understand set theory.\n\n \n I can't comment upon \"Selasphorus\", but I know that Lurch has used the names \"Lurch\" and \"Ungerdunn\" on other boards. There are a few things about his life that he is very proud of. He fails to resist commenting upon them regardless of identity and tends to give himself away each time...\n\n How do you know Lurch posted as Ungerdunn? Did he get banned and return and state that as a new ID he was really Lurch? I dread asking you now, for I didn't learn set-theory and it might have given me the edge to working out the 98% of stuff you didn't actually say, but meant anyway.", 
   {}, 
   73247, 
   null, 
   1098782520.0
  ], 
  [
   73444, 
   null, 
   "Clive14", 
   "...There are a few things about his life that he is very proud of. He fails to resist commenting upon them regardless of identity and tends to give himself away each time...\n\n \nHow do you know Lurch posted as Ungerdunn?\nI'm having a \"Groundhog Day\" experience emoticon_frazzled I was under the impression that it was traditional to ask the question before the answer was given emoticon_idea", 
   {}, 
   73432, 
   null, 
   1098791700.0
  ], 
  [
   73708, 
   null, 
   "montalban", 
   "I'm having a \"Groundhog Day\" experience emoticon_frazzled I was under the impression that it was traditional to ask the question before the answer was given\n\n How do you know it is him? It's a simple question. IF he is writing as Lurch, and someone else comes onto a board, as Ungerdunn, who is just as rude (which is what you are saying), you assume it's the same person? Or, is it because they both claim to be biologists? I guess that having another person enter a forum, and claim to be a biologist would narrow it down to just the same person emoticon_xclown \n \n All you've done is said you know it is him because one writer is as rude as the other... and that this gives his identity away by some mysterious process, probably I don't understand this as I've never read set-theory! emoticon_wow What should be a very easy question becomes you repeating \"I know it is him\".\n \n Also, has he been banned as Lurch on these other fora?", 
   {}, 
   73444, 
   null, 
   1098868380.0
  ], 
  [
   73710, 
   null, 
   "pandion", 
   "Clive14 is correct. All of the handles that he mentions are the same person. There is gallo, 7th_Arty, lurch, ober_unger, ungerdunn, trochilidae, archilochus, selasphorus, lampornis, amazilia, and accipitridae - maybe others that I don't remember. Some were banned because they challenged a certain poster on these boards - making him look like a fool is unfriendly. Others were banned because they reported \"unfriendly\" posts by the same poster. Most received no warning or reason for the banning. Isn't that strange? One of the above was banned without warning for suggesting that a certain poster was protected by the board moderator.\n \n Make no mistake about it. This is not an open discussion board. \"Friendly\" seems to mean uncritical of scientific illiteracy. One may not call a stupid idea stupid on this board. No matter how mindless an idea may be, on this board it must be respected as valid. If someone asserts that the earth is flat, the idea must be respected as a valid scientific opinion, because disagreement would be \"unfriendly.\"\n \n I have no doubt that this post will merit banning. It is \"unfriendly.\" Moreover, it asserts the bias of the moderater.\n \n This board doesn't invite discussion. It demands agreement. To call a scientific illiterate scientifically illerate is \"unfriendly.\" To show that a semiliterate is semiliterate is \"unfriendly.\"\n \n Isn't is sad that opposition must be banned, not because it is wrong, but because it disagrees with dogma?", 
   {}, 
   73444, 
   null, 
   1098869160.0
  ], 
  [
   73716, 
   null, 
   "Clive14", 
   "How do you know it is him? It's a simple question.\nAnd I've given you the answer. If what you are really asking is \"Will you tell me some things to look out for that will allow me to spot him in a new guise?\", then the answer is \"no\". Work it out for yourself.\n \n \nIF he is writing as Lurch, and someone else comes onto a board, as Ungerdunn, who is just as rude (which is what you are saying)\nAt no point did I mention being rude. I don't recall an occasion when I thought him rude. Blunt, yes. Angry, yes. Honest, yes. Rude? No.\n \n \nAll you've done is said you know it is him because one writer is as rude as the other\nActually you will find I have not stated that. Please retract that statement, otherwise I shall report you to the moderators for libeling me. I will not put up with your dishonesty like others do.", 
   {}, 
   73708, 
   null, 
   1098873240.0
  ], 
  [
   73721, 
   null, 
   "montalban", 
   "Ive given you the answer.\n\n All you've said is 'you know' it to be true.\n \nIf what you are really asking is \"Will you tell me some things to look out for that will allow me to spot him in a new guise?\", then the answer is \"no\". Work it out for yourself.\n\n I made no such application for your help. But I am interested to know how you know, and if you're going to posit your non-sequitur of 'set-theory' into a reasoned debate, or just make another 'just-so' statement about that. LOL\n \nIF he is writing as Lurch, and someone else comes onto a board, as Ungerdunn, who is just as rude (which is what you are saying) \n\n \nAt no point did I mention being rude. I don't recall an occasion when I thought him rude. Blunt, yes. Angry, yes. Honest, yes. Rude? No.\n\n This is true. You did not mention being rude. It still does not show how, when two different posters are 'blunt', 'angry', 'honest', etc you know its the same person, other than you stating you know.\n \nAll you've done is said you know it is him because one writer is as rude as the other \n\n \nActually you will find I have not stated that. Please retract that statement, otherwise I shall report you to the moderators for libelling me. I will not put up with your dishonesty like others do.\n\n Make my day, you have a complaint, you'll get a fair hearing.\n \n Your own projections of 'sick pleasure' is insulting. Your own evasiveness, and inclination to just-so statements show your willingness to 'debate' at a level of peachiness.\n \n Still unresolved is...\n Clive14 your 'just-so' statement that you know him still needs to be worked-out; you have an insight here that is 'mysterious'\n Poster A -Blunt, yes. Angry, yes. Honest, yes\n Poster B-Blunt, yes. Angry, yes. Honest, yes\n Therefore Poster A=Poster B\n \n I suspect I am dealing with a subtle mind who is just able to know things, such as Lurch and Ungerdunn are the same person.", 
   {}, 
   73716, 
   null, 
   1098880140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Where is Lurch/Ungerdunn/Selasphorus/etc???", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3426-where-lurch-ungerdunn-selasphorus-etc.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 3426, 
  "discussion_files": [
   [
    "26383.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3426-where-lurch-ungerdunn-selasphorus-etc-print.html"
   ], 
   [
    "26384.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3426-where-lurch-ungerdunn-selasphorus-etc-2-print.html"
   ]
  ], 
  "identifier": 3426
 }
]