[
 [
  [
   71274, 
   null, 
   "OccamsRazor", 
   "Every so often I hear or read a term in the news and think \"thats a clever use of language to dress up actual meaning\". Collateral damage, friendly fire and pre-owned are some good examples of this sort of linguistical window dressing that seems to become ever more common place in the world today- so much so we even have a term for it- doublespeak.\n \n Which brings me to the topic of this thread; rendition (also known as extraordinary rendition), the most impressive example I have come across recently of the use of a word to obscure the actual reality of the practice it refers to.\n \n For those of you who are unfamiliar, here is the OccamsRazor guide to rendition. Lets say a state captures an individual who is suspected of involvement in organsied terrorist activity against it. That person is then subjected to the laws that country has regarding the treatment of those it holds in custody. In the case of Western countries like the one I live in that grants them certain rights with regard to how they can be treated and interrogated. The prisoner will be generally be protected from serious physical and mental torture, in accordance with international treaty.\n \n This acknowledgment of what is acceptable treatment also puts a limit on the methods that can be employed to extract information from the suspect. They could be in possession of information that if known to the state could prevent the loss of life through a terrorist attack. The suspect (lets assume they are a member of a terrorist organisation and are in possession of such information) is extremely motivatied for their cause and quite resistant to the methods of interrogation available to the state.\n \n However, there is another state who does not put such restaint on the treatment of those in the custody of its judical system and allows the practice of more extreme physical and mental methods on its prisoners- what most of us would refer to as torture. This state is willing to interrogate the Western state's prisoner using such methods in exchange for concession on other international issues.\n \n The Western state then sends its vital prisoner to the other state where they are interrogated and tortured to find all information they know. The information that is gained is then sent to the Western nation who knows there prisoner has been subjected to as harsh a questioning as is possible.\n \n The prisoner in effect disappears, if their existence is revealed in the first place at all.\n \n \n So is the practice of rendition acceptable? It provides a useful way to circumvent international treaties that states have signed up- we cannot torture this prisoner, but we think we need to- you can do it for us, thankyou.\n \n Is information gained through the torture of prisoners reliable?\n \n Should states allow favour to those who are prepared to torture their prisoners on other matters of international law and compliance?\n \n Can rendition be justified bearing in mind the ruthless nature of the struggle against organised international terrorist activity?\n \n I'm most interested to hear views on this matter.", 
   {
    "post_info": {
     "post_title": "Rendition"
    }
   }, 
   null, 
   null, 
   1097597040.0
  ], 
  [
   71276, 
   null, 
   "college_girl", 
   "There has already been an abuse of this. Have you heard of the case of Maher Arar? A Canadian citizen, he was sent to Syria for a year. It was alleged he was a terrorist, however he was never charged with anything and is no longer under suspicion. He claims he was tortured the entire time and is now making quite a stink about it.", 
   {}, 
   71274, 
   null, 
   1097598060.0
  ], 
  [
   71283, 
   null, 
   "OccamsRazor", 
   "Yes, that is a particularly high profile incident, but from what I have gathered not the only one by any means.\n \n It also highlights one of the problems such a practice represents- what if the intelligence services get there assessment of a prisoner wrong? that person pays a high personal price indeed.", 
   {}, 
   71276, 
   null, 
   1097599200.0
  ], 
  [
   71673, 
   null, 
   "pnac=ww3", 
   "Well, what's up with Guantanamo?\n \n That's US territory, despite its location in Cuba.\n \n We torture away in there. I don't doubt it a bit.\n \n No \"rendition\" is necessary.\n \n .", 
   {}, 
   71283, 
   null, 
   1097800380.0
  ], 
  [
   71797, 
   null, 
   "OccamsRazor", 
   "Well, what's up with Guantanamo?\n \n That's US territory, despite its location in Cuba.\n \n We torture away in there. I don't doubt it a bit.\n \n No \"rendition\" is necessary.\n \n .\n\n \n Guantanamo is interesting due to its unusual legal status. Sovernity ultimately rests with Cuba and legal precidents have established that the US government is allowed to withhold the usual consitutional rights afforded to those on US soil who are held at the base.\n \n Without a doubt, activities at Guantanamo with regard to prisoners mainly caught in Afghanistan are carried out with an aim to breaking those peoples resistance and elliciting useful information from them. However, I think there is a limit to the methods that are employed there as there is less deniability if word gets out.\n \n With rendition I see greater deniability and the option of the most extreme methods of interrogation being available.", 
   {}, 
   71673, 
   null, 
   1097854800.0
  ], 
  [
   180991, 
   null, 
   "OccamsRazor", 
   "Looks like the US Government is to be formally questioned over the practice of rendition by the European Union, with regard to the use of covert flights moving prisoners through EU territory as well as the actual facilities themselves:\n \n http://news.bbc.co.uk/1/hi/world/europe/4461470.stm\n \n How much light will this shed on the American use of torture by proxy?", 
   {}, 
   71797, 
   null, 
   1132716000.0
  ], 
  [
   181004, 
   null, 
   "georged", 
   "Looks like the US Government is to be formally questioned over the practice of rendition by the European Union, with regard to the use of covert flights moving prisoners through EU territory as well as the actual facilities themselves:\n \n http://news.bbc.co.uk/1/hi/world/europe/4461470.stm\n \n How much light will this shed on the American use of torture by proxy?\n\n \n Not much more than our historical activities in S. America, the only difference being geographical location. Military aid with stipulated amounts as cash into the right pockets does work wonders.", 
   {}, 
   180991, 
   null, 
   1132719000.0
  ], 
  [
   181008, 
   null, 
   "daewoo", 
   "Guantanamo is interesting due to its unusual legal status. Sovernity ultimately rests with Cuba and legal precidents have established that the US government is allowed to withhold the usual consitutional rights afforded to those on US soil who are held at the base.\n \n\n \n No, legal preecedent has NOT been set allowing this. In fact, the supreme court already ruled that since Guantanamo bay is controlled byt he US, prisoners there absolutly have the right to a trial and an opportunity to challenge their detainment.\n \n Despite the fact that tyhe supreme court made it absolutly and unquestionably clear that they meant that these men should have access to the regular court system, the Bush administraiton started military tribunal trials for them and claimed that it was sufficient to meet the letter of the ruling (though they have not yet managed to find a single civil rights expert that agrees with them). \n \n This is a delaying tactic at best, but the Bush administration knows damn well that it will take another 2 years and several million dollars mroe to get this back to the supreme court for correction. It has already been tried in a lower court and the judge ruled against it and ordered the prisoner in question either released or brought before a federal court. The Bush administration refused, pending appeal.\n \n There is somethign SERIOUSLY wrong with the system when the powers that be can blatently ignore a supreme court ruling. In fact, I owuld say there is something SERIOUSLY wrong with the system when it takes 2 years and millions of dollars just to get a basic civil rights question answered by the supreme court. It pretty much gaurantees that justice is ONLY for the rich.", 
   {}, 
   71797, 
   null, 
   1132723080.0
  ], 
  [
   181161, 
   null, 
   "OccamsRazor", 
   "Not much more than our historical activities in S. America, the only difference being geographical location. Military aid with stipulated amounts as cash into the right pockets does work wonders.\n\n \n Change of location is true, but what interests me is a very different local political climate, one that is potentially hostile to US activities in this matter.", 
   {}, 
   181004, 
   null, 
   1132794540.0
  ], 
  [
   181163, 
   null, 
   "OccamsRazor", 
   "No, legal preecedent has NOT been set allowing this. In fact, the supreme court already ruled that since Guantanamo bay is controlled byt he US, prisoners there absolutly have the right to a trial and an opportunity to challenge their detainment.\n \n Despite the fact that tyhe supreme court made it absolutly and unquestionably clear that they meant that these men should have access to the regular court system, the Bush administraiton started military tribunal trials for them and claimed that it was sufficient to meet the letter of the ruling (though they have not yet managed to find a single civil rights expert that agrees with them). \n \n This is a delaying tactic at best, but the Bush administration knows damn well that it will take another 2 years and several million dollars mroe to get this back to the supreme court for correction. It has already been tried in a lower court and the judge ruled against it and ordered the prisoner in question either released or brought before a federal court. The Bush administration refused, pending appeal.\n \n There is somethign SERIOUSLY wrong with the system when the powers that be can blatently ignore a supreme court ruling. In fact, I owuld say there is something SERIOUSLY wrong with the system when it takes 2 years and millions of dollars just to get a basic civil rights question answered by the supreme court. It pretty much gaurantees that justice is ONLY for the rich.\n\n \n Okay then, the activities at Guantanamo have no support in US law at all. From what you say the Bush administration doesn't want little issues like legality get in their way.", 
   {}, 
   181008, 
   null, 
   1132794720.0
  ], 
  [
   181170, 
   null, 
   "georged", 
   "Change of location is true, but what interests me is a very different local political climate, one that is potentially hostile to US activities in this matter.\n\n \n I can't ascertain any difference. With the exception of perhaps Japan, 'Coalition of the Willing' that assisted the US in invasion/occupation of Iraq was bought and paid for with military aid and trade loan guarantees. What's a private detention facility on a military air force site to Spain, Poland or others when big financial and military aid is rolling in? I'm not stating those countries did bow to economic bribery, but it is something we've used on a regular basis for decades and still employ in S. America. Current US administration has certainly shown its disdain on all matters for any nation's sovereignty, including EU members.", 
   {}, 
   181161, 
   null, 
   1132796640.0
  ], 
  [
   181184, 
   null, 
   "daewoo", 
   "Okay then, the activities at Guantanamo have no support in US law at all. From what you say the Bush administration doesn't want little issues like legality get in their way.\n\n \n No on both counts. The Bush administration tried to claim that it was legal to do those things at GITMO becuse it is not part of the US. The courts ruled that since it is materially controlled by the US, and the detainees there are under the complete control of the US government, they have the same rights as if they were in the continental US. \n \n The Bush adminstration has absolutly no respect for peoples rights or the law.", 
   {}, 
   181163, 
   null, 
   1132799760.0
  ], 
  [
   181189, 
   null, 
   "georged", 
   "No on both counts. The Bush administration tried to claim that it was legal to do those things at GITMO becuse it is not part of the US. The courts ruled that since it is materially controlled by the US, and the detainees there are under the complete control of the US government, they have the same rights as if they were in the continental US. \n \n The Bush adminstration has absolutly no respect for peoples rights or the law.\n\n \n A portion of the Patriot Act, taken almost verbatim from ready to go war acts, is due to go permanent and/or get seven more years. If administration again recovers to a position of congressional power with public support, it isn't that far from bypassing SCOTUS by inclusion of just about anything they desire in a war act that would occupy dissenting counsel resources for years. The standing AG is a White House dog and Cheney literally foams at the mouth when even questioned about policy. I think they were so arrogant and full of power when the Patriot Act was initiated they simply forgot to cover the prisoner treatment base. Congress was owned and the public would have approved of it, they accepted serious reductions of their own civil rights, what's a prisoner of war? This gang of pirates still presents the possibility of additional, very questionable direction for the moral and tangible welfare of this country. A lot can happen in three years with a shaky economy at stake.", 
   {}, 
   181184, 
   null, 
   1132802520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Rendition", 
  "url": "http://www.4forums.com/political/civil-rights-debates/3427-rendition.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 3427, 
  "discussion_files": [
   [
    "21280.html", 
    "http://www.4forums.com/political/civil-rights-debates/3427-rendition-print.html"
   ]
  ], 
  "identifier": 3427
 }
]