[
 [
  [
   4171, 
   null, 
   "kelvin90701", 
   "Socialist fighting for social justice need government funding to support their social programs. The gigiantic expense is to be funded by government taxation. Look at Europe, all the socialist countries tax their citizens to death. The only way this will ever happen in this country is if the socialist can take guns away from citizens. Your average Joe Q. Public will not accept a 50% income tax. The only way the government will get away with it if citizens are passive. Remember 1776 was all about taxes. The socialist know that if the government were to try to tax USA citizens 50%, we will all be in the street with guns looking to lynch the politicians. Sound absurd? Think of 1776, it was all about burdensome taxation.", 
   {
    "post_info": {
     "post_title": "The Reason Why Liberals and Socialist Want Gun Control."
    }
   }, 
   null, 
   null, 
   1047091020.0
  ], 
  [
   4175, 
   null, 
   "Broker", 
   "Taxation without representation.", 
   {}, 
   4171, 
   null, 
   1047092100.0
  ], 
  [
   4205, 
   null, 
   "Crim", 
   "Broker, exactly.\n It's not like liberals are going to get into power and then be like \"Oh, we're changing the constitution so voting is no longer allowed and you can't get rid of us so we can do whatever we want with taxes!!!\"", 
   {}, 
   4171, 
   null, 
   1047096720.0
  ], 
  [
   4228, 
   null, 
   "kelvin90701", 
   "Crim:\n \n Read what ever you can find on the Congressional Approval for Judge Miguel Estrada. The Liberals are threating the stability of the Constituion right now with the filibuster.\n \n Go to Current Events and check out The Liberal Lie on the Senate Floor.", 
   {}, 
   4171, 
   null, 
   1047125100.0
  ], 
  [
   4310, 
   null, 
   "kelvin90701", 
   "There is no excuse for blocking Estrada. Qualifications are what matter. When a judge is blocked when his qualifications are not in question threatens the Constitution, by weakening the Judicial Branch of government.\n \n If you are comparing Clinton's judges you mean:\n \n \"Five of the eight judges currently sitting on the D.C. Circuit had no previous judicial experience, including Chief Judge Harry Edwards, as well as two of President Clinton's nominees. \" - National Review Online", 
   {}, 
   4171, 
   null, 
   1047185940.0
  ], 
  [
   4313, 
   null, 
   "kelvin90701", 
   "\"That's a pretty sad commentary,\" Mr. Roberts said on \"Fox News Sunday,\" referring to the Democrats' tactics.\n \"It's not only Estrada. You're getting my dander up now. It's not only Estrada; it is a new standard. If this sticks, if the filibuster sticks, it will mean that you will have to have 60 votes for any nominee. We are really changing the constitutional design of what it takes to basically nominate and approve any judge. That's the big issue\" - Washington Times\n \n Tell Hillary to stop messing with the Constitution:\n \n http://clinton.senate.gov/email_form.html", 
   {}, 
   4171, 
   null, 
   1047186720.0
  ], 
  [
   4317, 
   null, 
   "Tim", 
   "See my post in the current events forum.", 
   {}, 
   4171, 
   null, 
   1047189480.0
  ], 
  [
   4585, 
   null, 
   "JFriday", 
   "Thanks Tim\n \n We have habit of drifting from the topic here, heh, seems pretty common though.", 
   {}, 
   4171, 
   null, 
   1047542040.0
  ], 
  [
   5260, 
   null, 
   "kelvin90701", 
   "This website will sound familiar:\n \n http://www.lewrockwell.com/rockwell/bellesiles.html\n \n Over and over again I see anti-gunners who are so convinced they are right, that they naturally assume the evidence is there and it is common knowledge.\n \n Just like Bellesiles, the aging socialist were looking for something that was not there.\n \n \"But the disgrace of Bellesiles takes us back to square one. Instead of being a model and ideal of left-liberal scholarship in a new generation, it is now the most famous modern case of lying research, bad eggs at prestigious institutions, and the shoddiness of the academic class generally. The political paradigm that has limitless faith in the power of government, and no confidence in the ability of individuals to manage their own affairs, has been robbed of its biggest break in many years. \"- Lew Rockwell October 2002", 
   {}, 
   4171, 
   null, 
   1048223460.0
  ], 
  [
   5261, 
   null, 
   "kelvin90701", 
   "Death blow to socialism.", 
   {}, 
   4171, 
   null, 
   1048223640.0
  ], 
  [
   5377, 
   null, 
   "voiceofreason", 
   "Yeah right, like one man's opinion is a death blow to socialism. And socialism is not dying. America is becoming more socialist all the time. Welfare, Social Security, Medicare, and Medicaid are all socialist government programs in America. Our public school system is funded with tax money and therefore it's a socialist program. Capitalism is bad because it makes the rich richer and the poor poorer. I think America will eventually abandon capitalism as it transforms itself into a socialist utopia.", 
   {}, 
   4171, 
   null, 
   1048381740.0
  ], 
  [
   5380, 
   null, 
   "JFriday", 
   "I have never heard of a socialist utopia, NAME ONE! If Capitalism is so bad then why has it taken us this far!?!?!", 
   {}, 
   4171, 
   null, 
   1048383180.0
  ], 
  [
   5382, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n Yeah right, like one man's opinion is a death blow to socialism. \n \n \n Yes I exaggerate. As long a Americans who love freedom and have the means to protect it, you will never see the same oppressive taxation in Europe happen here.\n \n If Bellesiles is the poster boy for academia and socialism, then I rather not have utopia run by men like him.", 
   {}, 
   4171, 
   null, 
   1048383840.0
  ], 
  [
   5384, 
   null, 
   "voiceofreason", 
   "I don't know who this Lew Rockwell guy is, but that is just his opinion. Oppressive taxation? What are you talking about? The governments of other modern western nations take care of the poor and homeless much better than the US does. I wouldn't call that oppressive. Capitalism is oppressive because makes the rich richer and the poor poorer.", 
   {
    "unicode_changes_made": true
   }, 
   4171, 
   null, 
   1048385220.0
  ], 
  [
   5389, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n  The governments of other modern western nations take care of the poor and homeless much better than the US does. \n \n \n Prove it.\n \n Unless you can that is just another unproved supposition. Your doing exactly the same thing that Michael Bellesiles did and hopping you don't get caught.", 
   {}, 
   4171, 
   null, 
   1048390140.0
  ], 
  [
   5410, 
   null, 
   "Umoja", 
   "The United States is 4th in Quality of life according to the \"Time Almanac 2002\". The more Socialist countries, like Norway (which is #1 in Quality of Life) generally don't waste their money on the millitary and instead use it to benefit their people so they don't have people going hungry, or living without homes....", 
   {}, 
   4171, 
   null, 
   1048457100.0
  ], 
  [
   5411, 
   null, 
   "kelvin90701", 
   "Originally posted by Umoja \n  don't waste their money on the millitary and instead use it to benefit their people \n \n \n Norway is blessed with a wealth of raw materials:\n \n http://www.yahooligans.com/reference/factbook/no/econom.html\n \n The oil reserves for such a small (population) is immense. They do not suffer from the same problems the US does: immigration, racial strife, population induced collaspe of cities, etc.\n \n With such a low population and single race/culture, everyone \"plays ball\" to a greater degree, which is a hallmark of a socialist state that works.\n \n Even with our problems, US citizens enjoy a greater GDP $33,900 vs $25,100 for Norway. I do not believe that Norwegian do have a better way of life. Even in Norway, they want American MTV. Do the Norwegians really enjoy a better way of life when Americans have a 35% bigger GDP? I would not want to be Norwegian. A Norwegian did not walk on the moon, Norwegians did not invent Jazz and Rock and Roll, and a Norwegian did not dictate a peace treaty to the Iraqi in 1991.\n \n Plus we have a \"tax\" burden for keeping world order. As you have said, Norway does not money on defense. We pray a price for peace. Japan, Isreal, Germany, and most of NATO depends on our overseas bases and deployment for protection. Do you recommed that we just stop paying this \"tax\" to boost our standard of living?", 
   {
    "post_info": {
     "post_title": "This is getting way off thread...."
    }
   }, 
   4171, 
   null, 
   1048459920.0
  ], 
  [
   5413, 
   null, 
   "Umoja", 
   "I was just pointing out a fact. They have a higher standard of living, maybe not your standard of greatness, but still a higher standard of living.", 
   {}, 
   4171, 
   null, 
   1048460580.0
  ], 
  [
   5419, 
   null, 
   "kelvin90701", 
   "Originally posted by Umoja \n I was just pointing out a fact. They have a higher standard of living, maybe not your standard of greatness, but still a higher standard of living. \n \n \n I have trouble with the idea they have a higher standard of living with USA enjoying a GDP that is 35% higher.\n \n If you value a sack lunch in the park vs a steak in a restaurant as a higher standard of living, then I agree with you. Maybe you this sack lunch with with the Norwegian bikini team, then you may have something there.", 
   {}, 
   4171, 
   null, 
   1048478100.0
  ], 
  [
   5423, 
   null, 
   "Tim", 
   "According to the UN, Norway is the best country to live in. Australia ranks second and then Canada ranks third. The UN takes \"per capita income, health care, life expectancy and educational levels\" into consideration when it determines which nation is the best in the world. The US came in sixth.\n \n http://www.cnn.com/2001/WORLD/europe/07/10/un.development/index.html", 
   {}, 
   4171, 
   null, 
   1048481400.0
  ], 
  [
   5433, 
   null, 
   "JFriday", 
   "Then why is it that there are more people comming to America? If these people really buy that then why aren't they living there?", 
   {}, 
   4171, 
   null, 
   1048486560.0
  ], 
  [
   5439, 
   null, 
   "kelvin90701", 
   "Originally posted by JFriday \n Then why is it that there are more people comming to America? If these people really buy that then why aren't they living there? \n \n \n The people who live there are happy there, and more power to them. The socialist countries in Europe that work have almost no immigration. In other words they rather not share what they have. That is mighty socialist of them. So your not going to find taxi cab drivers in Norway that don't speak Norwegian vs New York where hardly any taxi cab drivers speak English (er American)?:) \n \n Those socialist countires manage to maintain social cohesion and order because they are all the same race and culture. That is why you can not simply copy those socialist systems and simply transfer them to the USA.", 
   {}, 
   4171, 
   null, 
   1048490940.0
  ], 
  [
   5503, 
   null, 
   "JFriday", 
   "Yes Capitalism has failed, that is why Russia is still Communist right, communism is a stupid idea, it cannot work, it has never worked, I would much rather the opportunity to become rich than the guarantee to stay poor along with everyone else except politicians. That was perhaps the dumbest post I have ever read from you VOR, your really disappointing me.", 
   {}, 
   4171, 
   null, 
   1048584780.0
  ], 
  [
   5589, 
   null, 
   "kelvin90701", 
   "Originally posted by voiceofreason \n Yes, this is what will happen as Karl Marx predicted. Marx said that society will get tired of the oppression of capitalism. The people will rise up and revolt and create a communist society. We might need guns for an armed revolution to create a communist society, but once we achieve a socialist utopia, guns will no longer be necessary. Then we can take away everybody's guns.\n \n We can learn from the mistakes that were made during the communist revolutions in the Soviet Union and China and make sure that they don't happen again when a communist revolution happens in American. Capitalism has failed and it must go sooner or later. \n \n \n Somebody gave me an example of Communism once, I think is was JFriday?\n \n Communist are like Will E. Coyote chasing after the road runner. They keep trying, always get it worng, then try someting even more complicated, get it wrong again, and so forth.\n \n Kruschev promissed that the USSR will out produce the USA and he will watch the USA crumble.\n \n (help help I'm crumbling) NOT", 
   {}, 
   4171, 
   null, 
   1048656060.0
  ], 
  [
   5633, 
   null, 
   "lukecrouch", 
   "Originally posted by voiceofreason \n Yes, this is what will happen as Karl Marx predicted. Marx said that society will get tired of the oppression of capitalism. The people will rise up and revolt and create a communist society. We might need guns for an armed revolution to create a communist society, but once we achieve a socialist utopia, guns will no longer be necessary. Then we can take away everybody's guns.\n \n We can learn from the mistakes that were made during the communist revolutions in the Soviet Union and China and make sure that they don't happen again when a communist revolution happens in American. Capitalism has failed and it must go sooner or later. \n \n \n This has nothing to do with Gun control. Socialism, yes, but not gun control.\n \n Please see this post: http://www.youdebate.com/vBulletin/showthread.php?s=&postid=5632#post5632\n for the Socialism and Capitalism debate. I have filled it up with posts that no-one has responded to.", 
   {}, 
   4171, 
   null, 
   1048703760.0
  ], 
  [
   5653, 
   null, 
   "Patriot", 
   "thanks for stopping the madness, lukecrouch.\n \n voiceofreason, I find it ironic that you think we should get rid of our guns now before a utopian socialist order comes to pass. You said yourself that you'll need guns to stage a revolution.", 
   {}, 
   4171, 
   null, 
   1048713720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Reason Why Liberals and Socialist Want Gun Control.", 
  "url": "http://www.4forums.com/political/gun-control-debates/343-reason-why-liberals-socialist-want-gun-control.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 343, 
  "discussion_files": [
   [
    "10305.html", 
    "http://www.4forums.com/political/gun-control-debates/343-reason-why-liberals-socialist-want-gun-control-print.html"
   ], 
   [
    "10306.html", 
    "http://www.4forums.com/political/gun-control-debates/343-reason-why-liberals-socialist-want-gun-control-2-print.html"
   ]
  ], 
  "identifier": 343
 }
]