[
 [
  [
   71754, 
   null, 
   "Fighter", 
   "Passions concerning to Yuschenko continue to fire. Some of the most impassioned supporters of this main leader of Ukrainian opposition laid the blame on Ukrainian authorities for using of biological weapon against President's candidate from \"Nasha Ukraina\". I'm interested in the next version of opposition. Was Yuschenko really exposed to high dose of radiation as a result of using nuclear weapon, for instance? But joking apart... At this time Yuschenko has just left one of Austrian clinics. And according to doctors his state of health was very heavy. Temporarily he was paralyzed in right side of his body. But doctors and guys from CIA hope that everything will be OK. It's now only a matter of time. It's clear that American bosses of Yuschenko are not able to be indifferent to the state of health of their protégé. They are terribly worried about the money, appropriated for his untwisted process with the aim of his victory during the election. So they advise his supporters to hang fire. By the way, so-called Yuschenko's refusal of speaking at TV debate can be due to it. I mean it's a real reason to refuse instead of statements of \"Nasha Ukraina\" as though Yanukovic decided not to use TV for rise in his rating.", 
   {
    "post_info": {
     "post_title": "Passions concerning to Yuschenko continue to fire"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1097832840.0
  ], 
  [
   73913, 
   null, 
   "Run-fellow", 
   "To tell the truth, the whole story with Yuschenko's food-poisoning is an incident wrapped with mystery. It's known there are two official versions of it. The first one is that there were some attempts to poison Yuschenko with risin. But it's common knowledge that there is no antidote to this poison. According to the second one the cause of such candidate's health state lies in acute attack of his chronic diseases and in trivial nervous overstrain. But the very suddenness of it arouses a lot of suspicions. And not a single version is wide open to criticism, I think. According to some data Americans decided to get rid of their protégé. And it's clear that poisonous substances, discovered in Yuschenko's blood, were produced in transatlantic secret laboratory. Washington's strategists had several grounds for sudden death of their puppet. First one was in his rather low rating that wouldn't be a guarantee for his victory during this election. And the second one was in his refractory nature, which Yuschenko began to show during his pre-election campaign.", 
   {
    "unicode_changes_made": true
   }, 
   71754, 
   null, 
   1098973740.0
  ], 
  [
   73921, 
   null, 
   "Rooster", 
   "Oh yes, American political technologists have planed everything very well. See for yourself. Yuschenko is dying of food-poisoning, but he isn't losing the elections. Then this incident will be written off to present authorities. And it will cause irreparable damage to second candidate's image (I mean Yanukovic, of course). Thus, without another candidate this election will declare dishonest and anti-democratic. And after starting wave of protests inconsolable widow (in aura of big martyr) ... is coming to power in Ukraine. For this purpose she even has been admitted to Ukrainian citizenship. Now Presidency is the latest woman's craze. And CIA is getting its own person in power. They say Ukrainians like Brazil's serials. But Yuschenko turned out to be a strong pal. He was able to reach the phone receiver and to call up to some necessary place. CIA's plans were knocked into a cocked hat. It's regrettable. What a wonderful performance it would be!", 
   {
    "unicode_changes_made": true
   }, 
   73913, 
   null, 
   1098975120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Passions concerning to Yuschenko continue to fire", 
  "url": "http://www.4forums.com/political/news-forum/3450-passions-concerning-yuschenko-continue-fire.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 3450, 
  "discussion_files": [
   [
    "13399.html", 
    "http://www.4forums.com/political/news-forum/3450-passions-concerning-yuschenko-continue-fire-print.html"
   ]
  ], 
  "identifier": 3450
 }
]