[
 [
  [
   72503, 
   null, 
   "joebrummer", 
   "It seems we have alot of young teenage born agians, who have recently become \"saved\". I am happy for you in your new found faith, but caution you in your search for the true message of christ and the true message of salvation. Granted, you may say, how can this atheist tell us anything about the message of chrsit. Well, I didn't become an atheist at birth. I was raised reading the bible, I was also raised to question things...I did.\n \n Read on......\n \n The Bible is a book (a collection of books). To make the Bible absolute is idolatry and opens the way for the Bible to be manipulated like any other idolatrous religion for the benefit of the religious leaders and experts. The Bible can be translated wrong, distorted, twisted, taken out of context, manipulated by \"ignorant, evil and unstable people\" ( 2 Peter 3:16), and made to say things that deny the good news of God's love in Christ for all people.\n \n Jesus sets us free from the idolatrous use of the Bible to hurt ourselves and others. Only God is absolute. God in Christ is \"The word of God made human (flesh)\" (not words) in John 1:14. The Bible never calls itself the word of God. The Bible calls Jesus the word of God and the one who sets people free from sick abusive use of scripture to hurt people. Be free! Follow Jesus as your guide to all things. Let the Spirit of Jesus guide you into a healthy use of the Bible for spiritual recovery from Bible abuse and from sick and oppressive religion.\n \n Jesus accepted and included all people. To use the Bible as a weapon to judge, condemn and exclude people is to abandon the Spirit and the example of Jesus.\n \n \n http://www.truluck.com/index.htm", 
   {
    "post_info": {
     "post_title": "For the younger Christians"
    }
   }, 
   null, 
   null, 
   1098243120.0
  ], 
  [
   72509, 
   null, 
   "billsco", 
   "Thanks for the message to our young posters. It is well-thought out and I agree with your call for tolerance of all people.\n \n I would only disagree that you weren't an atheist at birth. We all are, but we learn about this thing called religion at a stage in our lives where questioning isn't natural. For some, questioning never comes.", 
   {}, 
   72503, 
   null, 
   1098245940.0
  ], 
  [
   72512, 
   null, 
   "joebrummer", 
   "Thanks for the message to our young posters. It is well-thought out and I agree with your call for tolerance of all people.\n \n I would only disagree that you weren't an atheist at birth. We all are, but we learn about this thing called religion at a stage in our lives where questioning isn't natural. For some, questioning never comes.\n\n \n \n I agree! I wasn't anything at birth but a child, but raised a believer, then I took the time to listen, question, and use reason to come to where I am today!", 
   {}, 
   72509, 
   null, 
   1098247140.0
  ], 
  [
   72559, 
   null, 
   "Jaaaman", 
   "Jesus accepted and included all people. To use the Bible as a weapon to judge, condemn and exclude people is to abandon the Spirit and the example of Jesus.\n \n \n http://www.truluck.com/index.htm\n\n God will judge you in the end..... but many of these behaviors God has already judged as sinful and abominable..... As a christian, I can point out your behavior is wrong according to nature and what has been written over thousands of years in the bible.", 
   {}, 
   72503, 
   null, 
   1098286560.0
  ], 
  [
   72566, 
   null, 
   "unkerpaulie", 
   "there is a difference between \"include and accept all PEOPLE\" (which is what christianity teaches) and \"accept and tolerate all ACTIONS\" (which christianity actually teaches against)\n \n if more people would realize that christianity is not about condemning people, but about reforming actions, then this \"intolerance\" issue would not be as out of control as it is", 
   {}, 
   72559, 
   null, 
   1098288060.0
  ], 
  [
   72603, 
   null, 
   "joebrummer", 
   "God will judge you in the end..... but many of these behaviors God has already judged as sinful and abominable..... As a christian, I can point out your behavior is wrong according to nature and what has been written over thousands of years in the bible.\n\n \n \n Why should god bother to judge me when you have already done it for him, even though he specifically told you not to. You have gone directly against his will or what the bible said is his will. How I am more of a sinner than you", 
   {}, 
   72559, 
   null, 
   1098302040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  For the younger Christians", 
  "url": "http://www.4forums.com/political/religion-debates/3479-younger-christians.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 3479, 
  "discussion_files": [
   [
    "25816.html", 
    "http://www.4forums.com/political/religion-debates/3479-younger-christians-print.html"
   ]
  ], 
  "identifier": 3479
 }
]