[
 [
  [
   73017, 
   null, 
   "Waxy", 
   "That's the title on the cover of this month's National Geographic.\n \n A very good article for those that are interested. (Which unfortunately will likely only be those that already understand and accept the concept. :( )\n \n I'm going to post a few things that caught my eye and might spark a little debate.\n \n They cite the results of a Gallup poll, and quite frankly, I was astonished at its results -\n \n 45% of Americans agreed with the statement \"God created human beings pretty much in their present form sometime within the last 10,000 years or so\"\n \n My only explanation, and I'm grasping at straws, is that people think of \"modern humans\" as being around for about 10,000 years, especially those with only cursory scientific knowledge.\n \n 37% were satisfied in allowing room for both Darwin and God.\n \n Only 12% believed humans evolved from other life forms without the involvement of God.\n \n I really don't want to offend anyone here, but I thought Americans were supposed to be educated? It seems to me that even a rudimentary understanding of science and evolution would drastically alter these numbers.\n \n The really scary thing is that the're done this exact same poll in 1982, 1993, 1997, 1999, and again in 2004, and the percentage have only varied by very small margins. The creationist conviction - that God alone produced humans, has never fallen below 44%.\n \n There's always a lot of debate on \"theory\" in this section. Theory vs. fact.\n \n They point out that many of the things in life that we accept as fact and form basic parts of our everyday lives are actually scientific theory, some with less evidence to support them than evolution.\n \n The list includes -\n \n The Earth orbiting around the Sun rather than vice-versa\n Relativity  - E=mc2\n Atomic theory - the existance, structure and dynamics of atoms\n Continental drift - the movement of the Earth's crust as several large plates \n Electricity - yes, electricity, is a theory, it is based on the the construct of electrons, tiny unobservable units of mass that contain positive and negative charges\n \n How many would question whether these ideas are \"facts\"?\n \n Beyond that, the article goes into the deveolpment of the theory via Darwin and Wallace, and the advancements in modern genetics. It also provides some very compelling evidence.\n \n Worth a read.\n \n Waxy\n \n P.S. The phrase \"survival of the fittest\" does not appear once in this 30 page article. :p", 
   {
    "post_info": {
     "post_title": "Was Darwin Wrong?"
    }
   }, 
   null, 
   null, 
   1098465480.0
  ], 
  [
   73048, 
   null, 
   "OccamsRazor", 
   "I was going to say polls have to be taken with a pinch of salt, but National Geographic is hardly a trashy hack production.\n \n I'd be interested to see what results would be returned if similar polls were conducted in other western industrial nations.", 
   {}, 
   73017, 
   null, 
   1098476100.0
  ], 
  [
   73087, 
   null, 
   "Mach", 
   "That's the title on the cover of this month's National Geographic.\n \n A very good article for those that are interested. (Which unfortunately will likely only be those that already understand and accept the concept. :( )\n \n I'm going to post a few things that caught my eye and might spark a little debate.\n \n They cite the results of a Gallup poll, and quite frankly, I was astonished at its results -\n \n 45% of Americans agreed with the statement \"God created human beings pretty much in their present form sometime within the last 10,000 years or so\"\n \n My only explanation, and I'm grasping at straws, is that people think of \"modern humans\" as being around for about 10,000 years, especially those with only cursory scientific knowledge.\n \n 37% were satisfied in allowing room for both Darwin and God.\n \n Only 12% believed humans evolved from other life forms without the involvement of God.\n \n I really don't want to offend anyone here, but I thought Americans were supposed to be educated? It seems to me that even a rudimentary understanding of science and evolution would drastically alter these numbers.\n \n The really scary thing is that the're done this exact same poll in 1982, 1993, 1997, 1999, and again in 2004, and the percentage have only varied by very small margins. The creationist conviction - that God alone produced humans, has never fallen below 44%.\n \n There's always a lot of debate on \"theory\" in this section. Theory vs. fact.\n \n They point out that many of the things in life that we accept as fact and form basic parts of our everyday lives are actually scientific theory, some with less evidence to support them than evolution.\n \n The list includes -\n \n The Earth orbiting around the Sun rather than vice-versa\n Relativity  - E=mc2\n Atomic theory - the existance, structure and dynamics of atoms\n Continental drift - the movement of the Earth's crust as several large plates \n Electricity - yes, electricity, is a theory, it is based on the the construct of electrons, tiny unobservable units of mass that contain positive and negative charges\n \n How many would question whether these ideas are \"facts\"?\n \n Beyond that, the article goes into the deveolpment of the theory via Darwin and Wallace, and the advancements in modern genetics. It also provides some very compelling evidence.\n \n Worth a read.\n \n Waxy\n \n P.S. The phrase \"survival of the fittest\" does not appear once in this 30 page article. :p\n\n \n America is VERY religious when compared to other industrialized nations, so I've heard. Why religious people reject evolution, but accept most other scientific theories without protest generally falls into one of these two categories:\n \n Their faith tells them the claims of evolution must be false, so they adopt that belief. Then they examine the earth is round claims...and since their faith doesn't reject that, they can then use reason to agree. They can hide their belief in god as reason by claiming irrational things, then making it all nice and tidy. This would be for thinkers who just so happen to be religious (specifically with faiths that object to evolution).\n \n OR\n \n They don't rely heavily on reason AT ALL for deeper understanding of the world around them. They start with faith (same as above), but when it comes time for some deep thinking, they rely on other people to tell them what's true and what is not. Evolution? The other members reject it? It contradicts the bible OK, I reject it!! Continental drift..hrmm...anyone object to it? \"no\"... \"nuh uh\"....\"nope\"...OK, it must be OK to believe it then.\n \n Most people I'd guess fall into the last category, which is scary. A mob mentality is always capable of doing some crazy things...like denying what is real and what is not.\n \n I think given the short lifespan of humans right now, it won't have need to change much. It can take 20-30 years to get a person to the point where they can reason soundly, and with limited time on earth you'd have to have some SERIOUS incentive to get those that understand, to waste their time trying to convince people who are too intellectually lazy to find knowledge for themselves.\n \n -Mach", 
   {}, 
   73017, 
   null, 
   1098503040.0
  ], 
  [
   73098, 
   null, 
   "billsco", 
   "Thanks Waxy, I'm going to pick up a copy tomorrow in town. \n \n My state recently conducted a telephone poll on how many believe in the biblical story of creation. Seventy-five percent! I think the phone call spooked us Norwegians. We thought it was God himself conducting the poll.", 
   {}, 
   73087, 
   null, 
   1098505920.0
  ], 
  [
   73171, 
   null, 
   "Tastyfish", 
   "So is the article about this poll, or who darwinism has been combined with genetics rather than blending heritance and suchlike?\n \n Be intersting to see how those numbers split up over age range, whether the 45% is pretty much nerely exculsive to older generations or whether they are spread over all of them", 
   {}, 
   73098, 
   null, 
   1098641160.0
  ], 
  [
   73265, 
   null, 
   "Waxy", 
   "The poll was really only part of the intro to the article.\n \n NG was pointing out how much skepticism there is about the T of E and the general lack of knowledge/abundance of misinformation that surrounds Darwin and the Theory of Evolution.\n \n The article for the most part deals with Darwin himself and then goes into the basis and the basics of the T of E.\n \n It's a good \"Cliff's notes\" on the subject if you will.\n \n Waxy", 
   {}, 
   73171, 
   null, 
   1098723540.0
  ], 
  [
   73272, 
   null, 
   "Alan Ryan", 
   "America is VERY religious when compared to other industrialized nations, so I've heard. time on earth you'd have to have some SERIOUS incentive to get those that \n -Mach\n\n Britain, where I now live, is in comparison to America, a very secular society.\n But if that NG poll had been conducted here, I wouldn't be surprised if an\n even lower level of scientific understanding was measured. Ignorance in\n this case I'd put down to a very low level of education rather than to the \n interference of religious scruples. I think the former is harder to deal with\n than the latter.", 
   {}, 
   73087, 
   null, 
   1098726060.0
  ], 
  [
   73351, 
   null, 
   "pnac=ww3", 
   "\n I really don't want to offend anyone here, but I thought Americans were supposed to be educated? \n\n \n HA HA HA HA HA !\n emoticon_smile emoticon_smile emoticon_smile emoticon_smile emoticon_smile emoticon_smile \n \n \n But really... emoticon_emb \n \n \n .", 
   {}, 
   73017, 
   null, 
   1098748260.0
  ], 
  [
   73417, 
   null, 
   "pandion", 
   "An important point that seems to have been missed is that the poll in question was not done by National Geographic. It was a Gallup poll that was apparently reported in NG. Gallup has been repeating these polls in essentially the same form every few years for decades. In spite of advances of science in those years, creationists seem to be as entrenched in their ignorance as ever.\n \n Other polls have arrived at similar conclusions. You have to suscribe to the Gallup site to see the results of their polls but they are reported elsewhere. Here is a discussion of the most recent Gallup poll, from 2001. This report is not comprehensive. Gallup asks more questions and then shows certain correlations between the data. George Gallup was himself a fundamentalist Christian and he expressed some disappointment with what the data showed.\n \n All of the polls showed that the more educated a responder was, the less likely they were to be a creationist. Besides being less educated, creationists also tend to be less affluent (understandable when one considers education), older, southern, more rural and female. I certainly hope that all of you are sophisticated enough to realize that data correlations do not necessarily indicate a causitive influence. Nevertheless, it was these correlations that caused Gallup himself to comment.\n \n Polls have also shown that about 95% of those holding a degree in science accept evolution rather than young earth creationism. The numbers are even higher, at about 99%, for biologists and geologists. Chemists have the highest number of creationists among their ranks, approaching 6%. I seem to recall that astronomers are next. I'm not sure how many of them are \"creationists\" as opposed to \"young earth creationists.\" The bottom line is that the lists of \"scientists\" who accept creationism that have been put forward by creationist ministries are laughable. Few of the creationist scientists are biologists, and others hold law degrees, sociology degrees, hydrolics degrees, and the like. In answer, the National Center for Science Education began a list of evolutionary scientists named Steve - in honor of the then recently deceased Dr. Stephen Jay Gould. About 1% of the human population is named \"Steve\" in some form. Currently the Steve Project has 489 scientists with Ph.D. degrees in biology, geology, paleontology, or a related scientific field who suscribe to the statement (see below). The list includes Stephen Hawking, even though he is more a cosmologist than a biologist. How could the application of one of the greatest scientific minds of our day be refused?\n \n All of these scientists suscribe to the following statement:\n \nEvolution is a vital, well-supported, unifying principle of the biological sciences, and the scientific evidence is overwhelmingly in favor of the idea that all living things share a common ancestry. Although there are legitimate debates about the patterns and processes of evolution, there is no serious scientific doubt that evolution occurred or that natural selection is a major mechanism in its occurrence. It is scientifically inappropriate and pedagogically irresponsible for creationist pseudoscience, including but not limited to \"intelligent design,\" to be introduced into the science curricula of our nation's public schools.\n\n \n Waxy has pointed out some theories that are arrived at by inductive rather than deductive logic. He left out the theory of gravitation. We observe the effects of gravity but we have no idea why it works.", 
   {}, 
   73351, 
   null, 
   1098772020.0
  ], 
  [
   73503, 
   null, 
   "Waxy", 
   "Good points Pandion.\n \n I did mention that the poll was a Gallup poll conducted on behalf of NG, and that the same poll has been conducted regularly over the last 20 years.\n \n Anyhoo,\n \n I have seen the stats regarding education vs. \"fundamentalist\" Christian beliefs in the past, and to me, the correlation/causation is undeniable. However, it tends to be a real hot potato in any debate so I generally try to steer clear of it. That said, I was genuinely surprised that the level of education was so low in the USA to result in the number of YECs being so high.\n \n I'd like to see the actual wording of the poll questions, and I'd like to see the results of the poll in some other G7 countries, especially Canada. \n \n I happen to fall into the category where 99%+ believe in evolution, I'm a geologist.\n \n Waxy", 
   {}, 
   73417, 
   null, 
   1098809940.0
  ], 
  [
   78128, 
   null, 
   "Gator", 
   "I'd like to see the actual wording of the poll questions,\n\n Here are further details on the Gallup poll taken Nov 7-10, 2004 showing nearly half of Americans believe God created humans 10,000 years ago.\n \n \n Results based on telephone interviews with randomly selected national sample of 1,016 adults, aged 18 and older. One can say with 95% confidence that the maximum error attributable to sampling and other random effects is ±3 percentage points. In addition to sampling error, question wording and practical difficulties in conducting surveys can introduce error or bias into the findings of public opinion polls.", 
   {}, 
   73503, 
   null, 
   1100907120.0
  ], 
  [
   78130, 
   null, 
   "Waxy", 
   "Here are further details on the Gallup poll taken Nov 7-10, 2004 showing nearly half of Americans believe God created humans 10,000 years ago.\n \n \n Results based on telephone interviews with randomly selected national sample of 1,016 adults, aged 18 and older. One can say with 95% confidence that the maximum error attributable to sampling and other random effects is ±3 percentage points. In addition to sampling error, question wording and practical difficulties in conducting surveys can introduce error or bias into the findings of public opinion polls.\n\n \n Thanks Gator.\n \n Good link to some interesting info - some rather baffling, some not in the least bit surprising.\n \n Waxy", 
   {}, 
   78128, 
   null, 
   1100907660.0
  ], 
  [
   78177, 
   null, 
   "Gator", 
   "What I find particularly baffling in the survey results is that such a high percentage of people continue to believe humans were suddenly created 10,000 years ago, even though the acceptance of evolution does not preclude the simultaneous belief in God.\n \n In light of the overwhelming evidence that favors evolution, why is it that so many people inclined toward a theistic concept of creation are unwilling to simply integrate evolutionary theory into their theistic view?", 
   {}, 
   78130, 
   null, 
   1100931360.0
  ], 
  [
   82212, 
   null, 
   "redneckdebate", 
   "Darwin made a theory. Some people may accept it or reject it. But the key word here is theory. Do we get mad and make arguments over Hobbes social contract theory? Or even the theory of preponderance? I don't understand why people degrade on Darwin for simply making a theory. To conclude my argument I will make the following statement: theories are not proven. They are simply a hypothesis on different aspects of the world. If people did not accept Darwin's theory, they would not raise such chaos about it.", 
   {
    "post_info": {
     "post_title": "keyword theory"
    }
   }, 
   78177, 
   null, 
   1102800300.0
  ], 
  [
   82219, 
   null, 
   "Clive14", 
   "Darwin made a theory.\nDarwin offered us a hypothesis. That hypothesis (and many more that have come after Darwin) have been rigorously tested and found valid and thus it has become a scientific theory. A scientific theory is as near as we can get to a proven fact without invoking faith. Evolution is not \"just a theory\", just as gavity is not \"just a theory\". If people realised this and accepted that evolution is as near-as-damnit fact then the whole evolution v falsified creation just-so stories debate would end.", 
   {}, 
   82212, 
   null, 
   1102807860.0
  ], 
  [
   82391, 
   null, 
   "Duo_Maxwell", 
   "Darwin could certainly be wrong. Does that make creationism true? By no means. \n \n The fallacy of Excluded Middle (False Dichotomy, Faulty Dilemma, Bifurcation) assumes that there are only two alternatives. There could easily be other reasons for how life began, changed, and is, that has nothing to do with evolution or deities.", 
   {}, 
   82219, 
   null, 
   1102937400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Was Darwin Wrong?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3499-darwin-wrong.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 3499, 
  "discussion_files": [
   [
    "24009.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3499-darwin-wrong-print.html"
   ], 
   [
    "24010.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3499-darwin-wrong-2-print.html"
   ]
  ], 
  "identifier": 3499
 }
]