[
 [
  [
   73413, 
   null, 
   "Jaaaman", 
   "Yes.... in fact they do:\n Few \"gay\" relationships last longer than two years, with many homosexual men reporting hundreds of lifetime partners. Source: Pollack, M. \" Male Homosexuality,\" in Western Sexuality: Practice and Precept in Past and Present Times, ed. P. Aries and A.Bejin, pp. 40-61, cited by Joseph Nicolosi in Reparative Therapy of Male Homosexuality (Northvale, N.J., Jason Aronsons Inc., 1991), pp.124-25. \n \n 50% of homosexual men over the age of 30, and 75% of homosexual men over the age of forty, experienced no relationships that lasted more than one year. Source: M. T. Saghir and E. Robins, Male and Female Homosexuality: A Comprehensive Investigation (Baltimore: Williams Wilkins, 1973), pp. 56-57. \n \n \n In 1978, a study done by two homosexual doctors revealed staggering statistics. Of 685 homosexual men, 589 (83%) had 50+ partners in their lifetime, 497 (73%) had 100+, 394 (58%) had 250+, 284 (41%) had 500+, 182 exceeded 1000 partners, an astonishing 26%. And 79% noted that over half their sexual contacts were total strangers. Source: Bell, A.P. and Wienberg, M.S. \" Homosexualities: A Study of Diversity Among Men and Women \" (New York: Simon & Schuster, 1978.) \n \n \n Another large survey found that only 7 % of male homosexuals had been in a relationship that had lasted more than ten years. Source: K. Jay and A. Young, The Gay Report, (New York: Summit, 1979), pp. 339-40. \n \n \n Homosexual author Seymour Kleinberg: \"The prodigiousness of sex really depends deeply on change, and promiscuity is the easiest kind of change for gay men.\" Source: Seymour Klienberg, Alienated Affections (NY: St. Martin's Press, 1980), p. 171. \n \n \n In a 6-month long daily sexual diary, gay men were averaging somewhere around 110 different sex partners per year. Source: Corey, L. and Holmes, K.K., \" Sexual transmission of Hepatitis A in homosexual men,\" New England Journal of Medicine, 1980; Vol. 302, pp. 435-38. \n \n \n A 1981 study found that only 2% of homosexual could be classified as monogamous or even semi monogamous (having ten or fewer lifetime sexual partners). Source: Bell, A.P., Weinberg, M.S., Hammersmith, S.E., Sexual Preference, 1981, pp.308-9. \n \n \n Extreme promiscuity has in fact been a common occurrence among homosexual males for a long time. Back in 1982, homosexual author Dennis Altman even admitted: \" now there is a move toward claiming that this (promiscuity) is part of a different, perhaps even superior, way of managing sexual relationships... (t) he assumption that it is desirable to have frequent and varied sex partners is increasingly seen as a positive part of gay life style.\" Source: Dennis Altman, \" The Homosexualization of America, The Americanization of the Homosexual, (NY: St. Martin's Press, 1982) pp. 16-7. \n \n \n According to the American Psychological Association, after the AIDS epidemic the average number of male homosexual partners only dropped from 70 to 50 per year. Source: Sally Ann Stewart, \" AIDS Aftermath: Fewer Sex Partners among Gay Men,\" USA Today, 21 November 1984. \n \n \n The 1984 book the \" Gay Couple \" was written by a psychiatrist and psychologist (who happened to be a homosexual couple), and they hoped to dispel the myth that \"gay\" couples lacked stability and long-term relationships. Rather than eliminate the myth, their research confirmed it. After much searching, they were able to locate only 156 couples in lasting relationships. The study also revealed that only 7 couples had actually maintained sexual fidelity and none of the seven had been together more than 5 years. \n \n \n A Los Angeles study conducted in the late 1980s found that male homosexuals averaged over 20 partners per year. Source: L. Linn et al., \" Recent Sexual Behaviors Among Homosexual Men Seeking Primary Medical Care,\" Archives of Internal Medicine 149 (December 1989): pp. 2685-90. \n \n \n Two homosexual icons, Marshall Kirk and Hunter Madsen, wrote this about male homosexuality: \" gay men aren't very good at having and holding lovers...(because) gay men tire of their partners (sexually) more rapidly than straight men.\" And according to them, the average homosexual male first \"seeks (sexual) novelty in partners, rather than practices, and becomes massively promiscuous; (but) eventually, all bodies become boring, and only new practices will thrill. \" The cheating ratio of 'married' [committed] gay males, given enough time, approaches 100%.\" Source: Marshall Kirk and Hunter Madsen,\" After the Ball,\" (NY: Doubleday, 1989) pp. 304-320. \n \n \n In Spain, the average homosexual sexual encounters for men were 42 per year in 1989. Source: Rodriguez-Pichardo, A., et al \" Sexually transmitted diseases in homosexual males in Seville, Spain,\" Genitourin Med, 1990; Vol. 66, pp. 423-27. \n \n \n \"Gay\" monogamous relationships are rarely faithful. \"Monogamous\" seems to imply some primary emotional commitment, while causal sex continues on the side. Source: Con nell, RW. Crawford, J., Dowsett, GW., Kippax, S., Sinnott, V., Rodden, P., Berg, R., Baxter, D., Waston, L., \" Danger and context: unsafe anal sexual practice among homosexual and bisexual men in the AIDS crisis,\" Australian and New Zealand Journal of Sociology (1990 ) 26: pp.187-208. \n \n \n A three-year study in Boston found that 77% of 481 male subjects had had more than 10 partners in the previous 5 years, 34% more than 50 partners in the previous 5 years. Source: G. R. Seage III et al., \" The Relation Between Nitrite Inhalants, Unprotected Anal Intercourse and the Risk of Immunodeficiency Virus Infection,\" American Journal of Epidemiology 135 (January 1, 1992), p. 5. \n \n \n Between 17% to 54% of \"gay\" men continue to practice high-risk sex post-AIDS, suggesting an addictive drive. Source: Whitehead, NE., Whitehead, Bk., Submission to the Justice and Law Reform Select Committee on the Human rights Commission Amendment Bill 1992 ( Lower Hutt, New Zealand: Lion of Judah Ministries, 1993 ). \n \n \n The Washington Post reported in 1993 that despite all the AIDS education for almost a decade \" increasing numbers of gay men...are lapsing into previous patterns of unsafe sexual practices...\" Source: Andriote, John-Manuel, \" Gay Men and Unsafe Sex: Bridging a Gap Between Knowledge and Behavior,\" The Washington Post, August 10, 1993, Z14. \n \n \n Homosexuals still have 3-4 times as many partners as heterosexuals. Source: Laumann, FO. Gagnon, JH., Micheal, RT., Micheals, S., The Social Organization of Sexuality ( Chicago: university of Chicago Press, 1994 ). \n \n \n The national gay and lesbian publication, The Advocate, reported \" of 600 gay and bisexual male Milwaukeeans, 73% said they've had sex in the past six months with someone they never saw again.\" Source: The Advocate, June 14, 1994, p.16. \n \n \n A survey of 239 gay and bisexual males between the ages of 13 to 21 found that despite accurately understanding the odds of HIV infection, 63% participated in behavior that put them at \"extreme high risk.\" Source: Ramafedi, Gary, \" Predictors of Unprotected Intercourse Among Gay and Bisexual Youth: Knowledge, Beliefs and Behavior,\" Pediatrics, August 1994, vol. 94, no.2, pp. 163-168. Cf., Lemp, George F., et al, \" Seroprevalence of HIV and Risk Behaviors Among Young Homosexual and Bisexual Men - The San Francisco/Berkeley Young Men's survey,\" Journal of the American Medical Association, August 10, 1994, vol. 272, no.6, pp.449-454. \n \n \n Another story in The Advocate reported that although 71% of homosexual men claimed that they prefer long-term \"monogamous\" relationships, only 33% live with a partner, only 11% have a \"primary male partner, only 8% are dating one particular person, with 87% involved in multiple dating. Source: Lever, Janet. \" The 1994 Advocate Survey of Sexuality and Relationships: The Men,\" The Advocate, August 23, 1994. \n \n \n A Los Angeles Study of young homosexual males in 1996 revealed that about 50% of those between 15 to 22 years of age had engaged in \" high-risk, unprotected sex\" during the previous 6 months. Source: Bettina Boxall, \" Young Gays stray from Safe Sex, New Data Shows,\" Los Angeles Times, September 3, 1996, sec. A. \n \n \n \" The facts, enough gay men are once again having enough unsafe sex that the rates of HIV infection, gonorrhea and syphilis are returning to frightening heights. \" Source: Kramer, Larry, \" Gay Culture, Redefined,\" The New York Times, December 12, 1997, op ed page. \n \n \n An upscale homosexual men's magazine, Genre, surveyed 1037 readers in October of 1996. Here are some of the results: \" One of the single largest groups in the gay community still experiencing an increase of HIV are supposedly monogamous couples.\" 52% have had sex in a public park. 45% have participated in three-way sex. 42% have had sex with more than 100 different partners and 16% claim between 40 to 100 partners. Source: LaBarbera, Peter, \" Survey finds 40% of Gay men have had more than 40 Sex Partners,\" The Lambda Report, January-February 1998, p.20. \n \n \n Some men who have sex with men (MSM) may be recruiting sex partners in anonymous venues more often now than in the recent past. Source: Sowell Rl, Lindsey C, Spicer T, \"Group sex in gay men: its meaning and HIV prevention implications,\" Journal of Association of Nurses AIDS Care, 1998; Vol. 9: pp.59-71. \n \n \n Studies consistently show age differences in the sexual activities of gay men. Younger men have more partners, a greater frequency of sex, \"cruise\" more and have shorter relationships than older men, while older men are more likely to pay for sex. Source: Gilmore, MR, Schwartz, P, Civic, D, (1999), The social context of sexuality: The case of the United States, In KK Holmes, PA Mardh, PF Sparling, SM Lemon, WE Stamm, P Piot, & JN Wasserhelt (Eds.), Sexually Transmitted Diseases, 23 (2). pp.109-114. \n \n \n When STDs are introduced into the gay community, the size of the subsequent outbreak depends on the sexual mixing patterns of the gay community, the numbers of sex partners, concurrency of sexual partnerships, condom use, and frequency of partner change which at times can be great in the gay community. Source: Aral SQ., \" sexual network patterns as determinants of STD rates: paradigm shift in behavioral Epidemiology of STDs made visible,\" Sexually Transmitted Diseases, Vol. 26; pp. 262-264. \n \n \n Judy Wieder, editor in chief of The Advocate, wrote that according to Simon LeVay, a homosexual scientist who has researched homosexuality extensively - (males) are much more interested in causal sex and non monogamous relationships. In the same article, Gretchen Lee, managing editor of Curve, was quoted that one of her female staff writers wanted to \"even cruise for sex as gay men do.\" Source: \" Do gay men and lesbians get along?\" XY Magazine, July 1999, no.20, p. 77. \n v\n \n \n Dr. Martin Dannecker, a homosexual German Sexologist, studied 900 homosexuals in 1991 living in \"steady relationships\". 83% of males had numerous sexual encounters outside their partnerships over a one-year period. Dr. Dannecker observed \"clear differences in the manner of sexual gratification\" between single and non-single gay men that were the reverse of what he expected. Of the homosexual men in steady relationships, he wrote, \" the average number of homosexual contacts per person was 115 in the past year.\" In Contrast, single gay men had only 45 sexual contacts. Source: Wittmeier, Carmen, \" Now they know the other half,\" Alberta Report, 1999 06 07, p.27. \n \n \n The following study appeared in the Journal of American Medical Association (JAMA) July 26th issue. A Cross-sectional survey conducted September 1999 through April 2000 with a total of 856 clients of the Denver Public Health HIV Counseling and testing Site in Colorado. 69.2% of the survey were men, 34.7% were homosexual or bisexual, and aged 20 to 50 years represented 84.1% of participants. The results show that 21.8% of those seeking sex over the internet had a history of STDs, 88.7% solicited oral sex, 41% had anal sex and 16.8% reported being sexually exposed to a person known to have HIV infection. Table 3 showed 135 (15.8%) of clients reporting that they had logged on to the internet to seek sex partners, and 88 (65.2%) of these having successfully initiated sexual contact: of those who had sex with more than 3 different Internet partners over a 6 month period was 34 (38.7%). Table 4 showed the majority of online seekers were men (65.2%), white (76.2%), and between the ages of 20 to 39 (63.2%). Also table 4 revealed that 67.7% of on line sex seekers were either homosexual or bisexual and that 76.7% meet and had homosexual sex encounters via the Internet. This led the researchers to conclude the following: Online seekers were more likely to be homosexual than offline clients and online partners were more likely to be homosexual than the online-no partner group. Finally, Table 5 reveals that online sex seekers were more likely to have had an STD and that 28.9% of online seekers reported exposing themselves to known HIV-positive partners. 63.4% and 72.9% respectively were homosexual sex encounters with 97% being oral sex and 69.4% being anal sex. Source: M. McFarlane, PhD., S.S. Bull, PhD., MPH., C.A. Rietmeijer, MD.,MPH., \" The internet as a newly Emerging Risk Environment for Sexually Transmitted Diseases,\" Journal of American Medical Association, July 26, 2000: pp. 443-446. \n \n \n Men's Health magazine reported in June that (heterosexual) men, on average, have 12.4 sex partners (in a lifetime), and have sex 1.5 times per week. These numbers may seem low to many gay men, who generally exercise greater sexual freedom than their heterosexual counterparts. But for a person who is sexually compulsive these numbers may seem shockingly low. Frequent sexual encounters may be accompanied by feelings or guilt and minor consequences. Ken (a gay man) suffers from Sexual Addiction, \"It's just so much easier to have anonymous sex with someone I don't know. There is this buildup of excitement and a sexual rush, hoping the other guy will notice me...want me. After we connect, I just lose myself in the sex. It's really not about knowing the guy. I rarely even want to know his name. When it's over, I can simply walk away, \" said Ken. Among the problems caused by sexual addiction in \"gay\" men is one of the most common of contracting frequent and/or multiple sexually transmitted diseases (STDs) ( i.e., HIV, syphilis, chlamydia, gonorrhea, etc.). Source: Shaun Bourget, M.A., M.F.T., \" Sexual Addition: On a Road to Nowhere,\" GayHealth.com; July 26,2000.", 
   {
    "post_info": {
     "post_title": "Homosexuals cheat more than Heterosexuals"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1098769200.0
  ], 
  [
   73414, 
   null, 
   "Jaaaman", 
   "He are the stats you have all been asking for.......... emoticon_idea", 
   {}, 
   73413, 
   null, 
   1098769620.0
  ], 
  [
   73425, 
   null, 
   "JakeCJB", 
   "Of heterosexually active adults in the general population, about 20 percent of men have had 1 sexual partner during their lives, 55 percent have had up to 20 partners, and about 25 percent have had 20 or more partners11. Some older studies conducted before the epidemic of the acquired immunodeficiency syndrome (AIDS) indicated that homosexual men were more likely than heterosexual men to have had a very large number of sexual partners14. More recent population-based studies have found this to be relatively uncommon. For instance, Fay et al.10 found that of men who had homosexual contact after the age of 20, almost all had 20 or fewer homosexual partners in their lifetimes. Of 1450 men in the sample, only 2 were reported to have had 100 or more same-sex partners10. The inconsistency in the data on the number of sexual partners of homosexual men probably reflects flaws in the sampling techniques of the earlier studies (e.g., recruiting subjects in gay bars) and their completion before the human immunodeficiency virus (HIV) epidemic. The overlap between gay and heterosexual men with respect to the number of partners is considerable, although a small subgroup of gay men have had sex with a great many more partners than almost any heterosexual men. Women have been studied less than men, but the existing data show that lesbians resemble heterosexual women more than gay men in their sexual behavior15. For instance, women of any sexual orientation are more likely to view sexual desire as a function of emotional intimacy and to value romantic love and monogamy. Almost all married women are sexually active only with their husbands, and unmarried women are very unlikely to have more than one partner in a given three-month period11. Blumstein and Schwartz reported that women in lesbian couples had fewer outside partners than women in heterosexual couples. Lesbian couples generally have less sexual activity than their heterosexual counterparts but report higher levels of intimacy and as much or more satisfaction with the sexual relationship16. \n http://content.nejm.org/cgi/content/full/331/14/923#R14\n \n \n An example of how one of the old studies cited is not a representative sample according to its authors...\n Saghir, M.T., and Robins, E. Male and female homosexuality: a comprehensive\n investigation. Baltimore: Williams and Wilkins, 1973. Cited in Pamphlets\n #6 and #9.\n \n Pamphlets #6 and #9 make various claims on the criminality of homosexuals and\n use this book to support its claims. For example, Pamphlet #6 states that\n homosexuals \"generally are more frequently associated with criminality...\"\n and that \"homosexuals much more frequently attempt suicide....\" Pamphlet #9\n uses the Saghir and Robins study to claim that homosexuals are less stable\n and are more involved in criminal activity.\n \n None of these claims is supported by Saghir and Robins, who clearly state in\n a special section called \"Representativeness of the Samples\" (p. 14) that \"we\n entertained no illusions concerning representative samples although we\n realized that this would be the most desirable experimental situation....At\n the present time, a sampling procedure of this nature is not possible with\n homosexuals due to the social and legal stigmata attached to\n homosexuality....\"\n http://www.qrd.org/qrd/religion/anti/cameron/background.and.rebuttal\n \n More to come from me on this thread.", 
   {}, 
   73414, 
   null, 
   1098776100.0
  ], 
  [
   73540, 
   null, 
   "jitobear", 
   "If it's not your relationship - mind your own business.\n \n I am tired of the meaningless stats. They are not an excuse to deny rights to somebody.\n \n Did heterosexuals have to prove themselves to the masses before engaging in relationships and marriage?\n \n Each relationship is an indivudual thing.\n \n This sounds a lot like saying all blacks are criminals or all Indians are drunks. It's same load of ****.", 
   {}, 
   73425, 
   null, 
   1098818700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Homosexuals cheat more than Heterosexuals", 
  "url": "http://www.4forums.com/political/gay-rights-debates/3524-homosexuals-cheat-more-than-heterosexuals.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 3524, 
  "discussion_files": [
   [
    "17442.html", 
    "http://www.4forums.com/political/gay-rights-debates/3524-homosexuals-cheat-more-than-heterosexuals-print.html"
   ]
  ], 
  "identifier": 3524
 }
]