[
 [
  [
   73415, 
   null, 
   "Jaaaman", 
   "What harm will come to society from the marriage of gays?\n \n \n \n The most significant impact of legally recognizing same-sex unions would be more indirect. Expanding the definition of what \"marriage\" is to include relationships of a homosexual nature would inevitably, in the long run, change people's concept of what marriage is, what it requires, and what one should expect from it. These changes in the popular understanding of marriage would, in turn, change people's behavior both before and during marriage.\n \n Same-sex marriage will open wide the door to homosexual adoption, which will simply lead to more children suffering the negative consequences of growing up without both a mother and a father.\n \n Among homosexual men in particular, casual sex, rather than committed relationships, is the rule and not the exception. And even when they do enter into a more committed relationship, it is usually of relatively short duration. For example, a study of homosexual men in the Netherlands (the first country in the world to legalize \"marriage\" for same-sex couples), published in the journal AIDS in 2003, found that the average length of \"steady partnerships\" was not more than 2 < years (Maria Xiridou et al., in AIDS 2003, 17:1029-1038).\n \n In addition, studies have shown that even homosexual men who are in \"committed\" relationships are not sexually faithful to each other. While infidelity among heterosexuals is much too common, it does not begin to compare to the rates among homosexual men. The 1994 National Health and Social Life Survey, which remains the most comprehensive study of Americans' sexual practices ever undertaken, found that 75 percent of married men and 90 percent of married women had been sexually faithful to their spouse. On the other hand, a major study of homosexual men in \"committed\" relationships found that only seven out of 156 had been sexually faithful, or 4.5 percent. The Dutch study cited above found that even homosexual men in \"steady partnerships\" had an average of eight \"casual\" sex partners per year.\n \n So if same-sex relationships are legally recognized as \"marriage,\" the idea of marriage as a sexually exclusive and faithful relationship will be dealt a serious blow. Adding monogamy and faithfulness to the other pillars of marriage that have already fallen will have overwhelmingly negative consequences for Americans' physical and mental health.\n \n So, yes, same-sex marriages will have a direct impact on heterosexual marriages and families as a whole. The impact will be a negative one, and it will be long term. Marriage and the family \"unit\" will simply become terms with little value and meaning. There will be no structure, and as a result our country's resolve will weaken. I believe that the backbone of society is the family \"unit\", and this will break the backbone of our society.", 
   {
    "post_info": {
     "post_title": "What harm will come to society from the marriage of gays?"
    }
   }, 
   null, 
   null, 
   1098770220.0
  ], 
  [
   73447, 
   null, 
   "OccamsRazor", 
   "Lets see Jaaaman.\n \n The wedding industry will see an increase in trade.\n \n Pension providers will have to pay up by providing spouse entitlements to surviving partners in the event of the policy holders death.\n \n YMCA might get played more at wedding receptions.\n \n \n Oh yes, the impending doom of your society is upon you emoticon_rolleyes", 
   {}, 
   73415, 
   null, 
   1098794760.0
  ], 
  [
   73475, 
   null, 
   "joebrummer", 
   "What harm will come to society from the marriage of gays?\n \n \n\n None! Gay couples with children will be protected like other families...\n \n\n The most significant impact of legally recognizing same-sex unions would be more indirect. Expanding the definition of what \"marriage\" is to include relationships of a homosexual nature would inevitably, in the long run, change people's concept of what marriage is, what it requires, and what one should expect from it. These changes in the popular understanding of marriage would, in turn, change people's behavior both before and during marriage.\n \n\n says who? You. This is just an opinion, there is no statistical data to back this claim up. People don't value marriage now, it is just a legal agreement that couples have that the government resepcts. Then they get a divorce and do it again. How will gays marrying change this in anyway.\n \n\n Same-sex marriage will open wide the door to homosexual adoption, which will simply lead to more children suffering the negative consequences of growing up without both a mother and a father.\n\n \n Study show there is no significant difference that having two parents of the same sex or having different sexed parents. Children do better with two parents, the sex of those parents is no important. see www.colage.org let the kids speak for themselves.\n \n\n Among homosexual men in particular, casual sex, rather than committed relationships, is the rule and not the exception. And even when they do enter into a more committed relationship, it is usually of relatively short duration. For example, a study of homosexual men in the Netherlands (the first country in the world to legalize \"marriage\" for same-sex couples), published in the journal AIDS in 2003, found that the average length of \"steady partnerships\" was not more than 2 < years (Maria Xiridou et al., in AIDS 2003, 17:1029-1038).\n \n\n and where did they find the participants for this study, bath houses and bars? Gay men are a hidden population in statistical relms. It is very hard to get a true random sample of data on gay men. Studies will say whatever the funder of the study wants it to say. You just get data from the right place. If you want gay men to look like raging alcoholics get your study participants in a bar. If you want them to look like sexaholics then you get your study subjects in bathouses. The truth is that to have honest statistical data you need RANDOM SAMPLES.\n \n\n On the other hand, a major study of homosexual men in \"committed\" relationships found that only seven out of 156 had been sexually faithful, or 4.5 percent. The Dutch study cited above found that even homosexual men in \"steady partnerships\" had an average of eight \"casual\" sex partners per year.\n\n what major study, where is the source or did you make this up.\n \n\n So if same-sex relationships are legally recognized as \"marriage,\" the idea of marriage as a sexually exclusive and faithful relationship will be dealt a serious blow. Adding monogamy and faithfulness to the other pillars of marriage that have already fallen will have overwhelmingly negative consequences for Americans' physical and mental health.\n \n So, yes, same-sex marriages will have a direct impact on heterosexual marriages and families as a whole. The impact will be a negative one, and it will be long term. Marriage and the family \"unit\" will simply become terms with little value and meaning. There will be no structure, and as a result our country's resolve will weaken. I believe that the backbone of society is the family \"unit\", and this will break the backbone of our society.\n\n we have heard this from you before and already showed it to be rubbish hate speech from the christian right wing", 
   {}, 
   73415, 
   null, 
   1098804600.0
  ], 
  [
   73536, 
   null, 
   "jitobear", 
   "What harm will come to society from the marriage of gays?\n\n \n Gay marriage will impact straight marriage the same way black socks impact white ones.\n \n As in, it won't.\n \n \nThe most significant impact of legally recognizing same-sex unions would be more indirect. Expanding the definition of what \"marriage\" is to include relationships of a homosexual nature would inevitably, in the long run, change people's concept of what marriage is, what it requires, and what one should expect from it. These changes in the popular understanding of marriage would, in turn, change people's behavior both before and during marriage.\n\n \n What marriage is, how people act within it, and what they expect out of it is within the realm of private and personal choices made by the married couple. Maybe Dick and Jane feel should she should stay home, while he works. Maybe Dick and Jane feel he should stay home while she works. Maybe Dick and Jane expect monogomy. Maybe Dick and Jane have an open relationship and allow each other to see others. And maybe, just maybe, what Dick and Jane do with their marriage is none of your business.\n \n You need to learn that you do not get to lay out the morality guidelines of other people's marriages. \n \n Welcome to America.\n \n \nSame-sex marriage will open wide the door to homosexual adoption, which will simply lead to more children suffering the negative consequences of growing up without both a mother and a father.\n\n \n Currently in the county where I live there are around 100 children that are wards of the state that have neither. That is just one county. In Africa there are an alarming number of orphans due to AIDS. In other parts of the world children, particularly girls, are abandoned just for being the wrong sex. And we won't even go into the number of single parents there and the masses of dead-beat parents, particularly fathers.\n \n The bottom line is that there aren't enough loving parents to go around, yet you would deny these children loving homes to simply satisfy your own prejudice. How absolutely short-sighted, selfish and cruel.\n \n And I challenge you to ask my son, my aunt's son, my son's two friends from daycare or Justine's son how they feel about you wanting to take away their parents (my son's mentor is for all practical purposes his father). I DARE YOU.\n \n I would agree that children need positive role models of both sexes, however most gay people do know people of the opposit sex.\n \n \nAmong homosexual men in particular, casual sex, rather than committed relationships, is the rule and not the exception. And even when they do enter into a more committed relationship, it is usually of relatively short duration. For example, a study of homosexual men in the Netherlands (the first country in the world to legalize \"marriage\" for same-sex couples), published in the journal AIDS in 2003, found that the average length of \"steady partnerships\" was not more than 2 < years (Maria Xiridou et al., in AIDS 2003, 17:1029-1038).\n \n In addition, studies have shown that even homosexual men who are in \"committed\" relationships are not sexually faithful to each other. While infidelity among heterosexuals is much too common, it does not begin to compare to the rates among homosexual men. The 1994 National Health and Social Life Survey, which remains the most comprehensive study of Americans' sexual practices ever undertaken, found that 75 percent of married men and 90 percent of married women had been sexually faithful to their spouse. On the other hand, a major study of homosexual men in \"committed\" relationships found that only seven out of 156 had been sexually faithful, or 4.5 percent. The Dutch study cited above found that even homosexual men in \"steady partnerships\" had an average of eight \"casual\" sex partners per year.\n\n \n Quit with the sex stats already! Sex is legal. If you are an adult in this country and you are playing with another adult in this country - you can do whatever you want - regardless of marriage. \n \n \nSo if same-sex relationships are legally recognized as \"marriage,\" the idea of marriage as a sexually exclusive and faithful relationship will be dealt a serious blow. Adding monogamy and faithfulness to the other pillars of marriage that have already fallen will have overwhelmingly negative consequences for Americans' physical and mental health.\n\n \n See above. Whether a couple is or isn't monogomous is not for you to determine or worry about. And speak for yourself if you don't mind. This member of the American public's mental health is just fine thank you very much. If gay marriage impacts YOU that much, well that sounds like your problem.\n \n \nSo, yes, same-sex marriages will have a direct impact on heterosexual marriages and families as a whole. The impact will be a negative one, and it will be long term. Marriage and the family \"unit\" will simply become terms with little value and meaning. There will be no structure, and as a result our country's resolve will weaken. I believe that the backbone of society is the family \"unit\", and this will break the backbone of our society.\n\n \n The backbone of my family is me and a gay man. We are all just fine without you trying to tell us how to live our lives, Mr. Nosey Parker.", 
   {}, 
   73415, 
   null, 
   1098818220.0
  ], 
  [
   73630, 
   null, 
   "zachvac", 
   "What harm will come to society from the marriage of gays?\n \n\n None whatsoever as some have been married already.\n \n \n\n The most significant impact of legally recognizing same-sex unions would be more indirect. Expanding the definition of what \"marriage\" is to include relationships of a homosexual nature would inevitably, in the long run, change people's concept of what marriage is, what it requires, and what one should expect from it. These changes in the popular understanding of marriage would, in turn, change people's behavior both before and during marriage.\n \n\n Whoa, there's a big leap from allowing gays to marry and non-gays changing what they expect from it.\n \n \n\n Same-sex marriage will open wide the door to homosexual adoption, which will simply lead to more children suffering the negative consequences of growing up without both a mother and a father.\n \n\n I know many people at my high school alone raised with 2 fathers or 2 mothers. There was a recent debate held at our school between 2 people about gay marriage and when one said this the other said that he was raised by 2 gay male parents. The other responded with \"But you seem so normal\". How do you know that there are negative consequences of growing up without both a mother and a father. And also this is of course why we don't allow single mom's and single dad's to raise children, right?\n \n \n \n\n Among homosexual men in particular, casual sex, rather than committed relationships, is the rule and not the exception. And even when they do enter into a more committed relationship, it is usually of relatively short duration. For example, a study of homosexual men in the Netherlands (the first country in the world to legalize \"marriage\" for same-sex couples), published in the journal AIDS in 2003, found that the average length of \"steady partnerships\" was not more than 2 < years (Maria Xiridou et al., in AIDS 2003, 17:1029-1038).\n \n\n First of all this is none of your business or mine or anyone except them whether they have casual sex or committed relationships. Why should we tell them one or the other is right? Also I question the validity of a servey with such a personal matter at hand.\n \n \n\n In addition, studies have shown that even homosexual men who are in \"committed\" relationships are not sexually faithful to each other. While infidelity among heterosexuals is much too common, it does not begin to compare to the rates among homosexual men. The 1994 National Health and Social Life Survey, which remains the most comprehensive study of Americans' sexual practices ever undertaken, found that 75 percent of married men and 90 percent of married women had been sexually faithful to their spouse. On the other hand, a major study of homosexual men in \"committed\" relationships found that only seven out of 156 had been sexually faithful, or 4.5 percent. The Dutch study cited above found that even homosexual men in \"steady partnerships\" had an average of eight \"casual\" sex partners per year.\n \n\n Which studies? As I said I question them with matters so personal as this. And this one even admits that they only serveyed 156 gay people. How can this be considered to represent all gays? And of course no married people cheat on their spouses.\n \n \n\n So if same-sex relationships are legally recognized as \"marriage,\" the idea of marriage as a sexually exclusive and faithful relationship will be dealt a serious blow. Adding monogamy and faithfulness to the other pillars of marriage that have already fallen will have overwhelmingly negative consequences for Americans' physical and mental health.\n \n\n Are you saying that right now the idea of marriage is a sexually exclusive and faithful relationship? What about Brittney Spears' marriage that lasted less than a day? What about all these celebrity marriages that don't last long at all? And just as some heterosexuals being unfaithful not tainting the meaning of marriage, I doubt that some homosexuals would taint the meaning of marriage.\n \n \n\n So, yes, same-sex marriages will have a direct impact on heterosexual marriages and families as a whole. The impact will be a negative one, and it will be long term. Marriage and the family \"unit\" will simply become terms with little value and meaning. There will be no structure, and as a result our country's resolve will weaken. I believe that the backbone of society is the family \"unit\", and this will break the backbone of our society.\n\n So the government has the right to tell us what family \"unit\" we should live in now? Next they'll try to prevent single parents from bringing up kids. And gays can still have a family if it isn't called marriage. This hasn't broken the backbone of our society. It only hurts them if someone dies and when they need benefits from the government. They can already form a family, they just don't get the same rights as heterosexuals do and that's wrong.", 
   {}, 
   73415, 
   null, 
   1098831660.0
  ], 
  [
   73639, 
   null, 
   "pnac=ww3", 
   "Jaaaman, the only thing different between hetero and gay marriage is that state governments (except a couple) only recognize one of them. In the eyes of the couple, their \"church\", and their god (if they have one) a married couple is married despite what the govt says.\n \n The big debate is whether to legally recognize gay marriage for the purpose of inheritance rights, etc. (the financial/legal trappings of marriage). \n \n So, as we have it, gay marriage exists and doesn't affect hetero marriage one bit. Now you need to explain why granting legal/financial rights to a gay spouse will affect hetero marriages.\n \n \n .", 
   {}, 
   73630, 
   null, 
   1098833760.0
  ], 
  [
   73672, 
   null, 
   "Duo_Maxwell", 
   "am I the only one who laughs at jaaaman's rehashed posts?", 
   {}, 
   73639, 
   null, 
   1098842760.0
  ], 
  [
   73696, 
   null, 
   "joebrummer", 
   "am I the only one who laughs at jaaaman's rehashed posts?\n\n \n \n \n I laugh until I realize how many people could be misguided by them. When you look at those reading different threads on this board I realize many may not participate in the debate, but they read it. It is important to refute his rubbish for what it is....agenda driven right wing ****!", 
   {}, 
   73672, 
   null, 
   1098853500.0
  ], 
  [
   74410, 
   null, 
   "Tboy321025", 
   "The benifits from Gay Marriage are beyond the point, in my mind. I feel that no one has the right to tell anyone that they can't get married, dispite the sexual preference.", 
   {}, 
   73696, 
   null, 
   1099186140.0
  ], 
  [
   74424, 
   null, 
   "Dzeron", 
   "So, yes, same-sex marriages will have a direct impact on heterosexual marriages and families as a whole. The impact will be a negative one, and it will be long term. Marriage and the family \"unit\" will simply become terms with little value and meaning. There will be no structure, and as a result our country's resolve will weaken. I believe that the backbone of society is the family \"unit\", and this will break the backbone of our society.\n \n \n It all depends on priorities. I believe our country should prioritize liberty over family, and that is the crux of gay marriage support. Some have argued that the family will inevitably be destroyed as the march of liberty progresses. If that happens, so what? Liberty is more important IMO.\n \n The whole conservative argument rests on the premise that family is more important than liberty, which is blatantly un-patriotic and traitorous to American ideals.", 
   {}, 
   74410, 
   null, 
   1099197960.0
  ], 
  [
   74498, 
   null, 
   "JustineCredible", 
   "What harm will come to society from the marriage of gays?\n \n \n \n The most significant impact of legally recognizing same-sex unions would be more indirect. Expanding the definition of what \"marriage\" is to include relationships of a homosexual nature would inevitably, in the long run, change people's concept of what marriage is, what it requires, and what one should expect from it. These changes in the popular understanding of marriage would, in turn, change people's behavior both before and during marriage.\n\n \n Actually people's concept of what a marriage is changes along with societal roles. It's a natural progression, an evolution of sorts. As the roles of parents, partners and the elderly change in society so does the concept of what makes a marriage. It's completely normal and natural. Get a grip. \n \n \n \nSame-sex marriage will open wide the door to homosexual adoption, which will simply lead to more children suffering the negative consequences of growing up without both a mother and a father.\n\n \n Actually many states already allow same-sex couples to adopt. Jaaaman! GET WITH THE PROGRAM HERE! WAKE UP!\n The American Pediactrics Association has already put out at least one study showing that children suffer NO Ill effects of being raised in same gender parental homes versus opposite gender parental homes. The ONLY people who put undo expectations on children raise in same gender homes are those who simply propagate hate and misinformation. \n \n Now you want to talk about negitive effects of not having a mother or a father, try single parent homes where one or the other has LEFT the famial unit! Those are the kids who really suffer. \n \n \n \nAmong homosexual men in particular, casual sex, rather than committed relationships, is the rule and not the exception. And even when they do enter into a more committed relationship, it is usually of relatively short duration. For example, a study of homosexual men in the Netherlands (the first country in the world to legalize \"marriage\" for same-sex couples), published in the journal AIDS in 2003, found that the average length of \"steady partnerships\" was not more than 2 < years (Maria Xiridou et al., in AIDS 2003, 17:1029-1038).\n\n \n Ya know, studies done in the Netherlands really has little concequence in the United States. \n \n \nIn addition, studies have shown that even homosexual men who are in \"committed\" relationships are not sexually faithful to each other. While infidelity among heterosexuals is much too common, it does not begin to compare to the rates among homosexual men. The 1994 National Health and Social Life Survey, which remains the most comprehensive study of Americans' sexual practices ever undertaken, found that 75 percent of married men and 90 percent of married women had been sexually faithful to their spouse. On the other hand, a major study of homosexual men in \"committed\" relationships found that only seven out of 156 had been sexually faithful, or 4.5 percent. The Dutch study cited above found that even homosexual men in \"steady partnerships\" had an average of eight \"casual\" sex partners per year.\n\n \n Do you know what that says to me? It says we, as a society are to blame! We don't ENCOURAGE long term homosexual relationships in any kind of healthy or sociologically acceptable light. Seems to me if we promoted more healthy relationships between couples, regardless of gender everyone would be happier for it! \n DUH! \n \n \n \nSo if same-sex relationships are legally recognized as \"marriage,\" the idea of marriage as a sexually exclusive and faithful relationship will be dealt a serious blow. Adding monogamy and faithfulness to the other pillars of marriage that have already fallen will have overwhelmingly negative consequences for Americans' physical and mental health.\n\n \n Again Jaaaman, WAKE UP TO THE REALITY!!! Fidelity and Monogamy are ALREADY Falling by the wayside! IN ALL FORMS OF RELATIONSHIPS!\n \n You're only going to do more damage by DELIGITIMIZING same sex couples. \n \n My grandmother used to always say; \"You catch more flies with honey...\" \n Your words of hate and fear is the vinegar in the apple sause darling. Too much and you only make it go sour. \n \n \nSo, yes, same-sex marriages will have a direct impact on heterosexual marriages and families as a whole. The impact will be a negative one, and it will be long term. Marriage and the family \"unit\" will simply become terms with little value and meaning. There will be no structure, and as a result our country's resolve will weaken. I believe that the backbone of society is the family \"unit\", and this will break the backbone of our society.\n\n \n The backbone is already broken. The more you put same sex couples on the \"outs\" the more you do damage to ALL couples and families. \n Children are already growing up without mothers and/or fathers of HETEROSEXUAL parents. Children are already growing up healthy and happy in same sex parented homes. So why turn a good thing bad? \n Personally I just don't get it.\n I may not agree with some families traditions, but that doesn't mean I'm going to join any kind of campaign against them. I choose to not include what I don't agree with in my family's traditions. \n \n Just because I'm not Jewish doesn't mean I'm going to start a campaign to do away with Sabath on Fridays! Just because I'm not Catholic doesn't mean I'm going to start any campaign against Latin Masses. \n You're excuses for joining the campaign against same sex marriages is exactly that. It's a campaign in an attempt to outlaw a tradition you don't participate in. \n \n WHO CARES? !", 
   {}, 
   73415, 
   null, 
   1099260360.0
  ], 
  [
   75710, 
   null, 
   "spevacek", 
   "What harm will come to society from the marriage of gays?\n\n \n Exactly. I'd like to know that myself. Since when has God promoted discrimination?", 
   {}, 
   73415, 
   null, 
   1099695480.0
  ], 
  [
   75770, 
   null, 
   "Dzeron", 
   "Exactly. I'd like to know that myself. Since when has God promoted discrimination?\n\n \n Dude, it's, like, all over the Bible, man! Maybe if you hit your forehead with Bibles more often, you would know these things!", 
   {}, 
   75710, 
   null, 
   1099711440.0
  ], 
  [
   75772, 
   null, 
   "spevacek", 
   "Dude, it's, like, all over the Bible, man! Maybe if you hit your forehead with Bibles more often, you would know these things!\n\n \n On one note, I would appreciate it if you did not call me a man. On another note, no specific sermon or story that Jesus may have given about specific homosexual behavior is found in Scripture. I hardly believe God cares the sex of whom you love.", 
   {}, 
   75770, 
   null, 
   1099711620.0
  ], 
  [
   75776, 
   null, 
   "Dzeron", 
   "On one note, I would appreciate it if you did not call me a man. On another note, no specific sermon or story that Jesus may have given about specific homosexual behavior is found in Scripture. I hardly believe God cares the sex of whom you love.\n\n \n I think there's a story about a city called Sadom (sp?) that was filled with homosexuals, and God got mad and destoyed it by turning it into salt or something.", 
   {}, 
   75772, 
   null, 
   1099711860.0
  ], 
  [
   75804, 
   null, 
   "joebrummer", 
   "I think there's a story about a city called Sadom (sp?) that was filled with homosexuals, and God got mad and destoyed it by turning it into salt or something.\n\n \n \n \n too funny! Really, This is a joke and very funny for those of you that don't get it!", 
   {}, 
   75776, 
   null, 
   1099721100.0
  ], 
  [
   75846, 
   null, 
   "wsm2506", 
   "Dude, it's, like, all over the Bible, man! Maybe if you hit your forehead with Bibles more often, you would know these things!\n\n \n I think maybe you have hit yourself in the head with the Bible a few times too often.", 
   {}, 
   75770, 
   null, 
   1099757820.0
  ], 
  [
   75877, 
   null, 
   "Dzeron", 
   "I think maybe you have hit yourself in the head with the Bible a few times too often.\n\n \n I was being sarcastic.", 
   {}, 
   75846, 
   null, 
   1099773420.0
  ], 
  [
   75885, 
   null, 
   "joebrummer", 
   "I was being sarcastic.\n\n We know, we have seen your posts enough to know what side you are on, I liked the joke myself!", 
   {}, 
   75877, 
   null, 
   1099778760.0
  ], 
  [
   75910, 
   null, 
   "JustineCredible", 
   "We know, we have seen your posts enough to know what side you are on, I liked the joke myself!\n\n \n \n Of course I'm getting visuals of Monty Python here! emoticon_xgood\n \n I'm sure some of you can probably guess what crossed my mind when my ex-in-laws told me of my ex-spouse and his wife's newest arrival. (...note this now makes sybling #7, for my son!)\n \n ~~~Randon verses of \"Every Sperm\"~~~", 
   {}, 
   75885, 
   null, 
   1099796280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What harm will come to society from the marriage of gays?", 
  "url": "http://www.4forums.com/political/gay-rights-debates/3525-what-harm-will-come-society-marriage-gays.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 3525, 
  "discussion_files": [
   [
    "2446.html", 
    "http://www.4forums.com/political/gay-rights-debates/3525-what-harm-will-come-society-marriage-gays-print.html"
   ], 
   [
    "2447.html", 
    "http://www.4forums.com/political/gay-rights-debates/3525-what-harm-will-come-society-marriage-gays-2-print.html"
   ]
  ], 
  "identifier": 3525
 }
]