[
 [
  [
   73465, 
   null, 
   "jim's trucking", 
   "He knew we'd find the truth!\n \n http://insider.washingtontimes.com/articles/normal.php?StoryID=20041025-094455-2414r\n \n October 26, 2004\n \n TODAY'S EDITORIAL\n Kerry's phantom meeting\n From the Editorials/Op-Ed section\n \n \n John Kerry has called truthfulness \"the fundamental test of leadership.\" He told National Guard veterans last month, \"As president, I will always be straight with you -- on the good days and the bad days.\" He has repeatedly said President Bush fails the test, especially when it comes to foreign policy. All the richer, then, is yesterday's revelation that, for political purposes, Mr. Kerry fabricated a meeting with the \"entire\" U.N. Security Council in October 2002 just before the United Nations voted to authorize the use of force in Iraq. \n As Joel Mowbray reported in the Washington Times yesterday, of the 15 ambassadors who sat on the council in 2002, four say they have never even met Mr. Kerry. Neither has their staff. Mr. Kerry met individually with the French, Singaporean and Cameroon delegates, Mr. Mowbray confirmed. But no all-encompassing meeting with Security Council members ever took place the way Mr. Kerry said it did. \n For more than a year, the phantom meeting had been a useful cudgel for Mr. Kerry's attacks on the president. Speaking before the Council on Foreign Relations in December 2003, Mr. Kerry said he had met \"with the entire Security Council, and we spent a couple of hours talking about what they saw as the path to a united front in order to be able to deal with Saddam Hussein.\" In the second presidential debate, Mr. Kerry again trotted out the meeting to argue that \"this president hasn't listened ... I went to meet with the members of the Security Council in the week before we voted. I went to New York. I talked to all of them.\" \n But that turns out not to be true. Kerry spokesmen entered into spin mode over the weekend, backtracking from the above statements with the assertion that Mr. Kerry \"met with a group of representatives of countries sitting on the Security Council.\" But even this seems dubious. \"We were as surprised as anyone when Kerry started talking about a meeting with the Security Council,\" one U.S. diplomat told Mr. Mowbray. Another said on condition of anonymity that Mr. Kerry met with \"a few\" of the ambassadors. \n In all likelihood the reality is that Mr. Kerry chose to trump up the importance of piecemeal meetings with a few delegates as part of his effort to cast the president as disdainful of allies and hasteful as commander in chief. Mr. Kerry had wanted to make himself appear the better on both accounts. It helps, of course, if the acts of diplomatic finesse one ascribes to one's self actually took place. Just as it helps to have a truthful record when trying to cast an opponent as a deceiver. Clearly, Mr. Kerry has some explaining to do.", 
   {
    "post_info": {
     "post_title": "Why would Kerry lie about this?"
    }
   }, 
   null, 
   null, 
   1098802980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why would Kerry lie about this?", 
  "url": "http://www.4forums.com/political/politics-debates/3528-why-would-kerry-lie-about.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3528, 
  "discussion_files": [
   [
    "4707.html", 
    "http://www.4forums.com/political/politics-debates/3528-why-would-kerry-lie-about-print.html"
   ]
  ], 
  "identifier": 3528
 }
]