[
 [
  [
   73585, 
   null, 
   "Jaaaman", 
   "This is an opinion piece: \n \n Why I oppose John Kerry, and why I support George Bush.\n \n Primarily, I don't trust John Kerry, and I never have. He's spent most of his Senate career carrying Ted Kennedy's water and regularly competes with Kennedy for the most liberal voting record -- a contest he won last year, according to the National Journal. He rarely writes legislation, preferring to follow rather than to lead. He's been mostly a non-entity for the past 19 years. \n \n His sudden aspiration for the Presidency hasn't brought out any coherent philosophy of governing, either, except to continually state over and over that he would be the Anti-Bush. For example, he's continually carped over and over that Bush \"lied\" to him when Kerry voted for military action in Iraq, and derided Bush's attempts to gather UN support for an ultimatum to Saddam Hussein (which he spent five months negotiating before finally giving up on France and Russia). However, as soon as Haiti popped up, Kerry derides Bush for taking five days to get a UN resolution creating the multinational force that Kerry insisted Bush should have waited for in Iraq!\n \n Kerry (D-Mass.) said he would have sent troops to Haiti even without international support to quell the revolt against President Jean-Bertrand Aristide. \"President Kerry would never have allowed that to get where it is,\" Kerry said, though he added he's not \"a big Aristide fan.\" (via Tim Blair)\n This is part of a pattern of equivocations by a completely reactive Kerry, who keeps playing both sides of every argument. He voted against action to expel Iraq in 1991 and later claimed he supported it in concept but felt the timing wasn't right. In 2002 he voted for military action, and spent all of the latter half of 2003 claiming he opposed the war. He has made a great deal out of his support for the troops in Iraq and his determination to keep America secure, but was one of only 14 Senators to vote against the spending appropriation to keep the troops supplied. \n \n During the campaign, he has repeatedly thundered about his staunch opposition to \"special interests\", famously saying in Iowa that he was coming, they were going, and don't let the door hit them on the way out. But Kerry's own record demonstrates his hypocrisy, as he has gone way out of his way to use his influence to benefit his contributors. In one instance, he personally wrote 28 letters on behalf of a company that made several thousand dollars in illegal contributions to his 1996 re-election campaign. In another, he used his influence on the SEC to arrange a meeting for a contributor's friend -- who turned out to be a Chinese spy. Kerry's raged about Benedict Arnold CEOs who move their corporations offshore for tax shelters and send jobs overseas, but then has received more than half a million dollars from the same CEOs he excoriates. That's not counting his wife's fortune, which relies on a company that locates most of their manufacturing facilities overseas.\n \n In short, Kerry is Clinton without the charm. He doesn't just attempt to triangulate his opponents -- he triangulates himself. Someone who twists himself into these kinds of pretzels isn't the kind of man who will stand up to the challenges that face this country. Not to say that he's a coward, but that he won't lead; instead, he'll take polls and follow the political winds of the moment, which is what leaders without vision do.\n \n Which brings me to why I support George Bush. He's not the most accomplished politician, and in 2000 I was a McCain supporter. I've been a Republican for most of my life, except a short period when I registered Libertarian. My social philosophy doesn't match up well with Bush; I'm a laissez-faire man for both economics and social issues. I think that the government which governs and spends least governs best, and we got precious little of that philosophy so far in the Bush Administration. However, on the most pressing issue not of this time, not of the past couple of years, but over the past three decades, Bush grasps the issue completely: the rise of Islamofascistic terror and its targeting of America and Americans. \n \n Starting in 1979 with the sacking of our embassy in Teheran, Islamofascism has pressed its attack against the \"Great Satan\" in a number of ways -- and successive American administrations have retreated in the face of it, both Republican and Democrat. Starting with Carter's paralysis in the face of a clear act of war, proceeding through our retreat from Beirut, negotiating for hostages in Lebanon, the shameful bug-out in Somalia, and our complete failure to respond in any meaningful way to the attacks on our African embassies and the USS Cole, American Presidents have continually communicated that we were less interested in protecting our assets than in covering our ***. For instance, shortly after taking office, Clinton discovered an Iraqi plot to assassinate former President G.H.W. Bush. That is an act of war, and Saddam only held power due to a cease-fire that he already was continually violating. Instead of taking decisive action, Clinton followed his polls and tossed a few missiles at Baghdad, solving and resolving absolutely nothing. The lesson we taught our enemies -- and that is what they are -- was that we would not risk anything to protect ourselves and our interests, that we were paper tigers who would not risk open war in case an American got hurt.\n \n After 9/11, the rest of the country realized we were at war, but I don't think it's really settled in that we've been at war for 25 years against Islamist terror. But George Bush got it. He understood that we weren't dealing with a law-enforcement problem. Serious people wanted to kill Americans by the thousands, by the millions if possible, and they were being funded and sheltered by hostile governments. Bush also understood that in order to beat those dictatorships and kleptocracies, America would have to create a new reality on the ground in Islamofascism's breeding ground. That's why Phase I was Afghanistan -- to specifically go after al-Qaeda -- but Phase II had to be Iraq. A good portion of our military in the area was already pinned down there, enforcing a sanctions regime that had already become riddled with holes, and provided yet another example of American and UN vacillation in the face of provocation.\n \n The Democrats, with the notable and honorable exceptions of Joe Lieberman and Dick Gephardt, fail to understand the lessons of the last 25 years, and in John Kerry's words, continue to see terrorism as a law-enforcement issue. Ironically, even the one law-enforcement approach all of them supported, the Patriot Act (which passed in the Senate 95-1, with Kerry and Edwards voting yes), they have spent the last year vilifying when even Joe Biden, Ed Koch, and Dianne Feinstein called such criticism unwarranted. The problem with using a law-enforcement model is that law enforcement takes place after a crime has been committed. We arrested a dozen or so people after the World Trade Center bombing in 1993 even though we had intelligence that other governments and terror networks were involved, got our convictions, and stuck them in prison. How effective was that? Take a look at the New York skyline and see for yourself.\n \n Finally, instead of campaigning on issues and his record, Kerry has missed no chance to make this campaign personal. He started by explaining his law-and-order philosophy as \"John Ashcroft won't be the Attorney General\" and explicitly equating Bush's Guard service with draft dodging and implying it was morally inferior to it, egged on by his party's national chairman. Every time his voting record in the Senate comes up for discussion, he hides behind Max Cleland and cries about attacks on his patriotism. He throws his fine service record around on the campaign trail but insists that discussing his politics on his return -- which he played out on a national stage -- is nothing but \"dirty politics\". \n \n George Bush has his flaws, no doubt; everyone does, including (and especially) me. John Kerry has his virtues. But when it comes to securing the United States and creating a better world, I'm going to vote with the man who liberated 50 million people in the Middle East and got Moammar Gaddafi to knuckle under. I'm going to vote for the man who finally resolved the 12-year quagmire of Iraq and the multibillion-dollar drain it represented on our military. I'm going to vote for the man who woke up on 9/11 and saw the danger that our country and the Western world faces, and who has remained consistent in his determination to fight and beat that danger regardless of the polls and the calls for appeasement from weak and corrupt allies.\n \n \n http://www.captainsquartersblog.com/mt/archives/001075.php", 
   {
    "post_info": {
     "post_title": "Why I oppose John Kerry, and why I support George Bush"
    }
   }, 
   null, 
   null, 
   1098825660.0
  ], 
  [
   74046, 
   null, 
   "Pro-Bush", 
   "Well...i'm 16 years old so i'm too young to vote for bush but i must say..nice post... perhaps the best one i've ever seen..thanks for supporting our president and I hope he wins...\n AMEN..", 
   {
    "post_info": {
     "post_title": "well said."
    }
   }, 
   73585, 
   null, 
   1099011120.0
  ], 
  [
   74061, 
   null, 
   "pnac=ww3", 
   "Well...i'm 16 years old so i'm too young to vote for bush but i must say..nice post... perhaps the best one i've ever seen..thanks for supporting our president and I hope he wins...\n AMEN..\n\n \n Can you explain why you support Bush?\n If you could limit your answer to discussion of his policies and not his personality (which sucks) that would be nice.\n \n .", 
   {}, 
   74046, 
   null, 
   1099016400.0
  ], 
  [
   74062, 
   null, 
   "Dono", 
   "Quote:\"I'm going to vote for the man who finally resolved the 12-year quagmire of Iraq and the multibillion-dollar drain it represented on our military.\"\n \n I read your post with interest and was not going to respond since the content has been covered in other posts, but the quoted statement cries for some explanation. We agree on the characterization of Iraq as a \"quagmire\", but to call it \"resolved\" boggles the mind. The Administration just announced it would ask for another $70 billion, bringing the total in Iraq/Afgan to over $217 billion and counting, with no end projected or in sight.That \"drain\" is sucking up money and people daily. Resolved, I think not.\n Dono", 
   {}, 
   74046, 
   null, 
   1099016580.0
  ], 
  [
   74077, 
   null, 
   "joebrummer", 
   "Quote:\"I'm going to vote for the man who finally resolved the 12-year quagmire of Iraq and the multibillion-dollar drain it represented on our military.\"\n \n I read your post with interest and was not going to respond since the content has been covered in other posts, but the quoted statement cries for some explanation. We agree on the characterization of Iraq as a \"quagmire\", but to call it \"resolved\" boggles the mind. The Administration just announced it would ask for another $70 billion, bringing the total in Iraq/Afgan to over $217 billion and counting, with no end projected or in sight.That \"drain\" is sucking up money and people daily. Resolved, I think not.\n Dono\n\n And as a note: the money spent in Iraq is our money. The tax payer. Bush is going to ask for the 70 million, but keep in mind it is tax payer money. Could we spend our money better by securing our borders and national security. Who cares what those folks \"out there\" do. Lets keep us safe. Spend the money on \"FASTER\" airport security and lets keep the Terrorist out. Let those in the middle east kill each other while we, the Americans remain safe here at home, dealing with our own issues.\n \n Just a thought", 
   {}, 
   74062, 
   null, 
   1099022520.0
  ], 
  [
   74101, 
   null, 
   "Duo_Maxwell", 
   "before I basically annihilate Jaaaman's misguided article, let's examine the constantly used, and very false claim of Libya's weapons and Bush's Iraqi invasion. \n \n Libya started work on their nuclear weapons quite some time ago, enough so that they have a major project by the time the late 1990s came around. Due to the sanctions placed on them in the 80s, they were deserpately losing billions in annual revenue. During the late 1990s, they offered to give up their weapons programs to the British numerous times. Libya hadn't suddenly changed it's mind about WMD because of Iraq, they showed they were willing to give up their programs long before 2001 came about. Also, with the spike in oil prices prior to the war, Libya was losing even more then it was accustomed to. With rising birth rates across Africa, and decreasing income, Libya had essentially little choice. Coupled with the basic economic principal that suppliers bring as much product as they can when the price is high, Libya made the correct economic choice in giving up it's programs, droping the sanuctions and bringing in the revenue they deserpately needed. Quaddafi may be radical at times, but he's no idiot. Even still, Libya gave it's program up to BRITAIN, NOT the US. Britain's negitotator even had the sideline the US rep to get Libya to give up it's programs.", 
   {}, 
   74077, 
   null, 
   1099027860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why I oppose John Kerry, and why I support George Bush", 
  "url": "http://www.4forums.com/political/politics-debates/3537-why-i-oppose-john-kerry-why-i-support-george-bush.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3537, 
  "discussion_files": [
   [
    "26442.html", 
    "http://www.4forums.com/political/politics-debates/3537-why-i-oppose-john-kerry-why-i-support-george-bush-print.html"
   ]
  ], 
  "identifier": 3537
 }
]