[
 [
  [
   74298, 
   null, 
   "Dzeron", 
   "Alright, I'm quoting these from memory, so I might not have the exact wording.\n \n Bush:\n \"Marriage ought to be encouraged.\"\n \n Talk about the antithesis of the marriage penalty! I'm afraid that Bush is going to enact laws that punish individuated \"single\" people. Getting rid of the marriage penalty (if it truly exists) is fine, but forcing people to get married is tyrannical (and typical of a conservative.)\n \n Kerry:\n \"I won't directly force my religion on the people.\"\n \n Now why does he have to insert the word \"directly\" in there? So he can say that he never promised not to \"indirectly\" force it on us? Being a non-catholic, I'm really scared now.\n \n Has anyone else heard any other scary quotes from the candidates? (I remember that Bush said something really scary a long time ago, but I can't recall it off the top of my head.)", 
   {
    "post_info": {
     "post_title": "Two Scary Quotes from the Debates!  Aaah!"
    }
   }, 
   null, 
   null, 
   1099108620.0
  ], 
  [
   74311, 
   null, 
   "Dono", 
   "Should I print out those statements and hang them on my door for Halloween? Will they frighten the children? Or are you just picking some nit?\n To be frightened by a statement, you have to assume it has some validity, and since both the parties are politicians I find that hard to do. I do, however, find some amusement in the candidates statements. Bush saying he can't remember a mistake he has made in the last four years except maybe some appointments (I'd be happy to fax him a list). Kerry saying he will halve the deficit in five years while tauting programs that will make that impossible. One thing that does scare me is that in this great nation, these two are the best we can come up with to lead us ..... now that's scary.\n Dono", 
   {}, 
   74298, 
   null, 
   1099115640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Two Scary Quotes from the Debates!  Aaah!", 
  "url": "http://www.4forums.com/political/politics-debates/3569-two-scary-quotes-debates-aaah.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3569, 
  "discussion_files": [
   [
    "20750.html", 
    "http://www.4forums.com/political/politics-debates/3569-two-scary-quotes-debates-aaah-print.html"
   ]
  ], 
  "identifier": 3569
 }
]