[
 [
  [
   74450, 
   null, 
   "Duo_Maxwell", 
   "Lately, or since the start, a sizable portion of people here don;t use facts, thus leading to the question. are facts important?", 
   {
    "post_info": {
     "post_title": "Are facts important?"
    }
   }, 
   null, 
   null, 
   1099208100.0
  ], 
  [
   74453, 
   null, 
   "joebrummer", 
   "Lately, or since the start, a sizable portion of people here don;t use facts, thus leading to the question. are facts important?\n\n \n \n Personally, I try to always back up my facts when I have the energy and when they are availbale. YES, fatcs are important. In some debates more than others. In the gay rights form, the creation vs. evolution forum and politics (if you can find facts in politics). Facts are imporstant.", 
   {}, 
   74450, 
   null, 
   1099210020.0
  ], 
  [
   264469, 
   null, 
   "BITTERsweetLIFE", 
   " are facts important?\n\n \n \n \n im also confuse about that.\n \n correct me if im wrong.. but facts are facts and no one could question that. so to use it in a debate, would it actually help build a debate? a debate as in arguements of two points? cause what i noticed is that both sides are presenting facts so it turns out to be a battle-of-facts and no longer views. meaning there's no more point of debating because facts are already there and what they're battling, in reality, is already the credibility of each's sources. \n \n i am not a pro in debates but some how i have an idea about it because i used to be a member of a debate club. and in our debates what we use are not really facts because we always end up in questioning the sources which i don't think makes up a good debate. \n \n \n help me clarify these, please.", 
   {
    "post_info": {
     "post_title": "help me."
    }
   }, 
   74450, 
   null, 
   1179991620.0
  ], 
  [
   264471, 
   null, 
   "obvious_child", 
   "If debates are about convincing a audience that a specific viewpoint is correct, or at least the opposing is false or had serious doubts, then facts are indeed irrelevant. \n \n It is merely about who is more convincing. Every lawyer knows this by heart.\n \n If debates are about convincing your opponent that you are right, then it depends on your opponent. People like Ez rider and Arch refuse to accept anything they do not like. Mountains of facts are completely irrelevant in such a debate. To convince them would require either mind control or a act of God. For reasonable people, facts are important as they produce a foundation for which compelling arguments can be made. More importantly, it is how one presents such facts more then what facts they actually use. One could use every fact in the book but present a front so hostile that no one listens. They're right, but they have failed.", 
   {}, 
   264469, 
   null, 
   1179996000.0
  ], 
  [
   265199, 
   null, 
   "Jill White", 
   "Are facts important?\n \n Ask any religious person to provide facts to support their argument and you get a steady stream biblical sounding poop.\n \n I say we give them a taste of there own medicine and be irrational too!\n \n Seriously, yes facts are important but the lack of them in many instances seams irrelevant.", 
   {}, 
   264471, 
   null, 
   1180410900.0
  ], 
  [
   265228, 
   null, 
   "Winston Smith", 
   "If debates are about convincing a audience that a specific viewpoint is correct, or at least the opposing is false or had serious doubts, then facts are indeed irrelevant. \n \n It is merely about who is more convincing. Every lawyer knows this by heart.\n \n If debates are about convincing your opponent that you are right, then it depends on your opponent. People like Ez rider and Arch refuse to accept anything they do not like. Mountains of facts are completely irrelevant in such a debate. To convince them would require either mind control or a act of God. For reasonable people, facts are important as they produce a foundation for which compelling arguments can be made. More importantly, it is how one presents such facts more then what facts they actually use. One could use every fact in the book but present a front so hostile that no one listens. They're right, but they have failed.\n\n \n \n \n Debates are not about convincing your opponent you are righ,t but the judges or the audience.\n \n When it comes to a trial by jury, facts are important more so than the rhetorical skills of the lawyers. I gave been empanelled twice and the most influential person seemed to be the self appointed leader of the jury, who tried to force everybody else to see it his way.\n Once this woman refused to found the accused guilty \" for he was so young, and she felt sorry for him\".\n To me facts are important, no matter what. If I weren't I would be then another archangel: a fundamentalist who not only believes in The Bible in a literal sense but also in the existence of dragons, maybe because of Saint George?", 
   {
    "post_info": {
     "post_title": "believe it or not"
    }, 
    "unicode_changes_made": true
   }, 
   264471, 
   null, 
   1180439580.0
  ], 
  [
   265327, 
   null, 
   "Jill White", 
   "Debates are not about convincing your opponent you are righ,t but the judges or the audience.\n\n \n In Being Persuasive he is arguing for the other side.", 
   {}, 
   265228, 
   null, 
   1180475220.0
  ], 
  [
   266538, 
   null, 
   "obvious_child", 
   "Debates are not about convincing your opponent you are righ,t but the judges or the audience.\n\n \n Exactly why persuasiveness is more important then facts. The Glish Glop is one of these tactics that completely ignores the usage of facts. \n \n \n\n To me facts are important, no matter what. If I weren't I would be then another archangel: a fundamentalist who not only believes in The Bible in a literal sense but also in the existence of dragons, maybe because of Saint George?\n\n \n Then it depends more upon what your audience's stance is more then whether facts are important or not? \n \n I just saw a post by our dear associate AA where he completely ignored the facts of Muslim states on Homosexuality making up things left and right without any research whatever.", 
   {
    "unicode_changes_made": true
   }, 
   265228, 
   null, 
   1180939200.0
  ], 
  [
   267599, 
   null, 
   "livstyle", 
   "not really, how else do you explain good debaters being able to debate both sides of an issue? They just use the facts they have to their advantage, but it's the persuasiveness that sets the good from the bad.", 
   {}, 
   266538, 
   null, 
   1181361060.0
  ], 
  [
   282142, 
   null, 
   "minhan", 
   "This guide helps... alot!! lol", 
   {
    "post_info": {
     "post_title": "Cool... thx"
    }
   }, 
   267599, 
   null, 
   1188898140.0
  ], 
  [
   287892, 
   null, 
   "jerseygirl", 
   "I personally feel that facts are important to any discussion and or debate. If another source validates your statements and helps to draw a logical conclusion(s), then I would say that facts are a necessary evil. I say evil becuase when you're quoting another source, you have to ask yourself how reliable is this information? It sometimes leads you to another source and then another, which could be frustrating. \n \n In the case of a trial, facts are absolutely important as are definitions and interpretations of the law. \n \n For those people who are not using facts to vaildate their points. . .What do you think is the cause?", 
   {
    "post_info": {
     "post_title": "You can count on it!"
    }
   }, 
   282142, 
   null, 
   1192481640.0
  ], 
  [
   287920, 
   null, 
   "Winston Smith", 
   "Exactly why persuasiveness is more important then facts. The Glish Glop is one of these tactics that completely ignores the usage of facts. \n \n \n \n Then it depends more upon what your audience's stance is more then whether facts are important or not? \n \n I just saw a post by our dear associate AA where he completely ignored the facts of Muslim states on Homosexuality making up things left and right without any research whatever.\n\n \n well, AA is a believer, he believes even in the existence of dragons so facts or the lack of them never get in his way", 
   {}, 
   266538, 
   null, 
   1192496100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Are facts important?", 
  "url": "http://www.4forums.com/political/debating-techniques-styles/3577-facts-important.html", 
  "breadcrumbs": [
   "Debating Techniques and Styles"
  ], 
  "id_number": 3577, 
  "discussion_files": [
   [
    "1212.html", 
    "http://www.4forums.com/political/debating-techniques-styles/3577-facts-important-print.html"
   ]
  ], 
  "identifier": 3577
 }
]