[
 [
  [
   74471, 
   null, 
   "stormboy", 
   "The word of GOD is a road map to GOD, and its only when we find ourselves in GOD can we translate the word!\n Without GOD the word is a dead letter, even as a christian we can still find ourselves reading the word without being in GOD.", 
   {
    "post_info": {
     "post_title": "The word of GOD is a road map that leads to GOD"
    }
   }, 
   null, 
   null, 
   1099233360.0
  ], 
  [
   74524, 
   null, 
   "Duo_Maxwell", 
   "how do you know that the bible, or any holy book is actually the word of God?", 
   {}, 
   74471, 
   null, 
   1099284480.0
  ], 
  [
   74559, 
   null, 
   "Big Orn", 
   "The word of GOD is a road map to GOD, and its only when we find ourselves in GOD can we translate the word!\n Without GOD the word is a dead letter, even as a christian we can still find ourselves reading the word without being in GOD.\n\n Good point, stormboy. That statement, as simple as it sounds, is the key. However, it&#8217;s like hauling hay in the middle of summer for some folks, and for others, a walk in the park. What separates the two mindsets? What causes one person to dread it and the other to cheerfully welcome it? I think belief is the main factor. But, how can one acquire belief just for the purpose of discovery? Even for just a glimpse? For meager consideration?\n \n Prayer works for everyone and is indiscriminate.", 
   {}, 
   74524, 
   null, 
   1099328100.0
  ], 
  [
   74568, 
   null, 
   "joebrummer", 
   "if the word of god (meaning the bible) is a road map to anywhere, you would get lost with all the contradictions, mixed messges, and various interpretations. All the different denominations would be like back seat drivers telling you which way to turn at the next traffic light. Neat metaphor though.", 
   {}, 
   74559, 
   null, 
   1099331580.0
  ], 
  [
   74765, 
   null, 
   "stormboy", 
   "how do you know that the bible, or any holy book is actually the word of God?\n\n Because it led me to God, now i have the LORD in my heart!. He has changed my life!!!!!!!!!!!!!\n STORMY emoticon_cool", 
   {}, 
   74524, 
   null, 
   1099399980.0
  ], 
  [
   74766, 
   null, 
   "stormboy", 
   "if the word of god (meaning the bible) is a road map to anywhere, you would get lost with all the contradictions, mixed messges, and various interpretations. All the different denominations would be like back seat drivers telling you which way to turn at the next traffic light. Neat metaphor though.\n\n The very basis of the Gospel message with in the whole text of the word can only lead us to the saviour and LORD JESUS!!. And from this foundation of being in the LORD the word begins to lose its contradictions. It is only when the word is a dead letter that it contradicts (reading the word with out his holy spirit), But when we are reading the word through the eyes of the holy spirit does this word turn from a dead letter to a rhema word!!( the living word)\n STORMY emoticon_cool", 
   {}, 
   74568, 
   null, 
   1099400280.0
  ], 
  [
   74776, 
   null, 
   "joebrummer", 
   "The very basis of the Gospel message with in the whole text of the word can only lead us to the saviour and LORD JESUS!!. And from this foundation of being in the LORD the word begins to lose its contradictions. It is only when the word is a dead letter that it contradicts (reading the word with out his holy spirit), But when we are reading the word through the eyes of the holy spirit does this word turn from a dead letter to a rhema word!!( the living word)\n STORMY emoticon_cool\n\n \n \n And only when we listen to pink floyd while smoking a joint does it become true acid rock! Sounds like a cop out to ignore the contradiction, different interpretations and many denominations. Nothing loses it's contradictions if it says one thing in one place and a contradicitve thing somewhere else, no amount of anything can change the fact it is a contradiction.", 
   {}, 
   74766, 
   null, 
   1099410840.0
  ], 
  [
   74778, 
   null, 
   "Big Orn", 
   "Nothing loses it's contradictions if it says one thing in one place and a contradicitve thing somewhere else, no amount of anything can change the fact it is a contradiction.\n\n Or, more appropriately: Nothing in the natural world.\n \n It would be better to take a contradiction, point it out, and then debate it instead of wrapping them all together.\n \n Billsco is good at that. Maybe you can recruit him to make your point. :)", 
   {}, 
   74776, 
   null, 
   1099412340.0
  ], 
  [
   74779, 
   null, 
   "joebrummer", 
   "Or, more appropriately: Nothing in the natural world.\n \n It would be better to take a contradiction, point it out, and then debate it instead of wrapping them all together.\n \n Billsco is good at that. Maybe you can recruit him to make your point. :)\n\n \n I didn't want to list any paticular one becuase it takes away from my argument. It is about the bible as a whole. It is not just contradictions. We are already know they are there. It is also interpretations, and denominations. By saying that the influence of the holy spirit changes what the book says or what it is, is a cop out. Does my love of a certain music change that music when I listen? No, it is the same music. The music doesn't change, I do. \n \n The bible doesn't change with the holy spirit, you do. It is the same book. you just become blind to the illogical parts. But is you needed proof of the contradictions, I will provide a general list.\n \n http://www.infidels.org/library/modern/jim_meritt/bible-contradictions.html", 
   {}, 
   74778, 
   null, 
   1099413120.0
  ], 
  [
   74781, 
   null, 
   "Big Orn", 
   "IThe bible doesn't change with the holy spirit, you do. It is the same book. you just become blind to the illogical parts. But is you needed proof of the contradictions, I will provide a general list.\n \n (website)\n\n I understand. But, those contradictions can be picked clean.\n \n Just one example (Joseph's father). Heli was mentioned because in those days it was not appropriate to list the lineage of the mother, so it was \"slipped\" in to bring about the truth.\n \n Of course, even that is debatable - even among Christians.\n \n A roadmap, also, does not tell you of the dead armadillo in the middle of the road until you actually go there and see it for yourself.\n \n I will go further, Joe - even to the stalls of horses, the good or bad God, and even to the \"who da baby daddy\" if you like. It would be time consuming, but worth it.", 
   {}, 
   74779, 
   null, 
   1099414680.0
  ], 
  [
   74782, 
   null, 
   "joebrummer", 
   "I understand. But, those contradictions can be picked clean.\n \n Just one example (Joseph's father). Heli was mentioned because in those days it was not appropriate to list the lineage of the mother, so it was \"slipped\" in to bring about the truth.\n \n Of course, even that is debatable - even among Christians.\n \n A roadmap, also, does not tell you of the dead armadillo in the middle of the road until you actually go there and see it for yourself.\n \n I will go further, Joe - even to the stalls of horses, the good or bad God, and even to the \"who da baby daddy\" if you like. It would be time consuming, but worth it.\n\n Because I don't want to loose the focus of what I said, Let me side track you to part two of my statement, \"Interpretation\". If the word (the bible) what about mixed interpretations? If you are following a map (as the analogy goes) some of the interpretations say go one way, others saygo another. How do you know which way to go without getting lost. SOme of this is based on denomination. Some churches teach different things about how the bible is interpreted. Is that not a road block to the truth? (don't worry I haven't forgotten the contradiction thing)", 
   {}, 
   74781, 
   null, 
   1099415100.0
  ], 
  [
   74783, 
   null, 
   "Big Orn", 
   "Because I don't want to loose the focus of what I said, Let me side track you to part two of my statement, \"Interpretation\". If the word (the bible) what about mixed interpretations? If you are following a map (as the analogy goes) some of the interpretations say go one way, others saygo another. How do you know which way to go without getting lost. SOme of this is based on denomination. Some churches teach different things about how the bible is interpreted. Is that not a road block to the truth? (don't worry I haven't forgotten the contradiction thing)\n\n I know I'm bad about hijacking, Joe, and I appologize to stormboy and to you, but I really hate religion in that respect - how it misleads its followers; how it corrupts the Bible and how it \"speaks\" for God. Sure, it's based on denomination and divisions. But, the fact still remains that it's up to the person to ask for help in even the most (seemingly) simple verses. I'm not going to dispute that the wording and interpretations are askew. It's evident. What I am disputing is you or I taking someone else's word for it.", 
   {}, 
   74782, 
   null, 
   1099415880.0
  ], 
  [
   74786, 
   null, 
   "joebrummer", 
   "I know I'm bad about hijacking, Joe, and I appologize to stormboy and to you, but I really hate religion in that respect - how it misleads its followers; how it corrupts the Bible and how it \"speaks\" for God. Sure, it's based on denomination and divisions. But, the fact still remains that it's up to the person to ask for help in even the most (seemingly) simple verses. I'm not going to dispute that the wording and interpretations are askew. It's evident. What I am disputing is you or I taking someone else's word for it.\n\n \n \n What is funny is we are not going to debate well with each other becuase I agree with you. I just don't like it when people use the supernatural force of the holy spirit to defend the bible. Really I find it silly. The start of this thread makes a very interesting analogy about the roadmap to god. When someone asked how do you know it the word of god, the reply says \"because it lead me to god\". That is a lame answer really. That is all it takes to convince someone that the bible is the word of god, because it made you feel better. With that logic, as soon as a drug makes someone feel than that drug must be the cure for cancer. If that is all the evidence needed. My cancer is cured. \n how do you know?\n well I feel better after taking this drug.\n so it must be the drug so I am cured, right?", 
   {}, 
   74783, 
   null, 
   1099417080.0
  ], 
  [
   74795, 
   null, 
   "Big Orn", 
   "I just don't like it when people use the supernatural force of the holy spirit to defend the bible. Really I find it silly.\n\n Sometimes that's the only way to do it. But, sometimes it's best to know when to keep one's mouth shut.", 
   {}, 
   74786, 
   null, 
   1099419900.0
  ], 
  [
   75218, 
   null, 
   "stormboy", 
   "What is funny is we are not going to debate well with each other becuase I agree with you. I just don't like it when people use the supernatural force of the holy spirit to defend the bible. Really I find it silly. The start of this thread makes a very interesting analogy about the roadmap to god. When someone asked how do you know it the word of god, the reply says \"because it lead me to god\". That is a lame answer really. That is all it takes to convince someone that the bible is the word of god, because it made you feel better. With that logic, as soon as a drug makes someone feel than that drug must be the cure for cancer. If that is all the evidence needed. My cancer is cured. \n how do you know?\n well I feel better after taking this drug.\n so it must be the drug so I am cured, right?\n\n God is the cure to the disease of sin!, he is known as the great physican.\n There is no better proof for the word of God, then meeting God himself!", 
   {}, 
   74786, 
   null, 
   1099539900.0
  ], 
  [
   76164, 
   null, 
   "montalban", 
   "God is the cure to the disease of sin!, he is known as the great physican.\n There is no better proof for the word of God, then meeting God himself!\n\n How do you know it's not a demon?", 
   {}, 
   75218, 
   null, 
   1099912440.0
  ], 
  [
   76204, 
   null, 
   "joebrummer", 
   "God is the cure to the disease of sin!, he is known as the great physican.\n There is no better proof for the word of God, then meeting God himself!\n\n \n \n Let me guess, you two had lunch last week, right? Did god have the salad or the steak? Who payed the bill?", 
   {}, 
   75218, 
   null, 
   1099930260.0
  ], 
  [
   78180, 
   null, 
   "Dzeron", 
   "There is no better proof for the word of God, then meeting God himself!\n\n \n Eu, om, what? You met him? How? Let me guess - by reading the \"word of God\" and following the road map.\n \n I'll bet that this road map will get you stuck in a roundabout!", 
   {}, 
   75218, 
   null, 
   1100932500.0
  ], 
  [
   78181, 
   null, 
   "stormboy", 
   "Eu, om, what? You met him? How? Let me guess - by reading the \"word of God\" and following the road map.\n \n I'll bet that this road map will get you stuck in a roundabout!\n\n I recieved Jesus into my life to be my Lord and saviour!. Then when the very thing that seperated me from God (sin) was washed away, i finally was able to know my creator in a personal way, and he changed my life!!!.\n I met him through a friend that told me all about my sin and Jesus.", 
   {}, 
   78180, 
   null, 
   1100935140.0
  ], 
  [
   78184, 
   null, 
   "joebrummer", 
   "I recieved Jesus into my life to be my Lord and saviour!. Then when the very thing that seperated me from God (sin) was washed away, i finally was able to know my creator in a personal way, and he changed my life!!!.\n I met him through a friend that told me all about my sin and Jesus.\n\n \n \n Did Jesus wash away your sins, or did you finally forgive yourself for being human and making mistakes in life. Feelings are not external. Nothing outside of you can \"make\" you feel anyting. So what is in you that changed you. COuldn't this same effect be reach by coming to terms with yourself in life?", 
   {}, 
   78181, 
   null, 
   1100938560.0
  ], 
  [
   281544, 
   null, 
   "DrD", 
   "Jefferson may have been onto something here. . . .\"Fix reason firmly in her seat, and call to her tribunal every fact, every opinion. Question with boldness even the existence of a god; because, if there be one, he must approve the homage of reason rather than of blind-folded fear. Do not be frightened from this inquiry by any fear of its consequences.... If it end in a belief that there is no god, you will find incitements to virtue in the comfort and pleasantness you feel in its exercise and in the love of others it will procure for you.\"-- Thomas Jefferson, to Peter Carr, 10 Aug. 1787. (original capitalization of the word god is retained per original)", 
   {}, 
   78184, 
   null, 
   1188496500.0
  ], 
  [
   281985, 
   null, 
   "thecap0", 
   "Any of you Holy Rollers want to try these on?\n \n http://dim.com/~randl/tcont.htm\n \n :xbanghead", 
   {
    "post_info": {
     "post_title": "Life is too short to live it in Tejas or in ignorance - but I repeat myself."
    }
   }, 
   281544, 
   null, 
   1188810600.0
  ], 
  [
   282256, 
   null, 
   "samiinh", 
   "Any of you Holy Rollers want to try these on?\n \n http://dim.com/~randl/tcont.htm\n \n :xbanghead\n\n \n Texas and Ignorance seem to go hand in hand.", 
   {}, 
   281985, 
   null, 
   1188955020.0
  ], 
  [
   283347, 
   null, 
   "simone", 
   "The Word of God is a roadmap to Hell.", 
   {}, 
   76164, 
   null, 
   1189536900.0
  ], 
  [
   284028, 
   null, 
   "samiinh", 
   "The Word of God is a roadmap to Hell.\n\n \n Indeed. I hold these truths to be self-evident and undeniable: all religions are man-made and self-centered (gimme prayers), self-seeking (\"eternal life\"), and self-glorifying (a shining soul). They all promise those who accept their dogmas \"life everlasting.\" They are all belief systems that deny death. All require belief in a magical transition to a paradise after death, besides believing in imaginary, invisible deities with whom they can talk directly.\n \n In a hospital, a person who believes in and talks to imaginary beings is considered mentally ill. Religious beliefs are a form of mental illness. Organized religion is the most dangerous, divisive, and destructive force in the world.", 
   {
    "unicode_changes_made": true
   }, 
   283347, 
   null, 
   1189894500.0
  ], 
  [
   284391, 
   null, 
   "Winston Smith", 
   "The Word of God is a roadmap to Hell.\n\n \n God writes?", 
   {}, 
   283347, 
   null, 
   1190100900.0
  ], 
  [
   284393, 
   null, 
   "Winston Smith", 
   "Indeed. I hold these truths to be self-evident and undeniable: all religions are man-made and self-centered (gimme prayers), self-seeking (\"eternal life\"), and self-glorifying (a shining soul). They all promise those who accept their dogmas \"life everlasting.\" They are all belief systems that deny death. All require belief in a magical transition to a paradise after death, besides believing in imaginary, invisible deities with whom they can talk directly.\n \n In a hospital, a person who believes in and talks to imaginary beings is considered mentally ill. Religious beliefs are a form of mental illness. Organized religion is the most dangerous, divisive, and destructive force in the world.\n\n \n hundreds of millions of people are united in their faith be it Christians, Muslims, whatever\n \n the world exists only in your mind therefore you have no proof that everything you think it is real it exists independently, outside you. You could well be imagining everthing and you would never know otherwise. \n \n \n \"When I consider the fact that I have doubts, or that I am a thing that is incomplete and dependent, then there arises in me a clear and distinct idea of a being who is independent and complete, that is, an idea of God. And from the mere fact that there is such an idea within me, or that I who possess this idea exist, I clearly infer that God exists, and that every single moment of my entire existence depends on him ... And now, from this contemplation of the true God, in whom all the treasures of wisdom and the sciences, lie hidden, I think I can see a way forward to the knowledge of other things\" (Descartes)", 
   {
    "unicode_changes_made": true
   }, 
   284028, 
   null, 
   1190101380.0
  ], 
  [
   285713, 
   null, 
   "samiinh", 
   "hundreds of millions of people are united in their faith be it Christians, Muslims, whatever\n \n So what. Doesn't prove anything.", 
   {}, 
   284393, 
   null, 
   1191111300.0
  ], 
  [
   287073, 
   null, 
   "GodsCowboy", 
   "how do you know that the bible, or any holy book is actually the word of God?\n\n \n The MORE you study the WORD OF GOD, the closer you'll get to GOD and the better you'll be at knowing the TRUTH. Just as Christ taught in PARABLES, there are passages that AREN'T recorded/translated correctly, but can be understood correctly by those that KNOW GOD. \n \n Just as you know the TRUE MEANING of someone you know well (your parents) but may NOT UNDERSTAND the TRUE MEANING of the slang used by a visitor in your town.", 
   {
    "post_info": {
     "post_title": "Try It You'll Like It"
    }
   }, 
   74524, 
   null, 
   1191872460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The word of GOD is a road map that leads to GOD", 
  "url": "http://www.4forums.com/political/biblical-contradictions/3579-word-god-road-map-leads-god.html", 
  "breadcrumbs": [
   "Biblical Contradictions"
  ], 
  "id_number": 3579, 
  "discussion_files": [
   [
    "12541.html", 
    "http://www.4forums.com/political/biblical-contradictions/3579-word-god-road-map-leads-god-print.html"
   ], 
   [
    "12542.html", 
    "http://www.4forums.com/political/biblical-contradictions/3579-word-god-road-map-leads-god-2-print.html"
   ]
  ], 
  "identifier": 3579
 }
]