[
 [
  [
   4333, 
   null, 
   "kelvin90701", 
   "This is a point of history were the USA steps up and becomes THE one and only world power for the next 100 years or it is the start of our decline.\n \n The UN inspections and talks have been going on for 12 years now. Does the idea of \"give peace a chance\" still make sense?\n \n Our options:\n \n 1) Go alone. We then become an international menace. We pull back from NATO. Think of all the NATO countries that enjoy US dollars by our military bases in their countries. Think of the implosion it causes to Europe if we stop spending that money. We are then stuck with rebuilding a country that is split by tribal loyalty, were the only stablity they have known was under oppression. Where the people have no democratic notions.\n \n 2) Withdraw. Saves money, we take the moral high ground. Really, that is not the way the world works. International politics and conflict is rarely decided by morality. The power vaccum we leave behind is going to be filled by someone else, whom? Saddam is not going to have a sudden moral enlightenment and work for international stability in the region. By his very motive, stability will work againt him.\n \n 3) Stalemate. Just like the cold war. Will last for years and suck the economic life out of our country.", 
   {
    "post_info": {
     "post_title": "Iraq.  We loose no matter what at this point."
    }
   }, 
   null, 
   null, 
   1047255720.0
  ], 
  [
   4336, 
   null, 
   "Broker", 
   "No, I would say we can still win. Iraq falls, Iran is probably next. I say after Iraq we start funding the resistance in Iran. Both countries open to US business. The Iraqis kill French, Chinese, and Russian oil deals made with the regime and switch those deals to supporters of the US. Billions and billions in productivity.", 
   {}, 
   4333, 
   null, 
   1047258240.0
  ], 
  [
   4338, 
   null, 
   "kelvin90701", 
   "Any kind of replacement government is going to have to overcome a divided country loyal to thier own tribes. It is a medevil country no history of democratic ideas. Where does democracy start? Who do the tribes follow? The paleface outsiders who neither speak their language or worship thier religion?\n \n Any hint or appeance that the US is taking Iraqi oil then suspicious Muslims everwhere will point to the US as a greedy and murderous country. How does Iraqi then pay for rebuiling the country? By selling sand?\n \n Were screwed.", 
   {}, 
   4333, 
   null, 
   1047260520.0
  ], 
  [
   4344, 
   null, 
   "Broker", 
   "Why are we taking oil? We should buy that oil and let them use the money to rebuild the country. \n \n Afghanistan is also a country of tribes that was split because of that...maybe we can have some success in Iraq like that too.", 
   {}, 
   4333, 
   null, 
   1047266700.0
  ], 
  [
   4353, 
   null, 
   "kelvin90701", 
   "Originally posted by Broker \n Why are we taking oil? We should buy that oil and let them use the money to rebuild the country. \n \n Afghanistan is also a country of tribes that was split because of that...maybe we can have some success in Iraq like that too. \n \n \n To you it looks like a mutual transaction. To a radical Muslim it could look like imperialism.\n \n Ahhh Iraq and Afganistan. We'll have the equilivant of two Vietnams both going on at the same time.\n \n I make this point because I agree with GW. This is a long road we are about to go down. We can go down this road divided and into decline, or unified and as leaders of the free world into the next 100 years.", 
   {}, 
   4333, 
   null, 
   1047270900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Iraq.  We loose no matter what at this point.", 
  "url": "http://www.4forums.com/political/current-events-debates/358-iraq-we-loose-no-matter-what-point.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 358, 
  "discussion_files": [
   [
    "22486.html", 
    "http://www.4forums.com/political/current-events-debates/358-iraq-we-loose-no-matter-what-point-print.html"
   ]
  ], 
  "identifier": 358
 }
]