[
 [
  [
   74646, 
   null, 
   "OccamsRazor", 
   "--------------------------------------------------------------------------------\n \n Well its finally here, polling day in the elections to decide the next President of the United States of America.\n \n Sat on the east side of the pond, I've been watching this quite closely to see how things have unfolded. Last news I heard and the pollsters were saying its neck and neck between Bush and Kerry so it seems like there is everything still to play for.\n \n So if you are an American, what are your feelings on the coming events? are you a passionate supporter of either of the main candiates, one of the independents or maybe none at all? Do you want Bush out, or do you think he is the man of the hour and the only choice for America's future?\n \n If (like me) you are not an American what do you think of what will surely been one of the most closely watched elections in recent times? do you see it as been important in shaping the events of the next four years or do you think it will be \"more of the same\" regardless who wins?\n \n Whatever, its going to be an interesting couple of days- I really hope you get a decisive result for the sake of confidence in your Presidential election system.", 
   {
    "post_info": {
     "post_title": "Have a super Tuesday!: US Presidential elections tommorrow."
    }
   }, 
   null, 
   null, 
   1099347240.0
  ], 
  [
   74656, 
   null, 
   "Waxy", 
   "\n Whatever, its going to be an interesting couple of days- I really hope you get a decisive result for the sake of confidence in your Presidential election system.\n\n \n I'm hoping there'll be a decisive result too, I'm not too worried baout the US election system, I just don't think I could handle the threads that would result if there was any controversy.\n \n I can't wait for this election to be over, I don't think there are words to describe how sick of it I am.\n \n Waxy", 
   {}, 
   74646, 
   null, 
   1099348560.0
  ], 
  [
   74659, 
   null, 
   "Big Orn", 
   "I can't wait for this election to be over, I don't think there are words to describe how sick of it I am.\n \n Waxy\n\n \n ECHO\n \n What is it now? The 2004 Recount?", 
   {}, 
   74656, 
   null, 
   1099348920.0
  ], 
  [
   74671, 
   null, 
   "kickin50", 
   "The last 4 years here has been difficult to say the least. The last controversy never subsided. The election decided in the courts was never forgotten.\n \n After the election, Americans have a tradition of getting on board, as best they can. It didn't happen this time. I don't think the Supreme Court expected this reaction. I don't think they foresaw the deep mistrust that was created.\n \n I feel that they acted prematurely last time. But I also think that their intentions were the best. Their aim was to put an end to it. It was ripping the country apart. They thought a decision could put us back together. It didn't.\n \n The events of the past four years made it worse.\n \n Please - don't let it happen again.", 
   {}, 
   74659, 
   null, 
   1099351020.0
  ], 
  [
   74698, 
   null, 
   "pnac=ww3", 
   "I think I'm going to call it like I have seen some journalists call it.\n \n Before I thought Bush would win handily.\n \n But now I think this case is more likely:\n \n Bush will win the popular vote, but lose in the electoral college.\n \n Most of the map will be blanketed by red, but the electoral votes in the blue states will outweigh them. \n \n Bush will win a lot of red states by huge margins (most of the south and plains states, maybe even Texas) but it won't matter. Kerry will win all the swing states with significant numbers of votes (meaning not New Mexico, but Ohio and Wisconsin). O, and Kerry will win Florida.\n \n http://www.electoral-vote.com/\n \n .", 
   {}, 
   74671, 
   null, 
   1099355340.0
  ], 
  [
   74700, 
   null, 
   "Duo_Maxwell", 
   "does anyone expect to have a president on the 3rd? \n \n Hopefully we'll have a president by January, considering how many problems this election is predicted to have.", 
   {}, 
   74698, 
   null, 
   1099355820.0
  ], 
  [
   74703, 
   null, 
   "Sigma", 
   "\n Bush will win the popular vote, but lose in the electoral college.\n \n\n \n I will be depressed if Bush wins the popular vote. That would mean that most of the people in this country thinks he did a good job. I would hate to think there are that many blind and ignorant people in this country.", 
   {}, 
   74698, 
   null, 
   1099356240.0
  ], 
  [
   74716, 
   null, 
   "OccamsRazor", 
   "does anyone expect to have a president on the 3rd? \n \n Hopefully we'll have a president by January, considering how many problems this election is predicted to have.\n\n \n Heheh, well I heard there are something like 100,000 people who have \"provisional votes\" who will be able to vote but the validity of their vote will be decided a few months later. I suppose thats not many out of the total population but if things are very close it could be a real sticker.\n \n I also heard that turnout in 2000 was 55% and this time round it is expected at around 60%. I was a bit surprised as I thought it would be somewhat higher- maybe thats just my impression of how enthusiastic Americans are over voting for the President.\n \n Well, I'm hoping to see the back of Bush, and in particular the Neocons who put him in the Whitehouse in the first place..... Kerry will have his work cut out for him to be sure, but I'm more hopeful for 4 years of his administration than continuing the current status quo.", 
   {}, 
   74700, 
   null, 
   1099359600.0
  ], 
  [
   74724, 
   null, 
   "Duo_Maxwell", 
   "actually I was more worried about hacking. \n \n These wankers are sending poll information over the internet. Not to mention the expansive vulnerabilities of e-voting.", 
   {}, 
   74716, 
   null, 
   1099363020.0
  ], 
  [
   74732, 
   null, 
   "Mach", 
   "Yes, in this election, I'm a passionate suporter of one candidate over another.\n \n One candidate has spoken of reason, accountability, responsibility, and science. The other...I can barely make sense of.\n \n In all seriousness, I've followed both candidates, and parties, and have read more and listened to more radio and news this election cycle than I ever have in the past. Probably 1-2 hours a day for the past ~3 years. I felt quite prepared for my vote, and my position. I voted early though, last week!! :) No line, took about 8 minutes in total. Although in my state my vote WILL NOT COUNT, thanks to the electoral college.... :(\n \n I'm an independant, and consider myself fairly moderate. I'm more conservative on business/economy issues, and more liberal on social issues. Oddly enough, I don't consider them from differing viewpoints, I think they are both from the same, reasonable viewpoint. I voted for the candidate I felt best fit my views.\n \n I certainly hope that it's not a court-driven election...that would be disappointing. The farce of last election, regardless of the outcome, was absurd. \n \n -Mach", 
   {}, 
   74646, 
   null, 
   1099368900.0
  ], 
  [
   74733, 
   null, 
   "Dzeron", 
   "I'm more conservative on business/economy issues, and more liberal on social issues. Oddly enough, I don't consider them from differing viewpoints, I think they are both from the same, reasonable viewpoint.\n \n \n That \"reasonable viewpoint\" is libertarianism.", 
   {}, 
   74732, 
   null, 
   1099370040.0
  ], 
  [
   74743, 
   null, 
   "Dono", 
   "I'm planning to wrap all the crystal tonight. If Kerry wins, Jim's anguished screech will break glass for miles around.\n Dono", 
   {}, 
   74733, 
   null, 
   1099374120.0
  ], 
  [
   74775, 
   null, 
   "OccamsRazor", 
   "Well, the polling stations are begining to open now.... opportunity for those who have not already had chance to cast thier vote like Mach (who I sympathise with very much having been in a situation where I have voted knowing that there was no chance that my vote would ever be represented in Parliment).\n \n Listening to the news today I was surprised by a piece on a situation that has come to rise in the state of Ohio. The Republican party has been granted legal authority to place about 1000 \"poll watchers\" at stations around the state. These party representatives will be able to verbally challenge people as they arrive to make cast their vote over their voting preferences. I think this an invasion of individuals privacy and completely unjustified in a modern democratic system to be able to put sucvh overt pressure on people before they vote.\n \n The local Democrats were not only surprised by the ruling, but very unhappy with its timing as it was issued today at 1:30am local time when most interested parties had gone to bed.\n \n Anyway, the next 12 hours should be most interesting.", 
   {}, 
   74732, 
   null, 
   1099409700.0
  ], 
  [
   74825, 
   null, 
   "marc9000", 
   "\n The local Democrats were not only surprised by the ruling, but very unhappy with its timing as it was issued today at 1:30am local time when most interested parties had gone to bed.\n \n Anyway, the next 12 hours should be most interesting.\n\n \n I heard it just before 9:00PM EST the EVENING BEFORE, on Fox News TV.", 
   {}, 
   74775, 
   null, 
   1099428000.0
  ], 
  [
   74827, 
   null, 
   "OccamsRazor", 
   "I heard it just before 9:00PM EST the EVENING BEFORE, on Fox News TV.\n\n \n Ha- a good example of how different reports tell the \"truth\" from different perspectives- the Democrat on BBC Radio 4 was trying to do a bit of spin perhaps?", 
   {}, 
   74825, 
   null, 
   1099428660.0
  ], 
  [
   74829, 
   null, 
   "marc9000", 
   "Ha- a good example of how different reports tell the \"truth\" from different perspectives- the Democrat on BBC Radio 4 was trying to do a bit of spin perhaps?\n\n \n Well yes but you won't find me gloating - I'm afraid both sides are guilty of that kind of spinning. If confronted with it, it's easy for them to say they didn't know. :)", 
   {}, 
   74827, 
   null, 
   1099429200.0
  ], 
  [
   74835, 
   null, 
   "Famous Amos", 
   "I will be depressed if Bush wins the popular vote. That would mean that most of the people in this country thinks he did a good job. I would hate to think there are that many blind and ignorant people in this country.\n\n \n \n So people who don't think like you are ignorant?", 
   {}, 
   74703, 
   null, 
   1099433940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Have a super Tuesday!: US Presidential elections tommorrow.", 
  "url": "http://www.4forums.com/political/politics-debates/3589-have-super-tuesday-us-presidential-elections-tommorrow.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3589, 
  "discussion_files": [
   [
    "1076.html", 
    "http://www.4forums.com/political/politics-debates/3589-have-super-tuesday-us-presidential-elections-tommorrow-print.html"
   ], 
   [
    "1077.html", 
    "http://www.4forums.com/political/politics-debates/3589-have-super-tuesday-us-presidential-elections-tommorrow-2-print.html"
   ]
  ], 
  "identifier": 3589
 }
]