[
 [
  [
   74771, 
   null, 
   "SoftSoap", 
   "While Europe is spending its energy and a lot of resources on struggle against Islamic extremism and terrorism, schools for preparing new Muslim imams are opening all over the European territory. For instance, in France and in Holland an experiment of West European integration for imams into local society and culture is held on the basis of using the full sanction of these states. But why is it happening on the territory of Europe, not in Muslim countries? It becomes clear to you, if you remember that the process of forming the army of educated and Europe-zed imams is very difficult in Arab world, where any state interference in affairs of Islamic religion is quite natural. Meanwhile in Europe it is viewed in the light of crude violation of rights and private wrongs. Thus, when it's impossible to control imam's study and then their preaching activity, it becomes very difficult to prove their unlawful practice on the territory of Europe. How do you like it? Terrorists couldn't ask for anything better!", 
   {
    "post_info": {
     "post_title": "While Europe is spending its energy and a lot of resources on struggle against Islami"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1099403820.0
  ], 
  [
   74788, 
   null, 
   "georged", 
   "While Europe is spending its energy and a lot of resources on struggle against Islamic extremism and terrorism, schools for preparing new Muslim imams are opening all over the European territory. For instance, in France and in Holland an experiment of West European integration for imams into local society and culture is held on the basis of using the full sanction of these states. But why is it happening on the territory of Europe, not in Muslim countries? It becomes clear to you, if you remember that the process of forming the army of educated and Europe-zed imams is very difficult in Arab world, where any state interference in affairs of Islamic religion is quite natural. Meanwhile in Europe it is viewed in the light of crude violation of rights and private wrongs. Thus, when it's impossible to control imam's study and then their preaching activity, it becomes very difficult to prove their unlawful practice on the territory of Europe. How do you like it? Terrorists couldn't ask for anything better!\n\n \n I'd be curious as to which European nations not supporting US nation building in Iraq or Israeli expansionist policy are struggling against Islamic extremist terrorism?", 
   {
    "unicode_changes_made": true
   }, 
   74771, 
   null, 
   1099417860.0
  ], 
  [
   74803, 
   null, 
   "lord tammerlain", 
   "I would bet that he would name France, Spain and probably Germany. France which has the largest Muslim pop in Europe, many of whom are Algerian in heritage. Germany who has a large Turkish population, and Spain because how else would have the terrorists been able to plant the bombs in Madrid.\n \n Of course other then France with their anti religious policies in school has no real problem with muslims, the biggest threat to Spain is from the ETA who are not Islamic fundamentalists, and in Germany it is the Turks who have the history of being the victims of extremist attacks by german racists.", 
   {}, 
   74788, 
   null, 
   1099422180.0
  ], 
  [
   74812, 
   null, 
   "georged", 
   "Which tells me the definition of terrorism he's using relates to baptists, lutherans, catholics and any other belief system using missions and schools to spread their mythology? The only physical attack in any European country I'm aware of was directed at Spain for supporting US invasion/occupation of Iraq. England doesn't really represent much of an ideological challenge as the populace is against Blair's support of US aggression in Iraq and the remaining 'coalition members are small, generally powerless and bought and paid for with US trade guarantees and military aid. \n \n 'While Europe is spending its energy and a lot of resources on struggle against Islamic extremism and terrorism' is, to me, a confusing statement.", 
   {}, 
   74803, 
   null, 
   1099425240.0
  ], 
  [
   74862, 
   null, 
   "Dono", 
   "The 25 nations that make up the European Union are also using their assets to become the world's largest market, giving them enormous power. With a common currency, many regulatory functions merged, low military budgets, they can function like a single entity in the marketplace while retaining their 25 seperate votes in the UN and other bodies. They had the good sense to avoid a war that was not in their best interests, would drain resources and make them a target. They have their problems, but seem to be growing in strength.\n Dono", 
   {}, 
   74812, 
   null, 
   1099442040.0
  ], 
  [
   74878, 
   null, 
   "georged", 
   "The Euro, at $.90 (US Dollar base) two years ago, is now at $1.27 for 12/04 futures. In that same two-year period, the dollar has lost 25% of its purchasing power, which comes out of the pockets of US fixed income individuals and industrial capitalization. Tell me who's spending their energy and resources in paying for their foreign policies.\n \n If you want a truly gloomy scenario, take a fix on oil producing countries accepting Euros for that resource to hedge their rapidly deteriorating US dollar investments. Then tell me how much Europe is spending on 'fighting the tide of Islamic integration' and how much the rest of the world needs the US for anything but export markets. And I haven't even touched the fixed Chinese Yuan.", 
   {}, 
   74862, 
   null, 
   1099445880.0
  ], 
  [
   74911, 
   null, 
   "lord tammerlain", 
   "My question is when does the low dollar and the inflation pressures that it creates gets to be indicated in the inflation numbers.", 
   {}, 
   74878, 
   null, 
   1099482660.0
  ], 
  [
   75055, 
   null, 
   "georged", 
   "My question is when does the low dollar and the inflation pressures that it creates gets to be indicated in the inflation numbers.\n\n \n That would have caused a pre-election backlash, so food and energy indexes, the truly volatile issues, are excluded from official (government/equity brokerage houses) inflation announcements. To me, the interesting period will be when baby boomers begin retiring en mass and discover their investment income will not maintain planned lifestyles. Equity market disruption could become very serious as they attempt to cash out to supplement that income, further depressing that income. Which will happen first, the real estate bubble deflating or equity markets taking their licks? Europe spending its energy and resourses against Islamic integration is and will be a minor circumstance with their currency looking very attractive.", 
   {}, 
   74911, 
   null, 
   1099514160.0
  ], 
  [
   76531, 
   null, 
   "Alan Ryan", 
   "The 25 nations that make up the European Union are also using their assets to become the world's largest market, giving them enormous power. With a common currency, many regulatory functions merged, low military budgets, they can function like a single entity in the marketplace while retaining their 25 seperate votes in the UN and other bodies. They had the good sense to avoid a war that was not in their best interests, would drain resources and make them a target. They have their problems, but seem to be growing in strength.\n Dono\n\n You have a rather idealised picture of the European Union. It's actually riven by nationalistic disputes and has a governing elite that wants to create the most over-taxed and over-regulated economy that has ever existed. In the medium term, I'd guess the US will compete far more effectively in the global marketplace than the bloated European Union will. You overlook the atavistic hatred of American society and culture as a motive for avoiding the war in Iraq. (This might sound vague, but read the British newspapers online for a sense of what I'm driving at).", 
   {}, 
   74862, 
   null, 
   1100028660.0
  ], 
  [
   76540, 
   null, 
   "georged", 
   "You have a rather idealised picture of the European Union. It's actually riven by nationalistic disputes and has a governing elite that wants to create the most over-taxed and over-regulated economy that has ever existed. In the medium term, I'd guess the US will compete far more effectively in the global marketplace than the bloated European Union will. You overlook the atavistic hatred of American society and culture as a motive for avoiding the war in Iraq. (This might sound vague, but read the British newspapers online for a sense of what I'm driving at).\n\n \n I'll take a currency that has a mix of nationalistic disputes with a governing elite (former US circumstances when states rights were still vogue) to our overwhelming trend towards central government with political control of our currency.", 
   {}, 
   76531, 
   null, 
   1100029920.0
  ], 
  [
   76769, 
   null, 
   "jim's trucking", 
   "The Euro, at $.90 (US Dollar base) two years ago, is now at $1.27 for 12/04 futures. In that same two-year period, the dollar has lost 25% of its purchasing power, which comes out of the pockets of US fixed income individuals and industrial capitalization. Tell me who's spending their energy and resources in paying for their foreign policies.\n \n If you want a truly gloomy scenario, take a fix on oil producing countries accepting Euros for that resource to hedge their rapidly deteriorating US dollar investments. Then tell me how much Europe is spending on 'fighting the tide of Islamic integration' and how much the rest of the world needs the US for anything but export markets. And I haven't even touched the fixed Chinese Yuan.\nThe decline of the dollar against the Euro has caused a drop in European exports that hurts their home economy. It will eventually reverse.", 
   {}, 
   74878, 
   null, 
   1100105880.0
  ], 
  [
   76780, 
   null, 
   "georged", 
   "The decline of the dollar against the Euro has caused a drop in European exports that hurts their home economy. It will eventually reverse.\n\n \n The strong euro offsets oil pricing increases, priced in dollars, providing a far better trade balance than any commercial trading losses. They aren't dumping their national wealth, as we're doing, on trade imbalances and military expenditures. \n \n With our ever increasing debt, trade imbalance and migration to a service economy, I'd be curious to know how you've determined that the dollar will strengthen, especially after a 30-year decline that has accelerated in the past two years?", 
   {}, 
   76769, 
   null, 
   1100108640.0
  ], 
  [
   76781, 
   null, 
   "jim's trucking", 
   "The strong euro offsets oil pricing increases, priced in dollars, providing a far better trade balance than any commercial trading losses. They aren't dumping their national wealth, as we're doing, on trade imbalances and military expenditures. \n \n With our ever increasing debt, trade imbalance and migration to a service economy, I'd be curious to know how you've determined that the dollar will strengthen, especially after a 30-year decline that has accelerated in the past two years?\nKnowing as little as I do about world economics, I probably shouldn't be in this discussion. My thoughts were that EVENTUALLY the dollar will strengthen (or the Euro will weaken) bringing them closer to equal again.\n \n ICBM, but I recently heard that several Euro users want to opt out and go back to their own currency. Have you heard anything like that?", 
   {}, 
   76780, 
   null, 
   1100109720.0
  ], 
  [
   76783, 
   null, 
   "Alan Ryan", 
   "I'll take a currency that has a mix of nationalistic disputes with a governing elite (former US circumstances when states rights were still vogue) to our overwhelming trend towards central government with political control of our currency.\n\n Are you saying here that political control over currency exists in the US, but money somehow escapes this fate in the European Union ?\n The \"trends\" that bother you are already up and running policies over here. My home country has reaped many benefits from this interventionism over the last 10-15 years, but I still think that over-regulation and government interference with market forces will cause economic stagnation sooner rather than later. America is better placed on ideological grounds to compete in the global market than a Europe governed by the remote control of placemen and third rate politicians who can't get elected to their own national governments.", 
   {}, 
   76540, 
   null, 
   1100109960.0
  ], 
  [
   76797, 
   null, 
   "georged", 
   "Are you saying here that political control over currency exists in the US, but money somehow escapes this fate in the European Union ?\n The \"trends\" that bother you are already up and running policies over here. My home country has reaped many benefits from this interventionism over the last 10-15 years, but I still think that over-regulation and government interference with market forces will cause economic stagnation sooner rather than later. America is better placed on ideological grounds to compete in the global market than a Europe governed by the remote control of placemen and third rate politicians who can't get elected to their own national governments.\n\n \n As more newly developed countries join the EU, you'll enjoy the luxury of being able to produce goods at lower costs under the same strong currency umbrella regardless of the politics. Some nations will suffer, others will prosper, but all will enjoy the benefit of a broad economic base to absorb short-term economic changes that plague a single national currency that doesn't dominate world consumer production. That has a short and long-range advantage in eventually being able to compete with Asia as their standards of living increase. The US, with our currently high standard of living, political ambition and migration to a service economy, has forced a majority of our manufacturing companies to relocate outside the US to remain competitive in world markets. While US political ideology might seem favorable, until our standard of living and political objectives adjust to economic reality we have no alternatives to match eventual EU production costs and our dollar will continue to sink based on our continually expanding requirements of oil imports and public debt.", 
   {}, 
   76783, 
   null, 
   1100115540.0
  ], 
  [
   76798, 
   null, 
   "georged", 
   "Knowing as little as I do about world economics, I probably shouldn't be in this discussion. My thoughts were that EVENTUALLY the dollar will strengthen (or the Euro will weaken) bringing them closer to equal again.\n \n ICBM, but I recently heard that several Euro users want to opt out and go back to their own currency. Have you heard anything like that?\n\n \n Haven't heard that, but other nations are lined up and eagerly awaiting acceptance to 'get off the street' of national currency fluctuations.\n \n You'd enjoy looking at how US economic policies affect our well-being and how they impact global economics. Guaranteed to affect how you view domestic politics and not much of a learning curve.", 
   {}, 
   76781, 
   null, 
   1100116140.0
  ], 
  [
   76868, 
   null, 
   "lord tammerlain", 
   "Are you saying here that political control over currency exists in the US, but money somehow escapes this fate in the European Union ?\n The \"trends\" that bother you are already up and running policies over here. My home country has reaped many benefits from this interventionism over the last 10-15 years, but I still think that over-regulation and government interference with market forces will cause economic stagnation sooner rather than later. America is better placed on ideological grounds to compete in the global market than a Europe governed by the remote control of placemen and third rate politicians who can't get elected to their own national governments.\n\n \n \n European political manipulations of the Euro has to be done and liked by so many different groups that a policy of inertia sets in, they maintain a policy for the long term. America with the closer integration between the Fed and the US government, policy can get dictated for non economic purposes, just to get someone elected.\n \n Besides which the Euro zone has a current account surplus, which helps maintaining a strong currency and for long term growth in the economy. \"Old\" Europe generally concentrates on higher end goods in which a high Euro doesnt as negatively affect as when you are concentrating on low/ medium end goods. When you want the best of most industrial, or consumer (non electronic) generally you go for European good. The purchasers of European goods are generally more well off and are less concerned with higher prices.", 
   {}, 
   76783, 
   null, 
   1100149320.0
  ], 
  [
   76945, 
   null, 
   "georged", 
   "Besides which the Euro zone has a current account surplus, which helps maintaining a strong currency and for long term growth in the economy. \"Old\" Europe generally concentrates on higher end goods in which a high Euro doesnt as negatively affect as when you are concentrating on low/ medium end goods. When you want the best of most industrial, or consumer (non electronic) generally you go for European good. The purchasers of European goods are generally more well off and are less concerned with higher prices.\n\n \n Fine foot ware and clothing could be used as prime examples. US, Asian and other producers can't hold a candle to those European products. When buying shoes, I don't wear what I still call tennis shoes on a regular basis, a European brand is all important because it relates to the best in design, quality of workmanship and materials. When buying shoes, anyone who has worn fine foot ware isn't concerned with price. Like a Benz, it becomes a matter of 'you get what you pay for'. \n \n I still haven't read any examples of the title of this thread.", 
   {}, 
   76868, 
   null, 
   1100191020.0
  ], 
  [
   76952, 
   null, 
   "Alan Ryan", 
   "Fine foot ware and clothing could be used as prime examples. US, Asian and other producers can't hold a candle to those European products. When buying shoes, I don't wear what I still call tennis shoes on a regular basis, a European brand is all important because it relates to the best in design, quality of workmanship and materials. When buying shoes, anyone who has worn fine foot ware isn't concerned with price. Like a Benz, it becomes a matter of 'you get what you pay for'. \n \n I still haven't read any examples of the title of this thread.\n\n \n You're right this thread has gone off at a tangent, though I did mention in passing (in an earlier post) my supposition concerning the motives that members of the European Union have for failing to support America in Iraq.\n Your opinion about footwear may be true - but I would be surprised to hear as a general proposition that people aren't concerned with price. Mercedes produce cachet cars that you pay a premium for owning: a prestige factor is built into the decision to purchase, so the price may be a secondary consideration for those who can afford them. \n Generally speaking, because of the very large volumes that can be sold in the American market, prices of food and consumer goods of every type (especially electrical and \"hi-tech\" goods) are cheaper in the USA. The advantages of having a potentially enormous market in the European Union are being thrown away on very costly schemes of social engineering. \n Incidentally, Jim's Trucking is correct, many members of the European Union are having second thoughts about the medium term prospects for the euro and would be glad to return to their national currencies on economic and on \"sentimental\" grounds.", 
   {}, 
   76945, 
   null, 
   1100196120.0
  ], 
  [
   76962, 
   null, 
   "georged", 
   "You're right this thread has gone off at a tangent, though I did mention in passing (in an earlier post) my supposition concerning the motives that members of the European Union have for failing to support America in Iraq.\n Your opinion about footwear may be true - but I would be surprised to hear as a general proposition that people aren't concerned with price. Mercedes produce cachet cars that you pay a premium for owning: a prestige factor is built into the decision to purchase, so the price may be a secondary consideration for those who can afford them. \n Generally speaking, because of the very large volumes that can be sold in the American market, prices of food and consumer goods of every type (especially electrical and \"hi-tech\" goods) are cheaper in the USA. The advantages of having a potentially enormous market in the European Union are being thrown away on very costly schemes of social engineering. \n Incidentally, Jim's Trucking is correct, many members of the European Union are having second thoughts about the medium term prospects for the euro and would be glad to return to their national currencies on economic and on \"sentimental\" grounds.\n\n \n The US decision to invade and occupy another sovereign nation for flimsy and eventually unfounded reasoning would be enough to scare anyone with a somewhat recent memory of suffering the outfall from Hitler's invasion of Poland. Those actions don't breed admiration, especially when they cost big pieces of investment capital from companies making major contributions to your tax base. \n \n Superior shoes and automobiles are just that. If you've used them on a regular basis, everything else becomes second-best. As J.P. Morgan stated when an admirer asked the cost of his yacht, 'If you have to ask, you can't afford it'. As many countries eliminate the former middle classes, including the US, product offerings have drifted towards cheap and expensive, with little middle ground. \n \n When considering the Euro strength, I'd think those countries wishing to return to their national currencies for economic reasons are being pressed by Asian competition in mass-produced product lines, especially China with their fixed Yuan. They'll (the European countries) eventually have to seek out lower labor and compliance costs in some of the newer EU members, much as the US has done with outsourcing of manufacturing and services. The working middle class, for the time being, is history, replaced by resource draining hoards of government workers in countries embracing various degrees of socialism and no longer affordable in the areas of manufacturing and service. The sooner they admit same, the less whining we'll hear about their demise.\n \n Sentiment is a nice word, but when attached to a currency it doesn't spend well.", 
   {}, 
   76952, 
   null, 
   1100198820.0
  ], 
  [
   76968, 
   null, 
   "Alan Ryan", 
   " \n \n Superior shoes and automobiles are just that. If you've used them on a regular basis, everything else becomes second-best. As J.P. Morgan stated when an admirer asked the cost of his yacht, 'If you have to ask, you can't afford it'. As many countries eliminate the former middle classes, including the US, product offerings have drifted towards cheap and expensive, with little middle ground. \n The working middle class, for the time being, is history, replaced by resource draining hoards of government workers in countries embracing various degrees of socialism and no longer affordable in the areas of manufacturing and service. The sooner they admit same, the less whining we'll hear about their demise.\n Sentiment is a nice word, but when attached to a currency it doesn't spend well.\n\n The confidence you have in your economic premises seems a little overdone. It's an inexact and tentative \"science\" we're talking about here.\n Everything else is second-best when you can afford the best: but we must stick to generalities and not place too much emphasis on the spending habits of the individual who happens to be well off.\n I think your point about the \"resource draining hordes of government workers in countries embracing degrees of socialism etc.\" is a point I tried to make in a couple of previous posts - and I agree with you completely there.\n Finally, because I described people's attachment to their national currencies as being \"sentimental\" doesn't mean I necessarily approve of that: it just happens to figure in the \"gut economics\" of Joe Bloggs/John Doe - if I can put it that way.", 
   {}, 
   76962, 
   null, 
   1100200920.0
  ], 
  [
   76970, 
   null, 
   "georged", 
   "The confidence you have in your economic premises seems a little overdone. It's an inexact and tentative \"science\" we're talking about here.\n\n \n Generalities of material/labor/compliance costs competing in established markets with similar or identical products are pretty much cut and dried. Put the currency valuation factor to it as an export and all that does is lower/increase landed price. More of a marketing modeling summation than economics.\n \n Margins are generally much more attractive on the higher end than cheap volume stuff. As pointed out by another poster, those strengths are 'old Europe' and require servicing a defined market for a long time to establish acceptance. But once there, extremely difficult to dislodge in a market that doesn't change all that much. The lower end is much more susceptible to pricing and national/international economic circumstances.", 
   {}, 
   76968, 
   null, 
   1100202540.0
  ], 
  [
   76983, 
   null, 
   "Alan Ryan", 
   "Generalities of material/labor/compliance costs competing in established markets with similar or identical products are pretty much cut and dried. Put the currency valuation factor to it as an export and all that does is lower/increase landed price. More of a marketing modeling summation than economics.\n \n Margins are generally much more attractive on the higher end than cheap volume stuff. As pointed out by another poster, those strengths are 'old Europe' and require servicing a defined market for a long time to establish acceptance. But once there, extremely difficult to dislodge in a market that doesn't change all that much. The lower end is much more susceptible to pricing and national/international economic circumstances.\n\n \n OK georged: I don't have the expertise to debate with you on technicalities - but I do take an interest in economic policy and I wanted to correct what seemed to me a rather too rosy picture of the European Union economies.\n Living in an over-regulated society (as I would argue I do) makes what used to be called the \"American way\" an attractive but not perfect alternative. If the federal government helped itself to roughly 45% of the national cake, you might have more sympathy with my point of view: probably not.", 
   {}, 
   76970, 
   null, 
   1100210640.0
  ], 
  [
   76991, 
   null, 
   "georged", 
   "OK georged: I don't have the expertise to debate with you on technicalities - but I do take an interest in economic policy and I wanted to correct what seemed to me a rather too rosy picture of the European Union economies.\n Living in an over-regulated society (as I would argue I do) makes what used to be called the \"American way\" an attractive but not perfect alternative. If the federal government helped itself to roughly 45% of the national cake, you might have more sympathy with my point of view: probably not.\n\n \n Used to be is the key term. After a long run of prosperity, the US (while still in denial at political/consumer levels) is in for some unpleasant financial reality over the coming decades. With a shrinking work force, reduced wages, eroding tax base and massive trade imbalance, and no reversal of those conditions in sight, 45% might look like a deal to today's US youth when they eventually shoulder the load currently being built through public debt and social programs. \n \n Our levels of military and 'home defense' spending is the reason I couldn't understand the thread topic.", 
   {}, 
   76983, 
   null, 
   1100214300.0
  ], 
  [
   78825, 
   null, 
   "daewoo", 
   "OK georged: I don't have the expertise to debate with you on technicalities - but I do take an interest in economic policy and I wanted to correct what seemed to me a rather too rosy picture of the European Union economies.\n Living in an over-regulated society (as I would argue I do) makes what used to be called the \"American way\" an attractive but not perfect alternative. If the federal government helped itself to roughly 45% of the national cake, you might have more sympathy with my point of view: probably not.\n\n \n \n 45%? That owuld be GREAT. Currently the government in the US (federal, state, and local) is spending around 56% of our GDP. 45% would mean some pretty serious spending cuts!", 
   {}, 
   76983, 
   null, 
   1101255660.0
  ], 
  [
   78841, 
   null, 
   "Eddie", 
   "45%? That owuld be GREAT. Currently the government in the US (federal, state, and local) is spending around 56% of our GDP. 45% would mean some pretty serious spending cuts!\n\n \n How do you come to that figure? I was under the impression that the US tax revenue as a percentage of the GDP was just below (or above) 30%...\n \n I`m also sceptical about the figure concerning brittain. I thought their share was around 30-40%", 
   {}, 
   78825, 
   null, 
   1101259500.0
  ], 
  [
   78873, 
   null, 
   "georged", 
   "How do you come to that figure? I was under the impression that the US tax revenue as a percentage of the GDP was just below (or above) 30%...\n \n I`m also sceptical about the figure concerning brittain. I thought their share was around 30-40%\n\n \n For the US on a federal, published at around 26%, you have to add in deficit and supplemental/discretionary funding (sup/disc estimated at 50% of published deficit numbers but not accounted for other than as a contribution to national debt) as they are as yet uncollected taxes plus interest. With the long bonds, that turns into a good-sized number our youth will be privileged to service with a reduced work force. Plus state and municipal tax bites. Want to include the trade imbalance and that impact on the dollar value of taxes actually paid? \n \n The UK has shrunk to a few islands currently enjoying Brent oil revenue that skews their historical GDP and percentage of taxes paid. That will eventually change. \n \n On topic, Sweden, who pays the highest publized percentage of GDP in taxes, has a token military by world power standards, and also enjoys a very high standard of living is having what problems with terrorism? And those other European nations not affiliated with our coalition are experiencing what struggles?", 
   {}, 
   78841, 
   null, 
   1101267300.0
  ], 
  [
   78876, 
   null, 
   "daewoo", 
   "For the US on a federal, published at around 26%, you have to add in deficit and supplemental/discretionary funding (sup/disc estimated at 50% of published deficit numbers but not accounted for other than as a contribution to national debt) as they are as yet uncollected taxes plus interest. With the long bonds, that turns into a good-sized number our youth will be privileged to service with a reduced work force. Plus state and municipal tax bites. Want to include the trade imbalance and that impact on the dollar value of taxes actually paid? \n\n \n And therein lies the problem. When you just look at budgetary spending next to GDP, it doesn't look so bad. It is when you factor in all the other under the table spending that you realise that we are screwed, or more correctly, you young folks out there are screwed.\n \n I have often heard the \"30%\" number in regards to governement spending in America, so you are not alone in the misconception.", 
   {}, 
   78873, 
   null, 
   1101268680.0
  ], 
  [
   78895, 
   null, 
   "lord tammerlain", 
   "And therein lies the problem. When you just look at budgetary spending next to GDP, it doesn't look so bad. It is when you factor in all the other under the table spending that you realise that we are screwed, or more correctly, you young folks out there are screwed.\n \n I have often heard the \"30%\" number in regards to governement spending in America, so you are not alone in the misconception.\n\n \n \n Hello Eddie (portent), the 30% number has been reported in the Economist mag in the back pages with the statistical section.", 
   {}, 
   78876, 
   null, 
   1101296580.0
  ], 
  [
   78896, 
   null, 
   "Eddie", 
   "For the US on a federal, published at around 26%, you have to add in deficit and supplemental/discretionary funding (sup/disc estimated at 50% of published deficit numbers but not accounted for other than as a contribution to national debt) as they are as yet uncollected taxes plus interest. With the long bonds, that turns into a good-sized number our youth will be privileged to service with a reduced work force. Plus state and municipal tax bites. Want to include the trade imbalance and that impact on the dollar value of taxes actually paid? \n\n \n Ah, then I see where my figures and yours differed :) And I must say that it seems reasonable to adjust the figures of tax revenus to reflect the spending more accuratly.\n \n \n \nThe UK has shrunk to a few islands currently enjoying Brent oil revenue that skews their historical GDP and percentage of taxes paid. That will eventually change. \n\n \n Yeah, but not yet for a while ;)\n \n \nOn topic, Sweden, who pays the highest publized percentage of GDP in taxes, has a token military by world power standards, and also enjoys a very high standard of living is having what problems with terrorism? And those other European nations not affiliated with our coalition are experiencing what struggles?\n\n \n Not much really. The biggest thing regarding terrorism we`ve experienced in the past few years was when a Swedish newspaper uncovered that Usama Bin Ladin had been to Sweden and was able to provide real footage and eye wittneses. But then again, his visit took place in 1971 and Usama was 14 years at the time :p \n \n And our only real problem with terrorist actions took place sometime during the 1990-ies when neo-nazi groups started to harrass reporters. It all escalated resulting in a car bomb detonating, injuring a reporter and killing his child. A couple of weeks later, in a joint effort between all major newspapers published the names, pictures and occupations of every prominent neo-nazi leader in Sweden. Suddenly the harrassment stopped... \n \n \nHello Eddie (portent), the 30% number has been reported in the Economist mag in the back pages with the statistical section.\n\n \n \n Yeah (I got to start buing the economist ;)), and I`ve seen it in other places as well. But I guess georgeds take on the issue seems plausible :)", 
   {}, 
   78895, 
   null, 
   1101298980.0
  ], 
  [
   78930, 
   null, 
   "georged", 
   "Ah, then I see where my figures and yours differed :) And I must say that it seems reasonable to adjust the figures of tax revenus to reflect the spending more accuratly.\n\n \n US state and municipal entities have also gotten into the debt game in a big way using general bond issues to circumvent their constitutional and charter mandated restrictions against accumulating public debt not assigned to defined revenue streams. In most cases, but not all, this has been prompted by federal cuts in revenue sharing as that entity struggles to maintain a public facade of not raising taxes by incurring public debt during a period of declining tax revenue and excess spending. Like parent, like child as local taxation continues to steadily increase in a manner not readily visible to the average citizen (voter). Every facet of US government, federal and local, spends vast amounts of dollars polishing numbers for public consumption that facilitate political acceptance. \n \n As most of these increases are directly or indirectly due to our foreign policy, I again question the original poster's statements about European non-coalition members spending energy and resources on Islamic terror.", 
   {}, 
   78896, 
   null, 
   1101324180.0
  ], 
  [
   78934, 
   null, 
   "daewoo", 
   "US state and municipal entities have also gotten into the debt game in a big way using general bond issues to circumvent their constitutional and charter mandated restrictions against accumulating public debt not assigned to defined revenue streams. In most cases, but not all, this has been prompted by federal cuts in revenue sharing as that entity struggles to maintain a public facade of not raising taxes by incurring public debt during a period of declining tax revenue and excess spending. Like parent, like child as local taxation continues to steadily increase in a manner not readily visible to the average citizen (voter). Every facet of US government, federal and local, spends vast amounts of dollars polishing numbers for public consumption that facilitate political acceptance.\n\n \n This hits a little close to home for me as I am in Kansas, where we are apparently planning to pay a $245 million bond obligation by using a $64 million payout from the big tobacco lawsuit. We are also apparently going to caugh up another $45 million for schools from that same payout. \n \n I don't know why they bother to polish numbers for public consumption. The public isn't paying attention.", 
   {}, 
   78930, 
   null, 
   1101325500.0
  ], 
  [
   78963, 
   null, 
   "georged", 
   "I don't know why they bother to polish numbers for public consumption. The public isn't paying attention.\n\n \n General media reports what the politically dominated civil services provide them, preferably numbers that won't disturb their advertising base, and American intellectual depth doesn't go much beyond the domestic tube or favored print publication between specator sporting events.", 
   {}, 
   78934, 
   null, 
   1101330060.0
  ], 
  [
   78971, 
   null, 
   "georged", 
   "This hits a little close to home for me as I am in Kansas, where we are apparently planning to pay a $245 million bond obligation by using a $64 million payout from the big tobacco lawsuit. We are also apparently going to caugh up another $45 million for schools from that same payout. \n\n \n Or have your bond rating downgraded to where big gun institutional investors can no longer buy them. Same problem, no assigned revenue stream. Virtually all states have spent their tobacco settlement shares on general obligations or political pet projects rather than to offset public financial support of health problems derived from tobacco usage. I formerly lived in Nevada, where the Governor established a scholarship fund with that states share, which he will manage after leaving office. \n \n The forthcoming ruling on the bond status for your new sports stadium is being closely looked at by what's left of fed opinion. The Texas Ranger stadium bond issue floated under Bush & gang put a lot of those ventures in jeopardy for financing quasi-public stadiums at falsely depressed real estate values with public bond issues and then the private participating equity entities taking windfall profits on the resales at full real estate values. Sort of a leveraged lease using public debt with private industry reaping the benefits.", 
   {}, 
   78934, 
   null, 
   1101332160.0
  ], 
  [
   79218, 
   null, 
   "Dono", 
   "You have a rather idealised picture of the European Union. It's actually riven by nationalistic disputes and has a governing elite that wants to create the most over-taxed and over-regulated economy that has ever existed. In the medium term, I'd guess the US will compete far more effectively in the global marketplace than the bloated European Union will. You overlook the atavistic hatred of American society and culture as a motive for avoiding the war in Iraq. (This might sound vague, but read the British newspapers online for a sense of what I'm driving at).\n\n I have taken Alan's advise and I must admit that my words \"They have their problems\" are an understatement. That said, the dollar reached a new all-time low against the Euro yesterday (for the forth straight day) and dropped to a nearly five-year low against the Yen (later regained ground). The cause of the drop is our deficits and the Feds inability to stop the decline. Our elections are over and the pols are back to business as usual, spending money we don't have on things we don't need and \"staying the course\". The average man/woman on the street has his/her head safely tucked in the sand.\n Dono", 
   {}, 
   76531, 
   null, 
   1101582720.0
  ], 
  [
   79280, 
   null, 
   "daewoo", 
   "I have taken Alan's advise and I must admit that my words \"They have their problems\" are an understatement. That said, the dollar reached a new all-time low against the Euro yesterday (for the forth straight day) and dropped to a nearly five-year low against the Yen (later regained ground). The cause of the drop is our deficits and the Feds inability to stop the decline. Our elections are over and the pols are back to business as usual, spending money we don't have on things we don't need and \"staying the course\". The average man/woman on the street has his/her head safely tucked in the sand.\n Dono\n\n \n The upside to this is, as I have pointed out before, that currency trading has never been simpler.", 
   {}, 
   79218, 
   null, 
   1101602760.0
  ], 
  [
   79281, 
   null, 
   "georged", 
   "I have taken Alan's advise and I must admit that my words \"They have their problems\" are an understatement. That said, the dollar reached a new all-time low against the Euro yesterday (for the forth straight day) and dropped to a nearly five-year low against the Yen (later regained ground). The cause of the drop is our deficits and the Feds inability to stop the decline. Our elections are over and the pols are back to business as usual, spending money we don't have on things we don't need and \"staying the course\". The average man/woman on the street has his/her head safely tucked in the sand.\n Dono\n\n \n Now that the US debt ceiling has again been officially increased, if it doesn't happen this week Japan and China will soon buy a wad of dollars and treasury issues to shore it up somewhat as soon as the flood of Xmas consumer goods has been added to the import tab. That'll shut the administration up for a few weeks until the fed again raises interest rates. I wonder how the average person will react to US Government public political claims of 'letting the dollar float to make US exports more attractive in world markets' when the realization hits them that dollar bills serve family purchasing needs formerly filled by the now somewhat copper $.25 piece. \n \n I'm no longer active in the industry, but the dollar has to be creating nightmares in the international lending community. Are loans still assembled using periodic exchange rate adjustments as the lender hedge or are other factors now involved on a frequent adjustment basis? Ironic in that those tools were formerly in place to protect dollar based investments. Gotta be ugly for dollar people capping off-shore subs no matter what but fun to put together and providing some interesting impacts on financial business models.", 
   {}, 
   79218, 
   null, 
   1101604500.0
  ], 
  [
   79283, 
   null, 
   "georged", 
   "The upside to this is, as I have pointed out before, that currency trading has never been simpler.\n\n \n For big, big, big money. Entry levels for trading funds and exchanges have been raised far beyond the average person's participation ability and those entities are now mixing arbitrage, consulting and other peripheral results in their yields. If you're a Buffet or someone qualified at that grade of investment level you can buy direct. \n \n Or, maybe invest in some of the 'limited' US treasury issues indexed to inflation I've been hearing are being offered to patrons friendly to US policy? If true, that'll put your grandchildren in an economic position equal to waterline rower on a 3-deck slave galley.", 
   {}, 
   79280, 
   null, 
   1101605520.0
  ], 
  [
   79286, 
   null, 
   "daewoo", 
   "For big, big, big money. Entry levels for trading funds and exchanges have been raised far beyond the average person's participation ability and those entities are now mixing arbitrage, consulting and other peripheral results in their yields. If you're a Buffet or someone qualified at that grade of investment level you can buy direct. \n\n \n I disagree. I think that \"average joe\" currency trading is easier than ever, and easier to get into. There are a number of web pages out there, such as forex.com, which are geared towards your small time trader. Of course, you are just trading against the house, and the business is run on the theory (which appears to be sound) that 9-% of people will, even when given the best information available, make the wrong decision and loose their money in the first week.\n \n I am a majority partner in one such enterprise, and it is like having a money machine. There are a very few people who make substantial money (there is one guy who opened his account with $900 and has made about $1000 per week, every week, since the beginning). Most folks open an account wiht $500 or $1000, leverage it 100-1, and immediatly take a rediculous position on the dollar, and llose theri investment. We don't let people go below the cash in their account. Some places do (we are not that greedy).\n \n Give it a try, George. It is kind of fun to play with, and the potential for profit is definatly there if you are not an idiot. Go to forex.com and give it a go. Forex.com is not the one that I am associated with, but you should use them. You, and some others here, seem to have too good a grasp on the realities of our economy for my liking in that scenario. \n \n Of course, for the rest of you, those who think the US economy is in FINE shape, PM me and I will get an account set up for you. Put in a thousand or so. I will happily take your money.", 
   {}, 
   79283, 
   null, 
   1101609120.0
  ], 
  [
   79290, 
   null, 
   "georged", 
   "I disagree. I think that \"average joe\" currency trading is easier than ever, and easier to get into. There are a number of web pages out there, such as forex.com, which are geared towards your small time trader. Of course, you are just trading against the house, and the business is run on the theory (which appears to be sound) that 9-% of people will, even when given the best information available, make the wrong decision and loose their money in the first week.\n \n I am a majority partner in one such enterprise, and it is like having a money machine. There are a very few people who make substantial money (there is one guy who opened his account with $900 and has made about $1000 per week, every week, since the beginning). Most folks open an account wiht $500 or $1000, leverage it 100-1, and immediatly take a rediculous position on the dollar, and llose theri investment. We don't let people go below the cash in their account. Some places do (we are not that greedy).\n \n Give it a try, George. It is kind of fun to play with, and the potential for profit is definatly there if you are not an idiot. Go to forex.com and give it a go. Forex.com is not the one that I am associated with, but you should use them. You, and some others here, seem to have too good a grasp on the realities of our economy for my liking in that scenario. \n \n Of course, for the rest of you, those who think the US economy is in FINE shape, PM me and I will get an account set up for you. Put in a thousand or so. I will happily take your money.\n\n \n Be careful, there are several requote services like Forex, and if a big gun gets in a currency they'll be unable to keep up. I pay $40/yr to my regular full-service broker and he does 30-day fund positions for that plus his house commission on the interbank spread. I just don't have the patience to day trade stocks or currency, but do know several people who make a lot of money out of both. That's really being chained to a PC and loving research.", 
   {}, 
   79286, 
   null, 
   1101610860.0
  ], 
  [
   79298, 
   null, 
   "daewoo", 
   "Be careful, there are several requote services like Forex, and if a big gun gets in a currency they'll be unable to keep up. I pay $40/yr to my regular full-service broker and he does 30-day fund positions for that plus his house commission on the interbank spread. I just don't have the patience to day trade stocks or currency, but do know several people who make a lot of money out of both. That's really being chained to a PC and loving research.\n\n \n We have hedged pretty carefully. The market cannot possibly fluctuate enough atht his point in any direction to do more than bankrupt the endeavor, and frankly we have already pulled enoguh money out of it that the money machine breaking down will not matter much. \n \n I personaly am not a big fan of day trading or spot trading. It is an interesting game though. I have a few thousand dollars in an online account and it gives you something to do when it is raining, or at 3:00 in the morning when you can't sleep. \n \n Personally, I prefer long term positions and when the market fluctuates a little, I do nothing. It is not worth the headache and stress to sit in front of the somputer and egt all excited over every pip. I know that there s more monye to be made by playing every dip and every spike, but as you said, that pretty much chains you to a PC and I have better things to do.", 
   {}, 
   79290, 
   null, 
   1101613500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  While Europe is spending its energy and a lot of resources on struggle against Islami", 
  "url": "http://www.4forums.com/political/news-forum/3598-while-europe-spending-its-energy-lot-resources-struggle-against-islami.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 3598, 
  "discussion_files": [
   [
    "6121.html", 
    "http://www.4forums.com/political/news-forum/3598-while-europe-spending-its-energy-lot-resources-struggle-against-islami-print.html"
   ], 
   [
    "6122.html", 
    "http://www.4forums.com/political/news-forum/3598-while-europe-spending-its-energy-lot-resources-struggle-against-islami-3-print.html"
   ], 
   [
    "6123.html", 
    "http://www.4forums.com/political/news-forum/3598-while-europe-spending-its-energy-lot-resources-struggle-against-islami-2-print.html"
   ]
  ], 
  "identifier": 3598
 }
]