[
 [
  [
   4363, 
   null, 
   "Stormin Norman", 
   "Recently, I had to refute the claim that Gulf War Syndrome was caused by Depleted Uranium. The statement was made by one of the left-wing pinko sources often sited by the verminous communists that I love to debate. The beginning quote is from a Department of Defense source. My argument follows.\n \n \nFrom Commondreams: \"Gulf War exposures to depleted uranium (DU) have not to date produced any observable adverse health effects attributable to DU's chemical toxicity or low-level radiation.\"\n\n \n That's correct. The link between DU and Gulf War Syndrome is a weak one, as are all the conclusions that commondreams usually infers. The journalism here is nothing short of irresponsible. In fact, Gulf war syndrome has been linked to a number of other sources, all of which are chemical in nature. Exposure to pesticides, pills taken to reduce effects of chemical weapon agents, and the destruction of ammunition depots leading to a large scale exposure to nerve agents have all been named as probable sources. There is indication that a combination of these key ingredients could have catalyzed a faster reaction, and aided in breaching the blood/brain barrier leading to the type of brain damage commonly found in people and animals exposed to organophospates. There are really a variety of symptoms claimed by Gulf War Veterans, each exhibiting their own unique characteristics, and each with there own likely explanation. \n \n \"Syndrome 1, commonly found in veterans who wore pesticide-containing flea collars, is marked by impaired cognition.\" \n \n \"Syndrome 2, called confusion ataxia, is the most severe and debilitating. It was found among veterans who said they were exposed to low-level nerve gas and experienced side effects from anti-nerve gas pyridostigmine (PB), tablets....\"It may have been the combination of low-level nerve gas exposure and anti-gas tablets that caused the brain damage underlying (the most severe form of the) syndrome,\" Haley said.\" \n \n \"Syndrome 3, characterized by central pain, is found in veterans who wore insect repellent with high concentrations of DEET, a repellent chemical, and who experienced side effects from the anti-nerve gas tablets.\"\n \n \"As many as 100,000 of the 700,000 U.S. soldiers who served in the Gulf War complain of symptoms, which many attribute to exposure to chemicals.\"\n \n source: CNN\n \n The more general symptoms that Gulf War Veterans claim to suffer from include:\n \n -Fatigue \n -Musculoskeletal pain \n -Cognitive problems \n -Skin rashes \n -Diarrhea \n \n University of Maryland\n \n Since pyridostigmine seems to have acted as a catalyst for the leeching of toxic chemicals to the brain, UC Davis is conducting further research into this very promising lead. Hopefully their work allows for conclusive data that provides insight into the nature of the problem. The following is an explanation of the work they are conducting:\n \n \"We found cell culture and animal evidence indicating an additive (not sparing) effect of organophosphates and pyridostigmine bromide and the passage of pyridostigmine bromide across the blood/brain barrier into the brain of the chicken. Experiments are underway to define the dose conditions in which sarin causes delayed neuropathy in the chicken and whether pyridostigmine bromide will influence the intensity of the effect.\"\n \n source: UC Davis\n \n It would be great if the Defense Department could be offered strong evidence that demonstrates the precise causes for these ailments. It has admitted that as many as 100 thousand troops were probably exposed to agents like Sarin. However, it continues to deny a link, since no long-term effects are known to exist in survivors of exposure levels less than the LD50. \n \n If the one of the stronger explanations, which is the combination of the chemical nerve agent and the counter-drug to facilitate uptake of toxins, could be verified, the DOD would move away from plausible deniability to actually rectifying the situation. It would be irresponsible for our government to do nothing to prevent a further mistake of this magnitude, not to mention it would be detrimental to the recruiting effort. In this case, honesty is the best policy. However, I can understand how they would wish to fully investigate and be absolutely certain of the causes before officially acknowledging the existence of such a syndrome, as it is expensive to simply write checks without conclusive evidence.\n \n Probably the most telling and likely scenarios are the exposure of our men to pesticides. Pesticides containing organophosphates are known to cause the type of mental disorders documented in Gulf War Veterans. The following are some of the effects organophosphates cause:\n \n Action on Human System: Degrade acetylcholinesterase (an enzyme) in the tissues. \n Internal Exposure: Headache, dizziness, weakness, shaking, nausea, stomach cramps, diarrhea, sweating. \n External Exposure: Minimal rashes but readily absorbed through the skin. \n Chronic Exposure: Loss of appetite, weakness, weight loss, and general feeling of sickness. \n Type of Pesticide: Insecticides, acaricides.\n \n Source: Cornell University\n \n These symptoms sound eerily familiar to those suffered by some of the veterans. \n \n \"There is evidence that chronic, low-level exposure to organophosphates, the chemicals used in insecticides and chemical weapons, causes long-term memory loss. The most likely sources of these organophosphates for soldiers include sarin gas and the incredible number and variety of insecticides used by U.S. military forces.\"\n \n source: http://medweb.pc.edu/students/med2001/mcfaden1/medicaltopic.html\n \n Furthermore, these effects can be tracked using the level of chemical derivatives and the signal transducers with respect to normal brain functioning. Concentrations of chemicals found in the cholinergic system have been used to substantiate the belief that organophosphates hinder signaling pathways, and lead to brain damage. \n \n \"Acetylcholine (ACh)is critical for communication between neurons and muscle at the neuromuscular junction,is involved in direct neurotransmission in autonomic ganglia,\n and has been implicated in cognitive processing,arousal, and attention in the brain.\"\n \n source: NEUROTRANSMITTERS AND SIGNAL TRANSDUCTION; by ERIC J.NESTLER AND RONALD S. DUMAN\n \n Organophosphates react with the brain to produce a high concentration of acetylcholine. High levels of Acetylcholine in turn block the nicotinic receptors, and permanently alter signal processing of the brain.\n \n Unlike the DU theory, the link to organophosphates is backed with the evidence, and remains consistent with experimentation done on laboratory animals, and data obtained from farmers who have also been exposed to such compounds. Instead of making up possible scenarios, we should concentrate on the plethora of evidence, which points us in a given direction. The hypothesis seems to warrant the conclusion, for this explanation. These ideas should either be verified or negated, but these theories offer a more likely explanation than the weak case of DU exposure mentioned by commondreams.org. If getting to the truth behind the illnesses our servicemen suffered is your ultimate goal, then you would have no choice but to abandon your view that DU can be implicated as the likely cause of Gulf War Syndrome. Look at the evidence.\n \n I still challenge anyone to provide a single reputable source that can offer the scientific data needed to implicate DU for adverse side-effects of samples exposed to DU by way of either their direct use, or living in the aftermath of DU shelling.", 
   {
    "post_info": {
     "post_title": "Gulf War Syndrome:  Caused by Chemical Compounds Not Radiation"
    }
   }, 
   null, 
   null, 
   1047314040.0
  ], 
  [
   4364, 
   null, 
   "Stormin Norman", 
   "Here is the original source that I was refuting.\n \n CommonDreams", 
   {
    "post_info": {
     "post_title": "CommonDreams Sucks"
    }
   }, 
   4363, 
   null, 
   1047314220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gulf War Syndrome:  Caused by Chemical Compounds Not Radiation", 
  "url": "http://www.4forums.com/political/peace-middle-east/364-gulf-war-syndrome-caused-chemical-compounds-not-radiation.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 364, 
  "discussion_files": [
   [
    "23511.html", 
    "http://www.4forums.com/political/peace-middle-east/364-gulf-war-syndrome-caused-chemical-compounds-not-radiation-print.html"
   ]
  ], 
  "identifier": 364
 }
]