[
 [
  [
   75469, 
   null, 
   "Haulingboat", 
   "Georged is constently going on about finances and government spending. No matter what the thread subject is it always boils down to money.\n \n He, along with many others here, like to blame the war on Iraq and the service economy for the direct decline in the US dollar. Georged claims the only way to correct the impending financial dooms day is for all of us to give up our way of life. No more living beoynd our means(this point we actually agree on) I see people buy things on borrowed money every day. In fact I make a good living burying people in debt,but I'm getting away from my point.\n \n \n I ask why skimp on the protection of the USA. Why not go after terroists. They have made it clear that it is us or them. We need to protect ourselfs. Money spend defending the country against future 9/11s is money well spent, IMHO.\n \n Obviously we have to much money going out and to little money coming in. I say instead of skimping on national defense why don't we turn over the failing government programs to the private sector. We spend far to much on public schooling to be getting the results we have. We spend far to much on fedral and state prisons to be satisfied with the current results. We spend far to much money on medicare and medicade to be happy with the current results.\n \n Capitalism works. Government funded social programs have a long history of failure. I say turn those failures over to the private sector where capitalism will take over and improve the pisspoor results we currently throw money at.\n \n Here is at least one person that sees it my way.\n http://www.findarticles.com/p/articles/mi_m1272/is_n2594_v123/ai_15897222", 
   {
    "post_info": {
     "post_title": "Let's talk about finances"
    }
   }, 
   null, 
   null, 
   1099614240.0
  ], 
  [
   75473, 
   null, 
   "kickin50", 
   "Why not. We privatized garbage collection in many places. See how well that worked. emoticon_rolleyes", 
   {}, 
   75469, 
   null, 
   1099614780.0
  ], 
  [
   75478, 
   null, 
   "jskufan", 
   "Georged is constently going on about finances and government spending. No matter what the thread subject is it always boils down to money.\n\n \n Georged is correct with most, if not all, of his assessments regarding the economic health and future of our economy. Unfortunately, people never want to believe the news when it's critical of their beliefs. The fact is, we have, and are losing valuable, high paying jobs which is causing the erosion of our tax base. Simultaneously, we're spending record amounts of money on social and military programs. If we were a corporation, we'd be bankrupt.", 
   {}, 
   75469, 
   null, 
   1099616100.0
  ], 
  [
   75483, 
   null, 
   "Haulingboat", 
   "Georged is correct with most, if not all, of his assessments regarding the economic health and future of our economy. Unfortunately, people never want to believe the news when it's critical of their beliefs. The fact is, we have, and are losing valuable, high paying jobs which is causing the erosion of our tax base. Simultaneously, we're spending record amounts of money on social and military programs. If we were a corporation, we'd be bankrupt.\n\n I attemp not to discredit georged, rather to seek a solution to the problem. What you say is correct. \n \n As I said earlier we have to much going out and not enough coming in. How we fix that is the topic of discussion here.", 
   {}, 
   75478, 
   null, 
   1099616580.0
  ], 
  [
   75502, 
   null, 
   "jskufan", 
   "I attemp not to discredit georged, rather to seek a solution to the problem. What you say is correct. \n \n As I said earlier we have to much going out and not enough coming in. How we fix that is the topic of discussion here.\n\n \n Well, I know many here don't want to hear it, but defense spending is out of control. In addition to the hundreds of billions allocated under normal budgeting, we have to finance impromptu campaigns like Iraq. We're going to have to make some choices here if we want to continue shaping the Middle East, or dig deeper into your already shrinking wallets. Education, health care, infrastructure, and defense are just a few line item expenditures on our balance sheet and the revenues used to fund them are shrinking. It's really pretty simple, increase revenues or decrease costs. I guess there's always the third option, borrow more and run up the national debt.", 
   {}, 
   75483, 
   null, 
   1099618020.0
  ], 
  [
   75506, 
   null, 
   "daewoo", 
   "Georged is constently going on about finances and government spending. No matter what the thread subject is it always boils down to money.\n\n \n This is likely because an awful lot of what is going on in politics boils down to one of two things:\n \n 1. Trying to cme up with new ways to gain capitol in order to prop up our economy for another 4 years so we can blame the \"other guy\" when the cards finally come tumbling down.\n \n 2. Polishing our GDP in order to keep the American people placated (since an apparently miniscule number of people seem to actually understand how to read economic indicators)\n \n \n \n He, along with many others here, like to blame the war on Iraq and the service economy for the direct decline in the US dollar. Georged claims the only way to correct the impending financial dooms day is for all of us to give up our way of life. No more living beoynd our means(this point we actually agree on) I see people buy things on borrowed money every day. In fact I make a good living burying people in debt,but I'm getting away from my point.\n \n \n I ask why skimp on the protection of the USA. Why not go after terroists. They have made it clear that it is us or them. We need to protect ourselfs. Money spend defending the country against future 9/11s is money well spent, IMHO.\n \n Obviously we have to much money going out and to little money coming in. I say instead of skimping on national defense why don't we turn over the failing government programs to the private sector. We spend far to much on public schooling to be getting the results we have. We spend far to much on fedral and state prisons to be satisfied with the current results. We spend far to much money on medicare and medicade to be happy with the current results.\n \n \nCapitalism works. Government funded social programs have a long history of failure. I say turn those failures over to the private sector where capitalism will take over and improve the pisspoor results we currently throw money at.\n\n \n Does it? it seems to me like capitolism is very much like socialism in this regard. Socialism very well might have worked of the whole world was socialist. Capitolism might have worked if the whole world was capitolist, or if we had at least allowed free trade from the very start (and I mean REAL free trade) with other nations. Instead, we allowed our wages to become disporportionatly high when compared to competitor nations, which led to inflation on a grand scale (did you know that the dollar has lost over 95% of its value in the last 100 years? And 80% of that loss has beeen in the last 50). We have effectivly priced ourselves out of the game. As our corporations saw wages dwindle, they began looking for ways to cut the bottom line, and moving production offshore seemed to be just the ticket. They get their cheap labor, but keep prices high in America. We buy their product, and they use their outragous profit martgin to either hire more overseas help, or they stick it in a bank in the caymans at 12% (yes, this is a pretty standard offering with $25,000 to open, convert it to euros and you can pull an additional 3-5% per year on the exchange rate.....Cap fed is screwing you pretty bad, huh?).\n \n This si the problem, and there is no easy solution to the problem. Switching government programs to the private secotr would do NOTHING to alleviate this.", 
   {}, 
   75469, 
   null, 
   1099618620.0
  ], 
  [
   75536, 
   null, 
   "marc9000", 
   "Well, I know many here don't want to hear it, but defense spending is out of control. \n\n \n SOCIAL SPENDING is out of control and has been for a long time. With only the proper amount of it, we'd have enough for necessary defence spending. :(", 
   {}, 
   75502, 
   null, 
   1099624080.0
  ], 
  [
   75553, 
   null, 
   "jskufan", 
   "SOCIAL SPENDING is out of control and has been for a long time. With only the proper amount of it, we'd have enough for necessary defence spending. :(\n\n \n How much is enough? Do we need the hardware because of our aggressive policies? It might be a \"chicken or the egg\" saga. Everything has it's cost, and with every dollar spent something else gets eliminated.", 
   {}, 
   75536, 
   null, 
   1099628400.0
  ], 
  [
   75564, 
   null, 
   "Mach", 
   "Georged is constently going on about finances and government spending. No matter what the thread subject is it always boils down to money.\n \n He, along with many others here, like to blame the war on Iraq and the service economy for the direct decline in the US dollar. Georged claims the only way to correct the impending financial dooms day is for all of us to give up our way of life. No more living beoynd our means(this point we actually agree on) I see people buy things on borrowed money every day. In fact I make a good living burying people in debt,but I'm getting away from my point.\n \n \n I ask why skimp on the protection of the USA. Why not go after terroists. They have made it clear that it is us or them. We need to protect ourselfs. Money spend defending the country against future 9/11s is money well spent, IMHO.\n \n Obviously we have to much money going out and to little money coming in. I say instead of skimping on national defense why don't we turn over the failing government programs to the private sector. We spend far to much on public schooling to be getting the results we have. We spend far to much on fedral and state prisons to be satisfied with the current results. We spend far to much money on medicare and medicade to be happy with the current results.\n \n Capitalism works. Government funded social programs have a long history of failure. I say turn those failures over to the private sector where capitalism will take over and improve the pisspoor results we currently throw money at.\n \n Here is at least one person that sees it my way.\n http://www.findarticles.com/p/articles/mi_m1272/is_n2594_v123/ai_15897222\n\n \n I don't think it's that simple.\n \n Congress has funded Bush's policies. At least in the begining, the administration went to war before the money could be spent preparing the troops, and the planning. Recall the body armor and Humvee issues, among others, poor use of funds is always a problem when it's not your own sweat and blood that earned the dollar...even the government has to be watched (surprise I know).\n \n It's also surprising to many that Bush would enter a multi-pronged war, AND make a large tax cut, at the same time. Why not though, it's not his personal money, and it does two things for him: Helps him get re-elected (supporting his constituency), and allows him to pursue his admininstration's foreign policy. But who's best interest is it in? That's where the conflict comes..because some people say it's the party that he helps, others say it's 1% of the population and the neo-cons, some say it's the world...\n \n Capitialism works...for some markets. However, the creed of capitalism works against certain human desires:\n \n Health care business: \n Gain revenue from people being sick.\n Thus, more people need to be sick.\n Curing people means less profit.\n Preventitive medicine means less profit.\n \n Business is about profit, and more doctor visits and medicine = good for business. Not a good idea. I do not want more welfare, I do want a smart system that entails the public coming together and making reasonable decisions. Why do you think healthcare is out of sight? It's because capitalism WORKS...against health care, on the large scale.\n \n Regarding poverty programs...there is no money in it, who wants to have people in pverty as a customer? And impovershed people are generally very susceptible to scams that would only make matters worse. To some degree, it's in our best interest, financially, to get those that can work, working. And those that cannot, taken care of responsibly.\n \n Have you seen the $$ America spends on defense in relation to the rest of the world? We DO spend, no matter which party is in control. Enormous amounts of money. Why do we let the government spend OUR money, it's not their money, we give it to them in return for helping us secure our freedom, among other things. Can they be trusted with it? We don't have much choice, but we SHOULD be hawkish about where it's going and how it's being used. What responsible conservative would let the money fly out to no effect, and not balance it with what's coming in?\n \n I think the other key point is that most Americans were all for blowing the smack daddy out of Afghanistan (Terrorists ideally). But when it came to full-scale war, and a prolonged reconstruction in...Iraq...because of WMDs and links to 9/11...when neither have been shown to be true, was the concern. Did that not concern you at least on some level?\n \n -Mach", 
   {}, 
   75469, 
   null, 
   1099632900.0
  ], 
  [
   75584, 
   null, 
   "lord tammerlain", 
   "SOCIAL SPENDING is out of control and has been for a long time. With only the proper amount of it, we'd have enough for necessary defence spending. :(\n\n \n \n In relation to the other western industrialized nations, the US social spending is not out of control. The overall GDP to taxes ratio in the US is the lowest of the industrial world, at around 27% (inflated GDP numbers aside).\n \n Compared to Sweden with a ratio that is above 50%, and Canada, at about 35-38 %.\n \n There may be a lot of waste and ineffectual spending in the US social spending, but in comparison to foreign nations it is at the very low side", 
   {}, 
   75536, 
   null, 
   1099650240.0
  ], 
  [
   75643, 
   null, 
   "Haulingboat", 
   "I don't think it's that simple.\n \n Congress has funded Bush's policies. At least in the begining, the administration went to war before the money could be spent preparing the troops, and the planning. Recall the body armor and Humvee issues, among others, poor use of funds is always a problem when it's not your own sweat and blood that earned the dollar...even the government has to be watched (surprise I know).\n \n It's also surprising to many that Bush would enter a multi-pronged war, AND make a large tax cut, at the same time. Why not though, it's not his personal money, and it does two things for him: Helps him get re-elected (supporting his constituency), and allows him to pursue his admininstration's foreign policy. But who's best interest is it in? That's where the conflict comes..because some people say it's the party that he helps, others say it's 1% of the population and the neo-cons, some say it's the world...\n \n Capitialism works...for some markets. However, the creed of capitalism works against certain human desires:\n \n Health care business: \n Gain revenue from people being sick.\n Thus, more people need to be sick.\n Curing people means less profit.\n Preventitive medicine means less profit.\n \n Business is about profit, and more doctor visits and medicine = good for business. Not a good idea. I do not want more welfare, I do want a smart system that entails the public coming together and making reasonable decisions. Why do you think healthcare is out of sight? It's because capitalism WORKS...against health care, on the large scale.\n \n Regarding poverty programs...there is no money in it, who wants to have people in pverty as a customer? And impovershed people are generally very susceptible to scams that would only make matters worse. To some degree, it's in our best interest, financially, to get those that can work, working. And those that cannot, taken care of responsibly.\n \n Have you seen the $$ America spends on defense in relation to the rest of the world? We DO spend, no matter which party is in control. Enormous amounts of money. Why do we let the government spend OUR money, it's not their money, we give it to them in return for helping us secure our freedom, among other things. Can they be trusted with it? We don't have much choice, but we SHOULD be hawkish about where it's going and how it's being used. What responsible conservative would let the money fly out to no effect, and not balance it with what's coming in?\n \n I think the other key point is that most Americans were all for blowing the smack daddy out of Afghanistan (Terrorists ideally). But when it came to full-scale war, and a prolonged reconstruction in...Iraq...because of WMDs and links to 9/11...when neither have been shown to be true, was the concern. Did that not concern you at least on some level?\n \n -Mach\n\n \n I'm not sure I agree with your assessment of the medical/financial situation we are in.\n \n Now I'm am no expert here but, it seems to me the medical industry went in the toilet after government regulation and the introduction of big insurance HMOs and PPOs.\n The insurance companies started dragging out payments which left the hospitals and doctors holding the bag of unpaid claims. They inturn raised the prices of everything (we have all heard the stories of $12 asprin) in attempt to recover some over money held out by the insurance companies. Couple that with the increase in lawsuit and the resulting dramitic increase in malpractice insurance and we have the current situation we are in.\n \n I believe if we went back to a truely capitalistic medical system where you pay for care recieved the practice of medicine would improve. Now we have a situation where people send in a monthly payment and think it should cover anything and everything they want. We have people going to the emergancy room for any and everything. They don't have to pay the bill so they don't care what it costs. They just send their monthly payment and let the hospital battle the insurance company for the payment, when they could have spent half the money by going to the doctors office instead of the emergancy room.\n \n The current system has taken all the personal money managment out of the health care industry. In many ways it parallels the government spending our tax money. \"It not ours so lets spend away!\"\n \n The vast conspiricy you described can easily be broken by true capitalism. If the whole industry is plotting against good health, it would only take one good advancement that truely worked at curing someones ills and the cycle would be broken. You see if everyone is taken the drugs perscribed by the conspiracy with little improvement and then one lone doctor broke from the pack and sold a true cure, once the word was out the cure would bring long lines and plenty of money to its side. Then another doctor would break from the pack and cure something else while briging in money.\n \n Capitailism provides competition which provides advancement which provides profit and lowers cost to boot.", 
   {}, 
   75564, 
   null, 
   1099681200.0
  ], 
  [
   75651, 
   null, 
   "jskufan", 
   "I think there are a number of factors that have impacted the high costs of medical care:\n \n 1) People are just plain living longer and creating a bigger burden for the working / contributing members.\n 2) Medical liability has got to be passed on to the customer.\n 3) There is a growing number of uninsured that are being cared for and the cost is being absorbed by the paying public.", 
   {}, 
   75643, 
   null, 
   1099682880.0
  ], 
  [
   75698, 
   null, 
   "kickin50", 
   "We spend far to much on public schooling to be getting the results we have. We spend far to much on fedral and state prisons to be satisfied with the current results. We spend far to much money on medicare and medicade to be happy with the current results.\n \n Capitalism works.\nI hope you have a doctorate in something. On your say so, you think we should throw our entire economic structure to the wind -- not to mention societal values. Some have become so caught up in family values (self) that they've forgotten that a society that doesn't educate it's children and care for it's sick isn't civilized.", 
   {}, 
   75469, 
   null, 
   1099692180.0
  ], 
  [
   75700, 
   null, 
   "unkerpaulie", 
   "I ask why skimp on the protection of the USA. Why not go after terroists. They have made it clear that it is us or them. We need to protect ourselfs. Money spend defending the country against future 9/11s is money well spent, IMHO.\n\n here is where my aggravation meter runs thrugh the ceiling (not at you, hauling)\n \n we are spending hundreds of billions of dollars on LIBERATINING IRAQ. liberating iraq is NOT an anti-terrorism activity. as much as we would like it to be, as much as we would convince ourselves it is, as much as we put faith in bush, the reality is, liberating iraq CANNOT help us defeat terrorism. i wish somebody could explain to me HOW liberating iraq (whilst in the midst of terrorist countries) can help reduced terrorism. \n \n with or without iraq and saddam, bin laden right now has everything he needs to cause another 9/11\n - a network of terrorists\n - money to fund his operation\n - an american public that is oblivious to his activity and whereabbouts\n \n so what ARE we spending all that money on?", 
   {}, 
   75469, 
   null, 
   1099692960.0
  ], 
  [
   75703, 
   null, 
   "jim's trucking", 
   "Why not. We privatized garbage collection in many places. See how well that worked. emoticon_rolleyes\nIt's worked pretty well in my area. Every time a new company comes on board, the competition gets stronger and the prices go down. Their business is picking up!", 
   {}, 
   75473, 
   null, 
   1099693380.0
  ], 
  [
   75712, 
   null, 
   "Dono", 
   ".\n \n I believe if we went back to a truely capitalistic medical system where you pay for care recieved the practice of medicine would improve. Now we have a situation where people send in a monthly payment and think it should cover anything and everything they want. We have people going to the emergancy room for any and everything. They don't have to pay the bill so they don't care what it costs. They just send their monthly payment and let the hospital battle the insurance company for the payment, when they could have spent half the money by going to the doctors office instead of the emergancy room.\n\n \n Here are some numbers that will probably cheer you considerably, there are over 44 million Americans without health insurance and the number is climbing as employers lower overhead by reducing or eliminating benefits, or by reducing hours or using contract labor, or sending jobs off shore. It is interesting that while affordable insurance is unavailable to this group of Americans, 25 million Iraqis are to receive universal health care funded by us as part of the rebuilding of Iraq.\n I assume that you do not have medical insurance and have elected to practice what you preach and \"pay the bill\" yourself. If that is true (is it?), then good luck ... you will need it.\n \n \nThe current system has taken all the personal money managment out of the health care industry. In many ways it parallels the government spending our tax money. \"It not ours so lets spend away!\"\n \n The vast conspiricy you described can easily be broken by true capitalism. If the whole industry is plotting against good health, it would only take one good advancement that truely worked at curing someones ills and the cycle would be broken. You see if everyone is taken the drugs perscribed by the conspiracy with little improvement and then one lone doctor broke from the pack and sold a true cure, once the word was out the cure would bring long lines and plenty of money to its side. Then another doctor would break from the pack and cure something else while briging in money.\n \n Capitailism provides competition which provides advancement which provides profit and lowers cost to boot.\n\n \n You stated that you are not an expert on this subject ... probably the most accurate statement I have read from you, and for once we are in complete agreement. I spent over five years working with doctors and managers automating medical groups, hospitals and clinics so, while certainly not an expert, I have some insight. First, I find any \"easy\" solution to a complex problem to be suspect. Since insurance companies and hospitals are publicly held for-profit entities, I submit that they are capitalism at work. The drugs you referred to are produced by pharmaceutical corporations in direct competition with other like corporations ... is that not capitalism? Do some insured abuse their privileges? Absolutely, but I believe most emergency rooms are filled with people with genuine needs. Personally, I have always found that a trip to my doctor is always more pleasant than a trip to the emergency room. I'm an advocate of free enterprise, as unfettered by government as possible, and it may well be an ingredient in a recipe for better delivery of health services, but a panacea it is not.\n Dono", 
   {}, 
   75643, 
   null, 
   1099695840.0
  ], 
  [
   75714, 
   null, 
   "kickin50", 
   "If that's true, you're the first lucky person I've ever heard of. Personally, I've never seen a 2nd company come on board much less a new one. There's one - one only - and they charge at will. My in-laws (in NY) get charged BY THE BAG. My nephew (in NC) takes his garbage to the dump himself.", 
   {}, 
   75703, 
   null, 
   1099696140.0
  ], 
  [
   75738, 
   null, 
   "pnac=ww3", 
   "\n I ask why skimp on the protection of the USA. Why not go after terroists. They have made it clear that it is us or them. We need to protect ourselfs. Money spend defending the country against future 9/11s is money well spent, IMHO.\n\n \n Before 9/11 we spent about $350 billion on defense a year. That's many times more than the next highest (Russia). Then after 9/11, we increased spending to above $400 billion. The increase was higher than Russia's defense budget. We develop high tech weapons systems, aircraft, submarines, missiles, on and on. \n \n None of that stopped 9/11.\n \n If a billion dollar weapon system can stop some guys with box cutters from hijacking planes, then I'd like to see it.\n \n The thing that would have stopped 9/11 was better coordination of intellegence and law enforcement, not expensive weapons.\n \n Republicans uses 9/11 as an excuse to divert yet more of the GDP to defense contractors and weapons developers. Yet all this money spent on weapons can't take the place of competent intellgence gathering.", 
   {}, 
   75469, 
   null, 
   1099702980.0
  ], 
  [
   75740, 
   null, 
   "pnac=ww3", 
   "SOCIAL SPENDING is out of control and has been for a long time. With only the proper amount of it, we'd have enough for necessary defence spending. :(\n\n \n Defense spending is out of control and has been for a long time. With only the proper amount of it, we'd have enough for necessary social spending. :(", 
   {}, 
   75536, 
   null, 
   1099703640.0
  ], 
  [
   75745, 
   null, 
   "Haulingboat", 
   "Here are some numbers that will probably cheer you considerably, there are over 44 million Americans without health insurance and the number is climbing as employers lower overhead by reducing or eliminating benefits, or by reducing hours or using contract labor, or sending jobs off shore. It is interesting that while affordable insurance is unavailable to this group of Americans, 25 million Iraqis are to receive universal health care funded by us as part of the rebuilding of Iraq.\n I assume that you do not have medical insurance and have elected to practice what you preach and \"pay the bill\" yourself. If that is true (is it?), then good luck ... you will need it.\n \n \n \n You stated that you are not an expert on this subject ... probably the most accurate statement I have read from you, and for once we are in complete agreement. I spent over five years working with doctors and managers automating medical groups, hospitals and clinics so, while certainly not an expert, I have some insight. First, I find any \"easy\" solution to a complex problem to be suspect. Since insurance companies and hospitals are publicly held for-profit entities, I submit that they are capitalism at work. The drugs you referred to are produced by pharmaceutical corporations in direct competition with other like corporations ... is that not capitalism? Do some insured abuse their privileges? Absolutely, but I believe most emergency rooms are filled with people with genuine needs. Personally, I have always found that a trip to my doctor is always more pleasant than a trip to the emergency room. I'm an advocate of free enterprise, as unfettered by government as possible, and it may well be an ingredient in a recipe for better delivery of health services, but a panacea it is not.\n Dono\n\n Actually I participate in a HSA mucgh like W has purposed. I forces me to manage money in the account and not waste it in the ER when avoidable.\n \n \n I to know a little about the health care industry.(BTW,thanks for pointing out my level of expertice) While I was in Jr High my father was diagnosted with a hereditary (sp?) Kidney disease. His employer sponsored insurance promptly canceled coverage. Since his kidneys no longer filtered blood he was forced to attend dialosis twice aweek. Paying as he went each time. Finally the night came and he got the call. A kidney match had been located and he was to report immediatly to the hospital two hundred miles away. He spent the next month in the hospital. I never missed a meal. He never missed a payment. Being in sales, he never quit work. His hospital room became his sales office and the phone became his showroom. He payed the medical bills while laying in the hospital.\n \n Four years later he got the chance to do it all over again. The rejection medicine began top fail. In an attempt to level things out the doctors prescribed rejection medicine derived from horse serum. It put him in the ICU for eight days. Lawyers were begging him to sue the hospital and the doctors. He wouldn't. Instead he went back on the organ donor list and started the perocess all over again. \n \n He has now recieved two kidney transplants and payed for both of them on his nickel. He never filed bankruptcy. He never asked for help from anyone. My mother never worked a day outside the house. He is now living on bonus time. He was smart with his cash lives a very nice lifestyle.\n \n Being hereditary I get to look forward to much of the same. Medicine has come quit ahead of where it was when he got his first transplant, so I don't expect to have things quit as rough as he did. I do, however, plan on spending plenty of my own money on the event. I could hold my hand out and ask all of you to pay for it thru medicare, but I don't believe you should have to pay to keep me alive.\n \n Dono, if you live your life without preparing for emergancies in the future then you have a tough road ahead. Only the very few get thru this life without incurring serious medical situations that require the payment of serious medical bills. \n \n You have a choice. Be part of the problem or be part of the solution. Where do you fall?", 
   {}, 
   75712, 
   null, 
   1099704480.0
  ], 
  [
   75746, 
   null, 
   "Haulingboat", 
   "Before 9/11 we spent about $350 billion on defense a year. That's many times more than the next highest (Russia). Then after 9/11, we increased spending to above $400 billion. The increase was higher than Russia's defense budget. We develop high tech weapons systems, aircraft, submarines, missiles, on and on. \n \n None of that stopped 9/11.\n \n If a billion dollar weapon system can stop some guys with box cutters from hijacking planes, then I'd like to see it.\n \n The thing that would have stopped 9/11 was better coordination of intellegence and law enforcement, not expensive weapons.\n \n Republicans uses 9/11 as an excuse to divert yet more of the GDP to defense contractors and weapons developers. Yet all this money spent on weapons can't take the place of competent intellgence gathering.\n\n \n Defense spending includes intelligence does it not?", 
   {}, 
   75738, 
   null, 
   1099704660.0
  ], 
  [
   75749, 
   null, 
   "jskufan", 
   "Defense spending includes intelligence does it not?\n\n \n http://www.access.gpo.gov/int/int011.html", 
   {}, 
   75746, 
   null, 
   1099705260.0
  ], 
  [
   75764, 
   null, 
   "marc9000", 
   "Defense spending is out of control and has been for a long time. With only the proper amount of it, we'd have enough for necessary social spending. :(\n\n \n Is ALL social spending necessary according to you? Is there any at all that you deem just a little bit wasteful?\n \n I possibly should have used the term \"domestic spending\" rather than \"social spending\". Social spending IMO mainly involves redistributing tax money. Domestic spending involves much more, including government bureacracies' appetite. The environment can NEVER be clean enough, we can NEVER be safe enough, if these agencies are to continue to keep their hungry mouths pressed against the taxpayers sweet flowing breast. There will ALWAYS be more and more costly regulation to private business, costly in ways besides taxes. New diesel \"soot\" regulations come to mind. Required abandoning proven engine designs, and coming up with new ones. Never mind that the new designs aren't proven as far as reliability, and get lousier fuel milage. Never mind that companies alter the way they make decisions about when they are going to buy new trucks, or how they adjust their prices with worse fuel milage. It has a domino effect through the entire economy, right down to the products we all buy. It can't really be measured, but it can generally be seen if we open our eyes. \n \n Domestic spending goes on where we live and work. \"The people\" are much more capable of sizing up what is necessary and what is not with domestic spending than they are with defence. Relations with foriegn countries are the government's job. Anything the people know about it, our enemies know. We're kidding ourselves if we think we know enough about foriegn threats to ridicule those who really are in charge of taking care of it.", 
   {}, 
   75740, 
   null, 
   1099709220.0
  ], 
  [
   75765, 
   null, 
   "Dono", 
   "Hauling - Interesting story about your father, obviously a man to be admired. I sincerely hope that you are spared his ordeal and that you live a long and healthy life. That said, everything in my post was true. I am sure we agree on many things re the delivery of health care. I witnessed many inefficiencies. One example is insurance forms that have to be completed and filed, if a clinic deals with five insurance companies, then five DIFFERENT claim forms have to be completed and filed at five different locations, and it gets more complicated if they are Medicare supplement claims. It seems to me that a common form could do the job just as well, but that would probably require the government to step in.\n The truth is that the majority of Americans will never be able to afford major surgical procedures on their own, the numbers are there to see. I have paid fire insurance on my house for over 30 years and I have never had a fire. If my premiums go to replace another man's destroyed house, I have no problems with that.\n I live in comfortable retirement with my health needs covered, partly because I avoided unnecessary debt, saved and invested and partly because I was just plain lucky and was never stricken as others have been.\n Dono", 
   {}, 
   75749, 
   null, 
   1099710720.0
  ], 
  [
   75807, 
   null, 
   "daewoo", 
   "I think that you are missing the point of insurance, haulingboat. Ity is specifically designed to spread risk among a large number of people. true it is a bit like gambling, but it is a gamble worth taking.\n \n My wife just had a baby. Tehre were complications and a C-section was required. total cost-----$32,000.00\n \n A coupel months ago I had an accident and spent several days in the hospital and had a half dozen surgeries. Total cost...$271,392.24\n \n True, I suppose I could have said \"screw the insurance\" years ago and paid this out of pocket. Not the smart thing to do. \n \n If you can get insurance, you should get it. If you can't afford it, that is too bad, but if you can, you should have it. \n \n I am glad that you have your own HSA saet up. i hope there is at least a half million dollars in it. If not, you could end up making payments to the hospital for a long time in the event of a major medical event. Hospitals are set up as cash and carry enterprises. By forcing them to finance your debt, you cause prices to rise for the rest of us.", 
   {}, 
   75765, 
   null, 
   1099723620.0
  ], 
  [
   75856, 
   null, 
   "kickin50", 
   "Where have all the pragmatists gone? Where have all the goal-oriented people gone? The United States is 24th in the world for life expectancy. You can't find a solution until you properly identify the problem.", 
   {}, 
   75807, 
   null, 
   1099763040.0
  ], 
  [
   75864, 
   null, 
   "Mach", 
   "Where have all the pragmatists gone? Where have all the goal-oriented people gone? The United States is 24th in the world for life expectancy. You can't find a solution until you properly identify the problem.\n\n \n To the democratic party?\n http://slate.msn.com/id/2109218/\n \n Problems don't need to be identified, they are either FOR, or AGAINST the party...\n \n Karl Rove has shown us again, at least in his battles, that solutions and understanding take a back seat to ignorance.\n \n -Mach", 
   {}, 
   75856, 
   null, 
   1099764960.0
  ], 
  [
   75867, 
   null, 
   "georged", 
   "In relation to the other western industrialized nations, the US social spending is not out of control. The overall GDP to taxes ratio in the US is the lowest of the industrial world, at around 27% (inflated GDP numbers aside).\n \n Compared to Sweden with a ratio that is above 50%, and Canada, at about 35-38 %.\n \n There may be a lot of waste and ineffectual spending in the US social spending, but in comparison to foreign nations it is at the very low side\n\n \n And, as with many published government numbers, that one is also deceiving. As the US tax base shrinks, federal social expenses are being pushed down to state/municipal levels by reduced tax revenue sharing in the attempt to make federal defense deficit spending appear less ominous. In prosperous times, such a move would be indicative of less federal government, but, unfortunately, those expenses are being relocated complete with cumbersome and expensive federal compliance, operating and reporting statutes. Those unfortunate states without constitutional caps on various forms of taxation are already incurring serious general debt at presently low interest rates to meet their obligations without the requirement of assigning that debt to defined revenue streams. People seem to ignore the fact that it takes X dollars to operate government regardless of where X comes from, revenue or debt. \n \n All US government spending other than for military purposes and bureaucratic establishments is far below GDP percentages experienced by other industrialized nations. Two results of that domestic policy are the US having the highest per-capita prison population and the highest percentage of consumer GDP spending in that group.", 
   {}, 
   75584, 
   null, 
   1099767900.0
  ], 
  [
   75868, 
   null, 
   "georged", 
   "Where have all the pragmatists gone? Where have all the goal-oriented people gone? The United States is 24th in the world for life expectancy. You can't find a solution until you properly identify the problem.\n\n \n The smart ones are trying to hedge the dollar.", 
   {}, 
   75856, 
   null, 
   1099768080.0
  ], 
  [
   75876, 
   null, 
   "lord tammerlain", 
   "And, as with many published government numbers, that one is also deceiving. As the US tax base shrinks, federal social expenses are being pushed down to state/municipal levels by reduced tax revenue sharing in the attempt to make federal defense deficit spending appear less ominous. In prosperous times, such a move would be indicative of less federal government, but, unfortunately, those expenses are being relocated complete with cumbersome and expensive federal compliance, operating and reporting statutes. Those unfortunate states without constitutional caps on various forms of taxation are already incurring serious general debt at presently low interest rates to meet their obligations without the requirement of assigning that debt to defined revenue streams. People seem to ignore the fact that it takes X dollars to operate government regardless of where X comes from, revenue or debt. \n \n All US government spending other than for military purposes and bureaucratic establishments is far below GDP percentages experienced by other industrialized nations. Two results of that domestic policy are the US having the highest per-capita prison population and the highest percentage of consumer GDP spending in that group.\n\n \n Not following the state governments current deficiet spending could you provide some numbers. State level spending doesnt get much press where I am. I do know that San Diego is behind on its pension funding for its employees though.\n \n One thing I dissagree with in regards to both the US and Canada is the disparity in public school funding. Where suburbs often get the highest funding for schools due to property taxes while the inner city recieve generally a lot less. A well educated population is essential to the well being of an economy. Having even a small percentage of the population recieving a poor education is poor policy. An educated workforce is a better workforce.", 
   {}, 
   75867, 
   null, 
   1099773360.0
  ], 
  [
   75886, 
   null, 
   "georged", 
   "Not following the state governments current deficiet spending could you provide some numbers. State level spending doesnt get much press where I am. I do know that San Diego is behind on its pension funding for its employees though.\n\n \n Without looking at each state on an individual basis, I don't have personal access to those charts. My bond trader subscribes to those services and we were looking at them a couple of weeks ago, along with the various ratings, as he made his point about giving up yield by selecting bonds tied to state constitution payment priorites such as education and public safety as versus general obligation. The escalation began three years ago with especially the past two years fueled by falling revenues and low-cost interest rationalizations. California's recent $15-billion general obligation bond issue to make ends meet on a budget revenue shortfall is a graphic example.", 
   {}, 
   75876, 
   null, 
   1099779120.0
  ], 
  [
   76050, 
   null, 
   "Dono", 
   "It has been said that numbers don't lie, but people lie with numbers. Politicians toss numbers around while most of the public just nods in agreement or disagreement depending on whether the political affiliation of the speaker matches theirs. The President has said that he will overhaul Social Security and revamp the tax system while reducing the deficit by half in five years, the equivalent of 2+2=3. The nonpartisan Congressional Budget Office sees $2.3 trillion in deficits over the next ten years, not including the costs of the wars in Iraq/Afg and the effect of baby boomer's on federal programs. I'm not talking about merits (or lack of same) of the proposals, just the numbers the majority seems ready to accept, namely reducing the deficit. \n Reshape Social Security by allowing workers to use some taxes to open personal savings accounts .... 10 year cost = $1-2 trillion.\n Make tax cuts permanent by decade's end .... around $1 trillion.\n Iraq/Afg wars .... $100 billion a year for ? years.\n A word of advise; Elect whoever you want, a sacred right, but do not buy used car from him.\n Dono", 
   {}, 
   75886, 
   null, 
   1099858140.0
  ], 
  [
   76057, 
   null, 
   "georged", 
   " Elect whoever you want, a sacred right, but do not buy used car from him. Dono\n\n \n It's always interesting to hear politicians promise more to the voters, but in my ignorance I always see it coming out of my other pocket, public debt, in far larger amounts than what they promise I'll get. Maybe I'm just not patriotic enough. That's it, I need to close my eyes and cross my fingers when I wave the flag.", 
   {}, 
   76050, 
   null, 
   1099860240.0
  ], 
  [
   76074, 
   null, 
   "kickin50", 
   "It has been said that numbers don't lie, but people lie with numbers. Politicians toss numbers around while most of the public just nods in agreement or disagreement depending on whether the political affiliation of the speaker matches theirs. The President has said that he will overhaul Social Security and revamp the tax system while reducing the deficit by half in five years, the equivalent of 2+2=3. The nonpartisan Congressional Budget Office sees $2.3 trillion in deficits over the next ten years, not including the costs of the wars in Iraq/Afg and the effect of baby boomer's on federal programs. I'm not talking about merits (or lack of same) of the proposals, just the numbers the majority seems ready to accept, namely reducing the deficit. \n Reshape Social Security by allowing workers to use some taxes to open personal savings accounts .... 10 year cost = $1-2 trillion.\n Make tax cuts permanent by decade's end .... around $1 trillion.\n Iraq/Afg wars .... $100 billion a year for ? years.\n A word of advise; Elect whoever you want, a sacred right, but do not buy used car from him.\n Dono\nWe, as a family, on Monday, November 1, ( the night before the election) dercided that we would have some fun with the next Bush supporter that rang our phone. We planned to keep the next sucker on the phone as long as possible asking questions. It would also be useful to Kerry, we concluded, because as long as we used his time, he couldn't call anybody else. LMAO My first question was about the Social Security reform. First, I asked if there was any magic age where it was encouraged or required or even projected that people would utilize this opt out option. Of course, he didn't know. The plan is sketchy to say the least. His answer was that it's totally optional. Next I pointed out that as a 55 year old, Social Security uses your last 10 years of contributions/earnings to determine benefits. So, anybody at or very near 55 would be a fool to opt out. Therefore, god willing, he can still be paying for me 30 years from now. That left him quite speechless. Then I handed the phone to my \"undecided\" husband. Then the phone went to my son. He gave up on our vote after about an hour.\n \n He also pointed out that he was just tired of politicians and GWB was the guy because he came from a farm in Texas. We had our laughs for the evening.", 
   {}, 
   76050, 
   null, 
   1099869780.0
  ], 
  [
   76075, 
   null, 
   "jim's trucking", 
   "We, as a family, on Monday, November 1, ( the night before the election) dercided that we would have some fun with the next Bush supporter that rang our phone. We planned to keep the next sucker on the phone as long as possible asking questions. It would also be useful to Kerry, we concluded, because as long as we used his time, he couldn't call anybody else. LMAO My first question was about the Social Security reform. First, I asked if there was any magic age where it was encouraged or required or even projected that people would utilize this opt out option. Of course, he didn't know. The plan is sketchy to say the least. His answer was that it's totally optional. Next I pointed out that as a 55 year old, Social Security uses your last 10 years of contributions/earnings to determine benefits. So, anybody at or very near 55 would be a fool to opt out. Therefore, god willing, he can still be paying for me 30 years from now. That left him quite speechless. Then I handed the phone to my \"undecided\" husband. Then the phone went to my son. He gave up on our vote after about an hour.\n \n He also pointed out that he was just tired of politicians and GWB was the guy because he came from a farm in Texas. We had our laughs for the evening.\nAs it worked out, he didn't need your vote. :)", 
   {}, 
   76074, 
   null, 
   1099869960.0
  ], 
  [
   76202, 
   null, 
   "kickin50", 
   "As it worked out, he didn't need your vote. :)\nSo true, but we may have gotten his. My son, with a degree in economics, gave him a 20 minute crash course. Our solicitors answers just kept coming slower and slower. That same son, who couldn't in good conscience vote for GWB thinks his personal financial future is pretty bright right now. He's in the financial field and is ready to sit back and suck in what he can for as long as he can.", 
   {}, 
   76075, 
   null, 
   1099929420.0
  ], 
  [
   76216, 
   null, 
   "georged", 
   "So true, but we may have gotten his. My son, with a degree in economics, gave him a 20 minute crash course. Our solicitors answers just kept coming slower and slower. That same son, who couldn't in good conscience vote for GWB thinks his personal financial future is pretty bright right now. He's in the financial field and is ready to sit back and suck in what he can for as long as he can.\n\n \n 'Came from a farm in Texas'. That should make Bush's political strategists satisfied; even their telephone solicitors believed and repeated the deceptions. \n \n There are no easy answers to the US economy that aren't accompanied by some pretty draconian measures. For anyone with a decent education and personal motivation that they're capable of applying to demand, there's always money to be made. Most others will eventually be far less fortunate.", 
   {}, 
   76202, 
   null, 
   1099932780.0
  ], 
  [
   76342, 
   null, 
   "pnac=ww3", 
   "Defense spending includes intelligence does it not?\n\n \n And?....\n It still didn't stop 9/11.\n \n Ok, why is the same metality that produces \"6 billion for crappy schools? That's outrageous\"\n \n is the same mentality that has no problem with \"god knows how many billions for a crappy intellegence system, so we need to spend more\"\n \n What I'm trying to say is we can't spend our way our of the problems we face, especially when it comes to our shoddy intellgence services. I forget where I saw it (well it was on C-span) but someone was saying that our laws and intellegence culture have turned our intellegence services into a joke. They are far from the best and in some respects we are amongst the worst.\n \n As far as defense pork, there is a very nice book about this. I plan on picking it up. It was on C-span's Booknotes:\n \n http://www.amazon.com/exec/obidos/ASIN/159114938X/qid=1099953723/sr=2-1/ref=pd_ka_b_2_1/102-6037602-3171367\n \n http://www.booknotes.org/Program/?ProgramID=1805\n \n Anyway, it was interesting.\n \n .", 
   {}, 
   75746, 
   null, 
   1099961040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Let's talk about finances", 
  "url": "http://www.4forums.com/political/politics-debates/3642-lets-talk-about-finances.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3642, 
  "discussion_files": [
   [
    "29997.html", 
    "http://www.4forums.com/political/politics-debates/3642-lets-talk-about-finances-print.html"
   ], 
   [
    "29998.html", 
    "http://www.4forums.com/political/politics-debates/3642-lets-talk-about-finances-3-print.html"
   ], 
   [
    "29999.html", 
    "http://www.4forums.com/political/politics-debates/3642-lets-talk-about-finances-2-print.html"
   ]
  ], 
  "identifier": 3642
 }
]