[
 [
  [
   75611, 
   null, 
   "wsm2506", 
   "It never ceases to amaze (and amuse me) at the vast number of hetrosexuals that claim knowledge, insight, and expertise of homosexuality, the cause(s) of homosexuality, \"cures\" for homosexuality, homosexual lifestyles and relationships, and absolute knowledge of what is \"right\" for mankind. They would have you believe that they know more about homosexuality than any homosexual person ever could!! \n \n What drive their interest in homosexuality? How do they gain their insight? What are they hoping to prove or accomplish?\n \n Seriously, I am a 54 year old homosexual male. I have known I was \"different\" since a very early age (at least age 13), accepted myself as \"gay\" at age 18, lived in and around the gay community for 36 years, know hundreds if not thousdand of gay people, and lost a long time partner and many friends to AIDS. How can these people possibly claim to know more about homosexuality than I or anyone else who has lived with it every day of their lives for years? \n \n I would interested to hear from both sides of this on this question.", 
   {
    "post_info": {
     "post_title": "Hetrosexual &quot;experts&quot; on homosexuality."
    }
   }, 
   null, 
   null, 
   1099672200.0
  ], 
  [
   75622, 
   null, 
   "OccamsRazor", 
   "I think your post is very perceptive and shows the intrinsic risk everyone faces when making absolute judgements on subjects they have no personal experience of.\n \n I can only apologise for my fellow heteroexuals ignorance and bigotry emoticon_emb", 
   {}, 
   75611, 
   null, 
   1099676220.0
  ], 
  [
   75642, 
   null, 
   "unkerpaulie", 
   "can a doctor that has never had asthma understand more about asthma than a child who has had it all his life?\n \n do not equate experience with understanding. there are countless examples of things that can be understood without have to experience it, even better than those that do experience it. i agree that the personal, emotional aspects can never be felt in a more real way than to the person that is going through the situation, but understanding how something works or what it does doesnt always require being in that position", 
   {}, 
   75622, 
   null, 
   1099680960.0
  ], 
  [
   75654, 
   null, 
   "wsm2506", 
   "can a doctor that has never had asthma understand more about asthma than a child who has had it all his life?\n \n do not equate experience with understanding. there are countless examples of things that can be understood without have to experience it, even better than those that do experience it. i agree that the personal, emotional aspects can never be felt in a more real way than to the person that is going through the situation, but understanding how something works or what it does doesnt always require being in that position\n\n \n So, am I to understand that all these hetrosexuals are, in fact, experts about homosexuality to the extent the doctor you mention in your example is an expert in his field? This hypothetical doctor has gone through many years of education, training, and experience to achieve his expertise. How do these hetrosexuals in question gain their expertise about homosexuality?\n \n And one more question; why are these hetrosexuals so intrested in homosexuality to begin with?", 
   {}, 
   75642, 
   null, 
   1099683240.0
  ], 
  [
   75674, 
   null, 
   "jitobear", 
   "I'd say it's because they are self-righteous and arrogant, and because they looking for justification for their prejudice in a world that frowns on prejudice more and more.", 
   {}, 
   75654, 
   null, 
   1099687980.0
  ], 
  [
   75683, 
   null, 
   "Haulingboat", 
   "I don't claim to know much at all about Homosexuallity. I have challenge you to show me one instance where I have attemptted to push \"knowledge, insight, or expertise\" on anyone in the thread.\n \n I do have an opinion as to why homosexual marriage should not be recognized by our government. I have stated those opinions as clearly and logically as I know how. I avoid going beyond my opinion into the land of speculation or fact, due to my lack of knowledge to back up any such statement. \n \n If you don't like my opinion then don't come to website that incourages their expression.", 
   {}, 
   75674, 
   null, 
   1099689240.0
  ], 
  [
   75693, 
   null, 
   "wsm2506", 
   "I don't claim to know much at all about Homosexuallity. I have challenge you to show me one instance where I have attemptted to push \"knowledge, insight, or expertise\" on anyone in the thread.\n \n I do have an opinion as to why homosexual marriage should not be recognized by our government. I have stated those opinions as clearly and logically as I know how. I avoid going beyond my opinion into the land of speculation or fact, due to my lack of knowledge to back up any such statement. \n \n If you don't like my opinion then don't come to website that incourages their expression.\n\n \n I had no intention nor did I refer to you personally. It is unfortunate that you took offense.\n \n You are correct about offering one's opinions. I have never said otherwise nor challenged anyone as to their comments being either opinion or fact.", 
   {}, 
   75683, 
   null, 
   1099691460.0
  ], 
  [
   75696, 
   null, 
   "joebrummer", 
   "I don't claim to know much at all about Homosexuallity. I have challenge you to show me one instance where I have attemptted to push \"knowledge, insight, or expertise\" on anyone in the thread.\n \n I do have an opinion as to why homosexual marriage should not be recognized by our government. I have stated those opinions as clearly and logically as I know how. I avoid going beyond my opinion into the land of speculation or fact, due to my lack of knowledge to back up any such statement. \n \n If you don't like my opinion then don't come to website that incourages their expression.\n\n \n \n Post on other thread \n \n \nJp has it correct, why should homosexuals be afforded a special right because they choose an alternative lifestyle?\n \n The recent election proved the homosexual minority is just that, a small minority. Yet you insist in craming your sexuality down the majorities throat. Homosexulas have taken over television and hollywood thus forcing the majority of hetros to put up with homos if we wish to view TV or movies.\n \n We do not want to legitamize homosexuality. We will not allow it to be an accepted part of the country we keep.\n\n \n \n \n So, if you don't know much about it how do you know it's a choice? If you don't know much about, why don't you stop commenting listen, talk to homosexuals, ask questions, LEARN, then make an educated decision. I am sure your intentions are good, but you should really learn about a subkect before you make all these comments on it like you are some expert.", 
   {}, 
   75683, 
   null, 
   1099691880.0
  ], 
  [
   75697, 
   null, 
   "unkerpaulie", 
   "So, am I to understand that all these hetrosexuals are, in fact, experts about homosexuality to the extent the doctor you mention in your example is an expert in his field? This hypothetical doctor has gone through many years of education, training, and experience to achieve his expertise. How do these hetrosexuals in question gain their expertise about homosexuality?\n \n And one more question; why are these hetrosexuals so intrested in homosexuality to begin with?\n\n homosexuality is an identity, a behavior and a preference. people that have some knowledge in these areas would have a technical understanding of some aspects of homosexuality, be they hetero or not\n \n the \"interest\" between homosexuals and heterosexuals goes both ways. yes, it largely stems from religious dogma, but it also has to do with acceptance and justification. for a religious heterosexual, homosexuality goes against thier beliefs, and is \"wrong\" as far as they are concerned. homosexuals, seeking acceptance and justification, would obviously be upset by the opinions of such heteros\n \n so the problem is two-fold. either 1) heteros stop \"judging\" gays or 2)gays stop seeking \"approval\" from heteros, and the whole problem will disappear", 
   {}, 
   75654, 
   null, 
   1099692120.0
  ], 
  [
   75715, 
   null, 
   "wsm2506", 
   "homosexuality is an identity, a behavior and a preference. people that have some knowledge in these areas would have a technical understanding of some aspects of homosexuality, be they hetero or not\n \n the \"interest\" between homosexuals and heterosexuals goes both ways. yes, it largely stems from religious dogma, but it also has to do with acceptance and justification. for a religious heterosexual, homosexuality goes against thier beliefs, and is \"wrong\" as far as they are concerned. homosexuals, seeking acceptance and justification, would obviously be upset by the opinions of such heteros\n \n so the problem is two-fold. either 1) heteros stop \"judging\" gays or 2)gays stop seeking \"approval\" from heteros, and the whole problem will disappear\n\n \n How does expecting the same civil rights as hetrosexuals enjoy constitue \"seeking \"approval\" from hetros\"? How does it constitues \"...craming your sexuality down the majorities throat.\" as \"Haulingboat\" states above?\n \n Why should \"Haulingboat\" (as quoted above) consider the same civil rights he enjoys as \"special rights\" when applied to homosexuals? What is \"special\" about them?", 
   {}, 
   75697, 
   null, 
   1099696200.0
  ], 
  [
   75852, 
   null, 
   "wsm2506", 
   "Hmmmmmmmmm\n \n It seems none of the self proclaimed hertosexual \"experts\" on homosexuality can answer my questions. I think I understand why, now.\n \n They have no \"logical\" answers. Having no logical answers, they fall back upon \"theological\" responses and retorical orations of religious right dogma. Most of them know very little if any real theology, they merely parrot the so-called regilious right like of Gerry Falwell and Pat Robertson. They are so brainwashed by this \"feel good about yourself, you are special\" and gay hating retoric that they are no longer capable of thinking for themselves.\n \n What a shame. What a true shame. It saddens me to see people so controlled and lead like dumb animals.\n \n And they are scared. Scared sh**tless. To scared to face logic. To scared to face the reality of what they have become. It is called \"homophobia\". I dare any of them to read about homophobia. http://www.bidstrup.com/phobia.htm\n They won't. They are too scared. To scared to face what scares them. Too scared to admit they they are not in control of themselves.", 
   {}, 
   75715, 
   null, 
   1099761660.0
  ], 
  [
   76214, 
   null, 
   "unkerpaulie", 
   "How does expecting the same civil rights as hetrosexuals enjoy constitue \"seeking \"approval\" from hetros\"? How does it constitues \"...craming your sexuality down the majorities throat.\" as \"Haulingboat\" states above?\n \n Why should \"Haulingboat\" (as quoted above) consider the same civil rights he enjoys as \"special rights\" when applied to homosexuals? What is \"special\" about them?\n\n obviously, you are directing your complaints to the wrong party. the religious group holds very little power over what rights homosexuals can and cannot enjoy. something being classified as a \"sin\" never makes it \"unlawful\" as far as the law is concerned. homosexuality in the eyes of religion is just as much a sin as adultery and fornication, but that doesnt make these things illegal. if you want the laws changed, lobby for it, protest for it, write for it. but you have to direct your pleas to the state legislation group, not the religious group.\n \n and maybe i was presumptious about homosexuals seeking religious approval (although many do). i doubt very much will change about that. as long as the bible governs the beliefs of religion, you're not going to find christians accepting homosexuality", 
   {}, 
   75715, 
   null, 
   1099932360.0
  ], 
  [
   76215, 
   null, 
   "unkerpaulie", 
   "Hmmmmmmmmm\n \n It seems none of the self proclaimed hertosexual \"experts\" on homosexuality can answer my questions.\n\n what questions?", 
   {}, 
   75852, 
   null, 
   1099932420.0
  ], 
  [
   76217, 
   null, 
   "Jaaaman", 
   "I don't claim to know much at all about Homosexuallity. I have challenge you to show me one instance where I have attemptted to push \"knowledge, insight, or expertise\" on anyone in the thread.\n \n I do have an opinion as to why homosexual marriage should not be recognized by our government. I have stated those opinions as clearly and logically as I know how. I avoid going beyond my opinion into the land of speculation or fact, due to my lack of knowledge to back up any such statement. \n \n If you don't like my opinion then don't come to website that incourages their expression.\n\n Well, heres my opinion on the subject:\n \n The fundamental \"right to marry\" is a right that rests with individuals, not with couples. Homosexual individuals already have exactly the same \"right\" to marry as anyone else. Marriage license applications do not inquire as to a person's \"sexual orientation.\"\n \n Many people who now identify themselves as homosexual have previously been in legal (opposite-sex) marriages. On the other hand, many people who previously had homosexual relationships have now renounced that behavior and married persons of the opposite sex. If we define a \"homosexual\" as anyone who has ever experienced homosexual attractions, then both of these scenarios represent \"homosexual\" individuals who have exercised their right to be legally married.\n \n However, while every individual person is free to get married, no person, whether heterosexual or homosexual, has ever had a legal right to marry simply any willing partner. Every person, whether heterosexual or homosexual, is subject to legal restrictions as to whom they may marry. To be specific, every person, regardless of sexual preference, is legally barred from marrying a child, a close blood relative, a person who is already married, or a person of the same sex. There is no discrimination here, nor does such a policy deny anyone the \"equal protection of the laws\" (as guaranteed by the Constitution), since these restrictions apply equally to every individual.\n \n Some people may wish to do away with one or more of these longstanding restrictions upon one's choice of marital partner. However, the fact that a tiny but vocal minority of Americans desire to have someone of the same sex as a partner does not mean that they have a \"right\" to do so, any more than the desires of other tiny (but less vocal) minorities of Americans give them a \"right\" to choose a child, their own brother or sister, or a group of two or more as their marital partners.", 
   {}, 
   75683, 
   null, 
   1099932960.0
  ], 
  [
   76229, 
   null, 
   "joebrummer", 
   "Well, heres my opinion on the subject:\n \n The fundamental \"right to marry\" is a right that rests with individuals, not with couples. Homosexual individuals already have exactly the same \"right\" to marry as anyone else. Marriage license applications do not inquire as to a person's \"sexual orientation.\"\n \n Many people who now identify themselves as homosexual have previously been in legal (opposite-sex) marriages. On the other hand, many people who previously had homosexual relationships have now renounced that behavior and married persons of the opposite sex. If we define a \"homosexual\" as anyone who has ever experienced homosexual attractions, then both of these scenarios represent \"homosexual\" individuals who have exercised their right to be legally married.\n \n However, while every individual person is free to get married, no person, whether heterosexual or homosexual, has ever had a legal right to marry simply any willing partner. Every person, whether heterosexual or homosexual, is subject to legal restrictions as to whom they may marry. To be specific, every person, regardless of sexual preference, is legally barred from marrying a child, a close blood relative, a person who is already married, or a person of the same sex. There is no discrimination here, nor does such a policy deny anyone the \"equal protection of the laws\" (as guaranteed by the Constitution), since these restrictions apply equally to every individual.\n \n Some people may wish to do away with one or more of these longstanding restrictions upon one's choice of marital partner. However, the fact that a tiny but vocal minority of Americans desire to have someone of the same sex as a partner does not mean that they have a \"right\" to do so, any more than the desires of other tiny (but less vocal) minorities of Americans give them a \"right\" to choose a child, their own brother or sister, or a group of two or more as their marital partners.\n\n \n I think you just long-windly said, you already have the right to marry. If that was true Jamaaan, this thread wouldn't exist. Marriage is the right of couples to legally have protections and benefits from the government. Gay couples would like those benefits extended to them. The 14th ammendment, Loving vs. Virgina, and other rulings by the courts have paved the way to having this happen. It will happen.", 
   {}, 
   76217, 
   null, 
   1099934940.0
  ], 
  [
   76234, 
   null, 
   "unkerpaulie", 
   "I think you just long-windly said, you already have the right to marry. If that was true Jamaaan, this thread wouldn't exist. Marriage is the right of couples to legally have protections and benefits from the government. Gay couples would like those benefits extended to them. The 14th ammendment, Loving vs. Virgina, and other rulings by the courts have paved the way to having this happen. It will happen.\n\n what jaaaman is saying (quite tactfully) is that everyone - gays included - has the exact same rights concerning marriage. you cannot marry a child, more than one partner, someone that is already married, a close relative or a person of the same sex. there is no discrimination against anyone.", 
   {}, 
   76229, 
   null, 
   1099935600.0
  ], 
  [
   76245, 
   null, 
   "wsm2506", 
   "Well, heres my opinion on the subject:\n \n \n However, while every individual person is free to get married, no person, whether heterosexual or homosexual, has ever had a legal right to marry simply any willing partner. Every person, whether heterosexual or homosexual, is subject to legal restrictions as to whom they may marry. To be specific, every person, regardless of sexual preference, is legally barred from marrying a child, a close blood relative, a person who is already married, or a person of the same sex. There is no discrimination here, nor does such a policy deny anyone the \"equal protection of the laws\" (as guaranteed by the Constitution), since these restrictions apply equally to every individual.\n\n \n There are logical, non-religious, justifiable reasons for legal restrictions against marrying a child. Children / minors (in most states: under the age of 18) are legally barred from entering into any legally binding contracts also. Unless I am mistaken, both marriage and civil unions are legally binding contracts.\n \n There are logical, non-religious, justifiable reasons for legal restrictions against marrying a close blood relative: the greatly increased probability of birth defects in any child from such a union.\n \n There are logical, non-religious, justifiable reasons for legal restrictions against marrying a person who is already married: it would contravene the legal contract they already have with their current spouse.\n \n What are the logical, non-religious, justifiable reasons for legal restrictions against marrying a person of the same sex? Assuming: a) both individuals are of legal age, b) they are not close relatives (although no child could issue from such a union), c) the individuals are not already married?", 
   {
    "post_info": {
     "post_title": "In response to Jaaaman:"
    }
   }, 
   76217, 
   null, 
   1099937820.0
  ], 
  [
   76258, 
   null, 
   "Big Orn", 
   "Hmmmmmmmmm\n \n It seems none of the self proclaimed hertosexual \"experts\" on homosexuality can answer my questions.\n\n It could be me you&#8217;re referring to, but I hope it&#8217;s not negatively.\n When I say those things it is out of the need for understanding. With that understanding comes a need to utilize the knowledge it brings. How else can those who are not homosexual learn of his fellowman? Or is it required in your world that only certain people have that understanding?\n \n I&#8217;m with unkerpaulie on this one&#8230;also, except that I believe than some are born that way. But, I am still learning.\n \n Of course, wsm2506, if that offends you, you&#8217;re barking up the wrong tree.", 
   {}, 
   76229, 
   null, 
   1099940940.0
  ], 
  [
   76259, 
   null, 
   "joebrummer", 
   "what jaaaman is saying (quite tactfully) is that everyone - gays included - has the exact same rights concerning marriage. you cannot marry a child, more than one partner, someone that is already married, a close relative or a person of the same sex. there is no discrimination against anyone.\n\n \n \n The only people that put this argument up are the ones who couldn't come up with a real argument. Not all couples have the same rights. Palin and simple as that. Individuals cannot marry. As individuals there is no right to marry, you can only marry as a couple. Gay coulples cannot marry, straights can, hence the battle in the first place.", 
   {}, 
   76234, 
   null, 
   1099941360.0
  ], 
  [
   76262, 
   null, 
   "wsm2506", 
   "It could be me you&#8217;re referring to, but I hope it&#8217;s not negatively.\n When I say those things it is out of the need for understanding. With that understanding comes a need to utilize the knowledge it brings. How else can those who are not homosexual learn of his fellowman? Or is it required in your world that only certain people have that understanding?\n \n I&#8217;m with unkerpaulie on this one&#8230;also, except that I believe than some are born that way. But, I am still learning.\n \n Of course, wsm2506, if that offends you, you&#8217;re barking up the wrong tree.\n\n \n No Big Orn, I take no offense at this or any other post I have read of yoursand I was not refering to you. I welcome anyone who seeks to understand.", 
   {
    "post_info": {
     "post_title": "Big Orn"
    }
   }, 
   76258, 
   null, 
   1099942440.0
  ], 
  [
   76277, 
   null, 
   "unkerpaulie", 
   "The only people that put this argument up are the ones who couldn't come up with a real argument. Not all couples have the same rights. Palin and simple as that. Individuals cannot marry. As individuals there is no right to marry, you can only marry as a couple. Gay coulples cannot marry, straights can, hence the battle in the first place.\n\n and sibling couples, groups larger than two, and minors, cannot marry either. the indiviuals can marry, but the law restricts who they can marry TO. a couple not recognized by law cannot fight for the right to marry if they do not meet the legal requirements.\n \n its not discrimination\n \n if you want the legal requirements to change, then theres an avenue for that", 
   {}, 
   76259, 
   null, 
   1099949400.0
  ], 
  [
   76279, 
   null, 
   "wsm2506", 
   "and sibling couples, groups larger than two, and minors, cannot marry either. the indiviuals can marry, but the law restricts who they can marry TO. a couple not recognized by law cannot fight for the right to marry if they do not meet the legal requirements.\n \n its not discrimination\n \n if you want the legal requirements to change, then theres an avenue for that\n\n \n Then what is your definition of \"discrimination\"? Just because something is \"legal\" does not mean it is not discriminatory. I thought we went through this argument with the black civil rights movement in the 60's. Did I miss something. Many other once \"legal\" requirements have been overturned by the courts as being \"discriminatory\". \n \n I ask above: \"What are the logical, non-religious, justifiable reasons for legal restrictions against marrying a person of the same sex? Assuming: a) both individuals are of legal age, b) they are not close relatives (although no child could issue from such a union), c) the individuals are not already married?\" Do you have any?\n \n \n But I do agree with you about the proper avenues;state and federal legislatures and the courts. And this is being done. And the more people are educated with facts, logic, reason, and rationality, the sooner this will be accomplished.", 
   {}, 
   76277, 
   null, 
   1099950720.0
  ], 
  [
   76291, 
   null, 
   "unkerpaulie", 
   "I ask above: \"What are the logical, non-religious, justifiable reasons for legal restrictions against marrying a person of the same sex? Assuming: a) both individuals are of legal age, b) they are not close relatives (although no child could issue from such a union), c) the individuals are not already married?\" Do you have any?\n\n perhaps the govt doesnt want to encourage \"unproductive\" unions (without the ability to have children)\n \n what would be the logical, non-religious, justifiable reason for not having more that one married partner? if any?", 
   {}, 
   76279, 
   null, 
   1099954980.0
  ], 
  [
   76297, 
   null, 
   "Jaaaman", 
   "Then what is your definition of \"discrimination\"? Just because something is \"legal\" does not mean it is not discriminatory. I thought we went through this argument with the black civil rights movement in the 60's. Did I miss something. Many other once \"legal\" requirements have been overturned by the courts as being \"discriminatory\". \n \n \n\n \n This analogy is not valid at all. Bridging the divide of the sexes by uniting men and women is both a worthy goal and a part of the fundamental purpose of marriage, common to all human civilizations.\n \n Laws against interracial marriage, on the other hand, served only the purpose of preserving a social system of racial segregation. This was both an unworthy goal and one utterly irrelevant to the fundamental nature of marriage.\n \n Allowing a black woman to marry a white man does not change the definition of marriage, which requires one man and one woman. Allowing two men or two women to marry would change that fundamental definition. Banning the \"marriage\" of same-sex couples is therefore essential to preserve the nature and purpose of marriage itself.", 
   {}, 
   76279, 
   null, 
   1099956480.0
  ], 
  [
   76298, 
   null, 
   "MrWriteLA", 
   "perhaps the govt doesnt want to encourage \"unproductive\" unions (without the ability to have children)\n\n \n If that were true, they would make it illegal for infertile couples, couples who don't wish to procreate, and couples who fail to procreate, to marry.\n \n \n \nwhat would be the logical, non-religious, justifiable reason for not having more that one married partner? if any\n\n \n For one thing, the strain on the judicial system would be enormous. What if one had, say 50 spouses... or the entire population of New Jersey as spouses? Who inherits? Who gets the kids if you divorce? Are all the spouses to be considered married to each other as well?\n \n The number of those in the contract impacts matters enormously in tangible, concrete ways, as well as calling into question the whole fundamental idea of \"love & commitment to another person,\" which--unlike same-sex marriage--would  denigrate the institution.\n \n The gender of those in a two-person contract does not impact the idea of love and commitment in any way.", 
   {}, 
   76291, 
   null, 
   1099956600.0
  ], 
  [
   76300, 
   null, 
   "Jaaaman", 
   "Then what is your definition of \"discrimination\"? Just because something is \"legal\" does not mean it is not discriminatory. I thought we went through this argument with the black civil rights movement in the 60's. Did I miss something. Many other once \"legal\" requirements have been overturned by the courts as being \"discriminatory\". \n \n \n\n \n It is an affront to African-Americans to say having past generations being prevented from taking a drink from a public water fountain or being sprayed down by fire hoses in a public park was on par to laws preventing a man from marrying another man. The comparison is shameful. emoticon_rolleyes", 
   {}, 
   76279, 
   null, 
   1099957020.0
  ], 
  [
   76301, 
   null, 
   "wsm2506", 
   "[QUOTE=Jaaaman]This analogy is not valid at all. Bridging the divide of the sexes by uniting men and women is both a worthy goal and a part of the fundamental purpose of marriage, common to all human civilizations.\n \n Laws against interracial marriage, on the other hand, served only the purpose of preserving a social system of racial segregation. This was both an unworthy goal and one utterly irrelevant to the fundamental nature of marriage.\n \n Allowing a black woman to marry a white man does not change the definition of marriage, which requires one man and one woman. Allowing two men or two women to marry would change that fundamental definition. Banning the \"marriage\" of same-sex couples is therefore essential to preserve the nature and purpose of marriage itself.[/QUOTE\n \n I fail to see why it is not \"valid\" or \"worthy\". You offer no logical reason for your opinion.\n \n It would seem that we may be in disagreement over a matter of semantics. Assuming the maintenance of the traditional defination of \"marriage\", would you oppose \"civil unions\" of same sex couples and allowing them the same 1,000+ legal rights as enjoyed by those for \"marriage\"?", 
   {}, 
   76297, 
   null, 
   1099957140.0
  ], 
  [
   76303, 
   null, 
   "wsm2506", 
   "It is an affront to African-Americans to say having past generations being prevented from taking a drink from a public water fountain or being sprayed down by fire hoses in a public park was on par to laws preventing a man from marrying another man. The comparison is shameful. emoticon_rolleyes\n\n \n OK. I don't necessarily agree with you, but you still fail to logically explain why current laws are not discriminatory.", 
   {}, 
   76300, 
   null, 
   1099957560.0
  ], 
  [
   76306, 
   null, 
   "wsm2506", 
   "perhaps the govt doesnt want to encourage \"unproductive\" unions (without the ability to have children)\n \n what would be the logical, non-religious, justifiable reason for not having more that one married partner? if any?\n\n \n Then based on your logic, why not legally bar marriage for anyone not able to reproduce?\n \n Personally, I believe in momogomy. However there are many religions that do believe in pologomy (sp?) and it is practiced in many countries. I don't think it has caused their civilizations to crumble. If all parties to such a marriage agree, what business is it of mine or yours? If they are not restricting my right to practice my religion or your right to practice yours as you see fit, how would it affect either of us? \"clogging the courts\" as you mention in another post is is simply not a valid argument.\n \n \"calling into question the whole fundamental idea of \"love & commitment to another person,\" which--unlike same-sex marriage--would denigrate the institution.\"\n \n I don't understand this at all!!!!! Are you insinuating that \"love & commitment to another person,\" cannot exist between two persons of the same sex?", 
   {}, 
   76291, 
   null, 
   1099957680.0
  ], 
  [
   76308, 
   null, 
   "joebrummer", 
   "It is an affront to African-Americans to say having past generations being prevented from taking a drink from a public water fountain or being sprayed down by fire hoses in a public park was on par to laws preventing a man from marrying another man. The comparison is shameful. emoticon_rolleyes\n\n \n \n No one is comparing gays to any of those things. BUT even MLK's wife agrees that gay rights are civil rights.\n \n Marriage is only a contract that has federal and state benefits and protections. When you offer marriage to \"couple A\" but not \"Couple B\" because you think \"Couple B\" might be sinners by your religious notion. That is discrimination. Laws in this country are secular. They cannot and should bot prescribe to any church. I don't care what you call it. That is what it is. I can list dozens of churches that are supportive of same sex marriage. Many have websites and I am sure I could find them. BUT LAWS cannot be based on religion.", 
   {}, 
   76300, 
   null, 
   1099958520.0
  ], 
  [
   76321, 
   null, 
   "MrWriteLA", 
   "\n I don't understand this at all!!!!! Are you insinuating that \"love & commitment to another person,\" cannot exist between two persons of the same sex?\n\n \n You misunderstood my point. If you will re-read my post, you will see that I was referring to the fundamental aspect of marriage (love and commitment to another person) being denigrated when one person marries, say, 12 or 50 or 100 people. (At what number would you draw the line?) If a person asserts he loves and is dedicated to a half-dozen other people, well, frankly I'm not going to buy it. That  is when the definition of marriage truly does become degraded.\n \n It is not  denigrated by two people of the same sex being granted civil marriage rights. Gender does not dilute the institution one iota.", 
   {}, 
   76306, 
   null, 
   1099959240.0
  ], 
  [
   76490, 
   null, 
   "wsm2506", 
   "You misunderstood my point. If you will re-read my post, you will see that I was referring to the fundamental aspect of marriage (love and commitment to another person) being denigrated when one person marries, say, 12 or 50 or 100 people. (At what number would you draw the line?) If a person asserts he loves and is dedicated to a half-dozen other people, well, frankly I'm not going to buy it. That  is when the definition of marriage truly does become degraded.\n \n It is not  denigrated by two people of the same sex being granted civil marriage rights. Gender does not dilute the institution one iota.\n\n \n I apologize for my misunderstanding and appreciate your clarification.", 
   {}, 
   76321, 
   null, 
   1100016300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Hetrosexual \"experts\" on homosexuality.", 
  "url": "http://www.4forums.com/political/gay-rights-debates/3655-hetrosexual-experts-homosexuality.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 3655, 
  "discussion_files": [
   [
    "15388.html", 
    "http://www.4forums.com/political/gay-rights-debates/3655-hetrosexual-experts-homosexuality-print.html"
   ], 
   [
    "15389.html", 
    "http://www.4forums.com/political/gay-rights-debates/3655-hetrosexual-experts-homosexuality-3-print.html"
   ], 
   [
    "15390.html", 
    "http://www.4forums.com/political/gay-rights-debates/3655-hetrosexual-experts-homosexuality-2-print.html"
   ]
  ], 
  "identifier": 3655
 }
]