[
 [
  [
   76230, 
   null, 
   "jim's trucking", 
   "As of today, 11-08-04, the Cobb County (GA) school system is being tested in court about the validity of their warning sticker pasted in every Evolution textbook. The sticker basically says that evolution is a theory and should be approached with an open mind.\n \n The evolutionists are saying this is an endorsement of creationism, therefore is a religious doctrine being taught in school...against the law.\n \n This is the same school system whose leader recently tried to have the word \"evolution\" deleted from the school curriculum.\n \n Is the Bible Belt getting too tight?", 
   {
    "post_info": {
     "post_title": "A warning sticker in textbooks!"
    }
   }, 
   null, 
   null, 
   1099935180.0
  ], 
  [
   76232, 
   null, 
   "unkerpaulie", 
   "how is this an endorsement of creation? evolutionists always say that creationists teach AGAINST having an open mind. i cannot for the life f me understand why someone that truly understands science WOULDN'T want students to have an open mind. its not like evolution is a doctrine, now is it?", 
   {}, 
   76230, 
   null, 
   1099935360.0
  ], 
  [
   76236, 
   null, 
   "OccamsRazor", 
   "Good to see you in here Jim emoticon_xgood \n \n \nhow is this an endorsement of creation? evolutionists always say that creationists teach AGAINST having an open mind. i cannot for the life f me understand why someone that truly understands science WOULDN'T want students to have an open mind. its not like evolution is a doctrine, now is it?\n\n \n Is this warning going in any other science textbooks?\n \n Are they petitioning for a sticker to go in the front of Bibles saying that Genesis might just be a parable?\n \n Didn't think so, kthxgbye.", 
   {}, 
   76232, 
   null, 
   1099935900.0
  ], 
  [
   76239, 
   null, 
   "Clive14", 
   "As of today, 11-08-04, the Cobb County (GA) school system is being tested in court about the validity of their warning sticker pasted in every Evolution textbook. The sticker basically says that evolution is a theory and should be approached with an open mind.\n \n The evolutionists are saying this is an endorsement of creationism, therefore is a religious doctrine being taught in school...against the law.\n \n This is the same school system whose leader recently tried to have the word \"evolution\" deleted from the school curriculum.\n \n Is the Bible Belt getting too tight?\nDo these same sticker fanatics insist that other science textbooks carry warnings that gravity, atoms, cells, germs etc are \"only theories\" too? If not, then this is simply yet another attempt by creationists to wedge their lies into the minds of the young at as early an age as possible.", 
   {}, 
   76230, 
   null, 
   1099936560.0
  ], 
  [
   76241, 
   null, 
   "unkerpaulie", 
   "Good to see you in here Jim emoticon_xgood \n \n Is this warning going in any other science textbooks?\n \n Are they petitioning for a sticker to go in the front of Bibles saying that Genesis might just be a parable?\n \n Didn't think so, kthxgbye.\n\n thats the point. the bible is a religious doctrine and should be treated as such. to study the bible doesnt require an open mind. to study a science should", 
   {}, 
   76236, 
   null, 
   1099937100.0
  ], 
  [
   76246, 
   null, 
   "jim's trucking", 
   "Perhaps I should have posted the completely worded sticker language. Here it is.\n \n http://www.fox21.com/Global/story.asp?S=2532180\n \n The stickers read, \"This textbook contains material on evolution. Evolution is a theory, not a fact, regarding the origin of living things. This material should be approached with an open mind, studied carefully and critically considered.\"\n \n \n ...", 
   {}, 
   76241, 
   null, 
   1099938240.0
  ], 
  [
   76248, 
   null, 
   "jim's trucking", 
   "Do these same sticker fanatics insist that other science textbooks carry warnings that gravity, atoms, cells, germs etc are \"only theories\" too? If not, then this is simply yet another attempt by creationists to wedge their lies into the minds of the young at as early an age as possible.\nYour argument is valid and upheld by this biology professor.\n \n http://atlanta.creativeloafing.com/2002-05-22/cover3.html\n \n ...\n \n It's discrimination at work.", 
   {}, 
   76239, 
   null, 
   1099938600.0
  ], 
  [
   76251, 
   null, 
   "sinjin", 
   "Thank God I live in California where an atheist can practice his Satanic rites unfettered by those with no need for bookshelves.", 
   {}, 
   76248, 
   null, 
   1099939440.0
  ], 
  [
   76253, 
   null, 
   "jim's trucking", 
   "Thank God I live in California where an atheist can practice his Satanic rites unfettered by those with no need for bookshelves.\nHow can an atheist practice Satanic rites? Satan was a fallen angel...no God<no angels<no Satan.\n \n ..and if you're an atheist, what are you doing thanking God?", 
   {}, 
   76251, 
   null, 
   1099939620.0
  ], 
  [
   76254, 
   null, 
   "sinjin", 
   "How can an atheist practice Satanic rites? Satan was a fallen angel...no God<no angels<no Satan.\n\n \n It's just a \"theory\".", 
   {}, 
   76253, 
   null, 
   1099939740.0
  ], 
  [
   76256, 
   null, 
   "pandion", 
   "Here's the full text of the sticker.\n \nThis textbook contains material on evolution. Evolution is a theory, not a fact, regarding the origin of living things. This material should be approached with an open mind, studied carefully and critically considered.\n\n Creationists read this and wonder why there is a problem. Here's why. As has been mentioned there isn't any movement to put stickers in physics or chemistry books. But it would read like this if there were:\n \nThis textbook contains material on gravity. Gravitation is a theory, not a fact, regarding the attraction between bodies of mass. This material should be approached with an open mind, studied carefully and critically considered.\n\n Or maybe the textbooks in medical schools should have a sticker like this:\n \nThis textbook contains material on infectious disease. Infectious disease is a theory, not a fact, regarding the ability of pathogens to cause ailments. This material should be approached with an open mind, studied carefully and critically considered.\n\n Besides that, evolution is not a theory about the origin of living things. Evolution is a theory that explains how and why living things change as a response to their environment.\n \n I think that it is only fair that if the teaching of religion is to be allowed in public school science classes, then equal time should be given to evolutionary biology in fundamentalist churches. Half of the time should be devoted to the morality sermons and half to the presentation of the principles of evolutionary biology.\n \n I suggest the following as a sticker for the front of the Bible:\n \nThis religious mythology contains material on creation. Creation is a myth, not a fact, regarding the origin of living things. This material should be approached with an open mind, studied carefully and critically considered.\n", 
   {}, 
   76236, 
   null, 
   1099940700.0
  ], 
  [
   76260, 
   null, 
   "jim's trucking", 
   "I know of no book that has been studied more carefully or considered more critically than the Bible.", 
   {}, 
   76256, 
   null, 
   1099941960.0
  ], 
  [
   76261, 
   null, 
   "billsco", 
   "I know of no book that has been studied more carefully or considered more critically than the Bible.\n\n \n \n ...and turned more people into hypocrites...", 
   {}, 
   76260, 
   null, 
   1099942320.0
  ], 
  [
   76266, 
   null, 
   "sinjin", 
   "I know of no book that has been studied more carefully or considered more critically than the Bible.\n\n \n Critiquing the Bible used to get you burned.", 
   {}, 
   76260, 
   null, 
   1099943460.0
  ], 
  [
   76276, 
   null, 
   "unkerpaulie", 
   "Critiquing the Bible used to get you burned.\n\n thats right. critiquing the bible is different from reading the bible for guidance/edification. you dont want an open mind for reading the bible, you just want to read what is says and believe what it says. off course, when you start to critically study the bible you run into problems, so you dont want to do that", 
   {}, 
   76266, 
   null, 
   1099949160.0
  ], 
  [
   76283, 
   null, 
   "Close_slave_can", 
   "I would be happy with a warning sticker \"The contents of this book are not designed to be used in the abortion debate, the gay marriage debate or the existence or non-existence of God\".", 
   {}, 
   76276, 
   null, 
   1099952880.0
  ], 
  [
   76288, 
   null, 
   "Anastasia", 
   "thats right. critiquing the bible is different from reading the bible for guidance/edification. you dont want an open mind for reading the bible, you just want to read what is says and believe what it says. off course, when you start to critically study the bible you run into problems, so you dont want to do that\n\n Is it just me or is this statement validation for all the loopholes in the bible?\n \n emoticon_frazzled", 
   {}, 
   76276, 
   null, 
   1099953840.0
  ], 
  [
   76292, 
   null, 
   "unkerpaulie", 
   "Is it just me or is this statement validation for all the loopholes in the bible?\n \n emoticon_frazzled\n\n what loopholes? if you read the bible the way it was intended to be read (i.e., totally believing everything it says without question), then there is no loopholes/contradictions/discrepancies. if the bible said it, then it must be true. i dont see any loopholes...", 
   {}, 
   76288, 
   null, 
   1099955160.0
  ], 
  [
   76310, 
   null, 
   "daewoo", 
   "Creationists read this and wonder why there is a problem. Here's why. As has been mentioned there isn't any movement to put stickers in physics or chemistry books. But it would read like this if there were:\n \n Or maybe the textbooks in medical schools should have a sticker like this:\n \n \nThis textbook contains material on gravity. Gravitation is a theory, not a fact, regarding the attraction between bodies of mass. This material should be approached with an open mind, studied carefully and critically considered.\n \n\n \n No, because gravity is not a theory. The two (theory and law) are easily to diferentiate. Usually it is right there in the title, such as \"theory of relativity\". The theory of ralativity has not been proven, there is still room for debate on it, so it is a theory. If you spend much type speaking with physicists, you will often hear one say \"If einstein was right.....\" This is what they are talking about. Until the theory is proven, it is always approacehd with some degree of doubt. Unfortunatly, the evolutionists, who generally seem to care less about the science and more about scoring some kind of idealogical point, want the rules to be different when it comes to the THEORY of evolution.\n \n \n \nBesides that, evolution is not a theory about the origin of living things. Evolution is a theory that explains how and why living things change as a response to their environment.\n\n \n Evolution is more a theory about how higher level organisms came to exist. And frankly, we don't know. There are seveeral theories out there, including the theory of evolution and the creationist theory. It is a little boring to bdebate, though, because neither really conforms to the evidence we have available. The fossil record definatly records the fact that there have been several thousands fo species through the history of the planet earth that are no longer here, and that new species apparently have formed. There are not very many (I will not say \"no\" since there are a few fossiles outthere that could be interpeted to be) pieces of evidence available which suggest that the new species that aruise were actually descendants of earlier species. We see one species, then the next, but generally lack an unequivecal link between the two.\n \n Some theroise that aliens came down from space and changed species by modifying their genetic code. Personally, I think this is rediculous, but as far as theories go, there is no more or less support for this than for the theory of evolution.", 
   {}, 
   76256, 
   null, 
   1099958640.0
  ], 
  [
   76325, 
   null, 
   "pnac=ww3", 
   "No, because gravity is not a theory. The two (theory and law) are easily to diferentiate.\n\n \n There is both a law of gravity and a theory of gravity.\n Newton's Law of Gravitation (to more correct) merely spells out the way in which bodies attract each other, meaning the relationship between mass and distance, etc. The Theory of Gravity is still trying to work out where gravity comes from, how it traverses space and time, and what its implications are for the universe expanding or contracting. \n \n \n \nUsually it is right there in the title, such as \"theory of relativity\". The theory of ralativity has not been proven, there is still room for debate on it, so it is a theory.\n\n While no real theory has ever been \"proven\" there is an insurmountable heap of evidence that the model of relativity is accurate.", 
   {}, 
   76310, 
   null, 
   1099959480.0
  ], 
  [
   76329, 
   null, 
   "Anastasia", 
   "what loopholes? if you read the bible the way it was intended to be read (i.e., totally believing everything it says without question), then there is no loopholes/contradictions/discrepancies. if the bible said it, then it must be true. i dont see any loopholes...\n\n I guess what I took from your post was Don't study too hard or you might have too many questions...I am having a hard time with blind faith.. :)\n \n emoticon_xangel \n No offence really...", 
   {}, 
   76292, 
   null, 
   1099959600.0
  ], 
  [
   76335, 
   null, 
   "pandion", 
   "First of all, you misquote what I said. I didn't make comments that a disclaimer on gravity should be included in medical text books. I'm not sure of your motivations for the misrepresentation, but I suspect that they aren't honest.\n \nNo, because gravity is not a theory.\n\n Learn what you are talking about before you speak. Gravity is most certainly a theory. You will even notice that I said \"the theory of gravitation,\" which is the correct term. And gravity is part of Einstein's general theory of relativity.\n \nThe two (theory and law) are easily to diferentiate.\n\n Yes, for those who have bothered to learn the basics of topics that they discuss. Laws and theories are quite similar in nature except that theories are much more complex than laws of physics. For example, \"for every action there is an equal but opposite reaction\" is a law. It is just a simple statement of something that has been observed to be universally true.\n \nUsually it is right there in the title, such as \"theory of relativity\". The theory of ralativity has not been proven, there is still room for debate on it, so it is a theory.\n\n Actually, no. It has been quite conclusively shown that the theory of relativity is correct. It is the sign of a scientific illiterate to claim that a theory is somehow doubted because it hasn't been \"proven.\" No theory grows up to be a law.\n \nIf you spend much type speaking with physicists, you will often hear one say \"If einstein was right.....\" This is what they are talking about.\n\n No it's not. Educating yourself before you speak might help.\n \nUntil the theory is proven, it is always approacehd with some degree of doubt.\n\n Nonsense. No scientific theory is ever proven. Proof is a matter of math or booze. There is always the presumption that better data might be found that will cause the theory to be adjusted. In science, the best anything ever gets is to be a theory, because that means that the body of knowledge has been tested and verified many times over.\n \nUnfortunatly, the evolutionists, who generally seem to care less about the science and more about scoring some kind of idealogical point, want the rules to be different when it comes to the THEORY of evolution.\n\n Unfortunately, creationists don't bother to learn what they are talking about. They prefer to look foolish when they use the word theory as joe blow does on the street rather than as scientists do. Too bad that creationists want their mythology to be scientific so badly that they invent and misrepresent science without ever actually learning what science is or how it works.", 
   {}, 
   76310, 
   null, 
   1099960140.0
  ], 
  [
   76338, 
   null, 
   "Big Orn", 
   "Too bad that creationists want their mythology to be scientific so badly that they invent and misrepresent science without ever actually learning what science is or how it works.\n\n True.\n \n Makes me wonder why they need religion in the first place...'cause the Joneses have a box of evidence in the garage, I reckon.", 
   {}, 
   76335, 
   null, 
   1099960440.0
  ], 
  [
   76366, 
   null, 
   "Nu Leader", 
   "Thanks for that article jim's trucking, it was an interesting read:\n \n \nPerhaps I should have posted the completely worded sticker language. Here it is.\n \n http://www.fox21.com/Global/story.asp?S=2532180\n \n The stickers read, \"This textbook contains material on evolution. Evolution is a theory, not a fact, regarding the origin of living things. This material should be approached with an open mind, studied carefully and critically considered.\"\n\n \n I didn't know that stating the truth could get a law suit filed against you! What is this world coming to? Simply stating that evolution is a theory and not fact is common sense. No body has observed, tested, or repeated the events like life coming from lifeless chemicals with no intelligence, the supposed big bang event, and the progression of life from the simple to the complex. None of these events have been proved, and are far from being \"fact\". They are just beliefs about the past based on people's atheistic belief system. I honestly do not know how people can be so ignorant of this and yet still state boldy like it has been hammered into them \"Evolution is a fact\". Oh, wait, I could be getting a law suit filed against me for stating the truth! \n \n Creation is also a theory about the past that can be neither tested, observed, or repeated today, and hence, can never be proved by science. But we start off with the assumption that God created everything just as He said in Genesis 1 to be true, while atheistic evolutionists start off with the opposite assumption and ultimately come up with a different conclusion. To them, this conclusion is both scientificly sound and \"truth\" - because it matches their starting assumption, i.e. there is no God and everything can be explained by natural processes. To an open minded person, or a creationist, those statements are filled with ignorance and are false as they know that science is ill-equiped to deal directly with the past.\n \n This teaches kids to \"question\" more. A few people on this forum and the Religions forum have argued many times that the Bible restricts kids and people from \"questioning everything\". What is happening here? The labels try and teach kids to keep an open mind and in that, question everything (i.e. This material should be approached with an open mind, studied carefully and critically considered) not just taking for a proven fact on your teachers word who was not there! I find it ironic that many evolutionists say to question the Bible, then when there are calls for people to question evolution they are all up in arms about it:\n \"You can't say that! That supports creation!\"\n \n Even in the midst of lack of evidence, and when people try to give kids the chance to question it, evolutionary loyalists still shout \"Evolution is truth - don't question it\". This ultimately shows how strongly they are aligned to evolutionary theory - they are willing to deny rationality and logic to save their belief in evolutionary theory. \n \n People can question the Bible all they want in any way that they want. If they have an open mind on the matter (which in itself is hard to have), they may see that it answers their questions.\n \n Hey, look at the last sentence:\n They didn't go over well with parent Jeffrey Selman, who filed a lawsuit with the Georgia chapter of the American Civil Liberties Union. \n \n Ah, the civil liberties union, ironic how they will go up in arms over a label that teaches kids to have an open mind and follow the philosophy of \"question everything\" and say that this is a breach in civil freedom not to teach it as fact (a lie IMO) and so forth, when the not teaching of the Biblical model is not a breach of civil liberties? How hypocritical of them. I also wonder, did the son say or daughter say anything about the label? Or was it just the father who is [obviously] blinded by his belief in evolution who was cut?\n \n I honestly do not see that the plantiff has a point at all. If the label read something like:\n \"All information relating to evolution and/or evolutionary theory are false and the Bible's account of history is true\" or something to that effect, than the plantiff may have a point. But it does not:\n This textbook contains material on evolution. Evolution is a theory, not a fact, regarding the origin of living things. This material should be approached with an open mind, studied carefully and critically considered. \n \n This way the students know for sure, that it is just one of many interpretations of the scientific evidence that cannot be proven by science as science is ill-equiped to deal directly with the past, many fallible assumptions must be taken when dealing with the past. Many evolutionists say, for example, that the present is the key to the past, and as such, they see the slow erosion rates and what have you and project them back in the past. But they are not taking into account sudden and catastophic events such as floods (both local and Noah's Flood), volcanos, earthquakes, etc. All of these would rapidly change the Earth's geological features in days, not over millions of years.\n \n The label teaches the truth - the parent should shut up and stop having a cry over something as trivial. Evolution is still being taught at the school - just in a way that they know it is not regarded by scientists themselves as being \"truth\". It represent's their \"best guess\" at what happened in the past while ignoring the Bible's statements about our origins. If that father is so evolutionary inclined, than he can teach his kid all he wants at home. I am, however, a great believer in letting the child decide what they want to believe. Give them evolutionary material, give them good creationary material and let the child choose which story or interpretation he/she wishes to take.\n \n Honestly people, is this label saying do not believe it? No, it is saying to \"question\" it and if you think that it answers your quetions better than the alternatives, than by all means, believe it. I'm very happy to see this school make a stand for some truth, evolution is a theory, not a fact. I can actually see that sometime in the future, school teachers are going to be saying to their kids something like:\n \"People of old from the 1900's and early 2000's actually believed that we came from ape like creatures! What a silly belief.... Their ....... was not provable by science.....\" etc, etc.", 
   {
    "post_info": {
     "post_title": "My word, what is the world coming to?"
    }
   }, 
   76246, 
   null, 
   1099964100.0
  ], 
  [
   76368, 
   null, 
   "sinjin", 
   "I have never heard the devout use the phrase \"theory of creation\". The label implies that \"creation theory\" is just as likely as \"evolutionary theory\" which is untrue.", 
   {}, 
   76366, 
   null, 
   1099964400.0
  ], 
  [
   76404, 
   null, 
   "Mach", 
   "As of today, 11-08-04, the Cobb County (GA) school system is being tested in court about the validity of their warning sticker pasted in every Evolution textbook. The sticker basically says that evolution is a theory and should be approached with an open mind.\n \n The evolutionists are saying this is an endorsement of creationism, therefore is a religious doctrine being taught in school...against the law.\n \n This is the same school system whose leader recently tried to have the word \"evolution\" deleted from the school curriculum.\n \n Is the Bible Belt getting too tight?\n\n \n Yes, it is. I'm actually considering moving out of the south specifically for that reason. I will miss the largemouth bass fishing....wth is a pike? ;) It's always been that bad though, now that I think about it. It's just I ignored it more when I was younger.\n \n The sticker is moronic IMO. If they label \"evolution\" with that, they should go ahead and label every single book, TV, everyone's forehead, and every object that can hold a sticker in the entire world. Some people thing there is \"openess\" about being correct or incorrect. On some things that are opinion, sure. On reality? Not the case.\n \n I mean, I'm not running around believing John Kerry actually won the election despite the evidence, although I certainly could, if I approached the election results with \"an open mind\". Although I could....hmmm...just have to keep it up for 4 years!\n \n -Mach", 
   {}, 
   76230, 
   null, 
   1099975200.0
  ], 
  [
   76423, 
   null, 
   "daewoo", 
   "First of all, you misquote what I said. I didn't make comments that a disclaimer on gravity should be included in medical text books. I'm not sure of your motivations for the misrepresentation, but I suspect that they aren't honest.\n\n \n Sorry, didn't C&P properly. My bad\n \n \nLearn what you are talking about before you speak. Gravity is most certainly a theory. You will even notice that I said \"the theory of gravitation,\" which is the correct term. And gravity is part of Einstein's general theory of relativity.\n\n \n The law of gravitation would be Newtons universal gravitation law (or universal law of gravitation, if you prefer) which states that the intensity of the universal attractive force F, the so-called gravity force, between two any masses, M1 and M2 , kept at a distance R each other, is directly proportional to the product M1 M2 and inversely proportional to the square of their distance: F = GM1M2/R2 .\n \n The proportionality constant G is the so-called universal gravitation constant, that may be determined by measuring the extremely weak gravitational force acting between two masses , kept at a certain distance each other.\n The measure of the extremely little value of G \n \n What you seem to be thinking about in regars to Einstein is his \"equivalence principle\" which states that that the acceleration \"G\" acquired by a body subjected to a gravitational field is physically indistinguishable from the acceleration acquired by the body by means of an accelerate motion of its reference frame. A fundamental consequence of the principle of equivalence is the equality Mg = Mi of the gravitational mass Mg and of the inertial mass Mi, that is of the aptitude of a body to resist to the accelerating action of a force.\n \n \n \nYes, for those who have bothered to learn the basics of topics that they discuss. Laws and theories are quite similar in nature except that theories are much more complex than laws of physics. For example, \"for every action there is an equal but opposite reaction\" is a law. It is just a simple statement of something that has been observed to be universally true.\n\n \n Wrong answer. theories are unproven. That is why it is a theory. Get a dictionary.\n \n \nActually, no. It has been quite conclusively shown that the theory of relativity is correct. It is the sign of a scientific illiterate to claim that a theory is somehow doubted because it hasn't been \"proven.\" No theory grows up to be a law.\n\n \n Yes, theories which are proven grow up to be laws. Sorry, my major was physics. Interestingly enough, the theory of relativity, which has reigned supreme for so llong, is now being questioned as we fund that not all matter in the universe seems to follow the rules in regards to it. I would sugeest you look into antimatter research and research regarding sub atomic particles if you want some examples. Might take a good, hard look at quantum physics as well. It may very well turn out that the reactions to which I refer are simply not well enough observed to fully understand their ramifications (it may very well turn out that they conform to einsteins theory).\n \n Don't give me \"scientificcaly illeterate\" from somebody who says \"It has been quite conclusively shown that the theory of relativity is correct.\" This is absolutly incorrect, a farce. The theory of relativity has never been disproven, which is why it is still around. It has NEVER BEEN proven, and may not be correct. So far, it has passed every test we have thrown at it, or the anomalies are so few and far between that they are not well enough understood to form a conclusive argument. \n \n \nNo it's not. Educating yourself before you speak might help.\n\n \n Education is not something I lack.\n \n \nNonsense. No scientific theory is ever proven. Proof is a matter of math or booze. There is always the presumption that better data might be found that will cause the theory to be adjusted. In science, the best anything ever gets is to be a theory, because that means that the body of knowledge has been tested and verified many times over.\n\n \n Many scientific theories have been conclusively proven, even outside the realm of mathematics. Many have also been disproven (spontaneous generation, for example).\n \n The fact that something has been labeled a theory does not mean it has been tested and verified many tiems over. Some theories have, such as einsteins relativity. Some have not, such as the theory of evolution. \n \n \nUnfortunately, creationists don't bother to learn what they are talking about. They prefer to look foolish when they use the word theory as joe blow does on the street rather than as scientists do. Too bad that creationists want their mythology to be scientific so badly that they invent and misrepresent science without ever actually learning what science is or how it works\n\n \n \n I am well aware of how science works and the proper usage of the word \"theory\". The theory of evolution is just that, a theory. There is no insurmountable evidence which supports it, nor is there sufficient evidence to discredit it, so it remains in limbo, like Einsteins relativity. \n \n Thinking like yours has set research into anti matter back years due to early researchers trying to bend their results to meet Einsteins theories. It was years before somebody finally said \"this doesn't seem to work based on known principals of physics\". \n \n Unfortunatly, evolutionists are just as guilty of what you claim here as the creationists are. There is no hard evidence which proves evolution, just as there is no hard evidence whihc proves creationism. I, for one, have no horse in this race. I couldn't care less. Neither theory holds enough water for me to put full faith in it.\n \n I personally think that children should learn the theory of eveolution, but should be told it is a theory, and it may be wrong. I think they should be taught the theory of relativity the same way. \n \n The rpoblem is that in the argument between evolution and craetionism has nothing to do with sicence, it is simply a new battlefield for the rteliogous and the athiests. If physicists were having a big argument about the theory of relativity, there would not be all this debate. Nobody would even care. It would just be a bunch of nerds squabbling, unless a new kind of microwave oven came out of it, it wuld hardly be worthy of mention until such a time as the debate was won conclusively by one side or the other.\n \n Unfortunatly, you have two WRONG sides arguing abotu the evolution/creationism debate. Neither side has any conclusive proof for their argument and both sides try to bend facts to meet their viewpoint. It is sickening and has no place in education. Just as a matter of academic honesty, those stickers belong in those books. And while I would not support a sticker in a physics book which suggested that gravity is just a theory (what foolishness!), I would certianly support one declaring relativity to be just a theory (oh, if you want something that questions realtivity, take a look at some of the latest black hole research......more stuff that \"doesn't confrom to physics as we know it\")/", 
   {}, 
   76335, 
   null, 
   1099979160.0
  ], 
  [
   76453, 
   null, 
   "Close_slave_can", 
   "@daewoo\n If you define evolution of the chance of frequency of alleles over time can you call that a law? At any rate it is not an even bet if it is true or false. What about the claim the earth is 6000 years old. Is it fair to say that it is an even money bet if this is true or false?", 
   {}, 
   76423, 
   null, 
   1099992540.0
  ], 
  [
   76461, 
   null, 
   "Nu Leader", 
   "Hello daewoo:\n Where on Earth did you learn this stuff? I've never even heard of it before, I know gravity and time with reference to general relativity, but that is as far as my knowledge stretches on gravity and relativity.\n \n What you seem to be thinking about in regars to Einstein is his \"equivalence principle\" which states that that the acceleration \"G\" acquired by a body subjected to a gravitational field is physically indistinguishable from the acceleration acquired by the body by means of an accelerate motion of its reference frame. A fundamental consequence of the principle of equivalence is the equality Mg = Mi of the gravitational mass Mg and of the inertial mass Mi, that is of the aptitude of a body to resist to the accelerating action of a force.\n \n \n \nThe rpoblem is that in the argument between evolution and craetionism has nothing to do with sicence, it is simply a new battlefield for the rteliogous and the athiests. If physicists were having a big argument about the theory of relativity, there would not be all this debate. Nobody would even care. It would just be a bunch of nerds squabbling, unless a new kind of microwave oven came out of it, it wuld hardly be worthy of mention until such a time as the debate was won conclusively by one side or the other.\n\n \n Wow, I am not one of the only people on this forum that believes evolution and creation have nothing to do with operations science, but is a battle of religious views about our origins! I really like the rest of your paragraph too! And it is true, no one would care!\n \n \nAnd while I would not support a sticker in a physics book which suggested that gravity is just a theory (what foolishness!)\n \n \n Gravity has been proved, we can both feel and measure it's effects and strength. We know what it does, and I assume that some scientist knows how it does work. I've never really looked that much into gravity before. Relativity does, however, have some scientific proof to it. I certainly believe that relativity is a theory, not truth, but there is some evidence for it. I just find some parts of it, a little confusing at times.\n \n With regard to the black holes, the speed of light would be the same in and out of the black holes (different frames of reference). Time would, however, slow down as a result of gravity - this forms a part of Einstein's general relativity.\n \n Hi pandion:\n \n \nToo bad that creationists want their mythology to be scientific so badly that they invent and misrepresent science without ever actually learning what science is or how it works \n \n \n Thus you deomonstrate your ignorance. I find it actually some what amusing that you - obviously from how you talk - a layman of science, would accuse true scientists (many of which have a Ph.D that requires years of study to achieve) of not knowing science and how it works. Did you know that arguably the best most talented scientist to ever walk on this Earth, Sir Isaac Newton was a Christian creationist? He made up some of the stuff that you study at school if you made it to the higher grades. There are many other famous names of well respected creation scientists of past and present - whom you mindlessly bag out - who have made enormous contributions to science including Michael Faraday, James Clerk Maxwell, Wernher von Braun (without him, the space travel may have been put back for years); Dr Werner Gitt has developed new laws and theories in the area of information science.\n \n As I and most likely every other user on this thread can see, your faith in evolution has blinded you from either stating the truth or investigating it. In fact, have you ever studied any creationist material, from organisations such as Answers in Genesis or the ICR (Institute for Creation Research)? If you have, please, tell me where they have done what you accuse them of in the quote above. Once you investigate, rather than just repeating rhetoric, you will find that your prejudice is not warranted nor needed. I have challanged many with this same challange I am giving to you, and none have answered back. Hmm, how weird.", 
   {
    "post_info": {
     "post_title": "Creation and evolution - battle of religions"
    }
   }, 
   76423, 
   null, 
   1099996080.0
  ], 
  [
   76476, 
   null, 
   "OccamsRazor", 
   "I have never heard the devout use the phrase \"theory of creation\". The label implies that \"creation theory\" is just as likely as \"evolutionary theory\" which is untrue.\n\n \n Yes, its part of the mimicry of science that creationists are so fond of these days.\n \n And to everyone, have a read of this article entitled Scales of Belief. Quite outside of the guys usual field of aircraft armament, its an interesting essay bearing in mind the nature of our discussions.", 
   {}, 
   76368, 
   null, 
   1100008440.0
  ], 
  [
   76618, 
   null, 
   "daewoo", 
   "@daewoo\n If you define evolution of the chance of frequency of alleles over time can you call that a law? \n\n \n I would call that mutation. \n \n \nAt any rate it is not an even bet if it is true or false. \n \n \n We have no actual eveidence of a single species evolving. While we definatly have instances in the fossile record which suggest this, we can not say conclusively that it has ever happened. Without being able to do that, it is an even money bet. \n \n Based on the evidence we have, the \"Aliens came down and forced evolution\" is a more probably bet than the standard theory of evolution, which usually involves slow change over time. it seems far more likely that evolution is not a slow process, but a number of leaps.\n \n \n \nWhat about the claim the earth is 6000 years old. Is it fair to say that it is an even money bet if this is true or false?\n\n \n Absolutly false. We KNOW the rate at which carbon 14 decays. If anybody is really interested, I can explain how to calculate it (put on you rnerd hat :) ). \n \n BUT (and since the creationists will likely bring it up) I will concede that setting an actual date for the beginning of the earth is difficult to do, since carbon 14, upon which most radiological dating is done, is created by bombardment of nitrogen in our upper atmosphere by cosmic radiation. It is theoretically possible that sometime in the earths past there was a MUCH higher level of cosmic radiation than generally believed which could throw estimates of the earths creation off by several million years. Certainly not enough to end up with a 6000 year number (not even close).", 
   {}, 
   76453, 
   null, 
   1100044920.0
  ], 
  [
   76633, 
   null, 
   "Tortle", 
   "We have no actual eveidence of a single species evolving. While we definatly have instances in the fossile record which suggest this, we can not say conclusively that it has ever happened. Without being able to do that, it is an even money bet.\n\n \n A few studies with bacteria and flies have shown some anagenesis. I believe a few such studies are referenced in this month's National Geographic article on evolution.\n \n \n \nBased on the evidence we have, the \"Aliens came down and forced evolution\" is a more probably bet than the standard theory of evolution, which usually involves slow change over time. it seems far more likely that evolution is not a slow process, but a number of leaps.\n\n \n I would disagree that evolution is based on saltationistic mutations. The evidence we have does support the \"standard theory of evolution\" in that time is long enough to account for diversity and observable adaptations are primarily small and isotonic. The gaps in the fossil record bother me, but I think that arguments for punctuated equilibrium (i.e., relative stasis of form is common, with infrequent accelerations in evolution caused by drastic environmental change) are quite persuasive.\n \n \n \nBUT (and since the creationists will likely bring it up) I will concede that setting an actual date for the beginning of the earth is difficult to do, since carbon 14, upon which most radiological dating is done, is created by bombardment of nitrogen in our upper atmosphere by cosmic radiation.\n\n \n First, C14 dating is performed on items younger than 40,000 years, with uranium used otherwise. Second, you're right in that other factors could influence dating (although I'm not sure about cosmic rays). However, if you have two fossils of the same strata, in different locations, but with the same date, I think you could reliably infer the age.", 
   {}, 
   76618, 
   null, 
   1100047020.0
  ], 
  [
   76634, 
   null, 
   "daewoo", 
   "Hello daewoo:\n Where on Earth did you learn this stuff? I've never even heard of it before, I know gravity and time with reference to general relativity, but that is as far as my knowledge stretches on gravity and relativity.\n \n What you seem to be thinking about in regars to Einstein is his \"equivalence principle\" which states that that the acceleration \"G\" acquired by a body subjected to a gravitational field is physically indistinguishable from the acceleration acquired by the body by means of an accelerate motion of its reference frame. A fundamental consequence of the principle of equivalence is the equality Mg = Mi of the gravitational mass Mg and of the inertial mass Mi, that is of the aptitude of a body to resist to the accelerating action of a force.\n\n \n That would be either MIT or K-State. To be honest, I don't rememeber which. That is more or less the basic formula for gravitation, pretty much everything else is built on that unless you get into some really advanced stuff (unless you are standing next to a particle accelerator, whatever you are speaking of in terms of gravitation is probably based on that formula in some way).\n \n I believe that is a paraphrase forma paper by a guy named William Smiley (don't want to be accused of plajarism....I have this terrible habit of retaining things like that, but never being able to remember for sure the author).\n \n \n \nWow, I am not one of the only people on this forum that believes evolution and creation have nothing to do with operations science, but is a battle of religious views about our origins! I really like the rest of your paragraph too! And it is true, no one would care!\n\n \n No you are certainly not the only one here who sees this debate for what it is. Both sides are pushing unproven theories, but both are working hard to pretend that are fact. Pathetic. \n \n \nGravity has been proved, we can both feel and measure it's effects and strength. We know what it does, and I assume that some scientist knows how it does work. I've never really looked that much into gravity before. Relativity does, however, have some scientific proof to it. I certainly believe that relativity is a theory, not truth, but there is some evidence for it. I just find some parts of it, a little confusing at times.\n\n \n The evidence for Einsteins relativity is largely that it has worked just about every time so far. Relativity is simple, once you recognise the difference between special relativity and general relativity and the implications of both. Read Einstein. I have yet to find anybody who is able to explain his theories quite as well as he does. \n \n \nWith regard to the black holes, the speed of light would be the same in and out of the black holes (different frames of reference). Time would, however, slow down as a result of gravity - this forms a part of Einstein's general relativity.\n\n \n Yes, in theory. It has been suggested, and there is some degree of evidence, that the speed of light may NOT be constant in and out of a black hole, irregardless of your frame of reference (I know, bizarre). This has been something of a disputed point in the physics world for a little while now. \n \n Black holes are an anomaly, and we have never really had the opportunity to study one first hand, so most of it is theory, but there has been some suggestion that black holes produce anti matter, which we are already fairly certain does not follow einsteins relativity (general or special). \n \n Again, you are getting into really \"weird\" physics here. If you are interested in it, PM me. Otherwise this thread could be many pages long, and as we already agreed, NOBODY cares about a debate in physics. They are saving all their energy to argue their unproven theories in regards evolution/creationism. \n \n Speaking of black holes, though, I heard a tidbit the other day that a sicentist at Los Alamos believes he MAY be able to create a black hole. Nobody knew how he proposed to do it. He was, apparently, having trouble getting authorization and funding to do it. I guess I'm not the only one who thinks a black hole in Arizona MIGHT be a bad thing :) :) :)", 
   {}, 
   76461, 
   null, 
   1100047560.0
  ], 
  [
   76635, 
   null, 
   "OccamsRazor", 
   "The age of the earth has been quite well constrained for some time now, the figure of 4.55 billion years being widely acknowledged.\n \n Have a read about it here where common criticisms of radiometric dating are also examined.", 
   {}, 
   76633, 
   null, 
   1100047620.0
  ], 
  [
   76651, 
   null, 
   "stormboy", 
   "Here's the full text of the sticker.\n \n Creationists read this and wonder why there is a problem. Here's why. As has been mentioned there isn't any movement to put stickers in physics or chemistry books. But it would read like this if there were:\n \n Or maybe the textbooks in medical schools should have a sticker like this:\n \n Besides that, evolution is not a theory about the origin of living things. Evolution is a theory that explains how and why living things change as a response to their environment.\n \n I think that it is only fair that if the teaching of religion is to be allowed in public school science classes, then equal time should be given to evolutionary biology in fundamentalist churches. Half of the time should be devoted to the morality sermons and half to the presentation of the principles of evolutionary biology.\n \n I suggest the following as a sticker for the front of the Bible:\n\n \n How can we observe a monkey turning into a man? \n How can we observe gravity and deseases?\n I can see a tiny bit of a differance between the two!... Can you?\n Morality classes and evolution classes. How can some one build with the right hand that with which the left hand is consistently looking to destroy?", 
   {}, 
   76256, 
   null, 
   1100052360.0
  ], 
  [
   76653, 
   null, 
   "daewoo", 
   "A few studies with bacteria and flies have shown some anagenesis. I believe a few such studies are referenced in this month's National Geographic article on evolution.\n\n \n IMHO, they seem to point towards minute mutations based on external stimulai rather than long term evolutionary change. The test would seem to be whether the flies or bacteria in question are capable of exibiting not only a long term genetic change, but one capable of transforming the organism into a different species, or ideally the mutation into a higher level organism. This is what we are lacking. Until this can be proven conclusively, either by direct observation or insurmountable facts based on the fossile record, there will continue to be questions.\n \n \n \nI would disagree that evolution is based on saltationistic mutations. The evidence we have does support the \"standard theory of evolution\" in that time is long enough to account for diversity and observable adaptations are primarily small and isotonic. The gaps in the fossil record bother me, but I think that arguments for punctuated equilibrium (i.e., relative stasis of form is common, with infrequent accelerations in evolution caused by drastic environmental change) are quite persuasive.\n\n \n I would agree to a point. While it is true that an occurance of the circumstances required to preserve a fossil are rare, it woud seem to me that they were common enough that something should have filled at least some of the gap in the fossil record by now. Granted we have seen some fossiles that, when viewed in a certain light, do suggest the possibility of continous mutation, they are by no means conclusive.\n \n Even more damaging to the theory is the fact that we have several examples of species appearing apparently out of nowhere and we lack the evidence which would suggest that there was any drastic environmental change. This suggests some kind of spontaneous evolution, which goes against the standard theory of evolution. \n \n It would seem that the standard theory of evolution is also dealt a blow when one considers the existance/discovery of animals which were once assumed extinct (certina fish come to mind). In studying live specimines and their fossilised ancestors, we are not seeing evidence of evolution. They apparently have survived entirely unchanged, despite the fact that other species which date from the same time period have either evolved or become extinct.\n \n \n \n \nFirst, C14 dating is performed on items younger than 40,000 years, with uranium used otherwise. Second, you're right in that other factors could influence dating (although I'm not sure about cosmic rays). However, if you have two fossils of the same strata, in different locations, but with the same date, I think you could reliably infer the age.\n\n \n Yes, 100% correct about the carbon 14 dating. I was thinking of fossilization, not the age of the earth in general (my bad). Carbon 14 is created by a breakdown of nitrogen int he atmosphere, that breakdown being caused by cosmic radiation along certain wavelengths (would have to look up for the specific ones....). I have heard creationists argue that the earth may have at one time been exposed to higher levels of such radiation, which effects the results of carbon dating. This is a pretty lame theory. As you point out, it is easily discredited by examination of the earths crust and the different strata", 
   {}, 
   76633, 
   null, 
   1100052900.0
  ], 
  [
   76667, 
   null, 
   "Mach", 
   "\n \n We have no actual eveidence of a single species evolving. While we definatly have instances in the fossile record which suggest this, we can not say conclusively that it has ever happened. Without being able to do that, it is an even money bet. \n \n\n \n All other evidence in favor aside, Occam's razor ensures it's not an \"even money\" bet. Apply it. It's not a silver bullet, yet it's ability to guide one through theory formation is impressive. You suggest that to get past 50/50, one must be certain of one or the other. You work from a scale of 0, 50, 100. While science, and reason, works from 0-100. Degree of certainty, probability, the like.\n \n All evidence to date suggests no need for anything other than time/matter interaction.\n \n No evidence to date suggests a divine creator (irrational in most terms) or ET intervention.\n \n Besides there being no necessary reason for the complex notion of aliens intervening with a natural process, it would then beg the question, how did the aliens come into being? Then you're back to the same question. \n \n I'd take your odds in vegas any day....\n \n -Mach", 
   {}, 
   76618, 
   null, 
   1100061780.0
  ], 
  [
   76680, 
   null, 
   "Nu Leader", 
   "To OccamsRazor:\n \n \nThe age of the earth has been quite well constrained for some time now, the figure of 4.55 billion years being widely acknowledged.\n\n \n Yes, it has been widely acknowledged, not because it is true, but because it fits with evolutionary theory. It is impossible to measure the age of the Earth scientifically. You cannot use a measuring device and plug two electrodes into the ground and get some kind of reading on the device that tells you how old the Earth is. There is no substance called \"age\". The only way that you can try and measure the age of something older than yourself is by using assumptions. Assumptions are starting faiths. You know, you think you might know how much radioactive material was in there in the first place, you might also think that the rate at which the clock has been ticking (the decay rate) is a constant, that the world has no had any catastrophic events, such as Noah's Flood, i.e. everything has went on like this since the start of the world. All of these are fallible assumptions, now, because they are starting faiths you can't prove nor disprove them, but what you can say is \"How reasonable are they?\" \n \n Okay, that's one thing, the other thing we can do is to test them on the rocks in the present of known ages, e.g. rocks that have formed in the past 40 years that were formed from volcanic erruptions, for example. Now the radiometric dating methods generally work from the assumption that the clock starts cooling when the lava freezes and becomes solid rock. When we do test the methods, we get dates in the thousands and sometimes in the millions, for this 40 year old rock! This shows how worthless they are for measuring how old rocks are. Scientists have said that \"There's just no pattern here, may be we can't use radiometric dating methods to date rocks, may be all what we can use them for is to map rocks\", e.g. find the source of magma from which it came. \n \n The evolutionists say sometimes that most radiometric dating methods are not meant for such short time periods and so are much more useful in long ages. But here is the problem, fallible assumptions are made that WILL cause the date to be out by large figures, 99.99999999% in some cases. If we can't trust radiometric on rocks of known ages, why should we trust them on rocks of UNKOWN ages? That is not only irrational, but illogical! Would you not agree Mach? It is much like knowing the unknowable. To know the unknowable, you must take it by faith as I explained in that other thread. Where I stated that everything out side of operations science and the present, i.e. science involving the present, is unknowable - unless there are eye witness accounts.\n \n Summing up, since all radiometric dating methods require fallible assumptions when they are being used to project back into the far distant past, and these assumptions are based on their underlying beliefs:\n You are using evolutionary assumptions to prove evolutionary theory.", 
   {
    "post_info": {
     "post_title": "You are using evolutionary assumptions to prove evolutionary theory!"
    }
   }, 
   76635, 
   null, 
   1100069700.0
  ], 
  [
   76681, 
   null, 
   "Nu Leader", 
   "Hello Mach:\n \n I really thought that you were starting to understand the basic cold hard fact that states the real nature of this debate, it isn't science v religion, it is religion v religion or belief v belief (i.e. atheistic evolution v. Christian creation):\n Both creationists and evolutionists have the same evidence - just different interpretations that DEPEND on their underlying assumptions.\n I feel like smashing my head into a wall because this is a simple concept to understand that EVERYONE but two or so people either ignore or are willingly ignorant of, but I'll let the little smilie do it for me... :xbanghead \n \n \nAll evidence to date suggests no need for anything other than time/matter interaction.No evidence to date suggests a divine creator (irrational in most terms) or ET intervention.\n\n \n But where did that matter come from in the first place? We know that natural processes cannot \"create\" something from nothing, not even quantum physics is able to do that. There needs to be a Creator God who made the matter, and with that, time starts.\n \n The same evidence that you dismiss because of your underlying beliefs can be used as evidence for a creator! For example, these following link will provide a lot of examples about design:\n * Creation Design Features.", 
   {
    "post_info": {
     "post_title": "There may be hope for you yet to understand the nature of the debate..."
    }
   }, 
   76667, 
   null, 
   1100070360.0
  ], 
  [
   76711, 
   null, 
   "Clive14", 
   "Hello Mach:\n \n I really thought that you were starting to understand the basic cold hard fact that states the real nature of this debate, it isn't science v religion, it is religion v religion or belief v belief (i.e. atheistic evolution v. Christian creation):\n Both creationists and evolutionists have the same evidence - just different interpretations that DEPEND on their underlying assumptions.\n I feel like smashing my head into a wall because this is a simple concept to understand that EVERYONE but two or so people either ignore or are willingly ignorant of, but I'll let the little smilie do it for me... :xbanghead \nBash your head all you want: it might just knock some sense into you. The debate is 100% science versus religion. Evolution is pure science. Religion has nothing to do with it. Creation is pure religion and science has nothing to do with it.\n \n Having thought about it, what the sticker should really say is:\n Evolution is a well developed scientific theory based upon very large amounts of fact and evidence. Despite this, it presents ideas that contradict some religious teachings and so, unlike most other scientific theories, it remains contraversial in some parts of the world", 
   {}, 
   76681, 
   null, 
   1100086020.0
  ], 
  [
   76713, 
   null, 
   "Clive14", 
   "Yes, it has been widely acknowledged, not because it is true, but because it fits with evolutionary theory.\nCompletely untrue. It is widely acknowledged because it explains the geology of the Earth. Evolution has nothing to do with it.\n \n \nIt is impossible to measure the age of the Earth scientifically.\nUntrue. It has been done. You don't like the result, because it contradicts a fairy tale you hold to be true, but that is irrelevent. The Earth has been aged scientifically and accurately and it is very old.", 
   {}, 
   76680, 
   null, 
   1100086200.0
  ], 
  [
   76731, 
   null, 
   "stormboy", 
   "Completely untrue. It is widely acknowledged because it explains the geology of the Earth. Evolution has nothing to do with it.\n \n Untrue. It has been done. You don't like the result, because it contradicts a fairy tale you hold to be true, but that is irrelevent. The Earth has been aged scientifically and accurately and it is very old.\n\n What tool did they use to determine the age of the earth?. Is it the same tool they used to date a living shellfish and find it to be thousands of yrs old...\n \n \"The earth has been scientifically and accurately and its very old\". This sounds like another absolute to me, when i believe from what the evolutionists are saying that there can not be any absolutes?", 
   {}, 
   76713, 
   null, 
   1100093040.0
  ], 
  [
   76735, 
   null, 
   "Clive14", 
   "What tool did they use to determine the age of the earth?. Is it the same tool they used to date a living shellfish and find it to be thousands of yrs old...\n \n \"The earth has been scientifically and accurately and its very old\". This sounds like another absolute to me, when i believe from what the evolutionists are saying that there can not be any absolutes?\n\n See the thing is Stormboy, this sort of comment from you reafirms my view that you are stupid and believe the lies and propoganda that creation \"experts\" spout. For example, if someone informed you that screwdrivers where a useless tool because they had tried to screw a lightbulb into its socket with one and broke the bulb, would you:\n (a) accept that the screwdriver was a useless tool?\n (b) conclude that the person was more than a little deranged?\n \n So when someone uses a tool that is known to not work on aquatic samples, for very well understood reasons, to test an aquatic sample do you blame the tool and not the imbecile wielding it?", 
   {}, 
   76731, 
   null, 
   1100095680.0
  ], 
  [
   76741, 
   null, 
   "stormboy", 
   "See the thing is Stormboy, this sort of comment from you reafirms my view that you are stupid and believe the lies and propoganda that creation \"experts\" spout. For example, if someone informed you that screwdrivers where a useless tool because they had tried to screw a lightbulb into its socket with one and broke the bulb, would you:\n (a) accept that the screwdriver was a useless tool?\n (b) conclude that the person was more than a little deranged?\n \n So when someone uses a tool that is known to not work on aquatic samples, for very well understood reasons, to test an aquatic sample do you blame the tool and not the imbecile wielding it?\n\n How can you come to the conclusion that i am stupid from that, misinformed maybe, but stupid?.\n You might want to watch how easily you throw your insults around champ... One day it just may end up in the wrong direction and you may end up in a very unpleasant posi and when that day comes, who is going to be feeling stupid?\n By the way i choose b. It takes a man with their head on their shoulders to be able to recieve correction. Thankyou\n I would still like to look more into how they actually date the earth", 
   {}, 
   76735, 
   null, 
   1100097960.0
  ], 
  [
   76743, 
   null, 
   "Clive14", 
   "How can you come to the conclusion that i am stupid from that, misinformed maybe, but stupid?.\nMy apologies. I accept that I was being unnecessarily rude there.", 
   {}, 
   76741, 
   null, 
   1100098260.0
  ], 
  [
   76744, 
   null, 
   "stormboy", 
   "My apologies. I accept that I was being unnecessarily rude there.\n\n Apology accepted!", 
   {}, 
   76743, 
   null, 
   1100099220.0
  ], 
  [
   76775, 
   null, 
   "Tortle", 
   "Sorry if this seems to be a digression to the flow of the thread...\n \n \n \nIMHO, they seem to point towards minute mutations based on external stimulai rather than long term evolutionary change. The test would seem to be whether the flies or bacteria in question are capable of exibiting not only a long term genetic change, but one capable of transforming the organism into a different species, or ideally the mutation into a higher level organism. This is what we are lacking. Until this can be proven conclusively, either by direct observation or insurmountable facts based on the fossile record, there will continue to be questions.\n\n \n I agree. I think more time for the studies is necessary to prove their validity. But my main argument for small-scale variations as the primary \"fuel\" for natural selection (and therefore evolution itself) is that it's so ubiquitous. Large-scale mutations are rare, and mutations that are favorable are even rarer. In contrast, variations are plentiful, with relatively more that are favorable. \n \n However, I don't want to sound like I'm a panselectionist, discounting the importance of mutation entirely. I think that mutation is a valid form of evolution, but natural selection based on small-scale variation is the norm. The question I'm sure neither of us will be able to resolve (at least here) is whether the sum of the frequent variations overpowers the few infrequent mutations. If so, I'm right... if not, you're right.\n \n \n \nI would agree to a point. While it is true that an occurance of the circumstances required to preserve a fossil are rare, it woud seem to me that they were common enough that something should have filled at least some of the gap in the fossil record by now. \n\n \n I absolutely agree, which is why I think punctuated equilibrium is valid.\n \n \n \nEven more damaging to the theory is the fact that we have several examples of species appearing apparently out of nowhere and we lack the evidence which would suggest that there was any drastic environmental change. This suggests some kind of spontaneous evolution, which goes against the standard theory of evolution.\n\n \n I don't think it necessarily implies mutation. The environment may have changed, but we may have no ability to record the change. Maybe other species not recorded in the fossil record imposed some evolutionary pressure. Or, maybe it's accounted for by other evolutionary influences like genetic drift, sexual selection, or even mutation. The importance lies in the frequency of occurrence. \n \n \n \nIt would seem that the standard theory of evolution is also dealt a blow when one considers the existance/discovery of animals which were once assumed extinct (certina fish come to mind).\n\n \n Species don't evolve if not given a reason to do so: those that are not in changing environments would not change. It's conceivable that these living fossils were isolated from changing environments.", 
   {}, 
   76653, 
   null, 
   1100107560.0
  ], 
  [
   76789, 
   null, 
   "OccamsRazor", 
   "Firstly, Stormboy: if you want to know how the age of 4.55 billion years was arrived at for the earth, read the kink I gave in the previous post.\n \n \nYes, it has been widely acknowledged, not because it is true, but because it fits with evolutionary theory.\n\n \n This is not a reflection of the history of the science in this subject. The fact is you have stated the relationship the wrong way round. It is evolutionary theory that has to fit within the timescale for the age of the earth and not the other way round as you suggest. If you were so inclined to find out about this I would recommend the book The Dating Game which looks at the background to how the current scientific view of the AoE came to be.\n \n \nIt is impossible to measure the age of the Earth scientifically. You cannot use a measuring device and plug two electrodes into the ground and get some kind of reading on the device that tells you how old the Earth is.\n\n \n Well, you actually seem to have an accidental appreciation for the careful technique that radiometric dating is. You certainly cannot do exactly as you say, but metaphorically you can via careful preparation of samples and some very expensive equipment. [edited for clarity]\n \n \nThere is no substance called \"age\". The only way that you can try and measure the age of something older than yourself is by using assumptions. Assumptions are starting faiths. You know, you think you might know how much radioactive material was in there in the first place, you might also think that the rate at which the clock has been ticking (the decay rate) is a constant, that the world has no had any catastrophic events, such as Noah's Flood, i.e. everything has went on like this since the start of the world. All of these are fallible assumptions, now, because they are starting faiths you can't prove nor disprove them, but what you can say is \"How reasonable are they?\"\n\n \n Age exists because we live in a world where time is a dimension. It is our way of relating the \"now\" (present) to the \"before\" (past) and to the \"to come\" (future).\n \n As to the rest, well you can believe that if you want, but such nebulous assertions are as useless as they are enabling as they can be used to undermine any point of view one cares to disagree with.\n \n Also, I would point out that you have shot yourself in the foot, so to speak, with that comment. How do you know what the age of the earth is without using assumptions? Oh, and by the way I think it was God's flood, Noah just happened to be around to float on it.\n \n \nOkay, that's one thing, the other thing we can do is to test them on the rocks in the present of known ages, e.g. rocks that have formed in the past 40 years that were formed from volcanic erruptions, for example. Now the radiometric dating methods generally work from the assumption that the clock starts cooling when the lava freezes and becomes solid rock. When we do test the methods, we get dates in the thousands and sometimes in the millions, for this 40 year old rock! This shows how worthless they are for measuring how old rocks are. Scientists have said that \"There's just no pattern here, may be we can't use radiometric dating methods to date rocks, may be all what we can use them for is to map rocks\", e.g. find the source of magma from which it came.\n \n The evolutionists say sometimes that most radiometric dating methods are not meant for such short time periods and so are much more useful in long ages. But here is the problem, fallible assumptions are made that WILL cause the date to be out by large figures, 99.99999999% in some cases. If we can't trust radiometric on rocks of known ages, why should we trust them on rocks of UNKOWN ages? That is not only irrational, but illogical! Would you not agree Mach? It is much like knowing the unknowable. To know the unknowable, you must take it by faith as I explained in that other thread. Where I stated that everything out side of operations science and the present, i.e. science involving the present, is unknowable - unless there are eye witness accounts.\n\n \n Sounds like you have been reading about the (in)famous piece of scientific fraud perpetrated by Steve Austin when he had samples of Mt. St. Helens dacites from the 1981 eruption radiometrically dated and returned a result very different to the date we record the eruption at. What you are trying to use as a line of criticism is actually a great strength of our understanding of radiometric dating- there are clear conditions when such tests are not appropriate.\n \n To finish with I'd like to draw an example from a hobby of mine- WW2 Aviation simulation- to show why written history is the last piece of evidence you use when trying to technically/scientifically model something from history.\n \n Lets say we are trying to make a simulation of a WW2 Fighter for a computer program. To do this we need evidence to build our models on, and fortunately there are many sources available to help us do this;\n \n Test pilot accounts from the side that built the plane.\n Evaluation reports of captured enemy aircraft.\n Pilot accounts who flew the planes in combat.\n Manufacturer's test data.\n Photo's.\n Gun camera footage.\n \n The best piece of evidence here is the manufacturer's test data. Basically lots of number tables and graphs, this tells us in clear terms the performance of the airplane under different conditions. Flight models can be constructed from these to simulate the plane of interest. Test pilot evaluations also provide numerical data, although from a different perspective. So do evaulation reports of captured aircraft, but these need to be treated with more caution as we don't always know (i) were the planes in full working order (ii) had they been damaged (iii) did the technicians know how to correctly service unfamiliar equipment (iv) did the test pilots know how to properly operate the airplanes and (v) human bias on enemy equipment. Photo's can be useful for constructing 3d models. \n \n However, the two most vivid pieces of evidence- pilot accounts in combat and gun camera footage have to be considered with great skepticism. We might have a piece of film that shows a certain plane outmanouvering another. However, we know very little about the reasons that allowed this to happen- we cannot gain anything concrete that will help our models here. Likewise pilot accounts are written by those who were successful and survived. They often developed an endearment towards the planes they flew and their success can often attributed to tactical tricks they used. This leads to a tendancy to describe their planes in the most glowing terms, even when technically they were medicore. Once again we have very little that is concrete here and the use of such material in our model has to be subjected to great scrutiny before we consider it at all.\n \n All written history has to be read as such.... it is no subsitute for empirical methods in terms of technical matters.\n \n \nSumming up, since all radiometric dating methods require fallible assumptions when they are being used to project back into the far distant past, and these assumptions are based on their underlying beliefs:\n You are using evolutionary assumptions to prove evolutionary theory.\n\n \n Summing up I think you are mis-using language to muddy the issues here and present science and religion in false light to what they actually are. To use a phrase you will be familiar with you are teaching the controversy.", 
   {}, 
   76680, 
   null, 
   1100111640.0
  ], 
  [
   76835, 
   null, 
   "pandion", 
   "Sorry, didn't C&P properly. My bad\n\n Apology accepted.\n \nThe law of gravitation would be Newtons universal gravitation law\n\n Right. A simple observation that can be expressed by a single equation. It is usually claimed that the laws of science don't change. But that's not true. After almost 400 years Newton's laws of motion were changed when new data was accumulated.\n \nWrong answer. theories are unproven. That is why it is a theory. Get a dictionary.\n\n I have spent a number of years in an effort to give my students the basics of what science is and how it operates. One misconception is that that scientific theories are \"unproven\" and that is why they are theories. The problem seems to be that too many people use their little golden dictionary and expect to find the meanings of words as they are used by scientists. Sorry. It doesn't work that way. To the common man a theory is a wild and unsupported guess - my lights go out during a storm and I have a theory -- I hear a boom in the sky and I have a theory about what caused it -- there is a brown spot in my lawn and I have a theory.\n \n But that dictionaries don't do a very good job of explaining the meaning of the word in the context of science. Dictionaries tell you that a theory includes the idea of speculation or conjecture. Not in science. One definition, \"a plausible or scientifically acceptable general principle or body of principles offered to explain phenomena <wave theory of light<\" given by Merriam-Webster is better but still doesn't go far enough.\n \n First, a theory is an explanation for a body of facts. A scientific theory has been tested. First a prediction is made from an hypothesis of some observation that must be true if the hypothesis is correct. Then an experiment is designed that will make it possible to check the predicted observation. It it it found, then the hypothesis is supported and is called a theory, if not it is cast aside.\n \n Some other examples of scientific theories (besides gravity, which encompasses much more than you are aware of - the theory of quantum gravity is an effort to unite the most important theories of physics, quantum mechanics and the theory of general relativity). Of course there is also the germ theory of disease or the heliocentric theory which states that planets orbit the sun.\n \n Of all of these theories one of the best supported is the theory of evolution - we know very little of why gravity works. But it has been supported by observation.\n \n In fact, the theories of relativity have been shown to be correct. Light passing a massive star bends. Light escaping from a massive star is shifted in wave length. These facts are just some of the indications that the theory is correct.\n \nEducation is not something I lack.\n\n I meant education in science. From what I have seen, you couldn't pass one of my elementry courses. Anyone who thinks that scientific theories grow up to be laws of science when they are \"proven\" is scientifically illiterate.\n \nMany scientific theories have been conclusively proven, even outside the realm of mathematics.\n\n Absolutely wrong. None have been proven. In every case there is always the idea the new information can change the theory. It happens all the time. Theories are adjusted frequently.\n \nThe fact that something has been labeled a theory does not mean it has been tested and verified many tiems over.\n\n Actually, in most cases it does. Or it means that it has been tested so conclusively that failure to grant tentative acceptance would be foolish.\n \nI am well aware of how science works and the proper usage of the word \"theory\".\n\n Obviously you are not only NOT well aware of how science works, you don't even understand the basics. Anyone who claims that science is proven is scientifically illiterate. Obviously your refuge in \"the dictionary,\" which gives common usage rather than the meaning used by scientists, shows that you know less than you claim.\n \nThinking like yours has set research into anti matter back years due to early researchers trying to bend their results to meet Einsteins theories.\n\n That's just silly. Give me 5 examples. And while you're at it, give me 5 examples of scientific theories that have been proven and are therefore laws. The very concepts are meaningless.\n \nThere is no hard evidence which proves evolution, just as there is no hard evidence whihc proves creationism.\n\n I don't know how many times I'll have to say it before you begin to grasp the idea. Scientific theories are not proven. In science, a theory is as good as it gets. But still there is lots of evidence that shows that the theories of evolution are correct, would you like to hear of some?\n \n On the other hand, there is lots of evidence that does prove that creationism is wrong. It is mythology based on the tales of bronze age nomads. They gathered their mythology from several sources, which explains why there are two myths of creation. And a the biblical flood can only be believed if one intentionally closes out consideration of reality.", 
   {}, 
   76476, 
   null, 
   1100134440.0
  ], 
  [
   76841, 
   null, 
   "sinjin", 
   "Apology accepted.\n \n Right. A simple observation that can be expressed by a single equation. It is usually claimed that the laws of science don't change. But that's not true. After almost 400 years Newton's laws of motion were changed when new data was accumulated.\n \n I have spent a number of years in an effort to give my students the basics of what science is and how it operates. One misconception is that that scientific theories are \"unproven\" and that is why they are theories. The problem seems to be that too many people use their little golden dictionary and expect to find the meanings of words as they are used by scientists. Sorry. It doesn't work that way. To the common man a theory is a wild and unsupported guess - my lights go out during a storm and I have a theory -- I hear a boom in the sky and I have a theory about what caused it -- there is a brown spot in my lawn and I have a theory.\n \n But that dictionaries don't do a very good job of explaining the meaning of the word in the context of science. Dictionaries tell you that a theory includes the idea of speculation or conjecture. Not in science. One definition, \"a plausible or scientifically acceptable general principle or body of principles offered to explain phenomena <wave theory of light<\" given by Merriam-Webster is better but still doesn't go far enough.\n \n First, a theory is an explanation for a body of facts. A scientific theory has been tested. First a prediction is made from an hypothesis of some observation that must be true if the hypothesis is correct. Then an experiment is designed that will make it possible to check the predicted observation. It it it found, then the hypothesis is supported and is called a theory, it not it is cast aside.\n \n Some other examples of scientific theories (besides gravity, which encoumpasses much more than you are aware of - the theory of quantum gravity is an effort to unite the most important theories of physics, quantum mechanics and the theory of general relativity). Of course there is also the germ theory of disease or the heliocentric theory which states that planets orbit the sun.\n \n Of all of these theories one of the best supported is the theory of evolution - we know very little of why gravity works. But it has been supported by observation.\n \n In fact, the theories of relativity have been shown to be correct. Light passing a massive star bends. Light escaping from a massive star is shifted in wave length. These facts are just some of the indications that the theory is correct.\n \n I meant education in science. From what I have seen, you couldn't pass one of my elementry courses. Anyone who thinks that scientific theories grow up to be laws of science when they are \"proven\" is scientifically illiterate.\n \n Absolutely wrong. None have been proven. In every case there is always the idea the new information can change the theory. It happens all the time. Theories are adjusted frequently.\n \n Actually, in most cases it does. Or it means that it has been tested so conclusively that failure to grant tentative acceptance would be foolish.\n \n Obviously you are not only NOT well aware of how science works, you don't even understand the basics. Anyone who claims that science is proven is scientifically illiterate. Obviously your refuge in \"the dictionary,\" which gives common usage rather than the meaning used by scientists, shows that you know less than you claim.\n \n That's just silly. Give me 5 examples. And while you're at it, give me 5 examples of scientific theories that have been proven and are therefore laws. The very concepts are meaningless.\n \n I don't know how many times I'll have to say it before you begin to grasp the idea. Scientific theories are not proven. In science, a theory is as good as it gets. But still there is lots of evidence that shows that the theories of evolution are correct, would you like to hear of some?\n \n On the other hand, there is lots of evidence that does prove that creationism is wrong. It is mythology based on the tales of bronze age nomads. They gathered their mythology from several sources, which explains why there are two myths of creation. And a the biblical flood can only be believed if one intentionally closes out consideration of reality.\n\n \n Nice one teach. emoticon_xhoho", 
   {}, 
   76835, 
   null, 
   1100134920.0
  ], 
  [
   76842, 
   null, 
   "pandion", 
   "Sir Isaac Newton was a Christian creationist?\n\n You show your ignorance. Sir Isaac Newton was not really what might be considered a Christian. You can learn the facts and educate yourself by reading about it. There are two recent books about Newton on the market right now. If you learned what you were talking about before you spoke you would find that Newton was an arian. Newton denied the divinity of Jesus, believing that he was a good man sent by God, but nothing more. Of course he spoke little of his belief because it would have meant death from the merciful Christians - he did write about it in his private papers. Do you need the references to those books?\n \n As for being a \"creationist\", there were no alternatives since science hadn't discovered them at the time. In fact, modern science didn't actually exist. Newton was one of the first who actually paid attention to the evidence rather than mythology. Creationists came about in the late 1800s.\n \n If you want to claim the \"Newton was so smart and he was a creationist so it must be right,\" then you must also agree that \"Newton was so smart and denied the divinity of Jesus, so it must be right.\"\n \n By the way, I have science degrees from several universities. Obviously, you don't.", 
   {}, 
   76476, 
   null, 
   1100135220.0
  ], 
  [
   76850, 
   null, 
   "pandion", 
   "How can we observe a monkey turning into a man?\n\n The topic of discussion was evolution. Did you get lost? Only a creationist wishing to misinform ignorant dupes would make such a statement. No evolutionary biologist would ever make such a claim. It seems that you oppose something and you don't even know what it is.\n \nHow can we observe gravity and deseases?\n\n I can observe the effects of gravity and I can observe the effects of disease. I have even observed some of the theoretical pathogens of disease under a microscope. For example, I have seen streptococcus and staphylococcus.\n \nI can see a tiny bit of a differance between the two!... Can you?\n\n The topic wasn't the similarity between gravity and disease. It was mentioned as an example of scientific theories. The explanations for gravity (incomplete though they may be) and the explanations of diseases caused by pathogens are theories. You seem to have missed the point. There is also the theory that the earth is a sphere, and the theory that the earth orbits the sun with other planets (part of the theory of gravity explains why). And the theory that the power of the sun is caused by fusion, first hydrogen and then other elements up to iron. There is the theory that moisture laden warm air will push up over colder dry air and produce rain. There is the theory that earthquakes and volcanoes are caused by the movement of tectonic plates that move about over the molten core of the earth. And there is the theory that living things change through time in response to their environment.\n \nMorality classes and evolution classes. How can some one build with the right hand that with which the left hand is consistently looking to destroy?\n\n What are you talking about? I'm really getting tired of people who don't know the basics of the subject telling me what I think. I'm not sure what you think your morality has to do with evolution. I think the idea is ludicrous and demonstrates a dismal understanding of morality or no morality at all. All I can say is that as far as I know, evolutionary theory isn't anti-moral.\n \n I must say, stormboy, that was one of the silliest posts I have seen in a long time. It showed no thought and no education.", 
   {}, 
   76743, 
   null, 
   1100137080.0
  ], 
  [
   76855, 
   null, 
   "OccamsRazor", 
   "Nice one teach. emoticon_xhoho\n\n \n Indeed emoticon_xgood", 
   {}, 
   76841, 
   null, 
   1100138460.0
  ], 
  [
   76860, 
   null, 
   "daewoo", 
   "Right. A simple observation that can be expressed by a single equation. It is usually claimed that the laws of science don't change. But that's not true. After almost 400 years Newton's laws of motion were changed when new data was accumulated.\n\n \n It is far more than a basic observation, and the implications are far reaching (like relativity). \n \n \nI have spent a number of years in an effort to give my students the basics of what science is and how it operates. One misconception is that that scientific theories are \"unproven\" and that is why they are theories. The problem seems to be that too many people use their little golden dictionary and expect to find the meanings of words as they are used by scientists. Sorry. It doesn't work that way. To the common man a theory is a wild and unsupported guess - my lights go out during a storm and I have a theory -- I hear a boom in the sky and I have a theory about what caused it -- there is a brown spot in my lawn and I have a theory.\n\n \n Yes, I thought you were probably a teacher. This is why I fully support testing our teachers on an annual basis to ensure they are up to standard. \n \n \nBut that dictionaries don't do a very good job of explaining the meaning of the word in the context of science. Dictionaries tell you that a theory includes the idea of speculation or conjecture. Not in science. One definition, \"a plausible or scientifically acceptable general principle or body of principles offered to explain phenomena <wave theory of light<\" given by Merriam-Webster is better but still doesn't go far enough.\n \n First, a theory is an explanation for a body of facts. A scientific theory has been tested. First a prediction is made from an hypothesis of some observation that must be true if the hypothesis is correct. Then an experiment is designed that will make it possible to check the predicted observation. It it it found, then the hypothesis is supported and is called a theory, if not it is cast aside.\n\n \n \n To simplify, a theory is a school of thought on the implications of a body of evidence. A theory is unproven, and in many cases, unprovable, the only way you may prove a theory is either mathematically, or through direct observation. Neither has been done with the theory of evolution.\n \n \nSome other examples of scientific theories (besides gravity, which encompasses much more than you are aware of - the theory of quantum gravity is an effort to unite the most important theories of physics, quantum mechanics and the theory of general relativity). Of course there is also the germ theory of disease or the heliocentric theory which states that planets orbit the sun.\n\n \n Gravity is not somethign you need to give me a primer on, my education in that area came from much more qualified sources than you. \n \n \nOf all of these theories one of the best supported is the theory of evolution - we know very little of why gravity works. But it has been supported by observation.\n\n \n Beyond that, we have a mathematical gravity for gravity that can be proven. There is no such madel for evolution, nor is their insurmaountable evidence, nor have we directly observed the evolution of any species. \n \n \nIn fact, the theories of relativity have been shown to be correct. Light passing a massive star bends. Light escaping from a massive star is shifted in wave length. These facts are just some of the indications that the theory is correct.\n\n \n Certainly these fact indicate that the theory is correct. They are not in and of themselves \"proof\" that the theory of relativity is correct. Einstein worked his whole life in an effort to \"prove\" the theory of relativity and, oddly enough, to disprove the theories behind quantum physics. He could do neither and by his own admission, it may never be possible to conclusively prove his theory of relativity.\n \n \nI meant education in science. From what I have seen, you couldn't pass one of my elementry courses. Anyone who thinks that scientific theories grow up to be laws of science when they are \"proven\" is scientifically illiterate.\n\n \n Granted my background in science is largely in physics, where we hold to a slightly higher standard than many of the softer sciences. In physics, either something is proven or it is not. It is that simple. There is little or no guesswork in this area. Either ytou are working with a proven constant, or you are trying to prove one. \n \n \n \nAbsolutely wrong. None have been proven. In every case there is always the idea the new information can change the theory. It happens all the time. Theories are adjusted frequently.\n\n \n Yes, they are. Laws, however, are not. I am starting to see the problem we are having in relating here. You are failing to see that our physical universe is governed by a set of laws which are unbendable, anything else is simply a theory which may later be proven incorrect (such as the theory of spontaneous generation, which people argued for years). I am going to go out on a limb here and say that your background is not physics, where we have the luxury of being able to prove our theories, but instead it is in some of the softer sciences, where proof is exceptionally difficult to come by, so you try to spin theories, even those with fairly expansive holes in them, as fact. \n \n I suppose that if my interest was outside th realm of physics, where we have te ability to prove things indisputably, I, too, would take refuge in half definition and attempt to argue that unproven theories are facts.\n \n This has, after all, been the tradition in the softer sciences for hundreds of years, has it not? Just look at the \"facts\" which have been disproven in regards to scientific discovery in the last several hundred years. One of my favorites when discussing evolution/creationism is spontaneous generation, since the creationists and the scientists of the day were embroiled in the same argument, and the evidence for spontaneous generation was MUCH stronger than the evidence for evolution (it was, they believed at the time, observable). Of course, now we laugh at the concept, and it is a sure thing that in a few hundred years, people iwll be laughing at some of the ideas we have today. Not the laws of physics, though, as those are proven.\n \n I will come back and finish this later. Have to go for now (thge real world calls).", 
   {}, 
   76835, 
   null, 
   1100145180.0
  ], 
  [
   76861, 
   null, 
   "Mach", 
   "Hello Mach:\n \n I really thought that you were starting to understand the basic cold hard fact that states the real nature of this debate, it isn't science v religion, it is religion v religion or belief v belief (i.e. atheistic evolution v. Christian creation):\n Both creationists and evolutionists have the same evidence - just different interpretations that DEPEND on their underlying assumptions.\n I feel like smashing my head into a wall because this is a simple concept to understand that EVERYONE but two or so people either ignore or are willingly ignorant of, but I'll let the little smilie do it for me... :xbanghead \n \n But where did that matter come from in the first place? We know that natural processes cannot \"create\" something from nothing, not even quantum physics is able to do that. There needs to be a Creator God who made the matter, and with that, time starts.\n \n\n \n If you mean to say that using illogical assumptions to interperet evidence leads to logical conclusions, then I'm in complete disagreement, and I suspect more than one or two people would agree. \n \n A mountain of nonsense can be built upon a single irrational/illogical claim.\n \n Read my sig., I thought that would illustrate the modus operandi of religion.\n If you don't know, make it up.\n \n You ask a question...then, without reason, you \"accept\" a claim as true.\n \n -You claim that the existence of matter implies a creator, rather than by natural phenomenon\n \n - You claim that time has a begining, which requires a creator, rather than purely natural phenomenon.\n \n Neither of these are be supported by facts, nor are they necessary to explain anything. Yet you accept them as true, based on faith. Then you proceed to match all evidence to that faith-based claim. This is irresponsible, dishonest, call it what you like, call it...religion. You don't even recognize the possibility of the discovery of evidence, that would contradict your claim. That's because faith requires no evidence.\n \n Trees? Easy, a creator created them?\n \n AIDS virus? Easy, a creator created it.\n \n Men having nipples? Easy a creator thought that would be a nice touch.\n \n Most people being right handed but some being left handed? Just for fun, a creator did it.\n \n Brain tumors in children? Just for grins.\n \n So yes, you can interperet evidence any way you like, but interpereting it incorrectly, can lead to incorrect conclusions. For example, praising God when your loved one recovers in the hospital from a debilitating illness. Why not praise the doctors, and donate to the hospital or research, rather than pray, praise god, and donate to a church...\n \n -Mach", 
   {}, 
   76681, 
   null, 
   1100146320.0
  ], 
  [
   76871, 
   null, 
   "stormboy", 
   "The topic of discussion was evolution. Did you get lost? Only a creationist wishing to misinform ignorant dupes would make such a statement. No evolutionary biologist would ever make such a claim. It seems that you oppose something and you don't even know what it is.\n \n I can observe the effects of gravity and I can observe the effects of disease. I have even observed some of the theoretical pathogens of disease under a microscope. For example, I have seen streptococcus and staphylococcus.\n \n The topic wasn't the similarity between gravity and disease. It was mentioned as an example of scientific theories. The explanations for gravity (incomplete though they may be) and the explanations of diseases caused by pathogens are theories. You seem to have missed the point. There is also the theory that the earth is a sphere, and the theory that the earth orbits the sun with other planets (part of the theory of gravity explains why). And the theory that the power of the sun is caused by fusion, first hydrogen and then other elements up to iron. There is the theory that moisture laden warm air will push up over colder dry air and produce rain. There is the theory that earthquakes and volcanoes are caused by the movement of tectonic plates that move about over the molten core of the earth. And there is the theory that living things change through time in response to their environment.\n \n What are you talking about? I'm really getting tired of people who don't know the basics of the subject telling me what I think. I'm not sure what you think your morality has to do with evolution. I think the idea is ludicrous and demonstrates a dismal understanding of morality or no morality at all. All I can say is that as far as I know, evolutionary theory isn't anti-moral.\n \n I must say, stormboy, that was one of the silliest posts I have seen in a long time. It showed no thought and no education.\n\n What im saying is that the theory of evolution has no place with the gravity theory and particle theory. We know that there is such a thing as gravity, and we know we have a thing called particles, but we dont know we have evolution of animals turning from one kind to a totally differant kind!\n And yes i would like to know where evolution gets its morals from, as far as i know an animal does not instinctivily know the differance between rite and wrong, and we are animals arnt we?", 
   {}, 
   76850, 
   null, 
   1100150400.0
  ], 
  [
   76873, 
   null, 
   "daewoo", 
   "What im saying is that the theory of evolution has no place with the gravity theory and particle theory. We know that there is such a thing as gravity, and we know we have a thing called particles, but we dont know we have evolution of animals turning from one kind to a totally differant kind!\n\n \n My point exactly. Evolution is an interesting theory to explain observations which have been made. It is unproven, and will remain unproven, until either insurmountable evidence appears in the fossile record (fill in the gaps) or we actually observe evolution taking place. While the arguments to the contrary are minimally interesting (ok, not really, they basically boil down to trying to argue that an unproven theory is fact, and you frankly have to be semi delusional to believe that the evidence at hand is anywhere near insurmountable) the facts simply aren't there to advance the theory of evolution to the level that many here would like.\n \n I would really suggest that people here who are interested take a look at the controversy that surrounded spontaneous generation (the theory that life spontaneously generated form decaying matter). The arguments used at the time, in many cases by well respected scientists, were very similar to the argument used by todays evolutionists. The big difference being that those guys actually had more evidence at hand than modern evolutionist do. They could take a piece of rotten meat and wait, and behold, maggots appeared. What could possibly be more obvious than that? It was not until science progressed that this theory was disproven (and seen for the rediculousness that it was). Lacking absolute evidence, there is always the danger that current evolutionary theory will go the same way, an interesting and amusing side note in future biology text books. Just like modern evolutionist cannot fathom a possible explanation besides their theroy of evolution, advocates for the theory of spontaneous generation could not fathom another possible explanation for the phenomenon they were witnessing. \n \n This is why the standard of proof is so high in the scientific community, though there seem to be some out there who fail to understand this (and as horrifying as it may be, we see here thas some of them are teachers!).\n \n \nAnd yes i would like to know where evolution gets its morals from, as far as i know an animal does not instinctivily know the differance between rite and wrong, and we are animals arnt we?\n\n \n Humans do not know the difference between right and wrong indtinctively. We are taught the differnce from an early age by whoever raises us. Our definition of right and wrong is refined throughout our entire lives based on social conventions, which are generally based on religou rhetoric designed to make your population more managable. Can you imagine a society where we kill as casually as a tiger? Or where dominance and leadership are decided soley on who can rip out their opponents throat, like a wolf pack?\n \n While all governance basically boils down to force (even democracy is based on the assuption that 51% of the population can beat the hell out of 49% of the popultiaon), religion has certainly been a big help. This is why you see such a dominance of christian religions. If I was going to promote a religion as the leader of a government, I woudl certainly choose the one that has such lessons as \"give to caesar what is caesars\", \"easier fro a rich man to pass through the eye of a needle.....\", \"your reward will come in heaven (so just let them walk all over you on earth)\".", 
   {}, 
   76871, 
   null, 
   1100153340.0
  ], 
  [
   76875, 
   null, 
   "stormboy", 
   "My point exactly. Evolution is an interesting theory to explain observations which have been made. It is unproven, and will remain unproven, until either insurmountable evidence appears in the fossile record (fill in the gaps) or we actually observe evolution taking place. While the arguments to the contrary are minimally interesting (ok, not really, they basically boil down to trying to argue that an unproven theory is fact, and you frankly have to be semi delusional to believe that the evidence at hand is anywhere near insurmountable) the facts simply aren't there to advance the theory of evolution to the level that many here would like.\n \n I would really suggest that people here who are interested take a look at the controversy that surrounded spontaneous generation (the theory that life spontaneously generated form decaying matter). The arguments used at the time, in many cases by well respected scientists, were very similar to the argument used by todays evolutionists. The big difference being that those guys actually had more evidence at hand than modern evolutionist do. They could take a piece of rotten meat and wait, and behold, maggots appeared. What could possibly be more obvious than that? It was not until science progressed that this theory was disproven (and seen for the rediculousness that it was). Lacking absolute evidence, there is always the danger that current evolutionary theory will go the same way, an interesting and amusing side note in future biology text books. Just like modern evolutionist cannot fathom a possible explanation besides their theroy of evolution, advocates for the theory of spontaneous generation could not fathom another possible explanation for the phenomenon they were witnessing. \n \n This is why the standard of proof is so high in the scientific community, though there seem to be some out there who fail to understand this (and as horrifying as it may be, we see here thas some of them are teachers!).\n \n \n \n Humans do not know the difference between right and wrong indtinctively. We are taught the differnce from an early age by whoever raises us. Our definition of right and wrong is refined throughout our entire lives based on social conventions, which are generally based on religou rhetoric designed to make your population more managable. Can you imagine a society where we kill as casually as a tiger? Or where dominance and leadership are decided soley on who can rip out their opponents throat, like a wolf pack?\n \n While all governance basically boils down to force (even democracy is based on the assuption that 51% of the population can beat the hell out of 49% of the popultiaon), religion has certainly been a big help. This is why you see such a dominance of christian religions. If I was going to promote a religion as the leader of a government, I woudl certainly choose the one that has such lessons as \"give to caesar what is caesars\", \"easier fro a rich man to pass through the eye of a needle.....\", \"your reward will come in heaven (so just let them walk all over you on earth)\".\n\n \n Evolution does not work when we weigh up ALL the evidence!. \n EXAMPLE OF EVIDENCE: The mysteries of the world. Why are they mysteries, because they dont fit the evolution world view. However this type of evidence does fit the creation world view (it is no longer a mystery).\n There is evidence every where, it is that the evolutionists pick and chooses.\n The mysteries of the world is part of the evidence that evolutionists choose to discard, which is a dishonest way of drawing a conclusion from the evidence. To honestly come to a conclusion one needs to weigh up ALL the evidence!", 
   {}, 
   76873, 
   null, 
   1100154300.0
  ], 
  [
   76882, 
   null, 
   "pandion", 
   "It is far more than a basic observation, and the implications are far reaching (like relativity).\n\n The answer resorted to by all creationists when they get in beyond their depth: you misquote and misrepresent. I didn't say the implications weren't far reaching. Still, there is little difference between laws of science and theories of science except that the laws aren't as complex, i.e., as I stated, they are simpler than theories. Only a scientific illiterate would claim that theories become laws when proven.\n \nYes, I thought you were probably a teacher. This is why I fully support testing our teachers on an annual basis to ensure they are up to standard.\n\n Thank you for admiting your defeat. You are embarrassed by you demonstration of scientific ignorance and must resort to snide insults. How sad. \n \nTo simplify, a theory is a school of thought on the implications of a body of evidence.\n\n A poor description. A theory explains observed facts.\n \nA theory is unproven, and in many cases, unprovable, the only way you may prove a theory is either mathematically, or through direct observation. Neither has been done with the theory of evolution.\n\n Another demonstration of scientific illiteracy. No scientific theory is ever proven - not the theory of gravity, not the germ theory, not atomic theory, not particle theory - none of them. You are a faker.\n \nGravity is not somethign you need to give me a primer on, my education in that area came from much more qualified sources than you.\n\n You are a faker. \n \nBeyond that, we have a mathematical gravity for gravity that can be proven.\n\n Which comes back to what I said. Proof is a matter of math, and running mathematical proofs does not prove a theory.\n \nThere is no such madel for evolution, nor is their insurmaountable evidence, nor have we directly observed the evolution of any species.\n\n Actually, the model of evolution is clearer, the evidence is conclusive, and we have observed the evolution of species. How sad that you babble about things of which you are ignorant. (science, gravity, evolution). \n \nCertainly these fact indicate that the theory is correct. They are not in and of themselves \"proof\" that the theory of relativity is correct.\n\n And now you misrepresent - I guess you are trying to justify your previous foolish statements. I didn't claim that anything was \"proof\" of the theory of relativity. Go back and read it again.\n \nEinstein worked his whole life in an effort to \"prove\" the theory of relativity and, oddly enough, to disprove the theories behind quantum physics. He could do neither and by his own admission, it may never be possible to conclusively prove his theory of relativity.\n\n And I made no such claim. In fact, I said that theories are never proven - only math. But you are a scientific illiterate who pretends to some education and are embarrassed because you have made yourself look so foolish. So now you represent my arguments to claim exactly the opposite of what I actually said.\n \nGranted my background in science is largely in physics, where we hold to a slightly higher standard than many of the softer sciences.\n\n You're even a snob about being a fake.\n \nIn physics, either something is proven or it is not.\n\n See. There you go with the proof again. Of course once something is proven it can never be changed again, right?\n \nIt is that simple. There is little or no guesswork in this area. Either ytou are working with a proven constant, or you are trying to prove one.\n\n Absolute scientific illiteracy. Why don't you try that on your science teacher and see about the proof thing. You seem to have missed the boat and may have to repeat 7th grade science. \n \nYes, they are. Laws, however, are not.\n\n Laws have been amended. Newton's for example.\n \nI am starting to see the problem we are having in relating here. You are failing to see that our physical universe is governed by a set of laws which are unbendable, anything else is simply a theory which may later be proven incorrect (such as the theory of spontaneous generation, which people argued for years).\n\n Really. Even it that were true, how do you know that your explanations of those laws is correct. What if there is new information? Do we change the explanations to fit the new data? Or do we insist that laws of science are unbendable and \"proven\" correct for ever more.\n \nI am going to go out on a limb here and say that your background is not physics, where we have the luxury of being able to prove our theories, but instead it is in some of the softer sciences, where proof is exceptionally difficult to come by, so you try to spin theories, even those with fairly expansive holes in them, as fact.\n\n I'm going to go out on a limb here and say that your background isn't in physics either because you are scientifically illiterate. No scientific theory is proven. Proof is a matter of math. I think that you have such a poor grasp of the topic that you think that the mathematical proofs (which may be based on incorrect data) somehow prove the theory. They don't. Better data will unprove you proof. It happens all the time. \n \nI suppose that if my interest was outside th realm of physics, where we have te ability to prove things indisputably, I, too, would take refuge in half definition and attempt to argue that unproven theories are facts.\n\n Again with the snide admission that you have been embarrassed. Thanks.\n \n You don't merit further consideration.", 
   {}, 
   76875, 
   null, 
   1100159520.0
  ], 
  [
   76884, 
   null, 
   "pandion", 
   "What im saying is that the theory of evolution has no place with the gravity theory and particle theory. We know that there is such a thing as gravity, and we know we have a thing called particles, but we dont know we have evolution of animals turning from one kind to a totally differant kind!\n\n Maybe evolution doesn't belong with gravity theory and particle theory. We see planets orbit and apples fall, and we can reduce that to mathematical equations and arrive at mathematical proofs, but we actually can't explain why gravity works. The theory is pretty weak. And of course, no one has ever seen an electron, proton, or neutron, much less any of the other particles like the quarks. Particle theory is pure theory based on predicted observations. Evolution, on the other hand, has been observed. We have seen animals change and we have seen the formation of new species. Evolutionary theory is quite well supported. Way back in the 1930s and 1940s it was recognized that genetics offered the mechanisms of inheritance that supported Darwin's theory of natural selection.\n \nAnd yes i would like to know where evolution gets its morals from, as far as i know an animal does not instinctivily know the differance between rite and wrong, and we are animals arnt we?\n\n Are you not aware that morality is not a matter of science? You might as well ask where plumbing gets it's morals. Or maybe chemistry. Morality is not a matter of study by science.\n \n Maybe daewoo can explain it to you. I notice that he babbles on about wolf packs and such as if it had anything to do with evolution but fails to explain the morality of gravity. Of course, I suspect that daewoo is as ignorant of morality as he is of physics.", 
   {}, 
   76882, 
   null, 
   1100160300.0
  ], 
  [
   77016, 
   null, 
   "daewoo", 
   "The answer resorted to by all creationists when they get in beyond their depth: you misquote and misrepresent. I didn't say the implications weren't far reaching. Still, there is little difference between laws of science and theories of science except that the laws aren't as complex, i.e., as I stated, they are simpler than theories. Only a scientific illiterate would claim that theories become laws when proven.\n\n \n But I am not an creationist. Like I said before, I have no horse in this race. I am not even sure I believe in god (though I am sometimes a borderline catholic).\n \n The reason that laws are simpler is that we frankly haven't been able to prove much. There simply are not that many hard facts in the realm of science. \n \n Perhaps \"simple but with far reaching implications\" is too simplistic. Maybe \"deceptively simple\" is more like it. While the formula itself is seemingly simplistic, it is the foundation of an immense structure.\n \n \nThank you for admiting your defeat. You are embarrassed by you demonstration of scientific ignorance and must resort to snide insults. How sad. \n \n \n No, more a general assesment of our school system. It is a great difficulty to find good teachers, especially in fields such as math and science, since those who are truly skilled in such areas generally are out doing as opposed to teaching. Except, of course, for the rare individual who harbors both a great love for children and contempt for money.\n \n \nYou are a faker. \n \n \n I believe the word you are looking for is \"blasphemer\". You are no different form some the religous wackos running around here, you have simply replaced a diefied god with the great god science, whose apostles are reason and logic. \n \n Unfortunatly, history has shown that you are a true believer in a faulty system of beliefs. Ever since man first asked \"why\", theories have been created, evidence has been compiled, and conclusions have been drawn. With every new generation as our knowledge of the universe around us grows, those etheories, even those which are widespread and generally accepted, are discredited, disproven, mocked, and then finally forgotten. \n \n Do you really believe that we have reached the enlightened age of man? You truly believe that we have reached such a high level that the theories and ideas that we develop today will stand the scrutiny of years to come? I've got news for you, people have thought this for centuries. Just as you cannot fathom what new evidence may come along to disprove some of todays theories, Needham could not fathom how his difinitive experiment regarding spontaneous generation could ever be disproven. \n \n This is why the burden of proof is so stringent for scientists, why the bar is set so high. With every proclaimed discovery, the discoverer has an opportunity to make the history books, and who would not prefer to be Pasteur to Needham?\n \n But to suggest that the scientific theories we hold today are all factual! What idiocy! What unbridled arrogance!\n \n \nWhich comes back to what I said. Proof is a matter of math, and running mathematical proofs does not prove a theory.\n\n \n Depends on the theory. Is it a mathematical theory? \n \n \n \nAnd now you misrepresent - I guess you are trying to justify your previous foolish statements. I didn't claim that anything was \"proof\" of the theory of relativity. Go back and read it again.\n\n \n My apologies. What you said was:\n \n \nIn fact, the theories of relativity have been shown to be correct. Light passing a massive star bends. Light escaping from a massive star is shifted in wave length. These facts are just some of the indications that the theory is correct. \n \n \n these facts are, indeed, indications that the theory is correct. Unfortuntly, they do not prove the theory. They are simply facts which suppor the theory. Better?\n \n \nAnd I made no such claim. In fact, I said that theories are never proven - only math. But you are a scientific illiterate who pretends to some education and are embarrassed because you have made yourself look so foolish. So now you represent my arguments to claim exactly the opposite of what I actually said.\n\n \n No, I have not made myself look foolish. \n \n \nYou're even a snob about being a fake.\n\n \n Uh huh. Getting a little snippy. Kind of like baiting montelban about inaccuracies in the bible. You have allowed your passions to eclipse your thought process here. EVERYBODY here remebers high school science (some are still there). EVERYBODY HERE remembers hearing the rediculous scientific theories of the past. I seriously doubt that anybody here (besides yourself) believes for even one iota of a minute that one day future generations will not look back and laugh at some of the theories we hold today. \n \n You might want to back off on the physics. You are over your head. Don't make me make you look the fool. It is beside the point anyway.\n \n \n \nReally. Even it that were true, how do you know that your explanations of those laws is correct. What if there is new information? Do we change the explanations to fit the new data? Or do we insist that laws of science are unbendable and \"proven\" correct for ever more.\n\n \n This is why we don't run around declaring theories to be truth. The only absolute truths we accept are ones which can be proven mathematically. Beyond that, theories which can be supported with insurmountable evidence are generally considered fact, thoguh they may very well be proven incorrect someday as we learn more.\n \n \nI'm going to go out on a limb here and say that your background isn't in physics either because you are scientifically illiterate. No scientific theory is proven. Proof is a matter of math. I think that you have such a poor grasp of the topic that you think that the mathematical proofs (which may be based on incorrect data) somehow prove the theory. They don't. Better data will unprove you proof. It happens all the time. \n \n \n I am going ot go out on a limb here and say that your basic education came from Bugtown community college followed up by a teaching degree from noname teachers college. \n \n People lie because they want something. What could some noname scince teacher on the internet possibly have that I want?\n \n Most of the laws of physics are based on universal constants. If they are someday proven incorrect, we are in serious trouble. The laws of physics have existed virtually unchanged from their individual dates of creation right up to today.\n \n Other scientific principals are routinely disporven, discarded, and scoffed. It would probably be fair to say that half the accepted scientific dogma of any generation is ultimately discarded. This is the way it has always been, and is likely the way it will always be. \n \n \n \nYou don't merit further consideration\n\n \n Nor do you. As I said before, arguing this with you is like arguing biblical principals with montlban. You both posess something that I lack, blind faith. Her in her diety, you in whatever bit of unproven, soft scince garbage happens to be floating around at the time.", 
   {}, 
   76882, 
   null, 
   1100232000.0
  ], 
  [
   77019, 
   null, 
   "daewoo", 
   "Maybe evolution doesn't belong with gravity theory and particle theory. We see planets orbit and apples fall, and we can reduce that to mathematical equations and arrive at mathematical proofs, but we actually can't explain why gravity works. The theory is pretty weak. And of course, no one has ever seen an electron, proton, or neutron, much less any of the other particles like the quarks. Particle theory is pure theory based on predicted observations. Evolution, on the other hand, has been observed. We have seen animals change and we have seen the formation of new species. Evolutionary theory is quite well supported. Way back in the 1930s and 1940s it was recognized that genetics offered the mechanisms of inheritance that supported Darwin's theory of natural selection.\n\n \n You are finally figuring it out!! While particle theory is widely accepted and generally consdiered correct, since there is no insurmountable evidence supporting it as a whole, we must accept the fact that the day may come when it is found to be incorrect. I will be the first to admit that I cannot even begin to concieve of how this could be, but the possibility must always be there, lurking in the back of your mind. As I said, I cannot possibly concieve of this being the case, but I still view the whole thing through a critical eye, from phenomenology to string theory.\n \n \n \nMaybe daewoo can explain it to you. I notice that he babbles on about wolf packs and such as if it had anything to do with evolution but fails to explain the morality of gravity. Of course, I suspect that daewoo is as ignorant of morality as he is of physics\n\n \n Certainly discussion of lower organisms is not out of line when discussing the possibility of inherent morality, which is what I was discussing at that point (can't you even read???, my god man, and you are a teacher???). \n \n Morality of gravity? Pls explain. In exchange, I will explain the basics of physics.", 
   {}, 
   76884, 
   null, 
   1100233080.0
  ], 
  [
   77022, 
   null, 
   "Mach", 
   "http://wilstar.com/theories.htm\n \n \nScientific Law: This is a statement of fact meant to explain, in concise terms, an action or set of actions. It is generally accepted to be true and univseral, and can sometimes be expressed in terms of a single mathematical equation. Scientific laws are similar to mathematical postulates. They don't really need any complex external proofs; they are accepted at face value based upon the fact that they have always been observed to be true. \n \n Some scientific laws, or laws of nature, include the law of gravity, the law of thermodynamics, and Hook's law of elasticity. \n \n Hypothesis: This is an educated guess based upon observation. It is a rational explanation of a single event or phenomenon based upon what is observed, but which has not been proved. Most hypotheses can be supported or refuted by experimentation or continued observation. \n \n Theory: A theory is more like a scientific law than a hypothesis. A theory is an explanation of a set of related observations or events based upon proven hypotheses and verified multiple times by detached groups of researchers. One scientist cannot create a theory; he can only create a hypothesis. \n \n In general, both a scientific theory and a scientific law are accepted to be true by the scientific community as a whole. Both are used to make predictions of events. Both are used to advance technology. \n \n \n \nSome scientific theories include the theory of evolution, the theory of relativity, and the quantum theory. All of these theories are well documented and proved beyond reasonable doubt.  Yet scientists continue to tinker with the component hypotheses of each theory in an attempt to make them more elegant and concise, or to make them more all-encompassing. Theories can be tweaked, but they are seldom, if ever, entirely replaced. \n \n \n Even scientific laws are understood to be true only so far as they have been observed to always be true.\n \n A good heaping of skepticism is healthy. But to claim anything is false, without justification however, is absurd, unless of course you're one of those rare vegetables who hold onto irrational/illogical conclusions.\n \n -Mach", 
   {
    "unicode_changes_made": true
   }, 
   77019, 
   null, 
   1100234760.0
  ], 
  [
   77024, 
   null, 
   "daewoo", 
   "http://wilstar.com/theories.htm\n \n \n\n \n \n Who is wilstar? \n \n \nWilstar is the name of my home page and my domain name in cyberspace. But it is not my real name. I did not even make it up myself. Actually, my name is Jerry Wilson.\n \n I was a high school science teacher for 13 years. Once, after a period of absence for a couple of days due to the birth of my daughter, Shana, I returned to my classroom to discover that someone had written on the blackboard the phrase \"WELCOME BACK WILSTAR\" in big letters. I asked what that meant, and everyone just said it doesn't mean anything, that Wilstar was me. It was my nickname. And ever since then, most of my students began calling me \"Wilstar.\" I still have no idea who wrote it on the board or what, if anything, it actually means. I do know that there was once a Norwegian tanker named the Wilstar. It survived one of the largest waves in maritime history!\n\n \n If we could avoid presenting the writings of high school teachers as evidence it would certinaly help the debate move faster. While I recognise that they are at the forefront of the debate, they are not experts at anything, or they would be off doing whatever it is they are experts at.\n \n Take a look at Feyerabend. He was an austrian born philosopher of science. He explains things quite nicely.\n \n Of course, Steven Pinker also explains some things well. He points out that many people tend to base their views about the truth or falsity of certain scientific theories not on the evidence for and against them, but on their supposed moral, political and philosophical consequences. \n \n This has, I think, some definate implications here. To somebody who has spent a large quantity of their life passing on knowledge to the next generation to admit that a good portion of the knowledge they have passed may indeed be false is paramount to suggesting that they have wasted their life (though that is obviously not the case).", 
   {}, 
   77022, 
   null, 
   1100236320.0
  ], 
  [
   77068, 
   null, 
   "pandion", 
   "Nice try, Mach. But since daewoo is pretending to have qualifications that he doesn't have, his arguments from authority won't be changed by opinions from his betters. He is scientifically illiterate and not worth paying attention to.\n \n Also notice his inability to stay on topic and address the issues. Instead he misrepresents and resorts to ad hominem. A sure sign that he knows that he is in over his head and is trying to bluff his way out of it.", 
   {}, 
   77024, 
   null, 
   1100277600.0
  ], 
  [
   77071, 
   null, 
   "Mach", 
   "Who is wilstar? \n If we could avoid presenting the writings of high school teachers as evidence it would certinaly help the debate move faster. While I recognise that they are at the forefront of the debate, they are not experts at anything, or they would be off doing whatever it is they are experts at.\n\n \n My mistake. I assumed you accepted arugments based on their own merit rather than the authority that presented them. In that case, why not stick a gun to my head and demand I accept your \"truth\"? If a 6 year old tells you 3+3=9, you reject their claim based on their lack of authority, or accept the claim as true based on arithmetic? Absurd.\n \n \n \nOf course, Steven Pinker also explains some things well. He points out that many people tend to base their views about the truth or falsity of certain scientific theories not on the evidence for and against them, but on their supposed moral, political and philosophical consequences. \n \n Yet this is in agreement to what the incorrect-by-lack-of-authority source suggests is correct. So Steven Pinker, a human, agrees with some wilstar teacher-guy, another human. Who cares? Who's correct is the important question, and since they seem to be in agreement on the \"truth and falsity is based on evidence\", then what is your point? Should we write a letter to \"wilstar\" and ask him to \"get a life\"?? Oh wait, you meant to tell me wilstar being a teacher of a subject is not as qualified as you, what...an engineering graduate, to speak of life sciences? Maybe authority isn't a realiable way to determine truth from falsehood.\n \n \nThis has, I think, some definate implications here. To somebody who has spent a large quantity of their life passing on knowledge to the next generation to admit that a good portion of the knowledge they have passed may indeed be false is paramount to suggesting that they have wasted their life (though that is obviously not the case).\n\n \n Implications? You're in manufacturing right? Well, I have news for you daewoo, all those years building your business and making things...you weren't really making things, and those people you worked with and hired...weren't really there. But of course I'm correct, you cannot prove otherwise. You can show us observations, but humans are fallable, and there is no certainty. And I can claim it's false, because you cannot prove it as 100% certainty, and I don't need justification for my claim. Thus, you need a sticker on your company letter-head that reads :\n \n Warning: Our products contain material we think, but we cannot be sure, and cannot guarantee it. The theory of material is not a fact, it's a theory, based on evidence. This existence of this \"material\", no pun intended, should be approached with an open mind, studied carefully and critically considered, but not so open a mind that your brains fall out.\n \n To suggest it's NOT true, requires you to back your claims. The claims of evolution being true have evidence to support them, years and years of \"experts\" working on dismantling and refining it, yet you think a sticker is needed to discuss the definition of what a theory is, a law is, and what certainty is? Such nonsense. It's one theory singled out because the religious majority, based on irrational beliefs, declare it untrue based on faith (i.e.. without evidence).\n \n If you wish to join their ranks and claim it as false, and not justify it, by all means, do so, but don't expect to be taken seriously (well, by anyone reasonable anyway..I'm sure the faith-driven will welcome you, and your profits, with open arms.).\n \n The accepted defnitions of scientific laws, and theories, require evidence, require to not be shown as false, ever, and do not claim 100% certainty. At best, the sticker is redundant, and should be placed on all things, trees, people, cars, all books, each word of a book, your company letter-head etc....or accept what a theory is and get over it :). \n \n \n -Mach", 
   {}, 
   77024, 
   null, 
   1100281020.0
  ], 
  [
   77084, 
   null, 
   "OccamsRazor", 
   "\n Take a look at Feyerabend. He was an austrian born philosopher of science. He explains things quite nicely.\n \n\n \n Feyerabend is a very interesting figure in scientific philosophy. I'm interested to hear which of his ideas you see as being relevant here.", 
   {}, 
   77024, 
   null, 
   1100285400.0
  ], 
  [
   77177, 
   null, 
   "stormboy", 
   "Maybe evolution doesn't belong with gravity theory and particle theory. We see planets orbit and apples fall, and we can reduce that to mathematical equations and arrive at mathematical proofs, but we actually can't explain why gravity works. The theory is pretty weak. And of course, no one has ever seen an electron, proton, or neutron, much less any of the other particles like the quarks. Particle theory is pure theory based on predicted observations. Evolution, on the other hand, has been observed. We have seen animals change and we have seen the formation of new species. Evolutionary theory is quite well supported. Way back in the 1930s and 1940s it was recognized that genetics offered the mechanisms of inheritance that supported Darwin's theory of natural selection.\n \n Are you not aware that morality is not a matter of science? You might as well ask where plumbing gets it's morals. Or maybe chemistry. Morality is not a matter of study by science.\n \n Maybe daewoo can explain it to you. I notice that he babbles on about wolf packs and such as if it had anything to do with evolution but fails to explain the morality of gravity. Of course, I suspect that daewoo is as ignorant of morality as he is of physics.\n\n Well then if an evolutionists says that evolution is science, then after reading your last statement, how do you fit mankinds morality into the equasion of evolution?", 
   {}, 
   76884, 
   null, 
   1100327940.0
  ], 
  [
   77190, 
   null, 
   "pandion", 
   "how do you fit mankinds morality into the equasion of evolution?\n\n First of all, evolution isn't an \"equasion\". It isn't even an equation. The word means three things (maybe more): 1) a definition of what evolution is, 2) observations of events that meet the definition (the facts of evolution), and 3) the explanations of the mechanisms of the observations that meet the definition. It is known as a scientific theory.\n \n But before I answer your question, I want you to answer mine. How do you fit morality into the theory of gravity? How do you fit morality into nuclear theory? How do you fit morality into the germ theory of disease? How do you fit morality into the heliocentric theory? How do you fit your morality into plate tectonics? Why is it that you think that your morality should somehow be relevant to biology and not physics, cosmology, geology and medicine? What are the implications on my morality if I should get the flu? What are the moral implications of an eruption of Mt. St. Helen's, Etna, or Mauna Loa?\n \n Surely you can't be suggesting that observations and explanations of natural events should be made to conform to your morality! Bruno was burned at the stake and Galileo avoided the same fate by recanting the assertion that nature didn't conform to the morality of the time.\n \n You seem to have a problem with biology. Why don't you have a problem with cosmology & astronomy that, according to theory, claim the the universe is about 13.7 billion years old? Why don't you have a problem with geology that according to theory, says the the earth is about 4.55 billion years old?\n \n Ah! Wait! You think that any theory of science that is in conflict with your reading of the mythology of nomadic herdsmen is \"evolution.\"\n \n Never mind. It isn't possible to explain science to those who are intentionally scientific illiterates.", 
   {}, 
   77177, 
   null, 
   1100340780.0
  ], 
  [
   77198, 
   null, 
   "stormboy", 
   "First of all, evolution isn't an \"equasion\". It isn't even an equation. The word means three things (maybe more): 1) a definition of what evolution is, 2) observations of events that meet the definition (the facts of evolution), and 3) the explanations of the mechanisms of the observations that meet the definition. It is known as a scientific theory.\n \n But before I answer your question, I want you to answer mine. How do you fit morality into the theory of gravity? How do you fit morality into nuclear theory? How do you fit morality into the germ theory of disease? How do you fit morality into the heliocentric theory? How do you fit your morality into plate tectonics? Why is it that you think that your morality should somehow be relevant to biology and not physics, cosmology, geology and medicine? What are the implications on my morality if I should get the flu? What are the moral implications of an eruption of Mt. St. Helen's, Etna, or Mauna Loa?\n \n Surely you can't be suggesting that observations and explanations of natural events should be made to conform to your morality! Bruno was burned at the stake and Galileo avoided the same fate by recanting the assertion that nature didn't conform to the morality of the time.\n \n You seem to have a problem with biology. Why don't you have a problem with cosmology & astronomy that, according to theory, claim the the universe is about 13.7 billion years old? Why don't you have a problem with geology that according to theory, says the the earth is about 4.55 billion years old?\n \n Ah! Wait! You think that any theory of science that is in conflict with your reading of the mythology of nomadic herdsmen is \"evolution.\"\n \n Never mind. It isn't possible to explain science to those who are intentionally scientific illiterates.\n\n Thirstly, your question... Lets come in from another angle, you leave one morning to go to work, you kiss your wife and kids goodbye, then head off for another dollar. You come back home only to find your wife has been raped and killed, while your kids have been skined and hung on the wall like wall paper. How do you fit morality into that?. Isent this the way nature works, only the strong survive, after all, aint we all animals!?\n How does the theory of evolution seperate man from animals?\n \n Secondly, Does being scientifically literate make you more of a man?", 
   {}, 
   77190, 
   null, 
   1100350740.0
  ], 
  [
   77227, 
   null, 
   "Mach", 
   "Thirstly, your question... Lets come in from another angle, you leave one morning to go to work, you kiss your wife and kids goodbye, then head off for another dollar. You come back home only to find your wife has been raped and killed, while your kids have been skined and hung on the wall like wall paper. How do you fit morality into that?. Isent this the way nature works, only the strong survive, after all, aint we all animals!?\n How does the theory of evolution seperate man from animals?\n \n Secondly, Does being scientifically literate make you more of a man?\n\n \n I'm sure Pandion will have his own objections, I'll pipe in one of my own.\n \n Yes, that's the way nature works, morality is a human term.\n \n This is why a society is formed, and laws are made that are intended to protect what the society as a whole values. These laws are enforced, and open to interperetation. Since the needs of a society change, so can the laws. You are granted rights if you obey them, and rights, and even your life, can be removed if you break them.\n \n If your entire objection to evolution is that it doesn't make you moral \"by nature\", then you're correct, but misguided. YOU choose your own morals, and you can choose to adhere to them, or defy them, or whatever you wish. That is, nothing determines your morales except for your own, personal, choice.\n \n But when you break the law, when you make a \"choice\", the law can be enforced, without regard to your \"morale objections\", or my morality, or god.\n \n Kill someone's familiy in a viscious way and be found guilty? Likely life without parole or death. You suggest it work another way? How about we slap their hand and tell them they just need to ask god for forgiveness, after all, god will forgive anything right? \n \n I've got news for you, there ARE people out there who want to do other human's harm. But even worse, your own body is designed to kill itself, in fact, it is slowing killing you, your family, and everyone you know, right now. Do you think that's morally OK? A tornado kills you? WHERE IS YOUR MORALITY NOW? Morality is meaningless without humans, I suggest you start figuring out a way to stay alive, if you find death morally objectionable.\n \n -Mach", 
   {}, 
   77198, 
   null, 
   1100388900.0
  ], 
  [
   77228, 
   null, 
   "stormboy", 
   "I'm sure Pandion will have his own objections, I'll pipe in one of my own.\n \n Yes, that's the way nature works, morality is a human term.\n \n This is why a society is formed, and laws are made that are intended to protect what the society as a whole values. These laws are enforced, and open to interperetation. Since the needs of a society change, so can the laws. You are granted rights if you obey them, and rights, and even your life, can be removed if you break them.\n \n If your entire objection to evolution is that it doesn't make you moral \"by nature\", then you're correct, but misguided. YOU choose your own morals, and you can choose to adhere to them, or defy them, or whatever you wish. That is, nothing determines your morales except for your own, personal, choice.\n \n But when you break the law, when you make a \"choice\", the law can be enforced, without regard to your \"morale objections\", or my morality, or god.\n \n Kill someone's familiy in a viscious way and be found guilty? Likely life without parole or death. You suggest it work another way? How about we slap their hand and tell them they just need to ask god for forgiveness, after all, god will forgive anything right? \n \n I've got news for you, there ARE people out there who want to do other human's harm. But even worse, your own body is designed to kill itself, in fact, it is slowing killing you, your family, and everyone you know, right now. Do you think that's morally OK? A tornado kills you? WHERE IS YOUR MORALITY NOW? Morality is meaningless without humans, I suggest you start figuring out a way to stay alive, if you find death morally objectionable.\n \n -Mach\n\n \n Was this an attempt at answering my question?\n How does evolution seperate man from animals?", 
   {}, 
   77227, 
   null, 
   1100389380.0
  ], 
  [
   77230, 
   null, 
   "Mach", 
   "Was this an attempt at answering my question?\n How does evolution seperate man from animals?\n\n \n Humans are animals, by defnition:\n \n Main Entry: 2human\n Function: noun\n : a bipedal primate mammal (Homo sapiens) : MAN; broadly : any living or extinct member of the family (Hominidae) to which the primate belongs\n \n http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=humans\n \n ==========================\n Evolution doesn't \"seperate\" anything. It's the theory of a process by which life on earth, as we have observed, changes. It's also the only justifiable theory that describes how the human species (and all species) developed.\n \n I'm not sure why you're looking to nature for some written or implied moral code. Human choice is morality, through thought or action. \n \n -Mach", 
   {}, 
   77228, 
   null, 
   1100389860.0
  ], 
  [
   77231, 
   null, 
   "stormboy", 
   "Humans are animals, by defnition:\n \n Main Entry: 2human\n Function: noun\n : a bipedal primate mammal (Homo sapiens) : MAN; broadly : any living or extinct member of the family (Hominidae) to which the primate belongs\n \n http://www.m-w.com/cgi-bin/dictionary?book=Dictionary&va=humans\n \n ==========================\n Evolution doesn't \"seperate\" anything. It's the theory of a process by which life on earth, as we have observed, changes. It's also the only justifiable theory that describes how the human species (and all species) developed.\n \n I'm not sure why you're looking to nature for some written or implied moral code. Human choice is morality, through thought or action. \n \n -Mach\n\n \"Evolution doesn't seperate anything\". So we cannot seperate good morals from bad morals, its ok for me to act on my instincs and kill you for the lunch you are eating!.\n Its true, evolution cannot seperate man from animal. However we do know that mankind is seperate from animals, because we do not just act on our instincs as an animal would in its world.\n Evolution has to fit this type of evidence into its theory. How did mankind develope its distinctions(hope that was the rite choice of words..), between good and bad morals?", 
   {}, 
   77230, 
   null, 
   1100391840.0
  ], 
  [
   77247, 
   null, 
   "Mach", 
   "\"Evolution doesn't seperate anything\". So we cannot seperate good morals from bad morals, its ok for me to act on my instincs and kill you for the lunch you are eating!.\n Its true, evolution cannot seperate man from animal. However we do know that mankind is seperate from animals, because we do not just act on our instincs as an animal would in its world.\n Evolution has to fit this type of evidence into its theory. How did mankind develope its distinctions(hope that was the rite choice of words..), between good and bad morals?\n\n \n How did YOU develop your morals? I'm sure much of it you could tell us.\n You mean which part is nature, and which is nurture?\n \n If you understand how evolution works (it's an interesting concept, that applies not just to life on earth, but to the process itself), then the nature part becomes obvious. Game theory contributes to the understanding as well.\n \n Let's take a very hypothetical and quickly slapped together example:\n \n Two prides of lions.\n \n One pride has one male lion that has a very slight chemical imbalance in his brain that causes him to go berserk and kill all the females. Weakened from the fights he dies. His DNA code is now a dead end. Even if he survives the fights he kills any female, and eventually will die without mating, he attacks and kills everything that \"could\" be a threat.\n \n Another pride of lions has one males who doesn't have such tendancies. His DNA is slightly different, and his development/environment has been different. He instinctually protects the pride (rather than attacks them), assumes his dominant role based primarily on instinct, and mates frequently with his stable pride. His DNA, combined with the each females, gets passed on, in part, to the cubs. The cubs grow up, each has a \"chance\" of being similar to the father (see genetics). If it just so happens that's still a trait that works well for survival, it will contribute to their chances of survival.\n \n So, which mutation do you think will be most likely to be passed on, generation after generation? Which mutation do you think will become \"predominate\" in that particular gene pool if the animals overall, survive, and given hundreds of thousands of years?\n \n A mutation that essentially destroys itself, or a mutation that happens to give a survival advantage in a particular environment/time?\n \n Why does our population contain a percentage of homicidal maniacs, but the vast majority of us are not like this?\n \n That's the nature side.\n \n \n The reasoned side, is also supported by game theory, but mostly you just need common sense. Is there a need in the US to kill other people for no reason? What would you be killing them for? Land? Food? Money? All of these are much easier to get by working, and you don't have to hide from cops and risk getting put in jail, or senteneced to death. We have laws to define what we can, and cannot do.\n \n You mean you need the \"bible\" to tell you it's not a good thing to kill people? Please do tell me that's not the only reason you don't!!\n \n Evolution in broad terms, is just a process, it's nothing to be so scared of.\n \n -Mach", 
   {}, 
   77231, 
   null, 
   1100403120.0
  ], 
  [
   77251, 
   null, 
   "stormboy", 
   "How did YOU develop your morals? I'm sure much of it you could tell us.\n You mean which part is nature, and which is nurture?\n \n If you understand how evolution works (it's an interesting concept, that applies not just to life on earth, but to the process itself), then the nature part becomes obvious. Game theory contributes to the understanding as well.\n \n Let's take a very hypothetical and quickly slapped together example:\n \n Two prides of lions.\n \n One pride has one male lion that has a very slight chemical imbalance in his brain that causes him to go berserk and kill all the females. Weakened from the fights he dies. His DNA code is now a dead end. Even if he survives the fights he kills any female, and eventually will die without mating, he attacks and kills everything that \"could\" be a threat.\n \n Another pride of lions has one males who doesn't have such tendancies. His DNA is slightly different, and his development/environment has been different. He instinctually protects the pride (rather than attacks them), assumes his dominant role based primarily on instinct, and mates frequently with his stable pride. His DNA, combined with the each females, gets passed on, in part, to the cubs. The cubs grow up, each has a \"chance\" of being similar to the father (see genetics). If it just so happens that's still a trait that works well for survival, it will contribute to their chances of survival.\n \n So, which mutation do you think will be most likely to be passed on, generation after generation? Which mutation do you think will become \"predominate\" in that particular gene pool if the animals overall, survive, and given hundreds of thousands of years?\n \n A mutation that essentially destroys itself, or a mutation that happens to give a survival advantage in a particular environment/time?\n \n Why does our population contain a percentage of homicidal maniacs, but the vast majority of us are not like this?\n \n That's the nature side.\n \n \n The reasoned side, is also supported by game theory, but mostly you just need common sense. Is there a need in the US to kill other people for no reason? What would you be killing them for? Land? Food? Money? All of these are much easier to get by working, and you don't have to hide from cops and risk getting put in jail, or senteneced to death. We have laws to define what we can, and cannot do.\n \n You mean you need the \"bible\" to tell you it's not a good thing to kill people? Please do tell me that's not the only reason you don't!!\n \n Evolution in broad terms, is just a process, it's nothing to be so scared of.\n \n -Mach\n\n Was this an attempt to answer my question?...\n How is it mankind has a sense of rite and wrong, when animals dont?\n Our laws stem from somewhere, Where?\n I dont kill people because i know its not rite, and how do i know its not rite?. Well i will leave that one for you to answer....\n Lets see if you can fit your answer in with theory of evolution....\n Keeping in mind that evolution does not allow for seperation between \"NATURE AND NURTURE\".....\n MAN IS SEPERATE FROM THE ANIMAL KINGDOM!", 
   {}, 
   77247, 
   null, 
   1100405100.0
  ], 
  [
   77256, 
   null, 
   "zachvac", 
   "\"Evolution doesn't seperate anything\". So we cannot seperate good morals from bad morals, its ok for me to act on my instincs and kill you for the lunch you are eating!.\n Its true, evolution cannot seperate man from animal. However we do know that mankind is seperate from animals, because we do not just act on our instincs as an animal would in its world.\n Evolution has to fit this type of evidence into its theory. How did mankind develope its distinctions(hope that was the rite choice of words..), between good and bad morals?\n\n \n I would like to know why humans are different from other animals. I don't think we're really that much different. We think we're smarter and better but if we didn't develop technology like we have now another animal could easily be at the top right now. First of all are you suggesting that there aren't people who kill?\n \n You say we don't act on our instincts. I'd like to ask you a question. Why is killing wrong? Unless you blab about how the Bible says it is the answer would be because it's an instinct. I'd like to point out a case in our area a little while ago where a car ran over a monkey trying to run accross the road and when that car passed by again the monkeys threw rocks at it. They knew we killed them and that they wanted to get revenge. Same with humans, if your mother got killed wouldn't your instinct be to try to kill the killer? How moral is that? Human beings not only make up their own morals, but they constantly break their own laws. The only reason we invented morals is for a reason we are superior to animals. Since we break them at least as often as animals, I don't see much of a difference. (how many animals have killed people because of a different belief? They never kill other than for food, we kill for sport)", 
   {}, 
   77231, 
   null, 
   1100407140.0
  ], 
  [
   77262, 
   null, 
   "Dzeron", 
   "Was this an attempt to answer my question?...\n How is it mankind has a sense of rite and wrong, when animals dont?\n Our laws stem from somewhere, Where?\n I dont kill people because i know its not rite, and how do i know its not rite?. Well i will leave that one for you to answer....\n Lets see if you can fit your answer in with theory of evolution....\n Keeping in mind that evolution does not allow for seperation between \"NATURE AND NURTURE\".....\n MAN IS SEPERATE FROM THE ANIMAL KINGDOM!\n\n \n Our laws (at least the good ones) stem from the concept of defending liberty. It's illegal to kill people because killing someone is a violation of their liberty (unless they ask you to kill them.)\n \n Humans are animals by the way. We fit into the definition of animal - a multicellular heterotrophic mobile organism. We may be very smart, but we're still animals.", 
   {}, 
   77251, 
   null, 
   1100408400.0
  ], 
  [
   77263, 
   null, 
   "stormboy", 
   "I would like to know why humans are different from other animals. I don't think we're really that much different. We think we're smarter and better but if we didn't develop technology like we have now another animal could easily be at the top right now. First of all are you suggesting that there aren't people who kill?\n \n You say we don't act on our instincts. I'd like to ask you a question. Why is killing wrong? Unless you blab about how the Bible says it is the answer would be because it's an instinct. I'd like to point out a case in our area a little while ago where a car ran over a monkey trying to run accross the road and when that car passed by again the monkeys threw rocks at it. They knew we killed them and that they wanted to get revenge. Same with humans, if your mother got killed wouldn't your instinct be to try to kill the killer? How moral is that? Human beings not only make up their own morals, but they constantly break their own laws. The only reason we invented morals is for a reason we are superior to animals. Since we break them at least as often as animals, I don't see much of a difference. (how many animals have killed people because of a different belief? They never kill other than for food, we kill for sport)\n\n Firstly, i am not saying that man is not amune from acting out from there instincts, what i am saying is that man is seperate from animals, because we know its not rite to kill, steal or do anything that will end you up in a prison cell, as where animals dont have the ability to even aknowledge what is rite and what is wrong..", 
   {}, 
   77256, 
   null, 
   1100408460.0
  ], 
  [
   77267, 
   null, 
   "Mach", 
   "Firstly, i am not saying that man is not amune from acting out from there instincts, what i am saying is that man is seperate from animals, because we know its not rite to kill, steal or do anything that will end you up in a prison cell, as where animals dont have the ability to even aknowledge what is rite and what is wrong..\n\n \n But not all humans know it's wrong, or accept it as wrong, do they?\n \n Likewise, not all animals give in to instinct. We have dogs that we train not to bite some people (bad dog), and to bite people we tell them too (good dog).\n \n Yes, humans have enormous potentional compared to most animals in the animal kingdom, with regards to intellegence, and how to apply it. We are seperate in that regards, but it's up to us to DO something with this potential.\n \n But what are you suggesting we do with this intelligence? Listen blindly to a bible passage written by another human, or choose to do what is right based on knowledge?\n \n In any case, you can see why evolution is not the issue here, it's a fundamental desire of some to NOT understand or accept, what science is, what a theory is, and what evolution entails. That's what such a sticker represents. The willfull ignorance of some, in the face of every-day science. The same knowledge and methods used to put man on the moon, and that put antibiotics in our doctor's repetoire, is the same method we come to know the theory of evolution. accepting evolution will not remove your right to worship however you choose, again, we base things off freedoms...not instinct :)\n \n -Mach", 
   {}, 
   77263, 
   null, 
   1100410920.0
  ], 
  [
   77279, 
   null, 
   "Nu Leader", 
   "To pandion:\n \n \nNice try, Mach. But since daewoo is pretending to have qualifications that he doesn't have, his arguments from authority won't be changed by opinions from his betters. He is scientifically illiterate and not worth paying attention to.\n\n \n That's my humour for the day! This is coming from you, who in a few posts back who could thought that a theory was as good as proven and that there was nothing higher than that - or something like that. If you are trying to state that evolution is science, than it is you who are scientifically illiterate! Daewoo is smart enough to see that this whole debate is not science vs religion, it is a belief system about the past (a religion) vs another belief system about the past, i.e. evolution vs creation. He has realised that science cannot be used as a tool for trying to understand the past as it is ill equiped! Only the scientific layman out there would claim other wise that molecules to man evolution is scientific. It is a religious view about our past based on the religion of atheism.\n \n \nAlso notice his inability to stay on topic and address the issues. Instead he misrepresents and resorts to ad hominem. A sure sign that he knows that he is in over his head and is trying to bluff his way out of it.\n\n \n Are you jealous? Many times, people try to put others down because they are jealous of them. You are starting to sound like you fit into this category!", 
   {
    "post_info": {
     "post_title": "Please tell me you are kidding pandion!"
    }
   }, 
   77068, 
   null, 
   1100417160.0
  ], 
  [
   77280, 
   null, 
   "Nu Leader", 
   "To OccamsRazor:\n \n The dates that evolutionary scientists come to is based on evolutionary assumptions!! These assumptions include the fact that things have been going on the same for eons of years, the amount of radioactive material originally, the rate of decay, and so on. These are a few assumptions that MUST be used when trying to date how old a rock is. You have eluded this fact many times and will not address it - hmm, I wonder why?\n \n IF your assumptions are correct (assumptions are unprovable faiths, or starting beliefs) than your date will most likely be correct. But, by their very nature, assumptions about the past cannot be shown to be true.\n \n \nSounds like you have been reading about the (in)famous piece of scientific fraud perpetrated by Steve Austin when he had samples of Mt. St. Helens dacites from the 1981 eruption radiometrically dated and returned a result very different to the date we record the eruption at. What you are trying to use as a line of criticism is actually a great strength of our understanding of radiometric dating- there are clear conditions when such tests are not appropriate.\n \n \n Which, hence, proves my point! Your dates are built upon unprovable faiths and assumptions (dare I use the words \"religious belief\"?) and thus, the date of the Earth can never be proved by science. We can test the methods on rocks of known ages, but the date given by many method are way out. My view of what Steve Austin was doing was to prove to people that since we cannot trust these methods on rocks of known ages, why should we trust them with evolutionary assumptions on rocks of unknown ages. You must also take it by nothing more than blind faith that your \"guesses\", I mean, \"dates\", are true.\n \n \nAlso, I would point out that you have shot yourself in the foot, so to speak, with that comment. How do you know what the age of the earth is without using assumptions? Oh, and by the way I think it was God's flood, Noah just happened to be around to float on it\n.\n \n You are true, we know that the Earth is about 6,000 years old due to that fact that throughout the Bible there are genalogies that start with Adam and end with Jesus Christ and we know when he lived, so adding up the numbers gives the age of the Earth. We do base this date and the reliability of the Bible on the assumption that it is the Inspired Word of God. Well done. You can point out when assumptions are used - now use them in your own work and then you may see that your whole method is based on assumptions. However, our age of the Earth is not one based on blind faith, there are many elements of Divine Authorship in the Bible that point to there being a God who inspired it, the incredible design and the fact that the biology and geology and so on, fits with what the Bible has to say. All of these point to (or imply) there being a Divine Author of the Bible.\n \n With reference to the last part, ha, ha, he, he, ho, ho. If we call simply call it a flood, there have been many others - what makes this so special? If you call it God's Flood, I believe that some other religions also talk about a global flood. Calling it Noah's Flood is a simple way of letting people know that you are talking about the global flood account as recorded in the Bible.\n \n \nSumming up I think you are mis-using language to muddy the issues here and present science and religion in false light to what they actually are. To use a phrase you will be familiar with you are teaching the controversy.\n\n \n Far from it! I am trying to \"teach\" people that the evolutionary dates for rocks, the age of the Earth, and so on, is based on fallible evolutionary assumptions of events that happened in the past. It is people like you who teach the evolutionary lie by stating that it is \"scientific\" and can be trusted. You do not mention the many assumptions involved in the dating methods and thus are not entirely forth coming to the people. I am trying to inform people that the evolutionary dates come from evolutionary assumptions, i.e. evolutionary assumptions are used to prove evolution!", 
   {
    "post_info": {
     "post_title": "You still side step the assumptions involved argument!"
    }
   }, 
   76789, 
   null, 
   1100418660.0
  ], 
  [
   77282, 
   null, 
   "Nu Leader", 
   "Hello pandion:\n \n \nYou show your ignorance. Sir Isaac Newton was not really what might be considered a Christian. You can learn the facts and educate yourself by reading about it. \n \n \n I just love it when people make stupid statements like this. Let me enlighten you about Sir Isaac Newton. I already have learnt about it, the following is some from the book \"21 Great Scientists who believed the Bible\" by Ann Lamont:\n \n Isaac Newton was born at Woolthorpe, Lincolnshire, England on Christmas Day 1642. He was a premature baby and seemed unlikely to live. Gradually, however, he gained enough strength to survive. But Isaac's first few years were a constant struggle. His mother had become a widow two months before Isaac was born. Even with the help of her own mother, she had difficulty caring for Isaac in addition to running their farm while the Civil War in England raged around them.\n \n Several years later, his mother married the minister from nearby North Witham, but Isaac remained at Woolthorpe with his grandmother/ As he grew, he visited his mother frequently, and eagerly read books from his stepfather's well-stocked library, in addition to reading the Bible regularly. \n \n Isaac attened school at King's College in nearby Grantham. Isaac's mother was widowed for the second time when he was 14. Isaac was taken out of school to run the family farm to support his mother and her three younger children. However, Isaac missed his studies greatly and his mother realized this. When King's College offered to waive tuition fees because of his great ability and poor circumstances, Isaac returned and conpleted his schooling. Teachers and other students were impressed with his knowledge of the Bible.\n \n Issac then went to Trinity College at Cambridge University with the intention of becoming a Church of England minister. His life's story goes on until the following is stated:\n \n \"Isaac Newton is undoubtedly one of the greatest scientists who ever lived. His contributions were many and varied, including both revolutionary ideas and practical inventions. His work in physics, mathematics and astronomy is of continuing importance today. His contributions iin any on of these fields would have made him famous. Collectively, they made him outstanding. But Newton remained a modest man. He recognized God as the one who had made his scientific achievements possible, saying that:\n \n All my discoveries have been made in answer to prayer \n \n Newton loved God and believed God's Word. He wrote:\n \n I have a fundamental belief in the Bible as the Word of God, written by men who were inspired. I study the Bible daily. \n \n He also wrote:\n \n Atheism is so senseless. When I look at the solar system, I see the Earth at the right distance from the sun to recieve the proper amounts of heat and light. This did not happen by chance. \n \n Notice the last five words: \"This did not happen by chance\". What does evolution involve? A whole lot of luck and chance. Also stated above in his quote, he believed the Bible as the Word of God, i.e. this rules out theistic evolution as people have changed God's word to suit their own agenda.\n \n \nIf you want to claim the \"Newton was so smart and he was a creationist so it must be right,\" then you must also agree that \"Newton was so smart and denied the divinity of Jesus, so it must be right.\"\n\n \n As Newton stated above he believed the Bible as the Inspired Word of God, and hence, believed every part of it including the part about Jesus Christ being God's Son and coming down to Earth to die on the cross for our sins and rose again so that we may spend eternity in Heaven with Him. So, if you want to, yeah, we could claim that cuz Newton was so smart, he believed the Bible as truth, and in the divinity of Jesus, so it must be true. Notice, you said this, not me.\n \n \nCreationists came about in the late 1800s.\n \n \n Actually, there have been numerous beliefs that life has arisen by accidents all throughout the ages. To be a Christian creationist is just to believe the literal Genesis account for our origins (in six days God created everything).\n \n \nBy the way, I have science degrees from several universities. Obviously, you don't.\n\n \n And that means what to me? Your ignorance of past scientists and the scientific method appears to imply the opposite. And FYI it is the Law of Gravity (not the theory of gravity) that this man made up - which further gives me more reason to believe that you are puffing smoke. Well, then, just because you have a degree you appear to believe that you automatically are smarter than me and thus know more about science than me - and ultimately are more correct than me (you may well be - once again, I don't really care). Does this mean that Dr Sarfati and co at AiG who have a Ph.D are smarter than you and thus are more correct than you??? If you say no, than you are being hypocritical, as you are using the same criteria to judge me...\n \n If you do have a degree, than you should know that since science involves observation and experimental validation as well as repeatability (right?), how can evolution (molecules to man evolution, the big bang theory) be science? \n \n In addition to answering the above question, you should also be able to answer the following question: Is there more evidence for evolution than for creation? Be careful, this is a tricky question...", 
   {
    "post_info": {
     "post_title": "&quot;I have a fundamental belief in the Bible as the Word of God&quot; ~ Newton."
    }
   }, 
   76842, 
   null, 
   1100421000.0
  ], 
  [
   77283, 
   null, 
   "Nu Leader", 
   "To Clive14:\n \nBash your head all you want: it might just knock some sense into you.\n\n \n Kind of like the kettle calling the pot black there isn't it? You need to get some sense if you believe evolution is science.\n \n \nThe debate is 100% science versus religion. Evolution is pure science. Religion has nothing to do with it. Creation is pure religion and science has nothing to do with it.\n\n \n If you still believe this, then you do so on the basis of pure ignorance. Both daewoo and myself have given you evidence countless times that this battle is belief system about the past vs. belief system about the past (i.e. religion vs. religion). You have illustrated to all and justified the following statement that you are very ignorant. You didn't even read the information in the post that you responded to! People like you are a waste of my time, you could be given all the evidence in the world that evolution is a belief system about the past and thus cannot be proved by science, but you will still continue to state: Evolution is science. This proves to all, how much aligned to evolution you are and your ignorance of what science is, and of other's posts. \n \n \nHaving thought about it, what the sticker should really say is:\n Evolution is a well developed scientific theory based upon very large amounts of fact and evidence. Despite this, it presents ideas that contradict some religious teachings and so, unlike most other scientific theories, it remains contraversial in some parts of the world.\n\n \n But than that would be lying. It is not a \"scientific\" theory. It is a belief system about the past based on underlying assumptions. Of course it is based on evidence, as is creation - they have the same evidence to be precise. They are both different interpretations of that same evidence to try to explain the origin of that evidence, i.e. how it got there. It remains contraversial because it has not been observed, nor has it or will it ever be proved by science. Rational people can see that it is not science, but a belief system about the past.", 
   {
    "post_info": {
     "post_title": "It is pointless talking to people like you - your ignorance blinds you..."
    }
   }, 
   76711, 
   null, 
   1100421780.0
  ], 
  [
   77329, 
   null, 
   "zachvac", 
   "Firstly, i am not saying that man is not amune from acting out from there instincts, what i am saying is that man is seperate from animals, because we know its not rite to kill, steal or do anything that will end you up in a prison cell, as where animals dont have the ability to even aknowledge what is rite and what is wrong..\n\n \n Yet we need laws to stop people from doing it. If we knew it was wrong and didn't do it we wouldn't need to punish people for it. And how do you know that animals don't have the ability to acknowledge what is right and wrong? As I said in my post, there were monkeys trying to get revenge on someone who did something wrong (killed a monkey). If someone saw a 20 dollar bill fall out of someone's purse, most people (not all) would wait for them to leave, then pocket it. Is that right? Also, we kill all the time. How else do we get hamburgers, steak, ham, turkey, etc.? We hunt for fun, we step on bugs for our own amusement. Let me ask you the same question most animals would have.\n \n If you had to kill to survive, to eat, would you kill? They don't kill their own species usually, same as us. The only difference is we could survive without killing. Does that make us worse? We kill for sport and amusement and food while most animals just kill for food or self-defense. Yet you say we know right and wrong and they don't?", 
   {}, 
   77263, 
   null, 
   1100464680.0
  ], 
  [
   77330, 
   null, 
   "zachvac", 
   "But not all humans know it's wrong, or accept it as wrong, do they?\n \n Likewise, not all animals give in to instinct. We have dogs that we train not to bite some people (bad dog), and to bite people we tell them too (good dog).\n \n Yes, humans have enormous potentional compared to most animals in the animal kingdom, with regards to intellegence, and how to apply it. We are seperate in that regards, but it's up to us to DO something with this potential.\n \n But what are you suggesting we do with this intelligence? Listen blindly to a bible passage written by another human, or choose to do what is right based on knowledge?\n \n In any case, you can see why evolution is not the issue here, it's a fundamental desire of some to NOT understand or accept, what science is, what a theory is, and what evolution entails. That's what such a sticker represents. The willfull ignorance of some, in the face of every-day science. The same knowledge and methods used to put man on the moon, and that put antibiotics in our doctor's repetoire, is the same method we come to know the theory of evolution. accepting evolution will not remove your right to worship however you choose, again, we base things off freedoms...not instinct :)\n \n -Mach\n\n \n \n but we have the instinct that we want to be free. Why should we be free? What's bad about having someone \"smarter\" than us all having absolute authority? It goes against our instincts, we want freedom.", 
   {}, 
   77267, 
   null, 
   1100464800.0
  ], 
  [
   77333, 
   null, 
   "zachvac", 
   "To Clive14:\n \n But than that would be lying. It is not a \"scientific\" theory. It is a belief system about the past based on underlying assumptions. Of course it is based on evidence, as is creation - they have the same evidence to be precise. They are both different interpretations of that same evidence to try to explain the origin of that evidence, i.e. how it got there. It remains contraversial because it has not been observed, nor has it or will it ever be proved by science. Rational people can see that it is not science, but a belief system about the past.\n\n \n It most definately IS a scientific theory. It is a hypothesis created by a scientist and verified countless times by other SCIENTISTS. I don't care if you don't think it's right. it is a scientific theory because scientists created the theory with scientific evidence.", 
   {}, 
   77283, 
   null, 
   1100465160.0
  ], 
  [
   77338, 
   null, 
   "OccamsRazor", 
   "To OccamsRazor:\n The dates that evolutionary scientists come to is based on evolutionary assumptions!! These assumptions include the fact that things have been going on the same for eons of years, the amount of radioactive material originally, the rate of decay, and so on. These are a few assumptions that MUST be used when trying to date how old a rock is. You have eluded this fact many times and will not address it - hmm, I wonder why?\n\n \n Because you have no idea about the concepts behind and conditions for radiometric dating? Fact is you have no evidence to back up your claim that radioactive decay rates have changed with time.\n \n You cannot show evidence that shows how much the rates varied.\n \n You cannot show evidence that shows when the variation occured.\n \n You cannot show evidence that shows the above two occured in all radioactive minerals.\n \n You cannot show why a technique that can be applied to medicine, manufacturing and short term dating can not also be used past an arbitary date you have chosen.\n \n All you can actually show is that your reading of the Genesis produces a date that is in conflict with the timescale radiometric dating provides, and a desire to prove you are right.\n \n Please do not post another response making the same inferences unless you can provide detailed empirical evidence to back it up.\n \n \nIF your assumptions are correct (assumptions are unprovable faiths, or starting beliefs) than your date will most likely be correct. But, by their very nature, assumptions about the past cannot be shown to be true.\n\n \n This is another one of those statements that is useless because it applies as much to your line of reasoning as it does to mine. I say you read the story of Genesis incorrectly..... hence your assumption that underpins your viewpoint is flawed and cannot be accepted. Many Christians also think the same- you going to tell them they are wrong too?\n \n \nWhich, hence, proves my point! Your dates are built upon unprovable faiths and assumptions (dare I use the words \"religious belief\"?) and thus, the date of the Earth can never be proved by science. We can test the methods on rocks of known ages, but the date given by many method are way out. My view of what Steve Austin was doing was to prove to people that since we cannot trust these methods on rocks of known ages, why should we trust them with evolutionary assumptions on rocks of unknown ages. You must also take it by nothing more than blind faith that your \"guesses\", I mean, \"dates\", are true.\n\n \n What on earth are you on about? do you think radioactive half lives do not stand up to testing?\n \n And your opinion on Dr. Austin is sadly misplaced. Like many of the intellectuals who advocate young earth creationism he is actually quite smart when it comes to specific areas of science related to the age of the earth and evolution. Smart enough in fact to spot a way of deliberately enginnering a test that will return a wildly inaccurate answer. Then all it takes is the world wide web and a few creationist magazines to disseminate his rubbish. Oh, and off course lets not forget to leave the uneducated reader completely in the dark about such trivial details as the suitability of the testing equipment and method he chose as his victim for his campaign of mis-information.\n \n Sorry Nu Leader, Steve Austin's activity in this instance was deceitful and misleading and that alone.\n \n N.B. I don't suppose you actually bothered to read that article I linked you?\n \n \nYou are true, we know that the Earth is about 6,000 years old due to that fact that throughout the Bible there are genalogies that start with Adam and end with Jesus Christ and we know when he lived, so adding up the numbers gives the age of the Earth. We do base this date and the reliability of the Bible on the assumption that it is the Inspired Word of God. Well done. You can point out when assumptions are used - now use them in your own work and then you may see that your whole method is based on assumptions. However, our age of the Earth is not one based on blind faith, there are many elements of Divine Authorship in the Bible that point to there being a God who inspired it, the incredible design and the fact that the biology and geology and so on, fits with what the Bible has to say. All of these point to (or imply) there being a Divine Author of the Bible.\n\n \n See my last response, as I said you do not have monopoly on religious truth- other believers in Christianity do not think the world is 6000 years old, but 4.55 billion. Sorry bud, but your truth is not a truth at all. Its an opinion.\n \n \nWith reference to the last part, ha, ha, he, he, ho, ho. If we call simply call it a flood, there have been many others - what makes this so special? If you call it God's Flood, I believe that some other religions also talk about a global flood. Calling it Noah's Flood is a simple way of letting people know that you are talking about the global flood account as recorded in the Bible.\n\n \n In which case can you provide clear evidence to link all flood tales from around the world together by common timing?\n \n \nFar from it! I am trying to \"teach\" people that the evolutionary dates for rocks, the age of the Earth, and so on, is based on fallible evolutionary assumptions of events that happened in the past.\n\n \n No, you are either don't understand the science or you do and choose to put your faith based assumptions first.\n \n \nIt is people like you who teach the evolutionary lie by stating that it is \"scientific\" and can be trusted. You do not mention the many assumptions involved in the dating methods and thus are not entirely forth coming to the people. I am trying to inform people that the evolutionary dates come from evolutionary assumptions, i.e. evolutionary assumptions are used to prove evolution!\n\n \n You couldn't be more wrong, Nu Leader. Its people like me who say \"go read all the material first then make your mind up\". People like me might also say Christianity and science are not at odds with each other and both views can be held concurrently and without glaring contradiction.\n \n All you are doing is trying to make uncertainty where there is none, and forward your opinion based views.\n \n If you were really serious about this matter you would go and study some science (no, AiG et al. does not count) and learn for yourself. Try it, you might surprise yourself.", 
   {}, 
   77280, 
   null, 
   1100469000.0
  ], 
  [
   77340, 
   null, 
   "jim's trucking", 
   "...\n \n People like me might also say Christianity and science are not at odds with each other and both views can be held concurrently and without glaring contradiction.....\nI agree. There are more inconsistencies in religious doctrine and the Bible than there are in science. This does not preclude the basics of Christianity from being true. I believe God used Occam's Razor in inspiring the authorship of the stories in the Bible used to explain the creation. He knew the average Joe would never understand aeons so He said to tell us He did it all in 6 days, to keep it simple. There are lots of parables in the Bible.", 
   {}, 
   77338, 
   null, 
   1100469840.0
  ], 
  [
   77344, 
   null, 
   "Mach", 
   "I agree. There are more inconsistencies in religious doctrine and the Bible than there are in science. This does not preclude the basics of Christianity from being true. I believe God used Occam's Razor in inspiring the authorship of the stories in the Bible used to explain the creation. He knew the average Joe would never understand aeons so He said to tell us He did it all in 6 days, to keep it simple. There are lots of parables in the Bible.\n\n \n So, do you think such a sticker is necessary?\n \n If one chooses the skeptic viewpoint (we cannot have certainty...which is a contradiction amusingly enough), then we would need a sticker for everything in sight.\n \n The only reason it's suggested is to support non-scientific belief in religious dogma...of a very specific kind (religions that conflict with evolution).\n \n -Mach", 
   {}, 
   77340, 
   null, 
   1100471220.0
  ], 
  [
   77346, 
   null, 
   "jim's trucking", 
   "So, do you think such a sticker is necessary?\n \n If one chooses the skeptic viewpoint (we cannot have certainty...which is a contradiction amusingly enough), then we would need a sticker for everything in sight.\n \n The only reason it's suggested is to support non-scientific belief in religious dogma...of a very specific kind (religions that conflict with evolution).\n \n -Mach\nNot only is the current Georgia sticker not necessary, it's not correctly stated. It says that the holdings of evolutionism are not factual, a claim that cannot be substantiated with proof, except to quote the infallibility of the Bible, which of course, they are not allowed to do in public schools.\n \n It's a ridiculous effort by the religious Bible-thumpers to discredit Evolution and push for Creationism. I've heard of being creative, but this....", 
   {}, 
   77344, 
   null, 
   1100473440.0
  ], 
  [
   77357, 
   null, 
   "Master_Shake", 
   "Not only is the current Georgia sticker not necessary, it's not correctly stated. It says that the holdings of evolutionism are not factual, a claim that cannot be substantiated with proof, except to quote the infallibility of the Bible, which of course, they are not allowed to do in public schools.\n \n It's a ridiculous effort by the religious Bible-thumpers to discredit Evolution and push for Creationism. I've heard of being creative, but this....\n\n \n Wow, Jim's Trucking! I never would've expected that out of you. I think that is the first post I've read from you that I agreed with. Maybe we're not so different (lol) (at least on this).", 
   {}, 
   77346, 
   null, 
   1100479080.0
  ], 
  [
   77402, 
   null, 
   "stormboy", 
   "But not all humans know it's wrong, or accept it as wrong, do they?\n \n Likewise, not all animals give in to instinct. We have dogs that we train not to bite some people (bad dog), and to bite people we tell them too (good dog).\n \n Yes, humans have enormous potentional compared to most animals in the animal kingdom, with regards to intellegence, and how to apply it. We are seperate in that regards, but it's up to us to DO something with this potential.\n \n But what are you suggesting we do with this intelligence? Listen blindly to a bible passage written by another human, or choose to do what is right based on knowledge?\n \n In any case, you can see why evolution is not the issue here, it's a fundamental desire of some to NOT understand or accept, what science is, what a theory is, and what evolution entails. That's what such a sticker represents. The willfull ignorance of some, in the face of every-day science. The same knowledge and methods used to put man on the moon, and that put antibiotics in our doctor's repetoire, is the same method we come to know the theory of evolution. accepting evolution will not remove your right to worship however you choose, again, we base things off freedoms...not instinct :)\n \n -Mach\n\n \n \"We are seperate in that regards\". Hold on a tick, it was a couple of posts back you were saying that evolution doesant seperate anything?", 
   {}, 
   77267, 
   null, 
   1100498040.0
  ], 
  [
   77408, 
   null, 
   "Nu Leader", 
   "It is pointless even talking to you OccamsRazor, as you will not even admit that your own radiometric dating methods require assumptions.\n \n \nYou cannot show evidence that shows how much the rates varied.\n \n You cannot show evidence that shows when the variation occured.\n \n You cannot show evidence that shows the above two occured in all radioactive minerals.\n\n \n Nor can you show that the rates stay the same. I believe that this is one of the characteristics of an assumption. You cannot prove that the rate of decay has stayed the same throughout the past any more than what I can prove it changed, and hence, it must be taken by faith. But IF my assumption about the Flood happening is true, than your dates will be out by a large area of measurement.\n \n Down at the bottom of the Grand Canyon there is a lava flow that formed basalt that has been dated by the rubidium/strontium method at about 1 billion years old; and evolutionists were quite happy with that. But somebody made a mistake, they decided to apply the same method to a lava flow at the top of the canyon and again they get a nice straight line plot - no contamination should be a reliable date - but the lava flow at the top is about 1/3 of a billion years older by that method than the lava flow at the bottom! If you took radiometric dates literally, what? The canyon formed up-side-down! May be it is the Bible we should take literally and the dating methods causiously. This is well known to scientists, but the evolutionists don't want anyone else to know about it. One scientist suggested that there we just can't use, there is no pattern here, we can't use radioactivity to date things, may be all we can do with it is map rocks. The reason why these have different ammounts of rubidium and strontium has nothing to do with how old they are, but only the source of magma from which they came. So you can use it for mapping, but not for telling age. \n \n Until you finally realise that assumptions (i.e. unprovable starting beliefs) are used in radiometric dating methods, we cannot continue and you should not reply to any further posts relating to this topic made by myself. \n \n From the article Radioactive decay rate depends on chemical environment :\n \n Radioactive dating is claimed to prove that the earth is billions of years old, but the methods are based on a number of unprovable assumptions. For example, it is assumed that radioactive decay rates have not changed in the past. Specifically, geochronologists assume that radioactive decay rates are unaffected by physical conditions like temperature and pressure. They also assume they are independent of the chemical environment. \n \n Other assumptions can be seen from the site Radioactive Age Estimation :\n \n Assumptions and More Assumptions\n Arriving at a \"date\" depends upon a chain of assumptions,6 each link in the chain being an assumption. The validity of the calculated date can be no stronger than the weakest link (weakest assumption) used in the calculation. What are some of the assumptions made by most Evolutionists in using these systems?\n \n \n ASSUMPTION: Evolutionists generally assume the material being measured had no original \"daughter\" element(s) in it, or they assume the amount can be accurately estimated. For example, they may assume that all of the lead in a rock was produced by the decay of its uranium.\n PROBLEM: One can almost never know with absolute certainty how much radioactive or daughter substance was present at the start.\n \n \n ASSUMPTION: Evolutionists have also tended to assume that the material being measured has been in a closed system. It has often been wrongly assumed that no outside factors altered the normal ratios in the material, adding or subtracting any of the elements involved.\n PROBLEM: The age estimate can be thrown off considerably, if the radioactive element or the daughter element is leached in or leached out of the sample. There are evidences that this could be a significant problem.7 Simple things such as groundwater movement can carry radioactive material or the daughter element into or out of rock. Rocks must be carefully tested to determine what outside factors might have changed their content.\n \n \n ASSUMPTION: They assume that the rate of decomposition has always remained constant - absolutely constant.8\n PROBLEM: How can one be certain that decay rates have been constant over billions of years? Scientific measurements of decay rates have only been conducted since the time of the Curies in the early 1900s. Yet Evolutionists are boldly making huge extrapolations back over 4.5 billion years and more. There is some evidence that the rate of radioactive decay can change.9 If the decay rates have ever been higher in the past, then relatively young rocks would wrongly \"date\" as being old rocks.\n \n \n Evolutionist William Stansfield, Ph.D., California Polytech State, has stated:\n \n \"It is obvious that radiometric techniques may not be the absolute dating methods that they are claimed to be. Age estimates on a given geological stratum by different radiometric methods are often quite different (sometimes by hundreds of millions of years). There is no absolutely reliable long-term radiological 'clock'.\"10\n \n Evolutionist Frederick B. Jueneman candidly summarizes the situation:\n \n \"The age of our globe is presently thought to be some 4.5 billion years, based on radio-decay rates of uranium and thorium. Such 'confirmation' may be shortlived, as nature is not to be discovered quite so easily. There has been in recent years the horrible realization that radio-decay rates are not as constant as previously thought, nor are they immune to environmental influences. And this could mean that the atomic clocks are reset during some global disaster, and events which brought the Mesozoic to a close may not be 65 million years ago, but rather, within the age and memory of man.\"11\n \n I have given you several resources that show you that radioactive dating methods use unprovable assumptions as the core of their work. You can continue to ignore such evidence and thus demonstrate your ignorance - that is a decision I leave up to you.", 
   {}, 
   77338, 
   null, 
   1100500380.0
  ], 
  [
   77416, 
   null, 
   "pandion", 
   "For Nu Leader\n \nAlso at this time, the Archbishop of Canterbury offered him the position of Master of Trinity. Newton was forced to refuse this honor because he would have had to take holy orders and, as is known from his secret papers, he harbored doubts about orthodox Protestantism. In particular, he did not accept the concept of the Trinity.\n \n --Brennan, Richard P. Heisenberg Probably Slept Here: The Lives, Times, and Ideas of the Great Physicists of the 20th Century. New York: John Wiley & Sons, Inc. 1997\n\n \nNewton found time now to explore other interests, such as religion and theology. In the early 1690s he had sent Locke a copy of a manuscript attempting to prove that Trinitarian passages in the Bible were latter-day corruptions of the original text. When Locke made moves to publish it, Newton withdrew in fear that his anti-Trinitarian views would become known.\n \n --The Encyclopaedia Britannica, Newton, Sir Isaac, 2001\n\n Nothing in your response contradicts any of the above. As I said, Newton was not really what might be considered a Christian.\n \n Newton's law of gravity: F = G Ma Mb / r^2\n \n The theory of gravity accounts for the motions of bodies in space. It also includes such concepts as inertia. Einstein gave us general relativity, which is a theory of gravity in which gravity is a curvature of space/time near massive bodies. Quantum gravity deals with the very small. Both have amended Newton's theories on the motion of bodies. Tesla theorized gravity as a force field. The latest theory of gravity is M-theory, a revision of string theory and superstring theory.\n \nAnd FYI it is the Law of Gravity (not the theory of gravity) that this man made up - which further gives me more reason to believe that you are puffing smoke.\n\n Newton made up the law of gravity? Strange. I thought he calculated it from experimental observations. Of course, Newton stated the equation that is known as the law of gravity, as well as writing several papers on the theory of gravity that explained the motion of bodies.\n \n And yes, I probably am smarter than you. Your posts aren't very well thought out and show a lack of education. Dr. Sarfati is probably more knowledgable than I am in physical chemistry and Spectroscopy. But he hasn't done a lick of science since he got his Ph.D. He seems prouder of his chess accomplishments.", 
   {}, 
   77344, 
   null, 
   1100504700.0
  ], 
  [
   77428, 
   null, 
   "Clive14", 
   "Was this an attempt to answer my question?...\n How is it mankind has a sense of rite and wrong, when animals dont?\nYour question makes no sense. Social animals do have a sense of right and wrong.\n \n \nOur laws stem from somewhere, Where?\nA need to hold societies together. Humans are social animals and, like other social animals, we have rules of behaviour. Being smarter than other animals, we have made our rules far more complex than those of other animals though.\n \n \nI dont kill people because i know its not rite, and how do i know its not rite?. Well i will leave that one for you to answer....\nDo you not know then? It is because you have been taught it is not right. Do you see the death penalty as wrong? What about killing in self defense? What about killing in war?\n \n \nLets see if you can fit your answer in with theory of evolution....\nWhy limit myself to just evolution? Perhaps you would like me to shoe-horn my answers into the theory of magnetism too?\n \n \nKeeping in mind that evolution does not allow for seperation between \"NATURE AND NURTURE\".....\nReally? How do you arrive at that conclusion?\n \n \nMAN IS SEPERATE FROM THE ANIMAL KINGDOM!\nIncorrect.", 
   {}, 
   77251, 
   null, 
   1100512440.0
  ], 
  [
   77429, 
   null, 
   "Clive14", 
   "Only the scientific layman out there would claim other wise that molecules to man evolution is scientific. It is a religious view about our past based on the religion of atheism.\nOops, you are confused again Nu, only the creanist would ever claim that \"molecules to man evolution\" is scientific, because it is their strawman.", 
   {}, 
   77279, 
   null, 
   1100512620.0
  ], 
  [
   77430, 
   null, 
   "Clive14", 
   "If you still believe this, then you do so on the basis of pure ignorance. Both daewoo and myself have given you evidence countless times that this battle is belief system about the past vs. belief system about the past (i.e. religion vs. religion).\nYou both spout gibberish from a position of ignorance. Excuse me if I therefore view your opinions on the matter as being worthless.\n \n \nBut than that would be lying. It is not a \"scientific\" theory.\nVery true, evolution isn't a \"scientific\" theory, it is a scientific theory. It is a thoroughly tested explanation of observed data and thus qualifies as a scientific theory Anyone who states otherwise is ignorant, stupid or assinine.\n \n \nIt is a belief system about the past based on underlying assumptions. Of course it is based on evidence, as is creation\nIncorrect. Creation is based upon belief in a specific reading of the Bible. There is no evidence beyond the Bible for it.\n \n \nIt remains contraversial because it has not been observed, nor has it or will it ever be proved by science. Rational people can see that it is not science, but a belief system about the past.\nIncorrect. Rational people can see that evolution is a thoroughly tested explanation of observed data that has been observed and that has been proven beyond reasonable doubt. Irrational faith-bound dogmatic individuals that can't let go of their own egotistical reading of a religious text are the only ones that make evolution a contraversy.", 
   {}, 
   77283, 
   null, 
   1100513400.0
  ], 
  [
   77431, 
   null, 
   "stormboy", 
   "Oops, you are confused again Nu, only the creanist would ever claim that \"molecules to man evolution\" is scientific, because it is their strawman.\n\n This is outside of the line of the debate, but clive could you fill me in on what exsactly does strawman mean. I have heard it being said many of times, and i have been left wondering\n STORMY", 
   {}, 
   77429, 
   null, 
   1100514960.0
  ], 
  [
   77441, 
   null, 
   "OccamsRazor", 
   "It is pointless even talking to you OccamsRazor, as you will not even admit that your own radiometric dating methods require assumptions.\n\n \n I could say its pointless talking to you, Nu Leader as you refuse to read any of the science on radiometric dating. But I'll try :p\n \n \nNor can you show that the rates stay the same. I believe that this is one of the characteristics of an assumption. You cannot prove that the rate of decay has stayed the same throughout the past any more than what I can prove it changed, and hence, it must be taken by faith. But IF my assumption about the Flood happening is true, than your dates will be out by a large area of measurement.\n\n \n Wrong Nu Leader. We can test radiometric dating techniques on radioactive elements/minerals with half-lives short enough to allow us to study them over the timescales we can deal with. So we know these methods work.\n \n There is no evidence that radioactive decay rates have changed with time- physics tells us this. We do use the concept of the physical laws that we use to describe our world work the same today as they did 800, 800,000 and 80,000,000 years before present. Is this faith? no it is hypothesis which has been tested. The weakness with your reasoning is that key radiometric dates have been verifed by other areas of science using very different techniques. Try finding out some of these for yourself.\n \n Also, you have no proof to back up your assertion that these rates have changed. It is quite reasonable and logical to say they have stayed constant unless we have clear empirical evidence to the contary. Using your rationale I can argue the world is any age, because there is nothing that ties your notion to reality. So under your idea the world could be 18,000 years old just as easily as it is 6000. Which brings us back to the central point in this debate- you have no objection to the science, but to the results. Hence you construct arguements to undermine science and try fit the evidence to your preconceived opinions derived from Genesis.\n \n So you couldn't provide the examples I asked for could you?\n \n \nDown at the bottom of the Grand Canyon there is a lava flow that formed basalt that has been dated by the rubidium/strontium method at about 1 billion years old; and evolutionists were quite happy with that. But somebody made a mistake, they decided to apply the same method to a lava flow at the top of the canyon and again they get a nice straight line plot - no contamination should be a reliable date - but the lava flow at the top is about 1/3 of a billion years older by that method than the lava flow at the bottom! If you took radiometric dates literally, what? The canyon formed up-side-down! May be it is the Bible we should take literally and the dating methods causiously. This is well known to scientists, but the evolutionists don't want anyone else to know about it. One scientist suggested that there we just can't use, there is no pattern here, we can't use radioactivity to date things, may be all we can do with it is map rocks. The reason why these have different ammounts of rubidium and strontium has nothing to do with how old they are, but only the source of magma from which they came. So you can use it for mapping, but not for telling age.\n\n \n You forgot to mention this piece of work was carried out by the geochron fraudster-in-chief, Dr. Steve Austin. He has already been shown to be unable to correctly apply and interpret radiometric dating techniques, so we have to be cautious of his findings. That's the \"giving him the benefit of the doubt version\". Alternatively we can say Dr. Austin constructed another false \"test\" by, amongst other things, rigging his lava sample selection to produce a \"false\" result he could use to discredit the Rb/Sr method.\n \n I'm not even going to try paraphrase why Austin's results do not cast doubt on the Rb/Sr method, but instead send you here for a detailed critique or here for a more succinct examination.\n \n Once again, Dr. Austin and his colleagues deceive the uninformed reader by ommision of key facts.\n \n \nUntil you finally realise that assumptions (i.e. unprovable starting beliefs) are used in radiometric dating methods, we cannot continue and you should not reply to any further posts relating to this topic made by myself. \n \n From the article Radioactive decay rate depends on chemical environment :\n \n Radioactive dating is claimed to prove that the earth is billions of years old, but the methods are based on a number of unprovable assumptions. For example, it is assumed that radioactive decay rates have not changed in the past. Specifically, geochronologists assume that radioactive decay rates are unaffected by physical conditions like temperature and pressure. They also assume they are independent of the chemical environment. \n \n Other assumptions can be seen from the site Radioactive Age Estimation :\n\n \n So lets get this straight.... you are saying that because a researcher finds a 1.5% variation in decay rates according to the type of beryillium isotope tested that radiometric dates cannot be trusted? Don't think so.\n \n Richard Kerr noted in Science: 'Creationists hoping to trim geologic history to biblical proportions will be disappointed - the variations seen so far are much too small, just a percent or so, to affect the Earth's overall time scale.'\n \n And AiG does nothing to counter this comment (that they provide) with anything other than \"Ooo! we knew we cannot trust them!\", which I suppose is in line with the tone of their article which sticks to their teach the controversy approach quite consistently.\n \n \n'Creationists hoping to trim geologic history to biblical proportions will be disappointed - the variations seen so far are much too small, just a percent or so, to affect the Earth's overall time scale.'5\n \n Assumptions and More Assumptions\n Arriving at a \"date\" depends upon a chain of assumptions,6 each link in the chain being an assumption. The validity of the calculated date can be no stronger than the weakest link (weakest assumption) used in the calculation. What are some of the assumptions made by most Evolutionists in using these systems?\n \n ASSUMPTION: Evolutionists generally assume the material being measured had no original \"daughter\" element(s) in it, or they assume the amount can be accurately estimated. For example, they may assume that all of the lead in a rock was produced by the decay of its uranium.\n PROBLEM: One can almost never know with absolute certainty how much radioactive or daughter substance was present at the start.\n\n \n We cannot know an awful lot of things with absolute certainty, but that does not stop us using such ideas if they stand up to testing. Please think about this before you respond with another knee-jerk rebuttal.\n \n \nASSUMPTION: Evolutionists have also tended to assume that the material being measured has been in a closed system. It has often been wrongly assumed that no outside factors altered the normal ratios in the material, adding or subtracting any of the elements involved.\n PROBLEM: The age estimate can be thrown off considerably, if the radioactive element or the daughter element is leached in or leached out of the sample. There are evidences that this could be a significant problem.7 Simple things such as groundwater movement can carry radioactive material or the daughter element into or out of rock. Rocks must be carefully tested to determine what outside factors might have changed their content.\n\n \n I'm actually surprised by the understanding you displayed with this response! Suitability of potential samples for dating is a major area in geochronology, and there are a whole set of circumstances that are used to screen and discard samples that have been subjected to conditions that void their usefulness as subjects for dating. You seem to think that any old sample is dated..... you could not be more wrong. If anything consider the expense involved in dating rock samples- it is a very costly process.\n \n \nASSUMPTION: They assume that the rate of decomposition has always remained constant - absolutely constant.8\n PROBLEM: How can one be certain that decay rates have been constant over billions of years? Scientific measurements of decay rates have only been conducted since the time of the Curies in the early 1900s. Yet Evolutionists are boldly making huge extrapolations back over 4.5 billion years and more. There is some evidence that the rate of radioactive decay can change.9 If the decay rates have ever been higher in the past, then relatively young rocks would wrongly \"date\" as being old rocks.\n\n \n What is your evidence of this variation in radioactive decay rates? So what if radiometric dating was first discovered at the start of the 20th century. If you think this is an issue I suggest you consider the Wright Flyer of 1903 and the modern day Airbus.\n \n \nEvolutionist William Stansfield, Ph.D., California Polytech State, has stated:\n \n \"It is obvious that radiometric techniques may not be the absolute dating methods that they are claimed to be. Age estimates on a given geological stratum by different radiometric methods are often quite different (sometimes by hundreds of millions of years). There is no absolutely reliable long-term radiological 'clock'.\"10\n\n \n William Stansfield is a geneticist. Please be clear when describing the research interests of scientists you cite. You also know these comments date from 1977 I take it? Perhaps you should contact Professor Stansfield and ask him if he still holds this view on an area he is not engaged in reasearching.\n \n \nEvolutionist Frederick B. Jueneman candidly summarizes the situation:\n \n \"The age of our globe is presently thought to be some 4.5 billion years, based on radio-decay rates of uranium and thorium. Such 'confirmation' may be shortlived, as nature is not to be discovered quite so easily. There has been in recent years the horrible realization that radio-decay rates are not as constant as previously thought, nor are they immune to environmental influences. And this could mean that the atomic clocks are reset during some global disaster, and events which brought the Mesozoic to a close may not be 65 million years ago, but rather, within the age and memory of man.\"11\n\n \n Frederic Jueneman is a consulting industrial analytical chemist..... like I said before please be clear with your descriptions of scientific expertise. He does not seem to have any particular qualification to back his remarks up, aside from the fact he writes articles on catastrophism.\n \n \nI have given you several resources that show you that radioactive dating methods use unprovable assumptions as the core of their work. You can continue to ignore such evidence and thus demonstrate your ignorance - that is a decision I leave up to you.\n\n \n Lets be clear, Nu Leader. You have given some articles on:\n \n -Jury rigged radiometric dating tests cleverly designed to return controversial dates.\n \n -Articles from a faith based organisation that wishes to forward an agenda that the earth was created in accordance of theit literal reading of Genesis, ie. 6000 years old.\n \n -Articles that exploit the readers lack of knowledge on the complex methodologies employed in radiometric dating.\n \n -No empirical evidence has been given to show that radioactive decay rates vary in a manner that effects minerals used in radiometric dating, or to how much effect this variation would cause if it were to be found.\n \n Unlike yourself with regard to science, I do not ignore what the young earth camp has to say on the age of the earth. I do however try to examine their claims to see how reasonable they are and if they are actaully backed up by the facts they claim that support them.", 
   {
    "unicode_changes_made": true
   }, 
   77408, 
   null, 
   1100531040.0
  ], 
  [
   77536, 
   null, 
   "Mach", 
   "\"We are seperate in that regards\". Hold on a tick, it was a couple of posts back you were saying that evolution doesant seperate anything?\n\n \n That's correct.\n \n Humans are different than all other animals, that are not humans. What's confusing about that?\n \n -Mach", 
   {}, 
   77402, 
   null, 
   1100576400.0
  ], 
  [
   77564, 
   null, 
   "stormboy", 
   "That's correct.\n \n Humans are different than all other animals, that are not humans. What's confusing about that?\n \n -Mach\n\n Confuseing?, i dident say anything about being confused, you have just help to clarify a contradiction. There is no room for any seperation between animal and man when it comes to evolution!. Humans are seperate from animals....", 
   {}, 
   77536, 
   null, 
   1100591220.0
  ], 
  [
   77566, 
   null, 
   "pandion", 
   "Humans are seperate from animals....\n\n So medical testing on mice, rats, and even primates is useless? It is based on evolutionary theory you know.\n \n By the way. The word is \"separate.\" Please learn what you are talking about before you speak.", 
   {}, 
   77564, 
   null, 
   1100594340.0
  ], 
  [
   77573, 
   null, 
   "stormboy", 
   "So medical testing on mice, rats, and even primates is useless? It is based on evolutionary theory you know.\n \n By the way. The word is \"separate.\" Please learn what you are talking about before you speak.\n\n I have always thought that the best way to learn is to ask questions...Im thinking this would be a hard task for one that chooses not to open his or her mouth!. I will also make a solid note not to instruct anyone in the ways of spilling, sorry thats spelling...\n \n And as for the mice and so on, I have always believed the reason for the testing, is that we have a similar make up?. It is true that i can see how this could be good evidence for a common ancestor, however, i could also see how this can be evidence for a common intelligent designer. It all comes down to the way we interpret ALL the evidence. And when i say ALL the evidence thats exactly what i mean, ALL the evidence!. And part of that evidence is the unexplainable from a evolutionists worldview... It all needs to be able to fit.", 
   {}, 
   77566, 
   null, 
   1100607960.0
  ], 
  [
   77676, 
   null, 
   "zachvac", 
   "Nu Leader, We base a lot of historical stuff on radiometric dating. Go here http://www.asa3.org/ASA/resources/Wiens.html. The title is: Radiometric Dating: A Christian Perspective. Please read it (I doubt you will, but at least I tried). \n It explains many \"errors\" that Christians claim there are with radiometric dating. It explains it in detail and clearly so anyone can understand it (it even writes out that ln is natural logarithm). I'm sure Daewood should be able to understand it being a physicist and being held to a \"higher\" standard. And if he can't then he really is a XXXXX and a liar. Of course I'm sure both Nu Leader and Daewood (and any other interested in learning more) will read this. Here's one point it raises.\n \n Some young-Earth proponents recently reported that rocks were dated by the potassium-argon method to be a several million years old when they are really only a few years old. But the potassium-argon method, with its long half-life, was never intended to date rocks only 25 years old. These people have only succeeded in correctly showing that one can fool a single radiometric dating method when one uses it improperly. The false radiometric ages of several million years are due to parentless argon, as described here, and first reported in the literature some fifty years ago. Note that it would be extremely unlikely for another dating method to agree on these bogus ages. Getting agreement between more than one dating method is a recommended practice.\n \n You should realize that different isotopes of different molecules are used for different amounts of time and it would have been easy for Mr. Austin to fudge it and show all people ignorant of science how radiometric dating is wrong. It also explains that if you use the correct molecule and isotope, the dating is extremely accurate. Although I doubt either of you 2 will read it, maybe other interested people will read it. I tried.", 
   {
    "post_info": {
     "post_title": "Radiometric dating doesn't work? oh my!"
    }
   }, 
   77573, 
   null, 
   1100665140.0
  ], 
  [
   77683, 
   null, 
   "daewoo", 
   "Nu Leader, We base a lot of historical stuff on radiometric dating. Go here http://www.asa3.org/ASA/resources/Wiens.html. The title is: Radiometric Dating: A Christian Perspective. Please read it (I doubt you will, but at least I tried). \n It explains many \"errors\" that Christians claim there are with radiometric dating. It explains it in detail and clearly so anyone can understand it (it even writes out that ln is natural logarithm). I'm sure Daewood should be able to understand it being a physicist and being held to a \"higher\" standard. And if he can't then he really is a XXXXX and a liar. Of course I'm sure both Nu Leader and Daewood (and any other interested in learning more) will read this. Here's one point it raises.\n\n \n Sorry, I quite following this thread because pandion seemed to infer that he was not going to play anymore. Then I saw this. First, I never said I was a physicist, I am not. I have a degree in physics. Big difference. Then I saw this moronic rambling pass thoguh my inbox and felt compelled to respond. Why would I need to read this? I argued in this very thread for the accuracy of radiometric dating. I fear that you have certainly shown us a XXXXX, but it is not me. \n \n \n \nYou should realize that different isotopes of different molecules are used for different amounts of time and it would have been easy for Mr. Austin to fudge it and show all people ignorant of science how radiometric dating is wrong. It also explains that if you use the correct molecule and isotope, the dating is extremely accurate. Although I doubt either of you 2 will read it, maybe other interested people will read it. I tried.\n\n \n Again, why would you address this to me or imply that I need some explanation regarding radiometirc dating.\n \n Let me just say this one more time so those of you who are especially dense understand my position.\n \n I AM NOT A CREATIONIST. I HAVE NO HORSE IN THIS RACE. \n \n I was merely pointing out some inaccuracy in how certain posters were viewing/preaching the scintific method, namely that the foremost requirement when approching a problem is a healthy dose of scepticism. Opinions seem to be being formed based on incomplete evidence here, and that is dangerous to progress. By declaring theories for which we do not have insurmountable evidence in support of as absolute truth, you run the very real risk of overlooking contrary evidence, merely because you have already formed your own conclusions or adopted somebody elses.\n \n History has shown that this is VERY poor practice as people tend to bend evidence to fit theory as opposed to adjusting the theory to fit the available evidence. History has also demonstrated that many, if not most, of the scientific theories we hold today will eventually fall to ruin as our knowledge of the world progresses. Only a fool or a teacher would be willing to put absolute faith in a theory for which we do not have insurmountable evidence.\n \n I would suggest that in the future before presenting an imagined touche, you actually read the other persons views to avoid looking like an illiterate jackass as you have here.", 
   {}, 
   77676, 
   null, 
   1100667720.0
  ], 
  [
   77711, 
   null, 
   "pandion", 
   "I have always thought that the best way to learn is to ask questions...\n\n Well I certainly agree with that statement. But that isn't what you are doing. You are making assertions about matters of which you know nothing.\n \nIm thinking this would be a hard task for one that chooses not to open his or her mouth!.\n\n Perhaps if you expressed your questions as questions rather than creationist assertions you would make more progress. Questioning science isn't a bad thing, since that is the way science works. There is always the presumption that it is possible every law or theory of science may be shown to be incorrect by the discovery of new data.\n \nI will also make a solid note not to instruct anyone in the ways of spilling, sorry thats spelling...\n\n The problem is that you presume to instruct me in matters in which I have some education and experience, and you can't even spell correctly. I went through the system at a time before computers with spell checkers, and still I had professors who would give any paper an F if there was a single spelling error - or punctuation error for that matter.\n \nAnd as for the mice and so on, I have always believed the reason for the testing, is that we have a similar make up?.\n\n But the premise is that the more closely related a test species is to humans, then the more likely it is that the results will be meaningful when applied to humans. Tests on frogs are less likely to be applicable to humans than tests on dogs. Mice and rats are used because they are mammals, easy to raise, small and cheap. But they are not always the best subjects.\n \nIt is true that i can see how this could be good evidence for a common ancestor, however, i could also see how this can be evidence for a common intelligent designer.\n\n Design is a process of change. Designers reuse common designs because they have been shown to work in previous work. Some design characteristics are rejected because they don't work. Design is a process of change. But there is no reason why an infinite being who is all powerful would be constrained by common design. Why would your god be limited in such a way? Couldn't your god do whatever he wanted? Why does the biochemistry of a mouse have to be close to that of a human. Couldn't you god have designed each and every \"kind\" with a unique genetic code, a unique biochemistry and a unique metabolism?\n \nIt all comes down to the way we interpret ALL the evidence. And when i say ALL the evidence thats exactly what i mean, ALL the evidence!.\n\n Then you have actually examined ALL of the evidence? You claim that you are asking questions and then you make assertions. You claim that you are just trying to learn and then make claims that you can't support. I have examined evidence from cosmology, astrophysics, nuclear physics, biogeography, and geology. None of it supports an earth less than 10,000 years old. I have also examined evidence of biogeography, ecology, genetics, population genetics, and biology from a professional viewpoint. I have found no evidence that supports a young earth. In fact, all evidence points to an old universe (13.7 billion years) and an old earth (4.55 billion years). All of it points to a common ancestry of life (the same genetic elements using the same genetic code, from one celled organisms to humans).\n \nAnd part of that evidence is the unexplainable from a evolutionists worldview... It all needs to be able to fit.\n\n That wasn't a question - it was an assertion. How are you going to learn if you aren't going to ask questions? I didn't see a single question in this post.\n \n First of all, the theory of evolution isn't a \"worldview.\" Such assertions are usually made by those who don't understand science, much less evolution. Your religious \"worldview\" prevents you from giving reasonable consideration to science. You know the answers before you look at any evidence. Your answers are based on the 4000 year old mythology of nomadic herdsmen. Any evidence that doesn't fit your answer is rejected.\n \n So now I have two challenges:\n \n 1) present the evidence that is unexplainable by the scientific theory of evolution. Remember that evolution is a theory of biology - not cosmology, geology, or any other science.\n \n 2) present the evidence that supports the creationist \"worldview.\" I consider this to be the most important question, since creationism is essentially composed of arguments against various fields of science (mentioned above) that show creationism to be wrong. Please show the evidence FOR creationism. Please show why creationism (it's magic) is a better explanation than natural causes.\n \nSo please list in some detail the unexplainable evidence.\n\n So you don't ask questions, don't want to learn, don't understand science, can't spell, and are lazy to boot. Here's some. You must understand that this is only a part of the evidence presented from a very constrained viewpoint. This deals only with the evidence for common descent.\n \n Please answer each of the points presented and then we can move on to geology, cosmology, astronomy, and nuclear physics.\n \n 29+ Evidences for Macroevolution: The Scientific Case for Common Descent\n \n I suspect that you lack the integrity to actually read it and make any attempt to verify any of the information. You know the answer before any question is asked. That's why you don't ask questions.", 
   {}, 
   77676, 
   null, 
   1100680500.0
  ], 
  [
   77712, 
   null, 
   "pandion", 
   "First, I never said I was a physicist, I am not. I have a degree in physics. Big difference.\n\n Right. And I have degrees in biology but am not a biologist. Exactly what is a physicist? Is it that you weren't able to find a job because of your poor grades and are now sweeping floors or what?\n \nI AM NOT A CREATIONIST. I HAVE NO HORSE IN THIS RACE.\n\n Nonsense. If you are not a creationist then why are you presenting creationist arguments?\n \n As I said, you are a fake (no, not a blasphemer - a fake). You don't have a degree in physics and you are a creationist. Your knowledge of science is non-existant and you argue from a creationist position. Why pretend to be what you are not?", 
   {}, 
   77711, 
   null, 
   1100681220.0
  ], 
  [
   77718, 
   null, 
   "stormboy", 
   "Well I certainly agree with that statement. But that isn't what you are doing. You are making assertions about matters of which you know nothing.\n \n Perhaps if you expressed your questions as questions rather than creationist assertions you would make more progress. Questioning science isn't a bad thing, since that is the way science works. There is always the presumption that it is possible every law or theory of science may be shown to be incorrect by the discovery of new data.\n \n The problem is that you presume to instruct me in matters in which I have some education and experience, and you can't even spell correctly. I went through the system at a time before computers with spell checkers, and still I had professors who would give any paper an F if there was a single spelling error - or punctuation error for that matter.\n \n But the premise is that the more closely related a test species is to humans, then the more likely it is that the results will be meaningful when applied to humans. Tests on frogs are less likely to be applicable to humans than tests on dogs. Mice and rats are used because they are mammals, easy to raise, small and cheap. But they are not always the best subjects.\n \n Design is a process of change. Designers reuse common designs because they have been shown to work in previous work. Some design characteristics are rejected because they don't work. Design is a process of change. But there is no reason why an infinite being who is all powerful would be constrained by common design. Why would your god be limited in such a way? Couldn't your god do whatever he wanted? Why does the biochemistry of a mouse have to be close to that of a human. Couldn't you god have designed each and every \"kind\" with a unique genetic code, a unique biochemistry and a unique metabolism?\n \n Then you have actually examined ALL of the evidence? You claim that you are asking questions and then you make assertions. You claim that you are just trying to learn and then make claims that you can't support. I have examined evidence from cosmology, astrophysics, nuclear physics, biogeography, and geology. None of it supports an earth less than 10,000 years old. I have also examined evidence of biogeography, ecology, genetics, population genetics, and biology from a professional viewpoint. I have found no evidence that supports a young earth. In fact, all evidence points to an old universe (13.7 billion years) and an old earth (4.55 billion years). All of it points to a common ancestry of life (the same genetic elements using the same genetic code, from one celled organisms to humans).\n \n That wasn't a question - it was an assertion. How are you going to learn if you aren't going to ask questions? I didn't see a single question in this post.\n \n First of all, the theory of evolution isn't a \"worldview.\" Such assertions are usually made by those who don't understand science, much less evolution. Your religious \"worldview\" prevents you from giving reasonable consideration to science. You know the answers before you look at any evidence. Your answers are based on the 4000 year old mythology of nomadic herdsmen. Any evidence that doesn't fit your answer is rejected.\n \n So now I have two challenges:\n \n 1) present the evidence that is unexplainable by the scientific theory of evolution. Remember that evolution is a theory of biology - not cosmology, geology, or any other science.\n \n 2) present the evidence that supports the creationist \"worldview.\" I consider this to be the most important question, since creationism is essentially composed of arguments against various fields of science (mentioned above) that show creationism to be wrong. Please show the evidence FOR creationism. Please show why creationism (it's magic) is a better explanation than natural causes.\n \n So you don't ask questions, don't want to learn, don't understand science, can't spell, and are lazy to boot. Here's some. You must understand that this is only a part of the evidence presented from a very constrained viewpoint. This deals only with the evidence for common descent.\n \n Please answer each of the points presented and then we can move on to geology, cosmology, astronomy, and nuclear physics.\n \n 29+ Evidences for Macroevolution: The Scientific Case for Common Descent\n \n I suspect that you lack the integrity to actually read it and make any attempt to verify any of the information. You know the answer before any question is asked. That's why you don't ask questions.\n\n \n I totally agree that the evolution theory is not a worldview, however i do believe that the evolutionist does have a worldview, and this is what i am trieing to stress.\n Here is a question that i had asked many of times before i invited the LORD into my heart, and that is, \"how is it that ancient people with their ancient abilities were able to move a perfectly cut stone that was so heavy that not even todays technological machinery could move it\".\n \n See an evolutionist would have the worldview that the further we go back in time, mankind becomes less efficient in their abilities.\n \n This is one of the thousands of questions i have asked in the past and failed to get any answers too, and from a evolutionist worldview, and i would never get. How ever these questions seems to fit a creationists worldview so much more comfortably. \n \n See the problem is not that i havent asked any questions, the problem is that i could never get any logical answers..\n See even with the evolution theory itself, with all the scientific lingo and fluff put to the side, what they are saying is that my ancestors was a (please excuse the unscientific term) blob of goo under the ocean or something like that, and that the very excistence it came to be in, was a result off something explodeing out of nothing....", 
   {}, 
   77711, 
   null, 
   1100700420.0
  ], 
  [
   77723, 
   null, 
   "Clive14", 
   "Here is a question that i had asked many of times before i invited the LORD into my heart, and that is, \"how is it that ancient people with their ancient abilities were able to move a perfectly cut stone that was so heavy that not even todays technological machinery could move it\".\nYour question makes no sense. It is like asking \"How did people have faster global communications using rowing boats than they do today with all our technology?\" There are no \"perfectly cut stone[s] that [are] so heavy that not even todays technological machinery could move [them]\". There are no ancient buildings that we could not build today with a hundredth of the man power in a hundredth of the time it took \"ancient people\" to achieve.\n \n \nSee an evolutionist would have the worldview that the further we go back in time, mankind becomes less efficient in their abilities.\nThis is untrue and is another example of a strawman (you did read my personal message to you explaining strawmen, didn't you?). Evolution is directionless, it isn't a constant march from primitive to advanced.\n \n \nThis is one of the thousands of questions i have asked in the past and failed to get any answers too, and from a evolutionist worldview, and i would never get. How ever these questions seems to fit a creationists worldview so much more comfortably. \n \n See the problem is not that i havent asked any questions, the problem is that i could never get any logical answers..\nNo, you are mistaken. The problem is you ask illogical questions. Ask logical questions and you will start getting the answers your require.\n \n \nSee even with the evolution theory itself, with all the scientific lingo and fluff put to the side, what they are saying is that my ancestors was a (please excuse the unscientific term) blob of goo under the ocean or something like that, and that the very excistence it came to be in, was a result off something explodeing out of nothing....\nYet another strawman. Evolution theory says no such thing. Sadly despite the best efforts of a number of us here to teach you even the most rudamentry concepts of evolution have come to naught as you are still making the same false claim about the topic as you did when you arrived here.", 
   {}, 
   77718, 
   null, 
   1100704500.0
  ], 
  [
   77826, 
   null, 
   "stormboy", 
   "Your question makes no sense. It is like asking \"How did people have faster global communications using rowing boats than they do today with all our technology?\" There are no \"perfectly cut stone[s] that [are] so heavy that not even todays technological machinery could move [them]\". There are no ancient buildings that we could not build today with a hundredth of the man power in a hundredth of the time it took \"ancient people\" to achieve.\n \n This is untrue and is another example of a strawman (you did read my personal message to you explaining strawmen, didn't you?). Evolution is directionless, it isn't a constant march from primitive to advanced.\n \n No, you are mistaken. The problem is you ask illogical questions. Ask logical questions and you will start getting the answers your require.\n \n Yet another strawman. Evolution theory says no such thing. Sadly despite the best efforts of a number of us here to teach you even the most rudamentry concepts of evolution have come to naught as you are still making the same false claim about the topic as you did when you arrived here.\n\n \n Are you absalutely shore that evolution is directionless?", 
   {}, 
   77723, 
   null, 
   1100786220.0
  ], 
  [
   77829, 
   null, 
   "Clive14", 
   "Are you absalutely shore that evolution is directionless?\nI am as confident that evolution is directionless as I am confident that the universe exists or I exist. I'm not \"absalutely shore\" in any of these, but they are all so unlikely to not be true that it is pointless to consider them otherwise.", 
   {}, 
   77826, 
   null, 
   1100789760.0
  ], 
  [
   77952, 
   null, 
   "daewoo", 
   "Right. And I have degrees in biology but am not a biologist. Exactly what is a physicist? Is it that you weren't able to find a job because of your poor grades and are now sweeping floors or what?\n\n \n I would generally a physucust to be somebody working in the field of physics. I am not. I worked for a year at JPL just out of college and found I didn't like it, not even a little bit, so I went in another direction. \n \n Why did you decide to go into teaching with a biology degree? Pre med and couldn't make the cut? Wanted to do field work and weren't smart enough?\n \n \nNonsense. If you are not a creationist then why are you presenting creationist arguments?\n\n \n I am not. I was merely pointing out a rather glaring error in what you are considering absolutly proven.\n \n \nAs I said, you are a fake (no, not a blasphemer - a fake). You don't have a degree in physics and you are a creationist. Your knowledge of science is non-existant and you argue from a creationist position. Why pretend to be what you are not?\n\n \n I realise you are only getting snippy because you are used to showing up and flashing \"I am a teacher\" and people back down. Sorry, I am not PC enough to pretend any kind of admiration or awe for teachers. From the fact you are a teacher we can automatically infer that you are certianly not at the top of your field, and we can rather safely assume that your knowledge is behind (this is a real problem with teachers, they get out of school and don't bother to stay current in their field). \n \n While I admit that we don't pay teachers enough to expect much out of them (and judging from where the US ranks educationally in the world, we are not getting much out of them), but it would seem that ensuring that they understand simple things, like the meaning of \"insurmountable evidence\"", 
   {}, 
   77712, 
   null, 
   1100830020.0
  ], 
  [
   77963, 
   null, 
   "pandion", 
   "I've never bee able to figure out why so many of you YECs pretend to have degrees that you don't have. Carl Baugh, Don Patton, Kent Hovind and you.\n \n Another thing you have in common is how you resort to ad hominem when you figure out that you have made a mistake and don't have the ganas to admit it.", 
   {}, 
   77952, 
   null, 
   1100833200.0
  ], 
  [
   77982, 
   null, 
   "stormboy", 
   "I am as confident that evolution is directionless as I am confident that the universe exists or I exist. I'm not \"absalutely shore\" in any of these, but they are all so unlikely to not be true that it is pointless to consider them otherwise.\n\n Your not absalutely shore that you exist????. This is where it all becomes to be a tad trippy!", 
   {}, 
   77829, 
   null, 
   1100840340.0
  ], 
  [
   78007, 
   null, 
   "Clive14", 
   "Your not absalutely shore that you exist????. This is where it all becomes to be a tad trippy!\nDoes it? Can't say I've noticed. I don't wander through life worrying about it: I assume I exist because the evidence points to that being the case. I assume the universe exists because the evidence points to that being the case. I assume evolution is fact because the evidence points to that being the case. I assume no god exists because the evidence points to that being the case. I appreciate that this is hard for you to grasp, but I live my life free of faith. I make assumptions, but I accept that is what they are and that they could be wrong.", 
   {}, 
   77982, 
   null, 
   1100863680.0
  ], 
  [
   78008, 
   null, 
   "Clive14", 
   "I've never bee able to figure out why so many of you YECs pretend to have degrees that you don't have. Carl Baugh, Don Patton, Kent Hovind and you.\n \n Another thing you have in common is how you resort to ad hominem when you figure out that you have made a mistake and don't have the ganas to admit it.\n\n daewoo has admited on another forum on this board to being a troll and deliberately baiting you. I do not think he is a YEC supporter: he is just presenting unscientific claims from the point of view of a claimed scientist to wind you up.\n \n Don't feed trolls. Ignore them.\n \n Edited to add:\n The post in question is http://4forums.com/political/showpost.php?p=77569&postcount=4", 
   {}, 
   77963, 
   null, 
   1100863860.0
  ], 
  [
   78044, 
   null, 
   "jim's trucking", 
   "There's an article in the Novemember National Geographic that describes three separate studies of evolution in action. One concerned finches, another flies and the last viruses.\n \n As we develop pesticides, pests develop immunities.\n \n As the size of the food seed increaces, so does the strength of the beak.\n \n Evolution is a FACT OF LIFE!!!!!", 
   {
    "post_info": {
     "post_title": "Evolution in our lifetime!"
    }
   }, 
   78008, 
   null, 
   1100887140.0
  ], 
  [
   78170, 
   null, 
   "Cthulhu", 
   "I like daewoo, he has his outlook right about where i put it", 
   {}, 
   78044, 
   null, 
   1100927880.0
  ], 
  [
   78171, 
   null, 
   "Gator", 
   "As Newton stated above he believed the Bible as the Inspired Word of God, and hence, believed every part of it including the part about Jesus Christ being God's Son and coming down to Earth to die on the cross for our sins and rose again so that we may spend eternity in Heaven with Him.\nNonsense. Your misunderstanding of Newton derives from mental speculation, not even from your slanted source, and most definitely not from Newton's own writings.\n \n Even your source-Ann Lamont-dares not claim that Newton believed in the Trinity. The liberty you take in asserting such claim is entirely without foundation. If you had sincerely desired to know the mind of Newton in regard to his view of the Christian Trinity, then surely you would have let Newton speak for himself.\n \n Instead, you seem content merely to quote from Ann Lamont's essay published by the Creation Science Foundation, even as you dismiss the writings of Newton himself, whose treatise \"An Historical Account of Two Notable Corruptions of Scripture\" makes clear his contempt for Trinitarian theology.\n \n In the course of history are many great minds that believed in God and were inspired by the Bible, yet did not subscribe to dogmatic Christian theology. In that regard, Newton is akin to Thomas Jefferson in that both men harbored a belief in God the Creator, yet rejected outright the doctrine of the Trinity. Newton's rejection, however, had to be done privately and secretly so as to avoid losing his Cambridge professorship and perhaps even being prosecuted and hanged, whereas Jefferson a century later could openly take his scissors and do a cut-and-paste job on the biblical text to compile what is commonly known today as The Jefferson Bible, in which all references to the deity of Jesus are deleted.", 
   {
    "unicode_changes_made": true
   }, 
   77282, 
   null, 
   1100928540.0
  ], 
  [
   78337, 
   null, 
   "Mach", 
   " By declaring theories for which we do not have insurmountable evidence in support of as absolute truth, you run the very real risk of overlooking contrary evidence, merely because you have already formed your own conclusions or adopted somebody elses.\n\n \n Evolution is a fact, and the theory of how this mechanism resulted in all life on earth is supported, with overwhelming evidence. In fact, there is not sufficient evidence to give you any reason not to believe evolution as the mechanism by which all life came about on earth.\n \n \n Only a fool or a teacher would be willing to put absolute faith in a theory for which we do not have insurmountable evidence.\n\n \n What does faith have to do with the fact of evolution? Nothing.\n Why would faith depend on evidence? It wouldn't.\n You claim the evidence is not \"surmountable\", yet you have given us evidence to the contrary that \"surmounts\" the current body of knowledge that supports evolution? No. \n Can you? No.\n Will you? You cannot. \n Has anyone else? no.\n \n Yet you belive pandion is teaching nonense and you're the one holding the reasonable position? Based on what...based on nothing.\n \n Perhaps aliens did start life on earth, BUT TO BELIEVE IT WITHOUT EVIDENCE IS INSANITY. Likewise, TO DENY THE FACT OF EVOLUTION based on NO EVIDENCE, is insanity. Call it what you will, skepticism, doubt, insanity, it doesn't really matter, because your opinion is based on...of all things, faith.\n \n Perhaps pigs CAN fly. Perhaps we ARE just brains in a vat. To believe these however, based on no evidence, and to deny the evidence to the contrary is insanity.\n \n All reasoned beliefs can be falsified, including your knowledge that you have two legs. Are you not going to get up this morning and walk? Are you paralyzed by your doubt? Of course not. Get over the \"everything is uncertain\" concept, you don't believe it anyway :)\n \n -Mach", 
   {}, 
   77683, 
   null, 
   1101084300.0
  ], 
  [
   78369, 
   null, 
   "pandion", 
   "Only a fool or a teacher would be willing to put absolute faith in a theory for which we do not have insurmountable evidence.\n\n Isn't it funny how these fundamentalist YECs can't make up their minds what position they wish to take? Here he asserts that someone else has put absolute faith in a theory when it was he that did so by claiming that theories were proven in his field of science. So I guess we know what he is since he isn't a teacher. He was arguing for absolute faith in theories and against the position that science is tentative. Don't you wish these YECs would pick a horse and ride it.", 
   {}, 
   78337, 
   null, 
   1101105420.0
  ], 
  [
   78397, 
   null, 
   "Perry5", 
   "As of today, 11-08-04, the Cobb County (GA) school system is being tested in court about the validity of their warning sticker pasted in every Evolution textbook. The sticker basically says that evolution is a theory and should be approached with an open mind.\n \n The evolutionists are saying this is an endorsement of creationism, therefore is a religious doctrine being taught in school...against the law.\n \n This is the same school system whose leader recently tried to have the word \"evolution\" deleted from the school curriculum.\n \n Is the Bible Belt getting too tight?\n\n \n --------------------------------------------------------------------------\n (The Bible,)\n \n A book of parables and mythology written by men for men.", 
   {}, 
   76230, 
   null, 
   1101128400.0
  ], 
  [
   78879, 
   null, 
   "zachvac", 
   "I would generally a physucust to be somebody working in the field of physics. I am not. I worked for a year at JPL just out of college and found I didn't like it, not even a little bit, so I went in another direction. \n \n\n I don't know what JPL is but if it had something to do with physics and you really majored in it I'm assuming you had some interest in it. If JPL wasn't right you easily could have found another job with physics (including teaching).\n \n \n\n Why did you decide to go into teaching with a biology degree? Pre med and couldn't make the cut? Wanted to do field work and weren't smart enough?\n \n\n I don't know this person but people may teach for any of the reasons following:\n 1. They like to inspire children to love the same thing they do\n 2. They want to make sure there are other children who can grow up and pass on the knowledge\n 3. they just enjoy being around children\n \n My physics teacher was really amazing. He really helped us understand the topic in a way that our other physics teacher (the regular one is 75 and had surgery so we had the other for a while) could never do. A regular physicist may know how to apply knowledge from physics but teachers need to help people understand it and you know what they always say \"the best way to make sure you know something is to teach someone else\". This teacher was the first to admit he didn't know and would look it up after school and discuss it next class. Maybe most teachers just love their subject so much that they don't want to go into that field scientifically (for much the same reason many athletes don't want to make their hobby their job despite the money they would get).\n \n \n \n\n I realise you are only getting snippy because you are used to showing up and flashing \"I am a teacher\" and people back down. Sorry, I am not PC enough to pretend any kind of admiration or awe for teachers. From the fact you are a teacher we can automatically infer that you are certianly not at the top of your field, and we can rather safely assume that your knowledge is behind (this is a real problem with teachers, they get out of school and don't bother to stay current in their field). \n \n\n And I'm sure you are used to showing up and flashing \"I have a physics degree and we are held to a higher standard\" and others backing down. You don't think teachers learn as they teach to students? A good teacher does.\n \n \n\n While I admit that we don't pay teachers enough to expect much out of them (and judging from where the US ranks educationally in the world, we are not getting much out of them), but it would seem that ensuring that they understand simple things, like the meaning of \"insurmountable evidence\"\n\n I think that the way we pay teachers now ensures that they all love to teach or else they would do something else. While I also think they should be payed more, there is a good thing with the fact that unless you love teaching, you'd be crazy to become a teacher. I really think the rank in the world is a problem with the system, not the teachers. Focusing on passing tests instead of learning. But that's for the education thread.", 
   {}, 
   77952, 
   null, 
   1101270600.0
  ], 
  [
   86653, 
   null, 
   "Clive14", 
   "Update on the stickers in books in georgia story:\n \n http://www.aclu.org/ReligiousLiberty/ReligiousLiberty.cfm?ID=17052&c=139\n \n The YEC brigade loses again. Hurrah! :D", 
   {}, 
   78879, 
   null, 
   1105712340.0
  ], 
  [
   86667, 
   null, 
   "jim's trucking", 
   "Update on the stickers in books in georgia story:\n \n http://www.aclu.org/ReligiousLiberty/ReligiousLiberty.cfm?ID=17052&c=139\n \n The YEC brigade loses again. Hurrah! :D\nThat has been superseded. Here's another update: The court has ruled that the sticker is unconstitutional. \n \n I guess that ends this saga for a while.", 
   {}, 
   86653, 
   null, 
   1105718760.0
  ], 
  [
   86672, 
   null, 
   "Clive14", 
   "That has been superseded. Here's another update: The court has ruled that the sticker is unconstitutional. \n \n I guess that ends this saga for a while.\nOops I thought the article I quoted said that. Guess I should read the links I post more carefully \n emoticon_emb", 
   {}, 
   86667, 
   null, 
   1105719600.0
  ], 
  [
   86673, 
   null, 
   "jim's trucking", 
   "Oops I thought the article I quoted said that. Guess I should read the links I post more carefully \n emoticon_emb\nActually, the artcle was from November 12, 2004 just after the closing of arguments. The court took the next month or so to make up their minds.\n \n It should have taken only minutes on this one.", 
   {}, 
   86672, 
   null, 
   1105720320.0
  ], 
  [
   86675, 
   null, 
   "billsco", 
   "Can we really think this might be the end of this controversy? I smell an appeal.", 
   {}, 
   86673, 
   null, 
   1105720920.0
  ], 
  [
   86689, 
   null, 
   "jim's trucking", 
   "Can we really think this might be the end of this controversy? I smell an appeal.\nThat's why I said ,\"...for a while.\"\n \n I certainly expect a rerun before the summer is out.", 
   {}, 
   86675, 
   null, 
   1105723020.0
  ], 
  [
   86980, 
   null, 
   "Tigerlilly", 
   "Bout time they got rid of those lame-assed stickers. People need to stop whinning bout their petty religions not being taken seriously as academic truth. Religio-activists will only stop with the complete degredation of the modern science and logic curriculae. \n \n They never wanted education--they want christian indoctrination.", 
   {}, 
   86689, 
   null, 
   1105874460.0
  ], 
  [
   87253, 
   null, 
   "jim's trucking", 
   "In it's expected snobbery fashion, the Cobb County Board of Education has voted to appeal the decision, against the apparent objections of many constituents.\n \n What a waste of money. emoticon_rolleyes", 
   {}, 
   86980, 
   null, 
   1106065980.0
  ], 
  [
   90049, 
   null, 
   "Choscura", 
   "As of today, 11-08-04, the Cobb County (GA) school system is being tested in court about the validity of their warning sticker pasted in every Evolution textbook. The sticker basically says that evolution is a theory and should be approached with an open mind.\n \n The evolutionists are saying this is an endorsement of creationism, therefore is a religious doctrine being taught in school...against the law.\n \n This is the same school system whose leader recently tried to have the word \"evolution\" deleted from the school curriculum.\n \n Is the Bible Belt getting too tight?\n\n \n how do these *******s keep getting their jobs?", 
   {}, 
   76230, 
   null, 
   1107747300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A warning sticker in textbooks!", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3679-warning-sticker-textbooks.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 3679, 
  "discussion_files": [
   [
    "22426.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3679-warning-sticker-textbooks-print.html"
   ], 
   [
    "22427.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3679-warning-sticker-textbooks-9-print.html"
   ], 
   [
    "22428.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3679-warning-sticker-textbooks-7-print.html"
   ], 
   [
    "22429.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3679-warning-sticker-textbooks-5-print.html"
   ], 
   [
    "22430.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3679-warning-sticker-textbooks-4-print.html"
   ], 
   [
    "22431.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3679-warning-sticker-textbooks-6-print.html"
   ], 
   [
    "22432.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3679-warning-sticker-textbooks-8-print.html"
   ], 
   [
    "22433.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3679-warning-sticker-textbooks-3-print.html"
   ], 
   [
    "22434.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3679-warning-sticker-textbooks-2-print.html"
   ]
  ], 
  "identifier": 3679
 }
]