[
 [
  [
   4450, 
   null, 
   "kelvin90701", 
   "We all know the Vietnam War was unjust. We have the certainty of time to be able to look back and judge. We don't have the benefit of history today. When the Vietnam War started Americans went along with the leadership and went to war. Once the truth started to come to light violent protest happend everywhere. The leadership that got us into a war got thier justice, although I would argue not enough of it. You have the right to protest the war for the arguement of peace at any cost. You can make that arguement, but you would be wrong. Being wrong is allowed, it is part of the American way. Going to visit the enemy durring a time of war is treason.\n \n Peace protesters should give our leadership the benefit of doubt and trust them. If we later find out this war is unjust and they lied to us, then we go and hang them. We have 12 years of experience of dealing with Saddam after the Gulf War. From all that experience do you think he will disarm if we just walk away. Iraq gave up the right to deny inspections in the peace treaty to end the Gulf War, we agreed to stop shooting. They have broken the peace treaty, we have the right to start shooting.\n \n We are at war right now. If you don't think so ask the pilots who patrol the no fly zone.", 
   {
    "post_info": {
     "post_title": "Treason, Trust, the Government, and Iraq."
    }
   }, 
   null, 
   null, 
   1047446040.0
  ], 
  [
   4469, 
   null, 
   "Stormin Norman", 
   "Did you see that pile of garbage called The Pentagon Papers on the FX Network? Talk about glorifying a treasonous bastard. The guy should have been hanged, but Nixon's burglaries compromised the integrity of the Justice Department's case against him. The whole mess was disgraceful, especially how this movie made him out to be a hero. The movie was a real stinker, in my opinion.", 
   {}, 
   4450, 
   null, 
   1047474180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Treason, Trust, the Government, and Iraq.", 
  "url": "http://www.4forums.com/political/current-events-debates/369-treason-trust-government-iraq.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 369, 
  "discussion_files": [
   [
    "17030.html", 
    "http://www.4forums.com/political/current-events-debates/369-treason-trust-government-iraq-print.html"
   ]
  ], 
  "identifier": 369
 }
]