[
 [
  [
   76459, 
   null, 
   "ChrisAtUCF", 
   "Can you imagine what the U.S. population would be without abortion? Who will take care of all these children when the potential parent cannot?\n \n Abortion Statistics - U.S.\n [*]Approximately 1,370,000 abortions occur annually in the U.S. according to the Alan Guttmacher Institute. [*]In 2001, 1.31 million abortions took place.[*]88% of abortions occur during the first 6 to 12 weeks of pregnancy.[*]60% of abortions are performed on women who already have one or more children.[*]47% of abortions are performed on women who have already had one or more abortions.[*]43% of women will have had at least one abortion by the time they are 45 years old.\n **information obtained from http://womensissues.about.com", 
   {
    "post_info": {
     "post_title": "Population Control?"
    }
   }, 
   null, 
   null, 
   1099993500.0
  ], 
  [
   76522, 
   null, 
   "thebootfitter", 
   "Can you imagine what the U.S. population would be without abortion? Who will take care of all these children when the potential parent cannot?\n\n I have brought up the following item for discussion before, but it seems relevant here, too.\n \n Assuming abortion is justified as one means of acheiving the goal of population control, is it outrageous to consider 'removing' non-productive members of our society as another means of achieving the same goal?", 
   {}, 
   76459, 
   null, 
   1100025900.0
  ], 
  [
   76535, 
   null, 
   "sinjin", 
   "I have brought up the following item for discussion before, but it seems relevant here, too.\n \n Assuming abortion is justified as one means of acheiving the goal of population control, is it outrageous to consider 'removing' non-productive members of our society as another means of achieving the same goal?\n\n \n Non-productive how? Criminals? How about bad artists? Stock brokers? Clergy? Philosophers? YGMD.", 
   {}, 
   76522, 
   null, 
   1100029200.0
  ], 
  [
   76554, 
   null, 
   "thebootfitter", 
   "Non-productive how? Criminals? How about bad artists? Stock brokers? Clergy? Philosophers? YGMD.\n\n By using whatever definition law-makers place on the term \"non-productive.\"", 
   {}, 
   76535, 
   null, 
   1100031960.0
  ], 
  [
   76558, 
   null, 
   "sinjin", 
   "By using whatever definition law-makers place on the term \"non-productive.\"\n\n \n I would guess non-productive \"law-makers\" would be scarce.", 
   {}, 
   76554, 
   null, 
   1100032500.0
  ], 
  [
   76637, 
   null, 
   "valet_dave", 
   "Can you imagine what the U.S. population would be without abortion? Who will take care of all these children when the potential parent cannot?\n\n It's a consideration, but I doubt we should be promoting this under the \"population control\" banner.\n \n All these figures are really telling us is that society needs further education when it comes to contraception. I don't see how anyone could advocate an invasive surgical procedure as anything else but a last resort method.", 
   {}, 
   76459, 
   null, 
   1100048160.0
  ], 
  [
   76659, 
   null, 
   "Robotbeat", 
   "[...]Assuming abortion is justified as one means of acheiving the goal of population control, is it outrageous to consider 'removing' non-productive members of our society as another means of achieving the same goal?\n\n To a small extent, this happens already. Oftentimes (21.3%, U.S.), a woman decides to have and abortion because she cannot afford a baby (from here, source). This is in effect removing members of society who are non-productive (babies produce virtually nothing useful until they mature by about 10 years). And poor families are less productive, since they are often on welfare.\n \n Granted, this is a rather harsh perspective, but the effect is the same: In the U.S., there are about (21.3% X 1.31 million) 280,000 less people every year who would have likely grown up in a poor home (assuming the child wouldn't have been adopted). Forced contraception/abortion is seen as an effective way of solving poverty in some parts of the world...", 
   {}, 
   76522, 
   null, 
   1100058420.0
  ], 
  [
   96694, 
   null, 
   "Xbig_bootieX", 
   "Can you imagine what the U.S. population would be without abortion? Who will take care of all these children when the potential parent cannot?\n\n \n Actually, there's a birth every 8 seconds, and a death every 11 seconds, which means the population of the earth grows less than 1% each year...so, even with those aborted babies, the world would NOT be overpopulated.", 
   {}, 
   76459, 
   null, 
   1110445200.0
  ], 
  [
   96713, 
   null, 
   "bobbob", 
   "Can you imagine what the U.S. population would be without abortion? Who will take care of all these children when the potential parent cannot?\n \n Abortion Statistics - U.S.\n [*]Approximately 1,370,000 abortions occur annually in the U.S. according to the Alan Guttmacher Institute. [*]In 2001, 1.31 million abortions took place.[*]88% of abortions occur during the first 6 to 12 weeks of pregnancy.[*]60% of abortions are performed on women who already have one or more children.[*]47% of abortions are performed on women who have already had one or more abortions.[*]43% of women will have had at least one abortion by the time they are 45 years old.\n **information obtained from http://womensissues.about.com\n\n Chastity rather than promiscuity.", 
   {}, 
   76459, 
   null, 
   1110468600.0
  ], 
  [
   96714, 
   null, 
   "bobbob", 
   "babies produce virtually nothing useful until they mature by about 10 years!\n What about the value of a person. You were 10 and under once... \n You see mouths to feed, I see people to be respected. In a lot of places/countires their decreasing birth rate is actually causing problems (causing a welfare state) and in very polpuluss countries the workers etc. are actually quite valuable to society. A big population can be a commuodity. I don't believe we should just all start breading like rabbits. Thats a weird and false view of what real \"Pro-Lifers\" actually believe. \n We believe in the Sanctity of each life, from the moment of fertilization until natural death.", 
   {}, 
   96713, 
   null, 
   1110469020.0
  ], 
  [
   96717, 
   null, 
   "bobbob", 
   "I have brought up the following item for discussion before, but it seems relevant here, too.\n \n Assuming abortion is justified as one means of acheiving the goal of population control, is it outrageous to consider 'removing' non-productive members of our society as another means of achieving the same goal?\n\n \n By removing you mean Killing the innocent of course, which is different to imprisonment of the criminal.", 
   {}, 
   76522, 
   null, 
   1110469260.0
  ], 
  [
   96743, 
   null, 
   "Eddie", 
   "@ bobbob\n \n How is decreasing birth rates \"causing wellfare states\"? emoticon_confused", 
   {}, 
   96717, 
   null, 
   1110472080.0
  ], 
  [
   96788, 
   null, 
   "Master_Shake", 
   "Can you imagine what the U.S. population would be without abortion? Who will take care of all these children when the potential parent cannot?\n\n \n The idea of abortion as population control is absurd, especially forced abortions as someone mentioned a few posts ago. Anyone who has read a biology book knows the world has methods of population control on its own, we don't need to be doing stuff like that ourselves.\n \n \n[*]43% of women will have had at least one abortion by the time they are 45 years old.[/list]\n\n \n This stat sounds more than a bit inflated. Seeing as it comes from a website called \"women's issues\" it is probably not all that credible.", 
   {}, 
   76459, 
   null, 
   1110480240.0
  ], 
  [
   96802, 
   null, 
   "thebootfitter", 
   "Actually, there's a birth every 8 seconds, and a death every 11 seconds, which means the population of the earth grows less than 1% each year...so, even with those aborted babies, the world would NOT be overpopulated.\n\n I think you need to double-check the validity of your sources...\n \n By your stats, there are about 3.9 million births in the world per year and about 2.9 million deaths... which is roughly a net increase each year of one million people. Given that the current human population of the earth is over six billion, your stats give a net growth of less than two-hundredths of one percent per year. (Which would mean that it would take nearly 1,000 years for the world population to reach 7 billion.)\n \n To arrive at an annual population growth of around 1%, there would currently have to be a net increase of at least 60 million per year (assuming a conservative worldwide population of 6.0 billion).", 
   {}, 
   96694, 
   null, 
   1110484020.0
  ], 
  [
   96807, 
   null, 
   "Tastyfish", 
   "But the worlds way of dealing with overpopulation is mass starvation, society appears to have a better way where educated and better off couples tend to have less children. However contraception is one of the factors that causes this trend.", 
   {}, 
   96802, 
   null, 
   1110484800.0
  ], 
  [
   96978, 
   null, 
   "Harbinger", 
   "Without abortions, not only would we have a population explosion, we would see more trashcan babies turning up in landfills and women dying from attempted self abortions or from untrained back street abortionists.\n \n Sure, let's let the conservatives have there way so they can see just how horrible reality conflicts with their utopic fantasies.", 
   {}, 
   76459, 
   null, 
   1110533700.0
  ], 
  [
   97545, 
   null, 
   "Steeeeve", 
   "Yeah Harbinger, good point...could you imagine if Hitler didnt kill those Jews? That would be so bad!! We would have so many people here. Genocide is awesome. Why stop with just babies? Why can't get rid of dumb people (IQ below 65) or maybe people that are too old...I think we could do more with population control.\n \n \n Yeah, the population control arguement is messed up on so many levels.", 
   {}, 
   96978, 
   null, 
   1110781260.0
  ], 
  [
   97548, 
   null, 
   "Duo_Maxwell", 
   "Actually, there's a birth every 8 seconds, and a death every 11 seconds, which means the population of the earth grows less than 1% each year...so, even with those aborted babies, the world would NOT be overpopulated.\n\n \n Please read carefully. He was talking about the US population, not the world. \n \n The initial post was NOT detailing population control but bringing up the issue of resource allocation and parenting.", 
   {}, 
   96694, 
   null, 
   1110781560.0
  ], 
  [
   101531, 
   null, 
   "xeiah", 
   "The idea of abortion as population control is absurd, especially forced abortions as someone mentioned a few posts ago. Anyone who has read a biology book knows the world has methods of population control on its own, we don't need to be doing stuff like that ourselves.\n \n \n \n This stat sounds more than a bit inflated. Seeing as it comes from a website called \"women's issues\" it is probably not all that credible.\n\n \n Actually the Alan Guttmacher Institute is quite reputible. They have their own web site. Check it out. Also, why would a site called \"womens issuses\" be in valid?", 
   {}, 
   96788, 
   null, 
   1111820340.0
  ], 
  [
   101533, 
   null, 
   "xeiah", 
   "The idea of abortion as population control is absurd, especially forced abortions as someone mentioned a few posts ago. Anyone who has read a biology book knows the world has methods of population control on its own, we don't need to be doing stuff like that ourselves.\n \n \n \n This stat sounds more than a bit inflated. Seeing as it comes from a website called \"women's issues\" it is probably not all that credible.\n\n \n You question others sources and credibility yet you parade around under the name of a giant cartoon Shake?", 
   {}, 
   96788, 
   null, 
   1111820520.0
  ], 
  [
   101537, 
   null, 
   "Steeeeve", 
   "so why is population control a good arguement for abortion? Why don't we kill old people too...", 
   {}, 
   101533, 
   null, 
   1111822020.0
  ], 
  [
   101547, 
   null, 
   "jitobear", 
   "so why is population control a good arguement for abortion? Why don't we kill old people too...\n\n \n I am with you here. It isn't.", 
   {}, 
   101537, 
   null, 
   1111827480.0
  ], 
  [
   101548, 
   null, 
   "Cone", 
   "Can you imagine what the U.S. population would be without abortion? Who will take care of all these children when the potential parent cannot?\n \n Abortion Statistics - U.S.\n [*]Approximately 1,370,000 abortions occur annually in the U.S. according to the Alan Guttmacher Institute. [*]In 2001, 1.31 million abortions took place.\n\n I assume here that over population is being claimed as a justification for abortion. If this is not the case, then please forgive me. \n \n To make this claim, at least four things must be established:\n [*]That 42 million more citizens would present overpopulation in the United States today.[*]That aforesaid overpopulation would produce a negative effect[*]If so, negative enough to proactively exterminate a particular section of the population.[*]That abortion should be a first resort option as opposed to a last resort option. For instance, why not kill the elderly whose contribution to society has already been fulfilled. Then we could let the 1.3 million aborted per year live and further society by their own contribution.None of the above has been established. Therefore, the population control claim lacks sufficient reason to be a justification for abortion.", 
   {
    "post_info": {
     "post_title": "Claim is a bit lacking"
    }
   }, 
   76459, 
   null, 
   1111827600.0
  ], 
  [
   101624, 
   null, 
   "Steen", 
   "Therefore, the population control claim lacks sufficient reason to be a justification for abortion.\nBut then, the justification for abortion rests on the right to control one's own body, not population control.", 
   {}, 
   101548, 
   null, 
   1111863180.0
  ], 
  [
   101630, 
   null, 
   "Cone", 
   "But then, the justification for abortion rests on the right to control one's own body, not population control.\n\n I've seen that argued throughout these posts, but I don't think I've seen the argument from start to finish. As such, I have not been absolutely convinced of this. Do you mind helping me out a little by drawing this argument out in a little more detail?", 
   {
    "post_info": {
     "post_title": "Not Convinced Yet"
    }
   }, 
   101624, 
   null, 
   1111863660.0
  ], 
  [
   101632, 
   null, 
   "Steeeeve", 
   "...but this thread was about population control", 
   {}, 
   101624, 
   null, 
   1111863720.0
  ], 
  [
   101642, 
   null, 
   "Steen", 
   "I've seen that argued throughout these posts, but I don't think I've seen the argument from start to finish. As such, I have not been absolutely convinced of this. Do you mind helping me out a little by drawing this argument out in a little more detail?\nSure.\n \n The woman is a person, and individual, sentient human being. She has the same right to control her bodily resources as any other person does. As such, you can no more force her, against her will, to provide bodily resources to an embryo or fetus, than you can yourself be forced to give of your bodily resources against your will.\n \n Even if somebody is bleeding to death, and your blood can save their life, they still don't have the right to force you to safely give them of your blood.\n \n Each person have that right to control their bodily resources. If you want to force the woman to remain pregnant, you are forcing her to give of her bodily resources against her will. When you don't insist that everybody else be subject to such requirements, then the argument is hypocritical and misogynistic.\n \n And, of course the US Supreme Court agrees with this, thus ruling that per the 14th Amendment of the US Constitution, the woman has the right to privacy, to control her onw body.", 
   {}, 
   101630, 
   null, 
   1111864500.0
  ], 
  [
   101653, 
   null, 
   "Steeeeve", 
   "I believe we address the 14th amendment already...but just for the heck of it...show me in the 14th amendment where it says WOMEN has the right to control their own body?\n \n 1. All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\n \n 2. Representatives shall be apportioned among the several States according to their respective numbers, counting the whole number of persons in each State, excluding Indians not taxed. But when the right to vote at any election for the choice of electors for President and Vice-President of the United States, Representatives in Congress, the Executive and Judicial officers of a State, or the members of the Legislature thereof, is denied to any of the male inhabitants of such State, being twenty-one years of age, and citizens of the United States, or in any way abridged, except for participation in rebellion, or other crime, the basis of representation therein shall be reduced in the proportion which the number of such male citizens shall bear to the whole number of male citizens twenty-one years of age in such State.\n \n 3. No person shall be a Senator or Representative in Congress, or elector of President and Vice-President, or hold any office, civil or military, under the United States, or under any State, who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any State legislature, or as an executive or judicial officer of any State, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof. But Congress may by a vote of two-thirds of each House, remove such disability.\n \n 4. The validity of the public debt of the United States, authorized by law, including debts incurred for payment of pensions and bounties for services in suppressing insurrection or rebellion, shall not be questioned. But neither the United States nor any State shall assume or pay any debt or obligation incurred in aid of insurrection or rebellion against the United States, or any claim for the loss or emancipation of any slave; but all such debts, obligations and claims shall be held illegal and void.\n \n 5. The Congress shall have power to enforce, by appropriate legislation, the provisions of this article.\n \n \n I've even posted it for you :)", 
   {}, 
   101642, 
   null, 
   1111865040.0
  ], 
  [
   101663, 
   null, 
   "Steen", 
   "I believe we address the 14th amendment already...but just for the heck of it...show me in the 14th amendment where it says WOMEN has the right to control their own body?\nThe US Supreme Court showed that section 1 applies to the right to privacy.", 
   {}, 
   101653, 
   null, 
   1111865520.0
  ], 
  [
   101669, 
   null, 
   "Cone", 
   "Sure.\n \n The woman is a person, and individual, sentient human being. She has the same right to control her bodily resources as any other person does. As such, you can no more force her, against her will, to provide bodily resources to an embryo or fetus, than you can yourself be forced to give of your bodily resources against your will....\n\n Forgive me if this seems picky, but I just want to try and fully understand this argument. I should say that I don't necessarily agree with it, and would like to respond as to why. I just want to give a proper representation of your argument so that I can make a sound response.\n \n As such, you can no more force her, against her will, to provide bodily resources to an embryo or fetus, than you can yourself be forced to give of your bodily resources against your will.... \n \n Where does this right originate from, i.e., is it from the US Constitution via the 14th amendment etc?", 
   {
    "post_info": {
     "post_title": "A little more in depth please"
    }
   }, 
   101642, 
   null, 
   1111865880.0
  ], 
  [
   101672, 
   null, 
   "Steeeeve", 
   "Here is the first part...\n \n 1. All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\n \n Keeping in mind this was done between 2 slave amendments and this one clearly is talking about slavery....\n \n Where is the right to privacy?\n Where is the right to be able to do whta you want with your resources?", 
   {}, 
   101669, 
   null, 
   1111866120.0
  ], 
  [
   101712, 
   null, 
   "Sigma", 
   "Here is the first part...\n \n 1. All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\n \n Keeping in mind this was done between 2 slave amendments and this one clearly is talking about slavery....\n \n Where is the right to privacy?\n\n \n You know what, you're right. The word privacy appears nowhere in the Constitution. \n \n Guess what, the word marriage appears nowhere either. Does this mean I have no right to marry? The Constitution also doesn't include the right to eat food, or buy foriegn goods or a whole host of other things. Were those things invented by bleeding-heart liberals? How can I be denied such basic rights? It's because the Constitution spells out what the gov't may or must do while the Bill of Rights spells out what the gov't can't do. \n \n The government can't search or seize your property without due process of law, it can't keep you in jail indefinitely without a trial, it can't enact laws abridging the freedom of speech or religion, or infringing on the right to keep and bear arms. Collectively, this and various other protections are called the \"right to privacy\".\n \n Then the ninth and tenth amendments make it clear that the powers of the gov't are limited to those specifically spelled out in the Constitution.\n \n IX:\n The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people\n \n X:\n The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\n \n Clearly the gov't has no power to tell people what to do except in areas specifically authorized in the Constitution. Telling women that they must remain pregnant against their will is not in there.\n \n \n\n Where is the right to be able to do whta you want with your resources?\n\n \n Again, you misunderstand what the Constitution is. It is about what the gov't can do, not the people.", 
   {}, 
   101672, 
   null, 
   1111878420.0
  ], 
  [
   101715, 
   null, 
   "Steeeeve", 
   "couldnt have said it better myself Sigma...it is NOT in the constitution. You gave the 10th amendment...everything else is up to the states....therefore abortion should be a state issue not one for the courts. You talk about eating and such..the government can limit what you eat...for example you can't eat mushrooms (as a drug). It does say you have a right to life though...and once again you are right...it doesn't say anything about a right to marriage.\n \n Also, since when can we combine amendments to form an idea? I gave the example to you of the traffic law and that was a bad one because with a traffic sign you most likely have the intent for intersection traffic control. That is direct intent. When you say the 14th amendment which talks about slavery relates to abortion and right to privacy (along with the other ones that form privacy) there was no direct intent for a right to privacy and I have a hard time finding where that comes from.", 
   {}, 
   101712, 
   null, 
   1111878840.0
  ], 
  [
   101722, 
   null, 
   "Sigma", 
   "couldnt have said it better myself Sigma...it is NOT in the constitution.\n\n \n And anything not in the Constitution are reserved for the people. That includes privacy.\n \n \n\n You gave the 10th amendment...everything else is up to the states....therefore abortion should be a state issue not one for the courts.\n\n \n Except that the Supreme Court has jurisdiction when there is a citizen disputes the legality of state law. That is what happened in Roe v. Wade and every other Supreme Court case. And so the Supreme Court ruled that the state law was unconstitutional.\n \n \n\n You talk about eating and such..the government can limit what you eat...for example you can't eat mushrooms (as a drug).\n\n \n It does?! Where does it say that in the Constitution?\n \n \n\n It does say you have a right to life though...and once again you are right...it doesn't say anything about a right to marriage.\n\n \n Yet marriage is a right, because the gov't does not have the power to prohibit it. You missed the last line of my post. The Constitution does not give power to the people; we already have it. The Constitution spells out the gov'ts power. Every other power is reserved for us.\n \n \n\n Also, since when can we combine amendments to form an idea? I gave the example to you of the traffic law and that was a bad one because with a traffic sign you most likely have the intent for intersection traffic control. That is direct intent. When you say the 14th amendment which talks about slavery relates to abortion and right to privacy (along with the other ones that form privacy) there was no direct intent for a right to privacy and I have a hard time finding where that comes from.\n\n \n I showed you where your example was flawed. I don't have time to go back into it right now, perhaps later today.", 
   {}, 
   101715, 
   null, 
   1111879500.0
  ], 
  [
   101727, 
   null, 
   "Steeeeve", 
   "And anything not in the Constitution are reserved for the people. That includes privacy.\n \n \n It is actually reserved for the states..unless they say nothign about it.\n \n The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people\n \n \nIt does?! Where does it say that in the Constitution?\n \n Doesn't have to say it...we have a law that does\n \n \n You said \"we already have it\" referring to rights...who gives you these rights? What makes one haev these rights? \n \n \n \nI showed you where your example was flawed. I don't have time to go back into it right now, perhaps later today.\n \n My example was flawed in the fact that any traffic intersection law would have the clear direct intent for all traffic intersection laws....We could amend the thing by saying there is one law...you cant run a stop sign...someone gets hit by a car traveling down a road...you can't say that is illegal if the one law is you can't run a stop sign...One could not say the intent of the stop sign law was to punish those who get in accidents.\n \n This applies to the 14th amendment and the others that make up the right to privacy...the direct intent of the 14th was for slaves to have the same rights...one can not say the indirect intent is for privacy. The courts over stepped their powers in Roe vs Wade.", 
   {}, 
   101722, 
   null, 
   1111880100.0
  ], 
  [
   101741, 
   null, 
   "Steen", 
   "Forgive me if this seems picky, but I just want to try and fully understand this argument. I should say that I don't necessarily agree with it, and would like to respond as to why. I just want to give a proper representation of your argument so that I can make a sound response.\nI am saying that every person have the right to privacy, to not have their body used against their will (Guess it has to do with \"unwarranted seizure,\" perhaps?).\n \n I am not sure about the specific point in the law, but I certainly know that you can NOT be forced to give blood against your will and consent.", 
   {}, 
   101669, 
   null, 
   1111883880.0
  ], 
  [
   101742, 
   null, 
   "Steen", 
   "Here is the first part...\n \n 1. All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\n \n Keeping in mind this was done between 2 slave amendments and this one clearly is talking about slavery....\nHmm, because you say so?\n \n \nWhere is the right to privacy?\n Where is the right to be able to do whta you want with your resources?\n\n \n In this part: \n (1) No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States;\n \n As such, you can not pass laws that affect the \"priviledges and immunity\" of citizens.\n \n \n and this part:\n (2) nor shall any State deprive any person of life, liberty, or property, without due process of law;\n \n Right there, you are prohibited from enslaving people, from removing their liberty, from controlling their bodies against their will.\n \n And this part:\n (3) nor deny to any person within its jurisdiction the equal protection of the laws.\n \n \"equal protection.\" You can not deny the woman the control of her bodily resources unless you deny this right to EVERYBODY, meaning that you can be forced to give blood.\n Unless, of course, you argue that women do not constitute such a person, which is in line with typical prolife reasoning which makes her a second-class citizen, essentially nothing but breeding chattel.", 
   {}, 
   101672, 
   null, 
   1111884120.0
  ], 
  [
   101755, 
   null, 
   "Sigma", 
   "It is actually reserved for the states..unless they say nothign about it.\n \n The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people\n\n \n I bolded the important part. We are also reserved rights. The 9th amendment also specifically states that the powers not given to the gov't are reserved for the people. Since the power to force women to remain pregnant is not in the constitution, there can not be a national ban on abortion.\n \n Yes, the states normally how power. However, since it was challenged the Supreme Court had jurisdiction. They held that abortion was a protected right under the Constitution and thus states must show \"compelling interest\" in order to abridge her right.\n \n \n\n Doesn't have to say it...we have a law that does\n\n \n Wait wait wait... it doesn't have to be in the Constitution now, eh? And if there is a law giving us \"right to privacy\" you would stop getting your panties in a twist?\n \n \n\n You said \"we already have it\" referring to rights...who gives you these rights? What makes one haev these rights? \n\n \n Nothing \"gives us\" the rights. We simply have them, and they are recognized by the Constitution.\n \n \n\n My example was flawed in the fact that any traffic intersection law would have the clear direct intent for all traffic intersection laws....We could amend the thing by saying there is one law...you cant run a stop sign...someone gets hit by a car traveling down a road...you can't say that is illegal if the one law is you can't run a stop sign...One could not say the intent of the stop sign law was to punish those who get in accidents.\n\n \n Your example was flawed because the case would never make it to court. Your argument hinged on what the Courts would decide.\n \n \n\n This applies to the 14th amendment and the others that make up the right to privacy...the direct intent of the 14th was for slaves to have the same rights...one can not say the indirect intent is for privacy. The courts over stepped their powers in Roe vs Wade.\n\n \n So we are now judging by intent? So, if the Superior Court looks at the stop sign law and determines the intent of them was to govern intersection traffic and thus applies it to other intersection traffic, that is something they can do, right?\n \n The Due Process Clause protects basic substantive rights, general rights that reserve to the individual the power to do certain things despite the gov'ts desire to the contrary. The Clause also requires basic procedural rights, special rights that dictate how the gov't can lawfully go about taking away a person's freedom or property or life.\n \n The Due Process Clause of the Fifth and Fourteenth Amendments not only guarantee due process whenever the gov't punishes someone, but it also guarantees that a person's life, freedom and property cannot be taken away (by the gov't) without appropriate governmental justification. Because a woman has sex is not appropriate justification, regardless of the procedures used to do the taking.", 
   {}, 
   101727, 
   null, 
   1111888680.0
  ], 
  [
   101778, 
   null, 
   "Eddie", 
   "Nothing \"gives us\" the rights. We simply have them, and they are recognized by the Constitution.\n\n \n Sorry for hi-jacking the thread, but seriously, what is this nonsense? \"We have the rights\"? That`s just crazy talking. No rights are natural. They are merely social structures. We give eachother rights. Nothing more, nothing less. This whole \"natural rights\" thing has evolved into rather embarassing proportions.", 
   {}, 
   101755, 
   null, 
   1111893540.0
  ], 
  [
   101781, 
   null, 
   "Steeeeve", 
   "Hmm, because you say so?\n \n \n \n In this part: \n (1) No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States;\n \n As such, you can not pass laws that affect the \"priviledges and immunity\" of citizens.\n \n \n and this part:\n (2) nor shall any State deprive any person of life, liberty, or property, without due process of law;\n \n Right there, you are prohibited from enslaving people, from removing their liberty, from controlling their bodies against their will.\n \n And this part:\n (3) nor deny to any person within its jurisdiction the equal protection of the laws.\n \n \"equal protection.\" You can not deny the woman the control of her bodily resources unless you deny this right to EVERYBODY, meaning that you can be forced to give blood.\n Unless, of course, you argue that women do not constitute such a person, which is in line with typical prolife reasoning which makes her a second-class citizen, essentially nothing but breeding chattel.\n\n \n \n If one does not know that the 14th amendment is related to slavery then one needs to take a class on the constitution.\n ---\n It still doesn't say right to privacy there...you just assume you already had it and then they can't take it away...so where did it come from?\n \n ---\n \n \n(2) nor shall any State deprive any person of life, liberty, or property, without due process of law;\n \n \n Notice it says life. and then we go down further and it says equal....how is a women killing the baby equal protection?", 
   {}, 
   101742, 
   null, 
   1111893900.0
  ], 
  [
   101783, 
   null, 
   "Steeeeve", 
   "[QUOTE=Sigma]I bolded the important part. We are also reserved rights. The 9th amendment also specifically states that the powers not given to the gov't are reserved for the people. Since the power to force women to remain pregnant is not in the constitution, there can not be a national ban on abortion.\n \n Yes, the states normally how power. However, since it was challenged the Supreme Court had jurisdiction. They held that abortion was a protected right under the Constitution and thus states must show \"compelling interest\" in order to abridge her right.\n QUOTE]\n \n Well, since we concluded that it is reserved for the states (and yes I saw or the people), the states could but a ban on it....but then that means the Supreme Court would be over its jurisdiction if they heard the case. Since it is not in the constitution and reserved for the states right? Only Congress can give jurisdiction to the courts.\n ----\n \n We just happen to have rights...who gave them to you and why can't I take them away? The Constitution doesn't guarntee any right to privacy as we have seen...It just doesn't say it anywhere.\n -----\n If a law existed that only said \"you have the right to privacy\" then that would be the worst law ever. \"I can kill someone in my own home because it is private\"....IT would have to be pretty spelled out for me to like it.\n -------\n HAHA thats true, the courts would never hear it.\n ---\n in our evolving example which one day I will get it to what I want to say....the traffic law for stop signs would have direct intent for intersection traffic. It would be pretty hard pressed to argue that they did not intend for safe intersection traffic while making a law about stop signs.\n \n as for the due process stuff...blah, don't feel like responding to it right now...however I did see a website thta showed how the 14th amendment was ratified illegally!! It was kinda funny and very picky i guess you could say.", 
   {}, 
   101755, 
   null, 
   1111894440.0
  ], 
  [
   101796, 
   null, 
   "JPSartre12", 
   "I am saying that every person have the right to privacy, to not have their body used against their will (Guess it has to do with \"unwarranted seizure,\" perhaps?).\n \n I am not sure about the specific point in the law, but I certainly know that you can NOT be forced to give blood against your will and consent.\n\n \n I keep hearing you claim that the government has no \"right\" to use someone's body against their will, but you're argument is patently false. The government can and does use people's bodies against their will, it's called the military draft. Hundreds of thousands of men were forced into military service, so don't claim that the government can't \"use someone's body against their will\". It can. emoticon_rolleyes", 
   {}, 
   101741, 
   null, 
   1111898280.0
  ], 
  [
   101805, 
   null, 
   "Steeeeve", 
   "wow, never thought of that :p...we don't use the draft right now though", 
   {}, 
   101796, 
   null, 
   1111899060.0
  ], 
  [
   101838, 
   null, 
   "Steen", 
   "I keep hearing you claim that the government has no \"right\" to use someone's body against their will, but you're argument is patently false. The government can and does use people's bodies against their will, it's called the military draft.\nReally? (looks around and under the chair). Nope, no draft here.\n \n \nHundreds of thousands of men were forced into military service, so don't claim that the government can't \"use someone's body against their will\". It can. emoticon_rolleyes\n\"were forced.\" Hmm, past tense and everything. :p", 
   {}, 
   101796, 
   null, 
   1111904040.0
  ], 
  [
   101840, 
   null, 
   "JPSartre12", 
   "Really? (looks around and under the chair). Nope, no draft here.\n \n \"were forced.\" Hmm, past tense and everything. :p\n\n \n Yes, were forced. While we don't have the draft today, the precedence still exists and the fact remains that they were forced against their wills to put their bodies in harm's way. :p", 
   {}, 
   101838, 
   null, 
   1111905060.0
  ], 
  [
   101924, 
   null, 
   "jitobear", 
   "I keep hearing you claim that the government has no \"right\" to use someone's body against their will, but you're argument is patently false. The government can and does use people's bodies against their will, it's called the military draft. Hundreds of thousands of men were forced into military service, so don't claim that the government can't \"use someone's body against their will\". It can. emoticon_rolleyes\n\n \n Quite frankly I do not approve of the draft either.\n \n But aren't there recourses and exceptions that can be made?", 
   {}, 
   101796, 
   null, 
   1111951140.0
  ], 
  [
   101936, 
   null, 
   "JPSartre12", 
   "Quite frankly I do not approve of the draft either.\n \n But aren't there recourses and exceptions that can be made?\n\n A few, just as there are exceptions for abortions that threaten the life of the mother. :)", 
   {}, 
   101924, 
   null, 
   1111953120.0
  ], 
  [
   101980, 
   null, 
   "jitobear", 
   "A few, just as there are exceptions for abortions that threaten the life of the mother. :)\n\n \n Health and rape.\n \n I will fight hard and mean against lifers until they can meet in the middle where women are valued a little earlier than the verge of death.\n \n Plus I know you don't support helping those in need and complain about bleeding heart liberals who do.\n \n \"Be pregnant, have baby, (unless your gonna die), but don't actually expect me to care if it starves. I can meddle with your body - but you need to stay the hell out of my wallet.\" :xcensored", 
   {}, 
   101936, 
   null, 
   1111962180.0
  ], 
  [
   101987, 
   null, 
   "JPSartre12", 
   "Health and rape.\n I will fight hard and mean against lifers until they can meet in the middle where women are valued a little earlier than the verge of death.\n\n I would have no problem with those stipulations if I knew that they weren't already being abused. If you changed it to \"the life of the mother\" instead of \"health\", I'd agree. But you and I both know that there are plenty of abortion doctors out there who are more than happy to justify abortions based on the \"mental health and wel-being\" of the mother. That nebulous term is an invitation to abuse, IMO.\n \n\n Plus I know you don't support helping those in need and complain about bleeding heart liberals who do.\n\n Quite the contrary, I believe highly in helping those in need. That's what CHARITY is for, NOT government. That's my beef. Uncle Sam shouldn't be in the charity business.\n \n\n \"Be pregnant, have baby, (unless your gonna die), but don't actually expect me to care if it starves. I can meddle with your body - but you need to stay the hell out of my wallet.\" :xcensored\n\n \n Between you and me, want to wager who gives more money to help the needy? I hear you spout liberal dogma all of the time, but do YOU put your money where YOUR mouth is? I DO.", 
   {}, 
   101980, 
   null, 
   1111962780.0
  ], 
  [
   101993, 
   null, 
   "jitobear", 
   "I would have no problem with those stipulations if I knew that they weren't already being abused. If you changed it to \"the life of the mother\" instead of \"health\", I'd agree. But you and I both know that there are plenty of abortion doctors out there who are more than happy to justify abortions based on the \"mental health and wel-being\" of the mother. That nebulous term is an invitation to abuse, IMO.\n\n \n Go to hell. You will neve value women and we will never agree. \n \n \nQuite the contrary, I believe highly in helping those in need. That's what CHARITY is for, NOT government. That's my beef. Uncle Sam shouldn't be in the charity business.\n\n \n Balls. It would go back to everyone working for the king(s) and nobody giving a damn for the poor.\n \n \n \nBetween you and me, want to wager who gives more money to help the needy? I hear you spout liberal dogma all of the time, but do YOU put your money where YOUR mouth is? I DO.\n\n \n Why not? I donate to several organizations, have worked in homeless sheltered, have volunteered my time to lead activites for the mentally ill. I give money to my family when they need it. Sponsor other kids on school field trips, when their parents can't afford to. And on top of that - I don't whine about my tax dollars going to help those in need.\n \n Conservatives seem to think that they are the only ones that pay taxes.", 
   {}, 
   101987, 
   null, 
   1111963320.0
  ], 
  [
   102003, 
   null, 
   "Steeeeve", 
   "Calm down... jitobear...calm down", 
   {}, 
   101993, 
   null, 
   1111964160.0
  ], 
  [
   102008, 
   null, 
   "JPSartre12", 
   "Go to hell. You will neve value women and we will never agree. \n\n I value women enough to still be married to one for 26+ years and still going strong. I've raised two intelligent, independent daughters. I'll let my actions speak for themselves.\n \n\n Balls. It would go back to everyone working for the king(s) and nobody giving a damn for the poor.\n\n My bad. I forgot for a second that you were a true liberal that believed that Uncle Sam knew what to do with YOUR money better than YOU did. Isn't it great that Uncle Sam gets to chose YOUR charities so that you don't have to do any thinking on your own. :)\n \n\n Why not? I donate to several organizations, have worked in homeless sheltered, have volunteered my time to lead activites for the mentally ill. I give money to my family when they need it. Sponsor other kids on school field trips, when their parents can't afford to. And on top of that - I don't whine about my tax dollars going to help those in need.\n\n How refreshing, a liberal that actually does something other than talk. \n \n\n Conservatives seem to think that they are the only ones that pay taxes.\n\n \n Considering that the top 50% of wage earners (majority are Republican) pay 96% of all income taxes, you're not far from wrong. :p\n But that's not the point. The Federal Gov't has no business being in the business of charity. Charity should NEVER be coerced. It should be freely given to those charities that the donor deems worthy. Your problem is that if Uncle Sam wasn't in the business of charity, your left wing social engineering programs wouldn't get any funding because nobody with money to give would find them worthy enough to receive any support.", 
   {}, 
   101993, 
   null, 
   1111964400.0
  ], 
  [
   102010, 
   null, 
   "JPSartre12", 
   "Calm down... jitobear...calm down\n\n \n Don't bother. A dose of anti-liberal truth always fires her up. ;)", 
   {}, 
   102003, 
   null, 
   1111964460.0
  ], 
  [
   102011, 
   null, 
   "Steeeeve", 
   "come on now...be nice :)\n \n Everyone here preaches \"don't degrade....\" yet we write down little insults that directly degraded each other.", 
   {}, 
   102010, 
   null, 
   1111964520.0
  ], 
  [
   102015, 
   null, 
   "jitobear", 
   "Don't bother. A dose of anti-liberal truth always fires her up. ;)\n\n \n That's really condescending. I am a rape victim, have suffered domestic abuse, and was a single mom until three years ago. You trivialize a lot of what I have gone through. That's why I am angry. Another bang up job of not recognizing women and their issues - right here.", 
   {}, 
   102010, 
   null, 
   1111964760.0
  ], 
  [
   102018, 
   null, 
   "Steeeeve", 
   "Having a hard life does not make one have a more valid view. If this were the case then some homeless man on the streets that was in jail for something he didn't do and has no money and one leg after fighting in Vietnam would be more valid to answer lifes questions.\n \n This said...your life experiences make you who you are, and that is more valid then anything else.", 
   {}, 
   102015, 
   null, 
   1111965000.0
  ], 
  [
   102022, 
   null, 
   "JPSartre12", 
   "That's really condescending. I am a rape victim, have suffered domestic abuse, and was a single mom until three years ago. You trivialize a lot of what I have gone through. That's why I am angry. Another bang up job of not recognizing women and their issues - right here.\n\n \n So your bad experiences and poor life choices are now all of MANkind's cross to bear? And show me where I've ever trivialized rape. The only thing that I said about rape regarded pregnancies as a result...which were rare.", 
   {}, 
   102015, 
   null, 
   1111965660.0
  ], 
  [
   102054, 
   null, 
   "Steen", 
   "That's really condescending. I am a rape victim, have suffered domestic abuse, and was a single mom until three years ago. You trivialize a lot of what I have gone through. That's why I am angry. Another bang up job of not recognizing women and their issues - right here.\nThey won't get it. To them, you are \"only\" a woman and thus don't matter for anything but being a self-propelled uterus. I don't for a second believe that you can make a dent in their conservative misogyny.", 
   {}, 
   102015, 
   null, 
   1111971420.0
  ], 
  [
   102055, 
   null, 
   "Steen", 
   "Having a hard life does not make one have a more valid view.\n\n \nSo your bad experiences and poor life choices are now all of MANkind's cross to bear?\n\n But having gone through something gives one a whole lot more insight than somebody who has not and trivializes the experience in the best conservative misogynistic style.\n \n It is getting to be pretty clear what a conservative is. It is somebody who want the Government to not have any of their tax dollars at all, and see the role of government ONLY to be intrusive into people's private lives from a theocratic moralistically punitive perspective of women as second-class citizens. They insist that every conceptus be brought to term even against the woman's will, thus enslaving her, and then after birth seeing the woman and kid only as welfare leeches that are after their tax money that they don't want to pay to begin with.\n \n What friggin' hypocrites.\n \n THAT is what conservatives are. You guys have amply proven this.", 
   {}, 
   102018, 
   null, 
   1111971480.0
  ], 
  [
   102058, 
   null, 
   "Steeeeve", 
   "Or not...I have gone through more than you know and yet I formed this mindset...Wait, i am probably lieing here huh?", 
   {}, 
   102055, 
   null, 
   1111971600.0
  ], 
  [
   102094, 
   null, 
   "jitobear", 
   "So your bad experiences and poor life choices are now all of MANkind's cross to bear? And show me where I've ever trivialized rape. The only thing that I said about rape regarded pregnancies as a result...which were rare.\n\n \n For starters what do you really know about my choices. Really leaving my ex-husband was a good choice - I am certain - his choice to not be a dad is poor, though.\n \n In any case I am responding to your comment about why I am angry - it was insulting and disregarded how I really feel about the issue.", 
   {}, 
   102022, 
   null, 
   1111979280.0
  ], 
  [
   180212, 
   null, 
   "Bassman", 
   "Let's not overlook the fact that the first wave of Boomers will be retiring within five to seven years. Now, do the math. Since Roe, the US has had 50+ million unborn children legally murdered. My contention has always been that when you devalue human life, there's no telling what will happn next. First, the unborn. Next, the elderly and infirm. Yep, I'm referring to the \"slippery slope\" argument, but you cannot dismiss the pattern that's occuring now.", 
   {}, 
   102094, 
   null, 
   1132362660.0
  ], 
  [
   180214, 
   null, 
   "Sigma", 
   "Let's not overlook the fact that the first wave of Boomers will be retiring within five to seven years. Now, do the math. Since Roe, the US has had 50+ million unborn children legally murdered. My contention has always been that when you devalue human life, there's no telling what will happn next. First, the unborn. Next, the elderly and infirm. Yep, I'm referring to the \"slippery slope\" argument, but you cannot dismiss the pattern that's occuring now.\n\n \n What pattern is that? I fail to see how women having abortions and the elderly and terminally ill being able to end their own lives are part of a pattern.", 
   {}, 
   180212, 
   null, 
   1132363260.0
  ], 
  [
   180261, 
   null, 
   "Steeeeve", 
   "I think he is referring to us going back to eugenics..It wasn't really accepted when it first happened but it seems we might be heading that way as society feels the need to rank humans.", 
   {}, 
   180214, 
   null, 
   1132380000.0
  ], 
  [
   180263, 
   null, 
   "Sigma", 
   "I think he is referring to us going back to eugenics..It wasn't really accepted when it first happened but it seems we might be heading that way as society feels the need to rank humans.\n\n \n You would have a point if it were a gov't run program deciding who lives and who dies, but this is not the case. It would be closer to what you say if there was a national ban on abortion, imo.\n \n Society is not deciding who lives and who dies, Steve. In fact, it is the opposite.", 
   {}, 
   180261, 
   null, 
   1132380900.0
  ], 
  [
   180294, 
   null, 
   "Bassman", 
   "You would have a point if it were a gov't run program deciding who lives and who dies, but this is not the case. It would be closer to what you say if there was a national ban on abortion, imo.\n\n Roe v. Wade is government imposition of abortion by judicial fiat. The issue should have been left up to the states.\n \nSociety is not deciding who lives and who dies, Steve. In fact, it is the opposite.\n\n \"Society not deciding who live or dies?\"", 
   {}, 
   180263, 
   null, 
   1132411800.0
  ], 
  [
   180315, 
   null, 
   "Sigma", 
   "Roe v. Wade is government imposition of abortion by judicial fiat. The issue should have been left up to the states.\n\n \n Regardless of your personal feelings of Roe, the gov't is not deciding who lives and dies when abortion is legal. This would occur if there was a ban on abortion.\n \n \n\n \"Society not deciding who live or dies?\"\n\n \n Why did you repeat me but leave out \"is\"?", 
   {}, 
   180294, 
   null, 
   1132419360.0
  ], 
  [
   180358, 
   null, 
   "Howard Beale", 
   "Geez...get a grip on this. The majority of Conservatives are not misogynistic. You're just generalizing our views into one incorrect term. Do you truly believe that we are \"women haters\"? What classifies a misogynist to you? A person who attempts to take a \"right\" away? Does that classify as hate because we're standing up for our beliefs? \n \n What's the word for an unborn child hater?\nIt is open to question whether someone who believes that a government should impose a compulsory nine month gestation period and forced parturition (labor, birthing and everything that comes along with it) on females is a misogynist or not. Some might say that it is misogynistic.", 
   {}, 
   102054, 
   null, 
   1132429920.0
  ], 
  [
   180372, 
   null, 
   "Sigma", 
   "Is it misogynistic to imply responsibility before a woman gets pregant, rather than resorting to an abortion, not only on her part, but the man's part as well?\n\n \n Only if it becomes a legal responsibility on the part of the woman. To advocate responsibility on the part of both parties before sex, no.", 
   {}, 
   180358, 
   null, 
   1132431900.0
  ], 
  [
   180375, 
   null, 
   "simone", 
   "The idea of abortion as population control is absurd, especially forced abortions as someone mentioned a few posts ago. Anyone who has read a biology book knows the world has methods of population control on its own, we don't need to be doing stuff like that ourselves.\n \n This stat sounds more than a bit inflated. Seeing as it comes from a website called \"women's issues\" it is probably not all that credible.\nAnd, Master Shake, why is it precisely that you are having problems with \"women's issues\"?", 
   {}, 
   96788, 
   null, 
   1132432620.0
  ], 
  [
   180376, 
   null, 
   "simone", 
   "Health and rape.\n \n I will fight hard and mean against lifers until they can meet in the middle where women are valued a little earlier than the verge of death.\n \n Plus I know you don't support helping those in need and complain about bleeding heart liberals who do.\n \n \"Be pregnant, have baby, (unless your gonna die), but don't actually expect me to care if it starves. I can meddle with your body - but you need to stay the hell out of my wallet.\" :xcensored\nBeautiful, Jitobear, absolutely beautiful and true.", 
   {}, 
   101980, 
   null, 
   1132432800.0
  ], 
  [
   180377, 
   null, 
   "simone", 
   "Don't bother. A dose of anti-liberal truth always fires her up. ;)\nTruth? Do you truly dare to call that truth?", 
   {}, 
   102010, 
   null, 
   1132432920.0
  ], 
  [
   180378, 
   null, 
   "simone", 
   "Having a hard life does not make one have a more valid view. If this were the case then some homeless man on the streets that was in jail for something he didn't do and has no money and one leg after fighting in Vietnam would be more valid to answer lifes questions.\n \n This said...your life experiences make you who you are, and that is more valid then anything else.\nSo, one's experiences in the real world where there is rape and abusive behavior disqualifies them from remarking upon that behavior?\n \n My, what a high and mighty and insolent stance!", 
   {}, 
   102018, 
   null, 
   1132433040.0
  ], 
  [
   180379, 
   null, 
   "simone", 
   "Or not...I have gone through more than you know and yet I formed this mindset...Wait, i am probably lieing here huh?\nHave you been raped?\n \n Have you been beaten?\n \n Have you been abused?", 
   {}, 
   102058, 
   null, 
   1132433100.0
  ], 
  [
   180380, 
   null, 
   "simone", 
   "Let's not overlook the fact that the first wave of Boomers will be retiring within five to seven years. Now, do the math. Since Roe, the US has had 50+ million unborn children legally murdered. My contention has always been that when you devalue human life, there's no telling what will happn next. First, the unborn. Next, the elderly and infirm. Yep, I'm referring to the \"slippery slope\" argument, but you cannot dismiss the pattern that's occuring now.\nEh?\n \n Perhaps certain minds are on a slippery slope of unreality.", 
   {}, 
   180212, 
   null, 
   1132433220.0
  ], 
  [
   180381, 
   null, 
   "simone", 
   "What's the word for an unborn child hater?\nEh? \"Unborn\"? What if this particular imaginary entity created by your mind changes its mind upon birth?", 
   {}, 
   102054, 
   null, 
   1132433340.0
  ], 
  [
   180382, 
   null, 
   "simone", 
   "Is it misogynistic to imply responsibility before a woman gets pregant, rather than resorting to an abortion, not only on her part, but the man's part as well?\nIn other words, all women should have their legs stapled together.", 
   {}, 
   180358, 
   null, 
   1132433460.0
  ], 
  [
   180394, 
   null, 
   "Howard Beale", 
   "Is it misogynistic to imply responsibility before a woman gets pregant, rather than resorting to an abortion, not only on her part, but the man's part as well?\nRather than get into the myriad of things that are not misogynistic, which could be an endless task, I prefer to identify those that are like the one I outlined above.", 
   {}, 
   180358, 
   null, 
   1132434840.0
  ], 
  [
   180552, 
   null, 
   "JPSartre12", 
   "In other words, all women should have their legs stapled together.\n\n \n Nah, stapling's so painful. How about superglue? emoticon_rolleyes", 
   {}, 
   180382, 
   null, 
   1132515360.0
  ], 
  [
   180703, 
   null, 
   "jitobear", 
   "Nah, stapling's so painful. How about superglue? emoticon_rolleyes\n\n \n We could also dismember men. emoticon_xangel", 
   {}, 
   180552, 
   null, 
   1132603020.0
  ], 
  [
   180708, 
   null, 
   "Steeeeve", 
   "Have you been raped?\n \n Have you been beaten?\n \n Have you been abused?\n\n \n Whos to say I havent?", 
   {}, 
   180379, 
   null, 
   1132603260.0
  ], 
  [
   180709, 
   null, 
   "jitobear", 
   "Whos to say I havent?\n\n \n There are questions. Just answer them.", 
   {}, 
   180708, 
   null, 
   1132603440.0
  ], 
  [
   180711, 
   null, 
   "Steeeeve", 
   "There are questions. Just answer them.\n\n \n no, those are questions I believe are too personal to answer. So think what you want but in the end you don't know anything about me.", 
   {}, 
   180709, 
   null, 
   1132603620.0
  ], 
  [
   180712, 
   null, 
   "simone", 
   "Oh yes, JitoBear, remember that case of the woman who performed a penectomy on her hated husband with a sharp knife, what was her name? Bobbitt.\n \n Bobbitting! Full speed ahead!", 
   {}, 
   180703, 
   null, 
   1132603680.0
  ], 
  [
   180780, 
   null, 
   "JPSartre12", 
   "Oh yes, JitoBear, remember that case of the woman who performed a penectomy on her hated husband with a sharp knife, what was her name? Bobbitt.\n \n Bobbitting! Full speed ahead!\n\n \n What do we have here, a man-hater's convention? What's the opposite of misogyny? Oh yeah, misandry.", 
   {}, 
   180712, 
   null, 
   1132625460.0
  ], 
  [
   180801, 
   null, 
   "OccamsRazor", 
   "Oh yes, JitoBear, remember that case of the woman who performed a penectomy on her hated husband with a sharp knife, what was her name? Bobbitt.\n \n Bobbitting! Full speed ahead!\n\n \n That would only lead to a glut of new pornstars appearing :p", 
   {}, 
   180712, 
   null, 
   1132635420.0
  ], 
  [
   180838, 
   null, 
   "jitobear", 
   "What do we have here, a man-hater's convention? What's the opposite of misogyny? Oh yeah, misandry.\n\n \n Quit your belly aching! It was a joke! A joke, I would like to point out, that started out with comments (one being yours) about stapling or super-gluing women's legs together. It's a free society, baby. Women can make crude jokes at the expense of men just as freely as you did at the expense of women.", 
   {}, 
   180780, 
   null, 
   1132671000.0
  ], 
  [
   181292, 
   null, 
   "JPSartre12", 
   "Quit your belly aching! It was a joke! A joke, I would like to point out, that started out with comments (one being yours) about stapling or super-gluing women's legs together. It's a free society, baby. Women can make crude jokes at the expense of men just as freely as you did at the expense of women.\n\n \n Careful, your double-standard is showing. When MEN attempted to make jokes in the past, you accused US of being mysogenistic, remember? If not, I can link you back to your own words. It seems your selective indignation is a one way street. emoticon_rolleyes \n Oh, and my superglue comment was made as a response to a WOMAN's (or at least I think Simone's a woman) comment about stapling a woman's legs shut. :)", 
   {}, 
   180838, 
   null, 
   1132860540.0
  ], 
  [
   181296, 
   null, 
   "jitobear", 
   "Careful, your double-standard is showing. When MEN attempted to make jokes in the past, you accused US of being mysogenistic, remember? If not, I can link you back to your own words. It seems your selective indignation is a one way street. emoticon_rolleyes \n\n \n It quite entirely depends upon my mood. And quit rolling your eyes before I pluck them out.\n \n \nOh, and my superglue comment was made as a response to a WOMAN's (or at least I think Simone's a woman) comment about stapling a woman's legs shut. :)\n\n \n That does not mean I will not make jokes about men and and their hoo hoo dilly's.", 
   {}, 
   181292, 
   null, 
   1132862340.0
  ], 
  [
   181300, 
   null, 
   "JPSartre12", 
   "It quite entirely depends upon my mood. And quit rolling your eyes before I pluck them out.\n\n Careful, your Three Letter Syndrome is showing. :) \n \n\n That does not mean I will not make jokes about men and and their hoo hoo dilly's.\n\n \n Knock yourself out. Just don't apply your double standard on me and we'll get along just fine. emoticon_rolleyes emoticon_rolleyes emoticon_rolleyes :)", 
   {}, 
   181296, 
   null, 
   1132864020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Population Control?", 
  "url": "http://www.4forums.com/political/abortion-debates/3696-population-control.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 3696, 
  "discussion_files": [
   [
    "3277.html", 
    "http://www.4forums.com/political/abortion-debates/3696-population-control-print.html"
   ], 
   [
    "3278.html", 
    "http://www.4forums.com/political/abortion-debates/3696-population-control-6-print.html"
   ], 
   [
    "3279.html", 
    "http://www.4forums.com/political/abortion-debates/3696-population-control-4-print.html"
   ], 
   [
    "3280.html", 
    "http://www.4forums.com/political/abortion-debates/3696-population-control-5-print.html"
   ], 
   [
    "3281.html", 
    "http://www.4forums.com/political/abortion-debates/3696-population-control-3-print.html"
   ], 
   [
    "3282.html", 
    "http://www.4forums.com/political/abortion-debates/3696-population-control-2-print.html"
   ]
  ], 
  "identifier": 3696
 }
]