[
 [
  [
   77470, 
   null, 
   "jim's trucking", 
   "Must we wait another four years for the lunacy to surface again?", 
   {
    "post_info": {
     "post_title": "The Political Forum seems to have gone silent!"
    }
   }, 
   null, 
   null, 
   1100552700.0
  ], 
  [
   77474, 
   null, 
   "unkerpaulie", 
   "i've been trying to spark a politicl debate in the debate tournament forum, but with very little headway. you might want to check that out.\n \n election time and crisis/scandals are the only times the public thinks about politicians. if they dont hear anything, they just assume the politicians are doing their job", 
   {}, 
   77470, 
   null, 
   1100553720.0
  ], 
  [
   77494, 
   null, 
   "Waxy", 
   "Must we wait another four years for the lunacy to surface again?\n\n \n Here's hoping. :p \n \n Waxy", 
   {}, 
   77470, 
   null, 
   1100556720.0
  ], 
  [
   77569, 
   null, 
   "daewoo", 
   "I agree. It is getting boring around here. I actually had to resort to baiting some poor science teacher in the evolution/creationism forum. Boring even when you do manage to get the other guy worked up into a tissy.\n \n If past patterns hold, we can expect Bush to do something stupid soon, then we can get back to debating.", 
   {}, 
   77494, 
   null, 
   1100597580.0
  ], 
  [
   77582, 
   null, 
   "OccamsRazor", 
   "I actually had to resort to baiting some poor science teacher in the evolution/creationism forum. Boring even when you do manage to get the other guy worked up into a tissy.\n \n\n \n Be careful about admitting to trolling....... the fish have long memories.", 
   {}, 
   77569, 
   null, 
   1100613660.0
  ], 
  [
   77616, 
   null, 
   "georged", 
   "If past patterns hold, we can expect Bush to do something stupid soon, then we can get back to debating.\n\n \n That shouldn't take too long. As we continue our crusade of spreading democracy Fajullah now looks like Beirut (the inspiration for Bin Laden's twin towers attack), interest rates are going up to satisfy our creditors in a flat economy and China has reduced their annual growth to a paltry 12% as they concentrate on preparing their infrastructure for additional industrial expansion. He'll have to pick a fight with another third tier nation (low casualties) to expand the war footing or al Qaeda will hit us again. Rust never sleeps and we have a bad case of that.", 
   {}, 
   77569, 
   null, 
   1100632200.0
  ], 
  [
   77840, 
   null, 
   "jim's trucking", 
   "We could always talk about how the Democrats still can't believe they lost...or about the bigotted attacks on Condi Rice. What's with these people?", 
   {}, 
   77616, 
   null, 
   1100794920.0
  ], 
  [
   77865, 
   null, 
   "georged", 
   "We could always talk about how the Democrats still can't believe they lost...or about the bigotted attacks on Condi Rice. What's with these people?\n\n \n I've found it interesting that the US, in our constant effort to prove that we champion equality to disguise our basic racism, appoints women to sensitive cabinet positions where they'll deal with primarily men. Men who, in most cases, are world leaders and as egotistical and chauvinistic as their positions of power allow. I understand domestic political necessity of female representation due to the simple fact that more women than men are voters.\n Does this mean those representatives are 'world window dressing'? \n \n I certainly can't imagine a ranking member of the Saud family, as despotic and hostile to women's rights as it gets, privately confiding in Albright or Rice over brandy and a cigar. With the exception of the British, considered as a world power out of past consideration, I'm unable to think of any other world power that doesn't generally exclude women from positions of power.", 
   {}, 
   77840, 
   null, 
   1100802420.0
  ], 
  [
   77872, 
   null, 
   "jim's trucking", 
   "I've found it interesting that the US, in our constant effort to prove that we champion equality to disguise our basic racism, appoints women to sensitive cabinet positions where they'll deal with primarily men. Men who, in most cases, are world leaders and as egotistical and chauvinistic as their positions of power allow. I understand domestic political necessity of female representation due to the simple fact that more women than men are voters.\n Does this mean those representatives are 'world window dressing'? \n \n I certainly can't imagine a ranking member of the Saud family, as despotic and hostile to women's rights as it gets, privately confiding in Albright or Rice over brandy and a cigar. With the exception of the British, considered as a world power out of past consideration, I'm unable to think of any other world power that doesn't generally exclude women from positions of power.\nThat's a good point, but I referring to the recent cartoons depicting Dr. Rice as an imbecilic barefoot plantation slave. She deserves more respect than most of the laughing liberals can muster up.\n \n If you think women aren't strong in politics, you'll be amazed in 4 years when Hillary gets elected our Presidentress and Slick Willy is the nation's First Gentleman.", 
   {}, 
   77865, 
   null, 
   1100804880.0
  ], 
  [
   77881, 
   null, 
   "georged", 
   "If you think women aren't strong in politics, you'll be amazed in 4 years when Hillary gets elected our Presidentress and Slick Willy is the nation's First Gentleman.\n\n \n The woman's vote is what carried Clinton and it wouldn't surprise me if Hillary won by a landslide. But I think we've gotten in so far beyond our economic ability to recover now that it won't make much difference who's in office.", 
   {}, 
   77872, 
   null, 
   1100807880.0
  ], 
  [
   77971, 
   null, 
   "Dono", 
   "The woman's vote is what carried Clinton and it wouldn't surprise me if Hillary won by a landslide. But I think we've gotten in so far beyond our economic ability to recover now that it won't make much difference who's in office.\n\n Given the circumstances likely to exist four years from now, only a candidate with an ego larger than his/her brain would choose to run .... which means we will probably have quite a few clamoring for the job. \n Dono", 
   {}, 
   77881, 
   null, 
   1100834520.0
  ], 
  [
   78015, 
   null, 
   "Alan Ryan", 
   "I certainly can't imagine a ranking member of the Saud family, as despotic and hostile to women's rights as it gets, privately confiding in Albright or Rice over brandy and a cigar. With the exception of the British, considered as a world power out of past consideration, I'm unable to think of any other world power that doesn't generally exclude women from positions of power.\n\n \n Women in power - not many - but what about Indira Gandhi (India), and the President of Indonesia, Megawati Sukarnoputri is a woman. Helen Clark made it to the top in New Zealand. Can't think of any more apart from the woman who used to run Ceylon, Mrs Bandaranike ? I think was her name.\n But I suppose these don't really count for much because none of these women (apart from Thatcher), took charge of countries we'd rate as world powers ?", 
   {}, 
   77865, 
   null, 
   1100878980.0
  ], 
  [
   78138, 
   null, 
   "Haulingboat", 
   "I won't attempt to speak for anyone else, but I for one am glad to have the election behind us. A break from the political threads is good in my opinion. I have been staying out of there on purpose. \n \n After devoting so much time to it in the recent past I am enjoying some time away. We all know what they say though. \" It's sure good to come home again.\" I'll see you guys there soon. :) :) :)", 
   {}, 
   78015, 
   null, 
   1100910960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Political Forum seems to have gone silent!", 
  "url": "http://www.4forums.com/political/fun-debates/3726-political-forum-seems-have-gone-silent.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 3726, 
  "discussion_files": [
   [
    "15387.html", 
    "http://www.4forums.com/political/fun-debates/3726-political-forum-seems-have-gone-silent-print.html"
   ]
  ], 
  "identifier": 3726
 }
]