[
 [
  [
   4473, 
   null, 
   "Stormin Norman", 
   "posted on the communist forum by a rabid socialist: GWB is being sued right now for unconstitutional actions taking to declare war on Iraq. His dad was sued for the same reason. How many Americans know this.\n \n My answer to such utter stupidity:\n \n I know some XXXXXX have decided to question the president's ability to commit troops without a formal declaration of war. However, they are going to lose their case, because it is a weak argument. The U.S. Constitution states:\n \n \"The President shall be Commander in Chief of the Army and Navy of the United States, and of the Militia of the several States, when called into the actual Service of the United States; he may require the Opinion, in writing, of the principal Officer in each of the executive Departments, upon any Subject relating to the Duties of their respective Offices, and he shall have Power to grant Reprieves and Pardons for Offences against the United States, except in Cases of Impeachment.\n \n He shall have Power, by and with the Advice and Consent of the Senate, to make Treaties\" -U.S. Constitution; Article 2, Section 2\n \n Where as, the Congress has the power to declare war. \n \n The problem lies in the fact that Congress passed a resolution authorizing the President to use military force to disarm Iraq, back in October of 2002.\n \n Furthermore, liberals have long made a case for the U.N. in combating the world's problems. The U.N. charter is essentially a treaty, entered into by the President of the United States and affirmed by the Senate. Therefore, the use of force under the U.N. charter is well within the power of the President under Section 2. Article 2. of the United States Constitution. The U.N. charter allows for military action granted the Security Counsel votes in favor. However, under article 51, the U.N. nations can not impede self-defensive action by one member nation against another member nation. Therefore, the President can take all the necessary steps required by the Security Counsel, get denied, and still use the self-defense argument to persecute a war. In summation, liberals, who sought to use the U.N. to solve global conflict, and now complain about what appears to be an extension of presidential powers, essentially miss the paradox that they have created. By deferring issues to the U.N., the powers of Congress have been weakened in many respects, and the powers of the President have expanded over the years.\n \n In addition to the loopholes within the U.S. Constitution, and the U.N. Charter, a precedent has already been established regarding the type of action the President is about to take. First, Israel has engaged in preemptive attacks. Secondly, both the Vietnam and Korean wars were considered police actions under the U.N.. \n \n Because of some of the concerns raised by the Constitutionality of committing troops in protracted conflicts without a formal declaration of war the 1973 War Powers Resolution was issued by congress. This was a set of guidelines, for both Congress and the President regarding the \"introduction of United States Armed Forces into hostilities, or into situations where imminent involvement in hostilities is clearly indicated by the circumstances\", which was the case for both Korea and Vietnam. Under this act, troops have been sent to Panama, Grenada, Lebanon, Iraq, Iran, Haiti, Somalia and the Balkans. During the Bosnian conflict the debate was once again raised by congress. In 1997 the McCain-Dole Resolution was passed to further deal with the problem. It was said that Congress has \"the untrammeled authority to unappropriate, disappropriate funds. That is the key; and that makes us the king of the hill\".\n \n The debate over war powers continues to this day. However, because of precedents that have been sent, loopholes with the presidents ability to make treaties, current law, and the fact that Congress has approved of the use of force, the useful XXXXXX who are currently suing the President don't have a leg to stand on. Their case will most certainly be thrown out of court, and their lawyers should be severely reprimanded. One this is for certain, those lawyers sound pretty incompetent, and have oversimplified Congress's role in war powers. This has been a debate since the Constitutional Convention, and is the reason why the original document was worded in such a vague manner. The authors of the Constitution did not want to hinder the President's ability to defend the country, but they wanted to protect against abuses by giving Congress an important role. The War Powers Resolution in 1973 was an attempt to expand on the original intent of the framers, and clarify the respective roles of Congress and the Presidency.", 
   {
    "post_info": {
     "post_title": "Stupid Idiots Sue President Over War in Iraq"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1047484620.0
  ], 
  [
   4520, 
   null, 
   "Debater", 
   "United States Law takes precedence over treaties.\n \n So if Congress said he could well then he can.", 
   {}, 
   4473, 
   null, 
   1047511860.0
  ], 
  [
   4530, 
   null, 
   "Broker", 
   "I heard one of them on FOX...had nothing to say about Clinton's actions, of course.", 
   {}, 
   4473, 
   null, 
   1047514200.0
  ], 
  [
   4553, 
   null, 
   "dsadevil", 
   "While I fully expect the anti-war folks to lose the case, legally I feel it is at least legitimate. The flaws in stormin norman's arguments are as follows:\n \n His constitutional analysis is unpersuasive. First of all, the president's power as commander in chief means that he controls the army. Congress' power to declare war means that they decide when the army can be used on another sovereign state. All the commander in chief power means is that congress can't pass a resolution THEREFORE BE IT RESOLVED THAT: The IV Corps be moved 5 miles North and attack Mosul. It doesn't mean that the president can do an end run around congress. Congress still must, in my view, declare war in order for the president to send troops into combat. As the Washington Post tells us on March 12th 2003, it can be reasonably argued that the clause granting congress the power to declare war was meant as a check on an unbridled executive power to throw american lives and drain the american treasury on a whim. In this sense, congress must give its explicit authorization IN THE FORM MANDATED BY THE CONSTITUTION for war to be constitutional. This manner is a declaration of war. Does this mean I think the Korean war and Vietnam were unconstitutional? Yes. Furthermore, the congressional resolution itself is unconstitutional, because it delegates congressional power (declaring war) to the presidency without any guidelines or standards for the president to meet. In doing this, it violates the seperation of powers, and specifically Panama Refining Co. v. Ryan and Schecter Poultry Co. v. US. Congress cannot delegate the powers vested in it to the presidency, though presidents can \"Fill in the details\" of congressional acts. However, the court has specifically said that congress must provide some sort of guidelines and limitations to its delegation, and cannot give the sort of blanket approval that the resolution did.\n Norman then says in spite of this, art. 51 allows self-defense actions and thus the US can do it anyway. This is fallacious for two reasons. First, that this merely says that a defensive action is permissable under UN charters. It doesn't say that the nation can ignore its own legal standards when taking such an action. Third if pre-emption was ok under art 51, the US still has some obligation to prove that it is self-defense to attack Iraq, which it can't because a) Iraq has no weapons capable of reaching America (Al-Samoud missiles have a max range of no more than 100 miles) b) We have no connection from Iraq to al-qaeda except that a few al-qaeda folks are present in baghdad (and some are present in america too, that doesn't mean we support them) and that a pro al-qaeda group has established itself in a section of northern iraq that saddam doesnt even control. It seems highly doubtful that Iraq is supporting a group that has called its leader an infidel. c) Most defense experts agree that attacking Iraq will actually harm our national security interests, because it gives North Korea more oppurtunity to build up ITS arsenal (which currently has missiles that can reach america) but more importantly, because while the last thing Iraq, a secular state, would do is give up its weapons to radical muslim extremists (whose primary goals are to eliminate secular arab states) such as al-qaeda, the one situation where they might do such an action is if the US invades, because then they have nothing to lose by giving there weapons up.\n The Vietnam and N. Korea cases I have already dealt with, b/c they were in my view unconstitutional regardless of UN rules (incidentally, the UN didn't have a true court system, so no \"interpretations\" of UN statutes have been made). Israel is a false analogy because it most certainly has met the burden of proving self-defense. But it has been condemned repeatedly by the UN just the same.\n The War Powers Act, in essence was congress trying to regain some of the power it had lost by overbroad interpretations of executive power. Under a reasonable interpretation of the constitution it wouldn't have been necessary.\n I don't think the antiwar folks will win the case, but I do think that it is reasonable and perhaps even correct. Certainly, they shouldn't be \"reprimanded\" for bringing it. Incidentally, the case was thrown out, but the 1st circuit court of appeals agreed to expdite a hearing on the case, so we'll hear back in a few days. Also of note: 73 law professors signed a brief supporting the case.", 
   {}, 
   4473, 
   null, 
   1047520500.0
  ], 
  [
   4554, 
   null, 
   "Debater", 
   "Congress passed a resolution allowing the Pres to attack Iraq.", 
   {}, 
   4473, 
   null, 
   1047521820.0
  ], 
  [
   4567, 
   null, 
   "kelvin90701", 
   "\"Stupid\" is allowed in this country. Treason does not cover stupid. I am thankful that stupid is not against the law. They are quite obviously stupid.", 
   {}, 
   4473, 
   null, 
   1047528960.0
  ], 
  [
   4569, 
   null, 
   "Broker", 
   "Religion is a cover for these groups. They just hate America, and the only to stop that is for us to all be Muslims. They will always have reasons to hurt America. Saddam claims to be a Muslim. They don't consider him an infidel.", 
   {}, 
   4473, 
   null, 
   1047529320.0
  ], 
  [
   4571, 
   null, 
   "dsadevil", 
   "But it didn't declare war. I know it sounds minute, but constitutionally its a huge distinction. Delegating legislative powers of declaring war to the executive branch violates seperation of powers and Panama and Schecter. Declaring war is exercising the specific constitutional device that grants the president the power to wage war.", 
   {}, 
   4473, 
   null, 
   1047531120.0
  ], 
  [
   4599, 
   null, 
   "Debater", 
   "I read the resolution.\n \n I says that the President may attack Iraq.\n \n It also implies that the resolution is a Declaration of War, but the president can decided whether to attack Iraq.\n \n Not in those words of course, its very technical and legal.", 
   {}, 
   4473, 
   null, 
   1047582720.0
  ], 
  [
   4693, 
   null, 
   "Stormin Norman", 
   "The three-judge panel of the U.S. Court of Appeals for the First Circuit denied the suit brought by 12 House Democrats, a few servicemen and family. The suit named Donald Rumsfeld and President Bush as defendants. The panel said this was a matter to be discussed in the political arena, at this time. Since congress has passed a resolution and nothing is incongruent with the War Powers Act, there is nothing to resolve between Congress and the Presidency. No real conflict has surfaced. Therefore, there is no case. \n \n source: MSNBC", 
   {
    "post_info": {
     "post_title": "Suit Denied"
    }
   }, 
   4473, 
   null, 
   1047648000.0
  ], 
  [
   4737, 
   null, 
   "Broker", 
   "Good.", 
   {}, 
   4473, 
   null, 
   1047668760.0
  ], 
  [
   4740, 
   null, 
   "Debater", 
   "good but not good enough\n \n the group said they will sue again if the UN votes down the resolution or if the US withdraws the resolution. claiming a violation of international law", 
   {}, 
   4473, 
   null, 
   1047669000.0
  ], 
  [
   4844, 
   null, 
   "dsadevil", 
   "The rez doesn't conflict with war powers, it conflicts with the seperation of powers.\n The case should hinge on sep. of powers. I am not surprised they threw the case out, but i dont think its a clear cut as u make it out to be.", 
   {}, 
   4473, 
   null, 
   1047789840.0
  ], 
  [
   4845, 
   null, 
   "Broker", 
   "Then those people have 288 suits to go file...", 
   {}, 
   4473, 
   null, 
   1047791400.0
  ], 
  [
   4847, 
   null, 
   "dsadevil", 
   "???? emoticon_confused ?????", 
   {}, 
   4473, 
   null, 
   1047791580.0
  ], 
  [
   4848, 
   null, 
   "Broker", 
   "Originally posted by Debater \n the group said they will sue again if the UN votes down the resolution or if the US withdraws the resolution. claiming a violation of international law \n \n \n Referring to that. There have been 288 wars without UN resolutions.", 
   {}, 
   4473, 
   null, 
   1047791700.0
  ], 
  [
   4849, 
   null, 
   "Debater", 
   "no...\n \n Congress declares war, but the pres can decide whether or not to attack.", 
   {}, 
   4473, 
   null, 
   1047791700.0
  ], 
  [
   4850, 
   null, 
   "Broker", 
   "Why don't they sue Clinton too?", 
   {}, 
   4473, 
   null, 
   1047791820.0
  ], 
  [
   4852, 
   null, 
   "Debater", 
   "they already tried to... but lost", 
   {}, 
   4473, 
   null, 
   1047792360.0
  ], 
  [
   4857, 
   null, 
   "Broker", 
   "Oh... meh. No hypocrisy! :( lol", 
   {}, 
   4473, 
   null, 
   1047793440.0
  ], 
  [
   4863, 
   null, 
   "Debater", 
   "What do you mean?", 
   {}, 
   4473, 
   null, 
   1047794160.0
  ], 
  [
   4865, 
   null, 
   "Broker", 
   "Well, look at everything. Clinton was about to go in with no vote from Congress, no vote at the UN, and no one on the left complained. They were all pro war. Now that changed. \n \n You\\'d think that they wouldn\\'t file a suit against Clinton, but they did, so there was no hypocrisy. That\\'s a good thing though...", 
   {}, 
   4473, 
   null, 
   1047795060.0
  ], 
  [
   4866, 
   null, 
   "Debater", 
   "If I remember correctly it was the right that time not the left.\n \n Some libertarian oriented republicans filed the suit.", 
   {}, 
   4473, 
   null, 
   1047795240.0
  ], 
  [
   4871, 
   null, 
   "Broker", 
   "I think I saw an interview on Fox and they were from the left. Maybe not.", 
   {}, 
   4473, 
   null, 
   1047797520.0
  ], 
  [
   4961, 
   null, 
   "Debater", 
   "maybe so I don\\'t remember", 
   {}, 
   4473, 
   null, 
   1047927840.0
  ], 
  [
   11269, 
   null, 
   "Morfos", 
   "Oh! so all people against the war in Iraq are now stupid? You *******, we aren\\'t stupid, go to a University and tell them that. Most people at UCSD are against the war. Are they all XXXXXX? According to you they are. According to you, \"all Liberals are XXXXXX\". Even though those with PHDs tend to be Liberal and Anti-War, you continue to say how stupid all of us are for disagreeing with something Bush did. If Clinton fought the same war, you would be against it. Its just because Bush is a Republican you like this war. Oh well, continue to believe everything Rush Limbaugh tells you, continue to believe that Liberals are a bunch of XXXXXX, continue to believe anti-war protesters are pro-Saddam, since that seems to be what most Conservatives as yourself do best.\n \n BTW, You think we are stupid because we are the \"minority\". You think you are correct because you are the \"majority\". But really, we are the majority, you are the minority. In the other counties, most people are against the war! Blair\\'s approval rating droped by 30% when he declared this war. However you continue to act like your the majority and that you are right, and that all other countries\\' medias are biased against us. You act like America is always right. You call us idiotic Saddam lovers, tell that to the whole world jerk.", 
   {}, 
   4847, 
   null, 
   1056936180.0
  ], 
  [
   11277, 
   null, 
   "Broker", 
   "I think I should point out that most of us probably supported Clinton\\'s wars... I did, and I would. People can only name one Republican who was against Clinton\\'s wars and for this one...\n \n Where did you find out that people with PhDs tend to be against the war?\n \n Why do you assume that we listen to Rush? I don\\'t...\n \n Where did you get that number? 55% of Britons approved of the war right before it began... I highly doubt his approval rating was that low.", 
   {}, 
   11269, 
   null, 
   1056940860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Stupid Idiots Sue President Over War in Iraq", 
  "url": "http://www.4forums.com/political/government-debates/373-stupid-idiots-sue-president-over-war-iraq.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 373, 
  "discussion_files": [
   [
    "3873.html", 
    "http://www.4forums.com/political/government-debates/373-stupid-idiots-sue-president-over-war-iraq-print.html"
   ], 
   [
    "3874.html", 
    "http://www.4forums.com/political/government-debates/373-stupid-idiots-sue-president-over-war-iraq-2-print.html"
   ]
  ], 
  "identifier": 373
 }
]