[
 [
  [
   77636, 
   null, 
   "jyoshu", 
   "In the wake of the election which turned out to be about values as much as anything, we find the issue of gay marriage to be of great concern to many Americans. These are some results and consequences.\n \n - The issue of gay marriage has failed the test of what constitutes a civil rights issue. The problem is that marriage is really the issue at hand--not gay rights. To say that marriage has no traditional definition (even as a general understanding) of opposite gender is disingenuous. By far, most people think of marriage as applying to unions between men and women. This is a far different issue than that of rights for African Americans. In the fight for rights of black people, African Americans themselves were the subject of the controversy. It was an issue directly about people. But the subject of the gay marriage issue is marriage itself: should it remain traditional or not? Gay people would probably have much more success in lobbying for benefits in the form of civil unions.\n \n - We need to understand that disagreeement over whether gays should be allowed to have legal same sex marriage is not \"gay-bashing.\" It is not necessarily homophobic. It certainly does not help the cause of gay rights for anyone who voices concern to be maligned with such language as \"homophobe\" or worse, \"gay basher.\" Gay activists are going to have to wake up and accept that just because they hold to a certain opinion, it does not make that opinion right. The country has spoken and obviously most people in the U.S. are not in favor of legalized gay marriage. At this point gay activists have 2 choices. They can a.) remain on their present course of disaster and tick off the rest of the country who is not already tired of their rhetoric, or b.) they can start a dialog and have consideration as to the reasons why the country is so concerned about this issue. \n \n - Democrats are tokenizing gay rights groups. If the recent election and stance by John Kerry does not alarm gay rights activists, something is terribly wrong. In the end, there was very, very little difference in the stance between the two candidates regarding gay rights. The marriage amendment was the only difference, but to be fair, gay activists should say that Kerry saw them no more 'human' than Bush. Unfortunately for gay people, they have been taken and cheated by the Democratic party. The most they have gotten is token words and occassional promises that never really take place. But in the debates, Kerry was just as unappoving of gay marriage as Bush was. So why would gay rights activists overwhelmingly support Kerry and the Democratic party? Can't they see they have been sold a rotten bill of goods? Democrats have been no more helpful in the last 20 years--Clinton himself would not veto DOMA, signing it instead. It is difficult to take gay rights groups seriously when they throw their enthusiastic support at only Democrat canididates who are practically no different than Republican ones on the issue. Frankly, it smacks of partisanship and backroom politics. Gay people are the losers. Does that mean that gay people would be better off supporting Republicans? Not necessarily. But at least a little less blind political allegiance would help. At this point, it would seem that even if the Republican party ran a gay candidate who supported gay marriage enthusiastically, gay rights groups would still endorse the Democrat. Yes, it's THAT bad.\n \n - Gay activists are going to have to accept that that much of the nation considers their issue a moral one. Like it or not, homosexuality as a moral issue is still very much on the table. If anything, this will help our nation to step back and reexamine this issue, to make sure we have not gotten the cart before the horse, so to speak. No one is condoning abuse of gay people, but morality does not necessarily have to be compromised either.\n \n Again, gay activists are at a crossroads. They can continue down the path they are currently making in turning the nation against them, or they can show a degree of understanding and acceptance toward religion and people who consider values to be of importance. At this point, gay activism holds it's own destiny between these two choices.", 
   {
    "post_info": {
     "post_title": "Thoughts in the Wake of the Election Regarding Gay Marriage"
    }
   }, 
   null, 
   null, 
   1100647260.0
  ], 
  [
   77657, 
   null, 
   "JakeCJB", 
   "- The issue of gay marriage has failed the test of what constitutes a civil rights issue. The problem is that marriage is really the issue at hand--not gay rights. To say that marriage has no traditional definition (even as a general understanding) of opposite gender is disingenuous. By far, most people think of marriage as applying to unions between men and women.\n\n \n At one time most people thought of marriage as being only between two persons of the same race. Appeals to tradition and majority is always right arguments don't cut it.\n \n \nThis is a far different issue than that of rights for African Americans. In the fight for rights of black people, African Americans themselves were the subject of the controversy. It was an issue directly about people. But the subject of the gay marriage issue is marriage itself: should it remain traditional or not? Gay people would probably have much more success in lobbying for benefits in the form of civil unions.\n\n \n And the issue of having separate white and black schools, dining rooms and drinking fountains and bus seats, was only about schools, dining rooms, drinking fountains and bus seats. It wasn't an issue about people. Those seats at the back of the bus were just as comfortable as the seats at the front. No need for blacks to complain about being at the back of the bus. They could learn at black schools, and don't have to be in white schools. Blacks could eat just as well in the \"colored\" dining rooms. They didn't have to be at the \"white\" eating counter. Inter-racial marriage was not about black people, even though they were forbidden from marrying a white person, it was about marriage. \n \n \n- We need to understand that disagreeement over whether gays should be allowed to have legal same sex marriage is not \"gay-bashing.\" It is not necessarily homophobic. It certainly does not help the cause of gay rights for anyone who voices concern to be maligned with such language as \"homophobe\" or worse, \"gay basher.\" Gay activists are going to have to wake up and accept that just because they hold to a certain opinion, it does not make that opinion right.\n\n \n Then what are the LOGICAL REASONS for marriage discrimination? Is it because they are gay? If you can't offer any other reason, you are bigoted.\n \n \nThe country has spoken and obviously most people in the U.S. are not in favor of legalized gay marriage.\n\n \n The majority isn't always right. Certainly polling showed a higher majority of people were against inter-racial marriage before it become legal. \n \n \nAt this point gay activists have 2 choices.\n\n \n Why only two?\n \n \nThey can a.) remain on their present course of disaster and tick off the rest of the country who is not already tired of their rhetoric,\n\n \n What rhetoric? Why do you say it's a course for disaster?\n \n \n or b.) they can start a dialog and have consideration as to the reasons why the country is so concerned about this issue.\n\n \n No problem. Let's start that dialog now. What are the logical reasons for banning gay marriage? \n \n \n- Democrats are tokenizing gay rights groups. If the recent election and stance by John Kerry does not alarm gay rights activists, something is terribly wrong. In the end, there was very, very little difference in the stance between the two candidates regarding gay rights. The marriage amendment was the only difference, but to be fair, gay activists should say that Kerry saw them no more 'human' than Bush. Unfortunately for gay people, they have been taken and cheated by the Democratic party. The most they have gotten is token words and occassional promises that never really take place. But in the debates, Kerry was just as unappoving of gay marriage as Bush was. So why would gay rights activists overwhelmingly support Kerry and the Democratic party? Can't they see they have been sold a rotten bill of goods? Democrats have been no more helpful in the last 20 years--Clinton himself would not veto DOMA, signing it instead. It is difficult to take gay rights groups seriously when they throw their enthusiastic support at only Democrat canididates who are practically no different than Republican ones on the issue. Frankly, it smacks of partisanship and backroom politics. Gay people are the losers. Does that mean that gay people would be better off supporting Republicans? Not necessarily. But at least a little less blind political allegiance would help. At this point, it would seem that even if the Republican party ran a gay candidate who supported gay marriage enthusiastically, gay rights groups would still endorse the Democrat. Yes, it's THAT bad.\n\n \n I think the Democrats are generally seen as the lesser of two evils. Your point about gay rights groups perhaps endorsing a Democrat out of blind party loyalty over a pro- gay marriage Republican is an interesting point. Perhaps the answer is for those in all parties who are gay, to be more aggressive in promoting their equality. A lot of work needs to be done in both the Democratic and Republican parties.\n \n \n- Gay activists are going to have to accept that that much of the nation considers their issue a moral one. Like it or not, homosexuality as a moral issue is still very much on the table.\n\n \n It's a moral issue for those fighting for equality and against discrimination too.\n \n \nNo one is condoning abuse of gay people, but morality does not necessarily have to be compromised either.\n\n \n Whose morality will be compromised?\n \n \nAgain, gay activists are at a crossroads. They can continue down the path they are currently making in turning the nation against them,\n\n \n This is again a majority is always right, argument.\n \n \nor they can show a degree of understanding and acceptance toward religion and people who consider values to be of importance.\n\n \n There is a separation of church and state. What does religion have to do with civil rights? Gays and lesbians and their supporters consider values to be important too.", 
   {}, 
   77636, 
   null, 
   1100657460.0
  ], 
  [
   77660, 
   null, 
   "samNH", 
   "Those who oppose same-sex marriage use say it will destroy heterosexual marriage, but they never say how. There is nothing sanctimonious about a legal contract between two consenting adults, which is what a civil marriage is. How allowing two people of the same sex who wish to committ to each other in this manner will destroy other's right to the same is just plain nonsense. It is only fair that all people should have equality of opportunity for themselves and their families.", 
   {}, 
   77657, 
   null, 
   1100658900.0
  ], 
  [
   77669, 
   null, 
   "jyoshu", 
   "At one time most people thought of marriage as being only between two persons of the same race. Appeals to tradition and majority is always right arguments don't cut it.\n Again however, it did not infringe upon the most fundamental aspect of marriage in most people's minds: that of the fact that men marry women and women marry men. I agree with you however that oppostion over interracial marriage was unwarranted. I just don't feel the analogy fits. What is a civil rights issue in one case does not automatically mean the next case will be a civil rights issue. Going past the opposite gender standard of marriage gets us into an anything-goes view of marriage, which is not good.\n And the issue of having separate white and black schools, dining rooms and drinking fountains and bus seats, was only about schools, dining rooms, drinking fountains and bus seats.\n No, I don't think the subject of those arguements were whether or not the traditional view of the water fountain or seats were being questioned. I remember those issues and it was very clear that we were dealing with black people and everyone knew that was what it was about. The issue of marriage is much less cut and dry. The subject of this debate is marriage itself and the fact that some want traditional marriage challenged as the standard.\n Then what are the LOGICAL REASONS for marriage discrimination? Is it because they are gay? If you can't offer any other reason, you are bigoted.\n So if an argument does not meet your criteria of logic, the person giving it is bigoted? You see, you are doing exactly as I was talking about, and this is the very sort of thing that has led to values becoming such an issue in the recent election. No, the reasons most people want to protect traditional marriage are personal deeply-held reasons, not necessarily those of cold heartless logic. The problem is that gay activists refuse to accept and consider the concerns of many people and the fact that these people are essentially being asked to suddenly turn their back on deeply held time honored beliefs. It is simply not going to happen. You might as well be asking religious people to turn their backs on other deeply held religious beliefs as well. Would you also expect them to stop believing in God? This isn't an issue of logic, but of personal belief.\n The majority isn't always right.\n That is true, but neither is the minority always right.\n What rhetoric? Why do you say it's a course for disaster?\n The rhetoric of name-calling such as \"bigot\" or \"hateful\", when in fact people are simply holding to their religious beliefs. It is a disaster because the gay activists' rhetoric is starting to really anger people in this country, hence the election recently about values.\n Whose morality will be compromised?\n The morality of those you are expecting to turn their backs on their religious belief by supporting gay marriage.", 
   {}, 
   77660, 
   null, 
   1100663640.0
  ], 
  [
   77696, 
   null, 
   "JakeCJB", 
   "Again however, it did not infringe upon the most fundamental aspect of marriage in most people's minds: that of the fact that men marry women and women marry men. I agree with you however that oppostion over interracial marriage was unwarranted. I just don't feel the analogy fits.\n\n \n It infringed on a fundamental aspect to them in their beliefs that marriage should be between members of the same race. Here we are talking about sex, only sex. \n \n \nWhat is a civil rights issue in one case does not automatically mean the next case will be a civil rights issue. Going past the opposite gender standard of marriage gets us into an anything-goes view of marriage, which is not good.\n\n \n I doubt an anything-goes view of marriage will happen.\n \n \nNo, I don't think the subject of those arguements were whether or not the traditional view of the water fountain or seats were being questioned. I remember those issues and it was very clear that we were dealing with black people and everyone knew that was what it was about.\n\n \n Segregation was a tradition, in its various forms. We're dealing with gay people, here.\n \n \nSo if an argument does not meet your criteria of logic, the person giving it is bigoted? You see, you are doing exactly as I was talking about, and this is the very sort of thing that has led to values becoming such an issue in the recent election.\n\n \n I can't imagine a more subjective criteria than \"values\". If you say as you go on to, that it's simply a personal belief (in favour of bias and discrimination and inequality against a particular group), and give no other reasoning, and you want to impose this, then it's bigotry. It's my personal belief that gay marriage is just as good as straight marriage. I'm not willing to toss out logic for it's my personal belief and it's been this way or that way and there's the majority type of circular arguments. I'll question this. \n \n \nNo, the reasons most people want to protect traditional marriage are personal deeply-held reasons, not necessarily those of cold heartless logic. The problem is that gay activists refuse to accept and consider the concerns of many people and the fact that these people are essentially being asked to suddenly turn their back on deeply held time honored beliefs. It is simply not going to happen. You might as well be asking religious people to turn their backs on other deeply held religious beliefs as well. Would you also expect them to stop believing in God? This isn't an issue of logic, but of personal belief.\n\n \n People can still keep their \"traditional\" marriage, they don't have to turn their backs on it. Just don't impose those very personal and religious beliefs on all of us, expect it to affect public, government policy, equality rights. Equal rights don't take away the rights of others.", 
   {}, 
   77669, 
   null, 
   1100672280.0
  ], 
  [
   77751, 
   null, 
   "JustineCredible", 
   "At one time most people thought of marriage as being only between two persons of the same race. Appeals to tradition and majority is always right arguments don't cut it.\n Again however, it did not infringe upon the most fundamental aspect of marriage in most people's minds: that of the fact that men marry women and women marry men. I agree with you however that oppostion over interracial marriage was unwarranted. I just don't feel the analogy fits. What is a civil rights issue in one case does not automatically mean the next case will be a civil rights issue. Going past the opposite gender standard of marriage gets us into an anything-goes view of marriage, which is not good.\n And the issue of having separate white and black schools, dining rooms and drinking fountains and bus seats, was only about schools, dining rooms, drinking fountains and bus seats.\n No, I don't think the subject of those arguements were whether or not the traditional view of the water fountain or seats were being questioned. I remember those issues and it was very clear that we were dealing with black people and everyone knew that was what it was about. The issue of marriage is much less cut and dry. The subject of this debate is marriage itself and the fact that some want traditional marriage challenged as the standard.\n Then what are the LOGICAL REASONS for marriage discrimination? Is it because they are gay? If you can't offer any other reason, you are bigoted.\n So if an argument does not meet your criteria of logic, the person giving it is bigoted? You see, you are doing exactly as I was talking about, and this is the very sort of thing that has led to values becoming such an issue in the recent election. No, the reasons most people want to protect traditional marriage are personal deeply-held reasons, not necessarily those of cold heartless logic. The problem is that gay activists refuse to accept and consider the concerns of many people and the fact that these people are essentially being asked to suddenly turn their back on deeply held time honored beliefs. It is simply not going to happen. You might as well be asking religious people to turn their backs on other deeply held religious beliefs as well. Would you also expect them to stop believing in God? This isn't an issue of logic, but of personal belief.\n The majority isn't always right.\n That is true, but neither is the minority always right.\n What rhetoric? Why do you say it's a course for disaster?\n The rhetoric of name-calling such as \"bigot\" or \"hateful\", when in fact people are simply holding to their religious beliefs. It is a disaster because the gay activists' rhetoric is starting to really anger people in this country, hence the election recently about values.\n Whose morality will be compromised?\n The morality of those you are expecting to turn their backs on their religious belief by supporting gay marriage.\n\n \n \n Let me make this simple for you: Seperate but Equal is NEITHER!", 
   {}, 
   77669, 
   null, 
   1100722560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Thoughts in the Wake of the Election Regarding Gay Marriage", 
  "url": "http://www.4forums.com/political/gay-rights-debates/3739-thoughts-wake-election-regarding-gay-marriage.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 3739, 
  "discussion_files": [
   [
    "5887.html", 
    "http://www.4forums.com/political/gay-rights-debates/3739-thoughts-wake-election-regarding-gay-marriage-print.html"
   ]
  ], 
  "identifier": 3739
 }
]