[
 [
  [
   77788, 
   null, 
   "Cthulhu", 
   "The zygote is the cell formed when the sperm fertilises the egg. The zygote has no brain, it has no conciousness.\n \n You have two tables, one with a small test tube which you know holds a microscopically small living zygote, and another table with a live baby.\n \n You are told that one of them will be destroyed and you have just two seconds to decide which, or both will be destroyed. Without a seconds thought I would immediately point in the direction of the zygote, and save the life of the baby.\n \n Extreme pro-lifers on the otherhand would probably end up killing the baby or both via indecision and inability to make a choice in just 2 seconds. That's the morality of pro-life for you: the inability to realise that the chemical reactions that happen when a sperm meets an egg do not define a human person.\n \n Am I wrong? I don't believe so. The sperm meeting the egg is a really random point to decide the emergance of a human person. Why pick that point specifically?", 
   {
    "post_info": {
     "post_title": "Dilema"
    }
   }, 
   null, 
   null, 
   1100743560.0
  ], 
  [
   214670, 
   null, 
   "King Blue", 
   "A zygote and a baby to me are the same thing. I wouldn't tell someone to kill either. Both are equal. The only difference is that one of them is older than the other.", 
   {
    "post_info": {
     "post_title": "BLue"
    }
   }, 
   77788, 
   null, 
   1148841600.0
  ], 
  [
   214897, 
   null, 
   "Prototype", 
   "If I were confronted by that scenario, I would not pick either to be destroyed even if I had too. I would not entertain the notion.\n \n A zygote is just as viable as a human being as a born baby. Not knowing that it was being killed doesn't make it any less wrong. It's injustice to the first-degree. Killing either would be evil, and I would not be a tool to such a deed.", 
   {}, 
   214670, 
   null, 
   1149094680.0
  ], 
  [
   214898, 
   null, 
   "thelmoose", 
   "A zygote is just as viable as a human being as a born baby.\n\n \n That is an incorrect statement. \n \n Viability seems to be the topic that gets little mention here. Humanity, consciousness, personhood, sentience, etc. are all extremely debatable, as has been demonstrated, sometimes ad nauseam. \n \n But viability outside another human being is a clearly distinct difference between a zygote and a new-born baby.", 
   {}, 
   214897, 
   null, 
   1149095460.0
  ], 
  [
   214908, 
   null, 
   "Steeeeve", 
   "In the never going to happen scenario I wouldn't pick because I wouldn't pick between two 30yr olds sitting there.\n \n You could say \"if you have your mother (assume you love your mother) on one table and a random person on the other table which would you choose to kill or both die\"...if you picked your mother to live does that mean the other person is less of a human worthy of rights?\n \n Spare me the ridicious scenarios.", 
   {}, 
   214898, 
   null, 
   1149101400.0
  ], 
  [
   215016, 
   null, 
   "Another opinion", 
   "In the never going to happen scenario I wouldn't pick because I wouldn't pick between two 30yr olds sitting there.\n \n You could say \"if you have your mother (assume you love your mother) on one table and a random person on the other table which would you choose to kill or both die\"...if you picked your mother to live does that mean the other person is less of a human worthy of rights?\n \n Spare me the ridicious scenarios.\n\n Cthulhu may go too far in his/her assumptions about the indecision of pro-life people, but his scenario does bring up an interesting challenge. I'm sure that it was never meant to be presented as a realistic scenario - that was not the point. The point was to try to make pro-life people admit that the baby is more worthy of consideration than the newly fertilized zygote. Your example of choosing between ones mother and a stranger is equally unrealistic for most of us but does not address the same type of question (the question in that case being how much worth one places on personal connections in deciding the worth of a person).\n \n There are occasional situations in life where one is faced with choosing between two awful choices and one can only choose the lesser of two evils. Those type of situations can be quite interesting since they reveal to us our priorities and details of our moral reasoning. I remember being comfronted with the too-many-people-on-a-lifeboat scenario (so how does one decide who lives and dies) during comfirmation years back - again to force us to explore our moral reasoning.\n \n Cthulhu's scenario may be an unrealistic one but would force someone who is pro-life to consider the relative worth of the baby vs zygote. It may be a very uncomfortable question (all of the lesser-of-two-evils questions are) but can be quite revealing. Given that introduction, if you or other pro-life people were faced with that awful choice, would you:\n 1) Consider both so exactly equally worthy that you would indeed be frozen in indecision, or possibly decide based on chance (a flip of a coin)\n 2) Choose one over the other based on moral considerations\n \n Note: I believe it would be obvious to almost everyone that your choosing one over the other does not mean that you condone the killing of that other. It would be just a choice of the lesser of two evils, where it is acknowledged that both choices, in your view, would be evil.", 
   {}, 
   214908, 
   null, 
   1149179040.0
  ], 
  [
   215019, 
   null, 
   "Steeeeve", 
   "Cthulhu may go too far in his/her assumptions about the indecision of pro-life people, but his scenario does bring up an interesting challenge. I'm sure that it was never meant to be presented as a realistic scenario - that was not the point. The point was to try to make pro-life people admit that the baby is more worthy of consideration than the newly fertilized zygote. Your example of choosing between ones mother and a stranger is equally unrealistic for most of us but does not address the same type of question (the question in that case being how much worth one places on personal connections in deciding the worth of a person).\n \n There are occasional situations in life where one is faced with choosing between two awful choices and one can only choose the lesser of two evils. Those type of situations can be quite interesting since they reveal to us our priorities and details of our moral reasoning. I remember being comfronted with the too-many-people-on-a-lifeboat scenario (so how does one decide who lives and dies) during comfirmation years back - again to force us to explore our moral reasoning.\n \n Cthulhu's scenario may be an unrealistic one but would force someone who is pro-life to consider the relative worth of the baby vs zygote. It may be a very uncomfortable question (all of the lesser-of-two-evils questions are) but can be quite revealing. Given that introduction, if you or other pro-life people were faced with that awful choice, would you:\n 1) Consider both so exactly equally worthy that you would indeed be frozen in indecision, or possibly decide based on chance (a flip of a coin)\n 2) Choose one over the other based on moral considerations\n \n Note: I believe it would be obvious to almost everyone that your choosing one over the other does not mean that you condone the killing of that other. It would be just a choice of the lesser of two evils, where it is acknowledged that both choices, in your view, would be evil.\n\n \n You almost explained why my example actually does work. If you pick a mother over a stranger or pick someone to be kicked out of the lifeboat you pretty much placed a value on different people. The same thing is true with the zygote and baby. My point is that if you can't infer that abortion is ok even if you choose the born baby. This is the case because the person getting kicked out of the lifeboat or the stranger getting killed (assuming you picked your mother to live) all are worthy to have the right to life. Likewise I believe the test tube baby has a right to live as well (I assume the test tube baby will actually be able to live at some point in time) but that doesn't mean you can't pick the baby to live and thus make abortion ok.", 
   {}, 
   215016, 
   null, 
   1149180360.0
  ], 
  [
   215022, 
   null, 
   "Mickey Shane", 
   "One possible choice was left out of the original decision. If I recall the lifeboat question, it was possible to chose one's self for water treading duty.\n \n Therefore, the correct moral response to the original question would be:\n \n Kill the zygote. Suicide is a sin.", 
   {}, 
   215019, 
   null, 
   1149182340.0
  ], 
  [
   215023, 
   null, 
   "Steeeeve", 
   "One possible choice was left out of the original decision. If I recall the lifeboat question, it was possible to chose one's self for water treading duty.\n \n Therefore, the correct moral response to the original question would be:\n \n Kill the zygote. Suicide is a sin.\n\n \n Suicide may be but sacrific isn't. Choosing your own life to save another is sacrific :)", 
   {}, 
   215022, 
   null, 
   1149184020.0
  ], 
  [
   215029, 
   null, 
   "Mickey Shane", 
   "Suicide may be but sacrific isn't. Choosing your own life to save another is sacrific :)\nChoosing to sacrifice myself instead of one of two children, teens, or younger adults would be doable. \n \n Posed the original question, the zygote dies. Would you sacrifice your own life for a zygote? Suppose, for a second, that the decision is either one of two zygotes, or youself? \n \n Should I ever decide to sacrifice my own life, so that a couple of zygotes may live, please don't tell my friends.", 
   {}, 
   215023, 
   null, 
   1149187620.0
  ], 
  [
   215033, 
   null, 
   "Steeeeve", 
   "Choosing to sacrifice myself instead of one of two children, teens, or younger adults would be doable. \n \n Posed the original question, the zygote dies. Would you sacrifice your own life for a zygote? Suppose, for a second, that the decision is either one of two zygotes, or youself? \n \n Should I ever decide to sacrifice my own life, so that a couple of zygotes may live, please don't tell my friends.\n\n \n would you choose to kill three strangers to save your mother (assume they are unrelated parties) \n \n The idea that you would pick one over another doesn't prove abortion is ok nor does it prove abortion isn't ok. I for one will not choose which life lives or dies...lets hope I am never in that situation though :)", 
   {}, 
   215029, 
   null, 
   1149190020.0
  ], 
  [
   215034, 
   null, 
   "Another opinion", 
   "You almost explained why my example actually does work. If you pick a mother over a stranger or pick someone to be kicked out of the lifeboat you pretty much placed a value on different people. The same thing is true with the zygote and baby. My point is that if you can't infer that abortion is ok even if you choose the born baby. This is the case because the person getting kicked out of the lifeboat or the stranger getting killed (assuming you picked your mother to live) all are worthy to have the right to life. Likewise I believe the test tube baby has a right to live as well (I assume the test tube baby will actually be able to live at some point in time) but that doesn't mean you can't pick the baby to live and thus make abortion ok.\n\n Like I said in the added Note in my post, I understand that, if you picked the baby to live, you would not be condoning the killing of the zygote. THe point was to see if you saw a difference in their relative worth.\n \n In the mother vs. stranger choice, I would obviously chooses my mother to live - not because I think she is worthier on a global scale (ex. it might be a choice between her and a saintly person) but because she is worth more to ME and I have no problem showing my preference in that situation. That other person may be somebody else's mother worth more to them than mine, but I would have been the one deciding. It would be a choice based on a situation uniquely personal to ourselves - subjective reasoning, not objective moral reasoning. Therefore, it is not as relevant.\n \n The lifeboat scenario is more relavant since that is a situation which adresses our objective moral reasoning. If I were forced to make the choice, then I would probably also volunteer to go out of the boat (that is the subjective aspect). When that wouldn't be enough, I probably would make the excrutiating choice for the old to leave (since they have less life left in front of them) or, if there is a violent criminal in the boat, I might have them leave as well (their violent acts toward others would have reduced their worth to the larger society compared to others). Those decisions would certainly not mean that I condone the killing of the elderly or of criminals. However, these decisions are the decisions that address my objective moral reasoning in this very unusual situation. \n \n Similarly, the decision of killing the baby vs. zygote is not one that says that you condone the killing of one. Either beings have identical worth or they have some level of relative worth in certain situations. In the lifeboat scenario, one choice is to say that everyone has equal worth and we draw straws. In the baby vs. zygote situation, are you saying that you view them as being so identically equal in worth that you would draw straws, flip a dice, etc. to decide? (Namely, rely on chance?)", 
   {}, 
   215019, 
   null, 
   1149190560.0
  ], 
  [
   215038, 
   null, 
   "Steeeeve", 
   "Like I said in the added Note in my post, I understand that, if you picked the baby to live, you would not be condoning the killing of the zygote. THe point was to see if you saw a difference in their relative worth.\n \n In the mother vs. stranger choice, I would obviously chooses my mother to live - not because I think she is worthier on a global scale (ex. it might be a choice between her and a saintly person) but because she is worth more to ME and I have no problem showing my preference in that situation. That other person may be somebody else's mother worth more to them than mine, but I would have been the one deciding. It would be a choice based on a situation uniquely personal to ourselves - subjective reasoning, not objective moral reasoning. Therefore, it is not as relevant.\n I understand your point but it is still wrong for the stranger to die even though one is worth more to you. Their is no universal truth to the idea that the zygote is less worthy than the born baby. If this were true than we wouldn't be having this debate. So like the mother, you decided what is more important to you and choose. This doesn't make the death of the other any less wrong...I think you tried to state this point though (correct me if I am wrong).\n \n \nThe lifeboat scenario is more relavant since that is a situation which adresses our objective moral reasoning. If I were forced to make the choice, then I would probably also volunteer to go out of the boat (that is the subjective aspect). When that wouldn't be enough, I probably would make the excrutiating choice for the old to leave (since they have less life left in front of them) or, if there is a violent criminal in the boat, I might have them leave as well (their violent acts toward others would have reduced their worth to the larger society compared to others). Those decisions would certainly not mean that I condone the killing of the elderly or of criminals. However, these decisions are the decisions that address my objective moral reasoning in this very unusual situation.\n I don't know which situation is more relevant but I do believe that the person that died had a wrongful death. Not to blame any person on the boat but you would be placing less value on someone in the boat and thus creating a sub-class of person....like a slave was (although i realize this was to much more of an extreme). This doesn't shift the abortion debate too much in my opinion though.\n \n \nSimilarly, the decision of killing the baby vs. zygote is not one that says that you condone the killing of one. Either beings have identical worth or they have some level of relative worth in certain situations. In the lifeboat scenario, one choice is to say that everyone has equal worth and we draw straws. In the baby vs. zygote situation, are you saying that you view them as being so identically equal in worth that you would draw straws, flip a dice, etc. to decide? (Namely, rely on chance?)\n I actually wouldn't choose....I suppose the draw straws idea is just as bad because you still are supporting the death of another (admittly you probably aren't thinking rational at this point in time).\n \n In the case of abortion these scenarios really only come up with the life of the mother arguement (assuming the baby won't die if the mother does...this is way less than 1% of abortions). Most abortions you don't have to place value on life...and thus it becomes more like \"let the zygote live and deny the unborn baby a prepaid college eduation or vise versa.\" In this case I choose to let a person live.", 
   {}, 
   215034, 
   null, 
   1149191340.0
  ], 
  [
   215044, 
   null, 
   "Another opinion", 
   " I actually wouldn't choose....I suppose the draw straws idea is just as bad because you still are supporting the death of another (admittly you probably aren't thinking rational at this point in time).\n\n In the scenario that was presented, if you didn't choose, then both would die. This is what would force you to choose. This was also the case for the lifeboat scenario because the description of the original lifeboat scenario was that all would die of dehydration / starvation if some were not sacrificed. These morality challenges would not be challenges if we had an easy way out. Of course, I would not want anyone on the lifeboat to die or would not want the stranger to die. However, in both those situations, the circumstances would force me to commit an evil. That is where one chooses the lesser of two evils.\n \nMost abortions you don't have to place value on life...and thus it becomes more like \"let the zygote live and deny the unborn baby a prepaid college eduation or vise versa.\" In this case I choose to let a person live.\n\n I would say that there are two issues involved here:\n 1) Is there a relative scale of worth where zygotes vs babies are concerned?\n 2) Where does one place the threshold of worth where the right to life of the zygote or baby supercedes that of the mother?\n \n For me, I do believe that there is a relative scale of worth (yes to point 1). As for point 2, I believe that the threshold should be placed between the two - i.e. at the point when fetus starts having a mind. Therefore, I would be willing to sacrifice a zygote for a mother's rights but not a baby or (except for a few rare scenarios) late term fetus.\n \n I know that you set your threshold of worth (point 2) at the beginning of pregnancy - i.e. at anything at or above a zygote. The point of the challenge was to see if you also see a relative scale of worth (point 1). In your case, you might then see one being worth more than the other (ex. baby over zygote) but the threshold that you set would require that both have the right to life (no abortion of either).", 
   {}, 
   215038, 
   null, 
   1149196200.0
  ], 
  [
   215046, 
   null, 
   "Mickey Shane", 
   "would you choose to kill three strangers to save your mother (assume they are unrelated parties) \n \n The idea that you would pick one over another doesn't prove abortion is ok nor does it prove abortion isn't ok. I for one will not choose which life lives or dies...lets hope I am never in that situation though :)\nYou didn't answer my question. \n \n Would you sacrifice yourself to save a zygote?\n \n I'll answer your's.\n \n Yes.", 
   {}, 
   215033, 
   null, 
   1149196680.0
  ], 
  [
   215048, 
   null, 
   "thelmoose", 
   " You have two tables, one with a small test tube which you know holds a microscopically small living zygote, and another table with a live baby.\n \n You are told that one of them will be destroyed and you have just two seconds to decide which, or both will be destroyed. Without a seconds thought I would immediately point in the direction of the zygote, and save the life of the baby.\n \n\n \n A no-brainer.\n Zayonara zygote!", 
   {}, 
   77788, 
   null, 
   1149199080.0
  ], 
  [
   215053, 
   null, 
   "Caprii", 
   "The zygote is the cell formed when the sperm fertilises the egg. The zygote has no brain, it has no conciousness.\n \n You have two tables, one with a small test tube which you know holds a microscopically small living zygote, and another table with a live baby.\n \n You are told that one of them will be destroyed and you have just two seconds to decide which, or both will be destroyed. Without a seconds thought I would immediately point in the direction of the zygote, and save the life of the baby.\n \n Extreme pro-lifers on the otherhand would probably end up killing the baby or both via indecision and inability to make a choice in just 2 seconds. That's the morality of pro-life for you: the inability to realise that the chemical reactions that happen when a sperm meets an egg do not define a human person.\n \n Am I wrong? I don't believe so. The sperm meeting the egg is a really random point to decide the emergance of a human person. Why pick that point specifically?\n\n \n Let me pose a hypothetical question.\n \n Same scenario as yours above but instead there is a genetically normal zygote on one table or on the other table, there is a mentally retarded newborn baby...which one will you choose if you had 2 seconds to choose?\n \n You see life is existant at both stages, at the single cell and the newborn baby, but our view (sometimes ignorance, sometimes selfishness) is why we choose what we choose.\n \n \n So do tell me which one you will choose?", 
   {}, 
   77788, 
   null, 
   1149204360.0
  ], 
  [
   215056, 
   null, 
   "Another opinion", 
   "Let me pose a hypothetical question.\n \n Same scenario as yours above but instead there is a genetically normal zygote on one table or on the other table, there is a mentally retarded newborn baby...which one will you choose if you had 2 seconds to choose?\n \n\n Though I know you directed this question at Cthulhu, I will nonetheless jump in to say that I would quickly choose the newborn mentally retarded baby to live and the zygote to die. That is obvious to me since the mentally retarded baby is a currently existing person vs. the zygote being merely a potential person. That zygote may have more potential for the future but the decision is being made in the present. I would feel far more guilt in sentencing a real person to die than in sentencing a potential person (now merely a cell) to die.", 
   {}, 
   215053, 
   null, 
   1149205200.0
  ], 
  [
   215061, 
   null, 
   "Steeeeve", 
   "\n I know that you set your threshold of worth (point 2) at the beginning of pregnancy - i.e. at anything at or above a zygote. The point of the challenge was to see if you also see a relative scale of worth (point 1). In your case, you might then see one being worth more than the other (ex. baby over zygote) but the threshold that you set would require that both have the right to life (no abortion of either).\n\n I see what you are saying now. I don't place one worth over another..however, in these kinds of situations I doubt I would have the capacity to think as I am right now...in fact, I doubt many would. So I must say I don't know because I have never been in that position. I'm sure even you would like to say that you believe your mom and the person next to her have equal rights are should be the same...but those situations produce rather odd results. \n \n \nYou didn't answer my question.\n \n Would you sacrifice yourself to save a zygote?\n \n I'll answer your's.\n \n Yes.\n I don't know if I would or not. I think that might get into a religious aspect with me ;).\n \n \n As for the post above this one....you could go on with this example and say \"what if you knew the zygote would cure cancer\" and random stuff like that. In the end, this doesn't relate too much with abortion ;)", 
   {}, 
   215044, 
   null, 
   1149207540.0
  ], 
  [
   215104, 
   null, 
   "Another opinion", 
   "I see what you are saying now. I don't place one worth over another..however, in these kinds of situations I doubt I would have the capacity to think as I am right now...in fact, I doubt many would. So I must say I don't know because I have never been in that position. I'm sure even you would like to say that you believe your mom and the person next to her have equal rights are should be the same...but those situations produce rather odd results. \n\n Indeed, if faced with dire choices such as the lifeboat scenario or (in your case) the zygote vs baby choice, it would indeed be quite difficult if not impossible to make that decision instantly. We might all be stuck in temporary indecision. However, it is interesting to ponder such questions hypothetically while we have a lot of time to consider them since such questions do challenge us and reveal to ourselves and to others the details of our moral reasoning. \n \n In the choice between my mother and a stranger, I just know that I would choose my mother to live in nearly all circumstances. That is an unusual example, though, since it introduces an external influence (i.e. personal connection) into an otherwise objective moral reasoning question where, in general, if it were not MY mother, I would say that they both have equal rights to life. \n \n That is why I come back to the lifeboat issue since that addresses our objective moral reasoning (assuming that everyone on the lifeboat is a stranger). I suppose that, in general, I really do think that the young would deserve a chance for life more than the old (who have already had their time to live) in situations where such a choice has to be made. Of course, I think that they all deserve a chance to live but we don't always have that choice. In general, then, where my deliberations on morality are concerned, I do view moral issues as having relative scales and thresholds, not as black and white issues. For example, a murderer who tortures his victims is worse than one who kills them quickly, though both are bad. Having a relative scale does not necessarily have to be a dillution of our moral stance.", 
   {}, 
   215061, 
   null, 
   1149266280.0
  ], 
  [
   215222, 
   null, 
   "Prototype", 
   "That is an incorrect statement. \n \n Viability seems to be the topic that gets little mention here. Humanity, consciousness, personhood, sentience, etc. are all extremely debatable, as has been demonstrated, sometimes ad nauseam. \n\n \n To you, it may be an incorrect statement. But if it is, you have to tell me what it is you kill and take the life away from when you abort the zygote. Not knowing if it is being killed or not knowing someone wants to kill it makes no difference. Injustice is still practiced there, and not even some abortion doctors realize it.\n \n \nBut viability outside another human being is a clearly distinct difference between a zygote and a new-born baby. \n\n \n There's a distinct difference... so what? No baby at any age can live outside the womb. It still needs care and attention like any other. This difference in age doesn't mean anything.", 
   {}, 
   214898, 
   null, 
   1149384960.0
  ], 
  [
   215226, 
   null, 
   "thelmoose", 
   "To you, it may be an incorrect statement. But if it is, you have to tell me what it is you kill and take the life away from when you abort the zygote. Not knowing if it is being killed or not knowing someone wants to kill it makes no difference. Injustice is still practiced there, and not even some abortion doctors realize it. \n\n \n Whoa, sparky.\n You said, \"A zygote is just as viable as a human being as a born baby.\"\n Maybe the word \"viable\" is what you and I have a different definition of. I say it means able to survive outside a uterus, without being totally reliant on umbilical blood flow, placenta, etc. A baby who is born is able to breathe and eat and live physically separated from another human being.\n \n Whether you think it matters or not is a different story, but a fetus is most definitely not as viable as a baby up until, well it varies - 38 weeks for sure and the probability is progressively less with each fewer number of weeks. I happen to think that distinction is crucial to the discussion here, because the body of another human is necessary for viability prior to a certain gestational age. To me, that is the crux of the argument.\n \n Maybe you didn't mean what I thought you meant when you used (or misused) the word viable. It's a big word.", 
   {}, 
   215222, 
   null, 
   1149388200.0
  ], 
  [
   215527, 
   null, 
   "Prototype", 
   "I don't know if you read the last part of my post, but I'll repeat it more clearly.\n \n A baby is always reliant and demanding of another person's care. A baby outside of the womb still depends on its mother (or somebody at least) to consistently keep him fed, to help him sleep and to change his diapers. A baby can stay alive for a bare minimum of time outside the womb, but it still needs care.\n \n Viable may not be the right word for you. Maybe I should say as \"Genuine\" a baby as the newborn. And you're correct when you said: \"\"The probability is progressively less with each fewer number of weeks.\" But that only makes sense when the womb is empty. When the womb is occupied, it is occupied with a living functioning baby.", 
   {}, 
   215226, 
   null, 
   1149625380.0
  ], 
  [
   215617, 
   null, 
   "simone", 
   "I don't know if you read the last part of my post, but I'll repeat it more clearly.\n \n A baby is always reliant and demanding of another person's care. A baby outside of the womb still depends on its mother (or somebody at least) to consistently keep him fed, to help him sleep and to change his diapers. A baby can stay alive for a bare minimum of time outside the womb, but it still needs care.\n \n Viable may not be the right word for you. Maybe I should say as \"Genuine\" a baby as the newborn. And you're correct when you said: \"\"The probability is progressively less with each fewer number of weeks.\" But that only makes sense when the womb is empty. When the womb is occupied, it is occupied with a living functioning baby.\nFunctioning? The fetus breathes freely? It cries when it is hungry or uncomfortable? It demands attention? It smiles and coos and is cute to those who behold it?\n \n Wow! Didn't know that fetuses were that active and functional.", 
   {}, 
   215527, 
   null, 
   1149694920.0
  ], 
  [
   218506, 
   null, 
   "Taurine", 
   "Abortion is such a tough topic because much of it relies on ones religious beleifes and or upbringing. I beleive I would destroy the zygote, for obvious reasons but that's only because its more easy to get attatched to the baby. You see it as the real, loving thing it is with emotions and the ability to feel pain. So when a person thinks of a baby they think of a fetus.\n \n But its not a baby, its a fetus. Its not declared a baby untill its passed out of the womb and taken its first breath of air. You wouldnt see a tadpole and shout \"FROG\", would you? People need to get over their high strung emotions and realise whats what. I beleive when it is still a fetus, meaning still in the womans body, then it is her decision and her decision alone. No consent from a spouse, no consent from parents. And personally, I dont like the idea of someone putting restrictions on my vagina. I like to beleive its the last thing I have controll over on this lovely green planet.\n \n So, in conclusion, if you want to kill the fetus then kill it. Live with it. If you dont, then mind your buisness and stop butting into peoples personal lives. Not letting a woman abort HER child, making her have a baby she obviously dosent want, next are they going to start making laws that women HAVE to get pregnant?! Its almost to the point of hilarity, honestly, to know that the women of america STILL arent allowed to run their own lives.", 
   {}, 
   215617, 
   null, 
   1151007600.0
  ], 
  [
   218510, 
   null, 
   "Phyllis", 
   "...Not letting a woman abort HER child...\n\n Interesting choice of words for someone who believes it is not a baby until \"[it has] passed out of the womb and taken its first breath of air.\" Perhaps this was just a freudian slip? Or perhaps you have inadvertantly recognized abortion for what it is: the deliberate removal of life from a child. And if that is what abortion is, whose child it is does not matter; for, we have long since abandoned the notion that certain people are nothing more than someone else's property. It may be \"HER child.\" But a child it is. And SHE has no right to 1) kill it, or 2) have it killled.\n \n All this mantra about keeping one's moral beliefs to themselves is a load of crock, by the way. It does not make for a convincing argument in the least.\n \n In addition, your vain attempt at the slippery slope argument is likewise unconvincing. No one is going to pass a law forcing women to become pregnant against their will. In fact, we have laws which prohibit that.\n \n Also, your feminism is over the top. Women in America are allowed to run their own lives the same way men are: within the boundaries of the law.", 
   {}, 
   218506, 
   null, 
   1151009340.0
  ], 
  [
   218513, 
   null, 
   "Taurine", 
   "Yes, I admit it, it was a slip of wording. Everyone makes mistakes. Let me make it clear that I do not think abortion is in any way right, I DO however like the idea of having a desicion of sorts when it comes to my womb. And I guess you missed my sad attempt at sarcasm with the whole \"forcing women to get pregnant\" joke. Im not completly ignorant.\n \n I also admit I might not be the world champion debator but I do know what my opinions are and where I stand. So what are you saying, that my opinions are vauge and poorly constructed, or that women shouldnt have controll over their own bodies? My main point is that If I remember correctly their was some dispute over consent of the spouse and or parents.\n \n And I LIKE my femminism.", 
   {}, 
   218510, 
   null, 
   1151010300.0
  ], 
  [
   218517, 
   null, 
   "Steeeeve", 
   "Well, if you can kill your own child than why stop at birth? \n \n And if we are calling things what they are than a child is a child and a human is a human....the fetus is a human :). \n \n So you support some humans killing other humans? Interesting....and you preach for people butting out of your life...why do feel you should choose whether or not to kill someone else then?", 
   {}, 
   218513, 
   null, 
   1151011440.0
  ], 
  [
   218534, 
   null, 
   "simone", 
   "Speaking of slippery slopes, whoah, Steeeeve, where'd you get all that grease?", 
   {}, 
   218517, 
   null, 
   1151015280.0
  ], 
  [
   218550, 
   null, 
   "Prototype", 
   "Let me make it clear that I do not think abortion is in any way right, I DO however like the idea of having a desicion of sorts when it comes to my womb. \n\n \n Does that mean you would do something wrong when it comes to you?\n \n \nI also admit I might not be the world champion debator but I do know what my opinions are and where I stand. So what are you saying, that my opinions are vauge and poorly constructed, or that women shouldnt have controll over their own bodies? \n\n \n Oh, women should have control over their own bodies. I agree with that completely. But not after conception. I've always had the view that such a thing ought to be considered before sex if the women doesn't want to be pregnant.\n \n If she doesn't, then she ends doing something wrong in order to get out of the pregnancy; despite the reason.", 
   {}, 
   218513, 
   null, 
   1151020140.0
  ], 
  [
   218553, 
   null, 
   "Ooaman", 
   "There was one thing left out of the original question. Are you the father/mother of either the zygote or the baby? Or are you just some random person asked to choose between the life of either the zygote or the baby.\n (Perhaps there was no need for this but since the situation with the mother or perfect stranger came up, I noticed that there was no mention of relationship between you and the 2 being voted on for death.)\n By the way, how long can a zygote survive on a table?\n If I absolutely have to choose between the zygote that's just cells or a living breathing baby (without any mention of whether or not I'm a parent of either) then I would choose the living breathing already born baby. Especially if I'm only given what was in the original question.", 
   {}, 
   218534, 
   null, 
   1151020680.0
  ], 
  [
   218623, 
   null, 
   "Phyllis", 
   "Yes, I admit it, it was a slip of wording. Everyone makes mistakes. Let me make it clear that I do not think abortion is in any way right, I DO however like the idea of having a desicion of sorts when it comes to my womb.\n\n You do have a decision. Don't get pregnant.\n \n \nAnd I guess you missed my sad attempt at sarcasm with the whole \"forcing women to get pregnant\" joke. Im not completly ignorant.\n\n Sarcasm is extremely hard to pick up on these boards, especially because some people really have used those arguments before in a serious way.\n \n \n...So what are you saying, that my opinions are vauge and poorly constructed, or that women shouldnt have controll over their own bodies?\n\n Actually, I have said neither. You were actually quite clear, and I believe women should have control of their own bodies, so long as they use that control lawfully. However, you said abort a child. If it is a child that is being aborted, then this is exercising control over another person's body.\n \n \nMy main point is that If I remember correctly their was some dispute over consent of the spouse and or parents.\n\n Not sure if this was the main point. But we can talk about that if you want.", 
   {}, 
   218513, 
   null, 
   1151030880.0
  ], 
  [
   218678, 
   null, 
   "Love Never Dies", 
   "The zygote is the cell formed when the sperm fertilises the egg. The zygote has no brain, it has no conciousness.\n \n You have two tables, one with a small test tube which you know holds a microscopically small living zygote, and another table with a live baby.\n \n You are told that one of them will be destroyed and you have just two seconds to decide which, or both will be destroyed. Without a seconds thought I would immediately point in the direction of the zygote, and save the life of the baby.\n \n Extreme pro-lifers on the otherhand would probably end up killing the baby or both via indecision and inability to make a choice in just 2 seconds. That's the morality of pro-life for you: the inability to realise that the chemical reactions that happen when a sperm meets an egg do not define a human person.\n \n Am I wrong? I don't believe so. The sperm meeting the egg is a really random point to decide the emergance of a human person. Why pick that point specifically?\n\n Obviously the correct thing to do is kill the zygote. The thing that bothers me about this whole thing is some of the people that said they would refuse to choose. This is characteristic of your typical wimpy religious copout and is nothing but a cheep avoidance tactic. These people are not the kind of people that should be making any important decisions that concern other people so I guess it's just as well. A zygote is no more viable then a sperm. The attempt to call a zygote a living being is simply more evidence that the religious have no common sense.", 
   {
    "post_info": {
     "post_title": "The religious have no common sense."
    }, 
    "unicode_changes_made": true
   }, 
   77788, 
   null, 
   1151070480.0
  ], 
  [
   218699, 
   null, 
   "Mickey Shane", 
   "Well, if you can kill your own child than why stop at birth? \n \n And if we are calling things what they are than a child is a child and a human is a human....the fetus is a human :). \n \n So you support some humans killing other humans? Interesting....and you preach for people butting out of your life...why do feel you should choose whether or not to kill someone else then?\nAnyone who supports the war, or the death penalty, supports humans killing other humans.\n \n Grown, adult humans.\n \n Supporting either, or both, of the above mentioned attrocities, and claiming to be Pro Life is silly at best.", 
   {}, 
   218517, 
   null, 
   1151081100.0
  ], 
  [
   218844, 
   null, 
   "Steeeeve", 
   "Anyone who supports the war, or the death penalty, supports humans killing other humans.\n \n Grown, adult humans.\n \n Supporting either, or both, of the above mentioned attrocities, and claiming to be Pro Life is silly at best.\n\n \n If thats your stance than a pro-choice person would have to allow for support of the war and death penalty", 
   {}, 
   218699, 
   null, 
   1151170680.0
  ], 
  [
   218845, 
   null, 
   "Mickey Shane", 
   "If thats your stance than a pro-choice person would have to allow for support of the war and death penalty\nAgreed. The proof is in the pudding my friend.\n The death penalty is legal in the US. We are currently involved in two wars in the Middle East. AND, abortion is legal in the US.\n \n What 'one' thinks about those three methods of man killing man doesn't matter much in our country where the majority supposedly makes the laws.\n \n It looks like we, as a group, are natural born killers.", 
   {}, 
   218844, 
   null, 
   1151172480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Dilema", 
  "url": "http://www.4forums.com/political/abortion-debates/3744-dilema.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 3744, 
  "discussion_files": [
   [
    "28154.html", 
    "http://www.4forums.com/political/abortion-debates/3744-dilema-print.html"
   ], 
   [
    "28155.html", 
    "http://www.4forums.com/political/abortion-debates/3744-dilema-3-print.html"
   ], 
   [
    "28156.html", 
    "http://www.4forums.com/political/abortion-debates/3744-dilema-2-print.html"
   ]
  ], 
  "identifier": 3744
 }
]