[
 [
  [
   4537, 
   null, 
   "Debater", 
   "Do you think the govt should be able to keep track of everyone's library accounts?\n \n Currently the FBI and the HSD can look at your library history without a warrent.", 
   {
    "post_info": {
     "post_title": "Govt library searches"
    }
   }, 
   null, 
   null, 
   1047514620.0
  ], 
  [
   4545, 
   null, 
   "Crim", 
   "I don't really care.", 
   {}, 
   4537, 
   null, 
   1047516240.0
  ], 
  [
   4568, 
   null, 
   "kelvin90701", 
   "What you check out at the library reflects what is happening inside your brain. Do you feel safe that state has the ability to know what is inside your brain?", 
   {}, 
   4537, 
   null, 
   1047529260.0
  ], 
  [
   4570, 
   null, 
   "Crim", 
   "It doesn't reflect your exact thoughts. Knowing that I like Tolkien or that I'm writing a paper on X isn't real vital information.", 
   {}, 
   4537, 
   null, 
   1047530160.0
  ], 
  [
   4689, 
   null, 
   "gilligan8503", 
   "what could you possibly check out in the library that the government would be suspicious over? they already burn books that are on the government's \"black list\" (such as the turner diaries and the anarchist's cookbook)\n \n of course you have the right to own them, but not in public, or they will confiscate it.\n \n my point is: the government already shields us from certian information.\n \n (government meaning u.s.a. gov.)", 
   {}, 
   4537, 
   null, 
   1047628020.0
  ], 
  [
   4741, 
   null, 
   "Debater", 
   "books that explain terrorism or bombs and that kind of stuff\n \n if someone checks out a book like that the library notifies the government and they check it out.", 
   {}, 
   4537, 
   null, 
   1047669180.0
  ], 
  [
   24663, 
   null, 
   "Morfos", 
   "The Government should not be doing this. It has no right to find out what books you are buying. It has no right to know what you like to read. I despise the Patriot Act and everything else that allows the Government to spy on innocent people without permmision.", 
   {}, 
   4741, 
   null, 
   1070160720.0
  ], 
  [
   24684, 
   null, 
   "SilentPoet", 
   "Do you think the govt should be able to keep track of everyone's library accounts?\n\n \n I don't care. Although I don't think doing this well help prevent and stop terrorists.", 
   {}, 
   24663, 
   null, 
   1070165460.0
  ], 
  [
   25397, 
   null, 
   "smokefree", 
   "well you should care because preety soon they'll be checking your identity and what movies you watch (sarcastically) and what you do in your everyday life. they have eyes (cameras and spies) every where don't turn your backs or they'll have you as their suspects. Look at me no authority ever comes near me you know why? it's because they can't control you. the more you fear them the more you let them have their power.", 
   {}, 
   24684, 
   null, 
   1070503680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Govt library searches", 
  "url": "http://www.4forums.com/political/government-debates/376-govt-library-searches.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 376, 
  "discussion_files": [
   [
    "7173.html", 
    "http://www.4forums.com/political/government-debates/376-govt-library-searches-print.html"
   ]
  ], 
  "identifier": 376
 }
]