[
 [
  [
   78743, 
   null, 
   "Famous Amos", 
   "Has everyone heard about this guy from Laos who killed 6 people? Sometimes I wonder what is going through some people's heads nowadays. \n \n He was on someone else's property, in someone else's tree stand. When told to leave, he walked away, turned around, and mowed down the owner's of the property. When help arrived, he mowed them down as well. All because he was told to leave private property.\n \n How many places are there to hunt in Wisconsin? Certainly there is enough so that he can find somewhere else to hunt. There's a whole new breed of maniacs out there nowadays and you never know what could happen.", 
   {
    "post_info": {
     "post_title": "Hunter kills 6, wounds 2"
    }
   }, 
   null, 
   null, 
   1101249780.0
  ], 
  [
   78750, 
   null, 
   "Big Orn", 
   "He is a veteran of the US Military, for one thing. Been living here for 20 years and has never been arrested for anything, although the police has been called on him due to domestic disturbances (2 or 3 occasions). There is something missing from the story, in my opinion.\n \n It&#8217;s true the Hmong people of the region (from Laos) have no concept of private property regs, maybe this was a factor &#8211; maybe not. From what I understand he thought he was on public land when he climbed into the stand. What I don&#8217;t understand is him climbing down, removing the scope from his rifle (SKS) and opening fire&#8230;apparently without provocation. Then he just began to murder all those that came running.\n \n I know some people hunt with this type of weapon because the rifles are cheap and so is the ammo, but I certainly wouldn&#8217;t. Maybe at close range&#8230;\n \n A clearer background of how the Hmong people wound up in the US is a result of the &#8220;secret&#8221; war sponsored by the CIA in Laos during the Vietnam War. We (the CIA) &#8220;employed&#8221; the Hmong in Laos to fight for us, and when we pulled out, we left them high and dry to face the communists&#8230;alone, which made them pay dearly. After discovering the truth about this so-called &#8220;secret&#8221; war, many groups in the USA openly invited them to come over, where they settled somewhere in California. A few years ago they migrated to Minnesota and Wisconsin. In Laos there were no hunting restrictions (that&#8217;s why there&#8217;s not game there to hunt anymore) and any/all land was open to hunters.\n \n It is a full-time job to get them to understand our hunting laws. But, this guy has been here for 20 years or more.\n \n Something is missing here. I will say that whatever is missing will not explain nor will it excuse what he did.", 
   {}, 
   78743, 
   null, 
   1101250800.0
  ], 
  [
   78769, 
   null, 
   "jim's trucking", 
   "The man should be executed...next week!", 
   {}, 
   78750, 
   null, 
   1101252300.0
  ], 
  [
   78779, 
   null, 
   "Big Orn", 
   "The man should be executed...next week!\n\n Wait...hold on, Jim.\n \n What if he was fired on first? Who will really know the truth?\n \n I'm not excusing him by any means, but - get the facts, first and foremost.\n \n Can you think of any scenario where you would not kill someone, or several people, if they fired first?\n \n Again, there is no excuse, but there are mitigating circs...even if they are not justified.", 
   {}, 
   78769, 
   null, 
   1101252840.0
  ], 
  [
   78790, 
   null, 
   "Famous Amos", 
   "Wait...hold on, Jim.\n \n What if he was fired on first? Who will really know the truth?\n \n I'm not excusing him by any means, but - get the facts, first and foremost.\n \n Can you think of any scenario where you would not kill someone, or several people, if they fired first?\n \n Again, there is no excuse, but there are mitigating circs...even if they are not justified.\n\n \n \n I doubt if he was fired on first he would walk 40 yards, then take off his scope, and then fire. I think he'd just go ahead an open up. Apparently, he came down from the tree stand, walked about 40 yards, took his scope off, and then fired.", 
   {}, 
   78779, 
   null, 
   1101253560.0
  ], 
  [
   78794, 
   null, 
   "Big Orn", 
   "I doubt if he was fired on first he would walk 40 yards, then take off his scope, and then fire. I think he'd just go ahead an open up. Apparently, he came down from the tree stand, walked about 40 yards, took his scope off, and then fired.\n\n I'm trying to find the latest, Amos. I think he's made the statement that he was fired upon first.\n \n Between the stinking phone ringing and this storm we're having, I can't do much of anything...but argue with you. :)", 
   {}, 
   78790, 
   null, 
   1101253800.0
  ], 
  [
   78814, 
   null, 
   "daewoo", 
   "Wait...hold on, Jim.\n \n What if he was fired on first? Who will really know the truth?\n \n I'm not excusing him by any means, but - get the facts, first and foremost.\n \n Can you think of any scenario where you would not kill someone, or several people, if they fired first?\n \n Again, there is no excuse, but there are mitigating circs...even if they are not justified.\n\n \n \n Why worry about the truth? Just execute the dirty foreigner, right Jim? I think some of the Hmongs are muslims. All the more reason.\n \n I agree that the story is hokey. Generally I don't think most people just go nuts and start blowing away other folks. I can certainly think of more than one scenario where his actions may have been entirely justified. \n \n I have been trying to follow this, and there sems to be several different stories floating around. One of the sheriffs deputies form the area said it appeared that he was taking fire from the hunting party. If that is the case, he was certainly justified in returning fire.", 
   {}, 
   78779, 
   null, 
   1101255000.0
  ], 
  [
   78816, 
   null, 
   "Famous Amos", 
   "Why worry about the truth? Just execute the dirty foreigner, right Jim? I think some of the Hmongs are muslims. All the more reason.\n \n I agree that the story is hokey. Generally I don't think most people just go nuts and start blowing away other folks. I can certainly think of more than one scenario where his actions may have been entirely justified. \n \n I have been trying to follow this, and there sems to be several different stories floating around. One of the sheriffs deputies form the area said it appeared that he was taking fire from the hunting party. If that is the case, he was certainly justified in returning fire.\n\n \n \n You use the reasoning that the idea of the man going insane isn't valid, yet you then claim that maybe the people went insane and shot at him? Why would people shoot at someone?\n \n Let's just assume they did shoot at him. Did he have to kill 6 people (shooting some numerous times), some of them who weren't even armed? Can he justify self defense for killing other who came to the scene to help their friends? You can't just kill everyone when you feel threatened (if he was indeed shot at).\n \n And if he was taking fire, why would he come down from his tree stand, walk away like nothing happened, take his scope off, and then fire on people? The last thing I'm worried about when someone shoots at me is my scope.", 
   {}, 
   78814, 
   null, 
   1101255180.0
  ], 
  [
   78823, 
   null, 
   "Big Orn", 
   "Did he have to kill 6 people...\n\n Nope - after he killed the first, the others are just collateral damage.\n \n I think you&#8217;d see it that way, too, if you were in anyone&#8217;s shoes who knows how to &#8220;kill&#8221;.\n \n Way, way not enough info here, IMO.\n \n ON EDIT:\n \nHAYWARD, Wis. - A Hmong immigrant suspected of killing six fellow deer hunters in the Wisconsin woods told investigators that he opened fire after they took a shot at him first and hurled racial slurs at him, according to court papers filed Tuesday.\n", 
   {}, 
   78816, 
   null, 
   1101255600.0
  ], 
  [
   78830, 
   null, 
   "daewoo", 
   "You use the reasoning that the idea of the man going insane isn't valid, yet you then claim that maybe the people went insane and shot at him? Why would people shoot at someone?\n\n \n So he walked a ways, went \"Screw this\" and threw away his life? Then, instead of utilizing his military training to escape, he wandered off, found some other hunters who didn't know what had happened, asked them fro directions to the nearest road, and just wandered down the road until he was arrested without incident by a game warden? Are you kidding me? \n \n \nLet's just assume they did shoot at him. Did he have to kill 6 people (shooting some numerous times), some of them who weren't even armed? Can he justify self defense for killing other who came to the scene to help their friends? You can't just kill everyone when you feel threatened (if he was indeed shot at).\n\n \n That all depends. The only story we have heard is that of the survivors, not his. Tehy claim that they only had one weapon between them. They were out hunting. We will assume that they all had rifles back at the lodge (where they were before going to the aid of their friend). So, the guy calls them on the raidio and tells them what is going on and they all run from the lodge to help, but none of them thinks to grab a rifle? This is what they are claiming happened. I suppose it could be gods own truth, in which case they have got to be the dumbest outdoorsmen I have ever heard of. \n \n \nAnd if he was taking fire, why would he come down from his tree stand, walk away like nothing happened, take his scope off, and then fire on people? The last thing I'm worried about when someone shoots at me is my scope.\n\n \n \n OR, lets say he was shot at on the ground. He ran for cover and snapped off his scope. Maybe the last thing you would think of is taking off your scope. I would almost bet that most here who are military trained would think of it first. A rifle is about worthless at short range if you have a scope obstructing your sights, and trying to use it is likely to get you killed since target acquisition is pretty slow with a scope.\n \n \n I am not saying he was justified, or even that the story the survivors are telling is a lie. Just saying it sounds hokey and we probably shouldn't execute the guy before looking into things a little better.", 
   {}, 
   78816, 
   null, 
   1101256200.0
  ], 
  [
   78839, 
   null, 
   "sinjin", 
   "something stinks.", 
   {}, 
   78830, 
   null, 
   1101257940.0
  ], 
  [
   78840, 
   null, 
   "Big Orn", 
   "something stinks.\n\n And Bubba knows it....", 
   {}, 
   78839, 
   null, 
   1101258180.0
  ], 
  [
   78961, 
   null, 
   "jitobear", 
   "A few things.\n \n First of all I am glad that me and mine weren't up at the cabin last weekend. (Cabin is in Birchwood on Deer Lake). Beautiful area - by the way - if you like hunting/fishing you can find few places better. As it is I avoid the woods hunting season - too many drunk sportsmen and flying bullets. ;)\n \n ANYWAY.\n \n Land - there is actually very little public land in the area for hunting anymore as it is being bought up by developers. (The area is littered with lakes - lots of resorts and what not). Nor is private land that well marked.\n \n Racial Issues - first of all - MN/WI have a TON of Hmongs. Tensions between white and Hmong hunters have been going on for some time. I don't doubt for a second that racial slurs probably abound up there (on both sides). If that were the case - maybe the guy did snap. Maybe he is short-fused anyway. Who knows. He is certainly guilty - he does not even deny that. But I rarely believe in the Hollywood \"good guy/bad guy\" everything is black and white theory. Something led up to this.\n \n What I do not want to see is this turn into a race issue. There are tons of really great Hmong people in our communities, and who have cabins in my cabin community. I don't want them to start being afraid or feeling unwelcome because of this man. \n \n Jim - he won't be executed. Wisconsin does not have the death penalty and doesn't the death penalty require it to be a pre-mediated act? Nothing in anyone's story leads one to believe this guy went out to the woods to hunt people.", 
   {}, 
   78840, 
   null, 
   1101329940.0
  ], 
  [
   78986, 
   null, 
   "daewoo", 
   "Land - there is actually very little public land in the area for hunting anymore as it is being bought up by developers. (The area is littered with lakes - lots of resorts and what not). Nor is private land that well marked.\n \n\n \n This is something I don't understand. Why don't private landowners who are going to make an issue about people on their land mark it, especially if it butts up to public land? I have some land by a public lake (council grove) and it is not fenced, and it is not marked with signs. I have been by there several times and seen people hunting on it. I personally don't feel I can say much, since it isn't marked. The land around my house, on the other hand, is well marked and fenced. I have no trouble justifying tossing tresspassers off of that land (assuming the dogs don't find them first, in which case they generally leave of their own accord, as fast as they possibly can). \n \n \n \nRacial Issues - first of all - MN/WI have a TON of Hmongs. Tensions between white and Hmong hunters have been going on for some time. I don't doubt for a second that racial slurs probably abound up there (on both sides). If that were the case - maybe the guy did snap. Maybe he is short-fused anyway. Who knows. He is certainly guilty - he does not even deny that. But I rarely believe in the Hollywood \"good guy/bad guy\" everything is black and white theory. Something led up to this.\n \n What I do not want to see is this turn into a race issue. There are tons of really great Hmong people in our communities, and who have cabins in my cabin community. I don't want them to start being afraid or feeling unwelcome because of this man. \n\n \n I am a member of a board for discussing trapping (yes, catching harmless, furry animals in evil steel traps) and several board members are from that area or trap in that area. I was, frankly, shocked at the level of hate these guys had for the hmong in the area. It was in reading these guys posts that I first began to suspect that maybe the story was total BS, as opposed to simply a little hokey. I started thinkgin to myself \"if these rednecks are typical for hunters in the area, I have no trouble believing that the guy was firing in self defense.\"\n \n Until we get more facts, I personally am not willing to condemn the guy. We have a lot of vietnamese in our area. Several years ago one of them killed 3 local guys. He was arrested and spent nearly a year in prison waiting for trial. In the trial it came out that the guy he had killed were trying to hang him at the (yes, hang him, rope in tree and all that). He snatched a knife away from onte of the guys and killed all 3 of them with it, and a 4th escaped. \n \n Needless to say, once it was discovered, at trial, what was going on, the guy went free (and incidentally, the county prosecutor, who is elected, was replaced at the next election largely becuase it was felt that he knowingly prosecuted an innocent man).\n \n I, like most of the other locals around here, was convinced the guy was guilty and ready to personally strap him inot the chair if given the chance. I had to eat come humble pie after the whole story came out. I learned my lesson on that one. Now I give people accused of such things the full benifit of the doubt.\n \n \nJim - he won't be executed. Wisconsin does not have the death penalty and doesn't the death penalty require it to be a pre-mediated act? Nothing in anyone's story leads one to believe this guy went out to the woods to hunt people.\n\n \n \n Prosecutors have twisted \"pre-meditation\" from its rtatehr obvous original intent, which is pretty much as you described, a planned, willful act, into something not quite that. Prosecutors have argued that in order for a crime to be pre-meditated, the person doesn't really have to plan it much ahead of time. If you are in an argument with somebody, turn to walk away, take 2 steps, then turn back around and beat them to death, there is a better than average chance that the prosecutor is going to argue pre-meditation. \n \n In this case, if everything happened exactly like the story is told, it is almost certain that the prosecutro will argue the crime was premediatated based on the fact that the guy had walked away and removed his scope.\n \n Your definition is, I think, a lot closer to the intent of the laws regarding murder. I think the idea is that people who sit and plot a murder and then go and carry it out should be punished more harshly than somebody who, in a fit of rage, pops and kills somebody, or several people. \n \n A couple years ago, a local guy shot and killed a 16 yr old kid in a car. The guy owned a couple of decomissioned minuteman silos by his house, nad kids were always out there poking around. He took to chasing them off, so they took to harassing him and his family at home. One night a carload of them parked at the end of his driveway and were burning rubber and revving their engine. He stepped out the dorr with a rifle and fired a shot. The car sped off and he fired a shot after it, hitting a 16 yr old passenger,\n \n In court, the prosecutor argued that it was premeditated murder because there were two shots fired, one as the car was speeding away. Apparently they felt that if somebody had been killed witht he first shot, it would have been a lesser charge, but that since thre was a space of 2-3 seconds between shots, that implied pre meditation.\n \n The jury disagreed and foudn him guilty of second degree murder. The guys defense was that his house had been shot at several times and his dog kileld by kids in that same car, and when they made an aggressive display at the end of his driveway he feared for the safety of his family. He claimed the shots were just meant to scare the kids and that hitting the car was an accident. \n \n Later several memebrs of the jury said that they felt the guy was telling the truth and should have been found guilty of manslaughter, but that was not an option given to them. They could only choose between 1st degree murder and 2nd degree murder. I personally say that if those were the only options, the guy should have been declared innocent and released, they can always charge him with manslaughter later. \n \n But I digress...... Point is, premediation has been twisted, like so many other things (like the definition of \"interstate comerce\") in our legal system.", 
   {}, 
   78961, 
   null, 
   1101337260.0
  ], 
  [
   78992, 
   null, 
   "Tboy321025", 
   "Has everyone heard about this guy from Laos who killed 6 people? Sometimes I wonder what is going through some people's heads nowadays.\n\n \n A guy did that in Wisconsin over the weekend, killed 5 people", 
   {}, 
   78743, 
   null, 
   1101343860.0
  ], 
  [
   79018, 
   null, 
   "jitobear", 
   "A guy did that in Wisconsin over the weekend, killed 5 people\n\n \n Same story - same guy - one of the others he shot died a day later.", 
   {}, 
   78992, 
   null, 
   1101404640.0
  ], 
  [
   79189, 
   null, 
   "Tboy321025", 
   "wow, this is the part where i feel really stupid :xbanghead", 
   {}, 
   79018, 
   null, 
   1101546900.0
  ], 
  [
   79190, 
   null, 
   "sglaine", 
   "The man should be executed...next week!\n\n \n Whats wrong with today?", 
   {}, 
   78769, 
   null, 
   1101568440.0
  ], 
  [
   79196, 
   null, 
   "jitobear", 
   "Whats wrong with today?\n\n \n Innocent until proven guilty, fair trial, the constitution etc.", 
   {}, 
   79190, 
   null, 
   1101570720.0
  ], 
  [
   79456, 
   null, 
   "jim's trucking", 
   "...and O.J. is not guilty, either!", 
   {}, 
   79196, 
   null, 
   1101759300.0
  ], 
  [
   79489, 
   null, 
   "emclean", 
   "some thing stinks with this one, one man shooting 8 man with one rifle betwenen them? unless the cops are incompatent, or involved in a cover up then i feel the self defence is streched at best, and is more likly BS.", 
   {}, 
   79456, 
   null, 
   1101762300.0
  ], 
  [
   79541, 
   null, 
   "Famous Amos", 
   "A guy did that in Wisconsin over the weekend, killed 5 people\n\n \n \n \n Really?\n \n \n \n Actually it was 6 buddy.", 
   {}, 
   78992, 
   null, 
   1101764280.0
  ], 
  [
   79557, 
   null, 
   "Waxy", 
   "wow, this is the part where i feel really stupid :xbanghead\n\n \n I guess I'll give you the benefit of the doubt and assume you just missed this follow up post, otherwise, a post like your last one might be misconstrued as being the post of a real axe.\n \n Nonetheless, a real first class post. emoticon_rolleyes \n \n Waxy", 
   {}, 
   79189, 
   null, 
   1101765480.0
  ], 
  [
   79585, 
   null, 
   "daewoo", 
   "some thing stinks with this one, one man shooting 8 man with one rifle betwenen them? unless the cops are incompatent, or involved in a cover up then i feel the self defence is streched at best, and is more likly BS.\n\n \n As I said before, I will wait for the trial and the fact to come out.\n \n Mclean, you are a hunter, right? Doesn't it seem just downright bizarre to you that these 8 deer hunters only had 1 rifle between them? I have a LOT of trouble believeing that. Especially since most of them were back at the lodge and didn't head for the area until the one guy called on his radio and told them what was going on. And nobody thoguht to grab a rifle????", 
   {}, 
   79489, 
   null, 
   1101768780.0
  ], 
  [
   79684, 
   null, 
   "emclean", 
   "i don't hunt anymore (people got so ****** about me smoking in the tree stand). they did not have rifles due to the laws about hunting from moter vechales, from what i have been told in a diffrent forum is that the DNR officers can consfate the vechale and weapon if they find you hunting from it, so being on a ATV and having a loaded rifle is lickly to get you at least a talking to by the cops. hte first 2 were the ones going out to hunt then, the others came out after the radio call. \n \n \nEspecially since most of them were back at the lodge and didn't head for the area until the one guy called on his radio and told them what was going on. And nobody thoguht to grab a rifle????\n \n i cant comment unless i have some idea of there backround. former military, then i would agree, not military / LEO, it would not suprise me.", 
   {}, 
   79585, 
   null, 
   1101791100.0
  ], 
  [
   79699, 
   null, 
   "daewoo", 
   "i don't hunt anymore (people got so ****** about me smoking in the tree stand). they did not have rifles due to the laws about hunting from moter vechales, from what i have been told in a diffrent forum is that the DNR officers can consfate the vechale and weapon if they find you hunting from it, so being on a ATV and having a loaded rifle is lickly to get you at least a talking to by the cops. hte first 2 were the ones going out to hunt then, the others came out after the radio call. \n \n \n i cant comment unless i have some idea of there backround. former military, then i would agree, not military / LEO, it would not suprise me.\n\n \n Ok, so these hunters are sitting at th elodge and their buddy frank calls on the radio and sayd \"I need help!! This crazy bastard just shot me and joe!!\"\n \n And these hunters either:\n \n 1. Just didn't think to grab a gun, even though they knew at that ppint that somebody was gunning down theri buddy.\n 2. Didn't grab a gun beacuse they were afraid that they would be charged with hunting from a motorized vehicle, depsite the fact they knew somebody was gunning down their buddies.\n \n Come on, nobodies that stupid.", 
   {}, 
   79684, 
   null, 
   1101802860.0
  ], 
  [
   79710, 
   null, 
   "emclean", 
   "Ok, so these hunters are sitting at th elodge and their buddy frank calls on the radio and sayd \"I need help!! This crazy bastard just shot me and joe!!\"\n \n i thought the raido call was \"who is in our stand?\" with the responce of \"none of us\", not we are being shot.", 
   {}, 
   79699, 
   null, 
   1101827640.0
  ], 
  [
   79723, 
   null, 
   "Famous Amos", 
   "As I said before, I will wait for the trial and the fact to come out.\n \n Mclean, you are a hunter, right? Doesn't it seem just downright bizarre to you that these 8 deer hunters only had 1 rifle between them? I have a LOT of trouble believeing that. Especially since most of them were back at the lodge and didn't head for the area until the one guy called on his radio and told them what was going on. And nobody thoguht to grab a rifle????\n\n \n \n Why would a group of hunters, who obviously have hunted for a long while, all of a sudden decide to shoot at someone? I doubt a group of people just snapped because one person was on their property.\n \n Also, the guy who killed the people has changed his story twice. At first, he said someone else shot the hunters and ran off. Then he said he was shot at by the hunters and returned fire. Well, which one is it? It's not like he just misstated something...those are 2 completely different stories.\n \n Also, to defend himself, did the guy need to shoot and kill 6 people and wound 2 others? That seems a little outrageous.", 
   {}, 
   79585, 
   null, 
   1101834420.0
  ], 
  [
   79728, 
   null, 
   "Big Orn", 
   "At first, he said someone else shot the hunters and ran off. Then he said he was shot at by the hunters and returned fire. Well, which one is it?\n\n The way I understand it is that someone took his rifle and killed the hunters - that's the first story. Someone took his rifle, killed them, and then just handed it back? I don't buy that. If he was fired upon first, why tell a tall tale?\n \nAlso, to defend himself, did the guy need to shoot and kill 6 people and wound 2 others? That seems a little outrageous.\n\n When fired upon? No.\n \n When provoked via racial slurs? Yes.\n \n No one knows exactly what they would do if ever fired upon by several people. Maybe mowing down as many as they could would be the solution.\n \n I'm just hoping that he decides to tell the truth and be done with it...whatever that truth may be.", 
   {}, 
   79723, 
   null, 
   1101835440.0
  ], 
  [
   79736, 
   null, 
   "Famous Amos", 
   "The way I understand it is that someone took his rifle and killed the hunters - that's the first story. Someone took his rifle, killed them, and then just handed it back? I don't buy that. If he was fired upon first, why tell a tall tale?\n\n \n That's like asking to be put in jail for the rest of your life. If you were shot at, why would you lie and say someone stole your rifle and then shot them with it, and then gave it back to you? If that is true, this guy should be in jail for being he biggest XXXXX in the country.\n \n \n \n \nWhen fired upon? No.\n \n When provoked via racial slurs? Yes.\n\n \n \n So it's ok to kill people whoever you want if they throw slurs at you? That's outrageous. Killing someone is not a self-defense to verbal shots at you. You somehow seem to think that verbal assaults are worse than someone shooting at you.\n \n \n \n \nNo one knows exactly what they would do if ever fired upon by several people. Maybe mowing down as many as they could would be the solution.\n \n I'm just hoping that he decides to tell the truth and be done with it...whatever that truth may be.\n\n \n \n True, if 4 people fired at me I would mow them down. But when friends come out to see what's going on and you mow them down too, that's a little questionable. If he in fact was shot at and killed the people who were originally there shooting at him, he should have shown some self-control and tried to talk with the friends who showed up later. You can't just mow down everyone in sight because you feel threatened.", 
   {}, 
   79728, 
   null, 
   1101836760.0
  ], 
  [
   79739, 
   null, 
   "lord tammerlain", 
   "How about he was scared, and thought that the sheriff was just as bigoted as the hunters he killed. He might have thought that the sheriff would not believe any story that he told.\n \n He is a possiblity.\n \n As he was leaving he was being insulted, and one of the hunters thought it might be a kick to shoot say about 10 feet away from him. He notices the shot thinks he is being fired on and reacts in self defense. \n \n Dont forget he has lived there for years and for him just to snap and fire on another group of hunters without reason is not very likely.", 
   {}, 
   79736, 
   null, 
   1101837480.0
  ], 
  [
   79744, 
   null, 
   "Famous Amos", 
   "How about he was scared, and thought that the sheriff was just as bigoted as the hunters he killed. He might have thought that the sheriff would not believe any story that he told. \n\n \n One of the worst statements I have ever heard. You can't shoot people because you think the sheriff might be a racist or bigot. That is the worst defense I have ever heard to shooting up some hunters. You can't just assumy someone is a bigot and then kill them because of that. Even if the sheriff is a bigot, you are not entitled to kill 6 people and wound 8 others. I don't care if someone believes my story or not, but I will at least stick with the same one. His stories were completely different: one, someone took his gun and shot the hunter, and two, he shot the hunters. There are complete opposites. Why would he lie? Maybe he's trying to cover something up?\n \n \nAs he was leaving he was being insulted, and one of the hunters thought it might be a kick to shoot say about 10 feet away from him. He notices the shot thinks he is being fired on and reacts in self defense. \n\n \n So if he reacted he would have killed the people there. Why would he then kill the people who showed up later? They didn't shoot at him.\n \n \n \n \nDont forget he has lived there for years and for him just to snap and fire on another group of hunters without reason is not very likely. \n\n \n Actually you're wrong. He's from Minnesotta. I'm sure the hunters have had to deal with people trespassing on their land before, and I don't think they've shot at any of them.", 
   {}, 
   79739, 
   null, 
   1101839040.0
  ], 
  [
   79754, 
   null, 
   "lord tammerlain", 
   "One of the worst statements I have ever heard. You can't shoot people because you think the sheriff might be a racist or bigot. That is the worst defense I have ever heard to shooting up some hunters. You can't just assumy someone is a bigot and then kill them because of that. Even if the sheriff is a bigot, you are not entitled to kill 6 people and wound 8 others. I don't care if someone believes my story or not, but I will at least stick with the same one. His stories were completely different: one, someone took his gun and shot the hunter, and two, he shot the hunters. There are complete opposites. Why would he lie? Maybe he's trying to cover something up?\n \n \n \n So if he reacted he would have killed the people there. Why would he then kill the people who showed up later? They didn't shoot at him.\n \n \n \n \n \n Actually you're wrong. He's from Minnesotta. I'm sure the hunters have had to deal with people trespassing on their land before, and I don't think they've shot at any of them.\n\n \n His story to the sheriff might have changed because he may have thought the sheriff was bigotted and not believe that it may have been self defence. Given that he just shot 8 people, and depending on past experience with law enforcement he may have a jaded view of their fairness.\n \n As for there, I meant the US in general. He was not a recent immigrant. Given that I cant see him just shooting a bunch of hunters for a few insults. The has to be alot more to the story.", 
   {}, 
   79744, 
   null, 
   1101842460.0
  ], 
  [
   79760, 
   null, 
   "jim's trucking", 
   "Kill the bastard!", 
   {}, 
   79736, 
   null, 
   1101843780.0
  ], 
  [
   79767, 
   null, 
   "Famous Amos", 
   "His story to the sheriff might have changed because he may have thought the sheriff was bigotted and not believe that it may have been self defence. Given that he just shot 8 people, and depending on past experience with law enforcement he may have a jaded view of their fairness.\n \n As for there, I meant the US in general. He was not a recent immigrant. Given that I cant see him just shooting a bunch of hunters for a few insults. The has to be alot more to the story.\n\n \n \n He might have distorted his story, but why would he completely lie and say someone stole his gun? And then later admit he was the one who did the killing? I don't believe a thing he is saying now. Once again, I could care less what he thinks of cops. I'm sure a lot of blacks hate cops too, but does that give them right to lie to them and change their story? No.\n \n It seems like you're giving the benefit of the doubt to this guy. He killed 6 people and wounded 2 more. He lied about what happened. Regardless of whether or not racial slurs were present, the only thing that I can see that would give a reasonable cause for him to shoot would be if someone else shot at him. Even if someone did, he did not have the right to pick off everyone else who came by. And what about the scope deal? Who walks 40 yards, takes a scope off, and then fires? If he really felt he was in danger, don't you think he'd return fire rather than worrying about his scope?\n \n I think this guy is just looking for a way out now. He is trying to rationalize his heinous acts by saying they shouted racial slurs at him. That is not an excuse to shoot 8 people. Even if they shot at him, he had no reason to continue shooting the others who showed up on ATVs. And then after doing this he walked off nonchalantly as if nothing happened and asked for directions out of the woods.", 
   {}, 
   79754, 
   null, 
   1101845340.0
  ], 
  [
   79771, 
   null, 
   "emclean", 
   "depending on past experience with law enforcement he may have a jaded view of their fairness.\n would that include being arested for pointing a gun at his wifes head and thretning to kill her?", 
   {}, 
   79767, 
   null, 
   1101845700.0
  ], 
  [
   79772, 
   null, 
   "lord tammerlain", 
   "Panic might cause him to lie, along with distrust of law enforcement. Now visiable minorities often have a poor opinion of law enforcement (reasonable or not)\n \n Of course I am giving him the benifit of doubt. I dont know the whole story. He deserves a fair trial just like anyone else.\n \n As for self defense, I honesty can see one of the other hunters taking a shot at his direction, not to hit the Hmong but just to teach him a lesson. Racial tension from what I have read is there. Given the Hmong's military training his taking out the other 7 would be what he was trained for, removal of all threats. \n \n Overall if only 1 rifle was present, even if the other group fired first he did overreact and went past what I would call self defense", 
   {}, 
   79767, 
   null, 
   1101845880.0
  ], 
  [
   79775, 
   null, 
   "emclean", 
   "or with the racial tension, it might be a good line for the defence layer to give him to say. \n \n the truet i think was also lost in the woods, i do not think the guilty party will step up and admit to what happened, who ever it was.", 
   {}, 
   79772, 
   null, 
   1101846300.0
  ], 
  [
   79780, 
   null, 
   "Big Orn", 
   "That's like asking to be put in jail for the rest of your life. If you were shot at, why would you lie and say someone stole your rifle and then shot them with it, and then gave it back to you? If that is true, this guy should be in jail for being he biggest XXXXX in the country.\n\n ...and desperate.\n \n He's not only digging his own grave, but is doing his best to throw in the dirt, too.\n \nSo it's ok to kill people whoever you want if they throw slurs at you? That's outrageous. Killing someone is not a self-defense to verbal shots at you. You somehow seem to think that verbal assaults are worse than someone shooting at you.\n\n One of us is misunderstood. At this point, I'm going to say that its me. :)\n \n I was answering the best I could given your remark. You said, (paraphrasing) \"...to defend himself would it be outrageous to [shoot 8 people]...\" \n I replied, \"If fired upon? No. If provoked via racial slurs? Yes.\"\n \n See?", 
   {}, 
   79736, 
   null, 
   1101847980.0
  ], 
  [
   79781, 
   null, 
   "Big Orn", 
   "He might have distorted his story, but why would he completely lie and say someone stole his gun? And then later admit he was the one who did the killing? I don't believe a thing he is saying now. Once again, I could care less what he thinks of cops. I'm sure a lot of blacks hate cops too, but does that give them right to lie to them and change their story? No.\n \n It seems like you're giving the benefit of the doubt to this guy. He killed 6 people and wounded 2 more. He lied about what happened. Regardless of whether or not racial slurs were present, the only thing that I can see that would give a reasonable cause for him to shoot would be if someone else shot at him. Even if someone did, he did not have the right to pick off everyone else who came by. And what about the scope deal? Who walks 40 yards, takes a scope off, and then fires? If he really felt he was in danger, don't you think he'd return fire rather than worrying about his scope?\n \n I think this guy is just looking for a way out now. He is trying to rationalize his heinous acts by saying they shouted racial slurs at him. That is not an excuse to shoot 8 people. Even if they shot at him, he had no reason to continue shooting the others who showed up on ATVs. And then after doing this he walked off nonchalantly as if nothing happened and asked for directions out of the woods.\n\n I agree.\n \n Again, a very desperate man.\n \n I'm sure during his jaunt through the forest all sorts of scenarios swept through his mind. Don't you? Even as far as the OJ fiasco...\n \n Just because he's from Laos does not mean he's stupid...even though Stupid is as stupid does. ", 
   {}, 
   79767, 
   null, 
   1101848340.0
  ], 
  [
   79797, 
   null, 
   "Haulingboat", 
   "All the points raised here are valid. There may have been racism. There may have been warning shots intended to scare him off. The one rifle can be explained by certain hunting technic where one shooter sits in a designated spot while a group of others marches in a line towards that person pushing game his way. Once the game gets past him, in a safe direction of the group, he fires on the game. (this technic is employed quite often BTW)\n \n We can sit here and come up with a thousand scenarios. None of which excuses the death of 6 people. He is quilty of killing six people. Five of them unarmed and a few shot in the back, in my source is correct. \n \n Good thing he didn't pull that sh** in Texas. He'd be in the chair already.", 
   {}, 
   79781, 
   null, 
   1101852480.0
  ], 
  [
   79798, 
   null, 
   "Haulingboat", 
   "Oh yeah, when we leave the camp, we ALWAYS have our rifles. But that is just my experience. What we do is very different style of hunting.", 
   {}, 
   79797, 
   null, 
   1101852660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Hunter kills 6, wounds 2", 
  "url": "http://www.4forums.com/political/current-events-debates/3797-hunter-kills-6-wounds-2-a.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 3797, 
  "discussion_files": [
   [
    "10965.html", 
    "http://www.4forums.com/political/current-events-debates/3797-hunter-kills-6-wounds-2-a-print.html"
   ], 
   [
    "10966.html", 
    "http://www.4forums.com/political/current-events-debates/3797-hunter-kills-6-wounds-2-a-3-print.html"
   ], 
   [
    "10967.html", 
    "http://www.4forums.com/political/current-events-debates/3797-hunter-kills-6-wounds-2-a-2-print.html"
   ]
  ], 
  "identifier": 3797
 }
]