[
 [
  [
   41, 
   null, 
   "admin", 
   "Is the Confederate Flag a Symbol of Racism? \n \n http://www.youdebate.com/DEBATES/confederate_flag.HTM", 
   {
    "post_info": {
     "post_title": "Confederate Flag"
    }
   }, 
   null, 
   null, 
   1043624460.0
  ], 
  [
   720, 
   null, 
   "ghettocracka", 
   "no\n anyone who thinks that is a XXXXX\n \n just because the south was pro slavery dosent mean that their flag is a symbol of slavery", 
   {}, 
   41, 
   null, 
   1044305040.0
  ], 
  [
   721, 
   null, 
   "ghettocracka", 
   "not slavery\n \n racism\n \n my mistake", 
   {}, 
   41, 
   null, 
   1044305100.0
  ], 
  [
   741, 
   null, 
   "fallingupwards", 
   "are you implying that enslaving black people is not racist?", 
   {}, 
   41, 
   null, 
   1044319200.0
  ], 
  [
   868, 
   null, 
   "Maynard", 
   "the confederate flag is the flag of the south, that's all, i dont think it has anything to do with racism, that just what the north wanted everybody to believe.", 
   {}, 
   41, 
   null, 
   1044385260.0
  ], 
  [
   1119, 
   null, 
   "ghettocracka", 
   "no\n \n im saying that it makes no difference if the south was aginst or for slavery\n \n and that their flag shouldnt be considered a symbol of racism", 
   {}, 
   41, 
   null, 
   1044561180.0
  ], 
  [
   1125, 
   null, 
   "Heydrich", 
   "are you implying that enslaving black people is not racist?\n\n \n Are you implying that Abraham Lincoln in the Spring of 1861 did not propose and support a constitutional amendment that would have legalized slavery forever, that he ran on a platform of a new fugitive slave law, that when the Confederacy was formed there were more slave states in the Union than in the Confederacy, that slavery was not abolished until after the war with the 13th Amendment, the abolition of slavery Lincoln said he was oppossed to in his own inaugural address, the issue of slavery that did not even become an issue in the war until YEARS into the war to incite a servile insurrection in the South?\n \n \"I have no purpose to introduce political and social equality between the white and black races. There is a physical difference between the two, which, in my judgment, will probably forever forbid their living together upon the footing of perfect equality; and inasmuch as it becomes a necessity that there must be a difference, I, as well as Judge Douglas, am in favor of the race to which I belong having the superior position.\"\n \n -- Abraham Lincoln\n \n \"Anything that argues me into his idea of perfect social and political equality with the Negro is but a specious and fantastic arrangement of words, by which a man can prove a horse chestnut to be a chestnut horse.\" \n \n -- Abraham Lincoln\n \n emoticon_rolleyes", 
   {}, 
   41, 
   null, 
   1044569400.0
  ], 
  [
   1161, 
   null, 
   "Broker", 
   "People change. What about clansman Byrd, president pro tempore of the Senate? He said the \"n word\" on FOX News Sunday a few years ago and he wasn't forced out of his position.", 
   {}, 
   41, 
   null, 
   1044577740.0
  ], 
  [
   1163, 
   null, 
   "fallingupwards", 
   "yes, i do know all of what you are saying. why dont you join me and american in the history debate. we were discussing the civil war. the emancipation proclamation did not free slaves in 1863, the the 13th amendment did in 1865 right before the war ended. \n \n lincoln did not originally want to abolish slavery. but lincoln did want to prevent the EXPANSION of slavery into the territories. that is what the main difference was.\n \n can i have a reliable source saying that lincoln proposed an amendment legalizing slavery? its not that i dont believe you, but i would just like to see a source. thanks.\n \n what me and american implied in the history debate was that slavery was not the \"cause\" of the war, but it was the main \"factor\" of the war. there is a huge difference. if slavery had never existed, there never would have been a civil war", 
   {}, 
   41, 
   null, 
   1044577860.0
  ], 
  [
   1168, 
   null, 
   "Heydrich", 
   "yes, i do know all of what you are saying. why dont you join me and american in the history debate. \n\n \n I would be more than happy to.\n \n \nwe were discussing the civil war. \n\n \n The War Between the States was not a Civil War.\n \n \nthe emancipation proclamation did not free slaves in 1863, the the 13th amendment did in 1865 right before the war ended. \n\n \n Yes it is true that the Emancipation Proclomation only freed slaves not under Union control, the purpose of it being a war measure to incite a servile insurrection in the South against women and children and sway British and French public opinion from entering the war.\n \n \nlincoln did not originally want to abolish slavery. \n\n \n No, Lincoln did not originally want to abolish slavery. In fact, Lincoln was more than willing to legalize the insitutition of slavery forever and help the South preserve its continuation with a new fugitive slave law. Lincoln inherited a fortune from his own wife's slave owning family from Kentucky. Did he repudiate that? Of course not, for as a trial lawyer he even defended a slave owner before the Illinois Supreme Court. I would also like to point out that blacks could not even reside within the State of Illinois, it was illegal under the Illiniois State Constitution, a measure which Lincoln was himself quite proud of. Lincoln however did consider it to be a good idea to preserve the Western states as the \"exclusive preserve of the white race\" which according to him was \"superior\" for white labour. Lincoln also considered deporting blacks to Africa, and he in fact did help colonize many blacks there, the descendents of whom went on to enslave the native African population for decades.\n \n \nbut lincoln did want to prevent the EXPANSION of slavery into the territories. that is what the main difference was.\n\n \n Lincoln did not want to contaminate the territories with the obvious inferiority of the black race, which he considered to be fit for deportation from American soil. Lincoln wished to keep the Western states the exclusive preserve of the white race, for white labour. In other words, Lincoln was appealing to the Republican Labour constituancy, a self interested political manauever by an Illinois trial lawyer.\n \n Sure. I will post it below\n \n \nwhat me and american implied in the history debate was that slavery was not the \"cause\" of the war, but it was the main \"factor\" of the war.\n\n \n I disagree entirely. That is absolutely ridiculous for a number of reasons.\n \n A. Slavery was in decline anyway due to capital intensive agriculture, especially in the Upper South which did not originally join the Confederacy.\n \n B. Lincoln was more than willing to accomodate Southern Slavery as I will detail below.\n \n C. Lincoln was not willing to negotiate with regards to his tarriff and neither was the South. It was the tarriff dispute which had been brewing for decades which caused the war, not any moralistic propaganda canard over slavery.\n \n D. Slavery did not even become an issue until well into the war, and thus it is rather ridiculous to suggest that slavery caused the war.\n \n E. The vast majority of Southerners did not own slaves in the first place.\n \n The South seceded from the United States because of Lincoln's plan to massively increase tarriffs on imports, at the expense of the South. South Carolina had threatened to secede years earlier for this specific reason. The South fired on Fort Sumter because Lincoln unconstitutionally and unilaterally blockaded Southern ports, an act of aggression, to collect his tarriff revenue and to protect Northern commerce. This led to Lincoln's call to raise troops, which led to the secession of the Upper South where slavery was in massive decline. The invasion of the South by the North is what prompted Southerners to fight the bloodiest war in American history. Southerners believed they were fighting for independence, which was precisely the case, and not to preserve an institution the vast majority of them had nothing whatsoever to do with. The War Between the States was a culimination of a broad conflict between the North and the South, a conflict which came close to flaring up again in the 1960s, over state's rights, again almost a century after slavery had been abolished. There are vast differences between the North and the South. These differences have little to do with slavery, have always existed, exist now and will in all likelihood continue to exist indefinitely.\n \n \nthere is a huge difference. if slavery had never existed, there never would have been a civil war\n\n \n That is false. The North and the South have found DOZENS of issues to bitterly disagree over since slavery has been abolished, and indeed before slavery was even a source of contention in the United States. There are broad CULTURAL differences between the North and the South that have always existed, that go back centuries to the British Isles. These differences persist to this day. The Union in the very first place was only a practical agreement. I have pointed out that Lincoln was more than willing to accomodate slavery, that Lincoln ran on a platform of preserving slave with a new fugitive slave law, and that Lincoln was willing to preserve slavery forever with a new constitutional amendment to collect his tarriff. The War Between the States was an economic dispute, as has been true of most other American wars. The South seceded from the United States for many reasons and fought for its independence for the same reasons, first and foremost because the two areas are entirely culturally alien to one another and because the economic dispute over the tarriff is what sparked it off.", 
   {}, 
   41, 
   null, 
   1044579360.0
  ], 
  [
   1171, 
   null, 
   "Heydrich", 
   "Politically Correct History\n \n by Thomas J. DiLorenzo\n \n \n http://www.lewrockwell.com/dilorenzo/dilorenzo37.html\n \n The political left in America has apparently decided that American history must be rewritten so that it can be used in the political campaign for reparations for slavery. Congressman Jesse Jackson, Jr., of Chicago inserted language in a Department of Interior appropriations bill for 2000 that instructed the National Park Service to propagandize about slavery as the sole cause of the war at all Civil War park sites. The Marxist historian Eric Foner has joined forces with Jackson and will assist the National Park Service in its efforts at rewriting history so that it better serves the political agenda of the far left. Congressman Jackson has candidly described this whole effort as \"a down payment on reparations.\" (Foner ought to be quite familiar with the \"art\" of rewriting politically-correct history. He was the chairman of the committee at Columbia University that awarded the \"prestigious\" Bancroft Prize in history to Emory University's Michael A. Bellesiles, author of the anti-Second Amendment book, \"Arming America,\" that turned out to be fraudulent. Bellesiles was forced to resign from Emory and his publisher has ceased publishing the book.)\n \n In order to accommodate the political agenda of the far left, the National Park Service will be required in effect to teach visitors to the national parks that Abraham Lincoln was a liar. Neither Lincoln nor the US Congress at the time ever said that slavery was a cause - let alone the sole cause - of their invasion of the Southern states in 1861. Both Lincoln and the Congress made it perfectly clear to the whole world that they would do all they could to protect Southern slavery as long as the secession movement could be defeated.\n ?\n On March 2, 1861, the U.S. Senate passed a proposed Thirteenth Amendment to the US Constitution (which passed the House of Representatives on February 28) that would have prohibited the federal government from ever interfering with slavery in the Southern states. (See U.S. House of Representatives, 106th Congress, 2nd Session, \"http://www.amazon.com/exec/obidos/ASIN/0160063868/lewrockwell/\", Document No. 106-214, presented by Congressman Henry Hyde (Washington, D.C. U.S. Government Printing Office, January 31, 2000). The proposed amendment read as follows:\n \n \nARTICLE THIRTEEN\n No amendment shall be made to the Constitution which will authorize or give to Congress the power to abolish or interfere, within any State, with the domestic institutions thereof, including that of persons held to labor or service by the laws of said State.\n\n Two days later, in his First Inaugural Address, Abraham Lincoln promised to support the amendment even though he believed that the Constitution already prohibited the federal government from interfering with Southern slavery. As he stated:\n \n \nI understand a proposed amendment to the Constitution . . . has passed Congress, to the effect that the Federal Government shall never interfere with the domestic institutions of the States, including that of persons held to service. To avoid misconstruction of what I have said, I depart from my purpose, not to speak of particular amendments, so far as to saythat, holding such a provision to now be implied constitutional law, I have no objection to its being made express and irrevocable (emphasis added). \n\n \n This of course was consistent with one of the opening statements of the First Inaugural, where Lincoln quoted himself as saying: \"I have no purpose, directly or indirectly, to interfere with the institution of slavery in the States where it exists. I believe I have no lawful right to do so, and I have no inclination to do so.\"\n \n That's what Lincoln said his invasion of the Southern states was not about. In an August 22, 1862, letter to New York Tribuneeditor Horace Greeley he explained to the world what the war was about<b></b>:\n \n \nMy paramount object in this struggle is to save the Union, and it is not either to save or destroy slavery. If I could save the Union without freeing any slave, I would do it; and if I could save it by freeing some and leaving others alone I would also do that. What I do about slavery, and the colored race, I do because I believe it helps to save the Union.\n\n \n Of course, many Americans at the time, North and South, believed that a military invasion of the Southern states would destroy the union by destroying its voluntary nature. To Lincoln, \"saving the Union\" meant destroying the secession movement and with it the Jeffersonian political tradition of states' rights as a check on the tyrannical proclivities of the central government. His war might have \"saved\" the union geographically, but it destroyed it philosophically as the country became a consolidated empire as opposed to a constitutional republic of sovereign states.\n \n On July 22, 1861, the US Congress issued a \"Joint Resolution on the War\" that echoed Lincoln's reasons for the invasion of the Southern states:\n \n \nResolved: . . . That this war is not being prosecuted upon our part in any spirit of oppression, nor for any purpose of conquest or subjugation, nor purpose of overthrowing or interfering with the rights or established institutions of those states, but to defend and maintain the supremacy of the Constitution and all laws made in pursuance thereof and to preserve the Union, with all the dignity, equality and rights of the several states unimpaired; and that as soon as these objects are accomplished the war ought to cease. \n\n By \"the established institutions of those states\" the Congress was referring to slavery. As with Lincoln, destroying the secession movement took precedence over doing anything about slavery. \n \n On March 2, 1861 - the same day the \"first Thirteenth Amendment\" passed the U.S. Senate - another constitutional amendment was proposed that would have outlawed secession (See H. Newcomb Morse, \"The Foundations and Meaning of Secession,\" Stetson Law Review, vol. 15, 1986, pp. 419-36). This is very telling, for it proves that Congress believed that secession was in fact constitutional under the Tenth Amendment. It would not have proposed an amendment outlawing secession if the Constitution already prohibited it. \n \n Nor would the Republican Party, which enjoyed a political monopoly after the war, have insisted that the Southern states rewrite their state constitutions to outlaw secession as a condition of being readmitted to the Union. If secession was really unconstitutional there would have been no need to do so. \n ?\n These facts will never be presented by the National Park Service or by the Lincoln cultists at the Claremont Institute, the Declaration Foundation, and elsewhere. This latter group consists of people who have spent their careers spreading lies about Lincoln and his war in order to support the political agenda of the Republican Party. They are not about to let the truth stand in their way and are hard at work producing \"educational\" materials that are filled with false but politically correct history.", 
   {
    "unicode_changes_made": true
   }, 
   41, 
   null, 
   1044579720.0
  ], 
  [
   1172, 
   null, 
   "fallingupwards", 
   "you said: \"Lincoln did not want to contaminate the territories with the obvious inferiority of the black race\"\n \n are you trying to say that black people are inferior??\n \n (it wouldnt surprise me if you are, you seem like a very racist person to me)", 
   {}, 
   41, 
   null, 
   1044579720.0
  ], 
  [
   1173, 
   null, 
   "Heydrich", 
   "you said: \"Lincoln did not want to contaminate the territories with the obvious inferiority of the black race\"\n\n \n Yes I did.\n \n \nare you trying to say that black people are inferior??\n\n \n No, I did not say that. I did say that Abraham Lincoln was a White Supremacist, that the Republican Party platform was premised upon the notion that the Western states should be the exclusive preserve of the white race for white labour, something acknowledged by Lincoln and Seward on numerous occassions.\n \n \n(it wouldnt surprise me if you are, you seem like a very racist person to me)\n\n \n This is a debate about Abraham Lincoln, the Confederate Flag, and whether or not the Confederate Flag is in some way a \"racist\" symbol. Thus, I would say Abraham Lincoln's well known white supremacist views are pertinent to this debate, including his plan to deport all blacks to Africa and Latin America to eliminate the \"Negro problem.\" I would also like to point out that it was not the Confederacy, but the United States, which in the months after the war went about exterminating the Plains Indians by means of starvation. LOL some racial egalitarians. emoticon_rolleyes", 
   {}, 
   41, 
   null, 
   1044580140.0
  ], 
  [
   1347, 
   null, 
   "American", 
   "Heydrich,\n \n You have once again made a statement without backing it up with any kind of proof. \"I would say Abraham Lincoln's well known white supremacist views are pertinent to this debate, including his plan to deport all blacks to Africa and Latin America to eliminate the 'Negro problem.'\" Why not quote something to prove this from the start, like:\n \n On August 14, 1863 Lincoln spoke to a group of free negroes who had been invited to the White House. His comments included the following:\n \n \"Why should people of your race be colonized, and where? Why should they leave this country? This is, perhaps, the first question for proper consideration.\n \n \"You and we are different races. We have between us a broader difference than exists between almost any other two races. Whether it is right or wrong, I need not discuss; but this physical difference is a great disadvantage to us both, as I think. Your race suffers very greatly, man of them, by living among us, while ours suffers from you presence. In a word, we suffer on each side.\"", 
   {}, 
   41, 
   null, 
   1044678360.0
  ], 
  [
   1355, 
   null, 
   "debategirl88", 
   "I bet this site is known for getting off subject. If you want to talk about that go on the History forums. The question is \"Is the Confederate flag a sign a racism?\". It depends on the person. I don't think alot of people use it as one, but there probably is sa few. Im NOT saying that everybody that has that flag is racist. If I had one Id probably hang it in my room. im a southern chick myself. I want to move to New York though. lol!:p", 
   {}, 
   41, 
   null, 
   1044681180.0
  ], 
  [
   1661, 
   null, 
   "Heydrich", 
   "Heydrich,You have once again made a statement without backing it up with any kind of proof. \n\n \n Notice how \"American\" criticizes my above post while selectively editing Abraham Lincoln's words, getting the date wrong, and not posting a single citation. Contrast to this to documentation I provided above, along with a link to the source of my article.\n \n \n\"I would say Abraham Lincoln's well known white supremacist views are pertinent to this debate, including his plan to deport all blacks to Africa and Latin America to eliminate the 'Negro problem.'\" Why not quote something to prove this from the start, like\n\n \n Observe how \"American\" falsifies Lincoln's words and takes them out of context:\n \n On August 14, 1863 Lincoln spoke to a group of free negroes who had been invited to the White House. His comments included the following\n \n \n\"Why should people of your race be colonized, and where? Why should they leave this country? This is, perhaps, the first question for proper consideration.\n \n \"You and we are different races. We have between us a broader difference than exists between almost any other two races. Whether it is right or wrong, I need not discuss; but this physical difference is a great disadvantage to us both, as I think. Your race suffers very greatly, man of them, by living among us, while ours suffers from you presence. In a word, we suffer on each side.\"\n\n \n The article cited of course comes from the Collected Works of Abraham Lincoln. The actual date of the address was August 14, 1862, not August 14, 1863, a year later. emoticon_rolleyes\n \n Here is what Lincoln had to say. I will highlight American's quotes to show how they were grossly taken out of context to portray a false image of Abraham Lincoln's views regarding the Negro race and its inferiority to the white man.", 
   {}, 
   41, 
   null, 
   1044926520.0
  ], 
  [
   1662, 
   null, 
   "Heydrich", 
   "[quote]This afternoon the President of the United States gave audience to a Committee of colored men at the White House. They were introduced by the Rev. J. Mitchell, Commissioner of Emigration. E. M. Thomas, the Chairman, remarked that they were there by invitation to hear what the Executive had to say to them. Having all been seated, the President, after a few preliminary observations, informed them that a sum of money had been appropriated by Congress, and placed at his disposition for the purpose of aiding the colonization in some country of the people, or a portion of them, of African descent, thereby making it his duty, as it had for a long time been his inclination, to favor that cause; and why, he asked, should the people of your race be colonized, and where? Why should they leave this country? This is, perhaps, the first question for proper consideration. You and we are different races. We have between us a broader difference than exists between almost any other two races. Whether it is right or wrong I need not discuss, but this physical difference is a great disadvantage to us both, as I think your race suffer very greatly, many of them by living among us, while ours suffer from your presence. In a word we suffer on each side. If this is admitted, it affords a reason at least why we should be separated. You here are freemen I suppose.\n \n A Voice: Yes, sir.\n \n The President---Perhaps you have long been free, or all your lives. Your race are suffering, in my judgment, the greatest wrong inflicted on any people. But even when you cease to be slaves, you are yet far removed from being placed on an equality with the white race. You are cut off from many of the advantages which the other race enjoy. The aspiration of men is to enjoy equality with the best when free, but on this broad continent, not a single man of your race is made the equal of a single man of ours. Go where you are treated the best, and the ban is still upon you.\n \n I do not propose to discuss this, but to present it as a fact with which we have to deal. I cannot alter it if I would. It is a fact, about which we all think and feel alike, I and you. We look to our condition, owing to the existence of the two races on this continent. I need not recount to you the effects upon white men, growing out of the institution of Slavery. I believe in its general evil effects on the white race. See our present condition---the country engaged in war!---our white men cutting one another's throats, none knowing how far it will extend; and then consider what we know to be the truth. But for your race among us there could not be war, although many men engaged on either side do not care for you one way or the other. Nevertheless, I repeat, without the institution of Slavery and the colored race as a basis, the war could not have an existence.\n \n It is better for us both, therefore, to be separated. I know that there are free men among you, who even if they could better their condition are not as much inclined to go out of the country as those, who being slaves could obtain their freedom on this condition. I suppose one of the principal difficulties in the way of colonization is that the free colored man cannot see that his comfort would be advanced by it. You may believe you can live in Washington or elsewhere in the United States the remainder of your life, perhaps more so than you can in any foreign country, and hence you may come to the conclusion that you have nothing to do with the idea of going to a foreign country. This is (I speak in no unkind sense) an extremely selfish view of the case.\n \n But you ought to do something to help those who are not so fortunate as yourselves. There is an unwillingness on the part of our people, harsh as it may be, for you free colored people to remain with us. Now, if you could give a start to white people, you would open a wide door for many to be made free. If we deal with those who are not free at the beginning, and whose intellects are clouded by Slavery, we have very poor materials to start with. If intelligent colored men, such as are before me, would move in this matter, much might be accomplished. It is exceedingly important that we have men at the beginning capable of thinking as white men, and not those who have been systematically oppressed.\n \n There is much to encourage you. For the sake of your race you should sacrifice something of your present comfort for the purpose of being as grand in that respect as the white people. It is a cheering thought throughout life that something can be done to ameliorate the condition of those who have been subject to the hard usage of the world. It is difficult to make a man miserable while he feels he is worthy of himself, and claims kindred to the great God who made him. In the American Revolutionary war sacrifices were made by men engaged in it; but they were cheered by the future. Gen. Washington himself endured greater physical hardships than if he had remained a British subject. Yet he was a happy man, because he was engaged in benefiting his race---something for the children of his neighbors, having none of his own.\n \n The colony of Liberia has been in existence a long time. In a certain sense it is a success. The old President of Liberia, Roberts, has just been with me---the first time I ever saw him. He says they have within the bounds of that colony between 300,000 and 400,000 people, or more than in some of our old States, such as Rhode Island or Delaware, or in some of our newer States, and less than in some of our larger ones. They are not all American colonists, or their descendants. Something less than 12,000 have been sent thither from this country. Many of the original settlers have died, yet, like people elsewhere, their offspring outnumber those deceased.\n \n The question is if the colored people are persuaded to go anywhere, why not there? One reason for an unwillingness to do so is that some of you would rather remain within reach of the country of your nativity. I do not know how much attachment you may have toward our race. It does not strike me that you have the greatest reason to love them. But still you are attached to them at all events.\n \n The place I am thinking about having for a colony is in Central America. It is nearer to us than Liberia---not much more than one-fourth as far as Liberia, and within seven days'--- run by steamers. Unlike Liberia it is on a great line of travel---it is a highway. The country is a very excellent one for any people, and with great natural resources and advantages, and especially because of the similarity of climate with your native land---thus being suited to your physical condition.\n \n The particular place I have in view is to be a great highway from the Atlantic or Caribbean Sea to the Pacific Ocean, and this particular place has all the advantages for a colony. On both sides there are harbors among the finest in the world. \n Again, there is evidence of very rich coal mines. A certain amount of coal is valuable in any country, and there may be more than enough for the wants of the country. Why I attach so much importance to coal is, it will afford an opportunity to the inhabitants for immediate employment till they get ready to settle permanently in their homes.\n \n If you take colonists where there is no good landing, there is a bad show; and so where there is nothing to cultivate, and of which to make a farm. But if something is started so that you can get your daily bread as soon as you reach there, it is a great advantage. Coal land is the best thing I know of with which to commence an enterprise.\n \n To return, you have been talked to upon this subject, and told that a speculation is intended by gentlemen, who have an interest in the country, including the coal mines. We have been mistaken all our lives if we do not know whites as well as blacks look to their self-interest. Unless among those deficient of intellect everybody you trade with makes something. You meet with these things here as elsewhere.\n \n If such persons have what will be an advantage to them, the question is whether it cannot be made of advantage to you. You are intelligent, and know that success does not as much depend on external help as on self-reliance. Much, therefore, depends upon yourselves. As to the coal mines, I think I see the means available for your self reliance.\n \n I shall, if I get a sufficient number of you engaged, have provisions made that you shall not be wronged. If you will engage in the enterprise I will spend some of the money intrusted to me. I am not sure you will succeed. The Government may lose the money, but we cannot succeed unless we try; but we think, with care, we can succeed.\n \n continued below\n \n [...]\n \n [quote]", 
   {}, 
   41, 
   null, 
   1044926520.0
  ], 
  [
   1667, 
   null, 
   "Heydrich", 
   "The political affairs in Central America are not in quite as satisfactory condition as I wish. There are contending factions in that quarter; but it is true all the factions are agreed alike on the subject of colonization, and want it, and are more generous than we are here. To your colored race they have no objection. Besides, I would endeavor to have you made equals, and have the best assurance that you should be the equals of the best.\n The practical thing I want to ascertain is whether I can get a number of able-bodied men, with their wives and children, who are willing to go, when I present evidence of encouragement and protection. Could I get a hundred tolerably intelligent men, with their wives and children, to \"cut their own fodder,\" so to speak? Can I have fifty? If I could find twenty-five able-bodied men, with a mixture of women and children, good things in the family relation, I think I could make a successful commencement.\n I want you to let me know whether this can be done or not. This is the practical part of my wish to see you. There are subjects of very great importance, worthy of a month's study, instead of a speech delivered in an hour. I ask you then to consider seriously not pertaining to yourselves merely, not for your race, and ours, for the present time, but as one of the things, if successfully managed, for the good of mankind---not confined to the present generation, but as\n \"From age to age descends the lay,\n To millions yet to be,\n Till far its echoes roll away,\n Into eternity.\"\n \n The above is merely given as the substance of the President's remarks\n \n The Chairman of the delegation briefly replied that \"they would hold a consultation and in a short time give an answer.\" The President said: \"Take your full time---no hurry at all.\"\n The delegation then withdrew.[/quote]\n \n Lincoln, A. (1953-55). Collected Works. \n \n http://www.learner.org/channel/workshops/primarysources/emancipation/docs/address2.html", 
   {}, 
   41, 
   null, 
   1044926820.0
  ], 
  [
   1671, 
   null, 
   "debategirl88", 
   "OK, get back on subject please!", 
   {}, 
   41, 
   null, 
   1044932700.0
  ], 
  [
   1685, 
   null, 
   "fallingupwards", 
   "actually the flag that we associate with the confederacy was never the official confederate flag at all. it was the flag of the northern armies of virginia. the actual real confederate flag had three horizontal stripes (white, red, white) and a blue box in the top left corner with stars in it. that was the official confederate flag. but nobody today associates the confederacy with it.", 
   {}, 
   41, 
   null, 
   1044935580.0
  ], 
  [
   1765, 
   null, 
   "tsmith2771", 
   "You are somewhat right but not quite. The flag everyone sees today as the Confederate Flag was actually the Confederate naval jack. The army of Virgina's flag was square.", 
   {}, 
   41, 
   null, 
   1045010220.0
  ], 
  [
   3023, 
   null, 
   "Crim", 
   "The confederate flag is a symbol of whatever the people displaying it want it to be.\n \n You can't tell someone else what their motivation is.\n \n \"I like this shirt. It's about being proud to be a southerner.\"\n \"No, you wear that shirt because you're a racist.\"\n \n \n \n There is no right to not be offended.", 
   {}, 
   41, 
   null, 
   1046057520.0
  ], 
  [
   3793, 
   null, 
   "Middle", 
   "Actually a great many flags were used in the Civil War, in fact I think there were definitely more than 10. Each state had it's own version. I live in the south, from anyone I know, we do not treat the flag as a symbol of racism, more as a kind of southern pride. Some people may see it differently though... My family took a trip way down south a couple of years ago, and down in southern Florida there were southern flags all around. They were even on billboards. I mean, you can take it or leave it, but I don't think many people would tolerate those flags if they were meant as a symbol of racism.", 
   {}, 
   41, 
   null, 
   1046739180.0
  ], 
  [
   4423, 
   null, 
   "debategirl88", 
   "I live in the south to. I totally agree with Middle, it is for southern pride. \n \n \n People say I have a southern accent. I say yall and all that stuff.\n \n emoticon_xchicken emoticon_xchicken emoticon_xchicken", 
   {}, 
   41, 
   null, 
   1047423300.0
  ], 
  [
   7224, 
   null, 
   "wjim1269", 
   "I have a flag of some sports teams that I fly when they play. The flag shows that I have pride in that team.\n \n The confederate flag represents the south. It shows that people have pride in their region. The south is a lot different from the north. (And I don't mean that in a bad way. It is just a different way of life.) The confederate flag shows that people have pride in their culture.", 
   {}, 
   41, 
   null, 
   1051374180.0
  ], 
  [
   7640, 
   null, 
   "Middle", 
   "Very well said...:)", 
   {}, 
   41, 
   null, 
   1052002740.0
  ], 
  [
   8159, 
   null, 
   "airhead", 
   "without stating my opinion or taking a stance, would someone mind telling me what exactly the south stands for? when people say \"southern pride\", it is pride in what? \n as far as i can tell (i am sure that i can be wrong), there isn't a southern culture. there are many regions in the south, and it's fairly diverse in culture.... \n i am sure that people aren't just proud of a piece of land in the southern part of the US, so the question is \"southern pride\" is pride in what, exactly?\n i guess i have never been to the south, so i don't know.", 
   {}, 
   41, 
   null, 
   1053260100.0
  ], 
  [
   8185, 
   null, 
   "Crim", 
   "<shrug<\n \n Southern food\n Old school \"Bible Belt\" values\n Non-'city slicker' lifestyle\n Slow living\n NASCAR", 
   {}, 
   41, 
   null, 
   1053318420.0
  ], 
  [
   8402, 
   null, 
   "Chai", 
   "LOL. I'm a Yankee transplant, and I'd guess to say that \"Southern Pride\" is basically being happy you're not a Northerner, which I would guess includes part of what crim said. One question, though: Why are we bothering to debate if we're all on the same side? The only argument I've seen on this post is whether Abraham Lincoln was a white supremacist or not.", 
   {}, 
   41, 
   null, 
   1053906300.0
  ], 
  [
   8814, 
   null, 
   "SilentPoet", 
   "The Civil War was origonally fought for states right by the south. Slavery was very controversial but did not become a primary goal until Lincoln issued the Emancipation Proclomation, issuing all slaves their freedom. \n Afterwards it became even more of a struggle for and against slavery. \n The confederate flag represents the south and its struggle and the people who died for it. \n \n Looking into technecalities, the southern struggle by the end of the war was to keep slavery and defend their homeland.\n The norths struggle was to end it and to re-unite the Union\n The symbol of the Souths struggle became the Confederate flag. \n \n There are alot of people who fly the flag not because they are racist, and not because they support slavery, but because they are honoring the souths fallen heroes. \n \n But of course it has also come to attention that the flag is also flown alot for racism, and support of slavery. \n \n The confederate flag offends alot of people. Most of the offended people are African American. Althought their are alot of northeners who also do not like the flag. There are also people living in the south who disagree with flying it. \n \n I will now attempt to compare the confederate flag with the swastika.\n As you should know the swastika was a symbol used by Nazi's during WW2. It represented the Nazi party, and their ideas. The actions they took against people that were not like them, resulted in the worst genocide of all of human history. The Holocaust. Their are still alot of Nazi's out their who wish the same thing to happen again and to \"finish the job\". \n \n *Anyone who supports and advocates the Nazi party I will not speak with on this debate.*\n \n The Germans are ashamed of their history because they know what acts their relatives, and alot of deceased parents, grandparents, etc did was horrible, \"evil\" and wrong. \n Their is no swastika flown on Germany's capital, and I would be HIGHLY suprised to find it on any building, or for anyone to wear or shirt like that in any part of Germany without being condemned.\n \n The swastika reprents those horrible acts and ideas about how the world should be run. Those ideas I have accepted already as wrong. \n \n Of course the events of the Holocaust are far more drastic than that of slavery. But for some reason a symbol flys more frequently for one and is more accepted and more controversial than the other.\n \n I wouldn't like to make all southeners who fought in the revolutionary war to sound horrible, because I am related to some of them. My goal is to show that both the Germans and Confederates fought for something that was wrong.\n \n Therefor why should they be honored as heroes?\n \n Thank you for reading this\n \n If you would like to talk through faster communication:\n Email: SilentPoet326@hotmail.com\n AOL Screen Name: SilentPoet326\n \n Always Stay Open Minded", 
   {
    "post_info": {
     "post_title": "Reply 1"
    }
   }, 
   41, 
   null, 
   1054678500.0
  ], 
  [
   8820, 
   null, 
   "Striel", 
   "It's a flag. The people who fly that flag don't care about it's history. Most of the people around here that do it, just think of it as \"country pride\"", 
   {}, 
   41, 
   null, 
   1054678800.0
  ], 
  [
   8884, 
   null, 
   "wjim1269", 
   "Why did people fly the American flag after 9/11? Because they had pride in their country.\n \n People fly the confederate flag for the same reason: they have pride in their region. The confederate flag symbolizes that this is a different region, with a different lifestyle, and that these people have southern pride. (Trust me on this one, I just moved from a northern state to a southern state!)\n \n Personally, I will never fly a confederate flag because some people might find it offensive. However, I still believe if a state votes to fly the flag, then they should have the right to fly it.", 
   {}, 
   41, 
   null, 
   1054695000.0
  ], 
  [
   8890, 
   null, 
   "SilentPoet", 
   "I find it completely ok if people fly the flag. They can fly it all over their homes, and wear the shirts to public places. The problem I have is when the SC state house flies it on their grounds. Having a monument specifically dedicated to the fallen soldiers is ok. Although I still can compare it to giving a monument to fallen Nazi soldiers, which I think most people can find wrong. Doing that honors them, what they fought for, and dishonors the people they killed. In this case its the people they enslaved. \n \n \n I am currently living in a southern state, and although I did not grow up in a extreme southern enviorment I am aware of the cultural diffrence between the south and the north. \n \n To say that the flags main or sole purpose is to just say hey looks we are a diffrent culture or have a diffrent lifestyle down here seems a bit absurd. Although I'd like to clarify that there is probably a small percentage of people who use the confederate flag for that purpose. \n \n wjim1269: \"The confederate flag symbolizes that this is a different region, with a different lifestyle\"\n \n To illustrate the point of fallen soldiers the confederate flag flys right above the confederate monument at the state house. So an obvious intention is to honor soldiers who were (as I have pointed out in Reply 1 and in \"History\") beleivers in slavery. \n \n \n Thanks for reading this\n \n Always Stay Open Minded", 
   {
    "post_info": {
     "post_title": "Reply 2"
    }
   }, 
   41, 
   null, 
   1054696020.0
  ], 
  [
   9701, 
   null, 
   "SilentPoet", 
   "No response....\n \n I surely don't want to claim this as a victory because I'm sure people have more to say... \n \n Always Stay Open Minded", 
   {}, 
   41, 
   null, 
   1055555580.0
  ], 
  [
   9710, 
   null, 
   "wjim1269", 
   "I haven't given up on this debate. I just haven't had time to post much in the past few days. I am working on a response.", 
   {}, 
   41, 
   null, 
   1055557620.0
  ], 
  [
   11430, 
   null, 
   "tsmith2771", 
   "How many years did the Confederate Flag fly over slave ships? 0\n How many years did the American Flag fly over slave ships? over 75 years.\n \n Which flag is racist?", 
   {}, 
   9710, 
   null, 
   1057364880.0
  ], 
  [
   11482, 
   null, 
   "enfant terrible", 
   "How many years did the American Flag fly over slave ships? over 75 years.\n\n \n Who told you this?\n \n Slave trade became illegal in the US in 1807, see e.g. Cornell site about Amistad. This is only 30 years after adoption of the US flag and 24 years after most Atlantic nations recognized the US as an independent country. That means that some form of the US flag may have flown over slave ships for at most 24 years.\n \n But today's flag of the US certainly never did.", 
   {
    "post_info": {
     "post_title": "Not that it is relevant, but..."
    }
   }, 
   11430, 
   null, 
   1057558500.0
  ], 
  [
   11491, 
   null, 
   "tsmith2771", 
   "Who told you this?\n \n Slave trade became illegal in the US in 1807, see e.g. Cornell site about Amistad. This is only 30 years after adoption of the US flag and 24 years after most Atlantic nations recognized the US as an independent country. That means that some form of the US flag may have flown over slave ships for at most 24 years.\n \n But today's flag of the US certainly never did.\n\n \n Whenever it became illegal the UNITED STATES flag flew over slave ships, not the Confederate Flag. And no its not the same flag as today, a few stars were added.", 
   {}, 
   11482, 
   null, 
   1057564080.0
  ], 
  [
   11505, 
   null, 
   "enfant terrible", 
   "Whenever it became illegal the UNITED STATES flag flew over slave ships\n\n \n Well, do you have an example?\n \n One of your factual statements was just proven dead wrong; why should we take another at face value?\n \n Besides, even if what you claim is true, do you honestly think it has any relevance for the issue?", 
   {}, 
   11491, 
   null, 
   1057573800.0
  ], 
  [
   11528, 
   null, 
   "wjim1269", 
   "The Confederate Flag did not fly over any slave ships because the Confederacy did not exist until the 1860s. The American flag was the one that flew over slave ships registered in America. Regardless of the years, tsmith is right. The American flag flew over slave ships; the Confederate flag did not. And by the way, the flag that everyone debates over was actually not the Confederate flag; it was the flag of Virginia. The flag people fly today was actually the Confederate Naval Jack.", 
   {}, 
   11505, 
   null, 
   1057638300.0
  ], 
  [
   11535, 
   null, 
   "tsmith2771", 
   "Well, do you have an example?\n \n One of your factual statements was just proven dead wrong; why should we take another at face value?\n \n Besides, even if what you claim is true, do you honestly think it has any relevance for the issue?\n\n \n Yes I do think its relevant, how can you say the american flag isn't racist when it flew over the slave ships carring blacks from africa. How many times did the confederate flag fly over slave ships?", 
   {}, 
   11505, 
   null, 
   1057643580.0
  ], 
  [
   11536, 
   null, 
   "tsmith2771", 
   " And by the way, the flag that everyone debates over was actually not the Confederate flag; it was the flag of Virginia. The flag people fly today was actually the Confederate Naval Jack.\n\n \n What flag are you talking about? The square flag was the flag of the army of northern virginia and the rectangle flag that we all know today is the confederate naval jack. The real confederate flag looks extremely close to the american flag.", 
   {}, 
   11528, 
   null, 
   1057643700.0
  ], 
  [
   11537, 
   null, 
   "tsmith2771", 
   "And by the way who do you think started the slave trade?", 
   {}, 
   11536, 
   null, 
   1057643760.0
  ], 
  [
   11538, 
   null, 
   "wjim1269", 
   "I am talking about the rectangular flag, the one that everyone says is the Confederate flag.\n \n Sorry, I don't know what I was thinking about when I said that. I guess I must have been tired from my travels home. The flag of Virginia is the flag that the army of Virginia marched under. The flag representing the Confederacy was based on the American flag. Sorry for the misstatement.", 
   {}, 
   11537, 
   null, 
   1057645380.0
  ], 
  [
   11539, 
   null, 
   "tsmith2771", 
   "I wasn't trying to attack you or say your wrong, just trying to clarify", 
   {}, 
   11538, 
   null, 
   1057645500.0
  ], 
  [
   11542, 
   null, 
   "wjim1269", 
   "No, I just read your post, looked back at mine, and realized that I was wrong, so I thought I would confirm that you are right and that I was wrong. I didn't mean to come across that I thought you were attacking me.", 
   {}, 
   11539, 
   null, 
   1057645860.0
  ], 
  [
   11559, 
   null, 
   "enfant terrible", 
   "how can you say the american flag isn't racist when it flew over the slave ships carring blacks from africa.\n \n \n First, it is not a settled fact in this discussion that it ever did fly over any slave ship.\n \n Second, even if we assume that it did, it could not symbolize slavery because, with regard to slavery, there was nothing unusual about the USA in late 18th century. It did what most other countries did.\n \n But the Confederacy in 1861 is very different - it was one of the world's last bastions of slavery, and was fighting a war for, among other things, its power to remain that. \n \n \nHow many times did the confederate flag fly over slave ships? \n\n \n The Nazi flag never flew over a single slave ship. Does that mean it is not a symbol of racism?", 
   {}, 
   11535, 
   null, 
   1057653660.0
  ], 
  [
   11560, 
   null, 
   "tsmith2771", 
   "First off, I hate how people always refer to the Nazi flag because it is a horrid analogy. \n \n Second, sorry no I don't have any pictures of american flags flying over slave ships but it did happen, how do you think they got here? Do you think they showed up in Boston and said hey, we want to work for you. They were part of the triangle trade which involved british, american, french and many other countries. \n \n Third, who started slavery? Who actually inslaved the blacks first?", 
   {}, 
   11559, 
   null, 
   1057653840.0
  ], 
  [
   11609, 
   null, 
   "wjim1269", 
   "The Confederacy was not fighting for slavery. Lincoln promised to allow the states to keep their slaves if they would not leave the union, but they left anyway.\n \n Also, not all southerners owned slaves. To own slaves, you had to own land, purchase seeds, and provide for the well-being of all your slaves. You had to have money. Many southerners were not even able to purchase marching boots to wear while in the military. If they couldn't afford a pair of boots, they certainly wouldn't be able to own a slave.\n \n Also, southerners would not have fought for a system that impoverished them. With each slave that was brought over, one less job was available for the free people. Thus, this made their labor decrease in value because there was now a greater demand for jobs.\n \n What were the Confederates fighting for? It wasn't racism. It wasn't slavery. It was state's rights.", 
   {
    "post_info": {
     "post_title": "What were the Confederates fighting for?"
    }
   }, 
   11560, 
   null, 
   1057682760.0
  ], 
  [
   11621, 
   null, 
   "enfant terrible", 
   "First off, I hate how people always refer to the Nazi flag because it is a horrid analogy. \n\n \n You hate it because it exposes the flaw in your argument. You also seem to misunderstand the analogy. No one says Nazism and American slavery are at an equal (or similar) level of reprehensibility. The analogy is formal: the two logical arguments are exactly equivalent:\n \n YOU: CF was not on slave ships, THEREFORE CF does not symbolize racism.\n \n ME: swastika was not on slave ships, THEREFORE swastika does not symbolize racism.\n \n Note that you can also substitute \"olive branch\" for \"CF\" or \"swastika\" and have the analogous argument. In that case the conclusion would happen to be true, but that is just incidental: in the \"swastika\" example the argument leads to a patently false conclusion. This shows that your argument itself is worthless.\n \n \nSecond, sorry no I don't have any pictures of american flags flying over slave ships but it did happen, how do you think they got here?\n \n \n Very few slaves were imported after the USA was formed. I don't know if any US ships were used for that purpose. As I already explained, it is not relevant for the issue, but I am sure you can find out easily if you consult some history sources.\n \n \nThird, who started slavery? Who actually inslaved the blacks first? \n\n \n Slavery of course precedes written documents, so this question would take the discussion very far from the issue. A narrower issue for American slavery is who revived the practice after having abandoned it for a long time. The answer then is the Spanish and Potugese, when they needed more labor in their new colonies. Again, this is irrelevant for the issue.", 
   {}, 
   11560, 
   null, 
   1057692840.0
  ], 
  [
   11623, 
   null, 
   "enfant terrible", 
   "not all southerners owned slaves. \n\n \n Of course not. Who said they did?\n \n \nAlso, southerners would not have fought for a system that impoverished them. With each slave that was brought over, one less job was available for the free people. Thus, this made their labor decrease in value because there was now a greater demand for jobs.\n\n \n This is a very weak argument. First, there were no slaves brought over at least since 1807, and in some states well before that. Second, freeing the existing slaves would not make any more jobs available, and they would start competing with whites for many jobs that were reserved for whites before. It was thus in the best economic interest of poor Southern whites that no slaves be freed. Third, even if you were right on the economic issue (which you are not), you underestimate the patriotic sentiments. People do in fact fight with all their hearts for their countries whose systems/regimes impoverish them. The Kambodians fought against the Vietnam invasion even though the Khmer Rouge regime was objectively the far greater evil; the Iranians fought fanatically in the Iraq-Iran war; the North Koreans would do the same if a conflict with South Korea broke out. And these are infinitely more drastic examples than anything suffered by poor white Southerners.\n \n \nWhat were the Confederates fighting for? It wasn't racism. It wasn't slavery. It was state's rights. \n\n \n There is no such thing as state rights. Individuals have rights, states have powers. But yes, they did fight for state powers against federal powers. But which powers specifically? Look better and you'll see that slavery was the key issue indeed.\n \n The source of the conflict was economic in nature. The emerging industrial, capital-intensive North was quickly gaining importance and the agricultural, labor-intensive South was losing it. his threatened the wealth and the power of the ruling class in the South and they wanted to limit interstate commerce to protect themselves. The North did not want to allow that (and interstate commerce was in the federal domain) and the war broke out essentially for that reason.\n \n You may say this has little to do with slavery, but the wealth and power of the Southern quasi-aristocracy was very much based on the profits they made on products of slave labor. As such profits would diminish, many of them would get less wealthy and less able to keep huge plantanions and many slaves. Even if they were allowed to keep slavery legal, the system would eventually collapse under economic pressures. And that would, as I explained before, hurt the poor Southerners in the labor market. Thus preservation of slavery was an essential part of the South's goals.", 
   {}, 
   11609, 
   null, 
   1057695120.0
  ], 
  [
   11667, 
   null, 
   "wjim1269", 
   "First, there were no slaves brought over at least since 1807, and in some states well before that.\n\n \n I had forgotten that. I stand corrected.\n \n \nSecond, freeing the existing slaves would not make any more jobs available, and they would start competing with whites for many jobs that were reserved for whites before. It was thus in the best economic interest of poor Southern whites that no slaves be freed.\n\n \n Without slavery, you would still have the same number of workers and the same number of jobs. By looking at the Jim Crow era that followed the freeing of slaves after the Civil War, I doubt that blacks would have been able to compete for jobs reserved for whites. If that were the case, then it probably would have increased job availablity for whites. Not only would whites have first access to the jobs they already had, but many plantantion owners, when forced to decide between choosing to pay a white person or a black person, would probably have chosen the white person.\n \n \nyou underestimate the patriotic sentiments.\n\n \n No, I don't. I believe that is exactly what they fought for. They had more of a pride in their state (SC, GA, MS, etc.) than they did for their country (USA). When forced to back one, they backed their state government.\n \n \n I would furthermore like to point out that it is correct that today the Confederate flag is misused as a hate symbol. However, the same organization that turned the Confederate flag into a hate symbol also uses the Christian cross as a hate symbol by burning it. I don't see a push to ban use of the Christian cross, so why do people push banning the Confederate flag.", 
   {}, 
   11623, 
   null, 
   1057717500.0
  ], 
  [
   11727, 
   null, 
   "enfant terrible", 
   "Without slavery, you would still have the same number of workers and the same number of jobs. \n\n \n Workers, yes. Jobs, not necessarily. It depends on how abolishing slavery would affect the economy. Since the economy of the South depended significantly on agricultural products of slave labor, abolition was almost certain to cause a recession and fewer jobs would be available. But my argument still holds even if the number of jobs remains the same.\n \n \nBy looking at the Jim Crow era that followed the freeing of slaves after the Civil War, I doubt that blacks would have been able to compete for jobs reserved for whites. \n\n \n Jim Crow laws were an unconstitutional attempt to reverse the liberation of slaves. Taking them as the given conditions reverses cause and effect. They were enacted precisely to prevent blacks from competing with whites - in all spheres, economic, political, etc. And if whites did not fear that competition, why would they have pushed for such laws?\n \n \nIf that were the case, then it probably would have increased job availablity for whites. Not only would whites have first access to the jobs they already had, but many plantantion owners, when forced to decide between choosing to pay a white person or a black person, would probably have chosen the white person.\n\n \n First, you must realize that plantation work is less desirable than, say, making shoes. Second, while plantation owners owned slaves, they paid nothing other than housing and food (usually below most free people's standards). Now they have to pay wages. Most blacks, used to poorer conditions, would be willing to work for less than most whites. Most plantation owners would choose cheaper labor. Whites would have to lower their wage expectations to compete. Owners would probably be willing to pay whites a little more than blacks, but that still would have been low. Third, consumers would also follow their prejudices only to a point where it becomes too expensive. So trained blacks, like cooks and blacksmiths, would be able to compete with whites by working cheaper. Again, most whites would lose economically.\n \n \nHowever, the same organization that turned the Confederate flag into a hate symbol also uses the Christian cross as a hate symbol by burning it. I don't see a push to ban use of the Christian cross, so why do people push banning the Confederate flag. \n\n \n 1. A cross and a burning cross are two completely different symbols. (You wouldn't say that a burning bush means the same as a bush, would you?)\n \n 2. You can forbid the use of a burning cross in some (many) circumstances.\n \n 3. A state may not use a cross on its official building anyway, so your analogy does not help your case.", 
   {}, 
   11667, 
   null, 
   1057799580.0
  ], 
  [
   11766, 
   null, 
   "wjim1269", 
   "Jim Crow laws were an unconstitutional attempt to reverse the liberation of slaves. Taking them as the given conditions reverses cause and effect. They were enacted precisely to prevent blacks from competing with whites - in all spheres, economic, political, etc. And if whites did not fear that competition, why would they have pushed for such laws?\n\n \n But despite their unconstitutionality, the Jim Crow laws survived for years.\n \n \nA cross and a burning cross are two completely different symbols. (You wouldn't say that a burning bush means the same as a bush, would you?)\n\n \n But even a burning cross can mean something other than racism or white superiority. In Scotland, a burning cross is a rally symbol.\n \n \nA state may not use a cross on its official building anyway, so your analogy does not help your case.\n\n \n It depends on what we are debating. If we are debating the individual right to display the confederate flag, then it does. If we are debating the right of the state to use it on government property, then it does not.", 
   {}, 
   11727, 
   null, 
   1057818540.0
  ], 
  [
   11771, 
   null, 
   "enfant terrible", 
   "But despite their unconstitutionality, the Jim Crow laws survived for years.\n\n \n That is irrelevant for the economic argument within which you brought them up.\n \n \nBut even a burning cross can mean something other than racism or white superiority. In Scotland, a burning cross is a rally symbol.\n\n \n Of course - there is no symbol that has a meaning outside the cultural context. A swastika can be a symbol of life and fertility, American symbol for peace (raised index and middle finger) means \"victory\" in England and (so I've heard) \"up yours\" in Australia, shaking head symbols for \"yes\" and \"no\" are reversed in Bulgaria, \"P\" means \"R\" to Greeks and nations using ciryllics, and \":-)\" meant nothing to anyone in the world before there was Internet.\n \n \nIt depends on what we are debating. If we are debating the individual right to display the confederate flag, then it does. If we are debating the right of the state to use it on government property, then it does not. \n\n \n I cannot see how anyone normal could challenge the individual right to display the CF.\n \n I do not even argue that states may never display it. There are cases where uninterrupted history and tradition show that other, non-racist, meanings outweigh the racist connotations.\n \n I have simply been arguing that the CF has a meaning which is racist. (Note the emphasis and please do not quote without restoring it!)", 
   {}, 
   11766, 
   null, 
   1057821120.0
  ], 
  [
   11791, 
   null, 
   "wjim1269", 
   "After your last post, I believe that we have misunderstood each other's viewpoints. I interpreted that you were saying that the only way to intepret the Confederate Flag was a racist one. However, I agree that there is a racist way to interpret the flag, but it is not the only way to do so.\n \n I believe that individuals should have the right to fly the confederate flag regardless of what they believe.\n \n I believe that states should also have the right to fly the confederate flag on their buildings if the citizens choose to do so. To avoid conflicts, I believe that the states who choose to fly it should publish the reasons why they choose to fly it, but I believe that they should still have that right.", 
   {}, 
   11771, 
   null, 
   1057860720.0
  ], 
  [
   11793, 
   null, 
   "enfant terrible", 
   "After your last post, I believe that we have misunderstood each other's viewpoints. \n\n \n Yes, it seems there isn't that much disagreement.\n \n \nI believe that states should also have the right to fly the confederate flag on their buildings if the citizens choose to do so. \n\n \n I may be boring with this already, but a state cannot have rights, just powers. People have rights. The issue here is how the conflict between the will of the majority and the rights of the minority should be resolved.\n \n You may argue that the discrimination claim is weak, but the state interest in using the CF is even weaker. It is hard to even imagine how a state can have any interest in displaying any flag other than the US flag and the official state flag.\n \n \nTo avoid conflicts, I believe that the states who choose to fly it should publish the reasons why they choose to fly it, but I believe that they should still have that right. \n\n \n That is an interesting idea, but how would you prevent them from lying? Besides, I don't think that, legally, the constitutionality of a symbol can depend on the stated reasons for its use.", 
   {}, 
   11791, 
   null, 
   1057862940.0
  ], 
  [
   12590, 
   null, 
   "1979", 
   "no\n anyone who thinks that is a XXXXX\n \n just because the south was pro slavery dosent mean that their flag is a symbol of slavery\n\n \n I don't think the flag itself stands for racism, but I do believe that certain people believe that it does, and they use that as their own personal symbol for their beliefs. Where I live, there are a lot of racist people, and I know they are racist because of the things they do and say, and they are the ones who wave their confederate flags around and wear them on their clothes.....", 
   {}, 
   720, 
   null, 
   1059947040.0
  ], 
  [
   12591, 
   null, 
   "1979", 
   "Yes, it seems there isn't that much disagreement.\n \n \n \n I may be boring with this already, but a state cannot have rights, just powers. People have rights. The issue here is how the conflict between the will of the majority and the rights of the minority should be resolved.\n \n You may argue that the discrimination claim is weak, but the state interest in using the CF is even weaker. It is hard to even imagine how a state can have any interest in displaying any flag other than the US flag and the official state flag.\n \n \n \n That is an interesting idea, but how would you prevent them from lying? Besides, I don't think that, legally, the constitutionality of a symbol can depend on the stated reasons for its use.\n\n \n \n I agree that PEOPLE have rights, not states... what if there are certain people in that state that DON'T agree with the issue?", 
   {}, 
   11793, 
   null, 
   1059947880.0
  ], 
  [
   12637, 
   null, 
   "wjim1269", 
   "what if there are certain people in that state that DON'T agree with the issue?\n\n \n Do you agree with everything your government does? Probably not.\n \n Our elected officals are supposed to act in the interest of the majority of the state. Obviously, they aren't always able to do it, but that is the goal. If a large portion of the residents of a state feel that the Confederate Flag issue is important enough, they will consider that when they vote for their representatives. In that case, the representatives would be acting in the direct interest of the people on an issue that the people feel is important to them. If the people do not feel that it is important enough of an issue, then there is no purpose in debating it here.\n \n Also, sorry for using rights instead of powers. My errant memory told me that A10 used \"rights.\" You are correct, it does use \"powers.\"", 
   {}, 
   12591, 
   null, 
   1059979500.0
  ], 
  [
   12642, 
   null, 
   "1979", 
   "Do you agree with everything your government does? Probably not.\n \n Our elected officals are supposed to act in the interest of the majority of the state. Obviously, they aren't always able to do it, but that is the goal. If a large portion of the residents of a state feel that the Confederate Flag issue is important enough, they will consider that when they vote for their representatives. In that case, the representatives would be acting in the direct interest of the people on an issue that the people feel is important to them. If the people do not feel that it is important enough of an issue, then there is no purpose in debating it here.\n \n Also, sorry for using rights instead of powers. My errant memory told me that A10 used \"rights.\" You are correct, it does use \"powers.\"\n\n \n Well, as I said before, I don't believe that the flag itself is a symbol of racism, and I don't believe that everyone who flies one or wears one on their clothes is racist... I just know that there are people out there who think that it does stand for that, so that's why they 'like' it.\n When I said \"what if there are people who don't agree with it\", I meant those people who believe that it is a symbol of racism and don't want to be associated with that....", 
   {}, 
   12637, 
   null, 
   1059989100.0
  ], 
  [
   94286, 
   null, 
   "zodiacphil", 
   "There is nothing wrong with the Stars & Bars, better known as the Confederate Flag. It's part of Our history. A lot of brave men both black and white died under that flag. (It's A Battle Flag)\n People seem to forget that the Civil War was a war about states rights. Long before the slave issue was interjected.", 
   {
    "post_info": {
     "post_title": "It's History!!!"
    }
   }, 
   41, 
   null, 
   1109634960.0
  ], 
  [
   94378, 
   null, 
   "zachvac", 
   "There is nothing wrong with the Stars & Bars, better known as the Confederate Flag. It's part of Our history. A lot of brave men both black and white died under that flag. (It's A Battle Flag)\n People seem to forget that the Civil War was a war about states rights. Long before the slave issue was interjected.\n\n \n I agree. There's nothing wrong with a confederate flag.", 
   {}, 
   94286, 
   null, 
   1109655900.0
  ], 
  [
   94870, 
   null, 
   "Master_Shake", 
   "You lost. Get over it.", 
   {}, 
   94378, 
   null, 
   1109792760.0
  ], 
  [
   94953, 
   null, 
   "zachvac", 
   "What do you mean I lost? I wasn't even involved in the original debate, I was just posting my opinion now.", 
   {}, 
   94870, 
   null, 
   1109806260.0
  ], 
  [
   94959, 
   null, 
   "sinjin", 
   "What do you mean I lost? I wasn't even involved in the original debate, I was just posting my opinion now.\n\n \n I believe he was referring to the Confederacy.", 
   {}, 
   94953, 
   null, 
   1109806800.0
  ], 
  [
   94963, 
   null, 
   "zachvac", 
   "ohhhh, I see.", 
   {}, 
   94959, 
   null, 
   1109807040.0
  ], 
  [
   94980, 
   null, 
   "Big Orn", 
   "You lost. Get over it.\n\n That's just what we wanted ya'll to think... :p emoticon_rolleyes \n \n  Look Away! Look Away! Look away, Dixieland!\n \n Ya'll took the bait so quick, we had to look away. We wanted to point and laugh, but ya'll was tore up too bad. :)", 
   {}, 
   94870, 
   null, 
   1109808300.0
  ], 
  [
   95169, 
   null, 
   "jyoshu", 
   "You lost. Get over it.\n\n \n So did Custer, but that doesn't mean we should try and erase his name from history.", 
   {}, 
   94870, 
   null, 
   1109877600.0
  ], 
  [
   95208, 
   null, 
   "Master_Shake", 
   "So did Custer, but that doesn't mean we should try and erase his name from history.\n\n \n Relax, first of all, I said nothing about erasing the civil war from our history.\n Secondly, learn to take a joke.", 
   {}, 
   95169, 
   null, 
   1109888040.0
  ], 
  [
   95215, 
   null, 
   "jyoshu", 
   "Relax, first of all, I said nothing about erasing the civil war from our history.\n Secondly, learn to take a joke.\n\n \n Woo Hoo, ha ha ha--I'm rolling in the floor it was such a funny joke . . . emoticon_rolleyes \n \n Chill out, man! Not everything is about you", 
   {}, 
   95208, 
   null, 
   1109888640.0
  ], 
  [
   95255, 
   null, 
   "zachvac", 
   "Anyway, back to the original topic (sort of):\n \n The problem is that the victors write the history books. That's why we learn that all the people in the south were horrible rich white slave-owners. Sure there were probably some people like that, but all people in the south probably weren't as bad as the history books paint them. In the revolutionary war, the Brittish were painted as tyrants even though most of what they did was reasonable (or at least not unreasonable enough to start a war over). And I would still like to hear a story on the side of the Nazis explaining their rationale. I've never heard anything from that side of the story. I'm sure they didn't all just decide to kill people for no reason and convince others to do the same. There had to be some reason or purpose (convoluted or not) and it's for this reason that the civil war represents slavery. The people who won the war talk about how they were doing it all to free the slaves despite the fact that many in the north owned slaves as well.", 
   {}, 
   95215, 
   null, 
   1109893620.0
  ], 
  [
   95270, 
   null, 
   "jyoshu", 
   "Anyway, back to the original topic (sort of):\n \n The problem is that the victors write the history books. That's why we learn that all the people in the south were horrible rich white slave-owners. Sure there were probably some people like that, but all people in the south probably weren't as bad as the history books paint them. In the revolutionary war, the Brittish were painted as tyrants even though most of what they did was reasonable (or at least not unreasonable enough to start a war over). And I would still like to hear a story on the side of the Nazis explaining their rationale. I've never heard anything from that side of the story. I'm sure they didn't all just decide to kill people for no reason and convince others to do the same. There had to be some reason or purpose (convoluted or not) and it's for this reason that the civil war represents slavery. The people who won the war talk about how they were doing it all to free the slaves despite the fact that many in the north owned slaves as well.\n\n \n I agree with you for the most part. Regarding Nazi Germany, its my understanding that most Germans had no idea the genocide was taking place--they were shocked when the allies showed them what they had found.\n \n With that said, I can understand why some black people would find the confederate flag offensive. We are, after all, talking about the banner of the 'nation' that tried to hold onto the right and way of life that enslaved them. Symbols can be very powerful. It's really hard to justify allowing it to be flown above U.S. govt. buildings, as in several contested cases in the south. I think as long as we keep our history accurate as we can and therefore think of that flag as an historical symbol, we're doing fine.\n \n Some however, like to take pride in the south. It's too bad there is not a separate symbol of southern pride that is in no way associated with the confederacy that enslaved others.", 
   {}, 
   95255, 
   null, 
   1109895060.0
  ], 
  [
   95274, 
   null, 
   "sinjin", 
   " It's too bad there is not a separate symbol of southern pride ...\n \n\n You mean like the symbols we have for Northern pride, Western pride and Eastern pride?", 
   {}, 
   95270, 
   null, 
   1109895420.0
  ], 
  [
   95282, 
   null, 
   "jyoshu", 
   "You mean like the symbols we have for Northern pride, Western pride and Eastern pride?\n\n \n Hey if you want to take pride in any of those, go for it. No one's stopping you.", 
   {}, 
   95274, 
   null, 
   1109895840.0
  ], 
  [
   95290, 
   null, 
   "sinjin", 
   "Hey if you want to take pride in any of those, go for it. No one's stopping you.\n\n \n My point was that you are defending the perpetuation of division that cost many lives.", 
   {}, 
   95282, 
   null, 
   1109896380.0
  ], 
  [
   95291, 
   null, 
   "zachvac", 
   "I agree with you for the most part. Regarding Nazi Germany, its my understanding that most Germans had no idea the genocide was taking place--they were shocked when the allies showed them what they had found.\n \n With that said, I can understand why some black people would find the confederate flag offensive. We are, after all, talking about the banner of the 'nation' that tried to hold onto the right and way of life that enslaved them. Symbols can be very powerful. It's really hard to justify allowing it to be flown above U.S. govt. buildings, as in several contested cases in the south. I think as long as we keep our history accurate as we can and therefore think of that flag as an historical symbol, we're doing fine.\n \n Some however, like to take pride in the south. It's too bad there is not a separate symbol of southern pride that is in no way associated with the confederacy that enslaved others.\n\n \n Actually, I personally don't think the government should fly that flag. The government shouldn't show support or pride of something else unless it's their own flag or symbol. If people want to fly it at their homes, that's fine, but just as they can't fly a flag in favor of same-sex marriages or something like that on a government building, they can't fly a flag that doesn't represent the people flying it.\n \n On the note of Nazi Germany I'm not talking ordinarry citizens. I'm talking Hitler and other high-ranking officials who actually commited these crimes. I'm sure some were just taking orders from higher up and not disobeying them, but what was Hitler's original motivation for it? I've heard our side of the story, that he was just an insane madman who was hungry for power, but I'd like to see his side of the story. I'm not saying I would agree with him, but I like to see both sides of an argument before siding with one side.", 
   {}, 
   95270, 
   null, 
   1109896440.0
  ], 
  [
   95292, 
   null, 
   "zachvac", 
   "My point was that you are defending the perpetuation of division that cost many lives.\n\n \n But that's not all the flag stood for. We don't tear down the Jefferson memorial because he owned slaves. What's that much different between the civil war and the revolutionary war (besides the fact that the people trying to separate lost the civil war)? Slavery wasn't that much of an issue in the beginning of the war and many northerners had slaves and many southerners didn't have slaves. This wasn't a war over slavery. The south wanted to live their way (more states power) and the colonies wanted to live their way (freedom of religion and no taxation without representation). Yet since the colonies won and the south lost they are viewed in totally different ways.", 
   {}, 
   95290, 
   null, 
   1109896620.0
  ], 
  [
   95298, 
   null, 
   "sinjin", 
   "But that's not all the flag stood for. We don't tear down the Jefferson memorial because he owned slaves. What's that much different between the civil war and the revolutionary war (besides the fact that the people trying to separate lost the civil war)? Slavery wasn't that much of an issue in the beginning of the war and many northerners had slaves and many southerners didn't have slaves. This wasn't a war over slavery. The south wanted to live their way (more states power) and the colonies wanted to live their way (freedom of religion and no taxation without representation). Yet since the colonies won and the south lost they are viewed in totally different ways.\n\n \n I was speaking of the hypothetical symbol without baggage that was wished for.", 
   {}, 
   95292, 
   null, 
   1109897160.0
  ], 
  [
   95299, 
   null, 
   "jyoshu", 
   "My point was that you are defending the perpetuation of division that cost many lives.\n\n \n No, I'm saying that some like to take pride in being southern. I'm not \"defending\" anything. And I think you'd be hardpressed to prove that all cases of southern pride are based on the same spirit of division that resulted in the civil war.\n \n People taking pride in geographical, cultural, and ethnic identity is pretty common. I don't see why people of the south, with their distinct accent and larger rural areas and culture, is any different. To claim their cultural pride today is bad just because they were on the wrong side of a war a long time ago and at one time employed slavery doesn't make much sense. At one time, all the states/colonies in the U.S. supported slavery, as did England and many other countries. It doesn't mean their cultural pride is bad today.", 
   {}, 
   95290, 
   null, 
   1109897340.0
  ], 
  [
   95302, 
   null, 
   "zachvac", 
   "No, I'm saying that some like to take pride in being southern. I'm not \"defending\" anything. And I think you'd be hardpressed to prove that all cases of southern pride are based on the same spirit of division that resulted in the civil war.\n \n People taking pride in geographical, cultural, and ethnic identity is pretty common. I don't see why people of the south, with their distinct accent and larger rural areas and culture, is any different. To claim their cultural pride today is bad just because they were on the wrong side of a war a long time ago and at one time employed slavery doesn't make much sense. At one time, all the states/colonies in the U.S. supported slavery, as did England and many other countries. It doesn't mean their cultural pride is bad today.\n\n \n I still think pride for reasons like that are just plain silly. Like being proud of your race? You were born with it. Take pride in accomplishments, not things like how you were born or where you live.", 
   {}, 
   95299, 
   null, 
   1109897460.0
  ], 
  [
   95305, 
   null, 
   "sinjin", 
   "No, I'm saying that some like to take pride in being southern. \n\n \n So why the need for a symbol?", 
   {}, 
   95299, 
   null, 
   1109897700.0
  ], 
  [
   95306, 
   null, 
   "Big Orn", 
   "I was speaking of the hypothetical symbol without baggage that was wished for.\n\n You scare people, sinjin.\n \n You know that...", 
   {}, 
   95298, 
   null, 
   1109897700.0
  ], 
  [
   95309, 
   null, 
   "sinjin", 
   "You scare people, sinjin.\n \n You know that...\n\n \n It's far worse in person. You all are just seeing my \"soft\" side.", 
   {}, 
   95306, 
   null, 
   1109898480.0
  ], 
  [
   95329, 
   null, 
   "Master_Shake", 
   "Woo Hoo, ha ha ha--I'm rolling in the floor it was such a funny joke . . . emoticon_rolleyes \n \n Chill out, man! Not everything is about you\n\n \n Where the H-E-double hockey sticks did that come from?\n You sound pretty ticked, maybe I'm not the one that needs to chill.", 
   {}, 
   95215, 
   null, 
   1109905620.0
  ], 
  [
   95334, 
   null, 
   "Master_Shake", 
   "I think were missing the real heart of what this is all about. We are arguing over this flag's value or lack of value as a historical symbol, and what the civil war was really about. These seem to me to be issues for another thread (especially the second one which, by the way, has extensive threads). This is because this is not, by and large, what this flag is used for. I don't know about you folks, but the only people I have ever met or seen who take \"pride\" in that flag are white protestants with southern \"tendencies\" (if you get my jist). The flag is meant to create division.\n Secondly, all this talk about pride is absurd. As I said earlier in what was meant as a joke, the south lost. End of story. What's there to take pride in? You don't see Brits throwing parties to celebrate their loss of the Revolutionary War. Why? Because it would be totally absurd, just like the south taking pride in the confederacy.", 
   {}, 
   95329, 
   null, 
   1109906700.0
  ], 
  [
   95348, 
   null, 
   "zachvac", 
   "I think were missing the real heart of what this is all about. We are arguing over this flag's value or lack of value as a historical symbol, and what the civil war was really about. These seem to me to be issues for another thread (especially the second won which, by the way, has extensive threads). This is because this is not, by and large, what this flag is used for. I don't know about you folks, but the only people I have ever met or seen who take \"pride\" in that flag are white protestants with southern \"tendencies\" (if you get my jist). The flag is meant to create division.\n Secondly, all this talk about pride is absurd. As I said earlier in what was meant as a joke, the south lost. End of story. What's there to take pride in? You don't see Brits throwing parties to celebrate their loss of the Revolutionary War. Why? Because it would be totally absurd, just like the south taking pride in the confederacy.\n\n \n Yes, I don't see how you should take pride in where you live or a war you lost. But you mention the flag was meant to create division. People who fly the American flag seem to have American \"tendencies\".", 
   {}, 
   95334, 
   null, 
   1109914560.0
  ], 
  [
   95362, 
   null, 
   "shortej", 
   "I don't think the flag should be flown over a government building because it represents rebellion against the United States. While I support people's rights to fly it on their private property (free speech), it doesn't seem apropriate to fly it on the building of the very government the original flyers tried to break away from.", 
   {}, 
   95348, 
   null, 
   1109921580.0
  ], 
  [
   95384, 
   null, 
   "greg 79 f150", 
   "Quote \"I think were missing the real heart of what this is all about. We are arguing over this flag's value or lack of value as a historical symbol, and what the civil war was really about. These seem to me to be issues for another thread (especially the second won which, by the way, has extensive threads). This is because this is not, by and large, what this flag is used for. I don't know about you folks, but the only people I have ever met or seen who take \"pride\" in that flag are white protestants with southern \"tendencies\" (if you get my jist). The flag is meant to create division.\n Secondly, all this talk about pride is absurd. As I said earlier in what was meant as a joke, the south lost. End of story. What's there to take pride in? You don't see Brits throwing parties to celebrate their loss of the Revolutionary War. Why? Because it would be totally absurd, just like the south taking pride in the confederacy. \" End quote\n \n \n Agreed. Ahh, \"southern tendencies\" wow, what nice terminology to very politely slander a persons geographical culture . :) Kind of an all encompassing statement, for those people that had NO choice in what region of the country they were born in, or a choice in the culture the region has, or a choice in the history attached to that region they were born in. ..\n \n Yes, the south gets a pretty good rap in the mouth from the\"other\" american states, especially after they read books or see a movie depicting the culture in the southern states. We are not ALL drivers of jacked up 4x4 pickups, with beer cans being thrown out of the window, a rebel flag and shotgun in the rear window , yeehawing while driving barefoot and toothless. If a person sees one those people down here, the driver is just out making a movie for a hollywood mogul . :)\n \n As to the \"pride issue\" . We do not carry pride because of the battle flag of the Confederacy. We carry pride for all of our passed loved ones that were slaughtered and maimed in a war they fought in, one they believed in fighting and dying for, regardless of the cause. They even fought on the battlefields against their own blood relatives from the north. How could a region have PRIDE for killing their own countrymen ? To take the civil war, and the people of the south or north, down to that level of debate, is not very respectful to those that died for a VERY controversial cause. all jmo", 
   {}, 
   95362, 
   null, 
   1109944860.0
  ], 
  [
   95389, 
   null, 
   "JPSartre12", 
   "I agree with you for the most part. Regarding Nazi Germany, its my understanding that most Germans had no idea the genocide was taking place--they were shocked when the allies showed them what they had found.\n \n\n Maybe a few naive Germans who spent the war with their heads in the sand, but any German that watched Jews given stars to wear, then tattoos and then disappearing on cattlecar trains to nowhere would have had to be XXXXXX not to realize their fate.\n In a typical German town, the Jews were generally more affluent than the rest of society. It didn't take Einstein to see that Jews were targeted, had their property and businesses seized by the Nazis and were shipped out. \n The hate speaches might have clued them in a bit, too. emoticon_rolleyes \n \n \n\n With that said, I can understand why some black people would find the confederate flag offensive. We are, after all, talking about the banner of the 'nation' that tried to hold onto the right and way of life that enslaved them. Symbols can be very powerful. It's really hard to justify allowing it to be flown above U.S. govt. buildings, as in several contested cases in the south. I think as long as we keep our history accurate as we can and therefore think of that flag as an historical symbol, we're doing fine.\n \n Some however, like to take pride in the south. It's too bad there is not a separate symbol of southern pride that is in no way associated with the confederacy that enslaved others.\n\n \n I see the Confederate flag as an historical icon with both good and bad associations, but don't believe that we should ban it. We're too free a nation to start acting like Germany, who banned all Nazi artifacts after WWII. To me, that's just a feeble attempt to try to hide the fact that Nazis existed and were part of German history. Negative icons can still have positive effects IMO.", 
   {}, 
   95270, 
   null, 
   1109951340.0
  ], 
  [
   95391, 
   null, 
   "jyoshu", 
   "I still think pride for reasons like that are just plain silly. Like being proud of your race? You were born with it. Take pride in accomplishments, not things like how you were born or where you live.\n\n \n Tell that to people in the gay pride movement or those celebrating black history month.", 
   {}, 
   95302, 
   null, 
   1109951820.0
  ], 
  [
   95393, 
   null, 
   "jyoshu", 
   "Maybe a few naive Germans who spent the war with their heads in the sand, but any German that watched Jews given stars to wear, then tattoos and then disappearing on cattlecar trains to nowhere would have had to be XXXXXX not to realize their fate.\n In a typical German town, the Jews were generally more affluent than the rest of society. It didn't take Einstein to see that Jews were targeted, had their property and businesses seized by the Nazis and were shipped out. \n The hate speaches might have clued them in a bit, too.\n \n \n One would think so, yet much of the the German populace was not of the same view that Hitler had, that all Jews should be wiped off the face of the earth. Nazism controlled Germany using nationalism as a tool, not prejudice. It is an historical fact that many Germans were in fact shocked when the allies revealed that Hitler had exterminated millions of Jews.", 
   {}, 
   95389, 
   null, 
   1109952000.0
  ], 
  [
   95397, 
   null, 
   "JPSartre12", 
   "I don't think the flag should be flown over a government building because it represents rebellion against the United States. While I support people's rights to fly it on their private property (free speech), it doesn't seem apropriate to fly it on the building of the very government the original flyers tried to break away from.\n\n \n Since elements of the Confederate Battle Flag are still represented in a few state flags, why shouldn't it be flown over state buildings?", 
   {}, 
   95362, 
   null, 
   1109952600.0
  ], 
  [
   95462, 
   null, 
   "Master_Shake", 
   "Yes, I don't see how you should take pride in where you live or a war you lost. But you mention the flag was meant to create division. People who fly the American flag seem to have American \"tendencies\".\n\n \n I didn't say the flag originally meant to create division (although I guess in the truest since it was seeing as they were rebels) I said that is the way it is used now.\n \n \nAgreed. Ahh, \"southern tendencies\" wow, what nice terminology to very politely slander a persons geographical culture . :) Kind of an all encompassing statement, for those people that had NO choice in what region of the country they were born in, or a choice in the culture the region has, or a choice in the history attached to that region they were born in. ..\n\n \n You both seem to have misunderstood what I meant by southern tendencies. This is my mistake, I was trying to be subtle. I wasn't meaning to slander a group of people simply for being born in a certain region. What I meant was has a history of...how should I put this..racial \"difficulties\" to put it lightly and this flag is used as a reminder of this. I hope you understand what I meant now.\n \n Secondly, with regard to who takes pride in this flag, it seems almost more of a rural vs. urban thing than south vs. north, although obviously it gets more so as you travel south. I have met quite a few northerners in rural/semi-rural areas in non-confederate states that also take pride in this flag. This is a strange phenomenon.", 
   {}, 
   95384, 
   null, 
   1109963160.0
  ], 
  [
   95466, 
   null, 
   "JPSartre12", 
   ".........\n Secondly, with regard to who takes pride in this flag, it seems almost more of a rural vs. urban thing than south vs. north, although obviously it gets more so as you travel south. I have met quite a few northerners in rural/semi-rural areas in non-confederate states that also take pride in this flag. This is a strange phenomenon.\n\n \n Nah, not strange at all. Here in Michigan, \"folks\" driving around with Confederate Flags are called \"NASCAR fans\". :)", 
   {}, 
   95462, 
   null, 
   1109963580.0
  ], 
  [
   95469, 
   null, 
   "Master_Shake", 
   "Nah, not strange at all. Here in Michigan, \"folks\" driving around with Confederate Flags are called \"NASCAR fans\". :)\n\n \n emoticon_xagree \n I didn't want to go there, but yes, you are absolutely right. emoticon_smile", 
   {}, 
   95466, 
   null, 
   1109963760.0
  ], 
  [
   97387, 
   null, 
   "Hunter", 
   "Is the Confederate Flag a Symbol of Racism? \n \n http://www.youdebate.com/DEBATES/confederate_flag.HTM\n\n \n For me it is not. For others it is. American by chance, Southern by the grace of God.", 
   {}, 
   41, 
   null, 
   1110698460.0
  ], 
  [
   97391, 
   null, 
   "Nwarth", 
   "The flag, too me, represents some of the worst tendencies of this country... open armed division (as opposed to peaceful democratic debate), slavery, segregation, hate, and ignorance.\n \n While I strongly disagree with it and what I believe it represents I have no problems with individuals showing the flag. I do, however, have a problem with it being displayed in public buildings, especially in places of prominence. It sends the wrong message about this country and our values.", 
   {}, 
   97387, 
   null, 
   1110701220.0
  ], 
  [
   97427, 
   null, 
   "georged", 
   "The flag, too me, represents some of the worst tendencies of this country... open armed division (as opposed to peaceful democratic debate), slavery, segregation, hate, and ignorance.\n \n While I strongly disagree with it and what I believe it represents I have no problems with individuals showing the flag. I do, however, have a problem with it being displayed in public buildings, especially in places of prominence. It sends the wrong message about this country and our values.\n\n \n Many of those values are how other nations perceive our invasion and occupation of Iraq. \n \n As someone raised in Texas, having lived in Georgia and with extensive travel in all Southern states, I can tell you those 'values' are more the norm than exception. And they're not limited to Southern states; in general we're an extremely hateful, prejudicial population regarding most all minorities. I'm not aware of any other specific US region than the South priding itself on historical worship of being defeated by war for ideological purposes. That anyone could find any good in a flag signifying that era spawning the KKK summarizes a well defined sociopathic quality.", 
   {}, 
   97391, 
   null, 
   1110732300.0
  ], 
  [
   97439, 
   null, 
   "jim's trucking", 
   "Many of those values are how other nations perceive our invasion and occupation of Iraq. \n \n As someone raised in Texas, having lived in Georgia and with extensive travel in all Southern states, I can tell you those 'values' are more the norm than exception. And they're not limited to Southern states; in general we're an extremely hateful, prejudicial population regarding most all minorities. I'm not aware of any other specific US region than the South priding itself on historical worship of being defeated by war for ideological purposes. That anyone could find any good in a flag signifying that era spawning the KKK summarizes a well defined sociopathic quality.\nThe era that spawned the KKK was not all bad. The KKK was bad. The KKK took a respectable flag and used it in their terror campaign. People came to identify the flag as a symbol of the KKK and its hatred of blacks. The KKK ruined the flag.\n \n There are many people who want to fly the flag as a symbol of their heritage in the Confederacy, not the KKK.\n \n I don't personally fly the flag at home, on my vehicle or lapel pin. However, I think it is no more a sign of racism than the clinched first of the Black Panthers or the defiant face of Malcome X, both of which are permitted anywhere you look.", 
   {}, 
   97427, 
   null, 
   1110736860.0
  ], 
  [
   97455, 
   null, 
   "georged", 
   "The era that spawned the KKK was not all bad. The KKK was bad. The KKK took a respectable flag and used it in their terror campaign. People came to identify the flag as a symbol of the KKK and its hatred of blacks. The KKK ruined the flag.\n \n There are many people who want to fly the flag as a symbol of their heritage in the Confederacy, not the KKK.\n \n I don't personally fly the flag at home, on my vehicle or lapel pin. However, I think it is no more a sign of racism than the clinched first of the Black Panthers or the defiant face of Malcome X, both of which are permitted anywhere you look.\n\n \n The era spawning the KKK was bad. Not conceding to federal industrial supremacy and lower costs of imported cotten was childish, and succession against the law. And then killing off a major portion of the Southern male working population in a prolonged, fruitless war isn't much to be proud of. \n \n If a majority of 88% of the US population treated me like I had no rights I'd have been clenching my fist with a defiant look on my face.", 
   {}, 
   97439, 
   null, 
   1110741720.0
  ], 
  [
   97458, 
   null, 
   "jim's trucking", 
   "The era spawning the KKK was bad. Not conceding to federal industrial supremacy and lower costs of imported cotton was childish, and succession against the law. And then killing off a major portion of the Southern male working population in a prolonged, fruitless war isn't much to be proud of. \n \n If a majority of 88% of the US population treated me like I had no rights I'd have been clenching my fist with a defiant look on my face.\nThe southern lifestlye, except for slavery, was not evil. Conceding to \"supreme\" industrialism is not admirable. Somebody has to grow food and fiber. Wanting one's homegrown goods favored over cheap imports is expected. I believe all our cottonseed was imported. The native Americans didn't grow it that I'm aware of. (Maybe I should have googled all that before posting, but I'll stand with it until corrected.)", 
   {}, 
   97455, 
   null, 
   1110742380.0
  ], 
  [
   97976, 
   null, 
   "Nwarth", 
   "Jim, here is how it worked. The south picked the cotton (which produced plenty of cotton seed) and then shipped it north for processing, the finished products (clothing and other cotton products) were then shipped south for consumption. \n \n The problem is obvious, you have the Southerner saying \"what the hell? I am picking the cotton you are using but I'm getting short changed!?\" The tariffs also made them feel bad because it made our raw resource (cotton) less attractable to, say, a British or French market. Thats blow number two.\n \n The third thing that they didn't like is that they used slave labor, and the North was questioning the morality of such labor, thus the South felt (wrongly in my opinion) that the North was trying to squeeze them for all their worth and did not respect them. Thus, Civil War. \n \n Naturally the North had other reasons and conflicting interests, but that is a whole different post.", 
   {}, 
   97458, 
   null, 
   1110860940.0
  ], 
  [
   98141, 
   null, 
   "jim's trucking", 
   "Jim, here is how it worked. The south picked the cotton (which produced plenty of cotton seed) and then shipped it north for processing, the finished products (clothing and other cotton products) were then shipped south for consumption. \n \n The problem is obvious, you have the Southerner saying \"what the hell? I am picking the cotton you are using but I'm getting short changed!?\" The tariffs also made them feel bad because it made our raw resource (cotton) less attractable to, say, a British or French market. Thats blow number two.\n \n The third thing that they didn't like is that they used slave labor, and the North was questioning the morality of such labor, thus the South felt (wrongly in my opinion) that the North was trying to squeeze them for all their worth and did not respect them. Thus, Civil War. \n \n Naturally the North had other reasons and conflicting interests, but that is a whole different post.\nPerhaps I misspoke. Cotton was not a native crop when the Indians were in command. The initial seed came from elsewhere. I realize that cotton bowls are full of seed and cotton. (there's a tremendous market for cottonseed oil which comes from crushed seeds)\n \n \n http://www.pcga.org/cotton_history.html\n \n It is almost impossible to determine the original habitats of the various species of cotton. Scientists have determined fiber and boll fragments from the TehuacÃ¡n Valley of Mexico to be about 7000 years old. The plant has certainly been grown and used in India for at least 5000 years and probably for much longer. Cotton was used also by the ancient Chinese, Egyptians, and North and South Americans. It was one of the earliest crops grown by European settlers, having been planted at the Jamestown colony in 1607.\n \n The British were actually the main consumer of American cotton fiber until mills were built here.", 
   {}, 
   97976, 
   null, 
   1110898020.0
  ], 
  [
   98162, 
   null, 
   "georged", 
   "This is an interesting brief on the role cotten played in early US history, including the Civil War. I wonder if Bin Laden studied the US Confederacy's planning and reactions before implementing his plan to financially bring us to our knees? \n \n http://www.civilwarhome.com/kingcotton.htm", 
   {}, 
   98141, 
   null, 
   1110905580.0
  ], 
  [
   98176, 
   null, 
   "jim's trucking", 
   "This is an interesting brief on the role cotten played in early US history, including the Civil War. I wonder if Bin Laden studied the US Confederacy's planning and reactions before implementing his plan to financially bring us to our knees? \n \n http://www.civilwarhome.com/kingcotton.htm\n\n That is interesting. In recent years, cotton has become less important due to synthetics.\n \n Another crop has recently come to be a Southern money-maker...pond raised CATFISH! IINM, Belzoni, Mississippi is the catfish capitol of the world.", 
   {}, 
   98162, 
   null, 
   1110907380.0
  ], 
  [
   98184, 
   null, 
   "georged", 
   "That is interesting. In recent years, cotton has become less important due to synthetics.\n \n Another crop has recently come to be a Southern money-maker...pond raised CATFISH! IINM, Belzoni, Mississippi is the catfish capitol of the world.\n\n \n All of our remaining commodities have declined in importance because we consume more than we can produce at competitive costs. Now if the entire world, especially China, developed a taste for catfish and slavery was imitated by paying low skill workers what they're actually worth, maybe new antebellum and worker shack construction would be the driving force behind a healthy US economy.", 
   {}, 
   98176, 
   null, 
   1110909060.0
  ], 
  [
   98203, 
   null, 
   "jim's trucking", 
   "All of our remaining commodities have declined in importance because we consume more than we can produce at competitive costs. Now if the entire world, especially China, developed a taste for catfish and slavery was imitated by paying low skill workers what they're actually worth, maybe new antebellum and worker shack construction would be the driving force behind a healthy US economy.\nYes, your Royal Bitterness! emoticon_rolleyes", 
   {}, 
   98184, 
   null, 
   1110911460.0
  ], 
  [
   98219, 
   null, 
   "JPSartre12", 
   "All of our remaining commodities have declined in importance because we consume more than we can produce at competitive costs. \n\n What about furniture? carpeting? Aren't both thriving in the South?\n \n\n Now if the entire world, especially China, developed a taste for catfish and slavery was imitated by paying low skill workers what they're actually worth, maybe new antebellum and worker shack construction would be the driving force behind a healthy US economy.\n\n \n Too many protectionist tariffs on the export of US foodstocks. The EU prefers to keep us out of their markets despite our ability to be the low-cost producer. emoticon_mad", 
   {}, 
   98184, 
   null, 
   1110912720.0
  ], 
  [
   98225, 
   null, 
   "jim's trucking", 
   "All of our remaining commodities have declined in importance because we consume more than we can produce at competitive costs. Now if the entire world, especially China, developed a taste for catfish and slavery was imitated by paying low skill workers what they're actually worth, maybe new antebellum and worker shack construction would be the driving force behind a healthy US economy.\nThis begs the old question similar to the chicken/egg dilemma. Which came first, overpaid workers or high commodity prices? (Neither has anything to do with the Confederate Flag, but....)\n \n I'll bet you'll find more shanties and low paid workers in China than you will in the USA. That's why their prices are so low. I guess they more closely imitate slavery than we do.", 
   {}, 
   98184, 
   null, 
   1110913140.0
  ], 
  [
   98231, 
   null, 
   "jim's trucking", 
   "What about furniture? carpeting? Aren't both thriving in the South?\n \n \n Too many protectionist tariffs on the export of US foodstocks. The EU prefers to keep us out of their markets despite our ability to be the low-cost producer. emoticon_mad\nUnfortunately, the furniture business has taken a big hit. \"Slave\" labor in the developing countries has replaced even our modern machine made furniture factories.\n \n IINM, the carpet industry has declined also. Georgia still plays a big roll in the carpet world.\n \n Industry Statistics \n \n \n CRI 2002 Industry Statistics (PDF 184 KB)\n \n If you have any questions about the CRI Industry Statistics, please contact Linda Harrington by email. Need help with PDF?\n \n The Carpet Industry in the United States\n (Based on 2003 statistics)\n \n \n Total industry shipments (2003) totaled 1.969 billion square yards (17.721 billion square feet) or $12.091 billion at mill level. (In 1950 industry shipments were 97 million square yards.)\n \n \n The United States supplies approximately 45% of the world's carpet.\n \n \n Most carpet today -- 90% -- is tufted, the process that grew out of the chenille bedspread industry. \n The Impact of the Carpet Industry in Georgia\n (Based on 2003 statistics)\n \n Eighty percent of the U. S. carpet market is supplied by mills located within a 65 mile radius of Dalton, Georgia (Whitfield, Gordon, Catoosa, Murray, and Bartow counties).\n \n \n The manufacturer in Georgia with the largest number of employees is a carpet manufacturer.\n \n \n The four largest carpet companies are headquartered in Georgia and 7 of the largest 14 carpet companies are headquartered in Georgia. \n \n http://www.carpet-rug.com/drill_down_2.cfm?page=10&sub=3&requesttimeout=350\n \n \n Speaking of slavery and civil rights: India itself is more a symbol of hatred and racism than the Confederate Flag will ever be!\n \n http://www.iabolish.com/today/features/india/carpet.htm\n \n Child Slavery in the Carpet Industry\n \n \n Effects \n \n Slavery cannot be dismissed as an isolated problem in remote villages; it is a global issue, which profoundly yet quietly affects our daily lives. Many goods produced with slave labor are exported directly to North America and Europe, and consumers often purchase these slave-made products while unaware of their tainted origins. In addition, although production of certain consumer goods may not explicitly use slave labor, they may still use slave-made components. As an example, Kevin Bales cites slave-produced charcoal that is essential to making steel in Brazil. Much of this steel then becomes car parts and other metal goods that make up a quarter of all of Brazil's exports.\n \n Among the more prominent slave-made goods from India are oriental carpets. In recent years, the carpet export industry has become one of India's largest - and is believed to \"employ\" more child slaves than any other industry. Between April of 1995 and March of 1996, Indian carpet exports earned $656 million, with the largest portion ($225 million) coming directly from the United States. In 1998, the majority of US carpet imports originated in India, with income for India amounting to approximately $282 million. Indeed, the carpet industry proves to be extremely valuable for the Indian economy, earning large amounts of foreign exchange and providing further entry into the global market.\n \n Trapping Children \n \n The extreme poverty of the harijans or untouchables (the lowest group in the traditional caste system) and the adivasis (the tribals or indigenous people) make them the most vulnerable groups for exploitation. 80% to 90% of all bonded laborers in India are harijans and adivasis. The absolute levels of poverty and the lack of social welfare, education, or alternatives make it very easy for the loom owners to exploit these groups. Within these groups, children are probably the most exploited. One justification for child labor in the carpet industry is the predominant \"myth of nimble fingers, which claims that the small fingers of children are more productive than those of adults. (Nevertheless, the quality carpets that can be sold at the highest prices are often those made by adults.)", 
   {}, 
   98219, 
   null, 
   1110913500.0
  ], 
  [
   98239, 
   null, 
   "georged", 
   "Yes, your Royal Bitterness! emoticon_rolleyes\n\n \n Bitter? Actually, I'm making more on development investments than ever before because of the US mania for personal debt combined with the housing bubble. With interest only loans now popular and qualifying more legions of fools daily for crackerboxes, it couldn't be any better. In and out 3-9 months and secured at a 2/1 ratio. I do the land and go in after mortgages are approved and builders need finish money. Other than the dollar, I'm very fond of this economy through at least summer. If you could arrange for guaranteed payment on catfish shipments, I'd be interested in some of that.", 
   {}, 
   98203, 
   null, 
   1110914040.0
  ], 
  [
   98246, 
   null, 
   "jim's trucking", 
   "Bitter? Actually, I'm making more on development investments than ever before because of the US mania for personal debt combined with the housing bubble. With interest only loans now popular and qualifying more legions of fools daily for crackerboxes, it couldn't be any better. In and out 3-9 months and secured at a 2/1 ratio. I do the land and go in after mortgages are approved and builders need finish money. Other than the dollar, I'm very fond of this economy through at least summer. If you could arrange for guaranteed payment on catfish shipments, I'd be interested in some of that.\nSounds like fishy business to me!", 
   {}, 
   98239, 
   null, 
   1110914640.0
  ], 
  [
   98250, 
   null, 
   "georged", 
   "Unfortunately, the furniture business has taken a big hit. \"Slave\" labor in the developing countries has replaced even our modern machine made furniture factories.\n http://www.carpet-rug.com/drill_down_2.cfm?page=10&sub=3&requesttimeout=350\n\n \n I have a couple of friends in N. Carolina who have suffered from import devastation of the US furniture industry. Sooner or later our wages and compliance will drop to become competitive, but our factories are already outdated and attracting capital would be difficult at best. \n \n Hardwood flooring is still a strong N. Carolina industry, but the low end is being eliminated by Chinese bamboo hardwood flooring. 20% more dense than maple, but unavailable in select grades. At $6/sq ft, tongue/groove, it's even giving low-medium carpeting fits. \n \n Carpet is what, 150% oil? We paid $6 square foot with pad and installation for carpet in our last house three years ago (I was surprised the industry had moved from yard to foot as a common consumer measurement until I saw the prices) and that same carpet is now $31/sq ft., more expensive than installed select grade oak hardwood flooring. Let's beat up some more ME nations.", 
   {}, 
   98231, 
   null, 
   1110914940.0
  ], 
  [
   98256, 
   null, 
   "georged", 
   "This begs the old question similar to the chicken/egg dilemma. Which came first, overpaid workers or high commodity prices? (Neither has anything to do with the Confederate Flag, but....)\n \n I'll bet you'll find more shanties and low paid workers in China than you will in the USA. That's why their prices are so low. I guess they more closely imitate slavery than we do.\n\n \n We had a good run with reasonable labor costs, modest housing, no medical insurance and people actually saving money until prosperity became so widespread everyone down to people sweeping floors demanded a piece of it. China will, as every dominate economy experiences, face the same challenges. History will determine if their combination of Mao doctrine mixed with capitalism can manage it any better than we did.", 
   {}, 
   98225, 
   null, 
   1110915600.0
  ], 
  [
   98285, 
   null, 
   "JPSartre12", 
   "Bitter? Actually, I'm making more on development investments than ever before because of the US mania for personal debt combined with the housing bubble. With interest only loans now popular and qualifying more legions of fools daily for crackerboxes, it couldn't be any better. In and out 3-9 months and secured at a 2/1 ratio. I do the land and go in after mortgages are approved and builders need finish money. Other than the dollar, I'm very fond of this economy through at least summer. If you could arrange for guaranteed payment on catfish shipments, I'd be interested in some of that.\n\n \n I don't understand the attraction for interest-only mortgages. In 10 years, I want my housing costs to have dropped off the radar for good so that I'll be free to pursue other financial endeavors...like faster cars. :)", 
   {}, 
   98239, 
   null, 
   1110917520.0
  ], 
  [
   98294, 
   null, 
   "georged", 
   "I don't understand the attraction for interest-only mortgages. In 10 years, I want my housing costs to have dropped off the radar for good so that I'll be free to pursue other financial endeavors...like faster cars. :)\n\n \n Due to rising land and construction costs increasing entry level and step-up finished home prices, that's the only way many people can be qualified for a home loan with income to payment ratio requirements. Scary when one considers being stretched that thin normally means no reserves and default if either partner loses a job. That's the American way; no savings and living with maximum payments as a gauge of what one can afford.", 
   {}, 
   98285, 
   null, 
   1110918000.0
  ], 
  [
   98388, 
   null, 
   "JPSartre12", 
   "Due to rising land and construction costs increasing entry level and step-up finished home prices, that's the only way many people can be qualified for a home loan with income to payment ratio requirements. Scary when one considers being stretched that thin normally means no reserves and default if either partner loses a job. That's the American way; no savings and living with maximum payments as a gauge of what one can afford.\n\n \n I'm not a big advocate of walking a financial tightrope and hoping that I'm always sure-footed. :) \n I guess I'm old enough to be cautious and financially secure enough to not be foolish.", 
   {}, 
   98294, 
   null, 
   1110926880.0
  ], 
  [
   98404, 
   null, 
   "Hunter", 
   "That is interesting. In recent years, cotton has become less important due to synthetics.\n \n Another crop has recently come to be a Southern money-maker...pond raised CATFISH! IINM, Belzoni, Mississippi is the catfish capitol of the world.\n\n \n You are correct, lets not forget the watermelons from Watervalley Miss. They are scrumptious.", 
   {}, 
   98176, 
   null, 
   1110929160.0
  ], 
  [
   98426, 
   null, 
   "jim's trucking", 
   "You are correct, lets not forget the watermelons from Watervalley Miss. They are scrumptious.\nStrange you should mention that town. I met a darlin' little girl from there ages ago...can't remember her name but she was a living doll and a really delightful person. I was too young to think of marriage, but I was smitten to say the least.", 
   {}, 
   98404, 
   null, 
   1110931920.0
  ], 
  [
   98442, 
   null, 
   "Hunter", 
   "Strange you should mention that town. I met a darlin' little girl from there ages ago...can't remember her name but she was a living doll and a really delightful person. I was too young to think of marriage, but I was smitten to say the least.\n\n \n Okay then Jim, I am glad that I made you think of such a pleasant memory. I don't think that any part of the country has prettier girls than the South. I have some land in Yalobusha county Miss. and that is why I know about the Watervalley watermellon festival. My land is close to Enid lake which still holds the record for the largest Crappie ever caught. Have you ever been to Enid lake? There are Eagles roosting there year round now and they are a great sight to behold. Ahhhh.... the memories of our youth. :)", 
   {}, 
   98426, 
   null, 
   1110933360.0
  ], 
  [
   98495, 
   null, 
   "georged", 
   "I'm not a big advocate of walking a financial tightrope and hoping that I'm always sure-footed. :) \n I guess I'm old enough to be cautious and financially secure enough to not be foolish.\n\n \n That's common sense, currently in very short supply. As long as their politicians keep loading up on debt and telling them everything is rosy, those without common sense will follow the leader.", 
   {}, 
   98388, 
   null, 
   1110940800.0
  ], 
  [
   98499, 
   null, 
   "JPSartre12", 
   "That's common sense, currently in very short supply. As long as their politicians keep loading up on debt and telling them everything is rosy, those without common sense will follow the leader.\n\n \n I blame groups like the AARP for the shift in Republican philosophy. They have caused Republicans to put votes ahead of principle, just as the Democrats have been doing for 60 years. emoticon_mad", 
   {}, 
   98495, 
   null, 
   1110941460.0
  ], 
  [
   98517, 
   null, 
   "georged", 
   "I blame groups like the AARP for the shift in Republican philosophy. They have caused Republicans to put votes ahead of principle, just as the Democrats have been doing for 60 years. emoticon_mad\n\n \n You're obviously far brighter and better informed than me. I can't tell any difference between either major party other than where the money comes from and where it goes. But I've been around politicians for a long time and cynicism replaced my idealism at an early age.", 
   {}, 
   98499, 
   null, 
   1110942600.0
  ], 
  [
   98521, 
   null, 
   "JPSartre12", 
   "You're obviously far brighter and better informed than me. I can't tell any difference between either major party other than where the money comes from and where it goes. But I've been around politicians for a long time and cynicism replaced my idealism at an early age.\n\n \n 10 years ago, the first Republican HR in 40 years went to Washington with the goal of reducing the size of the Federal government. After years of being demonized, they caved in to public pressure and became Democrats in drag. emoticon_mad", 
   {}, 
   98517, 
   null, 
   1110942900.0
  ], 
  [
   98535, 
   null, 
   "Duo_Maxwell", 
   "10 years ago, the first Republican HR in 40 years went to Washington with the goal of reducing the size of the Federal government. After years of being demonized, they caved in to public pressure and became Democrats in drag. emoticon_mad\n\n \n Demonized? That's one way of looking at it. And Drag? That's just gross. A more accurate would be drinking a coke instead of pepsi and wearing different ties every other day.", 
   {}, 
   98521, 
   null, 
   1110944880.0
  ], 
  [
   98620, 
   null, 
   "jim's trucking", 
   "Okay then Jim, I am glad that I made you think of such a pleasant memory. I don't think that any part of the country has prettier girls than the South. I have some land in Yalobusha county Miss. and that is why I know about the Watervalley watermellon festival. My land is close to Enid lake which still holds the record for the largest Crappie ever caught. Have you ever been to Enid lake? There are Eagles roosting there year round now and they are a great sight to behold. Ahhhh.... the memories of our youth. :)\nYou're right about the southern girls.\n \n I recall picnicing at Enid when we had a '53 Chrysler....family reunion in a neutral zone!", 
   {}, 
   98442, 
   null, 
   1110984960.0
  ], 
  [
   98854, 
   null, 
   "zachvac", 
   "Okay then Jim, I am glad that I made you think of such a pleasant memory. I don't think that any part of the country has prettier girls than the South. I have some land in Yalobusha county Miss. and that is why I know about the Watervalley watermellon festival. My land is close to Enid lake which still holds the record for the largest Crappie ever caught. Have you ever been to Enid lake? There are Eagles roosting there year round now and they are a great sight to behold. Ahhhh.... the memories of our youth. :)\n\n Sounds like a great place to grow up.", 
   {}, 
   98442, 
   null, 
   1111028280.0
  ], 
  [
   98929, 
   null, 
   "Hunter", 
   "Sounds like a great place to grow up.\n\n \n You are correct my friend. The area is still somewhat rural. Plenty of peace and quite. The smell of Honeysuckle in the Spring is sweet and hangs in the air. Plenty of wildlife and the Deer are thick. What parts are you from zachvac? City or country? :)", 
   {}, 
   98854, 
   null, 
   1111040520.0
  ], 
  [
   98996, 
   null, 
   "georged", 
   "You are correct my friend. The area is still somewhat rural. Plenty of peace and quite. The smell of Honeysuckle in the Spring is sweet and hangs in the air. Plenty of wildlife and the Deer are thick. What parts are you from zachvac? City or country? :)\n\n \n I've been fortunate to have lived in most geographical areas of the US during all seasons, including Southern states, and there are many places with those attributes. Even better, many don't have soaking humidity, stinging insects or poisonous snakes. And there are beautiful women all over this world.", 
   {}, 
   98929, 
   null, 
   1111078020.0
  ], 
  [
   99320, 
   null, 
   "Hunter", 
   "I've been fortunate to have lived in most geographical areas of the US during all seasons, including Southern states, and there are many places with those attributes. Even better, many don't have soaking humidity, stinging insects or poisonous snakes. And there are beautiful women all over this world.\n\n \n This area is not the Miss. Delta, the humidity is not that bad. Snakes and insects are much easier to be around than the liberals that permeate my home town. Also you forgot to mention Poison Ivy, but I am immune to that. I'll take the country in the South any day to the big city.\n And Southern girls, BOY-HOWDY!!!!!!!!!!!!!! :)\n \n \n Oh yeh, and one Yankee girl from PA. BOY-HOWDY!!!!!!!!!!! emoticon_xangel", 
   {}, 
   98996, 
   null, 
   1111123980.0
  ], 
  [
   99626, 
   null, 
   "zachvac", 
   "Well I have heard that the bugs are bad in the South. But I'll take long, hot summers over snowy, cold winters any day. You can't play baseball in the snow, but you can when it's 110 degrees.", 
   {}, 
   99320, 
   null, 
   1111211280.0
  ], 
  [
   99627, 
   null, 
   "zachvac", 
   "This area is not the Miss. Delta, the humidity is not that bad. Snakes and insects are much easier to be around than the liberals that permeate my home town. Also you forgot to mention Poison Ivy, but I am immune to that. I'll take the country in the South any day to the big city.\n And Southern girls, BOY-HOWDY!!!!!!!!!!!!!! :)\n \n \n Oh yeh, and one Yankee girl from PA. BOY-HOWDY!!!!!!!!!!! emoticon_xangel\n\n \n I am really allergic to poison ivy. I pretty much get it at least once every spring and I don't go into the woods much anymore either.", 
   {}, 
   99320, 
   null, 
   1111211340.0
  ], 
  [
   99634, 
   null, 
   "Hunter", 
   "I am really allergic to poison ivy. I pretty much get it at least once every spring and I don't go into the woods much anymore either.\n\n \n Hey pardner, I have seen people in really bad shape from poison ivy. Some,actually had to go to the hospital. It does not bother me at all. I don't know why that is.", 
   {}, 
   99627, 
   null, 
   1111215540.0
  ], 
  [
   99638, 
   null, 
   "JPSartre12", 
   "Hey pardner, I have seen people in really bad shape from poison ivy. Some,actually had to go to the hospital. It does not bother me at all. I don't know why that is.\n\n \n When I was a kid, I used to miss almost a week of school every spring because of bad poison ivy. I looked like a professional boxer who forgot how to defend himself. :)", 
   {}, 
   99634, 
   null, 
   1111216740.0
  ], 
  [
   99660, 
   null, 
   "georged", 
   "This area is not the Miss. Delta, the humidity is not that bad. Snakes and insects are much easier to be around than the liberals that permeate my home town. Also you forgot to mention Poison Ivy, but I am immune to that. I'll take the country in the South any day to the big city.\n And Southern girls, BOY-HOWDY!!!!!!!!!!!!!! :)\n \n\n \n I thought we were commenting purely on the country, not cities? I've lived in 'not all that bad' Southern, Midwest and Eastern humidity and believe me, no humidity is far, far more desirable. I also lived in Hawaii for five years, and while that climate is humid per se, constant trade winds and relatively low, stable temperatures remove that discomfort. I'd think one has to experience the differences on a resident basis before forming an opinion or be speaking from a limited viewpoint restricted by lack of actual exposure and adhering to the traditional 'no place like home' sociodemographic comfort level?", 
   {}, 
   99320, 
   null, 
   1111249320.0
  ], 
  [
   156134, 
   null, 
   "EvelynW.", 
   "No. It was used by the Confederate side of the Civil War as a symbol that were not going to be told what to do in a free country where THEY were supposed to be the ones who decide. It was a symbol of not being pushed around. The only reason why the northerners didn't have slaves was becuase they didn't need them. Southern farmers did. If the north was majorly a crop area, they would DEFINATELY employ them. \n \n The Civil War wasn't even entirely about resisting to being told what to do, but it was also about the northern side trying to gain back control of the south. For a very long while the southerners had to ship their crops that were to be sold up north to ports on the coastline. But as the southerners slowly began building their own ports closer and easier to get to, the north wanted to get back the revenue they once had had. \n \n I hate it that people always think that the Civil War was only about the fact that slaves were being wrongly treated. \n \n Read Across Five Aprils, it's a fiction book but it brings up the very true and very real reasons as to why the war went on.", 
   {}, 
   41, 
   null, 
   1124677740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Confederate Flag", 
  "url": "http://www.4forums.com/political/civil-rights-debates/38-confederate-flag.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 38, 
  "discussion_files": [
   [
    "8232.html", 
    "http://www.4forums.com/political/civil-rights-debates/38-confederate-flag-print.html"
   ], 
   [
    "8233.html", 
    "http://www.4forums.com/political/civil-rights-debates/38-confederate-flag-10-print.html"
   ], 
   [
    "8234.html", 
    "http://www.4forums.com/political/civil-rights-debates/38-confederate-flag-8-print.html"
   ], 
   [
    "8235.html", 
    "http://www.4forums.com/political/civil-rights-debates/38-confederate-flag-6-print.html"
   ], 
   [
    "8236.html", 
    "http://www.4forums.com/political/civil-rights-debates/38-confederate-flag-4-print.html"
   ], 
   [
    "8237.html", 
    "http://www.4forums.com/political/civil-rights-debates/38-confederate-flag-5-print.html"
   ], 
   [
    "8238.html", 
    "http://www.4forums.com/political/civil-rights-debates/38-confederate-flag-7-print.html"
   ], 
   [
    "8239.html", 
    "http://www.4forums.com/political/civil-rights-debates/38-confederate-flag-9-print.html"
   ], 
   [
    "8240.html", 
    "http://www.4forums.com/political/civil-rights-debates/38-confederate-flag-3-print.html"
   ], 
   [
    "8241.html", 
    "http://www.4forums.com/political/civil-rights-debates/38-confederate-flag-2-print.html"
   ]
  ], 
  "identifier": 38
 }
]