[
 [
  [
   79051, 
   null, 
   "mcrazz1", 
   "That's how much money was raised and spent by the candidates in the last presidential election. Not surprisingly, much of the money came from wealthy benefactors and corporate interests. Think they are getting something in return? How about these examples of taxpayer dollars being doled out. $200,000 for the American Cotton Museum in Greeneville, Texas. $70,000 for a paper industry Hall of Fame in Appleton, WI. $1 million for the Missouri Pork Producers Federation to convert animal waste to energy. Talk about a crok of s**t! This is gross mismangement of our government. If you want even more heinous examples, go to www.americanoutrage.net or read the book Outrage: We The People.", 
   {
    "post_info": {
     "post_title": "Over 500 million dollars"
    }
   }, 
   null, 
   null, 
   1101438840.0
  ], 
  [
   79789, 
   null, 
   "pnac=ww3", 
   "Ok, there is research devoted to coverting animal wastes (and human) into energy (or at least coverting it into a crude oil). That sounds like a worthy venture.\n \n Most things that are considered pork probably are, but some things are considered pork by people who do not realize the implications of the research or why the money was spent.\n \n I wish the website would actually say something besides \"buy the book.\"", 
   {}, 
   79051, 
   null, 
   1101850080.0
  ], 
  [
   79829, 
   null, 
   "Dono", 
   "Ok, there is research devoted to coverting animal wastes (and human) into energy (or at least coverting it into a crude oil). That sounds like a worthy venture.\n \n Most things that are considered pork probably are, but some things are considered pork by people who do not realize the implications of the research or why the money was spent.\n \n I wish the website would actually say something besides \"buy the book.\"\n\n You make a good point that some earmarks are not pork and the research can be very beneficial and an excellent investment for the country. I made a point in my thread \"Fiscal Responsibility\" in this forum not to mention good research projects. That said, the pols, in this time of record deficits, are still feasting on pork from the public trough. Interesting fact, the state that received the most pork in the most recent bill was Alaska .... guess what state the gentleman that chairs the committee is from.\n Dono", 
   {}, 
   79789, 
   null, 
   1101857400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Over 500 million dollars", 
  "url": "http://www.4forums.com/political/politics-debates/3805-over-500-million-dollars.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3805, 
  "discussion_files": [
   [
    "28354.html", 
    "http://www.4forums.com/political/politics-debates/3805-over-500-million-dollars-print.html"
   ]
  ], 
  "identifier": 3805
 }
]