[
 [
  [
   79325, 
   null, 
   "Lily1000", 
   "At conception a particular individual's DNA is established. This is a scientific fact. So from conception one certain individual is forming and most likely will be born if the pregnancy is allowed to proceed (the majority of pregnancies allowed to proceed result in a live, healthy baby).\n \n Now, if the mother chooses to abort that person will not be born. You or I would not be here if we had been aborted. And why not? Because that person's life was ended while still in the womb. \n \n Consider that person whose life was ended by abortion. How is abortion not killing? Why does it not matter to you that a life is ended by abortion? Even if it was just a clump of cells (I can hear this one coming) in the beginning, the fact is, in the end it will most likely be a live human being and that isn't changed by it's alleged \"clump of cells in the beginning\" status.\n \n Please explain. :)", 
   {
    "post_info": {
     "post_title": "What Happens to the Life Ended by Abortion"
    }
   }, 
   null, 
   null, 
   1101662940.0
  ], 
  [
   79331, 
   null, 
   "jitobear", 
   "At conception a particular individual's DNA is established. This is a scientific fact. So from conception one certain individual is forming and most likely will be born if the pregnancy is allowed to proceed (the majority of pregnancies allowed to proceed result in a live, healthy baby).\n \n Now, if the mother chooses to abort that person will not be born. You or I would not be here if we had been aborted. And why not? Because that person's life was ended while still in the womb. \n \n Consider that person whose life was ended by abortion. How is abortion not killing? Why does it not matter to you that a life is ended by abortion? Even if it was just a clump of cells (I can hear this one coming) in the beginning, the fact is, in the end it will most likely be a live human being and that isn't changed by it's alleged \"clump of cells in the beginning\" status.\n \n Please explain. :)\n\n \n Actually I believe life begins at conception, that that life matters and abortion ends that life.\n \n I also believe mama comes first and until we can seriously address the issues faced by pregnant women rather than demonizing them that they will abort whether it's legal or not.\n \n I also believe that there are times when abortion is appropriate and necessary.", 
   {}, 
   79325, 
   null, 
   1101665280.0
  ], 
  [
   79352, 
   null, 
   "jyoshu", 
   "Actually I believe life begins at conception, that that life matters and abortion ends that life.\n \n I also believe mama comes first and until we can seriously address the issues faced by pregnant women rather than demonizing\n\n \n Your post was fine until you started into the \"demonizing\" bit. Why did you feel the need to get in that dig?\n \n It's sad that the pro-choice movement has resorted to portraying a desire to protect the life of the unborn as \"demonizing\" women. Intellectual dishonesty.", 
   {}, 
   79331, 
   null, 
   1101681780.0
  ], 
  [
   79397, 
   null, 
   "Tastyfish", 
   "As for the DNA defintion you are going to run into problems, is it Ok to get rid of one identical twin seeing as their DNA is exactly the same? Or chemotherapy, seeing as you will be killing a what you have defined as a new person - something with a new set of human DNA?\n \n There is no doubt as to whether abortion is killing or not, the main thing is whether it is closer to murder (the principle rather than the law seeing as it is not an illegal killing before some points this out). Is what you are killing actually a 'person' yet, and how highly is a potential person rated against an existing one.", 
   {}, 
   79352, 
   null, 
   1101739980.0
  ], 
  [
   79412, 
   null, 
   "jyoshu", 
   "There is no doubt as to whether abortion is killing or not, the main thing is whether it is closer to murder (the principle rather than the law seeing as it is not an illegal killing before some points this out).\n\n \n The law is supposed to reflect the principle.", 
   {}, 
   79397, 
   null, 
   1101744360.0
  ], 
  [
   79445, 
   null, 
   "Sigma", 
   "The law is supposed to reflect the principle.\n\n \n It does, as far as I'm concerned.", 
   {}, 
   79412, 
   null, 
   1101758100.0
  ], 
  [
   79474, 
   null, 
   "jitobear", 
   "Your post was fine until you started into the \"demonizing\" bit. Why did you feel the need to get in that dig?\n \n It's sad that the pro-choice movement has resorted to portraying a desire to protect the life of the unborn as \"demonizing\" women. Intellectual dishonesty.\n\n \n As long as pro-lifers simplify the issues pregnant women face as matters of convenience and imply that any woman who aborts for any reason outside of health (and maybe rape) as an unfeeling, irresponsible flake - they are demonizing women.\n \n I hear again and again about how most abortions are for convenience or birth control with absolutely NO REGARD further than that. All abortion gets lumped into three categories - rape, medical reasons and birth control - as if that is all that impacts a pregnancy. That scope is too narrow, very pro-life leaning and almost completely disregards the women invloved.\n \n Think about it! Why do people use birth control? Lots of valid reasons. Those reasons are no less valid after one is pregnant - although circumstances are certainly more dire.", 
   {}, 
   79352, 
   null, 
   1101760860.0
  ], 
  [
   79554, 
   null, 
   "unkerpaulie", 
   "Actually I believe life begins at conception, that that life matters and abortion ends that life.\n \n I also believe mama comes first and until we can seriously address the issues faced by pregnant women rather than demonizing them that they will abort whether it's legal or not.\n \n I also believe that there are times when abortion is appropriate and necessary.\n\n what is considered \"appropriate and necessary\" is highly subjective. the fact is that only less than 5% of women abort because of health hazards or rape. the vast majority of abortions occur because the woman just doesnt want the child. of course there are issues that come into play: finances, acceptance, emotional stability, maturity, career, etc. these are not trivial, but at the same time they do not constitute a situation of life-or-death for the mother as so many people would like to portray.\n \n with that said, we can still argue that the mama comes first. what happens when child is already born and any one of the above issues pops up? is it ok to \"abort\" motherhood?", 
   {}, 
   79331, 
   null, 
   1101765420.0
  ], 
  [
   79649, 
   null, 
   "Sigma", 
   "what is considered \"appropriate and necessary\" is highly subjective.\n\n \n Agreed. Those not in the situation don't know how bad it is for the woman, and so none should decide in the situation except the woman. None of us can judge \"oh her situation is not that bad\".\n \n \n\n the fact is that only less than 5% of women abort because of health hazards or rape.\n\n \n And what is included in your \"health hazard\"? Only death?\n \n \n\n the vast majority of abortions occur because the woman just doesnt want the child. of course there are issues that come into play: finances, acceptance, emotional stability, maturity, career, etc. these are not trivial, but at the same time they do not constitute a situation of life-or-death for the mother as so many people would like to portray.\n\n \n It is for her. These are severe enough for her to say \"I have to have an abortion\". You just finished saying that it is subjective, and now it's not?\n \n \n\n with that said, we can still argue that the mama comes first. what happens when child is already born and any one of the above issues pops up? is it ok to \"abort\" motherhood?\n\n \n You were part of the debate where you agreed that there are too many differences between a born child and a fetus in the womb to make any sort of direct line moral comparison. It really is an invalid comparison.", 
   {}, 
   79554, 
   null, 
   1101777180.0
  ], 
  [
   79655, 
   null, 
   "jitobear", 
   "what is considered \"appropriate and necessary\" is highly subjective. the fact is that only less than 5% of women abort because of health hazards or rape. the vast majority of abortions occur because the woman just doesnt want the child. of course there are issues that come into play: finances, acceptance, emotional stability, maturity, career, etc. these are not trivial, but at the same time they do not constitute a situation of life-or-death for the mother as so many people would like to portray.\n\n \n OK - I'll bite\n \n Finances - pregnancies need doctors, pills, and mama needs housing, clothes, shelter - not having these things are great risks to life and health.\n \n Acceptance - If you are a teen-ager and the family may toss you - dang right\n \n Amotional stability - This links to mental illness. These things may require meds, somebody who is not mentally stable can't care for themselves let alone a pregnancy (mental health worker)\n \n Maturity - yep. Little girls are not equipped to handle being pregnant - not to mention theor bodies are not ready\n \n Career plays into that finances money doctor thing mentioned above - during and AFTER baby is born\n \n \n \nwith that said, we can still argue that the mama comes first. what happens when child is already born and any one of the above issues pops up? is it ok to \"abort\" motherhood?\n\n \n Yep - ever heard of adoption? - plus most new borns can be left at any hopsital or police station.", 
   {}, 
   79554, 
   null, 
   1101777900.0
  ], 
  [
   85694, 
   null, 
   "skeeter", 
   "emoticon_idea the baby belongs to GOD, the mother the dr. and any one else involved are condemned, yu see its called murder, purely in the first degree. emoticon_frazzled", 
   {}, 
   79655, 
   null, 
   1105319940.0
  ], 
  [
   86188, 
   null, 
   "simone", 
   "Your post was fine until you started into the \"demonizing\" bit. Why did you feel the need to get in that dig?\n \n It's sad that the pro-choice movement has resorted to portraying a desire to protect the life of the unborn as \"demonizing\" women. Intellectual dishonesty.\n\n Perhaps not demonizing them, if castigating women who choose to abort as selfish or immoral is not demonizing. But, favoring fertilized eggs, embryos and fetuses over women certainly reduces greatly the humanity of the female sex.", 
   {}, 
   79352, 
   null, 
   1105555860.0
  ], 
  [
   86194, 
   null, 
   "jyoshu", 
   "Perhaps not demonizing them, if castigating women who choose to abort as selfish or immoral is not demonizing. But, favoring fertilized eggs, embryos and fetuses over women certainly reduces greatly the humanity of the female sex.\n\n \n What you don't seem to understand is that we would have far more women in the world today if it weren't for abortion. There are far less women in the world today because of it than there would be women as mothers who would die or are seriously injured in childbirth. So in that sense, abortion is very anti-woman. It's anti-humanity.", 
   {}, 
   86188, 
   null, 
   1105558380.0
  ], 
  [
   86196, 
   null, 
   "Sigma", 
   "What you don't seem to understand is that we would have far more women in the world today if it weren't for abortion. There are far less women in the world today because of it than there would be women as mothers who would die or are seriously injured in childbirth. So in that sense, abortion is very anti-woman. It's anti-humanity.\n\n \n From what I've seen, the birth rate has stayed fairly constant from when it was illegal to legal, so your charge is baseless.", 
   {}, 
   86194, 
   null, 
   1105559040.0
  ], 
  [
   86201, 
   null, 
   "jyoshu", 
   "From what I've seen, the birth rate has stayed fairly constant from when it was illegal to legal, so your charge is baseless.\n\n \n No, they were still abortions even before it was legal. There are still less women in the world as a result, legal or not. The true pro-life position is that abortion is bad legal or not.", 
   {}, 
   86196, 
   null, 
   1105559700.0
  ], 
  [
   86203, 
   null, 
   "Sigma", 
   "No, they were still abortions even before it was legal. There are still less women in the world as a result, legal or not. The true pro-life position is that abortion is bad legal or not.\n\n \n Then you realize that making it illegal will not help a fig. So, legal or not, the way to help is to support women. Making it illegal will only exacerbate the problem because it will make it more dangerous for women.", 
   {}, 
   86201, 
   null, 
   1105560000.0
  ], 
  [
   86204, 
   null, 
   "Jessica", 
   "No, they were still abortions even before it was legal. There are still less women in the world as a result, legal or not. The true pro-life position is that abortion is bad legal or not.\n\n \n You've yet to prove that a fetus is a person, so this is entirely irrelevant. Why do you want these women to die in unsafe illegal abortions?", 
   {}, 
   86201, 
   null, 
   1105560060.0
  ], 
  [
   86206, 
   null, 
   "jyoshu", 
   "You've yet to prove that a fetus is a person, so this is entirely irrelevant.\n\n \n Follow the logic . . .\n \n - A fetus develops into a person if left to grow\n \n - Killing the fetus prevents it from growing into a person\n \n - Since many of the fetuses would grow into women, then my statement that there less women in the world as a result of abortion IS true.\n \n I don't have to show that 'a fetus is a person' to make this arugment.", 
   {}, 
   86204, 
   null, 
   1105560540.0
  ], 
  [
   86211, 
   null, 
   "Jessica", 
   "Follow the logic . . .\n\n \n Oh, you have some?\n \n \n- A fetus develops into a person if left to grow\n\n \n And? that doesn't mean it is a person at that point, so this is irrelevant.\n \n \n- Killing the fetus prevents it from growing into a person\n\n \n B/c stops an egg developing into a person. Do you actually have a point here?\n \n \n- Since many of the fetuses would grow into women, then my statement that there less women in the world as a result of abortion IS true.\n\n \n And there's a lot less women in the world because of b/c. Lets make that illegal too!\n \n \nI don't have to show that 'a fetus is a person' to make this arugment.\n\n \n Which can be applied to b/c, so is utterly pointless - unless you advocate b/c illegal.", 
   {}, 
   86206, 
   null, 
   1105561560.0
  ], 
  [
   86220, 
   null, 
   "jyoshu", 
   "Which can be applied to b/c, so is utterly pointless - unless you advocate b/c illegal.\n\n \n That's a red herring; this forum isn't even about b/c.", 
   {}, 
   86211, 
   null, 
   1105562340.0
  ], 
  [
   86230, 
   null, 
   "bd1012", 
   "emoticon_idea the baby belongs to GOD, the mother the dr. and any one else involved are condemned, yu see its called murder, purely in the first degree. emoticon_frazzled\n\n I think you are the same person as usa all the way and again.. you have no right to talk about murder because you murder the english language everytime you post.\n \n And no.. the baby does not belong to god because there is no baby and I don't know if there is a god or not. Btw.. I'm not going to incubate something in my body because of you think it's wrong because someone who may or may not exist said so.", 
   {}, 
   85694, 
   null, 
   1105563240.0
  ], 
  [
   86240, 
   null, 
   "simone", 
   "What you don't seem to understand is that we would have far more women in the world today if it weren't for abortion. There are far less women in the world today because of it than there would be women as mothers who would die or are seriously injured in childbirth. So in that sense, abortion is very anti-woman. It's anti-humanity.\nObviously, you don't think it inhumane to strangle a baby at birth because it is female, as is done in many patriarchal cultures where women are despised. Or, exposed to wild beasts in the forest, as often happened in the old Roman empire. Or, abandoned to an orphanage and the great neglect that resides there, as still happens in China, where women and girls still are not valued as they should be.", 
   {}, 
   86194, 
   null, 
   1105564320.0
  ], 
  [
   86244, 
   null, 
   "Jessica", 
   "That's a red herring; this forum isn't even about b/c.\n\n \n Nope. b/c stops a person being born, just like abortion. Try and weasel out of it all you like, doesn't make it less true.", 
   {}, 
   86220, 
   null, 
   1105564620.0
  ], 
  [
   86247, 
   null, 
   "jyoshu", 
   "Obviously, you don't think it inhumane to strangle a baby at birth . . . \n\n \n Of COURSE I consider that inhumane. Why would you say something like that?", 
   {}, 
   86240, 
   null, 
   1105565160.0
  ], 
  [
   86253, 
   null, 
   "jyoshu", 
   "Nope. b/c stops a person being born, just like abortion. Try and weasel out of it all you like, doesn't make it less true.\n\n \n You are bringing up the irrelevant issue of contraceptives. Contraceptives and abortion are not the same thing. Some people use abortion as birth control, I'll grant you that.\n \n A more accurate way of saying what you said is \"B/c stops conception (the union of the egg and sperm).\" Most all contraceptives work to stop the conception. Only a much higher power dose will cause an abortion, as in the post-coital pill (or \"morning-after pill\"). It will work up to 72 hours after conception and still only prevents 85% of pregnancies.\n \n Contraceptives are generally what is thought of regarding birth control, and they are considered to work pre-conception, or in some cases as conception is taking place.\n \n Abortion and b/c are two separate issues, although unfortunately some people use abortion AS a form of birth control.", 
   {}, 
   86244, 
   null, 
   1105565700.0
  ], 
  [
   86256, 
   null, 
   "Jessica", 
   "You are bringing up the irrelevant issue of contraceptives. Contraceptives and abortion are not the same thing. Some people use abortion as birth control, I'll grant you that.\n\n \n Really? so there are women that have 30 abortions in their lifetime? Please provide proof.\n \n Your point was that abortion stops women being born. so does b/c. What is your point?\n \n \nAbortion and b/c are two separate issues, although unfortunately some people use abortion AS a form of birth control.\n\n \n Please provide proof for this assertion.", 
   {}, 
   86253, 
   null, 
   1105565940.0
  ], 
  [
   86266, 
   null, 
   "jyoshu", 
   "Really? so there are women that have 30 abortions in their lifetime? Please provide proof.\n\n \n I didn't give a number, you did. Surely you don't consider a stetch at all that some women consider abortion a way to control birth. That's what it IS, in a post-conception sense, by definition. It prevents a birth, therefore it is a way for women to control the situation. I'm not sure why you're arguing this--it seems like you would agee.\n \n \nYour point was that abortion stops women being born. so does b/c. What is your point?\n\n \n But most contraceptives work before there is even a conception. If you are going to start talking about pre-conception issues to prevent birth, the discussion can get ridiculous--we could go back to the sex act itself, or when the woman met the man, or heck, even when the woman was born. Abortion discussions by default are about post-conception matters. IMO a preconception matter is irrelevant to this discussion.", 
   {}, 
   86256, 
   null, 
   1105568160.0
  ], 
  [
   86276, 
   null, 
   "Jessica", 
   "I didn't give a number, you did. \n\n \n You claim women were using abortion for b/c. if that were true, most women would have 30 abortions in their reproductive life.\n \n \nBut most contraceptives work before there is even a conception. \n\n \n And? Conception doesn't make a person. Abortion stops a person being born. so does b/c. So does a reduced sex drive.", 
   {}, 
   86266, 
   null, 
   1105570500.0
  ], 
  [
   86285, 
   null, 
   "Sigma", 
   "I didn't give a number, you did. Surely you don't consider a stetch at all that some women consider abortion a way to control birth. That's what it IS, in a post-conception sense, by definition. It prevents a birth, therefore it is a way for women to control the situation. I'm not sure why you're arguing this--it seems like you would agee.\n\n \n An extreme minority do this. We are not allowed to use the special case of rape, yet you are allowed to use the special case of this?", 
   {}, 
   86266, 
   null, 
   1105571400.0
  ], 
  [
   86287, 
   null, 
   "jyoshu", 
   "An extreme minority do this. We are not allowed to use the special case of rape, yet you are allowed to use the special case of this?\n\n \n ???\n \n Not sure what you mean by the rape comment, but regarding abortion as birth control, it seems to me that it's always used as a form of birth control. That's what it does--it prevents birth, period.", 
   {}, 
   86285, 
   null, 
   1105572060.0
  ], 
  [
   86291, 
   null, 
   "Sigma", 
   "\n Not sure what you mean by the rape comment, but regarding abortion as birth control, it seems to me that it's always used as a form of birth control. That's what it does--it prevents birth, period.\n\n \n So does a hysterectomy, but that isn't the reason they're done emoticon_confused Abortions aren't desired for that reason.", 
   {}, 
   86287, 
   null, 
   1105572600.0
  ], 
  [
   86315, 
   null, 
   "simone", 
   "Of COURSE I consider that inhumane. Why would you say something like that?\nOne does wonder because of what you say.", 
   {}, 
   86247, 
   null, 
   1105578360.0
  ], 
  [
   86425, 
   null, 
   "jyoshu", 
   "One does wonder because of what you say.\n\n \n What did I say, specifically, that gives you the idea I would it inhumane to strangle a newborn??? Are you out of your mind?? \n \n If you are going to make such reckless and inflammatory accusations, I'm going to hold your feet to the fire and expect you to back them up.", 
   {}, 
   86315, 
   null, 
   1105631880.0
  ], 
  [
   86457, 
   null, 
   "simone", 
   "What you don't seem to understand is that we would have far more women in the world today if it weren't for abortion. There are far less women in the world today because of it than there would be women as mothers who would die or are seriously injured in childbirth. So in that sense, abortion is very anti-woman. It's anti-humanity.\nSigh! Let us go back and examine this statement in its entirety. I must admit that I think it rather anti-womanly to condemn women to \"die\" or be \"seriously injured\" in childbirth. I, particularly, as would the vast majority of pro-choicers, the true Pro-Lifers of the world, would like to see fewer women dying or being seriously disabled as a result of pregnancy.", 
   {}, 
   86194, 
   null, 
   1105640220.0
  ], 
  [
   86979, 
   null, 
   "xeiah", 
   "Your post was fine until you started into the \"demonizing\" bit. Why did you feel the need to get in that dig?\n \n It's sad that the pro-choice movement has resorted to portraying a desire to protect the life of the unborn as \"demonizing\" women. Intellectual dishonesty.\n\n \n \n Well isn't the beilef commonly held that women will be damned if they commit abortion unless they repent? I think that veiw is primarily the one doing the demoniaing isn't it?\n \n -\" I may be going to hell in a bucket....\" But at least I stand up for what I believe.", 
   {}, 
   79352, 
   null, 
   1105874340.0
  ], 
  [
   94410, 
   null, 
   "bobbob", 
   "Perhaps not demonizing them, if castigating women who choose to abort as selfish or immoral is not demonizing. But, favoring fertilized eggs, embryos and fetuses over women certainly reduces greatly the humanity of the female sex.\n\n Ah. Problem. You see you could be killing a girl. What If your mother chose to dehumanzie you? You wouldn't be around to enjoy anything or partake in this discussion, you would never have grown up to be a woman, would you?\n \n Abortion is often the torturous mutilation of a child but this is as relivant as quoting the Qu'ran at you. I'm sure you'll start talking about the \"but's\" well heres one. \n ... but what happens when it is during a stage of development when the child can feel their limbs being dismembered, the salt/urea burning their flesh, the pain of malnutrition, trying to breath while left to die in a bucket, their head being open and their brains sucked out, tortuorus posioning etc etc.\n \n There are none so blind as those who do not wish to see. \n You will just repeat your position and refut this anyway, time wasted.\n I'm sure you will justify even this (depending on your stance)...\n \n You see I know there is a person behind that computer screen. I know you've got reasons for believing what you do. I respect you, but in no way do I respect abortion as justifiable.", 
   {}, 
   86188, 
   null, 
   1109692140.0
  ], 
  [
   94414, 
   null, 
   "bobbob", 
   "Well isn't the beilef commonly held that women will be damned if they commit abortion unless they repent? I think that veiw is primarily the one doing the demoniaing isn't it?\n \n Well I think this isn't a theologicial discussion but rather a moral one. If theology applies O.K. but if it doesn't don't apply it, but in my limited knowledge I will reply since it applies now. \n \n If I kill people because I want a better life and don't care about what I've done and don't want God (which comes from the previous etc.) I can't enter heaven because I don't want to be there. Although I might want happiness this doesn't mean I want to be happy through loving (also the abundant reception of love). This love isn't what society calls love e.g. sex for pleasure alone is lust-self gratification. Heaven being a place of love as opposed to selfishness, indifferrence etc.\n \n living the Gospel comes before teaching it (although teaching it can be part of living it). I will never convert a soul, thats Gods job. \n \n If someone refuses truth all they see are lies.", 
   {}, 
   94410, 
   null, 
   1109693520.0
  ], 
  [
   94416, 
   null, 
   "bobbob", 
   "If I kill people because I want a better life and don't care about what I've done and don't want God (which comes from the previous etc.) I can't enter heaven because I don't want to be there. Although I might want happiness this doesn't mean I want to be happy through loving (also the abundant reception of love). This love isn't what society calls love e.g. sex for pleasure alone is lust-self gratification. Heaven being a place of love as opposed to selfishness, indifferrence etc.\n \n I am refering to If I were a murderer, not specificially to abortion etc.", 
   {}, 
   94414, 
   null, 
   1109693700.0
  ], 
  [
   94567, 
   null, 
   "jitobear", 
   "Whoah there double Bob - \n \n Looks like somebody here spends way too much watching meladrama and mistaking it for life.\n \n Real women, with real lives, and real circumstances get pregnant. Address them and her and you will help this problem. Demonize her - and you won't.", 
   {}, 
   94416, 
   null, 
   1109711400.0
  ], 
  [
   96986, 
   null, 
   "Harbinger", 
   "\n At conception a particular individual's DNA is established.\n \n\n That's true.\n \n \n\n Now, if the mother chooses to abort that person will not be born.\n \n\n Well, by the strict defintion of the word \"born\", an abortion is considered a premature birth.\n \n \n\n You or I would not be here if we had been aborted.\n \n\n Gee, I guess not. But, also wouldn't be looking back and feel bad about it either.\n \n \n\n And why not? Because that person's life was ended while still in the womb.\n \n\n \"That person\"? Wait, don't you mean me or you? This was supposed to be the answer to your last question, right?\n \n \n\n Consider that person whose life was ended by abortion. How is abortion not killing?\n \n\n Uh, it is killing. It's murder and it's every womens right have killed and removed whatever shes doesn't want inside of her body.\n \n \n\n Why does it not matter to you that a life is ended by abortion?\n \n\n Why should I worry about things I have no control over?\n What excuse would I have to assert control over a woman's body and force her to give birth? The will of God?\n \n \n\n Even if it was just a clump of cells (I can hear this one coming) in the beginning, the fact is, in the end it will most likely be a live human being and that isn't changed by it's alleged \"clump of cells in the beginning\" status.\n\n Just because a clump if cell will develope into a live human being doesn't mean the mother is obligated to let it happen in her body whether she want it to or not. If that bothers you then STOP DWELLING ON IT.", 
   {}, 
   79325, 
   null, 
   1110536820.0
  ], 
  [
   97501, 
   null, 
   "Steeeeve", 
   "I am a little unclear about Harbingers statements. Are you saying it is ok for the mother to murder something that is inside of her?", 
   {}, 
   96986, 
   null, 
   1110756300.0
  ], 
  [
   97506, 
   null, 
   "jitobear", 
   "I am a little unclear about Harbingers statements. Are you saying it is ok for the mother to murder something that is inside of her?\n\n \n Well Steve \"murder\" is a legal term that does not apply in abortion. But for the sake of keeping this simple - yes, and not only that, it's legal.", 
   {}, 
   97501, 
   null, 
   1110764700.0
  ], 
  [
   97521, 
   null, 
   "Steeeeve", 
   "it says murder right in his post....thats why I am asking...and abortion was never \"legal\"...Only congress makes laws (in theory) and there has been no law saying abortion is ok. You may reply \"well roe v wade made it legal\"...kinda....it made it so the government cannot inquire about an operation that a female has...not that abortion is legal", 
   {}, 
   97506, 
   null, 
   1110771180.0
  ], 
  [
   97523, 
   null, 
   "Tastyfish", 
   "But unless a change in the law recognises a growing embryo as a person, then it wouldn't come under murder in the first place...unless there are laws that specifically say that abortion is illegal?", 
   {}, 
   97521, 
   null, 
   1110771300.0
  ], 
  [
   97524, 
   null, 
   "Steeeeve", 
   "most states still have laws that say abortion is illegal....they just cant enforce them because the supreme court would strike it down as unconstitional.", 
   {}, 
   97523, 
   null, 
   1110771600.0
  ], 
  [
   97531, 
   null, 
   "HeavenBound", 
   "If women don't want to be pregnant they need to either practice abstinence or birth control. The life developing inside them shouldn't have to pay the consequence for their screw up (no pun intended). Women have to accept responsibility for their actions instead of taking the easy way out. They've got to learn if they want to play then they have to pay. God gave women the greatest gift of all to carry and give birth to a new life and now some women want to throw that away. Why don't they just get hysterectomies if they don't want to go through the process of birth?", 
   {}, 
   97524, 
   null, 
   1110773760.0
  ], 
  [
   97533, 
   null, 
   "Steeeeve", 
   "Im gonna reply before someone types in \"well what about if a women was raped\"....I know it is coming.\n \n If the women is raped why should the kid have to pay too? The fault is the person that raped not the kids fault. To punish two for the crime of one is not right. That kid would still rather live...The women will have to deal with the scars of being raped no matter what. As for the guy that raped...we should go to jail for life.", 
   {}, 
   97531, 
   null, 
   1110774600.0
  ], 
  [
   97587, 
   null, 
   "Sigma", 
   "HeavenBound,\n \nIf women don't want to be pregnant they need to either practice abstinence or birth control.\n\n \n Agreed. In fact, I'll go as far as to say everyone should practice both if they do not wish to have children. Unfortunately, this is not the case.\n \n \n\n The life developing inside them shouldn't have to pay the consequence for their screw up (no pun intended).\n\n \n Nor should women be required to remain pregnant against their will and without their consent. Women's rights should not be violated in this manner, even to ensure the survival of another.\n \n \n\n Women have to accept responsibility for their actions instead of taking the easy way out.\n\n \n Is forced responsibility really responsible? In any case, pregnancy is not something that should be used as a punishment for irresponsible behavior. Women should not be forced to endure detrimental changes to their body, just because they, according to you, need to \"accept responsibility\". \n \n No. Every pregnancy should be wanted. No one should enter motherhood because she has no other choice. That is an exteremly sick view, imo.\n \n \n\n They've got to learn if they want to play then they have to pay.\n\n \n I see now. \"They've got to learn\". You plan on punishing women for having sex by making continuing the pregnancy mandatory. \"Do the crime, do the time\", eh?\n \n I'm sorry, but sex is not a crime and pregnancy should never, ever, ever be used merely as a punishment, a beating stick, or a learning tool. Just because a woman is irresponsible is not an excuse for violating her rights in this manner.\n \n \n\n God gave women the greatest gift of all to carry and give birth to a new life and now some women want to throw that away. \n \n \n And by golly you're going to make them appreciate it, eh?\n \n \n\n Why don't they just get hysterectomies if they don't want to go through the process of birth?\n\n \n Perhaps they want children later. Why don't you have your testicles chopped off if you don't want children right now?\n \n \n Steeeeve,\n \nIm gonna reply before someone types in \"well what about if a women was raped\"....I know it is coming.\n \n If the women is raped why should the kid have to pay too?\n\n \n Why must the woman pay?\n \n \n\n The fault is the person that raped not the kids fault.\n\n \n Is it the woman's?\n \n \n\n To punish two for the crime of one is not right.\n\n \n Punishing the woman is? Violating her rights is the right thing to do? Do you even think before you type?\n \n \n\n That kid would still rather live...\n\n \n The \"kid\" doesn't care. It doesn't have the capacity to care.\n \n \n\n The women will have to deal with the scars of being raped no matter what. As for the guy that raped...we should go to jail for life.\n\n \n So your solution is to make her scars even worse? To force her to continue a pregnancy on a cervix that is perhaps bruised by the rape? To force her to be in pain every day, to have a reminder of the rape growing inside her for 9 months? And then, at the end, giving birth to this reminder in even more pain, in even more blood? \n \n The compassion for women is severely lacking.", 
   {}, 
   97531, 
   null, 
   1110792600.0
  ], 
  [
   97623, 
   null, 
   "Steeeeve", 
   "Would you please stop with the insulting...\n \n I clearly said that the person at fault is the rapest...the women is a victim and always will be after a rape...so why make the child a victim too. Two victims is not better than one. Also, assume you could travel into the future 10 years and ask that unborn if he would like to live...he would more than likely say yes and even if you don't know that you should still probably assume yes unless otherwise stated. \n \n You said violating her rights is the right thing to do. The only rights violated where the womens when she got raped. To say it is ok to then violate the rights of another person (the unborn) doesn't right the wrong. This goes back to the 2 wrongs don't make a right idea.", 
   {}, 
   97587, 
   null, 
   1110815340.0
  ], 
  [
   97700, 
   null, 
   "Sigma", 
   "Would you please stop with the insulting...\n \n I clearly said that the person at fault is the rapest...the women is a victim and always will be after a rape...so why make the child a victim too. Two victims is not better than one.\n\n \n Given that only one of them can actually think and feel, I would believe the woman takes precedence in every way. If it would make her situation one iota worse, she should have every right to choose to have an abortion. To do otherwise could make the rape even worse for her and she is of paramount importance in the pregnancy relationship.\n \n \n\n Also, assume you could travel into the future 10 years and ask that unborn if he would like to live...he would more than likely say yes and even if you don't know that you should still probably assume yes unless otherwise stated. \n\n \n If you have to include time-travel to make your points, don't bother.\n \n \n\n You said violating her rights is the right thing to do. The only rights violated where the womens when she got raped. To say it is ok to then violate the rights of another person (the unborn) doesn't right the wrong. This goes back to the 2 wrongs don't make a right idea.\n\n \n The \"unborn\" (this term amuses me, I always think \"undead\" to refer to the living) has no rights to violate. Even if the fetus did have rights, the woman's rights do and should take precedence over them.\n \n If you force the woman to remain pregnant against her will, you are making the fetus' rights to her body superior to hers and you are violating the rights of a thinking, feeling person who is a citizen of this country (assuming this is the US). A few weeks old embryo is none of these things. The fetus and the woman are in constant conflict in terms of the use of her bodily resources, and the woman's right to those resources are and should always be more important than the (non-existant) right of the fetus to her body.\n \n You are right, two wrongs don't make a right. Forcing the woman to remain pregnant when she does not wish to be is wrong as well.", 
   {}, 
   97623, 
   null, 
   1110823860.0
  ], 
  [
   97782, 
   null, 
   "Steeeeve", 
   "Who said an unborn could not feel? Partial Birth Abortion when they jam the sissors in the back on the babies neck the child actually tenses life you or me would.\n \n time travel is a perfectly valid arguement and I do not see why I can't make it. The child doesn't have the ability to speak right away but one would assume in time it could and would probably want to be alive. This is however a weak arguement because it is hard to speak for someone whom you don't know. Although if you don't know what he/she would say...you should probably find out because he/she is just as much of a person as you or I.\n \n if the unborn is a person it has rights. To say unborn is kind of like saying child or adult...it is simply a stage of life. So if the unborn has rights then they cannot be violated no matter how much of a burden it is on someone else. To say the mother shouldn't have to have the baby because she doesn't want it doesn't seem fair if one believe the unborn is a person (if one doesnt then its a different debate). If one does believe it the unborn is a person then it has the same right to live as you and I. This does not the fetus rights superior but rather equal to the mothers. The fact that she is raped is sad and the person that did it should probably rot in hell (my own opinion) but mean someone elses life should be destroyed too. I do understand your point that the mother not only had to go through a rape but now a pregnancy and sadly life is unfair like that. She was not treated fairly at all. We try to amend that by sending that guy to jail to make it as fair as possible. Killing a child is really unfair to the unborn child so what amend is there to make that fair? So to recap here....Rapest did and unfair thing to a women; women was treated unfairly and got pregnant; for this man goes to jail for life; child killed to make the women feel better?? I honestly just don't understand the logic about how killing an innocent justifies the wrong doing. One would not kill the rapest's dad for what happened.", 
   {}, 
   97700, 
   null, 
   1110837300.0
  ], 
  [
   97788, 
   null, 
   "Tastyfish", 
   "You have to realise that unlike pro-life, pro-choice is not all about abortion at all costs. The point where the fetus develops its own senses and brain is generally the point where most people say its too late for an abortion. Partial birth should only be used in case of the risks to mother examples.\n \n Its a weak argument because the people that were killed by them when they became the next Hitler speak out against them - sure they are less likely to exist than he is, but there is a lot more of them. Time travel is a nonsense argument, what matters is that the thing in question is aware or not aware (or even capable) of what is happening to it.", 
   {}, 
   97782, 
   null, 
   1110838020.0
  ], 
  [
   97802, 
   null, 
   "Steeeeve", 
   "with that arguement you could say a women that was drugged then raped was not capable of knowing was was happening to her (or drunk for that matter) and therefore ok. being able to \"aware\" or reason is not what a life is because life would go off and on at different times in ones life...even if they are knocked out.", 
   {}, 
   97788, 
   null, 
   1110839940.0
  ], 
  [
   97808, 
   null, 
   "Sigma", 
   "Who said an unborn could not feel? Partial Birth Abortion when they jam the sissors in the back on the babies neck the child actually tenses life you or me would.\n\n \n The general consensus among the scientific community is the the fetus (or the \"unborn\" :P) does not have the machinery to achieve conciousness (generally thought of as a requirement for pain) until around the 3rd trimester. What you speak of is very rare and generally done in more extreme circumstances. Something in the neighborhood of 80% of abortions are done in the 1st trimester and 95% in both the first and second. Using that extreme example as evidence of your POV is not valid.\n \n \n\n time travel is a perfectly valid arguement and I do not see why I can't make it.\n\n \n lol\n \n \n\n The child doesn't have the ability to speak right away but one would assume in time it could and would probably want to be alive. This is however a weak arguement because it is hard to speak for someone whom you don't know. Although if you don't know what he/she would say...you should probably find out because he/she is just as much of a person as you or I.\n\n \n In your zealousness to \"speak for the unborn\" you are forgetting that by doing that you are also speaking for the woman, who is perfectly capable of speaking for herself. The arrogance in assuming you know what is best for her in a situation as personal as pregnancy is, frankly, disgusting. It is her body. No matter your pure and noble goals in \"speaking for the unborn\", that fact does not change.\n \n \n\n if the unborn is a person it has rights. To say unborn is kind of like saying child or adult...it is simply a stage of life.\n\n \n It is much more than simply a stage of life. I know it helps your points to trivialize the woman's... contribution (to put it very lightly), but I will not accept that her role is unimportant. She is, and will continue to be, of paramount importance in the pregnancy relationship.\n \n \n\n So if the unborn has rights then they cannot be violated no matter how much of a burden it is on someone else.\n\n \n No. The gov't should not have the right to violate your or my rights, even to ensure the survival of someone else. The gov't does not have a deed to the woman's womb to hand over to another. Her right to her body and her privacy is still there, and that includes the right to terminate the life-support proess she is involved in.\n \n \n\n To say the mother shouldn't have to have the baby because she doesn't want it doesn't seem fair if one believe the unborn is a person (if one doesnt then its a different debate).\n\n \n In your own words: \"sadly life is unfair like that\"\n \n The woman is a person and is a citizen, uncontested. Her rights are superior to the fetus' (non-existant) rights. Always. Their rights cannot be equal, because they are both using her body. If she does not want it there, then they are in conflict, and the woman's rights should always be superior to what is growing inside her. To make the fetus' rights to her body as superior to her own is a twisted view, imo.\n \n \n\n If one does believe it the unborn is a person then it has the same right to live as you and I. This does not the fetus rights superior but rather equal to the mothers.\n\n \n None have the right to live at another's expense as the fetus is doing. You do not have that right, I do not have that right, and the fetus does not have that right.\n \n \n\n The fact that she is raped is sad and the person that did it should probably rot in hell (my own opinion) but mean someone elses life should be destroyed too. I do understand your point that the mother not only had to go through a rape but now a pregnancy and sadly life is unfair like that.\n\n \n \"life is unfair like that\" How nice and comforting to the woman. Yet you still want to be fair to the fetus? Which do you care more about? I think we can tell.\n \n \n\n She was not treated fairly at all. We try to amend that by sending that guy to jail to make it as fair as possible. Killing a child is really unfair to the unborn child so what amend is there to make that fair? So to recap here....Rapest did and unfair thing to a women; women was treated unfairly and got pregnant; for this man goes to jail for life; child killed to make the women feel better??\n\n \n No, her body and rights are not violated further by mandating that her body be used against her will for an additional 9 months. It should always be her choice.\n \n \n\n I honestly just don't understand the logic about how killing an innocent justifies the wrong doing. One would not kill the rapest's dad for what happened.\n\n \n Your analogy is flawed.", 
   {}, 
   97782, 
   null, 
   1110840660.0
  ], 
  [
   97817, 
   null, 
   "HeavenBound", 
   "HeavenBound,Nor should women be required to remain pregnant against their will and without their consent. Women's rights should not be violated in this manner, even to ensure the survival of another.\n\n \n So, you're saying it's ok for women to have multiple abortions and violate the right to life of another, while they go on playing around some more irresponsibly?\n \n \n \nIs forced responsibility really responsible? In any case, pregnancy is not something that should be used as a punishment for irresponsible behavior. Women should not be forced to endure detrimental changes to their body, just because they, according to you, need to \"accept responsibility\".\n\n \n It's not a punishment to make someone responsible for their actions. Isn't that what most parents try to instill in their children, that when they do something wrong they need to accept responsibility. These women are not brain dead, they know there's a risk of getting pregnant with unprotected sex. \n \n \nNo. Every pregnancy should be wanted. No one should enter motherhood because she has no other choice. That is an exteremly sick view, imo.\n\n \n She did have a choice before she got pregnant. The only sick view is a bunch of dead innocent lives thrown in the garbage can.\n \n \n \nI see now. \"They've got to learn\". You plan on punishing women for having sex by making continuing the pregnancy mandatory. \"Do the crime, do the time\", eh?\n \n I'm sorry, but sex is not a crime and pregnancy should never, ever, ever be used merely as a punishment, a beating stick, or a learning tool. Just because a woman is irresponsible is not an excuse for violating her rights in this manner.\n\n \n Oh, so let's just let women run about being irresponsible, killing innocent lives and do nothing about it. In your dreams.\n \n \n \nPerhaps they want children later. Why don't you have your testicles chopped off if you don't want children right now?\n\n \n I see, so they get to pick and choose which children get to live or die sort of like a smorgasbord. \n \n My testicles must have been chopped off at birth because I don't really recall having any.", 
   {}, 
   97587, 
   null, 
   1110841560.0
  ], 
  [
   97823, 
   null, 
   "Steeeeve", 
   "I dont like quoting so I will just address them like normal...\n \n Your first point about 80% being done is the first trimester I believe is true (from what I read). Are you saying you only support abortions in the first trimester?\n \n If you don't like the time travel arguement then fine. You might have misread what I wrote too. I said it is a weak arguement for me to say I can speak for someone that I don't know. The point I was making is that you are right, I shouldn't be able to speak for he or she but he/she should speak for its self. I by no means said I am speaking for the best interest of the women. The best interest of the women is selfish and irrelevant. One does not always get to do what is in their best interest. An example would be me killing the guy that I am competing for a job with. It would be in my best interest so I get the job. The point is one have to be fair to both sides, the mother and child.\n \n you said this \"It is much more than simply a stage of life. I know it helps your points to trivialize the woman's... contribution (to put it very lightly), but I will not accept that her role is unimportant. She is, and will continue to be, of paramount importance in the pregnancy relationship.\"\n \n This does not make sense to me because no where did I try to trivialize the womens role. I just said saying unborn is like saying child or adult...you call it what it is. To call a child a child is not undermining it. I honestly don't know where you might have gotten that conclusion from.\n \n You say the government does not have the right to violate your rights or my rights to save someone else. I am assuming (and please correct me because if I am wrong because I am assuming) that you mean the right of the mother to abort the unborn. If you believe that it is a life then it has rights and thus the government can prevent you from hurting it. It comes down to, is the unborn a life, if yes, then it has rights, guarnteed by our the Constitution (assuming US). No one person has greater rights then the other.\n \n I believe you state next that no one has the right to live at anothers expense. I will have to say I disagree with this 100%. Me living creates an expense to many yet I still have a right to live. Just because I happen to be a burden does not mean I don't get to live. A one month old child is a burden or expense on the mother and still cannot be killed.\n \n you say I still want to be fair to the fetus even after the women was raped...Yes I do. The opposite would imply that it is ok to be unfair to the fetus because of the wrong doing of a man to a women. That doesn't make sense to me. The fetus did nothing wrong, the man did. The man should be punished. Who do I care about? I care about the innocent. In this case, mother and child. The one punished should be the man only. Having the baby is not a punishment to the women.\n \n I believe the problem here is that you feel the rights of the women are above the unborn child because child happen to be produced in her. This just happens to be how people are created....the women carries the baby and I understand that sometimes she may not want the baby. But my agruement is that once a life is created no one can take away his or her right to life based on not being wanted or any other reason. I don't see one life greater than another even if it relies on someone to live. For the arguement that the women didnt consent...most cases she does, she consented to sex and therefore created a life and has no right to end that life. No one has the right to end an innocent life.", 
   {}, 
   97808, 
   null, 
   1110842580.0
  ], 
  [
   97866, 
   null, 
   "jitobear", 
   "\n In your zealousness to \"speak for the unborn\" you are forgetting that by doing that you are also speaking for the woman, who is perfectly capable of speaking for herself. The arrogance in assuming you know what is best for her in a situation as personal as pregnancy is, frankly, disgusting. It is her body. No matter your pure and noble goals in \"speaking for the unborn\", that fact does not change.\n\n \n \n Wow. \n \n Will you marry me? :)", 
   {}, 
   97808, 
   null, 
   1110847920.0
  ], 
  [
   97869, 
   null, 
   "Shaggydoo", 
   "\n In your zealousness to \"speak for the unborn\" you are forgetting that by doing that you are also speaking for the woman, who is perfectly capable of speaking for herself. The arrogance in assuming you know what is best for her in a situation as personal as pregnancy is, frankly, disgusting. It is her body. No matter your pure and noble goals in \"speaking for the unborn\", that fact does not change.\n \n \n \n \n\n The unborn child is not 'her body'. The unborn child is combination of genetics from the male recipient and the woman. That unborn child is not in any way 'her body'.", 
   {}, 
   97808, 
   null, 
   1110848220.0
  ], 
  [
   97876, 
   null, 
   "Tastyfish", 
   "You can not decide its a human because of unique DNA, cancer cell lines have a different DNA to the mother and can exist without them (infact bleak as it seems most of the commonly used immortal lines have actually outlived their parent). More than that, despite what we like to think most mammals are actually symbiotic - we get very sick, and many animals die without their complement of microscopic fauna. This stuff is not even in the same kingdom as us genetically yet keeps us alive in the real world (in our case generally by backing up own immune system, in other mammals often vitally involved in digestion). Infact in your own body there are more cells that don't have your DNA that those that do (seeing a prokaryotes are really small) and thats leaving out latent viruses that have already incorperated themselves into our genome either recently or generations ago and protect us from their more dangerous cousins\n \n Apart from DNA, it acts exactly like a parasite - it feeds off the mother to grow and causes incredable stresses on the body (which are not really required, marsupials have no problem at all with avoiding the mess of serious pregancy by never developing a plancenta - just our misfortune that our ratty ancestor just happened to be smart enough to make up for the disadvantages having a planetal offspring occurs).\n \n If no one told you it was going to be a baby, the idea of having a fetus growing inside you would be straight of SciFi. Compared to Kangaroo's, a human baby is straight out of Aliens.", 
   {}, 
   97869, 
   null, 
   1110850020.0
  ], 
  [
   97880, 
   null, 
   "Sigma", 
   "Jito,\n \nWow. \n \n Will you marry me? :)\n\n \n ;) I'm flattered, but already in a commited relationship\n \n Shaggydoo,\n \nThe unborn child is not 'her body'. The unborn child is combination of genetics from the male recipient and the woman. That unborn child is not in any way 'her body'.\n\n \n I did not say the fetus was her body. I am saying the fetus is using her body. In a sense, the woman is the fetus' body.", 
   {}, 
   97866, 
   null, 
   1110851160.0
  ], 
  [
   97922, 
   null, 
   "Sigma", 
   "I dont like quoting so I will just address them like normal...\n \n Your first point about 80% being done is the first trimester I believe is true (from what I read). Are you saying you only support abortions in the first trimester?\n\n \n No, I support a woman's right to choose as long as the fetus is living off of her body.\n \n \n\n If you don't like the time travel arguement then fine. You might have misread what I wrote too. I said it is a weak arguement for me to say I can speak for someone that I don't know. The point I was making is that you are right, I shouldn't be able to speak for he or she but he/she should speak for its self.\n\n \n It cannot. It cannot choose, it has no concept of choice. In situations such as these, it is right for the mother to make the decision for it.\n \n \n\n I by no means said I am speaking for the best interest of the women. The best interest of the women is selfish and irrelevant.\n\n \n Ah, the cry of the pro-lifer. The woman is being selfish so we disregard her desires. The woman was irresponsible so we'll make the decisions for her. The woman can't make decisions for herself so we'll make them all for her.\n \n \n\n One does not always get to do what is in their best interest. An example would be me killing the guy that I am competing for a job with. It would be in my best interest so I get the job. The point is one have to be fair to both sides, the mother and child.\n\n \n How does that analogy even apply? The other person is not living off of your bodily processes, you have a myriad of choices to be rid of him that do not involve violence against him. In the pregnancy relationship, a woman has one choice to be separated from the fetus.\n \n \n\n you said this \"It is much more than simply a stage of life. I know it helps your points to trivialize the woman's... contribution (to put it very lightly), but I will not accept that her role is unimportant. She is, and will continue to be, of paramount importance in the pregnancy relationship.\"\n \n This does not make sense to me because no where did I try to trivialize the womens role. I just said saying unborn is like saying child or adult...you call it what it is. To call a child a child is not undermining it. I honestly don't know where you might have gotten that conclusion from.\n\n \n You're right, I did say that ;)\n \n When you describe the fetus as at merely another stage of life similar to childhood and adulthood, you are trivializing the woman's rather large role in providing complete and total bodily support during that stage. The focus should not be on the fetus, but on the woman. She is of paramount importance.\n \n \n\n You say the government does not have the right to violate your rights or my rights to save someone else. I am assuming (and please correct me because if I am wrong because I am assuming) that you mean the right of the mother to abort the unborn.\n\n \n No, I mean generally. The gov't does not have the power to force you to donate organs or blood, even to ensure the survival of another. In the same sense, you are right that the gov't also does not have the power to force a woman to donate bodily resources to the fetus.\n \n \n\n If you believe that it is a life then it has rights and thus the government can prevent you from hurting it. It comes down to, is the unborn a life, if yes, then it has rights, guarnteed by our the Constitution (assuming US). No one person has greater rights then the other.\n\n \n You're making that idiotic statement again. It is not guaranteed rights because it is a life. You are only guaranteed rights if you are a citizen. Others are only given rights if there is a big enough outcry for them, but they are not guaranteed. Trust me, the US gov't does not govern its foreign policy with the Constitution.\n \n \n\n I believe you state next that no one has the right to live at anothers expense. I will have to say I disagree with this 100%. Me living creates an expense to many yet I still have a right to live. Just because I happen to be a burden does not mean I don't get to live. A one month old child is a burden or expense on the mother and still cannot be killed.\n\n \n Do you practice being obtuse? None of what you describe are living at the unwilling expense of another's bodily resources.\n \n A one month old child can be put up for adoption, a pregnant woman does not have that option.\n \n \n\n you say I still want to be fair to the fetus even after the women was raped...Yes I do.\n\n \n That's fine, except you are being unfair to the woman. If one has to choose, one should be fair to the woman first.\n \n\n The opposite would imply that it is ok to be unfair to the fetus because of the wrong doing of a man to a women. That doesn't make sense to me. The fetus did nothing wrong, the man did. The man should be punished. Who do I care about? I care about the innocent. In this case, mother and child. The one punished should be the man only. Having the baby is not a punishment to the women.\n\n \n And if you are unfair to the woman to be fair to the \"child\"? Where does that fall, oh moral one? Which is better, being unfair to the woman to be fair the fetus, or being unfair to the fetus to be fair to the woman? You seem to believe the former, but I believe the latter.\n \n \n\n I believe the problem here is that you feel the rights of the women are above the unborn child because child happen to be produced in her.\n\n \n No, I believe that because they are not equals, one necessarily must have superior rights. In the pregnancy relationship, the woman is more important than the fetus.\n \n \n\n This just happens to be how people are created....the women carries the baby and I understand that sometimes she may not want the baby.\n\n \n Er, ok. This does not mean that it cannot be changed.\n \n \n\n But my agruement is that once a life is created no one can take away his or her right to life based on not being wanted or any other reason.\n\n \n Oh? And why is that? No reason, not even to save the woman's life, eh? You obviously have a low view of women, less important than a fetus. You would kill the woman to save the fetus.\n \n \n\n I don't see one life greater than another even if it relies on someone to live.\n\n \n That isn't the argument. One life isn't greater than another (for who determines the value of life?), the woman's rights are greater than the fetus'. In a situation where one has to choose between enforcing the woman's rights or the fetus' rights, the woman's rights should always take precedence because she is the most important participant in the pregnancy relationship.\n \n \n\n For the arguement that the women didnt consent...most cases she does, she consented to sex and therefore created a life and has no right to end that life.\n\n \n What in the world gives you that idea?\n \n \n\n No one has the right to end an innocent life.\n\n \n What in the world gives you that idea?", 
   {
    "unicode_changes_made": true
   }, 
   97823, 
   null, 
   1110856680.0
  ], 
  [
   97947, 
   null, 
   "Steeeeve", 
   "Then what does it matter if 80% of abortions where done in the first trimester\n \n It has no concept of choice huh? Because it can't speak? Because you believe it has no logic? A 1month old can't speak and has no logic either.\n \n Next point...the women made a decision...now she doesn't have the right to make a decision for another.\n \n You have the arguement that if someone is living off of you, then you have the right to kill it. No matter what you say, a conjoined twin is living off of another...should one of them have the right to kill the other?\n \n ohh, so you think the mother is doing the kid a favor by letting him live. Maybe a mom could just stop feeding a kid at one day of age....she doesnt want to do favors anymore. Oh wait, thats child neglect. You live off your mother long past child birth....or i guess you could live off your father. You made the choice to have sex and thus have to deal with the fact that you created a life. You can't say \"oops, didnt mean to create this life we can kill it\" You gave that up when you created it because now that life has rights like I do.\n \n WOmen have supreme rights? Who made that up? Should I read some of the founding documents? ALL MEN ARE CREATED EQUAL....it doesn't say \"all men are created equal but women have more rights while pregnant\"....Since you don't believe it is a life though....we should probably go there....but thats in the other thread i believe.", 
   {}, 
   97922, 
   null, 
   1110858600.0
  ], 
  [
   97958, 
   null, 
   "Cone", 
   "I'm new to the forum... This is my first post.\n \n \nNo one has the right to end an innocent life.\n\n \n to which Siggy Poo answered, \"What in the world gives you that idea?\"\n \n Now, this intrigues me. Siggy, why would you even respond to this statement as you did. You made no point. If you don't agree with a statement somebody makes, the ball is in your court to give a reason for disagreement. Refuting a statment with a question is not a very convincing argumentative strategy. Come on folks, this is a debate, not a childish \"I know you are but what am I\" shouting match.", 
   {
    "post_info": {
     "post_title": "Give me a break"
    }
   }, 
   97823, 
   null, 
   1110859500.0
  ], 
  [
   98056, 
   null, 
   "Sigma", 
   "Then what does it matter if 80% of abortions where done in the first trimester\n\n \n We were speaking of trimesters and feelings and pain. Conciousness does not happen until the 3rd trimester. 95% of abortions happen before that point. I think that is an important fact.\n \n \n\n It has no concept of choice huh? Because it can't speak? Because you believe it has no logic? A 1month old can't speak and has no logic either.\n\n \n \"no logic\"? What point are you making? You are right, a 1 month old cannot choose, either. Guess who chooses for it? The parents :) Not you. Of course that does not extend to killing it, but that is because there are a myriad of different options that a parent has to be rid of a born child. A pregnant woman only has 1 choice.\n \n \n\n Next point...the women made a decision...now she doesn't have the right to make a decision for another.\n\n \n She makes the decision for herself. She decides if her body is involved in the life-support function of pregnancy.\n \n \n\n You have the arguement that if someone is living off of you, then you have the right to kill it. No matter what you say, a conjoined twin is living off of another...should one of them have the right to kill the other?\n\n \n A conjoined twin is much different. They formed at the same time, and one does not \"own\" the body. In the pregnancy relationship the body is distinctly the woman's, and the fetus is living off of it.\n \n \n\n ohh, so you think the mother is doing the kid a favor by letting him live. Maybe a mom could just stop feeding a kid at one day of age....she doesnt want to do favors anymore.\n\n \n I'm at a loss as to what your point with this is.\n \n \n\n Oh wait, thats child neglect. You live off your mother long past child birth....or i guess you could live off your father.\n\n \n Huh?\n \n \n\n You made the choice to have sex and thus have to deal with the fact that you created a life. You can't say \"oops, didnt mean to create this life we can kill it\" You gave that up when you created it because now that life has rights like I do.\n\n \n No, you wish to give it more rights. Currently, I do not have the right to live off of your organs and life processes against your will and without your consent. You wish to give the fetus that right.\n \n \n\n WOmen have supreme rights? Who made that up? Should I read some of the founding documents?\n\n \n When did I say women have supreme rights? Women have the right to bodily integrity, they have the right to not have to share their body. Their right is supreme in that regard I suppose, just like men.\n \n \n\n ALL MEN ARE CREATED EQUAL....it doesn't say \"all men are created equal but women have more rights while pregnant\"....Since you don't believe it is a life though....we should probably go there....but thats in the other thread i believe.\n\n \n And what of yourself? It doesn't say \"all men are created equal but if you're a fetus you get more rights\". Women are asking for equal rights. You are trying to give a fetus more rights than the woman.", 
   {}, 
   97947, 
   null, 
   1110868680.0
  ], 
  [
   98058, 
   null, 
   "Sigma", 
   "I'm new to the forum... This is my first post.\n\n \n Welcome! \n \n I would have suggested a less aggressive first post, but to each their own ;)\n \n \n\n to which Siggy Poo answered,\n\n \n Wow, first post and already you have given me a nickname :D\n \n \n\n \"What in the world gives you that idea?\"\n \n Now, this intrigues me. Siggy, why would you even respond to this statement as you did. You made no point. If you don't agree with a statement somebody makes, the ball is in your court to give a reason for disagreement. Refuting a statment with a question is not a very convincing argumentative strategy. Come on folks, this is a debate, not a childish \"I know you are but what am I\" shouting match.\n\n \n I was inviting him to expand upon his idea in such a way as to make it relevant to the topic. As it was stated, I didn't know where exactly he was connecting what he said to the larger topic. It is akin to saying \"And?\"", 
   {}, 
   97958, 
   null, 
   1110868860.0
  ], 
  [
   98060, 
   null, 
   "Steeeeve", 
   "Equal rights for all. Thats what I said and what I stand behind. The fetus gets no more rights then anyone.\n \n Women has right to life\n Fetus has right to life\n \n everyone has the right to be a burden on someone as long as they dont violate the others rights.\n \n Women has the right to life\n Fetus has the right to life\n \n There is no one getting more rights here. You say women are asking for equal rights...what if the unborn child is a women...this is determined at conception. I guess what you are saying is she wants equal rights too. She has the right to life.\n \n Women has the right to life\n Fetus has the right to life", 
   {}, 
   98056, 
   null, 
   1110869160.0
  ], 
  [
   98062, 
   null, 
   "Steeeeve", 
   "oh, what gave me that idea.....I keep on saying it is our founding documents that say all men are created equal...and then the law that says you can't kill another innocent person.", 
   {}, 
   98060, 
   null, 
   1110869340.0
  ], 
  [
   98066, 
   null, 
   "Sigma", 
   "Equal rights for all. Thats what I said and what I stand behind. The fetus gets no more rights then anyone.\n\n \n I am trying to decide if you are ignoring it or if you just don't get it. A woman does not have the right to live off of another's body against their will. You wish the fetus to have equal rights. Therefore a fetus does not have the right to live of another's body against their will. \n \n Do you get it?\n \n \n\n everyone has the right to be a burden on someone as long as they dont violate the others rights.\n\n \n A fetus is violating the woman's right to her own body. Do you get it?\n \n \n\n There is no one getting more rights here. You say women are asking for equal rights...what if the unborn child is a women...this is determined at conception. I guess what you are saying is she wants equal rights too. She has the right to life.\n\n \n Nobody has the right to live off another's organs and life processes against their will. Not even a fetus has that right. Do you get it?", 
   {}, 
   98060, 
   null, 
   1110869820.0
  ], 
  [
   98067, 
   null, 
   "Sigma", 
   "oh, what gave me that idea.....I keep on saying it is our founding documents that say all men are created equal...and then the law that says you can't kill another innocent person.\n\n \n I'm sorry, where in the law does it say that? Where does it say all men are created equal, and where does it say you can't kill another innocent person?", 
   {}, 
   98062, 
   null, 
   1110869880.0
  ], 
  [
   98071, 
   null, 
   "Steeeeve", 
   "http://criminal.findlaw.com/crimes/a-z/murder_first_degree.html\n \n That just an example of VAs 1st degree murder law.\n \n All men are created equal happens to be in the declaration of Independance....and, as the courts have decided :-/, in the 14th amendment", 
   {}, 
   98067, 
   null, 
   1110870180.0
  ], 
  [
   98077, 
   null, 
   "Steeeeve", 
   "A woman does not have the right to live off of another's body against their will. You wish the fetus to have equal rights. Therefore a fetus does not have the right to live of another's body against their will.\n \n But the fetus does have the right to life.\n \n Hmmm, if we take your right \"one does not have the right to live off another body\" and then take my right \"one has the right to live\" we will have a dilemma between two rights. IF this is where it stands, then I believe the right to life is more important because one can gain back resources taken from them but one cannot regain life.", 
   {}, 
   98071, 
   null, 
   1110870720.0
  ], 
  [
   98079, 
   null, 
   "Sigma", 
   "http://criminal.findlaw.com/crimes/a-z/murder_first_degree.html\n \n That just an example of VAs 1st degree murder law.\n\n \n It mentions nothing of \"innocence\"\n \n \n\n All men are created equal happens to be in the declaration of Independance....and, as the courts have decided :-/, in the 14th amendment\n\n \n I was thinking more along the lines of actual statutes, but that's certainly true ;)\n \n The Due Process Clause of the 14th amendment is one of the major supports of a woman's right to choose.", 
   {}, 
   98071, 
   null, 
   1110870840.0
  ], 
  [
   98081, 
   null, 
   "Sigma", 
   "A woman does not have the right to live off of another's body against their will. You wish the fetus to have equal rights. Therefore a fetus does not have the right to live of another's body against their will.\n \n But the fetus does have the right to life.\n\n \n The fetus does not have the right to live off of another's body without their consent. Nobody has that right.\n \n \n\n Hmmm, if we take your right \"one does not have the right to live off another body\" and then take my right \"one has the right to live\" we will have a dilemma between two rights. IF this is where it stands, then I believe the right to life is more important because one can gain back resources taken from them but one cannot regain life.\n\n \n No, if there is a dilemma between two rights, the woman's rights always take precedence. She is the most important participant in the pregnancy relationship. \n \n You have hit the nail on the head, and are finally getting what I was saying. If the fetus is considered a \"person\", there is a conflict between the woman's right to her body and the fetus' right to her body (for it needs her body to live). If you support the fetus' right to live, you are reducing the woman's rights to be inferior (not equal, as you were fond of claiming) to the fetus' rights. That is absolutely and completely horrible. The woman's rights should always always always be superior in any conflict of rights between herself and what is growing inside her. The fetus is not more important, and she is not just a vessel for the creature inside her. To treat her as inferior, by reducing her rights, is to make her into a second class citizen, a slave to her reproductive organs. That is completely wrong.", 
   {}, 
   98077, 
   null, 
   1110871200.0
  ], 
  [
   98082, 
   null, 
   "Steeeeve", 
   "I am a bit hesitent(sp) to use the 14th amendment because I think everyone gets it wrong...it was written between 2 amendments about slavery and I kind of believe the 14th deals with slavery too....never the less...\n \n I never said innocence but rather innocent.\n \n It doesn't say innocent but implies the same thing...not guilty of breaking any law etc.", 
   {}, 
   98079, 
   null, 
   1110871320.0
  ], 
  [
   98083, 
   null, 
   "Sigma", 
   "I am a bit hesitent(sp) to use the 14th amendment because I think everyone gets it wrong...it was written between 2 amendments about slavery and I kind of believe the 14th deals with slavery too....never the less...\n\n \n Whatever you believe the intent is, it says what it says.\n \n \n\n I never said innocence but rather innocent.\n \n It doesn't say innocent but implies the same thing...not guilty of breaking any law etc.\n\n \n Ah, I see. So the unborn is \"innocent\" only because it has not broken any laws?", 
   {}, 
   98082, 
   null, 
   1110871440.0
  ], 
  [
   98089, 
   null, 
   "Sigma", 
   "So, you're saying it's ok for women to have multiple abortions and violate the right to life of another, while they go on playing around some more irresponsibly?\n\n \n Whoops, sorry, missed this the first time around emoticon_emb \n \n I don't believe I've ever said that abortions were \"ok\" in any case. I believe women should be able to choose for themselves, it isn't your or my business regardless if we agree with it. \n \n The fetus has no right to live off of the woman's organs and life-processes.\n \n \n\n It's not a punishment to make someone responsible for their actions. Isn't that what most parents try to instill in their children, that when they do something wrong they need to accept responsibility.\n\n \n Women are not your children. Women do not need you trying to \"teach them to be responsible\". Mandating pregnancy to \"teach responsibility\" is abusive and immoral, imo, and is denegrating to women in general and mothers in particular.\n \n \n\n These women are not brain dead, they know there's a risk of getting pregnant with unprotected sex.\n\n \n As you know the risk of getting hit by a bus by crossing the street. That does not mean you cannot get medical attention, regardless of whether you \"accepted the possibility\". \n \n \n\n She did have a choice before she got pregnant. The only sick view is a bunch of dead innocent lives thrown in the garbage can.\n\n \n And she has a choice during the pregnancy too.\n \n \n\n Oh, so let's just let women run about being irresponsible, killing innocent lives and do nothing about it. In your dreams.\n\n \n Do you have an argument besides emotional exaggeration?\n \n \n\n I see, so they get to pick and choose which children get to live or die sort of like a smorgasbord. \n\n \n So... you get to choose what every woman has to do regarding their pregnancy sort of like a tyrant?\n \n \n\n My testicles must have been chopped off at birth because I don't really recall having any.\n\n \n Ah! So that's why you're so bitter ;)", 
   {}, 
   97817, 
   null, 
   1110872340.0
  ], 
  [
   98091, 
   null, 
   "Steeeeve", 
   "I guess you could say the unborn is innocent because he/she hasn't broken any laws or enfringed upon any rights guarnteeded by the law.\n \n ...as for the 14th, thats the problem with it, it says what it says but no one believes it. \n \n SECTION. 1. All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.  \n SECTION. 2. Representatives shall be apportioned among the several States according to their respective numbers, counting the whole number of persons in each State, excluding Indians not taxed. But when the right to vote at any election for the choice of electors for President and Vice-President of the United States, Representatives in Congress, the Executive and Judicial officers of a State, or the members of the Legislature thereof, is denied to any of the male inhabitants of such State, being twenty-one years of age, and citizens of the United States, or in any way abridged, except for participation in rebellion, or other crime, the basis of representation therein shall be reduced in the proportion which the number of such male citizens shall bear to the whole number of male citizens twenty-one years of age in such State. \n \n SECTION. 3. No person shall be a Senator or Representative in Congress, or elector of President and Vice-President, or hold any office, civil or military, under the United States, or under any State, who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any State legislature, or as an executive or judicial officer of any State, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof. But Congress may by a vote of two-thirds of each House, remove such disability. \n \n SECTION. 4. The validity of the public debt of the United States, authorized by law, including debts incurred for payment of pensions and bounties for services in suppressing insurrection or rebellion, shall not be questioned. But neither the United States nor any State shall assume or pay any debt or obligation incurred in aid of insurrection or rebellion against the United States, or any claim for the loss or emancipation of any slave; but all such debts, obligations and claims shall be held illegal and void. \n \n SECTION. 5. The Congress shall have the power to enforce, by appropriate legislation, the provisions of this article. \n \n \n Wrote it down for us all.\n \n I bolded the most important part...the Constitution is the highest of laws in the US....it says you get life", 
   {}, 
   98083, 
   null, 
   1110872640.0
  ], 
  [
   98093, 
   null, 
   "Steeeeve", 
   "Sigma...where did that last one come from??? dang....can we say fast typer", 
   {}, 
   98091, 
   null, 
   1110872700.0
  ], 
  [
   98297, 
   null, 
   "Cone", 
   "Welcome! \n \n I would have suggested a less aggressive first post, but to each their own ;)\n\n Well, I've been reading these things for a while, I just decided that I'd like to participate. Hence, I just dove in and went all out.\n \n \nWow, first post and already you have given me a nickname :D\n\n Well Siggy (lol), the tension was getting so thick that you could slice it with a knife. I thought I'd try to soften the mood up.\n \n \nI was inviting him to expand upon his idea in such a way as to make it relevant to the topic. As it was stated, I didn't know where exactly he was connecting what he said to the larger topic. It is akin to saying \"And?\"\n\n Understood. Yet, I think it would be better to simply ask him to clarify his point. That way any confusion would be eliminated.", 
   {
    "post_info": {
     "post_title": "Post #2"
    }
   }, 
   98058, 
   null, 
   1110918180.0
  ], 
  [
   98309, 
   null, 
   "Steeeeve", 
   "I cant wait for sigma to start posting again....she was atleast civil about it. Thanks \"siggy\" :)", 
   {}, 
   98297, 
   null, 
   1110918900.0
  ], 
  [
   98316, 
   null, 
   "Sigma", 
   "I guess you could say the unborn is innocent because he/she hasn't broken any laws or enfringed upon any rights guarnteeded by the law.\n\n \n Ah, but it has. It is infringing upon the woman's right to privacy and her right to her own body.\n \n \n\n ...as for the 14th, thats the problem with it, it says what it says but no one believes it. \n\n \n Not really. What it says can be used for various purposes.\n \n \n\n SECTION. 1. All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.  \n\n \n Meaning that the State cannot violate the woman's liberty in this manner. Beyond the part you bolded, \"No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States\". The woman violated no law by having sex, and being irresponsible is not a crime, there is no cause to reduce, violate or remove her rights. The Supreme Court specifically stated in Roe V Wade that \"person\" in the 14th amendment does not apply to the unborn.\n \n \n\n I bolded the most important part...the Constitution is the highest of laws in the US....it says you get life\n\n \n The Constitution applies to citizens and persons.", 
   {}, 
   98091, 
   null, 
   1110919380.0
  ], 
  [
   98448, 
   null, 
   "Steeeeve", 
   "I don't agree that the 14th amendment can be used for whatever purpose...The purpose of the amendment is clear and that is how it should be used. Courts don't have the right to decide what others might have meant beyond the purpose of the amendment. I don't see where the 14th amendment was trying to say privacy.\n \n \nMeaning that the State cannot violate the woman's liberty in this manner. Beyond the part you bolded, \"No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States\". The woman violated no law by having sex, and being irresponsible is not a crime, there is no cause to reduce, violate or remove her rights. The Supreme Court specifically stated in Roe V Wade that \"person\" in the 14th amendment does not apply to the unborn.\n \n\n \n It doesnt say womens liberty in that matter.\n Privilege is not a right\n I still believe an unborn is a person\n \n beyond that, the 14th amendment seems to be because of the Dred Scott case in many ways. This amendment was written between 2 other slave amendements around the same time...if fact it talks about slavery. While we can continue you debate abortion beyond Roe vs Wade I am waiting for a pro-choicer to stand up and say Roe v Wade didnt use the Constitution correctly.", 
   {}, 
   98316, 
   null, 
   1110934260.0
  ], 
  [
   98471, 
   null, 
   "Sigma", 
   "I don't agree that the 14th amendment can be used for whatever purpose...The purpose of the amendment is clear and that is how it should be used. Courts don't have the right to decide what others might have meant beyond the purpose of the amendment. I don't see where the 14th amendment was trying to say privacy.\n\n \n The Due Process Clause of the Fourteenth Amendment states \"nor shall any State deprive any person of life, liberty, or property, without due process of law . . . \" meaning the gov't has to use sufficiently clear and fair procedures to lawfully take these away. Because a woman has sex is not a sufficient justification to deprive women of their liberty in this matter. \n \n Mr. Justice Harlan once wrote: \"[T]he full scope of the liberty guaranteed by the Due Process Clause cannot be found in or limited by the precise terms of the specific guarantees elsewhere provided in the Constitution. This `liberty' is not a series of isolated points pricked out in terms of the taking of property; the freedom of speech, press, and religion; the right to keep and bear arms; the freedom from unreasonable searches and seizures; and so on. It is a rational continuum which, broadly speaking, includes a freedom from all substantial arbitrary impositions and purposeless restraints . . . and which also recognizes, what a reasonable and sensitive judgment must, that certain interests require particularly careful scrutiny of the state needs asserted to justify their abridgment.\" \n \n Justice Potter Stewart, a judge on the Roe v Wade case said in his concurring opinon: \"Several decisions of this Court make clear that freedom of personal choice in matters of marriage and family life is one of the liberties protected by the Due Process Clause of the Fourteenth Amendment. . . . As recently as last Term, in Eisenstadt v. Baird, 405 U. S. 438, 453, we recognized \"the right of the individual, married or single, to be free from unwarranted governmental intrusion into matters so fundamentally affecting a person as the decision whether to bear or beget a child.\" \" \n \n That right necessarily includes the right of a woman to decide whether or not to terminate her pregnancy.\n \n \n\n It doesnt say womens liberty in that matter.\n Privilege is not a right\n I still believe an unborn is a person\n\n \n False.\n \n \n\n beyond that, the 14th amendment seems to be because of the Dred Scott case in many ways. This amendment was written between 2 other slave amendements around the same time...if fact it talks about slavery. While we can continue you debate abortion beyond Roe vs Wade I am waiting for a pro-choicer to stand up and say Roe v Wade didnt use the Constitution correctly.\n\n \n That will not happen. The Supreme Court is the supreme law of the land. It is their job to interprete what it says. You may have an opinion on if it is correct or incorrect, but they determine the interpretation and constitutionality of the law.", 
   {}, 
   98448, 
   null, 
   1110936360.0
  ], 
  [
   98480, 
   null, 
   "Steeeeve", 
   "False? I dont think so...\n \n A privilege is not a right...??? all those were true\n \n The Supreme Court is the supreme law of the land.\n \n WHOAH....no it is not...the Constitution is.\n \n Harlan making stuff up again...the Halo of the amendments...I believe the amendments were made to do just what they say. There is no hidden meaning behind them that can be applied to something else....An example I heard today was that when women wanted the right to vote they wanted the 19th amendment...they didnt want judges to find it in the constitution because it is not in there (at the time).", 
   {}, 
   98471, 
   null, 
   1110937620.0
  ], 
  [
   98662, 
   null, 
   "Sigma", 
   "False? I dont think so...\n \n A privilege is not a right...??? all those were true\n\n \n \"Privileges and immunities\" refer to our rights.\n \n They were false.\n \n \n\n The Supreme Court is the supreme law of the land.\n \n WHOAH....no it is not...the Constitution is.\n\n \n The judicial system is part of the legal system. The Supreme Court is the last word on any and all legal matters. It is the supreme law of the land.\n \n You're nitpicking.\n \n \n\n Harlan making stuff up again...the Halo of the amendments...I believe the amendments were made to do just what they say.\n\n \n They are doing what they say. No words were changed.\n \n \n\n There is no hidden meaning behind them that can be applied to something else....An example I heard today was that when women wanted the right to vote they wanted the 19th amendment...they didnt want judges to find it in the constitution because it is not in there (at the time).\n\n \n Ok, this applies how to our situation?", 
   {}, 
   98480, 
   null, 
   1110993480.0
  ], 
  [
   98813, 
   null, 
   "Steeeeve", 
   "i dont mean to nitpick Sigma...I am just making it clear the the Supreme court is not the law...Congress makes laws. Supreme court is supposed there for disputes about the law. They, in theory, decide if someone has broken a law or not. \n \n The hidden meanings applies because the right to privacy is no where in the constitution....It was made up by using many amendments which had a \"halo\" that made up the right to privacy. I don't believe the judges have the power to determine what others meant when they created an amendment for example. This article about scalia says what I am trying to say a bit better\n \n http://www.foxnews.com/story/0,2933,150428,00.html\n (its also a topic on this forum)\n \n ALso, I dont believe Privileges and immunities refers to rights because the founders beleive people had rights that no one could touch...the privileges and immunities however says they can be taken away with due process of law", 
   {}, 
   98662, 
   null, 
   1111017600.0
  ], 
  [
   98826, 
   null, 
   "Sigma", 
   "\n i dont mean to nitpick Sigma...I am just making it clear the the Supreme court is not the law...Congress makes laws. Supreme court is supposed there for disputes about the law. They, in theory, decide if someone has broken a law or not. \n\n \n They also strike down laws that they deem are unconstitutional, and they interpret what the law says. They don't exactly determine what the law says, but they do determine what it means. They are the final word on legal matters, the supreme law of the land.\n \n \n\n The hidden meanings applies because the right to privacy is no where in the constitution....It was made up by using many amendments which had a \"halo\" that made up the right to privacy.\n\n \n In a sense. Several parts, taken together, are collectively called \"right to privacy\".\n \n \n\n I don't believe the judges have the power to determine what others meant when they created an amendment for example.\n\n \n That is part of the Supreme Court's job. They interpret what the Constitution means and they have the power to strike down and interpret the laws that Congress makes.\n \n \n\n This article about scalia says what I am trying to say a bit better\n \n http://www.foxnews.com/story/0,2933,150428,00.html\n (its also a topic on this forum)\n\n \n I might follow the link later. If I feel like it.\n \n \n\n ALso, I dont believe Privileges and immunities refers to rights because the founders beleive people had rights that no one could touch...the privileges and immunities however says they can be taken away with due process of law\n\n \n Rights can be taken away with sufficient justification, namely if you break the law. The privileges and immunities were referring to rights.", 
   {
    "unicode_changes_made": true
   }, 
   98813, 
   null, 
   1111021380.0
  ], 
  [
   98885, 
   null, 
   "Steeeeve", 
   "They also strike down laws that they deem are unconstitutional\n \n \n And where is that power in the constitution....oh right, they gave it to themselves.\n \n They also don't have the power to do anything but apply the law to a conflict. as stated in our other discussion. (side note: isnt it weird that sometiems we have the same arguement on two threads but one seems to lag behind the other...so we end up saying the same things to ourselves twice)\n \n \nIn a sense. Several parts, taken together, are collectively called \"right to privacy\".\n \n Where does it say the court can do this?!", 
   {
    "unicode_changes_made": true
   }, 
   98826, 
   null, 
   1111030860.0
  ], 
  [
   98886, 
   null, 
   "Steeeeve", 
   "oh and about the article...you went to it! :)\n \n Fox News is not all that bad hehe...although Linda Vester stinks...and everything from 1-4 on Fox News stinks...and after 10", 
   {}, 
   98885, 
   null, 
   1111030980.0
  ], 
  [
   98945, 
   null, 
   "Sigma", 
   "And where is that power in the constitution....oh right, they gave it to themselves.\n\n \n No, it does not explicitly state this in the Constitution. This was established in 1803 in Marbury v. Madison to strike down laws that exceeded Congress's constitutional powers.\n \n \n\n They also don't have the power to do anything but apply the law to a conflict.\n\n \n They have the power to decide the constitutionality of laws. Congress can make any law they please, but the Supreme Court has the power to decide if they are constitutional.\n \n \n\n as stated in our other discussion. (side note: isnt it weird that sometiems we have the same arguement on two threads but one seems to lag behind the other...so we end up saying the same things to ourselves twice)\n\n \n Not so much. Abortion discussions tend to revolve around a couple points and they get repeated a lot. I see it many times.\n \n \n\n Where does it say the court can do this?!\n\n \n Where does it say they cannot? The only definition given in the Constitution is Article III, where is says \"judicial Power of the United States, shall be vested in one supreme Court, and in such inferior Courts as the Congress may from time to time ordain and establish.\" The Court sets precedents, this was one of them.\n \n \n \noh and about the article...you went to it! :)\n\n \n How did you determine that? What I quoted before was in your summary of the article.", 
   {}, 
   98885, 
   null, 
   1111046340.0
  ], 
  [
   99783, 
   null, 
   "Steeeeve", 
   "well, i still dont see where they get the powers for the court....they have the judicial power...thats it....one power....I defined judicial in another thread I believe. They don't have the power to give themselves powers do they? They also don't have the power to decide extra meanings of laws....like I said before you can't say the law for running stop signs can be applied to running stop lights...one can not say that was the intent of the persons that passed the law for running stop signs.", 
   {}, 
   98945, 
   null, 
   1111287420.0
  ], 
  [
   99841, 
   null, 
   "Sigma", 
   "well, i still dont see where they get the powers for the court....they have the judicial power...thats it....one power....I defined judicial in another thread I believe.\n\n \n And you didn't answer when I asked how that definition applied to the Supreme Court.\n \n Let me try, shall we? I found this definition at dictionary.com:\n \n \"of or relating to a judgment, the function of judging, the administration of justice, or the judiciary \"\n \n In order to judge a case, they have to decide what the Constitution means. In your example of the stoplight/stopsigns, they had a case they needed to judge. Since, according to the mythical constitution that they judge according states that if you run a stopsign you get a ticket, these judges decide that the intent was to stop people from running all manner of intersection signals. They needed to decide what the constitution said about that issue in general to decide a particular case.\n \n \n\n They don't have the power to give themselves powers do they?\n\n \n If it is required to judge a case, then yes they do. You forget, the one power they are given is so vague (basically just go out and administer justice) that they have any power they need in order to carry out that one power. There is nothing limiting their power, so they have any power they desire (within some limits) in order to carry out their Constitutional duty.\n \n \n\n They also don't have the power to decide extra meanings of laws....like I said before you can't say the law for running stop signs can be applied to running stop lights...one can not say that was the intent of the persons that passed the law for running stop signs.\n\n \n That is the Supreme Court's function. How can you possibly say that the Supreme Court is not supposed to interprete the Constitution? You want them to \"go by what it say\" but do you realize there are scholars devoted to interprete shadings of meaning that are in what the Constitution says? Even something as simple as \"the right of every citizen to bare arms shall not be infringed\" is debated about in what each and every word means. The Courts job is to be the ultimate decider in what the Constitution means. That is why they were formed, that is what they do.", 
   {}, 
   99783, 
   null, 
   1111340040.0
  ], 
  [
   99884, 
   null, 
   "Steeeeve", 
   "In order to judge a case, they have to decide what the Constitution means. In your example of the stoplight/stopsigns, they had a case they needed to judge. Since, according to the mythical constitution that they judge according states that if you run a stopsign you get a ticket, these judges decide that the intent was to stop people from running all manner of intersection signals. They needed to decide what the constitution said about that issue in general to decide a particular case\n \n \n No, they can't do that because that is legislating from the bench...they now created a law that says you can't run a stop light and that was not the orginal law. In that case they couldn't do anythign for the person that ran the stop light. Only Congress is allowed to say you can't run a stop light if a law doesn't already exisit saying so. Remember the judges are not elected so for them to do anything more then using the laws on the books would be putting their own beliefs to become law and we are trying to not do that.\n \n \n Oh and the definition is applied to all the courts because that same article in the constitution makes the Supreme Court.", 
   {}, 
   99841, 
   null, 
   1111349100.0
  ], 
  [
   99898, 
   null, 
   "Sigma", 
   "No, they can't do that because that is legislating from the bench...they now created a law that says you can't run a stop light and that was not the orginal law.\n\n \n No, it wouldn't because they created no law. They didn't rewrite what the existing law said, either. They set a precedent on how that law is applied. \n \n \n\n In that case they couldn't do anythign for the person that ran the stop light. Only Congress is allowed to say you can't run a stop light if a law doesn't already exisit saying so.\n\n \n Congress can't say anything. Only judges can. Congress can make whatever law they see fit, but judges are the only ones who apply them.\n \n \n\n Remember the judges are not elected so for them to do anything more then using the laws on the books would be putting their own beliefs to become law and we are trying to not do that.\n\n \n Whether or not judges (any judges) are elected is immaterial to the argument. The act of sitting in judgement requires them to use their own judgement on how the law is supposed to be applied. That requires them to make an interpretation on the law, what the law means.\n \n \n\n Oh and the definition is applied to all the courts because that same article in the constitution makes the Supreme Court.\n\n \n I don't know what you are talking about here. The only passage that refers to the creation of the Supreme Court also gives it one duty. To administer justice. With no limits specified, they have basically whatever power they feel they need to have in order to follow through on that.", 
   {}, 
   99884, 
   null, 
   1111351740.0
  ], 
  [
   99904, 
   null, 
   "Steeeeve", 
   "No, it wouldn't because they created no law. They didn't rewrite what the existing law said, either. They set a precedent on how that law is applied. \n \n \n Once again...you cant rule on a law that does not exist...if it doesnt exist you cant create it to set precedent on how the law is applied. The congress has to make the law saying you cant run a stop light. If a law doesn't say that then the court cant say you can. Judges can't create law at all....thats how we set it up.\n \n ...you say congress can't say anything? Congress makes the laws! Thats what they are there for. Courts are the ones that cant say anything. They just have the ability to look at the law and see if it applies...in the case of thet stop light...no law....person that ran it gets off.", 
   {}, 
   99898, 
   null, 
   1111352820.0
  ], 
  [
   99918, 
   null, 
   "Sigma", 
   "Once again...you cant rule on a law that does not exist...if it doesnt exist you cant create it to set precedent on how the law is applied.\n\n \n They aren't ruling on a law that doesn't exist. In fact, they aren't doing anything because this entire scenario was created in our heads ;)\n \n In our mythical scenario, they aren't creating a law. They are setting a precedent on how an existing law is applied in a similar situation, and as the original laws was intended to apply, to the judges mind.\n \n \n\n The congress has to make the law saying you cant run a stop light. If a law doesn't say that then the court cant say you can. Judges can't create law at all....thats how we set it up.\n\n \n And they still do not create laws. In our scenario, since Congress didn't make a law, judges have to rule based on how they believe the law should be applied. Of course, our specific scenario would never get to court because a police officer couldn't arrest you when there is no law broken.\n \n I think we need a new example. We are getting bogged down and confused because SCOTUS is different than the inferior courts because SCOTUS rules based on the Constitution, not necessarily based on the laws on the books. They judge Constitutionality. Also, the case we've created would never have gone to court, as I noted above.\n \n \n\n ...you say congress can't say anything? Congress makes the laws!\n\n \n Congress has no say in how it's applied. Their power ends with the wording of the law. If they want it applied a certain way, they better damn well put limits and caveats in there, otherwise it will be used in any situation that lawyers and judges can twist the wording to mean.\n \n \n\n Thats what they are there for. Courts are the ones that cant say anything.\n\n \n Incorrect. Taking the case of The Supreme Court, the judges have almost complete discresion in applying the law. Lesser courts have lesser freedom to do so.\n \n \n\n They just have the ability to look at the law and see if it applies...in the case of thet stop light...no law....person that ran it gets off.\n\n \n Well, in the case of the stoplight there was no law to get him to court in the first place. However, if that case were before the Supreme Court and the stopsign law was in the Constitution, the judges there would and should have every right to say \"the intent was to govern intersection traffic so we are applying that here\". This falls well with their one and only duty of \"administering justice\"", 
   {}, 
   99904, 
   null, 
   1111355340.0
  ], 
  [
   99921, 
   null, 
   "Steeeeve", 
   "In our mythical scenario, they aren't creating a law. They are setting a precedent on how an existing law is applied in a similar situation, and as the original laws was intended to apply, to the judges mind.\n \n \n But in setting precedent that created a new law that says you can't run stop lights because now you can't run stop lights while before there was no law. The judge also has power to find intent of the orginal law. The judge did not create it and therefore can't rule on intent. Maybe the ones making the orginal law wanted people to run stop lights...how does the judge know?\n \n We probably should clearify our example....law in the constituition says you cant run stop signs.....no law about stop lights anywhere.....guy runs stop light and hurts person he plows into. Person takes guy to court...lets say Supreme Court for the heck of it.....the Court as this point can only rule based on laws that exist at that point. The judge can see the law about stop signs but cannot infer from that what congress would do in the case of stop lights...he is there to rule on the laws that exist not to create anything new. I will grant that this has not been the practice of the courts lately but many judges such as Scalia are ****** because of it.", 
   {}, 
   99918, 
   null, 
   1111356420.0
  ], 
  [
   99958, 
   null, 
   "Sigma", 
   "But in setting precedent that created a new law that says you can't run stop lights because now you can't run stop lights while before there was no law. The judge also has power to find intent of the orginal law.\n\n \n A precedent is not law. No law is created, no law is rewritten.\n \n \n\n The judge did not create it and therefore can't rule on intent. Maybe the ones making the orginal law wanted people to run stop lights...how does the judge know?\n\n \n I'm very glad you asked that question, steve :D The judge doesn't \"know\", but that is the reason we have judges. Each of us can look at a certain law and say \"this is what it means\" but each of us could have a different interpretation. We empower judges to be the \"standard\" interpretation that everyone goes by. Otherwise, there could be a thousand times a thousand different interpretations of a certain law or a certain passage in the Constitution. Judges exist, partly, to be an impartial and fair interpretation of the law.\n \n You don't know how many constitutional scholars disagree about certain passages and what have you. The Supreme Court can say \"this is what it means\" and have the authority to make it stick.\n \n \n\n We probably should clearify our example....law in the constituition says you cant run stop signs.....no law about stop lights anywhere.....guy runs stop light and hurts person he plows into. Person takes guy to court...lets say Supreme Court for the heck of it.....the Court as this point can only rule based on laws that exist at that point. The judge can see the law about stop signs but cannot infer from that what congress would do in the case of stop lights...he is there to rule on the laws that exist not to create anything new. I will grant that this has not been the practice of the courts lately but many judges such as Scalia are ****** because of it.\n\n \n The Court does not infer what Congress would do. They infer what the Constitution was meant to protect, regardless of what the law says. Congress can go hang for all they can do about it.\n \n Honestly, without the Supreme Court having this power what is to protect us from unconstitutional laws that Congress could pass?", 
   {}, 
   99921, 
   null, 
   1111366560.0
  ], 
  [
   99959, 
   null, 
   "Steeeeve", 
   "A precedent is not law. No law is created, no law is rewritten.\n \n \n its not a \"law\" but it kinda acts like one....on further review on our example, its not a good one to saw what I am trying to say because a stop sign law really has a strong intent and is written for intersection saftey...so thats not a good example...once my left pinky finger heals I will type out another example :)\n \n I jammed it playing football today so typing is hurting like crazy.", 
   {}, 
   99958, 
   null, 
   1111367460.0
  ], 
  [
   102412, 
   null, 
   "Sigma", 
   "its not a \"law\" but it kinda acts like one.\n\n \n So do taboos and customs.", 
   {}, 
   99959, 
   null, 
   1112085780.0
  ], 
  [
   102623, 
   null, 
   "gnojek", 
   "As for the DNA defintion you are going to run into problems, is it Ok to get rid of one identical twin seeing as their DNA is exactly the same? Or chemotherapy, seeing as you will be killing a what you have defined as a new person - something with a new set of human DNA?\n\n Tumors don't have a unique set of DNA.\n They have the same genome as the person they are growing on.\n The only difference is that genes involved in apoptosis are suppressed or mutated (if one mutation creates a new genome in your eyes then maybe it is an entirely new individual to you, but i wouldn't agree since there are mutations and misreads taking place pretty often but they get repaired before they can do much damage).", 
   {}, 
   79397, 
   null, 
   1112142420.0
  ], 
  [
   102625, 
   null, 
   "gnojek", 
   "You claim women were using abortion for b/c. if that were true, most women would have 30 abortions in their reproductive life.\n\n 30 is a pretty steep number, but I knew this one woman who saw abortion as no big deal. I think she had six or something.", 
   {}, 
   86276, 
   null, 
   1112142720.0
  ], 
  [
   102751, 
   null, 
   "Tastyfish", 
   "Tumors don't have a unique set of DNA.\n They have the same genome as the person they are growing on.\n The only difference is that genes involved in apoptosis are suppressed or mutated (if one mutation creates a new genome in your eyes then maybe it is an entirely new individual to you, but i wouldn't agree since there are mutations and misreads taking place pretty often but they get repaired before they can do much damage).\n\n There is generally a lot of mutations, not just one and it does technically code for something other than a person - if you cloned a tumour cell, you would get more tumour cells rather than a copy of the original organism.\n Its not quite the same, but the argument that abortion is wrong because a new set of DNA and therefore a person is made at conception is absurd", 
   {}, 
   102623, 
   null, 
   1112190060.0
  ], 
  [
   102802, 
   null, 
   "Steeeeve", 
   "The arguement for DNA making it a person is not one of my favorites however DNA specialists have concluded that their view is life beings at conception due to DNA...this is just one aspect of the science view on abortion.", 
   {}, 
   102751, 
   null, 
   1112207760.0
  ], 
  [
   102897, 
   null, 
   "gnojek", 
   "There is generally a lot of mutations, not just one and it does technically code for something other than a person - if you cloned a tumour cell, you would get more tumour cells rather than a copy of the original organism.\n Its not quite the same, but the argument that abortion is wrong because a new set of DNA and therefore a person is made at conception is absurd\n\n Well, there's a minimum of one persistent mutation in a tumor suppressing region.\n Usually its in the p53 gene, which regulates apoptosis, but it could be on other genes. \n \n Well, anyway, I can't see how one can make the comparison of a tumor to an embryo. \n \n One is terminated because it threatens the life of a person and the other is terminated for other various reasons, but rarely to save a life.\n \n I'll just say that at conception, a new individual human is formed. I really don't see how there is any question about that. An embryo is a human. The reason I sit on the fence about this issue is that it's such a rudimentary form of human that I don't think you can call it a \"person\" whatever that means. I just don't like the idea of ending the life of an embryo, especially for selfish reasons. \n \n I think it would be interesting if humans laid eggs.\n \n Then, we would be debating whether it was right to scramble them, where is the line where you can scramble them or not, and is it murder to scramble your fertilized eggs. Then there would be a clear visual for everyone (humans always seem to need visual aids). Then, there would be a clear line drawn. While the egg is forming with the zygote inside, a surgery could be performed that aborted the egg formation, but once the egg is laid, I would bet there would be laws to protect it.\n \n Just a thought. :)", 
   {}, 
   102751, 
   null, 
   1112222940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What Happens to the Life Ended by Abortion", 
  "url": "http://www.4forums.com/political/abortion-debates/3811-what-happens-life-ended-abortion.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 3811, 
  "discussion_files": [
   [
    "18091.html", 
    "http://www.4forums.com/political/abortion-debates/3811-what-happens-life-ended-abortion-print.html"
   ], 
   [
    "18092.html", 
    "http://www.4forums.com/political/abortion-debates/3811-what-happens-life-ended-abortion-7-print.html"
   ], 
   [
    "18093.html", 
    "http://www.4forums.com/political/abortion-debates/3811-what-happens-life-ended-abortion-5-print.html"
   ], 
   [
    "18094.html", 
    "http://www.4forums.com/political/abortion-debates/3811-what-happens-life-ended-abortion-4-print.html"
   ], 
   [
    "18095.html", 
    "http://www.4forums.com/political/abortion-debates/3811-what-happens-life-ended-abortion-6-print.html"
   ], 
   [
    "18096.html", 
    "http://www.4forums.com/political/abortion-debates/3811-what-happens-life-ended-abortion-3-print.html"
   ], 
   [
    "18097.html", 
    "http://www.4forums.com/political/abortion-debates/3811-what-happens-life-ended-abortion-2-print.html"
   ]
  ], 
  "identifier": 3811
 }
]