[
 [
  [
   79441, 
   null, 
   "billsco", 
   "I'm not a movie-goer, I haven't seen Oliver Stone's Alexander the Great. But it appears to be creating a new stir about whether Alexander was bi-sexual. This sidebar has been enough to energize some of the Christian community to pan it.\n \n http://news.independent.co.uk/world/americas/story.jsp?story=587778\n \n Have you seen the film? Is the criticism warranted?", 
   {
    "post_info": {
     "post_title": "Alexander the Not Ready for Great America"
    }
   }, 
   null, 
   null, 
   1101757800.0
  ], 
  [
   79467, 
   null, 
   "joebrummer", 
   "I have not seen the film, although I really do want to see it. The reviews have not been good so far. They are critical of the acting, the length of the film which is long for a blockbuster, and the story is sort of blah (not a great script). Even the gay critics aren't giving it much of a review. \n \n I am not sure I think it is the sexuality thing. Too many movies with gay or bi male themes have been successful to blame that. I think it might just be flop of a movie.", 
   {}, 
   79441, 
   null, 
   1101760380.0
  ], 
  [
   79488, 
   null, 
   "Big Orn", 
   "My son said that 12 minutes of it is worth watching.\n \n He said nothing about bisexual content.\n \n But, he's seventeen and a fairly good student - he already knew about boys kissing boys back \"in the day\". Said he wasted his money.\n \n I haven't seen it, but, like you billsco, I'm not much of a movie-goer. Must be a flop as Joe said.", 
   {}, 
   79467, 
   null, 
   1101762300.0
  ], 
  [
   79494, 
   null, 
   "jyoshu", 
   "My son said that 12 minutes of it is worth watching.\n \n He said nothing about bisexual content.\n \n But, he's seventeen and a fairly good student - he already knew about boys kissing boys back \"in the day\". Said he wasted his money.\n \n I haven't seen it, but, like you billsco, I'm not much of a movie-goer. Must be a flop as Joe said.\n\n \n Well, at least it has Angelina Jolie in it. emoticon_xangel", 
   {}, 
   79488, 
   null, 
   1101762540.0
  ], 
  [
   79497, 
   null, 
   "Tastyfish", 
   "From the reviews given on another forum its isn't so bad as long as you can sit though three hours and don't just want to watch endless battlescenes. That and you don't object to an Irish Alex.\n \n As for the 'Christian Comunity' - arn't these the guys who wanted to ban Harry Potter", 
   {}, 
   79488, 
   null, 
   1101762780.0
  ], 
  [
   79503, 
   null, 
   "jitobear", 
   "I'm not a movie-goer, I haven't seen Oliver Stone's Alexander the Great. But it appears to be creating a new stir about whether Alexander was bi-sexual. This sidebar has been enough to energize some of the Christian community to pan it.\n \n http://news.independent.co.uk/world/americas/story.jsp?story=587778\n \n Have you seen the film? Is the criticism warranted?\n\n \n Don't want to see it as I am so sick of epic films. They won't succeed in banning it here - do they forget that the law that protects their Bibles also protects this film\n \n It was custumary Greek/Roman men to have male lovers.", 
   {}, 
   79441, 
   null, 
   1101762960.0
  ], 
  [
   79516, 
   null, 
   "Big Orn", 
   "As for the 'Christian Comunity' - arn't these the guys who wanted to ban Harry Potter\n\n You have, I suppose, that community in quotation marks. I remember this, but I thought it was a Charles Manson type religious group, not Christians.\n \n Is that what you referred to? Like the ones that want to ban Halloween and the like?", 
   {}, 
   79497, 
   null, 
   1101763380.0
  ], 
  [
   79522, 
   null, 
   "Tastyfish", 
   "Yeah, communities of christians are generally nice people. Its just the small, extreme and barely newsworthy 'Christian Community' that kick up a fuss and generally advertise the thing they are protesting about more than if they had kept quiet.", 
   {}, 
   79516, 
   null, 
   1101763560.0
  ], 
  [
   79531, 
   null, 
   "Big Orn", 
   "Yeah, communities of christians are generally nice people. Its just the small, extreme and barely newsworthy 'Christian Community' that kick up a fuss and generally advertise the thing they are protesting about more than if they had kept quiet.\n\n To be honest - and the reason I asked - was because I felt like these were the ones that were responsible for many other subjects/ideas/etc., and use the word \"Christian\" as a front.\n \n They are the ones, IMO, that have shown more hate than love.", 
   {}, 
   79522, 
   null, 
   1101763860.0
  ], 
  [
   79549, 
   null, 
   "jyoshu", 
   "It was custumary Greek/Roman men to have male lovers.\n\n \n Go ahead and tell the whole story: it was customary for them to have male children lovers, as sad as that is. \n \n It was also customary for them to have slaves. Doesn't make it a good thing, culturally.", 
   {}, 
   79503, 
   null, 
   1101764880.0
  ], 
  [
   79568, 
   null, 
   "joebrummer", 
   "Go ahead and tell the whole story: it was customary for them to have male children lovers, as sad as that is. \n \n It was also customary for them to have slaves. Doesn't make it a good thing, culturally.\n\n \n \n It was customary for men to have male lovers, I have not heard that those lovers were children. You are just making a chance to potray all gays as child molesters.", 
   {}, 
   79549, 
   null, 
   1101766800.0
  ], 
  [
   79570, 
   null, 
   "jyoshu", 
   "It was customary for men to have male lovers, I have not heard that those lovers were children. You are just making a chance to potray all gays as child molesters.\n\n \n Read up on your history. And I didn't portray \"all gays\" as child molestors.\n \n You are over-reacting.", 
   {}, 
   79568, 
   null, 
   1101766920.0
  ], 
  [
   79578, 
   null, 
   "JustineCredible", 
   "Well, at least it has Angelina Jolie in it. emoticon_xangel\n\n \n Now there's something we have in common!!! Whew!! emoticon_ic emoticon_xgood", 
   {}, 
   79494, 
   null, 
   1101767880.0
  ], 
  [
   79580, 
   null, 
   "JustineCredible", 
   "Read up on your history. And I didn't portray \"all gays\" as child molestors.\n \n You are over-reacting.\n\n \n What I think you both are missing here is that just because it was customary doesn't mean those who took part in such costum were gay or even bisexual. Just because someone says:\" God bless you\" when someone else sneezes doesn't mean the first person is Christian or even believes in the idea that by sneezing you are releasing your soul. \n It's just a custom.", 
   {}, 
   79570, 
   null, 
   1101768060.0
  ], 
  [
   79601, 
   null, 
   "JakeCJB", 
   "Go ahead and tell the whole story: it was customary for them to have male children lovers, as sad as that is. \n \n It was also customary for them to have slaves. Doesn't make it a good thing, culturally.\n\n \n It was also customary for 12 year old girls to be married to males. No, something being customary does not make it a good thing. However, your point doesn't reflect badly on same-sex relations in general, in the same way that girls marrying guys at age 12, should not reflect badly on all different sex relations.", 
   {}, 
   79549, 
   null, 
   1101771660.0
  ], 
  [
   80872, 
   null, 
   "jitobear", 
   "It's true - it was customary for them to have male lovers, frequently some were boys, and there were slaves and girls were married off young. Not arguing for the good or bad of any of them - just thinking it is silly that people are in a fuss about the fact that Alexander may have been bi or had male lovers. He porbably did - as that was pretty dang common. That's all.", 
   {}, 
   79601, 
   null, 
   1102236720.0
  ], 
  [
   81079, 
   null, 
   "Tastyfish", 
   "However, if you are doing a historical film should you really not be accurate - there's no need to actually show some graphic child rape scene. But I think to completely sanitise a film is equally wrong, at least if you intend for it to be seen as vaguely historical. Making false heros is really not a good idea in my opinion (why I really want to see the new Churchill movie;) )", 
   {}, 
   80872, 
   null, 
   1102369260.0
  ], 
  [
   81086, 
   null, 
   "jyoshu", 
   "However, if you are doing a historical film should you really not be accurate - there's no need to actually show some graphic child rape scene. But I think to completely sanitise a film is equally wrong, at least if you intend for it to be seen as vaguely historical. Making false heros is really not a good idea in my opinion (why I really want to see the new Churchill movie;) )\n\n \n Well, Oliver Stone isn't exactly known for historical accuracy in his films. :)", 
   {}, 
   81079, 
   null, 
   1102370100.0
  ], 
  [
   81108, 
   null, 
   "Anastasia", 
   "Didnt anyone see Caligula?\n Link", 
   {}, 
   81086, 
   null, 
   1102372680.0
  ], 
  [
   81169, 
   null, 
   "pnac=ww3", 
   "Ok, if you learned all the gory details about Alex the Great, you would know that he had a male companion, Hephaestion, that was by his side almost his whole life. They were inseparable and when Heph died, Alexander went into severe depression until he died under a year later. It is generally assumed, based on the culture, that they were lovers of some sort. Alex eventually even had a persian wife and did the harem thing for a while, but Heph was always by his side.\n \n IIRC, there were 2 phases of greek culture where sex was concerned. In the early days, the male form and masculinity were seen as superior or ideal. It was common practice for older men to \"mentor\" pubescent boys in sexual ways. It was seen as healthy. Women were seen mostly as baby factories when it came to sex (at least that's what I recall). From what I understand there was a flourishing dildo \"industry\". Later, the female form was seen to be ideal and beautiful (why the switch? who can say?) \n \n But anyway, this leads me to question how innate are homosexual tendencies? Surely, those that are homosexual in today's American society aren't doing it to fit in. But, back in those days \"everyone was doing it.\" \n So, do the preachers have a point? Can homosexuality be \"learned\" or at least become normal behavior for someone who isn't \"innately\" homosexual?", 
   {}, 
   81108, 
   null, 
   1102382700.0
  ], 
  [
   81176, 
   null, 
   "joebrummer", 
   "Didnt anyone see Caligula?\n Link\n\n \n \n \n The only movie ever to make me sick to my stomach. It was the scene where the guy gets his gut slashed with a sword and the wine came out.........yuck!", 
   {}, 
   81108, 
   null, 
   1102386300.0
  ], 
  [
   81215, 
   null, 
   "jyoshu", 
   "But anyway, this leads me to question how innate are homosexual tendencies? Surely, those that are homosexual in today's American society aren't doing it to fit in. But, back in those days \"everyone was doing it.\" \n So, do the preachers have a point? Can homosexuality be \"learned\" or at least become normal behavior for someone who isn't \"innately\" homosexual?\n\n \n Well, I seriously doubt it was the \"fad\" to have homosexual sex, as you seem to be implying. There is no reason to think that it would have been any easier to deny one's natural attractions back then as it is now.\n \n More likely, some peoples' modern view of rampant homosexuality in ancient greek culture is an exagerration of the way it really was.", 
   {}, 
   81169, 
   null, 
   1102392900.0
  ], 
  [
   81225, 
   null, 
   "Tastyfish", 
   "But anyway, this leads me to question how innate are homosexual tendencies? Surely, those that are homosexual in today's American society aren't doing it to fit in. But, back in those days \"everyone was doing it.\" \n So, do the preachers have a point? Can homosexuality be \"learned\" or at least become normal behavior for someone who isn't \"innately\" homosexual?\n\n \n Think this is the point, unless you are gay, where is the attraction in gay sex? Or do you believe that everyone feels the urge for man-love but resists it in the form of being repulsed? Can't see any way round this that doesn't have homosexuality as being a natural choice for an individual...in which case, isn't it wrong to stack the odds against an individual getting into heaven. not only must they obey rules like everynoe else but must deny the natures God gave them?", 
   {}, 
   81169, 
   null, 
   1102396800.0
  ], 
  [
   81242, 
   null, 
   "BobNelson2", 
   "More likely, some peoples' modern view of rampant homosexuality in ancient greek culture is an exagerration of the way it really was.\n\n \n Geez. Why does EVERY SINGLE GAY-POSITIVE ASPECT OF HISTORY HAVE TO BE A LIE or an exagerration?\n \n Male/male bonding was the IDEAL of Greek culture. Not some little aspect that's been blown out of proportion. THE IDEAL. \n \n Now, that doesn't mean that sex HAD to be a part of EVERY mentoring relationship. I imagine some men, 100% heterosexual, just had no interest in bedding a young man and may have just skipped that part. But the relationships were important. Men mentored the sons of their best friends, etc. We may not see this as a positive relationship (well, you obviously don't), but the Greeks DID.\n \n Furthermore, in societies in which men's access to women is very restricted, most bisexual men and quite a few heterosexuals find sex with men to be a reasonable substitute, at least until they marry. This happens in the Middle East today. It happens in Turkey. It happens in American prisons today. \n \n These are all cultures were homosexuality is frowned on. Imagine how much more it might happen if it were preferred or even \"required\". \n \n That said, it doesn't mean that many of the men and young men were gay. The gay ones were the ones that didn't end their relationships when the young man reached cultural manhood (late teens, 20s). The gay ones were the \"odd ducks\" who maintained relationships for life. Or those who found lover with men their own age. I suspect people joked and whispered about them, but since their behavior wasn't THAT dissimilar from the norm, they were able to live as they wanted with far fewer problems than gay people face today (though many probably also took wives to fulfill their obligations to produce heirs). \n \n Just my take on it.", 
   {}, 
   81215, 
   null, 
   1102412940.0
  ], 
  [
   81250, 
   null, 
   "jyoshu", 
   "Geez. Why does EVERY SINGLE GAY-POSITIVE ASPECT OF HISTORY HAVE TO BE A LIE or an exagerration?\n\n \n I don't know, you tell me. We don't really know that much about the \"male/male bonding\" in Alexander's time, or the stats on how many men had male partners. Why would we portray as truth what we really don't know much about in the first place? Why would some people be so eager to read homosexuality into historical friendships at times?\n \n Why would a man back then be any more prone to act against his natural attractions than he is now? If our culture suddenly stopped looking down on homosexual relationships, do you honestly think men would suddenly find sex outside their orientation much more palatable? Do you really think that a more \"tolerant\" culture would compel a man to go against his orientation?", 
   {}, 
   81242, 
   null, 
   1102434780.0
  ], 
  [
   81396, 
   null, 
   "pnac=ww3", 
   "Well, I seriously doubt it was the \"fad\" to have homosexual sex, as you seem to be implying. There is no reason to think that it would have been any easier to deny one's natural attractions back then as it is now.\n \n More likely, some peoples' modern view of rampant homosexuality in ancient greek culture is an exagerration of the way it really was.\n\n \n I never said it was a fad. I was talking about a cultural practice that went on for hundreds of years.\n \n No, it's not an exaggeration. It was very very common. They get this from history. Reading ancient texts and looking at urns and paintings and such. Maybe even doing a little bit of archeology-anthropology to figure out how people lived.\n \n No one was denying their sexual attractions. I didn't mean that the boys and men had to be sexually attracted to one another. This isn't necessary. It was more about the mentoring aspect than anything. But, if something is customary, people are more likely to do it.\n \n \nThink this is the point, unless you are gay, where is the attraction in gay sex? Or do you believe that everyone feels the urge for man-love but resists it in the form of being repulsed? Can't see any way round this that doesn't have homosexuality as being a natural choice for an individual...in which case, isn't it wrong to stack the odds against an individual getting into heaven. not only must they obey rules like everynoe else but must deny the natures God gave them?\n\n Sexual attraction is not necessary. If the practice was quite customary, then there would be less (if any) repulsion to it. \n \n Don't know where you're going with the god stuff.", 
   {}, 
   81225, 
   null, 
   1102466160.0
  ], 
  [
   81397, 
   null, 
   "pnac=ww3", 
   "I don't know, you tell me. We don't really know that much about the \"male/male bonding\" in Alexander's time,\n\n Not true, unless we are to no longer trust history.\n \n \nWhy would some people be so eager to read homosexuality into historical friendships at times?\n\n If the friendship were in Judea or Persia at the time, then no one would think there may have been a sexual relationship, but the friendship was in Greece, where, as we keep saying over and over, it is well known that the culture emphasized male homosexuality.\n \n \nWhy would a man back then be any more prone to act against his natural attractions than he is now? If our culture suddenly stopped looking down on homosexual relationships, do you honestly think men would suddenly find sex outside their orientation much more palatable?\n\n Excellent point. Look back 50 years. How many straight women were french kissing each other on the dance floor? Somehow our culture has made it more acceptable for them to do this and bam, more of it is done. Some girls I have known told me that they only did it because it was \"cool\" or to impress guys. Social pressures can go a long way. Does this mean that these girls are gay? Nah. But they are still doing \"homosexual\" acts.\n \n \nDo you really think that a more \"tolerant\" culture would compel a man to go against his orientation?\n\n We are becoming more and more tolerant of female/female \"homosexuality\" all the time. (really, it's bisexuality, cuz the guys want to be turned on by it but not left out)", 
   {}, 
   81250, 
   null, 
   1102466640.0
  ], 
  [
   81468, 
   null, 
   "Tastyfish", 
   "\n Sexual attraction is not necessary. If the practice was quite customary, then there would be less (if any) repulsion to it. \n \n Don't know where you're going with the god stuff.\n\n Sexual attration would be needed for a society to attain the majority, at least at first. To actually b gay with the modern point of view I can't see how it can work without sexual attraction. God stuff id hypotheictal considering that homosexuality is both a sin an innate\n \n As for french kissing girls - ask yourself how much is to do with the modern porn showing girl on girl as acceptable and sexy rather than association with lesbianism. Kissing other girls gets male attention", 
   {}, 
   81396, 
   null, 
   1102488840.0
  ], 
  [
   81474, 
   null, 
   "jyoshu", 
   "Excellent point. Look back 50 years. How many straight women were french kissing each other on the dance floor? Somehow our culture has made it more acceptable for them to do this and bam, more of it is done. Some girls I have known told me that they only did it because it was \"cool\" or to impress guys. Social pressures can go a long way. Does this mean that these girls are gay? Nah. But they are still doing \"homosexual\" acts.\n \n \n We are becoming more and more tolerant of female/female \"homosexuality\" all the time. (really, it's bisexuality, cuz the guys want to be turned on by it but not left out)\n\n \n And therein lies the difference--with the current \"fad\" of girls frenchkissing, it's only done out of a desire among girls to look sexy, or at least conform to standards of \"sexyness.\" But what you all are basically claiming in the case of history is that men were having sex with men a lot. It's still hardly convincing that men are going to have sex with men so readily, going against their 'orientation.' There would have been no social reason for doing it. In other words, there is no compelling reason why a society would find homosexual activity so 'desirable.' At least in our society we can point to mens' attraction to women as a reason for teen girls 'grinding' each other or frenchkissing. But that just isn't there when it comes to a male/male sex.\n \n By the way, your argument that homosexual \"acts\" may get popular in culture sounds a lot like the arguments that fundies make, only for other motivations. What you claim is exactly what they fear, and your movement has gone to great pains to imply that this won't happen. Therefore you are, in effect, contradicting your own movement's claims that people won't be persuaded by homosexuality to do homosexual things.", 
   {}, 
   81397, 
   null, 
   1102489920.0
  ], 
  [
   81706, 
   null, 
   "BobNelson2", 
   "I don't know, you tell me. We don't really know that much about the \"male/male bonding\" in Alexander's time, or the stats on how many men had male partners. Why would we portray as truth what we really don't know much about in the first place? Why would some people be so eager to read homosexuality into historical friendships at times?\n\n \n Why are you so obsessed with disbelieving the possiblity? Do you really think that the biggest problem with our view of history is that gay people point out that homosexuality was acceptable in some cultures? Can you not see the systematic elimination of anything gay that has gone on for centuries in the history of the Christian West? Gay people and gay history have been obliterated over and over again.\n \n \nWhy would a man back then be any more prone to act against his natural attractions than he is now? If our culture suddenly stopped looking down on homosexual relationships, do you honestly think men would suddenly find sex outside their orientation much more palatable? Do you really think that a more \"tolerant\" culture would compel a man to go against his orientation?\n\n \n I think several things would happen. Gay people would stop hiding. This change alone would probably stun you. A lot more bisexual people would pursue same-sex relationships -- currently, most lean towards opposite-sex relationships, especially in their life partnerships. \n \n As for heterosexual people. Most -- perhaps almost all -- would continue to pursue opposite-sex relationships. Some might be more likely to \"experiment\" but the dyed in the wool straights wouldn't because in our society opposite-sex outlets are readily available. We would never return to the situation that faced young heterosexual males in ancient Greece, because we don't lock up our women. Same-sex experiences would increase in those parts of our culture where one gender is excluded: boarding schools, frats, sororities, prisons, Elks Clubs, etc.\n \n If you consider surveys of sexuality, maybe 5-10% are gay or mostly gay. Another 25-40% are bisexual. If there were absolutely no stigma and, conversely, no preference for homo- or heterosexuality, the gay people would have same-sex experiences and pick a same-sex partner. Among the bisexuals, most would have both same- and opposite-sex experiences but would pick a partner of the same-sex or the opposite sex, probably in roughly even proportions. Most heterosexuals would not have same-sex experiences, but some would (certainly more than today) out of situational horniness or just plain curiosity. Almost all would pick opposite-sex life partners.\n \n Is that so hard to grasp?", 
   {}, 
   81250, 
   null, 
   1102559760.0
  ], 
  [
   81764, 
   null, 
   "jyoshu", 
   "Why are you so obsessed with disbelieving the possiblity? Do you really think that the biggest problem with our view of history is that gay people point out that homosexuality was acceptable in some cultures? Can you not see the systematic elimination of anything gay that has gone on for centuries in the history of the Christian West? Gay people and gay history have been obliterated over and over again.\n\n \n You're having trouble staying with the topic. I'm not \"obsessed\" with believing or disbelieving anything. And we aren't talking about obliteration of gay people.\n \n \nI think several things would happen. Gay people would stop hiding. This change alone would probably stun you.\n\n \n What does the matter of 'what stuns me' have to do with this discussion? Is this the best you can do? You haven't posted here that much yet--you'll find that people will respond to you a lot better if you'll just discuss things straight up related to the topic rather than keep making irrelevant (to the thread) and erroneous assumptions and accusations about them.\n \n \nA lot more bisexual people would pursue same-sex relationships -- currently, most lean towards opposite-sex relationships, especially in their life partnerships. \n\n \n It's possible, although we have no way of knowing they would do this.\n \n \nAs for heterosexual people. Most -- perhaps almost all -- would continue to pursue opposite-sex relationships.\n\n \n I'll take that as a \"yes, I agree with you, hetersexuals would probably not act against their orientation\" (which is all I was saying). Not sure why you took such a hard road on this.\n \n \nIf you consider surveys of sexuality, maybe 5-10% are gay or mostly gay. Another 25-40% are bisexual. If there were absolutely no stigma and, conversely, no preference for homo- or heterosexuality, the gay people would have same-sex experiences and pick a same-sex partner.\n\n \n Maybe--other surveys show 3% gay and lower on the bi issue as well. Who knows? It really doesn't matter that much. But part of that \"preference\" issue (as you say) is tied to orientation. The point is that people aren't likely to act against their orientation if they are wired a certain way, now OR in ancient Greece. I'm not sure why you are having such a hard time agreeing with that.", 
   {}, 
   81706, 
   null, 
   1102607940.0
  ], 
  [
   82158, 
   null, 
   "BobNelson2", 
   "You're having trouble staying with the topic. \n\n \n The only hard time I'm having is getting you to see that what I've said is in response to:\n \n <<More likely, some peoples' modern view of rampant homosexuality in ancient greek culture is an exagerration of the way it really was.<<\n \n What does \"rampant\" mean to you? Was being part and parcel of a society ideal \"rampant\" enough that modern people can view it as something other than an exagerration?", 
   {}, 
   81764, 
   null, 
   1102735080.0
  ], 
  [
   82162, 
   null, 
   "pnac=ww3", 
   "As for french kissing girls - ask yourself how much is to do with the modern porn showing girl on girl as acceptable and sexy rather than association with lesbianism. Kissing other girls gets male attention\n\n That was my point. They are not lesbians. They are doing it because of social pressures. The same is being said about boys and men in ancient greece.\n \n \nAnd therein lies the difference--with the current \"fad\" of girls frenchkissing, it's only done out of a desire among girls to look sexy, or at least conform to standards of \"sexyness.\" \n\n It may be a fad, or a sign of a lasting culture change. We have to wait and see.\n \n \nBut what you all are basically claiming in the case of history is that men were having sex with men a lot. It's still hardly convincing that men are going to have sex with men so readily, going against their 'orientation.' There would have been no social reason for doing it. In other words, there is no compelling reason why a society would find homosexual activity so 'desirable.' \n\n So say you. If a boy grows up all his life seeing a certain behavior being practiced in his society then he won't think too much of doing it himself. It probably wouldn't be as naturally repellent as you may think.\n \n \nAt least in our society we can point to mens' attraction to women as a reason for teen girls 'grinding' each other or frenchkissing. But that just isn't there when it comes to a male/male sex.\n\n Well, it's the attention that these girls are after. So are they disgusted by doing it? They usually end up either liking it or becoming indifferent towards it. The social pressure was there, they did something considered 'homosexual' and they weren't repulsed by it.\n \n \nBy the way, your argument that homosexual \"acts\" may get popular in culture sounds a lot like the arguments that fundies make, only for other motivations. What you claim is exactly what they fear, and your movement has gone to great pains to imply that this won't happen. Therefore you are, in effect, contradicting your own movement's claims that people won't be persuaded by homosexuality to do homosexual things.\n\n What movement? I have no idea what you are talking about.\n And so what if the fundies are scared of homosexuality? It's probably just because it doesn't disgust them as much as they think it should. Personally, I wouldn't care if both men and women became more \"open\" (if you will). I probably wouldn't do it, but what do I know, we all succumb to peer pressure at one time or another. I'm that kind of person that wouldn't care if 2 men were humping on the street corner (as long as they kept it to themselves). \n \n But here is some quick google action:\n http://www.bigeye.com/sexeducation/ancientgreece.html\n \nMale Homosexuality\n \n Even though male homosexuality was common in Ancient Greece, it was censored in their artwork to an\n extent. In literature, it is called \"love of a man for a man.\" In paintings, the homosexual men are\n depicted clothed together, except for homosexual prostitutes who are depicted naked.\n \n When homosexual men wrote about their love for other men the most loved boys were usually age 12-14.\n Some homosexual men wouldn't even try to have sex with a boy over the age of 17.\n\n \n http://ancienthistory.about.com/library/weekly/aa072099.htm\n \nThere is in fact evidence that romantic eros was seen as homosexual all over Greece. Sparta, even with its relatively free women, had homosexual relationships built into the structure of the training all young Spartan men received. In other Dorian areas also homosexuality was widely accepted. Thebes saw in the 4th century the creation of a battalion of homosexual lovers - the Sacred Band. In Crete we have evidence of ritualised abduction of younger by older men.\n\n this is funny:\n \n In Plato's Symposium (a treatise on Athenian eroticism) Aristophanes offers a colorful explanation for why all these sexual options existed. In the beginning there were three types of double-headed humans, varying according to sex: male/male, female/female, and male/female. Zeus, angered at the humans, punished them by splitting them in half. From then on, each half has forever sought out his other half.\n\n \n http://www.suphawut.com/gvb/gayly/gay_history2.htm\n \nAncient Greece has long been portrayed as a homosexual paradise for today's modern gays and lesbians. The most famous historic gay culture, Greek society normalized same-sex love among its male and female members. Homosexual relations were believed to be above the lower classes, reserved for the middle class and aristocracy. Although that piece of culture has since seen its demise, ancient Greek culture honored gay relations as a flourishing empire, a period when Lambda warriors, an army of homosexual male soldiers, successfully conquered neighboring lands. Many of the Greek gods and goddesses worshiped during that time embodied homosexual tendencies, such as Zeus with Ganymede and Apollo with his numerous male lovers. Lesbians of that era included the goddesses Diana and Camilla, and Sappho, a renowned poet living on the island of Lesbos. Transgendered beings also were represented during this period of Greek history: \"...a bearded Venus was worshiped by male and female transvestites.\" Other rulers adopted transgendered personas, usually for reasons of power associated with the assumed gender.\n", 
   {}, 
   81468, 
   null, 
   1102737000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Alexander the Not Ready for Great America", 
  "url": "http://www.4forums.com/political/gay-rights-debates/3816-alexander-not-ready-great-america.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 3816, 
  "discussion_files": [
   [
    "8213.html", 
    "http://www.4forums.com/political/gay-rights-debates/3816-alexander-not-ready-great-america-print.html"
   ], 
   [
    "8214.html", 
    "http://www.4forums.com/political/gay-rights-debates/3816-alexander-not-ready-great-america-3-print.html"
   ], 
   [
    "8215.html", 
    "http://www.4forums.com/political/gay-rights-debates/3816-alexander-not-ready-great-america-2-print.html"
   ]
  ], 
  "identifier": 3816
 }
]