[
 [
  [
   79451, 
   null, 
   "jyoshu", 
   "It seems that homophobia can mean many different things, depending on who you talk to. One person may call someone a homophobe if they simply have an aversion to seeing gay people on TV. Another may reserve the term for someone who resorts to violence against gay people. Another may completely misuse it, and assume someone spoke from a homophobic standpoint when they in fact didn't.\n \n The dictionary defines it as:\n \n Fear of or contempt for lesbians and gay men. \n Behavior based on such a feeling. \n \n Bu even that is quite vague. For such an often-used word, it is terribly undefined and used too broadly, thrown around too much\n \n So what constitutes homophobia to you? Care to take weigh in?", 
   {
    "post_info": {
     "post_title": "What is homophobia to you?"
    }
   }, 
   null, 
   null, 
   1101758940.0
  ], 
  [
   79457, 
   null, 
   "joebrummer", 
   "It seems that homophobia can mean many different things, depending on who you talk to. One person may call someone a homophobe if they simply have an aversion to seeing gay people on TV. Another may reserve the term for someone who resorts to violence against gay people. Another may completely misuse it, and assume someone spoke from a homophobic standpoint when they in fact didn't.\n \n The dictionary defines it as:\n \n Fear of or contempt for lesbians and gay men. \n Behavior based on such a feeling. \n \n Bu even that is quite vague. For such an often-used word, it is terribly undefined and used too broadly, thrown around too much\n \n So what constitutes homophobia to you? Care to take weigh in?\n\n \n Phobias are \"irrational fears\". If you object to seeing gays on TV, you must have a reason for it. Is that reason rational or irrational? It is about having all the facts. In the mental health world, fears and phobias are treated with little by little exposure to that with what someone is afraid.\n \n Say you have a fear of elevators. The fear is irrational. Start with baby steps. Stand in the elevqator with the door open. Next time stand in the elevator wand let the doors close briefly. etc...etc... \n \n Homophobia...same thing.", 
   {}, 
   79451, 
   null, 
   1101759480.0
  ], 
  [
   79484, 
   null, 
   "Tastyfish", 
   "Probably go for the most common which would be the irrational comtempt or dislike type of phobia in this case, 'fear' I associate too strongly with fearing things - big difference between arachnophobia and a homophobia even though they share the same phobia bit.\n \n I hate 'camp', I find it extremely annoying and don't generally like the people who behave like that - but then excessively girly girls are just as annoying (pretty much the same thing). However I really couldn't careless whether someone was gay or not and have friends who are. Suppose thats what would be close to a rational dislike/contempt as I can think of form my point of view but wouldn't class it as homophobia.", 
   {}, 
   79457, 
   null, 
   1101762060.0
  ], 
  [
   79509, 
   null, 
   "emclean", 
   "homophobia the stick that over vocal activests use to beat over the head of anyone who thinks the gay life is wrong due to religen. this may be harsh, but i am tired of hearing it about my wife.", 
   {}, 
   79484, 
   null, 
   1101763200.0
  ], 
  [
   79512, 
   null, 
   "Tastyfish", 
   "This may be harsh, but perhaps she shouldn't go telling people that she thinks it's wrong due to her religion? Especially if she isn't expecting them to reply anyway.", 
   {}, 
   79509, 
   null, 
   1101763320.0
  ], 
  [
   79519, 
   null, 
   "emclean", 
   "is it ok to answer there questions honistly?", 
   {}, 
   79512, 
   null, 
   1101763500.0
  ], 
  [
   79523, 
   null, 
   "JustineCredible", 
   "I try to stay away from the word. It is very vague.\n I tend to use the term \"heteroist\" for those who show contempt or dislike for gays and gay behavior over hetero behavior. \n Whether religiously based or not, a person or group of people who work to deny gays/lesbians civil rights and protections. Personally I feel religious conviction is a convenient excuse for many. Because many relgions protest homosexual behavior, it's easier to simply jump on that bandwagon than to come up with a well thought out or even well informed reason.", 
   {}, 
   79509, 
   null, 
   1101763560.0
  ], 
  [
   79526, 
   null, 
   "sinjin", 
   "is it ok to answer there questions honistly?\n\n \n Depends what you mean by OK. It's OK to be an XXX but I wouldn't recommend it.", 
   {}, 
   79519, 
   null, 
   1101763680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is homophobia to you?", 
  "url": "http://www.4forums.com/political/gay-rights-debates/3817-what-homophobia-you.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 3817, 
  "discussion_files": [
   [
    "28888.html", 
    "http://www.4forums.com/political/gay-rights-debates/3817-what-homophobia-you-print.html"
   ]
  ], 
  "identifier": 3817
 }
]