[
 [
  [
   4597, 
   null, 
   "JFriday", 
   "Seeing the Smart families miracle reunion has brought this question to my mind.", 
   {
    "post_info": {
     "post_title": "What do you think the penalty for child molesters should be?"
    }
   }, 
   null, 
   null, 
   1047578460.0
  ], 
  [
   4600, 
   null, 
   "Debater", 
   "I think death would be considered \"cruel and unusual punishment\" especially the torture death.\n \n And \"cruel and unusual punishement\" is prohibited by the Consitution.", 
   {}, 
   4597, 
   null, 
   1047582960.0
  ], 
  [
   4603, 
   null, 
   "JFriday", 
   "I say no penalty can be rulled out for these monsters. They should all be destroyed to protect children. Well there are some exceptions, a friend of mines older brother is being charged with carnal knowlege, he is 19 and she is 17 they have been dating since he was a sophmore in high school, but that does not cover a 35 year old man and an 11 year old girl, that is just sick, and he should die.\n \n What do yall think of that.\n yes I am from the south where we say yall.", 
   {}, 
   4597, 
   null, 
   1047593820.0
  ], 
  [
   4612, 
   null, 
   "Debater", 
   "Life is of infinate worth, molesting is horrible, but let's be reasonable. It's not murder.", 
   {}, 
   4597, 
   null, 
   1047599940.0
  ], 
  [
   4776, 
   null, 
   "JFriday", 
   "I wonder what would be worse, life as a prison B*tch or death by torture. Heh, if life as a prison B*tch is worse then I say that would be good.\n \n And alot of people agree with you that it is not murder so they dont deserve to die, until it happens to someone they love. I say send em to hell.", 
   {}, 
   4597, 
   null, 
   1047682080.0
  ], 
  [
   4779, 
   null, 
   "Debater", 
   "yeah, but when it happens to a relative the person is angery and frustrated and not thinking right.", 
   {}, 
   4597, 
   null, 
   1047685260.0
  ], 
  [
   4796, 
   null, 
   "JFriday", 
   "Perhaps we are not the ones thinking right when we fail to put ourselves in their(the families) shoes. I remember hearing about a guy who molested a young boy, and the boys dad shot him in the head at an airport, the father was found to be \"temporarily insane\" so legally you are right when saying that they are not thinking clearly. So that leaves a comfortable loophole for retibution. emoticon_xkill- - - - - - - - - - - - - (Child molesters)", 
   {}, 
   4597, 
   null, 
   1047691200.0
  ], 
  [
   4814, 
   null, 
   "Stormin Norman", 
   "The death penalty should be applied to people who molest children.", 
   {}, 
   4597, 
   null, 
   1047715680.0
  ], 
  [
   4826, 
   null, 
   "Debater", 
   "Why death? I'd like to hear an explaination.", 
   {}, 
   4597, 
   null, 
   1047749640.0
  ], 
  [
   4917, 
   null, 
   "gilligan8503", 
   "i don't believe the death penalty should be used in ANY case. why take more life when it isn't necissary?\n \n the prison b*tch theory... yes... do you know what inmates do to convicted child molestors? they treat those worst of all. there is \"justice\" inside the prison bars.\n \n how about we send them back to austallia and let them duke it out? (joke)", 
   {}, 
   4597, 
   null, 
   1047865500.0
  ], 
  [
   4956, 
   null, 
   "Debater", 
   "Yeah that sound like a cool idea emoticon_rolleyes", 
   {}, 
   4597, 
   null, 
   1047927420.0
  ], 
  [
   5204, 
   null, 
   "JFriday", 
   "And why should the death penalty not be used? I dont think any punishment, no matter how severe, can be ruled out for a hard core child molester. There has never been a pedophile cured except through castrastion or death. Unfortunately the castration option is only volutary and thus has been used very little. Study after study shows that pedophiles are a danger to children after they get out of prison, why endanger children any more? Why bother with a sickos rights when he likes to violate kids? This is insane, they have no rights, certainly not the right to live after they have commited such an attrocity. That is the bottom line, I say to hell with them.", 
   {}, 
   4597, 
   null, 
   1048179960.0
  ], 
  [
   5221, 
   null, 
   "Tim", 
   "In the past, some people have been falsely accused and convicted of being child molestors. There is always the possiblity that the death penalty might be used to take the life of an innocent person. I would say that life without parole is best. That way they can never harm a child again. \n \n Men raping other men is very common in prison, so a child molester might get some of his own medicine.", 
   {}, 
   4597, 
   null, 
   1048188240.0
  ], 
  [
   5296, 
   null, 
   "JFriday", 
   "Uuuck! \n \n You see that is disgusting, there might be little kids on this site(hope not but think so from some of the post).\n \n I say when there is irrefutable evidence( like DNA) then the death penalty cannot be rulled out.", 
   {}, 
   4597, 
   null, 
   1048264560.0
  ], 
  [
   5298, 
   null, 
   "Debater", 
   "Why death for them? They never murdered someone. Wouldn't you say that under this case using the death penalty would be revenge and not justice?", 
   {}, 
   4597, 
   null, 
   1048269360.0
  ], 
  [
   5301, 
   null, 
   "JFriday", 
   "Nope. The reason is, is that there is no cure except death or castration for these sickos. It is irrelevant rather it is revenge or justice, it is the best solution. And I say we should have more cost effective executions. Like the gas chamber is a good one, just not one at a time, why not gas 10 at a time? Why spend all of that money on them for just one execution?", 
   {}, 
   4597, 
   null, 
   1048280100.0
  ], 
  [
   5381, 
   null, 
   "voiceofreason", 
   "Killing is evil even if you kill a murderer or child molestor. Two wrongs don't make a right. Look at other nations that don't have the death penalty. They have lower crime rates than the US. \n Every criminal can be rehabilitated. We should focus on rehabilitating criminals. It might take many years and a lot of tax money to rehabilitate a criminal, but that's the price we have to pay to live in a civilized society. The death penalty is a sign of a barbaric society and most modern western nations have abadoned it. I'm interested in doing what's best for America.\n \n -Voice of Reason", 
   {}, 
   4597, 
   null, 
   1048383300.0
  ], 
  [
   5385, 
   null, 
   "sarablaze", 
   "You remember what happened to Jeffery Dahmer, right? Well I say toss em'in for life, and lets see how long he lasts....... people in prison have a passionate hate for child molesters. So I've heard from a few good sources.", 
   {}, 
   4597, 
   null, 
   1048385640.0
  ], 
  [
   5431, 
   null, 
   "JFriday", 
   "Voice of Reason, please name one rehabilitated child molester. I have never heard of one. And what countries do you speak of, We are not even in the top ten anymore for crime except for burglary in which we are nuber 8.\n \n And as for Jeffery Dahmer (spell?) I think it was hilarious that he got killed.", 
   {}, 
   4597, 
   null, 
   1048485960.0
  ], 
  [
   5483, 
   null, 
   "voiceofreason", 
   "In Europe they choose to rehabilitate criminals instead of putting them to death. The EU (European Union) says:\n \n \"Indeed, crime rate and the death penalty are independent realities, capital punishment and its execution failing to have a deterrent effect and thus to produce less violent societies. Besides, maintaining capital punishment would not fit the philosophy of rehabilitation pursued in the criminal justice systems of all EU Member States and according to which one of the penological aims of penalties is that of rehabilitating or resocialising the offender.\"\n http://www.eurunion.org/legislat/DeathPenalty/eumemorandum.htm \n \n The US should have tried to rehabilitate Dahmer so that he could enter society again. The death penalty is cruel and unjust punishment.", 
   {}, 
   4597, 
   null, 
   1048557060.0
  ], 
  [
   5500, 
   null, 
   "JFriday", 
   "The US should have tried to rehabilitate Dahmer so that he could enter society again. \n \n - Voiceofreason\n \n That sounds really good, perhaps we can move people like him next door to you.", 
   {}, 
   4597, 
   null, 
   1048584060.0
  ], 
  [
   5533, 
   null, 
   "voiceofreason", 
   "Originally posted by JFriday \n  That sounds really good, perhaps we can move people like him next door to you. \n \n \n As long as he was rehabilitated, that would be fine. Perhaps Dahmer was really a victim. Maybe he was molested when he was a child and that messed him up. Maybe he was mentally ill. The EU is very concerned about all the people that have been put to death in the US.", 
   {}, 
   4597, 
   null, 
   1048626960.0
  ], 
  [
   5540, 
   null, 
   "JFriday", 
   "Yes well perhaps we should just exile the to the Bikini Islands in the S. Pacific, they could all live together and you and your family could go visit them, since they are all victims.", 
   {}, 
   4597, 
   null, 
   1048629480.0
  ], 
  [
   5695, 
   null, 
   "debategirl88", 
   "I voted life w/o parole. The death penalty is not as bad as l.i.p. Life w/o parole helps get them off the street. I have 2 child molestors down my busy street. And thats only in a 6 block range. im not allowed to go anyware w/o an adult or a HUGE group of people!", 
   {}, 
   4597, 
   null, 
   1048740840.0
  ], 
  [
   5731, 
   null, 
   "gilligan8503", 
   "i don't believe in \"an eye for an eye\" treatment... even in a murder case. to take life for life taken makes no sense. why take a life, with a history, a past, a family... why cause more heartbreak?\n \n i believe that all criminals should be forced into rehabilitation, no matter the crime. and about moving into the neighborhood, child molestors are required to tell the entire neighborhood that they were once convictied of child molestation. this is humiliating, but necissary.\n \n death is an extreme. i revote minumum of 20 years of less.", 
   {}, 
   4597, 
   null, 
   1048806660.0
  ], 
  [
   5732, 
   null, 
   "Crim", 
   "Too bad child molesters can just change their name and no one is the wiser.", 
   {}, 
   4597, 
   null, 
   1048807980.0
  ], 
  [
   5869, 
   null, 
   "gilligan8503", 
   "they go door to door and show their face.", 
   {}, 
   4597, 
   null, 
   1049005620.0
  ], 
  [
   5957, 
   null, 
   "JFriday", 
   "Yes and would you feel good about your kids living next door to one? I would not want to have to trust the lives and well being of my family to the gov'ts rehabilitation programs, perhaps we could move them all to the Bikini Islands in the S. Pacific, that would handle the problem well.", 
   {}, 
   4597, 
   null, 
   1049128740.0
  ], 
  [
   12187, 
   null, 
   "rapture", 
   "What do you think the penalty for child molesters should be?\n\n \n \n Street Justice! We're headed that way as we speak, in Calif alone aprox. \n \n 800 molesters was released, likwise, a lot of the satanic child molestion priest.\n And in Boston over 500 cases filed against priest was thrown out.\n The law is felling to punish offenders, therefore, people will take justice in their own hands", 
   {}, 
   4597, 
   null, 
   1059101640.0
  ], 
  [
   12545, 
   null, 
   "sassy1", 
   "Nope. The reason is, is that there is no cure except death or castration for these sickos. It is irrelevant rather it is revenge or justice, it is the best solution. And I say we should have more cost effective executions. Like the gas chamber is a good one, just not one at a time, why not gas 10 at a time? Why spend all of that money on them for just one execution?\n\n \n \n Castration isn't an answer.\n Castration will not change the psychological urges that pedophiles and sex offenders have and they will find other ways to meet their needs.\n \n I read an article yesterday about a man who had been a convicted molester who had a tumor removed from his frontal lobe. In doing so, the man no longer had the urges to commit acts against children.\n \n There is a pile of research happening right now concerning the frontal lobe activity and violent crime. It may be that for some, this may include sex offenses.\n \n So what do we do?\n The death penalty is only going to stop one pedophile at a time. A ped isn't going to change his behavior because he fears death. It is a psychological drive. (No, I am not empathetic toward molestors, but am being factual.) \n \n If you are going to use the death penalty to try to rid society of sex abuse, you better fire up those gas chambers. They will be as busy as Burger Kings grills at dinner time.\n \n There is some evidence that rehabilitation can be effective if the ped wants to benefit from treatment. To that end, treatment is long term and meets with mixed results. However, mental health treatment combined with medication treatment can prevent an offender from reoffending and help him to focus on dealing with the problem.\n \n By and large sex offenders are suffering from other mental health problems that also need to be addressed. A wholistic approach to treatment would be necessary.\n \n And IMHO, until treatment is a better gamble, lock em up.", 
   {}, 
   5301, 
   null, 
   1059802260.0
  ], 
  [
   12611, 
   null, 
   "1979", 
   "I wonder what would be worse, life as a prison B*tch or death by torture. Heh, if life as a prison B*tch is worse then I say that would be good.\n \n And alot of people agree with you that it is not murder so they dont deserve to die, until it happens to someone they love. I say send em to hell.\n\n I think they would be punished more by serving life in prison... that way they get to sit in that cell for the rest of their life... killing them would be an easier way out for them.....", 
   {}, 
   4776, 
   null, 
   1059965460.0
  ], 
  [
   17360, 
   null, 
   "Johnnis", 
   "i think u should cut their weiners off. then they wouldnt do it again.", 
   {}, 
   4597, 
   null, 
   1064546940.0
  ], 
  [
   17531, 
   null, 
   "Chobo Char", 
   "I don't agree with the death penalty, it just seems as an act of vengeance instead of justice. I don't know much about rehab among pediphiles, but from what I've heard it is extremely low if not almost non-existant. I say that they should be have life in prison or in less severe cases, voluntary castration and rehabilitation.", 
   {}, 
   12611, 
   null, 
   1064618580.0
  ], 
  [
   17732, 
   null, 
   "mizmaxx", 
   "please name one rehabilitated child molester.\n\n \n I think it's important to be specific about who we're talking about here- most child molesters do not fulfill the requirements to be considered \"pedophiles\". To equate the two is to allow most child molestors to hide behind the spectre of pedophiles.\n \n \nAbout 95% of victims know their perpetrators. \n Source: CCPCA, 1992\n \n \n One of the myths regarding child molesters is that they \"look different\" or behave differently from others in some way. Here are some statistics describing child molesters:\n \n 97% are male \n 91% are heterosexual \n 91% are religious \n 75% are married or formerly married \n 73% are Caucasian \n 65% earn a middle income or above \n 48% are college educated \n Source: This information was adapted from The Medlin Training Institute website, sexualdeviancy.com\n\n \n Keep in mind that the available statistics on reported sexual assault of minors will always present a skewed image, because- \nNinety percent of sexual abuse victims never tell.\n Susan Forward, Ph.D., 1989.\n Innocence and Betrayal Overcoming the Legacy of Sexual Abuse.\n \n \n The differences between most child molesters and actual pedophiles are:\n \n -Pedophiles usually are only sexually interested in children. Most child molesters primarily engage in adult heterosexual relations.\n \n -Pedophiles stalk and attack large numbers of children (hundreds), whereas most child molesters abuse children in their proximity (often dozens instead of hundreds). Of course, one molested child is too many.\n \n -Pedophiles are less likely to have known the child personally, whereas most child molesters are trusted family members or friends of the family.\n \n -Pedophiles are usually single, isolated and socially awkward, whereas most child molesters have families and are considered \"friendly\" and \"good citizens\".\n \n I'm not outlining these differences to argue that most child molesters can be \"reformed\", I don't know. I do think that less children would be abused if people stopped believing that the \"pervert in the bushes\" were more dangerous than the people in their families.\n \n I do think pedophiles are seriously dangerous individuals, who cause tremendous damage. I think they're kind of like serial killers. A dead person is a dead person, whether they died because of a \"run of the mill\" murder or because of a serial killer. However, there are differences between how these people should be dealt with and how we can protect ourselves (and the people we love) from them.\n \n I think we should focus more attention on preventing abuse and helping survivors, instead of deciding how to best punish offenders.", 
   {
    "unicode_changes_made": true
   }, 
   17531, 
   null, 
   1064820960.0
  ], 
  [
   25982, 
   null, 
   "cblan88", 
   "Killing is evil even if you kill a murderer or child molestor. Two wrongs don't make a right. Look at other nations that don't have the death penalty. They have lower crime rates than the US. \n Every criminal can be rehabilitated. We should focus on rehabilitating criminals. It might take many years and a lot of tax money to rehabilitate a criminal, but that's the price we have to pay to live in a civilized society. The death penalty is a sign of a barbaric society and most modern western nations have abadoned it. I'm interested in doing what's best for America.\n \n -Voice of Reason\n\n I'm not sure if your statement about countries that don't have the death penalty have lower crime rates then the US. I think it's a fairly reasonable statement that some do. However, I do know for a fact that some countries that have much much more severe punishments than the US have drastically lower crime rates. The constitution says that many of these practices are cruel and unusual and so can't be used here, but it is an example that deterrence is a practical method of stopping some criminals.\n \n I don't think that the death penalty will stop all pedophilles, many of these people are so mentally deranged that no punishment will stop them. However, the death penalty, especially if it was used efficiently, could probably stop you average potential child molester from deciding to get a little bit closer to his favorite neice.\n \n Deterrance does work. if one child is saved from the hell of being molested by using it then it is well worth having to confront my own moral objections to capital punishment.", 
   {}, 
   5381, 
   null, 
   1070782560.0
  ], 
  [
   27764, 
   null, 
   "Hiberpirates", 
   "Seeing the Smart families miracle reunion has brought this question to my mind.\n\n \n Good thread. I vote for castration, because if he somehow left jail early he would keep offending. Those guys are sick. Jail does nothing to heal them, it makes their lust worse.", 
   {}, 
   4597, 
   null, 
   1071597240.0
  ], 
  [
   30924, 
   null, 
   "mamboni", 
   "I definitely don't advocate the death penalty here, as I don't advocate it anywhere else. It's hypocritical to kill a man convicted of murder. Killing period should be condemned on both sides of the table. However, I hear the government spends a lot more money facilitating deathrow inmates annually than it would cost to execute them.\n Back on topic. I don't think they should recieve the death penalty, even for these degenerates that's too harsh. \n Assuming their problem is some mental and psychological ailment I would also assume they can be rehabilitated, but I'm uncertain as to how effective this would be. Still, executing someone isn't goin' to solve or undo the hurt, nor will it teach the offender a lesson, nor will it stem homocide or, in this case, molestation. Retribution is an ugly thing and I hate seeing vengeful and bloodthirsty people push for execution.", 
   {}, 
   27764, 
   null, 
   1073934360.0
  ], 
  [
   31583, 
   null, 
   "mizmaxx", 
   "The death penalty does not work as a deterrant, neither is it used appropriately by the state. They make so many mistakes, the sentence depends entirely on whether or not you have money for an expensive lawyer.\n \n As someone who has been molested, I can say that I do not want to advocate the state killing anyone on my behalf.", 
   {}, 
   30924, 
   null, 
   1074325440.0
  ], 
  [
   33238, 
   null, 
   "splinter99", 
   "I would use the death penalty, but only if there was undisputed evidence, like images on a computer. The reason i think they should be executed because what a child can go through under an abuser can mentally scar them for life, and a child molester is a sick sick sick thing to be, and we are better rid of them.", 
   {}, 
   31583, 
   null, 
   1075569480.0
  ], 
  [
   37884, 
   null, 
   "Adept", 
   "I think they should have their elbows and knees smashed, and be dumped in the city square for people to do with as they please. They should cease to be a legal person.\n \n So if you want to re-habilitate them, you can go and collect them, heal their broken joints and try to re-habilitate them. You had just better hope you get there before I do...\n \n With regards to all this death sentence tosh: Life is not objectively valuable. Prove me wrong if you can. Many have tried, all have failed. Since life is not objectively valuable, there can be no objective reason to oppose the death penalty. I dont believe that it should exist as a deterrent, I believe it should exist to give a sense of repatriation to the victim. An eye for an eye, and a tooth for a tooth. Sure its hypocritical to kill a man for murder, but who cares? We have the power to do it, and you lack the power to stop us, and that is all that matters.\n \n Take away the pedophiles ability to run and hide, inflict pain and suffering upon him to balance the pain and suffering he inflicts upon his victims, and then let society deal with him as we see fit. Remove his legal rights, and let the weight of his decisions judge him. Give him to us.", 
   {}, 
   33238, 
   null, 
   1078411200.0
  ], 
  [
   37907, 
   null, 
   "The_Comedian", 
   "I think they should have their elbows and knees smashed, and be dumped in the city square for people to do with as they please. They should cease to be a legal person.\n \n So if you want to re-habilitate them, you can go and collect them, heal their broken joints and try to re-habilitate them. You had just better hope you get there before I do...\n \n With regards to all this death sentence tosh: Life is not objectively valuable. Prove me wrong if you can. Many have tried, all have failed. Since life is not objectively valuable, there can be no objective reason to oppose the death penalty. I dont believe that it should exist as a deterrent, I believe it should exist to give a sense of repatriation to the victim. An eye for an eye, and a tooth for a tooth. Sure its hypocritical to kill a man for murder, but who cares? We have the power to do it, and you lack the power to stop us, and that is all that matters.\n \n Take away the pedophiles ability to run and hide, inflict pain and suffering upon him to balance the pain and suffering he inflicts upon his victims, and then let society deal with him as we see fit. Remove his legal rights, and let the weight of his decisions judge him. Give him to us.\n\n And who is the one to judge when a victim has the right to take revenge and in what form?\n Let me show you an example:\n You hit someone with your car, it is a terrible accident but according to the law you are not responsible (victim ran into your car, or something else).\n What if the parents of the dead person ignore this fact and insist on their right for revenge? \n \n Imho there would be hundreds of cases of self-justice if we wouldn't let our courts decide or if we would introduce torture or similar barbaric methods (because when the state is allowed to torture why shouldn't I be allowed to, especially when someone from my family was a crime-victim?).\n \n P.S.:\n Life IS objectively valuable, no matter whose life it is. This understanding seperates us from animals and if we would rate life not as the most important thing, some sicko could excuse any murder with it (even wars or genocides).", 
   {
    "unicode_changes_made": true
   }, 
   37884, 
   null, 
   1078416840.0
  ], 
  [
   38122, 
   null, 
   "Adept", 
   "And who is the one to judge when a victim has the right to take revenge and in what form?\n \n \n Already (in the west) we have revenge laws. What else is suing someone? Compensation payments? In the east, there are many situations that will find you in serious trouble. Thieving can cost a limb, drug trafficking your life. A culpable driving resulting in death conviction can earn you the death penalty in some countries.\n \n \nLet me show you an example:\n You hit someone with your car, it is a terrible accident but according to the law you are not responsible (victim ran into your car, or something else).\n What if the parents of the dead person ignore this fact and insist on their right for revenge? \n\n \n If I were to be re-forming the legal system, then no I dont think killing someone with your car should be punishable in such a way, provided it was not your fault. It would have been an accident, and the fault of the victim. Hence you are innocent, and owe the family nothing. You were not responsible. Culpable driving resulting in death or injury should carry a hefty jail term, permanent loss of any kind of licence, and perhaps thirty lashes. It is, however, an accident. You are a poor driver, but you didnt mean to kill anyone. Hence I consider your crime to be less. If you had deliberately killed someone using your car, then I urge the death penalty.\n \n \n(because when the state is allowed to torture why shouldn't I be allowed to, especially when someone from my family was a crime-victim?).\n\n \n That is inane. The state is allready allowed to kill people, imprison people, infringe privacy and personal rights and detain people against their will. Why cannot private citizens do that? Because it is against the law, thats why.\n \n I hold pedophiles in a special contempt. I believe that if they were no longer offered protection under the law, they would suffer greatly in society. If there was no penalty for killing them, I would do it.\n \n \nLife IS objectively valuable, no matter whose life it is.\n\n \n Says who?\n \n Where do they say this?\n \n Is this evidence credible?\n \n How much is a life worth?\n \n \nThis understanding seperates us from animals and if we would rate life not as the most important thing, some sicko could excuse any murder with it (even wars or genocides).\n\n \n emoticon_rolleyes \n \n How do you think wars and genocides come about?! Because people excuse them to themselves. Or do you honestly believe every person who took part in the holocaust was an evil murderer?\n \n We are not seperate from animals, apart from a good ability to use tools and very advanced forms of communication. There is no value difference between a cockroach and a child. Not objectively.", 
   {
    "unicode_changes_made": true
   }, 
   37907, 
   null, 
   1078445220.0
  ], 
  [
   38131, 
   null, 
   "jitobear", 
   "Get execution out your heads my blood-thirsty friends. Execution is clearly not allowed in cases like these. Although it is left up the states as to whether they will use it, the feds have limited it's use to murder and treason.\n \n Child molesters/pedophiles are indeed a danger that needs to be removed from society. But they are not the equivelant of a theif or someone who knows the crime they committ is wrong. People who are doing this are sick. Something is wrong upstairs. Mental hospitals would be a good place for them. No, we probably can't cure them, but the more we know, the better equiped we are to protect children. Proactive, not reactive.", 
   {}, 
   38122, 
   null, 
   1078446060.0
  ], 
  [
   38242, 
   null, 
   "The_Comedian", 
   "Says who?\n \n Where do they say this?\n \n Is this evidence credible?\n \n How much is a life worth?\n\n You can't rate life in material terms. But I feel the same about the value of it as any religions and beliefs think about it; that it is too high of value as if we should judge about it.\n Sounds strange; nobody has to agree with it.\n \n \n \n \n emoticon_rolleyes \n \n How do you think wars and genocides come about?! Because people excuse them to themselves. Or do you honestly believe every person who took part in the holocaust was an evil murderer?\n \n We are not seperate from animals, apart from a good ability to use tools and very advanced forms of communication. There is no value difference between a cockroach and a child. Not objectively.\n\n This is the sad reality. But we have the option to do better.\n At least we can be subjective. And then a child is worth more than a roach.", 
   {
    "unicode_changes_made": true
   }, 
   38122, 
   null, 
   1078470000.0
  ], 
  [
   38259, 
   null, 
   "Mr Jack", 
   "I say when there is irrefutable evidence( like DNA) then the death penalty cannot be rulled out.\n\n \n DNA evidence is not infailable. No evidence is.\n \n Surely there is room for some difference here as well: is someone who cops a feel off a young girl equivalent to someone who rapes that same girl repeatedly over years? Child molestation covers a multitude of sins.", 
   {}, 
   38242, 
   null, 
   1078492080.0
  ], 
  [
   41058, 
   null, 
   "Tastyfish", 
   "Seems most of the people advocating the death penalty are those that beelive they can not be rehabilitated (as for why you don't hear much about the rehabilitated ones- why would you, they don't do anything newsworthy and no one knows what they once did), so you have no problem with killing people because of a physiological condition- you're just talking eugenics here.", 
   {}, 
   38259, 
   null, 
   1080261420.0
  ], 
  [
   41150, 
   null, 
   "Phunting", 
   "Child molesting is a terrible crime, and shold be punished by appropriate means.\n \n The death penalty (and I do support it) is not appropriate for someone who has not killed, I don't care about the circumstances.\n \n To listen to people shout support of torture, castration, physical abuse in prison, enjoyment of sucicide, and mob law makes me more than a little worried. Why do people get so hysterical over child molestation. It is a crime that needs to be delt with calmly and rationally.\n \n Yes it is human nature to protect children, as is it our nature to lash out when feeling threatened. But the levels of hysterics over the subject is totally out of proportion.\n \n Oh and to all you advocates of castration, you do not need a penis to molest a child.", 
   {}, 
   41058, 
   null, 
   1080315600.0
  ], 
  [
   41151, 
   null, 
   "Tastyfish", 
   "Nor do you have to be male, seems to usually be but not always.", 
   {}, 
   41150, 
   null, 
   1080315840.0
  ], 
  [
   47305, 
   null, 
   "Maineiac", 
   "I went with castration,though life without parole is a bit extreme, unless it is a serious offence,or a case of multiple victims.\n \n Child molestation can come in many forms, so its hard to roll them all into the same catagory.\n \n This subject sickens me. To take a childs innocence away is appaling,for lack of a better expression.\n \n In extreme cases,I would consider the death penalty.Life without parole is not good enough punishment for those offenders,which I feel will never be fully rehabilitated.", 
   {}, 
   41151, 
   null, 
   1083557820.0
  ], 
  [
   47329, 
   null, 
   "Tastyfish", 
   "Depends if it is a psychological condition (I which think it must be, while I can see the reasons behind murders and rapes, this just is beyond me), in which case the death penalty would be irrelevant as it isn't acting as a deterant... So you are killing them because it is cheaper than locking them up? Depends mainly on what you think the purpose of punishment is- surely it is to act as a deterrant to those who would do it and those who have rather than to statisfy the people's want for vengance. \n If it is psychological then it should be possible to prescribe drugs to prevent it and possibly cure. To me a secure institution would be the best place, the same as you would do with other criminally insane people.", 
   {}, 
   47305, 
   null, 
   1083595320.0
  ], 
  [
   47987, 
   null, 
   "galton", 
   "If the molester kills the child, the death penalty should be automatic. Since research shows that serious pedophiles cannot be rehabilitated, they should be removed from society for life until they are too decrepit to victimize anyone. Less serious, less violent offenses should be punished less severely, but the message should be communicated that our society has zero patience for this heinous crime, and if you continue this you will be removed from society for good.", 
   {}, 
   47329, 
   null, 
   1083802560.0
  ], 
  [
   47996, 
   null, 
   "Tastyfish", 
   "You already said though that they can not be rehabilitated so what is the point sending the message. Should the death penalty then be used for unrehabilitable criminals then? \n Why is a child's life worth more than an adult as well? Abuse I can see as they are more vunerable and more likely to be emtionally scared, but dead is dead and they are not going to leave any dependants behind. Don't think the death penalty is a good idea anyway, but in something like this where it is almost impossible to get a fair trial and very easy to set up a victim and falsy accuse them.", 
   {}, 
   47987, 
   null, 
   1083805740.0
  ], 
  [
   48003, 
   null, 
   "galton", 
   "You already said though that they can not be rehabilitated so what is the point sending the message. Should the death penalty then be used for unrehabilitable criminals then? \n Why is a child's life worth more than an adult as well? Abuse I can see as they are more vunerable and more likely to be emtionally scared, but dead is dead and they are not going to leave any dependants behind. Don't think the death penalty is a good idea anyway, but in something like this where it is almost impossible to get a fair trial and very easy to set up a victim and falsy accuse them.\n\n Notice I differentiated between serious pedophiles and less serious offenses. For example, there are cases of a brother fooling around a couple times with his younger sister, and never doing anything like that again, so these cases should be treated differently than predatory pedophilia, especially violent pedophilia. \n \n The brutal rape and murder of a child is a more serious crime than say a guy who kills a liquor store owner after robbing the place, but both should be executed. I did not say kill pedophiles that will not be rehabilitated; I said lock them up until they are too old to do any harm. Same goes for chronic violent offenders.\n \n There are enough safeguards to ensure that we are not killing someone who did not rape and murder a child. As forensic science advances, we are increasingly getting beyond the problem of convicting the innocent.\n \n The only way to adequately show a child rapist/murderer how viciously we hate him is to kill him--I'd be more than happy to volunteer to flip the switch.", 
   {}, 
   47996, 
   null, 
   1083808140.0
  ], 
  [
   48294, 
   null, 
   "Haulingboat", 
   "If people are born homosexual then are people also born child molesters? If so, there is no rehabilitation. The only way to stop the activity is to stop the sex drive.", 
   {}, 
   41058, 
   null, 
   1083951900.0
  ], 
  [
   48315, 
   null, 
   "galton", 
   "If people are born homosexual then are people also born child molesters? If so, there is no rehabilitation. The only way to stop the activity is to stop the sex drive.\n\n Good point. I think serious pedophilia cannot be rehabilitated probably because it is based on a certain type of sex drive, and few passions are more powerful than sex drive. I would think sex drive is mostly genetic in origin, but there is at least the possibility that what you come to be turned on by could have some basis in experiences.", 
   {}, 
   48294, 
   null, 
   1083956880.0
  ], 
  [
   52694, 
   null, 
   "mjny", 
   "It is not a simple answer. Each case must be examined on its own merits. For example, a 30 year old man who kisses a 5 year old child on the mouth, as sick as it may be, does not deserve to die for it. On the other hand, that same man forces himself on that child and rapes and sodomizes her, I don't feel that putting him to death is wrong. The entire death penalty debate is an entirely different story. I agree with it in principal, meaning there are crimes that do warrant death, but the application of the death penalty in the U.S. is flawed to say the least. So I guess that my short answer is yes, I feel that sometimes death is a fair penalty for some child molesters.", 
   {}, 
   5298, 
   null, 
   1086064380.0
  ], 
  [
   54874, 
   null, 
   "jim's trucking", 
   "Death!\n \n \nWhy death? I'd like to hear an explaination.\n\n \n \n Why should I pay to feed and house some bastard who molests children?\n \n There are plenty of people in the world...more being born daily. It's not like there's a shortage of manpower. We don't need molesters...AT ALL!\n \n I say feed them to the fishes of the sea...then go enjoy a movie!", 
   {}, 
   4826, 
   null, 
   1087859100.0
  ], 
  [
   55330, 
   null, 
   "JPSartre12", 
   "Death!\n \n \n \n \n Why should I pay to feed and house some bastard who molests children?\n \n There are plenty of people in the world...more being born daily. It's not like there's a shortage of manpower. We don't need molesters...AT ALL!\n \n I say feed them to the fishes of the sea...then go enjoy a movie!\n\n \n No argument here. emoticon_xagree emoticon_xagree emoticon_xagree", 
   {}, 
   54874, 
   null, 
   1088046420.0
  ], 
  [
   55417, 
   null, 
   "jitobear", 
   "Death!\n \n \n \n \n Why should I pay to feed and house some bastard who molests children?\n \n There are plenty of people in the world...more being born daily. It's not like there's a shortage of manpower. We don't need molesters...AT ALL!\n \n I say feed them to the fishes of the sea...then go enjoy a movie!\n\n \n Except it costs more to execute them.", 
   {}, 
   54874, 
   null, 
   1088106000.0
  ], 
  [
   55420, 
   null, 
   "jim's trucking", 
   "Except it costs more to execute them.\n\n \n It costs hundreds of dollars per day to keep prisoners at any security level. It costs 50 to 75 thousand dollars a year to keep one prisoner on death row. I would volunteer to execute convicted child molesters for $250.00 each...discounts available for multiple parties.\n \n Shrimp and fish would love it!", 
   {}, 
   55417, 
   null, 
   1088107200.0
  ], 
  [
   55607, 
   null, 
   "Blue", 
   "Why death? I'd like to hear an explaination.\n\n \n Let me ask you a question.....Do you have kids?? You must not. I think they should fry for what they do. When a person molestes a child they take away that childs inncocense. Children should be children run, play, and dont worry about if this man is going to touch them. When this stuff happenes you took something away from the child you can tell in their eyes. I'm sorry but I have no compassion for a child molester. They are very sick people. So do you think that they shouldn't be killed? I bet you would change your opinion if your 5 yr old daughter came up to you crying saying that a bad man touched them. You would want to kill the person that did this to your daughter. You would want to see them sufer. Well atleast any good parent would! I would! I would probably kill them myself! Blue", 
   {}, 
   4826, 
   null, 
   1088206740.0
  ], 
  [
   55659, 
   null, 
   "King Triton", 
   "Let me ask you a question.....Do you have kids?? You must not. I think they should fry for what they do. When a person molestes a child they take away that childs inncocense. Children should be children run, play, and dont worry about if this man is going to touch them. When this stuff happenes you took something away from the child you can tell in their eyes. I'm sorry but I have no compassion for a child molester. They are very sick people. So do you think that they shouldn't be killed? I bet you would change your opinion if your 5 yr old daughter came up to you crying saying that a bad man touched them. You would want to kill the person that did this to your daughter. You would want to see them sufer. Well atleast any good parent would! I would! I would probably kill them myself! Blue\n\n \n The only problem I have with your statement is that death is too easy.I say they need to be tortured until near death,then doctored back to healthy,then tortured again,and keep doing it until they finally die.Also,make a website for these XXXXXX to be able to see their fellow sicko`s being tortured,so that it might stop them before they too get the sicko treatment!", 
   {}, 
   55607, 
   null, 
   1088272680.0
  ], 
  [
   55661, 
   null, 
   "Tastyfish", 
   "Whats the point, won't turn back time and stop the event from happening, its purely barbarity for its own sake. You are the sick people, who would want to subject someone to that kind of thing. Yes its a horrible crime, but it is not a normal type of crime, the deterrant system isn't going to work.", 
   {}, 
   55659, 
   null, 
   1088273460.0
  ], 
  [
   55668, 
   null, 
   "King Triton", 
   "Whats the point, won't turn back time and stop the event from happening, its purely barbarity for its own sake. You are the sick people, who would want to subject someone to that kind of thing. Yes its a horrible crime, but it is not a normal type of crime, the deterrant system isn't going to work.\n\n \n No your right,we should keep going the same way we always have,toss them in jail,so some bleeding heart like you can say that he has been cured.then put them back on the street so they can do it again.Whats your idea,give them flowers and say no,no dont do that again.Gimme a break,the only thing that will stop these sicko`s is to see that they will suffer,not being put in a cage and then released back on the rest of us.", 
   {}, 
   55661, 
   null, 
   1088276940.0
  ], 
  [
   55669, 
   null, 
   "Sigma", 
   "No your right,we should keep going the same way we always have,toss them in jail,so some bleeding heart like you can say that he has been cured.then put them back on the street so they can do it again.Whats your idea,give them flowers and say no,no dont do that again.Gimme a break,the only thing that will stop these sicko`s is to see that they will suffer,not being put in a cage and then released back on the rest of us.\n\n \n I believe it is better than being vicious for it's own sake. If it is a phsycological disturbance, do you really think torture will deter others from doing it? I do not believe it will. You only wish to do so in order to get revenge. That may satisfy some, but I do not believe simply revenge is a good enough reason for what you suggest.\n \n I do not believe anyone wishes for them to do it again, so we need to figure out what will accomplish that. Death certainly will, but don't you think we should explore other options before we simply decide to kill someone, as opposed to death being the first thing? If it is a phsycological condition, perhaps they cannot control their sexual desires. Perhaps castration is the only thing besides death that will prevent them from acting out their sexual desires. That should be our goal, to prevent them from doing it again.\n \n For violent criminals death may be the only option.", 
   {}, 
   55668, 
   null, 
   1088278440.0
  ], 
  [
   55671, 
   null, 
   "King Triton", 
   "I believe it is better than being vicious for it's own sake. If it is a phsycological disturbance, do you really think torture will deter others from doing it? I do not believe it will. You only wish to do so in order to get revenge. That may satisfy some, but I do not believe simply revenge is a good enough reason for what you suggest.\n \n For violent criminals death may be the only option.\n\n \n No,you are wrong there partner,I dont want revenge.I want the punishment to be so vile that anyone who has thoughts of doing something so sick,would not do it out of fear of the punishment.Too many people today use the mental disturbance cop-out.The act of harming a child this way is barbaric and needs a punishment that is equally barbaric.", 
   {}, 
   55669, 
   null, 
   1088279460.0
  ], 
  [
   55675, 
   null, 
   "Sigma", 
   "No,you are wrong there partner,I dont want revenge.I want the punishment to be so vile that anyone who has thoughts of doing something so sick,would not do it out of fear of the punishment.Too many people today use the mental disturbance cop-out.The act of harming a child this way is barbaric and needs a punishment that is equally barbaric.\n\n \n And if it is a psycological problem, where they fixate on little girls (predominatly) as the object of their sexual desires, do you expect your \"barbaric\" punishment to work? How do you justify being barbaric? Just because they are barbaric, you are going to be too? It sounds like revenge to me.", 
   {}, 
   55671, 
   null, 
   1088280120.0
  ], 
  [
   55679, 
   null, 
   "Tastyfish", 
   "No,you are wrong there partner,I dont want revenge.I want the punishment to be so vile that anyone who has thoughts of doing something so sick,would not do it out of fear of the punishment.Too many people today use the mental disturbance cop-out.The act of harming a child this way is barbaric and needs a punishment that is equally barbaric.\n\n \n There is a point where incrasing the deterrant is pointless, do you really think that criminals are thinking \"oh well, it'll only be 20 years in prison, what have I got to loose?\". They either can not help themselves even if they know it is very wrong (in the case of the peadophile or so it seems) or don't think they are going to get caught so any punishment is irrelevant.\n \n Really come down to what you see the purpose of punishment is, a deterant and a reforming tool. Causing harm for harm's sake is just the same crime as you are punishing the person for.", 
   {}, 
   55671, 
   null, 
   1088284740.0
  ], 
  [
   55680, 
   null, 
   "King Triton", 
   "And if it is a psycological problem, where they fixate on little girls (predominatly) as the object of their sexual desires, do you expect your \"barbaric\" punishment to work? How do you justify being barbaric? Just because they are barbaric, you are going to be too? It sounds like revenge to me.\n\n \n Skip the revenge idea,he becomes an example to the rest of his type to prevent them from following in his footsteps.Even people with phsycological problems can be taught not to do things.And if the punishment was vile enough,nobody would do it.", 
   {}, 
   55675, 
   null, 
   1088284920.0
  ], 
  [
   55930, 
   null, 
   "Blue", 
   "The only problem I have with your statement is that death is too easy.I say they need to be tortured until near death,then doctored back to healthy,then tortured again,and keep doing it until they finally die.Also,make a website for these XXXXXX to be able to see their fellow sicko`s being tortured,so that it might stop them before they too get the sicko treatment!\n\n \n \n Yeah but the jails would then become over poulated and if the jails are full were do the rest of the sickos go??? Blue", 
   {}, 
   55659, 
   null, 
   1088464020.0
  ], 
  [
   55945, 
   null, 
   "Eddie", 
   "Skip the revenge idea,he becomes an example to the rest of his type to prevent them from following in his footsteps.Even people with phsycological problems can be taught not to do things.And if the punishment was vile enough,nobody would do it.\n\n \n Yes, because during the middle ages when most crimes where punished with physical punishments akin to torture (and some of them, even worse than that), there was no crime what so ever?...", 
   {}, 
   55680, 
   null, 
   1088468100.0
  ], 
  [
   56947, 
   null, 
   "apathy", 
   "I didn't read all the posts. There were so many.\n \n I think the original question is making sweeping black-and-white statements about something that is far from black and white.\n \n There are a few things to think about before we can decide what to do with \"child molesters.\"\n \n We'd have to define exactly what constitutes \"molestation\" and what constitutes a \"child\".\n \n I mean I've heard stories of say a 19-20 yo male having consensual sex with a 13-14 year old girl, and that was called \"child molestation.\" Ok, so maybe the guy made a bad judgement, maybe she lied about her age, whatever, but should we cut the guys balls off? Should he get the death penalty? What punishment does she get? Was she \"molested\"?\n \n Personally I don't consider a 14 year old a \"child.\" Maybe they are YOUR child, but honestly they are old enough to make their own decisions (as poor as they may be). But, hey, who can decide when a person is old enough to make their own decisions? The legal cutoff is usually 18. Does an 18 year old make better decisions than a 14 year old? (I sure as hell didn't.) \n \n With that said, I think the type of child molestation you were referring to was when a full adult rapes or sexually abuses a small child. While this is pretty damned heinous, is death the answer? What if the abuser is the child's father? Would the child chose the death penalty for the father, or castration?\n \n The problem is not so cut and dry as some of the posts here have laid it out.\n \n I had a relative by marriage who sexually abused his children (my cousins). I don't know the details, I just know something happened over a period of time. All the kids turned out nutty, as in they now have many mental problems. You want to know what his punishment was? Five years probation. That's it. \n \n I think they should have locked his *** up for a long time. But death? castration? They sound pretty barbaric and extreme to me despite how much I hate the perverted ****.", 
   {}, 
   38259, 
   null, 
   1089239580.0
  ], 
  [
   57410, 
   null, 
   "Blue", 
   "And if it is a psycological problem, where they fixate on little girls (predominatly) as the object of their sexual desires, do you expect your \"barbaric\" punishment to work? How do you justify being barbaric? Just because they are barbaric, you are going to be too? It sounds like revenge to me.\n\n \n \n Huh??? Now here you are saying that this is barbaric? But you don't think abortions are??? Sorry I had to say something it's just weird to me emoticon_wow \n \n Blue", 
   {}, 
   55675, 
   null, 
   1089493620.0
  ], 
  [
   57412, 
   null, 
   "Duo_Maxwell", 
   "3 years of prison. With a sign on their shirt that reads Child Molester. \n \n IF they survive, that is enough punishment.\n \n That may be more barbaric then all the other options. emoticon_xgood emoticon_xhoho emoticon_wow", 
   {}, 
   37907, 
   null, 
   1089501480.0
  ], 
  [
   57622, 
   null, 
   "Ladywolf", 
   "Perhaps we could provide some much needed raw material for research and learn more about them in general before we \"decide what is the best solution\".", 
   {
    "post_info": {
     "post_title": "What do you think the penalty for child molesters should be?"
    }
   }, 
   5298, 
   null, 
   1089663960.0
  ], 
  [
   57938, 
   null, 
   "Phunting", 
   "Let me ask you a question.....Do you have kids?? You must not. I think they should fry for what they do. When a person molestes a child they take away that childs inncocense. Children should be children run, play, and dont worry about if this man is going to touch them. When this stuff happenes you took something away from the child you can tell in their eyes. I'm sorry but I have no compassion for a child molester. They are very sick people. So do you think that they shouldn't be killed? I bet you would change your opinion if your 5 yr old daughter came up to you crying saying that a bad man touched them. You would want to kill the person that did this to your daughter. You would want to see them sufer. Well atleast any good parent would! I would! I would probably kill them myself! Blue\nYes, which is why we go at lengths to make sure it is not someone emotionally connected in the jury. Seriously, we cannot have a legal system run by hysteria and revenge, which seems to be fuelling many of the posts here. I probably would want to kill someone who did it to my kid, I would want to kill someone who mugged my father as well for example, but I don't think that death/torture is an acceptable punishment for mugging.\n \n What is it about children? Is it because we feel responsible for them? That when someone gets to them it is a failure on our part as protectors and we feel so bad about that failure that we need to lash out? How is the rape of a child so significantly worse than the rape of anyone else? Doesn't any rape destroy lives?\n \n And the utter hypocrisy of the media gets to me as well. I just bought Brass Eye on DVD the other week, it was excellent at pointing out the hypocrisy of the reactionary press, but caused a massive outcry in the media as being 'sick' for being critical of the media's attitude to paedophilia.", 
   {}, 
   55607, 
   null, 
   1089818700.0
  ], 
  [
   57954, 
   null, 
   "jim's trucking", 
   "...\n \n What is it about children? Is it because we feel responsible for them? That when someone gets to them it is a failure on our part as protectors and we feel so bad about that failure that we need to lash out? How is the rape of a child so significantly worse than the rape of anyone else? Doesn't any rape destroy lives?\n \n And the utter hypocrisy of the media gets to me as well. I just bought Brass Eye on DVD the other week, it was excellent at pointing out the hypocrisy of the reactionary press, but caused a massive outcry in the media as being 'sick' for being critical of the media's attitude to paedophilia. \n\n \n There was a birdbrained idiot on talk radio recently suggesting that sex with toddlers should be acceptable. I believe 3 years is the age at which he advocated sex was okay with little girls.\n \n I realize that some societies have approved of 12 year olds marrying, but there is a line that should be drawn between little girls and women. Menstruation might be a good marker.\n \n It is ludicrous to think that there is no difference between raping a pre-pubescent child and raping a grown woman.\n \n The anger toward paedophiles must be something that even criminals have. Child molesters usually have a rough time in prison at the hands of their own inmates. Bravo to the inmates.", 
   {}, 
   57938, 
   null, 
   1089824400.0
  ], 
  [
   57957, 
   null, 
   "Phunting", 
   "There was a birdbrained idiot on talk radio recently suggesting that sex with toddlers should be acceptable. I believe 3 years is the age at which he advocated sex was okay with little girls.\n \n I realize that some societies have approved of 12 year olds marrying, but there is a line that should be drawn between little girls and women. Menstruation might be a good marker.\nOf course I would never ever state that it is acceptable, it categorically is not. That does not mean that I agree with the barbaric views expressed by many here.\n \n \n \nIt is ludicrous to think that there is no difference between raping a pre-pubescent child and raping a grown woman.\nI do not think there is no difference, however I do not think that the difference is so great that prison is an acceptable punishment in one case whereas torture, castration and worse is acceptable in the other. Just how are they so very different?\n \n \n \nThe anger toward paedophiles must be something that even criminals have. Child molesters usually have a rough time in prison at the hands of their own inmates. Bravo to the inmates.\nJim, I'd have thought that you of all people realize that society needs to be run by structured and clinical rules, not people turning a blind eye to assault and murder because it satisfies their 'burn the witch' mentality.", 
   {}, 
   57954, 
   null, 
   1089825480.0
  ], 
  [
   57960, 
   null, 
   "jim's trucking", 
   "Of course I would never ever state that it is acceptable, it categorically is not. That does not mean that I agree with the barbaric views expressed by many here.\n \n \n I do not think there is no difference, however I do not think that the difference is so great that prison is an acceptable punishment in one case whereas torture, castration and worse is acceptable in the other. Just how are they so very different?\n \n \n Jim, I'd have thought that you of all people realize that society needs to be run by structured and clinical rules, not people turning a blind eye to assault and murder because it satisfies their 'burn the witch' mentality.\n\n \n I did not imply that you approve of either. I take exception with your not seeing much difference between the two.\n \n I don't recall advocating torture, castration or worse. I advocate death...a needle, electricity, gas, a single bullet through the brain, a painless loss of blood...the method is not important so long as it is quick and quickly carried out.\n \n I do believe in a structured society with concrete rules. I also believe there are crimes deserving the death penalty. I believe when the death penalty is given to a convicted criminal, that criminal should be killed within a short period of time.\n \n This is not \"burn the witch\", this is \"kill the criminal\".", 
   {}, 
   57957, 
   null, 
   1089826440.0
  ], 
  [
   57962, 
   null, 
   "Phunting", 
   "I did not imply that you approve of either. I take exception with your not seeing much difference between the two.\nFair enough.\n \n \n \nI don't recall advocating torture, castration or worse. I advocate death...a needle, electricity, gas, a single bullet through the brain, a painless loss of blood...the method is not important so long as it is quick and quickly carried out.\nApologies then, but their have been many on the thread who have advocated the like. That is what I find so appalling. I don't agree with your stance, but at least I can accept it as a rational and socially responsible one. The 'torture/castration/whatever' one is neither.\n \n \n \nI do believe in a structured society with concrete rules. I also believe there are crimes deserving the death penalty. I believe when the death penalty is given to a convicted criminal, that criminal should be killed within a short period of time.\nAnd I agree with you, though I personally don't believe the taking of a life can be justified to one who has not done so themselves. And I also do not agree that it is a positive thing that inmates face assault at the hands of their fellows. If prison is not sufficient punishment then fair enough, change the standard sentence. But the avocation of turning a blind eye and allowing corruption and worse to exist within our own law system is unacceptable.\n \n \n \nThis is not \"burn the witch\", this is \"kill the criminal\".\nThe words may be different, but it seems for many (present company excepted of course) that the mentality is the same.", 
   {}, 
   57960, 
   null, 
   1089827040.0
  ], 
  [
   57967, 
   null, 
   "jim's trucking", 
   "...If prison is not sufficient punishment then fair enough, change the standard sentence. ....\n\n \n Yes, change it to DEATH!", 
   {}, 
   57962, 
   null, 
   1089828060.0
  ], 
  [
   57975, 
   null, 
   "Phunting", 
   "Just out of interest do you agree with the death penalty in cases of standard rape?", 
   {}, 
   5298, 
   null, 
   1089830640.0
  ], 
  [
   69580, 
   null, 
   "scrueballl", 
   "Seeing the Smart families miracle reunion has brought this question to my mind.\n\n \n Personally, in my perfect little legal system, you would be recompensed what you inflicted upon people.\n \n If you ran somebody over with a car, you'd be run over with a car in turn.\n \n If you shot somebody, you'd be shot in turn.\n \n If you diddled a kid... well... you'd be diddled in return. (though seems like some molesters would only enjoy this... so maybe they should be castrated along the way).\n \n You call this cruel and unusual? Cruel... no. Only fair. And unusual? Well... not if it became the norm! Then it'd be \"usual\". hehe... imagine that. A world full of people who were nice to each other, because they knew whatever bad thing they did to somebody else would be done back to them.", 
   {}, 
   4597, 
   null, 
   1096688700.0
  ], 
  [
   69587, 
   null, 
   "joebrummer", 
   "Personally, in my perfect little legal system, you would be recompensed what you inflicted upon people.\n \n If you ran somebody over with a car, you'd be run over with a car in turn.\n \n If you shot somebody, you'd be shot in turn.\n \n If you diddled a kid... well... you'd be diddled in return. (though seems like some molesters would only enjoy this... so maybe they should be castrated along the way).\n \n You call this cruel and unusual? Cruel... no. Only fair. And unusual? Well... not if it became the norm! Then it'd be \"usual\". hehe... imagine that. A world full of people who were nice to each other, because they knew whatever bad thing they did to somebody else would be done back to them.\n\n \n \n If everyone wanted an eye for an eye their be alot of blind men.\n Ghandi", 
   {}, 
   69580, 
   null, 
   1096691220.0
  ], 
  [
   69590, 
   null, 
   "scrueballl", 
   "If everyone wanted an eye for an eye their be alot of blind men.\n Ghandi\n\n \n ...either that, or there'd be some blind men, and then the rest would get the picture, and not poke peoples' eyes out in the first place.\n \n Ghandi was a really nice guy and all, but his words aren't gospel.\n \n Personally, I'd rather think for myself, than base my arguements purely on the words of others. You'll never, ever, catch me using quotes as a basis for an arguement.", 
   {}, 
   69587, 
   null, 
   1096691460.0
  ], 
  [
   69592, 
   null, 
   "joebrummer", 
   "...either that, or there'd be some blind men, and then the rest would get the picture, and not poke peoples' eyes out in the first place.\n \n Ghandi was a really nice guy and all, but his words aren't gospel.\n \n Personally, I'd rather think for myself, than base my arguements purely on the words of others. You'll never, ever, catch me using quotes as a basis for an arguement.\n\n \n \n It is not the basis of any argument but a good basis for thought provoking material. I do agree with the statement though. There has been too much of the eye for an eye stuff and it doesn't solve anything. Where does it really get you. Sorta like the death penalty, did it prevent murder...No..peopel still get murdered. What is the point, what did it solve...nothing!", 
   {}, 
   69590, 
   null, 
   1096691640.0
  ], 
  [
   69603, 
   null, 
   "scrueballl", 
   "It is not the basis of any argument but a good basis for thought provoking material. I do agree with the statement though. There has been too much of the eye for an eye stuff and it doesn't solve anything. Where does it really get you. Sorta like the death penalty, did it prevent murder...No..peopel still get murdered. What is the point, what did it solve...nothing!\n\n \n By murdering a murderer, you remove the very real threat that this murderer will murder again. And you do it in a manner where this murderer will not be fed, watered, and housed by you and me... the innocent bystanding tax-payers... for the rest of his life.\n \n That seems to me like a problem that was very definitely solved.", 
   {}, 
   69592, 
   null, 
   1096693260.0
  ], 
  [
   69619, 
   null, 
   "scrueballl", 
   "PS: Thanks for the welcome on the other string Joe. I appreciate it... and I'll hang around; so far I like this site. Opinions seem fairly liberal, but with a decent enough smattering of opposing opinions to be interesting.", 
   {}, 
   69603, 
   null, 
   1096695540.0
  ], 
  [
   69621, 
   null, 
   "joebrummer", 
   "By murdering a murderer, you remove the very real threat that this murderer will murder again. And you do it in a manner where this murderer will not be fed, watered, and housed by you and me... the innocent bystanding tax-payers... for the rest of his life.\n \n That seems to me like a problem that was very definitely solved.\n\n \n \n I think there is already a thread on capital punisnment, but as the statistics go.....It costs more money to \"murder them\" or carry out the sentence, than it does to put them away for life. It lies in the appeall process costing us the tax payer and the public defender they are using to spend our money, Plus you send a message to others that murder is ok. If one person does it, and the govenment does it. well it must be ok. Murder isn't ok!", 
   {}, 
   69603, 
   null, 
   1096695780.0
  ], 
  [
   69626, 
   null, 
   "Mach", 
   " Personally, I'd rather think for myself, than base my arguements purely on the words of others. You'll never, ever, catch me using quotes as a basis for an arguement.\n\n \n Whoa, you'll find your exact opposite here in bizzaro land, I can name at least one forum regular who uses extensive quotes, sometimes 40-50 tedious lines of text, to support points you have to dig around in the text just to discover...\n \n But more importantly, welcome to the forum!\n \n -Mach", 
   {}, 
   69590, 
   null, 
   1096696440.0
  ], 
  [
   69631, 
   null, 
   "GreenMtnBoy", 
   "The thing that perplexes me about the death penalty is that most of the supporters are christians, who should be reminded of a commandment...\"thou shalt not kill\".", 
   {}, 
   69626, 
   null, 
   1096698000.0
  ], 
  [
   69688, 
   null, 
   "scrueballl", 
   "The thing that perplexes me about the death penalty is that most of the supporters are christians, who should be reminded of a commandment...\"thou shalt not kill\".\n\n \n Though I'm stepping out on a limb here because I'm unsupported by any statistics, my own experience leads me to believe just the opposite:\n \n The Christian community is the most vocal opponent to the death penalty, and for exactly the reason you describe.", 
   {}, 
   69631, 
   null, 
   1096760820.0
  ], 
  [
   72187, 
   null, 
   "zachvac", 
   "I think it's mainly most conservatives are for it and most Christians are conservatives.", 
   {}, 
   69688, 
   null, 
   1098077700.0
  ], 
  [
   72188, 
   null, 
   "zachvac", 
   "OK, my views on the topic.\n \n I am a kid, 15 years old and I think that the type of child molesting being described is very horrible. So the only solution would be to make sure they could never do it again. That would leave 2 options:\n \n 1. kill them and get it over with, kill them and torture, basically kill them\n \n 2. Put them in prison for life, which costs less money, doesn't have to kill someone, and they will have to rot in prison the rest of their lives and deal with other inmates (although we shouldn't turn a blind eye), there shouldn't be violence, but it would be far from a friendly atmosphere.\n \n And the death penalty is used today in the US. Not only are there many found innocent, but it hasn't seemed to stop the crime rate getting the death penalty.", 
   {}, 
   72187, 
   null, 
   1098077940.0
  ], 
  [
   72189, 
   null, 
   "zachvac", 
   "and the prison in life should be without parole.", 
   {}, 
   72188, 
   null, 
   1098077940.0
  ], 
  [
   72296, 
   null, 
   "Phunting", 
   "So the only solution would be to make sure they could never do it again. That would leave 2 options:\nSurely all punishment is meted out with the intention to make sure that the criminals never do it again, not just execution and life imprisonment.\n \n \n \nkill them and get it over with, kill them and torture, basically kill them\nI'd be very careful about that flippant use of 'torture' in the sentence.", 
   {}, 
   72188, 
   null, 
   1098147120.0
  ], 
  [
   72432, 
   null, 
   "zachvac", 
   "Surely all punishment is meted out with the intention to make sure that the criminals never do it again, not just execution and life imprisonment.\n \n\n Of course that's their intention. But the only way to make SURE that they don't is to keep them confined the rest of their life or kill them (assuming they don't escape prison)\n \n \n\n I'd be very careful about that flippant use of 'torture' in the sentence.\n\n \n [/quote]\n I'm not exactly sure what you're saying here. I was a little hard to understand there, let me try to reword it. Option number 1 would be to kill them. Under that there are 2 categories mentioned so far. Letter a would be torture and kill. Letter b would be just kill. How is that a flippant use of torture?", 
   {}, 
   72296, 
   null, 
   1098224220.0
  ], 
  [
   72477, 
   null, 
   "Phunting", 
   "Of course that's their intention. But the only way to make SURE that they don't is to keep them confined the rest of their life or kill them (assuming they don't escape prison)\nAgreed, they are the only real methods of making re-committing a physical impossibility. My point was that this physical impossibility is not the only method to ensure further committal. Rehabilitation or lesser punishment with surveillance for example could also work.\n \n \n \n \nI'm not exactly sure what you're saying here. I was a little hard to understand there, let me try to reword it. Option number 1 would be to kill them. Under that there are 2 categories mentioned so far. Letter a would be torture and kill. Letter b would be just kill. How is that a flippant use of torture?\nIndeed. I personally have been massively concerned with the large amount of people who seriously suggest torture/castration as a just, enlightened, moral and practical solution to the problem. The way you added 'torture' to your sentence appeared to imply, to me at least, that it went hand in hand with execution. Torture is by no means necessary for your remit, to ensure against re-offence.", 
   {}, 
   72432, 
   null, 
   1098235320.0
  ], 
  [
   160382, 
   null, 
   "Misty1975", 
   "OK the way I see it is they had their chance to prove they were worthy of living a free life! Some of these people get away with this for MANY MANY years. Look how many children get destoyed in the meantime. I was molested as a child and so was one of my kids, by a daycare! I say :xcensored em they had the opportunity to stop themselves. My Grandfather is serving 27 years without parole for gross sexual imposition, yet someone else is only serving 7 years for RAPING a 4 year old child! He said he doesn't want the sentence to end because he knows that the prison system has not done enough to rehabilitate him. I say if they wanna lethal inject their butts then by all means HOP TO IT! If they want to surgically OR chemically castrate them then lets roll I will gladly pay a lil more in taxes. Instead these guys get out of prison, get some sort of welfare insurance that will PAY FOR VIAGRA! WTH is going on in this country that this is acceptable???? I don't think that 3rd world countries would aloow this type of behavior, they would simply take the person to their version of Times Square, expose them to everyone and shoot them, hang them, whatever they needed to do! To accept it means you would be OK with it happening to YOUR child! ~Misty", 
   {
    "post_info": {
     "post_title": "Sickos must not be given another chance!"
    }
   }, 
   4597, 
   null, 
   1126113360.0
  ], 
  [
   160384, 
   null, 
   "jim's trucking", 
   "OK the way I see it is they had their chance to prove they were worthy of living a free life! Some of these people get away with this for MANY MANY years. Look how many children get destoyed in the meantime. I was molested as a child and so was one of my kids, by a daycare! I say :xcensored em they had the opportunity to stop themselves. My Grandfather is serving 27 years without parole for gross sexual imposition, yet someone else is only serving 7 years for RAPING a 4 year old child! He said he doesn't want the sentence to end because he knows that the prison system has not done enough to rehabilitate him. I say if they wanna lethal inject their butts then by all means HOP TO IT! If they want to surgically OR chemically castrate them then lets roll I will gladly pay a lil more in taxes. Instead these guys get out of prison, get some sort of welfare insurance that will PAY FOR VIAGRA! WTH is going on in this country that this is acceptable???? I don't think that 3rd world countries would aloow this type of behavior, they would simply take the person to their version of Times Square, expose them to everyone and shoot them, hang them, whatever they needed to do! To accept it means you would be OK with it happening to YOUR child! ~Misty\nThe USA is replete with looney liberals and the influence of the ACLU so there will never come a day that we actually punish sex offenders and child molesters as they should be punished. We will continue to spank their palms, put them under house arrest, make them register (big deal) and let them walk the streets unrecognized as what they are. They will repeat their crimes until the day they die...a day that cannot come too soon for me.", 
   {}, 
   160382, 
   null, 
   1126113720.0
  ], 
  [
   160443, 
   null, 
   "Matthew S", 
   "It depends what your deinition of child molestation. A man can legally marry and have sex with a 12 year old girl in the state of Kanasas.", 
   {}, 
   160384, 
   null, 
   1126126200.0
  ], 
  [
   160586, 
   null, 
   "Phunting", 
   "I don't think that 3rd world countries would aloow this type of behavior, they would simply take the person to their version of Times Square, expose them to everyone and shoot them, hang them, whatever they needed to do!\nPossibly. I don't think we should be looking to third world countries in order to dictate our criminal justice system somehow though.\n \n \nTo accept it means you would be OK with it happening to YOUR child! ~Misty\nNobody is talking of 'accepting' anything. But there needs to be a just and rational system in place, one not led by knee-jerk reactions.\n \n P.S. Talk about resurrecting the dead! It's nearly a year before that post!", 
   {}, 
   160382, 
   null, 
   1126184700.0
  ], 
  [
   160600, 
   null, 
   "Iuris", 
   "First, I believe this thread, and similar threads all over the Internet, whenever the discussion occurs, is the best proof of why death sentence should be, at the very least, avouded, especially in cases of child molestation. People completely lose control. Prejudice forms instantly, as do calls for the most excessive punishments. This is intolerable. Moral panic suspends rationality and can lead to false convictions. Minds must be calmed first, only then can wise decisions be made. It is often pointed out that pepole will care more about their dog than about a starving african baby. Thus, people so often change persectives when one of their own close relatives is a victim of anything (\"You just don't understand! If it were your wife that has been raped, you'd want to kill the #%( rapist too!\"). Just because we are all protective of children in general (which is the reason for the intense reaction) does not mean that the same reasons for which a calm, impartial mind should decide on punishments of other crimes should not apply to child molestation.\n \n Second, cruel punishments make for cruel people. In criminals, people with nothing to lose are dangerous, more likely to be drawn to excessive expansion of their acts. In the rest of the society, the social acceptance of cruelty is elevated. Both are a highly negative element.\n \n Third, the crime is too singled out. To the victim, the rape of a child is no worse than the rape of an adult. Both are scarred for life. Thus, we get back to the big problem of setting punishments. Is murder worse than rape, or worse than torturing the victim for days without killing them, or than breaking one's neck, leaving him a tetraplegic, ... \n \n Fourth, a year of prison is not nothing. For a typical criminal, twenty years already takes away your productive and enjoyable life, leaving you only old age. Think about this, with a calm mind.\n \n And last, I'm not so sure about the \"incurable\" status. Here, terms get mixed up. Paedophilia simply means attraction to children, and not all paedophiles are actually child molesters. So if paedophilia (simply feeling attraction) is incurable, is the willingness to actually act upon the impulse also incorrigible? While we may have a lot of child molestor recidivists, how many people with paedophilic feelings simply obey the law and never act on them?", 
   {}, 
   160586, 
   null, 
   1126193280.0
  ], 
  [
   160614, 
   null, 
   "Phunting", 
   "I could not agree more with that excellent post. Unfortunately such rational views tend to get drowned out by the \"string 'em up\" attitude that seems to infest every such thread.\n \n I find it exceptionally worrying that any 'civilised' society could seriously have 10% of a poll voting for an option named 'death by torture'.", 
   {}, 
   160600, 
   null, 
   1126196160.0
  ], 
  [
   160618, 
   null, 
   "jim's trucking", 
   "I could not agree more with that excellent post. Unfortunately such rational views tend to get drowned out by the \"string 'em up\" attitude that seems to infest every such thread.\n \n I find it exceptionally worrying that any 'civilised' society could seriously have 10% of a poll voting for an option named 'death by torture'.\nIf there ever was a crime for which the perpetrators should be \"strung up\", it's child molestation. Kill the worthless bastards and be done with it. There's no sense in paying the multiple prices of keeping them alive...just for the sake of being \"civil\" to them.", 
   {}, 
   160614, 
   null, 
   1126197180.0
  ], 
  [
   162322, 
   null, 
   "Carrie", 
   "i think it is horrilbe what they do, but the system is surpose to be there to make the place safer and for justice, not revenge. also there can be wrong convictions. so i'd have to say no to the death penilty and life in prisonment without parol, because it's safer for the children. you can't tell allthetime if some one has been successfully rehabliltitated.", 
   {}, 
   5298, 
   null, 
   1126821960.0
  ], 
  [
   165840, 
   null, 
   "Eve Harrington", 
   "Imagine yourself to be a 5 year old girl or boy. You've been grabbed by a relative or a stranger and he is pushing his penis into your small body. The horror and the pain has to be unbearable. And no one is around to stop this monster from torturing you.\n \n The damage done to the child's body is incredible. The damage done to the mind, in most cases, takes years to overcome...sometimes never. In effect, the rapist has ruined a life.....an important life, the life of an innocent child.\n \n If this is not your child, then it's okay to have lenient laws to protect other children from rapists. If this is your child and you witness the bloody aftermath of the rape....is it okay for the law to take care of this monster or are you going to want to take care of him yourself? What if your child tells you much later and not right away, does this make it even less of a crime?\n \n We are parents. Our children look to us for their safety and learn from us how to react in a major crisis.\n \n So, in a civilized society, most let the authorities take over and do the punishment.\n \n But I have to tell you, if one of my children had ever been raped.....the last thing I would have done is call a cop.", 
   {}, 
   162322, 
   null, 
   1127666160.0
  ], 
  [
   165955, 
   null, 
   "greg 79 f150", 
   "Imagine yourself to be a 5 year old girl or boy. You've been grabbed by a relative or a stranger and he is pushing his penis into your small body. The horror and the pain has to be unbearable. And no one is around to stop this monster from torturing you.\n \n The damage done to the child's body is incredible. The damage done to the mind, in most cases, takes years to overcome...sometimes never. In effect, the rapist has ruined a life.....an important life, the life of an innocent child.\n \n If this is not your child, then it's okay to have lenient laws to protect other children from rapists. If this is your child and you witness the bloody aftermath of the rape....is it okay for the law to take care of this monster or are you going to want to take care of him yourself? What if your child tells you much later and not right away, does this make it even less of a crime?\n \n We are parents. Our children look to us for their safety and learn from us how to react in a major crisis.\n \n So, in a civilized society, most let the authorities take over and do the punishment.\n \n But I have to tell you, if one of my children had ever been raped.....the last thing I would have done is call a cop.\n \n \n \n \n Excellent post,\n \n \n My wife has always said the same thing ever since I met her. She said that if she was ever raped and survived it, only her and the rapist would ever know about it, and that she would never be put on trial for a such a horrible crime against her.", 
   {}, 
   165840, 
   null, 
   1127695620.0
  ], 
  [
   165956, 
   null, 
   "Master_Shake", 
   "1st offense- moderate length jail time and strong, strong efforts at rehabilitation\n 2nd offense- Life without the possibility of parole", 
   {}, 
   165955, 
   null, 
   1127696040.0
  ], 
  [
   166003, 
   null, 
   "Iuris", 
   "Imagine yourself to be a 5 year old girl or boy. You've been grabbed by a relative or a stranger and he is pushing his penis into your small body. The horror and the pain has to be unbearable. And no one is around to stop this monster from torturing you.\n\n \n You are forgetiing one thing, though: the same applies to any rape victim, be it child, female or male. I stand by what I have written.", 
   {}, 
   165956, 
   null, 
   1127724600.0
  ], 
  [
   166135, 
   null, 
   "Eve Harrington", 
   "A child needs extra special attention, moreso than an adult rape victim. Unless objects or a horrendous beating are used in the rape, adult victims rarely suffer the consequence of never being able to bear a child. Little girls do.\n \n Sorry. I didn't read any of your comments on this subject. I will do so now.", 
   {}, 
   166003, 
   null, 
   1127767740.0
  ], 
  [
   166142, 
   null, 
   "Eve Harrington", 
   "Your definition of paedophilia:\n And last, I'm not so sure about the \"incurable\" status. Here, terms get mixed up. Paedophilia simply means attraction to children, and not all paedophiles are actually child molesters. So if paedophilia (simply feeling attraction) is incurable, is the willingness to actually act upon the impulse also incorrigible? While we may have a lot of child molestor recidivists, how many people with paedophilic feelings simply obey the law and never act on them?\n \n \n Accurate definition of pedophilia:\n ~  The act or fantasy on the part of an adult of engaging in sexual activity with a child or children.\n ~  sexual perversion in which children are the preferred sexual object\n ~ sexual activity of an adult with a child\n ~ incurable\n \n Sooner or later, perverted minds manifest into perverted acts.", 
   {}, 
   160618, 
   null, 
   1127769120.0
  ], 
  [
   166322, 
   null, 
   "Iuris", 
   "Sooner or later, perverted minds manifest into perverted acts.\n\n \n Leaving the freedom of thought issue aside, where's the telepathic corps to enforce the implied idea?", 
   {}, 
   166142, 
   null, 
   1127811840.0
  ], 
  [
   173454, 
   null, 
   "soulwolf", 
   "I think death would be considered \"cruel and unusual punishment\" especially the torture death.\n \n And \"cruel and unusual punishement\" is prohibited by the Consitution.\n\n if it was prohibitied by the constitution and death is \"cruel and unusual punishment\" why did they have lynching and firing squad?\n Death for a crime commited is not cruel and it isn't unusual in and of itself.\n If you were to kill the person by putting them in with parahna's after skinning them alive that would be unusual and cruel.\n Cruel is when you have motives other than justice like revenge. \n Cruel is when you gain pleasure from watching them suffer.\n Unusual is when you use a method not approved to.\n Well known methods in america for death was lynching,gun shot,needle,gas and electric.\n At one time they might have been considered unusual but not anymore.\n And none of them are cruel if done properly because the criminal dies either fast and painless or slow and painless either way painless is noted.\n Other than electric chair that is why they have gone away from that method,not to mention the smell.", 
   {
    "post_info": {
     "post_title": "constitution"
    }
   }, 
   4600, 
   null, 
   1130100300.0
  ], 
  [
   173469, 
   null, 
   "doG", 
   "should be branded with the word \"TOY\" across their forehead and given to the local death row population to be played with and discarded as the death row inmates please.", 
   {
    "post_info": {
     "post_title": "Child molesters..."
    }
   }, 
   37884, 
   null, 
   1130104440.0
  ], 
  [
   173471, 
   null, 
   "Wez", 
   "should be branded with the word \"TOY\" across their forehead and given to the local death row population to be played with and discarded as the death row inmates please.\n\n And what if they turn out to be innocent?\n \n -Wez", 
   {}, 
   173469, 
   null, 
   1130104980.0
  ], 
  [
   173473, 
   null, 
   "Steeeeve", 
   "should be branded with the word \"TOY\" across their forehead and given to the local death row population to be played with and discarded as the death row inmates please.\n\n \n This is why we don't let the average person decide a sentence.\n \n What do you mean by child molester? Is someone with a low IQ that gets hit on by his girlfriends 14yr old daughter and the two end up fooling around, a child molester? Do you realize the re-offense rate for the situation I just discribed is one of the lowest out of all crimes? Do you realize the cases on TV are extremely rare? So what are you referring to?", 
   {}, 
   173469, 
   null, 
   1130105820.0
  ], 
  [
   175472, 
   null, 
   "soulwolf", 
   "This is why we don't let the average person decide a sentence.\n \n What do you mean by child molester? Is someone with a low IQ that gets hit on by his girlfriends 14yr old daughter and the two end up fooling around, a child molester? Do you realize the re-offense rate for the situation I just discribed is one of the lowest out of all crimes? Do you realize the cases on TV are extremely rare? So what are you referring to?\n\n But judges are average people.\n The do let personal beliefs weigh in all the time.\n If they are proved beyond a shadow of a doubt that they are guilty they should be executed. (ie caught on video tape,dna evidence (more than just sexual conduct because if 2 adults have sex and then one is murdered they can assume rape and murder but you need more))\n I know someone who went to jail for killing a man who raped his daughter (he did it right after the rape). and he got more time than a former friend of mine who went to jail for molesting his own 2 nieces.\n Where is the justice there?", 
   {}, 
   173473, 
   null, 
   1130654820.0
  ], 
  [
   175489, 
   null, 
   "daewoo", 
   "If there was a reasonable option in the poll I might have voted. Since there is not, I will abstain.\n \n I think you people are WAY too worked up over this. Molesting children is certainly a bad thing to do. That said, if it is the absolute worst thing you can imagine, you need to get out more.\n \n Nobody is killed\n Nobody is generally maimed\n Nobody is generally permanently damaged\n \n To some extent, steeeve is correct, judges are not generally your average Americans. They tend to be ruled more by logic than by blind emotion, and do not have the luxury of seperating themselves from the unpleasant parts of society and living in denial.\n \n Lets say for just one second that you are a judge. You sentence a mother for putting her infant in a pot fo boiling water (which oddly enough happens fairly routinely). The next case is a guy who had sex with his daughters 13 yr old friend. How serious does that really seem considering the last case on your docket?\n \n We have a strong cultural taboo when it comes to sex crimes in the US, and a strong cultural taboo against crimes against children. On the one hand that is a good thing, because it keeps incients of that nature down. On the other hand, it can be a bad thing becuase, besides encouragind emotionally driven XXXXXX to argue for rediculously severe punishments, it also tends to terrorize the victim. There are still places on this planet (especially if you travel to places as uncivilized as africa or eastern europe) where rape is fairly routine and the woman generally sees it as an unpleasant part of life. You get over it and move on. \n \n You people who are advocating the death penalty, or torture and the death penalty, or even 20 yrs in prison, need to SERIOSULY get a grip on reality. Of all the twisted, sick, depraved things that human beings do to each other, rape is pretty far down there on the list.", 
   {}, 
   175472, 
   null, 
   1130660100.0
  ], 
  [
   175537, 
   null, 
   "simone", 
   "I should like to know the causes of pedophilia (Sorry, I can't master the UK spelling of the word.).\n \n In a number of cases it is quite apparent that the pedophile has an inexorable attraction for children and little is known about how to deal with these perpetrators save to isolate them totally from contact with children.\n \n However, in a number of other cases I opine that people who act as pedophiles and make free sexually with children have a stripe of cruelty within them and they enjoy taking advantage of the vulnerable, those with less power than they, the stripe of the predator. The same psychology operates within the minds of rapists.", 
   {}, 
   175489, 
   null, 
   1130688540.0
  ], 
  [
   175573, 
   null, 
   "jim's trucking", 
   "But judges are average people.\n The do let personal beliefs weigh in all the time.\n If they are proved beyond a shadow of a doubt that they are guilty they should be executed. (ie caught on video tape,dna evidence (more than just sexual conduct because if 2 adults have sex and then one is murdered they can assume rape and murder but you need more))\n I know someone who went to jail for killing a man who raped his daughter (he did it right after the rape). and he got more time than a former friend of mine who went to jail for molesting his own 2 nieces.\n Where is the justice there?\n\n Justice is sort of like beauty...it exists in the eye of the beholder. There is no definition that I can think of that will satisfy everyone. To the family whose child has been molested, justice may be death. To the family of the molester, justice may be that their little angel will have a color TV in prison and won't be in prison too long.", 
   {}, 
   175472, 
   null, 
   1130693040.0
  ], 
  [
   175579, 
   null, 
   "daewoo", 
   "\n In a number of cases it is quite apparent that the pedophile has an inexorable attraction for children and little is known about how to deal with these perpetrators save to isolate them totally from contact with children.\n\n \n The VAST majority of peole charged with sex crimes against minors are not having sex with \"children\", but with teenage girls, and it is consensual. In my book, that amounts more to a lapse in judgement or an indiscretion than a crime. \n \n I think the going theory as far as active pedophalistic predators is arrested devlopment and impulse control problems. That they can not be helped is a rather sorry myth. True enough, when they are caught and put in jail, they commit another offence nearly 90% of the time. If they are sentenced to treatment at an inpatient facility, they commit another offence VERY rarely (95% sucess rate with long term inpatient treatment). \n \n We recently had this debate in my home state because they were suggesting that maybe penalties should be changed for some of these offences from jail time to treatment. The usual bunch of \"lock them up for 20 years\" XXXXXX showed up, but the argument for treatment is a compelling one, especially when you consider that the cost is negligible compared to a 5 year jail term (we have some state run, secure mental faciities already in kansas).", 
   {}, 
   175537, 
   null, 
   1130693520.0
  ], 
  [
   175582, 
   null, 
   "daewoo", 
   "I know someone who went to jail for killing a man who raped his daughter (he did it right after the rape). and he got more time than a former friend of mine who went to jail for molesting his own 2 nieces.\n Where is the justice there?\n\n \n In one case somebody is DEAD. Permanently removed from the planet. In the other case, nobody is dead, and nobody is pernanently injured. The girls will get over it and everything will be fine.", 
   {}, 
   175472, 
   null, 
   1130693700.0
  ], 
  [
   175583, 
   null, 
   "jim's trucking", 
   "In one case somebody is DEAD. Permanently removed from the planet. In the other case, nobody is dead, and nobody is pernanently injured. The girls will get over it and everything will be fine.\nWho are you to say the girls will get over it? Unless you've been traumatized yourself by a molester, you have absolutely NO CLUE how it affects one's mind.\n \n Besides that, in many cases...dead is good...permanent removal from the planet is good. It's bleeding heart liberals who want to save every lowlife that ruins someone else's life.", 
   {}, 
   175582, 
   null, 
   1130693820.0
  ], 
  [
   175599, 
   null, 
   "simone", 
   "It looks like the issues of pedophilia and age of consent are not quite separate in this thread.\n \n Also, I want to add that there have been incidents of women exploiting male children as sexual partners, witness the case of Mary Kay LeTourneau in Washington State. By the way, LeTourneau is now married to the child she abused--he is of age now--and, apparently, they are raising their two children together.", 
   {}, 
   175583, 
   null, 
   1130698740.0
  ], 
  [
   175601, 
   null, 
   "daewoo", 
   "It looks like the issues of pedophilia and age of consent are not quite separate in this thread.\n\n \n Thats because we are talking crime and punishment here and there is no distinction set forth in the law.", 
   {}, 
   175599, 
   null, 
   1130699700.0
  ], 
  [
   175602, 
   null, 
   "Steeeeve", 
   "But judges are average people.\n The do let personal beliefs weigh in all the time.\n If they are proved beyond a shadow of a doubt that they are guilty they should be executed. (ie caught on video tape,dna evidence (more than just sexual conduct because if 2 adults have sex and then one is murdered they can assume rape and murder but you need more))\n I know someone who went to jail for killing a man who raped his daughter (he did it right after the rape). and he got more time than a former friend of mine who went to jail for molesting his own 2 nieces.\n Where is the justice there?\n\n \n judges aren't average people...they deal with this stuff day in and day out. Not only that, I was referring to the fact taht punishments are created by the legislative branch.", 
   {}, 
   175472, 
   null, 
   1130699820.0
  ], 
  [
   175609, 
   null, 
   "daewoo", 
   "Who are you to say the girls will get over it? Unless you've been traumatized yourself by a molester, you have absolutely NO CLUE how it affects one's mind.\n\n \n Unless you have lit your hair on fire you have absolutly NO idea whetehr it hurts or not.\n \n Come on, Jim, you can do better than that.\n \n They will get over, unless some well meaning idiot turns it into a lifelong complex.\n \n \nBesides that, in many cases...dead is good...permanent removal from the planet is good. It's bleeding heart liberals who want to save every lowlife that ruins someone else's life.\n\n \n In some cases it is. You really think that peiople deserve to die for a crime with virtually no long term effects? \n \n I have a sister who is a child psychologist. She deals with rape victims fairly routinely. Attitudes like your above, thatt here iwll be long term problems, are, according to her, the biggest stumbling block in any recovery. The first time somebody tells a rape victim \"this will haunt you for the rest of your life\", they have ensured that it will. The first time they imply that the victim may feel like it is their fault, they victim will start looking for reasons it is their fault. \n \n My sisters approach to treating rape victims is essentially \"this was a bad thing that happened. Not terrible, but bad, and you will get over it just fine\". First step in this is of course to talk to the family and keep them form suggesitng any of the normal drivle people (including you) are pawning of here thay this is somethng that will take years to get over and have long term psychological effects. \n \n She developed this approach because at one time she was raped, and after YEARS of therapy, she was sitting in my living room one day looking at a bunch of pictures I had brought back with me from Sierra Leone of people who had actually HAD terrible things done to them, and she realized that she was pretty much whining, after 6 years, about a non-event, and her shrink had done a lot more damage to her than her attacker. Her appraoch has been effective enough that most patients require weekly appointment for less than 6 months, and it is being adopted as a treatmetn standard in many facilities (which kind of makes me proud of my sister, despite the fact that I generally loathe her).\n \n I can see her point in a lot fo that. I volunteer at the local fire department, and spend a lot fo time as the on call paramedic. The most useful tool I have on the ambulance is my \"shock meter\". It is a purely faciful piece of equipment with absoluitly no function whatsoever. It has an LCD screen, and LCD controller, and a 555 timer that counts up from 60% to 100%. I show it to injured people and tellt hem \"I know it hurts now, but accordingt ot he shcok meter, you are going into shock. When the meter hits 100%, you will be in shock and your brain will shut off your pain receptors and it will stop hurting\". Is this utter bukllshit? Of course. I built the shock meter in my basement, and that is not even how it works when people go into shock. BUT, people believe it, and it works 100% of the time. I have seen a guy who severed his hand tell me, and the folks at the hospital, that iut didn't hurt because he was in shock. It should have hurt like hell.\n \n People are incredibly open to sugegstion, and Americans are especially prone to believeing whatever bit of drivel they are told by someboyd in a percieved position of authority. If I tell the guy the shockl meter says his pain receptors are turned off and he can't feelit, it is true, he can't. If you tell a rape victim that she is never going to get over it and it is the most terrible thing that could ever happen, that becomes true as well.", 
   {}, 
   175583, 
   null, 
   1130700900.0
  ], 
  [
   175811, 
   null, 
   "soulwolf", 
   "Unless you have lit your hair on fire you have absolutly NO idea whetehr it hurts or not.\n \n Come on, Jim, you can do better than that.\n \n They will get over, unless some well meaning idiot turns it into a lifelong complex.\n\n \n And unless you fall from 15 feet backwards onto concrete you have absolutely no idea whether it hurts or not.\n Wait a minute.\n I fell backwards onto concrete from 15 feet and it didn't hurt at all.\n But it would most likely hurt you.\n But some people don't get hurt like others do.\n My sister bruises from touching her arm lightly.\n My ex wife was raped before numerous times and it effected her very much.\n And not due to peoples input but rather she still can not trust men.\n \n \n\n In some cases it is. You really think that peiople deserve to die for a crime with virtually no long term effects? \n\n \n I guess all a child molester needs then is a spanking,dirty mag and some k-y jelly?\n \n \n\n I have a sister who is a child psychologist. She deals with rape victims fairly routinely. Attitudes like your above, thatt here iwll be long term problems, are, according to her, the biggest stumbling block in any recovery. The first time somebody tells a rape victim \"this will haunt you for the rest of your life\", they have ensured that it will. The first time they imply that the victim may feel like it is their fault, they victim will start looking for reasons it is their fault. \n\n \n No the long term problem is that child psychologists deal with rape victims fairly routinely.\n Something in the child molesters brain is damaged and shy of surgery to correct it there is no way to fix them.\n Men on drugs perscribed for that desire still rape but don't feel any joy from it.\n They go through a routine long enough and it becomes second nature.\n \n \n\n She developed this approach because at one time she was raped, and after YEARS of therapy, she was sitting in my living room one day looking at a bunch of pictures I had brought back with me from Sierra Leone of people who had actually HAD terrible things done to them, and she realized that she was pretty much whining, after 6 years, about a non-event, and her shrink had done a lot more damage to her than her attacker. Her appraoch has been effective enough that most patients require weekly appointment for less than 6 months, and it is being adopted as a treatmetn standard in many facilities (which kind of makes me proud of my sister, despite the fact that I generally loathe her).\n\n \n Nice ending. You are making me cry. How lovely you are proud of someone you generally loathe. It's a hallmark moment.\n \n \n\n I can see her point in a lot fo that. I volunteer at the local fire department, and spend a lot fo time as the on call paramedic. The most useful tool I have on the ambulance is my \"shock meter\". It is a purely faciful piece of equipment with absoluitly no function whatsoever. It has an LCD screen, and LCD controller, and a 555 timer that counts up from 60% to 100%. I show it to injured people and tellt hem \"I know it hurts now, but accordingt ot he shcok meter, you are going into shock. When the meter hits 100%, you will be in shock and your brain will shut off your pain receptors and it will stop hurting\". Is this utter bukllshit? Of course. I built the shock meter in my basement, and that is not even how it works when people go into shock. BUT, people believe it, and it works 100% of the time. I have seen a guy who severed his hand tell me, and the folks at the hospital, that iut didn't hurt because he was in shock. It should have hurt like hell.\n\n \n And do you realize if the lawyers and judges find out about that they can prosecute?\n \n \n\n People are incredibly open to sugegstion, and Americans are especially prone to believeing whatever bit of drivel they are told by someboyd in a percieved position of authority. If I tell the guy the shockl meter says his pain receptors are turned off and he can't feelit, it is true, he can't. If you tell a rape victim that she is never going to get over it and it is the most terrible thing that could ever happen, that becomes true as well.\n\n \n And if you tell them they will and they believe they did but still have an unhealthy relationship it must be due to something else because you know for a scientific fact it has nothing to do with the rape?\n \n And as a side note I would like to respond to the statement someone else made that punishment is made by the legislative branch is a falsehood.\n Legislative says what is a crime and the judge or jury makes the sentence.\n There are standards but the judge can impose the standard,more than or less than.\n \n There was a case of spousal abuse that made the news because the judge gave the man a slap on the rist as a punishment.\n I don't mean that in a figurative way.\n That was the actual punishment.\n The man had to put his hand out and the judge slapped it.\n Where did the legislative branch come up with that punishment?\n Other criminals had to write essays.\n While other criminals got community service for violent crimes.\n Even though most people do not trust the government it is inconceivable that the legislative branch (responsible for laws) and the judicial branch (responsible for the sentences or application of such laws and the meaning of the laws as well as if they are constituionally sound) did not even talk to each other to come up with a better sentence if they actually did come up with that sentence.", 
   {}, 
   175609, 
   null, 
   1130744400.0
  ], 
  [
   175816, 
   null, 
   "daewoo", 
   "And unless you fall from 15 feet backwards onto concrete you have absolutely no idea whether it hurts or not.\n Wait a minute.\n I fell backwards onto concrete from 15 feet and it didn't hurt at all.\n But it would most likely hurt you.\n But some people don't get hurt like others do.\n My sister bruises from touching her arm lightly.\n My ex wife was raped before numerous times and it effected her very much.\n And not due to peoples input but rather she still can not trust men.\n\n \n If you fell backwards onto concrete and it did nto hurt you at all, you need to see a neurologist.\n \n Interestignly enough, the first time general distrust of men was mentioned as a potential effect of rape was in 1968. There was no case study to support the hypothesis, it was simply a possibility put forth. 2 years later, questions regarding general distrust of men were included in nearly all rape trauma interviews. 2 years after that, nearly 80% of patients reported general distrust of men. Prior to 1970, there was not EVER a single case study which mentioned that as a symptom in any patient, despite the hudreds of thousands of rape related case studies available. \n \n In modern case studies, if the attending professional does not mention general distrust of men as a potential symptom, it appears in less than 5% of patients. Currently , due to information like this, paramedics, social workers, and police officers are being re-trained in many states to NOT mention any potential psychological effects fo rape. This way patients just have to deal with their own symptoms, they do not artificially manifest symptoms due to suggestion or a need to feel \"normal\"\n \n \n \n \nI guess all a child molester needs then is a spanking,dirty mag and some k-y jelly?\n\n \n So since they do not deserve to die, there is no other punishment option? This is just illogical. It does display that your thought here are primarly motivated not by logic or intelligence, but by emotion. From a practical standpoint, that probably means that you are not worth debating (very difficult to debate somebody whose intellect has been reduced or entirely removed due to emotion). I will continue, though, becuase you do make a couple of interesting points.\n \n \nNo the long term problem is that child psychologists deal with rape victims fairly routinely.\n Something in the child molesters brain is damaged and shy of surgery to correct it there is no way to fix them.\n Men on drugs perscribed for that desire still rape but don't feel any joy from it.\n They go through a routine long enough and it becomes second nature.\n\n \n Unfortunatly, you are confusing rapists in general with sexual predators. Sexual predators are the fewer than 5% of sexual criminals who are never cured or are incurable. Your average rapist is convicted ONE time and never commits another offense. \n \n \n \nNice ending. You are making me cry. How lovely you are proud of someone you generally loathe. It's a hallmark moment.\n\n \n She is a flake. \n \n \nAnd do you realize if the lawyers and judges find out about that they can prosecute?\n\n \n Really? For what? \n \n Our departments attorney did not seem to think it was a problem, nor did the county prosecutor, nor the board of ethics at the local hospital, nor the kansas state medical association. You do not introduce practices like that aboard an ambulance, providing primary care, without a LONG list of approvals. Using the \"shock meter\" is no different than a doctor prescribing a placebo. \n \n \n \nAnd if you tell them they will and they believe they did but still have an unhealthy relationship it must be due to something else because you know for a scientific fact it has nothing to do with the rape?\n\n \n I see, you are trying to blame the failure of your marriage on your wifes prior experience. I suppose that is a reasonable explanation for your emotional response here. Unfortunatly, it is unlikely that your wife beign raped led to your divorce, though it is a possibility that her treatment instille din her certain assumed symptoms that were. OR, maybe you are an overly emotional person, with little logical ability, which tends to drive people freakign nuts. \n \n \nThere was a case of spousal abuse that made the news because the judge gave the man a slap on the rist as a punishment.\n I don't mean that in a figurative way.\n That was the actual punishment.\n The man had to put his hand out and the judge slapped it.\n Where did the legislative branch come up with that punishment?\n Other criminals had to write essays.\n While other criminals got community service for violent crimes.\n Even though most people do not trust the government it is inconceivable that the legislative branch (responsible for laws) and the judicial branch (responsible for the sentences or application of such laws and the meaning of the laws as well as if they are constituionally sound) did not even talk to each other to come up with a better sentence if they actually did come up with that sentence.\n\n \n There is a reason our system is set up the way it is, and frankly the legislature imposing minimum sentences and requiring special circumstances in order to circumvent them is, IMHO an unconstitutional power grab by the legislative branch.\n \n It is impossible for a law to be written that takes all circumstances into account. In my state, the legal age of consent for having sex is 16. Is a 17 yr old who has sex with their sixteen year old girlfriend deserving of the same punishment as a 40 yr old who has sex with a 10 yr old? The crime in both cases is the same in my state, statuatory rape. We depend on the wisdom of the judge in sentencing to give the 17 yr old community service, or make them write an essay, and throw the book at the 40 yr old. \n \n Your emotional investment here is preventing you from seeing the situation logically.", 
   {}, 
   175811, 
   null, 
   1130752440.0
  ], 
  [
   175906, 
   null, 
   "soulwolf", 
   "Interestignly enough, the first time general distrust of men was mentioned as a potential effect of rape was in 1968. There was no case study to support the hypothesis, it was simply a possibility put forth. 2 years later, questions regarding general distrust of men were included in nearly all rape trauma interviews. 2 years after that, nearly 80% of patients reported general distrust of men. Prior to 1970, there was not EVER a single case study which mentioned that as a symptom in any patient, despite the hudreds of thousands of rape related case studies available. \n \n In modern case studies, if the attending professional does not mention general distrust of men as a potential symptom, it appears in less than 5% of patients. Currently , due to information like this, paramedics, social workers, and police officers are being re-trained in many states to NOT mention any potential psychological effects fo rape. This way patients just have to deal with their own symptoms, they do not artificially manifest symptoms due to suggestion or a need to feel \"normal\"\n\n \n \n So what we should do is ignore things?\n If we ignore crime enough it will just go away?\n Get over the mugging,get over the rape,get over the beating (bones heal),get over the robbery (you still have a job),get over the vandalism (you can buy more)?\n \n \n \n \n\n So since they do not deserve to die, there is no other punishment option? This is just illogical. It does display that your thought here are primarly motivated not by logic or intelligence, but by emotion. From a practical standpoint, that probably means that you are not worth debating (very difficult to debate somebody whose intellect has been reduced or entirely removed due to emotion). I will continue, though, becuase you do make a couple of interesting points.\n\n \n \n Logic. The use of correct thought and words. Or as I read from your post it would go something like.\n Logc. Teh use fo correct thaut and wrds. In case you wondered I noticed too many spelling problems that are not like mixing up \"where\" or \"wear\" or \"there\" or \"their\".\n You spelled of as fo,that as thatt interestingly as interestignly and too many to mention here.\n Education,there is value in it.\n \n \n\n Unfortunatly, you are confusing rapists in general with sexual predators. Sexual predators are the fewer than 5% of sexual criminals who are never cured or are incurable. Your average rapist is convicted ONE time and never commits another offense. \n \n \n What is the difference?\n Rapists are not sexual predators?\n I know some sexual predators might be predisposed to flash themselves and others might be predisposed of rude conduct in public but rapists fit the sexual predator catagory to a \"t\".\n \n \n \n\n She is a flake. \n\n \n \n And you trust her diagnosis as a \"flake\"\n I should have trusted my dentist when he told me I needed a root canal and extraction on 1 tooth.\n Stupid me went for a rebuild and saved the tooth.\n After all wouldn't it be better to do a root canal on a tooth you are about to pull????\n Flake.\n \n \n\n Really? For what? \n \n Our departments attorney did not seem to think it was a problem, nor did the county prosecutor, nor the board of ethics at the local hospital, nor the kansas state medical association. You do not introduce practices like that aboard an ambulance, providing primary care, without a LONG list of approvals. Using the \"shock meter\" is no different than a doctor prescribing a placebo. \n\n \n Placebos are used in scientific testing of drugs.\n If you give saline solution as a treatment to the flu or other illnesses and the person dies you are held liable.\n Saline solutions are harmless but it does not help the problem.\n Neither does the \"shock meter\".\n \n \n\n I see, you are trying to blame the failure of your marriage on your wifes prior experience. I suppose that is a reasonable explanation for your emotional response here. Unfortunatly, it is unlikely that your wife beign raped led to your divorce, though it is a possibility that her treatment instille din her certain assumed symptoms that were. OR, maybe you are an overly emotional person, with little logical ability, which tends to drive people freakign nuts. \n\n \n No.\n Her being raped did not bother me.\n It was her having sex with a dog.\n Or maybe I was the personal bank account for her children and had no say or right to discipline or educate them.\n Or maybe it was because she was racist.\n Or maybe it was because she was cheating on me.\n All of which are true.\n The rape was the least of my problems........BUT that does not mean her attitude wasn't caused by HER being raped.\n \n \n \n\n There is a reason our system is set up the way it is, and frankly the legislature imposing minimum sentences and requiring special circumstances in order to circumvent them is, IMHO an unconstitutional power grab by the legislative branch.\n\n \n \n Once again LEGISLATURE dictates LAWS........NOT SENTENCES.......\n Sentence are a judicial matter.\n Our 3 branches of government are as follows.\n 1.Legistative Branch made up of Congress and Senate.\n 2.The Executive Branch....The White House made up of President and vice president.\n 3.The Judicial Branch made up of 12 funny looking people in Black robes.\n other wise known as judges.\n Judges say punishment.\n When did Hillary Clinton or any other Senator or Congressman create a punishment?\n When did they say what the sentence would be under a new law?\n They never did.\n The Judges DO...............\n \n \n\n It is impossible for a law to be written that takes all circumstances into account. In my state, the legal age of consent for having sex is 16. Is a 17 yr old who has sex with their sixteen year old girlfriend deserving of the same punishment as a 40 yr old who has sex with a 10 yr old? The crime in both cases is the same in my state, statuatory rape. We depend on the wisdom of the judge in sentencing to give the 17 yr old community service, or make them write an essay, and throw the book at the 40 yr old. \n \n Your emotional investment here is preventing you from seeing the situation logically.\n\n \n Actually it is your state that is illogical.\n To figure they say consent is 16 and a 16 can't consent is a trick.\n It is a lie.\n It is a trap.\n or it is just stupidity.\n As for the 40 year old with the 10 year old he should be shot.\n 10 years old?\n She hasn't fully grown yet.\n She is not of sound mind to have sex.\n Besides the common fact of it breaking the law..............\n The other one didn't break the law but they have loopholes.\n Tricks of the trade to out of trouble or get others into trouble.\n Plus what debate is it when one persons arguement is \"get over it\"?\n How come nobody ever debate with \"I don't know\"?\n or maybe \"I am still learning\"?\n Emotions run everything.\n Look at the legislative Branch they win based on emotions.\n Don't believe that just look at dukakis on the tank..........", 
   {}, 
   175816, 
   null, 
   1130782080.0
  ], 
  [
   176031, 
   null, 
   "daewoo", 
   "So what we should do is ignore things?\n If we ignore crime enough it will just go away?\n Get over the mugging,get over the rape,get over the beating (bones heal),get over the robbery (you still have a job),get over the vandalism (you can buy more)?\n\n \n There is a difference between just ignoring things and not allowing yourself tobe traumatized permanently over a relatively non event.\n \n \n \n \n \nLogic. The use of correct thought and words. Or as I read from your post it would go something like.\n Logc. Teh use fo correct thaut and wrds. In case you wondered I noticed too many spelling problems that are not like mixing up \"where\" or \"wear\" or \"there\" or \"their\".\n You spelled of as fo,that as thatt interestingly as interestignly and too many to mention here.\n Education,there is value in it.\n\n \n Yes, there is. I hold a Masters degree and a bachelors degree. Picking on typos is pretty pathetic, and a sign that your argument is weak. The less interesting I find the debate, the more typos you will find. Additionally, I routinely work on something on another monitor when I am answering truly brain dead deabters, in which case the typos can outnumber properly spelled words.\n \n \n \nWhat is the difference?\n Rapists are not sexual predators?\n I know some sexual predators might be predisposed to flash themselves and others might be predisposed of rude conduct in public but rapists fit the sexual predator catagory to a \"t\".\n\n \n By definition a sexaul predator has impulse control problems. That may or may not be true of rapists in general.\n \n \n \nAnd you trust her diagnosis as a \"flake\"\n I should have trusted my dentist when he told me I needed a root canal and extraction on 1 tooth.\n Stupid me went for a rebuild and saved the tooth.\n After all wouldn't it be better to do a root canal on a tooth you are about to pull????\n Flake.\n\n \n Part of the reaosn I think she is a flake is her chosen profession.\n \n \n \nPlacebos are used in scientific testing of drugs.\n If you give saline solution as a treatment to the flu or other illnesses and the person dies you are held liable.\n Saline solutions are harmless but it does not help the problem.\n Neither does the \"shock meter\".\n\n \n Placebos are routinley prescribed to cancer patients, as well as to treat psychosematic illnesses. For years many doctors have used placebos with good results to treat impotence. You have no idea what you are talking about.\n \n \n \nNo.\n Her being raped did not bother me.\n It was her having sex with a dog.\n Or maybe I was the personal bank account for her children and had no say or right to discipline or educate them.\n Or maybe it was because she was racist.\n Or maybe it was because she was cheating on me.\n All of which are true.\n The rape was the least of my problems........BUT that does not mean her attitude wasn't caused by HER being raped.\n\n \n Maybe....I don't know. From your previous post, you are clearly still hung up on her and blame her rape (and the attitudes that it fostered) for your breakup. Maybe you should see somebody about this.\n \n \nOnce again LEGISLATURE dictates LAWS........NOT SENTENCES.......\n Sentence are a judicial matter.\n Our 3 branches of government are as follows.\n 1.Legistative Branch made up of Congress and Senate.\n 2.The Executive Branch....The White House made up of President and vice president.\n 3.The Judicial Branch made up of 12 funny looking people in Black robes.\n other wise known as judges.\n Judges say punishment.\n When did Hillary Clinton or any other Senator or Congressman create a punishment?\n When did they say what the sentence would be under a new law?\n They never did.\n The Judges DO...............\n\n \n YES, almost all laws include sentencing guidelines, maximum and minimum, and there are additional senteencing guidelines that cover laws that do not specifically impose them individually. Those sentencing guidlines, which are created by the LEGISLATURE provide the sentencing structure for the JUDICIAL branch to follow. \n \n Don't you pay any attention to how your government works? you think judges just pull sentences out of their butts?", 
   {}, 
   175906, 
   null, 
   1130800440.0
  ], 
  [
   176180, 
   null, 
   "soulwolf", 
   "There is a difference between just ignoring things and not allowing yourself tobe traumatized permanently over a relatively non event.\n\n \n \n \n Yes there is a difference.\n But you can not just say \"you will get over it,give it time.\"\n \n \n \n \n\n Yes, there is. I hold a Masters degree and a bachelors degree. Picking on typos is pretty pathetic, and a sign that your argument is weak. The less interesting I find the debate, the more typos you will find. Additionally, I routinely work on something on another monitor when I am answering truly brain dead deabters, in which case the typos can outnumber properly spelled words.\n\n \n \n \n I can live with typos but when a person wants to judge someone on \"intellect\" it doesn't help when there are way too many typos and the same word is misspelled almost all the way through. \n And the word if \"of\"\n I am amazed at how bad the job market must be.\n You are such an intellectual with a masters and a bachelors and work as a ambulance driver.\n With such an education you should have had no problems getting a very good job teaching at a university or management.\n \n \n \n\n By definition a sexaul predator has impulse control problems. That may or may not be true of rapists in general.\n\n \n \n Sexual Predator is defined as a person who has been convicted of, or pleaded guilty to, committing a sexually oriented offense and who is likely in the future to commit additional sexually oriented offenses. \n \n Offenders can be classified as sexual predators in one of the following ways:\n 1. The offender is convicted of a sexually violent offense with a sexually violent predator specification, or\n 2. The sentencing court, after holding a sexual predator hearing pursuant to \n O.R.C. 2950.09, determines that the offender is a sexual predator.\n \n Offenders designated as sexual predators are subject to registration/verification requirements for life unless a judge modifies or terminates the sexual predator designation. Sexual predators are subject to the neighbor/community notification provisions and the reporting requirements at 90 day intervals.\n \n \n \n \n\n Part of the reaosn I think she is a flake is her chosen profession.\n\n \n \n You are supposedly both in a form of medical. Aren't you?\n You work as a ambulance driver and she works as a psychologist.\n She helps people with problems and their mental conditions.\n I guess your right. She should have been a driver.\n It is so much more rewarding to drive from point a to point b,try to keep them alive and then pass them off to a doctor to finish the job.\n \n \n \n \n\n Placebos are routinley prescribed to cancer patients, as well as to treat psychosematic illnesses. For years many doctors have used placebos with good results to treat impotence. You have no idea what you are talking about.\n\n \n \n Placebos were used to treat impotence.\n Because they didn't have drugs like Viagra and Cialis back then.\n When they did come up with those drugs they needed a test group.\n Group a was on placebos\n Group b was on the drug (viagra,cialis,etc..)\n And as for cancer patients. What drug treats it?\n Considering they are still testing drugs for the treatment all they really have is radiation.\n What disease or problems are treated by placebos only?\n What is the rate of success?\n How bad was their conditions in the beginning without placebos?\n Here is an article you might want to brush up on.\n A number of organizations have advised against the use of placebo substitution, including the American Pain Society, Agency for Healthcare Policy and Research, World Health Organization, Healthcare Facilities Accreditation Program, Joint Commission on Accreditation of Healthcare Organizations, Education for Physicians on End-of-Life Care Project (cosponsored by the American Medical Association and The Robert Wood Johnson Foundation), American Nursing Association, and the American Society of Pain Management Nurses. \n \n This white paper describes the literature and rationale in support of the American Osteopathic Association's (AOA's) position on the controversial subject of the use of placebos for pain management in terminally ill patients. \n \n The issues of placebo use, placebo effect, and placebo abuse as they affect pain management are fraught with opinion, confusion, and misunderstanding. The placebo effect of medication can be a significant resultant action of any prescription. However, the substitution of a placebo in place of effective pain medication has been widely recognized as unethical, ineffective, and potentially harmful\n \n \n\n Maybe....I don't know. From your previous post, you are clearly still hung up on her and blame her rape (and the attitudes that it fostered) for your breakup. Maybe you should see somebody about this.\n\n \n \n No.\n My thoughts were never that way.\n You are assuming.\n Not a good quality in a masters or bachelors degree.\n I was using her as an example.\n I love my fiance now.\n She is the only one I want.\n Plus I have seen someone.\n They said get over it. lol\n \n \n\n YES, almost all laws include sentencing guidelines, maximum and minimum, and there are additional senteencing guidelines that cover laws that do not specifically impose them individually. Those sentencing guidlines, which are created by the LEGISLATURE provide the sentencing structure for the JUDICIAL branch to follow. \n \n Don't you pay any attention to how your government works? you think judges just pull sentences out of their butts?\n\n \n Yes I pay attention greatly.\n Slap on the wrist for spousal abuse.\n Weekend jail time for drug possession.\n Jail time for self defense (3 years)\n Jail time for 2 counts of child molestation (1 year) and that included other charges that totalled 5 counts of crimes.\n They may give guidelines but it is a total shame that these guidelines are not met.\n Guidelines are just how it should work not how it does work.\n Dumping into a river anything is a crime and usually you pay a fine.\n But a chemical company here in Michigan dumped toxic water into the lake and a judge (with these great guidelines) said it was ok because it was dilluted by the water.\n But I can get a ticket for smoking in certain areas outdoors.\n Isn't that dilluted by the air?\n Our government tells us one thing while doing another.\n Each state has different laws.\n And in those states the judges decide which crime they want to be bothered with.\n It should not matter to the judge what is on his case agenda that day.\n He has a job to do.", 
   {}, 
   176031, 
   null, 
   1130824860.0
  ], 
  [
   176188, 
   null, 
   "daewoo", 
   "\n I can live with typos but when a person wants to judge someone on \"intellect\" it doesn't help when there are way too many typos and the same word is misspelled almost all the way through. \n And the word if \"of\"\n I am amazed at how bad the job market must be.\n You are such an intellectual with a masters and a bachelors and work as a ambulance driver.\n With such an education you should have had no problems getting a very good job teaching at a university or management.\n\n \n Maybe you missed (you seem to have poor reading retention) the \"volunteer\" part. Small towns and rural communities often cannot afford to maintain a paid fire department and ambulance service, so they rely on volunteers from the community to get the training required to staff their emergency services. The job pays $1.24 per hour, and you pay for your own training, certifications, and bunker gear. I figure if I do it for another 35 years, I should just about break even. \n \n You are again whining about spelling, and it is not helping your case.\n \n I am retired, more or less. \n \n \n \n \nSexual Predator is defined as a person who has been convicted of, or pleaded guilty to, committing a sexually oriented offense and who is likely in the future to commit additional sexually oriented offenses. \n \n Offenders can be classified as sexual predators in one of the following ways:\n 1. The offender is convicted of a sexually violent offense with a sexually violent predator specification, or\n 2. The sentencing court, after holding a sexual predator hearing pursuant to \n O.R.C. 2950.09, determines that the offender is a sexual predator.\n \n Offenders designated as sexual predators are subject to registration/verification requirements for life unless a judge modifies or terminates the sexual predator designation. Sexual predators are subject to the neighbor/community notification provisions and the reporting requirements at 90 day intervals.\n\n \n Uhhh, how do you suppose the court determines if there is cause ot be classified as a sexual predator under clause #2? Could they maybe rely on the testimony of expert witnesses, like maybe mental health professionals? You rdefinition here is a legal definition, and worthlesss to the debate because it relies on a another definiiton, a medical definition, for its substance. \n \n \n \nYou are supposedly both in a form of medical. Aren't you?\n You work as a ambulance driver and she works as a psychologist.\n She helps people with problems and their mental conditions.\n I guess your right. She should have been a driver.\n It is so much more rewarding to drive from point a to point b,try to keep them alive and then pass them off to a doctor to finish the job.\n\n \n I don't \"work\" as an ambulance driver, I am a volunteer. That was stated clearly.\n \n I think she is a flake because she threw her life away, now she whines because she doesn't have enough money. \n \n \n \nPlacebos were used to treat impotence.\n Because they didn't have drugs like Viagra and Cialis back then.\n When they did come up with those drugs they needed a test group.\n Group a was on placebos\n Group b was on the drug (viagra,cialis,etc..)\n And as for cancer patients. What drug treats it?\n Considering they are still testing drugs for the treatment all they really have is radiation.\n What disease or problems are treated by placebos only?\n What is the rate of success?\n How bad was their conditions in the beginning without placebos?\n Here is an article you might want to brush up on.\n A number of organizations have advised against the use of placebo substitution, including the American Pain Society, Agency for Healthcare Policy and Research, World Health Organization, Healthcare Facilities Accreditation Program, Joint Commission on Accreditation of Healthcare Organizations, Education for Physicians on End-of-Life Care Project (cosponsored by the American Medical Association and The Robert Wood Johnson Foundation), American Nursing Association, and the American Society of Pain Management Nurses. \n \n This white paper describes the literature and rationale in support of the American Osteopathic Association's (AOA's) position on the controversial subject of the use of placebos for pain management in terminally ill patients. \n \n The issues of placebo use, placebo effect, and placebo abuse as they affect pain management are fraught with opinion, confusion, and misunderstanding. The placebo effect of medication can be a significant resultant action of any prescription. However, the substitution of a placebo in place of effective pain medication has been widely recognized as unethical, ineffective, and potentially harmful\n\n \n Maybe you need to go back and review a bit. First of all, I did not argue for the placebo effect as a treatmetn for disease. I advanced my personal observation regarding a mythical \"shock meter\" and the fact that its ability to soothe patients obviously indicated suggestability. Second, regardless of whatever un-names source you are citing says, there are literally hundreds of thousands of case studies that confirm that placebo treatments are often effective. \n \n Regardless of all this, and your ignorance, placebos were not the issue at all here, until you made your ignorant statement about how I could be charged with some undefined crime if anybody knew I was using a nonsensical \"medical device\" to sooth my wards. \n \n The point is that people are very open to suggestion. The entire \"repressed memory\" faisco, where it was later discovered that there was essentially no such thing as repressed memories, and in reality the psychologists themselves were inadvertantly creating false memories in their quest to \"recover\" repressed memories is another excellent example of people bowing to suggestion, and mental health professionals inadvertantly creating trauma in their patients in their attempt to help them. \n \n \nNo.\n My thoughts were never that way.\n You are assuming.\n Not a good quality in a masters or bachelors degree.\n I was using her as an example.\n I love my fiance now.\n She is the only one I want.\n Plus I have seen someone.\n They said get over it. lol\n\n \n And yet you seem to tie the fact that she was raped into your seperation, and are apprently bitter about it. Interesting\n \n \n \nYes I pay attention greatly.\n Slap on the wrist for spousal abuse.\n Weekend jail time for drug possession.\n Jail time for self defense (3 years)\n Jail time for 2 counts of child molestation (1 year) and that included other charges that totalled 5 counts of crimes.\n They may give guidelines but it is a total shame that these guidelines are not met.\n Guidelines are just how it should work not how it does work.\n\n \n there are specific criteria that cases need to meet in order for the judge to depart from sentencing guidlines.\n \n \nDumping into a river anything is a crime and usually you pay a fine.\n But a chemical company here in Michigan dumped toxic water into the lake and a judge (with these great guidelines) said it was ok because it was dilluted by the water.\n But I can get a ticket for smoking in certain areas outdoors.\n Isn't that dilluted by the air?\n Our government tells us one thing while doing another.\n Each state has different laws.\n And in those states the judges decide which crime they want to be bothered with.\n It should not matter to the judge what is on his case agenda that day.\n He has a job to do.\n\n \n And part of that judges job is to issue sentences that are not utterly rediculously harsh for crimes in which nobody is permanently damaged, killed, and there is no property loss. \n \n You are right, the law is not always fair. Personally, I don't think there should be ANY mandated sentencing guidelines, and all judges should be elected to serve set terms. That would put the law in the hands of the people where it belongs. \n \n You will find that before there were mandatory sentencing guidlines for rape, sentences were MUCH lighter than they are today. Probation was common. To a judge who sees the worst that humanity has to offer on a daily basis, rape just isn't that bad. If they cut off the victims arms and raped them, it might warrant serious attention from the judge, but you can not expect a guy who deals with hardened criminals who have done horrific things on a daily basis to get too excited about a crime where nobody is permanently hurt.", 
   {}, 
   176180, 
   null, 
   1130828340.0
  ], 
  [
   176222, 
   null, 
   "Tastyfish", 
   "Curious though, would you be in favour of a harsher penalty (more jail time rather than some of the more inventive things that have appeared here) if for some reason or another the victim was traumatised (too much Law and Order, having a preconceived idea of what it should be like after a rape)?", 
   {}, 
   176188, 
   null, 
   1130862360.0
  ], 
  [
   176239, 
   null, 
   "Adept", 
   "nobody is permanently injured.\n\n \n How is on going mental trauma less debilitating than physical trauma?\n \n \nThe girls will get over it and everything will be fine.\n\n \n A persons mind is every bit as physical as their bones. Damage it, and that damage can be permanent and debilitating. A rape can be a life sentence of terror, panic and frustration.\n \n It can be, in my opinion, a crime as heinous as murder.", 
   {}, 
   175582, 
   null, 
   1130864640.0
  ], 
  [
   176241, 
   null, 
   "Tastyfish", 
   "How is on going mental trauma less debilitating than physical trauma?\n This was the point he was making, the actual mental trauma caused my rape is apparently not as much as people think it is - and its people convincing themselves that they should be traumatised that is causing the problem.", 
   {}, 
   176239, 
   null, 
   1130864760.0
  ], 
  [
   176255, 
   null, 
   "Adept", 
   "This was the point he was making, the actual mental trauma caused my rape is apparently not as much as people think it is - and its people convincing themselves that they should be traumatised that is causing the problem.\n\n \n Unfortunately, there is no way to measure mental trauma. Even the best educated and experienced specialists can only make a guess. An educated guess, but a guess none the less.", 
   {}, 
   176241, 
   null, 
   1130866200.0
  ], 
  [
   176256, 
   null, 
   "Tastyfish", 
   "Though there will be plenty of ancedotal evidence and I suppose you could measure the recovery periods or the time taken to return to normal life without suffering from depression etc.", 
   {}, 
   176255, 
   null, 
   1130866380.0
  ], 
  [
   176304, 
   null, 
   "soulwolf", 
   "Maybe you missed (you seem to have poor reading retention) the \"volunteer\" part. Small towns and rural communities often cannot afford to maintain a paid fire department and ambulance service, so they rely on volunteers from the community to get the training required to staff their emergency services. The job pays $1.24 per hour, and you pay for your own training, certifications, and bunker gear. I figure if I do it for another 35 years, I should just about break even. \n \n You are again whining about spelling, and it is not helping your case.\n \n I am retired, more or less. \n\n \n I figure based on your numbers you must be either in your 30's or low 40's?\n I might be wrong but if you will do the volunteer work for 35 years before you break even and you should be able to do that until you are in your 60's or early 70's and you have 2 degrees which usually take 5 to 9 years to gain depending on how loaded the class schedules are and if you go to get them at the same time or not.\n If these numbers are accurate you should have been retired (more or less) within 10 to 15 years of work.\n If this is true you should write a book. \n Because that is amazing.\n It would be proof of a great financial mind.\n \n \n \n \n\n Uhhh, how do you suppose the court determines if there is cause ot be classified as a sexual predator under clause #2? Could they maybe rely on the testimony of expert witnesses, like maybe mental health professionals? You rdefinition here is a legal definition, and worthlesss to the debate because it relies on a another definiiton, a medical definition, for its substance. \n\n \n Courts do rely on expert witnesses all the time.\n In fact that is how some of the legal definitions have been changed.\n They have alot of criteria to meet in order for medical opinion to be accepted as cause or effect.\n If medical definition is not part of legal definition how do they come up with not guilty by reason of mental defect.\n A good actor could pass it off as mental defect in court but then the medical proffession is called upon to prove or disprove the mental defect based on their definitions.\n \n \n \n \n\n Maybe you need to go back and review a bit. First of all, I did not argue for the placebo effect as a treatmetn for disease. I advanced my personal observation regarding a mythical \"shock meter\" and the fact that its ability to soothe patients obviously indicated suggestability. Second, regardless of whatever un-names source you are citing says, there are literally hundreds of thousands of case studies that confirm that placebo treatments are often effective. \n \n Regardless of all this, and your ignorance, placebos were not the issue at all here, until you made your ignorant statement about how I could be charged with some undefined crime if anybody knew I was using a nonsensical \"medical device\" to sooth my wards. \n \n The point is that people are very open to suggestion. The entire \"repressed memory\" faisco, where it was later discovered that there was essentially no such thing as repressed memories, and in reality the psychologists themselves were inadvertantly creating false memories in their quest to \"recover\" repressed memories is another excellent example of people bowing to suggestion, and mental health professionals inadvertantly creating trauma in their patients in their attempt to help them. \n\n \n \n You mentioned earlier about it being used in the treatment of cancer.\n You mentioned earlier about it being used in the treatment of impotence.\n Even though impotence is not a disease you did inadvertantly argue its use in treating cancer by saying doctors have used it with success on cancer treatment.\n Even if it was 25% success rate,I will grant you never said percentage of success.\n The unnamed source I am claiming is from the american osteopathic association who was also backed by the american medical association.\n Top names in the medical field.\n Or maybe judges should not even consider medical opinion and rely solely on laws alone?\n I know not all states have the same laws.\n It may be legal in Kansas toto but it is not legal in all states to use a device in the manner you would use placebos.\n If psychiatrists can not put false memories ( a source of a belief) into a persons mind why would that allow us to put a false belief into a person at all?\n Yes that would include using suggestabilities.\n If it is legal in Kansas. Fine.\n I said that without knowing your state in mind plus I said you could be charged (in some states) not that you would be charged.\n \n \n \n\n And yet you seem to tie the fact that she was raped into your seperation, and are apprently bitter about it. Interesting\n\n \n I am not bitter that she was raped.\n I am not happy she was raped\n I am not concerned that she was raped.\n But that does not mean I can not use that as an example.\n Only an example.\n It is simply 1 case.\n \n \n \n\n And part of that judges job is to issue sentences that are not utterly rediculously harsh for crimes in which nobody is permanently damaged, killed, and there is no property loss. \n\n \n Wait a minute.\n You have been saying rape is a non issue and they will get over it.\n Now you are saying that the judges jobs are to issue sentences that are not utterly rediculously harsh for crimes in which \"nobody is permanently damaged,killed and there is no property loss?\"\n Let me see if I have this straight.\n Someone who kills deserves hash sentences?\n Someone who permanently damages a person deserves harsh sentences?\n And someon who steals or destroys property (what classifies as property loss) deserve harsh sentences?\n Glad to see you believe in harsher sentences for property damage than you do with rape.\n After all it must be worse to destroy my vcr than to rape a little girl (sarcasm intended.....I do that all the time).\n \n [/QUOTE]", 
   {}, 
   176188, 
   null, 
   1130874420.0
  ], 
  [
   176306, 
   null, 
   "daewoo", 
   "I figure based on your numbers you must be either in your 30's or low 40's?\n I might be wrong but if you will do the volunteer work for 35 years before you break even and you should be able to do that until you are in your 60's or early 70's and you have 2 degrees which usually take 5 to 9 years to gain depending on how loaded the class schedules are and if you go to get them at the same time or not.\n If these numbers are accurate you should have been retired (more or less) within 10 to 15 years of work.\n If this is true you should write a book. \n Because that is amazing.\n It would be proof of a great financial mind.\n\n \n I am probably younger than you imagine. Great finacial mind? Not especially. Good breeding and a knowledge of how the game is played, definatly. That is not as uncommon as you may think. Generally the primary difference between rich and poor people is that rich people ahve the ability to focus on a goal and are brighter. Face it, ifyou were smarter, you would have more money becuase you would be better qualified to recognize opportunities when they come along.\n \n 4.5 years for both degrees. 12 hours, which is considered full time, is an incredibly lazy schedule in the real world. That is part of being \"goal oriented\". There is no reason that you can not, or should not, take 22-24 hours in college. It makes for some long weeks, and certainly curtails your party and screwing around time, but in the real world 80 hour weeks are often required for success. There is no reason not to start them soon and get used to it. On the topic of college strategy, waiting until you are 18 or 19 to go to college is also rediculous. Our public education system is based on the lowest common denominator. Unless you are in the bottom 10% of your school, you should be able to leave high school and head for college at 16.\n \n \n \nCourts do rely on expert witnesses all the time.\n In fact that is how some of the legal definitions have been changed.\n They have alot of criteria to meet in order for medical opinion to be accepted as cause or effect.\n If medical definition is not part of legal definition how do they come up with not guilty by reason of mental defect.\n A good actor could pass it off as mental defect in court but then the medical proffession is called upon to prove or disprove the mental defect based on their definitions.\n\n \n \"Sexual predator\" is a medical term. In order for a person to be a \"sexual predator\", they must have impulse control issues. End of story\n \n \n \nYou mentioned earlier about it being used in the treatment of cancer.\n You mentioned earlier about it being used in the treatment of impotence.\n Even though impotence is not a disease you did inadvertantly argue its use in treating cancer by saying doctors have used it with success on cancer treatment.\n Even if it was 25% success rate,I will grant you never said percentage of success.\n The unnamed source I am claiming is from the american osteopathic association who was also backed by the american medical association.\n Top names in the medical field.\n Or maybe judges should not even consider medical opinion and rely solely on laws alone?\n I know not all states have the same laws.\n It may be legal in Kansas toto but it is not legal in all states to use a device in the manner you would use placebos.\n If psychiatrists can not put false memories ( a source of a belief) into a persons mind why would that allow us to put a false belief into a person at all?\n Yes that would include using suggestabilities.\n If it is legal in Kansas. Fine.\n I said that without knowing your state in mind plus I said you could be charged (in some states) not that you would be charged.\n\n \n No, I couldn't. You have absoltly no idea what you are talking about. You have made that abundantly clear. \n \n \n \nWait a minute.\n You have been saying rape is a non issue and they will get over it.\n Now you are saying that the judges jobs are to issue sentences that are not utterly rediculously harsh for crimes in which \"nobody is permanently damaged,killed and there is no property loss?\"\n Let me see if I have this straight.\n Someone who kills deserves hash sentences?\n\n \n Generally murder is considered a fairly severe crime deserving of a harsh sentence.\n \n \nSomeone who permanently damages a person deserves harsh sentences?\n\n \n Yes, that also is generally a pretty severe crime\n \n \n \nAnd someon who steals or destroys property (what classifies as property loss) deserve harsh sentences?\n Glad to see you believe in harsher sentences for property damage than you do with rape.\n After all it must be worse to destroy my vcr than to rape a little girl (sarcasm intended.....I do that all the time).\n\n \n That would depend on the severity of the property damage.", 
   {}, 
   176304, 
   null, 
   1130875680.0
  ], 
  [
   176309, 
   null, 
   "daewoo", 
   "This was the point he was making, the actual mental trauma caused my rape is apparently not as much as people think it is - and its people convincing themselves that they should be traumatised that is causing the problem.\n\n \n That is EXACTLY what I am saying. \n \n I think that being careful not to escalate a problem is a real issue in the metal health community. They seem to be learning, allbeit slowly. Already you see changes to the way solders are handled following combat deployment, or the way civilian war survivors are handled. For years we created PTSD where there was none because it was suggested that PTSD was the \"normal\" respone to combat.", 
   {}, 
   176241, 
   null, 
   1130876040.0
  ], 
  [
   176317, 
   null, 
   "soulwolf", 
   "I am probably younger than you imagine. Great finacial mind? Not especially. Good breeding and a knowledge of how the game is played, definatly. That is not as uncommon as you may think. Generally the primary difference between rich and poor people is that rich people ahve the ability to focus on a goal and are brighter. Face it, ifyou were smarter, you would have more money becuase you would be better qualified to recognize opportunities when they come along.\n\n \n I scored in the top 5 % of electrical knowledge on military entrance exam.\n I speak 2 languages.\n I studied religions and history.\n I scored high on all classes taken (with the exclusion of 2 because they put me in advanced at the beginning because of how high I scored).\n I make good money now.\n you are assuming that I am poor.\n That is a sign of a person who thinks of themselves as being better than the rest of society for you to make that assumption.\n Companies have requested me for security and electronics.\n \n \n\n 4.5 years for both degrees. 12 hours, which is considered full time, is an incredibly lazy schedule in the real world. That is part of being \"goal oriented\". There is no reason that you can not, or should not, take 22-24 hours in college. It makes for some long weeks, and certainly curtails your party and screwing around time, but in the real world 80 hour weeks are often required for success. There is no reason not to start them soon and get used to it. On the topic of college strategy, waiting until you are 18 or 19 to go to college is also rediculous. Our public education system is based on the lowest common denominator. Unless you are in the bottom 10% of your school, you should be able to leave high school and head for college at 16.\n\n \n \n But people need down time also.\n Children are being rushed into adulthood too fast.\n They need to enjoy their youth and not see adulthood as the best times because adults remember fondly their youth.\n \n \n \n\n \"Sexual predator\" is a medical term. In order for a person to be a \"sexual predator\", they must have impulse control issues. End of story\n\n \n The \"sexual predator\" I was refering to is the legal definition.\n Make up your mind.\n Do you want a legal definition or a medical one because you use both when it seems to back your belief.\n If a man forces a woman or child to have sex it is rape or molestation.\n Either which way it is an impulse and a control issue.\n So rapists are sexual predators.\n But the medical definition of sexual predator would include a man who goes bar hoping to look for a one night stand and he finds a woman who consents to sex.\n It is a \"medical\" sexual predator but not a legal \"sexual predator\".\n When it comes to actual laws we should only use medical advice when there is no other rational explanation and it is scientifically proven within the scope the law determines is fair.\n \n \n \n\n No, I couldn't. You have absoltly no idea what you are talking about. You have made that abundantly clear. \n\n \n I have stated that I am not familiar with Kansas Law.\n That being stated do you honestly believe Kansas has the same laws every states have?\n Kansas is not the Federal Government.\n Congratulations. You are able to do that in Kansas.\n Of that much I concede this much.\n But I do know it IS illegal in some states.\n When I made that statement it was because of those states in question.\n I did not know which state you are in.\n \n \n \n\n Generally murder is considered a fairly severe crime deserving of a harsh sentence.\n\n \n Generally? Fairly?\n How often is murder a severe crime if it is generally a fairly severe crime?\n Generally speaking.\n \n \n\n That would depend on the severity of the property damage.\n\n \n \n Lets just give an example.\n One man goes into a house and rapes 5 children under the age of 9.\n That is all he done.\n The second man goes to the neighbors house and steals everything,burns down the house,destroys the 2 family cars and sets fire to the boat they have on a trailer.\n You are saying the severity of the damage is worse \"legally speaking\" than the rape of the 5 children under 9 (not that I am saying it would be better if they were all 17)?\n That is stupid.\n I would rather charge the man with rape than worry about my property.\n I would want them both punished but if only one case could be heard I would let my neighbor have first shot in court with the rapist and worry about my property later.\n Apparently your high education and motivation and determination has made you lose concentration on the nation and what would be an abomination.\n Doctor Suess lives.\n What is important in this world.\n Work? Money? Power? Fame? Or is it Family and love?\n I could be broke out of work and still fight for these kids who are raped.\n I do not see it as a minor issue.\n Most Americans do not see it as a minor issue.\n The minor issues are the ones that don't affect us personally.\n Rape affects us. Killings affects us. Poverty affects us. Homelessness affects us.\n I do not care one bit if business ceo's are only making 2.5 million a year.\n They could go bankrupt and I would not care one bit.\n People will find work if businesses allow them to.\n People will have money as long as they are not raped by the government and businesses in tag team form.\n So if Ford goes belly up who cares?\n GM will pick up sales and that means more needed jobs.\n If every airline in this country went belly up.\n It could be run by the government like Jordanian Air.\n Education is not enough. Values are important.", 
   {}, 
   176306, 
   null, 
   1130880120.0
  ], 
  [
   176412, 
   null, 
   "daewoo", 
   "I scored in the top 5 % of electrical knowledge on military entrance exam.\n I speak 2 languages.\n I studied religions and history.\n I scored high on all classes taken (with the exclusion of 2 because they put me in advanced at the beginning because of how high I scored).\n I make good money now.\n you are assuming that I am poor.\n That is a sign of a person who thinks of themselves as being better than the rest of society for you to make that assumption.\n Companies have requested me for security and electronics.\n\n \n I am not assuming anything. I am merely pointing out that generally wealthy people are wealthy because they are brighter and more driven than people who are not. congratulations on scoring high on the ASVAB (a test designed for high school seniors). Excuse me if I do not drop to my knees in recognition of your achievement. \n \n \n \nBut people need down time also.\n Children are being rushed into adulthood too fast.\n They need to enjoy their youth and not see adulthood as the best times because adults remember fondly their youth.\n\n \n rushed into adulthood? are you nuts? It is pathetic how Americans coddle their children. 100 years ago, at 16 you were a man. Now at 18 you are legally an adult, and at 25 you MIGHT start behaving like one. Most of todays children are undisciplined, uncouth, obnoxious, worthless mouth breathers It is pathetic. Very few places on the planet do people strive so hard to keep their children from becoming useful members of society as they do in the US.\n \n As far as downtime needed, I now have 30 to 50 years to do whatever I wish, and more than enough funds to do it, though I am finding retirement mind numbingly boring and will likely find some profitable diversions to keep me occupied (or run for office). \n \n Downtime is for Type B personalities who prefer to sit and watch life go by, htough that is typical American mentality. Don't work hard for your goal, just kind of coast through, doing the minimum amount needed to maintain a decent standard of living. No risks, no drive, no extreme effort. Jsut take the 12 hours, graduate in 4 years, work at some garbage yuppie job, elect whatever poltician proimises to spend the most of your kids money, then die. Theres a plan for you. BUT, you get plenty of \"down time\" in that arrangement. \n \n As with all things, sucess requires payment. Sometimes you pay the price, sometimes you reap the rewards. The price is all too often 100 + hr weeks, self deprivation in the name of reaching your goal, and a tireless drive to suceed. When it comes time to reap the rewards, they are things like never havign to worry about money, never having to worry about what would happen if you lost your job, weekend jaunts to exotic locations, retirement while you are still young enough to enjoy it. \n \n There is no great secret to success. You simply have to work twice as hard as the next guy. BE intelligent enough to take every setback as a learning experience, and actually LEARN, and know when you are out of your depth and need to call in reinforcements. OR, you can go to work, go home, watch football, breed, and die. The only other thing, which is maybe the hardest, is to be able to put your emotions on a shelf and make decisions based solely on logic. Decisions made on a bunch of emotional baggage are worthless and likely to cost you.\n \n If you want to teach your kids to take their time being kids and enjoying downtime, fell free. When they get older, they can work for my kids, until my kids retire at 30, then they can work for somebody else's kids. they can live a sad middle class lifestyle in a poorly constructed house with cardboard siding, watch TV, breed, and die. OR, you might consider dropping the \"stay kids too long\" and \"need down time\" and move to a more goal oriented mentality.\n \n \nThe \"sexual predator\" I was refering to is the legal definition.\n Make up your mind.\n Do you want a legal definition or a medical one because you use both when it seems to back your belief.\n If a man forces a woman or child to have sex it is rape or molestation.\n Either which way it is an impulse and a control issue.\n So rapists are sexual predators.\n\n \n I have not been inconsistent. the legal definition you posted is based on the medical definition. We are not talking about \"impulse and control\" issues (that darn reading retention problem again), we are talking about impulse control issues, which is the inability to control improper impulses. \n \n \nBut the medical definition of sexual predator would include a man who goes bar hoping to look for a one night stand and he finds a woman who consents to sex.\n\n \n No, it wouldn't, unless you wanted to argue that the man felt compelled to do so, and was unable to control that compulsion. Even so, another requirement for somebody to meet the definition of a sexual predator is that feel an overwhelming desire to dominate or control their victim. It would be unusual for a sexual predator to accept voluntary sex (in many cases) because it would not feed their need for domination. IT has been argued that certain types of sexual dysfunction such as sexual addiction are milder forms of the same impulse control problems that sadists have. \n \n It has been suggested that sexual predators (which can be used interchangeably with \"sexual psychopath) have abnormalities in the paralimbic system. \n \n There is an article at http://www.nctimes.com/articles/2005/09/12/news/californian/20_47_359_10_05.txt that does a reasonably good job of touching base on some of the possible physiological causes of sexual predation.\n \n The divide between a sexual predator and a normal sex offender is great enough that most states have \"habitual sexual violator\" laws along with sexual predator laws. A habitual sexual violator is somebody who commits multiple offenses, but does not fit the definition of a sexual predator. \n \n \n \nI have stated that I am not familiar with Kansas Law.\n That being stated do you honestly believe Kansas has the same laws every states have?\n Kansas is not the Federal Government.\n Congratulations. You are able to do that in Kansas.\n Of that much I concede this much.\n But I do know it IS illegal in some states.\n When I made that statement it was because of those states in question.\n I did not know which state you are in.\n\n \n And for the third time, I ask you to point out which states. I would be interested to see exactly how they codify such a thing to make it illegal. I spent some time looking and could not find anything, so I called my county prosecutor to see if he came across anything when I originally asked the question of him. He also was unaware of any relevant statute or case law in any state and would be interested in a statute # or case # so he can see what his para missed when researching the issue. He also thought it would be exceptionally difficult to codify something like that without just outlawing non functional boxes with LCD displays.\n \n \n \n \nGenerally? Fairly?\n How often is murder a severe crime if it is generally a fairly severe crime?\n Generally speaking.\n\n \n some places in the world it is nto treated as that severe.\n \n \n \n \nLets just give an example.\n One man goes into a house and rapes 5 children under the age of 9.\n That is all he done.\n The second man goes to the neighbors house and steals everything,burns down the house,destroys the 2 family cars and sets fire to the boat they have on a trailer.\n\n \n this is not an \"example\", it is a ridiculously grandiose exaggeration. Get your emotions under control then try again", 
   {}, 
   176317, 
   null, 
   1130905140.0
  ], 
  [
   176443, 
   null, 
   "soulwolf", 
   "I am not assuming anything. I am merely pointing out that generally wealthy people are wealthy because they are brighter and more driven than people who are not. congratulations on scoring high on the ASVAB (a test designed for high school seniors). Excuse me if I do not drop to my knees in recognition of your achievement.\n \n \n \n No problem.\n But you were assuming because you stated if I was smarter. You never knew my education before that and yes I also went to college ontop of all that.\n Besides the test I took was not the high school test given by the high school or state,it was the one given by the Air Force.\n The one test you are talking about I scored high on also but like you said I don't count high school tests either as achievements.\n But I scored high on the military entrance exam back in 1985 which was done at the recruiting office.\n But what I was actually stating was that you are not the only \"smart\" person out there.\n You seem to think that you either have all the answers and are unwilling to even take facts issued by recognized organizations that disprove your \"theory\".\n When I see facts that I am wrong I am atleast man enough to admit it.\n I admitted I was wrong about Kansas (taking your word for it because I am not familiar with their laws there).\n And since you wanted to say \"intellectuals\" are the only ones who have good money is a wrong philosophy.\n I know people who are dumb as a stump but they own 2 houses,4 cars,2 boats,etc..\n There are many factors in being rich.\n Intelligence is one factor,luck is another,talent is another.\n \n \n \n\n rushed into adulthood? are you nuts? It is pathetic how Americans coddle their children. 100 years ago, at 16 you were a man. Now at 18 you are legally an adult, and at 25 you MIGHT start behaving like one. Most of todays children are undisciplined, uncouth, obnoxious, worthless mouth breathers It is pathetic. Very few places on the planet do people strive so hard to keep their children from becoming useful members of society as they do in the US.\n\n \n coddle?\n Are you kidding.\n Kids having sex,doing drugs,swearing,etc..\n I even seen a kid swear at his mother and she said \"he is misunderstood\"\n It isn't so much they coddle them.\n It is the fact these same parents are lazy parents.\n They think if they ignore the problem it will go away.\n However I do agree that it is pathetic how parents treat their kids now a days.\n These kids do not have any true role models or upbringing.\n Our laws do not help any either.\n Some places you can go to jail for spanking your kid.\n The minute these liberals push those types of laws on us the kids know it and they are not stupid.\n They just want things their way only. Just like adults.\n \n \n\n As far as downtime needed, I now have 30 to 50 years to do whatever I wish, and more than enough funds to do it, though I am finding retirement mind numbingly boring and will likely find some profitable diversions to keep me occupied (or run for office).\n \n \n God have mercy on us when you run for office......lol\n \n \n\n Downtime is for Type B personalities who prefer to sit and watch life go by, htough that is typical American mentality. Don't work hard for your goal, just kind of coast through, doing the minimum amount needed to maintain a decent standard of living. No risks, no drive, no extreme effort. Jsut take the 12 hours, graduate in 4 years, work at some garbage yuppie job, elect whatever poltician proimises to spend the most of your kids money, then die. Theres a plan for you. BUT, you get plenty of \"down time\" in that arrangement. \n\n \n What?\n You mean when you die you would have wished you worked harder?\n You have to take time to smell the roses as they say.\n Not analyze the aroma for scientific purposes.\n Plus just because people like their downtime don't assume that they are lazy and don't work hard.\n I work exceptionally hard and I know people who have more degrees than you do who have done more than you have who still take time to relax and enjoy downtime.\n I see where your priorities are.\n Money,status,power and fame as well as recognition.\n Other important things are love,family,time,friendship,compassion and faith.\n \n \n\n As with all things, sucess requires payment. Sometimes you pay the price, sometimes you reap the rewards. The price is all too often 100 + hr weeks, self deprivation in the name of reaching your goal, and a tireless drive to suceed. When it comes time to reap the rewards, they are things like never havign to worry about money, never having to worry about what would happen if you lost your job, weekend jaunts to exotic locations, retirement while you are still young enough to enjoy it. \n\n \n True.\n But don't treat it like it is the end all be all.\n I would rather be poor and happy than rich and sad.\n \n \n\n There is no great secret to success. You simply have to work twice as hard as the next guy. BE intelligent enough to take every setback as a learning experience, and actually LEARN, and know when you are out of your depth and need to call in reinforcements. OR, you can go to work, go home, watch football, breed, and die. The only other thing, which is maybe the hardest, is to be able to put your emotions on a shelf and make decisions based solely on logic. Decisions made on a bunch of emotional baggage are worthless and likely to cost you.\n\n \n This is true.\n Why have emotions.\n They bring people down.\n Just like marrying for love,that is so crazy.\n If only people married someone because that person would help them further their career or give them children with a good gene pool.\n Imagine a world without emotion.\n No love,no family (just a domestic partner and biological offspring),no friends (just close aquantances),no hobbies (just sideline occupations to spend time on),no appreciation of beauty (just constantly evaluating the net worth and value).\n I will chose family every time over creating a cure for all diseases,ending world suffering and money,money,money.\n Not to say I don't want those things but family and friends are more important.\n If you don't see that I feel sorry for you.\n \n \n \n\n If you want to teach your kids to take their time being kids and enjoying downtime, fell free. When they get older, they can work for my kids, until my kids retire at 30, then they can work for somebody else's kids. they can live a sad middle class lifestyle in a poorly constructed house with cardboard siding, watch TV, breed, and die. OR, you might consider dropping the \"stay kids too long\" and \"need down time\" and move to a more goal oriented mentality.\n\n \n For someone who is as educated as you are you are very bitter and self absorbed.\n You think the working class is not important?\n You think the working class are nothing more than cattle?\n There is a big difference between teaching your kids to have fun and enjoy life and teaching your kids the proper way of life.\n Kids need to be taught responsibilities and dedication as well as hard work pays off but if they can not have their day or 2 days a week of just relaxing,going to a movie or concert,playing games,etc.. they will be a very bad example later on.\n Bill Gates is rich but what is his education status?\n Eddie Murphy has good money but he even dropped out of college.\n Some of the richest people in the world have been married numerous times and pay child support for children they hardly see.\n Paris Hilton is from a very rich family who paid the price for the money and she now does cheesy tv shows and she is most known for her acting in a video (or was it acting?).\n It should not be a game of teaching your kids that they must have a multi million dollar contract when they graduate and put fear into them about if they are not rich and famous or rich and educated they will be living in a cardboard box.\n If every person in America followed your teaching every person in america would be business owners but who would work for us?\n We need the working class just like they need the business owners.\n It is a partnership.\n \n \n\n I have not been inconsistent. the legal definition you posted is based on the medical definition. We are not talking about \"impulse and control\" issues (that darn reading retention problem again), we are talking about impulse control issues, which is the inability to control improper impulses. \n\n \n And what is improper impulses?\n Impulse control is made up of 2 words.\n I got my definition from a legal aspect not medical.\n But if you like the long winded version (truely legal form....party of the first party type of english) check out ohio for example,even though each state is different on all laws this is just one state. http://www.ohiolaw.net/faq/Sexual_Predator.htm\n I do not look at second rate sites to get information.\n I usually look up government sites and court sites as well as medical sites when the topic needs researching.\n I never look up government sites for medical conditions as well as medical sites for government sentencing.\n That would be like calling the NRA to find out laws against drugs.\n Not their field of expertise.\n \n \n \n\n No, it wouldn't, unless you wanted to argue that the man felt compelled to do so, and was unable to control that compulsion. Even so, another requirement for somebody to meet the definition of a sexual predator is that feel an overwhelming desire to dominate or control their victim. It would be unusual for a sexual predator to accept voluntary sex (in many cases) because it would not feed their need for domination. IT has been argued that certain types of sexual dysfunction such as sexual addiction are milder forms of the same impulse control problems that sadists have. \n\n \n Sexual dysfunction,sexual addiction and sexual predator are different ofcourse.\n It was a spur of the moment decision?\n Sorry your honor I know it will never happen again.\n Sexual dysfunction (erectile problems) and sexual addiction (needs it 10 times a day) is a problem but only a medical one.\n Sexual Predator as you say is a need for domination.\n But that isn't all.\n Sexual predators also are on the \"hunt\" for sex.\n That could be a bar hopper,web surfer,anyone.\n If they don't use controling factors it is ok (ie consent).\n But rapists have yet to use self control.\n And child molesters also have yet to use self control.\n Rapist do not say \"may I have sex with you\" while they are doing it.\n Rapist is all about control.\n Molestors are all about control with usually the young but not limited to just age.\n \n \n\n It has been suggested that sexual predators (which can be used interchangeably with \"sexual psychopath) have abnormalities in the paralimbic system. \n\n \n Very true\n \n \n\n There is an article at http://www.nctimes.com/articles/2005/09/12/news/californian/20_47_359_10_05.txt that does a reasonably good job of touching base on some of the possible physiological causes of sexual predation.\n\n \n \n Good source of true knowledge.\n The media.\n North Carolina times?\n I have read article milk is bad.\n I have read articles milk is good.\n Smoking kills,but it also relaxes and lowers stress.\n Drinking a little can help you live longer.\n Alcohol kills.\n I take the medias information and run it through so many tests because the media is one sided.\n \n \n\n The divide between a sexual predator and a normal sex offender is great enough that most states have \"habitual sexual violator\" laws along with sexual predator laws. A habitual sexual violator is somebody who commits multiple offenses, but does not fit the definition of a sexual predator. \n\n \n True.\n Although I never heard of a sex offender as being referred to as normal.\n But now you are lumping a flasher with a rapist.\n \n \n\n And for the third time, I ask you to point out which states. I would be interested to see exactly how they codify such a thing to make it illegal. I spent some time looking and could not find anything, so I called my county prosecutor to see if he came across anything when I originally asked the question of him. He also was unaware of any relevant statute or case law in any state and would be interested in a statute # or case # so he can see what his para missed when researching the issue. He also thought it would be exceptionally difficult to codify something like that without just outlawing non functional boxes with LCD displays.\n\n \n \n I have heard of cases in New York and even here in Michigan,a considerable amount of legislation exists regarding a patient's right to pain management. \n Several states have statutes that address this issue. \n Some of these statutes are based on the Federation of State Medical Boards Model Guidelines for the use of controlled substances for the treatment of pain.\n It is not the use of placebos in and of itself that is illegal.\n It is when the placebos are sold or distributed with the sales pitch of it being a medical cure,treatment,etc.. and by taking it it doesn't help the problem and in fact the patient gets worse or dies.\n If the patient is treated with a placebo and they do get better there is never a lawsuit.\n It is a waste of time.\n It is only when someone dies from it or when by using the placebo instead of proven treatment plans the person gets worse can a law suit happen.\n I just wouldn't want to be the person who runs into the one person who did not make it.\n If you treat impotence with a placebo it is not going to lead to a lawsuit ever.\n But if you treat a gun shot wound with a placebo it could.\n \n \n\n some places in the world it is nto treated as that severe.\n\n \n \n This may be true.\n But are we the rest of the world?\n Some places see using drugs as a good thing,others see prostitution as good and some see shooting someone over the loss of honor a good thing.\n Others believe in suicide to regain honor.\n That is other places in the world.\n We are america.\n We should not do what other countries do nor should we say we won't do what they do.\n We need to see if it will work here before doing it.\n \n \n \n\n this is not an \"example\", it is a ridiculously grandiose exaggeration. Get your emotions under control then try again\n\n \n My emotions are under control.\n But maybe we can make it simple.\n Why should a child molester be given less time than an armed robber who did not hurt anyone?\n Based on your answers he should (because the money being taken can qualify as loss of property) or should they both walk?\n Your original post said it was unreasonable for any of the answers in the poll even though one of them had 20 years OR LESS,which could be 6 months for all we know.\n And since you wanted to tout the use of drugs used to treat offenders I also pulled up medical for that because the use of drugs to treat sexual offenders is gaining strength and is very common but they still have to be watched and locked up for a time.\n One day they will find a drug that works 100% of the time and they won't need to lock them up but it hasn't happened 100% of the time and I am not willing to deal with 97% when my kids could be in the 3% margin.", 
   {}, 
   176412, 
   null, 
   1130915820.0
  ], 
  [
   176600, 
   null, 
   "Dono", 
   "I have enjoyed the exchanges between Soulwolf and Daewoo. I have no doubt that Soulwolf is a valuable employee whose efforts contribute to the success of his employer and provides him and his family with a good and stable lifestyle ....... a success story. My heros have always been entrepreneurs, those people who take the risks and build the businesses that fuel the economy and provide the jobs for people like Soulwolf and myself (before I retired). Many try and fail, some succeed, some don't, but they keep the wheels turning and I admire that. Another group I admire are the innovators (and Soulwolf may be a member of this group), those who come up with new and better ways to do things, with new and better products and services. I had the privilege to work with many such people in the early days of vacuum tube big box computers and automated process control systems. I apologize if I am off topic, but I see the work ethic and willingness to \"pay the price\" that was common in my father's generation disappearing at a time when we need them more than ever.\n Dono", 
   {}, 
   176443, 
   null, 
   1130967720.0
  ], 
  [
   176646, 
   null, 
   "sinjin", 
   "My only problem with all of this is that little disctinction is made between those who raised their own capital and those capitalized at birth. Of course that's just me wishing for a fair and just world. Dream on.\n I often here people say a person's value to society cannot be measured by their wealth. They're never rich.", 
   {}, 
   176600, 
   null, 
   1130978160.0
  ], 
  [
   176660, 
   null, 
   "soulwolf", 
   "My only problem with all of this is that little disctinction is made between those who raised their own capital and those capitalized at birth. Of course that's just me wishing for a fair and just world. Dream on.\n I often here people say a person's value to society cannot be measured by their wealth. They're never rich.\n\n That is extremely true.\n I know this has gotten somewhat off topic but what should the punishment be for child molestors?\n I think in all this excitement Myself and Daewoo have gotten off track by debating other issues and lost track of what this one was about.\n But you are very right in your judgement.\n But then again usually I see the bumper sticker of \"God is my copilot\" on cars that have been in an accident.\n Makes me wonder if they should find a new copilot.", 
   {}, 
   176646, 
   null, 
   1130980860.0
  ], 
  [
   176710, 
   null, 
   "daewoo", 
   "I have enjoyed the exchanges between Soulwolf and Daewoo. I have no doubt that Soulwolf is a valuable employee whose efforts contribute to the success of his employer and provides him and his family with a good and stable lifestyle ....... a success story. My heros have always been entrepreneurs, those people who take the risks and build the businesses that fuel the economy and provide the jobs for people like Soulwolf and myself (before I retired). Many try and fail, some succeed, some don't, but they keep the wheels turning and I admire that. Another group I admire are the innovators (and Soulwolf may be a member of this group), those who come up with new and better ways to do things, with new and better products and services. I had the privilege to work with many such people in the early days of vacuum tube big box computers and automated process control systems. I apologize if I am off topic, but I see the work ethic and willingness to \"pay the price\" that was common in my father's generation disappearing at a time when we need them more than ever.\n Dono\n\n \n \n The only difference between those who suceed and those who fail is the ability to learn from their mistakes, ADMIT when they made a mistake, and the willingness to accept unpleasant realities of life as opposed to living in a cloud of optimism. The cloud of optimism is certainly more fun, but unless you face reality, no matter how unpleasant, you can not make good decisions.\n \n The only other element required is the ability to WORK, and none of that pansy 40 hour per week stuff. If you are not willing to put in 80 to 100 hours per week, you are likely to fail. A lot fo small business people make the mistake of believig that owning their own business would mean the freedom to do what they want. In the real world, if you are your own boss, you had better be the hardest boss you have ever had.", 
   {}, 
   176600, 
   null, 
   1130994480.0
  ], 
  [
   176712, 
   null, 
   "daewoo", 
   "My only problem with all of this is that little disctinction is made between those who raised their own capital and those capitalized at birth. Of course that's just me wishing for a fair and just world. Dream on.\n I often here people say a person's value to society cannot be measured by their wealth. They're never rich.\n\n \n There is no distinction in mose cases. Most \"old money\" families raise and groom their children from birth to someday grow up and take over the family empire. New money tends to spawn people like that idiot hilton girl. That is why the divide exists. Getting the money is nothing. Holding onto it, especially over several generations, is the trick.\n \n I have also heard it said that money cannot buy happiness. This is true, but it can make about 99.75% of your problems go away, which is a good start.", 
   {}, 
   176646, 
   null, 
   1130994720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What do you think the penalty for child molesters should be?", 
  "url": "http://www.4forums.com/political/crime-debates/382-what-do-you-think-penalty-child-molesters-should.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 382, 
  "discussion_files": [
   [
    "32026.html", 
    "http://www.4forums.com/political/crime-debates/382-what-do-you-think-penalty-child-molesters-should-print.html"
   ], 
   [
    "32027.html", 
    "http://www.4forums.com/political/crime-debates/382-what-do-you-think-penalty-child-molesters-should-10-print.html"
   ], 
   [
    "32028.html", 
    "http://www.4forums.com/political/crime-debates/382-what-do-you-think-penalty-child-molesters-should-8-print.html"
   ], 
   [
    "32029.html", 
    "http://www.4forums.com/political/crime-debates/382-what-do-you-think-penalty-child-molesters-should-6-print.html"
   ], 
   [
    "32030.html", 
    "http://www.4forums.com/political/crime-debates/382-what-do-you-think-penalty-child-molesters-should-4-print.html"
   ], 
   [
    "32031.html", 
    "http://www.4forums.com/political/crime-debates/382-what-do-you-think-penalty-child-molesters-should-5-print.html"
   ], 
   [
    "32032.html", 
    "http://www.4forums.com/political/crime-debates/382-what-do-you-think-penalty-child-molesters-should-7-print.html"
   ], 
   [
    "32033.html", 
    "http://www.4forums.com/political/crime-debates/382-what-do-you-think-penalty-child-molesters-should-9-print.html"
   ], 
   [
    "32034.html", 
    "http://www.4forums.com/political/crime-debates/382-what-do-you-think-penalty-child-molesters-should-3-print.html"
   ], 
   [
    "32035.html", 
    "http://www.4forums.com/political/crime-debates/382-what-do-you-think-penalty-child-molesters-should-2-print.html"
   ]
  ], 
  "identifier": 382
 }
]