[
 [
  [
   79828, 
   null, 
   "Richbee", 
   "Contrary to popular definitions, true tolerance means &#8220;putting up with error&#8221;&#8212;not &#8220;being accepting of all views.&#8221;\n \n Paul Copan, Ph. D. writes,\n \n We don&#8217;t tolerate what we enjoy or approve of&#8212;like chocolate or Bach&#8217;s music. \n \n By definition, what we tolerate is what we disapprove of or what we believe to be false and erroneous.\n \n Furthermore, tolerance presupposes an adequate grasp of what another person believes&#8212;as well as a knowledge of the strengths and weaknesses of such belief. Actually, if disagreement didn&#8217;t exist, then tolerance would be unnecessary. It is because real differences exist between people that tolerance becomes necessary and virtuous. \n \n The contemporary definition of tolerance as acceptance is simply wrong-headed. It lands a person in massive inconsistencies. Take the matter of &#8220;comparative religions.&#8221; The leveling approach of comparative religions (&#8220;when we talk with people from other religious groups, we should consider all religions equal) arbitrarily asserts without qualification the equal validity or relative nature of all religions. Dialogue, however, shouldn&#8217;t begin by assuming the equality of all religions or truth claims (the erroneous definition of tolerance), but with regard for the equality of persons. Dialogue implies respect, not agreement.\n \n A Christian can interact with and respect a Buddhist while still believing on rational grounds that he is mistaken. In fact, the belief that both views cannot be right is an impetus to engage in meaningful dialogue. Dialogue thus becomes an opportunity for both sides to reexamine their presuppositions and clarify their positions. True tolerance grants people the right to dissent.\n \n It is very important that a Christian criticized for intolerance asks his accuser what he means by &#8220;intolerance.&#8221; The accuser will probably say something like &#8220;not being accepting of another&#8217;s beliefs.&#8221; To this the Christian can gently respond, &#8220;But you are not being accepting of my position. You think I am wrong.&#8221; The relativist simply cannot be accepting of all positions as true without falling into severe contradictions. \n \n The reality of God actually makes tolerance intelligible, because God is the source of truth and because God has made human beings in his likeness. Naturalistic secularism has no such foundation for tolerance. \n \n If tolerance is a value, it isn&#8217;t obvious from nature; so if there is no God and we are just hulks of protoplasmic guck, how could tolerance be an objective value at all? \n \n Instead, if objective truth exists, as religion maintains, then we must seek and seriously discuss it despite our differing worldviews. But if objective truth doesn&#8217;t exist, as secularism generally maintains, then relativism obliterates genuine differences of perspective.\n \n &#8220;Who are you to Judge Others? - In Defense of Making Moral Judgments - Click Here", 
   {
    "post_info": {
     "post_title": "Tolerance and Religion - Singin' Kumbaya?"
    }
   }, 
   null, 
   null, 
   1101857220.0
  ], 
  [
   79840, 
   null, 
   "sinjin", 
   "from dictionary.com:\n \n tol·er·ance - \n \n 1. The capacity for or the practice of recognizing and respecting the beliefs or practices of others.\n \n \n I don't find anything about \"error\". I understand your need to mangle the language to suit your argument. I think it's called \"oralgamy\".", 
   {}, 
   79828, 
   null, 
   1101858540.0
  ], 
  [
   79850, 
   null, 
   "Richbee", 
   "from dictionary.com:\n \n tol·er·ance - \n \n 1. The capacity for or the practice of recognizing and respecting the beliefs or practices of others.\n \n \n I don't find anything about \"error\". I understand your need to mangle the language to suit your argument. I think it's called \"oralgamy\".\n\n \n If everything were true, what then, would be the meaning of False?", 
   {}, 
   79840, 
   null, 
   1101860040.0
  ], 
  [
   79857, 
   null, 
   "Waxy", 
   "If everything were true, what then, would be the meaning of False?\n\n \n LOL.\n \n Ohhh man, it just keeps getting better. :p \n \n Waxy", 
   {}, 
   79850, 
   null, 
   1101860400.0
  ], 
  [
   79861, 
   null, 
   "Richbee", 
   "from dictionary.com:\n \n tol·er·ance - \n \n 1. The capacity for or the practice of recognizing and respecting the beliefs or practices of others.\n \n \n I don't find anything about \"error\". I understand your need to mangle the language to suit your argument. I think it's called \"oralgamy\".\n\n \n To put another way, Religion has to do with our convictions, not our preferences.\n \n Our opinions shape our Preferences.\n \n Conversely, our convictions are shaped by matters of our conscience.", 
   {}, 
   79840, 
   null, 
   1101860700.0
  ], 
  [
   79863, 
   null, 
   "sinjin", 
   "If everything were true, what then, would be the meaning of False?\n\n \n When two people have a difference of opinion it is not immediately clear which, if either, is in \"error\". There is no possible way to know if the doctrine you accept is \"true\".", 
   {}, 
   79850, 
   null, 
   1101860940.0
  ], 
  [
   79865, 
   null, 
   "Richbee", 
   "When two people have a difference of opinion it is not immediately clear which, if either, is in \"error\". There is no possible way to know if the doctrine you accept is \"true\".\n\n \n Now we're getting somewhere.\n \n Tolerance also means that we understand what each party believes.\n \n I would agree, not every person will conclude that a belief represents error, then again, looking back a few years ago, if you were in San Diego and met members of Heaven's Gate and say, Cool man, go hook up with your comet, see ya'?\n \n Or, might you, after informing yourself, pronounce Marshall Applewhite, WRONG?\n \n Synopsis:\n \n Heaven&#8217;s Gate taught that remaining on earth was suicide, because it had been revealed to &#8220;the Representative&#8221; (a.k.a. Applewhite) that earth would soon be &#8220;recycled&#8221; or &#8220;spaded under.&#8221; There was a narrow window of time to escape the bonds of earth and join the Kingdom of Heaven. The Hale-Bopp comet was &#8220;the marker&#8221; signaling the time of their &#8220;departure.&#8221;", 
   {}, 
   79863, 
   null, 
   1101861300.0
  ], 
  [
   79872, 
   null, 
   "sinjin", 
   "Now we're getting somewhere.\n \n Tolerance also means that we understand what each party believes.\n \n I would agree, not every person will conclude that a belief represents error, then again, looking back a few years ago, if you were in San Diego and met members of Heaven's Gate and say, Cool man, go hook up with your comet, see ya'?\n \n Or, might you, after informing yourself, pronounce Marshall Applewhite, WRONG?\n \n Synopsis:\n \n Heaven's Gate taught that remaining on earth was suicide, because it had been revealed to \"the Representative\" (a.k.a. Applewhite) that earth would soon be \"recycled\" or \"spaded under.\" There was a narrow window of time to escape the bonds of earth and join the Kingdom of Heaven. The Hale-Bopp comet was \"the marker\" signaling the time of their \"departure.\"\n\n \n Just because I think you're wrong in your \"belief\" does not mean I am right in mine. I \"believe\" I'm right. Error is definite, objective.", 
   {
    "unicode_changes_made": true
   }, 
   79865, 
   null, 
   1101862800.0
  ], 
  [
   79898, 
   null, 
   "Dzeron", 
   "Contrary to popular definitions, true tolerance means \"putting up with error\"-not \"being accepting of all views.\"\n \n Paul Copan, Ph. D. writes,\n \n We don't tolerate what we enjoy or approve of-like chocolate or Bach's music. \n \n By definition, what we tolerate is what we disapprove of or what we believe to be false and erroneous.\n \n Furthermore, tolerance presupposes an adequate grasp of what another person believes-as well as a knowledge of the strengths and weaknesses of such belief. Actually, if disagreement didn't exist, then tolerance would be unnecessary. It is because real differences exist between people that tolerance becomes necessary and virtuous. \n \n The contemporary definition of tolerance as acceptance is simply wrong-headed. It lands a person in massive inconsistencies. Take the matter of \"comparative religions.\" The leveling approach of comparative religions (\"when we talk with people from other religious groups, we should consider all religions equal) arbitrarily asserts without qualification the equal validity or relative nature of all religions. Dialogue, however, shouldn't begin by assuming the equality of all religions or truth claims (the erroneous definition of tolerance), but with regard for the equality of persons. Dialogue implies respect, not agreement.\n \n A Christian can interact with and respect a Buddhist while still believing on rational grounds that he is mistaken. In fact, the belief that both views cannot be right is an impetus to engage in meaningful dialogue. Dialogue thus becomes an opportunity for both sides to reexamine their presuppositions and clarify their positions. True tolerance grants people the right to dissent.\n \n It is very important that a Christian criticized for intolerance asks his accuser what he means by \"intolerance.\" The accuser will probably say something like \"not being accepting of another's beliefs.\" To this the Christian can gently respond, \"But you are not being accepting of my position. You think I am wrong.\" The relativist simply cannot be accepting of all positions as true without falling into severe contradictions. \n \n The reality of God actually makes tolerance intelligible, because God is the source of truth and because God has made human beings in his likeness. Naturalistic secularism has no such foundation for tolerance. \n \n If tolerance is a value, it isn't obvious from nature; so if there is no God and we are just hulks of protoplasmic guck, how could tolerance be an objective value at all? \n \n Instead, if objective truth exists, as religion maintains, then we must seek and seriously discuss it despite our differing worldviews. But if objective truth doesn't exist, as secularism generally maintains, then relativism obliterates genuine differences of perspective.\n \n \"Who are you to Judge Others? - In Defense of Making Moral Judgments - Click Here\n\n \n I disagree here with the assertion that secularism disregards tolerance. Secularists (i.e. atheists, agnostics, and deists) support tolerance due to their social-political theories (usually liberalism or libertarianism.) A society without tolerance is, in effect, a theocracy. No secularist supports theocracy!", 
   {
    "unicode_changes_made": true
   }, 
   79828, 
   null, 
   1101875160.0
  ], 
  [
   79968, 
   null, 
   "Richbee", 
   "\"Don&#8217;t Laugh at Me\" sent ripples through the culture in 1999 and led to a Country Music Award nomination for \"Song of the Year.\" That same year another well-known musical group recorded the song with some additional lyrics. Here is a snippet with the addition:\n \n I&#8217;m fat, I&#8217;m thin, I&#8217;m short, I&#8217;m tall\n I&#8217;m deaf, I&#8217;m blind, yes, I think in a way, we&#8217;re all\n I&#8217;m black, I&#8217;m white and I am brown\n I&#8217;m Christian, I&#8217;m Jewish, and I am Muslim\n I&#8217;m gay, I&#8217;m lesbian, I&#8217;m American Indian\n I&#8217;m very, very young, I&#8217;m quite aged\n I&#8217;m very wealthy, I&#8217;m very, very poor\n \n Don&#8217;t laugh at me\n Don&#8217;t call me names\n Don&#8217;t get your pleasure from my pain\n In God&#8217;s eyes we're all the same\n Someday we&#8217;ll all have perfect wings\n Don&#8217;t laugh at me\n \n This song speaks to a need in our present culture of prejudice and hate. In fact, this song, including the addition, is used as part of a \"tolerance\" education program by Education World, a subsidiary of one of the largest providers of learning management solutions in the world.\n \n I can relate to this song, especially when reflecting on my teen years. Having divorced parents, I often felt taunted and weak to the blows of insulting peers. There was little refuge. I wanted others to realize that I did not choose my lot in life, but it was handed to me by the poor choices of others. If anything, I needed restoration, not humiliation. I believe most people can relate to these experiences in some way. The bullies sometimes seem to have the last word. This song speaks well to that issue.\n \n But in trying to speak to a need, the song over-speaks itself. The categories listed in this song range from ethnicity, to religion, to morality, to economics, to age, to body shapes. But the problem enters when it equates the conditions of each of these. This is evident in the last lines, \"In God&#8217;s eyes we&#8217;re all the same/Someday we&#8217;ll all have perfect wings.\"\n \n That statement smuggles in the idea that all the categories listed previously do not ultimately matter. Instead of merely speaking against abuses, the song has overstepped its bounds and made blurry judgments about morality and religion.\n \n While we should not be laughing at people who disagree with us or are different from us, we should also not consider that God smiles happily down on all belief systems and certain immoral decisions. Ethnicity and economics are indifferent to the most important ideas in life. Morality and religion are not.\n \n I believe that when people often talk about \"tolerance\" they are meaning \"love.\" And when we speak out about confusion over tolerance, some people only hear, \"I don&#8217;t care about love.\" \n \n This would be a false dichotomy.\n \n RZIM.org", 
   {
    "post_info": {
     "post_title": "Love and Tolerance - What is Politically Correct?"
    }
   }, 
   79898, 
   null, 
   1101924600.0
  ], 
  [
   80212, 
   null, 
   "Orion", 
   "\"A lie told often enough becomes the truth.\" - Lenin\n\n \n You would do well to pay close attention to this quote of yours, Richbee.", 
   {}, 
   79968, 
   null, 
   1101983940.0
  ], 
  [
   80247, 
   null, 
   "Richbee", 
   "You would do well to pay close attention to this quote of yours, Richbee.\n\n \n You would do better to end your canards about the Bible, as you keep losing.\n \n Still steaming about the Tyre prophesy? Time for another bath in the harbor? You know, the harbor that was previously the glory of the Eastern Mediterranean, and the commercial hub of the Kingdom of Tyre? What happened to the King of Tyre?", 
   {
    "post_info": {
     "post_title": "End your One Size fits all Theology Orion"
    }
   }, 
   80212, 
   null, 
   1102011060.0
  ], 
  [
   80791, 
   null, 
   "zachvac", 
   "\"Don?t Laugh at Me\" sent ripples through the culture in 1999 and led to a Country Music Award nomination for \"Song of the Year.\" That same year another well-known musical group recorded the song with some additional lyrics. Here is a snippet with the addition:\n \n I?m fat, I?m thin, I?m short, I?m tall\n I?m deaf, I?m blind, yes, I think in a way, we?re all\n I?m black, I?m white and I am brown\n I?m Christian, I?m Jewish, and I am Muslim\n I?m gay, I?m lesbian, I?m American Indian\n I?m very, very young, I?m quite aged\n I?m very wealthy, I?m very, very poor\n \n Don?t laugh at me\n Don?t call me names\n Don?t get your pleasure from my pain\n In God?s eyes we're all the same\n Someday we?ll all have perfect wings\n Don?t laugh at me\n \n This song speaks to a need in our present culture of prejudice and hate. In fact, this song, including the addition, is used as part of a \"tolerance\" education program by Education World, a subsidiary of one of the largest providers of learning management solutions in the world.\n \n I can relate to this song, especially when reflecting on my teen years. Having divorced parents, I often felt taunted and weak to the blows of insulting peers. There was little refuge. I wanted others to realize that I did not choose my lot in life, but it was handed to me by the poor choices of others. If anything, I needed restoration, not humiliation. I believe most people can relate to these experiences in some way. The bullies sometimes seem to have the last word. This song speaks well to that issue.\n \n But in trying to speak to a need, the song over-speaks itself. The categories listed in this song range from ethnicity, to religion, to morality, to economics, to age, to body shapes. But the problem enters when it equates the conditions of each of these. This is evident in the last lines, \"In God?s eyes we?re all the same/Someday we?ll all have perfect wings.\"\n \n That statement smuggles in the idea that all the categories listed previously do not ultimately matter. Instead of merely speaking against abuses, the song has overstepped its bounds and made blurry judgments about morality and religion.\n \n While we should not be laughing at people who disagree with us or are different from us, we should also not consider that God smiles happily down on all belief systems and certain immoral decisions. Ethnicity and economics are indifferent to the most important ideas in life. Morality and religion are not.\n \n I believe that when people often talk about \"tolerance\" they are meaning \"love.\" And when we speak out about confusion over tolerance, some people only hear, \"I don?t care about love.\" \n \n This would be a false dichotomy.\n \n RZIM.org\n\n \n Well the original song is used to stop violence because of bullying people who are \"fat, thin, short, tall, etc.\" I never heard about the additional lyrics, but I don't think God really was in any way the key point. Here is the whole, original song by Mark Wills:\n \n I'm a little boy with glasses\n The one they call the geek\n A little girl who never smiles\n 'Cause I've got braces on my teeth\n And I know how it feels\n To cry myself to sleep\n \n I'm that kid on every playground\n Who's always chosen last\n A single teenage mother\n Tryin' to overcome my past\n You don't have to be my friend\n But is it too much to ask\n \n Don't laugh at me\n Don't call me names\n Don't get your pleasure from my pain\n In God's eyes we're all the same\n Someday we'll all have perfect wings\n Don't laugh at me\n \n \n \n \n I'm the cripple on the corner\n You've passed me on the street\n And I wouldn't be out here beggin'\n If I had enough to eat\n And don't think I don't notice\n That our eyes never meet\n \n I lost my wife and little boy when\n Someone cross that yellow line\n The day we laid them in the ground\n Is the day I lost my mind\n And right now I'm down to holdin'\n This little cardboard sign...so\n \n Don't laugh at me\n Don't call me names\n Don't get your pleasure from my pain\n In God's eyes we're all the same\n Someday we'll all have perfect wings\n Don't laugh at me\n \n I'm fat, I'm thin, I'm short, I'm tall\n I'm deaf, I'm blind, hey, aren't we all\n \n Don't laugh at me\n Don't call me names\n Don't get your pleasure from my pain\n In God's eyes we're all the same\n Someday we'll all have perfect wings\n Don't laugh at me\n \n \n The point was that people who are in unfortunate situations shouldn't be laughed at, not that it doesn't matter and God will make us all better when we die. It's talking about beggars on the street who everyone hates for giving the city a bad reputation, a teenage mother, a man who's lost his wife and kids, a kid who's fat, etc. It's saying we should be tolerant of all people but the reason wasn't because in God's eyes we're all the same, the reason was \n \n I lost my wife and little boy when\n Someone cross that yellow line\n The day we laid them in the ground\n Is the day I lost my mind\n And right now I'm down to holdin'\n This little cardboard sign\n \n It's pointing out that people don't choose to be victims and he decided to add a little bit of his own beliefs in (which is fine, it's his music) about how we're all the same in God's eyes, but that was more of a comforting statement to people like that than a reason we should be tolerant.", 
   {}, 
   79968, 
   null, 
   1102201440.0
  ], 
  [
   80793, 
   null, 
   "Richbee", 
   "how we're all the same in God's eyes, but that was more of a comforting statement to people like that than a reason we should be tolerant.\n\n \n Yes, God loves all of us, and we are all equal in God's eyes, from birth, to life, to death and even unto Judgment Day!\n \n Not all ideas are equal.\n \n People often confuse Love and Tolerance.\n \n Love does not rejoice in evil, or condone evil ideas and behaviors.", 
   {}, 
   80791, 
   null, 
   1102201860.0
  ], 
  [
   80795, 
   null, 
   "zachvac", 
   "Yes, God loves all of us, and we are all equal in God's eyes, from birth, to life, to death and even unto Judgment Day!\n \n Not all ideas are equal.\n \n People often confuse Love and Tolerance.\n \n Love does not rejoice in evil, or condone evil ideas and behaviors.\n\n \n I don't get exactly what you mean, or why you gave that quote. and how do you measure ideas to see if they're equal? What is love? what is evil? These are subjective. Love and tolerance are different, of course they are. We should be tolerant of people of other beliefs, we don't have to love them. This is a very random post that doesn't seem to go with the quote you gave.", 
   {}, 
   80793, 
   null, 
   1102202040.0
  ], 
  [
   80805, 
   null, 
   "Richbee", 
   "I don't get exactly what you mean, or why you gave that quote. and how do you measure ideas to see if they're equal? What is love? what is evil? These are subjective. Love and tolerance are different, of course they are. We should be tolerant of people of other beliefs, we don't have to love them. This is a very random post that doesn't seem to go with the quote you gave.\n\n \n We can judge good Vs. evil and both ideas and behaviors in light of an objective moral standard - God and the Bible.\n \n It is the Atheist who has no foundational standard for morality. emoticon_xbanghead", 
   {}, 
   80795, 
   null, 
   1102206060.0
  ], 
  [
   80896, 
   null, 
   "zachvac", 
   "We can judge good Vs. evil and both ideas and behaviors in light of an objective moral standard - God and the Bible.\n \n It is the Atheist who has no foundational standard for morality. emoticon_xbanghead\n\n \n No, it's the atheist who can decide for himself what his own morals are. It's the Christian who has to look up the way he acts and his morals in a book.", 
   {}, 
   80805, 
   null, 
   1102270080.0
  ], 
  [
   80911, 
   null, 
   "Richbee", 
   "No, it's the atheist who can decide for himself what his own morals are. It's the Christian who has to look up the way he acts and his morals in a book.\n\n \n In America the Christians built the foundation for the greatest Democracy in the World! And, BTW, I hope you're not intolerant of our Christian history?\n \n In his essay \"What I Saw in America,\" the great English writer G. K. Chesterton observed that:\n \"America is the only nation in the world that is founded on a creed. That creed is set forth with dogmatic and even theological lucidity in the Declaration of Independence.\" \n Chesterton was referring to the second paragraph of America's founding document which states:\n \"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable rights, that among these are life, liberty and the pursuit of happiness\" \n The starting point of the Declaration's argument was faith in man's \"Creator,\" \n and is very similar to the Apostle Paul's initial proposition in his letter to the Romans:\n \"Because that which is known about God is evident within them; for God made it evident to them. For since the creation of the world His invisible attributes, His eternal power and divine nature, have been clearly seen, being understood through what has been made, so that they are without excuse\" (Romans 1:19-20). \n Also, The Book, that is the Bible, prophesies from around 600 B.C, the time will come when I will write my Law on Men's hearts!\n \n Jesus is in my heart and soul! And, besides, even as children, intuitively we know right from wrong. And, this God is who? Note, that we are all created in the likeness of God!", 
   {
    "post_info": {
     "post_title": "We are endowed by our Creator"
    }
   }, 
   80896, 
   null, 
   1102280100.0
  ], 
  [
   80949, 
   null, 
   "zachvac", 
   "In America the Christians built the foundation for the greatest Democracy in the World! And, BTW, I hope you're not intolerant of our Christian history?\n \n\n how can I be intolerant of history? I am not ignorant of it if that's what you meant to say, but how can I be tolerant or intolerant of something that for sure happened?\n \n In his essay \"What I Saw in America,\" the great English writer G. K. Chesterton observed that:\n \"America is the only nation in the world that is founded on a creed. That creed is set forth with dogmatic and even theological lucidity in the Declaration of Independence.\" \n Chesterton was referring to the second paragraph of America's founding document which states:\n \"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable rights, that among these are life, liberty and the pursuit of happiness\" \n The starting point of the Declaration's argument was faith in man's \"Creator,\" \n and is very similar to the Apostle Paul's initial proposition in his letter to the Romans:\n \"Because that which is known about God is evident within them; for God made it evident to them. For since the creation of the world His invisible attributes, His eternal power and divine nature, have been clearly seen, being understood through what has been made, so that they are without excuse\" (Romans 1:19-20). \n Also, The Book, that is the Bible, prophesies from around 600 B.C, the time will come when I will write my Law on Men's hearts!\n \n Jesus is in my heart and soul! And, besides, even as children, intuitively we know right from wrong. And, this God is who? Note, that we are all created in the likeness of God![/QUOTE]\n \n Yes they put that in the declaration of independence, but those were just a bunch of religious people who wanted independence. When it came time to actually form a government you'll notice they didn't put anything about religion in the Constitution (the basis for our laws) and added an ammendment (1st) to give us the freedom of religion and stop the governmeent from admiting one religion is right.", 
   {}, 
   80911, 
   null, 
   1102300680.0
  ], 
  [
   81465, 
   null, 
   "Richbee", 
   "Yes they put that in the declaration of independence, but those were just a bunch of religious people who wanted independence. When it came time to actually form a government you'll notice they didn't put anything about religion in the Constitution (the basis for our laws) and added an ammendment (1st) to give us the freedom of religion and stop the governmeent from admiting one religion is right.\n\n \n Actually, the goal of the US C' was to United the thirteen colonies who were 98% Christian, but of many denominations.\n \n So the US C' is not really a \"secular\" or Anti-Religious document, but one that was written to gain approval and acceptance by ALL americans and indeed their is a genius to it, and written by Christians. John Adams, Alexander Hamilton and Madison to a name a few. Were their five?\n \n Oh, and note the phrase, \"With the Blessings of Liberty......\"", 
   {}, 
   80949, 
   null, 
   1102487820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Tolerance and Religion - Singin' Kumbaya?", 
  "url": "http://www.4forums.com/political/religion-debates/3832-tolerance-religion-singin-kumbaya.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 3832, 
  "discussion_files": [
   [
    "22858.html", 
    "http://www.4forums.com/political/religion-debates/3832-tolerance-religion-singin-kumbaya-print.html"
   ], 
   [
    "22859.html", 
    "http://www.4forums.com/political/religion-debates/3832-tolerance-religion-singin-kumbaya-2-print.html"
   ]
  ], 
  "identifier": 3832
 }
]