[
 [
  [
   79906, 
   null, 
   "Siegfriedson", 
   "Jerusalem's Dirty Little Secret\n \n by Eric J. Greenberg of The Forward\n \n It has been Jerusalem's dirty little secret for decades: Orthodox yeshiva students and other Jewish residents vandalizing churches and spitting on Christian clergyman as they walk along the narrow, ancient stone streets of the Old City.\n \n Now, however, following a highly publicized fracas last week (Oct. 10) between a yeshiva student and the archbishop of Jerusalem's Armenian Church, the issue is generating unprecedented media attention in Israel. The fight started after a yeshiva student at the respected Har Hamor yeshiva spat on Archbishop Nourhan Manougian during a Christian holy procession in the Old City.\n \n The controversy comes as the Israeli government and Diaspora Jewish organizations have been attempting to focus international attention on what they describe as a surge in antisemitism across the globe. Beyond potentially undermining these efforts, the reports of anti-Christian harassment could weaken Israel's claim to be an effective guardian of Christian and Muslim rights in Jerusalem.\n \n *A few weeks ago, an elderly man wearing a yarmulke spat on a senior Greek Orthodox cleric who was entering a government office in Jerusalem's Givat Shaul section.\n \n *Stars of David were spray-painted on the entrance to the Monastery of the Cross, not far from the Knesset. The Holy Trinity Russian Orthodox Cathedral, near Jerusalem police headquarters, in the so-called Russian Compound in downtown Jerusalem, suffered similar vandalism.\n \n *Churches located in several Orthodox neighborhoods in Jerusalem complained that neighbors had thrown garbage into their yards.\n \n On Sunday (Oct. 17), Israel's Knesset held an emergency meeting and launched an investigation into the apparently rising level of assaults against Christian clergy and churches.\n \n Continued:\n \n http://www.revisionisthistory.org/talmud1.html\n \n \n Video Reveals A Hate Crime That Was Ignored by the Jewish-Dominated US Media: 13-Year-Old Palestinian Girl Gunned Down by Israeli Soldiers\n \n http://www.informationclearinghouse.info/article7363.htm\n \n (click link above for streaming video)\n \n \n Israeli officer: I was right to shoot 13-year-old child\n \n An Israeli army officer who repeatedly shot a 13-year-old Palestinian girl in Gaza dismissed a warning from another soldier that she was a child by saying he would have killed her even if she was three years old.\n \n Continued:\n \n http://www.guardian.co.uk/israel/Story/0,2763,1358173,00.html\n \n \n \n .", 
   {
    "post_info": {
     "post_title": "Hate Crimes Committed by the Chosen People"
    }
   }, 
   null, 
   null, 
   1101883860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Hate Crimes Committed by the Chosen People", 
  "url": "http://www.4forums.com/political/peace-middle-east/3834-hate-crimes-committed-chosen-people.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 3834, 
  "discussion_files": [
   [
    "16665.html", 
    "http://www.4forums.com/political/peace-middle-east/3834-hate-crimes-committed-chosen-people-print.html"
   ]
  ], 
  "identifier": 3834
 }
]