[
 [
  [
   79909, 
   null, 
   "Siegfriedson", 
   " Morality Not the Only Target on Monday Night Football\n \n by Sam Francis\n \n ABC Sports last week took careful aim at the \"moral issues\" that are said to have driven this month's national election and delivered a good swift kick to their dentures on national television.\n \n The main reaction from viewers and the professional \"family values\" lobby has been to denounce the nudity and clearly implied sex of the now-notorious ad that promoted last week's Monday Night Football game. That's all well and good, but there was more going on in the ad that no one will mention-race.\n \n The ad shows blonde white sexpot Nicolette Sheridan of the steamy \"Desperate Housewives\" series smooching up to black football star Terrell Owens in the locker room of the Philadelphia Eagles. Then the young lady drops her bath towel and jumps into Mr. Owens' not-exactly recalcitrant arms.\n \n Continued:\n \n http://www.nationalvanguard.org/story.php?id=4278\n \n \n Click for graphics:\n \n http://www.indystar.com/images/pics2/image-195587-1257.jpg\n \n http://www.resist.com/CARTOON%20GALLERY/NIGGERS/nig_image49.jpg\n \n \n .", 
   {
    "post_info": {
     "post_title": "Interracial Sex Being Pushed More and More"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1101886380.0
  ], 
  [
   80058, 
   null, 
   "Tastyfish", 
   "Well coming from decadent europe, I woud say a big 'so....' however I don't think its purpose was to encourage interracial relations but more opening the add to wider demographics. White woman with famous black football star probably gets more people's attention than if it were a black woman. Are there that many recognisable famous black porn stars as well?", 
   {}, 
   79909, 
   null, 
   1101932520.0
  ], 
  [
   80075, 
   null, 
   "sinjin", 
   "Have you seen Halle Berry? Nuff said.", 
   {}, 
   80058, 
   null, 
   1101933900.0
  ], 
  [
   80103, 
   null, 
   "jitobear", 
   "Have you seen Halle Berry? Nuff said.\n\n \n Gimme some Lenny Kravitz or Cuba Gooding Jr any day.....and there is NOTHING wrong with Fifty Cent's bod.\n \n mmm mmm pretty boyzzzz", 
   {}, 
   80075, 
   null, 
   1101938340.0
  ], 
  [
   80123, 
   null, 
   "joebrummer", 
   "These ads are about shock value, sex and selling products to the public. Any marketing executive will tell you, you cannot sell products unless people remember to buy them, unless people think they are cool etc....\n \n \n It is all shock value. American's love it! Sex sells. If you have a white women and a black man or vice versa, you have covered more demographics. Than having two of the same race. \n \n I think this article really streches things way out of proportion!\n \n \n Besides, I would do Seal in a heartbeat! It those sad eyes!", 
   {}, 
   80103, 
   null, 
   1101940560.0
  ], 
  [
   80161, 
   null, 
   "emclean", 
   "Interracial Sex Being Pushed More and More \n \n DEAR GOD, YOU ARE RIGHT, AND NEXT THEY WILL BE PUSHING INTERACIAL {GASP} GAY COUPLES, AND THEN IS WOULD BE INTERSPECIES, AND THEN GAY INTERSPECIES, AND ALL THAT WOULD BE LEFT WOULD BE COUPLES WITH ONE INADIMIT OBJECT\n \n \n Won't somebody please think of the children?\n Mrs. Lovejoy", 
   {}, 
   80123, 
   null, 
   1101953280.0
  ], 
  [
   80163, 
   null, 
   "Anastasia", 
   "These ads are about shock value, sex and selling products to the public. Any marketing executive will tell you, you cannot sell products unless people remember to buy them, unless people think they are cool etc....\n \n \n It is all shock value. American's love it! Sex sells. If you have a white women and a black man or vice versa, you have covered more demographics. Than having two of the same race. \n \n I think this article really streches things way out of proportion!\n \n \n Besides, I would do Seal in a heartbeat! It those sad eyes!\n\n *waving her hand* Hello That is exactly what I do...\n Sex does sell.\n \n You should see Jessica Alba's butt and Paul Walkers abs.. Film I am working on right now\n Very hot!\n \n Remember who started this thread.... emoticon_rolleyes", 
   {}, 
   80123, 
   null, 
   1101954540.0
  ], 
  [
   80173, 
   null, 
   "pnac=ww3", 
   "These ads are about shock value.\n\n \n That's funny. I saw the same ad and I didn't think twice (or once) about the fact that the woman was white and the man was black. I just flipped the channel.\n \n No shock. No reaction at all actually. I guess I was barely paying attention. TYV has a way of numbing the mind.\n \n It's amazing what will set off certain people. I'm sure Seigfreidson (or someone at his website) was sitting there flipping channels and saw the ad, flipped out, and started this thread.\n \n (ps- Jessica Alba is totally hot, btw. Are you saying she's mixed? If she is I couldn't tell, but that's probably where she got that butt.)", 
   {}, 
   80123, 
   null, 
   1101958860.0
  ], 
  [
   80179, 
   null, 
   "joebrummer", 
   "That's funny. I saw the same ad and I didn't think twice (or once) about the fact that the woman was white and the man was black. I just flipped the channel.\n \n No shock. No reaction at all actually. I guess I was barely paying attention. TYV has a way of numbing the mind.\n \n It's amazing what will set off certain people. I'm sure Seigfreidson (or someone at his website) was sitting there flipping channels and saw the ad, flipped out, and started this thread.\n \n (ps- Jessica Alba is totally hot, btw. Are you saying she's mixed? If she is I couldn't tell, but that's probably where she got that butt.)\n\n \n \n \n There is a funny ad witha mixed race couple that I love. A white women is out on a date with a black man (not that I care, I don't) It is raining and she is driving. She swirves to not hit someone (showing just hoe responsive the car in the ad is..Nissan I think), The man shakes his head and says \"women drivers\"\n \n Then you see they guy on the side of the road in the rain as she drives away.\n I didn't notice the interracial couple thing but my partner did. I just think the commercial is great.", 
   {}, 
   80173, 
   null, 
   1101960060.0
  ], 
  [
   80189, 
   null, 
   "emclean", 
   "You should see Jessica Alba's butt \n \n i would love to, up close, do you think you could arange it???????? :phone:", 
   {}, 
   80179, 
   null, 
   1101962220.0
  ], 
  [
   80400, 
   null, 
   "jitobear", 
   "i would love to, up close, do you think you could arange it???????? :phone:\n\n \n Me too. And I am a straight woman. Good tush is simply good tush.", 
   {}, 
   80189, 
   null, 
   1102047360.0
  ], 
  [
   80709, 
   null, 
   "pnac=ww3", 
   "Me too. And I am a straight woman. Good tush is simply good tush.\n\n hmmmmmmmm if you say so! emoticon_xangel", 
   {}, 
   80400, 
   null, 
   1102146180.0
  ], 
  [
   81032, 
   null, 
   "Anastasia", 
   "Me too. And I am a straight woman. Good tush is simply good tush.\n\n When I screened the movie, I couldn't stop looking at it :)\n and yes you are right good tush is good tush no matter what you are :)\n I think women are far more open to appreciating beauty amongst themselves. That was the point I was trying to make earlier.\n And I don't think it would be a far cry for a straight women to have a lesbian affair because of some attraction, women IMO are more open even when they are straight.\n Hey I have had a crush on Cate Blanchet for years :) Wasnt she amazing in \"Elizabeth\"", 
   {}, 
   80400, 
   null, 
   1102358880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Interracial Sex Being Pushed More and More", 
  "url": "http://www.4forums.com/political/society-debates/3836-interracial-sex-being-pushed-more-more.html", 
  "breadcrumbs": [
   "Society"
  ], 
  "id_number": 3836, 
  "discussion_files": [
   [
    "1981.html", 
    "http://www.4forums.com/political/society-debates/3836-interracial-sex-being-pushed-more-more-print.html"
   ]
  ], 
  "identifier": 3836
 }
]