[
 [
  [
   80409, 
   null, 
   "greg 79 f150", 
   "A 19 year old guy that worked for my employer killed himself yesterday. He was going to college and was working with us during the summer only, to help pay his tuition. I wasnt around the guy very often , but he seemed like a nice fellow , with his head on straight. I overheard some college students that worked with him, saying they just couldnt understand why he did it....\n \n I have to wonder sometimes, when a person gets to that mental stage of hopelessness and personal torment , would the belief in the hereafter have a influence on their decision to permanently terminate themselves or not? I remember a time in my life , back when I was in my early twenties that I was despondent. It was just after my bride of a only a year, up and left me for 3 other guys. I was pretty much destroyed as a person, because I loved her SO much, and I thought marriage vows were forever ( super naive back then I was ). Needless to say, after that \"moment\" in my life, thoughts of self destruction were with me when I awoke , and when I went to sleep. ...\n \n The thoughts were there , but something was keeping me from harming myself. It was not that I knew in my heart , that my self destruction would bring great sadness and embarassment to my family for the rest of THEIR lives. It was not that I cared whether or not anyone would miss me. It was not that I was afraid I would be making a mistake, and miss out on living out the rest of my miserable exsistence... \n \n It was my belief in the \"hereafter\" that kept the destructive thoughts at bay. I had learned some about Christianity and the hereafter , by being \"prompted\" by my Mom to go to a baptist church every Sunday until I was thirteen. When I reached 14, she let me make my own choice on what I wanted to do with my religous followings, or not. The church had taught me that the human body has a soul , and it will face judgement after the death of the physical body. The act of suicide was condemned by my church because the act was an abomination, and considered a unforgivable sin. So, the thought of suicide and my soul spending eternity in Hades, made me admonish the thought of self destruction any more. :) Now 27 years later , I am kind of glad my dear departed Mother made me wash behind my ears, get dressed in my Sunday duds, and go to church. :) ....\n \n Now, take this post for what it is worth, each person is on their own on this one, am sure :) . But as I have seen in the past 20 years , five of my friends in their early 20's took their lives, three more aquaintances did also, and now, a 19 year old I worked with has taken his. I am beginning to think I carry a hideously bad karma around with me. :( ...\n \n It truly seems to me though, even if one does end up taking the Bible as jibberish, if the person somehow ends up believing that the end of their earth life may just not be the \"end \" of the whole show, and that belief keeps them from self destruction, then the teachings of the \"hereafter\" may not be such a bad idealogy after all. all jmo", 
   {
    "post_info": {
     "post_title": "Does the belief in the hereafter preserve life?"
    }
   }, 
   null, 
   null, 
   1102049400.0
  ], 
  [
   80412, 
   null, 
   "joebrummer", 
   "Sometimes it is the guilt that religion leaves on it's followers that casuses them to lose hope. Promoting better mental health care would make a difference. Letting people know that they can get help no matter what. That would help.\n \n People who kill themself are \"unwell\". It usually isn't an overnight decision to take your own life. They ponder it for weeks. Depression changes the brains chemistry. In somecases it even changes the size of the brain if we are talking about emtional trauma (the brain shrinks).\n \n I cannot give you a spiritual answer but I can tell you that teaching more people about Mental Health and the signs of suicide would make a great difference.", 
   {}, 
   80409, 
   null, 
   1102050960.0
  ], 
  [
   80422, 
   null, 
   "Richbee", 
   ".....It was my belief in the \"hereafter\" that kept the destructive thoughts at bay. I had learned some about Christianity and the hereafter , by being \"prompted\" by my Mom to go to a baptist church every Sunday until I was thirteen. When I reached 14, she let me make my own choice on what I wanted to do with my religous followings, or not. The church had taught me that the human body has a soul , and it will face judgement after the death of the physical body. The act of suicide was condemned by my church because the act was an abomination, and considered a unforgivable sin. So, the thought of suicide and my soul spending eternity in Hades, made me admonish the thought of self destruction any more. Now 27 years later , I am kind of glad my dear departed Mother made me wash behind my ears, get dressed in my Sunday duds, and go to church.\n \n Now, take this post for what it is worth, each person is on their own on this one, am sure. But as I have seen in the past 20 years , five of my friends in their early 20's took their lives, three more aquaintances did also, and now, a 19 year old I worked with has taken his. I am beginning to think I carry a hideously bad karma around with me. \n\n \n BTW, suicide is the leading cause of death now, among teenagers, or is it, auto accidents?\n \n Also, set yourself free, there is no bad karma.\n \n As you know, in Christianity it is a sin to commit suicide.\n \n The reason, is that, since we are created by God, in God's likeness, that in effect, we presume the position of God, or over rule God in ending Life.\n \n Clearly, many suffer from clinical depression and mental illiness.\n \n Sadly, many more practice passive suicide through booze, and drugs, attempting to kill themselves slowly, or through stunts, like high speed driving.\n \n The solution? Doctors and counselors are standing by: New Life.com", 
   {}, 
   80409, 
   null, 
   1102053960.0
  ], 
  [
   80424, 
   null, 
   "Richbee", 
   "Sometimes it is the guilt that religion leaves on it's followers that casuses them to lose hope\n\n \n Or, False guilt as it were. Sadly, some refuse to accept that they are forgiven, under any circumstances.\n \n Judas. His guilt from stealing money and betraying Jesus, and his pride were too overwhelming.\n \n In contrast, Peter made a healthy choice, although under different circumstances.", 
   {}, 
   80412, 
   null, 
   1102054560.0
  ], 
  [
   80459, 
   null, 
   "Waxy", 
   "A 19 year old guy that worked for my employer killed himself yesterday. He was going to college and was working with us during the summer only, to help pay his tuition. I wasnt around the guy very often , but he seemed like a nice fellow , with his head on straight. I overheard some college students that worked with him, saying they just couldnt understand why he did it....\n \n I have to wonder sometimes, when a person gets to that mental stage of hopelessness and personal torment , would the belief in the hereafter have a influence on their decision to permanently terminate themselves or not? I remember a time in my life , back when I was in my early twenties that I was despondent. It was just after my bride of a only a year, up and left me for 3 other guys. I was pretty much destroyed as a person, because I loved her SO much, and I thought marriage vows were forever ( super naive back then I was ). Needless to say, after that \"moment\" in my life, thoughts of self destruction were with me when I awoke , and when I went to sleep. ...\n \n The thoughts were there , but something was keeping me from harming myself. It was not that I knew in my heart , that my self destruction would bring great sadness and embarassment to my family for the rest of THEIR lives. It was not that I cared whether or not anyone would miss me. It was not that I was afraid I would be making a mistake, and miss out on living out the rest of my miserable exsistence... \n \n It was my belief in the \"hereafter\" that kept the destructive thoughts at bay. I had learned some about Christianity and the hereafter , by being \"prompted\" by my Mom to go to a baptist church every Sunday until I was thirteen. When I reached 14, she let me make my own choice on what I wanted to do with my religous followings, or not. The church had taught me that the human body has a soul , and it will face judgement after the death of the physical body. The act of suicide was condemned by my church because the act was an abomination, and considered a unforgivable sin. So, the thought of suicide and my soul spending eternity in Hades, made me admonish the thought of self destruction any more. :) Now 27 years later , I am kind of glad my dear departed Mother made me wash behind my ears, get dressed in my Sunday duds, and go to church. :) ....\n \n Now, take this post for what it is worth, each person is on their own on this one, am sure :) . But as I have seen in the past 20 years , five of my friends in their early 20's took their lives, three more aquaintances did also, and now, a 19 year old I worked with has taken his. I am beginning to think I carry a hideously bad karma around with me. :( ...\n \n It truly seems to me though, even if one does end up taking the Bible as jibberish, if the person somehow ends up believing that the end of their earth life may just not be the \"end \" of the whole show, and that belief keeps them from self destruction, then the teachings of the \"hereafter\" may not be such a bad idealogy after all. all jmo\n\n \n That's tragic, I hate hearing stories like that. \n \n To address the topic-\n \n You may be right, OR, could the thought of escaping the difficulties of this life for a place in the eternal happiness of the afterlife be a motivating factor to escape by ending this life and \"moving on\"?\n \n These issues are so sensitive and individual. IMHO, there is something wrong, biologically, with people that are depressed to the point of comitting suicide. Depression is common, especially among teens, I can remember going through phases myself, but depression deep enough to cause suicide, to me, is a sign of mental illness, not just having a bad day or month or year.\n \n Is religion a pro or a con? To me it could be either or neither. It is completely dependent on the individual.\n \n Waxy", 
   {}, 
   80409, 
   null, 
   1102092600.0
  ], 
  [
   80483, 
   null, 
   "unkerpaulie", 
   " I have to wonder sometimes, when a person gets to that mental stage of hopelessness and personal torment , would the belief in the hereafter have a influence on their decision to permanently terminate themselves or not? I remember a time in my life , back when I was in my early twenties that I was despondent. It was just after my bride of a only a year, up and left me for 3 other guys. I was pretty much destroyed as a person, because I loved her SO much, and I thought marriage vows were forever ( super naive back then I was ). Needless to say, after that \"moment\" in my life, thoughts of self destruction were with me when I awoke , and when I went to sleep. ...\n \n The thoughts were there , but something was keeping me from harming myself. It was not that I knew in my heart , that my self destruction would bring great sadness and embarassment to my family for the rest of THEIR lives. It was not that I cared whether or not anyone would miss me. It was not that I was afraid I would be making a mistake, and miss out on living out the rest of my miserable exsistence... \n \n It was my belief in the \"hereafter\" that kept the destructive thoughts at bay. I had learned some about Christianity and the hereafter , by being \"prompted\" by my Mom to go to a baptist church every Sunday until I was thirteen. When I reached 14, she let me make my own choice on what I wanted to do with my religous followings, or not. The church had taught me that the human body has a soul , and it will face judgement after the death of the physical body. The act of suicide was condemned by my church because the act was an abomination, and considered a unforgivable sin. So, the thought of suicide and my soul spending eternity in Hades, made me admonish the thought of self destruction any more. :) Now 27 years later , I am kind of glad my dear departed Mother made me wash behind my ears, get dressed in my Sunday duds, and go to church. :) ....\n\n whenever i hear of suicide in relation to religion, i cant help but think about the suicide pilots of 9/11. when the black box was recovered from the plane that crashed in the penn field, it recorded up to the last words the hijackers uttered just a moment before the plane crashed: \"allah is great! allah is great!\". this sent chills up my spine, to think that religion, and the belief in the afterlife, could be so badly twisted. and they believe that they pray to the same God as the God of the bible...\n \n i think even if you strip away religion youd realize that all the things religion instills in you, you have in you all along. i too, avoided thoughts of suicide when i was young for the same reason. you cannot ask forgiveness after youre dead, so you'll be dying as a sinner, and a murderer at that! with suicide not even as an option, i would tell myself things would be better, and that i would somehow find the strength and courage to make it through the depressing situation. of course i always did, and looking back now i can see that i always could, even when i thought i couldnt\n \n acknowledging God when you get through a depressing situation, there really is absolutely nothing wrong with that. you pray for strength, courage, favor, prosperity, then thank God when they come to pass. even without God, these things are within you, but creating a need within yourself to be grateful to God when good things happen, i cant see anything wrong with that.\n \n \nNow, take this post for what it is worth, each person is on their own on this one, am sure :) . But as I have seen in the past 20 years , five of my friends in their early 20's took their lives, three more aquaintances did also, and now, a 19 year old I worked with has taken his. I am beginning to think I carry a hideously bad karma around with me. :( ...\n\n i dont think you have anything to base this self-proclaimed \"curse\" on. on the one hand, belief in the afterlife has preserved your life. on the other, belief in bad karma makes you blame yourself for other people taking their lives. this is how superstition is born. what you believe can be both dangerous and healthy. even though the thing you believe doesnt even exist, the belief itself has very real consequences in your life\n \n \n It truly seems to me though, even if one does end up taking the Bible as jibberish, if the person somehow ends up believing that the end of their earth life may just not be the \"end \" of the whole show, and that belief keeps them from self destruction, then the teachings of the \"hereafter\" may not be such a bad idealogy after all. all jmo\n\n totally agree", 
   {}, 
   80409, 
   null, 
   1102097220.0
  ], 
  [
   80484, 
   null, 
   "unkerpaulie", 
   "These issues are so sensitive and individual. IMHO, there is something wrong, biologically, with people that are depressed to the point of comitting suicide. Depression is common, especially among teens, I can remember going through phases myself, but depression deep enough to cause suicide, to me, is a sign of mental illness, not just having a bad day or month or year.\n \n Is religion a pro or a con? To me it could be either or neither. It is completely dependent on the individual.\n \n Waxy\n\n i think a bad week or month could drive someone to suicide. labelling it a mental disorder is unfair, imo. opting to commit suicide may usually (i think in most cases) be due to a lack of wisdom, foresight or resourcefulness. all of these are common, especially among young people that havent acquired the wisdom and resources to see beyond their current bad week/month. after a while, wisdom earned, you begin to realize that its just a slump in a very long up-and-down cycle called life, and things do always get better. an even if they dont, they do, because the positivity of a situation is 90% perception, if not more\n \n like i said, i wouldn't be so quick to slap a \"mental disorder\" label on suicidal thoughts. it seems like simply waving the issue away, or declaring that these cases were hopeless to begin with, when thats not the case. i know a few people that would label belief in the afterlife as a mental disorder (and that would probably be more correct), yet such a belief is what saves many young people from suicide", 
   {}, 
   80459, 
   null, 
   1102097640.0
  ], 
  [
   80500, 
   null, 
   "Richbee", 
   "i think a bad week or month could drive someone to suicide. labelling it a mental disorder is unfair, imo.\n\n \n If the authorities catch on, they do put people in mental wards, and how ironic, it is against the Law to commit suicide.\n \n I will agree in part, say a M.D. declares a man has inoperable brain tumor/cancer, and the Man wants the Freedom to go out his way!?\n \n I would agree that this person may be of sound mind.\n \n However, a young person overwhelmed is a sign of Depression, IMO.\n \n Now, back to the question, does Faith perserve Life?\n \n Yes, indeed, if Scientific Materialism, or Philosophical Natural were true and ruled our society, or had founded our society, instead of our Judeo-Christian moral values, then I don't see any reason why suicide would be illegal in the first place.\n \n Or, why would save anyone from their desired goal?\n \n Why place an infinite value on Life?\n \n As the Russian writer Fyodor Dostoyevsky rightly said:\"If there is no immortality, then all things are permitted.\"", 
   {}, 
   80484, 
   null, 
   1102100460.0
  ], 
  [
   80503, 
   null, 
   "Richbee", 
   "This is excellent, and I post this because Keith Cox is spot on for this topic!\n \n So do you believe in the Creator?\n \n The consequence in answering yes is that your life cannot with impunity be lived solely according to your wishes, your desires, your aims. For if there is a Creator, than your Creator has the prerogative to make demands upon you, who you are, and what you become. In the most terrifying sense, you are accountable for your choices. \n \n The consequence for answering no is the reverse: you become unaccountable. Transcendent reference points are lost and the quagmire of immanence befalls. Yes, if there's no Creator, the ultimate bounds upon your freedom are knocked down, but without boundaries freedom becomes a noose. Just read Sartre, or Camus, or Beckett to discover this. The first of these, Sartre, was one of the most influential philosophers of the twentieth century, and he disbelieved in a Creator. He also believed that the first question of philosophy was, \"Why not commit suicide?\"\n \n These two beliefs are connected. Unbounded freedom is a noose.\n \n Don't mistake me, bounded freedom is not a cake-walk. Just read the Dutch philosopher Soren Kierkegaard to see this. He wrestled with the profound truth that the Creator's demands upon us are not light. In fact, he entitled his work contemplating God's demands, The Sickness Unto Death.\n \n He believed, if taken seriously, the demands of the Creator upon us should cause such anxiety as to produce a sickness unto death; for the demands of a just God are too weighty for our human frailties and shortcomings. He was right. But he was also a Christian, and so he believed that another had already born his sickness unto death, and won a cure for his soul. \n \n Hmmmm.\n \n More:: Creators, Cures, and Nooses - By Keith Cox\n \n Yippee! That one, just made my Day! emoticon_xbouncer\n \n I have a savior that bore my sickness unto death, death on the cross, so that I might LIVE!", 
   {
    "post_info": {
     "post_title": "Why not commit Suicide?"
    }
   }, 
   80500, 
   null, 
   1102101060.0
  ], 
  [
   80505, 
   null, 
   "Waxy", 
   "i think a bad week or month could drive someone to suicide. labelling it a mental disorder is unfair, imo. opting to commit suicide may usually (i think in most cases) be due to a lack of wisdom, foresight or resourcefulness. all of these are common, especially among young people that havent acquired the wisdom and resources to see beyond their current bad week/month. after a while, wisdom earned, you begin to realize that its just a slump in a very long up-and-down cycle called life, and things do always get better. an even if they dont, they do, because the positivity of a situation is 90% perception, if not more\n \n like i said, i wouldn't be so quick to slap a \"mental disorder\" label on suicidal thoughts. it seems like simply waving the issue away, or declaring that these cases were hopeless to begin with, when thats not the case. i know a few people that would label belief in the afterlife as a mental disorder (and that would probably be more correct), yet such a belief is what saves many young people from suicide\n\n \n My intent behind the \"mental disorder\" label has nothing to do with waving the issue away, in fact, just the opposite. I think if we invested more time and resources into the issue we'd have a much better understanding of what triggers suicidal thoughts, and we'd have much better ways of both preventing it and treating it.\n \n I'd venture to say that 99% of people go through periods of depression, but maybe what, 1%? of those people actually commit suicide. IMHO, there has to be something there, a chemical imbalance/disorder for lack of a better term, that allows people to go from depression to suicide. I certainly wouldn't claim that as the only factor, but as a contributing factor or a predisposition. Suicide is not a \"natural\" act IMHO. \n \n That being said, I don't think a society full of kids on Ritalin and adults hopped up on Prozac or Zoloft is the answer either. \n \n I don't really know where I stand on this issue to be honest. emoticon_confused\n \n Waxy\n \n ON EDIT: I will say this,, based on my knowledge of you Greg, this boy's actions had absolutely nothing to do with you. I can't see how anyone as caring and compassionate as you seem to be could be cursed or be a negative influence on those around you.", 
   {}, 
   80484, 
   null, 
   1102101240.0
  ], 
  [
   80514, 
   null, 
   "MrWriteLA", 
   "My intent behind the \"mental disorder\" label has nothing to do with waving the issue away, in fact, just the opposite. I think if we invested more time and resources into the issue we'd have a much better understanding of what triggers suicidal thoughts, and we'd have much better ways of both preventing it and treating it.\n \n I'd venture to say that 99% of people go through periods of depression, but maybe what, 1%? of those people actually commit suicide. IMHO, there has to be something there, a chemical imbalance/disorder for lack of a better term, that allows people to go from depression to suicide. I certainly wouldn't claim that as the only factor, but as a contributing factor or a predisposition. Suicide is not a \"natural\" act IMHO. \n\n \n You may find this arcticle interesting:\n \n Tendency To Kill Oneself May Have A Genetic Basis\n http://unisci.com/stories/20012/0406014.htm", 
   {}, 
   80505, 
   null, 
   1102102560.0
  ], 
  [
   80661, 
   null, 
   "greg 79 f150", 
   "Thanks for the replies guys, a lot of good input here from all. On clarification, I know I am not in any WAY responsible for anyone that I knew that took their own life. It justs seems like I am around a lot of it, and I really dont believe in \"karma\" in the true sense of it. I believe more in the laws of cause and effect.... \n \n I think as a society we may not be paying enough attention to our youth now. The way I see it, so many of the teens today live life almost seperate from their parents, because of our \"mach one\" pace of life. They pass their parents at the breakfast table in the morning, grab money from their Dad and \"poof\" they are out the door. After school its sports for the athletic types, the others get homework or x-box games showing nothing but death and harm to electronic figures on a screen, or for some its the never ending quest to quench their hormones....\n \n Back when I was a teen, families actually sat and conversed with each other at a fully served meal at the dinner table. A parent could \"see' when one of their children was troubled and approach them about it later in privacy. It seems as if the teens today are so grown up by the time they are 15 , they dont want any \"help\" or advice from their parents or peers. They think they are all grown up and can handle anything that life pushes their way ... not so......\n \n I dont think a person that just \"ups\" and takes their life will always fall in the category of being mentally ill. The suicidal person has a serious dysfunction in their capability of handling problems, thats for sure. But as said above, the suicide victim didnt just wake up and say, \" hey, its a beautiful day, I think I will go stand in the road and kiss a Mack truck doing 75 mph. \" The dark thoughts overwhelmed them systematically, whatever they are trying to get away from wont leave their mind, and they see no other way out....\n \n I guess all anyone can really do is just lend a helping hand to those down and out when possible . The variables that bring people to want to harm themselves , are just too overwhelming to even comprehend. Maybe becoming a good listener instead of talking all the time, and watching out for those young people that seem to never be happy about anything would help. Because if someone wont listen to them, or take time to care about them, they just might be the very next one to end it all.... all jmo", 
   {}, 
   80514, 
   null, 
   1102131720.0
  ], 
  [
   80670, 
   null, 
   "greg 79 f150", 
   "My intent behind the \"mental disorder\" label has nothing to do with waving the issue away, in fact, just the opposite. I think if we invested more time and resources into the issue we'd have a much better understanding of what triggers suicidal thoughts, and we'd have much better ways of both preventing it and treating it.\n \n I'd venture to say that 99% of people go through periods of depression, but maybe what, 1%? of those people actually commit suicide. IMHO, there has to be something there, a chemical imbalance/disorder for lack of a better term, that allows people to go from depression to suicide. I certainly wouldn't claim that as the only factor, but as a contributing factor or a predisposition. Suicide is not a \"natural\" act IMHO. \n \n That being said, I don't think a society full of kids on Ritalin and adults hopped up on Prozac or Zoloft is the answer either. \n \n I don't really know where I stand on this issue to be honest. emoticon_confused\n \n Waxy\n \n ON EDIT: I will say this,, based on my knowledge of you Greg, this boy's actions had absolutely nothing to do with you. I can't see how anyone as caring and compassionate as you seem to be could be cursed or be a negative influence on those around you.\n\n \n \n \n Good points you have made Waxy, thanks\n \n I know am not cursed , least not until I track mud on to my wife's newly mopped floor anyway. :) I know your point about the drugged up solution for the emotionally challenged teens/adults of today. I worked in a hospital for 12 years , one that had a Behavioral Health Center for Adolescents in it on just one of the wings. As a male employee , myself as well as other males, had to go to the \"all male employees to the BHC stat \" overhead page calls quite often....\n \n It was our duty to calm down the teens that had gotten too aggresive or threatening. I spent a lot of time up there westling these youngsters to the floor so they wouldnt hurt the nurses or themselves. I went home many a night , so mad at the adolescent mental health \"system\" that I would tell my wife I was going to quit working at the hospital....\n \n I think I figured out there was two common threads that seemed to put the unruly , out of control teens in the center. One was parents that didnt get the mode set of who was the parent and who was the child, at a early age for their child. Their child grew up to be 12 years old and a out of control monster. The other was the ones just \"acting\" out, resulting in bad grades, petty crimes. They really had no place in the family, were neglected, and generally just felt unloved and worthless. A lot of these kids were on suicide watch. Those were the worse ones to have to throw a blanket over and wrestle down, it just drained us guys emotionally when they made us do it. ..\n \n I know it was to protect the staff and the child, but that made it no easier for us . So many times I remembered wishing how I would have loved to put the PARENTS of those kids in there, and wrestled THEM down to the floor . all jmo", 
   {}, 
   80505, 
   null, 
   1102138140.0
  ], 
  [
   81229, 
   null, 
   "Tastyfish", 
   "You may find this arcticle interesting:\n \n Tendency To Kill Oneself May Have A Genetic Basis\n http://unisci.com/stories/20012/0406014.htm\n\n Scary thing is, if this is true then suicidal tendancies at some point have a positive influence and you won't be able to get rid of them (say taking an oversimplified version - that they make you less likely to follow restrictive laws imposed by a society without reason when heterozygous. The homozygous version either committing suicide after realising nothing has any meaning or following society's codes to the letter).\n \n As for Faith, it does raise an interesting question - is it better to have false hope in something than face the truth (at least as they see it) or would it be better to help those who have turned their back on religion to come to terms with a world that has no preordained purpose for them.\n \n Big thing from talking to friends is that it isn't easy to accept that the universe is intrinsically meaningless (seeing as preaching religion is counter productive and pointless here, seeing as this attitude is likely focused by these pre existing beleifs), something I see as becoming more of an issue as western life expectancy increases. \n \n Richbee - really? Refusing to admit they are forgiven? So because someone feels really guilty about a crime and doesn't think there is some quick fix he is condemned? Judas killed his God (he was an apostle beforehand) - you reckon 'oops sorry boss' is going to clear that concience?\n As for 'why not commit suicide?' if it comes down to this then you are done for. You don't commit suicide because you don't want to as staying alive is a very strong impulse and things do actual bring pleasure. If you beleive there is no purpose in the world for you, you should do want makes you feel happy. Course this doesn'y advocate aanarchy as the society you are a member of adds rules to try to ensure that as any people are happy as possible. Even if you cheat the system you still have to live with causing pain - and as a social animal that is more serious than it sounds", 
   {}, 
   80514, 
   null, 
   1102397940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Does the belief in the hereafter preserve life?", 
  "url": "http://www.4forums.com/political/religion-debates/3860-does-belief-hereafter-preserve-life.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 3860, 
  "discussion_files": [
   [
    "17068.html", 
    "http://www.4forums.com/political/religion-debates/3860-does-belief-hereafter-preserve-life-print.html"
   ]
  ], 
  "identifier": 3860
 }
]