[
 [
  [
   80674, 
   null, 
   "Mach", 
   "\"I contend that we are both atheists. I just believe in one fewer god than you do. When you understand why you dismiss all the other possible gods, you will understand why I dismiss yours.\" -* Stephen Roberts\n \n Considering the rash of atheist and agnostic posts, I thought a good religious oriented post would fit nicely.\n \n So, why are organized religions all correct, and why do we have ancient relgions, and modern religions. Why are so many \"modern\" religious holidays actually based on ancient religions like pagan religions...coincidence or stolen ideas? Winter solistice becomes \"Christmas\"? Created to by man, to oppress man? Or was it random chance?\n \n -Mach", 
   {
    "post_info": {
     "post_title": "Religions are actually 99.9% atheistic"
    }
   }, 
   null, 
   null, 
   1102139340.0
  ], 
  [
   80725, 
   null, 
   "dreamweaver", 
   "They're actually not. Since, an atheist is defined as someone who \"lacks belief in a [any] deity", 
   {}, 
   80674, 
   null, 
   1102161540.0
  ], 
  [
   80744, 
   null, 
   "Alan Ryan", 
   "[I]\"\n So, why are organized religions all correct, and why do we have ancient relgions, and modern religions. Why are so many \"modern\" religious holidays actually based on ancient religions like pagan religions...coincidence or stolen ideas? Winter solistice becomes \"Christmas\"? Created to by man, to oppress man? Or was it random chance?\n -Mach\n\n \n Don't these questions resolve into - why, in probably all recorded human societies, are religions invented ? I suspect the answer will involve detailed psycholgical speculations - apart from the obvious answers that point to the lack of scientific understanding, primitive ignorance, etc. of people who have been mystified by the complexity of the natural world.", 
   {}, 
   80674, 
   null, 
   1102184400.0
  ], 
  [
   80774, 
   null, 
   "Richbee", 
   "The only five possibilities for ultimate meaning and values are:\n \n atheism - (no God)\n \n humanism - (man as God)\n \n polytheism - (many gods)\n \n pantheism - (one immanent God)\n \n theism - (one transcendent God - Genesis 1)", 
   {}, 
   80744, 
   null, 
   1102197300.0
  ], 
  [
   80786, 
   null, 
   "zachvac", 
   "The only five possibilities for ultimate meaning and values are:\n \n atheism - (no God)\n \n humanism - (man as God)\n \n polytheism - (many gods)\n \n pantheism - (one immanent God)\n \n theism - (one transcendent God - Genesis 1)\n\n \n But you have dodged the question? My specific question that I would like you to answer is why don't you believe in the Buddhist god, Buddha?\n \n And guess what, meaning and values have nothing to do with a god or not, my values are based on what I think is right. I don't see that there.", 
   {}, 
   80774, 
   null, 
   1102199880.0
  ], 
  [
   80792, 
   null, 
   "Richbee", 
   "But you have dodged the question? My specific question that I would like you to answer is why don't you believe in the Buddhist god, Buddha?\n\n \n Buddha was a man, and a man who rejected the Vedas, but in his day, he would have been considereed a Hindu.\n \n Buddha never wanted to start a new Religion, and IMHO, he was searching for God.\n \n Buddha is dead.\n \n My advice is, don't follow any dead prophet.\n \n Jesus Christ is God!\n \n Next.", 
   {}, 
   80786, 
   null, 
   1102201560.0
  ], 
  [
   80796, 
   null, 
   "zachvac", 
   "Buddha was a man, and a man who rejected the Vedas, but in his day, he would have been considereed a Hindu.\n \n Buddha never wanted to start a new Religion, and IMHO, he was searching for God.\n \n Buddha is dead.\n \n My advice is, don't follow any dead prophet.\n \n Jesus Christ is God!\n \n Next.\n\n \n Hmm, Jesus is alive, that's funny, I never knew that. And I thought Jesus was the SON of God. And since God created the earth it's kind of funny God being the son of anyone.", 
   {}, 
   80792, 
   null, 
   1102202640.0
  ], 
  [
   80931, 
   null, 
   "pnac=ww3", 
   "The only five possibilities for ultimate meaning and values are:\n \n atheism - (no God)\n \n humanism - (man as God)\n \n polytheism - (many gods)\n \n pantheism - (one immanent God)\n \n theism - (one transcendent God - Genesis 1)\n\n \n You forgot agnosticism - (God? maybe/maybe not)", 
   {}, 
   80774, 
   null, 
   1102290720.0
  ], 
  [
   80933, 
   null, 
   "pnac=ww3", 
   "Hmm, Jesus is alive, that's funny, I never knew that. And I thought Jesus was the SON of God. And since God created the earth it's kind of funny God being the son of anyone.\n\n \n Also, can someone explain what the Holy Ghost is?\n \n If you are a monotheistic religion then you have ONE god, period.\n \n Christianity (from its pagan lineage) got bored with one god.\n \n Judaism was looking for a messiah. To some people 2004 years ago, that messiah was Jesus. Does this make him a god, the god? Where does that place The Father, is he now just A god, or still the head god, like Zeus? And the Holy Ghost is part of the Trinity too, so it's god too, so why seperate them in the first place? Why not say \"god came down in human form and called himself Jesus.\" Instead of \"God gave his only begotten son?\" And again, what's the role of the Divine Spook?", 
   {}, 
   80796, 
   null, 
   1102291020.0
  ], 
  [
   80937, 
   null, 
   "Master_Shake", 
   "But you have dodged the question? My specific question that I would like you to answer is why don't you believe in the Buddhist god, Buddha? \n\n \n I know these statements are a bit hostile, but arrogant ignorance just ticks me off.\n What makes you think you have the knowledge to post on a thread like this if you didn't know that the Buddha never even claimed to be God?\n \n \nSo, why are organized religions all correct, and why do we have ancient relgions, and modern religions. Why are so many \"modern\" religious holidays actually based on ancient religions like pagan religions...coincidence or stolen ideas? Winter solistice becomes \"Christmas\"? Created to by man, to oppress man? Or was it random chance?\n\n \n Christmas wasn't placed on the winter solstice. It was placed on some \"pagan\" god's (I can't remember which) feast day. You left out Easter by the way-placed in the spring because of the idea of rebirth. Secondly, what difference does it make that they were placed like this? To a christian (at least to most I suppose) it doesn't matter whether or not the event they are celebating happened on that specific day, it just matters that it happened. It was neither random chance, nor created to oppress man. On top of that, the irony in your idea that religions were created to oppress man, is that (in your posts in general) are attacking the oppressed then aren't you? Which would make you another oppressor wouldn't it? I don't think this is so, because I don't believe they were created to oppress man, but I think you get my point.\n \n And why do you say \"modern religions\" when you really seem to mean Christianity? If you want to talk abot Christianity, talk about it.", 
   {}, 
   80786, 
   null, 
   1102292340.0
  ], 
  [
   80941, 
   null, 
   "billsco", 
   "And again, what's the role of the Divine Spook?\n\n \n Definitely third-stringer. Low man on the totem pole. No one ever prays to this apparition because we can't quite picture him or her or it. We prefer to speak directly to God himself, often bypassing Jesus like he was sitting at the reception desk and we breezed right by him on the way to the boss's office. \n \n I feel Christianity made a mistake in creating a Triune God, as you correctly note as to how the standard finally became one monolithic god. Christianity quickly undid, or at least muddied, centuries of thought.", 
   {}, 
   80933, 
   null, 
   1102293720.0
  ], 
  [
   80942, 
   null, 
   "dreamweaver", 
   "I think people should watch out when using the term Agnosticism. Agnosticism isn't a half-way between atheism and theism -- there is no half-way. What is different however is what they speak of. Agnosticism is an epistemic position, and atheism/theism are doxastic ones -- relating to beliefs, that is. Someone can quite easily be an agnostic-theist or an agnostic-atheist.", 
   {}, 
   80941, 
   null, 
   1102295400.0
  ], 
  [
   80950, 
   null, 
   "zachvac", 
   "I think people should watch out when using the term Agnosticism. Agnosticism isn't a half-way between atheism and theism -- there is no half-way. What is different however is what they speak of. Agnosticism is an epistemic position, and atheism/theism are doxastic ones -- relating to beliefs, that is. Someone can quite easily be an agnostic-theist or an agnostic-atheist.\n\n \n Actually agnosticism is saying that it is impossible to prove god's existence. I happen to not really believe there is a god and the reason for that is that you can't prove it. Others may believe in God but admit that it is on faith and not possible to prove it.", 
   {}, 
   80942, 
   null, 
   1102301100.0
  ], 
  [
   80981, 
   null, 
   "dreamweaver", 
   "Actually agnosticism is saying that it is impossible to prove god's existence. I happen to not really believe there is a god and the reason for that is that you can't prove it. Others may believe in God but admit that it is on faith and not possible to prove it.\n\n Actually, Agnosticism is about gnosis (knowledge); or rather -- a lack of it. It would all be fine and dandy if we could go by Huxley's original definition, but the term has adopted a number of meanings. Sure, in general use, since it says that we cannot know (whether now, in this life time, or ever) it's probably adequate to suggest that we cannot \"prove it\"; but still...", 
   {}, 
   80950, 
   null, 
   1102329720.0
  ], 
  [
   80986, 
   null, 
   "Alan Ryan", 
   "Actually, Agnosticism is about gnosis (knowledge); or rather -- a lack of it. It would all be fine and dandy if we could go by Huxley's original definition, but the term has adopted a number of meanings. Sure, in general use, since it says that we cannot know (whether now, in this life time, or ever) it's probably adequate to suggest that we cannot \"prove it\"; but still...\n\n Yes, agnosticism should be understood as lack of knowledge (concerning the exitence of God) - but an agnostic has an open mind on the matter pending the arrival of credible evidence. It's possible to argue that \"credible evidence\" pointing to the existence of God is inconceivable:the metaphysical nature of such evidence might require more evidence to verify it......and so on and on, ad infinitum.", 
   {}, 
   80981, 
   null, 
   1102336920.0
  ], 
  [
   81035, 
   null, 
   "dreamweaver", 
   "Yes, agnosticism should be understood as lack of knowledge (concerning the exitence of God) - but an agnostic has an open mind on the matter pending the arrival of credible evidence. It's possible to argue that \"credible evidence\" pointing to the existence of God is inconceivable:the metaphysical nature of such evidence might require more evidence to verify it......and so on and on, ad infinitum.\n\n Agnostics don't necessarily have open minds. Odd statement... \n \n Just to note: some Agnostics maintain that there cannot be any proof of a Supreme Being in this lifetime; some might go step further and say that there cannot be sufficient evidence that allows us to know whether such a being exists, as well.", 
   {}, 
   80986, 
   null, 
   1102359240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Religions are actually 99.9% atheistic", 
  "url": "http://www.4forums.com/political/religion-debates/3869-religions-actually-99-9-atheistic.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 3869, 
  "discussion_files": [
   [
    "22819.html", 
    "http://www.4forums.com/political/religion-debates/3869-religions-actually-99-9-atheistic-print.html"
   ], 
   [
    "22820.html", 
    "http://www.4forums.com/political/religion-debates/3869-religions-actually-99-9-atheistic-2-print.html"
   ]
  ], 
  "identifier": 3869
 }
]