[
 [
  [
   81832, 
   null, 
   "MrWriteLA", 
   "From the Discovery Channel's website\n http://dsc.discovery.com/news/briefs/20041206/lincoln.html\n \n A forthcoming book claims that the sixteenth president of the United States, Abraham Lincoln, was a homosexual, based on evidence ranging from a post-assassination interview with Lincoln's stepmother to a poem about gay marriage written by the Civil War leader. \n \n The book, entitled \"The Intimate World of Abraham Lincoln,\" will be published on Jan. 11 by The Free Press, a Simon & Schuster company. It was authored by C.A. Tripp, associate professor of psychiatry at the State University of New York, and a researcher who worked closely with Alfred Kinsey on studies concerning human sexuality. \n \n Tripp died at the age of 83, just two weeks after finishing the book, which he worked on over the last 14 years of his life. \n \n To argue his case that Lincoln (1809-1865) was gay, Tripp gathered biographical texts contemporary to Lincoln's time, private correspondence, and other books and documents culled from his database of more than 600 Lincoln-related texts, which now are housed at the Lincoln Institute in Springfield, Ill. \n \n A spokesperson at The Free Press told Discovery News that Tripp's book would not be available to the media until closer to January, but the L.A. Weekly already has published sections of the book, including Lincoln's poem about gay marriage. The poem, which he wrote when he was a teenager, may have been the most explicit of its kind for America in the 1800s. \n \n It reads: \n \n \"I will tell you a Joke about Jewel and Mary \n It is neither a Joke nor a Story\n For Rubin and Charles has married two girls\n But Billy has married a boy\n The girlies he had tried on every Side\n But none could he get to agree\n All was in vain he went home again\n And since that is married to Natty\n So Billy and Natty agreed very well\n And mama's well pleased at the match\n The egg it is laid by Natty's afraid\n The Shell is So Soft that it never will hatch\n But Betsy she said you Cursed bald head\n My Suitor you never Can be\n Beside your low crotch proclaims you a botch\n And that never Can serve for me\"\n \n The book also includes affectionate correspondence between the former president and merchant Joshua Speed, with whom Lincoln shared a bed for four years from his late 20s to early 30s, and an account written by Lieutenant Colonel Thomas Chamberlain, a 19th century historian. \n \n Chamberlain wrote that in Mrs. Lincoln's absence, the president would sleep, share nightshirts, and conduct an \"intimacy\" with David Derickson, who was captain of Lincoln's bodyguard Company K. \n \n Additionally, the book contains descriptions of Lincoln from his stepmother, who said he \"never took much interest in the girls,\" and poet Carl Sandburg, who wrote that both Speed and Lincoln possessed \"a streak of lavender, and spots soft as May violets.\" \n \n Jean Baker, professor of history at Goucher College and the author of \"Mary Todd Lincoln: A Biography,\" told Discovery News, \"I believe that Lincoln engaged in homosexual acts with several men, but this was an era before any understanding of the concept of self-identifying as an homosexual. The word was not even used during Lincoln's life.\" \n \n As for Lincoln's wife, Baker believes she knew nothing of her husband's purported relationships with men. \n \n \"I think that his homosexuality was not noticed by either his wife, or many of his friends, which is one reason why we are only finding out about it today,\" Baker said. \n \n Tripp was not the first to theorize about Lincoln's sexuality. Charles Shively, University of Massachusetts at Boston professor emeritus of American history, described what he viewed was a homosexual relationship between Lincoln and Speed in his book concerning the private life of poet and naturalist Walt Whitman, whom many researchers also believe was gay. \n \n Conservative groups have denounced the suggestions, and several historians remain skeptical about the Lincoln claims. \n \n Douglas L. Wilson, co-director of the Lincoln Studies Center at Knox College, told the Southern Voice newspaper, \"(Lincoln) and Speed were soul mates and all the indications I have seen show they had this close relationship. They were both the same age and in the same situation. They were concerned about this transition from bachelorhood to marriage and all that.\" \n \n Wilson added, \"I can see how that is suggestive and points in other directions but it really indicates that they saw things in very similar ways and had the same emotional take on the world.\" ", 
   {
    "post_info": {
     "post_title": "Historian's book says Lincoln was gay"
    }
   }, 
   null, 
   null, 
   1102625460.0
  ], 
  [
   81853, 
   null, 
   "Big Orn", 
   "As you well know, I am from the South....so:\n \n I allays knew they wuz sumpin wrong wif that man..... :p \n \n I wonder how many more of our leaders that will be forced from \"the closet\"?\n \n Seriously, MrWriteLA, how much stock can a person put in that article?\n \n Don't get me wrong - I could care less. I'm around gays and lesbians more and more lately and can't see that \"terrible beast\" as some do, but come on, how much credence can you give it?", 
   {}, 
   81832, 
   null, 
   1102628940.0
  ], 
  [
   81857, 
   null, 
   "MrWriteLA", 
   "Well, considering that it's a well-researched work by an historian, and that his conclusions are supported by another biographer, and that the evidence is spelled out right there for all to see, I think you can give it as much credence as any other biography.\n \n Why wouldn't  you give it credence? Is the idea that Lincoln might have been actively bisexual so unthinkable that you automatically have to question it?\n \n You can interpret the evidence differently, I suppose (as the \"family values\" groups will surely try to do), but surely you don't suggest the author made it all up?", 
   {}, 
   81853, 
   null, 
   1102630200.0
  ], 
  [
   81862, 
   null, 
   "jyoshu", 
   "[INDENT]A forthcoming book claims that the sixteenth president of the United States, Abraham Lincoln, was a homosexual,\n\n \n Oh brother, here we go again. At this point, I wonder if there are less historical leaders who haven't had someone try and say they were gay than not.\n \n Why do some people want so badly to find homsexuality in historical famous people?", 
   {}, 
   81832, 
   null, 
   1102630980.0
  ], 
  [
   81863, 
   null, 
   "Master_Shake", 
   "I really don't understand the point in all of this. If Lincoln was gay, or he wasn't, so what?", 
   {}, 
   81862, 
   null, 
   1102631220.0
  ], 
  [
   81864, 
   null, 
   "joebrummer", 
   "I really don't understand the point in all of this. If Lincoln was gay, or he wasn't, so what?\n\n \n \n I agree, who cares! I am sure there are lots of closet cases in history. It would be interesting but it doesn't change anything.", 
   {}, 
   81863, 
   null, 
   1102631460.0
  ], 
  [
   81865, 
   null, 
   "Big Orn", 
   "No, of course I don't think he made it up.... emoticon_rolleyes \n I just see it this way: \n \n\n from your link\n \n Douglas L. Wilson, co-director of the Lincoln Studies Center at Knox College, told the Southern Voice newspaper, \"(Lincoln) and Speed were soul mates and all the indications I have seen show they had this close relationship. They were both the same age and in the same situation. They were concerned about this transition from bachelorhood to marriage and all that.\" \n Wilson added, \"I can see how that is suggestive and points in other directions but it really indicates that they saw things in very similar ways and had the same emotional take on the world.\" \n\n \n ...and you see it your way.\n \n \n And \"so unthinkable\"? Umm - no.", 
   {
    "unicode_changes_made": true
   }, 
   81857, 
   null, 
   1102631580.0
  ], 
  [
   82161, 
   null, 
   "BobNelson2", 
   "Why do some people want so badly to find homsexuality in historical famous people?\n\n \n Because folks have sought, and continue to seek, to erase us from history and from reality. \n \n On of the more interesting things about Lincoln is that he was ridiculed and whispered about but was elected nonetheless. Hardly something that could happen in these \"enlightened\" times.\n \n Of course, voters were forced to READ about politics, so ideas were more important than appearances.", 
   {}, 
   81862, 
   null, 
   1102735620.0
  ], 
  [
   82174, 
   null, 
   "pnac=ww3", 
   "I heard that John Adams used to like to spank his male slaves over his knee and that Andrew Jackson had a liking for something he called \"old dickory\".", 
   {}, 
   82161, 
   null, 
   1102739880.0
  ], 
  [
   82203, 
   null, 
   "Mach", 
   "Oh brother, here we go again. At this point, I wonder if there are less historical leaders who haven't had someone try and say they were gay than not.\n \n Why do some people want so badly to find homsexuality in historical famous people?\n\n \n You mean why would people want to know the truth?\n \n I suppose because the alternative - made up **** - doesn't sit well with everyone.\n \n -Mach", 
   {}, 
   81862, 
   null, 
   1102786860.0
  ], 
  [
   82220, 
   null, 
   "jyoshu", 
   "Because folks have sought, and continue to seek, to erase us from history and from reality.\n\n \n Whatever. emoticon_rolleyes \n \n \nOf course, voters were forced to READ about politics, so ideas were more important than appearances.\n\n \n It's not like they weren't still subject to an author's biases and slants. No matter what the media, it can be spun, much like you've done here.", 
   {}, 
   82161, 
   null, 
   1102808160.0
  ], 
  [
   82221, 
   null, 
   "jyoshu", 
   "You mean why would people want to know the truth?\n \n I suppose because the alternative - made up **** - doesn't sit well with everyone.\n \n -Mach\n\n \n Hey, if you want to sit around and worry about whether Lincoln was a homosexual or not, or George Washington, or Bert and Ernie, or Teletubbies, or whoever, knock yourself out. I'll do without your Fallwellish obsession myself and read about what we know to be true about men like Lincoln.", 
   {}, 
   82203, 
   null, 
   1102808820.0
  ], 
  [
   82290, 
   null, 
   "wsm2506", 
   "Hey, if you want to sit around and worry about whether Lincoln was a homosexual or not, or George Washington, or Bert and Ernie, or Teletubbies, or whoever, knock yourself out. I'll do without your Fallwellish obsession myself and read about what we know to be true about men like Lincoln.\n\n \n \n Just how far in the closet are you?", 
   {}, 
   82221, 
   null, 
   1102836480.0
  ], 
  [
   95327, 
   null, 
   "MrWriteLA", 
   "by Paul Rudnick\n (from this week's New Yorker)\n http://www.newyorker.com/shouts/content/index.ssf?050307sh_shouts \nThe first draft of the Gettysburg Address began, \"Four score and seven years ago-ish . . .\"\n \n When Lincoln was a boy, he would walk twenty miles through the snow every morning to buy magazines.\n \n Lincoln was raised in a log cabin with a dirt floor, which he vacuumed.\n \n Lincoln liked to say, \"All men are created equal, except at the beach.\"\n \n Lincoln's greatest regret was the movie version of \"Phantom.\"\n \n Lincoln named his horse Mister Horse.\n \n Lincoln wanted to call it \"The Emancipation Proclamation-The New Sensation!\"\n \n Lincoln urged Congress to bind the nation's wounds \"with malice toward none, with charity for all,\" although under his breath he murmured, \"except for a certain red-headed lieutenant, and he knows why.\"\n \n As a young country lawyer, Lincoln often bartered his services for house seats.\n \n For more than four years during his twenties, Lincoln shared a bed with his friend Joshua Fry Speed. It is now believed that he loved Joshua Fry Speed for his winning personality, and not because his name sounds like a George Foreman product.\n \n The friendship finally ended when Speed told Lincoln, \"You're not the President of me!\"\n \n Another friend, Billy Greene, said that Lincoln's thighs were \"as perfect as a human being's could be.\" Lincoln was said to have responded, \"It's called Pilates.\"\n \n Lincoln was known as the Rail-Splitter. Few people realize that this was a cocktail.\n \n When Lincoln was told that Lee had surrendered, he gasped and exclaimed, \"Oh no she didn't!\"\n \n Just before his first inauguration, he told Mary Todd Lincoln to go home and take one thing off.\n \n Lincoln grew his beard because he thought it looked hot on Ethan Hawke.\n \n Upon entering Ford's Theatre on that fateful night, Lincoln whispered to his wife, \"I hear it's slow.\"\n", 
   {
    "post_info": {
     "post_title": "More Proof That Lincoln Was Gay"
    }, 
    "unicode_changes_made": true
   }, 
   82290, 
   null, 
   1109904180.0
  ], 
  [
   95332, 
   null, 
   "Duo_Maxwell", 
   "the only relevance, if this claim is true, would have would depend on Lincoln's public stance on gay issues, which to my knowledge doesn't exist.\n \n Who CARES? So what?", 
   {}, 
   95327, 
   null, 
   1109906340.0
  ], 
  [
   95354, 
   null, 
   "zachvac", 
   "I agree. It really doesn't make a difference. Why don't we research if Joe Smith, a random farmer in the 1800's was gay? He is remembered for things he did for our country. His sexual life isn't really relevant.", 
   {}, 
   95332, 
   null, 
   1109915580.0
  ], 
  [
   95359, 
   null, 
   "Duo_Maxwell", 
   "not necessarily. Strom Thurman's black daughter is relevant because of his rabid segregationist and racist remarks. \n \n The revelance and importants depends on the subject's public stances. \n \n therefore, lincoln's alleged gayness is really irrevelant to anything since he made no public statements on homosexuality.", 
   {}, 
   95354, 
   null, 
   1109920320.0
  ], 
  [
   95376, 
   null, 
   "JustineCredible", 
   "Well, considering that it's a well-researched work by an historian, and that his conclusions are supported by another biographer, and that the evidence is spelled out right there for all to see, I think you can give it as much credence as any other biography\n\n \n \n LA, don't get me wrong here, but I noticed you did a fairly common typo there. I had to put it in bold type for you. I'm sorry, but we're not in France, therefore using \"an\" before an \"h\" word is simply bad grammar. Here in the US the \"h\" is a hard concenent, not silent as it is in French. If it were we would then actually use the contracted spelling such as: \"an'istorian\"  .\n \n Just a little pet peeve there. I notice it more and more in print and it's a glaring typo that really tends to grate on my nerves. Nothing personal, really...just one of those things. :)", 
   {}, 
   81857, 
   null, 
   1109929620.0
  ], 
  [
   95379, 
   null, 
   "JustineCredible", 
   "I agree, who cares! I am sure there are lots of closet cases in history. It would be interesting but it doesn't change anything.\n\n \n \n Famous Gays and Lesbians in History \n 1.Sappho (600 B.C.) Greek Poetess \n 2.Socrates (470-399 B.C.) Greek Teacher and Philosopher \n 3.Plato (427-347 B.C.) Greek Teacher and Philosopher \n 4.Alexander The Great (356-323 B.C.) Macedonian King and Military Leader \n 5.Wu (140-87 B.C.) Chinese Emperor \n 6.Hadrian (76-138 A.D.) Roman Emperor \n 7.Richard the Lion Hearted (1157-1199) English King and Crusader(actually bi) \n 8.Edward II (1254-1327) English King \n 9.Leonardo da Vinci (1452-1519) Italian Renaissance Artist, Teacher, Scientist and Inventor(actually bi) \n 10.Julius III (1487-1555) Catholic Pope \n 11.Ieyasu Tokugawa (1542-1616) Japanese Shogun and founder of the Edo Shogunate \n 12.Sir Francis Bacon (1561-1626) British Statesman and Writer \n 13.Christopher Marlowe (1564-1593) English dramatist and poet \n 14.Christina (1626-1689) Swedish Queen \n 15.Peter the Great (1672-1725) Russian Czar \n 16.Frederick the Great (1712-1786) Prussian King and Military Leader \n 17.Madame de Stael (1766-1817) French Writer and Intellectual \n 18.Lord Byron (1788-1824) British Poet \n 19.Hans Christian Andersen (1805-1875) Danish Poet and Writer \n 20.Margaret Fuller (1810-1850) Euro-American Writer and Journalist \n 21.Henry David Thoreau (1817-1862) Euro-American Philosopher, Naturalist, and Peace Activist \n 22.Walt Whitman (1819-1892) Euro-American Poet \n 23.Herman Melville (1819-1891) Euro-American Writer \n 24.Chief Crazy Horse (Tashunca witco) (1849-1877) Oglala Sioux Chief \n 25.Peter I. Tchaikovsky (1840-1893) Russian Composer \n 26.Oscar Wilde (1854-1900) Irish Writer and Dramatist \n 27.Dame Ethel Smyth (1858-1944) British Composer, Writer, and Activist \n 28.Marcel Proust (1871-1922) French Writer \n 29.Sergei Diaghileff (1872-1929) Russian Ballet Impresario \n 30.Vita Sackville-West (1892-1962) British Writer \n 31.Vaslav Nijinsky (1890-1950) Russian Ballet Dancer \n 32.Edward Carpenter (1844-1929) British Author and Gay Rights Pioneer \n 33.Willa Cather (1873-1947) Euro-American Writer and Critic \n 34.Colette (1873-1954) French Writer and Actress \n 35.W. Somerset Maugham (1874-1965) British Writer and Dramatist \n 36.Alice B. Toklas (1877-1967) Euro-American Writer; Stein's Domestic Partner \n 37.Gertrude Stein (1874-1946) Euro-American Writer and Art Collector; Toklas' Domestic Partner \n 38.Bessie Smith (1894-1937) African-American Blues Singer and Entertainer \n 39.E.M. Forster (1879-1970) British Writer \n 40.Virginia Woolf (1882-1941) British Writer and Publisher \n 41.Ernst Rohm (1887-1933) German Nazi and SA Leader \n 42.T.E. Lawrence (Lawrence of Arabia) (1888-1935) British Soldier \n 43.Jean Cocteau (1889-1963) French Writer and Filmmaker \n 44.John Maynard Keynes (1883-1946) British Economist and Nobel Prize Winner \n 45.Cole Porter (1893-1964) Euro-American Composer \n 46.Bayard Rustin (1910-87) African-American Civil Rights, Labor Rights, & Peace Activist/Leader \n 47.Alan Turing (1912-1954) British Mathematician and Computer Scientist \n 48.James Baldwin (1924-1987) African-American Writer and Civil Rights Activist \n 49.Truman Capote (1924-1984) Euro-American Author \n 50.Tennessee Williams (1914-1983) Euro-American Dramatist \n 51.Marguerite Yourcenar (1903-1987) Belgian-American Writer \n 52.Federico Garcia Lorca (1894-1936) Spanish Poet and Dramatist \n 53.Christopher Isherwood (1904-1986) British Author \n 54.W.H. Auden (1907-1973) British Poet and Writer \n 55.Harvey Milk (1930-1978) Euro-American Politician \n 56.Audre Lorde (1934-1992) African-American Writer and Activist \n 57.Billie Jean King (1943 - ) Euro-American Tennis Champion and Activist \n 58.Martina Navratilova (1956- ) Czechoslovakian-American Tennis Champion and Activist \n 59.Andy Warhol (1930-1987) Euro-American Pop Artist \n 60.Frieda Kahlo (1907-1954) Mexican Artist and Activist \n 61.Gore Vidal (1925- ) Euro-American Writer \n 62.Rudolf Nureyev (1938-1993) Russian dancer \n 63.Freddie Mercury (1946-1991) British Singer/songwriter/musician \n 64.Elton John (1947 - ) British Singer/songwriter/musican \n 65.Janis Ian (1951 - ) Euro-American Singer/songwriter/musician \n 66.Nathan Lane (1956 - ) Euro-American Actor \n 67.Ellen Degeneres (1958 - ) Euro-American Comedian/actor \n 68.Melissa Etheridge (1961 - ) Euro-American Singer/songwriter/musician \n 69.k. d. lang (1961 - ) Canadian Singer/songwriter \n 70.Gianni Versace (1946- 1997) Italian Fashion Designer\n 71. Rosie O'Donnell (1962- )Comedien, Actess.", 
   {
    "post_info": {
     "post_title": "Famous Gays and Lesbians in history..."
    }
   }, 
   81864, 
   null, 
   1109930700.0
  ], 
  [
   95398, 
   null, 
   "jyoshu", 
   "Famous Gays and Lesbians in History \n\n \n A number of those on your list should really be qualified as \"possibly\" gay. Let's face it, there's just no way to know for certain that someone who lived as far back as two millenia ago is gay or not. In fact I'd have to say the same for many of them from Davinci on back.", 
   {}, 
   95379, 
   null, 
   1109952780.0
  ], 
  [
   95401, 
   null, 
   "wsm2506", 
   "A number of those on your list should really be qualified as \"possibly\" gay. Let's face it, there's just no way to know  for certain that someone who lived as far back as two millenia ago is gay or not. In fact  \n\n \n Let me see, first you say: \"no way to know\"; then you say: \"In fact\". That sounds contradictory to me.\n \n \n \nI'd have to say  the same for many of them from Davinci on back.\n\n \n Based on what? The \"opinions\" of others of what was \"probably\" meant by someone else 2,000+years ago??", 
   {}, 
   95398, 
   null, 
   1109953800.0
  ], 
  [
   95406, 
   null, 
   "jyoshu", 
   "Let me see, first you say: \"no way to know\"; then you say: \"In fact\". That sounds contradictory to me.\n\n \n How do KNOW Socrates was gay? \n \n How do you KNOW Plato was gay?\n \n How do you KNOW Sappho from 600 BC was gay?\n \n How do you KNOW a Chinese emperor from 140 BC was gay?\n \n How do you KNOW Christopher Marlowe and Da Vinci were gay?\n \n If you are going to put the info out there portraying it as fact, show the proof. The bottom line is that the best we can say is that they \"may\" have been gay.", 
   {}, 
   95401, 
   null, 
   1109954400.0
  ], 
  [
   95410, 
   null, 
   "wsm2506", 
   "How do KNOW Socrates was gay? \n \n How do you KNOW Plato was gay?\n \n How do you KNOW Sappho from 600 BC was gay?\n \n How do you KNOW a Chinese emperor from 140 BC was gay?\n \n How do you KNOW Christopher Marlowe and Da Vinci were gay?\n \n If you are going to put the info out there portraying it as fact, show the proof. The bottom line is that the best we can say is that they \"may\" have been gay.\n\n \n I never said I DID know they were or were NOT gay. I offered no opinion whatsoever on their sexual orientation. I merely ask on what you were basing YOUR opinion, or where YOUR \"fact\" comes from.", 
   {}, 
   95406, 
   null, 
   1109955180.0
  ], 
  [
   95412, 
   null, 
   "jyoshu", 
   "I never said I DID know they were or were NOT gay. I offered no opinion whatsoever on their sexual orientation. I merely ask on what you were basing YOUR opinion.\n\n \n My opinion that such statements about them should be qualified as \"might be gay\" as opposed to portraying it as fact? Simple demand for proof, that's what. If you all can prove Plato was gay, by all means let's see it! Otherwise, why was his name among others posted under the title \"Famous Gays and Lesbians in History\"?", 
   {}, 
   95410, 
   null, 
   1109955540.0
  ], 
  [
   95418, 
   null, 
   "wsm2506", 
   "My opinion  that such statements about them should be qualified as \"might be gay\" as opposed to portraying it as fact? Simple demand for proof, that's what. If you all can prove Plato was gay, by all means let's see it! Otherwise, why was his name among others posted under the title \"Famous Gays and Lesbians in History\"?\n\n \n You are asking the wrong person. I never said  they were or were not! YOU stated: \"in fact\". I ask where YOUR facts come from.", 
   {}, 
   95412, 
   null, 
   1109956800.0
  ], 
  [
   95424, 
   null, 
   "JustineCredible", 
   "Let me see, first you say: \"no way to know\"; then you say: \"In fact\". That sounds contradictory to me.\n \n \n \n \n Based on what? The \"opinions\" of others of what was \"probably\" meant by someone else 2,000+years ago??\n\n \n Based on his need for sexual order in history. The idea that there may have actually been ancient gays and lesbians who made real impacts on the human condition simply contradicts the way he thinks. \n So, even though EVERYONE KNOWS Sappho was indeed a lesbian, and admittedly so, He (jyoshu) will still doubt it because there's no way to go back and ask her.", 
   {}, 
   95401, 
   null, 
   1109957160.0
  ], 
  [
   95434, 
   null, 
   "wsm2506", 
   "Based on his need for sexual order in history. The idea that there may have actually been ancient gays and lesbians who made real impacts on the human condition simply contradicts the way he thinks. \n So, even though EVERYONE KNOWS Sappho was indeed a lesbian, and admittedly so, He (jyoshu) will still doubt it because there's no way to go back and ask her.\n\n \n Yet he accepts his basic beliefs on much less than that. Go figure. emoticon_frazzled", 
   {}, 
   95424, 
   null, 
   1109958060.0
  ], 
  [
   95439, 
   null, 
   "MrWriteLA", 
   "In 1964 in the ancient necropolis of Saqqara, Egyptian archaeologist Ahmed Moussa discovered a series of tombs with rock-cut passages in the escarpment facing the causeway that lead to the pyramid of Unas. \n \n Soon after the Chief Inspector Mounir Basta reported crawling on his hands and knees through the passages, entering one of the Old Kingdom tombs. \n \n He was impressed with its unique scenes of two men in intimate embrace, something he had never seen before in all the Saqqara tombs.\n\n \nTheir names inscribed together as they are above, at the entrance to the rock-cut chamber, may be a design element to suggest a play on words, meaning \"joined in life and joined in death\" and obviously has reference to the closeness of the two and their desire to remain together in this life and the next.\n\n http://www.egyptology.com/niankhkhnum_khnumhotep/", 
   {
    "post_info": {
     "post_title": "THE TOMB of NIANKHKHNUM and KHNUMHOTEP"
    }
   }, 
   95434, 
   null, 
   1109958420.0
  ], 
  [
   95442, 
   null, 
   "JustineCredible", 
   "How do KNOW Socrates was gay? \n \n How do you KNOW Plato was gay?\n\n \n \n http://www.fordham.edu/halsall/pwh/symposium.html\n \n \n \nHow do you KNOW Sappho from 600 BC was gay?\n\n \n Actually LESBIAN, if you remember your history at all. \n \n Try reading her poetry some time. Maybe, just maybe you might get a clue. Why do you think she has been a lebian icon for so many centuries? \n Yes, yes, we all (those of us who have actually researched her) know she was married to a wealthy merchant Aclaeus, but does that mean automatically that she was not lesbian? No. Many lesbians married, it was expected of them as women. \n \n \n \nHow do you KNOW a Chinese emperor from 140 BC was gay?\n\n \n Actually Chinese emporers were well known to have open male lovers. It was an accepted practice. \n \n http://users.bigpond.net.au/bstone/gay_china.htm\n \n \n \n \nHow do you KNOW Christopher Marlowe and Da Vinci were gay?\n\n \n Hmmm...why else would he have had such an open interest in gays in history and wrote about gay love lives? Come on, you can't be THAT naive'. Or maybe you can...\n \n \n \n \nIf you are going to put the info out there portraying it as fact, show the proof. The bottom line is that the best we can say is that they \"may\" have been gay.\n\n \n True, but it's kinda hard to dispute it as well...\n Just because you don't like the idea of someone notable in history having been gay doesn't mean the world will revolve around your feelings.", 
   {}, 
   95406, 
   null, 
   1109958960.0
  ], 
  [
   95503, 
   null, 
   "BobNelson2", 
   "A number of those on your list should really be qualified as \"possibly\" gay. Let's face it, there's just no way to know for certain that someone who lived as far back as two millenia ago is gay or not. In fact I'd have to say the same for many of them from Davinci on back.\n\n \n Scholarship. It trumps your \"gut feeling\". You know, some people actually study these old dead folks. That's how we know they had same-sex lovers.\n \n If you don't believe some particular one, the internet awaits. Better yet, try books.", 
   {}, 
   95398, 
   null, 
   1109969280.0
  ], 
  [
   95504, 
   null, 
   "JustineCredible", 
   "Scholarship. It trumps your \"gut feeling\". You know, some people actually study these old dead folks. That's how we know they had same-sex lovers.\n \n If you don't believe some particular one, the internet awaits. Better yet, try books.\n\n \n \n \n \n emoticon_xagree \n \n [...Biting tongue and snickering under my breath...]\n \n Just another example of how well that whole \"dumming down\" thing is going. \n \n So far, so good. \n \n We can see that child wasn't left behind...", 
   {}, 
   95503, 
   null, 
   1109969520.0
  ], 
  [
   95544, 
   null, 
   "jyoshu", 
   "Scholarship. It trumps your \"gut feeling\". \n\n \n The only ones using a gut feeling here are those who are wanting to find homosexuality in history so much they'll assume it about very ancient people about which little is written about their relationships in the first place. It's sort of like saying \"Hannibal only had pet elephants and refused to have any other pets for any reason,\" just because you read that he used them in war.", 
   {}, 
   95503, 
   null, 
   1109976540.0
  ], 
  [
   95546, 
   null, 
   "jyoshu", 
   "emoticon_xagree \n \n [...Biting tongue and snickering under my breath...]\n \n Just another example of how well that whole \"dumming down\" thing is going. \n \n So far, so good. \n \n We can see that child wasn't left behind...\n\n \n This has got to be one of the more intentionally condescending posts I've read. I'm probably older than you are, and nobody is doing any \"dumming down.\" What a crock.", 
   {}, 
   95504, 
   null, 
   1109976780.0
  ], 
  [
   95548, 
   null, 
   "Duo_Maxwell", 
   "1.Sappho (600 B.C.) Greek Poetess \n 2.Socrates (470-399 B.C.) Greek Teacher and Philosopher \n 3.Plato (427-347 B.C.) Greek Teacher and Philosopher \n 4.Alexander The Great (356-323 B.C.) Macedonian King and Military Leader \n \n Let's look at the first four.\n \n Sappho was a lesbian poet with known lesbian lovers. That pretty much rules out that argument\n Socrates and plato were part of the man-love-teacher system that ran through greek society. That pretty much rules out that argument\n Alexander litterally slept with several of his male confidants. That pretty much rules out that argument", 
   {}, 
   95546, 
   null, 
   1109977080.0
  ], 
  [
   95551, 
   null, 
   "tonybrown74", 
   "This has got to be one of the more intentionally condescending posts I've read. I'm probably older than you are, and nobody is doing any \"dumming down.\" What a crock.\n\n \n Age means nothing in relation to knowledge and experience. All your age tells is is that you lived longer ...", 
   {}, 
   95546, 
   null, 
   1109977620.0
  ], 
  [
   95553, 
   null, 
   "BobNelson2", 
   "The only ones using a gut feeling here are those who are wanting to find homosexuality in history so much they'll assume it about very ancient people about which little is written about their relationships in the first place. It's sort of like saying \"Hannibal only had pet elephants and refused to have any other pets for any reason,\" just because you read that he used them in war.\n\n \n You're not very good with analogies, are you?\n \n It's a bit hard to tell, but it appears that you're arguing that the best way to describe Hannibal would be \"pet-owner\" as opposed to \"elephant-owner\" because, though the latter is very well documented, you just never know... he MIGHT have also had his troops ride into battle on armadillos.\n \n By the way, did you notice that a few of the entries on Justine's list say \"actually bi\"? Sort of like \"had other pets\".", 
   {}, 
   95544, 
   null, 
   1109977800.0
  ], 
  [
   95560, 
   null, 
   "jyoshu", 
   "The interesting thing here is that no one (including me) is arguing that any or all of these historical figures were NOT gay. They may indeed have been. But good history-interpretation never emphatically assumes as fact something of which there is little to no direct evidence, and that's why, regarding some of them, we'll never really know for sure.", 
   {}, 
   95553, 
   null, 
   1109978220.0
  ], 
  [
   95566, 
   null, 
   "Duo_Maxwell", 
   "Age means nothing in relation to knowledge and experience. All your age tells is is that you lived longer ...\n\n \n Furthermore, any argument that asserts that because of age you are correct is fallacious, specifically the fallacy of knowlegdge of the ancients/youth. \n \n Just goes to show you that Anti arguments revolve around fallacies, lies and majority oppresion\n \n jyoshu: the majority of people are saying that they don't care if historical figures were or were not gay. It doesn't matter at all and therefore any argument that they were or were not is irrevelant.", 
   {}, 
   95551, 
   null, 
   1109978820.0
  ], 
  [
   95571, 
   null, 
   "BobNelson2", 
   "The interesting thing here is that no one (including me) is arguing that any or all of these historical figures were NOT gay. They may indeed have been. But good history-interpretation never emphatically assumes as fact something of which there is little to no direct evidence, and that's why, regarding some of them, we'll never really know for sure.\n\n \n OK. You know this odd attitude you have means that ALL historical figures \"may indeed have been gay\".\n \n I can live with that. Seems kinda silly, but you've convinced me.\n \n Henry VIII... wow, who'd've thunk it?", 
   {}, 
   95560, 
   null, 
   1109979120.0
  ], 
  [
   95573, 
   null, 
   "jyoshu", 
   "OK. You know this odd attitude you have means that ALL historical figures \"may indeed have been gay\".\n\n \n Sure, as long as one ignores the the fact that it is generally understood that gays make up no more than between 3-7% of a population.", 
   {}, 
   95571, 
   null, 
   1109979420.0
  ], 
  [
   95576, 
   null, 
   "tonybrown74", 
   "The interesting thing here is that no one (including me) is arguing that any or all of these historical figures were NOT gay. They may indeed have been. But good history-interpretation never emphatically assumes as fact something of which there is little to no direct evidence, and that's why, regarding some of them, we'll never really know for sure.\n\n \n You would have a point if sexual orientation was irrelevant in today's society. The fact that we are having this debate should tell you that it is quite relevant. There are people still, to this day, arguing about the \"validity\" of homosexual \"actions\" (whatever that means), even though most professional medical organizations have determined that being gay/bi is an innate characteristic that is determined early in life. The last election used homophobia as a basis to get out the vote, and now we have people that do not want anything remotely positive said about homosexuality in schools, or on TV. Homosexuality is VERY relevant right now. Finding out that one (or more) of our historical figures may have been at least bisexual just tells us that homosexuality - even if irrelevant at the time - did exist back then, even in our leaders.", 
   {}, 
   95560, 
   null, 
   1109979780.0
  ], 
  [
   95578, 
   null, 
   "tonybrown74", 
   "Sure, as long as one ignores the the fact that it is generally understood that gays make up no more than between 3-7% of a population.\n\n \n \n Out of curiosity, where do you get that figure from?", 
   {}, 
   95573, 
   null, 
   1109979840.0
  ], 
  [
   95581, 
   null, 
   "jyoshu", 
   "Out of curiosity, where do you get that figure from?\n\n \n Taking Kinsey's claim of 10%, bumping it down some because that is now commonly disputed as being too high.", 
   {}, 
   95578, 
   null, 
   1109980500.0
  ], 
  [
   95582, 
   null, 
   "tonybrown74", 
   "Taking Kinsey's claim of 10%, bumping it down some because that is now commonly disputed as being too high.\n\n \n Commonly disputed by whom? And even if that were the case, what are the actual figures these people come up with?", 
   {}, 
   95581, 
   null, 
   1109980680.0
  ], 
  [
   95604, 
   null, 
   "jitobear", 
   "You would have a point if sexual orientation was irrelevant in today's society. The fact that we are having this debate should tell you that it is quite relevant. There are people still, to this day, arguing about the \"validity\" of homosexual \"actions\" (whatever that means), even though most professional medical organizations have determined that being gay/bi is an innate characteristic that is determined early in life. The last election used homophobia as a basis to get out the vote, and now we have people that do not want anything remotely positive said about homosexuality in schools, or on TV. Homosexuality is VERY relevant right now. Finding out that one (or more) of our historical figures may have been at least bisexual just tells us that homosexuality - even if irrelevant at the time - did exist back then, even in our leaders.\n\n \n Wow. This is an excellent post.", 
   {}, 
   95576, 
   null, 
   1110004200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Historian's book says Lincoln was gay", 
  "url": "http://www.4forums.com/political/gay-rights-debates/3906-historians-book-says-lincoln-gay.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 3906, 
  "discussion_files": [
   [
    "4421.html", 
    "http://www.4forums.com/political/gay-rights-debates/3906-historians-book-says-lincoln-gay-print.html"
   ], 
   [
    "4422.html", 
    "http://www.4forums.com/political/gay-rights-debates/3906-historians-book-says-lincoln-gay-3-print.html"
   ], 
   [
    "4423.html", 
    "http://www.4forums.com/political/gay-rights-debates/3906-historians-book-says-lincoln-gay-2-print.html"
   ]
  ], 
  "identifier": 3906
 }
]