[
 [
  [
   83448, 
   null, 
   "pnac=ww3", 
   "I was watching Discovery's The Science Channel and they had a show about the development of feathers from dinosaurs to birds. There is a very rich fossil bed in China that is yielding a lot of valuable fossils of theropod dinosaurs that showed a mix of primitive feathers and fully modern feathers. These dinosaurs would be the predecessor to Tyrannosaurus rex . So the question is, did T. rex have feathers too, or did he lose them like an elephants have lost most of their hair?\n \n Here are some links:\n http://news.nationalgeographic.com/news/2004/10/1006_041006_feathery_dino.html\n http://news.nationalgeographic.com/news/2004/10/photogalleries/feathered_dinosaur/\n http://www.msnbc.msn.com/id/6191512/\n http://news.nationalgeographic.com/news/2003/01/0121_030122_dromaeosaur.html\n http://news.nationalgeographic.com/news/2002/09/0917_020918_dinosaur.html", 
   {
    "post_info": {
     "post_title": "Did Tyrannosaurus rex have feathers?"
    }
   }, 
   null, 
   null, 
   1103626200.0
  ], 
  [
   83455, 
   null, 
   "pandion", 
   "Sad to say, I missed that show. I'm still in a nacartic stupor most of the time and can't seem to stay awake through a whole TV show. In case you're wondering, I had about 7 hours of surgery and ended up with about 11 inches of surgical scars. All of this was 21 days ago and only now, as the surgeon predicted, is the pain beginning to lessen. I'm going to be OK.\n \n Well, anyway, most of the feathered theropods seem to come from China while the T. rex is from North America. I realize that's not evidence of anything - just an observation. While the Chinese theropods and the T.rex may have been related, did the feather originate before or after the split? Wasn't it Jack Horner who first pointed out evidence of structures similar to those of warm blooded animals in the T.rex?\n \n All in all, I don't know but I sure find it interesting.", 
   {}, 
   83448, 
   null, 
   1103648220.0
  ], 
  [
   83476, 
   null, 
   "pnac=ww3", 
   "Well, on that channel they play a show about 10 times over the course of a couple of days so you might still catch it.\n \n Go here: http://www.discovery.com/\n Ah! Here it is. http://science.discovery.com/schedule/series.jsp?series=108606&gid=0&channel=SCI\n Doh, hopefully you have Tivo or something, because the last time it comes on is 5:00pm today (Dec 21).\n \n It's called \"The Dinosaur Feather Mystery.\" It was a really interesting show.\n \n I forgot about T. rex living in North America. Hmm, well, the bed they discovered dates to around 130 mya, so that's about 60 million years before the earliest T. rex could have showed up. I'd say they are pretty distant cousins, since it's been only about 65 million years ago that we think dinos went extinct, which we consider a pretty long time ago. \n \n The fact that these newly found feathered species are predecessors to T. rex implies that a lot of theropods had feathers so the evolution of the feather must have begun even before then. \n \n Who can say if T. rex had any feathers at all. It's said that they lived in a pretty warm climate so they wouldn't really need feathers.\n \n My favorite dino of the bunch has to be the little 4 winged tree-jumper.\n They showed the fossils on the TV show and then they showed some \n cg stuff of one of them flying from tree to tree with his wings on all 4 limbs.\n Wild stuff.", 
   {}, 
   83455, 
   null, 
   1103658780.0
  ], 
  [
   83479, 
   null, 
   "OccamsRazor", 
   "\n The fact that these newly found feathered species are predecessors to T. rex implies that a lot of theropods had feathers so the evolution of the feather must have begun even before then. \n \n Who can say if T. rex had any feathers at all. It's said that they lived in a pretty warm climate so they wouldn't really need feathers.\n \n\n \n This is an interesting area which has fascinated me for some time. It seems it would be quite a challenge to establish the direct lineage between the Tyrannosaurs and their coeluosaur ancestors given the limited numbers of fossils and the huge separation in time bwtween the animals.\n \n I suppose one important point is whether feathers were a characteristic feature of all Coelurosauria at the time when the chinese specimens date from or if they were limited to those group that were directly ancestral to the birds.\n \n If they were a diverse trait, then its more likely that feathers featured in T. Rex's ancestry. However, even if this were the case it would instantly mean that T. Rex was feathered itself- there is a great period of time over which such a trait could have been modified or lost entirely. Maybe T-Rex could have been like modern large mammals that do not have insulating hair- it might have retained a few specialised feathers for other specific purposes.\n \n \n P.S. Hope you have a speedy recovery pandion emoticon_xgood", 
   {}, 
   83476, 
   null, 
   1103660640.0
  ], 
  [
   83521, 
   null, 
   "pandion", 
   "Thanks for the heads up on this. I found it and was able to watch. I now have more questions than when I started but they are better questions. And it all makes sense. Maybe future findings will change the answer but I have always loved the littlest dinosaur.\n \n http://home.houston.rr.com/bybayouu/graphics/Male2003.jpg", 
   {}, 
   83479, 
   null, 
   1103676000.0
  ], 
  [
   83584, 
   null, 
   "Alan Ryan", 
   " \n \n Who can say if T. rex had any feathers at all. It's said that they lived in a pretty warm climate so they wouldn't really need feathers.\n \n .\n\n Perhaps this throws light on the question of whether T.rex was warm-bloodied or cold-bloodied. The possibility (if confirmed) of a feathered T.rex seems to indicate that they were warm-bloodied creatures that required insulation in a cool climate ???", 
   {}, 
   83476, 
   null, 
   1103726880.0
  ], 
  [
   83644, 
   null, 
   "pnac=ww3", 
   "Perhaps this throws light on the question of whether T.rex was warm-bloodied or cold-bloodied. The possibility (if confirmed) of a feathered T.rex seems to indicate that they were warm-bloodied creatures that required insulation in a cool climate ???\n\n Oh, yeah, the show went into this. They didn't really talk about T. rex that much at all. But they were pretty sure that the feathered dinosaurs must have been \"warm-blooded\" or somewhere toward truly warm blooded.\n \n There are still some animals today that aren't all the way (but dinos, or some dinos, could have been all the way, who knows?)\n http://coolcosmos.ipac.caltech.edu/image_galleries/ir_zoo/coldwarm.html\n \nSome animals do not fall neatly into the categories of being warm or cold-blooded. Bats, for example, are mammals who cannot maintain a constant body temperature and cool off when they are not active. Echidnas maintain a range of body temperatures which usually lies between 77 and 98.6 degrees Fahrenheit and have difficulty cooling down. Mole Rats are another group of mammals who are unable to regulate their body temperature, however, since they live underground, the temperature of their environment does not change much. Some warm-blooded animals, such as bears, groundhogs, gophers and bats hibernate during the cold winter. During hibernation these animals live off of stored body fat and can drop their body temperatures by as much as 50 degrees Fahrenheit. The Hawk Moth is an insect which can raise its body temperature well above the temperature of its surroundings when it is flying because of its huge wing muscles which generate heat when in use. Bees are another example of insects that can raise their body temperatures above that of their environment by moving their wings rapidly to generate heat.\n\n \n More discussion:\n http://www.enchantedlearning.com/subjects/dinosaurs/anatomy/Blood.shtml", 
   {}, 
   83584, 
   null, 
   1103750460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Did Tyrannosaurus rex have feathers?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3976-did-tyrannosaurus-rex-have-feathers.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 3976, 
  "discussion_files": [
   [
    "9329.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/3976-did-tyrannosaurus-rex-have-feathers-print.html"
   ]
  ], 
  "identifier": 3976
 }
]