[
 [
  [
   83668, 
   null, 
   "pnac=ww3", 
   "There was an allusion to tort reform in another thread so I thought it would be a good topic for its own thread.\n \n I'm no expert on the subject so I hope to learn a thing or two from this thread.\n \n From what I understand, tort \"reform\" is the reform of personal injury law\n (even though a strict definition would also include contract law).\n \n Personal injuries can come from many sources but the leading proponents of tort reform want to put caps on damages received in personal injury cases, whether they are frivolous or not. W even said that one of the reasons health care costs are so high is because there are no caps on damages in malpractice suits.\n \n I believe \"tort reform\" should not involve monetary caps on damages.\n This is like saying that your life and limbs are only worth so much.\n There is little deterrent for negligence and fraud that would lead to injury and death.\n A rich enough company or doctor can then \"afford\" to cut corners that may increase risks to individuals.\n If the law suit is frivolous (someone 'slips' on the supermarket floor) then why doesn't the court throw it out? \n Where is the reform in the court? \n Why is the \"reform\" that's being sought to punish the people who were injured?\n \n I think the main reason that proponents for tort reform want caps is to satiate certain companies in certain industries who would save lots of money by cutting corners and then by being able to afford the monetary awards in law suits brought against them. It has nothing to do with lowering health care costs or anything else.", 
   {
    "post_info": {
     "post_title": "Tort reform"
    }
   }, 
   null, 
   null, 
   1103761620.0
  ], 
  [
   83754, 
   null, 
   "whosthere", 
   "There was an allusion to tort reform in another thread so I thought it would be a good topic for its own thread.\n \n I'm no expert on the subject so I hope to learn a thing or two from this thread.\n \n From what I understand, tort \"reform\" is the reform of personal injury law\n (even though a strict definition would also include contract law).\n \n Personal injuries can come from many sources but the leading proponents of tort reform want to put caps on damages received in personal injury cases, whether they are frivolous or not. W even said that one of the reasons health care costs are so high is because there are no caps on damages in malpractice suits.\n \n I believe \"tort reform\" should not involve monetary caps on damages.\n This is like saying that your life and limbs are only worth so much.\n There is little deterrent for negligence and fraud that would lead to injury and death.\n A rich enough company or doctor can then \"afford\" to cut corners that may increase risks to individuals.\n If the law suit is frivolous (someone 'slips' on the supermarket floor) then why doesn't the court throw it out? \n Where is the reform in the court? \n Why is the \"reform\" that's being sought to punish the people who were injured?\n \n I think the main reason that proponents for tort reform want caps is to satiate certain companies in certain industries who would save lots of money by cutting corners and then by being able to afford the monetary awards in law suits brought against them. It has nothing to do with lowering health care costs or anything else.\n\n \n You are getting close to the truth here. W. and others would have us believe that damage awards are driving the price of medical malpractice insurance (for an example) so high that doctors are being forced out of business.\n The truth is that the insurance companies lost hundreds of billions on bad investments, and are raising rates to cover their own mistakes. Malpractice claims are less than 1% of the industries outlay, yet rates have gone up 200% in 6 years.\n Thre are two legitimate ways of cutting the cost of malpractice claims for the insurance industry (although they will never lower rates). these are:\n 1. Go to a \"loser pay\" system for lawsuits. This will stop most \"frivolous\" suits.\n and\n 2. Stop malpractice. You can call up the BBB to check out your auto mechanic, but, in almost all states, there is no way to check out your doctor.\n These seem like common sense reforms - which is why they won't happen under the current administration.", 
   {}, 
   83668, 
   null, 
   1103831280.0
  ], 
  [
   84240, 
   null, 
   "daewoo", 
   "From what I understand, tort \"reform\" is the reform of personal injury law (even though a strict definition would also include contract law).\n\n \n In most cases it goes past personal injury law. A tort is simply a civil wrong in which the victim pursues compensation.\n \n \nPersonal injuries can come from many sources but the leading proponents of tort reform want to put caps on damages received in personal injury cases, whether they are frivolous or not. W even said that one of the reasons health care costs are so high is because there are no caps on damages in malpractice suits.\n\n \n Thats about it\n \n Tort refomr is very unlikely to bring down medical malpractice insurance rates. Many states already have liability caps for medical malpractice (including mine) and it doesn't save the doctors any money in insurance. \n \n Medical malpractice insurance is so expensive because most places doctors are required to carry it and have been for years. this means that when an insurance company needs to caugh up some extra money (generally because some genius in the investment department made a bad call), they can hit medical malpractice policyholders with a rate increase and not have to worry about loosing customers.\n \n The same thing has happened with auto insurance. Most states now have mandatory insurance laws. Since auto insurance has become mandatory for the majority of the country, insurance rates have increased at almost double the rate that they did before insurance was mandatory. In states without insurance requirements, insurance is lower than states that require it.\n \n \nI think the main reason that proponents for tort reform want caps is to satiate certain companies in certain industries who would save lots of money by cutting corners and then by being able to afford the monetary awards in law suits brought against them. It has nothing to do with lowering health care costs or anything else.\n\n \n You are exactly right, and good for you for being able to see it.\n \n I am reminded of several years ago when we put fine caps on EPA regulations. At one time companies could be fined without limit for violations. We were convinced that this was choking industry, so we put a $25,000.00 cap on the fines. No company may be fined more then $25,000.00 per day. As a result, we habve toxic waste disposal companies that make 10 million per day dumping illegally in the ocean. The $25,000 per day fine is simply calculated into overhead. \n \n Dow chemical is fined $25,000.00 per day for pumping chemicals into lake erie. It would cost them over 1 million per day to have them disposed of properly. \n \n Sure, tort law costs businesses in this country a lot of money every yeart. Prtimarily becuas eAmerican companies are notorious for behaving poorly.", 
   {}, 
   83668, 
   null, 
   1104379140.0
  ], 
  [
   84245, 
   null, 
   "JPSartre12", 
   "There was an allusion to tort reform in another thread so I thought it would be a good topic for its own thread.\n \n I'm no expert on the subject so I hope to learn a thing or two from this thread.\n \n From what I understand, tort \"reform\" is the reform of personal injury law\n (even though a strict definition would also include contract law).\n \n Personal injuries can come from many sources but the leading proponents of tort reform want to put caps on damages received in personal injury cases, whether they are frivolous or not. W even said that one of the reasons health care costs are so high is because there are no caps on damages in malpractice suits.\n \n I believe \"tort reform\" should not involve monetary caps on damages.\n This is like saying that your life and limbs are only worth so much.\n There is little deterrent for negligence and fraud that would lead to injury and death.\n A rich enough company or doctor can then \"afford\" to cut corners that may increase risks to individuals.\n If the law suit is frivolous (someone 'slips' on the supermarket floor) then why doesn't the court throw it out? \n Where is the reform in the court? \n Why is the \"reform\" that's being sought to punish the people who were injured?\n \n I think the main reason that proponents for tort reform want caps is to satiate certain companies in certain industries who would save lots of money by cutting corners and then by being able to afford the monetary awards in law suits brought against them. It has nothing to do with lowering health care costs or anything else.\n\n \n There are many reasons why Tort Reform is necessary. Some include:\n 1. The proliferation of ambulance chasers who take cases on contingency. That way, the plaintiff pays ZERO out of pocket and te lawyer is speculating on a possible favorable outcome. It only takes a few BIG settlements out of many suits filed to be lucrative to the lawyer.\n 2. Many judges have abducated their responsibility to throw out frivilous lawsuits before they even get to trial.\n 3. Smart lawyers shop for favorable venues to have their cases heard in. Many trial lawyers know which judges are likely to act favorably to a certain type of suit and file in those courts as opposed to one less favorable.\n 4. Class Action lawsuits have been bastardized to the point that they are nothing more than a potential windfall for the plaintiff AND his lawyer and bear little resemblance to actual damages incurred.\n 5. Unlike England and many other civilized nations, we don't make the loser pay the costs if he loses. This increases the likelihood of frivilous lawsuits.\n 6. Allowing unlimited damages leaves juries free to give outrageous settlements that have no basis in fact. For example, just because little Johnny died from complication taking a frequently prescribed drug is no reason to punish the drug maker with $100's of Million in judgement because the jury isn't sympathetic to drug companies. Jury rewards have become more about making the \"mean, cold, big company pay\" than assessing fair damage awards to the victims.", 
   {}, 
   83668, 
   null, 
   1104380940.0
  ], 
  [
   84247, 
   null, 
   "JPSartre12", 
   "You are getting close to the truth here. W. and others would have us believe that damage awards are driving the price of medical malpractice insurance (for an example) so high that doctors are being forced out of business.\n\n \n If you don't think that malpractice lawsuits and the high cost of insurance are an issue, explain why its difficult to find a OB/GYN in Michigan. \n \n\n The truth is that the insurance companies lost hundreds of billions on bad investments, and are raising rates to cover their own mistakes. Malpractice claims are less than 1% of the industries outlay, yet rates have gone up 200% in 6 years.\n\n And what is the % of medical malpractice insurance in effect vs all other forms of insurance? I'd venture a guess that medical malpractice insurance is only a fraction of a % of insurance companies income. Remember, the same companies that are insuring your life, house, business and cars are also insuring your doctors. I'm guessing that the money from malpractice insurance premiums is piddly by comparison to all of the rest of the insurance premiums paid.\n \n\n Thre are two legitimate ways of cutting the cost of malpractice claims for the insurance industry (although they will never lower rates). these are:\n 1. Go to a \"loser pay\" system for lawsuits. This will stop most \"frivolous\" suits.\n and\n 2. Stop malpractice. You can call up the BBB to check out your auto mechanic, but, in almost all states, there is no way to check out your doctor.\n\n I agree with #1, but find #2 harder to accept. I think that the amount of true malpractice is extremely low, but the number of malpractice suits isn't proportional to the true rate of malpractice. My sister is a neo-natal ICU nurse and she has been involved in several malpractice lawsuits in which the patient clearly had no grounds. But, being in California, when a baby dies at birth, the filing of a lawsuit is almost Pavlovian. \n \n\n These seem like common sense reforms - which is why they won't happen under the current administration.\n\n \n I don't understand that last shot at GW. He IS pushing Tort Reform, unlike his predecessor.", 
   {}, 
   83754, 
   null, 
   1104381720.0
  ], 
  [
   84257, 
   null, 
   "daewoo", 
   "If you don't think that malpractice lawsuits and the high cost of insurance are an issue, explain why its difficult to find a OB/GYN in Michigan. \n\n \n It is difficult to find an OB/GYn anywhere. Part of this IS the result of high liability. This is mostly due to the OB part of that. This is because, unlike most medical fields, a minor mistake by an obstetrician can very easily lead tot he death of a baby. For example calculation of medication doses in adults is not critical. A fluctuation of 10% (in most cases even 100%) are no problem. They might make you sick, but that is about it. because a baby is so small and their system is almost entirely open, a 3% overdose of some of the most commonly used neonatal medications is enough to kill an infant. \n \n An OB/GYN who has survived for quite a while and not been sued out of business is likely one of the better doctors you will ever find. The fact that they are still around means that they can think on their feet, make critical decisions quickly, and most important, make the RIGHT decisions.\n \n A few more fields in medicine that have huge potential to kill people if the doctor is not on the ball:\n \n Anesthesiology\n Neural Surgery\n Trauma specialist (ER doc)\n \n Those four are abotu it. Those are the only fields in medicine where a tiny slip at any point, a single bad judgement call, is likely to get somebody killed. Insurance for those professions is high because liability is high. Rewards (pay) is also high in those fields. Big risks net big rewards. I have an Uncle who is an Anesthesiologist. He is one of the top in his field. He has been all over the world passing gas when important people go under the knife. If a head of state is getting surgery, odds are he is there. He is a millionaire many times over. Has an art collection worth nearly 100 million dollars. Yes, his liability is high, but so is his pay. \n \n This is not a case for tort reform. This is just the way life is. Those who take big risks and go intot he above fields instead of something safer (epidermiology for instance) are in line for big rewards. With big risk comes a big chance of failure as well.\n \n \nAnd what is the % of medical malpractice insurance in effect vs all other forms of insurance? I'd venture a guess that medical malpractice insurance is only a fraction of a % of insurance companies income. Remember, the same companies that are insuring your life, house, business and cars are also insuring your doctors. I'm guessing that the money from malpractice insurance premiums is piddly by comparison to all of the rest of the insurance premiums paid.\n\n \n By raising medical malpractice rates 3% across the board in 1999 the insurance industry made an extra 3.4 BILLION dollars. Yea, piddly.\n \n \n6. Allowing unlimited damages leaves juries free to give outrageous settlements that have no basis in fact. For example, just because little Johnny died from complication taking a frequently prescribed drug is no reason to punish the drug maker with $100's of Million in judgement because the jury isn't sympathetic to drug companies. Jury rewards have become more about making the \"mean, cold, big company pay\" than assessing fair damage awards to the victims.\n\n \n This DOES NOT HAPPEN. What you are saying is that 12 jurors are picked who either have an irrational hatered for corporations or are just XXXXXX. I'm not buying it. \n \n Comanies who do business honorably and openly do not worry about things like this, because when you are standing in front of a jury, and you can honestly say that you did your bes to provide a safe product, and you don't have a bunch of skeletons in your closet, you really have nothing to fear. It is in cases where companies KNOW they are turning out an unsafe product and try to cover it up that you see huge awards.\n \n GM and side saddle fuel tanks are a good example. GM knew for YEARS that they were dangerous. They KNEW that under certain conditions there was a good likelyhood of explosion or fire. They COVERED UP the fact from the public and from government regulators bewcause it was CHEAPER to mount the gas tanks on the outside of the frame.\n \n McDonalds researchers TOLD THEM that certain food additives that McDonalds used were, in combination with high levels of sugar, addictive. McDonalds resonse was to ADD MORE of these additives and more sugar to make their food, which they KNEW was bad for you, more addictive. They later tried to COVER THIS UP.\n \n Are you seeing the pattern here? A company does something wrong, knows it, and covers it up. The idea that comapnies KILL PEOPLE for MONEY makes juries angry and makes them feel like they should punish that company.\n \n I own a company that specialises in prototyping and short run manufacturing. A lot of what we do is one off specialty industrial equipment. Several years ago we built a specialty induction melter for a client. It failed at a critical point during the melt and spilled nearly 2000 lbs of a titanium alloy onto the production floor. 3 people were vaporised by the hot metal (6000 degrees, hot enough to completely combust flesh and bone...those 3 people basically just disapeared from existance) and several other people were horribly maimed. \n \n We were sued by the families of the people who were killed and injured, as well as by our client company. We reviewed our engineering and production procedure in court.\n \n When we engineer such an item, we create a team to deal witht he design. They collectively design the device. After they are done, their design is offered to EVERY engineer in our engineering department,a dn EVERY one of them is required to do a written critique of it. After they are done. I get the design and I do a critique of it. The design then goes back to the original engineering team for revision and the process is repeated. After 2 or 3 revisions, when the design is \"perfected\" we send it to an OUTSIDE engineering company and have THEM review and critique it. We rotate companies to ensure that the answer we are getting back from them is based on a genuine critique and not on misguided loyalty to a steady customer. \n \n Once the design has been concieved and updated 4, 5, or sometimes 6 times, and EVERYBODY agrees that there are no problems, the design goes to my shop foreman. He orders materials and begins a work plan for the unit.\n \n As materials come in, EVERY critical piece is inspected using the best methods technology can provide as well as being inspected by our shop foreman. I have trashed 5 thousand dollar pieces of metal because he didn't like the way they sounded when he whacked them with a hammer, even after they have passed X-ray, Mag particle, flourescent penetrant, sonogram, the works. Every button and switch is tested. Anything outside of spec is either tossed in the trash or returned for credit.\n \n Once the materials are inspected and ready to go, fabrication begins. For every weld made, there are 2 welders, one welding, one watching. Every cut that is made involves 2 machinists, one cutting, one monitoring temperature (overheating metal changed its physical properties). Every electronic circuit is assembeled, then inspected by a second tech, then tested by a third tech, then given final inspection and test by the head of our electronics department. Every control that goes in is given the same care. Every step of this is documented ON PAPER and electronically, and the shop foreman audits it to ensure that every step is being carried out. A worker who notices a mistake or an oversight in fabrication and does not report it to the shop foreman is subject to immediate on the spot dismissal and every critical component he has worked on in the last 3 months is subject to re-inspection, even if it means sending somebody into the field to inspect equipment that has already shipped.\n \n In court, we laid out our design, fabrication, and quality control processes for the jury. We had documentation that showed that we did EVERYTHING we possibly could to provide a safe, quality product for out client. No corners were cut. We had nothign to hide. We did business in an honorable fashion, provided the best quality we could for our client, and took every precaution possible to ensure that our product was safe.\n \n As a result, the jury did not find us responsible. \n \n We never actually found out why the device failed, because it was so badly damaged in the accident (half of it was completely unidentifiable). We have had a couple of units that experienced structural failure, and in those cases we have also had favorable verdicts from the juries because we took every reasonable precaution. They saw no negligence or malice on our part. We were upfront with our clients and upfront with the jury. we tried to hide nothing, and we came out just fine.\n \n I know of at least 3 other companies that have had simialr experiences to ours with induction melters that they had produced. They were both sued out of existance because they do not have the quality control that we have. When you get a guy on the stand who says \"Yes, we knew that a failure could lead to people being vaporised\" and then \"No, we don't have any industry standard equipment to test our materials\", you are looking at a guy who is going to have problems.", 
   {}, 
   84247, 
   null, 
   1104400500.0
  ], 
  [
   84370, 
   null, 
   "whosthere", 
   "If you don't think that malpractice lawsuits and the high cost of insurance are an issue, explain why its difficult to find a OB/GYN in Michigan. High cost IS a part of the problem - never said otherwise. I was simply pointing out the true reason that insurance costs have gone up.\n \n And what is the % of medical malpractice insurance in effect vs all other forms of insurance? I'd venture a guess that medical malpractice insurance is only a fraction of a % of insurance companies income. Remember, the same companies that are insuring your life, house, business and cars are also insuring your doctors. I'm guessing that the money from malpractice insurance premiums is piddly by comparison to all of the rest of the insurance premiums paid. Irrelevant to the issue at hand (tort reform).\n \n I agree with #1, but find #2 harder to accept. I think that the amount of true malpractice is extremely low, but the number of malpractice suits isn't proportional to the true rate of malpractice. My sister is a neo-natal ICU nurse and she has been involved in several malpractice lawsuits in which the patient clearly had no grounds. But, being in California, when a baby dies at birth, the filing of a lawsuit is almost Pavlovian. The incidence of malpractice is staggering. My wife is a medical records supervisor at our state's largest hospital, and takes care of all records involved in malpractice claims, as well as those involving \"mistakes\" where no claim has been filed. I can assure you that malpractice (defined as an error in treatment) occurs on a regular basis in any major hospital. A recent study by the Dept of Health (see their website, you'll have to use their search engine) says that errors in medication at major hospitals is as high as 40%. That's why I say \"staggering.\" \n \n \n I don't understand that last shot at GW. He IS pushing Tort Reform, unlike his predecessor.\n He's not pushing \"tort reform,\" just using the label. He's pushing to limit victim's rights.", 
   {}, 
   84247, 
   null, 
   1104450420.0
  ], 
  [
   84383, 
   null, 
   "marc9000", 
   "Comanies who do business honorably and openly do not worry about things like this, because when you are standing in front of a jury, and you can honestly say that you did your bes to provide a safe product, and you don't have a bunch of skeletons in your closet, you really have nothing to fear. It is in cases where companies KNOW they are turning out an unsafe product and try to cover it up that you see huge awards. \n\n \n Huge awards can happen when a product is unsafe ONLY if someone misuses it. Companies are often required to pay because of really stupid misuse of their product. What is the definition of \"safe\"? Safe under normal use, or idiot proof? Making a very useful, practical item idiot proof can easily make it cost prohibitive so that no one can have it. We are possibly doing without a few things now because of that. Another reason the U.S. may be having trouble competing in some world markets.\n \n \nGM and side saddle fuel tanks are a good example. GM knew for YEARS that they were dangerous. They KNEW that under certain conditions there was a good likelyhood of explosion or fire. They COVERED UP the fact from the public and from government regulators bewcause it was CHEAPER to mount the gas tanks on the outside of the frame. \n\n \n Trucks aren't intended to be rammed in the side. 67 - 72 Ford pickups have the tank mounted INSIDE THE CAB, extending out past the frame rails on the sides. Did they \"know\" the danger - was this covered up? I own one - wonder if I should try to wreck it and sue them?\n \n Back when the GM tanks were a big news story, NBC, in their never ending quest to keep us informed, performed their own \"crash tests\" on these pickups. They rigged them with explosives to make really impressive video. WHY DOES NBC STILL EXIST? The fact that they do is clear proof that we need tort reform. There are double standards, and corruption.\n \n \nMcDonalds researchers TOLD THEM that certain food additives that McDonalds used were, in combination with high levels of sugar, addictive. McDonalds resonse was to ADD MORE of these additives and more sugar to make their food, which they KNEW was bad for you, more addictive. They later tried to COVER THIS UP.\n\n \n Did this happen before or after that lady spilled hot coffee in her lap?\n \n \n \nAre you seeing the pattern here? A company does something wrong, knows it, and covers it up. The idea that comapnies KILL PEOPLE for MONEY makes juries angry and makes them feel like they should punish that company. \n\n \n About 15 years ago, for a period of a few years, Ford Motor Company had a separate seat belt - shoulder belt system. The shoulder belt was automatic, the lap belt had to be fastened manually. Someone got hurt because they didn't fasten the lap belt, and the shoulder belt only can sometimes be worse than no belt at all. They sued, and Ford payed through the nose for it. Was Ford really trying to kill people? Ford also paid dearly for the 1988 Ky. church bus crash. (the worst drunk driving wreck in this country's history) The bus was rammed in the front corner, and the spring punctured the gas tank. Was Ford trying to kill people?\n \n Which would make a jury angier, what Ford did, or what NBC did?", 
   {}, 
   84257, 
   null, 
   1104459960.0
  ], 
  [
   84386, 
   null, 
   "jskufan", 
   "I just want to add a couple of comments to the current discussion, primarily aimed at those who defend the current tort system.\n \n First of all, people will always be hurt and killed as a result of defective products. People design and build most everything we use in modern day life, and people will always make mistakes.\n \n Secondly, most judgments and damages are paid by insurance companies not the defendants. Therefore, you and I pay a portion of all monies paid to plaintiffs. As insurance companies need more revenues to cover these expenses, premiums go up, and the prices for all products and services go up. Saying malpractice suits account for only a small portion of premiums is ridiculous. The costs are built into every aspect of the health care industry from pharmaceuticals to wheelchairs. It's impossible to estimate this cost because it's built into everything we buy.\n \n Lastly, the legal profession extorts a disproportionate amount of this revenue for their \"services\". Injured parties should be compensated for their pain, however, a very large part of the total cost in any suit is attributable to the endless litigation costs on both sides and the percentage taken by the \"winning\" legal representation. It's not uncommon to have many thousands of dollars invested just to get an innocent party excluded from a suit. The plaintiff simply has to throw out a wide net to better his chances for a payoff. I think if jurors really understood the fact that they were sharing in the awards, they'd be a lot less generous.", 
   {}, 
   84383, 
   null, 
   1104461640.0
  ], 
  [
   84395, 
   null, 
   "pnac=ww3", 
   "There are many reasons why Tort Reform is necessary. Some include:\n 1. The proliferation of ambulance chasers who take cases on contingency. That way, the plaintiff pays ZERO out of pocket and te lawyer is speculating on a possible favorable outcome. It only takes a few BIG settlements out of many suits filed to be lucrative to the lawyer.\n\n I don't see how lawyers making money from winning law suits is a reason for tort reform. If people weren't injured or wronged in some way then they shouldn't win the case, and no money will be awarded.\n \n \n2. Many judges have abducated their responsibility to throw out frivilous lawsuits before they even get to trial.\n\n This is THE MAIN problem. This is what needs to be reformed. \n Not putting caps on damages.\n \n \n3. Smart lawyers shop for favorable venues to have their cases heard in. Many trial lawyers know which judges are likely to act favorably to a certain type of suit and file in those courts as opposed to one less favorable.\n\n This is the type of thing that John Edwards was saying needed to be part of tort reform. Lawyers need to be held responsible for frivolous law suits. if a law suit is found to be frivolous, the lawyer should be punished monetarily (but this would be a disincentive for lawyers to attempt cases that are actual cases on the mere chance they could get fined.)\n \n So basically you are saying that the problem isn't the amount of damages awarded, it's that there are favorable venues for frivolous law suits. \n \n \n4. Class Action lawsuits have been bastardized to the point that they are nothing more than a potential windfall for the plaintiff AND his lawyer and bear little resemblance to actual damages incurred.\n\n Potential. If they win, then they get paid. If they lose, they get bupkis.\n \n \n5. Unlike England and many other civilized nations, we don't make the loser pay the costs if he loses. This increases the likelihood of frivilous lawsuits.\n\n See, this is where I need to learn something.\n Who pays then? Insurance companies?\n To me, what increases the likelihod of frivoulous lawsuits is that judges let them go to trial.\n \n \n6. Allowing unlimited damages leaves juries free to give outrageous settlements that have no basis in fact. For example, just because little Johnny died from complication taking a frequently prescribed drug is no reason to punish the drug maker with $100's of Million in judgement because the jury isn't sympathetic to drug companies. Jury rewards have become more about making the \"mean, cold, big company pay\" than assessing fair damage awards to the victims.\n\n Well, the judge is who determines on a case by case basis what damages should be awarded, how much the plaitiff receives. There are no caps on that figure, but I don't think we can consider it limitless. \n And whether a drug company pays through the nose for the death of a user of its drugs is up to the judge (or jury) in the case. This is the jurisdiction of the courts. Politicians always complain about \"activist judges\" re-writing law (when all they were doing was interpreting the law as written, which is their job), but it looks like legislators want to extend their power into the courtroom, which is beyond their jurisdiction.", 
   {}, 
   84245, 
   null, 
   1104469440.0
  ], 
  [
   84396, 
   null, 
   "pnac=ww3", 
   " It failed at a critical point during the melt and spilled nearly 2000 lbs of a titanium alloy onto the production floor. 3 people were vaporised by the hot metal (6000 degrees, hot enough to completely combust flesh and bone...those 3 people basically just disapeared from existance) and several other people were horribly maimed.\n\n GD, that's terrible.\n Did the families ever receive any kind of compensation or relief?\n Hopefully they had life insurance or something.\n \n \n\n Secondly, most judgments and damages are paid by insurance companies not the defendants. Therefore, you and I pay a portion of all monies paid to plaintiffs.\n\n Well, then this is the part that needs to be changed first.\n I'm not \"for\" the current tort system. i just don't think caps on damages is \n the way to reform anything.\n Making the loser pay (and not its insurance company) is the first step and probably the biggest that I can see.\n \n \nLastly, the legal profession extorts a disproportionate amount of this revenue for their \"services\". Injured parties should be compensated for their pain, however, a very large part of the total cost in any suit is attributable to the endless litigation costs on both sides and the percentage taken by the \"winning\" legal representation. It's not uncommon to have many thousands of dollars invested just to get an innocent party excluded from a suit. The plaintiff simply has to throw out a wide net to better his chances for a payoff. I think if jurors really understood the fact that they were sharing in the awards, they'd be a lot less generous.\n\n A judge (who is way more informed in these matters than a jury) can always, and often does, reduce awards if they seem extreme.", 
   {}, 
   84257, 
   null, 
   1104470340.0
  ], 
  [
   84403, 
   null, 
   "marc9000", 
   "\n See, this is where I need to learn something.\n Who pays then? Insurance companies?\n \n\n \n The costs are incurred on the municipalities. TAXPAYERS.", 
   {}, 
   84395, 
   null, 
   1104471360.0
  ], 
  [
   84423, 
   null, 
   "daewoo", 
   "Huge awards can happen when a product is unsafe ONLY if someone misuses it. Companies are often required to pay because of really stupid misuse of their product. What is the definition of \"safe\"? Safe under normal use, or idiot proof? Making a very useful, practical item idiot proof can easily make it cost prohibitive so that no one can have it. We are possibly doing without a few things now because of that. Another reason the U.S. may be having trouble competing in some world markets.\n\n \n This is not generally the case.\n \n \nTrucks aren't intended to be rammed in the side. 67 - 72 Ford pickups have the tank mounted INSIDE THE CAB, extending out past the frame rails on the sides. Did they \"know\" the danger - was this covered up? I own one - wonder if I should try to wreck it and sue them?\n\n \n No, but collisions, including side impact collisions, are a reasonable expectation during the course of regular use. \n \n \nBack when the GM tanks were a big news story, NBC, in their never ending quest to keep us informed, performed their own \"crash tests\" on these pickups. They rigged them with explosives to make really impressive video. WHY DOES NBC STILL EXIST? The fact that they do is clear proof that we need tort reform. There are double standards, and corruption.\n\n \n Not the point. The point is that GM KNEW the dnager existed and not only did they not fix it, they went out of their way to cover it up.\n \n \n \nDid this happen before or after that lady spilled hot coffee in her lap?\n\n \n After. The coffee in the lap thing is another one that people like to throw out there. Mc Donalds was passing out liquid in paper cups that was hot enought to cause THIRD DEGREE burns. This was not just a matter of some lady gets burned a little. \n \n In an industrial environment, OSHA regulations require pretty extensive safety equipment for dealing with liquids in that temperature range, and Mcdonalds was giving it out in styrofoam cups. This was definatly, absolutly irresponsible.\n \n \nAbout 15 years ago, for a period of a few years, Ford Motor Company had a separate seat belt - shoulder belt system. The shoulder belt was automatic, the lap belt had to be fastened manually. Someone got hurt because they didn't fasten the lap belt, and the shoulder belt only can sometimes be worse than no belt at all. They sued, and Ford payed through the nose for it. Was Ford really trying to kill people? Ford also paid dearly for the 1988 Ky. church bus crash. (the worst drunk driving wreck in this country's history) The bus was rammed in the front corner, and the spring punctured the gas tank. Was Ford trying to kill people?\n\n \n The seat belt thing I don't know about. The bus thing, yes, for was risking peoples lives to save a buck. Ford was the only company selling busses without keepers on the springs. For almost 10 years the NTSB was issuing warnings about leaf springs on busses breaking in the even of an accident. It was dangerous, and ford let it slide in order to save a couple hundred bucks.", 
   {}, 
   84383, 
   null, 
   1104476340.0
  ], 
  [
   84424, 
   null, 
   "pnac=ww3", 
   "The costs are incurred on the municipalities. TAXPAYERS.\n\n Isn't that thr truth with everything though. :)\n That air conditioner factory that got a municipal subsidy to be built (are the taxpayers the lien holder?) should be.\n \n That football stadium that the NFL talked the city into building.\n Do the taxpayers get rent checks? Dividends? Anything?\n Oh, they get high ticket prices, if they actually even like the team they partly paid for.\n \n It's almost impossible to escape the interdependency of the economy.\n If something costs a lot of money, somehow, someway, everyone ends up pitching in at least something down the line.\n \n If there's something that needs to be reformed it's \"corporate welfare.\"", 
   {}, 
   84403, 
   null, 
   1104476760.0
  ], 
  [
   84429, 
   null, 
   "daewoo", 
   "GD, that's terrible.\n Did the families ever receive any kind of compensation or relief?\n Hopefully they had life insurance or something.\n\n \n Yes. The families of those killed teamed up witht he folks who were badly injured and sued the company off the face of the earth. \n \n Using the casting methods that they were, OSHA requires raised catwalks so in the event that a catastrophic failure like that takes place, the molten metal flows under the folks, who can (in theory) make is to safety. the company did not have this safety equipment. They knew of the requirements, and knew of the dangers of operating witout them, but did it anyway. The system would have cost them nearly $20,000 and the OSHA fine for not having it was only $1000 so they made the decision to risk their employees lives to save a few bucks (and $20,000 to a company that size truly is a FEW bucks).\n \n I know that a scholarship fund was set up for the kids of those killed (my company contributed quite a bit of money to it) and the families are taken care of. Other than that I am not sure.\n \n \nFirst of all, people will always be hurt and killed as a result of defective products. People design and build most everything we use in modern day life, and people will always make mistakes.\n\n \n Yes, but the big tort settlements we see are almost never the result of a mistake or an oversight. They are the result of a conscious decision by a company to do something wrong.\n \n This is why our constitutional right ot a jury trial for such things is so important. As I said before, a jury is not likely to find for a plantif in cases where the defendant was doing business entirely above board and doing all they could to provide a safe and effective product.\n \n Lastly, the legal profession extorts a disproportionate amount of this revenue for their \"services\". Injured parties should be compensated for their pain, however, a very large part of the total cost in any suit is attributable to the endless litigation costs on both sides and the percentage taken by the \"winning\" legal representation. It's not uncommon to have many thousands of dollars invested just to get an innocent party excluded from a suit. The plaintiff simply has to throw out a wide net to better his chances for a payoff. I think if jurors really understood the fact that they were sharing in the awards, they'd be a lot less generous.", 
   {}, 
   84424, 
   null, 
   1104478080.0
  ], 
  [
   84430, 
   null, 
   "daewoo", 
   "GD, that's terrible.\n Did the families ever receive any kind of compensation or relief?\n Hopefully they had life insurance or something.\n\n \n Yes. The families of those killed teamed up witht he folks who were badly injured and sued the company off the face of the earth. \n \n Using the casting methods that they were, OSHA requires raised catwalks so in the event that a catastrophic failure like that takes place, the molten metal flows under the folks, who can (in theory) make is to safety. the company did not have this safety equipment. They knew of the requirements, and knew of the dangers of operating witout them, but did it anyway. The system would have cost them nearly $20,000 and the OSHA fine for not having it was only $1000 so they made the decision to risk their employees lives to save a few bucks (and $20,000 to a company that size truly is a FEW bucks).\n \n I know that a scholarship fund was set up for the kids of those killed (my company contributed quite a bit of money to it) and the families are taken care of. Other than that I am not sure.\n \n \nFirst of all, people will always be hurt and killed as a result of defective products. People design and build most everything we use in modern day life, and people will always make mistakes.\n\n \n Yes, but the big tort settlements we see are almost never the result of a mistake or an oversight. They are the result of a conscious decision by a company to do something wrong.\n \n This is why our constitutional right ot a jury trial for such things is so important. As I said before, a jury is not likely to find for a plantif in cases where the defendant was doing business entirely above board and doing all they could to provide a safe and effective product.\n \n \nLastly, the legal profession extorts a disproportionate amount of this revenue for their \"services\". Injured parties should be compensated for their pain, however, a very large part of the total cost in any suit is attributable to the endless litigation costs on both sides and the percentage taken by the \"winning\" legal representation. It's not uncommon to have many thousands of dollars invested just to get an innocent party excluded from a suit. The plaintiff simply has to throw out a wide net to better his chances for a payoff. I think if jurors really understood the fact that they were sharing in the awards, they'd be a lot less generous.\n\n \n To me, this would be truly effective tort reform. If a judge was required to make a yes or no decision as far as attorneys taking cases on contingency (on a case by case basis), and legal costs were to be payed by the looser, this would significantly decrese such frivolous suits.\n \n Sme states already allow defendants in lawsuits to counter sue for their legal expenses. These states tend to have much quiter civil court dockets.", 
   {}, 
   84424, 
   null, 
   1104478200.0
  ], 
  [
   84512, 
   null, 
   "marc9000", 
   "This is not generally the case. \n\n \n If you don't know a thing about the Ford car seat belt case I mentioned, maybe you aren't qualified to make this general, all encompasing statement.\n \n \n \n \nNo, but collisions, including side impact collisions, are a reasonable expectation during the course of regular use. \n\n \n As they are with the 67 - 72 Fords. Why was GM singled out? It always seems to be part of the legal game to single one company out. If the blame was applied more evenly and fairly, maybe the companies would have a better chance of reasonably defending themselves. \n \n \n \n \nNot the point. The point is that GM KNEW the dnager existed and not only did they not fix it, they went out of their way to cover it up. \n\n \n The subject is tort reform - it is EXACTLY the point. Profit making enterprises can almost always be divided into two classifications. Some make products in a competitive market that people buy of their own free will, and some, with a much more protected market, leech off of human emotion. Trial lawyers, and NBC fall into the latter catagory. Safety features ALWAYS have a cost. UNUSED safety features are ALWAYS a waste. IMO GM's \"covering up\" of this questionable danger, is far less of a crime than NBC's blatent attempt to mislead the public about GM's product. Sure, NBC was attacking \"big business\" (a routine job of the liberal media) but it was also seeking ratings, attempting to make a \"couple bucks\". \n \n \n \n \n \n \n \nThe seat belt thing I don't know about. The bus thing, yes, for was risking peoples lives to save a buck. Ford was the only company selling busses without keepers on the springs. For almost 10 years the NTSB was issuing warnings about leaf springs on busses breaking in the even of an accident. It was dangerous, and ford let it slide in order to save a couple hundred bucks.\n\n \n Keepers on the springs? Never heard that one - what was GM and International doing to their springs that Ford was not? Leaf springs are pretty simple things, they have an eyelet with a pin on each end. Did they do crash tests that PROVED that a GM or International bus would not have caught on fire in a crash like that? You're saying that those two companies wouldn't have been sued if it would have been one of their buses? emoticon_rolleyes What a coincedence - the bus body maker, Sheller Globe, was sued too. Don't know what the reason was, but I'm sure they did some wicked cost cutting to provoke it. If only it would have been a Wayne or Carpenter bus. Then there would have been no suit, right? It appears that Sheller Globe quit making school bus bodies a few years before that accident. Wayne and Carpenter had been building them for about 75 years each. They both recently went under. Did they forget how to make and market their product, or did our legal system have something to do with their demise? Since the mid - eighties, Ky. school buses have almost tripled in price. And we'll continue to wonder why we have ever increasing difficulty competing in world markets.", 
   {}, 
   84423, 
   null, 
   1104600000.0
  ], 
  [
   84554, 
   null, 
   "JPSartre12", 
   "I don't see how lawyers making money from winning law suits is a reason for tort reform. If people weren't injured or wronged in some way then they shouldn't win the case, and no money will be awarded.\n\n I didn't say that lawyers shouldn't be paid for their work, only that indulging in speculative lawsuits belonged in the realm of pond scum. If a plaintiff has a real case, let him pay the lawyer and when he wins, he'll be made whole again. Suing in a \"no risk\" environment in which the lawyer assumes all of the risk, and 30-50% of the reward, places no incentive on the plaintiff to make sure that he has a real case.\n \n\n This is THE MAIN problem. This is what needs to be reformed. \n Not putting caps on damages.\n\n The problem is all of the above.\n \n\n This is the type of thing that John Edwards was saying needed to be part of tort reform. Lawyers need to be held responsible for frivolous law suits. if a law suit is found to be frivolous, the lawyer should be punished monetarily (but this would be a disincentive for lawyers to attempt cases that are actual cases on the mere chance they could get fined.)\n\n Agreed. There are already statutes on the books to punish lawyers who initiate frivilous lawsuits...unfortunately, they aren't enforced.\n \n\n So basically you are saying that the problem isn't the amount of damages awarded, it's that there are favorable venues for frivolous law suits. \n\n I gave a list of problems and you choose to target just one aspect. I think that all of the 6 items listed are part of the problem.\n \n\n Potential. If they win, then they get paid. If they lose, they get bupkis.\n\n A multi-millionaire lawyer like Edwards, for example, can do a lot of speculating before it affects his pocketbook. You only need one motherlode to pay for a lifetime of fruitless mining. :)\n \n\n See, this is where I need to learn something.\n Who pays then? Insurance companies?\n To me, what increases the likelihod of frivoulous lawsuits is that judges let them go to trial.\n\n Good question. I'll have to do some research and get back to you because I'd like to know myself. I know that the number of suits is much lower and the standards for allowing a suit are much higher, though.\n \n\n Well, the judge is who determines on a case by case basis what damages should be awarded, how much the plaitiff receives. There are no caps on that figure, but I don't think we can consider it limitless. \n\n In the case of class action lawsuits, it does appear that the kitty is bottomless. \n \n\n And whether a drug company pays through the nose for the death of a user of its drugs is up to the judge (or jury) in the case. This is the jurisdiction of the courts.\n\n How many juries have you known who can make an educated assessment on what the correct monetary award should be? We're lucky if we can get a jury to come back with the correct verdict half of the time let alone expect them to give a reasonable settlement figure.\n \n\n Politicians always complain about \"activist judges\" re-writing law (when all they were doing was interpreting the law as written, which is their job), but it looks like legislators want to extend their power into the courtroom, which is beyond their jurisdiction.\n\n You have it all wrong. It isn't a trial judge's responsibility to interpret the law. That job belongs with SCOTUS. It is his job to insure that the law is fairly applied. \n There is a movement in Congress to give itself the power to overturn SCOTUS rulings, but I believe that such a law would be unconstitutional and, ironically, would likely be found unconstitutional by SCOTUS. ;)", 
   {}, 
   84395, 
   null, 
   1104626820.0
  ], 
  [
   84556, 
   null, 
   "JPSartre12", 
   "He's not pushing \"tort reform,\" just using the label. He's pushing to limit victim's rights.\n\n \n No, actually, I'm pushing for fairness and a better definition of the term \"victim\".\n To me, a victim is someone who had no knowledge or opportunity to avoid damages caused by another party's negligence. This definition would eliminate nearly ALL smokers suing tobacco companies, for instance, because they all knew of the potential risks involved in smoking.", 
   {}, 
   84370, 
   null, 
   1104627120.0
  ], 
  [
   84584, 
   null, 
   "pnac=ww3", 
   "The problem is all of the above.\n\n Almost all of the above.\n \n\n I gave a list of problems and you choose to target just one aspect. I think that all of the 6 items listed are part of the problem.\n\n I started out targetting ONE thing, caps on damages.\n The system needs reform, but you can't call giving incentives to rich companies to be negligent \"reform.\" This is what caps on damages does.\n \n\n In the case of class action lawsuits, it does appear that the kitty is bottomless. \n \n It appears so because we aren't sitting on the judge's bench.\n I'm sure that a judge worthy of the title will not grant an award \n that is so ridiculous as to be considered coming from a bottomless pit.\n The limits are arbitrary, but they are there (in the judge's head).\n \n \nHow many juries have you known who can make an educated assessment on what the correct monetary award should be? We're lucky if we can get a jury to come back with the correct verdict half of the time let alone expect them to give a reasonable settlement figure.\n\n That's why the judge can raise or lower the amount the jury awards.\n \n \nYou have it all wrong. It isn't a trial judge's responsibility to interpret the law. That job belongs with SCOTUS. It is his job to insure that the law is fairly applied. \n\n Ah, ok, bad wording. and state laws are interpreted by state supreme courts, but anyway...\n \n Eh, but you're right. I think that standard sentences are determined legislatively, and lots of things judges must adhere to come from legislation, not just precedent.\n \n \nThere is a movement in Congress to give itself the power to overturn SCOTUS rulings, but I believe that such a law would be unconstitutional and, ironically, would likely be found unconstitutional by SCOTUS. ;)\n\n Yeah, but then congress would just vote to give the president the authority to do it for them and take all the blame when he does it.", 
   {}, 
   84554, 
   null, 
   1104635220.0
  ], 
  [
   84658, 
   null, 
   "lord tammerlain", 
   "I didn't say that lawyers shouldn't be paid for their work, only that indulging in speculative lawsuits belonged in the realm of pond scum. If a plaintiff has a real case, let him pay the lawyer and when he wins, he'll be made whole again. Suing in a \"no risk\" environment in which the lawyer assumes all of the risk, and 30-50% of the reward, places no incentive on the plaintiff to make sure that he has a real case.\n \n \n\n \n \n There is a real problem with having to pay the lawyer first. Many people could not afford the $200+ /hr fee that the lawyers would want on an ongoing basis. If a person has been injured, and as a result unable to work how would they be able to pay for a lawyer to sue the person that caused the injury?", 
   {}, 
   84554, 
   null, 
   1104684900.0
  ], 
  [
   84659, 
   null, 
   "jskufan", 
   "There is a real problem with having to pay the lawyer first. Many people could not afford the $200+ /hr fee that the lawyers would want on an ongoing basis. If a person has been injured, and as a result unable to work how would they be able to pay for a lawyer to sue the person that caused the injury?\n\n \n I don't think the problem here is taking cases on \"contingency\", or simply extending credit to the plaintiffs. I think the real problem is the giant percentages plaintiffs are required to sign away in exchange for the upfront credit. Why are lawyers entitled to such windfall profits above and beyond their normally high hourly rates? This allows them to take many cases they know are groundless and coerce settlements, or take their chances with juries knowing they'll collect on a percentage of them. If they were only entitled to collect their normal rate, they would weed out the suits that had no merit.", 
   {}, 
   84658, 
   null, 
   1104686580.0
  ], 
  [
   84663, 
   null, 
   "georged", 
   "I don't think the problem here is taking cases on \"contingency\", or simply extending credit to the plaintiffs. I think the real problem is the giant percentages plaintiffs are required to sign away in exchange for the upfront credit. Why are lawyers entitled to such windfall profits above and beyond their normally high hourly rates? This allows them to take many cases they know are groundless and coerce settlements, or take their chances with juries knowing they'll collect on a percentage of them. If they were only entitled to collect their normal rate, they would weed out the suits that had no merit.\n\n \n The legal profession determined our civil and criminal court system was becoming overloaded about 40-years ago. Up to that point most contingency cases were based on actual, accumulated billings paid out on settlement. Insurance companies, deluged with claims in what was rapidly becoming our something for nothing society, established settlement levels for most claims that avoided the overhead of litigation and negotiation. Lawyers quickly switched to the percentage of settlement method and in effect became very highly paid administrators passing money from insurance companies to claimants. I don't know what the actual percentage of total claims reaching juries is, but when compared to the total its tiny and reserved for big buck cases. To go to court on a percentage basis just creates additional overhead and less profit margin for both the lawyer and insurance company/self-insured business. They both prefer settlement, even in large, combined tort cases.\n \n Which provides a higher than average income for even incompetent lawyers. When combined with our plea bargain criminal sentencing structure, I believe we now have more lawyers than the rest of the world combined due to financial rewards, which also make a hefty contribution to our transaction oriented GDP numbers. \n \n Like most of the ills in our society, this one isn't going to be solved by partisan political legislation. There's way too much money involved and the public has grown accustomed to being highly rewarded beyond actual costs for normal negligence, one of the components of loss of personal responsibility. \n \n About a year ago I was rear-ended by a intermediate sized SUV. $6k damage to my truck and the other party's SUV totaled. I wasn't injured but did receive calls from three big personal injury law mills (who obviously follow accident reports issued by the city/county for a fee), each basically telling me it would be quick big bucks in my pocket to retain them, see their doctors and follow a prescribed course of therapy until the other party's insurance company coughed up to avoid pursuit of a neck/back injury lawsuit. So there's the cycle; lawyers, doctors, physical therapists, public agencies and individuals, all after personal gain, with insurance rates responding accordingly. How do you break that cycle with legislation and an already overloaded judicial system?", 
   {}, 
   84659, 
   null, 
   1104691680.0
  ], 
  [
   84705, 
   null, 
   "jskufan", 
   "\n How do you break that cycle with legislation and an already overloaded judicial system?\n\n \n I don't know if you break the cycle or the cycle breaks itself. When the last domestic manufacturer closes its doors to avoid the outrageous costs associated with doing business in America we may finally run out of \"targets\" for these modern day pirates to feed on. For every millionaire we create in the courtroom, there's an insurance company out there re-calculating next years premium.", 
   {}, 
   84663, 
   null, 
   1104715860.0
  ], 
  [
   84712, 
   null, 
   "georged", 
   "I don't know if you break the cycle or the cycle breaks itself. When the last domestic manufacturer closes its doors to avoid the outrageous costs associated with doing business in America we may finally run out of \"targets\" for these modern day pirates to feed on. For every millionaire we create in the courtroom, there's an insurance company out there re-calculating next years premium.\n\n \n The lawyers I know tell me big-time volume personal injury firms we all see advertise in every media form in every major city seldom ever see the inside of a civil courtroom. Ten or so bar members in those firms, usually members of multiple, highly populated state bars where insurance carriers are domiciled manage big staffs of paralegals supervising clerks who basically file against insurance companies and government entities, coordinate the medical side and deposit settlement checks. They all have a litigator or two for big buck cases, and some specialize in government hearings (they have their own judicial system), workers comp claims being a big revenue source as any business person who ever furnished a workers comp insurance policy can attest to. Your basic, in many cases, something for nothing money machines, with most heavily involved in politics.\n \n Interesting when one considers this topic is just a fragment of our current social and economic ills. And we're using military force to impose our ideology on other, far less powerful nations. Sound familiar in a historical sense?", 
   {}, 
   84705, 
   null, 
   1104720000.0
  ], 
  [
   84719, 
   null, 
   "jskufan", 
   "The lawyers I know tell me big-time volume personal injury firms we all see advertise in every media form in every major city seldom ever see the inside of a civil courtroom. Ten or so bar members in those firms, usually members of multiple, highly populated state bars where insurance carriers are domiciled manage big staffs of paralegals supervising clerks who basically file against insurance companies and government entities, coordinate the medical side and deposit settlement checks. They all have a litigator or two for big buck cases, and some specialize in government hearings (they have their own judicial system), workers comp claims being a big revenue source as any business person who ever furnished a workers comp insurance policy can attest to. Your basic, in many cases, something for nothing money machines, with most heavily involved in politics.\n \n Interesting when one considers this topic is just a fragment of our current social and economic ills. And we're using military force to impose our ideology on other, far less powerful nations. Sound familiar in a historical sense?\n\n \n At our company, the General Liability premium represents the highest expense probably after equipment note payments and labor. Obviously, that cost has to be recovered by our customers, and I doubt we are the exception in our industry. As you've mentioned, workman's compensation is also responsible for a sizable percentage of the premium and problem. In the great state of Missouri, it is unthinkable for an employer to challenge the validity of an injury, you simply pay and pay and pay. The system is a breeding ground for abuse and merely encourages future employees to participate in the extended paid vacations that result from it.\n \n On the subject of tort litigation, the biggest problem is the complete lack of checks and balances, at least in our industry. The costs incurred by our council to defend the suit can actually surpass the settlement, and unfortunately all costs involved reflect on a clients loss report, which in turn dictate your premiums. Therefore, winning and clearing your name can still result in being a high risk and carry the same financial penalties as loosing: for the insurance companies, cost is cost.", 
   {}, 
   84712, 
   null, 
   1104724140.0
  ], 
  [
   84721, 
   null, 
   "JPSartre12", 
   "The lawyers I know tell me big-time volume personal injury firms we all see advertise in every media form in every major city seldom ever see the inside of a civil courtroom. Ten or so bar members in those firms, usually members of multiple, highly populated state bars where insurance carriers are domiciled manage big staffs of paralegals supervising clerks who basically file against insurance companies and government entities, coordinate the medical side and deposit settlement checks. They all have a litigator or two for big buck cases, and some specialize in government hearings (they have their own judicial system), workers comp claims being a big revenue source as any business person who ever furnished a workers comp insurance policy can attest to. Your basic, in many cases, something for nothing money machines, with most heavily involved in politics.\n \n Interesting when one considers this topic is just a fragment of our current social and economic ills. And we're using military force to impose our ideology on other, far less powerful nations. Sound familiar in a historical sense?\n\n \n Ever hear the quote \"Millions for defense but not one cent for tribute\"? Believe it!!!!! emoticon_mad", 
   {}, 
   84712, 
   null, 
   1104724320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Tort reform", 
  "url": "http://www.4forums.com/political/politics-debates/3989-tort-reform.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 3989, 
  "discussion_files": [
   [
    "11020.html", 
    "http://www.4forums.com/political/politics-debates/3989-tort-reform-print.html"
   ], 
   [
    "11021.html", 
    "http://www.4forums.com/political/politics-debates/3989-tort-reform-2-print.html"
   ]
  ], 
  "identifier": 3989
 }
]