[
 [
  [
   83949, 
   null, 
   "whosthere", 
   "All laws that make criminals out of people for actions that do not \"victimize\" anyone else should be repealed. These include things like: most drug laws, gambling laws, sexual conduct laws (involving consenting adults), etc.\n \n Anyone?", 
   {
    "post_info": {
     "post_title": "Resolved: Victimless crimes should be abolished"
    }
   }, 
   null, 
   null, 
   1104180360.0
  ], 
  [
   86337, 
   null, 
   "chaoticgnome", 
   "I obviously agree with abolishing any crimes related to consensual sex, with the exception that consent doesn't make statutory rape all right etc.\n \n I have problems abolishing all \"victimless\" crimes such as drug use. I do think that large prison sentences for simple possession are a detriment that does nothing but assure later crime and overfill our prisons. At the same time, victimless crimes often lead to others. A person on a cocaine binge can get violent and, of course, there is the sterotypical crack addict who mugs people to be able to pay his dealer.\n \n It comes down to what we want our criminal system to be. If we wish the justice system to punish those who commit crimes than we can just wait for the violent crimes resulting from drug use etc. and imprison them for that. If our justice system is designed to help prevent such crimes, then laws that deter destructive behavior are in order.\n \n These laws, however, should be more on the order of fines or community service and thus act more like a sin tax than a criminal law. If you call for a complete end to all crimes that the law declares \"victimless\" you run a lot of risks.\n \n For example, there was a court case that found computer generated child pornography, that is, an actual minor was not involved, legal. Owning or distributing CG child pornography, in that sense, is a victimless crime.\n \n It's a tenuous balance and like most things in life, the correct answer lies somewhere in the middle.", 
   {}, 
   83949, 
   null, 
   1105583640.0
  ], 
  [
   86676, 
   null, 
   "whosthere", 
   "While you make some good points - I respectfully disagree.\n What you are advocating is punishing people for what they MIGHT do, or for what someone else has done in the past.\n In this country, one has the right to face and question his/her accusor. That would be the victim, or the victim's proxy.\n Who is the victim if I grow a marijuana plant, dry it, and smoke it?", 
   {}, 
   86337, 
   null, 
   1105720980.0
  ], 
  [
   86679, 
   null, 
   "joebrummer", 
   "The crimes you have listed are not victimless crimes. If there were no victims, it wouldn't be a crime. Some laws are in place to protect society from itself. \n \n Drugs.....If you are a drug addict, you are sucjing up resources from the commmunity...tax dollars....to steal, lie, cheat, go in and out of treament.....\n \n Gambling.....If you are a gambler and you have lost it all, who's tax dollars will it be to pick you up again?\n \n Sexual laws between consenting adult ...I agree here.", 
   {}, 
   86676, 
   null, 
   1105721220.0
  ], 
  [
   87269, 
   null, 
   "whosthere", 
   "The crimes you have listed are not victimless crimes. If there were no victims, it wouldn't be a crime. Some laws are in place to protect society from itself. \n \n Drugs.....If you are a drug addict, you are sucjing up resources from the commmunity...tax dollars....to steal, lie, cheat, go in and out of treament.....\n \n Gambling.....If you are a gambler and you have lost it all, who's tax dollars will it be to pick you up again?\n \n Sexual laws between consenting adult ...I agree here.\n\n You are still advocating the punishment of one person for the actions of another. You are also assuming that all drug users are \"addicts.\"\n As to gambling - If you have \"lost it all\" this implies that you had the ability to aquire it all in the first place. Why would gambling prevent you from doing so again?", 
   {}, 
   86679, 
   null, 
   1106071440.0
  ], 
  [
   87744, 
   null, 
   "epaphras_faith", 
   "Ask anyone who has been involved with another with an addiction whether or not their crimes are victimless.\n \n Alanon is a support group for family and friends of alcoholics. One would think that the alcoholic isn't hurting anyone but himself. At least that's what I glean from Whosthere's comments. Ask those in Alanon if it is true. There are millions of these people worldwide. I am one. \n \n What a foolish statement that drug use doesn't harm anyone. We are all involved with family and friends. We hurt those people by our addictive behavior. Why do you think there are support groups for so many kinds of addiction.\n \n Even sexual conduct between consenting adults can be harmful if it is a part of a codependent relationship.\n \n There are really no \"victimless\" crimes. It is why they were determined criminal in the first place. We don't just live in a society. We also live in relationships. \n \n It sounds like someone just doesn't want to take responsibility for their behavior.\n \n Judgement? No, I am not judging anyone, just drawing a conclusion based on evidence. NO comments about the persons worth.\n \n \n ________\n \n Edit: Sorry, I didn't realize I was in the tournaments forum. I apologize if I interupted an official debate. If that is the case please ask the admin to delete my comments.\n \n EF", 
   {}, 
   87269, 
   null, 
   1106339880.0
  ], 
  [
   87963, 
   null, 
   "jim's trucking", 
   "...\n \n ________\n \n Edit: Sorry, I didn't realize I was in the tournaments forum. I apologize if I interupted an official debate. If that is the case please ask the admin to delete my comments.\n \n EF\nI see only one poster with multiple posts, so the debate evidently hasn't begun. I believe whosthere is still waiting for acceptance of the challenge.\n \n Speaking of deleting one's posts, I visit another VBulletin board where you can totally delete any post you make. What is the reasoning behind not allowing that here? After all, on edit you can go back and delete all the text and show totally different text in the re-post.\n \n \n On edit: I was mistaken. Evidently we can delete our own posts.", 
   {}, 
   87744, 
   null, 
   1106516640.0
  ], 
  [
   88679, 
   null, 
   "whosthere", 
   "Ask anyone who has been involved with another with an addiction whether or not their crimes are victimless. The vast majority of the millions of people who use illeagal drugs in this country do not become addicts. Why should they be punished?\n \n Alanon is a support group for family and friends of alcoholics. One would think that the alcoholic isn't hurting anyone but himself. At least that's what I glean from Whosthere's comments. You misread me. I never said that our actions do not affect others. Ask those in Alanon if it is true. There are millions of these people worldwide. I am one. \n \n What a foolish statement that drug use doesn't harm anyone. We are all involved with family and friends. We hurt those people by our addictive behavior. Why do you think there are support groups for so many kinds of addiction. Again, you are dealing with addicts, not the majority. Addiction can take many forms, drugs (including alcohol) are just one. Most things that people get addicted to are legal (television is a good example). The simple fact that something can be abused is not, in itself, justification to punish those who do not abuse it (or even those who do - if they don't harm anyone other than themselves).\n \n Even sexual conduct between consenting adults can be harmful if it is a part of a codependent relationship. Like marriage? Not being sarcastic, just not sure what you mean.\n \n There are really no \"victimless\" crimes. It is why they were determined criminal in the first place. We don't just live in a society. We also live in relationships. \n \n It sounds like someone just doesn't want to take responsibility for their behavior. Where did you get that idea from?\n \n Judgement? No, I am not judging anyone, just drawing a conclusion based on evidence. NO comments about the persons worth. The above certainly looks like a judgment (an incorrect one).\n \n \n ________\n \n Edit: Sorry, I didn't realize I was in the tournaments forum. I apologize if I interupted an official debate. If that is the case please ask the admin to delete my comments. No one has actually accepted the challenge yet - so you aren't interrupting at all.\n \n EF\n\n \n You are welcome to accept if you wish. I'm not sure how these things work, since this is the first one I've done.", 
   {}, 
   87744, 
   null, 
   1106947680.0
  ], 
  [
   88685, 
   null, 
   "epaphras_faith", 
   "You are welcome to accept if you wish. I'm not sure how these things work, since this is the first one I've done.\n\n \n Actually, as I said, I didn't realize this was the debate tournament thread. I would not have posted. I simply got moving to fast and not paying attention. I don't have the time to join an actual debate. \n \n DSA Devil has been the judge in the past. There are rules somewhere in this forum for the debates and how they should procedeed.", 
   {}, 
   88679, 
   null, 
   1106948340.0
  ], 
  [
   206342, 
   null, 
   "waskelwabbit35", 
   "It is unbeleivable to me how people can justify putting people in prison that are just pursuing what makes them happy and not harming anyone. Drinking and driving is one of the most contraversial of the victimless crimes because you \"could kill someone\", many people in United States prisons today are there because they have more than one drinking and driving convictions and have not hurt anyone but themselves which in my opinion shouldn't be a crime. Let's talk about all the millions wasted on enforcing such laws as drug possesion and sale and still yet the millions local governments make off such laws and the lives of people that have not hurt anyone being ruined just because thier pusuit of happiness is not the same as our \"representatives\" in government who really represent lobbiests and their own interests and greed.\n If I am sitting here at home shooting heroin (which I am not) who am I hurting besides myself? Shouldn't that be my right? Wake up America, soon it will be something that makes you happy that you will be spending some time in jail over losing your job and reputation. The lawmakers pass new laws everyday and it will not stop until we the people stop it. emoticon_xgood And by the way if someone is addicted and disturbing others with their behaivior those other people are not forced to keep dealing with that person after all this is supposed to be a free country, if you don't like it get away from it. Why should everyone be punished for the few that cant control what they do??", 
   {
    "post_info": {
     "post_title": "Abolish all victimless crimes"
    }
   }, 
   88685, 
   null, 
   1144637280.0
  ], 
  [
   206350, 
   null, 
   "zachvac", 
   "All laws that make criminals out of people for actions that do not \"victimize\" anyone else should be repealed. These include things like: most drug laws, gambling laws, sexual conduct laws (involving consenting adults), etc.\n \n Anyone?\n\n \n \n As much as I agree with you, I think it would be very interesting to debate from the other side, so unless someone who's already posted would like to debate this topic, I'm game.\n \n Just one condition though, I don't like putting victimless in the statement of the debate because the argument is whether they are truly victimless or not. I think it should be something actually stating the crimes we are talking about (drug use, gambling laws, sorry I just don't see a single argument for banning certain sexual conduct among adults).\n \n One more thing to clarify, would you be arguing that these laws should be repealed or should I be arguing that these laws should exist?", 
   {}, 
   83949, 
   null, 
   1144642800.0
  ], 
  [
   206442, 
   null, 
   "MTKnight", 
   "It is unbeleivable to me how people can justify putting people in prison that are just pursuing what makes them happy and not harming anyone. Drinking and driving is one of the most contraversial of the victimless crimes because you \"could kill someone\", many people in United States prisons today are there because they have more than one drinking and driving convictions and have not hurt anyone but themselves which in my opinion shouldn't be a crime. Let's talk about all the millions wasted on enforcing such laws as drug possesion and sale and still yet the millions local governments make off such laws and the lives of people that have not hurt anyone being ruined just because thier pusuit of happiness is not the same as our \"representatives\" in government who really represent lobbiests and their own interests and greed.\n If I am sitting here at home shooting heroin (which I am not) who am I hurting besides myself? Shouldn't that be my right? Wake up America, soon it will be something that makes you happy that you will be spending some time in jail over losing your job and reputation. The lawmakers pass new laws everyday and it will not stop until we the people stop it. emoticon_xgood And by the way if someone is addicted and disturbing others with their behaivior those other people are not forced to keep dealing with that person after all this is supposed to be a free country, if you don't like it get away from it. Why should everyone be punished for the few that cant control what they do??\n\n \n Ok about the drinking and driving and how they don't kill anyone. Doesn't matter...they drank and drive and that impairs their driving skills. About people who shoot up with heroin at home the law is in place to protect them. I mean look at history. What did England do to China because they wouldn't open their doors to trade. They sent in opium. :P This country really doesn't want people to shoot heroin and not get sent to jail for it. Cause over time more and more people will do it. My mom's boyfriend did all of the above...he spent time in jail for 2-3 years. He did all manner of drugs and drank and drive. He got off prieviously because as you say they were victomless crimes, but he avoided his probation officer and still did the same XXXX. However, because he did time he is no long an acholic and doesn't do drugs. He hasn't had a drink in almost 3 years. This is just completely foolish, there are so many examples that refute these so called 'victomless crimes' its amazing.", 
   {}, 
   206342, 
   null, 
   1144697580.0
  ], 
  [
   245161, 
   null, 
   "Protege", 
   "Hi-I'm new here so I hope I'm doing this right:\n \n With regards to law, perhaps this brings us to a more fundamental question about what the purpose of law is. Is it punitive in nature (that is, does it exist simply to punish offenders?) or is it more preventative (it exists to stop future offenders before they begin)? \n \n I will argue that the reason for the so called \"victimless crimes\" is often more preventative in nature. While one cannot blanketly say \"all people who use drugs are addicts\", it is a fair thing to say that most street drugs available today will not enhance one's life, will more than likely lead to addiction, will often have lasting effects on both the person's health as well as their relationships with family and friends, and (currently) will also finance criminal operations that manufacture or produce the illegal drugs. I will also venture (not knowing any stats) that most people that begin illegal drug use are teenagers, or at least a huge portion, and teenagers often seem to think they are invincible, and often lack an ability to grasp the gravity of an addiction (whereas, say, a 25 year old who knows how hard it is to quit smoking might understand addiction a bit better).", 
   {
    "post_info": {
     "post_title": "Resolved: Disagreed"
    }
   }, 
   206442, 
   null, 
   1167401340.0
  ], 
  [
   245435, 
   null, 
   "daewoo", 
   "STOP\n \n \n Whosthere posted a resolution and a formal debate challenge. In order for that formal debate to go forward, ONE person has to accept the challenge. TWO people are involved in a formal debate...NOT just anybody who wants to participate.\n \n Once the debate challenge is accepted, a format has to be agreed upon as far as # of posts, etc... THEN the debaters debate. Once the debate is finished, it is judged based on the logic of the debaters arguments.", 
   {}, 
   245161, 
   null, 
   1167686580.0
  ], 
  [
   245709, 
   null, 
   "Zardoz", 
   "Hehe, didn't Whosthere start this thread like 2 years ago?\n \n With only 40 posts made, it's doubtful that this particular topic could be debated by the original poster.\n \n Talk about necromancy.", 
   {}, 
   245435, 
   null, 
   1167865140.0
  ], 
  [
   308977, 
   null, 
   "gpdk1", 
   "i agree with what was said", 
   {}, 
   83949, 
   null, 
   1208484900.0
  ], 
  [
   308978, 
   null, 
   "gpdk1", 
   "i agree with what was said \n emoticon_xkill emoticon_xkill \n emoticon_xkill emoticon_xkill \n emoticon_xkill emoticon_xkill", 
   {}, 
   83949, 
   null, 
   1208484960.0
  ], 
  [
   313696, 
   null, 
   "nutter", 
   "Point made.", 
   {
    "post_info": {
     "post_title": "Hmmm"
    }
   }, 
   245709, 
   null, 
   1213989240.0
  ], 
  [
   401278, 
   null, 
   "Freedom", 
   "All laws that make criminals out of people for actions that do not \"victimize\" anyone else should be repealed. These include things like: most drug laws, gambling laws, sexual conduct laws (involving consenting adults), etc.\n \n Anyone?\n\n \n Without the violation of rights there can be no crime. A crime without a victim is a crime which violated no right.\n \n There is no crime without a victim.\n \n Beware though, a victim must not defined as they who one can feel pity for nor can the violation of a right be restricted to direct interaction.", 
   {}, 
   83949, 
   null, 
   1273621500.0
  ], 
  [
   401485, 
   null, 
   "josephdphillips", 
   "Without the violation of rights there can be no crime. A crime without a victim is a crime which violated no right. There is no crime without a victim. Beware though, a victim must not defined as they who one can feel pity for nor can the violation of a right be restricted to direct interaction.\n\n In criminal law, the victim of a crime is the state. Thus there is no such thing as a victimless crime.\n \n That said, I would lower the age of consent and repeal laws against prostitution. Californians will be voting on the legalization of marijuana, which we already decriminalized anyway, and I'll be voting against it.", 
   {}, 
   401278, 
   null, 
   1273770480.0
  ], 
  [
   401516, 
   null, 
   "Freedom", 
   "The state can't be a victim its an abstraction.\n \n Or to be more precise the only way to make a victim out of a state is to victimize every member.", 
   {}, 
   401485, 
   null, 
   1273785120.0
  ], 
  [
   401526, 
   null, 
   "josephdphillips", 
   "The state can't be a victim its an abstraction. Or to be more precise the only way to make a victim out of a state is to victimize every member.\nExactly. In criminal law, the citizens are the ones harmed by crime, severally. That is what distinguishes a crime from a tort.\n \n The question is really whether abolition of a particular law is better or worse for society.", 
   {}, 
   401516, 
   null, 
   1273788780.0
  ], 
  [
   401540, 
   null, 
   "Freedom", 
   "Exactly. In criminal law, the citizens are the ones harmed by crime, severally. That is what distinguishes a crime from a tort.\n \n The question is really whether abolition of a particular law is better or worse for society.\n\n \n The question should be whether abolition of a particular law is right or wrong, much like all other questions pertaining to law.\n \n You cannot harm all people with a crime of human ability, so you cannot hold society or even a country as a victim.", 
   {}, 
   401526, 
   null, 
   1273795680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Resolved: Victimless crimes should be abolished", 
  "url": "http://www.4forums.com/political/debate-challenges/4015-resolved-victimless-crimes-should-abolished.html", 
  "breadcrumbs": [
   "Debate Challenges"
  ], 
  "id_number": 4015, 
  "discussion_files": [
   [
    "2036.html", 
    "http://www.4forums.com/political/debate-challenges/4015-resolved-victimless-crimes-should-abolished-print.html"
   ], 
   [
    "2037.html", 
    "http://www.4forums.com/political/debate-challenges/4015-resolved-victimless-crimes-should-abolished-2-print.html"
   ]
  ], 
  "identifier": 4015
 }
]