[
 [
  [
   84070, 
   null, 
   "unkerpaulie", 
   "is it because he lies in his films, or because he just rubs people the wrong way?", 
   {
    "post_info": {
     "post_title": "why do people really hate michael moore?"
    }
   }, 
   null, 
   null, 
   1104276420.0
  ], 
  [
   84072, 
   null, 
   "JPSartre12", 
   "is it because he lies in his films, or because he just rubs people the wrong way?\n\n \n I found his first movie, Roger and Me, to be an interesting story about the decline of the US auto industry and its impact on Flint, MI. While most of it was unstaged documentary, he juxtaposed scenes to make certain things look like cause and effect. He tried the same thing with later, political movies, but with much less honesty. He clearly had an agenda in Bowling for Columbine, for example, and he played on the public's \"touchy-feely\" attitude and not facts to sell his belief that guns should be made illegal by using cripples to gain sympathy for his campaign. IMO, he used Columbine survivors to further his own personal agenda. After that, I stopped watching anything that he did and saw him become an ever-increasing fool.", 
   {}, 
   84070, 
   null, 
   1104276960.0
  ], 
  [
   84088, 
   null, 
   "emclean", 
   "Quote:\n its funny. do people hate moore because his films portray lies, or because he rubs them the wrong way? \n \n speeking for myself, it is both, he knowling puts out lies, or at best half truths, and will manuilpuate the footage as best as he can, and calls it a documentary. he will use footage with out permition, rewright newspaper headlines, all in the name of truth. i think he is a sleasy tabloid reporter who lucked into some thing more lucrative.\n (i had not seen this thred when i answered in ther gun controle section)", 
   {}, 
   84072, 
   null, 
   1104290760.0
  ], 
  [
   84108, 
   null, 
   "unkerpaulie", 
   "I found his first movie, Roger and Me, to be an interesting story about the decline of the US auto industry and its impact on Flint, MI. While most of it was unstaged documentary, he juxtaposed scenes to make certain things look like cause and effect. He tried the same thing with later, political movies, but with much less honesty. He clearly had an agenda in Bowling for Columbine, for example, and he played on the public's \"touchy-feely\" attitude and not facts to sell his belief that guns should be made illegal by using cripples to gain sympathy for his campaign. IMO, he used Columbine survivors to further his own personal agenda. After that, I stopped watching anything that he did and saw him become an ever-increasing fool.\n\n oh boy. not once did moore ever even imply that guns should be made illegal. the cripple boy scene was to show that live ammo is way too easily available. the fact is that the boy got shot and became cripple, and the fact is that the ammo was bought from a walmart department store. in moore minds theres something wrong with this picture, and he believes it needs to be addressed. it has nothing to do with making guns illegal. in fact, it had nothing to do with making selling of ammo at department stores illegal either", 
   {}, 
   84072, 
   null, 
   1104334500.0
  ], 
  [
   84110, 
   null, 
   "unkerpaulie", 
   "speeking for myself, it is both, he knowling puts out lies, or at best half truths, and will manuilpuate the footage as best as he can, and calls it a documentary. he will use footage with out permition, rewright newspaper headlines, all in the name of truth. i think he is a sleasy tabloid reporter who lucked into some thing more lucrative.\n (i had not seen this thred when i answered in ther gun controle section)\n\n from what i see, moore presents facts in a way that illustrates the point of view he is seeing it from. he presents his information so that the viewer sees what he is seeing, likely in an effort to make the viewer as disgusted or sympathetic about a situation as he is\n \n but what he presents are facts. not once has anybody showed that moore makes up stuff or lies in his movies. the way he sees the situation is the way he presents it. i cannot see anything wrong with that\n \n what i usually see is that a lot of people dont like his point of view, or thinks he is wrong to present the facts they way he does. people dont like to see america the way moore presents it. they dont like the way he presents his views on a situation. they usually dont want to believe that things are as bad as moore presents them to be\n \n all in all, not once has anyone shown that his work is based on lies, but it becomes more evident that moore simply rubs people the wrong way", 
   {}, 
   84088, 
   null, 
   1104334920.0
  ], 
  [
   84152, 
   null, 
   "JPSartre12", 
   "oh boy. not once did moore ever even imply that guns should be made illegal. the cripple boy scene was to show that live ammo is way too easily available. the fact is that the boy got shot and became cripple, and the fact is that the ammo was bought from a walmart department store. in moore minds theres something wrong with this picture, and he believes it needs to be addressed. it has nothing to do with making guns illegal. in fact, it had nothing to do with making selling of ammo at department stores illegal either\n\n \n Gun grabbers have used the tactic of trying to control ammunition for years since they know that a Constitutional challenge of the Second will leave them devastated. The first attempt that I remember was to tax ammo at an extremely high level. That effort failed, thank God. Since then, gun grabbers have tried to eliminate guns via new safety regulations requiring trigger locks. The tactics may change but the goal remains the same, to eliminate private ownership of firearms. And Moore is a posterboy for that movement.\n :xcensored", 
   {}, 
   84108, 
   null, 
   1104347400.0
  ], 
  [
   84156, 
   null, 
   "unkerpaulie", 
   "Gun grabbers have used the tactic of trying to control ammunition for years since they know that a Constitutional challenge of the Second will leave them devastated. The first attempt that I remember was to tax ammo at an extremely high level. That effort failed, thank God. Since then, gun grabbers have tried to eliminate guns via new safety regulations requiring trigger locks. The tactics may change but the goal remains the same, to eliminate private ownership of firearms. And Moore is a posterboy for that movement.\n :xcensored\n\n wow, so guns shouldnt have regulations? how about cars and medicine? there are laws making it mandatory to put huge tags on pillow cases warning of potential hazards. pillow cases! think about the guy that sued phillip-morris for 3 billion after dying from cigarette induced lung cancer. its in the government's and companies' best interest to put regulations on their products, especially those that are potentially hazardous to life. i cannot see why you would be against regulations about guns...", 
   {}, 
   84152, 
   null, 
   1104347940.0
  ], 
  [
   84176, 
   null, 
   "emclean", 
   "but what he presents are facts. not once has anybody showed that moore makes up stuff or lies in his movies. the way he sees the situation is the way he presents it. i cannot see anything wrong with that\n \n the two things i mantoined were directly about the 911 film, the footage from Arlinton cematery were used with out the famlies permition, not illegal, or lieing, just slezy, the a news paper headline that was flashed on the screan appered to be large type on the frount page from an Illinois paper, the headline was close, but not the same, it was taken from an editorial, not the frount page, and was printed in much smaller print. the paper saw sueing MM for $1 (link to anit moore sight talking about the lie, with pics. link to paper ands columnist who acused more of the lie this happened 5 mounths age, the link to the story is not working, but i would guess bill flick could tell you mare about it). that would cover the lieing\n \n \noh boy. not once did moore ever even imply that guns should be made illegal\n \n \n from Official Transcript DONAHUE show October 28, 2002 Monday \n \"MOORE: Handguns or weapons where you can fire multiple rounds at a time. You don't need to essentially spray the woods to get your deer. If you do, you should be, you know, doing needle point or some other sport. \n \n DONAHUE: OK, so let's understand. You'd like a ban on the sale of handguns. \n \n MOORE: Yes. I believe that we don't need handguns. \n \n DONAHUE: And a ban on the sale of brrr! That kind of gun. \n \n MOORE: Anything that fires multiple rounds like that, absolutely. \"\n from MM's web sight", 
   {}, 
   84156, 
   null, 
   1104354360.0
  ], 
  [
   84185, 
   null, 
   "unkerpaulie", 
   "the two things i mantoined were directly about the 911 film, the footage from Arlinton cematery were used with out the famlies permition, not illegal, or lieing, just slezy, \n\n in other words, not lying, just rubbing you the wrong way...\n \n \nthe a news paper headline that was flashed on the screan appered to be large type on the frount page from an Illinois paper, the headline was close, but not the same, it was taken from an editorial, not the frount page, and was printed in much smaller print. the paper saw sueing MM for $1 (link to anit moore sight talking about the lie, with pics. link to paper ands columnist who acused more of the lie this happened 5 mounths age, the link to the story is not working, but i would guess bill flick could tell you mare about it). that would cover the lieing\n\n the article in question was published by the newspaper, just as moore implied it did. all moore did was put the title in a bigger font so that it could be seen easily. how is that lying?\n \n \nfrom Official Transcript DONAHUE show October 28, 2002 Monday \n \"MOORE: Handguns or weapons where you can fire multiple rounds at a time. You don't need to essentially spray the woods to get your deer. If you do, you should be, you know, doing needle point or some other sport. \n \n DONAHUE: OK, so let's understand. You'd like a ban on the sale of handguns. \n \n MOORE: Yes. I believe that we don't need handguns. \n \n DONAHUE: And a ban on the sale of brrr! That kind of gun. \n \n MOORE: Anything that fires multiple rounds like that, absolutely. \"\n from MM's web sight\n\n this was years after bowling for columbine. and even if moore felt that way prior to making his movie, he never implied it in the movie. which is what i said in the first place", 
   {}, 
   84176, 
   null, 
   1104360000.0
  ], 
  [
   84210, 
   null, 
   "emclean", 
   "the article in question was published by the newspaper, just as moore implied it did. all moore did was put the title in a bigger font so that it could be seen easily. how is that lying?\n \n you see no diffrance between something being a top of the story large print news stopy, and a letter to the editor? \n \n \nthis was years after bowling for columbine. and even if moore felt that way prior to making his movie, he never implied it in the movie. which is what i said in the first place\n \n if the above is what you ment, then it was unclear, you wrote\n \noh boy. not once did moore ever even imply that guns should be made illegal.\n \n witch seamed a bit more open ended to me.\n \n \"MSNBC\n SHOW: DONAHUE 20:00\n October 28, 2002 Monday \n \n TRANSCRIPT: # 102800cb.466\n SECTION: NEWS; DOMESTIC\n LENGTH: 6146 words \n HEADLINE: DONAHUE for October 28, 2002\n BYLINE: Phil Donahue\n GUESTS: Michael Moore \n \n HIGHLIGHT: \n Michael Moore discusses his latest film, \"Bowling for Columbine,\" a documentary about violence in American society\"\n it may have been later, but the movie was the subject of his apperance", 
   {}, 
   84185, 
   null, 
   1104368520.0
  ], 
  [
   84214, 
   null, 
   "pnac=ww3", 
   "from what i see, moore presents facts in a way that illustrates the point of view he is seeing it from. he presents his information so that the viewer sees what he is seeing, likely in an effort to make the viewer as disgusted or sympathetic about a situation as he is\n\n Not very different from a \"news\" magazine show.\n \n\n but what he presents are facts. not once has anybody showed that moore makes up stuff or lies in his movies. the way he sees the situation is the way he presents it. i cannot see anything wrong with that\n\n the way in which people present things might just be the way they see them\n so if one sees something wrong with the way something is presented they might just not agree with the perspective being presented\n \n\n what i usually see is that a lot of people dont like his point of view, or thinks he is wrong to present the facts they way he does. people dont like to see america the way moore presents it. they dont like the way he presents his views on a situation. they usually dont want to believe that things are as bad as moore presents them to be\n\n didn't mean to paraphrase you above, but ditto\n \n \nall in all, not once has anyone shown that his work is based on lies, but it becomes more evident that moore simply rubs people the wrong way\n\n and that's his tactic\n he intentionally rubs people the wrong way\n the more he does it, the more money he makes\n what a true american\n \nthink about the guy that sued phillip-morris for 3 billion after dying from cigarette induced lung cancer.\n\n Wow! That is amazing. He must have been really angry to sue from the grave. ;)", 
   {}, 
   84110, 
   null, 
   1104369180.0
  ], 
  [
   84243, 
   null, 
   "JPSartre12", 
   "wow, so guns shouldnt have regulations? \n\n No, they shouldn't. Any law-abiding citizen should be able to own guns. Period.\n \n\n how about cars and medicine? \n\n Anybody can own a car, even a 2 year old. As for medicine, show me where the constitution guarantees \"freedom of medicine\".\n \n\n there are laws making it mandatory to put huge tags on pillow cases warning of potential hazards. pillow cases! think about the guy that sued phillip-morris for 3 billion after dying from cigarette induced lung cancer. its in the government's and companies' best interest to put regulations on their products, especially those that are potentially hazardous to life. i cannot see why you would be against regulations about guns...\n\n \n I'm not against all regulations, just those that are either unnecessary or unconstitutional. I'm in favor of traffic regulations and laws against drunk driving, for example.", 
   {}, 
   84156, 
   null, 
   1104379860.0
  ], 
  [
   84280, 
   null, 
   "unkerpaulie", 
   "No, they shouldn't. Any law-abiding citizen should be able to own guns. Period.\n\n is there any citizen that cannot own a gun? there is no definition for law abiding citizen. thats why such a condtion cannot be met. things like background checks, credit and criminal history, medical records, etc, should be considered before permitting someone to own a gun.\n \n \nAnybody can own a car, even a 2 year old. As for medicine, show me where the constitution guarantees \"freedom of medicine\".\n\n the constitution guarantees \"freedom of cars\"? ownership and use of these things are regulated because there are responsibilities attached to the use and ownership of them, as well as the risk of injury or death, making either the government, the company or the owner liable for damages. thats why they put regulations in place\n \n \nI'm not against all regulations, just those that are either unnecessary or unconstitutional. I'm in favor of traffic regulations and laws against drunk driving, for example.\n\n when regulations are made, they are designed to protect both the companies and the consumer. sometimes they are made to protect the government from the public as well. the more potentially life-threatening a product is, the more regulations you will see attached to it. anything from disclaimers to acquisition of permits, are all put in place for the protection of both the consumer and the companies. it is not because the government is trying to infringe your rights. you have to remember that everybody besides you has rights as well", 
   {}, 
   84243, 
   null, 
   1104424560.0
  ], 
  [
   84284, 
   null, 
   "unkerpaulie", 
   "you see no diffrance between something being a top of the story large print news stopy, and a letter to the editor? \n\n how is it a lie if he didnt change or make up the article, the heading, the source, or anything else about it except the font and format? the purpose was to make the title easily visible. and it wasnt even made to look like it was from the front page of the newspaper. i still dont see how that is a lie\n \n \nif the above is what you ment, then it was unclear, you wrote\n \n witch seamed a bit more open ended to me.\n \n \"MSNBC\n SHOW: DONAHUE 20:00\n October 28, 2002 Monday \n \n TRANSCRIPT: # 102800cb.466\n SECTION: NEWS; DOMESTIC\n LENGTH: 6146 words \n HEADLINE: DONAHUE for October 28, 2002\n BYLINE: Phil Donahue\n GUESTS: Michael Moore \n \n HIGHLIGHT: \n Michael Moore discusses his latest film, \"Bowling for Columbine,\" a documentary about violence in American society\"\n it may have been later, but the movie was the subject of his apperance\n\n point taken. moore is against handguns and automatic assault weapons. but that was not the gist of the movie, and was not implied as a message within the movie", 
   {}, 
   84210, 
   null, 
   1104425400.0
  ], 
  [
   84298, 
   null, 
   "emclean", 
   "but that was not the gist of the movie, and was not implied as a message within the movie\n \n it was not a message stated in the movie, implied messages are what wver the viewer walks away with.\n \n \nmoore is against handguns and automatic assault weapons.\n \n \"MOORE: Yes, for handguns and for assault weapons. Hunting stuff, I don't care. They're still selling that. There's nothing against hunters here. I'm all for hunting.\"\n i am raely not trying to beat a dead hores, i am trying to show moore is aganst anything that is not \"for hunters\", i am not sure how to define what is a hunting rifle, and what is not.\n \n \nhow is it a lie if he didnt change or make up the article, the heading, the source, or anything else about it except the font and format? the purpose was to make the title easily visible. and it wasnt even made to look like it was from the front page of the newspaper. i still dont see how that is a lie\n \n this i think will have to be left as a diffrance of opinion, i think that by changing what he did changes the meaning of the headline, you do not. IMO it is something along th elines of wether or not clinton lied about having sex.", 
   {}, 
   84284, 
   null, 
   1104430740.0
  ], 
  [
   84314, 
   null, 
   "unkerpaulie", 
   "it was not a message stated in the movie, implied messages are what wver the viewer walks away with.\n\n then this could be anything. what is the point of debating the \"implied\" meaning if it could very well be totally unrelated to the movie, as in this case?\n \n \n\"MOORE: Yes, for handguns and for assault weapons. Hunting stuff, I don't care. They're still selling that. There's nothing against hunters here. I'm all for hunting.\"\n i am raely not trying to beat a dead hores, i am trying to show moore is aganst anything that is not \"for hunters\", i am not sure how to define what is a hunting rifle, and what is not.\n\n which i agreed with. its safe to say that moore is against hand guns and automatic assault rifles, which is what i said\n \n \nthis i think will have to be left as a diffrance of opinion, i think that by changing what he did changes the meaning of the headline, you do not. IMO it is something along th elines of wether or not clinton lied about having sex.\n\n clinton said straight out he didnt have sex with the woman. that was a lie, because he actually did. moore showed an article from a newspaper. that was not a lie because that newspaper actually published that article with that title. i see a difference", 
   {}, 
   84298, 
   null, 
   1104433980.0
  ], 
  [
   84340, 
   null, 
   "emclean", 
   "then this could be anything. what is the point of debating the \"implied\" meaning if it could very well be totally unrelated to the movie, as in this case?\n \n there is no way to debate it, i was conseading that there was no direct message in the movie.\n \n \nwhich i agreed with. its safe to say that moore is against hand guns and automatic assault rifles, which is what i said\n \n moore left out the automatic part, we are left with what ever an assault rifle is.\n \n \nclinton said straight out he didnt have sex with the woman. that was a lie, because he actually did. \n \n not sex according to the definition given by congress.\n \n \nthat was not a lie because that newspaper actually published that article with that title. i see a difference\n \n an editorial is not the same as a news story, the news story need s facts, an editorial is opinion.", 
   {}, 
   84314, 
   null, 
   1104441000.0
  ], 
  [
   84353, 
   null, 
   "unkerpaulie", 
   "there is no way to debate it, i was conseading that there was no direct message in the movie.\n \n \n moore left out the automatic part, we are left with what ever an assault rifle is.\n \n \n not sex according to the definition given by congress.\n \n \n an editorial is not the same as a news story, the news story need s facts, an editorial is opinion.\n\n having fun with these semantics games?\n \n the message that bowling for columbine conveyed is moore's view that the mainstream media's constant pumping of paranoia into the public is what accounts for the high rate of gun crimes in america\n \n an article was published in a newspaper. moore's movie showed that that article was published in that newspaper. it is not a lie", 
   {}, 
   84340, 
   null, 
   1104444240.0
  ], 
  [
   84389, 
   null, 
   "emclean", 
   "an article was published in a newspaper. moore's movie showed that that article was published in that newspaper. it is not a lie\n \n i guess we are stuck, it is pointless for us to keep posting the same things worded diffrntly", 
   {}, 
   84353, 
   null, 
   1104463680.0
  ], 
  [
   84503, 
   null, 
   "pnac=ww3", 
   "I'm not against all regulations, just those that are either unnecessary or unconstitutional. I'm in favor of traffic regulations and laws against drunk driving, for example.\n\n Do you think that background checks and strict licencing and registration regulations on guns are unnecessary or unconstitutional?", 
   {}, 
   84243, 
   null, 
   1104574680.0
  ], 
  [
   84565, 
   null, 
   "jitobear", 
   "Hate Michael Moore?????\n \n That seems like a lot of energy to waste on somebody you don't really know....\n \n Moore is an extremist - the left's Limbaugh. Egree disagree whatever. They do get us talking, though....", 
   {}, 
   84298, 
   null, 
   1104630540.0
  ], 
  [
   84572, 
   null, 
   "JPSartre12", 
   "is there any citizen that cannot own a gun? there is no definition for law abiding citizen. thats why such a condtion cannot be met. things like background checks, credit and criminal history, medical records, etc, should be considered before permitting someone to own a gun.\n\n Yes, there are citizens that can't legally own a gun. You enumerated a couple in your answer above, so why even ask the question? emoticon_confused \n \n\n the constitution guarantees \"freedom of cars\"? ownership and use of these things are regulated because there are responsibilities attached to the use and ownership of them, as well as the risk of injury or death, making either the government, the company or the owner liable for damages. thats why they put regulations in place\n\n Do you enjoy putting words in my mouth? I never said NOR implied that there was a constitutional right to own a car but even so, your reasoning behind regulation is bogus.\n Cars aren't regulated, driving them on public roads is regulated. I can own a car and drive to my heart's content on my own property, free from Uncle Sam's intervention. Driving on Uncle Sam's roads is a privilege and along with that privilege comes certain responsibilities and regulations. Don't confuse car ownership with public usage of that auto. The two aren't equal.\n \n\n when regulations are made, they are designed to protect both the companies and the consumer. sometimes they are made to protect the government from the public as well. the more potentially life-threatening a product is, the more regulations you will see attached to it. anything from disclaimers to acquisition of permits, are all put in place for the protection of both the consumer and the companies. it is not because the government is trying to infringe your rights. you have to remember that everybody besides you has rights as well\n\n \n What gun control law, that you're aware of, was meant to protect the manufacturer? And if I was to believe your assertion that regulation is proportional to the degree of risk associated with the product, then explain why parachutes have very little regulatory controls on them and almost all of the regulations that they do have are self-imposed within the sport. Even experimental aircraft have less regulations associated with them than automobiles do and there is far more risk associated with flying than driving.", 
   {}, 
   84280, 
   null, 
   1104632280.0
  ], 
  [
   84587, 
   null, 
   "pnac=ww3", 
   "Driving on Uncle Sam's roads is a privilege and along with that privilege comes certain responsibilities and regulations.\n\n I think the responsibilities and regulations come about because there are other people to worry about on the road, \n not because it's a grand privilege.\n \n I think this is the same thing for guns.\n There are other people's lives and liberty to worry about so there are regulations.", 
   {}, 
   84572, 
   null, 
   1104637140.0
  ], 
  [
   84707, 
   null, 
   "jskufan", 
   "I think the responsibilities and regulations come about because there are other people to worry about on the road, \n not because it's a grand privilege. \n\n \n I think it's a privelege because the multi-trillion dollar network of roadways, bridges, highways, and interstates were bought and paid for by Americans who paid/will pay taxes before, during, and after our lifetime. Our meager contribution to the sum total dictates we are at best a guest, and are priveleged to use the system for recreational or business purposes.\n \n \nI think this is the same thing for guns.\n There are other people's lives and liberty to worry about so there are regulations.\n\n \n Gun ownership is protected in the Bill of Rights. Do you actually feel that creating more stringent laws for law abiding citizens with respect to guns will have any impact on crime? Do you think it will make us all safer?", 
   {}, 
   84587, 
   null, 
   1104718500.0
  ], 
  [
   84717, 
   null, 
   "JPSartre12", 
   "I think the responsibilities and regulations come about because there are other people to worry about on the road, \n not because it's a grand privilege.\n\n \n Driving legally on public roads is a privilege. It is extended to you as long as you obey the rules and most of those rules are designed to minimize risk of harm to you or other drivers. If you fail to follow the rules, you can have your \"driving privilege\" revoked. You can still buy a car with a revoked license and drive on private property, though.\n \n\n I think this is the same thing for guns.\n There are other people's lives and liberty to worry about so there are regulations.\n\n Owning a gun is a protected right, not a privilege. The mere fact that I own a gun is of no concern to anyone but myself as long as I don't use that gun to violate someone else's rights. Too many people are too willing to trade away their rights for a false sense of security. I don't fall into that group.", 
   {}, 
   84587, 
   null, 
   1104722820.0
  ], 
  [
   84769, 
   null, 
   "unkerpaulie", 
   "What gun control law, that you're aware of, was meant to protect the manufacturer? And if I was to believe your assertion that regulation is proportional to the degree of risk associated with the product, then explain why parachutes have very little regulatory controls on them and almost all of the regulations that they do have are self-imposed within the sport. Even experimental aircraft have less regulations associated with them than automobiles do and there is far more risk associated with flying than driving.\n\n because parachutes in an of themselves are not harmful. and parachutes do have rigorous manufacturing codes that ensure their reliability. when a parachute causes someone's death, the liability is primarily with the manufacturer. when a gun causes someone's death, its promarily the gun owner's liability. thats were the regulations come in and who they are aimed at. you as the owner dont see the regulations involving the manufacure of these things, but dont assume theyre not there just because they dont apply to you", 
   {}, 
   84572, 
   null, 
   1104767580.0
  ], 
  [
   84837, 
   null, 
   "pnac=ww3", 
   "I think it's a privelege because the multi-trillion dollar network of roadways, bridges, highways, and interstates were bought and paid for by Americans who paid/will pay taxes before, during, and after our lifetime. Our meager contribution to the sum total dictates we are at best a guest, and are priveleged to use the system for recreational or business purposes.\n\n I didn't say it wasn't a privilege, but that its being a privilege is not why there are laws and regulations placed on cars.\n \n \nGun ownership is protected in the Bill of Rights.\n\n So is free speech, but there are laws and regulations on who can speak where and what they can say (FCC anyone?).\n \n \nDo you actually feel that creating more stringent laws for law abiding citizens with respect to guns will have any impact on crime? Do you think it will make us all safer?\n\n You think current laws are stringent?\n \n If the laws were made more stringent and then enforced, then law abiding citizens would abide by them.\n \n Stricter registration laws and more effective gun identification and tracing measures would help solve more gun-related crimes in the short run. And in the long run, they may help cut down on gun-related crimes. If someone had to pass a test (similar to a driving test) before he was able to get his gun-user licence before being able to buy guns and use them, then every time someone is found with a gun, they have to show their licence. If they don't have a licence, off to jail (same with cars). \n \n Of course, there will be people who circumvent these laws as there are people who cirumvent car licencing laws with fake licences and trading out plates on stolen cars, and then committing crimes using these cars.\n \n So, does requiring car registrations and licensing reduce crimes using cars? Not at all, but they ensure that responsible car users know how to use the car safely and how to follow laws involving cars. They also make solving crimes involving cars much easier.", 
   {}, 
   84707, 
   null, 
   1104788820.0
  ], 
  [
   84840, 
   null, 
   "pnac=ww3", 
   "Driving legally on public roads is a privilege. It is extended to you as long as you obey the rules and most of those rules are designed to minimize risk of harm to you or other drivers. If you fail to follow the rules, you can have your \"driving privilege\" revoked. You can still buy a car with a revoked license and drive on private property, though.\n\n Right, the rules are there to protect others, not because driving on roads is a privilege.\n \n \nOwning a gun is a protected right, not a privilege.\n\n So is free speech, but I cannot say **** on network TV at 2:00pm.\n \n \nThe mere fact that I own a gun is of no concern to anyone but myself as long as I don't use that gun to violate someone else's rights.\n\n Same with cars. There is a potential to violate someone's rights, so there are laws regulating cars so that these rights will not be violated.\n \n \n \nToo many people are too willing to trade away their rights for a false sense of security. I don't fall into that group.\n\n Then you'd better stop buckling your seatbelt just because there is some law against it.", 
   {}, 
   84717, 
   null, 
   1104789120.0
  ], 
  [
   84842, 
   null, 
   "JPSartre12", 
   "because parachutes in an of themselves are not harmful.\n\n And guns are inherently harmful? Maybe if you drop one on your toe. emoticon_rolleyes \n \n\n and parachutes do have rigorous manufacturing codes that ensure their reliability. when a parachute causes someone's death, the liability is primarily with the manufacturer. \n\n \n Not true at all. Manufacturers are rarely responsible for deaths due to parachutes malfunctioning. The biggest cause of failure is with the operator/packer.\n \n \n\n when a gun causes someone's death, its promarily the gun owner's liability. thats were the regulations come in and who they are aimed at. \n\n \n This is the same as in parachute failure. You incorrectly identified the manufacturer as the responsible party for failure when it is, in fact, the owner, just as with guns. The analogy holds true. \n \n\n you as the owner dont see the regulations involving the manufacure of these things, but dont assume theyre not there just because they dont apply to you\n\n And you don't think that there are regulations involved with the manufacture of firearms?! emoticon_rolleyes", 
   {}, 
   84769, 
   null, 
   1104789900.0
  ], 
  [
   84844, 
   null, 
   "JPSartre12", 
   "Right, the rules are there to protect others, not because driving on roads is a privilege.\n\n Actually, the rules are there to protect YOU and others on the road. If you abuse the privilege by not following the rules, you lose the privilege. You don't lose your rights by abusing them.\n \n\n So is free speech, but I cannot say **** on network TV at 2:00pm.\n\n That's a topic for another time. Suffice it to say that free speech doesn't \"always\" include obscenity......it does on HBO though. ;)\n \n\n Same with cars. There is a potential to violate someone's rights, so there are laws regulating cars so that these rights will not be violated.\n\n You fail to make the distinction that \"road rules\" only apply to public land. I can drive any way I wish on my own property.\n Gun laws, by contrast, extend into my property, where it is illegal for Uncle Sam to do so according to the Second.\n \n\n Then you'd better stop buckling your seatbelt just because there is some law against it.\n\n I buckle my seatbelt because it does improve my security, no false assumption involved. I've seen them save lives with my own two eyes.", 
   {}, 
   84840, 
   null, 
   1104790620.0
  ], 
  [
   84907, 
   null, 
   "pnac=ww3", 
   "Actually, the rules are there to protect YOU and others on the road. If you abuse the privilege by not following the rules, you lose the privilege. You don't lose your rights by abusing them.\n\n Are you saying that you can't go to jail for abusing your right to own a gun?\n By abusing it I would assume you mean using it the way it wasn't intended.\n Maybe by shooting someone. Then you go to jail and lose your rights.\n \n \n\n You fail to make the distinction that \"road rules\" only apply to public land. I can drive any way I wish on my own property.\n Gun laws, by contrast, extend into my property, where it is illegal for Uncle Sam to do so according to the Second.\n\n The only place that anyone would have the right to demand the licence for the gun you are carrying is when you are in public. If you are on your own land with a gun, then a cop can't tell you what to do with it. But when you are stopped driving with a gun in your car or on while on foot and the gun is concealed, a lot of places require that you have your gun registered and have a permit to carry. The cop will ask for these things and he has every right to do so. \n \n \nI buckle my seatbelt because it does improve my security, no false assumption involved. I've seen them save lives with my own two eyes.\n\n Does carrying a concealed gun improve your safety?", 
   {}, 
   84844, 
   null, 
   1104830820.0
  ], 
  [
   85036, 
   null, 
   "JPSartre12", 
   "Are you saying that you can't go to jail for abusing your right to own a gun?\n By abusing it I would assume you mean using it the way it wasn't intended.\n Maybe by shooting someone. Then you go to jail and lose your rights.\n\n \n No, you don't have \"the right\" to shoot anyone, just to own a gun. The Constitution says right to keep and bear, not target practice on the neighbor. ;)\n \n\n The only place that anyone would have the right to demand the licence for the gun you are carrying is when you are in public. If you are on your own land with a gun, then a cop can't tell you what to do with it. But when you are stopped driving with a gun in your car or on while on foot and the gun is concealed, a lot of places require that you have your gun registered and have a permit to carry. The cop will ask for these things and he has every right to do so. \n\n Agreed...with a few exceptions involving hunting, for instance. \n \n\n Does carrying a concealed gun improve your safety?\n\n It surely can. \n emoticon_xkill", 
   {}, 
   84907, 
   null, 
   1104890580.0
  ], 
  [
   86420, 
   null, 
   "USA allthe Way", 
   "is it because he lies in his films, or because he just rubs people the wrong way?\n\n \n \n huh!!! scuse while i, i , i, puke there it goes hope it hit him, hes a liberal of the woist kind an azz hole fpoist klass, ififn yu like em yu like em, me i hats him ands what him stands fer, ahh shuks dere i go agin a, a, a, noew i feels beter anoter puke jist went out// emoticon_xlove", 
   {}, 
   84070, 
   null, 
   1105629960.0
  ], 
  [
   86423, 
   null, 
   "unkerpaulie", 
   "huh!!! scuse while i, i , i, puke there it goes hope it hit him, hes a liberal of the woist kind an azz hole fpoist klass, ififn yu like em yu like em, me i hats him ands what him stands fer, ahh shuks dere i go agin a, a, a, noew i feels beter anoter puke jist went out// emoticon_xlove\n\n i didnt say i like him. you just say you hate him, but with absolutely no reason. either he lies in his films or he doesnt, and if he doesnt, i assume you just hate him because he doesnt lie. unless you have another reason...", 
   {}, 
   86420, 
   null, 
   1105631340.0
  ], 
  [
   86436, 
   null, 
   "Big Orn", 
   "I'm sure you want to know a reason that suits you, unkerpaulie, but I may not have one.\n \n He's trash and has trashy ways.\n \n With that said - I don't know him personally enough to love or hate him. I do know trash when I see it, though.\n \n Other than that, JP summed it up for me as well in his first post (Post #2).", 
   {}, 
   84298, 
   null, 
   1105634160.0
  ], 
  [
   86438, 
   null, 
   "unkerpaulie", 
   "I'm sure you want to know a reason that suits you, unkerpaulie, but I may not have one.\n \n He's trash and has trashy ways.\n \n With that said - I don't know him personally enough to love or hate him. I do know trash when I see it, though.\n \n Other than that, JP summed it up for me as well in his first post (Post #2).\n\n have you seen f911? the term \"rubs you the wrong way\" simply means you simply dont like him, but for no real particualr reason. so i think its safe to say you fall into that category\n \n as a matter of fact, i have never heard anyone that didnt like michael moore give a better reason for their dislike than you have, ron. congrats!", 
   {}, 
   86436, 
   null, 
   1105635180.0
  ], 
  [
   86476, 
   null, 
   "JPSartre12", 
   "have you seen f911? the term \"rubs you the wrong way\" simply means you simply dont like him, but for no real particualr reason. so i think its safe to say you fall into that category\n \n as a matter of fact, i have never heard anyone that didnt like michael moore give a better reason for their dislike than you have, ron. congrats!\n\n \n You want some concrete reasons, being a fellow Michigander, I'll give you some.\n Michael Moore is proud of the fact that he's an Eagle Scout, but in order to get to be an Eagle Scout, you have to acquire various badges and complete a variety of tasks. One involved camping out. According to a long-time friend of Moore's, Kevin Leffler, prior to the survival trip, he hid food all around the area in which he was going to be camping in and cheated his way into the Eagle Scouts. His friend said that Moore was one of those who twisted reality to fit his viewpoint. He gave other examples, such as his doctored interview with Charleton Heston in Bowling for Columbine. He, literally, edited the interviews to give the opposite meaning to it.\n Rhonda, the ignorant white trash lady who sold rabbits in Roger and Me, was tricked into signing a waiver for $100 and a ride to the premier in a limo. Later she had a fire and her house burned down, went into bankrupsy and tried to get Moore to help her. He wouldn't even return her calls. Moore made $3Million on the movie, never gave her a dime to help. \n Fred, the eviction guy, had to sue Moore to get money from Moore for his part in the film after Moore couldn't trick him into signing the same waiver that Rhonda signed. And he won his suit.\n Kevin Leffler, by the way, is a Professor at Baker College and is using his own money to make a rebuttal film about Michael Moore called \"Shooting Michael Moore\". Because of Moore's clout in the industry, he has been unable to find any insurer to back the film because they fear retaliation from the \"kind hearted\" Michael Moore.\n Here's the link to Lefler's interview on Detroit radio. It is very telling:\n \n http://www.760wjr.com/Article.asp?pt=WJR+Personalities&id=30968", 
   {}, 
   86438, 
   null, 
   1105642980.0
  ], 
  [
   86481, 
   null, 
   "Big Orn", 
   "have you seen f911? \n\n Back on that again? No, I have not watched the movie and probably won't. But as I have said, I have seen enough of it to know it follows the same pattern - politics aside.\n What did Moore call that book that GW was reading in that schoolroom? My Favorite Goat or something like that? Maybe My Pet Goat? That was not the title of that book. The title was Mastery in Reading or something like that. Did he think us stupid Americans wouldn't fiind out about his little twist? It's all over the movie - just like that. You want to consider it subtle, unkerpaulie? Fine. But, a lie is a lie.\n \nthe term \"rubs you the wrong way\" simply means you simply dont like him, but for no real particualr reason. so i think its safe to say you fall into that category\n\n Put me into any cat you feel suits you, makes you feel better that this little local hero of yours is indeed the master of truth. Sheesh......\n \nas a matter of fact, i have never heard anyone that didnt like michael moore give a better reason for their dislike than you have, ron. congrats!\n\n Condescension aside, a rose by any other name..............", 
   {}, 
   86438, 
   null, 
   1105644180.0
  ], 
  [
   86569, 
   null, 
   "unkerpaulie", 
   "You want some concrete reasons, being a fellow Michigander, I'll give you some.\n Michael Moore is proud of the fact that he's an Eagle Scout, but in order to get to be an Eagle Scout, you have to acquire various badges and complete a variety of tasks. One involved camping out. According to a long-time friend of Moore's, Kevin Leffler, prior to the survival trip, he hid food all around the area in which he was going to be camping in and cheated his way into the Eagle Scouts. His friend said that Moore was one of those who twisted reality to fit his viewpoint. He gave other examples, such as his doctored interview with Charleton Heston in Bowling for Columbine. He, literally, edited the interviews to give the opposite meaning to it.\n Rhonda, the ignorant white trash lady who sold rabbits in Roger and Me, was tricked into signing a waiver for $100 and a ride to the premier in a limo. Later she had a fire and her house burned down, went into bankrupsy and tried to get Moore to help her. He wouldn't even return her calls. Moore made $3Million on the movie, never gave her a dime to help. \n Fred, the eviction guy, had to sue Moore to get money from Moore for his part in the film after Moore couldn't trick him into signing the same waiver that Rhonda signed. And he won his suit.\n Kevin Leffler, by the way, is a Professor at Baker College and is using his own money to make a rebuttal film about Michael Moore called \"Shooting Michael Moore\". Because of Moore's clout in the industry, he has been unable to find any insurer to back the film because they fear retaliation from the \"kind hearted\" Michael Moore.\n Here's the link to Lefler's interview on Detroit radio. It is very telling:\n \n http://www.760wjr.com/Article.asp?pt=WJR+Personalities&id=30968\n\n thats all well and good. some truly solid reasons for disliking moore. he's a scam artist of sorts, heartless and stingy with money, and weasels his way out liability with trick contracts. you outdid ron, i must say\n \n but... you still havent shown that his films are based on lies.\n \n on a personal level, i too wouldnt touch moore with a ten-foot-pole, but his movies are presentations of truth. is it ok reject truth because you dont like the source?", 
   {}, 
   86476, 
   null, 
   1105658820.0
  ], 
  [
   86707, 
   null, 
   "Valthonis", 
   "is there any citizen that cannot own a gun? there is no definition for law abiding citizen. thats why such a condtion cannot be met. things like background checks, credit and criminal history, medical records, etc, should be considered before permitting someone to own a gun.\n \n \n the constitution guarantees \"freedom of cars\"? ownership and use of these things are regulated because there are responsibilities attached to the use and ownership of them, as well as the risk of injury or death, making either the government, the company or the owner liable for damages. thats why they put regulations in place\n \n \n when regulations are made, they are designed to protect both the companies and the consumer. sometimes they are made to protect the government from the public as well. the more potentially life-threatening a product is, the more regulations you will see attached to it. anything from disclaimers to acquisition of permits, are all put in place for the protection of both the consumer and the companies. it is not because the government is trying to infringe your rights. you have to remember that everybody besides you has rights as well\n\n God... you hypocritical @$$. You are argueing to take away freedoms yet people like you complain how bush is taking awy your freedoms. Compared to this, he has taken away no freedoms from you. He has not violated any of the bills of rights.", 
   {}, 
   84280, 
   null, 
   1105727160.0
  ], 
  [
   86742, 
   null, 
   "unkerpaulie", 
   "God... you hypocritical @$$. You are argueing to take away freedoms yet people like you complain how bush is taking awy your freedoms. Compared to this, he has taken away no freedoms from you. He has not violated any of the bills of rights.\n\n where did this come from? when did i say bush is taking away anybody's freedoms? and when did i argue to take away anybody's freedoms? does this even have anything to do with ANYTHING i said in the post i made?", 
   {}, 
   86707, 
   null, 
   1105736880.0
  ], 
  [
   86763, 
   null, 
   "JPSartre12", 
   "thats all well and good. some truly solid reasons for disliking moore. he's a scam artist of sorts, heartless and stingy with money, and weasels his way out liability with trick contracts. you outdid ron, i must say\n \n but... you still havent shown that his films are based on lies.\n \n on a personal level, i too wouldnt touch moore with a ten-foot-pole, but his movies are presentations of truth. is it ok reject truth because you dont like the source?\n\n \n What part of Leffler's interview was unclear to you. He said that, even as a young man Moore fabricated \"facts\" to suit his need. He doctored Charleton Heston's interview, as he did the father of a victim in 911. If the man has a history of dishonesty and makes movies that have so many provable lies, how can you STILL support him? :xbanghead emoticon_confused", 
   {}, 
   86569, 
   null, 
   1105739820.0
  ], 
  [
   87256, 
   null, 
   "unkerpaulie", 
   "What part of Leffler's interview was unclear to you. He said that, even as a young man Moore fabricated \"facts\" to suit his need. He doctored Charleton Heston's interview, as he did the father of a victim in 911. If the man has a history of dishonesty and makes movies that have so many provable lies, how can you STILL support him? :xbanghead emoticon_confused\n\n moore showed clips from heston's speeches. he didnt change the speech to make it look like heston said something he didnt say. what moore showed is what happened. nobody assumed that all the clips in the show were sequential. a documentary isnt a story with a storyline. if heston said \"from my cold dead hands\" in another speech, and moore put that clip in the segment about heston's speech, how does it change anything at all about the movie or about the point that moore was trying to make. if moore said \"and here's heston in another rally\" before he showed the cold-dead-hands clip, would it make even the slightest difference?\n \n according to leffler, what are the \"facts\" moore fabricated to suit his needs? that entire statement sounds all too familiar: a vague assertion that moore \"lies\" in his work without a single instance of evidence to support the assertion. come on people, you guys can do better than this. if you have the evidence, present it. if you dont, its ok", 
   {}, 
   86763, 
   null, 
   1106067120.0
  ], 
  [
   87368, 
   null, 
   "pnac=ww3", 
   "No, you don't have \"the right\" to shoot anyone, just to own a gun. The Constitution says right to keep and bear, not target practice on the neighbor. ;)\n\n \n I never said you had the right to shoot people (except in battle), but that shooting people was an abuse of the right to bear arms.\n \n We compared guns and cars.\n I said that there are regulations on the use of cars in public places because there are other people's rights and lives to worry about.\n \n The same can be said of guns. \n If you carry a gun in public there should be regulations on the use of the gun.\n There are laws against firing them in city limits (on YOUR property).\n When a cop stops you with a gun in your pocket he asks for your registration or your permit to carry, IIRC.\n Now, if they can just tighten the law around the point of sale, then it would be very much like a car.\n \n The main difference between guns and cars is that guns are small and cars are big. It's really hard to hide a car in your jacket. It's tough to buy a car without a liscence, but you can still do it, but once you start to take that big conspicuous piece of metal on the road, the law is on your XXX. The only reason guns don't get the same treatment is because they are so concealable.\n \n \nAgreed...with a few exceptions involving hunting, for instance. \n\n Well, I don't know much about modern hunting. \n I always thought that most people hunted on \"private\" property.\n I guess there are some state parks and national parks maybe?\n But if you are out there, where other people could be wandering around and it's kinda public property then...\n (shrug)", 
   {}, 
   85036, 
   null, 
   1106101860.0
  ], 
  [
   101706, 
   null, 
   "Leviathan", 
   "I found his first movie, Roger and Me, to be an interesting story about the decline of the US auto industry and its impact on Flint, MI. While most of it was unstaged documentary, he juxtaposed scenes to make certain things look like cause and effect. He tried the same thing with later, political movies, but with much less honesty. He clearly had an agenda in Bowling for Columbine, for example, and he played on the public's \"touchy-feely\" attitude and not facts to sell his belief that guns should be made illegal by using cripples to gain sympathy for his campaign. IMO, he used Columbine survivors to further his own personal agenda. After that, I stopped watching anything that he did and saw him become an ever-increasing fool.\n\n \n This is very interesting. I've had to argue this with people several times in the past. I don't really want to get into specifics here, but I would ask you to put yourself into his shoes.\n \n You need to sell a label. You have a strong view against something, probably emotionally propelled as well. You need to argue it and get it off effectively. Pushing straight facts down peoples' throats for two and a half hours is going to make your entire audience walk away. People won't watch it if there is no drama. You have to play touchy-feely. You don't have a choice.\n \n He also has a lot of content to work with. You need to understand that as an artist, composition and design is his best tool. He needs to use the material that is going to be the most effective. He also needs to use the material that he can make flow the best. He is trying to avoid non-sequiturs. He does a very mediocre job at this. Trying to tie the NRA and Columbine is kind of abstract and slipshod on his part, but most people understood the relationship as guns. He was beginning to run out of content.\n \n If nothing else, you have to realize that these are simply one man's ideas. Whether or not you liked his documentary, it points out a lot of issues that can be expanded on. All is fair in love in war. The two Columbine survivors were his most important piece. Whether or not you feel they were used, you cannot ignore what happened to them. They are living facts in and of themselves. You cannot downplay their importance. Did you ever notice how gun supporters all ignore the value of the lives of the people taken by guns and insist that guns aren't part of the problem. \n \n And yet, the hypocrit gun supporters try to argue that the gun owner was irresponsible when they all sleep at night with their pistols loaded underneath their pillows. Did you ever notice how they try to sidestep every arguement by making ridiculous assertions, like how cars are more dangerous than guns, that have absolutely nothing to do in an intelligent debate. Having a serious debate with a gun supporter is like arguing with a pile of fecies. All it does is sit there and stink. ;\\\n \n Try to imagine a gun owner trying to make a video that even comes close to competing with Michael Moore's content. He did the best he could and the opposition could never really make a workable case.", 
   {}, 
   84072, 
   null, 
   1111875540.0
  ], 
  [
   101714, 
   null, 
   "JPSartre12", 
   ".......\n Did you ever notice how gun supporters all ignore the value of the lives of the people taken by guns and insist that guns aren't part of the problem. \n \n And yet, the hypocrit gun supporters try to argue that the gun owner was irresponsible when they all sleep at night with their pistols loaded underneath their pillows. Did you ever notice how they try to sidestep every arguement by making ridiculous assertions, like how cars are more dangerous than guns, that have absolutely nothing to do in an intelligent debate. Having a serious debate with a gun supporter is like arguing with a pile of fecies. All it does is sit there and stink. ;\\\n\n I'm a gun owner and have never slept with a loaded pistol under my pillow. It's stereotypical liberal knee-jerk statements like yours that distort reality to the point in which the ignorant masses start to believe the lies. That's what Moore preys upon, the unlightened unwashed masses who are too ignorant to do their own investigation and make their own decisions. Spoon-fed liberalism is alive and well in the US, unfortunately. emoticon_mad \n \n\n Try to imagine a gun owner trying to make a video that even comes close to competing with Michael Moore's content. He did the best he could and the opposition could never really make a workable case.[/b]\n\n \n If I, as a gun owner, had the money to make a pro-gun movie, I'd start the movie with a scene of riders on the Long Island commuter train. I'd show how Colin Ferguson calmly got up from his seat and began randomly shooting at the 90 passengers on the train. After emptying his 15 round clip, he reloaded while a carload of sheeples were helpless to stop him. Six dead, 7 severely injured. From there, I'd interview the young woman who shot and killed an assailant attempting to break into her locked bedroom and the old crippled woman in Chicago who unloaded her shotgun on a man in the process of smashing through her front door.\n The stories are numerous, with a common theme. Law-abiding citizens defending themselves against criminals that they'd never be able to subdue without a gun.", 
   {}, 
   101706, 
   null, 
   1111878720.0
  ], 
  [
   101728, 
   null, 
   "Leviathan", 
   "I'm a gun owner and have never slept with a loaded pistol under my pillow. It's stereotypical liberal knee-jerk statements like yours that distort reality to the point in which the ignorant masses start to believe the lies. That's what Moore preys upon, the unlightened unwashed masses who are too ignorant to do their own investigation and make their own decisions. Spoon-fed liberalism is alive and well in the US, unfortunately. emoticon_mad \n\n \n  It was a cliche` figure of speech, forgive me. What I was getting at is that each of you lay the finger on carelessness. But as proof of my point, you said yourself that people keep them nearby for protection. This would leave it someplace where it can be easily obtained by anyone (in many circumstances). I don't think you could ever define 'gun safety'. Your arguement falls to 'culpable ignorance'. You can never prove that guns are safe. Necessary can be argued, but not safe.\n \n As for yourself, you just made the assumption that I, and others, are the unlightened (sp)?, ignorant masses because I clearly have a mind of my own? Let's talk about typical knee-jerk statements for a moment here.\n \n \nIf I, as a gun owner, had the money to make a pro-gun movie, I'd start the movie with a scene of riders on the Long Island commuter train. I'd show how Colin Ferguson calmly got up from his seat and began randomly shooting at the 90 passengers on the train. After emptying his 15 round clip, he reloaded while a carload of sheeples were helpless to stop him. Six dead, 7 severely injured. From there, I'd interview the young woman who shot and killed an assailant attempting to break into her locked bedroom and the old crippled woman in Chicago who unloaded her shotgun on a man in the process of smashing through her front door.\n The stories are numerous, with a common theme. Law-abiding citizens defending themselves against criminals that they'd never be able to subdue without a gun.\n\n \n So your first arguement is that you have to own a gun to stop a gun. You're also making the assertion that guns should be carried freely, anywhere. And protection is your second arguement. Fair enough.\n \n Now make yourself the director. Why does anyone want to watch your movie? ", 
   {}, 
   101714, 
   null, 
   1111880400.0
  ], 
  [
   101743, 
   null, 
   "JPSartre12", 
   " It was a cliche` figure of speech, forgive me. What I was getting at is that each of you lay the finger on carelessness. But as proof of my point, you said yourself that people keep them nearby for protection. This would leave it someplace where it can be easily obtained by anyone (in many circumstances). I don't think you could ever define 'gun safety'. Your arguement falls to 'culpable ignorance'. You can never prove that guns are safe. Necessary can be argued, but not safe.\n\n You presume way too much. I have guns in my house and I had three children in my house. My guns were kept in a closet away from the ammo, with only my wife and I knowing how to marry the two until my kids were old enough to shoot a gun. (only my son was interested in shooting). At that point, I had no fear of them accidentally shooting someone because he knew how to shoot, knew how to properly handle a gun and knew that he'd better have a damn good reason for ever touching a gun.\n \n\n As for yourself, you just made the assumption that I, and others, are the unlightened (sp)?, ignorant masses because I clearly have a mind of my own? Let's talk about typical knee-jerk statements for a moment here.\n\n No, I said that the idea that all gun owners slept with a loaded pistol was knee-jerk liberal statement.\n \n\n So your first arguement is that you have to own a gun to stop a gun. You're also making the assertion that guns should be carried freely, anywhere. And protection is your second arguement. Fair enough.\n\n There's no reason to deny the Second Amendment Rights of any law-abiding citizen. You are correct.\n \n\n Now make yourself the director. Why does anyone want to watch your movie? \n\n \n Well, they actually already made a movie about the Long Island train massacre. It's called \"MINUTE BY MINUTE: THE LONG ISLAND RAILROAD SHOOTING\" , but I think that people would watch the movie because it would disprove what liberals have been preaching for 4 decades. The post 9-11 mentality isn't anti-gun anymore. Unless you haven't been paying attention, the number of armed people in the US has gone way up. We have pilots packing, sky marshals packing, HSA people packing and lots of new CCW licenses. In fact, the states with the least restrictive gun laws, like Vermont, have the lowest crime rates. But, I wouldn't expect liberals to look at the facts. It's easier to spout the liberal mantra \"guns kill\".", 
   {}, 
   101728, 
   null, 
   1111884240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  why do people really hate michael moore?", 
  "url": "http://www.4forums.com/political/society-debates/4021-why-do-people-really-hate-michael-moore.html", 
  "breadcrumbs": [
   "Society"
  ], 
  "id_number": 4021, 
  "discussion_files": [
   [
    "19987.html", 
    "http://www.4forums.com/political/society-debates/4021-why-do-people-really-hate-michael-moore-print.html"
   ], 
   [
    "19988.html", 
    "http://www.4forums.com/political/society-debates/4021-why-do-people-really-hate-michael-moore-4-print.html"
   ], 
   [
    "19989.html", 
    "http://www.4forums.com/political/society-debates/4021-why-do-people-really-hate-michael-moore-3-print.html"
   ], 
   [
    "19990.html", 
    "http://www.4forums.com/political/society-debates/4021-why-do-people-really-hate-michael-moore-2-print.html"
   ]
  ], 
  "identifier": 4021
 }
]