[
 [
  [
   84277, 
   null, 
   "snakespit", 
   "I was listening to the radio today, and heard them talking about peoples most irrational fears. I thought it might be fun to see if anyone has anything unusual. Mine is that I am afraid of clowns. To this day (as a grown man) I will not go to the circus, I shy away from parades and amusement parks that have clowns, and I even go through the drivethru at McCholesterols because of the life sized Ronald McDonald inside. Anyone else...or am I just unusual?", 
   {
    "post_info": {
     "post_title": "Irrational Fears"
    }
   }, 
   null, 
   null, 
   1104423960.0
  ], 
  [
   84282, 
   null, 
   "joebrummer", 
   "I myself don't have this fear, but I have heard of others who share it. Many people have fears of different things for different reasons. Cool that you can admit to though, most people don't do that! I respect that.", 
   {}, 
   84277, 
   null, 
   1104424860.0
  ], 
  [
   84381, 
   null, 
   "Loki", 
   "Mine is pretty funny! I have a fear of getting locked in a dark room...lol\n Guess I never grew out of that one....hehe", 
   {}, 
   84282, 
   null, 
   1104458220.0
  ], 
  [
   84427, 
   null, 
   "daewoo", 
   "Corn fields. \n \n I don't mind driving past them, or even having them around, just don't like walking out into the middle of them. I remember being a child and getting lost in a big corn field and it was terrifying. You can't see anything or tell what direction you are facing.\n \n Not a paralyzing fear, but certainly uncomfortable (now that I am an adult).", 
   {}, 
   84381, 
   null, 
   1104477420.0
  ], 
  [
   84436, 
   null, 
   "college_girl", 
   "Midgets chasing me on stilts. Weird I know, at least it's not very common!\n \n ps I hope I haven't offended any midgets emoticon_frazzled", 
   {}, 
   84427, 
   null, 
   1104483960.0
  ], 
  [
   84446, 
   null, 
   "Anastasia", 
   "Corn fields. \n \n I don't mind driving past them, or even having them around, just don't like walking out into the middle of them. I remember being a child and getting lost in a big corn field and it was terrifying. You can't see anything or tell what direction you are facing.\n \n Not a paralyzing fear, but certainly uncomfortable (now that I am an adult).\n\n I know that fear very well, I used to spend my summers on my grandmothers farm in Indiana, and corn fields are very scary!!!!!!", 
   {}, 
   84427, 
   null, 
   1104509640.0
  ], 
  [
   84459, 
   null, 
   "billsco", 
   "Midgets chasing me on stilts. Weird I know, at least it's not very common!\n \n ps I hope I haven't offended any midgets emoticon_frazzled\n\n \n Does this happen often? Enquiring minds want to know. :)", 
   {}, 
   84436, 
   null, 
   1104515100.0
  ], 
  [
   84475, 
   null, 
   "college_girl", 
   "Does this happen often? Enquiring minds want to know.\n \n \n I saw it on a movie or something when I was little and ever since then when I see a midget I can't help imagining him on stilts, with evil intentions.\n \n This has never happened to me in real life though, that is why it is irrational I suppose.", 
   {}, 
   84459, 
   null, 
   1104526620.0
  ], 
  [
   84481, 
   null, 
   "jitobear", 
   "Flying - airplanes. Yep the sky is no place for me (although I do it since I love travel - a horrible means to a wonderful end).\n \n And I freak out when I get locked out of my house (maybe because when it has happened it has always been in freezing temps and I have not been properly dressed for it.)\n \n Not real fond of elevators.", 
   {}, 
   84475, 
   null, 
   1104531180.0
  ], 
  [
   84540, 
   null, 
   "jim's trucking", 
   "Fear.\n \n \n \n \n \n \n \n \n :p", 
   {}, 
   84481, 
   null, 
   1104616260.0
  ], 
  [
   84553, 
   null, 
   "jitobear", 
   "Fear.\n \n \n \n \n \n \n \n \n :p\n\n \n FDR would be disappointed.", 
   {}, 
   84540, 
   null, 
   1104626220.0
  ], 
  [
   84566, 
   null, 
   "pnac=ww3", 
   "Man, that one gets me.\n I don't know exactly how irrational it is, \n but being closed in a tight spot\n makes me really uncomfortable and I start looking for a way out.\n I could never be a spelunker.\n My worst nightmare is to be buried alive.\n That would be unthinkable for me.", 
   {
    "post_info": {
     "post_title": "Claustrophobia!"
    }
   }, 
   84553, 
   null, 
   1104631380.0
  ], 
  [
   84676, 
   null, 
   "jim's trucking", 
   "FDR would be disappointed.\nQuite the contrary. I think he would be happy that at least one person correctly interpretted his words. If the only thing we have to fear is fear itself, then all fears are irrational.", 
   {}, 
   84553, 
   null, 
   1104697500.0
  ], 
  [
   84678, 
   null, 
   "zachvac", 
   "This isn't me but one of my teachers is scared of our mascot. She's also the cheerleading coach :)\n \n So one day the mascot went over and hugged her and she punched him in the face and ran away screaming. Our mascot is a red devil.\n \n And our English teacher said fear of public speaking ranked above fear of death in surveys. What am I afraid of? cicadas (sp?)\n \n When all the cicadas came out last year one flew in my mouth and it was disgusting. The rest of the week I was running away from them and then my friends started throwing them at me. I wondere if I'll still be afraid of them in 16 more years.", 
   {}, 
   84676, 
   null, 
   1104698040.0
  ], 
  [
   84819, 
   null, 
   "pnac=ww3", 
   "When birds fly directly overhead, I have a fear that they are going to poop on me and I try to get out from under them. But, since I've been pooped on before maybe that fear isn't so irrational. \n \n This coworker I had is pathologically afraid of dogs. I guess she had a bad experience when she was younger, but I had no idea. So, I brought my dog (who is a total sweetheart) to work one evening because at the time it was convenient to do so. I just brought him near her desk, and she turned around, and totally freaked. She started shaking and hiding her face, and crying. She just kept repeating the few words she could get out \"No, no, I'm scared, no, no!\" and crying. it was totally unexpected so I freaked, and ran my dog out of there. It was weird.", 
   {}, 
   84678, 
   null, 
   1104782820.0
  ], 
  [
   84832, 
   null, 
   "jitobear", 
   "Quite the contrary. I think he would be happy that at least one person correctly interpretted his words. If the only thing we have to fear is fear itself, then all fears are irrational.\n\n \n I was just being silly.", 
   {}, 
   84676, 
   null, 
   1104787500.0
  ], 
  [
   84850, 
   null, 
   "jim's trucking", 
   "I was just being silly.\nI doe. I just didn't see any LOLs or rolling-eyes! emoticon_xangel", 
   {}, 
   84832, 
   null, 
   1104793620.0
  ], 
  [
   85139, 
   null, 
   "lucky_me", 
   "ok, i hope yall are sitting down for this one...ducks. ever since i was 2 and went to disney land, i have been afraid of ducks. i think it is because of donald duck...i dont know. is that normal? i dont think so but hey, is anyone else afraid of ducks?", 
   {
    "post_info": {
     "post_title": "ducks"
    }
   }, 
   84819, 
   null, 
   1104955500.0
  ], 
  [
   85278, 
   null, 
   "Valthonis", 
   "ok, i hope yall are sitting down for this one...ducks. ever since i was 2 and went to disney land, i have been afraid of ducks. i think it is because of donald duck...i dont know. is that normal? i dont think so but hey, is anyone else afraid of ducks?\n\n God, your a freak. :)", 
   {}, 
   85139, 
   null, 
   1105035180.0
  ], 
  [
   86179, 
   null, 
   "lucky_me", 
   "God, your a freak. :)\n\n \n only when i need to be...", 
   {}, 
   85278, 
   null, 
   1105553880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Irrational Fears", 
  "url": "http://www.4forums.com/political/fun-debates/4029-irrational-fears.html", 
  "breadcrumbs": [
   "Fun"
  ], 
  "id_number": 4029, 
  "discussion_files": [
   [
    "25396.html", 
    "http://www.4forums.com/political/fun-debates/4029-irrational-fears-print.html"
   ], 
   [
    "25397.html", 
    "http://www.4forums.com/political/fun-debates/4029-irrational-fears-2-print.html"
   ]
  ], 
  "identifier": 4029
 }
]