[
 [
  [
   84410, 
   null, 
   "Mach", 
   "http://en.wikipedia.org/wiki/Teleological_argument\n \nA teleological argument (or an argument from design) is an argument for the existence of God based on evidence of design in nature. Although there are variations, the basic argument goes something like this:\n \n Premise 1: X was intelligently designed, \n Premise 2: X was not designed by humans. \n Premise 3: The only conceivable beings capable of intelligent design are humans (who exist) and God (who may or may not exist). \n From (3): The only conceivable beings capable of designing X in particular are humans (who exist) and God (who may or may not exist). \n Recall (2): that X was not designed by humans. \n If God doesn't exist, then X was also not designed by God. \n Thus if God doesn't exist, then none of the conceivable beings capable of designing X designed X, in which case X was not designed at all. \n Since God not existing therefore results in a contradiction of (1), God must exist. \n X usually stands either for the whole universe, the evolution process, human, a given animal species or for a particular organ (e.g., the eye) or capability (e.g., language in humans). It can also stand for the fundamental constants of the universe, based on the anthropic principle that these constants seem specially tuned to allow intelligent life to evolve.\n \n Although the second premise is widely accepted, the third premise, and especially the first premise, are disputed.\n\n \n Premise1:\n #1 What does intelligently mean?\n #2 What does designed mean?\n #3 How can you know it's designed?\n #4 How can you know an intelligence designed it?\n \n These are your premises? Sounds like circular reasoning at best, insanity or outright lies at worst.\n \n In general\n #1 We do not know if an entity created the universe, or if it always existed, or if it came from nothing, or if it was created by an infinite number of other conceptual entities. How can someone claim to know this? They claim knowledge of god and miracles and ghosts, and immaculate conception, why should they NOT claim this too? More nonsense. Even if all of the above were our only logical choices (in my #1, not the original argument), then occam's razor would suggest a creator adds complexity and is thrown out unless there is evidence of a creator (there isn't).\n \n #2 Designed? Design implies a creator, let's not question beg, please.\n Try \"ordered\".\n \n Premise3:\n Or a unie (may or may not exist), or a dingbat (may or may not exist), or a munchipookie (may or may not exist), or a sea monkey (may or may not exist), or a hoopiyaya (may or may not exist)......ad infinitum.\n \n Hey all, we just hit an infinite loop...can we do anything with it? No. Is this a real argument or just words? I think it's hard to tell the difference.\n \n \n We can't even get into any real meaty debate with this train-wreck of an argument. If someone wants to take up the reigns and argue for the teleological argument, please do, so far it's obviously flawed and rejected...else, we'd probably be seeing this taught in science under cosmology. But of course...it is not.\n \n -Mach", 
   {
    "post_info": {
     "post_title": "Teleological argument - why it's rejected"
    }
   }, 
   null, 
   null, 
   1104474180.0
  ], 
  [
   84413, 
   null, 
   "zachvac", 
   "http://en.wikipedia.org/wiki/Teleological_argument\n \n \n Premise1:\n #1 What does intelligently mean?\n #2 What does designed mean?\n #3 How can you know it's designed?\n #4 How can you know an intelligence designed it?\n \n These are your premises? Sounds like circular reasoning at best, insanity or outright lies at worst.\n \n In general\n #1 We do not know if an entity created the universe, or if it always existed, or if it came from nothing, or if it was created by an infinite number of other conceptual entities. How can someone claim to know this? They claim knowledge of god and miracles and ghosts, and immaculate conception, why should they NOT claim this too? More nonsense. Even if all of the above were our only logical choices (in my #1, not the original argument), then occam's razor would suggest a creator adds complexity and is thrown out unless there is evidence of a creator (there isn't).\n \n #2 Designed? Design implies a creator, let's not question beg, please.\n Try \"ordered\".\n \n Premise3:\n Or a unie (may or may not exist), or a dingbat (may or may not exist), or a munchipookie (may or may not exist), or a sea monkey (may or may not exist), or a hoopiyaya (may or may not exist)......ad infinitum.\n \n Hey all, we just hit an infinite loop...can we do anything with it? No. Is this a real argument or just words? I think it's hard to tell the difference.\n \n \n We can't even get into any real meaty debate with this train-wreck of an argument. If someone wants to take up the reigns and argue for the teleological argument, please do, so far it's obviously flawed and rejected...else, we'd probably be seeing this taught in science under cosmology. But of course...it is not.\n \n -Mach\n\n \n This is sort of like saying (just disguised as a real proof)\n \n premise 1: God exists\n conclusion: God exists\n \n end of proof. See I proved it.\n \n It's just that all the premises combined are parts of god existing. They've just gone backward from god existing, seen what would have had to been true for god to create it, and claim it to be true. For example: intelligent design, that implies there is a god, so that's just like claiming god exists as a premise. Makes no sense.", 
   {}, 
   84410, 
   null, 
   1104474420.0
  ], 
  [
   84447, 
   null, 
   "dreamweaver", 
   "Mach,\n \n You're doing it again. You're rejecting things that you simply don't even understand. You have quite a few questions for the argument, since you don't understand what they're implying by it, and by this -- you presume that it's a whole load of rubbish. I reject the argument in general, too, but at least I know what it claims and know of its reasoning. \n \n#1 What does intelligently mean?\n #2 What does designed mean?\n\n You know, I'm thinking of suggesting that they put a permanent link to an online dictionary on this forum. \n http://dictionary.reference.com/search?q=designed\n \n You could take \"intelligently\" to mean that the being is conscious of what it's doing; that it's doing what it is purposefully. \n \n These are your premises? Sounds like circular reasoning at best, insanity or outright lies at worst.\n\n Sounds like you don't know what circular reasoning is. \n \n#1, not the original argument), then occam's razor would suggest a creator adds complexity and is thrown out unless there is evidence of a creator (there isn't).\n\n Very nice and bold statement. Since you've made the statement, the onus is now on you to show how this is the case. You in your omniscience and full-out-objectivity have examined all the evidence in the Universe, and can thus conclude appropriately. \n \n #2 Designed? Design implies a creator, let's not question beg, please.\n Try \"ordered\".\n\n Let's try ordered. :D Who are you to say that what you perceive is \"ordered\"? How do you know what this is, is not in actual fact chaos. By speaking of \"order\" you're presupposing a standard, I'd like to know what standard this is and how you know of it.\n \nIf someone wants to take up the reigns and argue for the teleological argument, please do, so far it's obviously flawed and rejected...else, we'd probably be seeing this taught in science under cosmology. But of course...it is not.\n\n Full of fallacies. Next time you come, bring your argument. \n \n The teleological argument relies on the premise that we generally see things in the world which are designed, and not by humans, or things that have a \"purpose\". For example, any body feature or the like; we'd automatically think that the \"purpose of the eye is sight\" or that the \"purpose of the ozone layer is to do so and so...\". In an atheist worldview, these statements are meaningless, and there is no \"purpose\".\n \n Zachvac, \n \n No it doesn't. :) (if you really need me to explain... I will)", 
   {}, 
   84413, 
   null, 
   1104510120.0
  ], 
  [
   84449, 
   null, 
   "billsco", 
   "\n \n Premise 2: X was not designed by humans. \n \n ...Although the second premise is widely accepted, the third premise, and especially the first premise, are disputed. \n \n \n\n \n Why is this premise not disputed as well? Are humans to be thought of as simply terrestrial? Because we're found on the earth we can have no further consideration?", 
   {}, 
   84410, 
   null, 
   1104510360.0
  ], 
  [
   84451, 
   null, 
   "dreamweaver", 
   "No, it just means that the argument is talking about things that are supposedly designed, but not thought to be designed by humans. i.e. the ozone layer.", 
   {}, 
   84449, 
   null, 
   1104512820.0
  ], 
  [
   84454, 
   null, 
   "billsco", 
   "The argument seems to imply that intelligence is required to create some type of designed product. Either a god or humans are the only candidates. We know humans exist. No one has ever seen a god, except for a dubious account about a brief encounter Moses had with a bush on fire.\n \n Humans seem more likely to be the intelligence needed to create something, if design is truly there.", 
   {}, 
   84451, 
   null, 
   1104513840.0
  ], 
  [
   84455, 
   null, 
   "dreamweaver", 
   "Humans seem more likely to be the intelligence needed to create something, if design is truly there.\n\n Did you read my post? The argument applies to things that we know not be designed by humans; it doesn't aim to show that things designed by humans are designed by God.", 
   {}, 
   84454, 
   null, 
   1104513960.0
  ], 
  [
   84456, 
   null, 
   "billsco", 
   "I'm asking how you know humans didn't design it, in a far-away place in a far-away time?\n \n If you think humans are only 6000 years old I can understand why you can't understand my premise.", 
   {}, 
   84455, 
   null, 
   1104514320.0
  ], 
  [
   84464, 
   null, 
   "Alan Ryan", 
   "No, it just means that the argument is talking about things that are supposedly designed, but not thought to be designed by humans. i.e. the ozone layer.\n\n Hope I don't cloud the issue by jumping in here with a slightly different take on what's been said so far.\n I see things this way: Teleology is the study of purposes, goals or ends. The basic idea is that events/processes can only be explained, and that the evaluation of objects, acts, states, etc., can be justified only by reference to the ends towards which they are directed. \n OK, if this is a satisfactory summary of the nature of teleological theory, then I guess it's necessary to establish (in this thread) what ends or purposes can be attributed to the fact that the universe, humanity, etc. exist ? If any end or purpose can be established respecting what deeply concerns us, the next step would be to infer the \"who\" or the \"what\" that bestowed these purposes in the first place which we have just supposed ourselves to perceive. \n Whether an inquiry proceeding in this limited way would lead to a teleological proof of the existence of God, I leave to the theologians in the forum to determine.", 
   {}, 
   84451, 
   null, 
   1104516840.0
  ], 
  [
   84468, 
   null, 
   "Dzeron", 
   "The argument seems to imply that intelligence is required to create some type of designed product. Either a god or humans are the only candidates. We know humans exist. No one has ever seen a god, except for a dubious account about a brief encounter Moses had with a bush on fire.\n \n Humans seem more likely to be the intelligence needed to create something, if design is truly there.\n\n \n The thing is, though, god and humans aren't the only candidates. Mach illustrated this point in the first post. Ogres, vampires, ghosts, etc. are all other possible candidates. That said, change \"God\" to \"ogres\" and the argument proves the existence of ogres.", 
   {}, 
   84454, 
   null, 
   1104519660.0
  ], 
  [
   84469, 
   null, 
   "dreamweaver", 
   "I'm asking how you know humans didn't design it, in a far-away place in a far-away time?\n\n Sure, why don't you stick to that then.\n \nIf you think humans are only 6000 years old I can understand why you can't understand my premise.\n\n Incidentally, I don't. The \"Homo\" genus appeared at least 2 million years ago, and we know from other evidence that homo sapiens were around (in Africa, at least) by the second interglacial period in the Middle Pleistocene epoch (~250k years ago).\n \n Believe it or not, Christians fundamentalists only constitute but a small minority Christendom as a whole. The two oldest branches of Christianity (Catholicism and Orthodox Church) do not proffer Biblical literalism to mandatory in the slightest.", 
   {}, 
   84456, 
   null, 
   1104522000.0
  ], 
  [
   84471, 
   null, 
   "billsco", 
   "The thing is, though, god and humans aren't the only candidates. Mach illustrated this point in the first post. Ogres, vampires, ghosts, etc. are all other possible candidates. That said, change \"God\" to \"ogres\" and the argument proves the existence of ogres.\n\n \n I see, thanks for answering my question.", 
   {}, 
   84468, 
   null, 
   1104525900.0
  ], 
  [
   84472, 
   null, 
   "billsco", 
   "Sure, why don't you stick to that then.\n \n \n\n \n Your explanation makes more sense, a infinite being created it all? Where's Occam when you need him?", 
   {}, 
   84469, 
   null, 
   1104526020.0
  ], 
  [
   84473, 
   null, 
   "dreamweaver", 
   "Your explanation makes more sense, a infinite being created it all? Where's Occam when you need him?\n\n Funnily enough, William of Ockham was a Franciscan friar -- a theist. And furthermore, I never said the design argument was valid or sound; I suggested that I think it is the opposite -- unsound.", 
   {}, 
   84472, 
   null, 
   1104526200.0
  ], 
  [
   84508, 
   null, 
   "billsco", 
   "Funnily enough, William of Ockham was a Franciscan friar -- a theist. \n\n \n Nothing funny or amazing about it really. If he had been an atheist he would have been burned at the stake.", 
   {}, 
   84473, 
   null, 
   1104592260.0
  ], 
  [
   84509, 
   null, 
   "dreamweaver", 
   "Nothing funny or amazing about it really. If he had been an atheist he would have been burned at the stake.\n\n What rubbish. Nonsensical claptrap and fables of the enlightenment. Do some research before you make wild claims like that.", 
   {}, 
   84508, 
   null, 
   1104595080.0
  ], 
  [
   84519, 
   null, 
   "Mach", 
   "Nothing funny or amazing about it really. If he had been an atheist he would have been burned at the stake.\n\n \n lol. How true :/", 
   {}, 
   84508, 
   null, 
   1104605100.0
  ], 
  [
   84538, 
   null, 
   "dreamweaver", 
   "lol. How true :/\n\n Lol, then my statement applies to you too. Learn something about religious history before you start relying on nonsensical propaganda and erroneous historical factoids.", 
   {}, 
   84519, 
   null, 
   1104615360.0
  ], 
  [
   84574, 
   null, 
   "Mach", 
   "Lol, then my statement applies to you too. Learn something about religious history before you start relying on nonsensical propaganda and erroneous historical factoids.\n\n \n Quit ordering people around <---an order in itself.\n \n See how useless that is?\n \n I'm sure many of us are familiar with the abusive power the church wielded in history, often leading to outright murder of people who speak out against the church or it's teachings. It's not limited to the church either, the church(es) are just one type of organized power. \n \n Was Billsco's comment entertaining and relevant? More so that you care to share with us:\n \n Occam:\n both: &#335;k'em) , c.1285-c.1349, English scholastic philosopher. A Franciscan, Occam studied and taught at Oxford from c.1310 until 1324, when he was summoned to the papal court at Avignon to answer charges of heresy in his writings. He waited there until 1328 for a judgment. When it appeared that Pope John XXII was about to condemn his position Occam fled to the protection of Holy Roman Emperor Louis IV, whom he supported in his struggle with Pope John.\n \n \n SONUVA GUN. Even the guy we're talking about had to flee the church to avoid being condemmed a heretic? There is no end to the evil of the church!\n \n Thanks, not only was billsco's comment funny it looks to have been quite relevant. Thanks for ordering us around though, it helped reveal this \"factoid\" that you left out.\n \n -Mach", 
   {
    "unicode_changes_made": true
   }, 
   84538, 
   null, 
   1104633060.0
  ], 
  [
   84578, 
   null, 
   "dreamweaver", 
   "Quit ordering people around <---an order in itself.\n\n Just so observative! Hardly orders, even though they appear as though they are; I'm no greater an authority than anyone else. Even though they're posed as though they might be open to interpretation as you suggest, they're merely recommendations.\n \nI'm sure many of us are familiar with the abusive power the church wielded in history, often leading to outright murder of people who speak out against the church or it's teachings. \n\n Which are all quite naturally grossly exaggerated. The most famous examples of \"scientists being tortured/killed for their research\" (that of Copernicus and Galileo) are complete myths, and construed beyond belief. \n \n billsco here implies that dear Ockham was forced to be a theist, while he secretly knew the truth (atheism, of course), but was not allowed to voice his opinion. Of course! That's why he became a Philosopher consistently trying to make the case for God and shows his devoutness throughout his writings. \n \n Ockham outright thought the Pope to be a heretic and no true Pope (see: http://www.utm.edu/research/iep/o/ockham.htm ). Of course, I'm not condoning the Church's actions, but considering the time, such things were easily to be expected (outright treason was punishable by death in the majority of countries at the time). And of course, this was the main driving purpose of him being looked for by the Church, not that he was secretly an atheist and couldn't believe his beliefs in the open.\n \nThere is no end to the evil of the chruch!\n\n Sure! All conflict is caused by religions. Why not take a look at the 20th century and tell me who was responsible for the greatest acts of genocide. Erm.. yes, that's right. The secularists. I'm not placing blame on secularism; I can merely acknowledge that we're all in the same boat, and it's particular humans to blame, not a whole popular religion or school of thought per se.", 
   {}, 
   84574, 
   null, 
   1104633780.0
  ], 
  [
   84588, 
   null, 
   "Orion", 
   "I'm sure many of us are familiar with the abusive power the church wielded in history, often leading to outright murder of people who speak out against the church or it's teachings.\n\n \n \nWhich are all quite naturally grossly exaggerated. The most famous examples of \"scientists being tortured/killed for their research\" (that of Copernicus and Galileo) are complete myths, and construed beyond belief.\n\n \n Giordano Bruno (1548 - 1600) was convicted by the Roman Catholic Church of heresy and was burned at the stake. He was a follower of Copernicus.\n \n BTW, the Church did not limit its persecution to only scientists.", 
   {}, 
   84578, 
   null, 
   1104637500.0
  ], 
  [
   84591, 
   null, 
   "Orion", 
   "And lest it be thought that I'm attempting to single out the RCC...\n \n Therefore be on your guard against the Jews, knowing that wherever they have their synagogues, nothing is found but a den of devils in which sheer self-glory, conceit, lies, blasphemy, and defaming of God and men are practiced most maliciously and veheming his eyes on them.\n \n Moreover, they are nothing but thieves and robbers who daily eat no morsel and wear no thread of clothing which they have not stolen and pilfered from us by means of their accursed usury. Thus they live from day to day, together with wife and child, by theft and robbery, as arch-thieves and robbers, in the most impenitent security.\n \n What shall we Christians do with this rejected and condemned people, the Jews?...First to set fire to their synagogues or schools and to bury and cover with dirt whatever will not burn, so that no man will ever again see a stone or cinder of them. This is to be done in honor of our Lord and of Christendom, so that God might see that we are Christians, and do not condone or knowingly tolerate such public lying, cursing, and blaspheming of his Son and of his Christians.\n \n Second, I advise that their houses also be razed and destroyed. For they pursue in them the same aims as in their synagogues. Instead they might be lodged under a roof or in a barn, like the gypsies.\n \n Third, I advise that all their prayer books and Talmudic writings, in which such idolatry, lies, cursing and blasphemy are taught, be taken from them. I advise that their rabbis be forbidden to teach henceforth on pain of loss of life and limb. -- The Jews and their Lies Martin Luther", 
   {}, 
   84588, 
   null, 
   1104639060.0
  ], 
  [
   84592, 
   null, 
   "Easyrider", 
   "Giordano Bruno (1548 - 1600) was convicted by the Roman Catholic Church of heresy and was burned at the stake. He was a follower of Copernicus. BTW, the Church did not limit its persecution to only scientists.\n\n \n Great Scientists who were also Creationists:\n \n http://www.innercite.com/~tstout/cs/pog_a.shtml", 
   {}, 
   84588, 
   null, 
   1104639240.0
  ], 
  [
   84623, 
   null, 
   "Dzeron", 
   "Great Scientists who were also Creationists:\n \n http://www.innercite.com/~tstout/cs/pog_a.shtml\n\n \n That website is total bull. Half of the scientists listed lived long before Darwin published his theory, and others (like Einstein) are mentioned to have believed in a Creator, which is not necessarily, and hardly likely, a Genesis-believer. Deists believe in a Creator, but they are in no way Genesis Creationists.", 
   {}, 
   84592, 
   null, 
   1104648540.0
  ], 
  [
   84637, 
   null, 
   "dreamweaver", 
   "Giordano Bruno (1548 - 1600) was convicted by the Roman Catholic Church of heresy and was burned at the stake. He was a follower of Copernicus.\n \n BTW, the Church did not limit its persecution to only scientists.\n\n You didn't disprove a single one of my points.", 
   {}, 
   84588, 
   null, 
   1104666540.0
  ], 
  [
   84641, 
   null, 
   "Orion", 
   "You didn't disprove a single one of my points.\n\n \n Ah, yes, my dear sophomore. I refer you again to my response to your assertion...\n \n HERE\n \n Ya know, it wouldn't kill you to study a bit of Church history, and doing so might boost your credibility just a little.", 
   {}, 
   84637, 
   null, 
   1104669780.0
  ], 
  [
   84644, 
   null, 
   "Easyrider", 
   "That website is total bull. Half of the scientists listed lived long before Darwin published his theory, and others (like Einstein) are mentioned to have believed in a Creator, which is not necessarily, and hardly likely, a Genesis-believer. Deists believe in a Creator, but they are in no way Genesis Creationists.\n\n \n Tsk, tsk... Truth hurts, huh? You can review any number of modern day (post-Darwin) Christian / Creationist Scientists in the following links:\n \n American Scientific Affiliation\n \n http://www.asa3.org/\n \n Canadian Scientific and Christian Affiliation\n \n http://www.csca.ca/\n \n Affiliation of Christian Geologists\n \n http://www.wheaton.edu/ACG/\n \n Affiliation of Christian Biologists\n \n http://home.messiah.edu/~ghess/acbhome.htm\n \n ASA Science Education Commission\n \n http://www.asa3.org/ASA/education/\n \n Association for Christians in the Mathematical Sciences\n \n http://www.acmsonline.org/\n \n Then you will know the truth, and the truth will set you free! \n \n :p", 
   {}, 
   84623, 
   null, 
   1104674820.0
  ], 
  [
   84646, 
   null, 
   "dreamweaver", 
   "Ah, yes, my dear sophomore. I refer you again to my response to your assertion...\n \n HERE\n \n Ya know, it wouldn't kill you to study a bit of Church history, and doing so might boost your credibility just a little.\n\n Ergh. Why don't we make a deal: I agree to learn more about Church History (where my current knowledge hasn't shown to be too bad, just yet ;)), and you agree to read my posts. Let's bring my statement back here:\n \n The most famous examples of \"scientists being tortured/killed for their research\" (that of Copernicus and Galileo) are complete myths, and construed beyond belief.\n \n Note that I didn't say \"of people adhering to their school of thought\", I said that of of those two scientists. Indeed, Copernicus' book received the blessing of the local bishop and Galileo was a prestege of the Pope. You brought in remarks about Giordano Bruno -- neither Galileo nor Copernicus.", 
   {}, 
   84641, 
   null, 
   1104675300.0
  ], 
  [
   84647, 
   null, 
   "billsco", 
   "Note that I didn't say \"of people adhering to their school of thought\", I said that of of those two scientists. Indeed, Copernicus' book received the blessing of the local bishop and Galileo was a prestege of the Pope. You brought in remarks about Giordano Bruno -- neither Galileo nor Copernicus.\n\n \n I'd like to know what a \"prestege\" is. It must be a person who has been given a life sentence in prison by the Church for publishing a scientific paper, but is allowed to serve the sentence at home, with no freedoms. Sweet. \n \n Copernicus' book received the blessing of a local bishop? So? Did the Church embrace and endorse it?", 
   {}, 
   84646, 
   null, 
   1104676980.0
  ], 
  [
   84648, 
   null, 
   "dreamweaver", 
   "Hehe. Prestege -- one of the greatest kinds. The type that stayed faithful to Galileo even after his public mockery of his friend, the Pope. Since you're not familiar with what happened, I've gone through the liberty of finding you a decent link (though any Google search reveals promising results):\n http://www.leaderu.com/orgs/probe/docs/modmyths.html\n http://www.catholiceducation.org/articles/history/world/wh0005.html\n \n With regard to Copernicus, no -- the Church didn't accept it at the time. With all due respect to Galileo and Copernicus, their arguments were pathetically weak; it's often remarked that it's questionable whether Copernicus believed in the theory himself. The primary ridicule they faced was from the scientific community. Arguments had been put forward, ever since the time of Aristotle, of the Geocentric model of the Universe. They didn't have the scientific knowledge that we do now; things such as gravity and the like were not well known.\n \n For example, one of Galileo's arguments (sometimes it's said that he thought it to be his strongest) was his argument of the tides (link: http://www.noao.edu/outreach/nop/nophigh/steve4.html). That is, that the tide was proof that the Earth was moving. And, of course, let's not forget that the Heliocentric model of the Universe was indeed wrong. :)", 
   {}, 
   84647, 
   null, 
   1104677880.0
  ], 
  [
   84649, 
   null, 
   "billsco", 
   "Hehe. Prestege -- one of the greatest kinds. The type that stayed faithful to Galileo even after his public mockery of his friend, the Pope.\n\n \n I still have no idea what you mean. Besides, I believe the evidence shows the Pope betrayed Galileo, who assumed it was safe to publish his work because of their friendship. \n \n \n Since you're not familiar with what happened...\n\n \n ?\n \n \n... I've gone through the liberty of finding you a decent link (though any Google search reveals promising results):\n http://www.leaderu.com/orgs/probe/docs/modmyths.html\n http://www.catholiceducation.org/articles/history/world/wh0005.html\n\n \n \n Puh..lease! Apologetics are not \"decent links\". \n \n \n\n With regard to Copernicus, no -- the Church didn't accept it at the time. With all due respect to Galileo and Copernicus, their arguments were pathetically weak; it's often remarked that it's questionable whether Copernicus believed in the theory himself. The primary ridicule they faced was from the scientific community. Arguments had been put forward, ever since the time of Aristotle, of the Geocentric model of the Universe. They didn't have the scientific knowledge that we do now; things such as gravity and the like were not well known.\n\n \n Arguing that the Church rejected it on scientific grounds won't fly. It rejected it because the idea contradicted their pre-conceived notion.\n \n \n\n For example, one of Galileo's arguments (sometimes it's said that he thought it to be his strongest) was his argument of the tides (link: http://www.noao.edu/outreach/nop/nophigh/steve4.html). That is, that the tide was proof that the Earth was moving. And, of course, let's not forget that the Heliocentric model of the Universe was indeed wrong. :) \n\n \n Not pertinent. Galileo was imprisoned by the Church. Period. And Bruno was burned, lest anyone forget.", 
   {}, 
   84648, 
   null, 
   1104680280.0
  ], 
  [
   84650, 
   null, 
   "dreamweaver", 
   "I still have no idea what you mean. Besides, I believe the evidence shows the Pope betrayed Galileo, who assumed it was safe to publish his work because of their friendship. \n\n I take it you're not reading the links. It's quite the contrary. Galileo was told that he could publish any of his theories, and as many as he pleased, but that he shouldn't pass them off as necessary truth until there is full evidence of it (Galileo promised and agreed to this). He never produced it. Furthermore, any \"punishment\" to Galileo (which was of the mildest ever possible; he was allowed to stay at friends' houses; often extremely luxurious place) for ridicule of the Pope; not for any scientific matter per se. Check the first link again.\n \n ?\n\n Not very descriptive I'm afraid. You'll have to expand. \n \n Puh..lease! Apologetics are not \"decent links\". \n\n What rubbish; maybe you should stop making arguments littered with fallacies, and try refute the evidence that is littered all over the Internet. Just do a Google search and then come back.\n \n Arguing that the Church rejected it on scientific grounds won't fly. It rejected it because the idea contradicted their pre-conceived notion.\n\n Rubbish. It did reject it on scientific reasons. We all have pre-conceived notions; what a weird statement. The argument was pathetically weak, scientifically, so you shouldn't be surprised in the slightest that it was rejected. \n \n Not pertinent. Galileo was imprisoned by the Church. Period. And Bruno was burned, lest anyone forget.\n\n No period. We're not talking of Bruno, so no idea why you're mentioning him here. I might as well start talking about the Easter Bunny, too. Galileo's \"imprisonment\" was so mild (when you consider what it consisted of) that it's quite hilarious. But note, I never condoned the Church's acts towards Galileo in the slightest. I'm merely saying that they're grossly over-exaggerated, and they indeed are.", 
   {}, 
   84649, 
   null, 
   1104680760.0
  ], 
  [
   84651, 
   null, 
   "billsco", 
   "Once again...what is a prestege?", 
   {
    "post_info": {
     "post_title": "One at a time, then."
    }
   }, 
   84650, 
   null, 
   1104681240.0
  ], 
  [
   84653, 
   null, 
   "dreamweaver", 
   "Oh boy, bad spelling. No worry -- Dictionary.com suggests it in one: prestige. I'm pretty happy with:\n \n A person's high standing among others; honor or esteem.\n http://dictionary.reference.com/search?q=prestige", 
   {}, 
   84651, 
   null, 
   1104682260.0
  ], 
  [
   84671, 
   null, 
   "Mach", 
   "\n Which are all quite naturally grossly exaggerated. The most famous examples of \"scientists being tortured/killed for their research\" (that of Copernicus and Galileo) are complete myths, and construed beyond belief. \n\n \n So, the one I posted, Giordano Bruno, was a myth? I do not see how your comment is relevant.\n \n \nbillsco here implies that dear Ockham was forced to be a theist, while he secretly knew the truth (atheism, of course), but was not allowed to voice his opinion. Of course! That's why he became a Philosopher consistently trying to make the case for God and shows his devoutness throughout his writings. \n \n \n Why don't you ask billsco what he implied, rather than use...ah, your imaginination?\n \n Personally I read billsco's remark to mean:\n \n Had occam not chosen to be a theist (if he happened to not be a theist), he may not have been so luck. He also meant this in a humurous vein. \n \n I never assumed for a minute that Billsco meant that occam was an atheist in hiding. Yet you did. Telling.\n \n How can you possibly know if the church would have dealt with him sooner had he not been a theist? How can you know occam would not have been \"taken in\" as he fled the churches decree that he was a heretic? You cannot, so to come here and suggest Billsco is anything other than :\n Making a funny remark\n A remark based in fact, on historical events\n A remark, quite relevant, because indeed the little friar was chased away by the church for his views.\n \n Perhaps you are suggesting that before making the entertaining comment, billsco should have posted 25 links to various church evils and killings, etc., to justify the one line joke? How not funny.\n \n \nSure! All conflict is caused by religions. Why not take a look at the 20th century and tell me who was responsible for the greatest acts of genocide. Erm.. yes, that's right. The secularists. I'm not placing blame on secularism; I can merely acknowledge that we're all in the same boat, and it's particular humans to blame, not a whole popular religion or school of thought per se.\n\n \n No, it's the abuse of power that often leads to humans comitting wide-scale killing. In many cases, the churches, in history, wielded such power.\n \n -Mach", 
   {}, 
   84578, 
   null, 
   1104695160.0
  ], 
  [
   84673, 
   null, 
   "dreamweaver", 
   "So, the one I posted, Giordano Bruno, was a myth? I do not see how your comment is relevant.\n\n Never said anything close to that. I'm sorry that you fail to see its relevance.\n \nWhy don't you ask billsco what he implied, rather than use...ah, your imaginination?\n\n Not really; I'm reasoning to discover what he implied, actually.\n \nHad occam not chosen to be a theist (if he happened to not be a theist), he may not have been so luck. He also meant this in a humurous vein. \n\n Don't understand; grammar is tricky. \n \nPerhaps you are suggesting that before making the entertaining comment, billsco should have posted 25 links to various church evils and killings, etc., to justify the one line joke? How not funny.\n\n Perhaps the world is going to blow up in two seconds; perhaps my keyboard is going to start speaking; perhaps your comments really do have no point.\n \nNo, it's the abuse of power that often leads to humans comitting wide-scale killing. In many cases, the churches, in history, wielded such power.\n \n -Mach\n\n What \"no\"? What part do you disagree with?", 
   {}, 
   84671, 
   null, 
   1104696180.0
  ], 
  [
   84695, 
   null, 
   "jyoshu", 
   "No, it's the abuse of power that often leads to humans comitting wide-scale killing. In many cases, the churches, in history, wielded such power.\n \n -Mach\n\n \n Sounds to me like you agree with him.", 
   {}, 
   84671, 
   null, 
   1104709980.0
  ], 
  [
   84720, 
   null, 
   "Orion", 
   "Let's bring my statement back here:\n \n The most famous examples of \"scientists being tortured/killed for their research\" (that of Copernicus and Galileo) are complete myths, and construed beyond belief.\n\n \n Not quite. I'm going to quote you directly...\n \n \"Which are all quite naturally grossly exaggerated. The most famous examples of \"scientists being tortured/killed for their research\" (that of Copernicus and Galileo) are complete myths, and construed beyond belief.\"\n \n I direct your attention to the first sentence of your statement and, in particular, your use of the word \"all\", which prompted me to respond to you as follows...\n \n \"Giordano Bruno (1548 - 1600) was convicted by the Roman Catholic Church of heresy and was burned at the stake. He was a follower of Copernicus.\" \n \n \nNote that I didn't say \"of people adhering to their school of thought\", I said that of of those two scientists... You brought in remarks about Giordano Bruno -- neither Galileo nor Copernicus.\n\n \n You said...\"all\". I suggest to you that you learn to take responsibility for what you post, and that you learn to accept correction with dignity and grace. Oh, and, try to avoid using the term \"all\" unless you really really mean it.", 
   {}, 
   84646, 
   null, 
   1104724260.0
  ], 
  [
   84723, 
   null, 
   "billsco", 
   "It's somewhat unfortunate this thread about the teleological argument has been derailed. I hope it can get back on track. \n \n I wanted to defend the work of Galileo, a man who with patient and careful observations tried with the best of intentions to share with the world the results of his work. Dreamweaver wants to excoriate him, for no other reason than he caused problems in the old, stale way the Church had guarded its \"facts\" on matters it knew nothing about. I think the problem is with the Pope and that whole mindset. Galileo, for using his brain to the fullest possible extent, is worth nothing more than contempt to Dreamweaver and people of like mind. In his work, Dialogue, Galileo had the audacity to call a fictional person Simplicio, who represented the old Aristolean philosophy embraced by the Church, and this so perturbed and miffed the Holy See. \n \n I think the Pope needed thicker skin. Dreamweaver too. I and a lot of other posters get called much worse on a daily basis plying the forums and expressing our opinions. The problem was in the mind of the man who thought he was so important that others must kneel and kiss his ring. Yet, we are to believe it was only with the greatest magnanimity that Galileo was merely sentenced to a lifetime of house arrest, and even could visit friend's houses, according to Dreamweaver. Dreamweaver obviously has never considered what freedom means to a human being. \n \n He claims in the posts above the reason the Church balked was because Galileo's endorsement of Coperinicanism wasn't proven scientifically beyond a shadow of a doubt. That's not true, and is an untenable statement. \n \n I have never wished for one second to take a man's freedom away because I disagreed with him. Yet even today, the Church has not fully apologized for this sad chapter.", 
   {
    "unicode_changes_made": true
   }, 
   84695, 
   null, 
   1104724920.0
  ], 
  [
   84724, 
   null, 
   "dreamweaver", 
   "You still didn't disprove any of my points (even if you take \"all\" as an absolute). You haven't shown that Bruno's story there hasn't been exaggerated. My quantifier \"all\" wasn't to be taken as an absolute, and I'm sorry that it's disappointed you so; I'll remember to be more strict in my use of language with you. We could get into a debate on just how much the Church was exaggerated and construed by fables of the enlightenment, but it's not really necessary. I didn't mean \"all and every\" fact; I'll officially retract that; I meant \"a lot of the time\". Like I said, the two most popular occurrences to the public of the \"Church being so evil to scientists\" are complete myths.", 
   {}, 
   84720, 
   null, 
   1104724980.0
  ], 
  [
   84727, 
   null, 
   "dreamweaver", 
   "It's somewhat unfortunate this thread about the teleological argument has been derailed. I hope it can get back on track..... \n\n I'm sorry that you seem to have Galileo on such a pedastel. I'm not saying he was a bad guy; I'm saying that he made some terribly unwise moves. Neither have I condoned the Pope's actions (which were hugely mild considering the time). \n \n Galileo was by no means the perfect scientist/empiricst, and I've demonstrated it. He made terribly unwise moves by publically ridiculing not only the Pope, but a friend of his (great friend, that is). The Catholic Church has apologised for its treatment of Galileo. \n \n billsco needs to read his interlocutor's posts before attacking them. I'll admit that we were going off-track, but dear billsco, your post did nothing but get us further away from the OP (shown by your constant stress on me).", 
   {
    "unicode_changes_made": true
   }, 
   84723, 
   null, 
   1104725340.0
  ], 
  [
   84741, 
   null, 
   "zachvac", 
   "You still didn't disprove any of my points (even if you take \"all\" as an absolute). You haven't shown that Bruno's story there hasn't been exaggerated. My quantifier \"all\" wasn't to be taken as an absolute, and I'm sorry that it's disappointed you so; I'll remember to be more strict in my use of language with you. We could get into a debate on just how much the Church was exaggerated and construed by fables of the enlightenment, but it's not really necessary. I didn't mean \"all and every\" fact; I'll officially retract that; I meant \"a lot of the time\". Like I said, the two most popular occurrences to the public of the \"Church being so evil to scientists\" are complete myths.\n\n \n Then why didn't you use the word most? In a forum where all we see is written language you should mean what you type, we don't know what you mean if you don't mean what you type. If I say \"all people with a screen name of dreramweaver are complete XXXXXX\" and then say, \"well all didn't mean everyone, it meant a lot of the time\".", 
   {}, 
   84724, 
   null, 
   1104729300.0
  ], 
  [
   84750, 
   null, 
   "Orion", 
   "You still didn't disprove any of my points (even if you take \"all\" as an absolute).\n\n \n I corrected you. No big deal. Get over it. \n \n \nYou haven't shown that Bruno's story there hasn't been exaggerated.\n\n \n Nor am I in any way obligated to do so. Instead, I accept the historical accounts concerning Bruno's fate as being factual. Besides, how does one 'exaggerate' his being burned at the stake?\n \n But while we're on the subject, please consider the following...\n \n Exd 22:18 Thou shalt not suffer a witch to live.\n \n Care to guess how many women and children lost their lives as a result of this little ditty? Oh, wait, any such number would probably be, umm... 'exaggerated'?", 
   {}, 
   84724, 
   null, 
   1104731220.0
  ], 
  [
   84753, 
   null, 
   "Easyrider", 
   "To Dreamweaver: I corrected you. No big deal. Get over it.\n\n \n Dreamweaver had you hands down, Orion. \n \n And the fact is that the God of Abraham, Isaac, and Jacob created the universe.", 
   {}, 
   84750, 
   null, 
   1104734040.0
  ], 
  [
   84768, 
   null, 
   "dreamweaver", 
   "I corrected you. No big deal. Get over it. \n\n Maybe we could get you a certificate to be sure.\n \nNor am I in any way obligated to do so.\n\n Wrong. To properly disprove my point, you would have to, since you've interpreted it in that fashion. And furthermore, you speak of the \"historical records\" of Bruno as if there were all the same; unlikely. \n \nCare to guess how many women and children lost their lives as a result of this little ditty? Oh, wait, any such number would probably be, umm... 'exaggerated'?\n\n Hah. I take it you haven't read Dan Brown yet, then.", 
   {}, 
   84750, 
   null, 
   1104766980.0
  ], 
  [
   84793, 
   null, 
   "billsco", 
   "I'm sorry that you seem to have Galileo on such a pedastel. I'm not saying he was a bad guy; I'm saying that he made some terribly unwise moves. Neither have I condoned the Pope's actions (which were hugely mild considering the time). \n\n \n It's puzzling to read that you don't condone the Pope's action, while in the very same sentence, you justify the Pope's actions, thereby condoning the whole affair. \n \n \n\n Galileo was by no means the perfect scientist/empiricst, and I've demonstrated it. He made terribly unwise moves by publically ridiculing not only the Pope, but a friend of his (great friend, that is). The Catholic Church has apologised for its treatment of Galileo.\n\n \n Galileo is guilty of being a crabby curmudgeon. Yawn.\n \n Pope John Paul II apologized for errors in judgement of some of the churchmen who prosecuted him. He never admitted the Church was wrong. Perhaps I should be a bit more generous and let it go at that? Nah. \n \n \n\n billsco needs to read his interlocutor's posts before attacking them. I'll admit that we were going off-track, but dear billsco, your post did nothing but get us further away from the OP (shown by your constant stress on me). \n\n \n This thread isn't about you, sorry.", 
   {}, 
   84727, 
   null, 
   1104775560.0
  ], 
  [
   84798, 
   null, 
   "dreamweaver", 
   "It's puzzling to read that you don't condone the Pope's action, while in the very same sentence, you justify the Pope's actions, thereby condoning the whole affair. \n\n Never \"justified\" them; I said they were understandable, considering the time. \n \n This thread isn't about you, sorry.\n\n I'm glad you agree with me.", 
   {}, 
   84793, 
   null, 
   1104776700.0
  ], 
  [
   84801, 
   null, 
   "Alan Ryan", 
   "Will this thread ever return to a discussion of the \"teleological argument\" ? It seems to have gathered speed in a race to nowhere.", 
   {}, 
   84793, 
   null, 
   1104777480.0
  ], 
  [
   84803, 
   null, 
   "unkerpaulie", 
   "this discussion went downhill real fast, simply because people seemed more compelled to debate definitions and semantics than the actual issue. go figure\n \n this argument fails at premise 1. where do the limits of intelligent design begin and end? a slab of concrete won't form naturally in nature. is that intelligent design? but rocks and water do. there is a lot of not-so-intelligent design out there, both in nature and man-made. what arguments can be made for the existence of mud, clouds, rivers or caves?\n \n similarly, a simple atheistic counter-proof for the non-existence of God goes something like this:\n \n 1. x is chaotic\n 2. x was not designed by anything intelligent\n 3. if it was designed, it was not by something intelligent (inference from 2)\n 4. if God exists then x would be intelligently designed\n 5. since x is not intelligently designed, God does not exist\n \n we end up with 2 \"valid\" proofs that both prove and disprove the existence of God based on the premise of a subjective viewpoint (i.e., \"how intelligently was x designed\"). so can we entertain both arguments? i propose that both arguments must be thrown out based on faulty premises", 
   {}, 
   84508, 
   null, 
   1104778020.0
  ], 
  [
   84804, 
   null, 
   "unkerpaulie", 
   "Hope I don't cloud the issue by jumping in here with a slightly different take on what's been said so far.\n I see things this way: Teleology is the study of purposes, goals or ends. The basic idea is that events/processes can only be explained, and that the evaluation of objects, acts, states, etc., can be justified only by reference to the ends towards which they are directed. \n OK, if this is a satisfactory summary of the nature of teleological theory, then I guess it's necessary to establish (in this thread) what ends or purposes can be attributed to the fact that the universe, humanity, etc. exist ? If any end or purpose can be established respecting what deeply concerns us, the next step would be to infer the \"who\" or the \"what\" that bestowed these purposes in the first place which we have just supposed ourselves to perceive. \n Whether an inquiry proceeding in this limited way would lead to a teleological proof of the existence of God, I leave to the theologians in the forum to determine.\n\n probably the most insightful post in this thread. very well stated", 
   {}, 
   84464, 
   null, 
   1104778200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Teleological argument - why it's rejected", 
  "url": "http://www.4forums.com/political/religion-debates/4031-teleological-argument-why-its-rejected.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 4031, 
  "discussion_files": [
   [
    "7431.html", 
    "http://www.4forums.com/political/religion-debates/4031-teleological-argument-why-its-rejected-print.html"
   ], 
   [
    "7432.html", 
    "http://www.4forums.com/political/religion-debates/4031-teleological-argument-why-its-rejected-4-print.html"
   ], 
   [
    "7433.html", 
    "http://www.4forums.com/political/religion-debates/4031-teleological-argument-why-its-rejected-3-print.html"
   ], 
   [
    "7434.html", 
    "http://www.4forums.com/political/religion-debates/4031-teleological-argument-why-its-rejected-2-print.html"
   ]
  ], 
  "identifier": 4031
 }
]