[
 [
  [
   84581, 
   null, 
   "pnac=ww3", 
   "If you are a male born in the United States, chances are better than not that you are circumcized. \n It happened when you were a few days old and had no say in the matter. \n You probably don't think much about it because that's all you know and that's the way it's been your whole life. \n But did you realize one day that you don't have a normal penis?\n Did you realize that the doctors chopped off some quite important tissue when they circumcized you without your consent?\n \n I believe the practice of ritual infant genital mutilation needs to be banned in this country and people need to be educated as to the deterimental effects of circumcision, which in almost every case is a totally unnecessary procedure.", 
   {
    "post_info": {
     "post_title": "Infant Genital Mutilation"
    }
   }, 
   null, 
   null, 
   1104634200.0
  ], 
  [
   84595, 
   null, 
   "greg 79 f150", 
   "Wow, after 36 years of having a normal sex life, you tell me my appendage is abnormal ??? \n Do you realize the physcological impact your statement will have on all of us circumcised males, who , as you say, had no choice as to what the doctor did to us ?? I think now after reading this post, I will no longer be able to perform my marital duties , and probaly end up divorced !! WOE is me !!! :)", 
   {}, 
   84581, 
   null, 
   1104639720.0
  ], 
  [
   84599, 
   null, 
   "jitobear", 
   "Granted I find the procedure unecessary and I did not have it done to my beastie - the starting post here is a tad over the top.\n \n Plus these days it's a 50/50 thing.", 
   {}, 
   84595, 
   null, 
   1104640380.0
  ], 
  [
   84604, 
   null, 
   "OccamsRazor", 
   "If you are a male born in the United States, chances are better than not that you are circumcized. \n \n\n \n What really boggled my mind when I first read it was that female circumcisions were offered under most health insurance policies in the US up until the 1950's.", 
   {}, 
   84581, 
   null, 
   1104641160.0
  ], 
  [
   84613, 
   null, 
   "greg 79 f150", 
   "I wonder if the poster knows about the negatives of not having the snip ,", 
   {}, 
   84604, 
   null, 
   1104644880.0
  ], 
  [
   84622, 
   null, 
   "jitobear", 
   "I wonder if the poster knows about the negatives of not having the snip ,\n\n \n Usually only an issue if you don't teach your boys to keep things clean.\n \n Hate to break it to ya fellas, but whether or not you have your foreskin ain't all that shakin to the workings of the universe. :p \n \n Female circumcision - now THAT is interesting. What in the world did they cut?", 
   {}, 
   84613, 
   null, 
   1104648420.0
  ], 
  [
   84638, 
   null, 
   "pnac=ww3", 
   "Hate to break it to ya fellas, but whether or not you have your foreskin ain't all that shakin to the workings of the universe. :p \n\n It is to the boy/man who will never know in his life what sex is actually supposed to feel like. His poor hardened (keratinized) glans will never have the sensation that it would if he weren't circumcized. I've heard it being compared to the difference between seeing in color or in black and white. Certain nerve cells that were amputated normally perform certain sensory funtions also. These can never be recovered. \n \n Circumcision removes some, most, or sometimes all of the frenulum, which is (was) a very sensitive part, as well as the material that makes up \"the ridged band\" which is very important in normal ejaculatory response. \n \n Here is a nice site that explains things (Australian):\n http://www.circinfo.org/research.html\n \n \n\n Circumcision was a Victorian medical fad which should have gone out with neck-to-knee bathing costumes, blood-letting, frontal lobotomies, and the idea that children should be seen and not heard. The practice survived because it became deeply entrenched in the culture of English-speaking countries, and seen as normal, or at least acceptable: few people came to regard it with the same revulsion as they would look upon surgical alterations to the genitals of girls. As the original justifications for early circumcision were discredited, the fanatics kept coming up with new reasons for doing it: if it wasn't to stop masturbation, it was to provide immunity against syphilis; if it wasn't syphilis, it was cancer; if it wasn't cancer, it was UTIs ... And so on.\n .....\n The ridged band is a special zone of tissue on the underside of the foreskin, with probably the densest concentration of nerve endings in the human body. Until recently doctors did not even know it was there because they were too busy amputating foreskins before they had studied what they were tossing in the trash. In terms of its role in sexual responsiveness, it could be regarded as the male clitoris.\n .....\n Did you know that an early circumcision can prevent the development of neural pathways in the brain? And that circumcision often has harmful, and permanent, psychological effects?\n\n \n This is not a very well organized site, but it has A LOT of links: http://www.circumstitions.com/\n \n This is interesting to me:\n http://www.circumstitions.com/Nursing.html\n \n As well as this:\n http://www.circumstitions.com/AAP.html\n \nInformation for ordinary people\n The AAP's brochure for parents \"Circumcision: Information for Parents\" is woefully biased towards circumcision, not even admitting that the foreskin is part of the penis. Here is an analysis of its faults. That prompted an alternative brochure, treating intactness as normal, available both online with links and in document form suitable for printing out.\n \n Doctors' organisations\n The American Medical Association issued a policy statement on circumcision on July 6, 2000. It is weighed in the balance (and found wanting) here. It agrees with the recommendation of the American Academy of Pediatrics of March 1, 1999.\n \n The AAP statement is also laid out paragraph for paragraph against its corresponding statement on Female Genital Mutilation, issued in July 1998. The contrast in both the tone and the content of the two statements is astonishing. You wouldn't think the two committees live on the same planet.\n\n \n And then they can always botch the procedure:\n http://www.circumstitions.com/Botched.html\n (links to pictures, so if you are squeamish, don't click here)\n \n \n \nFemale circumcision - now THAT is interesting. What in the world did they cut?\n\n The skin that protects the clitoris, and/or the labia minora, and/or (in some cases) the clitoris itself.", 
   {
    "unicode_changes_made": true
   }, 
   84622, 
   null, 
   1104667740.0
  ], 
  [
   84642, 
   null, 
   "greg 79 f150", 
   "I stand against not being cut. As a infant , a male wont remember the surgery , and the good outweighs the bad when they grow up and use it. As to female circumscision. my God, a hideous crime that should be treated as such . It is a vile and disgusting act performed on girls in third world countries still today, and very disturbing to say the least....\n I am not a doctor , but I worked in a hospital for 12 years. The cases of elderly men they were being treated for infections due to unclean appendages were quite common . The elderly men with diminished capacity minds and untrimmed organs were just not maintaining cleaniness ... \n And on a more sensitive note, ask women that have relations with uncut men. You will find they are concerned with yeast infections ( is the male clean ??? ) and they complain about how uncut males have a hair trigger (no pun intended) and finish before they really get started. :)", 
   {}, 
   84638, 
   null, 
   1104672540.0
  ], 
  [
   84825, 
   null, 
   "OccamsRazor", 
   "\n Female circumcision - now THAT is interesting. What in the world did they cut?\n\n \n Here, have a read of this which discusses female circumcision/genital mutilation, including the appalling practice of infibulation :(", 
   {}, 
   84622, 
   null, 
   1104785580.0
  ], 
  [
   84827, 
   null, 
   "pnac=ww3", 
   "I stand against not being cut. As a infant , a male wont remember the surgery \n\n But there is evidence that it affects the poor tike psychologically. \n Certain neural pathways that would have been formed don't.\n The pain lasts far beyond the day of the amputation and this affects how little jonny sleeps, pees, and breastfeeds.\n \n \n, and the good outweighs the bad when they grow up and use it.\n \n I don't know what you mean by \"when they grow up to use it\" but please \n tell me what's so bad about leaving your penis the way it should be?\n Is it because you have to clean it?\n Tell me a body part that you don't have to clean.\n Should I cut off my ears because they develop ear wax?\n Should I amputate my arms because my armpits get stinky?\n Should I get my butt checks amputated because my XXX gets dirty?\n \n \n\n As to female circumscision. my God, a hideous crime that should be treated as such . It is a vile and disgusting act performed on girls in third world countries still today, and very disturbing to say the least....\n\n And that's just a matter of culture. Someone in Eastern Europe would think that ritual male gential mutilation as disturbing. They would cringe at the thought. \n \n Here, did you read these side by side?\n The opinion of the AAP:\n On male circumcision:\n \nETHICAL ISSUES\n \n The practice of medicine has long respected an adult's right to self-determination in health care decision-making. This principle has been operationalized through the doctrine of informed consent. The process of informed consent obligates the physician to explain any procedure or treatment and to enumerate the risks, benefits, and alternatives for the patient to make an informed choice. For infants and young children who lack the capacity to decide for themselves, a surrogate, generally a parent, must make such choices.118\n \n Parents and physicians each have an ethical duty to the child to attempt to secure the child's best interest and well-being.119 However, it is often uncertain as to what is in the best interest of any individual patient. In cases such as the decision to perform a circumcision in the neonatal period when there are potential benefits and risks and the procedure is not essential to the child's current well-being, it should be the parents who determine what is in the best interest of the child.\n \n In the pluralistic society of the United States in which parents are afforded wide authority for determining what constitutes appropriate child-rearing and child welfare, it is legitimate for the parents to take into account cultural, religious, and ethnic traditions, in addition to medical factors, when making this choice.119\n \n Physicians counseling families concerning this decision should assist the parents by explaining the potential benefits and risks and by ensuring that they understand that circumcision is an elective procedure. Parents should not be coerced by medical professionals to make this choice.\n\n So basically infant genital mutilation is left up to the parents.\n \n On female circumcision:\n \nThe physical burdens and potential psychological harms associated with FGM violate the principle of nonmaleficence, a commitment to avoid doing harm, and disrupt the accepted norms inherent in the patient-physician relationship, such as trust and the promotion of good health. More recently, FGM has been characterized as a practice that violates the right of infants and children to good health and well-being, part of a universal standard of basic human rights.22\n \n Although pediatricians and pediatric surgical specialists may believe that refusal to perform FGM may represent ethnic and Eurocentric cultural imperialism, protection of the physical and mental health of girls should be the overriding concern of the health care community. Humanitarian organizations led by women from cultures in which FGM is practiced have adopted a strong position against the procedure because of its serious physical and psychological consequences.\n \n Some physicians, including pediatricians, who work closely with immigrant populations in which FGM is endemic (is MGM endemic here?), have voiced concern about the adverse effects of criminalization of the practice on educational efforts.24 These physicians emphasize the significance of a ceremonial ritual in the initiation of the girl or adolescent as a community member, and advocate a lesser procedure, such as pricking or incision of the clitoral skin, as often sufficient to satisfy cultural requirements. Pediatricians and pediatric surgical and urologic surgeons who are contemplating performing such a procedure should consider their role in perpetuating this social practice with its cultural implications for the status of women. It is also unclear whether performing such lesser procedures would be exempt from federal criminal laws.\n \n EDUCATION OF PATIENTS AND PARENTS\n \n An educational program about FGM requires, above all, sensitivity to the cultural background of the patient and her parents and an appreciation of the significance of this custom in their tradition.23 Objective information should include a detailed explanation of female genital anatomy and function, as well as a thorough review of the lifelong physical harms and psychological suffering associated with FGM. It should be emphasized that many countries in Africa have supported efforts to educate the public about the serious negative health effects of FGM, and that prominent physicians from Africa are advocates for the elimination of these practices because of their adverse consequences. Pediatricians and pediatric surgical specialists who care for patients from populations known to commonly practice FGM, such as Somalian, Ethiopian, Eritrean, and Sudanese communities, should be aware of local counseling centers. Successful educational programs typically require the active involvement and leadership of immigrant women, whose experience and knowledge can address the health, social status, and legal aspects of FGM.\n \n Efforts should be made to use all available educational and counseling resources to dissuade parents from seeking a ritual genital procedure for their daughter. In those circumstances in which an infant, child, or adolescent appears to be at risk of FGM, the AAP recommends that its members educate and counsel the family about the health effects of FGM. Parents should be reminded that performing FGM is illegal and constitutes child abuse in the United States.\n\n I can understand the difference between chopping off the entire outer part of the clitoris and male circumcision, but as stated in the report, this is not as common a practice as simple female circumcision. Really, what mostly happens is they circumcize the hood of the clitoris, or they remove most of the labia. This is pretty similar to male circumcision. Why isn't the AAP calling it MGM?\n \n So MGM is up to the parents and FGM is illegal.\n \n \n \nI am not a doctor , but I worked in a hospital for 12 years. The cases of elderly men they were being treated for infections due to unclean appendages were quite common . The elderly men with diminished capacity minds and untrimmed organs were just not maintaining cleaniness ... \n And on a more sensitive note, ask women that have relations with uncut men. You will find they are concerned with yeast infections ( is the male clean ??? ) and they complain about how uncut males have a hair trigger (no pun intended) and finish before they really get started. :)\n\n \n Well, then you are contradicting many sources that say that women acheive orgasm more often with uncut men because the way the penis behaves is different. The main sensations rely on mostly pressure and little friction, but when cut, friction is greatly increased, causing the need for artificial lubrication much more often. The penis is supposed to mostly slide in and out of the foreskin instead of mostly rubbing directly on the vaginal walls. (I wouldn't know the difference because I have never had a foreskin beyond infancy. And my girlfriend says she never has any problems or complaints, but we do use the lube sometimes!)\n \n Anyway, if an old man has some problem with his penis then he can get circumcized then (this is what happened to my grandfather). At least he's well old enough to make that decision on his own. A week old infant has no choice in the matter.", 
   {}, 
   84642, 
   null, 
   1104786360.0
  ], 
  [
   85110, 
   null, 
   "sinjin", 
   "Given that men can reach orgasm while asleep(wet dream), I fail to see the significance of a minor reduction in penile sensitivity. Sexual gratification for men at least is more mental than physical IMO. How would you know what you're missing anyway? I smoke and food still tastes good to me. Also, as someone who has undertaken some modification for aesthetics, I think it quaint to talk about how your body \"should\" be.", 
   {}, 
   84827, 
   null, 
   1104947700.0
  ], 
  [
   85181, 
   null, 
   "pnac=ww3", 
   "Given that men can reach orgasm while asleep(wet dream), I fail to see the significance of a minor reduction in penile sensitivity.\n\n Minor? I've read testimonials of guys who got snipped while adults.\n They say that the sensitivity is about 1/3 what it was previously.\n And the sensations last all throughout the \"act\" not just toward the end.\n \n \nSexual gratification for men at least is more mental than physical IMO.\n\n ???\n Maybe you should elaborate.\n \n \n \nHow would you know what you're missing anyway?\n\n EXACTLY. That's exactly the point. \n I will never in my life know what sex is supposed to feel like.\n I don't know what I'm missing, but I know I'm missing something that can never be fully recovered.\n \n \nI smoke and food still tastes good to me.\n\n And you have the choice to quit.\n I cannot choose to regrow the parts that were amputated.\n \n \n \nAlso, as someone who has undertaken some modification for aesthetics, I think it quaint to talk about how your body \"should\" be.\n\n YOU CHOSE TO DO IT.\n If you modified yourself, great!\n If you modified your baby before he was 2 weeks old, that's bad.\n \n If your baby grows up and decides circumcision is the way to go, then away he goes.\n \n But the choice should be his and his alone.\n \n That's really the whole point of this post. A hope that maybe one parent will care enough about their son to not sign a waiver and let some doctor perform an unnecessary amputation on them without the child's consent.", 
   {}, 
   85110, 
   null, 
   1104974880.0
  ], 
  [
   85183, 
   null, 
   "sinjin", 
   "Minor? I've read testimonials of guys who got snipped while adults.\n They say that the sensitivity is about 1/3 what it was previously.\n \n \n ???\n Maybe you should elaborate.\n \n \n \n EXACTLY. That's exactly the point. \n I will never in my life know what sex is supposed to feel like.\n I don't know what I'm missing, but I know I'm missing something that can never be fully recovered.\n \n \n And you have the choice to quit.\n I cannot choose to regrow the parts that were amputated.\n \n \n \n YOU CHOSE TO DO IT.\n If you modified yourself, great!\n If you modified your baby before he was 2 weeks old, that's bad.\n \n If your baby grows up and decides circumcision is the way to go, then away he goes.\n \n But the choice should be his and his alone.\n \n That's really the whole point of this post. A hope that maybe one parent will care enough about their son to not sign a waiver and let some doctor perform an unnecessary amputation on them without the child's consent.\n\n \n I demanded that he be snipped and don't regret it.", 
   {}, 
   85181, 
   null, 
   1104975180.0
  ], 
  [
   85185, 
   null, 
   "pnac=ww3", 
   "I demanded that he be snipped and don't regret it.\n\n I feel sorry for him.\n What if he hates you for it later?\n I don't hate my parents, but I see them as being \"less than informed\" at the time.\n It's really ignorance that keeps this trend going.\n \n I'm sure most of the Africans that lob off labia don't regret it one bit either.", 
   {}, 
   85183, 
   null, 
   1104975360.0
  ], 
  [
   85189, 
   null, 
   "greg 79 f150", 
   "But there is evidence that it affects the poor tike psychologically. \n Certain neural pathways that would have been formed don't.\n The pain lasts far beyond the day of the amputation and this affects how little jonny sleeps, pees, and breastfeeds.\n \n \n I don't know what you mean by \"when they grow up to use it\" but please \n tell me what's so bad about leaving your penis the way it should be?\n Is it because you have to clean it?\n Tell me a body part that you don't have to clean.\n Should I cut off my ears because they develop ear wax?\n Should I amputate my arms because my armpits get stinky?\n Should I get my butt checks amputated because my XXX gets dirty?\n \n \n And that's just a matter of culture. Someone in Eastern Europe would think that ritual male gential mutilation as disturbing. They would cringe at the thought. \n \n Here, did you read these side by side?\n The opinion of the AAP:\n On male circumcision:\n \n So basically infant genital mutilation is left up to the parents.\n \n On female circumcision:\n \n I can understand the difference between chopping off the entire outer part of the clitoris and male circumcision, but as stated in the report, this is not as common a practice as simple female circumcision. Really, what mostly happens is they circumcize the hood of the clitoris, or they remove most of the labia. This is pretty similar to male circumcision. Why isn't the AAP calling it MGM?\n \n So MGM is up to the parents and FGM is illegal.\n \n \n \n \n Well, then you are contradicting many sources that say that women acheive orgasm more often with uncut men because the way the penis behaves is different. The main sensations rely on mostly pressure and little friction, but when cut, friction is greatly increased, causing the need for artificial lubrication much more often. The penis is supposed to mostly slide in and out of the foreskin instead of mostly rubbing directly on the vaginal walls. (I wouldn't know the difference because I have never had a foreskin beyond infancy. And my girlfriend says she never has any problems or complaints, but we do use the lube sometimes!)\n \n Anyway, if an old man has some problem with his penis then he can get circumcized then (this is what happened to my grandfather). At least he's well old enough to make that decision on his own. A week old infant has no choice in the matter.\n\n \n \n \n Man, that is a lot of cutting and pasting of someone elses opinion you have there. :) You might want to put your humanitarian attributes to better use and post a thread with your concern about what REALLY leaves long term effects on infants . Just for starters , how about we all be concerned with those infants being born in this country daily, that are circumcised, then turned over to parents that are,\n \n A: Drug addicts and alcholics\n B: Abusive to the baby physically and mentally as it is raised up \n C: Do not provide a loving atmosphere for the infant\n D: Do not have enough money to keep the infant in a warm home or enough food to keep it from crying, no funds for good healthcare for it \n E: Did not want the child , it was a accident, so it will be treated as such all of its living years\n F: Do not have the mental capacity OR the maturity , to bring a new life in this world and nuture it. \n \n These issues are WORTH being concerned with for an new infant ,the way I see it. A trimmed up tool is the least of concerns for a infant, compared to those listed above . These issues are ones the infant/child can REALLY feel AND will remember the pain of for a lifetime. all jmo good day to you pnac,", 
   {}, 
   84827, 
   null, 
   1104975780.0
  ], 
  [
   85192, 
   null, 
   "pnac=ww3", 
   "Man, that is a lot of cutting and pasting of someone elses opinion you have there. :) You might want to put your humanitarian attributes to better use and post a thread with your concern about what REALLY leaves long term effects on infants . Just for starters , how about we all be concerned with those infants being born in this country daily, that are circumcised, then turned over to parents that are,\n \n A: Drug addicts and alcholics\n B: Abusive to the baby physically and mentally as it is raised up \n C: Do not provide a loving atmosphere for the infant\n D: Do not have enough money to keep the infant in a warm home or enough food to keep it from crying, no funds for good healthcare for it \n E: Did not want the child , it was a accident, so it will be treated as such all of its living years\n F: Do not have the mental capacity OR the maturity , to bring a new life in this world and nuture it. \n \n These issues are WORTH being concerned with for an new infant ,the way I see it. A trimmed up tool is the least of concerns for a infant, compared to those listed above . These issues are ones the infant/child can REALLY feel AND will remember the pain of for a lifetime. all jmo good day to you pnac,\n\n \n You see how ignorant people are about this?\n Everyone thinks it's no big deal.\n It's not as big a deal as being born to drug addicts, but it's a much more common deal, and a much easier deal to stop.\n \n If you want to make this thread about being good to your children then we can include all that other stuff too. \n \n Then we can list what's most common and what's easiest to stop.\n \n I'd say by far that ritual infant genital mutilation is easiest to stop,\n but now that I see these responses maybe it takes more education.\n \n Getting people to stop doing things out of tradition is difficult.\n \n And don't you think B: is applicable to mutilating your child's genitalia without his consent?", 
   {}, 
   85189, 
   null, 
   1104977160.0
  ], 
  [
   85224, 
   null, 
   "greg 79 f150", 
   "You see how ignorant people are about this?\n Everyone thinks it's no big deal.\n It's not as big a deal as being born to drug addicts, but it's a much more common deal, and a much easier deal to stop.\n \n If you want to make this thread about being good to your children then we can include all that other stuff too. \n \n Then we can list what's most common and what's easiest to stop.\n \n I'd say by far that ritual infant genital mutilation is easiest to stop,\n but now that I see these responses maybe it takes more education.\n \n Getting people to stop doing things out of tradition is difficult.\n \n And don't you think B: is applicable to mutilating your child's genitalia without his consent?\n\n \n \n As you noted, I will stand guilty of ignorance on this one. Changes come about in our society because people first , have to bring forth the *issue * ( as you have), then those people with the sincerest heart felt motivation about that issue , that have within their means the following : A lot of time on their hands, a lot of political friends , a lot of money , a camp of attorneys, etc, those people CAN set the course for change. To me , people that have these tools in their hands , would benefit society MORE, by starting a campaign to rid society of the issues I stated above regarding infants. To me, it would be a better humanitarian effort for infants , than a war against weeny trimming. good day, and all jmo", 
   {}, 
   85192, 
   null, 
   1105015260.0
  ], 
  [
   85272, 
   null, 
   "sinjin", 
   "I mutilated my dog as well. He looks much better.\n \n here you go:\n http://www.propenis.com/foreskin.htm\n \n additionally:\n \n Reversal of circumcision \n \n Q. I was circumcised as a baby but now I want to re-grow my foreskin. Is this possible? \n \n A. You are not alone in wanting the circumcision reversed. Requests for foreskin reconstruction, as it is called, is not at all uncommon, especially in America where very many more babies are circumcised than in the UK. There are two main reasons for men to request foreskin reconstruction, one physical the other psychological. On the physical side, following circumcision the glans of the penis may become less sensitive and a man may want foreskin reconstruction to reverse this. Although increased sensitivity of the glans has been reported following foreskin reconstruction, I am not at all sure whether this occurs in all men who have this procedure. On the psychological front, some men who were circumcised when infants feel hey were mutilated without their consent and develop a feelings of resentment and frustration. They feel their body is incomplete and that their penis may not be so attractive to a partner. They may become fixated on such feelings, which become intrusive on their daily life.\n \n Foreskin reconstruction is possible. It is accomplished either by skin grafting undertaken by a plastic surgeon or by a process known as tissue expansion in which the skin covering the shaft of the penis is progressively stretched over the glans. Tissue expansion is a slow process, involving hanging small weights on the skin and takes between 2 and 4 years to accomplish. \n \n The first step would be to discuss the problem with your doctor who may refer you, in the first instance, to a psychiatrist with a special interest in body image problems or to a urologist.", 
   {}, 
   85224, 
   null, 
   1105033560.0
  ], 
  [
   85359, 
   null, 
   "sinjin", 
   "http://www.circlist.com/preferences/preferences.html\n \n a little risqué but informative.", 
   {}, 
   85272, 
   null, 
   1105059540.0
  ], 
  [
   85439, 
   null, 
   "pnac=ww3", 
   "I mutilated my dog as well. He looks much better.\n \n here you go:\n http://www.propenis.com/foreskin.htm\n \n additionally:\n \n Reversal of circumcision \n\n Yes, I've seen many methods of foreskin \"restoration.\" They either include more cutting or streching of the existing shaft skin over the head of the penis. Neither are the same as being left intact. There are certain types of nerve cells and mucosal cells that can never be regrown or grafted back onto the penis.\n \n \n \n \n \nQ. I was circumcised as a baby but now I want to re-grow my foreskin. Is this possible? \n \n A. You are not alone in wanting the circumcision reversed. Requests for foreskin reconstruction, as it is called, is not at all uncommon, especially in America where very many more babies are circumcised than in the UK. There are two main reasons for men to request foreskin reconstruction, one physical the other psychological. On the physical side, following circumcision the glans of the penis may become less sensitive and a man may want foreskin reconstruction to reverse this. Although increased sensitivity of the glans has been reported following foreskin reconstruction, I am not at all sure whether this occurs in all men who have this procedure. On the psychological front, some men who were circumcised when infants feel hey were mutilated without their consent and develop a feelings of resentment and frustration. They feel their body is incomplete and that their penis may not be so attractive to a partner. They may become fixated on such feelings, which become intrusive on their daily life.\n\n I don't feel like I've been humiliated nor do I feel like my penis won't be attractive. It's the part about not having a body part that I should and having no say in the matter.\n \n \n \nForeskin reconstruction is possible. It is accomplished either by skin grafting undertaken by a plastic surgeon or by a process known as tissue expansion in which the skin covering the shaft of the penis is progressively stretched over the glans. Tissue expansion is a slow process, involving hanging small weights on the skin and takes between 2 and 4 years to accomplish. \n \n The first step would be to discuss the problem with your doctor who may refer you, in the first instance, to a psychiatrist with a special interest in body image problems or to a urologist.\n\n I shouldn't have to hang weights from my penis for 2 years or have more penis slicing to attempt to regain a foreskin. It wouldn't be a real foreskin anyway. There are special nerve and skin cells that are in a foreskin that are not in the shaft skin. All foreskin \"restoration\" does is put non-foreskin skin over the glans. This would lead to increased sensitivity in the glans, but that's not really the point. There are entire sensations that are not possible in a circumcized (even a restored one) penis.", 
   {}, 
   85272, 
   null, 
   1105128060.0
  ], 
  [
   85440, 
   null, 
   "pnac=ww3", 
   "As you noted, I will stand guilty of ignorance on this one. Changes come about in our society because people first , have to bring forth the *issue * ( as you have), then those people with the sincerest heart felt motivation about that issue , that have within their means the following : A lot of time on their hands, a lot of political friends , a lot of money , a camp of attorneys, etc, those people CAN set the course for change. To me , people that have these tools in their hands , would benefit society MORE, by starting a campaign to rid society of the issues I stated above regarding infants. To me, it would be a better humanitarian effort for infants , than a war against weeny trimming. good day, and all jmo\n\n Then doctors should just go ahead and do vagina trimming when the parents ask for it.", 
   {}, 
   85224, 
   null, 
   1105128120.0
  ], 
  [
   85442, 
   null, 
   "pnac=ww3", 
   "http://www.circlist.com/preferences/preferences.html\n \n a little risqué but informative.\n\n \n Most of these women are in the US and are used to seeing cicumsized penises.\n \n I've met a few women from Eastern Europe and they say that they have seen few or no circumcized penises and think it's weird or would be more curious about it than aroused. One's husband, when he first came over here, thought that most of the US being circumcized was some kind of propanda held over from the Soviets. When I told him it was true, he couldn't believe it. He said, go to my country and women will think you are Jewish.\n \n Christelle (down about half way) sounds like a doctor that really isn't from Europe. \n \n Here is something: http://www.circumstitions.com/Iowa.html\n \n It's funny how this page: http://www.circlist.com/preferences/uncutintercourse.html says that the action of the uncut penis reduces sexual gratification for both partners, but this page : http://www.cirp.org/pages/anat/ uses the same diagram and says \"The gliding mechanism is Nature's intended mechanism of intercourse. As such, it contributes greatly to sexual pleasure. Also, since more of the loose skin of the penis remains inside the vagina, the woman's natural lubrication is not drawn out to evaporate to a great extent, which makes sex easier without using artificial lubricants.\"\n \n So there is a lot of mixed info out there.", 
   {}, 
   85359, 
   null, 
   1105128960.0
  ], 
  [
   85834, 
   null, 
   "jitobear", 
   "My son is not snipped - he has been taught to keep it clean and there are no problems. I have been with men who are and are not - doesn't matter to me at all (more interested in their character). Regardless of whether or not they are clipped I expect the fellas to be clean.", 
   {}, 
   85442, 
   null, 
   1105396620.0
  ], 
  [
   85843, 
   null, 
   "pnac=ww3", 
   "My son is not snipped - he has been taught to keep it clean and there are no problems. I have been with men who are and are not - doesn't matter to me at all (more interested in their character). Regardless of whether or not they are clipped I expect the fellas to be clean.\n\n Yes, this is the response I get from most of the women I have asked (that have been with both). They say it doesn't really matter or that they couldn't really tell the difference. \n \n They just expect the penis to be clean.\n I'm \"clipped\" and by god I still have to wash my penis!!", 
   {}, 
   85834, 
   null, 
   1105399200.0
  ], 
  [
   86585, 
   null, 
   "jitobear", 
   "Yes, this is the response I get from most of the women I have asked (that have been with both). They say it doesn't really matter or that they couldn't really tell the difference. \n \n They just expect the penis to be clean.\n I'm \"clipped\" and by god I still have to wash my penis!!\n\n \n Hope you clean up the rest of you, too. ;)", 
   {}, 
   85843, 
   null, 
   1105663140.0
  ], 
  [
   86586, 
   null, 
   "sinjin", 
   "Yes, this is the response I get from most of the women I have asked (that have been with both). They say it doesn't really matter or that they couldn't really tell the difference. \n \n They just expect the penis to be clean.\n I'm \"clipped\" and by god I still have to wash my penis!!\n\n \n Don't scrub too hard or you may lose even more of the sensitivity Nature wants you to have.\n \n More grist:\n \n http://www.circumcisioninfo.com/circ_record.html#anchor2r", 
   {}, 
   85843, 
   null, 
   1105663320.0
  ], 
  [
   86609, 
   null, 
   "Sigma", 
   "Definitely no snipping for any of my children. There is no benefit from it, and any detriment is too much detriment. It is just one more operation that may go wrong.", 
   {}, 
   86586, 
   null, 
   1105666740.0
  ], 
  [
   86615, 
   null, 
   "pnac=ww3", 
   "Sorry for providing too much info about my hygiene habits, but that's the nature of this thread, I guess...\n \n Yes, this is pure grist, literally.\n \n I would sit here and debunk their debunking point by point but let me just attack the weakest points.\n \n \nAllegation 8: Male circumcision is basically the same as Female Genital Mutilation (FGM).\n \n Male circumcision and female genital mutilation (sometimes also incorrectly called \"female circumcision\") are two completely different procedures. Circumcision of males, except if done for religious reasons, is considered by most people as a prophylactic (health) procedure. FGM - by its nature - usually results in the mutilation of the female sexual organ, which makes it very hard for the person involved to experience any sexual pleasure [7]. The equivalent of FGM in males would amount to the complete amputation of the penis. \n\n First they just say that removal of penis parts is a different procedure from removal of vagina parts. Well, DERp! Then they say the reason it's different is because people's perceptions of the two are different. I'll agree with that. That's about the only difference. Then they say that FGM shouldn't be called circumcision because that's the word used for MGM. I agree that the more extreme forms of FGM mutilates the vagina to the point that sexual pleasure is almost non-existent. How would the girl know if it happened when she was an infant? What if she has 1/3 of the feeling like a circumcized male. They also try to make you believe that all FGM practiced in the world is the most extreme form, which is not the case. Most of it is comparable to common male circumcision.\n \n \n\n Allegation 3: Circumcision is a traumatic and painful experience for the newborn infant.\n \n The issue of how much pain infants experience during circumcision is a very controversial and hotly debated subject [1], [2]. Even though it is nowadays generally agreed that newborns experience pain more intensely than was previously thought, there are still those who regard the potentials dangers involved in administering anesthesia to newborns to outweigh the benefits [3].\n \n In the most recent report of the Task Force on Circumcision of the AAP, issued in March 1999, three forms of pain relief was reviewed. The methods deemed most effective was the use of either a local anesthetic cream (applied about an hour before the procedure), or a subcutaneous ring block [18]. Alternative forms of analgesia like sugar coated pacifiers [4] or even a drop of alcohol (like wine, which is often used at Jewish circumcisions) have also been advocated for use in conjunction with the anesthetics named above.\n \n Regardless of what kind of pain relief is used, parents can ensure that the circumcision of their newborn is made as comfortable as possible by on the one hand being there to comfort him, and also by choosing a qualified operator to do the operation, which will minimize the time needed to do the operation.\n \n Circumcisions performed on newborns normally only take between 5 to 10 minutes. With the use of anesthesia and/or analgesia, the discomfort and pain to the infant can be almost totally eliminated. Under these conditions, the claim that circumcision is a \"traumatic\" experience is clearly false and misleading.\n \n Parents should also bear in mind that studies have shown that the crying observed in babies during circumcision is often not pain-related (if some kind of pain relief is used), but instead might be caused by the discomfort of being strapped into a circumstraint (the apparatus that is used to restrain the baby during circumcision). However, these days more gentler ways of constraining the baby during the operation are often used instead. \n\n Here is the AAP report (again, with highlights):\n http://www.cirp.org/library/statements/aap1999/\n \n WARNING: Actual video of a child being circumcized without anesthesia.\n http://www.measurection.com/user-submittals/videos/babycirc.wmv\n (~37MB, with sound) \n I don't know if this is too much for this board, but here it is.\n I never watched it actually, I minimized it and listened to the audio.\n The screams of the baby made me not want to watch it at all.\n \n\n Allegation 2: Circumcision amounts to the \"amputation\" of a normal, functional body part.\n \n Calling circumcision an \"amputation\" is a deliberate exaggeration that is used to to frighten prospective parents or instill a feeling of dissatisfaction and loss in those who had been circumcised as infants (see also the discussion below). Circumcision amounts to the removal of between 20% - 50% of the foreskin depending on the method used. It can therefore in no way be described as an \"amputation\".\n \n The claim is sometimes made that a baby is born with a perfect body, and that the foreskin must therefore serve a purpose like protecting the glans of the penis. That might have been the case if humans were still walking around naked. The question why human males are still born with a foreskin can of course be asked. It should, however, be born in mind that human beings have only been wearing clothing of any sort for the last 10-20 thousand years. On the evolutionary time-scale this constitutes a very brief period - certainly too short to have given nature time enough to do away with the foreskin!\n \n Another significant - and interesting - fact is that the only human cultures to routinely wear no clothing are all uncircumcised: in many of these cultures, a male with an exposed glans is considered \"naked\", i.e. the foreskin acts as a kind of natural covering. Circumcision is therefore exclusively associated with clothed man.\n\n http://dictionary.reference.com/search?r=2&q=amputation\n To cut off (a projecting body part), especially by surgery.\n \n The dung about clothed and unclothed man made me laugh.\n \n \n Allegation 7: Circumcision is to blame for many social and psychological problems in adult males.\n \n During the past 20 years or so various \"support\" groups for of men who were circumcised as infants have been formed. These groups claim that they believe that have been harmed by circumcision, that they feel psychologically damaged and mutilated by it and that their sex lives had been ruined by the lack of a foreskin.\n \n As discussed in a separate Section , it has been the aim of the anti-circumcision lobby to make - and support - these claims in order to further their cause of stopping circumcision. It is, after all, hard to get people to change their views about a subject if they are happy about it.\n \n The easiest - and most susceptible - targets for this propaganda are those men who - for whatever reason - are unhappy with their lives and/or with their bodies, and as a result suffer from low self-esteem. To these people, circumcision becomes an easy target - and a convenient scape goat - for all their problems [25] .\n\n This isn't debunking anything, but they don't have any scientific evidence that it doesn't affect the brain. I would think that we would need to know one way or another before chopping off foreskins for no good reason.\n \n I can't speak for everyone but even before I became anti-circumcision I had thought that uncircumcized penises felt something that I didn't feel and that perhaps there was something \"emotional\" tied to it as well. Not just the foreskin, I mean the feelings that you would have if you had a foreskin. \n \n I have nothing to back this up, it's just a hunch. \n It was a hunch, along with other things, led me to be anti-circumcision.\n \n\n Allegation 9: An uncircumcised penis can be kept sufficiently clean by proper washing.\n \n As \"cleanliness\" is very often mentioned in conjunction with circumcision, this subject has been a favorite target of the opponents of circumcision, who proclaim that the implication that men cannot be entrusted with maintaining their own penile hygiene is an insult to them.\n \n If humans only needed to use the bathroom once a day, there might at least be some truth in the statement that proper cleaning of the genital area once a day with soap and water is enough. However, since this is not the case, and most men moreover either don't have the opportunity, inclination or time to clean themselves every time after urinating - as is needed to ensure proper penile hygiene - the statement is clearly false.\n \n Most parents know how difficult it is to get their children to take a bath or shower every day. Even if they do get them to bathe regularly, parents often fail to instruct their children about proper personal hygiene or see to it that it is also carried out in practice. In uncircumcised boys the foreskin usually cannot be retracted until the age of around six. Cleaning the penis in this instance not only requires extra attention and effort, but becomes absolutely necessary since the non-retractable foreskin can very easily trap dirt, bacteria and germs which can lead to a variety of infections, which in infants and young boys can have serious consequences [22], [26].\n \n From the facts outlined above it is clear that personal hygiene in uncircumcised boys often leaves a lot to be desired. What is more, this situation does not improve in adolescent boys: a recent study of boys in Germany [8] has shown that penile hygiene actually worsens as boys grow older. The reason for this might lie in cultural attitudes towards personal hygiene: in many European societies bathing on a daily basis is not the norm. A recent article in Time Magazine [9] for example mentioned that only 47% of all French men and women bathe on a daily basis. Taking into account the fact that most males in Europe are uncircumcised, the scenario discussed above paints a pretty dire picture of (especially) male personal hygiene in those societies. Most people will probably agree that this is hardly an ideal to strive for. Most heterosexual women also have a preference for circumcised sexual partners (see discussion below).\n \n This is saying \"Uncircumcized penises can be kept clean by proper washing\" is a myth because people don't wash properly. What is it then? Does wahing keep the penis clean or doesn't it? Should we lob off fingers because the fingernails get dirty? If you keep your penis clean, what's the problem? Let's let American men decide what's best for their own penises and let's not mutilate it for them before they realize what's going on because French people don't bathe everyday.\n \n \n Allegation 10: The foreskin plays an integral part in facilitating intercourse and in experiencing sexual pleasure.\n \n The experience of pleasure during sexual intercourse by circumcised and uncircumcised men is totally different, and therefore not directly comparable. After circumcision the glans develops a thin but tough protective layer of skin cells. This so-called keratinization process results in a layer only 10 or so cells think - about as thick as Saran Wrap. This is not enough to to significantly alter sexual intercourse, but instead creates a barrier against viruses and pathogenic bacteria.\n \n Opponents of circumcision allege that this protective layer of skin on the glans makes it less sensitive. There is no proof of this statement - many men circumcised as adults claim that once the glans becomes moist (e.g. during sexual intercourse), it has nearly identical sensitivity with that of the uncircumcised penis [10].\n \n Many men have also reported that the foreskin, instead of \"facilitating\" sexual intercourse, actually hinders it [10] because the glans is covered for a lot of the time, thereby reducing the sensitivity experienced by both partners. Even though the exposed glans is less sensitive than in the uncircumcised case, the former regains a lot of its sensitivity when the glans becomes moist (due to the use of lubricants or naturally during intercourse). Also, contrary to the claim often repeated by the anti-circumcision lobby, the foreskin is not the only erogenous part of the penis! Another advantage of circumcision is that the glans becomes enlarged (since it is no longer restricted by the foreskin), which many women find sexually very stimulating. Taking into account the factors mentioned here, as well as the much improved hygienic state of the circumcised penis, it should come as no surprise that a survey of women demonstrated female sexual preference for circumcised men [11].\n \n A recent study by researchers from the University of Chicago, based on a survey of 1400 men, moreover indicated that circumcised men have more varied sex lives [12]. This finding should not be surprising: oral sex, for example, is more likely to be a cleaner and more enjoyable experience for women if their partner is circumcised. The facts mentioned here hardly support the premis that circumcised men suffer from reduced sexual pleasure.\n \n So much misinformation.\n They do admit that the foreskin is ERROGENOUS.\n Not for me!\n The bold part about the foreskin covering the glans contradicts another \n \"myth debunking\" that this page even links to.\n http://www.circinfo.com/myths/myths_and_lies1.html\n \nThe foreskin contains specialized nerve endings.\n All nerves are specialized. There is nothing more or less special about those in the foreskin compared with those elsewhere in the body. The glans also contains nerves which don't usually get fully stimulated when sex is experienced through the foreskin.\n\n The glans never gets fully stimulated through the keratinized layer either, and you can't pull that back.\n \n And I've never heard of the glans getting bigger just because the foreskin is gone. I have heard of the glans being pulled into weird positions because of the tighter skin around the penis after circumcision.\n \n \n Allegation 12: Circumcision amounts to the \"mutilation\" of a sexual organ.\n \n A well-known researcher has made the comment that \"comparing circumcision to amputation is akin to comparing a nose-job to decapitation merely because both events occur above the neck!\". It should also be clear from the previous discussions that this statement is utter nonsence. \n\n A nose job is elective. For a newborn, a circumcision is not elective.\n Also, the nose is not amputated in a nose job.\n http://dictionary.reference.com/search?r=2&q=mutilation\n 1. To deprive of a limb or an essential part; cripple.\n 2. To disfigure by damaging irreparably: mutilate a statue. See Synonyms at batter1.\n 3. To make imperfect by excising or altering parts.\n \n I'd say #3 is the tamest form so maybe that definition would be more palatable to this site.\n \n\n Allegation 13: Infant circumcision violates the (human) rights of the the child since it is done without his consent.\n \n From the day that a child is born until it is old enough to make its own decisions, it is the responsibility of the parents to look after the welfare of their child. This means making decisions that they believe will be in their child's best interest. If parents are convinced that circumcision will benefit their child, they have the legal and moral right to make this decision for him. This is, after all, what parenthood is all about [13]. In the light of this, some of the comments made by those opposed to the procedure (e.g. that infant circumcision \"is an atrocity and a fraud; that it's brutal, perverse, outrageous violation ...\") can only be described as being bizarre on the one hand and totally misguided on the other. Some even equate circumcision with child abuse. Comments like these are irresponsible, not only because they are totally false, but also because they trivialize real suffering and abuse. \n\n This is the biggest fallacy.\n I love their double standard with regard to FGM.\n If the parents are convinced that removing the labia or the clitoral hood were in the best interest of the child shouldn't they have every right to do it?\n \n Here is a list of some ways people trivialize FGM the way we trivialize MGM here:\n http://www.noharmm.org/trivial.htm\n \n \n\n Allegation 15: If my child is circumcised he will be teased by his peers.\n \n Since the circumcision rate in the US at present is conservatively estimated to be at least 60% (see below) just the opposite will be the case. It is a well-documented fact [10] that young uncircumcised boys get teased quite a lot when they are amongst their peers, most of whom are circumcised.\n \n Although the fear of being teased or made fun of should not be an overriding reason for parents to circumcise their newborn, they should certainly keep this fact in mind since it can cause psychological problems for their son when he grows up. There has even been a reported case where a boy circumcised himself (and had to be rushed to hospital) because he could no longer stand the ribbing and teasing inflicted on him by his peers [6].\n \n Parents should also take note of a recent internet survey of teenage boys which showed that uncircumcised boys are far less satisfied with their status than their circumcised peers [14]. \n\n In one breath they say \"Don't get your kid circumcized just to fit in.\"\n And in the rest they say how uncircumcized boys don't fit in, and that you should get your kid cricumcized so he will be more satisfied with his status. Basically they are saying, circumcize your kids because you want them to fit in (figuratively).\n \n Here's something else to put in the mill:\n http://www.mothersagainstcirc.org/", 
   {
    "unicode_changes_made": true
   }, 
   86586, 
   null, 
   1105670040.0
  ], 
  [
   87706, 
   null, 
   "billsco", 
   "I've heard circumcision was started by the Jews because they wanted 10% off.", 
   {}, 
   86615, 
   null, 
   1106326500.0
  ], 
  [
   87794, 
   null, 
   "pnac=ww3", 
   "Nice! emoticon_xhoho", 
   {}, 
   87706, 
   null, 
   1106356560.0
  ], 
  [
   95201, 
   null, 
   "Wraith", 
   "I'm dismayed that male genital mutilation is still legal and utterly shocked to hear it's so common in the USA. Beyond this I'm sickened to read so many people on this thread defending such mutilation I can only imagine they do so because they themselves have been mutilated and feel they are being personally attacked.\n \n In my opinion circumcision is a form of child abuse and under taken ignorantly due to archaic cultural fallacies and 'old wives tales' I am only thankful I do not live in a culture that encourages such barbarous acts to be under taken on new born infants.", 
   {}, 
   87794, 
   null, 
   1109886600.0
  ], 
  [
   95223, 
   null, 
   "sinjin", 
   "I'm dismayed that male genital mutilation is still legal and utterly shocked to hear it's so common in the USA. Beyond this I'm sickened to read so many people on this thread defending such mutilation I can only imagine they do so because they themselves have been mutilated and feel they are being personally attacked.\n \n In my opinion circumcision is a form of child abuse and under taken ignorantly due to archaic cultural fallacies and 'old wives tales' I am only thankful I do not live in a culture that encourages such barbarous acts to be under taken on new born infants.\n\n \n I defended it because I honestly feel a circumcised penis is aesthetically more pleasing. My son was completely healed in a few days. Big deal.\n \n mu·ti·late - \n \n 1. To deprive of a limb or an essential part; cripple. \n \n 2. To disfigure by damaging irreparably.\n \n 3. To make imperfect by excising or altering parts. \n \n The term mutilation hardly applies IMO. I don't buy the psychological trauma argument or the significant sensitivity loss argument either.", 
   {}, 
   95201, 
   null, 
   1109889360.0
  ], 
  [
   95234, 
   null, 
   "jitobear", 
   "I defended it because I honestly feel a circumcised penis is aesthetically more pleasing.\n\n \n ***snort*** emoticon_xbouncer \n \n That's funny....you boys really think you got gold there don't ya?\n \n It's useful - that's it. If I want aesthetics I will go to an art museum.", 
   {}, 
   95223, 
   null, 
   1109891160.0
  ], 
  [
   95240, 
   null, 
   "sinjin", 
   "***snort*** emoticon_xbouncer \n \n That's funny....you boys really think you got gold there don't ya?\n \n It's useful - that's it. If I want aesthetics I will go to an art museum.\n\n \n I suppose you do no intimate grooming? Why bother since it's usefulness isn't improved?", 
   {}, 
   95234, 
   null, 
   1109891940.0
  ], 
  [
   95295, 
   null, 
   "jitobear", 
   "I suppose you do no intimate grooming? Why bother since it's usefulness isn't improved?\n\n \n Hey I am all about keeping your stuff clean. I have been with both, my ex wasn't, my last BF was - it really did not make a difference to me. They were both equally silly looking. And for the record - so is my girl stuff. To quote Robine Williams on close ups of said parts in porn, \"it's like an industrial film covered in fur\". On both sexes - the other parts are all cuter than the genitals.", 
   {}, 
   95240, 
   null, 
   1109897100.0
  ], 
  [
   95301, 
   null, 
   "sinjin", 
   "Hey I am all about keeping your stuff clean. I have been with both, my ex wasn't, my last BF was - it really did not make a difference to me. They were both equally silly looking. And for the record - so is my girl stuff. To quote Robine Williams on close ups of said parts in porn, \"it's like an industrial film covered in fur\". On both sexes - the other parts are all cuter than the genitals.\n\n \n I wasn't talking clean but styled. Yes or no? Waxed, shaven, plucked, whatever.", 
   {}, 
   95295, 
   null, 
   1109897400.0
  ], 
  [
   95321, 
   null, 
   "greg 79 f150", 
   "I'm dismayed that male genital mutilation is still legal and utterly shocked to hear it's so common in the USA. Beyond this I'm sickened to read so many people on this thread defending such mutilation I can only imagine they do so because they themselves have been mutilated and feel they are being personally attacked.\n \n In my opinion circumcision is a form of child abuse and under taken ignorantly due to archaic cultural fallacies and 'old wives tales' I am only thankful I do not live in a culture that encourages such barbarous acts to be under taken on new born infants.\n\n \n I am snipped and have had no life threatening ordeals or sexual catastrophe's as the result of it being done. \n Heck, I wish they had cut more skin off . At 52 now, my foreskin is getting longer than my dangler, so now I am getting salty shoe tops before I realize the sun aint fully out :(", 
   {}, 
   95201, 
   null, 
   1109901300.0
  ], 
  [
   95358, 
   null, 
   "jitobear", 
   "I wasn't talking clean but styled. Yes or no? Waxed, shaven, plucked, whatever.\n\n \n Not really sure I should be answering this, but I keep it pretty simple - clean and trimmed, mostly for comfort and hygene.\n \n You seem to be offended by my light-hearted view on all this. I mean, really, it we can't laugh at our privates - what can we laugh at that? \n \n \"My dingaling\n My dingaling\n I want to play with my dingaling\"\n ~ Chuck Berry", 
   {}, 
   95301, 
   null, 
   1109918160.0
  ], 
  [
   95381, 
   null, 
   "miagirl", 
   "Given that men can reach orgasm while asleep(wet dream), I fail to see the significance of a minor reduction in penile sensitivity. Sexual gratification for men at least is more mental than physical IMO. How would you know what you're missing anyway? I smoke and food still tastes good to me. Also, as someone who has undertaken some modification for aesthetics, I think it quaint to talk about how your body \"should\" be.\n\n I hate to be offensive, but that sounds like a disgusting response. I am a woman and have had sexual dreams in which I've had an orgasm, usually half awake and half asleep. I smoke, too. You are just being mean... You mean a minor cutting would be ok? Minor cutting to you, or one who has to do it? A male cannot help being born a male...", 
   {}, 
   85110, 
   null, 
   1109934060.0
  ], 
  [
   95382, 
   null, 
   "Wraith", 
   "1. To deprive of a limb or an essential part; cripple.\n \n 2. To disfigure by damaging irreparably.\n \n 3. To make imperfect by excising or altering parts.\n \n The term mutilation hardly applies IMO. I don't buy the psychological trauma argument or the significant sensitivity loss argument either.\n\n \n It applies in all 3 cases. emoticon_mad \n \n I'm just gald I'm not mutilated in such a way and if I have a son at some point in my life I'll make sure he isn't either.", 
   {}, 
   95381, 
   null, 
   1109936880.0
  ], 
  [
   95413, 
   null, 
   "sinjin", 
   "It applies in all 3 cases. emoticon_mad \n \n I'm just gald I'm not mutilated in such a way and if I have a son at some point in my life I'll make sure he isn't either.\n\n \n Nothing essential is removed, therefore damage is not done in that the member is functionally intact. It's sculpting nothing more. Do you consider a \"nose job\" mutilation?\n \n I'm happy you like yours the way it is. It is your right to cut or not cut your son. I likewise will \"mold\" my son as I see fit within the bounds of the law.", 
   {}, 
   95382, 
   null, 
   1109955720.0
  ], 
  [
   95421, 
   null, 
   "sinjin", 
   "I hate to be offensive, but that sounds like a disgusting response. I am a woman and have had sexual dreams in which I've had an orgasm, usually half awake and half asleep. I smoke, too. You are just being mean... You mean a minor cutting would be ok? Minor cutting to you, or one who has to do it? A male cannot help being born a male...\n\n \n You're not being offensive and I'm not trying to be \"disgusting\". I'm not sure what your orgasmic abilities have to do with circumcision. I only addressed dreams for males as I am one. If I'm mean then I'm mean. I'll also put braces on his teeth should that be indicated.", 
   {}, 
   95381, 
   null, 
   1109956920.0
  ], 
  [
   95431, 
   null, 
   "sinjin", 
   "You seem to be offended by my light-hearted view on all this. I mean, really, it we can't laugh at our privates - what can we laugh at that? \n \n\n \n Not at all. I simply wanted you to admit that similar \"vanities\" are common to both genders. American males tend to \"light-heartedly\" disparage each others privates regularly although they might find it less humorous coming from a woman.", 
   {}, 
   95358, 
   null, 
   1109957940.0
  ], 
  [
   95483, 
   null, 
   "jitobear", 
   "Not at all. I simply wanted you to admit that similar \"vanities\" are common to both genders. American males tend to \"light-heartedly\" disparage each others privates regularly although they might find it less humorous coming from a woman.\n\n \n However - women get to pretty much choose what to they want to do with their privates when they reach adulthood. Circumcision is different.\n \n In any case - I don't think it matters all that much at. The world hardly begins or ends with foreskin. I chose not to snip my son because it seemed uneccesary and rather meanish - but I hardly think it's earth shatteringly horrible if you do snip.\n \n I was mostly amused by your putting \"penis\" and \"aestheticly pleasing\" in the same sentence..... :p", 
   {}, 
   95431, 
   null, 
   1109965500.0
  ], 
  [
   95497, 
   null, 
   "sinjin", 
   "However - women get to pretty much choose what to they want to do with their privates when they reach adulthood. Circumcision is different.\n \n\n \n It is different. I've heard it's much more painful to have done as an adult. One might look upon it as having done the little man a favor. Or not.", 
   {}, 
   95483, 
   null, 
   1109967840.0
  ], 
  [
   95498, 
   null, 
   "Wraith", 
   "Nothing essential is removed, therefore damage is not done in that the member is functionally intact. It's sculpting nothing more. Do you consider a \"nose job\" mutilation?\n\n \n I don't feel the need to debate with you on this point - arguments have already been given in this thread which answer your questions.\n \n \nIt is your right to cut or not cut your son. I likewise will \"mold\" my son as I see fit within the bounds of the law.\n\n \n Then I see you no better than a 'run of the mill' child abuser.", 
   {}, 
   95483, 
   null, 
   1109968020.0
  ], 
  [
   95510, 
   null, 
   "sinjin", 
   "I don't feel the need to debate with you on this point - arguments have already been given in this thread which answer your questions.\n\n Whatever. Apparently you felt the need initially. Not fun anymore?\n My question was to you and you alone. \n \n \nThen I see you no better than a 'run of the mill' child abuser.\n \n\n \n An attempt at the last word I suppose? How will I ever live with myself?", 
   {}, 
   95498, 
   null, 
   1109971200.0
  ], 
  [
   95543, 
   null, 
   "Wraith", 
   "Whatever. \n\n \n I haven't heard that before!\n \n \n Apparently you felt the need initially. Not fun anymore?\n My question was to you and you alone. \n\n \n My first post was a general statement.\n \n My second post was to say I disagreed that circumcision didn't meet all three deffinitions that you posted.\n \n The third is what you quoted.\n \n Neither of these posts did I express the desire to debate whether your listed deffinitions applied to circumcision - I simply stated I dissagreed with your comment \"The term mutilation hardly applies IMO.\"  for reasons already presented in this thread.\n \n \nAn attempt at the last word I suppose? How will I ever live with myself?\n\n \n My guess is you'll simply decide to label me a 'XXXXX' so you can dissmiss my comments in an attempt to avoid the disturbing truth that you practice and advocate the genital mutilation of infants.", 
   {}, 
   95510, 
   null, 
   1109976480.0
  ], 
  [
   95585, 
   null, 
   "sinjin", 
   "My guess is you'll simply decide to label me a 'XXXXX' so you can dissmiss my comments in an attempt to avoid the disturbing truth that you practice and advocate the genital mutilation of infants.\n\n \n I don't think you a XXXXX. I dismiss the charge of mutilation. No \"truth\" has been established. Btw only boy \"infants\".\n \n And you never answered my question. Rhinoplasty=mutilation?", 
   {}, 
   95543, 
   null, 
   1109983560.0
  ], 
  [
   95611, 
   null, 
   "Mach", 
   "My wife is about 90% certain she will not want a boy circumsized if we're lucky enough to have one.\n \n #1 It can be the boys choice later in life\n #2 It's unnatural\n #3 It can cause irreversable damage to arguable the only important part of a males anatomy (until it stops functioning).\n \n That's really the important points. Better sex overall is a plus, to be sure, but #1 is key. My wife despises the robotic ritual and mindles actions of much of society, mutilating an infants penis is just one of them.\n \n Sorry Sinjin, but permantly removing and deforming the male appendage is the definition of mutilation. I don't think you're a run-of-the-mill child abuser though!!! I think that was a bit much, you've always seemed quite OK, if not often correct, to me.\n \n Mutilate:\n 1 : to cut up or alter radically so as to make imperfect (a boys appendage)\n \n And rhinoplasty is a choice an adult makes, people don't always boys that choice.\n \n -Mach", 
   {}, 
   95498, 
   null, 
   1110011520.0
  ], 
  [
   95612, 
   null, 
   "Mach", 
   "\n You seem to be offended by my light-hearted view on all this. I mean, really, it we can't laugh at our privates - what can we laugh at that? \n \n\n \n Actually reading through them they were cracking me up.\n \n And we don't \"think\" we have gold down there. It TELLS US, in a commanding voice, that it IS gold, and will be treated as such. We don't have much choice in the matter, we share our physical selves with what amounts to a primitive beast. Easy to see what happens when junior is taken away, just look at eunichs :/\n \n -Mach", 
   {}, 
   95498, 
   null, 
   1110013380.0
  ], 
  [
   95644, 
   null, 
   "Mach", 
   "I think there is mental well-being of the parents at stake too, which I don't really support. Parents don't really want to hear they made the wrong choice either way, which I do sympathize with, but still don't condone. In the end, it's still a choice, are pros and cons to both, all of which are supported not only by individual accounts, but by medical associations.\n \n I think choice, and what's natural, are more important. I would prefer not to have been cut, I think that choice should have been mine.\n I promise you that most parents aren't given information unbiased, on both sides, it just \"happens\" in many hospitals, or is just a check box...\n \n \n -Mach", 
   {}, 
   95498, 
   null, 
   1110045420.0
  ], 
  [
   95663, 
   null, 
   "jitobear", 
   "Actually reading through them they were cracking me up.\n \n And we don't \"think\" we have gold down there. It TELLS US, in a commanding voice, that it IS gold, and will be treated as such. We don't have much choice in the matter, we share our physical selves with what amounts to a primitive beast. Easy to see what happens when junior is taken away, just look at eunichs :/\n \n -Mach\n\n \n I am SO GLAD I am female. emoticon_xangel", 
   {}, 
   95612, 
   null, 
   1110054120.0
  ], 
  [
   95944, 
   null, 
   "Silent_eko", 
   "Here, have a read of this which discusses female circumcision/genital mutilation, including the appalling practice of infibulation :(\n\n \n im not going to eat for the next week! emoticon_wow", 
   {
    "post_info": {
     "post_title": "ello"
    }
   }, 
   84825, 
   null, 
   1110222840.0
  ], 
  [
   96163, 
   null, 
   "sinjin", 
   "My wife is about 90% certain she will not want a boy circumsized if we're lucky enough to have one.\n \n #1 It can be the boys choice later in life\n #2 It's unnatural\n #3 It can cause irreversable damage to arguable the only important part of a males anatomy (until it stops functioning).\n\n I'll play along a little further even though I think this all a little silly.\n \n 1. Yes, he could choose to cut it later with additional discomfort. I'm anticipating his feelings based on mine. Do it all the time.\n 2. \"Natural\" has no special meaning for me. Are tribal people who practice \"body modifications\" less \"natural\" than say, you?\n 3. \"Damage\" in the sense of some loss of sensitivity is acknowledged. Acceptable IMO.\n \n \nThat's really the important points. Better sex overall is a plus, to be sure, but #1 is key. My wife despises the robotic ritual and mindles actions of much of society, mutilating an infants penis is just one of them.\n\n I stated my reasons and they are not \"robotic\" or \"mindless\". Thanks.\n \"Better sex\" is not guaranteed by having foreskin.\n \n \nSorry Sinjin, but permantly removing and deforming the male appendage is the definition of mutilation. I don't think you're a run-of-the-mill child abuser though!!! I think that was a bit much, you've always seemed quite OK, if not often correct, to me.\n -Mach\n\n de·form -\n 1. To spoil the natural form of; misshape: a body that had been deformed by disease.\n 2. To spoil the beauty or appearance of; disfigure.\n \n I would submit that \"spoil\" is subjective in this case as is \"correct\" in your backhanded compliment. emoticon_xclown I'm fond of you too. :p \n \n Btw I would advise against \"natural\" childbirth. Ouch! Best of luck to you and your wife with this great adventure. emoticon_xgood", 
   {}, 
   95611, 
   null, 
   1110309900.0
  ], 
  [
   175016, 
   null, 
   "Dusty Boots", 
   "I had a Jewish pediatrician. \n \n Result: Easy maintenance. Plenty of sensitivity. No complaints.\n \n If having a foreskin could make things any more sensitive than they are being circumcised, I'd never be able to leave the house due a perpetual :xcensored. \n \n Signed, one satisfied cut-stomer.\n \n D.B. emoticon_cool", 
   {}, 
   96163, 
   null, 
   1130480820.0
  ], 
  [
   178810, 
   null, 
   "OccamsRazor", 
   "\n I was mostly amused by your putting \"penis\" and \"aestheticly pleasing\" in the same sentence..... :p\n\n \n Goes to show beauty is in the eye of the beholder. I once had a colleague who described her fellas schlong as being \"the picture of beauty\".\n \n Go figure emoticon_xclown", 
   {}, 
   95483, 
   null, 
   1131763740.0
  ], 
  [
   180743, 
   null, 
   "jim's trucking", 
   "Everybody's crazy septin me 'n' you. I sometimes I wonder about you.\n \n Circumventing problems outweighs some miniscule loss of sensitivity. I can't compare before and after because I was an infant when it happened. They didn't cut off any working parts, just a snippet of skin that served no purpose other than to cover the sensitive parts and aid in penetration.\n [*]I don't want the sensitive parts covered.[*]I have other methods of lubricating the receptacle and the plug.\n Sustained covering of the sensitive parts leads to dead skin cells, fungi and infectuous hangers on that impede healthy and totally enjoyable use of the divining rod.\n \n All you people who think it's mutilation are really out to lunch!\n \n That's exactly opposite of how I feel about female mutilation. The purpose of the cutting there is to take away the little man in the boat, thus denying the female of her God-given pleasure center. THAT is mutilation!", 
   {}, 
   95497, 
   null, 
   1132614840.0
  ], 
  [
   180764, 
   null, 
   "Dono", 
   "I feel qualified to comment here since I was circumcised at age 30. For me it was a necessity because sex became very uncomfortable and the tight foreskin was often torn during intercourse, not a good thing. My only regret was that I didn't do it years earlier since I found the sex better (something I didn't think was possible) and the maintenance easier. When my son was born, I made sure he was snipped based on my experience (I often brag that he weighed 11 pounds at birth and 7 pounds after being circumcised).\n Dono", 
   {}, 
   87794, 
   null, 
   1132619220.0
  ], 
  [
   180765, 
   null, 
   "sinjin", 
   "I feel qualified to comment here since I was circumcised at age 30. For me it was a necessity because sex became very uncomfortable and the tight foreskin was often torn during intercourse, not a good thing. My only regret was that I didn't do it years earlier since I found the sex better (something I didn't think was possible) and the maintenance easier. When my son was born, I made sure he was snipped based on my experience (I often brag that he weighed 11 pounds at birth and 7 pounds after being circumcised).\n Dono\n\n \n How was the recovery?", 
   {}, 
   180764, 
   null, 
   1132619880.0
  ], 
  [
   181208, 
   null, 
   "Dono", 
   "How was the recovery?\n\n Both my son and I recovered nicely. I wanted my doctor to use pinking shears to give me that custom touch, but my insurance covered only the standard snipping.\n Dono", 
   {}, 
   180765, 
   null, 
   1132817340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Infant Genital Mutilation", 
  "url": "http://www.4forums.com/political/health-debates/4039-infant-genital-mutilation.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 4039, 
  "discussion_files": [
   [
    "29973.html", 
    "http://www.4forums.com/political/health-debates/4039-infant-genital-mutilation-print.html"
   ], 
   [
    "29974.html", 
    "http://www.4forums.com/political/health-debates/4039-infant-genital-mutilation-5-print.html"
   ], 
   [
    "29975.html", 
    "http://www.4forums.com/political/health-debates/4039-infant-genital-mutilation-4-print.html"
   ], 
   [
    "29976.html", 
    "http://www.4forums.com/political/health-debates/4039-infant-genital-mutilation-3-print.html"
   ], 
   [
    "29977.html", 
    "http://www.4forums.com/political/health-debates/4039-infant-genital-mutilation-2-print.html"
   ]
  ], 
  "identifier": 4039
 }
]