[
 [
  [
   84706, 
   null, 
   "Toxey", 
   "Canada started out with 3 million and the n 33 million now 67 miilion dollars for relief in asia from the disaster.\n Big whoopie,,,,Why dont you get off your a$$ and really help!!!!!!!!!!!!!!", 
   {
    "post_info": {
     "post_title": "Where are you Canada"
    }
   }, 
   null, 
   null, 
   1104718200.0
  ], 
  [
   84716, 
   null, 
   "georged", 
   "Canada - population 30M, GDP $1T, disaster contribution $67M\n US - population 290M, GDP $11T, disaster contribution $350M\n \n Simple math says you're throwing stones at the wrong target. By your account the US should be at $670M, but it always does take us time to work out the details, like what those distressed nations will concede in trade agreements for humanitarian US contributions.", 
   {}, 
   84706, 
   null, 
   1104722460.0
  ], 
  [
   84726, 
   null, 
   "jskufan", 
   "Canada - population 30M, GDP $1T, disaster contribution $67M\n US - population 290M, GDP $11T, disaster contribution $350M\n \n Simple math says you're throwing stones at the wrong target. By your account the US should be at $670M, but it always does take us time to work out the details, like what those distressed nations will concede in trade agreements for humanitarian US contributions.\n\n \n Well George, in all fairness, Canada isn't involved in the $125 billion dollar humanitarian aid project in Iraq like its intellectually superior neighbor to the south. Taking that in account, the US taxpayer really is considerably more generous.", 
   {}, 
   84716, 
   null, 
   1104725160.0
  ], 
  [
   84756, 
   null, 
   "daewoo", 
   "Well George, in all fairness, Canada isn't involved in the $125 billion dollar humanitarian aid project in Iraq like its intellectually superior neighbor to the south. Taking that in account, the US taxpayer really is considerably more generous.\n\n \n \n Leveling cities and killing thousnads of civilians.....what an odd form of humanitarian aid.", 
   {}, 
   84726, 
   null, 
   1104738120.0
  ], 
  [
   84766, 
   null, 
   "georged", 
   "I keep forgetting how wrong the rest of the world is and our eagerness to use our credit card military to show them the errors of their ways. Our 2005 humanitarian military aid to Columbia is $724M, to assist that government in continued destabilization by defoliation and death of their sparsely occupied territory residents who insist on growing those sinful drugs to sell in our always receptive markets. A natural disaster does of course pale in importance to those priorities.", 
   {}, 
   84756, 
   null, 
   1104766620.0
  ], 
  [
   84809, 
   null, 
   "lord tammerlain", 
   "Canada is also fast tracking refugees from the affected areas, providing that they have family members already in Canada either as citizens or permanent residents.\n \n However I think that for real humanitarian aid we should first imprison them, beat them, sodomize them with flashlights, and call it a frat party.", 
   {}, 
   84766, 
   null, 
   1104779340.0
  ], 
  [
   84813, 
   null, 
   "georged", 
   "Canada is also fast tracking refugees from the affected areas, providing that they have family members already in Canada either as citizens or permanent residents.\n \n However I think that for real humanitarian aid we should first imprison them, beat them, sodomize them with flashlights, and call it a frat party.\n\n \n That would put you well on your way to becoming an honorary member of the general US public. I think humanitarian frat party is now probably the politically correct term. Our president includes that word or God's Will in all statements.", 
   {}, 
   84809, 
   null, 
   1104780480.0
  ], 
  [
   84877, 
   null, 
   "OccamsRazor", 
   "Well George, in all fairness, Canada isn't involved in the $125 billion dollar humanitarian aid project in Iraq like its intellectually superior neighbor to the south. Taking that in account, the US taxpayer really is considerably more generous.\n\n \n Humanitarian aid project..... snicker :p", 
   {}, 
   84726, 
   null, 
   1104808200.0
  ], 
  [
   85386, 
   null, 
   "Maineiac", 
   "The folks in Asia are lucky that we don't contribute only what we can afford.I think we are sending sufficent relief.", 
   {}, 
   84877, 
   null, 
   1105070220.0
  ], 
  [
   85465, 
   null, 
   "jim's trucking", 
   "Gee, if we could just get all the UN members and world leaders to read 4forums.com, all our problems would soon be over. What with our resident all-round experts...such brilliance is a shame to go unnoticed.", 
   {}, 
   85386, 
   null, 
   1105136040.0
  ], 
  [
   85481, 
   null, 
   "lord tammerlain", 
   "Now come on Jim, how many times did we all hear that Abu Ghraib, was no worse then a frat house", 
   {}, 
   85465, 
   null, 
   1105139400.0
  ], 
  [
   85500, 
   null, 
   "georged", 
   "The folks in Asia are lucky that we don't contribute only what we can afford.I think we are sending sufficent relief.\n\n \n Being a little short on cash, I wouldn't be surprised if our donation consisted of treasury issues redeemable in 2015. And require that all reconstruction be split beteen Iraq Coalition members, with Halliburton as lead.", 
   {}, 
   85386, 
   null, 
   1105145160.0
  ], 
  [
   85513, 
   null, 
   "jskufan", 
   "Being a little short on cash, I wouldn't be surprised if our donation consisted of treasury issues redeemable in 2015. And require that all reconstruction be split beteen Iraq Coalition members, with Halliburton as lead.\n\n \n It's never a good sign economically when a superpower like the US has a hard time scraping up a lousy billion dollars for the worst natural disaster in modern history. We resorted to sending a couple of ex-Presidents out door to door to raise money from the private sector because apparently we've become officially \"tapped out\" at the Federal level. It's probably better that way, at least we have a say in where the money's going.", 
   {}, 
   85500, 
   null, 
   1105150440.0
  ], 
  [
   85575, 
   null, 
   "squid", 
   "The Australian Government has donated $1Bn, with private donations at around $150m, which will rise significantly in the next 2 days with various charity events organised. I'm very proud of our nation of 19 million people at the moment. \n \n In saying this, I would expect Australia to donate such a large amount, because we have strong relationships with the countries affected as they are our neighbours, this applies particularly to Indonesia. A strong sense of responsibility is felt by the general public and our Government to do all that we can to help the affected areas get back on their feet. Australia is one of the more financially prosperous nations in the region and feel we need to take a broad responsibility in this disaster. Other nations would not feel as compelled to donate large amounts to these areas for one reason or another, which is totally acceptable. I doubt if a disaster like this occured in Europe Australia's response would be as large. It's simply geographical and relationship strength factors coming into play.\n \n I've also heard people saying that the US response has been less than adequete. I'm not sure whether they consider the amount it costs to send planes, ships, helicopters and marines to these regions, or the vital role these forces play. Australia too has dispatched warships, choppers, planes and servicemen to Acech.\n \n If people want to get on someones back about levels of donation, which in my opinion they shouldn't in the first place, why not Saudi Arabia, or even Al-Qaeda? Afterall Indonesia has been the hardest hit country, and it does have the largest concerntration of Muslims in the world. Our Defence Minister actually had to call off a visit to the area because of threats that a terrorist movement had moved into the region and would be targeting Australian, and other international helicopters. Now that's sad.", 
   {}, 
   85513, 
   null, 
   1105193640.0
  ], 
  [
   85726, 
   null, 
   "Toxey", 
   "It's never a good sign economically when a superpower like the US has a hard time scraping up a lousy billion dollars for the worst natural disaster in modern history. We resorted to sending a couple of ex-Presidents out door to door to raise money from the private sector because apparently we've become officially \"tapped out\" at the Federal level. It's probably better that way, at least we have a say in where the money's going.\n\n \n \n We had 3 Cat 3 and 4 hurricanes hit the USA this year,one running up my back yard.\n Do you see any other country offering relief??\n It seems odd that when the rest of the world has a calamity everyone looks to the the good ole' USA to save them,and when they do offer help,its scoffed at by the rest of the world.\n When are some of the other countries gonna offer a little releif towards us,,,,,,,never!!!!!", 
   {}, 
   85513, 
   null, 
   1105331520.0
  ], 
  [
   85741, 
   null, 
   "georged", 
   "We had 3 Cat 3 and 4 hurricanes hit the USA this year,one running up my back yard.\n Do you see any other country offering relief??\n It seems odd that when the rest of the world has a calamity everyone looks to the the good ole' USA to save them,and when they do offer help,its scoffed at by the rest of the world.\n When are some of the other countries gonna offer a little releif towards us,,,,,,,never!!!!!\n\n \n People and businesses in Florida are required to carry disaster insurance through private carriers, additional disaster insurance through a state disaster fund and Florida has legislation in place that allows increases in property taxes to cover reconstruction not covered by private and public insurance. \n \n You're referring to US areas with established patterns of severe weather and geographical disruptions, flood plains, earthquakes and tornadoes, where people are well aware of the dangers and choose to live there in spite of those dangers. Comparing established patterns to a tsunami is apples to oranges.", 
   {}, 
   85726, 
   null, 
   1105371300.0
  ], 
  [
   85861, 
   null, 
   "Waxy", 
   "Canada started out with 3 million and the n 33 million now 67 miilion dollars for relief in asia from the disaster.\n Big whoopie,,,,Why dont you get off your a$$ and really help!!!!!!!!!!!!!!\n\n \n One thing in the Bible, in the teachings of Jesus, that I clearly remember from my childhood, and that he really nailed IMHO, was his views on charity. \n \n I remember quite clearly Jesus' stong distaste for the gaudy displays of charity strictly for the purpose of appearing charitable or seeking reward for such generosity, while at the same time, his admiration for those that give all they can, while not seeking any recognition or reward.\n \n Perhaps you could learn a little something from those teachings, whether you're a Christian or not.\n \n If that's not your cup of tea, perhaps learning some simple mathematics would suffice. emoticon_rolleyes \n \n At any rate, with such strong views, I trust that you've made a large donation personally, I applaud you if you have, otherwise, you'd simply be blowing smoke. \n \n Waxy", 
   {}, 
   84706, 
   null, 
   1105405320.0
  ], 
  [
   85863, 
   null, 
   "Waxy", 
   "We had 3 Cat 3 and 4 hurricanes hit the USA this year,one running up my back yard.\n Do you see any other country offering relief??\n It seems odd that when the rest of the world has a calamity everyone looks to the the good ole' USA to save them,and when they do offer help,its scoffed at by the rest of the world.\n When are some of the other countries gonna offer a little releif towards us,,,,,,,never!!!!!\n\n \n Relief is given to those that need it. See George's reply.\n \n My memory may be going, but it seems to me that Canadians among many others have given relief in many forms over the years, especially during and immediately post 9/11.\n \n Maybe your memory is going.\n \n Waxy", 
   {}, 
   85726, 
   null, 
   1105405440.0
  ], 
  [
   85919, 
   null, 
   "jim's trucking", 
   "Now come on Jim, how many times did we all hear that Abu Ghraib, was no worse then a frat house\nI heard it 16 times, counting the times I said it myself.", 
   {}, 
   85481, 
   null, 
   1105452420.0
  ], 
  [
   85954, 
   null, 
   "USA allthe Way", 
   "It's never a good sign economically when a superpower like the US has a hard time scraping up a lousy billion dollars for the worst natural disaster in modern history. We resorted to sending a couple of ex-Presidents out door to door to raise money from the private sector because apparently we've become officially \"tapped out\" at the Federal level. It's probably better that way, at least we have a say in where the money's going.\n\n \n \n thats all well and good, NOW lets see them go out stomping for the aged in this country who decide on whetherthey are going to buy their medicines or a loaf of bread.\n \n Lets see them go stomping to find a way for Americans that cant afford to buy medical insurance have some.\n \n Lets see them go stomping for any American in need!!", 
   {}, 
   85513, 
   null, 
   1105463100.0
  ], 
  [
   85959, 
   null, 
   "jskufan", 
   "thats all well and good, NOW lets see them go out stomping for the aged in this country who decide on whetherthey are going to buy their medicines or a loaf of bread.\n \n \n\n \n Who are these \"aged\" and why do they have no money saved for retirement? Was the idea of saving for retirement different fifty years ago than it is for today's workers?", 
   {}, 
   85954, 
   null, 
   1105465140.0
  ], 
  [
   85960, 
   null, 
   "georged", 
   "thats all well and good, NOW lets see them go out stomping for the aged in this country who decide on whetherthey are going to buy their medicines or a loaf of bread.\n \n Lets see them go stomping to find a way for Americans that cant afford to buy medical insurance have some.\n \n Lets see them go stomping for any American in need!!\n\n \n Simply divert the money being spent on the Iraq folly, about $7-billion a month, to solve some of those problems. Unless, of course, one has swallowed the bait on the spending of that money is 'protecting our nation', 'humanitarian assistance' or other such deceit.", 
   {}, 
   85954, 
   null, 
   1105465200.0
  ], 
  [
   85973, 
   null, 
   "Waxy", 
   "I'm proud to say the Canadian gov't has upped the ante to 450 million, the 5th highest total of any nation.\n \n Personally, I think we should spend some of that money on our own military so that we don't have to wait and borrow planes from the Russians next time to get our troops and aid there. Pathetic.\n \n Waxy", 
   {}, 
   85960, 
   null, 
   1105468080.0
  ], 
  [
   85979, 
   null, 
   "jim's trucking", 
   "I'm proud to say the Canadian gov't has upped the ante to 450 million, the 5th highest total of any nation.\n \n Personally, I think we should spend some of that money on our own military so that we don't have to wait and borrow planes from the Russians next time to get our troops and aid there. Pathetic.\n \n Waxy\nYou bring up a good point. I don't know that the US contribution figure includes the cost of the ships, planes, helicopters, loaders, trucks, fuel, maintenance, feeding the personnel, etc. being used in the effort. That the personnel involved are not being taken away from anything but training exercises (which would cost just about as much except for the distributed goods) should mean that their value is not included in the total US figure.\n \n I'm not keen on judging people or countries according to their relative contributions. In the case of charity and relief efforts, I think the communist doctrine is appropriate...to each according to their needs, from each according to their ability.\n \n As Andrew Young said last night in an interview, the 4 billion or so that is pledged so far is a drop in the bucket compared to the projected cost of recovery. We've had that much damage from hurricanes last year and it doesn't even come close to the devastation the tsunami brought to those people.", 
   {}, 
   85973, 
   null, 
   1105470600.0
  ], 
  [
   85980, 
   null, 
   "georged", 
   "I'm proud to say the Canadian gov't has upped the ante to 450 million, the 5th highest total of any nation.\n \n Personally, I think we should spend some of that money on our own military so that we don't have to wait and borrow planes from the Russians next time to get our troops and aid there. Pathetic.\n \n Waxy\n\n \n As pointed out, US planes are tied up in the world's largest humanitarian effort, converting Iraq to democracy whether they like it or not.", 
   {}, 
   85973, 
   null, 
   1105470660.0
  ], 
  [
   85982, 
   null, 
   "jim's trucking", 
   "As pointed out, US planes are tied up in the world's largest humanitarian effort, converting Iraq to democracy whether they like it or not.\nYou are such a misguided, bitter person. Where do you get your \"facts\"?", 
   {}, 
   85980, 
   null, 
   1105470780.0
  ], 
  [
   85983, 
   null, 
   "georged", 
   "You are such a misguided, bitter person. Where do you get your \"facts\"?\n\n \n I'm very bitter about Iraq, as any sensible person would be. Facts? are we not instilling democracy in Iraq based on a humanitarian rationale after the WMD facade collapsed?", 
   {}, 
   85982, 
   null, 
   1105471140.0
  ], 
  [
   85989, 
   null, 
   "jim's trucking", 
   "I'm very bitter about Iraq, as any sensible person would be. Facts? are we not instilling democracy in Iraq based on a humanitarian rationale after the WMD facade collapsed?\nMany sensible people oppose your views. \n \n \n Facts:\n \n Our airplanes are not tied up in Iraq. They never were. Only a small fraction of our air power was used in Iraq at any one time. Cargo planes have been available throughout the whole thing for other uses. The fighters and bombers will likely NOT be used in the tsunami relief effort.\n \n Our goal to liberate Iraq was based on the need to remove Saddam Hussien. Only part of the reason was the erroneous belief that he still had the WMDs. The fact that we believed he had them was largely his own fault. The humanitarian goal was always there. Bill Clinton signed a bill in 1998 making it our goal to liberate the Iraqi people.\n \n How many times must you beat a dead horse to be convinced it's not going to move?", 
   {}, 
   85983, 
   null, 
   1105471980.0
  ], 
  [
   85996, 
   null, 
   "georged", 
   "How many times must you beat a dead horse to be convinced it's not going to move?\n\n \n In your case, I won't bother. Your misguided patriotism is still locked onto what's presented to you by a self-serving administration too egotistical to admit glaring errors in domestic and foreign policy. We'll just have to agree to disagree and save bandwidth.", 
   {}, 
   85989, 
   null, 
   1105473480.0
  ], 
  [
   86005, 
   null, 
   "jim's trucking", 
   "In your case, I won't bother. Your misguided patriotism is still locked onto what's presented to you by a self-serving administration too egotistical to admit glaring errors in domestic and foreign policy. We'll just have to agree to disagree and save bandwidth.\nJust like Jack said, you can't stand the truth!\n \n I haven't claimed the administration to be faultless. Very few administrations have admitted wrong doing and most have thought their policies were correct regardless of the outcome. One can easily find fault with them all.\n \n The obvious reduction in moral standards under Slick Willy Clinton is paramount in the misguided illusion that GWB is evangelical driven by church doctrine. We went from Ronald Reagan, who refused even to enter the Oval Office without a coat and tie, to William Jefferson Clinton who got blow jobs from interns while keeping visiting dignataries waiting. So opposite appear the parties that even Hillary is now claiming to be a evangelical Christian in hopes of winning back the votes her hubby drove away from the Democrats.\n \n Domestic policy is more important to me than foriegn policy as long as we keep the big guns, even though sometimes the foriegn policy affects domestic tranquility more than does domestic policy.", 
   {}, 
   85996, 
   null, 
   1105475820.0
  ], 
  [
   86009, 
   null, 
   "Waxy", 
   "Only part of the reason was the erroneous belief that he still had the WMDs. \n\n \n Did I read this right? emoticon_wow :p \n \n Waxy", 
   {}, 
   85989, 
   null, 
   1105477560.0
  ], 
  [
   86016, 
   null, 
   "jim's trucking", 
   "Did I read this right? emoticon_wow :p \n \n Waxy\nI can't be sure. Facts are: He had them at one time. He led the world to believe he still had them. We believed he still had them. He evidently hid them well or shipped them off to Syria or some other \"friendly\" terrorist nation. They cannot be found.\n \n Our only error was believing that he still had them. Based on the fact that he wanted us and the world to believe he still had them, I think it's an excusable mistake to have assumed he did.\n \n They are still unaccounted for.", 
   {}, 
   86009, 
   null, 
   1105478700.0
  ], 
  [
   86362, 
   null, 
   "Toxey", 
   "People and businesses in Florida are required to carry disaster insurance through private carriers, additional disaster insurance through a state disaster fund and Florida has legislation in place that allows increases in property taxes to cover reconstruction not covered by private and public insurance. \n \n You're referring to US areas with established patterns of severe weather and geographical disruptions, flood plains, earthquakes and tornadoes, where people are well aware of the dangers and choose to live there in spite of those dangers. Comparing established patterns to a tsunami is apples to oranges.\n\n While your paragraph on Floridas insurance policies was very informative.None of it relates to me.I do not live in Florida.\n As for 'established patterns of severe weather',there are not many if any places in the USA that are not affected by at least one of your named natural dissasters.\n \"Comparing established patterns to a tsunami is apples to oranges.\"\n Are you really trying to make me beleive that these people never heard of a tsunami ?And never thought that they could be hit by one?", 
   {}, 
   85741, 
   null, 
   1105589040.0
  ], 
  [
   86367, 
   null, 
   "georged", 
   "While your paragraph on Floridas insurance policies was very informative.None of it relates to me.I do not live in Florida.\n As for 'established patterns of severe weather',there are not many if any places in the USA that are not affected by at least one of your named natural dissasters.\n \"Comparing established patterns to a tsunami is apples to oranges.\"\n Are you really trying to make me beleive that these people never heard of a tsunami ?And never thought that they could be hit by one?\n\n \n Crescent City, CA is the only mainland US city I'm aware of that's ever experienced a tsunami that totaled the area flat on its back. Their first, in recorded times, brought forth the knowledge to some Americans that how earth's under ocean crust plates settle, unlike damaging weather patterns, is mostly an unknown science. As far as I know, other than immediate US and Japanese offshore earthquake faults, little other of the planet's under ocean crust is specifically monitored for disturbance levels. It was a real surprise; unlike living near a coast where hurricanes are the norm, tornado alley or in CA, where onshore earthquakes occur on a frequent basis.", 
   {}, 
   86362, 
   null, 
   1105589940.0
  ], 
  [
   86371, 
   null, 
   "Toxey", 
   "You bring up a good point. I don't know that the US contribution figure includes the cost of the ships, planes, helicopters, loaders, trucks, fuel, maintenance, feeding the personnel, etc. being used in the effort. That the personnel involved are not being taken away from anything but training exercises (which would cost just about as much except for the distributed goods) should mean that their value is not included in the total US figure.\n \n I'm not keen on judging people or countries according to their relative contributions. In the case of charity and relief efforts, I think the communist doctrine is appropriate...to each according to their needs, from each according to their ability.\n \n As Andrew Young said last night in an interview, the 4 billion or so that is pledged so far is a drop in the bucket compared to the projected cost of recovery. We've had that much damage from hurricanes last year and it doesn't even come close to the devastation the tsunami brought to those people.\n\n \n \n The United States has spent $78 million of the $350 million it has pledged to the relief effort, according to Administrator Andrew Natsios of the U.S. Agency for International Development (USAID), who spoke to reporters at a briefing in Geneva. With more than 14,000 military personnel and scores of U.S. aircraft and ships taking part, the daily cost of the U.S. military contribution is estimated to be more than $5 million a day, in addition to the $350 million commitment, Natsios said.\n http://www.allamericanpatriots.com/m-news+article+storyid-4421-PHPSESSID-2563bf38f9101c6fc19fb7eaf6d0b409.html", 
   {}, 
   85979, 
   null, 
   1105590900.0
  ], 
  [
   86375, 
   null, 
   "jskufan", 
   "\n Domestic policy is more important to me than foriegn policy as long as we keep the big guns, even though sometimes the foriegn policy affects domestic tranquility more than does domestic policy.\n\n \n Why don't you bring us all up to speed on these \"domestic policies\" you're celebrating. As far as the \"big guns\" you want to preserve, you might want to study up a little on what's going on in economically progressive countries like China. Big guns cost money, shrinking economies like ours can't keep sustaining large military budgets indefinitely. At least China realizes that they need to grow their economy if they want to increase military spending.", 
   {}, 
   86005, 
   null, 
   1105591260.0
  ], 
  [
   86452, 
   null, 
   "jim's trucking", 
   "Why don't you bring us all up to speed on these \"domestic policies\" you're celebrating. As far as the \"big guns\" you want to preserve, you might want to study up a little on what's going on in economically progressive countries like China. Big guns cost money, shrinking economies like ours can't keep sustaining large military budgets indefinitely. At least China realizes that they need to grow their economy if they want to increase military spending.\nI don't recall saying I'm celebrating anything domestic or foriegn. The tax cuts are good. The free prescription drug policies are bad. The Patriot Act is good and bad. The environmental policies are inefficient. The give-away social programs are good and bad.\n \n My statement was that domestic policies are more important than foriegn policies as long as we have the big guns (the ability to defend our people and interests against all who would harm them). That's all I said.", 
   {}, 
   86375, 
   null, 
   1105639500.0
  ], 
  [
   86456, 
   null, 
   "Waxy", 
   "The United States has spent $78 million of the $350 million it has pledged to the relief effort, according to Administrator Andrew Natsios of the U.S. Agency for International Development (USAID), who spoke to reporters at a briefing in Geneva. With more than 14,000 military personnel and scores of U.S. aircraft and ships taking part, the daily cost of the U.S. military contribution is estimated to be more than $5 million a day, in addition to the $350 million commitment, Natsios said.\n http://www.allamericanpatriots.com/m-news+article+storyid-4421-PHPSESSID-2563bf38f9101c6fc19fb7eaf6d0b409.html\n\n \n Only 350 million? That's it? From the richest nation in the world? Why doesn't the US get off it's duff and donate real money like Canada did (450 million)? emoticon_rolleyes :p :p \n \n That was fun. :p \n \n I could go on, but my first post here and my general attitude towards charity and situtations like this, which is much along the lines of jim's truckings', will have me stopping here.\n \n Waxy", 
   {}, 
   86371, 
   null, 
   1105640040.0
  ], 
  [
   86591, 
   null, 
   "jskufan", 
   "I don't recall saying I'm celebrating anything domestic or foriegn. The tax cuts are good. The free prescription drug policies are bad. The Patriot Act is good and bad. The environmental policies are inefficient. The give-away social programs are good and bad.\n \n My statement was that domestic policies are more important than foriegn policies as long as we have the big guns (the ability to defend our people and interests against all who would harm them). That's all I said.\n\n \n Jim, that's what I was eluding to. Most people are hard pressed to elaborate on anything domestic that has been implemented over the last 4 years, that enhances the long term health of our economy. The tax cut is well known, the effects are not so clear, none the less, I'm always for a tax cut: just follow it up with some responsible spending. We can only keep the giant military machine going by keeping the economy growing. Once the money quits rolling in, defense spending will be a luxury we wont be able to afford. It's simply a very large \"expense\" item on our shaky balance sheet.", 
   {}, 
   86452, 
   null, 
   1105664160.0
  ], 
  [
   86604, 
   null, 
   "pnac=ww3", 
   "All this talk about how much each country donated, but no one is talking about how much they personally donated to the relief effort. Usually, these personal donations come with no strings attached.\n \n Me? I have donated zero dollars. I came pretty close to buying a $12 pound of Starbucks so they would donate $1, but I already had plenty of coffee.\n \n Then again, I always think I'm strapped for cash. \n Compared to someone in Cuidad Juarez, Mexico I'm a damned millionaire,\n but here, I'm just an average joe. I never think I have enough money,\n much less to donate to someone on the other side of the globe.\n \n It's really hard for me to throw a twenty into the bin and get nothing for it except a warm fuzzy feeling. And I never get the fuzzy feeling.\n \n I don't remember Starbucks taking donations during the Bam earthquake, but the tsunami is 5 times worse. I wonder how much the US donated to Bangladesh in 1970, which was 5 times worse than the recent tsunami.\n \n I think George Harrison made an album and donated the proceeds, but surely they didn't come to $350 million.\n \n Here are a few \"recent\" natural disasters that were worse than the current one and I don't remember all the hubbub that we are throwing into the tsunami thing. The post-9/11 world is wierd!!\n \n http://www.scaruffi.com/politics/disaster.html\n \nChina, 1960: Famine (20 million dead)\n Bangladesh, 1970: Sea flood (200-500,000 dead)\n Vietnam, 1971: Red River flood (100,000 dead)\n Ethiopia, 1974: famine (200,000 dead)\n Tangshan, China, 1976: 8.0 earthquake (242,000 dead)\n Ethiopia, 1984: Famine (900,000 dead) *there was a big deal made about this\n Bangladesh, 1991: tsunami (138,000 dead)\n North Korea, 1995-98: Famine and floods (3.5 million dead)\n \n", 
   {
    "post_info": {
     "post_title": "How much have you personally donated?"
    }
   }, 
   86591, 
   null, 
   1105665600.0
  ], 
  [
   86610, 
   null, 
   "daewoo", 
   "All this talk about how much each country donated, but no one is talking about how much they personally donated to the relief effort. Usually, these personal donations come with no strings attached.\n \n Me? I have donated zero dollars. I came pretty close to buying a $12 pound of Starbucks so they would donate $1, but I already had plenty of coffee.\n \n\n \n I, too, have donated 0 dollars. This is not because I am particularly strapped for cash, I just don't care about the tsunami. Lot of folks are dead, homeless, etc... They will work it out......or not.\n \n At one time, I may very possibly have donated some money, most likely though my church. Anymore, though, there is no point or need. The Us Government, in its infinite wisodom, has already decided to force donations by giving our tax dollars to the effort.\n \n I didn't know about the starbucks deal. Unfortunatly, I prefer Folgers.", 
   {}, 
   86604, 
   null, 
   1105667100.0
  ], 
  [
   86629, 
   null, 
   "georged", 
   "Jim, that's what I was eluding to. Most people are hard pressed to elaborate on anything domestic that has been implemented over the last 4 years, that enhances the long term health of our economy. The tax cut is well known, the effects are not so clear, none the less, I'm always for a tax cut: just follow it up with some responsible spending. We can only keep the giant military machine going by keeping the economy growing. Once the money quits rolling in, defense spending will be a luxury we wont be able to afford. It's simply a very large \"expense\" item on our shaky balance sheet.\n\n \n Tax cut results are very clear. General accounting books them as lost revenue, while expenses continue to accumulate far beyond existing revenue.\n Accounting 101 teaches any beancounter that when expenses exceed revenue, new revenue or capital is required. If debt is employed to supplement a lack of revenue or fresh capital, the ability to service that debt will become the sole objective of the entity until revenue increases or the entity is declared to be no longer a going concern. \n \n If anyone has looked at 2005/6 US budgets, most people are tuned into whatever network viewing provides, the thrust is to reduce state revenue sharing by pushing federal entitlement spending down to state levels to allow increases in military spending. There are no projections for increased federal tax revenue (which is the intent of tax cuts), reduction in federal government spending or reduction in trade imbalance, the latter rapidly removing our national wealth. Incidentally, Iraq funding is not included in any budget, Those are budget supplements, never to be seen by the general public except as debt service buried in past military costs. Bend over America, the politicians have a new insertion to keep you safe from their policies.", 
   {}, 
   86591, 
   null, 
   1105674600.0
  ], 
  [
   86652, 
   null, 
   "Leo", 
   "I'm proud to say the Canadian gov't has upped the ante to 450 million, the 5th highest total of any nation.\n \n Waxy\n\n \n I am not an Australian, so I am free to thump this particular tub without being accused of nationalism. :) \n \n Is anyone aware that Australia, a nation of 18 million, and one of the world's smaller economies, has donated one billion dollars, as well as committed a large number of army personnel, naval vessals, troop carriers, helicopters and fixed wing aircraft to the relief effort?\n \n Leo", 
   {}, 
   85973, 
   null, 
   1105693860.0
  ], 
  [
   86655, 
   null, 
   "Eddie", 
   "Here is an interesting take on the generosity of peoples and governments towards the tsunami-stricken in south-east asia:\n \n \"Humanitarian response to the 2004 Indian Ocean earthquake\" Wikipedia", 
   {}, 
   86652, 
   null, 
   1105713840.0
  ], 
  [
   86687, 
   null, 
   "Waxy", 
   "I am not an Australian, so I am free to thump this particular tub without being accused of nationalism. :) \n \n Is anyone aware that Australia, a nation of 18 million, and one of the world's smaller economies, has donated one billion dollars, as well as committed a large number of army personnel, naval vessals, troop carriers, helicopters and fixed wing aircraft to the relief effort?\n \n Leo\n\n \n I heard that Australia was leading the charge.\n \n I think they have a fairly big stake in the area in terms of their economy and tourism etc... \n \n Nonetheless, kudos to the Australians.\n \n Waxy", 
   {}, 
   86652, 
   null, 
   1105722780.0
  ], 
  [
   86692, 
   null, 
   "jim's trucking", 
   "I heard that Australia was leading the charge.\n \n I think they have a fairly big stake in the area in terms of their economy and tourism etc... \n \n Nonetheless, kudos to the Australians.\n \n Waxy\nAre you saying that their humanitarian effort may be driven by greed?", 
   {}, 
   86687, 
   null, 
   1105723560.0
  ], 
  [
   86697, 
   null, 
   "Waxy", 
   "Are you saying that their humanitarian effort may be driven by greed?\n\n \n No, I'm saying that they have a greater interest in, or perhaps better stated as a more direct connection to, what's going on in the affected areas. \n \n It's always easier to look after people you know and things you have a stake in than complete strangers and things that don't affect you. Australia, from what I understand has many ties, both social - the area affected is one of the favourite vacation spots of Australians - and economic/political with the countries in the region. It has nothing to do with greed.\n \n Did you give more money to the tsunami victims or the victims of 9/11?\n \n Are you more affected by the devastation of New York, or of some small village or beach resort in country that you can't find on a map and that you've never been to and likely will never go to?\n \n Perhaps self serving greed on the part of the Australians was the first thing that entered your mind, but it wasn't a part of my thoughts, I don't tend to think that way.\n \n Waxy", 
   {}, 
   86692, 
   null, 
   1105724460.0
  ], 
  [
   86702, 
   null, 
   "jim's trucking", 
   "...Perhaps self serving greed on the part of the Australians was the first thing that entered your mind, but it wasn't a part of my thoughts, I don't tend to think that way.\n \n Waxy\nWhy should asking a question be inferred as having an opinion regarding the answer?\n \n My first thought was that Australians are being generously philanthropic. Their motives are of secondary importance.\n \n Twas you that first presented the possiblilty of greed being the motive. I simply asked for clarification.", 
   {}, 
   86697, 
   null, 
   1105725840.0
  ], 
  [
   86708, 
   null, 
   "Waxy", 
   "Why should asking a question be inferred as having an opinion regarding the answer?\n \n My first thought was that Australians are being generously philanthropic. Their motives are of secondary importance.\n \n Twas you that first presented the possiblilty of greed being the motive. I simply asked for clarification.\n\n \n I didn't present the possibility of greed being the motive, I maybe didn't do the best job of wording or getting my thoughts across in my first post, but I didn't state in any way that Australia's motives were greed or self serving. Carefully read my post.\n \n It was you that interpreted from my post that greed was behind Australia's motives.\n \n The way I see it, the thought that greed was possibly the Australian's motive had to be in your mind, both to interpret my response as you did initially, and it was necessary IMHO, as the basis on which to formulate the question in the first place. Why ask that specific question if you don't have any thoughts on the matter? \n \n IMHO, you were looking to score some points by painting my post as suggesting that Australia's efforts were less valid than those of Canada, etc... based solely on your inference of what my post meant. You could just as easily have interpreted it as I went on to explain it. You didn't.\n \n Another pointless back and forth. emoticon_frazzled \n \n Waxy", 
   {}, 
   86702, 
   null, 
   1105727520.0
  ], 
  [
   86719, 
   null, 
   "jim's trucking", 
   "I didn't present the possibility of greed being the motive, I maybe didn't do the best job of wording or getting my thoughts across in my first post, but I didn't state in any way that Australia's motives were greed or self serving. Carefully read my post.\n \n It was you that interpreted from my post that greed was behind Australia's motives.\n \n The way I see it, the thought that greed was possibly the Australian's motive had to be in your mind, both to interpret my response as you did initially, and it was necessary IMHO, as the basis on which to formulate the question in the first place. Why ask that specific question if you don't have any thoughts on the matter? \n \n IMHO, you were looking to score some points by painting my post as suggesting that Australia's efforts were less valid than those of Canada, etc... based solely on your inference of what my post meant. You could just as easily have interpreted it as I went on to explain it. You didn't.\n \n Another pointless back and forth. emoticon_frazzled \n \n Waxy\nMay the spirit of Gregory Hines dance forever. Amen.", 
   {}, 
   86708, 
   null, 
   1105732620.0
  ], 
  [
   86720, 
   null, 
   "Waxy", 
   "May the spirit of Gregory Hines dance forever. Amen.\n\n \n Whatever. emoticon_rolleyes \n \n Waxy", 
   {}, 
   86719, 
   null, 
   1105732860.0
  ], 
  [
   86722, 
   null, 
   "jim's trucking", 
   "Hey, Waxy. It's okay to be vague now and then...happens to me all the time...doesn't mean you're a bad person.\n \n Try not to be so sinsative. :p", 
   {}, 
   86720, 
   null, 
   1105733220.0
  ], 
  [
   86841, 
   null, 
   "Toxey", 
   "Only 350 million? That's it? From the richest nation in the world? Why doesn't the US get off it's duff and donate real money like Canada did (450 million)? emoticon_rolleyes :p :p \n \n That was fun. :p \n \n I could go on, but my first post here and my general attitude towards charity and situtations like this, which is much along the lines of jim's truckings', will have me stopping here.\n \n Waxy\n\n That is only from the Government,not counting the estimated 5 million a day spent on military involvment in the disaster relief.Lets see,add 20 days in the area,that adds another 100 mil.Not counting the 250 mil or better in personal donations by Americans.Do you really think its gonna stop at that,,,pfhhhh.Not hardly\n Fact of the matter is,any Govt can pledge x mount of dollars ,its how much they really give is the true worth of their word.", 
   {}, 
   86456, 
   null, 
   1105765560.0
  ], 
  [
   86874, 
   null, 
   "georged", 
   "That is only from the Government,not counting the estimated 5 million a day spent on military involvment in the disaster relief.Lets see,add 20 days in the area,that adds another 100 mil.Not counting the 250 mil or better in personal donations by Americans.Do you really think its gonna stop at that,,,pfhhhh.Not hardly\n Fact of the matter is,any Govt can pledge x mount of dollars ,its how much they really give is the true worth of their word.\n\n \n And how they give it. With the exception of additional fuel and maintenance, negligible in big numbers, any military is a fixed cost.", 
   {}, 
   86841, 
   null, 
   1105813200.0
  ], 
  [
   86992, 
   null, 
   "Eddie", 
   "And how they give it. With the exception of additional fuel and maintenance, negligible in big numbers, any military is a fixed cost.\n\n \n But then again, so is much of the pledged humanitarian aid. Many governments who have given rather extraordinary amounts havn`t really changed their budgets in any significant way. They will only re-direct humanitarian aid from other projects.", 
   {}, 
   86874, 
   null, 
   1105895340.0
  ], 
  [
   87661, 
   null, 
   "Toxey", 
   "And how they give it. With the exception of additional fuel and maintenance, negligible in big numbers, any military is a fixed cost.\n\n \n So are you saying if the USA packed up their 5 million dollar a day military and left the area it would not affect the relief effort at all?", 
   {}, 
   86874, 
   null, 
   1106279040.0
  ], 
  [
   87664, 
   null, 
   "georged", 
   "So are you saying if the USA packed up their 5 million dollar a day military and left the area it would not affect the relief effort at all?\n\n \n There's nothing in it for us. As a soverign nation you don't provide financial assistance unless there's a quid pro quo in trade agreements. The populace who pays big taxes to the creditor nation would get upset if you gave their money away with no return on the investment. Not the general public, they don't know or care. I believe tiny Australia has interests there, top developed nation contribution is a statement. There are also a lot of affected Muslims not well-disposed about US humanitarian efforts such as Iraq.", 
   {}, 
   87661, 
   null, 
   1106280660.0
  ], 
  [
   87668, 
   null, 
   "daewoo", 
   "So are you saying if the USA packed up their 5 million dollar a day military and left the area it would not affect the relief effort at all?\n\n \n No, he is saying it wouldn't make any difference to us. The 5 million we are spending on the military is a static number. Whether we spend it on them ferrying humanitarian supplies, or spend it for them to sit on their butts at home, the same amount is spent (I would even argue against the \"fuel and maintenance\" aspect....aircraft get routine maintenance regardless and we burn more fuel in training exercises than we are on relief flights). \n \n Loaning out your military is like loaning out your bird dog. It doesn't cost you anything.\n \n \n \nThere's nothing in it for us. As a soverign nation you don't provide financial assistance unless there's a quid pro quo in trade agreements. \n \n \n I think you are forgetting the Japanese, who have been known to show up with a big bag of gold when needed, set it down, and walk away. As far as I know, they are the only nation on earth that sometimes provides aid money without expecting anything at all in return. \n \n most nations expect trade allowances. The US usually expects this and your children.", 
   {}, 
   87661, 
   null, 
   1106283420.0
  ], 
  [
   87813, 
   null, 
   "Toxey", 
   "Loaning out your military is like loaning out your bird dog. It doesn't cost you anything.\n\n \n I really dont care for your example of the United States military.Comparing these fine soldiers to a bird dog is a slap in the face to all REAL Americans.\n \n A better example would be to replace the bird dog with your son or your daughter!Because thats who are there,not DOGS!\n \n While you are pondering what the heck does this have to do with the original topic.These fine soldiers are putting their life on the line to help these people.\n American soldiers could die helping these people thru disease(spelling?),helicopter and plane crash,terrorist attacks.\n Not to mention our ships and planes sitcking out like a sore thumb,waiting to get destroyed by some nut ball terrorist.\n So,sure losing a bird dog might not cost you much,but what about one of your sons or daughters.", 
   {}, 
   87668, 
   null, 
   1106364960.0
  ], 
  [
   87817, 
   null, 
   "daewoo", 
   "I really dont care for your example of the United States military.Comparing these fine soldiers to a bird dog is a slap in the face to all REAL Americans.\n \n A better example would be to replace the bird dog with your son or your daughter!Because thats who are there,not DOGS!\n \n While you are pondering what the heck does this have to do with the original topic.These fine soldiers are putting their life on the line to help these people.\n\n \n Are you on crack? A little info from somebody who has been in the service and still has extensive ties there. First, our modern army is composed almost entirely of white trash. 95% of these \"fine soldiers\" could not get a job at wal mart, so they ended up in the military, because todays military will take about anybody and they pay better than McDonalds.\n \n Most of the time our military sits around and does nothing and gets paid for it. Even our training exercises are designed to keep people busy, not to actually \"train\" anybody, since the majority of our weapons sytems are now automated (which is how we get away with using XXXXXX as soldiers) and our communications allow the pentagon to make decisions at the squad level. The average IQ of an american soldier (excludig officers) is less than 85, which is pretty sad considering an IQ of 80 makes you legally retarded.\n \n So, PLEASE, keep your preaching about insulting these \"fine\" people to yourself. I have been there. I know all about these fine folks. If being a \"real american\" requires that you worhip that band of XXXXXX, I will pass.\n \n \n \nAmerican soldiers could die helping these people thru disease(spelling?),helicopter and plane crash,terrorist attacks.\n Not to mention our ships and planes sitcking out like a sore thumb,waiting to get destroyed by some nut ball terrorist.\n So,sure losing a bird dog might not cost you much,but what about one of your sons or daughters.\n\n \n None are going to die from disease. Theoreticallly they could die from a plane crashes. BUT, since the biggest killer of US soldiers is training accidents, even during times of war, logic would dictate that they are much safer assisting tsunami victims than being at home.\n \n Also, why would terorists attack our soldiers dunring the humanitarian mission, where they are mobile and hard to hit instead of here at home, or back at base, hwere they would be easy to hit? \n \n Our bases are hardened against mass attack, not individual infiltrators. IT would be incredibly simple for somebody to wander onto most US military bases and plant a bomb. Much harder to hit a military plane being guarded on a runway during a humanitarian mission.\n \n Have you ever acutually served i the military, or are your views here totally based on ignorance and propoganda (admittedly a potet combination).", 
   {}, 
   87813, 
   null, 
   1106368080.0
  ], 
  [
   87818, 
   null, 
   "Toxey", 
   "No I never served in the military.But someone who puts his or her life on the line for my country deserves my respect and admiration .\n Am I on crack????? No.\n From your bitter post,if you really were in the military ,I would guess that you were dishonerably dicharged.Hmmm,,,,maybe from smoking Crack?\n As for you still having extensive ties with the military.I have my doubts with this statement as well.Because if any of our Fine soldiers were to read your statements about them,they would kindly beat the cr@p out of you.", 
   {}, 
   87817, 
   null, 
   1106369460.0
  ], 
  [
   87820, 
   null, 
   "Toxey", 
   "Yall have a nice life.I cannot sit hear and read this cr@p anymore.\n While this site has some highly intelligent people and most are quite friendly,that last post is the last straw for me.\n You can wallow in your bitterness without me daewoo.\n Consider me a non-memberof this forum.", 
   {}, 
   87818, 
   null, 
   1106371080.0
  ], 
  [
   87823, 
   null, 
   "daewoo", 
   "No I never served in the military.But someone who puts his or her life on the line for my country deserves my respect and admiration .\n Am I on crack????? No.\n\n \n Who in the military is putting their life on the line for our country? Personally I think that this has a lot to do with the quality of recruit lately. At one time, joining the military and fighting for your country was an honorable thing. No longer are soldiers fighting for their country. I saw combat more than once in the US military. Once we were securing oil leases for US oil producers under the guise of fighting a humanitarian war, the other time we were ensuring DeBeers diamond cartel stayed intact under the guise of combating the slave trade. \n \n There is no honor in putting your life on the line for US corporate interests. There is no honor in putting your life on the line to \"liberate\" people and advance \"freedom\" in areas where they do not wish your \"gift\" (\"gifts\" that often include things like exemption from child labor laws and minimum wage laws for US corporations). Forcing democracy on people at the end of a gun is tyranny, regardless of how pure your motives may be.\n \n Our current crop of military personel is little more than a bunch of mercenaries. There is no particular honor in being a mercenary, especially if you have no control over what wars you become involved in or what causes you are willing to support.\n \n \nFrom your bitter post,if you really were in the military ,I would guess that you were dishonerably dicharged.Hmmm,,,,maybe from smoking Crack?\n\n \n Nope. I resigned my commission. I decided that if I was going to be a mercenary, there was no reason to be tied to the US military to do so when there are so many private companies out there that allow you to pick your wars (so you can actually attempt to fight on the side of \"right\" as opposed to fighting on whichever side best serves US corporate interests) and be a little more discriminating about the tactics you are willing to use (i.e you can choose not to torture people or level cities, or bomb civilians). I did that for 2 years, then used the money I made as a stake to start my own company (since in the private sector my skills were apparently worth in excess of $1000 per day as opposed to the $41,400.00 per year that the US military was willing to pay).\n \n \nAs for you still having extensive ties with the military.I have my doubts with this statement as well.Because if any of our Fine soldiers were to read your statements about them,they would kindly beat the cr@p out of you.\n\n \n Fortunately most of my ties are with upper echelon players as opposed to rank and file cannon fodder. Otherwise I would almost certainly pick another business. Fortunately, most of the military command structure seems to understand that our ground pounders anymore are largely XXXXXX with high tech toys. During desert storm, the joint chiefs were literally making decisions at the squad level. In many cases, they were relaying commands to individual vehicles. The current campaign is not that different. \n \n In short, yes, I can say they are XXXXXX, and I can say they are baby killing mercenaries because I have been there, done that. As you said, you have never served, and apparently have no military ties, so I stick to my original ascertation, that your opinion is entirely based on ignorance and propaganda. \n \n \nYall have a nice life.I cannot sit hear and read this cr@p anymore.\n While this site has some highly intelligent people and most are quite friendly,that last post is the last straw for me.\n You can wallow in your bitterness without me daewoo.\n Consider me a non-memberof this forum.\n\n \n I realise that truth born from experience is sometimes hard to take, but you don't have to run off. If you disagree, then debate the point (that is why this is a \"debate\" froum, not an \"everybody agree with the rediculous propoganda\" forum).\n \n I believe it was you who jumped down my throat about paying proper respect to our soldiers. Having been one of our soldiers, I can say that little tidbit definatly fits in the BS department. \n \n If you want to take your ball and go home, there's nothing I can do about it. There is a pretty good bunch of folks around here, so I would recommend that you not. I am not going to tailor my posts to make you happy, though, nor am I going to allow some little prig who has not ever served in the military sit and lecture me on proper respect for our troops wihtout responding.", 
   {}, 
   87818, 
   null, 
   1106375760.0
  ], 
  [
   87838, 
   null, 
   "georged", 
   "Yall have a nice life.I cannot sit hear and read this cr@p anymore.\n While this site has some highly intelligent people and most are quite friendly,that last post is the last straw for me.\n You can wallow in your bitterness without me daewoo.\n Consider me a non-memberof this forum.\n\n \n Supposedly, everyone in this country is allowed to have their own viewpoints and opinions. That's the free speech part of our governing system. You took the bird dog comment way out of context. It was made as a reference to facts; once anything, dog or soldier, is trained for a specific task, it exists to utilize that training, nothing else. For all practical purposes when not utilizing that training, all it does is eat, sleep, emit waste and reproduce. If that training can be put to use at any time at any task, it doesn't cost the owner anything extra because it still has to be fed.\n \n We now have a volunteer military solely because the manufacturing sector of our economy has declined due to competition and eliminated those former entry level jobs. Starting military pay and benefits, including food, clothing, shelter and education, have been increased to where our remaining service economy entry level jobs can't compete with military enlistment as a vocation. Instead of going to work at WalMart of a fast food franchise, try and support yourself on that, many young people with no intent or capability of continuing their education have opted for military enlistment.\n \n If you want to believe they're doing it solely for love of country or patriotism, not under command or facing prison for refusing to obey orders, you're certainly entitled to your opinion. But before condemning someone else's opinion of our military I suggest you research present problems the military is having with overall quality and recruitment of a volunteer military involved in an unjust war. If that doesn't open your eyes, open a forum topic on the subject and field posts, mine included, that will really shatter your illusions.", 
   {}, 
   87820, 
   null, 
   1106409600.0
  ], 
  [
   87853, 
   null, 
   "jim's trucking", 
   "Are you on crack? A little info from somebody who has been in the service and still has extensive ties there. First, our modern army is composed almost entirely of white trash. 95% of these \"fine soldiers\" could not get a job at wal mart, so they ended up in the military, because todays military will take about anybody and they pay better than McDonalds.\n \n Most of the time our military sits around and does nothing and gets paid for it. Even our training exercises are designed to keep people busy, not to actually \"train\" anybody, since the majority of our weapons sytems are now automated (which is how we get away with using XXXXXX as soldiers) and our communications allow the pentagon to make decisions at the squad level. The average IQ of an american soldier (excludig officers) is less than 85, which is pretty sad considering an IQ of 80 makes you legally retarded.\n \n So, PLEASE, keep your preaching about insulting these \"fine\" people to yourself. I have been there. I know all about these fine folks. If being a \"real american\" requires that you worhip that band of XXXXXX, I will pass.\n \n \n \n \n None are going to die from disease. Theoreticallly they could die from a plane crashes. BUT, since the biggest killer of US soldiers is training accidents, even during times of war, logic would dictate that they are much safer assisting tsunami victims than being at home.\n \n Also, why would terorists attack our soldiers dunring the humanitarian mission, where they are mobile and hard to hit instead of here at home, or back at base, hwere they would be easy to hit? \n \n Our bases are hardened against mass attack, not individual infiltrators. IT would be incredibly simple for somebody to wander onto most US military bases and plant a bomb. Much harder to hit a military plane being guarded on a runway during a humanitarian mission.\n \n Have you ever acutually served i the military, or are your views here totally based on ignorance and propoganda (admittedly a potet combination).\nI was going to take up for your use of the dog analogy and say that it had nothing to do with the relative worth of our military personnel. However, after reading the tripe you subsequently posted, I concluded that indeed it is you that is on crack. GFY!\n \n Without our honorable watchdogs, you would be dead already.", 
   {}, 
   87817, 
   null, 
   1106417520.0
  ], 
  [
   87858, 
   null, 
   "georged", 
   "I simply fail to understand why blind worship of virtually everything American now becomes a criterion for patriotism. Logic points out that anyone dumb enough to volunteer at the enlisted level to fight a war initiated on deceit and perpetuated under the guise of conceited morality is far from being the sharpest knife in the drawer. IQ numbers aren't required to make that determination.", 
   {}, 
   87853, 
   null, 
   1106419020.0
  ], 
  [
   87861, 
   null, 
   "jim's trucking", 
   "I simply fail to understand why blind worship of virtually everything American now becomes a criterion for patriotism. Logic points out that anyone dumb enough to volunteer at the enlisted level to fight a war initiated on deceit and perpetuated under the guise of conceited morality is far from being the sharpest knife in the drawer. IQ numbers aren't required to make that determination.\nI simply fail to understand why some people see any form of patriotism as blind worship.\n \n Any country that expects to survive long will have a military. Even the native tribes have their warriors who will defend the tribe from attackers. Countries need their military forces.\n \n If we get past that simple point, let's assume we should also agree that it's a dirty job but someone has to do it.\n \n To say that they are brave soldiers does not imply blind worship of the system but it does convey a bit of honor and high regard for those willing to stand in the line of fire to keep your XXX from being blown away or put in chains.\n \n The candy-assed chickens who slyly dodge military service actually do us all a favor by not participating. Their presense in a firefight would definitely be an albatross.\n \n The smug bastards that look on the military with disdain for any reason including some ill-gotten interpretation of its personnel's average IQ should take some time to learn what IQ really means relative to one's worth in society. High IQ has nothing to do with one's true worth.\n \n Read up and call me back when you have something correct to say.\n \n http://www.gnxp.com/MT2/archives/000382.html\n \n \n http://www.chron.com/content/chronicle/page1/98/03/16/iq.html\n \n \n http://www.isteve.com/IQhoax.htm\n \n \n http://www.isteve.com/\n \n \n http://www.snopes.com/politics/ballot/stateiq.asp", 
   {}, 
   87858, 
   null, 
   1106421300.0
  ], 
  [
   87868, 
   null, 
   "georged", 
   "What's your point? I don't consider volunteer enlisted ranks other than warrior lifers with any more respect than that due other employed people making their contributions to society. And I certainly don't classify respect or put them on various pedestal heights by occupation. If you have some conception that their station in life offers you more security than conscription including all sociodemographic population to defend our country, when we're actually attacked in a conventional manner, so be it.", 
   {}, 
   87861, 
   null, 
   1106423700.0
  ], 
  [
   87871, 
   null, 
   "jim's trucking", 
   "What's your point? I don't consider volunteer enlisted ranks other than warrior lifers with any more respect than that due other employed people making their contributions to society. And I certainly don't classify respect or put them on various pedestal heights by occupation. If you have some conception that their station in life offers you more security than conscription including all sociodemographic population to defend our country, when we're actually attacked in a conventional manner, so be it.\nWe seem to agree on one thought...all occupations are important.\n \n I said nothing regarding a comparison of volunteer and drafted forces. I know if we drafted people from all walks of life, the average IQ of the military would rise. That says absolutely nothing of the effectiveness of the military. A rise in IQ is not necessarily accompanied by better performance.\n \n I objected to daewoo's asinine statement about the military's being full \"white trash\" with lower IQs. You incorrectly took that as some sort of blind worship of the military and sounded to me as if you think we'd be better off without them. I am truly thankful for all the military, the police, the firemen, the garbage collectors, the parking lot attendants, the laundry workers, the miners, the truck drivers, the farmers, the ditchdiggers, the shoe salesmen and everybody else it takes to keep things happening. I do place a lot of value in a person who's willing to die so that I don't.", 
   {}, 
   87868, 
   null, 
   1106425200.0
  ], 
  [
   87873, 
   null, 
   "georged", 
   " I do place a lot of value in a person who's willing to die so that I don't.\n\n \n That's where mental capacity and sociodemographic standing as a value comes into play. If and when another sovereign nation attacked us in a physical manner, defense becomes the universal motivation. WW2 is the last example I'm aware of. I think it pretty low on the food chain to risk one's life by joining a military engaged in an unjust war. That's purely mercenary in nature, the best paying job for existing skills. Patriotic or not, middle and upper class America are certainly not encouraging their offspring to join the enlisted ranks of our volunteer military.", 
   {}, 
   87871, 
   null, 
   1106426760.0
  ], 
  [
   87884, 
   null, 
   "jskufan", 
   "When looking at the demographic make-up of our military, I think we almost have to look at two different groups of people. The first group were already enlisted prior to Iraq, and are simply fulfilling their obligation wherever that happens to take them. These people may or may not support our foreign policies, yet they honor their oath of service and follow leadership commands. The second group would be those that have enlisted post Iraq. These people were privy to our current foreign policy trends and obviously support this administration and their vision of spreading liberty and freedom in other countries since enlistment is volunteer. If we ever reach a point that a draft is necessary, and we start \"forcing\" people to serve, I think we'll get a much better idea of how many Americans are truly on board with this new role America has decided to play in dictating the world order.", 
   {}, 
   87873, 
   null, 
   1106434020.0
  ], 
  [
   87927, 
   null, 
   "Dono", 
   " The second group would be those that have enlisted post Iraq. These people were privy to our current foreign policy trends and obviously support this administration and their vision of spreading liberty and freedom in other countries since enlistment is volunteer. \n\n I agree in part, but many of the volunteers are being induced into service by the lack of job opportunities at home, enlistment bonuses, educational opportunities and a vigorous recruiting effort. Not all are related to \"support of the administration and their vision ......\". The declining number of reenlistments may force a draft to insure that we have sufficient cannon fodder to continue \"spreading liberty and freedom\".\n Dono", 
   {}, 
   87884, 
   null, 
   1106507760.0
  ], 
  [
   87938, 
   null, 
   "daewoo", 
   "I objected to daewoo's asinine statement about the military's being full \"white trash\" with lower IQs. You incorrectly took that as some sort of blind worship of the military and sounded to me as if you think we'd be better off without them. I am truly thankful for all the military, the police, the firemen, the garbage collectors, the parking lot attendants, the laundry workers, the miners, the truck drivers, the farmers, the ditchdiggers, the shoe salesmen and everybody else it takes to keep things happening. I do place a lot of value in a person who's willing to die so that I don't.\n\n \n Sorry. Been there. done that. If you are going to convince me that what I have witnessed first hand is incorrect, you are going to have to do better than that.\n \n Nobody is dying to secure your freedoms or to defend your life. Nobody has done that since WWII. If, indeed, the wars since then had been somehow related to the safety or security of the US and it population, we would be in dire straits, since we have lost every one, save the latest mess in Iraq, which we have neither won nor lost yet (jury is still out on that one). \n \n From a practical standpoint, the last purely defensive war we fought was the war of 1812. Even WWI and WWII were not fought to defend a direct threat to the US. Our best defense has always been the fact that we are on our own continent, with relatively underdeveloped neighbors on either side. The world wars we fought because we could perceive a time in the future where they could become a direct threat to America (preemptive war). At the end of the day, nobody in the current military is directly defending the United states. The Pacific and Atlantic oceans are doing that. We could have a military the size of Canada's and be just as safe from attack. I will go one step further and say that if we had a military the size of Canada's, we would be safer from attack, since our politicians and corporate interests would not feel so free to engage in amoral foreign policy decisions.\n \n \n \nWhen looking at the demographic make-up of our military, I think we almost have to look at two different groups of people. The first group were already enlisted prior to Iraq, and are simply fulfilling their obligation wherever that happens to take them. These people may or may not support our foreign policies, yet they honor their oath of service and follow leadership commands. The second group would be those that have enlisted post Iraq. These people were privy to our current foreign policy trends and obviously support this administration and their vision of spreading liberty and freedom in other countries since enlistment is volunteer. If we ever reach a point that a draft is necessary, and we start \"forcing\" people to serve, I think we'll get a much better idea of how many Americans are truly on board with this new role America has decided to play in dictating the world order.\n\n \n Immediately following 9/11 there was a rise in enlistment as a relatively small number of US citizens felt compelled to join up and fight the terrorists. It ended up lasting about a month. \n \n Enlistment has not changed that much. People are joining up because it pays better than wal mart and there is a certain segment of our population that glorifies military service (you see some of them here babbling on about \"honorable servicemen\" and \"defending our nation\" and \"....die so I don't have to\").\n \n If you are a poor piece of white trash whose likely path in life includes a series of dead end jobs, welfare checks, and no respect from anybody around you, the military option starts to look attractive.", 
   {}, 
   87871, 
   null, 
   1106510100.0
  ], 
  [
   87947, 
   null, 
   "jim's trucking", 
   "Sorry. Been there. done that. If you are going to convince me that what I have witnessed first hand is incorrect, you are going to have to do better than that.\n \n ....\nConvince me that you sampled the entire military. Likely, you were put with people of like nature, hence you couldn't help but notice the white trash and low IQs.", 
   {}, 
   87938, 
   null, 
   1106514180.0
  ], 
  [
   87960, 
   null, 
   "jskufan", 
   "Convince me that you sampled the entire military. Likely, you were put with people of like nature, hence you couldn't help but notice the white trash and low IQs.\n\n \n This discussion on the intelligence and character of today's military is getting a little personal and isn't really offering any concrete data worth noting. There are hundreds of thousands of Americans that make up our current fighting forces. We can't generalize on the profile ,as a whole, because there are a variety of reasons that people have enlisted. Not everyone is financially driven, so pay is not the only motivator. If it were, no one would join the Peace Corps., no one would teach school, and no one would do social work. Simply enlisting in the military doesn't make someone a model American, Leavenworth Prison is full of examples that prove that theory. I think it's safe to say that the vast majority of men and women that serve our country, for whatever reason, do it admirably. Our disagreements are not with the troops, they're with the political leadership whom they answer to.", 
   {}, 
   87947, 
   null, 
   1106516220.0
  ], 
  [
   87966, 
   null, 
   "georged", 
   "This discussion on the intelligence and character of today's military is getting a little personal and isn't really offering any concrete data worth noting. There are hundreds of thousands of Americans that make up our current fighting forces. We can't generalize on the profile ,as a whole, because there are a variety of reasons that people have enlisted. Not everyone is financially driven, so pay is not the only motivator. If it were, no one would join the Peace Corps., no one would teach school, and no one would do social work. Simply enlisting in the military doesn't make someone a model American, Leavenworth Prison is full of examples that prove that theory. I think it's safe to say that the vast majority of men and women that serve our country, for whatever reason, do it admirably. Our disagreements are not with the troops, they're with the political leadership whom they answer to.\n\n \n I feel you're comparing apples to oranges using peace corps, teachers and social workers to military enlisted rank volunteers. Most of the prior groups have strong personal motivation and normally advanced education prior to pursuing their ideals. With military pay and benefits far ahead of private industry, I'd be inclined to see a majority of current enlisted personnel doing so on a mercenary basis dictated by lack of workplace skills in a tight job market rather than pursuing personal ideals. \n \n Again, I have no objection to their choice of careers, everyone not born into wealth must be motivated by something, and I respect them for fulfilling their obligations to society. That they're currently commanded by an egotistical, secretive band of pirates isn't their fault.", 
   {}, 
   87960, 
   null, 
   1106517360.0
  ], 
  [
   87977, 
   null, 
   "daewoo", 
   "Convince me that you sampled the entire military. Likely, you were put with people of like nature, hence you couldn't help but notice the white trash and low IQs.\n\n \n \n Hmmm, I will take the fact that you haven't actually bothered to address any of the points raised, but instead opted for a rather poor cheap shot, as concession. \n \n \nAgain, I have no objection to their choice of careers, everyone not born into wealth must be motivated by something, and I respect them for fulfilling their obligations to society. That they're currently commanded by an egotistical, secretive band of pirates isn't their fault.\n\n \n I, too, have no problem with our current military personnel. You do what you can with what you've got, and if your economic, social, and educational background puts you in a position where the military is the best option you can find, you should certainly take it. \n \n My problem is with the folks who feel compelled to offer immediate and unreserved reverence to them. That is a dangerous mindset. If you immediately assume that everybody in uniform is an \"honorable defender of America\", or \"dying so that I don't have to\" or \"putting their life on the line for my freedoms\", you have effectively removed all accountability and responsibility from your military.\n \n It is a fascist mindset, which has been used to enslave more people than any other, and has allowed more governments to do more twisted, wrong things that I can even count. \n \n Even when the Italian army was slaughtering Italian citizens by the score, they were viewed as noble, honorable men defending their nation, because this is what the Italian people had been taught to believe. Same with the soviets. Even Hitler noted that \"in order to completely control you population you must convince them of the supremacy of your military and police personnel\".", 
   {}, 
   87947, 
   null, 
   1106521500.0
  ], 
  [
   87988, 
   null, 
   "jim's trucking", 
   "Hmmm, I will take the fact that you haven't actually bothered to address any of the points raised, but instead opted for a rather poor cheap shot, as concession.\n I concede nothing. I want to see some numbers that back up your ridiculous claims. You made the claim. Prove it. \n \n Tell me when and where you served, in what capacity and what your methods of identifying white trash are. Tell me where the 95% figure came from.\n \n I contend that you are totally (100%) full of yourself.", 
   {}, 
   87977, 
   null, 
   1106526840.0
  ], 
  [
   88002, 
   null, 
   "georged", 
   " \n \n Tell me when and where you served, in what capacity and what your methods of identifying white trash are. Tell me where the 95% figure came from.\n \n\n \n I know not one professional person who has children, friends or acquaintances serving in Iraq or the military at the volunteer enlisted level. Every article in our local newspaper regarding enlisted military personnel provides addresses (we're a small, safe town) that are considered financially well below the locales for lower middle class residences. I experienced the same circumstances living in a large city. I can't totally agree with the white trash statement as our military is now skewed way beyond normal percentages of population in favor of ethnic groups. How many people do you know in the volunteer military at enlisted level?", 
   {}, 
   87988, 
   null, 
   1106536260.0
  ], 
  [
   88029, 
   null, 
   "daewoo", 
   "I think you are probably correct in that I am overgeneralising when I say \"white trash\", as there is certainly a disporportionate number of minorities, especially blacks and mexicans, running around in the army.\n \n I went in as an officer, and thought that the army would be full of folks similar to the types I was used to dealing with in my ROTC unit. Boy was I surprised when I went regular army and met some of our \"honorable fighting men\"", 
   {}, 
   88002, 
   null, 
   1106559420.0
  ], 
  [
   88035, 
   null, 
   "Eddie", 
   "There's nothing in it for us. As a soverign nation you don't provide financial assistance unless there's a quid pro quo in trade agreements. The populace who pays big taxes to the creditor nation would get upset if you gave their money away with no return on the investment. Not the general public, they don't know or care. I believe tiny Australia has interests there, top developed nation contribution is a statement. There are also a lot of affected Muslims not well-disposed about US humanitarian efforts such as Iraq.\n\n \n While I agree that there is some truth to this statement, I think you are forgetting the dynamics of domestic politics. I don`t know about the US, but over here, governmental aid to catastrophe victims (as well as other forms of aid) has a political value. A politician not showing generosity (with my money ;)) when the public is expecting it (like now) looses political credability, gets harassed by the media and is attacked by the opposition. And conversely, a political leader showing generosity towards people in need can gain the affection of the public. I would say as a political leader, you don`t provide financial assistance unless you have something to gain. But it doesn`t necessarily have to be economic gain.", 
   {}, 
   87664, 
   null, 
   1106582640.0
  ], 
  [
   88037, 
   null, 
   "jim's trucking", 
   "I think you are probably correct in that I am overgeneralising when I say \"white trash\", as there is certainly a disporportionate number of minorities, especially blacks and mexicans, running around in the army.\n \n I went in as an officer, and thought that the army would be full of folks similar to the types I was used to dealing with in my ROTC unit. Boy was I surprised when I went regular army and met some of our \"honorable fighting men\"\nSo you decline to answer the questions. Instead you change your \"white trash\" characterization to one of \"ethnic trash\". You have not explained where the \"95% couldn't get a job at Wal-Mart\" came from. Did you make that figure up?\n \n ROTC you likely attended in college. Surely, you didn't expect the military to be full of former college students.\n \n When, where and in what capacity did you serve? (\"Officer\" doesn't define your duties.) I'm interested in how your experiences in the military enabled you to become so knowledgable of the entire system. Did you become a General or a Base Commander or a Battalion Leader or a Drill Sergeant? How were you exposed to enough soldiers to make an assessment of the general worth of the whole population.\n \n Your credibility is being questioned.", 
   {}, 
   88029, 
   null, 
   1106584080.0
  ], 
  [
   88039, 
   null, 
   "jim's trucking", 
   "I know not one professional person who has children, friends or acquaintances serving in Iraq or the military at the volunteer enlisted level. Every article in our local newspaper regarding enlisted military personnel provides addresses (we're a small, safe town) that are considered financially well below the locales for lower middle class residences. I experienced the same circumstances living in a large city. I can't totally agree with the white trash statement as our military is now skewed way beyond normal percentages of population in favor of ethnic groups. How many people do you know in the volunteer military at enlisted level?\nNot that it matters how many people I know, but I do know three families personally who have sons and daughters enlisted in the forces. I know several more who have officer children. I know several officers. Not a single one of these people is trash of any color. All the parents are professionals, living well above the poverty level. None of the soldiers I know are \"dumb\". The picture painted by daewoo is not valid.\n \n I've been to numerous military bases in various parts of the country and overseas. The general character of the populations I saw was definitely not as depicted in daewoo's derogatory post.\n \n If you think I'm wrong, present me with some facts and not some unsubstantiated \"statistics\".", 
   {}, 
   88002, 
   null, 
   1106584980.0
  ], 
  [
   88040, 
   null, 
   "lord tammerlain", 
   "While I agree that there is some truth to this statement, I think you are forgetting the dynamics of domestic politics. I don`t know about the US, but over here, governmental aid to catastrophe victims (as well as other forms of aid) has a political value. A politician not showing generosity (with my money ;)) when the public is expecting it (like now) looses political credability, gets harassed by the media and is attacked by the opposition. And conversely, a political leader showing generosity towards people in need can gain the affection of the public. I would say as a political leader, you don`t provide financial assistance unless you have something to gain. But it doesn`t necessarily have to be economic gain.\n\n \n \n Most assistance from Canada comes with strings attached as to where the items of aid are purchased. Food aid from Canada for the Tusnami 90% has to be sourced from Canada, with 10% being free and clear. Very few aid packages are totally given with out a side benifit to the giving country.\n \n However had not the Paul Martin not up the Canadian aid packages his political standing would have decreased quite abit. Especially considering the large number of ethnic groups in Canada that are from the affected areas. To my knowledge though none of the Canadian aid comes with a trade agreement clause. Which would be very distastefull.", 
   {}, 
   88035, 
   null, 
   1106585340.0
  ], 
  [
   88041, 
   null, 
   "georged", 
   "I think you are probably correct in that I am overgeneralising when I say \"white trash\", as there is certainly a disporportionate number of minorities, especially blacks and mexicans, running around in the army.\n \n\n \n Black - 21% - Army 25%, 33% of all senior sergeants and non-commissioned officers are Black.\n \n Hispanic - 14% (37,000 non-US citizen seeking citizenship conversion)\n \n Asian - negligible\n \n Black and Hispanic enlisted ranks are generally enlistment motivated to escape civilian sociodemographic conditions and statistically show a much higher rate of military career pursuit than Caucasian volunteers. Blacks and Hispanics also statistically display far lower death and wounded rates in Iraq than Caucasian volunteers. Both minority groups have a disproportionately low percentage of serving officers.", 
   {}, 
   88029, 
   null, 
   1106585760.0
  ], 
  [
   88048, 
   null, 
   "daewoo", 
   "So you decline to answer the questions. Instead you change your \"white trash\" characterization to one of \"ethnic trash\". You have not explained where the \"95% couldn't get a job at Wal-Mart\" came from. Did you make that figure up?\n\n \n Uh, I think to any thinking person it should be clear that the 95% number is my opinion, not a stiatistic I pulled out of a report somewhere. I am not sure how one would even calculate such a thing, unless you had ever private who enlisted in the military run by the local wally world and fill out an application. \n \n \nROTC you likely attended in college. Surely, you didn't expect the military to be full of former college students.\n\n \n Of course not. College gradutes are virtually unheard of outside of officer country. Somebody who goes through college is A--too smart and B--To valuable, to use as front line cannon frodder.\n \n \nWhen, where and in what capacity did you serve? (\"Officer\" doesn't define your duties.) I'm interested in how your experiences in the military enabled you to become so knowledgable of the entire system. Did you become a General or a Base Commander or a Battalion Leader or a Drill Sergeant? How were you exposed to enough soldiers to make an assessment of the general worth of the whole population.\n\n \n I was in the regular army for two years. a year of that was spent at frot benning, 8 months as a training officer (during that 8 months I got to interact with nearly 100,000 of the armys finest as they rotated in and out for training) and and 4 months on \"special assingment\" to WHINSEC (used to be called \"School of the Americas\"....it is where we train third world death squads and teach tyrants how to \"convince\" people to sign confessions using such noble techniques as electro shock and near drowning, which we called \"submersion assisted interrogation\").\n \n Personally, I found that rather tasteless, bringing people to the land of the free and the home of the brave and teaching them how to torture and \"disapear\" people, and how to rig elections by terrorising your population.\n \n It was then that I found out that there was a thriving market for former special forces guys, especially those who had seen combat, and that the pay was substantially higher than what the US army was offering. So, I went SF. I will admit that SF personel are certainly on a higher scale than your average enlisted grunt. I went with a group that I KNEW would show me some combat time (having served at WHINSEC, and interacted with all the thrid world tyrants, I knew which units we were sneaking off overseas to fight invisible wars in support of dictators and lunatics).", 
   {}, 
   88037, 
   null, 
   1106589780.0
  ], 
  [
   88050, 
   null, 
   "jim's trucking", 
   "Uh, I think to any thinking person it should be clear that the 95% number is my opinion, not a stiatistic I pulled out of a report somewhere. I am not sure how one would even calculate such a thing, unless you had ever private who enlisted in the military run by the local wally world and fill out an application.\nIn the future, please try to spare me the theatrical flair. \n \n \n ....", 
   {}, 
   88048, 
   null, 
   1106590320.0
  ], 
  [
   88055, 
   null, 
   "georged", 
   "Not that it matters how many people I know, but I do know three families personally who have sons and daughters enlisted in the forces. I know several more who have officer children. I know several officers. Not a single one of these people is trash of any color. All the parents are professionals, living well above the poverty level. None of the soldiers I know are \"dumb\". The picture painted by daewoo is not valid.\n \n I've been to numerous military bases in various parts of the country and overseas. The general character of the populations I saw was definitely not as depicted in daewoo's derogatory post.\n \n If you think I'm wrong, present me with some facts and not some unsubstantiated \"statistics\".\n\n \n I was under the impression that the discussion was centered on enlisted ranks. I know currently serving and retired general officers who are and were career people, I haven't met any that weren't since the Vietnam days, and they're all well educated and certainly had the choice of military service or civilian careers without personal economics being an issue. \n \n Anyone can Google for enlisted rank demographics and discover that 42% of the volunteer military hails from mostly Southern and two lower-Midwest states. Those states sustaining the heaviest economic damage by our manufacturing decline. When I grew up in Texas, lived in Georgia and extensively traveled the South, dirt poor mill workers and marginal farmers were commonly referred to as poor white trash by their economically advantaged peers. Remove the 35% minority enlistment and it should be obvious that the volunteer military ranks have a very high percentage of enlistments derived from those aforementioned economically depressed areas offering few, if any employment opportunities for unskilled and uneducated young people. \n \n I was also under the impression that to challenge a post consists of a statement of disagreement supported by referenced facts, allowing the original poster to refute the disagreement and references. 'Prove it' is reminiscent of children expressing frustrated emotion due to limited or lack of knowledge.", 
   {}, 
   88039, 
   null, 
   1106592180.0
  ], 
  [
   88057, 
   null, 
   "daewoo", 
   "I've been to numerous military bases in various parts of the country and overseas. The general character of the populations I saw was definitely not as depicted in daewoo's derogatory post\n\n \n In what capacity? How much time did you actually spend in the mud with the grunts? How many nights did you spend knocking abck cold ones with them in the local watering hole?\n \n I would guess \"none\"", 
   {}, 
   88055, 
   null, 
   1106592840.0
  ], 
  [
   88058, 
   null, 
   "jim's trucking", 
   "...\n I was also under the impression that to challenge a post consists of a statement of disagreement supported by referenced facts, allowing the original poster to refute the disagreement and references. 'Prove it' is reminiscent of children expressing frustrated emotion due to limited or lack of knowledge.\nIf a statement such as \"95% of them are XXXXXX\" is made, it is not up to me to search for verification of that or to prove that only 36% actually are XXXXXX. If a statistical claim is made, it should be verified by the person making the statement. Had it been presented unmistakedly as an opinion, I would not ask for proof...I would simply disagree and not worry about where the numbers came from.\n \n Each person's knowledge is limited in some way or another. Your knowledge of me is limited as is mine of you. I do perceive you to be a bitter, grouchy, obstinant, pompous homosapien. I'm sure you have some redeeming qualities and I'm relatively certain your mother loved you at one time or another.", 
   {}, 
   88055, 
   null, 
   1106593260.0
  ], 
  [
   88060, 
   null, 
   "jim's trucking", 
   "In what capacity? \nConsultant/Contractor\n \n \n How much time did you actually spend in the mud with the grunts?\nVery close to none.\n \n \n How many nights did you spend knocking back cold ones with them in the local watering hole?\nMany...very close to too many. ...and it wasn't just with the officers.\n \n \n\n I would guess \"none\"\nYou'd be nearly correct in one case and severely incorrect in the other. You may be aware that it's easier to learn people's convictions at the watering hole than it is in the mud.\n \n But, then again, maybe not.", 
   {}, 
   88057, 
   null, 
   1106593740.0
  ], 
  [
   88074, 
   null, 
   "Eddie", 
   "@ LT\n \n Yeah, I`m not saying that much aid isn`t provided to maximize the donor country`s benefit. I`m just questioning the idea that foreign aid is only given when it creates economic benefits for the donating country.", 
   {}, 
   88060, 
   null, 
   1106597460.0
  ], 
  [
   88077, 
   null, 
   "georged", 
   "@ LT\n \n Yeah, I`m not saying that much aid isn`t provided to maximize the donor country`s benefit. I`m just questioning the idea that foreign aid is only given when it creates economic benefits for the donating country.\n\n \n What country has that level of surplus wealth without generating at least a good portion of the tax base to replace it?", 
   {}, 
   88074, 
   null, 
   1106598120.0
  ], 
  [
   88081, 
   null, 
   "daewoo", 
   "Consultant/Contractor\n \n Very close to none.\n \n Many...very close to too many. ...and it wasn't just with the officers.\n \n You'd be nearly correct in one case and severely incorrect in the other. You may be aware that it's easier to learn people's convictions at the watering hole than it is in the mud.\n \n But, then again, maybe not.\n\n \n Just out of curiosity, what kind of consultant/copntractor? Both professions generally deal with decision makers and money handlers, and since enlisted men are allowed to do neither, it would seem that your contact with them would have been minimal.\n \n As far as the other (eaiser to learn about people in the watering hole than in the mud), I seriously doubt you can find a soldier on the planet who would agree with you. \n \n I also know that soldiers everywhere I have ever been have been far more open with other soldiers than with strangers or visitors.", 
   {}, 
   88060, 
   null, 
   1106599140.0
  ], 
  [
   88084, 
   null, 
   "jim's trucking", 
   "Just out of curiosity, what kind of consultant/contractor? \nI'm not authorized to say.\n \n \nBoth professions generally deal with decision makers and money handlers, and since enlisted men are allowed to do neither, it would seem that your contact with them would have been minimal.\nYou may be confusing our normal connotation of \"contractor\" with the military use of the word. We built nothing and provided no physical product. The only writing involved was in the original contract and scope of work. We were escorted, sometimes by a platoon of enlisted men, but most always by enlisted men. I met quite a few of them at many US bases and several abroad...and we all drank rather heavily at the end of each day, except for the guards who were not allowed to drink at all. My drinking with them was part of my job.\n \n \n \n\n As far as the other (eaiser to learn about people in the watering hole than in the mud), I seriously doubt you can find a soldier on the planet who would agree with you. \nWhen the whiskey flows, the inhibitions tend to disappear and the truth comes out. \n \n \n \n\n I also know that soldiers everywhere I have ever been have been far more open with other soldiers than with strangers or visitors.\nI agree. It's the same with Cajuns...you just can't infiltrate the family. If you spend a week or ten days with a group, you all get to trust each other to some degree or another. Some, I never got through to, but others opened up like a day lily.", 
   {}, 
   88081, 
   null, 
   1106600400.0
  ], 
  [
   88091, 
   null, 
   "Eddie", 
   "What country has that level of surplus wealth without generating at least a good portion of the tax base to replace it?\n\n \n How do you mean?", 
   {}, 
   88077, 
   null, 
   1106603160.0
  ], 
  [
   88095, 
   null, 
   "georged", 
   "How do you mean?\n\n \n Aid money is extended when a good portion of the aid returns to the donor country through purchases, reconstruction business or other future mutually acceptable transactions including non-tangible goodwill expected to eventually bear economic fruit by the receiver that help replenish that aid through commerce making tax base contributions to the contributor. Some countries put more strings on their aid than others.", 
   {}, 
   88091, 
   null, 
   1106603940.0
  ], 
  [
   88166, 
   null, 
   "Eddie", 
   "Aid money is extended when a good portion of the aid returns to the donor country through purchases, reconstruction business or other future mutually acceptable transactions including non-tangible goodwill expected to eventually bear economic fruit by the receiver that help replenish that aid through commerce making tax base contributions to the contributor. Some countries put more strings on their aid than others.\n\n \n I`ll take your word for it. But I don`t see how it relates to any of my statements. (could be my english failing me though)", 
   {}, 
   88095, 
   null, 
   1106653200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Where are you Canada", 
  "url": "http://www.4forums.com/political/current-events-debates/4043-where-you-canada.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 4043, 
  "discussion_files": [
   [
    "3041.html", 
    "http://www.4forums.com/political/current-events-debates/4043-where-you-canada-print.html"
   ], 
   [
    "3042.html", 
    "http://www.4forums.com/political/current-events-debates/4043-where-you-canada-7-print.html"
   ], 
   [
    "3043.html", 
    "http://www.4forums.com/political/current-events-debates/4043-where-you-canada-5-print.html"
   ], 
   [
    "3044.html", 
    "http://www.4forums.com/political/current-events-debates/4043-where-you-canada-4-print.html"
   ], 
   [
    "3045.html", 
    "http://www.4forums.com/political/current-events-debates/4043-where-you-canada-6-print.html"
   ], 
   [
    "3046.html", 
    "http://www.4forums.com/political/current-events-debates/4043-where-you-canada-3-print.html"
   ], 
   [
    "3047.html", 
    "http://www.4forums.com/political/current-events-debates/4043-where-you-canada-2-print.html"
   ]
  ], 
  "identifier": 4043
 }
]