[
 [
  [
   85486, 
   null, 
   "pnac=ww3", 
   "The current theory regarding the formation of the moon is a theory that says that the moon was formed when a large impactor, the size of Mars, intersected the early Earth's orbit, they smashed together and flung large amounts of debris into orbit around the planet newly formed by the impact. This debris coalesced to form The Moon.\n \n This theory explains why the moon behaves the way it does.\n \n It's slowly moving farther away from the Earth. This can be measured by laser.\n \n It explains why we only ever see one face of the moon.\n \n It explains why a rocky inner planet, such as the Earth, would have such a large single moon.\n \n Basically put, it explains exactly how the moon got here and why we see it behave the way it does now.\n \n It explains these things WAY better than Genesis does, which doesn't even mention anything about the orbit or rotation of the moon at all.\n \n Here is a paper that came out yesterday that further refines the theory, making it all the more plausible.\n http://arxiv.org/PS_cache/astro-ph/pdf/0405/0405372.pdf\n \n I'd like to hear why the Moon wasn't formed this way and why it's not <4 billion years old.", 
   {
    "post_info": {
     "post_title": "Giant impactor theory works best!"
    }
   }, 
   null, 
   null, 
   1105140780.0
  ], 
  [
   86773, 
   null, 
   "jim's trucking", 
   "Can you come up with something a bit more difficult to understand?", 
   {}, 
   85486, 
   null, 
   1105743420.0
  ], 
  [
   86788, 
   null, 
   "pnac=ww3", 
   "Sorry, the paper is quite long and quite technical.\n I should have put more general info.\n \n Here is a really nice page:\n http://starchild.gsfc.nasa.gov/docs/StarChild/questions/question38.html\n and another:\n http://www.xs4all.nl/~carlkop/moonfor.html\n \n If the moon took less than a year to form from the debris, that\n would have been pretty cool to watch. Well, pretty hot, maybe \n if we were standing on Earth at the time, we would have fried.\n \n Also, after it formed it was only 14,000 miles away \n (as opposed to 238,712 today). And the Earth day was only 14 hours.", 
   {}, 
   86773, 
   null, 
   1105750380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Giant impactor theory works best!", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4064-giant-impactor-theory-works-best.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 4064, 
  "discussion_files": [
   [
    "21551.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4064-giant-impactor-theory-works-best-print.html"
   ]
  ], 
  "identifier": 4064
 }
]