[
 [
  [
   86120, 
   null, 
   "duck", 
   "Embryonic stem cell research should be banned. It's a waste of time and money and it doesn't work. We should put all our money into stem cell research using only adult or umbilical cord stem cells. \n Stem cells are cells that can develop into any organ and originally were thought to exist only in embryos. So researchers had the choice of killing a baby, or finding one that was already dead from abortion, and using their stem cells to try to cure diseases. But when a stem cell from an embryo was put into another person, the immune system would attack the stem cells thinking that they were viruses. The scientific term for this is rejection. And the cells would only grow into tumors since embryonic cells are pre-programmed to form an entire body. \"The results were no successful treatments,\" said the National Catholic Register. \n So why are some scientists still researching embryonic stem cells? Elenor Schoen, Communications Director for Human Life of Washington said, \"They are actually exploring how the embryo's body works, not trying to find disease cures with the stem cells. Stem cell research monies give access to embryos.\" \n About five or six years ago it was discovered that every human being, old or young, has stem cells in their bodies. When your own stem cells are used to treat a disease there is no rejection problem. The National Catholic Register said, \"The results of adult stem cells are treatments for 56 diseases including breast cancer, and stroke.\" Stem cells have also been discovered in the blood of umbilical cords which are available after a birth.", 
   {
    "post_info": {
     "post_title": "almost everything I know about stem cells"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1105512960.0
  ], 
  [
   86144, 
   null, 
   "Jessica", 
   "Embryonic stem cell research should be banned. It's a waste of time and money and it doesn't work.\n\n \n Proof?\n \n \nSo researchers had the choice of killing a baby, or finding one that was already dead from abortion, and using their stem cells to try to cure diseases. \n\n \n Killing a baby? Oh, you mean using a frozen embryo that's going to be destroyed anyway. \n \n \n\"The results were no successful treatments,\" said the National Catholic Register. \n\n \n HA HA HA HA HA!!! The NCR, who are biased (understand that word?) and have reported LIES about abortion and sexual health for years. You poor thing - you're so ignorant you think this is evidence.\n \n Here's a new word for you duck: BIAS. Say it with me, don't be afraid: BIAS. Why don't you come back with some UNBIASED material and then we'll talk, OK?", 
   {
    "unicode_changes_made": true
   }, 
   86120, 
   null, 
   1105538760.0
  ], 
  [
   86394, 
   null, 
   "duck", 
   "proof?\n \n Why don't you try and find a single time of when embryos have worked. You could search for hours but you will not find one. mainly becasue doctors haven't dared to use the embryos on humans yet. They used them on rats and they grew things like teeth and hair inside their bodies. All we got was tumors. Which makes sense becasue embryonic stem cells are programmed to form an entire body. \n \n \nKilling a baby? Oh, you mean using a frozen embryo that's going to be destroyed anyway. \n \n Yes. That is exactly what I mean. It is very frightening to know that hundreds of thousands of babies are being frozen and used like lab mice.\n \n \nHA HA HA HA HA!!! The NCR, who are biased (understand that word?) and have reported LIES about abortion and sexual health for years. You poor thing - you're so ignorant you think this is evidence.\n \n \n Alright listen punk, if you find it to hard to talk without insulting me and my religion then I don't want you saying anything. And who told you that the NCR is biased?(besides plan parenthood). As I recall, I saw a picture of the Pope blessing the register. Now I'm pretty sure that the Pope is smart guy. A dumb person could not have helped end the cold war. Now, why would the pope bless a biaest paper. Don't even try to say the Pope is biased. I think YOUR the ignorant one. Why don't you come back with some evidence period. All I see is you making fun of me. \n And this for everybody else. Now I have seen a lot of nasty things insulting people. Most of them are insulting what I have dedicated my life too. If your not intelligent enough to actually debate, then just go away.:xcensored", 
   {}, 
   86144, 
   null, 
   1105603680.0
  ], 
  [
   86405, 
   null, 
   "Jessica", 
   "\n Alright listen punk, if you find it to hard to talk without insulting me and my religion then I don't want you saying anything. And who told you that the NCR is biased?(besides plan parenthood). \n\n \n Alright listen child, it's common sense. PP did NOT tell me it's biased, I worked that out for myself. There is a clear political agenda to any medical work carried out by the RCC. You clearly think PP is baised - please explain why you think THEY are but the RCC isn't.\n \n \n I saw a picture of the Pope blessing the register. Now I'm pretty sure that the Pope is smart guy. \n\n \n And?\n \n \nn could not have helped end the cold war. Now, why would the pope bless a biaest paper. Don't even try to say the Pope is biased. \n\n \n The Pope is biased. Next you're going to say he's not really Catholic.\n \n \nUR the ignorant one. Why don't you come back with some evidence period. All I see is you making fun of me.\n\n \n Evidence for what? I'm not making the claim here. I don't know a lot about stem cells so if you could prove from and INDEPENDENT source that it doesn't work and never will, then I will agree with you. Why don't you have a go?\n \n \n everybody else. Now I have seen a lot of nasty things insulting people. Most of them are insulting what I have dedicated my life too. \n\n \n I am not insulting what you've dedicated your life to. You want to live by that, off you go and be merry. You want to forced others to live by that, then we have a problem. You want to present any biased info as evidence and I will laugh at you.", 
   {}, 
   86394, 
   null, 
   1105625640.0
  ], 
  [
   86589, 
   null, 
   "duck", 
   "Alright listen child, it's common sense. PP did NOT tell me it's biased, I worked that out for myself. There is a clear political agenda to any medical work carried out by the RCC. You clearly think PP is baised - please explain why you think THEY are but the RCC isn't.\n \n First of all, its NCR. Second of all, I want to know why NCR is biased besides cause you said so. Thrid of all I'm not here to argue about PP. \n \n \nAnd?\n\n Read the rest of it.\n \n \nThe Pope is biased.\n \n The Pope is not biased and never has been. \n \n Next you're going to say he's not really Catholic.\n \n That doesn't even make any sense.\n \n \nEvidence for what? I'm not making the claim here. I don't know a lot about stem cells so if you could prove from and INDEPENDENT source that it doesn't work and never will, then I will agree with you. Why don't you have a go?\n \n \n Evidence that the Register is biased. You can't just throw it all away and say \"oh its biast, you can't use this.\" Tell me one thing that they have done that was Biased. Right now I don't have time to get more evidence. Mabye in my next post. \n \n If you are uncapable of prooving something and all you can do is sit there and laugh, then this debate is over.", 
   {}, 
   86405, 
   null, 
   1105664100.0
  ], 
  [
   86605, 
   null, 
   "Sigma", 
   " \n The Pope is not biased and never has been. \n \n That doesn't even make any sense.\n \n\n \n I think her point was that the pope is biased because he's catholic.", 
   {}, 
   86589, 
   null, 
   1105665660.0
  ], 
  [
   86608, 
   null, 
   "sinjin", 
   "The Pope not biased. Bwahahahahahaha!\n \n I'm from a Catholic family btw before you start.", 
   {}, 
   86605, 
   null, 
   1105666560.0
  ], 
  [
   86620, 
   null, 
   "duck", 
   "emoticon_mad Your defintely a horrible Catholic. And for the record, I'm from a bishop's family.", 
   {}, 
   86608, 
   null, 
   1105671420.0
  ], 
  [
   86621, 
   null, 
   "duck", 
   "I think her point was that the pope is biased because he's catholic.\n \n ohhhhhh. \n So all Catholics are biased? Am I the only one thinking that this is prejudice?", 
   {}, 
   86620, 
   null, 
   1105671600.0
  ], 
  [
   86623, 
   null, 
   "simone", 
   "So researchers had the choice of killing a baby, or finding one that was already dead from abortion, and using their stem cells to try to cure diseases.\nWhat the devil? Where did you get this idiotic information?", 
   {}, 
   86120, 
   null, 
   1105672080.0
  ], 
  [
   86696, 
   null, 
   "sinjin", 
   "emoticon_mad Your defintely a horrible Catholic. And for the record, I'm from a bishop's family.\n\n \n Agreed. emoticon_xangel", 
   {}, 
   86620, 
   null, 
   1105724460.0
  ], 
  [
   86840, 
   null, 
   "sakura", 
   "Embryonic stem cell research should be banned. It's a waste of time and money and it doesn't work. We should put all our money into stem cell research using only adult or umbilical cord stem cells. \n Stem cells are cells that can develop into any organ and originally were thought to exist only in embryos. So researchers had the choice of killing a baby, or finding one that was already dead from abortion, and using their stem cells to try to cure diseases. But when a stem cell from an embryo was put into another person, the immune system would attack the stem cells thinking that they were viruses. The scientific term for this is rejection. And the cells would only grow into tumors since embryonic cells are pre-programmed to form an entire body. \"The results were no successful treatments,\" said the National Catholic Register. \n So why are some scientists still researching embryonic stem cells? Elenor Schoen, Communications Director for Human Life of Washington said, \"They are actually exploring how the embryo's body works, not trying to find disease cures with the stem cells. Stem cell research monies give access to embryos.\" \n About five or six years ago it was discovered that every human being, old or young, has stem cells in their bodies. When your own stem cells are used to treat a disease there is no rejection problem. The National Catholic Register said, \"The results of adult stem cells are treatments for 56 diseases including breast cancer, and stroke.\" Stem cells have also been discovered in the blood of umbilical cords which are available after a birth.\n\n \n ok, first of all, the \"baby\" isn't really a baby yet. and i'm not really such an expert on this whole science thing, but the researchers must have their reasons for not using the dead babies' stem cells. maybe they don't work. and also, think about this: if u had a very close friend or relative who's affected by a disease that cud be cured by stem cell research, wudn't u want stem cell research to happen? wat wud probably be more important, a very great person who's going to die pretty soon, or using things that aren't babies yet to help that person live longer. i wud choose to have that person live longer. i know, it's a rather selfish thought, but wat can i say, people are just like that. can't really deny it.", 
   {
    "unicode_changes_made": true
   }, 
   86120, 
   null, 
   1105765320.0
  ], 
  [
   86854, 
   null, 
   "duck", 
   "ok, first of all, the \"baby\" isn't really a baby yet.\n \n Really, I think it he or she is.\n \nand i'm not really such an expert on this whole science thing, but the researchers must have their reasons for not using the dead babies' stem cells.\n \n I don't quite get this. The whole point of my post was that researchers did not have any reason to get embryonic stem cells.\n \nand also, think about this: if u had a very close friend or relative who's affected by a disease that cud be cured by stem cell research, wudn't u want stem cell research to happen? wat wud probably be more important, a very great person who's going to die pretty soon, or using things that aren't babies yet to help that person live longer. i wud choose to have that person live longer.\n \n Perhaps you don't get this. I want stem cell research. i cannot describe how much I want. I do know some people that could really use these stem cells. I just don't want researchers to harvest the cells from our children. Not only is it a sick and perverted way of medicene and science, but it doesn't work. Embryonic stem cell research does not work. We haven't even dared trying to test them on humans yet. When we tested them on mice, the mice grew tumors and died. You see, I want the stem cells to come from our own bodies. the stem cells in our own bodies are called adult stem cells and they really work. In the first post, it states that there have been treatments for over 56 diseases. Embryonic stem cells have done nothing like this. Not to mention the umbilical cord stem cells have worked really well too. \n \n know, it's a rather selfish thought, but wat can i say, people are just like that. can't really deny it.\n \n I'm not like that. I could list a few hundred people that I know that are not like that.", 
   {}, 
   86840, 
   null, 
   1105780980.0
  ], 
  [
   87003, 
   null, 
   "sakura", 
   "Really, I think it he or she is.\n \n really, i don't think it is a baby yet.\n \n I don't quite get this. The whole point of my post was that researchers did not have any reason to get embryonic stem cells.\n \n how do you know? maybe they do, but you're just too close-minded to know. then again, i may be wrong, but....\n \n Perhaps you don't get this. I want stem cell research. i cannot describe how much I want. I do know some people that could really use these stem cells. I just don't want researchers to harvest the cells from our children. Not only is it a sick and perverted way of medicene and science, but it doesn't work. Embryonic stem cell research does not work. We haven't even dared trying to test them on humans yet. When we tested them on mice, the mice grew tumors and died. You see, I want the stem cells to come from our own bodies. the stem cells in our own bodies are called adult stem cells and they really work. In the first post, it states that there have been treatments for over 56 diseases. Embryonic stem cells have done nothing like this. Not to mention the umbilical cord stem cells have worked really well too. \n \n well, since the ubilical cord stems have worked really well, then how come the scientists and doctors are also doing embryonic stem cell research? again, they have their reasons to. they wudn't choose 2 use the embryonic cells if they didn't have to. i'm no science wiz, and a lot of the science stuff that i'm saying might be wrong, but the rest of the stuff are the things that i'm using based off of logic, and my knowledge. common sense, that's wat it's called.\n \n I'm not like that. I could list a few hundred people that I know that are not like that.\n\n \n oh really? so u wud choose 2 have...say...a close friend or relative who has a disease that wud probably be cured by stem cell research, 2 die from it and choose 2 have a new baby be born, right? well then, wat if it's ur mom or dad?", 
   {}, 
   86854, 
   null, 
   1105900980.0
  ], 
  [
   87052, 
   null, 
   "xeiah", 
   "[QUOTE=duck]Why don't you try and find a single time of when embryos have worked. You could search for hours but you will not find one. mainly becasue doctors haven't dared to use the embryos on humans yet. \n \n < Uh, If dr.s havent used them yet then how do you know it won't work?", 
   {}, 
   86394, 
   null, 
   1105933380.0
  ], 
  [
   87086, 
   null, 
   "duck", 
   "oh really? so u wud choose 2 have...say...a close friend or relative who has a disease that wud probably be cured by stem cell research, 2 die from it and choose 2 have a new baby be born, right? well then, wat if it's ur mom or dad?\n \n If it was anybody I was choose adult stem cells. My whole point is that adult stem cells work and embryonic cells don't.", 
   {}, 
   87052, 
   null, 
   1105947360.0
  ], 
  [
   87087, 
   null, 
   "duck", 
   "Uh, If dr.s havent used them yet then how do you know it won't work?\n \n Dr.s haven't used them on humans. They have tested them on mice. The mice grew tumors and died.", 
   {}, 
   87086, 
   null, 
   1105947420.0
  ], 
  [
   87112, 
   null, 
   "kickin50", 
   "Duck, you're getting your panties in a bunch over an issue that you have no hope of controlling.\n \n The research WILL go on, if not in California, in another country.", 
   {}, 
   87052, 
   null, 
   1105982160.0
  ], 
  [
   87118, 
   null, 
   "sakura", 
   "If it was anybody I was choose adult stem cells. My whole point is that adult stem cells work and embryonic cells don't.\n\n \n well, then why are the doctors trying 2 also test the embyonic cells? what's their reason then? we don't know, because the doctors might not want everything that they're doing be on the front page of every newspaper. they have their reasons for their actions, and they just don't want people like you to know about them. or...they already have their reasons published and everything and you're just 2 close-minded 2 take the information in.", 
   {}, 
   87086, 
   null, 
   1105983480.0
  ], 
  [
   87164, 
   null, 
   "xeiah", 
   "[QUOTE=duck]Why don't you try and find a single time of when embryos have worked. You could search for hours but you will not find one. mainly becasue doctors haven't dared to use the embryos on humans yet. \n \n < Uh, If dr.s havent used them yet then how do you know it won't work?", 
   {}, 
   86394, 
   null, 
   1105994340.0
  ], 
  [
   87222, 
   null, 
   "Tastyfish", 
   "Adult stem cells are different things and are used for different things - its like using a plaster cast to perform a heart bypass and then declaring that plaster casts are useless.\n Adult stem cells are only able to produce one type of cell in addition to a copy of themselves when they replicate) and can only do so a finate amount of times. Embryonic stem cells are able to replicate infinitely and can differentiate into any cell within the human body.\n \n A lot of the work and research done into embryonic stem cells is purely to see how they work - but this isn't out of curiosity, without knowing how they work there is no way you can use them safely or even use that knowledge to modify things so they behave in the same way with better focus.\n \n Really, if you know what you are trying to do then rejection is a really easy thing to get round. Thinking that treatment and research just involves sticking stem cells somewhere is drastically simplifiing things", 
   {}, 
   87164, 
   null, 
   1106024100.0
  ], 
  [
   87347, 
   null, 
   "pnac=ww3", 
   "Duck, you really need to strike at the heart of the matter.\n You're missing the mark with stem cell research.\n You can't do a thing with embryonic stem cells and you can't have those\n without an embryo and you get those from fertility clinics.\n They do one of two things with those frozen embryos.\n After a certain time, if no one has \"adopted\" one of the thousands \n in each clinic, then they are destroyed.\n \n So really what you are against is in vitro fertilization.\n In the process they create about 12 embryos and then they \n pick the most viable 2-3 to impregnate the woman with.\n Then 1 or 2 of those catch, and you get a pregnancy.\n In the process you create, destroy, and temporarily store \n around a dozen \"humans.\"\n http://www.conceivingconcepts.com/learning/articles/embryo.html\n \nIn a typical case, specialists will attempt to fertilize a dozen eggs, then implant no more than three. That leaves nine embryos, which get VIP treatment as they are stored in liquid nitrogen at minus-196 degrees Celsius, often for several years. They belong to the parents who have the option to use them again, discard them or donate them.\n\n They belong to the parents, who can chose to kill them if they so wish.", 
   {}, 
   87222, 
   null, 
   1106094840.0
  ], 
  [
   87392, 
   null, 
   "duck", 
   "\"Duck, you really need to strike at the heart of the matter.\n You're missing the mark with stem cell research.\n You can't do a thing with embryonic stem cells and you can't have those\n without an embryo and you get those from fertility clinics.\n They do one of two things with those frozen embryos.\n After a certain time, if no one has \"adopted\" one of the thousands\n in each clinic, then they are destroyed.\n \n So really what you are against is in vitro fertilization.\n In the process they create about 12 embryos and then they\n pick the most viable 2-3 to impregnate the woman with.\n Then 1 or 2 of those catch, and you get a pregnancy.\n In the process you create, destroy, and temporarily store\n around a dozen \"humans.\" \"\n \n \n Oh, so its even more sick and perveted then i thought.\n \n \nThey belong to the parents, who can chose to kill them if they so wish.\n \n And your more sick and perverted then I thought.", 
   {}, 
   87347, 
   null, 
   1106119620.0
  ], 
  [
   87412, 
   null, 
   "Clive14", 
   "I think her point was that the pope is biased because he's catholic.\nHer point was that the Pope is biased because he's human.\n \n I found Duck's first post for this thread overly long. The thread is \"almost everything I know about stem cells\" and his first post could have just said \"Nothing\".\n \n Adult and umbilical stem cells are extremely difficult to work with. Embryonic stem cells multiply with easy in simple cultures allowing vast numbers to be produced, thus making them easy to work with. Over time, we may be able to overcome this and various other problems with adult stem cells. Then they will be the stem cell of choice for most treatments and research. Untill then embryonic stem cells remain vital as far as research goes.\n \n Clearly the use of embryos in stem cell research causes some upset amongst some Americans and people of some Catholic countries. Britain, and other countries, will continue to use embryos for research though regardless of what Duck and other ethical whingers. Hopefully America will win out against the ludites who oppose such research, but even if you don't you'll still get to benefit from them when other countries' scientists develop treatments for you.", 
   {}, 
   86605, 
   null, 
   1106151060.0
  ], 
  [
   88422, 
   null, 
   "duck", 
   "Adult and umbilical stem cells are extremely difficult to work with. Embryonic stem cells multiply with easy in simple cultures allowing vast numbers to be produced, thus making them easy to work with. Over time, we may be able to overcome this and various other problems with adult stem cells. Then they will be the stem cell of choice for most treatments and research. Untill then embryonic stem cells remain vital as far as research goes.\n \n \n Despite the fact that are difficvult to work with, they have worked. Treatments for 56 diseases. Embryo's have not had a single succesful inncident. Only tumors. Now lets think logically. Adult stem cells are hard to work with, so are umbulical cord stem cells. But they have been very succesful. Embryonic stem cells are almost too easy to get. And very simple to work with. But they have not treated anything. Now, if I were paralyzed right now, I would definetly go for my own stem cells. And even if embryos did wk, we would have to be put on medication for the rest of our lives. Now I have stated the logic as clearly as possible. if some poeple still don't understand then thats just sad. \n \n \nClearly the use of embryos in stem cell research causes some upset amongst some Americans and people of some Catholic countries. Britain, and other countries, will continue to use embryos for research though regardless of what Duck and other ethical whingers. Hopefully America will win out against the ludites who oppose such research, but even if you don't you'll still get to benefit from them when other countries' scientists develop treatments for you.\n \n First of all, you are damn right. I am disturbed, ****** off, and distgusted that we would dare use our own human race to do in-humane, horrifyingly painful, and downright insane tests on our babies, just because they haven't made it out of the whomb. THESE ARE OUR CHILDREN.This sounds like it was directly out of the movie \"star wars clone wars\". We use our own children as farms.", 
   {}, 
   87412, 
   null, 
   1106816460.0
  ], 
  [
   88456, 
   null, 
   "Tastyfish", 
   "Meh? Have you even seen Epidsode 2 (attack of the clones by the way, clone wars is the animated series I think), nothing like this at all - they have just trained a large army who all share the best genetical make up they could find for soldiers. They aren't considered non human or anything.", 
   {}, 
   88422, 
   null, 
   1106846100.0
  ], 
  [
   88589, 
   null, 
   "xeiah", 
   "First of all, you are damn right. I am disturbed, ****** off, and distgusted that we would dare use our own human race to do in-humane, horrifyingly painful, and downright insane tests on our babies, just because they haven't made it out of the whomb. \n \n <Stem cells are not harvested from the womb. They have never made it too the womb in the first place. They are frozen in peitrie dishes. Also, embryos have no brains and no ability to feel pain. Weather you can concider them human is debatable but they are not in pain. They come from couples looking to use them for Invitro Fertilization. Couples that want children but are having trouble becoming pregnant. They do not come from abortion clinics or women who have miscaried. Many are fretilized at once so the couple may try mulitple rounds of implantation. If it is sucessfull then there are usally still many embryos left that will then just be thrown away if not used in research. \n Why waste then when we can use them to try to cure illnesses that are killing fully grown developed humans.\n \n You can say you would not let an embryo be distroyed to save your life or the life of someone you love but until you are realy faced with that it's not fair to say you know what you would do. If you had a child with Parkinsons and your Dr siad they could have a cure in year useing stem cells it would be awfully hard to say no I'd rather see my baby suffer than see a mesh of cells that has the potential to become somthing but won't be distroyed.\n \n \n THESE ARE OUR CHILDREN.This sounds like it was directly out of the movie \"star wars clone wars\". We use our own children as farms.[/QUOTE\n \n <Read your own Quote and think about how you'd realy feel. Also go rent Star Wars and get the title right.\n ", 
   {}, 
   88422, 
   null, 
   1106889420.0
  ], 
  [
   88619, 
   null, 
   "trebor", 
   "Embryonic stem cell research should be banned. It's a waste of time and money and it doesn't work. We should put all our money into stem cell research using only adult or umbilical cord stem cells. \n Stem cells are cells that can develop into any organ and originally were thought to exist only in embryos. So researchers had the choice of killing a baby, or finding one that was already dead from abortion, and using their stem cells to try to cure diseases. But when a stem cell from an embryo was put into another person, the immune system would attack the stem cells thinking that they were viruses. The scientific term for this is rejection. And the cells would only grow into tumors since embryonic cells are pre-programmed to form an entire body. \"The results were no successful treatments,\" said the National Catholic Register. \n So why are some scientists still researching embryonic stem cells? Elenor Schoen, Communications Director for Human Life of Washington said, \"They are actually exploring how the embryo's body works, not trying to find disease cures with the stem cells. Stem cell research monies give access to embryos.\" \n About five or six years ago it was discovered that every human being, old or young, has stem cells in their bodies. When your own stem cells are used to treat a disease there is no rejection problem. The National Catholic Register said, \"The results of adult stem cells are treatments for 56 diseases including breast cancer, and stroke.\" Stem cells have also been discovered in the blood of umbilical cords which are available after a birth.\n\n \n \n On the contrary, stem cells do lose their adaptabity over time. How much is unknown. Why is unknown. While hopefully, the ultimate source of stem cells can be unbilicord stem cells, or adult stem cells, we don't know enough about stem cells to be able to find out a number of answers. When we understand why embronic stem cells are more adaptable than the unbilicord stem cells, we might be able to return the umbilicord stem cells and the adult stem cells into the condition the embronic stem cells are in. If that can be done, then\n the umbilicord stems cells would have the advantage of not having certain ethical concerns, and they would be cheaper to get. Using stem cells from adults would have the advantage of not introducing another persons DNA \n into the body,which might have unforeseen consequences down the road.\n \n However, we need to know more about how the cell develops. It is, after all, \n just a cell, not a human being.", 
   {
    "unicode_changes_made": true
   }, 
   86120, 
   null, 
   1106931900.0
  ], 
  [
   88624, 
   null, 
   "trebor", 
   "Really, I think it he or she is.\n \n\n \n That is your opinion. I happen not to agree.\n \n \n\n \n \n I don't quite get this. The whole point of my post was that researchers did not have any reason to get embryonic stem cells.\n \n\n \n Researchers disagree. I happen to trust people who trained in science about science rather than someone who is making sweeping statements due to their \n religious beliefs. \n \n \n\n Perhaps you don't get this. I want stem cell research. i cannot describe how much I want. I do know some people that could really use these stem cells. I just don't want researchers to harvest the cells from our children. Not only is it a sick and perverted way of medicene and science, but it doesn't work. Embryonic stem cell research does not work. We haven't even dared trying to test them on humans yet. When we tested them on mice, the mice grew tumors and died. You see, I want the stem cells to come from our own bodies. the stem cells in our own bodies are called adult stem cells and they really work. In the first post, it states that there have been treatments for over 56 diseases. Embryonic stem cells have done nothing like this. Not to mention the umbilical cord stem cells have worked really well too. \n \n\n \n These stem cells are not our children. They are not children at all. You might want to worship the fertilised egg. Don't force others to though.\n \n I personaly hope that we can use the umbilicord stem cells. I don't KNOW we can use that would be feasible in all possible cases. For example.. it might be possible to perform embronic surgury with stem cells to correct birth defects...and I don't know if umbilicord stems cells would do.", 
   {}, 
   86854, 
   null, 
   1106933100.0
  ], 
  [
   89668, 
   null, 
   "maximus", 
   "FYI, duck, you might be interested in this website:\n \n http://www.stemcellresearch.org/", 
   {}, 
   88624, 
   null, 
   1107498360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  almost everything I know about stem cells", 
  "url": "http://www.4forums.com/political/abortion-debates/4077-almost-everything-i-know-about-stem-cells.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 4077, 
  "discussion_files": [
   [
    "19567.html", 
    "http://www.4forums.com/political/abortion-debates/4077-almost-everything-i-know-about-stem-cells-print.html"
   ], 
   [
    "19568.html", 
    "http://www.4forums.com/political/abortion-debates/4077-almost-everything-i-know-about-stem-cells-2-print.html"
   ]
  ], 
  "identifier": 4077
 }
]