[
 [
  [
   86212, 
   null, 
   "jyoshu", 
   "I've never thought about this before until today, and it's not really relevant to any legal issues, but I thought it was interesting nonetheless. \n \n I also debate a lot on the abortion forum here (and sometimes some of the others). I got to thinking about what possible ways the issue of homosexuality relates to abortion. It doesn't, directly of course.\n \n But it hit me that a homosexual male couple could never have an abortion, unlike a straight couple. Any kids they had would be adopted or by surrogate. And of course they wouldn't be using a surrogate unless they had the intention of keeping the child. \n \n It also seems that a lesbian couple probably would never have one either, because a true lesbian (if sexual orientation is for real) would never be in a position to get pregnant unless she really wanted to be. Of course cases of rape would be the only exception here--a lesbian could get pregnant that way.\n \n So basically, gay people are the most unlikely group in our society to have an abortion, it seems to me.\n \n Has anyone else ever thought about this?", 
   {
    "post_info": {
     "post_title": "A Thought on Two Issues: Homosexuality and Abortion"
    }
   }, 
   null, 
   null, 
   1105561620.0
  ], 
  [
   86217, 
   null, 
   "JustineCredible", 
   "I've never thought about this before until today, and it's not really relevant to any legal issues, but I thought it was interesting nonetheless. \n \n I also debate a lot on the abortion forum here (and sometimes some of the others). I got to thinking about what possible ways the issue of homosexuality relates to abortion. It doesn't, directly of course.\n \n But it hit me that a homosexual male couple could never have an abortion, unlike a straight couple. Any kids they had would be adopted or by surrogate. And of course they wouldn't be using a surrogate unless they had the intention of keeping the child. \n \n It also seems that a lesbian couple probably would never have one either, because a true lesbian (if sexual orientation is for real) would never be in a position to get pregnant unless she really wanted to be. Of course cases of rape would be the only exception here--a lesbian could get pregnant that way.\n \n So basically, gay people are the most unlikely group in our society to have an abortion, it seems to me.\n \n Has anyone else ever thought about this?\n\n \n What you are forgetting are those gays and lesbians alike who may have attempted to live as a straight person. Many do you know. They try to assimilate because society makes them feel as if it's required. So, in those instances it's very possible that a gay man may have impregnated a woman or a lesbian may have been impregnated and opted for an abortion. \n \n Honey, don't be so narrow minded, it can happen, and I'm sure it probably has.", 
   {}, 
   86212, 
   null, 
   1105562220.0
  ], 
  [
   86308, 
   null, 
   "BobNelson2", 
   "Has anyone else ever thought about this?\n\n \n Sure. The lesson here that could really benefit society is not that gay folks can't accidentally have children but that the BEST way to bring children into the world is intentionally, with preparation and planning.\n \n It's not the ONLY way, of course, but wanted children clearly do better on average than unwanted children.", 
   {}, 
   86212, 
   null, 
   1105577520.0
  ], 
  [
   86917, 
   null, 
   "jyoshu", 
   "Sure. The lesson here that could really benefit society is not that gay folks can't accidentally have children but that the BEST way to bring children into the world is intentionally, with preparation and planning.\n \n It's not the ONLY way, of course, but wanted children clearly do better on average than unwanted children.\n\n \n Sure, or just make sure that any children a couple does happen to have are wanted and treasured, regardless of whether or not they are truly 'planned.' \"Accidents\" do happen. (though not with gay people--they can never have a 'surprise' child, which I would find to be a wonderful surprise to have, myself.)", 
   {}, 
   86308, 
   null, 
   1105837380.0
  ], 
  [
   86919, 
   null, 
   "wsm2506", 
   "Sure, or just make sure that any children a couple does happen to have are wanted and treasured, regardless of whether or not they are truly 'planned.' \"Accidents\" do happen. (though not with gay people--they can never have a 'surprise' child, which I would find to be a wonderful surprise to have, myself.)\n\n \n I have three sons from my ex-wife. They were all \"suprise\" children to me. She told me she was on the pill when she wasn't. I don't love them any less because of it.", 
   {}, 
   86917, 
   null, 
   1105837680.0
  ], 
  [
   86921, 
   null, 
   "jyoshu", 
   "I have three sons from my ex-wife. They were all \"suprise\" children to me. She told me she was on the pill when she wasn't. I don't love them any less because of it.\n\n \n That makes my point, thanks! (Of course you didn't have them as part of a gay couple, if that's the point you were trying to make)", 
   {}, 
   86919, 
   null, 
   1105837860.0
  ], 
  [
   86922, 
   null, 
   "wsm2506", 
   "That makes my point, thanks! (Of course you didn't have them as part of a gay couple, if that's the point you were trying to make)\n\n \n No, i was not trying to make that point. I was in a heterosexual marriage for many of the same reasons that Justine has addressed. I just have never mentioned it before in this forum.", 
   {}, 
   86921, 
   null, 
   1105838100.0
  ], 
  [
   86923, 
   null, 
   "BobNelson2", 
   "I have three sons from my ex-wife. They were all \"suprise\" children to me. She told me she was on the pill when she wasn't. I don't love them any less because of it.\n\n \n Fool me once, shame on you.\n \n Fool me twice, shame on me.\n \n Fool me thrice??? Get 'em snipped!!\n \n emoticon_xclown \n \n Or are we talking triplets?", 
   {}, 
   86919, 
   null, 
   1105838280.0
  ], 
  [
   86925, 
   null, 
   "wsm2506", 
   "Fool me once, shame on you.\n \n Fool me twice, shame on me.\n \n Fool me thrice??? Get 'em snipped!!\n \n emoticon_xclown \n \n Or are we talking triplets?\n\n \n LOL LOL LOL LOL No, they were single births, 2 years between each. She still doesn't understand why I don't trust her.\n \n Edit:\n \n FYI, I don't take your comments badly. I understand you were just ribbing me. My boys are now 28, 26, and 24. My sexual identity has never been an issue between my sons and I.", 
   {}, 
   86923, 
   null, 
   1105838760.0
  ], 
  [
   86995, 
   null, 
   "JustineCredible", 
   "That makes my point, thanks! (Of course you didn't have them as part of a gay couple, if that's the point you were trying to make)\n\n \n \n Actually, if you bothered to pay any attention whatsoever, it actually goes against your point entirely. Just because WSM and I were both in \"heterosexual\" Style relationships, doesn't change the fact that both of us are indeed homosexuals and therefore proves that homosexuals do indeed have children, planned or not. \n \n Mine too was kind of a suprise. I was on the \"pill\" but was also taking antibiotics at the time and for anyone who doesn't already know, antibiotics will completely cancel out the affects of the birth control pill. I was NOT aware of this at the time and low-and-behold I ended up pregnant with my son. \n \n p.s. just for general information, I was not taking \"the pill\" for birth control reasons. \n Not all women who are prescribed it are even sexually active at all. The birth control pill contains synthetic or naturally dirived female hormones, which for some women aids them in attaining a more regular period. Many women atheletes are prescribed birth control because being extremely athletic can disrupt, postpone or completely do away with a woman's natural cycle. Taking birth control helps to \"normalize\" female hormone levels. Such was my case.", 
   {}, 
   86921, 
   null, 
   1105898640.0
  ], 
  [
   87100, 
   null, 
   "jyoshu", 
   "Actually, if you bothered to pay any attention whatsoever, it actually goes against your point entirely. Just because WSM and I were both in \"heterosexual\" Style relationships, doesn't change the fact that both of us are indeed homosexuals and therefore proves that homosexuals do indeed have children, planned or not. \n \n\n \n I think anyone reading this thread with with a reasonable amount of common sense is going to know we are talking about children in the context of gay couples. I did use the term gay 'people,' but I thought surely that it would be taken in the context of gay relationships and not relationships between a gay person and a straight one. Of coruse a gay person with a straight person could have a 'surprise' child. But generally, when we talk about these issues we are talking within the context of gay relationships. \n \n So, to make my point again yet in a way that doesn't allow you to pull exceptions out of a hat in place of the rule . . . gay couples can't have a surprise child given that they have to have a third party means to have one. (surrogate, adoption, etc.)", 
   {}, 
   86995, 
   null, 
   1105978680.0
  ], 
  [
   87203, 
   null, 
   "JustineCredible", 
   "I think anyone reading this thread with with a reasonable amount of common sense is going to know we are talking about children in the context of gay couples. I did use the term gay 'people,' but I thought surely that it would be taken in the context of gay relationships and not relationships between a gay person and a straight one. Of coruse a gay person with a straight person could have a 'surprise' child. But generally, when we talk about these issues we are talking within the context of gay relationships. \n \n So, to make my point again yet in a way that doesn't allow you to pull exceptions out of a hat in place of the rule . . . gay couples can't have a surprise child given that they have to have a third party means to have one. (surrogate, adoption, etc.)\n\n \n \n Jyoshu:\n \n You may have assumed we would automatically know what you meant, and yes, maybe I did, but you can't throw that out there like that and not expect someone to knock it down to reality. \n The reason being is that many gays/lesbians are in similar situations as Steve &/or myself. Because gays/lesbians are infact physologically the same as heterosexuals. Just as are those of other races and/or religions. Being gay or lesbian does not preclude one from being able to procreate. That's the assumption Steve and I both have major problems with. \n It's the proliferation of that falicy and misgiving that needs to be stopped.", 
   {}, 
   87100, 
   null, 
   1106011800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A Thought on Two Issues: Homosexuality and Abortion", 
  "url": "http://www.4forums.com/political/gay-rights-debates/4081-thought-two-issues-homosexuality-abortion.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 4081, 
  "discussion_files": [
   [
    "18508.html", 
    "http://www.4forums.com/political/gay-rights-debates/4081-thought-two-issues-homosexuality-abortion-print.html"
   ]
  ], 
  "identifier": 4081
 }
]