[
 [
  [
   86398, 
   null, 
   "galeleo", 
   "Georgia: Saakashvili to be replaced\n Mikhail Saakashvili did not live up to the expectations of Washington. It looks like he is absolutely helpless. The only thing he happened to be good at was to blow out the money he was given (it was actually distributed among his close entourage and relatives instead of being invested into Georgian industry and social welfare). Actually it is for this reason that the USA started looking for somebody who can replace him at the position of Georgian president. Actually, it can well be Georgian Defense Minister Irakly Okruashvili. US Ambassador Richard Miles said the United States are watching after him with great interest. He added Okruashvili could bank on support of America in case his military operation in early spring aimed at rejoining Abkhazia and South Ossetia to Georgia is success. As like as not, Georgian army might turn its weapons against Tbilisi after it defeats Abkhazians and Ossetians. Things alike used to happen before...", 
   {
    "post_info": {
     "post_title": "Georgia: Saakashvili to be replaced"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1105607280.0
  ], 
  [
   87568, 
   null, 
   "Maineiac", 
   "Hello galeleo. emoticon_xbye Welcome aboard. 2 new users and 2 complaints about the U.S. being involved in Georgia. emoticon_cry As i see it,he was voted into office by a 96% margin.I'd say that Georgia got what they wanted. I don't see how the U.S. can have him replaced. \n He has only been in office about a year.How fast were the people of Georgia expecting great changes in the development of a country formally run by Russia to take place?\n Does anything that takes place in Georgia affect you personally?", 
   {}, 
   86398, 
   null, 
   1106242140.0
  ], 
  [
   89686, 
   null, 
   "Blond", 
   "I'm sure everyone in the Parliamentary Assembly of the Council of Europe (PACE) knows that Saakashvili's single ambition today is nothing else but to become a full member of the EU. But I'm glad to see now that our old kind Europe has thought better of it. At last EU delegates understood that they (with active help of USA, of course) had enthroned real monster in Georgia. It's obvious that it's \"a big strategic victory for America, but not for Europe. After EU authorities realized that Saakashvili hadn't followed their main recommendations and concentrated the whole power in the hands of a single party with absence of any political alternatives, the PACE Monitoring Committee recommended to limit his powers. But even now it's clear for me that, having the full sanction of USA, the young Georgian leader (US-educated lawyer, by the way), not Brussels, will soon dictate terms on which EU will have to base its relations with Georgia. In other words, the Moor has done his duty, let him go.", 
   {
    "unicode_changes_made": true
   }, 
   87568, 
   null, 
   1107512160.0
  ], 
  [
   89899, 
   null, 
   "Choscura", 
   "what? of course he's ****ing powerless, anybody can see that. the trick that would have kept him in office would have been hiding the strings that tugged his pinoccio-puppet XXX around.", 
   {}, 
   86398, 
   null, 
   1107603180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Georgia: Saakashvili to be replaced", 
  "url": "http://www.4forums.com/political/current-events-debates/4086-georgia-saakashvili-replaced.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 4086, 
  "discussion_files": [
   [
    "20701.html", 
    "http://www.4forums.com/political/current-events-debates/4086-georgia-saakashvili-replaced-print.html"
   ]
  ], 
  "identifier": 4086
 }
]