[
 [
  [
   86576, 
   null, 
   "pnac=ww3", 
   "You may have heard about it in the news, but here it is.\n \n These fossils were found in the same fossil-rich province as\n the feathered dinosaurs as well as the earliest know placental mammal, Liaoning province, China.\n \n The latest to be unearthed is a genus of dog-like mammals that lived in the Cretaceous perdiod.\n http://news.nationalgeographic.com/news/2005/01/0112_050112_dino_eater.html\n The fossilized skeleton of a small dinosaur was found in the stomach of the dino-eating dog.\n \n Here is the original Nature articles (abstract):\n http://www.nature.com/cgi-taf/DynaPage.taf?file=/nature/journal/v433/n7022/abs/nature03102_fs.html&dynoptions=doi1105652511\n \nNature 433, 149 - 152 (13 January 2005)\n Large Mesozoic mammals fed on young dinosaurs\n \n YAOMING HU1,2,3, JIN MENG2, YUANQING WANG1 & CHUANKUI LI1\n \n 1 Institute of Vertebrate Paleontology & Paleoanthropology, Chinese Academy of Sciences, PO Box 643, Beijing 100044, China\n 2 Division of Paleontology, American Museum of Natural History, Central Park West at 79th Street, New York City, New York 10024, USA\n 3 Biology Program, Graduate School and City College of New York, City University of New York, New York City, New York 10016, USA\n \n Correspondence and requests for materials should be addressed to Y. H. (yhu@amnh.org).\n \n Mesozoic mammals are commonly portrayed as shrew- or rat-sized animals that were mainly insectivorous, probably nocturnal and lived in the shadow of dinosaurs. The largest known Mesozoic mammal represented by substantially complete remains is Repenomamus robustus, a triconodont mammal from the Lower Cretaceous of Liaoning, China. An adult individual of R. robustus was the size of a Virginia opossum. Here we report a new species of the genus, represented by a skeleton with most of the skull and postcranium preserved in articulation. The new species is 50% larger than R. robustus in skull length. In addition, stomach contents associated with a skeleton of R. robustus reveal remains of a juvenile Psittacosaurus, a ceratopsian dinosaur. Our discoveries constitute the first direct evidence that some triconodont mammals were carnivorous and fed on small vertebrates, including young dinosaurs, and also show that Mesozoic mammals had a much greater range of body sizes than previously known. We suggest that Mesozoic mammals occupied diverse niches and that some large mammals probably competed with dinosaurs for food and territory.\n\n http://news.nationalgeographic.com/news/2001/05/0524_paperclipmammal.html\n \n This just goes to show you that all species that ever lived were once living side by side, at least before the flood, and Noah only had so much room!\n \n I wonder what the authors of this article :http://www.icr.org/pubs/imp/imp-321.htm\n have to say about it, since they said (back in 1999 and have yet to update),\n \n\n The idea of feathered dinosaurs and the theropod origin of birds is being actively promoted by a cadre of zealous scientists acting in concert with certain editors at Nature and National Geographic who themselves have become outspoken and highly biased proselytizers of the faith. Truth and careful scientific weighing of evidence have been among the first casualties in their program, which is now fast becoming one of the grander scientific hoaxes of our age-the paleontological equivalent of cold fusion.\n\n \n This was just anohter interesting Nature article from the same issue:\n http://www.nature.com/cgi-taf/DynaPage.taf?file=/nature/journal/v433/n7022/full/433111a_fs.html\n \nNature 433, 111 (13 January 2005)\n \n CONCEPTS\n Body doubles\n \n ALBERTO G. SÁEZ1 AND ENCARNACIÓN LOZANO2\n \n 1 Alberto G. Sáez is in the Departamento de Biodiversidad y Biología Evolutiva, Museo Nacional de Ciencias Naturales, 28006 Madrid, Spain.\n 2 Encarnación Lozano is in the Department of Biological Sciences, Imperial College London, Berkshire SL5 7PY, UK.\n \n Cryptic species: as we discover more examples of species that are morphologically indistinguishable, we need to ask why and how they exist.\n \n Have you ever approached someone whom you thought you knew, talked to him with familiarity, only to find out later that he was a complete stranger, albeit remarkably similar in appearance to the person you had in mind, such as a twin brother? Well, taxonomists are similarly puzzled when they come across two or more groups of organisms that are morphologically indistinguishable from each other, yet found to belong to different evolutionary lineages. That is, when they discover a set of cryptic species.\n \n Our records of cryptic species are on the rise, often revealed by surveys of DNA variation. The story repeats itself with increased frequency - a number of individuals belonging to a morphologically recognized species are sequenced (or otherwise genetically characterized), normally at several points (loci) within the genome. Then, often unexpectedly, the various genotypes will cluster in reciprocally monophyletic groups, with no signs of genetic exchange between them. Similar evolutionary scenarios are evident at each locus, suggesting that the corresponding populations are reproductively isolated from each other, yet the sampled populations are not geographically isolated.\n \n But cryptic species are not new to science. In 1942, Ernst Mayr introduced them to English scientific literature as 'sibling' species, translating from the French espèces jumelles or from the German Geschwisterarten. At the same time, in his Systematics and the Origin of Species, Mayr reviewed a relatively long list of cryptic species, and used their existence to expose the vulnerability of the morphological species concept and support his idea of species as populations of reproductively isolated organisms. This was a dual effort, which we must keep pursuing today. The continued tallying of cryptic species is important for conservation concerns and biodiversity counts. Through them, we can also seek a better understanding of biological evolution, such as asking the whys and wherefores of so many deceiving species.\n \n But are these species truly cryptic? It is difficult, but after detailed comparisons of morphological and non-morphological features, we can often establish key morphological characters for their identification. In those cases, we can then refer to pseudo-cryptic or pseudo-sibling species. What, in the midst of a number of contradicting or lacking phenotypic marks, makes the case for a subtle morphological trait to be upgraded to being species-specific? It is the covariation of the trait with characteristics suggestive of reproductive isolation, such as the use of different habitats, contrasting behaviours, divergent ecological interactions - but above all, clear-cut evidence of reproductive isolation derived from breeding tests or from phylogenetic analysis. The key to identifying (pseudo-) sibling species can also be morphological characters of other life stages. For example, adults of the neotropical skipper butterfly Astraptes fulgerator are disconcertingly similar, but the caterpillars are not, comprising a minimum of ten distinctive phenotypes based on colour patterns. These patterns are also clearly correlated to ecological, ethological and genetic traits, all of which gives decisive support to their discoverers' claim of \"ten species in one\".\n \n Some degree of differentiation in the biology of cryptic species is actually predicted by ecological competition theory. According to this theory, the coexistence of equal competitors is doomed, because random changes of their relative abundances will inevitably end in only one survivor. But exceptions occur in the theory and also, apparently, in the field. Fig-pollinating wasps from Panama present cryptic species separated by as much as five million years, with no apparent differences between them - including the fact that they grow side by side in figs of the same species, for which they are specific. The trick may be that each species adjusts its sex ratio in accordance to its own population density, increasing the proportion of males, hence slowing down population growth, when it is more abundant. The ensuing oscillations may hold the key to this stable coexistence of equals.\n \n Skipper butterflies and Panamanian fig wasps are just two examples of a possibly higher incidence of cryptic species in the tropics. This leads us to the questions of where cryptic species are more abundant, or what organisms appear more misleading, which in turn could teach us something about their fundamental raisons d'être. Nancy Knowlton has argued that we will find marine habitats filled with them, pointing out two chief reasons: first, our poor access to those habitats; and second, speciation processes less coupled to morphology than to other phenotypic aspects, notably chemical recognition systems. Recent work has added planktonic groups to Knowlton's list, such as coccolithophores and diatoms (with elaborate architectures) and the more subdued planktonic foraminifers, with nine 'morphospecies' sequenced giving rise to 33 'genetic species'. No matter how bizarre or simple their specific shapes are, each represents a well isolated adaptive peak, which is particularly shocking with respect to the intriguing geometrical forms of many planktonic organisms.\n \n How should we move on from here? We need to learn more about the biology of the taxa involved, not only for the sake of it, but to seek the authenticity of their cryptic status. Could, for example, some of the sexual/asexual alternating species be genetically clonal instead of cryptic, as has been proposed for many parasitic protozoa, despite their sexuality? In addition, instead of just concentrating on particular cases, we also need systematic and quantitative comparisons across different taxa or habitats, looking for the conditions in which cryptic species will thrive - pursuing their causes whilst decrypting their nature.\n \n FURTHER READING\n Hebert, P. D. et al. Proc. Natl Acad. Sci. USA 101, 14812-14817 (2004).\n Zhang, D. Y. et al. Ecol. Lett. 7, 165-169 (2004).\n Knowlton, N. Annu. Rev. Ecol. Syst. 24 189-216 (1993).\n Sáez, A. G., et al. Proc. Natl Acad. Sci. USA100, 7163-7168 (2003).\n Thierstein, H. R. & Young, J. R. (eds) Coccolithophores: From Molecular Processes to Global Impact 271-366 (Springer, 2004).\n \n \n", 
   {
    "post_info": {
     "post_title": "Mammals ate dinos!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1105660980.0
  ], 
  [
   86869, 
   null, 
   "pandion", 
   "Here's an article from the BBC.\n Fierce mammal ate dinos for lunch\n It is amazing that the fossil beds of China are yielding so much information in such a short time - feathered theropods, early birds, early primates, and now two species of early carnivorous mammals. How fortunate that China has opened it's boarders and allowed the rest of the world to share and participate in the wonders being discovered there.\n \n The American Museum of Natural History printed an amazing series of photos of the Dromaeosauridae (possibly a young Sinornithosaurus) when it was on display there. I printed pictures of both the slab and counterslab that I have on my desk, along with my picture of Archaeopteryx and very near my excellent reproduction of the Berlin specimen that hangs on my wall.\n \n If creationism is correct, that ark is getting more and more crowded.", 
   {}, 
   86576, 
   null, 
   1105810260.0
  ], 
  [
   86911, 
   null, 
   "Tigerlilly", 
   "That's easy. The ark was never crowded, becaues creationism was never correct. Just because some mammals that were large existe then does not equate to everything alive today existed then... it doesn't follow...anyway.", 
   {}, 
   86869, 
   null, 
   1105836120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mammals ate dinos!", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4094-mammals-ate-dinos.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 4094, 
  "discussion_files": [
   [
    "26108.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/4094-mammals-ate-dinos-print.html"
   ]
  ], 
  "identifier": 4094
 }
]