[
 [
  [
   86738, 
   null, 
   "Rev. HellH0und", 
   "On Hardball tonight, Sen. Ted Kennedy talks more about accountability.\"There was submariner who ran his submarine into that mountain underneath the sea. That area wasn't even charted, and they're talking about cashiering him. But we haven't held one person accountable for the mistakes that we've got in Iraq, not one person. I think the American people want to know why.\"\n\n \n \n Whats more amazing. The fact that Chappaquidik Ted wants to talk about accountability or that it involves \"underwater\" shennanigans.... The Gall of this man!\n \n For Reference", 
   {
    "post_info": {
     "post_title": "Ted Kennedy talks more about accountability."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1105736280.0
  ], 
  [
   88811, 
   null, 
   "Tigerlilly", 
   "And attacking the man instead of the position he has is legitimate how? It shouldn't matter if he's a mass-murderor or a saint. All that matters is what he's saying--his origin or hypocrisy notwithstanding", 
   {}, 
   86738, 
   null, 
   1107072780.0
  ], 
  [
   88821, 
   null, 
   "georged", 
   "Whats more amazing. The fact that Chappaquidik Ted wants to talk about accountability or that it involves \"underwater\" shennanigans.... The Gall of this man!\n \n For Reference\n\n \n So, for you, the source of a congressional demand for accountability is more important than the issue? That's about as fine an example of Christian righteousness as I've heard since Bush heard voices telling him to spread democracy.", 
   {}, 
   86738, 
   null, 
   1107103200.0
  ], 
  [
   88848, 
   null, 
   "Dzeron", 
   "So, for you, the source of a congressional demand for accountability is more important than the issue? That's about as fine an example of Christian righteousness as I've heard since Bush heard voices telling him to spread democracy.\n\n \n I think that if Bush is hearing voices, then he can be impeached for being insane.", 
   {}, 
   88821, 
   null, 
   1107119100.0
  ], 
  [
   88852, 
   null, 
   "georged", 
   "I think that if Bush is hearing voices, then he can be impeached for being insane.\n\n \n Not if his Christan God or Jesus is the speaker. Born agains prize their personal relationships with Jesus. To question the validity of personal conversations with God or Jesus and classify them delusional would put most Christian evangelists out of business.", 
   {}, 
   88848, 
   null, 
   1107119760.0
  ], 
  [
   88881, 
   null, 
   "jyoshu", 
   "Born agains prize their personal relationships with Jesus. To question the validity of personal conversations with God or Jesus and classify them delusional would put most Christian evangelists out of business.\n\n \n People with axes to grind against christians prize their deep-rooted prejudice against Christianity. To question the validity of personal biases with religious people and classify them prejudiced would put most anti-christian atheists out of business.", 
   {}, 
   88852, 
   null, 
   1107140820.0
  ], 
  [
   88883, 
   null, 
   "jyoshu", 
   "Whats more amazing. The fact that Chappaquidik Ted wants to talk about accountability or that it involves \"underwater\" shennanigans.... The Gall of this man!\n\n \n Agreed. It's hard to take him seriously about anything when he is supposed to be in prison.", 
   {}, 
   86738, 
   null, 
   1107140880.0
  ], 
  [
   88887, 
   null, 
   "marc9000", 
   "It's been argued a lot by those on the left that American style democracy is something that the Iraqi people can't handle and don't want. Whether or not they can handle it remains to be seen, but the voter turnout today in spite of the danger proves that they WANT it.", 
   {}, 
   86738, 
   null, 
   1107145020.0
  ], 
  [
   89052, 
   null, 
   "Dzeron", 
   "It's been argued a lot by those on the left that American style democracy is something that the Iraqi people can't handle and don't want. Whether or not they can handle it remains to be seen, but the voter turnout today in spite of the danger proves that they WANT it.\n\n \n I think that if they really wanted democracy, there would have been a revolution.", 
   {}, 
   88887, 
   null, 
   1107231900.0
  ], 
  [
   89055, 
   null, 
   "daewoo", 
   "It's been argued a lot by those on the left that American style democracy is something that the Iraqi people can't handle and don't want. Whether or not they can handle it remains to be seen, but the voter turnout today in spite of the danger proves that they WANT it.\n\n \n Don't you think it is a little early to make such a determination? Considering that, with the exception of the canidates that we hand picked to run, everybody on the ballot in central and souther Iraq was running on the platform of \"get the Americans out of the country ASAP\", including promising to ensure that there were provisions in the constitution that disallow American troops in the country (which would be a real bummer since we have already spend 3 billion dollar building permanent bases there), it would seem that until we know the outcome of the election, hazarding a guess about whther they want American style democracy or not is a little premature.\n \n The only folks besides our hand picked canidates who have any real hope of winning a majority are Sistanis picks, every one of which is pushing for closer ties with Iran (some are even advocating asking Iran to annex Iraq).", 
   {}, 
   88887, 
   null, 
   1107233040.0
  ], 
  [
   89073, 
   null, 
   "georged", 
   "I think that if they really wanted democracy, there would have been a revolution.\n\n \n Agreed. We're so conceited we're trying to tell ourselves that our equality based ideology can endure with Islamic Law, in a country with a 99% Muslim population, after we take the guns out of their faces. As if the masses had any real choice other than vote or don't vote about the current election and how they're governed.", 
   {}, 
   89052, 
   null, 
   1107274260.0
  ], 
  [
   89086, 
   null, 
   "jyoshu", 
   "I think that if they really wanted democracy . . .\n\n \n You should try making that comment to an Iraqi widow, who, because she has no rights of her own and no husband to support her, is relegated to living on the streets because of the system she lives in.", 
   {}, 
   89052, 
   null, 
   1107279120.0
  ], 
  [
   89088, 
   null, 
   "georged", 
   "You should try making that comment to an Iraqi widow, who, because she has no rights of her own and no husband to support her, is relegated to living on the streets because of the system she lives in.\n\n \n We're certainly responsible for much of that over almost two years. On an annual basis, we're far ahead of Saddam's widow making machine.", 
   {}, 
   89086, 
   null, 
   1107279720.0
  ], 
  [
   89092, 
   null, 
   "daewoo", 
   "You should try making that comment to an Iraqi widow, who, because she has no rights of her own and no husband to support her, is relegated to living on the streets because of the system she lives in.\n\n \n \n Terrible, isn't it? Under saddam she would have been taken care of (remember, Iraq was a socialist state that had one of the most liberal policies towards women in the ME).\n \n Now we have removed saddam people will starve to death since there is nothing to stop it. As an added bonus, since the Shia will likely be running things from here on out, women will probably loose rights that they previously enjoyed under Saddam.\n \n when you think of ME societies where women have no rights, you are mostly thinking of places like Sadi Arabia and kuwait, our allies, where women are fairly routinely killed over matters of honor and wander around wrapped head to foot in heavy clothing.\n \n Requirements for women to wear veils died a LONG time ago in Iraq. Women under saddam drove, held jobs, voted, and had all the basic rights that a man did.", 
   {}, 
   89086, 
   null, 
   1107282360.0
  ], 
  [
   89093, 
   null, 
   "georged", 
   "Terrible, isn't it? Under saddam she would have been taken care of (remember, Iraq was a socialist state that had one of the most liberal policies towards women in the ME).\n \n Now we have removed saddam people will starve to death since there is nothing to stop it. As an added bonus, since the Shia will likely be running things from here on out, women will probably loose rights that they previously enjoyed under Saddam.\n \n when you think of ME societies where women have no rights, you are mostly thinking of places like Sadi Arabia and kuwait, our allies, where women are fairly routinely killed over matters of honor and wander around wrapped head to foot in heavy clothing.\n \n Requirements for women to wear veils died a LONG time ago in Iraq. Women under saddam drove, held jobs, voted, and had all the basic rights that a man did.\n\n \n Here's a little Islamic primer regarding Islamic female daily habits, Made In The USA, for those Americans who are so caught up in our self-conceit regarding democracy being ideal for all the ME:\n \n http://www.uh.edu/campus/msa/articles/fatawawom/Content.html", 
   {}, 
   89092, 
   null, 
   1107283320.0
  ], 
  [
   89094, 
   null, 
   "jyoshu", 
   "Terrible, isn't it? Under saddam she would have been taken care of (remember, Iraq was a socialist state that had one of the most liberal policies towards women in the ME).\n\n \n Sure, as if that would really be saying much. Let's not pretend Saddam was good to widows or people in general. Listening to anti-war buffs, one would think he was mother Teresa. There are lots of credible reports about him being all too willing to kill off the husbands of many women, just on the basis of suspicion that the victims were not as loyal as they should be.\n \n One other thing, Iraq was NOT a socialist state. It was a dictatorship, period.", 
   {}, 
   89092, 
   null, 
   1107283680.0
  ], 
  [
   89095, 
   null, 
   "jyoshu", 
   "We're certainly responsible for much of that over almost two years. On an annual basis, we're far ahead of Saddam's widow making machine.\n\n \n But far ahead of him in taking care of widows.", 
   {}, 
   89088, 
   null, 
   1107283740.0
  ], 
  [
   89096, 
   null, 
   "Big Orn", 
   "Here's a little Islamic primer regarding Islamic female daily habits, Made In The USA, for those Americans who are so caught up in our self-conceit regarding democracy being ideal for all the ME:\n \n http://www.uh.edu/campus/msa/articles/fatawawom/Content.html\n\n It's so scary it's funny.\n \n E'ry time you pass gas you gotta wash your clothes.\n \n Hope they never eat my grandma's Pintos and Collards....\n \n Democracy - government of the people, etc. - will change all that, though. Right?", 
   {}, 
   89093, 
   null, 
   1107283920.0
  ], 
  [
   89097, 
   null, 
   "daewoo", 
   "Sure, as if that would really be saying much. Let's not pretend Saddam was good to widows or people in general. Listening to anti-war buffs, one would think he was mother Teresa. There are lots of credible reports about him being all too willing to kill off the husbands of many women, just on the basis of suspicion that the victims were not as loyal as they should be.\n\n \n Saddam, while fairly wicked by our standards, was considered in the region to be far more compassionate than most other regional leaders. Saddam claimed the oil fields of Iraq for hte people, and unlike in other places, hea actually shared some of the wealth form the oilfields with the people. For a lot of years, Iraq was the most western ME nation. That is largely why we supported them for so many years.\n \n \nOne other thing, Iraq was NOT a socialist state. It was a dictatorship, period\n\n \n Bull. the baathists are socialists.", 
   {}, 
   89094, 
   null, 
   1107285060.0
  ], 
  [
   89107, 
   null, 
   "jyoshu", 
   "Saddam, while fairly wicked by our standards, was considered in the region to be far more compassionate than most other regional leaders. Saddam claimed the oil fields of Iraq for hte people, and unlike in other places, hea actually shared some of the wealth form the oilfields with the people. For a lot of years, Iraq was the most western ME nation. That is largely why we supported them for so many years.\n\n \n Maybe compared to other leaders in the area, but I just don't think that says very much. \n \n \nBull. the baathists are socialists.\n\n \n After researching this a bit myself, I see that you are right about this. I stand corrected.", 
   {}, 
   89097, 
   null, 
   1107290160.0
  ], 
  [
   89112, 
   null, 
   "daewoo", 
   "Maybe compared to other leaders in the area, but I just don't think that says very much. \n\n \n You really think he was much worse than our own government? If you look at the number of prisoners we hold per capita, and the number that saddam held, we imprison FAR more people per capita than saddam ever did.\n \n We don't specifically sanction torture, but we stick our prisoners in jails and prisons where they are seperated entirely form guards. Instances of rape, abuse, and murder are fairly widespread. If you compare the numebr of people who go into American prisons and die there, and the number of people who went into Iraqi prisons under saddam and died there, we are actually imprisoning and killing far more people than saddam did.\n \n The big hissy fit against saddam seems to be the fact he gassed the kurds. The Kurds at the time were on open rebelion. They were a clear and present danger to the nation. When we were attacked on 9/11, we percieved a clear and present danger to the US and killed roughly 35,000 afghani civilians, then went on to do the same to 100,000 Iraqi civilians. Why are we upset that saddam killed 8 or 10 thousand Kurds to secure his nation, but we are just fine with killing 135,000 civilians to secure ours?", 
   {}, 
   89107, 
   null, 
   1107291600.0
  ], 
  [
   89114, 
   null, 
   "georged", 
   "Saddam, while fairly wicked by our standards, was considered in the region to be far more compassionate than most other regional leaders. Saddam claimed the oil fields of Iraq for hte people, and unlike in other places, hea actually shared some of the wealth form the oilfields with the people. For a lot of years, Iraq was the most western ME nation. That is largely why we supported them for so many years.\n\n \n The administration is now courting Pakistan along the same lines we based affiliation on with pre-Gulf War Iraq. I can't help but laugh at that one. Any American who has looked at the Muslim belief system, centuries of ingrained social customs and the tribal systems that have physical control right now and believes our way of life is easily convertible to a ME Islamic Nation might as well start preaching Satanism to Baptists in the Deep South for real goal achievement.", 
   {}, 
   89097, 
   null, 
   1107292020.0
  ], 
  [
   89115, 
   null, 
   "georged", 
   "The big hissy fit against saddam seems to be the fact he gassed the kurds. The Kurds at the time were on open rebelion. They were a clear and present danger to the nation. When we were attacked on 9/11, we percieved a clear and present danger to the US and killed roughly 35,000 afghani civilians, then went on to do the same to 100,000 Iraqi civilians. Why are we upset that saddam killed 8 or 10 thousand Kurds to secure his nation, but we are just fine with killing 135,000 civilians to secure ours?\n\n \n Because Americans take comfort in the end justifying the means, but disallow it to be used as a rationalization by anyone else.", 
   {}, 
   89112, 
   null, 
   1107292260.0
  ], 
  [
   89116, 
   null, 
   "jyoshu", 
   "You really think he was much worse than our own government? If you look at the number of prisoners we hold per capita, and the number that saddam held, we imprison FAR more people per capita than saddam ever did.\n\n \n That's because Saddam executed at least 147,000 prisoners. Of course the number of them was lower--he didn't keep them around. (http://www.dailystar.com.lb/article.asp?edition_id=10&categ_id=2&article_id=4206)\n \n \nWe don't specifically sanction torture, but we stick our prisoners in jails and prisons where they are seperated entirely form guards. Instances of rape, abuse, and murder are fairly widespread. If you compare the numebr of people who go into American prisons and die there, and the number of people who went into Iraqi prisons under saddam and died there, we are actually imprisoning and killing far more people than saddam did.\n\n \n Prove it.\n \n \nThe big hissy fit against saddam seems to be the fact he gassed the kurds. The Kurds at the time were on open rebelion. They were a clear and present danger to the nation. When we were attacked on 9/11, we percieved a clear and present danger to the US and killed roughly 35,000 afghani civilians, then went on to do the same to 100,000 Iraqi civilians. Why are we upset that saddam killed 8 or 10 thousand Kurds to secure his nation, but we are just fine with killing 135,000 civilians to secure ours?\n\n \n You are forgetting that these \"civilians\" were effectively the military we had to face. When a civilian takes a AK-47 and shoots at you for a nationalist cause, they aren't acting as a civilian any longer.", 
   {}, 
   89112, 
   null, 
   1107292380.0
  ], 
  [
   89118, 
   null, 
   "georged", 
   "\n You are forgetting that these \"civilians\" were effectively the military we had to face. When a civilian takes a AK-47 and shoots at you for a nationalist cause, they aren't acting as a civilian any longer.\n\n \n The administration claims that Iraqi insurgents are from neighboring countries. Iraqis welcome us and desire adopting out ideology and lifestyle. The only condoned nationalism is US occupation or be killed.", 
   {}, 
   89116, 
   null, 
   1107293640.0
  ], 
  [
   89129, 
   null, 
   "daewoo", 
   "That's because Saddam executed at least 147,000 prisoners. Of course the number of them was lower--he didn't keep them around. (http://www.dailystar.com.lb/article.asp?edition_id=10&categ_id=2&article_id=4206)\n\n \n So what? Between 1980 and 2000, 941,000 people died violently in the US criminal justice system. That is one hell of a lot of dead folks. Iraq had 221,000 laws and regulations on thebook (not a bad number). The us has over 300,000,000 laws and regulations on the books. THAT is why we have so many people in prison. We have become an increasingly fascist society over the last 30 years, and one of the key elements of fascism is an almost grotesque fascination with crime and punishement.\n \n \n \nYou are forgetting that these \"civilians\" were effectively the military we had to face. When a civilian takes a AK-47 and shoots at you for a nationalist cause, they aren't acting as a civilian any longer.\n\n \n WRONG. Those numbers are kept seperately. The majority of civilian dead in both Iraq and afghanistan were killed by our \"precision\" munitions. We have adopted policies that put Iraqi civilians at risk in order to keep the number of US troops killed to a minimum. Take a look at the methodology employed in calculating the numbers.\n \n Have your read 1984 by Goerge Orwell? Give it a read. It lays out the current media blitz regarding Saddam Hussein fairly well. \"The enemy of the moment always represented absolute evil, and it followed that any past or future agreement with him would be impossible.\" pg 32\n \n If saddam was such an evil bastard, why was the US his greatest ally, and the source of the majority of his wealth, for most of his presidency? \n \n Now that he has become inconvenient, more likely because we wished to avoid the emabaressment of having to fess up in the face of a clean report from the UN weapons inspector to being the cause of the deaths of countless IRaqis, mostly children, due to our sanctions, than due to any real threat or overt act, we are hard at work transforming him into the very image of absolute evil, and the majority of the country has already scrubbed from their minds that for a VERY long time, he was considered our best buddy in the ME, or that his neiborghing countries feared him not because of his military capabilities, but because in relation to the rest of the ME, Iraq was a virtual western paradise. It was an incredibly progressive country under saddam. Women voted, drove, held jobs. Religous law was supressed and he ran a secular government. In addition, he did what no other leader int eh ME was willing, he shared the income fromthe oil fields. \n \n BUT, we are all supposed to forget that now, view him as absolute evil. Otherwise, how could we possibly justify all the killing? \n \n FRom a practical standpoint, no, he really wasn't that bad a guy. There was no \"reign of terror\". I know, I was in Iraq more than once when saddam was running things. Saddam was put in the difficult position of ruling a poorly concieved nation that is composed of 3 distinct ethnic groups that all hate each other.\n \n We are actively supporting FAR, FAR worse guys (the sauds, the government of pakistan, etc...).", 
   {}, 
   89116, 
   null, 
   1107296880.0
  ], 
  [
   89135, 
   null, 
   "jyoshu", 
   "So what? Between 1980 and 2000, 941,000 people died violently in the US criminal justice system. That is one hell of a lot of dead folks. \n\n \n You are comparing apples and oranges here: Saddam himself had the 147,000 prisoners killed; the number of people who \"died violently\" in prison here in the U.S. include a lot more than just capital punishment cases. Also, Saddam's killings include such justifications as heresay disloyalty toward him.\n \n \nWRONG. Those numbers are kept seperately. The majority of civilian dead in both Iraq and afghanistan were killed by our \"precision\" munitions.\n\n \n Then the figure you cited as 135,000 civilian deaths in both engagements is bull. NO ONE (who isn't just trying to spread baseless propaganda) seriously thinks there have been that many civilian deaths in IRaq--not even antiwar groups: (http://www.iraqbodycount.net/database/ - Note that their count is currently between 17 and 18 thousand, and real-world numbers are probably far less.\n \n \nwe are hard at work transforming him into the very image of absolute evil, and the majority of the country has already scrubbed from their minds that for a VERY long time, he was considered our best buddy in the ME,\n\n \n No, Israel's leaders have always been our \"best buddies\" in the ME.\n \n \nIt was an incredibly progressive country under saddam. Women voted, drove, held jobs. Religous law was supressed and he ran a secular government. In addition, he did what no other leader int eh ME was willing, he shared the income fromthe oil fields. \n \n FRom a practical standpoint, no, he really wasn't that bad a guy. There was no \"reign of terror\". \n \n \n You're living in an absolute naive dream world about this guy. I think I should be trying to sell YOU the beachfront property.", 
   {}, 
   89129, 
   null, 
   1107300480.0
  ], 
  [
   89145, 
   null, 
   "daewoo", 
   "You are comparing apples and oranges here: Saddam himself had the 147,000 prisoners killed; the number of people who \"died violently\" in prison here in the U.S. include a lot more than just capital punishment cases. Also, Saddam's killings include such justifications as heresay disloyalty toward him.\n\n \n So we stick people in prison and let the other prisoners kill them instead of doing it directly. There is little difference. \n \n What we are calling \"disloyalty towards him\" was not. Here, we would call it \"treason\", and we execute people for it, too. THere were a lot of anti government protests in Iraq, and nobody really cared (I saw one first hand). The people he was executing were people who were planning violent revolutions or actively plotting to overthrow the government. Most of them were Shia, who wished to see the coutry thorw off the westernization it had undergone and return to a stricter observacne of muslim law, where women were oppressed and they took their marching orders from religous leaders. \n \n BTW, for all the press that Saddams massive executions over the last 20 yrs have gotten, so far we have only found about 5000 bodies using eye witness accounts of where such people were buried. It seems that maybe the numbers being circulated to support the invasion now that our original justification has fallen through may be a bunch of BS\n \n Now, thanks to our intervention, the islamic fundamentalists will get a crack at running the coutry. USA ALL THE WAY\n \n \n \n \nThen the figure you cited as 135,000 civilian deaths in both engagements is bull. NO ONE (who isn't just trying to spread baseless propaganda) seriously thinks there have been that many civilian deaths in IRaq--not even antiwar groups: (http://www.iraqbodycount.net/database/ - Note that their count is currently between 17 and 18 thousand, and real-world numbers are probably far less.\n\n \n Wrong answer, bucko. The figures at that page are the number of civilians who were killed and reported in the international media. Every case is fully documented, and in order to count had to be documented by at least 2 news sources.\n \n The best number we have now is closer to 100,000. Here are a couple of articles:\n \n http://www.guardian.co.uk/Iraq/Story/0,2763,1338749,00.html\n \n http://www.nytimes.com/2004/10/29/international/europe/29casualties.html?ex=1107406800&en=a561a0a27a9da596&ei=5070\n \n \n The second actually discusses the page you linked, as well as giving a statement from the guy who runs it. \n \n The methodology used in the study is a standard, approved methodology foe estimating such things. It was peer reviewed, and found to be correctly done. There has been some argument that it is invalid because at one point it says 800-98,000 wiht a 95% CI. This is little more than a pathetic, childish smear since the data is available in the report and is clearly outlined.\n \n So, we have killed roughly 135,000 people in order to avenge the death of 3000 killed at the world trade center. Yep, that is a lot of people. Hard to believe that we have wiped out over 100,000 people in one country and still claim we are doing somethign good there.\n \n \n \n \nNo, Israel's leaders have always been our \"best buddies\" in the ME.\n\n \n Wrong answer there, too. Besides the fact that we have a strong jewish element in this country that can count on holocaust guilt to humble americans when they feel they need to exert some political pressure, we care nothing about israel.\n \n Israels is a worthless little country., They have no natural resources, no oil, no real industry, and nobody in their right mond would do business with them. They are afloat only because whenever they get into a jam, the US shows up with a big sack of gold. \n \n Without US intervention, Israel would be gone within a year, and frankly the entire region would be better for it, and the US would be more secure. \n \n For YEARS our greatest allies in the middle east have been the saudis. Sure, they are a bunch of totalitarin facists whose people have no rights, women are treated horribly, and people are routinely removed (nice way of saying killed) for defaming the house of saud. \n \n As opposed to israel, which is too small and wretched a country to do us any good at all, the sauds are sitting on a huge reserve of oil. This makes them our buddies. \n \n \n \nYou're living in an absolute naive dream world about this guy. I think I should be trying to sell YOU the beachfront property.\n\n \n Again, I was there. I saw Iraq under saddam more than once. It was far better than the rest of the ME. All you seem to know about him is the horror rumors that have circulated since his downfall. YES, he was your typical selfish dictator, and YES, he ruled his country with a hard hand. Now that hte US has had a shot at ruling his country, and botched it horribly despite the fact that we have kileld far more per year than he ever dreamed, you would think that we would be at least a little humbled, or at least Humbled enough to not be shooting our mouths off out of turn and without knowing what we were talking about.\n \n WAR IS PEACE\n FREEDOM IS SLAVERY\n IGNORANCE IS STRENGTH\n \n You have the first and third down pat. Work on #2 and you will be a model fascist.", 
   {}, 
   89135, 
   null, 
   1107304140.0
  ], 
  [
   89159, 
   null, 
   "marc9000", 
   "Don't you think it is a little early to make such a determination? Considering that, with the exception of the canidates that we hand picked to run, everybody on the ballot in central and souther Iraq was running on the platform of \"get the Americans out of the country ASAP\", including promising to ensure that there were provisions in the constitution that disallow American troops in the country (which would be a real bummer since we have already spend 3 billion dollar building permanent bases there), it would seem that until we know the outcome of the election, hazarding a guess about whther they want American style democracy or not is a little premature. \n\n \n The Iraqi people knew that the vote was initiated by the U.S., and the terrorists did not want them voting at all. They knew the best way to show their disaproval of U.S. occupation was to stay home and please the terrorists. Not risk their lives to vote, as they knew the U.S. troops wanted them to do. I can't believe that you imply that they disagree with the idea of voting, after a voter turnout like that.", 
   {}, 
   89055, 
   null, 
   1107313680.0
  ], 
  [
   89160, 
   null, 
   "marc9000", 
   "I think that if they really wanted democracy, there would have been a revolution.\n\n \n A revolution? emoticon_rolleyes An unarmed, oppressed population revolting against today's multi million dollar dictatorships? ANYTHING they tried to come up with would be crushed so quick it wouldn't even make the Al-jezeera news.", 
   {}, 
   89052, 
   null, 
   1107313980.0
  ], 
  [
   89161, 
   null, 
   "daewoo", 
   "The Iraqi people knew that the vote was initiated by the U.S., and the terrorists did not want them voting at all. They knew the best way to show their disaproval of U.S. occupation was to stay home and please the terrorists. Not risk their lives to vote, as they knew the U.S. troops wanted them to do. I can't believe that you imply that they disagree with the idea of voting, after a voter turnout like that.\n\n \n They voted under saddam, so the concept was not entirely new to them, and the elections were rigged under saddam, so that is not a new concept, either.\n \n Besides the guys that we hand picked (and if they are elected we will likely be run out of the country in 30 days since the Shia will almost certianly join in th attacks), everybody who ran did so on the basis of getting the US out of the country. The only question was how fast it could be done, and whether or not it could actually be written into the constitution.\n \n That being the case, calling the fact that people voted a sign of approval for the occupation is ludicrous. The shia endorsed the elections because they believed it was the only way to get us gone.", 
   {}, 
   89159, 
   null, 
   1107314520.0
  ], 
  [
   89162, 
   null, 
   "daewoo", 
   "A revolution? emoticon_rolleyes An unarmed, oppressed population revolting against today's multi million dollar dictatorships? ANYTHING they tried to come up with would be crushed so quick it wouldn't even make the Al-jezeera news.\n\n \n That same \"unarmed, oppressed population\" sure seems to have kicked the snot out of the most powerful military in the world. I wonder how they would have done against Saddams 20 yr old tanks and conscript army? \n \n Nobody in the ME is unarmed.", 
   {}, 
   89160, 
   null, 
   1107314760.0
  ], 
  [
   89173, 
   null, 
   "georged", 
   "Interesting since Afghanistan's newly elected democratic government, body-guarded by 20,000 US special forces members with air support, controls less than 20% of that country. Russia, with a military as technically advanced as it got, left there in defeat after eight years. 60% of Iraq voted, most in hope that their occupiers, the US, will leave. Only our Iraqi puppet, facing possible defeat by a political coalition backed by Shia and Sunni clerics, is publicly stating we'll stay. I point out that the success of spreading democracy or anything else with a gun requires that the target be completely defeated, destroyed, demoralized and prepared to accept anything to support change not generated from within. Germany and Japan are perfect examples. Vietnam, Afghanistan and Iraq are not defeated countries. There's a strong internal spark in each of them , in the case of Iraq several sparks, that defies sub-servience without total domination. I hope we're not so foolish as to pick on a truely tough country.", 
   {}, 
   89160, 
   null, 
   1107317940.0
  ], 
  [
   89199, 
   null, 
   "jyoshu", 
   "So we stick people in prison and let the other prisoners kill them instead of doing it directly. There is little difference. \n\n \n Sure there is. One is direct action of the govt, the other is not.\n \n \nWhat we are calling \"disloyalty towards him\" was not. Here, we would call it \"treason\", and we execute people for it, too. THere were a lot of anti government protests in Iraq, and nobody really cared (I saw one first hand). The people he was executing were people who were planning violent revolutions or actively plotting to overthrow the government.\n\n \n Are you sure you're name isn't Taraq Aziz, or something? I'm now convinced I would really like for you to see my swampland that's for sale now.\n \n \nThe best number we have now is closer to 100,000. Here are a couple of articles:\n \n So, we have killed roughly 135,000 people in order to avenge the death of 3000 killed at the world trade center. Yep, that is a lot of people. Hard to believe that we have wiped out over 100,000 people in one country and still claim we are doing somethign good there.\n\n \n There is nothing there to indicate that those numbers are any more accurate than the numbers I showed you. Going house to house (esp. in fallujah) to get information on this is obviously inviting a biased view of the situation. The problem is that you are only wanting to believe the numbers that are most high, because it fits your biases against the administration. You should do some research on the way military munitions work before automatically believing the worst stats you could find.\n \n \nWAR IS PEACE\n\n \n I'm glad the allies didn't take your view of war in WW2.", 
   {}, 
   89145, 
   null, 
   1107361260.0
  ], 
  [
   89200, 
   null, 
   "jyoshu", 
   "That same \"unarmed, oppressed population\" sure seems to have kicked the snot out of the most powerful military in the world.\n\n \n You sound like Mohammed Saeed al-Sahaf (Iraqi Minister of Information under Saddam) as U.S. troops were closing in on Baghdad.\n \n Among his many quotes . . .\n \n \"We have destroyed 2 tanks, fighter planes, 2 helicopters and their shovels - We have driven them back.\" \n \n \"We have them surrounded in their tanks\"\n \n \"Now even the American command is under siege. We are hitting it from the north, east, south and west. We chase them here and they chase us there. But at the end we are the people who are laying siege to them. And it is not them who are besieging us.\"", 
   {}, 
   89162, 
   null, 
   1107361680.0
  ], 
  [
   89201, 
   null, 
   "daewoo", 
   "Are you sure you're name isn't Taraq Aziz, or something? I'm now convinced I would really like for you to see my swampland that's for sale now.\n\n \n Sorry, that just the way it ws, buster, changing history to support a new rationaization for war now that our original ones have fallen through is deplorable. The fact that the American public is stupid enough to fall ofr it is just sad.\n \n \n \n \nThere is nothing there to indicate that those numbers are any more accurate than the numbers I showed you. Going house to house (esp. in fallujah) to get information on this is obviously inviting a biased view of the situation. The problem is that you are only wanting to believe the numbers that are most high, because it fits your biases against the administration. You should do some research on the way military munitions work before automatically believing the worst stats you could find.\n\n \n If you checked, fallujah was specifically excluded from the study (the results from falluja were not included in calculations). \n \n Picking specific incidents from press reports is not an approved method of demographic study. Here is an article that explains the methodology used in the study:\n \n http://www.zmag.org/content/showarticle.cfm?SectionID=15&ItemID=6565%20\n \n \n \nI'm glad the allies didn't take your view of war in WW2\n\n \n WWII was the result of a direct threat. Gulf II had nothing to do with a direct threat.\n \n I'm telling you, you have 1 and 3 down, just hget tigerlilly to help you with number 2 (I don't need facts or a rational basis, I have this MAINSTREAM textbooks), and you will be a model fascist.", 
   {}, 
   89199, 
   null, 
   1107361980.0
  ], 
  [
   89203, 
   null, 
   "daewoo", 
   "You sound like Mohammed Saeed al-Sahaf (Iraqi Minister of Information under Saddam) as U.S. troops were closing in on Baghdad.\n \n Among his many quotes . . .\n \n \"We have destroyed 2 tanks, fighter planes, 2 helicopters and their shovels - We have driven them back.\" \n \n \"We have them surrounded in their tanks\"\n \n \"Now even the American command is under siege. We are hitting it from the north, east, south and west. We chase them here and they chase us there. But at the end we are the people who are laying siege to them. And it is not them who are besieging us.\"\n\n \n Uh Huh.\n \n Currently, the only sections of Iraq that we have fully secured are the green zone and some outlying US bases. We have flushed billions of dollars down the toilet, and there are still LARGE sections of baghdad where we just cannot go. \n \n I hope we don't have too many more \"victories\" like this one!", 
   {}, 
   89200, 
   null, 
   1107362340.0
  ], 
  [
   89207, 
   null, 
   "georged", 
   "Sorry, that just the way it ws, buster, changing history to support a new rationaization for war now that our original ones have fallen through is deplorable. The fact that the American public is stupid enough to fall ofr it is just sad.\n\n \n Sad, but not unusual. Due to professional studies that would make a children's cereal manufacturer proud and non-disclosed planning, politicians have a keen grasp on what the country will swallow and where they balk at political schemes. A public that can accept non-defensive war based on a swing from suspicion of WMDs to using force in supposedly spreading democracy throughout the ME by simple policy restatement is not exactly the sharpest knife in the drawer.", 
   {}, 
   89201, 
   null, 
   1107364620.0
  ], 
  [
   89236, 
   null, 
   "Alan Ryan", 
   " A public that can accept non-defensive war based on a swing from suspicion of WMDs to using force in supposedly spreading democracy throughout the ME by simple policy restatement is not exactly the sharpest knife in the drawer.\n\n \n Now that the only remaining justification for the American invasion of Iraq turns out to be the replacement of Saddam's regime by a limited democracy impregnated with local theologies (which might be the prelude to yet more bloodshed) - perhaps we ought to remember that a number of countries in recent memory have managed to make the transition from dictatorship, war lordism etc. to \"democratic infancy\" without any American intervention. The most recent one being the Ukraine.\n \n Where the US has been involved directly or by proxy in regime changes, the political outcomes have not been entirely satisfactory: I'm thinking of Haiti, Lebanon, Kosovo, Somalia, etc. \n \n I know Mr Bush is currently receiving a lot of credit for a very modest and perhaps temporary gain in Iraq which has cost a great deal, but we must wait until the dust settles (if it ever does) before jumping to conclusions.\n \n When in 1956, Anthony Eden attempted (with French/Israeli assistance) to impose a government in Egypt that would meet with western approval, the purists at the time concluded that he was more or less off his onion.", 
   {}, 
   89207, 
   null, 
   1107370920.0
  ], 
  [
   89242, 
   null, 
   "JPSartre12", 
   "......Again, I was there. I saw Iraq under saddam more than once. It was far better than the rest of the ME. All you seem to know about him is the horror rumors that have circulated since his downfall. YES, he was your typical selfish dictator, and YES, he ruled his country with a hard hand. Now that hte US has had a shot at ruling his country, and botched it horribly despite the fact that we have kileld far more per year than he ever dreamed, you would think that we would be at least a little humbled, or at least Humbled enough to not be shooting our mouths off out of turn and without knowing what we were talking about.\n\n \n Since you've been to the ME a number of times, did you ever visit Iran while the Shah was in power? From what I've read, it was the closest thing to a modern Westernized civilization that the ME has ever seen.", 
   {}, 
   89145, 
   null, 
   1107373560.0
  ], 
  [
   89247, 
   null, 
   "daewoo", 
   "Since you've been to the ME a number of times, did you ever visit Iran while the Shah was in power? From what I've read, it was the closest thing to a modern Westernized civilization that the ME has ever seen.\n\n \n \n Nope. I have never been to Iran. Even when the shah was in charge, there were plenty of religous fundamentalists in Iraq who were willing to kill americans, and even under the shah, there was no consequence for such things.", 
   {}, 
   89242, 
   null, 
   1107374820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Ted Kennedy talks more about accountability.", 
  "url": "http://www.4forums.com/political/politics-debates/4099-ted-kennedy-talks-more-about-accountability.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 4099, 
  "discussion_files": [
   [
    "16496.html", 
    "http://www.4forums.com/political/politics-debates/4099-ted-kennedy-talks-more-about-accountability-print.html"
   ], 
   [
    "16497.html", 
    "http://www.4forums.com/political/politics-debates/4099-ted-kennedy-talks-more-about-accountability-3-print.html"
   ], 
   [
    "16498.html", 
    "http://www.4forums.com/political/politics-debates/4099-ted-kennedy-talks-more-about-accountability-2-print.html"
   ]
  ], 
  "identifier": 4099
 }
]