[
 [
  [
   86741, 
   null, 
   "Anastasia", 
   "Last night at the dinner table my oldest son was telling us about his health class. He is 14, on the football team, typical man/boy :)\n They had guest speakers, I think it was a homosexual man, lesbian and bisexual women. They answered questions, and talked about their experiences.\n My question for all of you is... How do you feel about this. The school did not send a note home to make us aware.\n Little background....\n I support gay rights, have a ton of gay friends, when I was tattooing I would say 80% of my clientele was gay. My son has been raised around gay people and has no problems with anyone. We are a very eclectic family :)\n Even though I fully support the cause why was I little miffed that I was not made aware of the speakers. And to top it off I am miffed that I am miffed.. Does this make any sense?\n Your thoughts please :)", 
   {
    "post_info": {
     "post_title": "Gay Education"
    }
   }, 
   null, 
   null, 
   1105736640.0
  ], 
  [
   86745, 
   null, 
   "JustineCredible", 
   "Last night at the dinner table my oldest son was telling us about his health class. He is 14, on the football team, typical man/boy :)\n They had guest speakers, I think it was a homosexual man, lesbian and bisexual women. They answered questions, and talked about their experiences.\n My question for all of you is... How do you feel about this. The school did not send a note home to make us aware.\n Little background....\n I support gay rights, have a ton of gay friends, when I was tattooing I would say 80% of my clientele was gay. My son has been raised around gay people and has no problems with anyone. We are a very eclectic family :)\n Even though I fully support the cause why was I little miffed that I was not made aware of the speakers. And to top it off I am miffed that I am miffed.. Does this make any sense?\n Your thoughts please :)\n\n \n Actually yes, you make perfect sence, to me at least. Having a son nearly the same age as yours (actually mine is older) I too would have been a bit miffed, as you put it, if my son's school had not made parents aware this was going to occur. \n Mainly because I feel it's up the the parents to dictate what their child is exposed to. Granted, you probably didn't have as much a problem with the subject matter as would say an Evangelical family. I think the school should have thought it through a little better.", 
   {}, 
   86741, 
   null, 
   1105737420.0
  ], 
  [
   86757, 
   null, 
   "BobNelson2", 
   "Even though I fully support the cause why was I little miffed that I was not made aware of the speakers. \n\n \n That's your latent prejudice at work.\n \n \nAnd to top it off I am miffed that I am miffed..\n\n \n That's your conscience making you feel bad about your latent prejudice.\n \n :) \n \n \n \nDoes this make any sense? Your thoughts please \n\n \n Of course it does. Especially if the maternal protective instinct kicked in.\n \n As for its appropriateness, by age 14 -- even without the exposure your son has had living in an eclectic family -- homosexuality is hardly \"news\". It was a major topic of the election season, afterall.", 
   {}, 
   86741, 
   null, 
   1105739280.0
  ], 
  [
   86759, 
   null, 
   "Anastasia", 
   "That's your latent prejudice at work.\n That's your conscience making you feel bad about your latent prejudice.\n \n :) \n \n Of course it does. Especially if the maternal protective instinct kicked in.\n \n As for its appropriateness, by age 14 -- even without the exposure your son has had living in an eclectic family -- homosexuality is hardly \"news\". It was a major topic of the election season, afterall.\n\n Very true...\n But I really dont have any prejudice, or at least like you say I would like to think I don't.. interesting :)\n Nonetheless I was not really upset about it, we moved on to other things during dinner, never gave it a second thought.\n Maybe I would like to know who is speaking so I can be sure it wasnt any of those crazy reform gay people :)\n emoticon_xangel", 
   {}, 
   86757, 
   null, 
   1105739520.0
  ], 
  [
   86772, 
   null, 
   "BobNelson2", 
   "never gave it a second thought.\n\n \n Posting on a website, days later, qualifies as a \"second thought\".\n \n :) \n \n \n \nMaybe I would like to know who is speaking so I can be sure it wasnt any of those crazy reform gay people :)\n emoticon_xangel\n\n \n It might have been instructive to have both varieties.", 
   {}, 
   86759, 
   null, 
   1105743060.0
  ], 
  [
   86774, 
   null, 
   "BobNelson2", 
   "How do you feel about this. \n\n \n I have to confess that in a way, it makes me sort of sad. I was a speaker for a similar round of discussions in high schools in the community around my university some (gasp!) 25+ years ago. Regardless of how far we've come in less than three decades, it's still a bit dispiriting that this is still necessary.\n \n These days, I'm sure that there's much less of the wide-eyed wonder at the actual presence of a h-o-m-o-s-e-x-u-a-l on the face of some of the kids. There was a zoo-exhibit-like aspect to our visit. On the other hand, I'm sure there are still a couple kids sitting there with eyes wide in terror and fear. \n \n I remember one kid in one class. Still breaks my heart. He was so scared and so sad.", 
   {}, 
   86741, 
   null, 
   1105743720.0
  ], 
  [
   86778, 
   null, 
   "Anastasia", 
   "Posting on a website, days later, qualifies as a \"second thought\".\n \n :) \n \n \n \n \n It might have been instructive to have both varieties.\n\n Well OK I guess it is a second thought, but as we were having the talk, I had mentioned putting the topic here. :)\n \n And as far as having both, I think that is where I would have to put my foot down, I would not want some religious fanatic telling my son that gays can be reformed.", 
   {}, 
   86772, 
   null, 
   1105745400.0
  ], 
  [
   86780, 
   null, 
   "BobNelson2", 
   "And as far as having both, I think that is where I would have to put my foot down, I would not want some religious fanatic telling my son that gays can be reformed.\n\n \n I was kidding about that.", 
   {}, 
   86778, 
   null, 
   1105745760.0
  ], 
  [
   86910, 
   null, 
   "jyoshu", 
   ". . . . when I was tattooing I would say 80% of my clientele was gay. \n\n \n I know that this is aside from the subject of the thread, but why might this be? Do you do your tatooing in a predominately gay area or cater to gay people? Do gay people just like to get tatoos? Is it the gay \"alternate lifestyle\" thing? It just seems odd that since gay people supposedly comprise around 3-7% (or whatever) of the general population, why your clientele would be 80% gay.", 
   {}, 
   86741, 
   null, 
   1105836120.0
  ], 
  [
   86912, 
   null, 
   "jyoshu", 
   "Regarding the thread, I too would be miffed if there had been a guest speaker at the school my kids went to that I had not known about beforehand if at all possible.\n \n I think the fact that you have the same feelings shows that one can feel this way and it not be rooted in prejudice at all (since you claim to be un-prejudiced toward gay people).", 
   {}, 
   86910, 
   null, 
   1105836240.0
  ], 
  [
   86918, 
   null, 
   "wsm2506", 
   "Regarding the thread, I too would be miffed if there had been a guest speaker at the school my kids went to that I had not known about beforehand if at all possible.\n \n I think the fact that you have the same feelings shows that one can feel this way and it not be rooted in prejudice at all (since you claim to be un-prejudiced toward gay people).\n\n \n I would be miffed also. Not only that the parents weren't notified, but as to what the content might have been. I think it would be wrong to present a biased opinion one way or the other to childern.", 
   {}, 
   86912, 
   null, 
   1105837440.0
  ], 
  [
   86955, 
   null, 
   "zachvac", 
   "Actually yes, you make perfect sence, to me at least. Having a son nearly the same age as yours (actually mine is older) I too would have been a bit miffed, as you put it, if my son's school had not made parents aware this was going to occur. \n Mainly because I feel it's up the the parents to dictate what their child is exposed to. Granted, you probably didn't have as much a problem with the subject matter as would say an Evangelical family. I think the school should have thought it through a little better.\n\n \n I am about that age, 15, and I don't see what the problem would be. This is most likely part of the health curriculum. If they are teaching kids about gay people, what better way than to introduce them to one. I'm sorry but a parent doesn't get to dictate what their child is exposed to once they are put in public school or any non-home school situation. One of the main points in schools are to get the children ready socially for the world as well, and since this includes gay people that only makes since. I may have a problem if he was actually trying to convince the children that they should be gay or that they were somehow inferior to others, but I doubt that's the case. If a Christian came in to talk about religion in a religious studies class would you be outraged? As long as they talked in an informative tone and not \"we're right because...\" than that's fine with me, and that's coming from an atheist.", 
   {}, 
   86745, 
   null, 
   1105856760.0
  ], 
  [
   86957, 
   null, 
   "wsm2506", 
   "I am about that age, 15, and I don't see what the problem would be. This is most likely part of the health curriculum. If they are teaching kids about gay people, what better way than to introduce them to one. I'm sorry but a parent doesn't get to dictate what their child is exposed to once they are put in public school or any non-home school situation. One of the main points in schools are to get the children ready socially for the world as well, and since this includes gay people that only makes since. I may have a problem if he was actually trying to convince the children that they should be gay or that they were somehow inferior to others, but I doubt that's the case. If a Christian came in to talk about religion in a religious studies class would you be outraged? As long as they talked in an informative tone and not \"we're right because...\" than that's fine with me, and that's coming from an atheist.\n\n \n If you are, in fact, about 15, you are indeed an astute young man.", 
   {}, 
   86955, 
   null, 
   1105857180.0
  ], 
  [
   86997, 
   null, 
   "JustineCredible", 
   "I am about that age, 15, and I don't see what the problem would be. This is most likely part of the health curriculum.\n\n \n \n Ok, hold on here a second, don't get your briefs in a bunch just yet. As a fifteen year old you are by nature going to be headstrong. I understand that. \n But please don't get so upset. Remember, I am gay.\n \n \n \n If they are teaching kids about gay people, what better way than to introduce them to one. I'm sorry but a parent doesn't get to dictate what their child is exposed to once they are put in public school or any non-home school situation.\n\n \n \n Nope, that's where you are wrong. \n Parents are notified about other school activities because it is definitely up to the parent as to what a child is exposed to. \n Public school does NOT mean a school has free reign as to what it puts into its curriculum. Pubic schools are funded by tax dollars, voted on by citizens of the area in question and mandated by the feds, states, counties and town where the schools reside. \n Curriculums are indeed a parents perogative to know.\n \n \n One of the main points in schools are to get the children ready socially for the world as well, and since this includes gay people that only makes since. I may have a problem if he was actually trying to convince the children that they should be gay or that they were somehow inferior to others, but I doubt that's the case.\n\n \n I doubt it too, but not all parents would feel that way. Some have very strong sentiments about sexuality. Not just sex, per se, but the idea of sexuality. Do not confuse the two.\n \n \n If a Christian came in to talk about religion in a religious studies class would you be outraged?\n\n \n I think the question here is what was a religious studies class doing in a Public School setting to begin with? \n \n Health class is about personal health. Yes, sexual health is most definitely a part of that, but sexuality is not. That really moreover belongs in a sociology class setting. \n \n \n As long as they talked in an informative tone and not \"we're right because...\" than that's fine with me, and that's coming from an atheist.\n\n \n \n Again, I agree. No, if a Christian came in to talk to a \"religions\" class I wouldn't have a problem with it. I would however have a problem with religious studies classes being taught in a public school. I don't feel they belong there. \n As far as people who were clearly identified as Gay, Lesbian and Bisexual coming to speak to a health class I feel is out of context. \n Sure there are health issues which uniquely impact gays/lesbians and bisexuals, but to bring in speakers who are identified as such draws the wrong conclussions. \n One does not need to be gay to understand gay health issues. Nor does a person speaking on gay health issues need to be identified as being gay. It shouldn't matter who or how the speaker identifies him/herself. As long as the information given is accurate and unbiased the speakers gender, sexual identity, race, relgion, age or physical ability should not matter. \n Again, it's moreover an issue of merit vs. status. \n \n But, since the speakers were indeed identified as being gay, lesbian and bisexual, my question would be moreover what was the subject matter at hand? \n If it was about being or identifying as gay, lesbian and bisexual I feel that it's more of a societal issue and would be better served in a sociology setting.", 
   {}, 
   86955, 
   null, 
   1105900020.0
  ], 
  [
   87019, 
   null, 
   "BobNelson2", 
   "Health class is about personal health. Yes, sexual health is most definitely a part of that, but sexuality is not. That really moreover belongs in a sociology class setting. \n\n \n How in the world could one teach a course about sexual health and biology without mentioning sexual orientation?\n \n Discussion of gay people belongs in schools not because it's \"the right thing to do\", not because \"it promotes tolerance\", but because it's REALITY. Schools, first and foremost, are there to teach about the world.\n \n For the same reason, it would be entirely appropriate for a school to have a religious studies course. Not to study ONE religion, but to study religion and it's influence on world history, etc. Of course, it would probably be an elective. Mandatory history and literature courses (if they still require those at all) should address religion in the context of the subject matter. They should probably also address homosexuality, at least in the context of the many historical figures who were homosexual.", 
   {}, 
   86997, 
   null, 
   1105915440.0
  ], 
  [
   87071, 
   null, 
   "zachvac", 
   "\n Nope, that's where you are wrong. \n Parents are notified about other school activities because it is definitely up to the parent as to what a child is exposed to. \n Public school does NOT mean a school has free reign as to what it puts into its curriculum. Pubic schools are funded by tax dollars, voted on by citizens of the area in question and mandated by the feds, states, counties and town where the schools reside. \n Curriculums are indeed a parents perogative to know.\n \n\n Yes to a certain extent. If a parent has an issue exposing a child to math, they don't get that choice. If they don't like that the kid is learning about the Holocaust that's too bad, unless they are going to teach their child, in which case they will still need to teach these things, just they can however they want. I don't think the school would agree if a parent didn't want their child exposed to the pledge (a prayer many say, but definately a reference to God) and wanted to have their child excused 5 minutes before to get out of earshot and then come back. The school wouldn't allow that. In our health class (I took it over the summer) we learned about homosexuals and there was a specific assignment where the whole premise was proving that AIDS was not a gay disease, I can see where many religious parents may have a problem with that. Although parents can withdraw their child from the sex portion of health with a note, they weren't told that this would be taught with such a perspective.\n \n \n\n I doubt it too, but not all parents would feel that way. Some have very strong sentiments about sexuality. Not just sex, per se, but the idea of sexuality. Do not confuse the two.\n \n\n The point of school is to get people to be benificial to society at the end. This includes erasing bigotry and hatred of blacks as well as other groups like atheists or gays or any other minority group. In their life they are going to meet at least one gay person. They can't leave school thinking that all gays are evil and are going to hell.\n \n \n\n I think the question here is what was a religious studies class doing in a Public School setting to begin with? \n \n\n OK, what's wrong with this, as long as you sign up for it and it is purely from an objective view. It's not as in \"God created the world blah blah blah\" but it's (or should be) \"Christians believe God created the world blah blah blah, but Muslims believe blah and Jews believe blah\". Obviously not that fast but they would learn a variety of religions and I think it would be very beneficial to know what a lot of people believe. As long as it's not mandatory and taught from a purely objective standpoint, I have no problem with it being in public schools.\n \n \n\n Health class is about personal health. Yes, sexual health is most definitely a part of that, but sexuality is not. That really moreover belongs in a sociology class setting. \n \n\n I don't know if it belongs in the curriculum, but it is there in the health curriculum where I live.\n \n \n\n Again, I agree. No, if a Christian came in to talk to a \"religions\" class I wouldn't have a problem with it. I would however have a problem with religious studies classes being taught in a public school. I don't feel they belong there. \n As far as people who were clearly identified as Gay, Lesbian and Bisexual coming to speak to a health class I feel is out of context. \n Sure there are health issues which uniquely impact gays/lesbians and bisexuals, but to bring in speakers who are identified as such draws the wrong conclussions. \n One does not need to be gay to understand gay health issues. Nor does a person speaking on gay health issues need to be identified as being gay. It shouldn't matter who or how the speaker identifies him/herself. As long as the information given is accurate and unbiased the speakers gender, sexual identity, race, relgion, age or physical ability should not matter. \n Again, it's moreover an issue of merit vs. status. \n \n But, since the speakers were indeed identified as being gay, lesbian and bisexual, my question would be moreover what was the subject matter at hand? \n If it was about being or identifying as gay, lesbian and bisexual I feel that it's more of a societal issue and would be better served in a sociology setting.\n\n \n I don't know which class it should be taught in. Basically our 10th grade health class covered most topics they weren't allowed to cover until then by law. They weren't allowed to talk about gays, sex, drugs, alchohol, etc. except for \"don't do drugs, they're bad\" or \"sex is bad, wait until you're older\". In the south, they aren't even allowed to teach anything except for abstinence until mariage ever in school. I'm not sure if it's the same at the original poster's son's school but basically it was supposed to cover everything they couldn't cover until then.", 
   {}, 
   86997, 
   null, 
   1105940460.0
  ], 
  [
   87099, 
   null, 
   "jyoshu", 
   "I don't really have a problem with a health class acknowledging the existence of gay people, if it can do it without giving the movement a strong sense of legitimacy. Of course it exists, but should we also allow health class to talk about such things as protecting one's health in polygamous relationships? How about the health issues of incest? Certainly these things exist in some cases as well.", 
   {}, 
   87019, 
   null, 
   1105978260.0
  ], 
  [
   87205, 
   null, 
   "JustineCredible", 
   "I don't really have a problem with a health class acknowledging the existence of gay people, if it can do it without giving the movement a strong sense of legitimacy. Of course it exists, but should we also allow health class to talk about such things as protecting one's health in polygamous relationships? How about the health issues of incest? Certainly these things exist in some cases as well.\n\n \n \n As crazy as it may seem, I actually find myself agreeing with you here. \n As far as incestuous relationships there are indeed certain health issues which are unique to those types of relationships. Mainly birth defects. \n The same does not completely hold true for polygamous relationships, because even though they are polygamous those involved are still monogamous to their partners. Polygamous does not equal promiscuous. They just aren't the same. \n STD's and birth defects of issue to incest and promiscuity aren't of issue in committed polygamous or monogamous relationships regardless of gender.", 
   {}, 
   87099, 
   null, 
   1106012700.0
  ], 
  [
   87361, 
   null, 
   "Black Phoenix", 
   "wow...hmm....well in regards to the topic yes I would be more than outraged I would most likely have the head of the teacher and principle on a platter, well the teacher at very least. I don't see how one's sexual orientation is related to a class designed to educate in matters of HEALTH not about sexual preferences especially at the age. It's not like they are ignorant of the fact that yes there are Homosexuals, much more explicit and bolder than ever before. I feel it's the parents right to know these things, just as Justine put.....which I commend you for....the homosexuals I have met are very..um...gross and rude you could say about their sexual preference and their sexual activities. I do not agree with the gay lifestyle, however a homosexual does have the right to be just that, this is America and you must protect everyone. Again I'm surprised though how much my thoughts were similar to yours Justine Credible....you're the first decent homosexual I've ever met.....thank you....", 
   {}, 
   87019, 
   null, 
   1106099640.0
  ], 
  [
   87376, 
   null, 
   "joebrummer", 
   "wow...hmm....well in regards to the topic yes I would be more than outraged I would most likely have the head of the teacher and principle on a platter, well the teacher at very least. I don't see how one's sexual orientation is related to a class designed to educate in matters of HEALTH not about sexual preferences especially at the age. It's not like they are ignorant of the fact that yes there are Homosexuals, much more explicit and bolder than ever before. I feel it's the parents right to know these things, just as Justine put.....which I commend you for....the homosexuals I have met are very..um...gross and rude you could say about their sexual preference and their sexual activities. I do not agree with the gay lifestyle, however a homosexual does have the right to be just that, this is America and you must protect everyone. Again I'm surprised though how much my thoughts were similar to yours Justine Credible....you're the first decent homosexual I've ever met.....thank you....\n\n \n \n Homosexuality is part of health education. Sexual Health is a very important part od understanding the whole person. Yeaching students about the different sexual orientations gives student a chance to understand their sexuality but more importantly guide their sexual behaviors, hopefully toward seafer sex and healthy sex. Americans are known for being sexually uptight. By teaching kids about sexual orientations earlier, it reduces stigma and increases understanding both of themselves and others.", 
   {}, 
   87361, 
   null, 
   1106108880.0
  ], 
  [
   87404, 
   null, 
   "jyoshu", 
   "Homosexuality is part of health education. Sexual Health is a very important part od understanding the whole person. Yeaching students about the different sexual orientations gives student a chance to understand their sexuality but more importantly guide their sexual behaviors, hopefully toward seafer sex and healthy sex. Americans are known for being sexually uptight. By teaching kids about sexual orientations earlier, it reduces stigma and increases understanding both of themselves and others.\n\n \n I think the problem isn't so much that we are \"uptight\", but that we have somewhat of an obsession with sex in this country. To varying degrees, it permeates our culture. We choose to deal with this problem by sometimes ignoring it or pretending it isn't there (resulting in a supposed \"uptightness.\") But since the root of the problem is the sexual obsession in the first place, I would love to see our culture move back to a less sex-driven one. Sex has become such am obsession in so many lives these days and we have advertising and culture to thank for it.", 
   {}, 
   87376, 
   null, 
   1106149140.0
  ], 
  [
   87408, 
   null, 
   "joebrummer", 
   "I think the problem isn't so much that we are \"uptight\", but that we have somewhat of an obsession with sex in this country. To varying degrees, it permeates our culture. We choose to deal with this problem by sometimes ignoring it or pretending it isn't there (resulting in a supposed \"uptightness.\") But since the root of the problem is the sexual obsession in the first place, I would love to see our culture move back to a less sex-driven one. Sex has become such am obsession in so many lives these days and we have advertising and culture to thank for it.\n\n \n People are obsessed with that which is \"Taboo\". Maybe if it weren't so taboo it wouldn't be such an obsession.", 
   {}, 
   87404, 
   null, 
   1106150100.0
  ], 
  [
   87415, 
   null, 
   "jyoshu", 
   "People are obsessed with that which is \"Taboo\". Maybe if it weren't so taboo it wouldn't be such an obsession.\n\n \n I think the obsession over sex is a lot more prevalent than just 'taboo' things.", 
   {}, 
   87408, 
   null, 
   1106151300.0
  ], 
  [
   87416, 
   null, 
   "snakespit", 
   "Last night at the dinner table my oldest son was telling us about his health class. He is 14, on the football team, typical man/boy :)\n They had guest speakers, I think it was a homosexual man, lesbian and bisexual women. They answered questions, and talked about their experiences.\n My question for all of you is... How do you feel about this. The school did not send a note home to make us aware.\n Little background....\n I support gay rights, have a ton of gay friends, when I was tattooing I would say 80% of my clientele was gay. My son has been raised around gay people and has no problems with anyone. We are a very eclectic family :)\n Even though I fully support the cause why was I little miffed that I was not made aware of the speakers. And to top it off I am miffed that I am miffed.. Does this make any sense?\n Your thoughts please :)\n\n \n The only question that I have is: would you have even bothered to post this if it was 3 heterosexuals who came in to talk about their experiences and answer questions?", 
   {}, 
   86741, 
   null, 
   1106151720.0
  ], 
  [
   87421, 
   null, 
   "snakespit", 
   "I think the obsession over sex is a lot more prevalent than just 'taboo' things.\n\n \n I think that Americas true obsession with sex is people who can't keep from delving into the private sex lives of others. You know the type...it's not that they mind the people, they just can't stand what they do in the bedroom. I think if you had any wordly experience...perhaps been to Europe once or twice, you would begin to see how uptight and conservative the genaral American attitude is towards sex when compared to theirs.", 
   {}, 
   87415, 
   null, 
   1106152140.0
  ], 
  [
   87433, 
   null, 
   "jyoshu", 
   "I think that Americas true obsession with sex is people who can't keep from delving into the private sex lives of others. You know the type...it's not that they mind the people, they just can't stand what they do in the bedroom. I think if you had any wordly experience...perhaps been to Europe once or twice, you would begin to see how uptight and conservative the genaral American attitude is towards sex when compared to theirs.\n\n \n I've been to Europe several times, actually and parts of Africa. There are plenty of places in the U.S. that are just as flagrant in their sexuality as parts of Europe. Also there are parts of Europe that are NOT so obsessed with sex, as in Portugal and Spain. They are still very conservative countries. Greece as well.", 
   {}, 
   87421, 
   null, 
   1106157000.0
  ], 
  [
   87452, 
   null, 
   "wsm2506", 
   "I've been to Europe several times, actually and parts of Africa. There are plenty of places in the U.S. that are just as flagrant in their sexuality as parts of Europe. Also there are parts of Europe that are NOT so obsessed with sex, as in Portugal and Spain. They are still very conservative countries. Greece as well.\n\n \n Then to what do you attribute your obsession with the sex acts of 2 consenting adults in the privacy of their own bedroom?", 
   {}, 
   87433, 
   null, 
   1106160600.0
  ], 
  [
   87456, 
   null, 
   "jyoshu", 
   "Then to what do you attribute your obsession with the sex acts of 2 consenting adults in the privacy of their own bedroom?\n\n \n You're the pot calling the kettle black, if you're going to go there. I'm not the one obsessed with it, in fact one reason I'm here is to help deal with the obsession that some like you have with it being made into a marriage standard. You need to direct such accusations at people on these forums who actually write posts about the 'sex acts' you are talking about. I don't remember ever writing posts about such details.", 
   {}, 
   87452, 
   null, 
   1106161500.0
  ], 
  [
   87461, 
   null, 
   "Anastasia", 
   "The only question that I have is: would you have even bothered to post this if it was 3 heterosexuals who came in to talk about their experiences and answer questions?\n\n But that would probably never happen, The teacher is assumably heterosexual therefore can answer any questions.\n The only reason I \"bothered\" with this post was to get an opinion from others, mainly gays to see what their take was on it. I have no problems with the school informing my son about the gay community but I would like to know how it will be presented. Like I said before I would hate to think that some extremist group would be teaching a formula that I don't agree with and that is what I would have a problem with.", 
   {}, 
   87416, 
   null, 
   1106162340.0
  ], 
  [
   87474, 
   null, 
   "snakespit", 
   "I've been to Europe several times, actually and parts of Africa. There are plenty of places in the U.S. that are just as flagrant in their sexuality as parts of Europe. Also there are parts of Europe that are NOT so obsessed with sex, as in Portugal and Spain. They are still very conservative countries. Greece as well.\n\n \n But you were not talking about isolated parts of our country, such as Las Vegas or Key West where I would agree that sex and the attitudes towards sex are a little more \"flagrant\". You stated that it has \"[permeated] our culture\" and that \"[you] would love to see our culture move back to a less of a sex-driven one\". So what is it, certain areas of the country with loose moral fiber, or a culture of sex crazed maniacs. Either way, I think the obsession exists in your mind, not in our culture. \n \n And just what is so wrong with sex? Sex is a natural part of who we are. What exactly is our cultures obsession with sex, could you define this topic a little more?", 
   {}, 
   87433, 
   null, 
   1106168520.0
  ], 
  [
   87476, 
   null, 
   "snakespit", 
   "You're the pot calling the kettle black, if you're going to go there. I'm not the one obsessed with it, in fact one reason I'm here is to help deal with the obsession that some like you have with it being made into a marriage standard. You need to direct such accusations at people on these forums who actually write posts about the 'sex acts' you are talking about. I don't remember ever writing posts about such details.\n\n \n If you are not obsessed with sex, then answer this for me. Why is it that you have argued on other threads about homosexual sex acts, saying it is not the people that you disapprove of, it is the sexual acts that they engage in? If you truely are not obsessed about sex, why is it that you feel you have the right to judge and condemn what consenting adults do behind closed doors? I do remember you writing posts about such details, and I think others probably do as well. \n \n What obsession are people trying to make into a \"marriage standard\"?", 
   {}, 
   87456, 
   null, 
   1106168940.0
  ], 
  [
   87478, 
   null, 
   "jyoshu", 
   "But you were not talking about isolated parts of our country, such as Las Vegas or Key West where I would agree that sex and the attitudes towards sex are a little more \"flagrant\". You stated that it has \"[permeated] our culture\" and that \"[you] would love to see our culture move back to a less of a sex-driven one\". So what is it, certain areas of the country with loose moral fiber, or a culture of sex crazed maniacs. Either way, I think the obsession exists in your mind, not in our culture.\n\n \n Then apparently you don't get out much.", 
   {}, 
   87474, 
   null, 
   1106169240.0
  ], 
  [
   87480, 
   null, 
   "jyoshu", 
   "If you are not obsessed with sex, then answer this for me. Why is it that you have argued on other threads about homosexual sex acts, saying it is not the people that you disapprove of, it is the sexual acts that they engage in? If you truely are not obsessed about sex, why is it that you feel you have the right to judge and condemn what consenting adults do behind closed doors? I do remember you writing posts about such details, and I think others probably do as well.\n\n \n Why do you assume that objection to something equals \"obsession?\" I guess by your standard that anyone objecting to voter fraud is obsessed with voter fraud. Or seatbelt laws. Or drugs. Or anything people might object to.", 
   {}, 
   87476, 
   null, 
   1106169360.0
  ], 
  [
   87482, 
   null, 
   "wsm2506", 
   "You're the pot calling the kettle black, if you're going to go there. I'm not the one obsessed with it, in fact one reason I'm here is to help deal with the obsession that some like you have with it being made into a marriage standard. You need to direct such accusations at people on these forums who actually write posts about the 'sex acts' you are talking about. I don't remember ever writing posts about such details.\n\n \n Excuse me, but it is you who has repeatedly mentioned your vehement disapproval of certain sex acts that you presume goes on behind closed bedroom doors of consenting adults, not I. I couldn't care less what you do in your bedroom.", 
   {}, 
   87456, 
   null, 
   1106169600.0
  ], 
  [
   87497, 
   null, 
   "Ladywolf", 
   "Interesting post. I suppose you don't live in the south where any mention of gay/lesbian topics is off base for public school. Our state just ruled to change the testbooks from using the word \"life partners\" to \"husband and wife\" when referring to family. I guess only a man and a woman can be a family here in Texas.\n \n Would you have been miffed if they also brought in a married couple among the others to share and discuss adult relationships?\n \n I believe that if you take the diversity of relationships out of the schools, you end up with kids learning from what they see and what they hear and all the other wonderful things as well as the myths and negative things that might not necessarily be true. This has happened with heterosexual relationships as well...how many 12 year olds do you think know the true facts of sex and relalationships and staying healthy if most adults don't even know the facts?\n \n Accept your feelings and explore them. Perhaps you will learn more about yourself in the process. \n \n Good luck to you.", 
   {
    "post_info": {
     "post_title": "Gay Show and Tell?"
    }
   }, 
   87019, 
   null, 
   1106179020.0
  ], 
  [
   87512, 
   null, 
   "BobNelson2", 
   "Why do you assume that objection to something equals \"obsession?\" \n\n \n \n Uh.... \n \n jyoshu: Total Posts: 614 (9.57 posts per day)", 
   {}, 
   87480, 
   null, 
   1106186580.0
  ], 
  [
   87514, 
   null, 
   "BobNelson2", 
   "I've been to Europe several times, actually and parts of Africa. There are plenty of places in the U.S. that are just as flagrant in their sexuality as parts of Europe. Also there are parts of Europe that are NOT so obsessed with sex, as in Portugal and Spain. They are still very conservative countries. Greece as well.\n\n \n One has to wonder what you mean by \"obsessed\".\n \n By the way, Spain will legalize fully equal same-sex marriage in February. It is supported by over 66% of the population.", 
   {}, 
   87433, 
   null, 
   1106186820.0
  ], 
  [
   87543, 
   null, 
   "jyoshu", 
   "Uh.... \n \n jyoshu: Total Posts: 614 (9.57 posts per day)\n\n \n Nice job trying to lie with statistics.\n \n The count includes posts in ALL the forums, not just the gay rights one.", 
   {}, 
   87512, 
   null, 
   1106236200.0
  ], 
  [
   87544, 
   null, 
   "jyoshu", 
   "One has to wonder what you mean by \"obsessed\".\n\n \n 'One has to wonder' how you couldn't know that our society is full of sexuality. Television is full of advertising that is sexually-related. Matters of sexuality are all over the media these days. It appeals to sex. We are a very openly sexual country, so I don't see how someone can say we are still not a very sexually open country. \n \n Do you have kids? If you did, you might be a bit more concerned about this sort of thing.\n \n \"Daddy, what's a XXX Bookstore? I saw a sign on the interstate when we were driving.\"", 
   {}, 
   87514, 
   null, 
   1106236560.0
  ], 
  [
   87545, 
   null, 
   "snakespit", 
   "Then apparently you don't get out much.\n\n \n Actually, as a pilot I have probably seen more of our country and the world in the last 5 years than you will in your life. But the questions from my previous posts still remain, funny how you choose not to address the issues.", 
   {}, 
   87478, 
   null, 
   1106236620.0
  ], 
  [
   87548, 
   null, 
   "snakespit", 
   "'One has to wonder' how you couldn't know that our society is full of sexuality. Television is full of advertising that is sexually-related. Matters of sexuality are all over the media these days. It appeals to sex. We are a very openly sexual country, so I don't see how someone can say we are still not a very sexually open country. \n \n Do you have kids? If you did, you might be a bit more concerned about this sort of thing.\n \n \"Daddy, what's a XXX Bookstore? I saw a sign on the interstate when we were driving.\"\n\n \n So what are you going to do, lock your kid in a closet? May I suggest perhaps a blindfold for when you get in the car. If you choose to shelter your child from the real world outside your doors, that is your choice. I myself would rather answer my childs questions openly and honestly. Being open and honest with your children is the best way to get them to be open and honest with you.", 
   {}, 
   87544, 
   null, 
   1106237040.0
  ], 
  [
   87550, 
   null, 
   "jyoshu", 
   "So what are you going to do, lock your kid in a closet? May I suggest perhaps a blindfold for when you get in the car. If you choose to shelter your child from the real world outside your doors, that is your choice. I myself would rather answer my childs questions openly and honestly. Being open and honest with your children is the best way to get them to be open and honest with you.\n\n \n Oh sure, answer the question openly when they're, say, 5 years old. I can hear you now. \"well son, some people like to look at something called pornography which is sex acts on film and in books. Its a whole industry. Heck son, some porn out there even has kids your age in it!\"\n \n Get real. \n \n Why can't you just simply acknowledge that our society could stand to temper some things? Why is that asking so much? No one is advocating locking people in a closet or using blindfolds except you.", 
   {}, 
   87548, 
   null, 
   1106237400.0
  ], 
  [
   87553, 
   null, 
   "wsm2506", 
   "Oh sure, answer the question openly when they're, say, 5 years old. I can hear you now. \"well son, some people like to look at something called pornography which is sex acts on film and in books. Its a whole industry. Heck son, some porn out there even has kids your age in it!\"\n\n \n You really are a case, jyoshu. I have absolutely no doubt that that is exactly the way you would handle the situtaion. However, I think snakespit and other intelligent parent possess more tact than that.\n \n \nWhy can't you just simply acknowledge that our society could stand to temper some things? Why is that asking so much?\n\n \n I agree. Like prejudice, fear mongering, spreading derrogitory mythical stereotypes, elitism, malicious misinformation...........", 
   {}, 
   87550, 
   null, 
   1106238120.0
  ], 
  [
   87555, 
   null, 
   "jyoshu", 
   "You really are a case, jyoshu. I have absolutely no doubt that that is exactly the way you would handle the situtaion. However, I think snakespit and other intelligent parent possess more tact than that.\n\n \n He said to respond \"open and honestly.\" Sorry, but you can't always be open with your kids about some things. You have to respond more as they grow older and mature. But it gets harder and harder to do that when society is the way it is (that's the point.) Surely you realized to take my response tongue-in-cheek.", 
   {}, 
   87553, 
   null, 
   1106238420.0
  ], 
  [
   87557, 
   null, 
   "wsm2506", 
   "He said to respond \"open and honestly.\" Sorry, but you can't always be open with your kids about some things. You have to respond more as they grow older and mature. But it gets harder and harder to do that when society is the way it is (that's the point.) Surely you realized to take my response tongue-in-cheek.\n\n \n Actually, based on the vehement attitude you present here on any issue relating to gays, homosexulaity, same-sex marriage, ect., I have no reason to believe that your response is anything other than your true beliefs.", 
   {}, 
   87555, 
   null, 
   1106239020.0
  ], 
  [
   87560, 
   null, 
   "snakespit", 
   "Oh sure, answer the question openly when they're, say, 5 years old. I can hear you now. \"well son, some people like to look at something called pornography which is sex acts on film and in books. Its a whole industry. Heck son, some porn out there even has kids your age in it!\"\n\n What is wrong with that? \n \n \nGet real.\n\n You first. \n \n \nWhy can't you just simply acknowledge that our society could stand to temper some things? Why is that asking so much? No one is advocating locking people in a closet or using blindfolds except you.\n\n Temper what things? Give me some examples and what you would like to see done with them.", 
   {}, 
   87550, 
   null, 
   1106239440.0
  ], 
  [
   87575, 
   null, 
   "JustineCredible", 
   "Jyoshu:\n \n You claim to not be \"obsessed\" with Gay Rights, but out of the 500 posts listed (127 are achived and cannot be found)\n 328 of them are in the GAY RIGHTS forum.\n \n Yea, you do post in a number of other threads, but this one is where the MAJORITY of your posts reside. \n \n 328 out of 500 {Yup, I counted them...one by one}\n \n For someone who isn't gay and doesn't have a personal stake in the rights of gays, that kind of shows an obsessive trait. \n \n Yes, I have posted almost exclusively in this forum, but then again, I AM GAY and therefore I have a Personal interest in Gay Rights. So, that just makes sence.", 
   {}, 
   87560, 
   null, 
   1106246040.0
  ], 
  [
   87592, 
   null, 
   "jyoshu", 
   "Jyoshu:\n \n You claim to not be \"obsessed\" with Gay Rights, but out of the 500 posts listed (127 are achived and cannot be found)\n 328 of them are in the GAY RIGHTS forum.\n \n Yea, you do post in a number of other threads, but this one is where the MAJORITY of your posts reside. \n \n 328 out of 500 {Yup, I counted them...one by one}\n\n \n This is pretty bizarre to me that people would even worry that much to count up a poster's posts. What difference does it make to you or anyone else if I post 328 or 3028? So I've posted more in this forum than others. So what?\n \n We need to get past this view that a person doesn't need to debate something unless he has a personal stake in it, especially in a public forum.", 
   {}, 
   87575, 
   null, 
   1106252160.0
  ], 
  [
   87602, 
   null, 
   "BobNelson2", 
   "Nice job trying to lie with statistics.\n \n The count includes posts in ALL the forums, not just the gay rights one.\n\n \n The page says \"Forum statistics\". How am I supposed to know?\n \n Now, retract the accusation that I was lying.", 
   {}, 
   87543, 
   null, 
   1106256300.0
  ], 
  [
   87605, 
   null, 
   "BobNelson2", 
   "'One has to wonder' how you couldn't know that our society is full of sexuality. Television is full of advertising that is sexually-related. Matters of sexuality are all over the media these days. It appeals to sex. We are a very openly sexual country, so I don't see how someone can say we are still not a very sexually open country. \n\n \n Please try to remember that my comments were in reaction to what you said about the U.S. and Europe. With that in mind...\n \n You seem to be greatly confused about what is wrong with America. It isn't \"sexuality\", it's rampant commercialism. Unsurprisingly, you mistake vulgarity and a prudish immaturity for \"open sexuality\". \n \n \nDo you have kids? If you did, you might be a bit more concerned about this sort of thing.\n\n \n No, we don't. As for this issue, I am very concerned about it. No way would any kids of mine be allowed to watch most TV. Not because it's too \"sexual\", but because it's so violent and crass.\n \n \n\"Daddy, what's a XXX Bookstore? I saw a sign on the interstate when we were driving.\"\n\n \n \"Oh, Johnny, that's a bad, bad place. It's an alluring, mysterious place you should just obsess about for the next ten years, then you can sneak in and see for yourself. For which, of course, you will go straight to hell. Now, put those blinders back on.\"", 
   {}, 
   87544, 
   null, 
   1106257260.0
  ], 
  [
   87606, 
   null, 
   "wsm2506", 
   "The page says \"Forum statistics\". How am I supposed to know?\n \n Now, retract the accusation that I was lying.\n\n \n Don't hold your breath. That would require integrity.", 
   {}, 
   87602, 
   null, 
   1106257380.0
  ], 
  [
   87616, 
   null, 
   "jyoshu", 
   "The page says \"Forum statistics\". How am I supposed to know?\n \n Now, retract the accusation that I was lying.\n\n \n Ok, fair enough. Maybe you were simply mistaken.", 
   {}, 
   87602, 
   null, 
   1106259600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gay Education", 
  "url": "http://www.4forums.com/political/gay-rights-debates/4100-gay-education.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 4100, 
  "discussion_files": [
   [
    "12298.html", 
    "http://www.4forums.com/political/gay-rights-debates/4100-gay-education-print.html"
   ], 
   [
    "12299.html", 
    "http://www.4forums.com/political/gay-rights-debates/4100-gay-education-4-print.html"
   ], 
   [
    "12300.html", 
    "http://www.4forums.com/political/gay-rights-debates/4100-gay-education-3-print.html"
   ], 
   [
    "12301.html", 
    "http://www.4forums.com/political/gay-rights-debates/4100-gay-education-2-print.html"
   ]
  ], 
  "identifier": 4100
 }
]