[
 [
  [
   86943, 
   null, 
   "wsm2506", 
   "Perhaps the title of this thread will surprise some people. It surprised me too. Having many times been a victim of what I considered \"homophobia\", I decided to research the topic on the most available resource, the Internet. What I found opened my eyes to new vistas. \n \n I , like so many of us all, like to consider myself \"open minded\". For that reason, I will purposely avoid references to Internet links that are obviously biased, either pro or con. I will attempt, where ever possibly, to present information, documentation, and facts, from generally accepted, recognized, and respected sources. If you desire credibility for your response to this thread, I suggest you do the same. \"Flames\" will be ignored and not responded to, at least by me.\n \n I first happened upon the term \"sexual prejudice\" on this link:\n \n http://psychology.ucdavis.edu/rainbow/html/prej_defn.html\n \n For those of you disinclined to follow the link, I will quote it here.\n \n \n\n Definitions: \n Homophobia, Heterosexism, and Sexual Prejudice \n \n \n People with homosexual or bisexual orientations have long been stigmatized. With the rise of the gay political movement in the late 1960s, however, homosexuality's condemnation as immoral, criminal, and sick came under increasing scrutiny. When the American Psychiatric Association dropped homosexuality as a psychiatric diagnosis in 1973, the question of why some heterosexuals harbor strongly negative attitudes toward homosexuals began to receive serious scientific consideration. \n \n Homophobia \n Read interviews with \n Dr. George Weinberg \n from 1997 and \n 2000 Society's rethinking of sexual orientation was crystallized in the term homophobia, which heterosexual psychologist George Weinberg coined in the late 1960s. Weinberg used homophobia to label heterosexuals' dread of being in close quarters with homosexuals as well as homosexuals' self loathing. The word first appeared in print in 1969 and was subsequently discussed at length in Weinberg's 1972 book, Society and the Healthy Homosexual. \n The American Heritage Dictionary (1992 edition) defines homophobia as \"aversion to gay or homosexual people or their lifestyle or culture\" and \"behavior or an act based on this aversion.\" Other definitions identify homophobia as an irrational fear of homosexuality. \n Heterosexism Around the same time, heterosexism began to be used as a term analogous to sexism and racism, describing an ideological system that denies, denigrates, and stigmatizes any nonheterosexual form of behavior, identity, relationship, or community (Herek, 1990). Using the term heterosexism highlights the parallels between antigay sentiment and other forms of prejudice, such as racism, antisemitism, and sexism. \n Like institutional racism and sexism, heterosexism pervades societal customs and institutions. It operates through a dual process of invisibility and attack. Homosexuality usually remains culturally invisible; when people who engage in homosexual behavior or who are identified as homosexual become visible, they are subject to attack by society. \n Examples of heterosexism in the United States include the continuing ban against lesbian and gay military personnel; widespread lack of legal protection from antigay discrimination in employment, housing, and services; hostility to lesbian and gay committed relationships, recently dramatized by passage of federal and state laws against same-gender marriage; and the existence of sodomy laws in more than one-third of the states. \n Although usage of the two words has not been uniform, homophobia has typically been employed to describe individual antigay attitudes and behaviors whereas heterosexism has referred to societal-level ideologies and patterns of institutionalized oppression of non-heterosexual people. \n Limitations By drawing popular and scientific attention to antigay hostility, the creation of these terms marked a watershed. Nevertheless, they have important limitations. \n Critics have observed that homophobia is problematic for at least two reasons. \n First, empirical research does not indicate that heterosexuals' antigay attitudes can reasonably be considered a phobia in the clinical sense. Indeed, the limited data available suggest that many heterosexuals who express hostility toward gay men and lesbians do not manifest the physiological reactions to homosexuality that are associated with other phobias (see Shields & Harriman, 1984). \n Second, using homophobia implies that antigay prejudice is an individual, clinical entity rather than a social phenomenon rooted in cultural ideologies and intergroup relations. Moreover, a phobia is usually experienced as dysfunctional and unpleasant. Antigay prejudice, however, is often highly functional for the heterosexuals who manifest it. \n As antigay attitudes have become increasingly central to conservative political and religious ideologies since the 1980s, these limitations have become more problematic. However, heterosexism, with its historic macro-level focus on cultural ideologies rather than individual attitudes, is not a satisfactory replacement for homophobia. \n Sexual Prejudice Scientific analysis of the psychology of antigay attitudes will be facilitated by a new term. Sexual prejudice serves this purpose nicely. Broadly conceived, sexual prejudice refers to all negative attitudes based on sexual orientation, whether the target is homosexual, bisexual, or heterosexual. Given the current social organization of sexuality, however, such prejudice is almost always directed at people who engage in homosexual behavior or label themselves gay, lesbian, or bisexual (Herek, 2000). \n Like other types of prejudice, sexual prejudice has three principal features: \n &#61623; It is an attitude (i.e., an evaluation or judgment). \n &#61623; It is directed at a social group and its members. \n &#61623; It is negative, involving hostility or dislike. \n Conceptualizing heterosexuals' negative attitudes toward homosexuality and bisexuality as sexual prejudice - rather than homophobia - has several advantages. First, sexual prejudice is a descriptive term. Unlike homophobia, it conveys no a priori assumptions about the origins, dynamics, and underlying motivations of antigay attitudes. \n Second, the term explicitly links the study of antigay hostility with the rich tradition of social psychological research on prejudice. \n Third, using the construct of sexual prejudice does not require value judgments that antigay attitudes are inherently irrational or evil. \n References Herek, G. M. (1990). The context of anti-gay violence: Notes on cultural and psychological heterosexism. Journal of Interpersonal Violence, 5, 316-333. [Back to text] \n Herek, G. M. (2000). The psychology of sexual prejudice. Current Directions in Psychological Science, 9, 19-22. [Back to text] \n Read more about the paper \n Shields, S. A., & Harriman, R. E. (1984). Fear of male homosexuality: Cardiac responses of low and high homonegative males. Journal of Homosexuality, 10(1/2), 53-67. [Back to text] \n \n \n For an overall view of the topic, I refer you to the source link of the above:\n \n http://psychology.ucdavis.edu/rainbow/html/sexual_prejudice.html\n \n I realize that this may only scratch the surface of the topic. I would appreciate additional, respectful of all, documented facts or information. If you wish to post your own personal beliefs or opinions, please state that they are such, and the basis of your belief or opinion.", 
   {
    "post_info": {
     "post_title": "Understanding &quot;Sexual Prejudice&quot;."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1105850100.0
  ], 
  [
   86994, 
   null, 
   "JustineCredible", 
   "wsm: \n \n THESE ARE MY OPINIONS ONLY. \n (just to set the record straight. ~no pun intended~)\n \n Your post was well taken, please do not get me wrong, but I noticed that although it shows good examples as to why the term \"homophobia\" may be being used improperly, it didn't say anything about the term \"Heterosexism.\" \n \n I tend to perfer a similar term \"hetero-ist\" when used towards one specific person or group. \n \n Just feeling for oppinion here.", 
   {}, 
   86943, 
   null, 
   1105898100.0
  ], 
  [
   86996, 
   null, 
   "wsm2506", 
   "wsm: \n \n THESE ARE MY OPINIONS ONLY. \n (just to set the record straight. ~no pun intended~)\n \n Your post was well taken, please do not get me wrong, but I noticed that although it shows good examples as to why the term \"homophobia\" may be being used improperly, it didn't say anything about the term \"Heterosexism.\" \n \n I tend to perfer a similar term \"hetero-ist\" when used towards one specific person or group. \n \n Just feeling for oppinion here.\n\n \n I understand your point. I will see what I can find on the term \"heterosexism\".", 
   {}, 
   86994, 
   null, 
   1105899060.0
  ], 
  [
   86998, 
   null, 
   "JustineCredible", 
   "I understand your point. I will see what I can find on the term \"heterosexism\".\n\n \n Thanks, I'd really appreciate it. emoticon_smile", 
   {}, 
   86996, 
   null, 
   1105900200.0
  ], 
  [
   87001, 
   null, 
   "wsm2506", 
   "Thanks, I'd really appreciate it. emoticon_smile\n\n \n OK, I see what you mean now after reading this article:\n \n HETEROSEXISM:\n DEFINITIONS AND RESPONSES\n Chuck Stewart, PhD\n Affiliated Scholar, ONE Institute Center for Advanced Studies\n University of Southern California \n Los Angeles CA 90089-0032 USA\n \n http://www.jtsears.com/intblu.htm\n \n It is much too long to post here. It delves into many areas not covered by \"sexual prejudice\" and shows it's links to many forms of prejudice. It even gives a short historical perspective.\n \n Enjoy, and I would be interested in what you think of the article.", 
   {}, 
   86998, 
   null, 
   1105900980.0
  ], 
  [
   87004, 
   null, 
   "JustineCredible", 
   "Steve;\n \n Thank you, I will read it and let you know. That was very thoughtful of you to have researched it so quickly. :)", 
   {}, 
   87001, 
   null, 
   1105901280.0
  ], 
  [
   87005, 
   null, 
   "wsm2506", 
   "Steve;\n \n Thank you, I will read it and let you know. That was very thoughtful of you to have researched it so quickly. :)\n\n \n :) I love to \"google\".", 
   {}, 
   87004, 
   null, 
   1105901520.0
  ], 
  [
   87008, 
   null, 
   "JustineCredible", 
   "Interesting article, although most of the first part of the article did not pertain directly to my question, but eventually it got there. I particularly enjoyed the paragraph that read: \n \n \n\"Competition and Exploitation- Prejudice and discrimination have been found in hierarchical social structures and is inversely related to economic climate of the society (Saenger). When economic times are tough, prejudice and discrimination explode. Prejudice against minorities can be further exploited by totalitarian regimes to divert attention away from the real causes of social and economic conditions.\"\n\n \n {How interesting as we are seeing just that happening as we speak. }\n \n I noticed that Heterosexism is a more generalized term in this article. It includes homophobes as well as those who simply have a basic or more general apathy towards homosexuals or homosexual culture. \n \n By this article I noticed that it backs up the use of the term Homophobia when used to describe an individual's strong feelings towards homosexuals or homosexuality or negative actions towards the same. \n \n I also noticed how many current stereotypes about gay men have been created not only by out right lies and suspicion, but by actions that some gay men have used as a means to survive. \n \n \n Allport (1954) enumerated the varieties of negative responses to stigmatization including: (Blumenfeld, p. 263)\n 1. obsessive concern resulting in feelings of deep anxiety, suspicion, and insecurity \n 2. denial (from both oneself and others) of actual membership in the minority group\n 3. social withdrawal and passivity\n 4. clowning, being the \"court jester\" in an effort to be accepted by the dominant group\n 5. slyness and cunning-oftentimes for mere survival\n 6. identification with the dominant group-a sign of self-hate \n 7. aggression against and addressing blame to one's own group \n 8. directing prejudice and discrimination against other minorities \n 9. excessive neuroticism\n 10 internalizing and acting out the negative social definitions and stereotypes-the self-fulfilling prophecy\n 11. excessive striving for status to compensate by substitution for the feelings of inferiority.\n Thus many of the more undesirable characteristics often attributed to minorities are not intrinsic but are rather defenses and responses to discrimination. yet, when these responses occur, they often lead to reinforcement of negative stereotypes and beliefs.\n\n \n Thanks again to linking this article. I'd be interested in hearing others' opinions as well.", 
   {
    "unicode_changes_made": true
   }, 
   87004, 
   null, 
   1105903320.0
  ], 
  [
   90743, 
   null, 
   "wsm2506", 
   "I can't resist any longer. emoticon_xangel \n \n \n\n http://www.psych.org/pnews/96-09-20/phobia.html\n \n Repressed Homosexuality Could Be Root of Homophobia\n New research lends considerable credence to the psychoanalytic theory that repressed homosexual urges may be at the root of homophobic behavior by heterosexual men. \n \n Using a scale that measures traits of homophobia--fear, anger, anxiety, or aversion in response to interactions with gay men or lesbians--University of Georgia researchers compared 35 men who exhibited homophobic traits with 29 men who do not. Both groups identified themselves as exclusively heterosexual. \n \n Each participant viewed videotapes showing three categories of sexually explicit activities--heterosexual, male homosexual, and lesbian. (The researchers explained that they included a lesbian videotape because it has proven to be \"highly sexually arousing to heterosexual men and is a better discriminator between heterosexual and homosexual men than other stimuli.\") The order of the tapes was varied to avoid any effects that might be linked to the sequence in which the subjects viewed them. \n \n Before and after each type of videotape, which subjects watched individually in a soundproofed room, arousal was measured using penile plethysmography. In addition, subjects provided a subjective rating of their sexual arousal using a 10-point scale following each of the three tapes. \n \n The men in both of the groups had similar degrees of arousal after viewing the videos showing the heterosexual couple and two women having sex. A significant difference between the two study groups appeared, however, following the video depicting male homosexual acts. \n \n According to researchers Henry Adams, Lester Wright Jr., and Bethany Lohr of the psychology department at the University of Georgia, the men in the homophobic group displayed significantly greater increase in penile circumference after the all-male videos, while the nonhomophobic subjects showed dramatically lower arousal levels. They report that 24 percent of the nonhomophobic men, but 54 percent of the subjects who scored high on the homophobia scale showed some degree of tumescence in response to the homosexual video. In addition, 66 percent of the nonhomophobic group showed no significant increases in tumescence after this video, but only 20 percent of the homophobic men failed to display any arousal. \n \n Arousal Level Denied\n \n Adams and his colleagues, who describe their research in the August issue of the Journal of Abnormal Psychology, also point out that the homophobic men were either unaware of or unwilling to admit the level of arousal engendered by the homosexual male video. When asked to give their subjective assessment of the degree to which they were aroused by watching each of the three videos, men in both groups gave answers that tracked fairly closely with the results of the objective physiological measurements, the authors note, with one notable exception--the homophobic men significantly underestimated their degree of arousal by the male homosexual video. \n The scale used to assess the degree to which subjects possessed homophobic traits was the 25-item Index of Homophobia, which yields a score between 0 and 100 that indicates the level of \"dread\" a person experiences \"when placed in close quarters with a homosexual,\" the authors note. \n \n To evaluate whether aggression is a component of homophobia, the researchers also administered the self-rated Aggression Questionnaire, but no link between aggression and degree of homophobia was found. \n \n Competing Theories\n \n The researchers offer competing explanations for the arousal experienced by the homophobic men in response to erotic videos of male homosexual acts. The psychoanalytically oriented theory would view homophobia \"as one type of latent homosexuality where persons either are unaware of or deny their homosexual urges,\" they point out. \n \n An alternative hypothesis, which they attribute to Barlow, Sakheim, and Beck, focuses on the role of anxiety in sexual responsiveness. It postulates that \"viewing homosexual stimuli causes negative emotions such as anxiety in homophobic men but not in nonhomophobic men. Because anxiety has been shown to enhance arousal and erection, this theory would predict increases in erection in homophobic men.\" Thus, the homophobic men's increased arousal is a response to a perceived threat rather than to stimuli they find sexually arousing. \n \n Evaluating the validity of either theory requires further research, the authors caution. \n \n (Psychiatric News, September 20, 1996) \n \n \n \n\n \n I think we all know those who protest the most.", 
   {}, 
   87008, 
   null, 
   1108075560.0
  ], 
  [
   90744, 
   null, 
   "jyoshu", 
   "I think we all know those who protest the most.\n\n \n Hmm, I wonder then if this mean that when gay pride people oppose religious groups, they themselves have repressed religious desires? \n \n emoticon_rolleyes", 
   {}, 
   90743, 
   null, 
   1108075740.0
  ], 
  [
   90751, 
   null, 
   "wsm2506", 
   "Hmm, I wonder then if this mean that when gay pride people oppose religious groups, they themselves have repressed religious desires? \n \n emoticon_rolleyes\n\n \n I knew you couldn't resist a response to that. :) And the first response at that! emoticon_xangel", 
   {}, 
   90744, 
   null, 
   1108076580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Understanding \"Sexual Prejudice\".", 
  "url": "http://www.4forums.com/political/gay-rights-debates/4102-understanding-sexual-prejudice.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 4102, 
  "discussion_files": [
   [
    "24691.html", 
    "http://www.4forums.com/political/gay-rights-debates/4102-understanding-sexual-prejudice-print.html"
   ]
  ], 
  "identifier": 4102
 }
]