[
 [
  [
   87563, 
   null, 
   "Black Phoenix", 
   "I just can't understand people who argue in favor of gun control. I mean honestly it's in the constitution. You don't think the founding fathers didn't think of putting that in there for reason? We overthrew the England monarchy by having guns......it would have been hypocritical to say don't posses weapons when that was what we used and needed to achieve our liberty. Now radical leftist want to destroy our rights. They're supposed to be called the Liberals too....lol. Please show me the light as to why the prohibition of guns is necessary....", 
   {
    "post_info": {
     "post_title": "I honestly don't understand how...."
    }
   }, 
   null, 
   null, 
   1106240220.0
  ], 
  [
   87627, 
   null, 
   "snakespit", 
   "I just can't understand people who argue in favor of gun control. I mean honestly it's in the constitution. You don't think the founding fathers didn't think of putting that in there for reason? We overthrew the England monarchy by having guns......it would have been hypocritical to say don't posses weapons when that was what we used and needed to achieve our liberty. Now radical leftist want to destroy our rights. They're supposed to be called the Liberals too....lol. Please show me the light as to why the prohibition of guns is necessary....\n\n \n Not all people who argue for gun control want to see a prohibition on guns. Some gun control in todays society is regretably needed. What you are saying would be like someone pushing for a traffic law to protect drivers, and then saying that they want to ban cars. There is a difference.", 
   {}, 
   87563, 
   null, 
   1106265000.0
  ], 
  [
   87646, 
   null, 
   "Black Phoenix", 
   "Sorry my brain wasn't working that early this morning. What I was trying to say was I can't understand those who wish to completely take guns away from civilians. Now I think it does get a little extreme with owning several M-16s, but if I want to own a pistol, a shotgun, and some fancy automatic, well that's my right.", 
   {}, 
   87627, 
   null, 
   1106274000.0
  ], 
  [
   87656, 
   null, 
   "joebrummer", 
   "Sorry my brain wasn't working that early this morning. What I was trying to say was I can't understand those who wish to completely take guns away from civilians. Now I think it does get a little extreme with owning several M-16s, but if I want to own a pistol, a shotgun, and some fancy automatic, well that's my right.\n\n \n \n Well, maybe the pistol and the hunting rifle, what do you need an automatic weapon? Have the deer gotten faster?", 
   {}, 
   87646, 
   null, 
   1106277480.0
  ], 
  [
   87658, 
   null, 
   "daewoo", 
   "Sorry my brain wasn't working that early this morning. What I was trying to say was I can't understand those who wish to completely take guns away from civilians. Now I think it does get a little extreme with owning several M-16s, but if I want to own a pistol, a shotgun, and some fancy automatic, well that's my right.\n\n \n Are you more dangerous if you own several M-16's than if you just own 1 or two? why? You can only shoot one at a time anyway. If you want to have 19 extras sitting around, why should anybody have the right to tell you no?\n \n The problem with most of todays \"regretably needed\" gun control is that most of it, while regrettable, is not really needed. Generally folks who say things like \"regretably needed\" favor \"common sense\" gun control laws. Unfortuntly such laws very rarely have enything to do with \"common sense\"\n \n Some common sense measures we have in place now include limits/licinsing requirements for concealed carry, registration, background checks, the recently expire \"assault weapons ban\".\n \n We spend hundreds of billion per year enforcing this garbage legislation, but nobody can actually show that we (the public) actually recieve any benifit from it.\n \n Those who support background checks are XXXXXX. We have had them for years now and nobody can show any effect from them. The issue has been studied extensively now, and we now know for sure, that less than 7% of criminals bought their guns at gun stores or throught retail outlets. This means that background checks are worthless. Maybe we should have looked into this before we passed the idiotic brady bill. Background checks cost this country more than a billion dollars per year. \n \n Thos we favor limits on the number of guns you can own are XXXXXX. Most criminals own ONE gun, with the average being 1.23. \n \n Those who favor limits on how many bullets your gun can hold are XXXXXX. This, too had been studied. In your average gun related crime, there are 2.34 shots fired. \n \n Those who favor restrictions on the type of weapon you may own are XXXXXX. As always, the weapons most generally used in crimes are pistols. This is the 67th straight year were there have been NO legally owned machine guns used in crimes. Criminals figured out something a long time ago that apparently the liberals have not.........you do not want a weapon that requires that you carry 500 extra rounds of ammo with you all the time. \n \n There are a whole bunch of other \"common sense\" gun control measures that pretty much make you an idiot. \n \n The problem is that despite the fact that we have been studying this stuff for years, and we KNOW the \"common sense\" gun control measures are inneffective (and frankly, knew they were ineffective before they were ever passed, for those who cared to actually look into things). Instead of recognising that the concept is flawed, those who support \"common sense\" gun control seem to have decided that we just haven't taken strict enough measures. Since what we have done so far hasn't worked worth spit in a bucket, we obviously need to strengthen these common sense gun control measures. \n \n Maybe what we need is to identify what we see as the problem and attempt to correct it. If criminal use of firearms is the problem, there are certainly ways to address it. Unfortunaytly, none of these ways are being used currently. I would say that 90% of our gun control laws contain NO crime control element.\n \n If you percieve the problem as being accidental shootings, address that. Hadn out pamphlets with the guns expalining their safe use and storage. that is really all you can do, since guns are such incredibly simple machines that there are really only 2 basic safety rules. Don't point it at anything you don't want to die and don't leave it where your kids can get it (unless, of course, it is your kids gun). Thats it. Anything else is just fluff. \n \n Lets rememebr, folks, Lethal Weapon was NOT a documentary.", 
   {}, 
   87646, 
   null, 
   1106278080.0
  ], 
  [
   87673, 
   null, 
   "Jeffersonian", 
   "Well, maybe the pistol and the hunting rifle, what do you need an automatic weapon? Have the deer gotten faster?\n\n \n The pistol and hunting rifle is not enough. Please read the 2nd Amendment. It does not mention hunting as a reason for firearm owership or a reason for firearm ownership. \n \n What the 2nd Amendment refers to is modern military weapons. So, yes, we 'need' military weapons. The purpose of the 2nd Amendment is to defend democracy from enemies of democracy who are armed with modern military weapons. The 2nd Amendment does not mean I fight the enemies of democracy with hunting guns. It means I fight back with the same guns they will probably be shooting at ME with.", 
   {}, 
   87656, 
   null, 
   1106288400.0
  ], 
  [
   96937, 
   null, 
   "scrippman", 
   "The pistol and hunting rifle is not enough. Please read the 2nd Amendment. It does not mention hunting as a reason for firearm owership or a reason for firearm ownership. \n \n What the 2nd Amendment refers to is modern military weapons. So, yes, we 'need' military weapons. The purpose of the 2nd Amendment is to defend democracy from enemies of democracy who are armed with modern military weapons. The 2nd Amendment does not mean I fight the enemies of democracy with hunting guns. It means I fight back with the same guns they will probably be shooting at ME with.\n\n \n Well when the second amendment was written, \"modern military weapons\" were black powder rifles. Feel free to defend yourself with black powder rifles. In addition, what are the non-recreational benefits of guns. In other words, what would we lose by taking away automatic guns (since I know your manly self could never part with every weapon you own.)", 
   {}, 
   87673, 
   null, 
   1110506700.0
  ], 
  [
   96938, 
   null, 
   "daewoo", 
   "Well when the second amendment was written, \"modern military weapons\" were black powder rifles. Feel free to defend yourself with black powder rifles. In addition, what are the non-recreational benefits of guns. In other words, what would we lose by taking away automatic guns (since I know your manly self could never part with every weapon you own.)\n\n \n \n Now you are just playing silly word games since you cannot support your position. \n \n Also, modern military weapons at the time that the second ammendment was written were not just black powder rifles, they were cannons and artillery pieces as well. when the british attempted to sieze the arsenals at lexington and concord (you know, the event that actually started the revolutiuonalry war), what they were seizing was NOT rifles and muskets. Those were kept at home. What the arsenals at lexington and concord contained were artillery pieces, mortars and fragmentary shells. \n \n To pose this question another way, is there really any reason that we SHOULD do away with automatic weapons? There has not been a crime committed by a civilian yielding a legally posessed automatic weapon since 1937. It simply doesn't happen, and yet when we suggest that maybe we should rescind the 1968 ban on their production, people throw a fit. Why? Ther is no evidence that an increase in the number of automatic weapons is likely to increase crime at all. \n \n What you are exhibiting here are foolish emotional reactions that lack any basis in fact. They are illogical, and frankly I think you know it, which is why you started your post with that childish word game. So, are you just poking for conversation, or are you really a foolish, emotionally driven person with no basis in reality?", 
   {}, 
   96937, 
   null, 
   1110507720.0
  ], 
  [
   96939, 
   null, 
   "pickleweaseler", 
   "In other words, what would we lose by taking away automatic guns (since I know your manly self could never part with every weapon you own.)\n\n \n You're looking at this the wrong way. You should be asking, \"Why ban automatic firearms?\" Legally owned machineguns don't harm anyone. They aren't used in crimes (or at least haven't been for most of a decade).\n \n When trying to limit a freedom, it's important to ask, \"why?\" not just, \"why not?\".", 
   {}, 
   96937, 
   null, 
   1110507900.0
  ], 
  [
   98074, 
   null, 
   "StrategosFF", 
   "Well when the second amendment was written, \"modern military weapons\" were black powder rifles. Feel free to defend yourself with black powder rifles. In addition, what are the non-recreational benefits of guns. In other words, what would we lose by taking away automatic guns (since I know your manly self could never part with every weapon you own.)\n\n \n Well, you cite a fact from history without citing the entirity of the truth. Yes, while it is true that during the writing of the Bill of Rights, the most modern weapon was muzzle loaded weapons, BUT the intent behind the 2nd Amendment was...1. England at that time FORBADE the colonists from keeping weapons other than hunting rifles. 2. Because of this restriction, the colonists were intially unable to match the British in terms of fire power. 3. Because of this intial handicap, and to prevent the American public to be so handicapped again, the 2nd Amendment came about. It is likely there are some details I missed, but thats the gist of it. If you can cite some WHOLE facts that suggest otherwise, I'd like to hear it.\n \n Also, what would we lose if we took away people's right to speak profanely? Or any bit of freedom we are granted by the bill of rights? Those rights are there, the government is already trying to restrict the rights and freedoms of our citizens, why are you trying to help them do that?", 
   {}, 
   96937, 
   null, 
   1110870540.0
  ], 
  [
   98112, 
   null, 
   "Steeeeve", 
   "Lets read the second amendment first...\n \n A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed. \n \n \n Thats all I gotta say :)", 
   {}, 
   98074, 
   null, 
   1110874740.0
  ], 
  [
   98151, 
   null, 
   "Bryan", 
   "Well when the second amendment was written, \"modern military weapons\" were black powder rifles. Feel free to defend yourself with black powder rifles. In addition, what are the non-recreational benefits of guns. In other words, what would we lose by taking away automatic guns (since I know your manly self could never part with every weapon you own.)\n\n \n When the First Amendment was written, the \"press\" was comprised of newspapers, handbills, and books. Feel free to defend your right to a free press there, but the internet is hereby outside of the free press guarantee because it did not exist when the nation was founded. \n \n When the Fourth Amendment was written, computers did not exist. Therefore, since they did not exist and could not have been contemplated by our founders, you have no right to be free from unreasonable searches and seizures by the government of your computer and its files. Additionally, you can have a right to be free from an unreasonable search and seizure of your horse or ox drawn cart, but you do not have the right to be free from unreasonable searches and seizures while driving a car that did not exist when the nation was founded. \n \n When the Fifth Amendment was written, \"due process\" in a criminal case was far more limited then it is now. We must return to the older system that had fewer safeguards because that was how due process was understood when the nation was founded. The \"Miranda rule\" did not exist back then, either. Therefore, because that rule did not exist when the nation was founded, we should no longer be required to inform an arrested suspect of his right to remain silent and his right to counsel before we seek to obtain a confession from him.\n \n --------------------------------\n \n \"Foolish liberals who are trying to read the Second Amendment out of the Constitution by claiming it's not an individual right or that it's too much of a safety hazard don't see the danger of the big picture. They're courting disaster by encouraging others to use the same means to eliminate portions of the Constitution they don't like.\" Alan Dershowitz, quoted in David T. Hardy, The Conceptual Foundations of Anglo-American Jurisprudence in Religion and Reason, 62 Tenn L. Rev. 759 (1995).", 
   {
    "post_info": {
     "post_title": "Hold that thought..."
    }, 
    "unicode_changes_made": true
   }, 
   96937, 
   null, 
   1110904080.0
  ], 
  [
   98208, 
   null, 
   "georged", 
   "Well when the second amendment was written, \"modern military weapons\" were black powder rifles. Feel free to defend yourself with black powder rifles. In addition, what are the non-recreational benefits of guns. In other words, what would we lose by taking away automatic guns (since I know your manly self could never part with every weapon you own.)\n\n \n Keep in mind that if you have contemporary neighbors they might have adverse reactions when you put horses in your stable and hang game in your backyard as part of bringing back the past and creating equality. It should be all or nothing, or are you being personally selective in using automatic weapons as a rhetorical question?", 
   {}, 
   96937, 
   null, 
   1110911580.0
  ], 
  [
   101205, 
   null, 
   "Leviathan", 
   "What the hell is wrong with you people. I mean seriously. You are all arguing against gun control, but cannot even come to a common census as to why guns are even necessary. \n \n \nAre you more dangerous if you own several M-16's than if you just own 1 or two? why? You can only shoot one at a time anyway. If you want to have 19 extras sitting around, why should anybody have the right to tell you no? \n \n  Exactly, why own any at all. \n \n Oh wait, duh, I can scratch off the serial numbers and sell 18 extra guns to fifteen year olds for three times the price! \n \n The problem with most of todays \"regretably needed\" gun control is that most of it, while regrettable, is not really needed. Generally folks who say things like \"regretably needed\" favor \"common sense\" gun control laws. Unfortuntly such laws very rarely have enything to do with \"common sense\"\n \n  Right... If I owned a gun, the first thing I would undoubtedly want to do with it is put it to someone's head. \n \n [sarcasm] Altough, I suppose those M-16s are going to save your life when the army invades the United States with RPGs and M4 SOPMODS.[/sarcasm]\n \n Some common sense measures we have in place now include limits/licinsing requirements for concealed carry, registration, background checks, the recently expire \"assault weapons ban\".\n \n We spend hundreds of billion per year enforcing this garbage legislation, but nobody can actually show that we (the public) actually recieve any benifit from it.\n \n  And your proposition is what? Having extensive knowledge of guns and gun control, you know exactly where the problem is, ofcourse.\n \n Those who support background checks are XXXXXX. We have had them for years now and nobody can show any effect from them. The issue has been studied extensively now, and we now know for sure, that less than 7% of criminals bought their guns at gun stores or throught retail outlets. This means that background checks are worthless. Maybe we should have looked into this before we passed the idiotic brady bill. Background checks cost this country more than a billion dollars per year. \n \n  I guess it's all those handguns being smuggled in from Mexico and Canada, ay. I always see those illegal immigrants flashing their pistolas. \n \n Illegal gun markets operate through the legal ones. 98% of all handguns in circulation are produced by 5 major gun manufacturers. Where are the guns coming from? Yea buddy boy. Right here. [Please see 2nd bold response above].\n \n Illiminate background checks!? There's a fricken winner of an idea... How the hell does it cost more than a billion dollars a year to check someone's criminal record? It's public access for goodness sake. Show me this information. \n \n Thos we favor limits on the number of guns you can own are XXXXXX. Most criminals own ONE gun, with the average being 1.23. \n \n Those who favor limits on how many bullets your gun can hold are XXXXXX. This, too had been studied. In your average gun related crime, there are 2.34 shots fired. \n \n  Averages tend not to mean much when 14 kids are laying dead in a school. \n \n \n Those who favor restrictions on the type of weapon you may own are XXXXXX. As always, the weapons most generally used in crimes are pistols. This is the 67th straight year were there have been NO legally owned machine guns used in crimes. Criminals figured out something a long time ago that apparently the liberals have not.........you do not want a weapon that requires that you carry 500 extra rounds of ammo with you all the time. \n \n I was going to say something about that... Oh yea, RPGs baby, that's where the fun is, yo.\n \n There are a whole bunch of other \"common sense\" gun control measures that pretty much make you an idiot. \n \n The problem is that despite the fact that we have been studying this stuff for years, and we KNOW the \"common sense\" gun control measures are inneffective (and frankly, knew they were ineffective before they were ever passed, for those who cared to actually look into things). Instead of recognising that the concept is flawed, those who support \"common sense\" gun control seem to have decided that we just haven't taken strict enough measures. Since what we have done so far hasn't worked worth spit in a bucket, we obviously need to strengthen these common sense gun control measures. \n \n I already know who's common sense is defective...\n \n Maybe what we need is to identify what we see as the problem and attempt to correct it. If criminal use of firearms is the problem, there are certainly ways to address it. Unfortunaytly, none of these ways are being used currently. I would say that 90% of our gun control laws contain NO crime control element.\n \n If you percieve the problem as being accidental shootings, address that. Hadn out pamphlets with the guns expalining their safe use and storage. that is really all you can do, since guns are such incredibly simple machines that there are really only 2 basic safety rules. Don't point it at anything you don't want to die and don't leave it where your kids can get it (unless, of course, it is your kids gun). Thats it. Anything else is just fluff. \n \n  I was thinking that American society in general is just too damn stupid to own them...\n \n Lets rememebr, folks, Lethal Weapon was NOT a documentary. \n \n Oh, but shooting people is so much fun!\n", 
   {}, 
   87658, 
   null, 
   1111731300.0
  ], 
  [
   101255, 
   null, 
   "georged", 
   "What the hell is wrong with you people. I mean seriously. You are all arguing against gun control, but cannot even come to a common census as to why guns are even necessary.\n\n \n Do you have any points to make that relate to the topic, or just rants based on personal emotion?", 
   {}, 
   101205, 
   null, 
   1111765920.0
  ], 
  [
   101256, 
   null, 
   "daewoo", 
   "What the hell is wrong with you people. I mean seriously. You are all arguing against gun control, but cannot even come to a common census as to why guns are even necessary. \n \n \n Maybe because ther are plentiful reasons. It is hard to pin down just one.\n \n \nExactly, why own any at all. \n \n Oh wait, duh, I can scratch off the serial numbers and sell 18 extra guns to fifteen year olds for three times the price! \n \n \n Except that doesn't happen. We all know where criminals get theri guns. The DOJ has studied it farily extensively. Your argumetn is emotional, silly and childish.\n \n \nRight... If I owned a gun, the first thing I would undoubtedly want to do with it is put it to someone's head. \n \n \n then you might think twice before you go out and get one (assuming you are old enough). It sounds like maybe you have some mental problems anyway if the first thing you would do with a firearm is put it to somebodies head. Did you have anybody in particular in mind? Have you considered your own? Whiel still not a good action, it is prefereable to somebody elses. \n \n \nAnd your proposition is what? Having extensive knowledge of guns and gun control, you know exactly where the problem is, ofcourse.\n\n \n The problem has nothing to do with guns, and frankly you have to be semi delusional to believe otherwise. Poverty is the primary casue of crime. tehre is actually a causal relationship there. If we could eliminate all firearms, there would certainly be a reduction in firearms crime, but violent crime as a whoel would either be unaffected, or would increase. We have seen this in Asutralia, Britain, and especially S Africa, where illegal posession of a firearms can net you the death penalty.\n \n \nIllegal gun markets operate through the legal ones. 98% of all handguns in circulation are produced by 5 major gun manufacturers. Where are the guns coming from? Yea buddy boy. Right here. [Please see 2nd bold response above].\n\n \n I'm sorry, you are wrong. The most produced pistols on the planet are the glock and the HK. Neither of them is produced here.\n \n \nIlliminate background checks!? There's a fricken winner of an idea... How the hell does it cost more than a billion dollars a year to check someone's criminal record? It's public access for goodness sake. Show me this information. \n \n \n Hmmm, 3700 federal employees with juicy COLA packages, 500 million dollar computer system, over 300 full time system administrators and programmers. 8 minutes per record for every court clerk in the country to ensure the system is updated, not to mention lost time fro the retail employees and customers. The billion dollar estimate is probably low.\n \n \nAverages tend not to mean much when 14 kids are laying dead in a school.\n\n \n And irrational emotional appeals seldom hold up in the face of logic \n \n \nI was going to say something about that... Oh yea, RPGs baby, that's where the fun is, yo.\n\n \n You are aware that RPG's are legal to own, right? \n \n \nI was thinking that American society in general is just too damn stupid to own them...\n\n \n This is actually worth discussion. Studies show that anti gunners tend to be less self confident and more fearful of crime because they doubt theri ability to handle the situation themselves. IS the fact that you are too stupid to safely handle a weapon what drives you to believe that otehrs are as well? Rememeber, over 65 million gun owners managed to get through the entire year last year without shooting anybody at all.\n \n \n Do you actually have a debate here, or just more of this pathetic, childish garbage?", 
   {}, 
   101205, 
   null, 
   1111766040.0
  ], 
  [
   101310, 
   null, 
   "greg 79 f150", 
   "Well, maybe the pistol and the hunting rifle, what do you need an automatic weapon? Have the deer gotten faster?\n\n \n \n Only after I put a thirty round burst of .223's at their feet , :)\n \n \n \n \n just kiddin round,", 
   {}, 
   87656, 
   null, 
   1111773840.0
  ], 
  [
   101318, 
   null, 
   "georged", 
   "Only after I put a thirty round burst of .223's at their feet , :)\n \n\n \n That could also be very effective in a positive manner during political campaign speeches.", 
   {}, 
   101310, 
   null, 
   1111774740.0
  ], 
  [
   101326, 
   null, 
   "greg 79 f150", 
   "That could also be very effective in a positive manner during political campaign speeches.\n\n \n True , but the feds would have the EPA fining me for leading the soil, and then the politicians would impose a tax on me for using their ground, the lead was put in. :)", 
   {}, 
   101318, 
   null, 
   1111775460.0
  ], 
  [
   101396, 
   null, 
   "Leviathan", 
   "Maybe because ther are plentiful reasons. It is hard to pin down just one.\n \n It is more likely that you are all just arguing irrationally.\n \n Except that doesn't happen. We all know where criminals get theri guns. The DOJ has studied it farily extensively. Your argumetn is emotional, silly and childish.\n \n Give me a fricken break man. You would have to be daftly stupid to believe that people don't pawn off their extra, legally bought firearms.\n \n And you are right. We do know where criminals get their guns. How would you go about combating the Ring of Fire?\n \n then you might think twice before you go out and get one (assuming you are old enough). It sounds like maybe you have some mental problems anyway if the first thing you would do with a firearm is put it to somebodies head. Did you have anybody in particular in mind? Have you considered your own? Whiel still not a good action, it is prefereable to somebody elses. \n \n Yes, welcome to the American dilemma.\n \n The problem has nothing to do with guns, and frankly you have to be semi delusional to believe otherwise. Poverty is the primary casue of crime. tehre is actually a causal relationship there. If we could eliminate all firearms, there would certainly be a reduction in firearms crime, but violent crime as a whoel would either be unaffected, or would increase. We have seen this in Asutralia, Britain, and especially S Africa, where illegal posession of a firearms can net you the death penalty.\n \n 15,000 gun deaths a year in America. Why is that number 15,000 times higher in American than any other country again?\n \n Do you have proof that poverty is the leading cause of crime? No? It's okay, I believe you. So how do you intend to fight poverty? How do you intend for them to stop getting the guns?\n \n I'm sorry, you are wrong. The most produced pistols on the planet are the glock and the HK. Neither of them is produced here.\n \n They are all sold legally and circulated here. The site below is a study on California with proof that 8 out of 10 handguns used in crimes in California were, infact, produced in California. I would advise you to take heed of this.\n http://www.ucdmc.ucdavis.edu/vprp/snsweb.html \n \n Hmmm, 3700 federal employees with juicy COLA packages, 500 million dollar computer system, over 300 full time system administrators and programmers. 8 minutes per record for every court clerk in the country to ensure the system is updated, not to mention lost time fro the retail employees and customers. The billion dollar estimate is probably low.\n \n  I didn't ask you to make up some fictitious numbers. I didn't ask you to cite the resources that they HAVE to have to do their everday jobs. I asked for legitimate proof that the cost of doing background checks is over 1 billion dollars. \n \n And irrational emotional appeals seldom hold up in the face of logic \n \n \n \n You are aware that RPG's are legal to own, right? \n \n I didn't know that.\n \n This is actually worth discussion. Studies show that anti gunners tend to be less self confident and more fearful of crime because they doubt theri ability to handle the situation themselves. IS the fact that you are too stupid to safely handle a weapon what drives you to believe that otehrs are as well? Rememeber, over 65 million gun owners managed to get through the entire year last year without shooting anybody at all.\n \n Yes. I am too stupid to ever be able to own a weapon. Period.\n \n Do you actually have a debate here, or just more of this pathetic, childish garbage?\n\n \n There was nothing emotional or irrational about my presentation. I never became emotionally involved. I stated facts, I stated logical conjectures, and I questioned your beliefs. You're argument now insists on attacking me and telling me that I am wrong without proof to back yourself up. That sort of seems childish to me. Do you care to add anything usefull this time around?", 
   {}, 
   101256, 
   null, 
   1111787040.0
  ], 
  [
   101402, 
   null, 
   "daewoo", 
   "There was nothing emotional or irrational about my presentation. I never became emotionally involved. I stated facts, I stated logical conjectures, and I questioned your beliefs. You're argument now insists on attacking me and telling me that I am wrong without proof to back yourself up. That sort of seems childish to me. Do you care to add anything usefull this time around?\n\n \n Not emotional or irrational? The entire post was nothing but a pathetic temper tantrum. You offered no real data or even a rational argument. Do you even have a rational argument?", 
   {}, 
   101396, 
   null, 
   1111787700.0
  ], 
  [
   101408, 
   null, 
   "georged", 
   "I got a laugh out of the rational example of scratching serial numbers off 18 M16s and selling them for three times value to 15-year old kids when a decent civilian M16 is $15k. 15-year olds sure have a lot more disposable cash than when I was that age.", 
   {}, 
   101402, 
   null, 
   1111788480.0
  ], 
  [
   101415, 
   null, 
   "zelma", 
   "I am against gun control laws. Steeeeve said it all.", 
   {}, 
   101408, 
   null, 
   1111789260.0
  ], 
  [
   101417, 
   null, 
   "daewoo", 
   "I got a laugh out of the rational example of scratching serial numbers off 18 M16s and selling them for three times value to 15-year old kids when a decent civilian M16 is $15k. 15-year olds sure have a lot more disposable cash than when I was that age.\n\n \n I rememebr saving for a .22 at that age........$89. I still have it\n \n At $45,000.00 per pop, I actually would probably be willing to sell an M-16 to a kid. I figure if the kid is responsible enough to come up with $45,000.00 in cash, regardless of how he got it, he is probably responsible enoguh to handle an M-16.\n \n Illegal guns are chearper than legal ones. Smuggeld handguns are cheaper than what you can buy in a gun store. For the most part, the issue of straw buyers, or the rediculaous scenario laid out here, seems to be a moot point.", 
   {}, 
   101408, 
   null, 
   1111789440.0
  ], 
  [
   101823, 
   null, 
   "pickleweaseler", 
   "15,000 gun deaths a year in America. Why is that number 15,000 times higher in American than any other country again?\n\n \n So are you saying that all countries other than America only have 1 gun death per year, and America has 15,000 times that amount? Maybe you need to check your numbers.", 
   {}, 
   101417, 
   null, 
   1111901880.0
  ], 
  [
   101934, 
   null, 
   "Leviathan", 
   "Sorry, I wasn't paying attention. I meant 150 times and that is being generous.\n \n Please exclude wartime countries.", 
   {}, 
   101823, 
   null, 
   1111952520.0
  ], 
  [
   102346, 
   null, 
   "RooK", 
   "I thought Brazil and African countries were way up there...\n \n Anyway, one reason we have so many gun deaths is our population. We have way more citizens than most other countries and thus a larger number of actual deaths from any accident. You would have to go on percentages to get anything meaningful. We also have a very ethnically diverse population, which of course gives rise to tensions between people when they don't understand your culture or ways of thinking. So many factors exist, it would be hard to find one specific reason.", 
   {}, 
   101934, 
   null, 
   1112059140.0
  ], 
  [
   102686, 
   null, 
   "pickleweaseler", 
   "Sorry, I wasn't paying attention. I meant 150 times and that is being generous.\n \n Please exclude wartime countries.\n\n \n 15,000/150=100\n \n I still don't believe you. Please post your source saying that America has 15,000 firearms deaths per year and that every other country has 100 or fewer.", 
   {}, 
   101934, 
   null, 
   1112154720.0
  ], 
  [
   102860, 
   null, 
   "RooK", 
   "Lets help him then, eh?\n \n http://news.bbc.co.uk/1/hi/world/africa/644224.stm\n \n http://www.guncite.com/gun_control_gcgvintl.html\n \n As you can see, gun ownership does not correlate with high death rates. Other factors are present and must be examined.", 
   {}, 
   102686, 
   null, 
   1112218500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  I honestly don't understand how....", 
  "url": "http://www.4forums.com/political/gun-control-debates/4129-i-honestly-dont-understand-how.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 4129, 
  "discussion_files": [
   [
    "2938.html", 
    "http://www.4forums.com/political/gun-control-debates/4129-i-honestly-dont-understand-how-print.html"
   ], 
   [
    "2939.html", 
    "http://www.4forums.com/political/gun-control-debates/4129-i-honestly-dont-understand-how-2-print.html"
   ]
  ], 
  "identifier": 4129
 }
]