[
 [
  [
   87789, 
   null, 
   "pnac=ww3", 
   "Wow,\n \n I had a sort of crude idea of what to \"predict\" in the near future in Iraq.\n It's really eerie that I come across this list that pretty much parallels what I think, but with a little more detail.\n \n So, how accurate do you think this timeline is?\n \n http://hindutva.org/\n \n \n \nShape of things to come in Iraq (and the world over) \n \n \u0095 The elections are held in Iraq\n \u0095 Sunni clerics denounce elections \n \u0095 Thousands of voters are killed on election day in mega Terror attacks\n \u0095 But election results are announced\n \u0095 Sunni turnout is less than 20%\n \u0095 Sunni clerics reject results\n \u0095 Shia dominated govt is formed\n \u0095 Sunnis call for US troops to leave\n \u0095 New Shia dominated govt calls for phased pullout of US forces\n \u0095 US forces begin a phased pullout\n \u0095 They re-locate outside the cities in isolated fortified camps\n \u0095 Terrorists blow off Iraqi parliament, Presidential palace Prime Minister's residence\n \u0095 Terrorists assassinate Ministers, Parliamentarians \n \u0095 A full scale civil war starts between the Sunni dominated insurgents and the new Shia and Kurd Iraqi military\n \u0095 Iran sends in insurgents to back Shias\n \u0095 Saudis, Syrians, Egyptians, Kuwaitis, Palestinians send in insurgents to back Sunnis\n \u0095 Saudis and Kuwaitis call for US action to stop Iran from intensifying the Iraqi civil war\n \u0095 US siezes the opportunity and bombs Iranian nuke facilities\n \u0095 Iran tries to crash missiles into Israel and Europe\n \u0095 Internal rebellion breaks out in Iran\n \u0095 US special forces start operating inside Iran to topple Mullah regime\n \u0095 Iranian/Hezbollah forces stage terrorist attacks in Israel and in the West\n \u0095 US launches an air blitz of Iran followed by a land invasion and sets up a new regime\n \u0095 The Shah of Iran returns to Iran as a private citizen\n \u0095 Shia-Hezbollah led terror attacks across the West and Israel intensify\n \u0095 Israel invades Lebanon to wipe out the Hezbollah threat\n \u0095 Egypt/Syria threaten Israel with serious consequences. \n \u0095 Terrorist attacks originating from Gaza intensify in Israel\n \u0095 Israel warns Egypt with military action\n \u0095 Spectacular mega terror attack in Israel\n \u0095 Israel declares Egypt to be culpable and launches a swift land and air assault on Egypt\n \u0095 Israel annexes Sinai, crosses Suez Canal and threatens Cairo\n \u0095 Egypt appeals for Arab military action to save itself\n \u0095 Syria, Jordan and Saudis start military action against Israel\n \u0095 Israel overruns Jordan to join up with US forces stationed in Iraq\n \u0095 Israel occupies Damascus\n \u0095 US forces enter Syria from Syrian-Iraqi border in the North, join up with Israeli military\n \u0095 Upheaval in the entire Arab world\n \u0095 Western diplomats and businessmen attacked, kidnapped, beheaded\n \u0095 Anti-American riots in Pakistan, Indonesia, Malaysia. \n \u0095 Musharraf and Yudhyono regimes under tremendous pressure to give up pro-US stance\n \u0095 Musharraf assassinated by pro-Jihadi elements in Army due to his association with the US. The Jihadis last straw being his helping the Americans in finding Iran's nuke sites as a trade off for letting AQ Khan off the hook. But Mushy's gamble does not pay off, as he loses his job and life.\n \u0095 Jihadi regime in Pakistan ups hostility with India\n \u0095 Jihadis succeed in smuggling nuclear devices in the US and exploding them simultaneously\n \u0095 US army takes over US administration, suspends constitution\n \u0095 US military regime blockades the UN and declares it persona non-grata\n \u0095 US enters into emergency war council with Russia and Britain\n \u0095 The triple alliance starts nuclear bombing military targets across the Islamic world\n \u0095 Pakistani nukes taken out in first strike\n \u0095 Pakistan explodes some nuke devices on India\n \u0095 Indian retaliation wipes off Pakistan off the map - death toll in South Asia is over half a billion\n \u0095 Widespread Hindu-Muslim riots in India on the lines of the Gujarat riots of 2002. Muslim population decimated, Hindus and Christians also suffer heavy death toll.\n \u0095 Nuclear campaign launched by the triple alliance intensifies as many cities in the Islamic world are taken off the map to wipe off the air forces. \n \u0095 Seaports in the Islamic world crippled to decapitate the navies\n \u0095 Mecca, Medina, Mena, Jiddah taken off the map thru IAF (Israel Air Force) nuke strikes\n \u0095 Radiation causes second wave of deaths. The toll in secondary deaths more than three billion\n \u0095 More than half of the fatalities are Muslims. \n \u0095 Almost the entire population in the Muslim world is decimated. \n \u0095 China joins war against Islam, wipes off Muslim (Ughir) population in Eastern Turkestan \u0095 Muslims in Europe launch a wave of terror attacks in European capitals\n \u0095 Conditions in Europe very disturbed in a civil war like situation\n \u0095 Right wing coups in France, Germany, Spain, Netherlands, Denmark. The new regimes join the triple alliance\n \u0095 Widespread anti-Muslim riots in Europe aided by the militaries of those countries and NATO forces\n \u0095 Domestic military action against Muslims in Europe intensifies as European militaries do combing operations to flush out Muslims\n \u0095 The post-war Muslim population worldwide now accounts for only one percent of the global population concentrated mostly in Europe\n \u0095 Military action ends, US, Britain and Russia announce reconstruction plan for the world\n \u0095 Islam outlawed across the globe\n \u0095 Residual Muslims worldwide embrace Christianity, Hinduism, Buddhism. Judaism\n \u0095 Humanity enters post-Islamic phase. \n This write-up has been compiled based on analysis by Seymour Hersh and information at the following sites; Stratfor.org, Rand.org, Military.com\n\n There are a couple of things I have a problem with.\n They make it sound as if we could go in and just mop up in Iran.\n It would not be so easy.\n Also, Israel would not just overrun Jordan. \n I think lately (past 10 years) they have been trying to kiss and make up.\n They also wouldn't just nuke Mecca and Medina out of spite, would they?\n They aren't military/govt targets.\n \n They get a little crazy with everybody attacking Islam directly as opposed to attacking the ruling regimes.\n I doubt China would care that much, even in a global nuclear war.\n Islam will never be globally outlawed. Get real. (Well, after nuclear war, anything's possible).\n \n So how far overboard do you think this is?\n I think that there is definitely the possibility of global conflict over the horizon.\n I think most countries would be very afraid of using nukes (MAD) but it only takes one country or one terrorist group to get the ball rolling.", 
   {
    "post_info": {
     "post_title": "The final countdown."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1106355300.0
  ], 
  [
   87859, 
   null, 
   "Alan Ryan", 
   "Wow,\n \n I had a sort of crude idea of what to \"predict\" in the near future in Iraq.\n It's really eerie that I come across this list that pretty much parallels what I think, but with a little more detail.\n \n So, how accurate do you think this timeline is?\n \n http://hindutva.org/\n \n \n \n There are a couple of things I have a problem with.\n They make it sound as if we could go in and just mop up in Iran.\n It would not be so easy.\n Also, Israel would not just overrun Jordan. \n I think lately (past 10 years) they have been trying to kiss and make up.\n They also wouldn't just nuke Mecca and Medina out of spite, would they?\n They aren't military/govt targets.\n \n They get a little crazy with everybody attacking Islam directly as opposed to attacking the ruling regimes.\n I doubt China would care that much, even in a global nuclear war.\n Islam will never be globally outlawed. Get real. (Well, after nuclear war, anything's possible).\n \n So how far overboard do you think this is?\n I think that there is definitely the possibility of global conflict over the horizon.\n I think most countries would be very afraid of using nukes (MAD) but it only takes one country or one terrorist group to get the ball rolling.\n\n \n There are lots of very improbable links in this chain of events: but some of the predictions look like they could have been abstracted from the Project for the New American Century ?", 
   {}, 
   87789, 
   null, 
   1106419920.0
  ], 
  [
   87865, 
   null, 
   "AMD4EVER", 
   "I think amost everything after and including \"US siezes the opportunity and bombs Iranian nuke facilities\" is a little unrealistic. Why would the US just go in and bomb Irani nuke sites and risk turning one out of control situation into many? Also when it jumps into the US leading a ground assault in Iran, that is almost insane. Almost all of our forces are occupied at the moment and if there were a civil war in Iraq we would be there for sure. Maybe an air campaign in Iran at most but not a ground. And please, Israel just jumping in and attacking Lebanon. With the US busy elsewhere and everyone just looking for a reason to destroy Israel they certainly would not just smoothly get away with taking another country and following that up with taking part of Egypt and the whole of Jordan and even then bombing key cities in the Muslim world.\n \n This is just a worst of the worst of the worst case scenarios for the Muslim world. What is more likely is that we westernize Iraq and Afghanistan and over the coming decades Indias western influence expands into Pakistan, Irans government falls and is replaced by a more democratic system, oil becomes less valuable of a resource making many middle eastern countries think more about western economics, and eventually peace is formed between the Palestinians and the Israelis ending hundreds of years of the Muslims and Christian nations not being able to come to any sort of agreement.", 
   {}, 
   87859, 
   null, 
   1106423040.0
  ], 
  [
   87872, 
   null, 
   "georged", 
   "More and more statements from the US administration indicate that our gunslinger Israel will begin broader ME assertiveness in their (administration) quest for peace dividends. And our current administration has proven they have no qualms about attacking other sovereign nations for unfounded reasons. Wolfowitz is beginning to again surface in public matters, and that's interesting. \n \n I was under the impression that the Shah of Iran had died in the US some years ago.", 
   {}, 
   87865, 
   null, 
   1106426040.0
  ], 
  [
   87900, 
   null, 
   "AMD4EVER", 
   "More and more statements from the US administration indicate that our gunslinger Israel will begin broader ME assertiveness in their (administration) quest for peace dividends. And our current administration has proven they have no qualms about attacking other sovereign nations for unfounded reasons. Wolfowitz is beginning to again surface in public matters, and that's interesting. \n \n I was under the impression that the Shah of Iran had died in the US some years ago.\n\n \n Israel has enough of their own issues to deal with. Perhaps they will bomb an Irani nuclear plant but they are not going to invade countries. Doing that does not resolve any of their own issues but it does create more. So what is the benefit to them to attack Egypt and Lebanon when as it stands right now they have already gotten the better of both of them?", 
   {}, 
   87872, 
   null, 
   1106458680.0
  ], 
  [
   87920, 
   null, 
   "georged", 
   "Israel has enough of their own issues to deal with. Perhaps they will bomb an Irani nuclear plant but they are not going to invade countries. Doing that does not resolve any of their own issues but it does create more. So what is the benefit to them to attack Egypt and Lebanon when as it stands right now they have already gotten the better of both of them?\n\n \n Israel has such deep-seated economic problems they exist as a going concern only due to financial and military aid from the US. They're our ME gunslinger. Israel does not currently have the population or ground army to invade/occupy any country other than stellar powers like neighbors Palestine and Egypt. They do have our strike technology and capability, and will do our bidding. The ME isn't solely a war of ideology, economics always have and always will determine military goals and achievement. We have substantial internal economic problems and we're rushing to financially bleed ourselves out for purely ideological ME goals? Unless so-called allies the Sauds and Pakistan, as repressive as government gets, were our primary objectives, that's not what rational reasoning would term sound leadership. This administration has some loose screws in their effort to maintain GDP numbers.", 
   {}, 
   87900, 
   null, 
   1106501760.0
  ], 
  [
   87996, 
   null, 
   "pnac=ww3", 
   "I think amost everything after and including \"US siezes the opportunity and bombs Iranian nuke facilities\" is a little unrealistic. Why would the US just go in and bomb Irani nuke sites and risk turning one out of control situation into many?\n\n If the IRaq civil war turns out to happen and be Shia vs. Sunni mainly, with some oblique Kurdish involvement, Shia from all around would come in to help. They would mostly come from Iran. If the war were \"hot\" enough and Iran could be implicated in the escalation, I don't see why the US wouldn't sieze the oppurtunity for regime change. True our troops are stretched, but that didn't stop them from invading Iraq.\n \n \nAlso when it jumps into the US leading a ground assault in Iran, that is almost insane. Almost all of our forces are occupied at the moment and if there were a civil war in Iraq we would be there for sure. Maybe an air campaign in Iran at most but not a ground.\n\n I agree, we could never get away with any ground war in Iran.\n It would all have to be from the air, and while we'd probably quickly gain air superiority, we'd have an actual working air force to deal with. \n \n \nAnd please, Israel just jumping in and attacking Lebanon. With the US busy elsewhere and everyone just looking for a reason to destroy Israel they certainly would not just smoothly get away with taking another country and following that up with taking part of Egypt and the whole of Jordan and even then bombing key cities in the Muslim world.\n\n Yeah, I thought that was overboard too.\n \n \n \nThis is just a worst of the worst of the worst case scenarios for the Muslim world. What is more likely is that we westernize Iraq and Afghanistan and over the coming decades Indias western influence expands into Pakistan\n\n Where it will butt heads very violently with the Taliban-like fundamentalists in the North West Frontier Province. They pretty much run Peshawar and that whole area. Al-qeada has quite a strong presence there.\n \n \nIrans government falls and is replaced by a more democratic system,\n\n This will happen most effectively from the inside, and from what I hear, it's what the majority of Iranians want. That does not mean they aim to be tools of the US. \n \n \noil becomes less valuable of a resource\n\n Probably not in this century.\n \n \nmaking many middle eastern countries think more about western economics, and eventually peace is formed between the Palestinians and the Israelis ending hundreds of years of the Muslims and Christian nations not being able to come to any sort of agreement.\n\n Israel, a christian nation?\n Peace may be coming soon or it may not.\n We've had so many false alarms over the decades.", 
   {}, 
   87865, 
   null, 
   1106530800.0
  ], 
  [
   88099, 
   null, 
   "georged", 
   "\n Israel, a christian nation?\n \n\n \n That'll be of interest to my Jewish wife. Does this mean Christian bibles will enjoy brisk sales in Israel?", 
   {}, 
   87996, 
   null, 
   1106604420.0
  ], 
  [
   90573, 
   null, 
   "Choscura", 
   " Anti-American riots in Pakistan, Indonesia, Malaysia.\n everything looks at least moderately well thought out up till here. but in indonesia right now, the main power comes froma 5000-strong heavily armed geurilla group that essintialy replaces the government, and the citizens there are NOT happy with this. they are incredibly UNHAPPY, and as soon as they realize 'hey, we can do everything they're doing!' theres probably going to be at least a coup de etat, possibly a civil war. but i don't think the US will touch this one: its mostly out of our sphere of influence. more likely, the french foreign legion (they're badasses. mock them at your own risk) will step in, save frances assets, maybe some of germanies and the other countries there as a sort of ransom/'you owe us' move.\n \n \nJihadis succeed in smuggling nuclear devices in the US and exploding them simultaneously\n possible, but highly unlikely. they hate us and want us dead, and nukes are a very expensive way to accomplish that: more likely they will try some forgotton disease like smallpox, the plague, or anthrax, and will do so in such a way that it will inspire a lack of satisfaction with the government, allowing them to get a toehold over here because of lowered morale from the resistance that remains. if, however, they insisted on using nuclear weapons, it is quite probable they would hit a heavily populated and very rich area: los angeles or san francisco come to mind, as does washington DC (a hard target, but they might try nonetheless), new york (also a hard target now that they've already attacked it). and as for military targets, if they don't already have them (they aren't incredibly difficult to find: everything from marine bootcamps to SEAL training grounds to the CIA killhouses), i'm not going to list them here.\n \n \nResidual Muslims worldwide embrace Christianity, Hinduism, Buddhism. Judaism\n i find it difficult to see that happening. people don't typically give up on things they've devoted large portions of their life too, even if everyone else thinks its wrong (look at history: we have rubber because goodyear ignored everybody that said he couldn't do it, and hundreds of other inventions and innovations from inventors like him besides). this is part of human nature: the will to go on that is quite possibly the reason we as a species still exist today (our ancestors will to go on in the cold/etc).\n \n anyway, other than that, i can see that happening: if not right away, then over the course of the next five to ten years.\n \n perfect timing :)", 
   {}, 
   88099, 
   null, 
   1107997740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The final countdown.", 
  "url": "http://www.4forums.com/political/peace-middle-east/4143-final-countdown.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 4143, 
  "discussion_files": [
   [
    "9545.html", 
    "http://www.4forums.com/political/peace-middle-east/4143-final-countdown-print.html"
   ]
  ], 
  "identifier": 4143
 }
]