[
 [
  [
   88293, 
   null, 
   "jyoshu", 
   "Bush is currently pushing for immigration reform which is badly needed. There are so many jobs in this country that U.S. citizens won't do, so why should companies be prevented from having the labor they need for services and products that we Americans buy? Seems sensible to me.", 
   {
    "post_info": {
     "post_title": "Immigration"
    }
   }, 
   null, 
   null, 
   1106766300.0
  ], 
  [
   88294, 
   null, 
   "lord tammerlain", 
   "The jobs that you speak of would be done by Americans if the price was right. All the companies have to do is raise the wages for those jobs to be more attractive then either welfare or working at Macdonalds.", 
   {}, 
   88293, 
   null, 
   1106766540.0
  ], 
  [
   88299, 
   null, 
   "jyoshu", 
   "The jobs that you speak of would be done by Americans if the price was right. All the companies have to do is raise the wages for those jobs to be more attractive then either welfare or working at Macdonalds.\n\n \n So you'd be in line to apply for the local job to clean out septic tanks if you were making as much doing it as you do at your current job? How about working all day long in the scorching heat nailing shingles on roofs?\n \n I don't think it's the wages that keep most Americans from doing these jobs.", 
   {}, 
   88294, 
   null, 
   1106767440.0
  ], 
  [
   88303, 
   null, 
   "lord tammerlain", 
   "So you'd be in line to apply for the local job to clean out septic tanks if you were making as much doing it as you do at your current job? How about working all day long in the scorching heat nailing shingles on roofs?\n \n I don't think it's the wages that keep most Americans from doing these jobs.\n\n \n \n Of course it is, would I clean septic tanks at my current salary, no but then my job is relatively cushy. Double or triple it and I would jump at the opportunity. \n \n If the job pays enough, people will do it. If the job is distasteful because of the working conditions, watch what would happen if the salary was doubled, see how many people would leave working at Wendy's to start nailing shingles on roofs or cleaning septic tanks. Wendy's at minimum wage, or the meat packing plant for double or triple the pay at Wendy's, which would you choose?\n \n Immigrants are hired to do the distasteful jobs because they will do them at lower wages then would native born Americans or Canadians.", 
   {}, 
   88299, 
   null, 
   1106768160.0
  ], 
  [
   88317, 
   null, 
   "daewoo", 
   "AND LT hits the nail right on the head again.\n \n Not long ago I was reading a trade publication form the Johnson County (ks) homebuilders association. There was an article in there about the use if illegal aliens as framers. The justification is that \"nobody is willing ot do it\".\n \n When I was in college, every summer I returned to beautiful Johnson County, Ks to frame houses. We worked 12-15 hours per day, 7 days a week. I made $18 per hour. I made enough during the summer that I could loaf a little during school (just work part time) and still have enough money to pay my bills and keep me drunk whenever I wasn't either in class or at work.\n \n The illegals are working for $7 per hour, no overtime pay (still working the long weeks, but just getting straight time). \n \n YES, Iw as more than willing to do it for $18 per hour, which is not only a fair wage, but was actually a little on the low side. NO, I would not have been willing to do it for $7 per hour.\n \n There are a lot of unemployed framing carpenters in Ks City these days who are not willing to work for $7 per hour. This does not mean they are not wiloling to do the job, it just means theya re not willing ot do the job for the money offered.\n \n Oddly enough, despite the fact that labor costs have been cut by 2/3 for the guys using illegals, my dad (who owns a construction company in the area) manages to price his homes the same using $18/hr labor.\n \n It was a sad day for America when companies figured out that they could use illegals for labor, not lower prices to reflect the savings, still complain about high labor costs (since the public generally does not realise that they are using illegals) and keep the extra money as profit.", 
   {}, 
   88303, 
   null, 
   1106771160.0
  ], 
  [
   88324, 
   null, 
   "jyoshu", 
   "AND LT hits the nail right on the head again.\n \n Not long ago I was reading a trade publication form the Johnson County (ks) homebuilders association. There was an article in there about the use if illegal aliens as framers. The justification is that \"nobody is willing ot do it\".\n \n When I was in college, every summer I returned to beautiful Johnson County, Ks to frame houses. We worked 12-15 hours per day, 7 days a week. I made $18 per hour. I made enough during the summer that I could loaf a little during school (just work part time) and still have enough money to pay my bills and keep me drunk whenever I wasn't either in class or at work.\n \n The illegals are working for $7 per hour, no overtime pay (still working the long weeks, but just getting straight time). \n \n YES, Iw as more than willing to do it for $18 per hour, which is not only a fair wage, but was actually a little on the low side. NO, I would not have been willing to do it for $7 per hour.\n \n There are a lot of unemployed framing carpenters in Ks City these days who are not willing to work for $7 per hour. This does not mean they are not wiloling to do the job, it just means theya re not willing ot do the job for the money offered.\n \n Oddly enough, despite the fact that labor costs have been cut by 2/3 for the guys using illegals, my dad (who owns a construction company in the area) manages to price his homes the same using $18/hr labor.\n \n It was a sad day for America when companies figured out that they could use illegals for labor, not lower prices to reflect the savings, still complain about high labor costs (since the public generally does not realise that they are using illegals) and keep the extra money as profit.\n\n \n The problem is a LOT more complicated than that.\n \n I think it is really a combination of both things and probably other factors as well. Times have probably changed quite a bit since you were in college framing. It used to be that there were a lot less kids going off to college than in recent times. I remember there was a push in the 80s and 90s in high schools to get kids to go to college--a push that was not there previously. I think there indeed are less people today wanting the sort of jobs that immigrants are more than willing to take. The focus among American workers and professionals has shifted a lot in the lst decade or two; more and more people are preferring to go in a white-collar direction than ever before. You yourself was framing while going to college--obviously you didn't have in mind to do framing for any longer than you had to. It's probably true as well that the wages for them have gone down or ay least not risen with the times. However, companies cannot be faulted for wanting to hire at less wages if there are people out there willing to go to work for that pay--most all employers will do this--the name of the game in business is to make money.", 
   {}, 
   88317, 
   null, 
   1106772360.0
  ], 
  [
   88326, 
   null, 
   "Waxy", 
   "However, companies cannot be faulted for wanting to hire at less wages if there are people out there willing to go to work for that pay--most all employers will do this--the name of the game in business is to make money.\n\n \n emoticon_frazzled \n \n There's just that pesky little thing called THE LAW in the way.\n \n Illegals are called illegals for a reason. \n \n IMHO, they should go after the businesses that hire the illegals far more forcefully, they are the root of the problem.\n \n Waxy", 
   {}, 
   88324, 
   null, 
   1106772900.0
  ], 
  [
   88327, 
   null, 
   "daewoo", 
   "emoticon_frazzled \n \n There's just that pesky little thing called THE LAW in the way.\n \n Illegals are called illegals for a reason. \n \n IMHO, they should go after the businesses that hire the illegals far more forcefully, they are the root of the problem.\n \n Waxy\n\n \n Exactly.\n \n What is being missed here (and not by you, Waxy), is that our entire economic system is based on the law of supply and demand and competition. It is called \"capitolism\". In theory, supply and demand drives prices, and competition drives companies to find innovative ways to lower prices.\n \n Supply and demand is not just supposed to work on the price side, it is supposed to work on the labor side, too. If you short circuit that,. what you have is supply and screw your labor pool.\n \n As far as the rest (college), A, plenty of folks in America still don't go to college. More than enough to meet our fairly minimal labor requirement. B, you would be surprised how many people with college degrees end up int the trades. I have a machinist right now with a masters degree. He worked at a machine shop through college, and couldn't find a postion willing to pay him the $80,000.00 per year he makes as a machinist. My little borther has a college degree and is working at a ford dealership as a grease monkey. He makes about $70,000.00 per year.", 
   {}, 
   88326, 
   null, 
   1106773620.0
  ], 
  [
   88328, 
   null, 
   "jyoshu", 
   "emoticon_frazzled \n \n There's just that pesky little thing called THE LAW in the way.\n \n Illegals are called illegals for a reason. \n \n IMHO, they should go after the businesses that hire the illegals far more forcefully, they are the root of the problem.\n \n Waxy\n\n \n A lot of these workers though, are working in the US on a work visa. It happens all the time, and is completely legal.", 
   {}, 
   88326, 
   null, 
   1106773920.0
  ], 
  [
   88336, 
   null, 
   "jskufan", 
   "Bush is currently pushing for immigration reform which is badly needed. There are so many jobs in this country that U.S. citizens won't do, so why should companies be prevented from having the labor they need for services and products that we Americans buy? Seems sensible to me.\n\n \n Why stop there with the jobs that Americans supposedly won't do? Let's open up the White House, Congress, and House of representatives to these hard working immigrants. They'll work for a lot less, and since they typically aren't extended credit, they're used to living and spending within their means. Maybe they could teach the Republicans the definition of Conservative.", 
   {}, 
   88293, 
   null, 
   1106776560.0
  ], 
  [
   88337, 
   null, 
   "daewoo", 
   "A lot of these workers though, are working in the US on a work visa. It happens all the time, and is completely legal.\n\n \n Unfortuntly, folks with green cards don't work the nasty, low paying jobs that nobody here will do. They want good jobs that pay a decent wage, too, especially if they actually have to pay taxes on it.\n \n Bushs plan is a pretty good example of him pipming himself to big business. The \"jobs nobody else wants\" rational is utter BS. What he is really talking about is \"jobs that corporate america does not want to have to pay a decent wage on\".\n \n While one could certainly argue that the average wage in America is too high, that is primairily the result of corporate markups going through the roof in the last 20 years. \n \n Skilled labor (machinists, production workers, etc...) probably could take a pay cut, if the manufacturers would actually cut prices to a decent level (in which case everything evens out anyway). The jobs that bush is thinking these illegals are going to fill are mostly ag sector. These are jobs that are undercompansated.\n \n You are talking jobs that remain unfilled because a person makes more money on welfare than in working a minimum wage job in this country, especially if they have kids (since on welfare they don't need daycare, and working they do.\n \n This is just another sign of a troubled economy. Adding a bunch of cheap labor to the pool would certainly help keep the house of cards up a little longer, as well as allowing americna producers to keep moving as they have been (mostly sucking as much money out of the system as they can before it collapses). Yes, it would be great for businesses in the short run, but terribly destructive in the long run.", 
   {}, 
   88328, 
   null, 
   1106778000.0
  ], 
  [
   88338, 
   null, 
   "Big Orn", 
   "jyoshu, are you from Texas? I see where you're coming from - on both ends.\n \n Younger folks (19 to 35) don't and won't work for under $14 dollars/hr. If they need the job real bad they'll come out and make a showing, then gripe and complain until you get the idea they didn't want the job in the first place or miss days claiming illness or their car broke down or they couldn't catch a ride, etc, etc.\n \n The \"immigrants\" will be there rain, sleet, snow, heat, cold. They'll all pile up in a 2ton truck or ride a bike or walk - but they'll be there.\n \n Being loyal has its benefits.\n \n Businesses want that.\n \n jskufan,\n I'll second that. :p", 
   {}, 
   88336, 
   null, 
   1106778240.0
  ], 
  [
   88339, 
   null, 
   "daewoo", 
   "Younger folks (19 to 35) don't and won't work for under $14 dollars/hr. If they need the job real bad they'll come out and make a showing, then gripe and complain until you get the idea they didn't want the job in the first place or miss days claiming illness or their car broke down or they couldn't catch a ride, etc, etc.\n\n \n I can see this, too, depending on where you live. I know that around my hometown (Kansas City area) this was certainly the case. My adopted home town (Emporia, Ks) is entirely different. There are a lot of farm kids around here who are used to working hard for free and actually have a pretty good work ethic. They are not squeamish about what they are willing to do, and after working all those years on the family farm for free, it doesn't take a whole lot of money to make them feel like they are really raking it in. During deer season I hired the kid down the road to clean my deer. It cost me $20, but he cleaned it and butchered it (which I didn't expect) for that price, so I was more than happy. He also cleans out the stables (probably makes $4 per hour doing it, but hey, he set the price, not me) and he is there every evening, even when there is a blizzard or ice storm.\n \n It sounds like what you are saying is that the problem is work ethic?\n \n Also, I agree with jskufan (not about being a KU fan, though). Lets let the illegals and the emmigrants run the government. They can't do a worse job that our current bunch has. Arnold hell. I say we make carlos down at the meat packing plant president. He works for $9 per hour and sends $6 of that back to the family in mexico. He knows the value of a dollar and how to live within a budget.", 
   {}, 
   88338, 
   null, 
   1106778960.0
  ], 
  [
   88367, 
   null, 
   "georged", 
   "Why stop there with the jobs that Americans supposedly won't do? Let's open up the White House, Congress, and House of representatives to these hard working immigrants. They'll work for a lot less, and since they typically aren't extended credit, they're used to living and spending within their means. Maybe they could teach the Republicans the definition of Conservative.\n\n \n I'm all for that. Neither my father or father-in-law could understand why working people bought anything but an appreciating house on credit. When I'd mention people wanted better cars they really couldn't afford, which they both well knew, both would laugh even harder. Those so-called Republicans currently holding public office are using credit as irresponsibly as most Americans do on personal basis.", 
   {}, 
   88336, 
   null, 
   1106786880.0
  ], 
  [
   88368, 
   null, 
   "jyoshu", 
   "Unfortuntly, folks with green cards don't work the nasty, low paying jobs that nobody here will do. \n\n \n Sure they do . . . I know some that do.\n \n \nYou are talking jobs that remain unfilled because a person makes more money on welfare than in working a minimum wage job in this country, especially if they have kids (since on welfare they don\\'t need daycare, and working they do.\n\n \n They also remain unfilled because the dynamics of the jobforce have changed in other ways as well.\n \n \nThis is just another sign of a troubled economy.\n\n \n Since the same problem existed in the 90s when the economy was booming, I don\\'t think so. In fact, because there were more white collar jobs available at that time, in some ways the situation in the 90s probably made this issue even worse.", 
   {}, 
   88337, 
   null, 
   1106787060.0
  ], 
  [
   88369, 
   null, 
   "jyoshu", 
   "It sounds like what you are saying is that the problem is work ethic?\n\n \n I think he hit the nail right on the head, myself.", 
   {}, 
   88339, 
   null, 
   1106787120.0
  ], 
  [
   88371, 
   null, 
   "georged", 
   "\n Immigrants are hired to do the distasteful jobs because they will do them at lower wages then would native born Americans or Canadians.\n\n \n I don't know about Canada, but where I currently live and at my former residence in another state the major problem was and is getting those native born Caucasian Americans to show up for work on a regular basis and put in a full day of work. \n \n In Las Vegas almost all residential and commercial construction and maintenance trades are staffed by Hispanics, some legal, some not. Wage disparity isn't the issue. The contractors I knew there had reached a point where their field people just didn't hire 'white' workers if the trade could be filled by a Hispanic. \n \n Here in Oregon we're having a new home built by a local contractor. He said his biggest business problem is getting sub crew members to show up for work. There are few minorities here, almost no blacks and very few Hispanics other than during harvest times. These are adult Caucasian Americans, most with families, no legal or otherwise immigrants to compete with and construction is the highest paying job since the mills ran out of old growth timber and easy profits. Problems with alcohol and drugs, especially meth, are common, to the point where I'm told that many of the workers hold jobs just to re-qualify for unemployment benefits and the usual bag of federal goodies for husband, wife/girlfriend and children. A lack of work ethic is very present in some US industries.", 
   {}, 
   88303, 
   null, 
   1106788560.0
  ], 
  [
   88375, 
   null, 
   "Tigerlilly", 
   " The jobs that you speak of would be done by Americans if the price was right. All the companies have to do is raise the wages for those jobs to be more attractive then either welfare or working at Macdonalds.\n\n \n Why shoud companies pay people more? Go the Libertarian way: hands off government. Let the economy run itself despite the costs. If they raise wages, fewer people will get hired. Higher wages tend to cause people to get fired or not hired.\n \n If left alone, businesses want to maximize their profits, so they will pay you as little as possible to get to that end. If the government gets invovled, that's another story, but that's bad, evil socialism.", 
   {}, 
   88368, 
   null, 
   1106790300.0
  ], 
  [
   88380, 
   null, 
   "jskufan", 
   "\n \n If left alone, businesses want to maximize their profits, so they will pay you as little as possible to get to that end. If the government gets invovled, that's another story, but that's bad, evil socialism.\n\n \n While companies would strive to maximize profits, they would also compete with each other for competent labor. This would create upward pressure on wages. The problem is, the playing field isn't a level one. Once you step outside the US, there's always some third world country violating human rights and willing to make the same product for a fraction of the cost. As for utilizing inexpensive immigrant labor domestically, just be aware of how the taxpayer picks up the slack for all the benefits the employer doesn't have to pay.", 
   {}, 
   88375, 
   null, 
   1106792160.0
  ], 
  [
   88394, 
   null, 
   "pnac=ww3", 
   "Yous guys are all talking about illegal aliens as if they aren't here illegally.\n As if they had a legitimate claim to a job in the US at all.\n There are reasons we have immigration laws.\n \n If people are getting visas and going through the proper channels, then good for them, they should be able to get any job they can, for any pay they are willing to work for. If they beat out an American, o well.\n \n The problem here is that people aren't doing things legally.\n \n I'm not a big fan of rules for rules sake, but there are reasons for these rules.\n \n \n O yeah, and what he said: companies are shipping manufacturing jobs overseas in a flood. Those are jobs Americans ARE willing to do (for 3 times as much).", 
   {}, 
   88380, 
   null, 
   1106796180.0
  ], 
  [
   88406, 
   null, 
   "georged", 
   "O yeah, and what he said: companies are shipping manufacturing jobs overseas in a flood. Those are jobs Americans ARE willing to do (for 3 times as much).\n\n \n Supply and demand. From what I can determine, there's enough of a government funded cushion to allow 'part-time' need some cash workers to maintain households. That's a false labor market. Any influx of competent, lower priced labor will simply compound the problem as their original ethics are discarded as they learn the system. The only question seems to be how much money we have to support another, growing layer of public dependency before an inevitable economic downturn that could create some big homeless crowds.", 
   {}, 
   88394, 
   null, 
   1106799600.0
  ], 
  [
   88425, 
   null, 
   "lord tammerlain", 
   "I don't know about Canada, but where I currently live and at my former residence in another state the major problem was and is getting those native born Caucasian Americans to show up for work on a regular basis and put in a full day of work. \n \n In Las Vegas almost all residential and commercial construction and maintenance trades are staffed by Hispanics, some legal, some not. Wage disparity isn't the issue. The contractors I knew there had reached a point where their field people just didn't hire 'white' workers if the trade could be filled by a Hispanic. \n \n Here in Oregon we're having a new home built by a local contractor. He said his biggest business problem is getting sub crew members to show up for work. There are few minorities here, almost no blacks and very few Hispanics other than during harvest times. These are adult Caucasian Americans, most with families, no legal or otherwise immigrants to compete with and construction is the highest paying job since the mills ran out of old growth timber and easy profits. Problems with alcohol and drugs, especially meth, are common, to the point where I'm told that many of the workers hold jobs just to re-qualify for unemployment benefits and the usual bag of federal goodies for husband, wife/girlfriend and children. A lack of work ethic is very present in some US industries.\n\n \n Meth is not yet a very popular drug where I am, other drugs yes but not the really cheap very addicitve ones like crack or meth. Housing construction in Calgary is still dominated by Caucasians, ( lots of 1st, 2 nd generation Italians) with East Indians coming on strong. The work is hard and the pay is better then working retail so the people are motivated to show up for work. With shorter construction season, (winter) they still get some time off.\n \n Cleaners, meat packing plants and other similar type jobs are done by recent immigrants though. East Africans, Somalis, and Ethopians, especially work in the meat packing industry. High River a town of about 5 000 has a Cargill plant, 15 years ago there would have been maybe 10 Africans in the entire town, now about 1/3 of it is East African. They will work these jobs because of a lack of job skills for other industries and of course they are actively recruited.", 
   {}, 
   88371, 
   null, 
   1106821380.0
  ], 
  [
   88472, 
   null, 
   "georged", 
   " They will work these jobs because of a lack of job skills for other industries and of course they are actively recruited.\n\n \n No different than employer supplied buses waiting at US/Mexico border crossing points. I don't know about Africans in Canada, but many Mexicans who do seasonal and permanent work in the US remain permanent Mexican citizens without the desire to obtain US citizenship. As I believe Daewoo pointed out, within their working lifetime they're able to accumulate enough personal wealth to live in comfortable retirement in rural Mexico. Many Americans condemn that practice, while admiring Americans who retire to Costa Rica and other relatively inexpensive S. American countries.", 
   {}, 
   88425, 
   null, 
   1106849640.0
  ], 
  [
   88474, 
   null, 
   "lord tammerlain", 
   "Most of the East Africans that I know, are here to stay. The violence and regular environmental famines drove most away for good.", 
   {}, 
   88472, 
   null, 
   1106849940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Immigration", 
  "url": "http://www.4forums.com/political/politics-debates/4172-immigration.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 4172, 
  "discussion_files": [
   [
    "22892.html", 
    "http://www.4forums.com/political/politics-debates/4172-immigration-print.html"
   ], 
   [
    "22893.html", 
    "http://www.4forums.com/political/politics-debates/4172-immigration-2-print.html"
   ]
  ], 
  "identifier": 4172
 }
]