[
 [
  [
   88386, 
   null, 
   "Devils Advocate", 
   "My boss (also known as Satan), is curious as to why god doesnt just kill him?", 
   {
    "post_info": {
     "post_title": "My boss has been wonderin"
    }
   }, 
   null, 
   null, 
   1106794140.0
  ], 
  [
   88395, 
   null, 
   "pnac=ww3", 
   "Then where would god score his crack?", 
   {}, 
   88386, 
   null, 
   1106796420.0
  ], 
  [
   88399, 
   null, 
   "Devils Advocate", 
   "Say again? Us demons are still adapting to Modern English.", 
   {}, 
   88395, 
   null, 
   1106797800.0
  ], 
  [
   88412, 
   null, 
   "pnac=ww3", 
   "I forgot, God's loaded. He can afford to buy the powder and freebase it.", 
   {}, 
   88399, 
   null, 
   1106801340.0
  ], 
  [
   88427, 
   null, 
   "GreenMtnBoy", 
   "Because god is waiting for him to realize the error of his ways and repent. emoticon_rolleyes", 
   {}, 
   88412, 
   null, 
   1106822280.0
  ], 
  [
   88453, 
   null, 
   "Big Orn", 
   "My boss (also known as Satan), is curious as to why god doesnt just kill him?\n\n No, he's not curious at all. He knows the Bible inside and out and knows what's planned.\n \n He just wants to foil those plans.\n \n Tell him Big Orn said.... \n \n No, you don't have to tell him anything from me. He knows me well enough to know what I'd tell him.", 
   {
    "unicode_changes_made": true
   }, 
   88427, 
   null, 
   1106845020.0
  ], 
  [
   88458, 
   null, 
   "unkerpaulie", 
   "Because god is waiting for him to realize the error of his ways and repent. emoticon_rolleyes\nnah, theres no repentance for satan. he already blasphemed and all that. i think satan's existence is gonna be persistent simply because as long as humans exist, and pain, tragedy, suffering, etc exists, people need to identify it with an evil source, and reassure themselves that a greater good source also exists\n \n if there were no pain, suffering, tragedy, evil in general, do you guys really think people would need to believe that God exists? would there be any religions?", 
   {}, 
   88427, 
   null, 
   1106846340.0
  ], 
  [
   88461, 
   null, 
   "Alan Ryan", 
   "Because god is waiting for him to realize the error of his ways and repent. emoticon_rolleyes\n\n \n At which point perhaps God will readmit him to heaven - where he formerly resided under the name of Lucifer. Only after his \"fall from grace\" did he assume his present identity as Satan, Prince of Evil.", 
   {}, 
   88427, 
   null, 
   1106846940.0
  ], 
  [
   88462, 
   null, 
   "Waxy", 
   "My boss (also known as Satan), is curious as to why god doesnt just kill him?\n\n \n Simple, because God NEEDS satan for his gig to work. \n \n Just like the Harlem Globeltrotters need the Washington Generals. :p \n \n Waxy", 
   {}, 
   88386, 
   null, 
   1106846940.0
  ], 
  [
   88466, 
   null, 
   "Big Orn", 
   "Simple, because God NEEDS satan for his gig to work. \n\n The Wisdom of Waxy...\n \n It never ceases to amaze me how much know about God's original plan, my friend.\n \n < And you say you don't know..... < Scary....", 
   {}, 
   88462, 
   null, 
   1106847900.0
  ], 
  [
   88539, 
   null, 
   "Devils Advocate", 
   "nah, theres no repentance for satan. he already blasphemed and all that. i think satan's existence is gonna be persistent simply because as long as humans exist, and pain, tragedy, suffering, etc exists, people need to identify it with an evil source, and reassure themselves that a greater good source also exists\n \n if there were no pain, suffering, tragedy, evil in general, do you guys really think people would need to believe that God exists? would there be any religions?\n \n Theres not even repetance (after death) for innocent buddists, why would Satan get any?", 
   {}, 
   88466, 
   null, 
   1106868600.0
  ], 
  [
   92648, 
   null, 
   "zachvac", 
   "nah, theres no repentance for satan. he already blasphemed and all that. i think satan's existence is gonna be persistent simply because as long as humans exist, and pain, tragedy, suffering, etc exists, people need to identify it with an evil source, and reassure themselves that a greater good source also exists\n \n if there were no pain, suffering, tragedy, evil in general, do you guys really think people would need to believe that God exists? would there be any religions?\n \n Theres not even repetance (after death) for innocent buddists, why would Satan get any?\n\n \n They're personal friends. Without Satan no one would believe in God. After repentance they'll probably sit down and have a couple beers together. emoticon_xhoho", 
   {}, 
   88539, 
   null, 
   1108968960.0
  ], 
  [
   92865, 
   null, 
   "SheriG", 
   "Of course Satan is needed in God's plan. What would you prefer? That God created us as robots with no knowlege to choose righteousness. That we all start out in heaven, content and ignorant to why we are? emoticon_rolleyes Cant you see that in order to have someone love you, they choose too. Or it wouldn't really be love, just blind obedience.", 
   {}, 
   92648, 
   null, 
   1109035980.0
  ], 
  [
   92878, 
   null, 
   "Socialist", 
   "Because God doesn't exist and Christian Mythology is stupid. God will kill you for having sex outside of marriage, but he won't kill Satan for trying to take over Heaven and depose God.\n \n He makes no sense.", 
   {}, 
   92865, 
   null, 
   1109040360.0
  ], 
  [
   92889, 
   null, 
   "zachvac", 
   "Because God doesn't exist and Christian Mythology is stupid. God will kill you for having sex outside of marriage, but he won't kill Satan for trying to take over Heaven and depose God.\n \n He makes no sense.\n\n \n If God really killed people for having sex outside of marriage our population would be a lot lower.", 
   {}, 
   92878, 
   null, 
   1109041200.0
  ], 
  [
   93000, 
   null, 
   "SheriG", 
   "what do define as kill? A physical death? that is nothing to fear. A spiritual death is what you need to think about. So in fact, Satan is and always will be dead. God doesn't kill anyone spiritually, because we have choice. A person holding a gun to their head chooses to pull the trigger. Does that mean that the company the made the gun is responsible for his death? Of course not. Satan is dead spiritually and yes the punishment for sin is death spiritually. We all are guilty of sin, so does this mean we all die spiritually? If we choose to. \n Hey if I were in a building with a bomb in it, I would get out of there fast. The people that don't really beleive it will go off and end up getting blown up can't say they have'nt been warned.", 
   {}, 
   92889, 
   null, 
   1109089260.0
  ], 
  [
   93173, 
   null, 
   "zachvac", 
   "what do define as kill? A physical death? that is nothing to fear. A spiritual death is what you need to think about. So in fact, Satan is and always will be dead. God doesn't kill anyone spiritually, because we have choice. A person holding a gun to their head chooses to pull the trigger. Does that mean that the company the made the gun is responsible for his death? Of course not. Satan is dead spiritually and yes the punishment for sin is death spiritually. We all are guilty of sin, so does this mean we all die spiritually? If we choose to. \n Hey if I were in a building with a bomb in it, I would get out of there fast. The people that don't really beleive it will go off and end up getting blown up can't say they have'nt been warned.\n\n \n So when we die and go to the spiritual world we don't need to worry about Satan because his spirit is dead. But I say without Satan no one would believe all this Christianity stuff. It is really not believable and the only reason many people believe it is because of the threat of hell. They could think \"If I don't believe it can't be worse than if I do believe, and if there's a god, Christianity will be better.\" Well guess what, I prefer not to give into threats and bribes and will face what happens when it comes.", 
   {}, 
   93000, 
   null, 
   1109121120.0
  ], 
  [
   93307, 
   null, 
   "unkerpaulie", 
   "God was invented to help man fathom the (then) inexplicable 'beauty' and 'order' in the world (which, of course, is subjective). the devil was invented to help man fathom the equally inexplicable 'pain' and 'horror' that exists in the world. these two concepts were promoted and developed into maturity at a time when most of the world's population was gullible and illiterate, and when the mode of education was by story-telling, where the story-teller would undoubtedly add exaggerations and legendary aspects to captivate his audience and ensure that the story itself would be preserved. there were no objective journalism then (as if there is any today :p), and since noone could read, knowledge and news was conveyed by word of mouth.\n \n today, religion relies on these characters (God and Satan) to create a living guide for its members. however, as science develops, we realize that the \"inexplicable\" (order/chaos) is actually logically explicable, and has nothing to do with order or chaos.\n \n there is no use for a God or Satan. they served their purpose for the period of mystery and void, but are no longer need", 
   {}, 
   93173, 
   null, 
   1109179260.0
  ], 
  [
   93312, 
   null, 
   "thebootfitter", 
   "God was invented to help man fathom the (then) inexplicable 'beauty' and 'order' in the world (which, of course, is subjective). the devil was invented to help man fathom the equally inexplicable 'pain' and 'horror' that exists in the world. these two concepts were promoted and developed into maturity at a time when most of the world's population was gullible and illiterate, and when the mode of education was by story-telling, where the story-teller would undoubtedly add exaggerations and legendary aspects to captivate his audience and ensure that the story itself would be preserved. there were no objective journalism then (as if there is any today :p), and since noone could read, knowledge and news was conveyed by word of mouth.\n \n today, religion relies on these characters (God and Satan) to create a living guide for its members. however, as science develops, we realize that the \"inexplicable\" (order/chaos) is actually logically explicable, and has nothing to do with order or chaos.\n \n there is no use for a God or Satan. they served their purpose for the period of mystery and void, but are no longer need\n\n Within Christianity, it is often said that God created humanity in God's image. It is conceivable, as you imply here, that humanity created God in humanity's image.", 
   {}, 
   93307, 
   null, 
   1109179980.0
  ], 
  [
   93380, 
   null, 
   "unkerpaulie", 
   "Within Christianity, it is often said that God created humanity in God's image. It is conceivable, as you imply here, that humanity created God in humanity's image.\n\n if evolution is true, then:\n 1. there was no creation of man in any image\n 2. there was no target image that evolving man was tending towards\n \n assuming that God exists, and assuming that he has a recognisable image, then his image would look the way it does since the beginning of time. in other words, living organisms evolving from primordal forms would be destined to look like we do at some point. science disagrees, since evolution has no target form. not only that, but man in God's image would mean no further evolution, unless either we are not in God's image yet, or God's image evolves at our rate, neither of which is consistent with the definition of God.\n \n there is nothing that says that at some point humans were bound to come into existence, or look the way we do. along the random path of evolution, intelligent being on this planet could have ended up looking very very different than what we look like now. is there an optimally evolved creature? can we imagine it? would it look like us?\n \n if evolution proceeds with no supernatural \"guidance\", and God just \"sits back and watch things unfold\", what are the odds of any species on the planet looking like modern humans?", 
   {}, 
   93312, 
   null, 
   1109193780.0
  ], 
  [
   93408, 
   null, 
   "thebootfitter", 
   " if evolution is true, then:\n 1. there was no creation of man in any image\n 2. there was no target image that evolving man was tending towards\n\n False dichotomy. Consider the word image is not necessarily limited to physical attributes. \n \n \nis there an optimally evolved creature? can we imagine it? would it look like us?\n\n What do you mean by \"optimally evolved creature\"? Optimally evolved for what? The optimally evolved creatures are the ones that continue to exist.\n \n \nif evolution proceeds with no supernatural \"guidance\", and God just \"sits back and watch things unfold\", what are the odds of any species on the planet looking like modern humans? \n\n 100%. Because modern humans exist.", 
   {}, 
   93380, 
   null, 
   1109198700.0
  ], 
  [
   93413, 
   null, 
   "unkerpaulie", 
   "False dichotomy. Consider the word image is not necessarily limited to physical attributes. \n\n for whatever meaning youd like to assign to \"image\", are you saying that evolution has been inevitably heading towards our current condition for hundreds of millions of years?\n \n \nWhat do you mean by \"optimally evolved creature\"? Optimally evolved for what? The optimally evolved creatures are the ones that continue to exist.\n\n yes, and if the environment of the planet were very different (e.g., completely covered in water) and one species evolved to a condition where they were conscious of themselves to the extent that we are now, would we still assume that we were in God's image? or what if evolution had caused the only self-conscious beings on the planets to be bird-like (because of an environment of pervasive cliffs and gorges), would we assume that we were created in God's image? we are the way we are primarily because our environment meshed with our physical features. a very different environment could have produced very different \"dominant\" beings on this planet\n \n \n100%. Because modern humans exist.\n\n if we had wound back time to the emergence of the first form of life, and allowed the hundreds of millions of years to elapse, but with completely random events at different times during this period, are you saying that the present would look exactly the way it looks today? are you saying that regardless of the sequence of natural environmental changes on the planet, modern humans would emerge exactly like we have in our present? what if another planet a couple solar systems away went through the same length of time starting with the same life forms and initial environmental conditions, but perhaps a different sequence of environmental changes between then and now, are you saying that we would also find beings like humans on that planet too?", 
   {}, 
   93408, 
   null, 
   1109199960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  My boss has been wonderin", 
  "url": "http://www.4forums.com/political/religion-debates/4173-my-boss-has-been-wonderin.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 4173, 
  "discussion_files": [
   [
    "32127.html", 
    "http://www.4forums.com/political/religion-debates/4173-my-boss-has-been-wonderin-print.html"
   ], 
   [
    "32128.html", 
    "http://www.4forums.com/political/religion-debates/4173-my-boss-has-been-wonderin-2-print.html"
   ]
  ], 
  "identifier": 4173
 }
]