[
 [
  [
   88761, 
   null, 
   "georged", 
   "http://story.news.yahoo.com/news?tmpl=story&cid=2027&e=10&u=/chitribts/20050129/ts_chicagotrib/nationinnearlockdownaselectionworkhastens\n \n Imagine this in your home city/country at election time. There's something seriously wrong with our foreign policy.", 
   {
    "post_info": {
     "post_title": "Democracy in Action?"
    }
   }, 
   null, 
   null, 
   1107023640.0
  ], 
  [
   88775, 
   null, 
   "lord tammerlain", 
   "But the Iraqis are voting for democracy, the first time in 40 odd years, that 180 billion dollars, 100 000 Iraqi lives, 25 000 US sick and wounded, the severe lowering of US world opinion are nothing when compared to voting with a gun to your head.\n \n The fact that the gun is there trying to make you vote and trying to stop youre voting is the most interesting part.", 
   {}, 
   88761, 
   null, 
   1107029340.0
  ], 
  [
   88777, 
   null, 
   "daewoo", 
   "http://story.news.yahoo.com/news?tmpl=story&cid=2027&e=10&u=/chitribts/20050129/ts_chicagotrib/nationinnearlockdownaselectionworkhastens\n \n Imagine this in your home city/country at election time. There's something seriously wrong with our foreign policy.\n\n \n Not at all. We could have had elections shortly after rolling into Iraq, at leas allowed the Iraqis to elect a constitutional convention, which would have made them feel like maybe theyr were actually in control of their country. BUT, if we had done that, we would not have had time to appoint our own government and give our guys control of the media, so they are the only ones that have any real chance of election. Sure this inflames the people who live in the country, but otherwise they may have leceted somebody that we didn't like, and what kind of democracy would that have been?\n \n Think back to vietnam. We set up free elections for those folks, and they just wanted to elect a communist. We had to fight and eventually loose a very long, very expensive war in order to ensure the guy that the people chose did not lead that country.\n \n If we had simply allowed the Iraqis to elect their own constitutional convention (as opposed to appointing one of our choosing) and allowed them to elect their first government, as opposed to appoinitng one then assuring that the deck is stacked unfarily in their favor, where is the democracy in that?\n \n Just like the word \"conservative\" has a new definition, the words \"freedom\" and \"democracy\" have been redefined as well. The old definitions were much too complicated. They included concepts like self government and fairly elected officials.\n \n The new definition for a free and democratic nation is apparently \"does waht america tells you\". Much simpler that way.", 
   {}, 
   88761, 
   null, 
   1107030180.0
  ], 
  [
   88782, 
   null, 
   "georged", 
   "\n Just like the word \"conservative\" has a new definition, the words \"freedom\" and \"democracy\" have been redefined as well. The old definitions were much too complicated. They included concepts like self government and fairly elected officials.\n \n The new definition for a free and democratic nation is apparently \"does waht america tells you\". Much simpler that way.\n\n \n I see it as another export we're going to have real problems peddling. Just because most of the US has been dumbed up, that doesn't mean we can sell our concept of democracy or the Golden Gate Bridge to other countries regardless of their current leadership.", 
   {}, 
   88777, 
   null, 
   1107033120.0
  ], 
  [
   88783, 
   null, 
   "georged", 
   "But the Iraqis are voting for democracy, the first time in 40 odd years, that 180 billion dollars, 100 000 Iraqi lives, 25 000 US sick and wounded, the severe lowering of US world opinion are nothing when compared to voting with a gun to your head.\n \n The fact that the gun is there trying to make you vote and trying to stop youre voting is the most interesting part.\n\n \n Agreed on all points. Too bad Americans wallowing in their Christian righteousness are unable to place themselves in the other party's shoes.", 
   {}, 
   88775, 
   null, 
   1107033240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Democracy in Action?", 
  "url": "http://www.4forums.com/political/current-events-debates/4191-democracy-action.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 4191, 
  "discussion_files": [
   [
    "11668.html", 
    "http://www.4forums.com/political/current-events-debates/4191-democracy-action-print.html"
   ]
  ], 
  "identifier": 4191
 }
]