[
 [
  [
   88776, 
   null, 
   "lord tammerlain", 
   "http://slate.com/Default.aspx?id=2112697&\n \n Overall the article illistrates my opinion of what is in store for the US in the coming years. \n \n \nThe likely emergence of China and India ... as new major global players-similar to the advent of a united Germany in the 19th century and a powerful United States in the early 20th century-will transform the geopolitical landscape with impacts potentially as dramatic as those in the previous two centuries. \n \n In this new world, a mere 15 years away, the United States will remain \"an important shaper of the international order\"-probably the single most powerful country-but its \"relative power position\" will have \"eroded.\" The new \"arriviste powers\"-not only China and India, but also Brazil, Indonesia, and perhaps others-will accelerate this erosion by pursuing \"strategies designed to exclude or isolate the United States\" in order to \"force or cajole\" us into playing by their rules.\n \n America's current foreign policy is encouraging this trend, the NIC concluded. \"U.S. preoccupation with the war on terrorism is largely irrelevant to the security concerns of most Asians,\" the report states. The authors don't dismiss the importance of the terror war-far from it. But they do write that a \"key question\" for the future of America's power and influence is whether U.S. policy-makers \"can offer Asian states an appealing vision of regional security and order that will rival and perhaps exceed that offered by China.\" If not, \"U.S. disengagement from what matters to U.S. Asian allies would increase the likelihood that they will climb on Beijing's bandwagon and allow China to create its own regional security that excludes the United States.\"\n \n\n \n It furthers my believe that the US actions in the mid east are going to be the last gasp of a dieing empire. What is really going to matter is how the US handles its declining influence.", 
   {
    "post_info": {
     "post_title": "United States is a Declining Power"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1107029940.0
  ], 
  [
   88781, 
   null, 
   "Dzeron", 
   "The U.S. is declining because it is becoming more and more fascist. We're taxing the people to dole out corporate welfare, start crazy wars against sweeping categories of enemies, and police our lives.", 
   {}, 
   88776, 
   null, 
   1107032400.0
  ], 
  [
   88792, 
   null, 
   "daewoo", 
   "I disagree with this article, as well as with the CIA report he cited. There is no way the events described will transpire in the next 15 years. The next 5 is far more likely.\n \n From the CIA report (I don't have a link, but I have a copy in PDF if anybody wants it I think you can get it from their web page), it seems to make the assumption that other nations will continue to fund our debt at relatively low interest rates even as out economy declines. This is entirely unrealistic. Even now, we are raising interest rates in order to make our bond offerings more attractive (as LT pointed out before, they currently pay better than those of Canada), and new offerings are still not exactly flying out the door. It also does not allow for the additional difficulty in moving our bonds as we fall out as the world largest consumer economy. They have measured Chinas potential growth and the influence it is likely to have using Japans emergence as an industrial power as a yardstick. I think the analogy is flawed. China has a bargaining chip that Japan never had, which is the opening of their massive consumer market to US and other countries. This has allowed them to collect and consolidate technology at an incredible rate. \n \n The initiative toward automated factories in Japan took nearly 20 years. Chinas took less than five, and US corporations footed the bill for the vast majority of it, with little hope for ROI past 2010. China has effectively used their consumer market to induce US and European companies to fully fund and construct modern factories and incur all costs associated with product development. In exchange, profits are generally to be split evenly between the foreign company and the Chinese partner for 10 years, at which point all material production facilities end up in the hands of the Chinese company, and the foreign company is basically unceremoniously booted out of the country.\n \n Japan never had the sway to pull off such sweetheart deals.\n \n While they do touch on the war on terror in regards to its political effects, they make no motion of its financial impact. In on eplace, they cite the yearly price of the war in the ME as a paltry $125 billion. \n \n In addition, I think they are far too optimistic about the social impact that comes with this. I have a copy of a FEMA sponsored report that was a direct response to this CIA report that paints a far different picture from a sociological standpoint. In regard to the decline of the middle class into poverty, the CIA report calls it \"painful\". The FEMA report paints a much less pleasant picture (yes, less pleasant than \"painful\"). According to their sociologists, the American middle class is not conditioned to live in poverty, and will not make the transition gracefully. They predict a 1000% increase in crime and a \"high likelihood\" of some kind of large scale armed action. \n \n Further, the CIA report fails to mention the impact of a large scale terrorist attack, which seems like a pretty significant oversight, given the fact that we now know that Bin Laden has been given religious authorization to use nuclear weapons, and there are an awful lot of folks out there that are reporting that he likely has access to them. \n \n With estimated costs of a nuclear attack, even a small scale one, against a major US city running upward of $20 trillion (keep in mind that the world trade center attacks are estimated to have cost us more than $1 trillion), that would be a blow that the US economy would be unlikely to be able to recover from.", 
   {}, 
   88781, 
   null, 
   1107035880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  United States is a Declining Power", 
  "url": "http://www.4forums.com/political/politics-debates/4192-united-states-declining-power.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 4192, 
  "discussion_files": [
   [
    "23387.html", 
    "http://www.4forums.com/political/politics-debates/4192-united-states-declining-power-print.html"
   ]
  ], 
  "identifier": 4192
 }
]